{
  "source": "https://www.techradar.com/news/watchos-8-update",
  "title": "watchOS 8 release date, features and everything you need to know",
  "category": "wearables",
  "updated": "2021-09-20T17:22:40Z",
  "author": "david-lumb",
  "summary": "watchOS 8 is now available",
  "article": [
    "watchOS 8 is now available for the Apple Watch, but the Apple Watch Series 7, while confirmed at the September 14 event, there wasn't a release date for it.",
    "The new software update brings a new Mindfulness app, sleep app updates to track Respiratory Rate, Fitness Plus updates, and more. They don't look like huge changes, but check watchOS 8 features below for all the new perks coming to your Apple Watch.",
    "And there's good news for older Apple Watch owners: the watchOS 8 support devices list hasn't changed from last year's watchOS 7, meaning Apple Watch 3 and newer devices will be able to download the operating system.",
    "Apple announced an event for September 14, which revealed updates to its iPad, iPhone and Apple Watch line, alongside the release date for watchOS 8. If you missed the event, you can catch up with what was announced.",
    "The watchOS 8 update landed on September 20, not long after the September 14 event, where the Apple Watch Series 7, the iPad (2021), iPad mini (2021) and the iPhone 13 line were all confirmed.",
    "If you're wondering how to update your Watch to the latest update, we've created a handy guide for you.",
    "While the Apple Watch Series 7 is yet to have a release date, you can update to watchOS 8 on your existing watch so you can take advantage of the latest features.",
    "The watchOS 8 update is compatible with all models from the Apple Watch 3 onwards. This doesn't shift from the watchOS 7 compatibility list, so if you've gotten last year's big update, you'll be able to run this year's new software, too.",
    "You'll need an iPhone that's running iOS 15, so if you want to upgrade to watchOS 8, you'll need to pair it with at least an iPhone 6S on this version of iOS.",
    "The watchOS 8 update offers a number of smaller features, all augmenting how you normally use your Apple Watches. While we didn't see any monumental upgrades this time around, there are some quality of life improvements for existing apps and new functionality.",
    "The Wallet app is adding more ways to wirelessly interact with places and things. Some of this is limited to the Apple Watch 6 and its Ultra Wideband tech, like the ability to unlock your car (first unveiled at WWDC 2020 and coming to select vehicles) and start it from the driver's seat, per Apple's press release.",
    "But most Apple Watches should be able to benefit from adding more digital keys to Wallet for their home, office, and hotel, and use their wearables to unlock them.",
    "Perhaps most surprising: individuals in participating US states will be able to add their driver's license or state ID to Wallet, and some TSA checkpoints will start accepting these digital IDs – just add them in the iOS Wallet app and you can display them on your Apple Watch.",
    "The Breathe app has been incorporated into the new Mindfulness app along with a new activity, Reflect, to walk users through a different kind of mindful session reflecting on past events.",
    "Sleep tracking now monitors a new metric – respiratory rate – which measures breaths per minute. And all data fed into the Health app is also folded into new Trends, tracking how your health metrics shift over longer periods of time.",
    "The watchOS Workout app is getting two new workout activities – Tai Chi and Pilates, both of which are more relaxed and mindful exercises to accompany the yoga workout. These have custom-built heart rate and motion algorithms, per Apple's press release.",
    "There's also new functionality in the Apple Fitness Plus watchOS app, like Picture in Picture support and more filtering options. You can also transfer workouts seamlessly between devices, pausing exercise on one and starting it again on another.",
    "Fitness Plus is also adding more workouts by expert Jeanette Jenkins, as well as a new musical Artist Spotlight Series with workouts tuned to entire playlists by artists like Lady Gaga, Jennifer Lopez, Keith Urban, and Alicia Keys.",
    "The Photos app has been redesigned with new ways to navigate collections, while Memories and Featured Photos sync to the Apple Watch from the iOS app. A new Portraits watch face lets you turn your Portrait-mode photos into watch faces and twist the crown to alter depth.",
    "The Apple Watch will also display the time or complications behind the person in the Portrait, so you won't get numbers covering up their features.",
    "Messages also gets more granular controls, like twisting the crown to move the cursor and even the capability to search and reply with GIFs. There's also a new Contacts app brought over to watchOS to browse, edit, and share contacts from your Apple Watch.",
    "New features in other products also add Apple Watch features, like Intercom, an upgrade for the Home app that lets you see who's at the door via live video feed and even greet them.",
    "The new Focus feature in iOS also comes to watchOS 8: whichever Focus users set on their iPhone will carry over to their Apple Watch, allowing them to set their notification settings to prioritize work, fitness, sleep, or simply do not disturb."
  ],
  "headers": {
    "4": "watchOS 8 release date",
    "7": "watchOS 8 supported devices",
    "9": "watchOS 8 features",
    "10": "Wallet: digital IDs, now on your Apple Watch",
    "13": "New Mindfulness app and sleep tracking",
    "15": "Workout app and Apple Fitness Plus",
    "18": "Photos and Portrait watch faces",
    "20": "Messages and GIF responses"
  },
  "links": {
    "Apple Watch Series 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "watchOS 7": "https://www.techradar.com/news/watchos-74-news",
    "an event for September 14": "https://www.techradar.com/news/iphone-13-launch-date-confirmed-for-september-14-heres-all-we-know",
    "what was announced": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "landed on September 20": "https://www.techradar.com/how-to/how-to-get-watchos-8",
    "September 14 event": "https://www.techradar.com/news/iphone-13-launch-date-confirmed-for-september-14-heres-all-we-know",
    "iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "iPad mini (2021)": "https://www.techradar.com/reviews/ipad-mini-2021",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "created a handy guide for you": "https://www.techradar.com/how-to/how-to-get-watchos-8",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "press release": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5370360840494157000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F06%2Fwatchos-8-brings-new-access-connectivity-and-mindfulness-features-to-apple-watch%2F"
  }
}