{
  "source": "https://www.techradar.com/news/one-of-the-best-looking-games-shown-at-gamescom-2021-was-a-complete-surprise",
  "title": "One of the best-looking games shown at Gamescom 2021 was a complete surprise",
  "category": "gaming",
  "updated": "2021-08-25T19:42:09Z",
  "author": "nick-pino",
  "summary": "DokeV, a monster collecting game from South Korea, blew us away",
  "article": [
    "Gamescom 2021 kicked off on Wednesday with a few bombshell announcements like Marvel’s Midnight Suns, the Saints Row reboot, the release date for Halo Infinite and the unveiling of a custom Halo-themed Xbox Series X, but one announcement really took us by surprise.",
    "The trailer was for a game called DokeV that, according to the show’s host Geoff Keighley, was an open-world MMO monster-collecting game from a South Korean developer Pearl Abyss (creators of Black Desert) that looks like it blends fast-paced battles and psychedelic visuals.",
    "The results speak for themselves.",
    "What’s most striking about the trailer outside of its bubble-pop soundtrack and its slightly unsettling child-filled dream world is just how darn good its game world looks. The contrast in its lighting is unlike anything we’ve seen before and its particle physics rivals anything we’ve seen from a Unreal Engine trailer.",
    "While it’s pretty difficult to understand all of what’s happening in the trailer, the general gist of it appears to be that you’ll use your monsters - called Dokebi - to battle other monsters in an attempt to capture them and grow your team. It doesn’t appear that you command your monsters a la Pokemon commands, but rather you jump into the fray yourself with an oversized hammer and… a missile launcher?",
    "It's kind of hard to follow, but it's straight eye-candy to watch in action.",
    "It’s a bold claim for a showcase that included trailers for a new Marvel game, a new Halo game and a new entry in the Saints Row franchise, but of them all, DokeV felt like it had the most going for it. The others, while certainly epic in their own way, felt like things we’d seen before. DokeV is its own weird thing that’s part Monster Hunter and part Space Channel 5.",
    "That being said, creating a great trailer and creating a great game are two different things.",
    "At some point in our lives, we’ve all seen a trailer for something that promised the world only for the final product to under deliver. In just the last few years games like Dead Island, The Order 1886 and No Man’s Sky all had these eye-catching trailers that promised something entirely different from the actual game.",
    "We’re not saying that’s going to be the case for DokeV when it comes out on consoles and PC - but, like anything else that seems too good to be true, it warrants a bit of skepticism until we see a bit more of it."
  ],
  "headers": {
    "6": "Analysis: Trailers sometimes over-promise and then under-deliver"
  },
  "links": {
    "Gamescom 2021": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show",
    "Marvel’s Midnight Suns": "https://www.techradar.com/news/marvels-midnight-suns-brings-xcom-tactics-to-a-comic-book-rpg",
    "Saints Row reboot": "https://www.techradar.com/news/saints-row-reboot-what-can-we-expect-to-see-from-volitions-next-game",
    "release date for Halo Infinite": "https://www.techradar.com/news/halo-infinite-finally-has-a-release-date-and-its-sooner-than-youd-think",
    "custom Halo-themed Xbox Series X": "https://www.techradar.com/news/halo-infinite-xbox-series-x-console-is-a-space-themed-monolith-how-to-get-it"
  }
}