{
  "source": "https://www.techradar.com/news/apple-watch-7-could-be-the-biggest-apple-watch-yet",
  "title": "Apple Watch 7 could be the biggest Apple Watch yet",
  "category": "wearables",
  "updated": "2021-08-25T09:00:14Z",
  "author": "james-rogerson",
  "summary": "A bigger body and likely a larger screen",
  "article": [
    "We’re expecting quite a few design changes for the Apple Watch 7, and that might include a larger case than any previous model.",
    "This claim comes from leaker UnclePan posting on Weibo (a Chinese social network). They claim that the Apple Watch 7 will be available in 41mm and 45mm sizes, up from 40mm and 44mm on the Apple Watch 6. They additionally say that old straps will work with the new models.",
    "While we’d take all of this with a side of salt, UnclePan has accurately revealed Apple details before, so they may well be right, though they don’t leak things as often as some sources.",
    "We have heard at least one conflicting report though, with a previous leak suggesting that the Apple Watch 7 would come in a 44mm size, so we’re really not sure who to believe right now.",
    "Even if the Apple Watch 7 does have a bigger case that also doesn’t necessarily mean the screen will be any bigger – the case could simply be enlarged for aesthetic reasons, or to fit changed internal components, such as a larger battery. But it is likely to lead to a larger screen.",
    "As well as a possibly larger case (and therefore probably screen), we’ve also heard from numerous sources that the Apple Watch 7 will have flat sides, in place of the curved ones of its predecessor.",
    "Some leaks have additionally pointed to a slightly thinner build and smaller bezels, all of which could add up to a decidedly different look for the wearable.",
    "While we’d still love to see an Apple Watch with a circular screen one day, we’re not holding our breath for that, and the Apple Watch 7 could be the biggest visual overhaul the wearable has had in a while. So for anyone getting a bit bored of the current design, this could be worth keeping an eye on.",
    "Via BGR"
  ],
  "headers": {
    "3": "Some disagreement",
    "5": "Analysis: it’s all change on the Apple Watch 7"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "UnclePan": "https://weibo.com/5367283758/KuNKke9zr?type=comment#_rnd1629878841578",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "would come in a 44mm size": "https://www.techradar.com/news/apple-watch-7-renders-show-that-it-might-be-inspired-by-the-iphone-12",
    "will have flat sides": "https://www.techradar.com/news/see-this-apple-watch-7-leak-with-a-wild-looking-flat-edged-design",
    "BGR": "https://bgr.com/tech/apple-watch-series-7-might-be-the-companys-biggest-wearable-to-date/"
  }
}