{
  "source": "https://www.techradar.com/news/three-key-features-that-make-collaboration-tools-more-accessible-for-the-visually-impaired",
  "title": "Three key features that make collaboration tools more accessible for the visually impaired",
  "category": "computing",
  "updated": "2021-03-29T14:04:12Z",
  "author": "ian-tien",
  "summary": "Accessibility elements should be designed from the ground up with input from users who require these features the most",
  "article": [
    "Collaboration tools are meant to encourage and inspire people to work together. When we can easily and effectively connect and share ideas, we are more productive, more creative and happier. But for those who are visually impaired, poorly designed tools will inevitably fall short. That’s why elements such as predictable navigation and other easy-to-use accessibility features are not just nice-to-haves, but altogether necessary.",
    "Ideal keyboard and screen reader accessibility elements should be designed from the ground up with input from users who require these features the most. Element-based navigation that delivers a smooth, predictable, and frustration-free user experience eliminates the need for a mouse, and instead relies innovative tabbing and region navigation, as well as robust screen reader compatibility.",
    "The American Foundation for the Blind estimates that in 2018, there were as many as 32.2 million American adults who reported experiencing vision loss. That vision loss is defined as “individuals who reported that they have trouble seeing, even when wearing glasses or contact lenses, as well as to individuals who reported that they are blind or unable to see at all.”",
    "What’s surprising is that in 2021, there are still websites that are not optimally designed for use by these millions of people, making them effectively inaccessible. Inaccessibility is not acceptable – whether we’re talking about websites, enterprise applications, email and other office suites, or collaboration tools.",
    "Accessibility in collaboration tools is typically enabled via manual navigation shortcuts. But if these shortcuts aren’t efficient simple, efficient, or easy to use, they might as well not exist. There should be as few inputs needed by the user to perform a given action, and the order in navigational action should be carefully designed to match how people typically use the app.",
    "Here are three important capabilities that increase accessibility for the visually impaired:",
    "Predictability is key for visually impaired users, so navigation between the software’s key focus regions works best when it is looped in a continuous order which never changes. For example:",
    "With simple, manual controls, such as pressing F6 (or CTRL+F6 on browser) continuously, users can move between regions quickly and effectively without losing track of where they are in the software. Or, by pressing TAB and SHIFT+TAB, users can move back and forth between elements. The use of highlighting on-screen by a colored outline, by simply pressing Enter or Space, puts elements in focus.",
    "Simple navigate through messages can be done using just the arrow keys. For example, by hitting F6 (or CTRL+F6 on browser), a user can enter the message list region, then use UP or DOWN arrow keys to navigate between messages. By pressing TAB, a user can easily navigate through message actions, including replying and reacting.",
    "Ideally, the collaboration tool you choose will be compatible with most popular screen readers, such as AppleVoiceOver and JAWS for Windows.",
    "Channel switching can be cumbersome for visually impaired users. But that can be remedied with a switcher that is fully keyboard accessible and enables users to jump between channels quickly. A tool that uses smarter matching algorithms can help surface the most relevant channels first.",
    "Another navigation feature that can help is a channel sidebar region that lets users easily move between entire sidebar categories (such as Favorites, Channels, Direct Messages, and custom categories) using the arrow keys.",
    "Be sure to check that the collaboration tool you choose meets various compliances and certifications, including compliance with accessibility standards:",
    "508 Compliance: For U.S. public sector organizations seeking to confirm 508 compliance, look for a Voluntary Product Accessibility Template (VPAT).",
    "WCAG 2.0L: Check third-party ratings to measure how the tool meets Web Contact Accessibility Guidelines 2.0 (WCAG.",
    "ADA: Compliance with the Americans with Disabilities Act (ADA) is critical; look for features that provide accessibility support detailed in the VPAT and WCAG 2.0.",
    "Remediation: Any technical issue in a current or future product release that would prevent compliance with accessibility ratings stated in product documentation should be considered a product defect. Vendors should welcome the public filing of an issue report against the defect so that it may be resolved.",
    "The most effective collaboration tools are always iterating and evolving to be as streamlined and user-friendly as possible, and accessibility features are no exception to the rule."
  ],
  "headers": {
    "2": "Visually impaired accessibility",
    "4": "Efficient and intuitive shortcuts",
    "6": "Predictable region navigation",
    "8": "Intuitive message navigation",
    "10": "Channel navigation",
    "12": "Accessibility compliance matters",
    "17": "Encourage feedback to continuously improve"
  },
  "links": {
    "Collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "keyboard": "https://www.techradar.com/best/best-business-keyboards",
    "email": "https://www.techradar.com/news/best-email-provider"
  }
}