{
  "source": "https://www.techradar.com/news/heres-your-first-look-at-obi-wan-kenobis-disney-plus-show",
  "title": "Here's your first look at Obi-Wan Kenobi's Disney Plus show",
  "category": "entertainment",
  "updated": "2021-12-02T14:35:50Z",
  "author": "tom-power",
  "summary": "Hello there",
  "article": [
    "Disney has revealed a first look at its upcoming Obi-Wan Kenobi Disney Plus TV series – but there's no official footage of the show just yet.",
    "Released on the Disney Plus app as part of the streaming service's second anniversary celebrations, the Obi-Wan behind-the-scenes featurette only provides us with a glimpse at the series through a few pieces of concept art. The artwork is spliced between video excerpts from the Star Wars prequel movies, too, so there's no new footage for fans to pour over, unfortunately.",
    "There's also no way to view the one-minute long video on social media yet. But, you can check out some of the concept art in the tweet below:",
    "A six-part series set between Star Wars Episodes III and IV, Obi-Wan will follow the legendary Jedi as he watches over Luke Skywalker on Tatooine. The show will also mark a reunion between Obi-Wan and his former apprentice Anakin Skywalker (Luke's father), who is now a fully fledged Sith Lord – aka the iconic Darth Vader – by the time that the series' story kicks off.",
    "Speaking as part of the mini featurette, Obi-Wan star Ewan McGregor said: \"There's a hunger for this character to come back. The fans have been waiting long enough, you know? But the most beautiful thing of all is that it's brought me back together with Hayden [Christensen, who plays Vader]. To see them have another swing at each other might be quite satisfying!\"",
    "Director Deborah Chow, who has helmed episodes on another Star Wars Disney Plus show in The Mandalorian, added: \"This is quite a dark time that we're coming into with him. Just being a Jedi, it's not safe [and] there are Jedi hunters out there.\"",
    "Also starring the likes of Kumail Nanjiani (Eternals), Indira Virma (Game of Thrones), and Joel Edgerton (Bright), Obi-Wan Kenobi's TV show will launch exclusively on Disney Plus sometime in 2022."
  ],
  "headers": {},
  "links": {
    "Obi-Wan Kenobi Disney Plus TV series": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "Disney Plus app": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-3983950667584811500&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fvideo%2Fbdb127ae-08b5-4b5a-8dd6-f2fede81006b",
    "streaming service's second anniversary celebrations": "https://www.techradar.com/news/disney-plus-day-how-to-watch-date-start-time-shang-chi-what-to-expect-and-more",
    "Star Wars Episodes III and IV": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}