{
  "source": "https://www.techradar.com/news/motorola-teams-up-with-bullitt-for-toughest-phone-yet",
  "title": "Motorola teams up with Bullitt for toughest phone yet",
  "category": "phones",
  "updated": "2021-06-17T18:20:18Z",
  "author": "anthony-spadafora",
  "summary": "Defy dust, water and drops with Motorola's new rugged smartphone",
  "article": [
    "Motorola and Bullitt have announced the launch of the new Motorola Defy which is the first rugged smartphone to come about as a result of their exclusive partnership that was revealed at the beginning of this year.",
    "While Lenovo has been responsible for making Motorola-branded smartphones in the past, the company chose the Bullitt Group to revive its rugged smartphone line instead. This is because Bullitt manufactures the CAT line of rugged phones for the American engineering giant Caterpillar Inc. and also produces phones under the Land Rover brand.",
    "The Motorola Defy features all of the hallmarks of a rugged smartphone including IP68 water resistance as well as MIL SPEC 810H durability certification. The device can be submerged in water at a depth of 1.5m (4ft 11 inches) for 35 minutes thanks to its unique dual-sealed housing and can withstand a drop from up to 1.8m (5ft 10.8 inches.",
    "As 34 percent of consumers have either broken or damaged their smartphone in the last three years, the Motorola Defy also delivers comprehensive protection for daily mishaps such as falling from your pocket, coffee spills and even being left out in the sun. In fact, thanks to its IP68 rating, users can wash the device as often as they wash their hands.",
    "In addition to being rugged, the Motorola Defy can take beautiful photos thanks to its 48MP f/1.8 sensor with Quad Pixel technology. The inclusion of a powerful camera sensor will likely help set the Defy apart from other rugged smartphones which often skimp on camera quality.",
    "The Motorola Defy also features a 6.5-inch HD+ display that is protected with thick Corning Gorilla Glass Victus Plus. Keeping the device charged won't be a problem as well since its 5,000mAh battery with TurboPower charging can last for two whole days on a single charge.",
    "Available in either Forged Green or Black, the Motorola Defy also has a textured design to make it easier to grip and a detachable lanyard wrist strap can be used to anchor it to your hand when out in the field or working.",
    "The Motorola Defy will be available in select European and Latin American markets in the coming weeks starting at €329 / £279 though pricing may vary per country. Depending on the success of its launch, Motorola's new rugged smartphone could also come to the US and other regions at a later date."
  ],
  "headers": {
    "4": "Motorola Defy"
  },
  "links": {
    "Motorola Defy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-9785363426369802000&url=https%3A%2F%2Fwww.motorola.com%2Fblog%2Fbullitt-motorola-defy&article_name=Motorola%20teams%20up%20with%20Bullitt%20for%20toughest%20phone%20yet&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmotorola-teams-up-with-bullitt-for-toughest-phone-yet",
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "Motorola-branded smartphones": "https://www.techradar.com/news/phone-and-communications/mobile-phones/motorola-branded-phones-are-officially-dead-1312648",
    "chose the Bullitt Group": "https://www.techradar.com/news/there-might-be-some-new-motorola-rugged-phones-on-the-way",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Quad Pixel technology": "https://www.techradar.com/news/motorola-announces-a-trio-of-new-phones-including-the-anticipated-moto-g8-plus",
    "Corning Gorilla Glass Victus Plus": "https://www.techradar.com/news/dnp-gorilla-glass-victus-is-cornings-next-leap-for-smartphone-displays"
  }
}