{
  "source": "https://www.techradar.com/news/google-clock-bug-means-some-android-users-are-sleeping-through-their-alarms",
  "title": "Google Clock bug means some Android users are sleeping through their alarms",
  "category": "phones",
  "updated": "2021-09-05T11:22:41Z",
  "author": "david-nield",
  "summary": "A fix is apparently on the way",
  "article": [
    "If the Google Clock app on your Android phone hasn't been sounding off and waking you up for the last few days, you're not alone – plenty of disgruntled users have reported the bug, which seems to be relatively widespread.",
    "As reported in several places, including Android Authority, there's now a Reddit thread on the problem, and the app listing on the Google Play Store is getting hit by a lot of one-star reviews that mention alarms not ringing when they should.",
    "What's not clear is exactly what the bug might be related to: some people's issues seem to be linked with using a Spotify playlist as an alarm, or with their phone's Do Not Disturb settings, but for others that doesn't appear to be the case.",
    "The problems look to be primarily related to Pixel phones, with a variety of models affected. However, users who have the Google Clock installed on phones from other manufacturers are also chiming in to say they've been affected.",
    "Android Police reports that a Reddit post from Google's Pixel Community account mentions a fix: \"We've identified a fix and will roll it out soon\" reads the message, which also recommends not using Spotify as the alarm sound.",
    "Using one of the default on-device sounds does appear to solve the issue for some users, but not others. There's also a thread on Issue Tracker about the bug, which states that the product and engineering teams at Google are looking into it.",
    "With many of us relying on our phones to get up in the morning (or any other time in the day), this is a bigger problem than it might at first appear to be. Google and Spotify do at least look to have worked quickly to figure out what might be happening.",
    "At the time of writing, we're still waiting on a full fix for the issue to be rolled out. In the meantime, there are plenty of free third-party alarm clock apps for Android on the Google Play Store, which you should be able to use without any issues."
  ],
  "headers": {
    "4": "Can they fix it?"
  },
  "links": {
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Android Authority": "https://www.androidauthority.com/google-clock-app-bug-2746394/",
    "a Reddit thread": "https://www.reddit.com/r/GooglePixel/comments/pdenpy/alarm_being_missednot_showing_at_all/",
    "the app listing": "https://play.google.com/store/apps/details?id=com.google.android.deskclock&showAllReviews=true",
    "Android Police": "https://www.androidpolice.com/2021/09/03/some-users-are-missing-their-alarms-because-of-a-mysterious-google-clock-bug/",
    "on Issue Tracker": "https://issuetracker.google.com/issues/198237873?pli=1"
  }
}