{
  "source": "https://www.techradar.com/news/intel-raptor-lake-cpu-details-mistakenly-spilled-including-compatibility-with-alder-lake",
  "title": "Intel Raptor Lake CPU details mistakenly spilled – including compatibility with Alder Lake",
  "category": "computing",
  "updated": "2021-04-02T09:54:03Z",
  "author": "darren-allan",
  "summary": "Unintentional leak from Intel gives us a touch more info on 13th-gen processors",
  "article": [
    "Intel has accidentally spilled a bit more information about its Raptor Lake processors, including that these chips will succeed and be compatible with Alder Lake (they’ll use the same socket).",
    "We’ve been hearing a fair bit about Raptor Lake on the rumor mill of late, as Intel’s 13th-gen CPUs which will follow Alder Lake and should land in 2022, before Meteor Lake takes the baton in 2023.",
    "Most recently, we saw Raptor Lake actually mentioned in official Intel documentation regarding its compatibility with Alder Lake, suggesting that these processors are indeed the follow-up to the 12th-gen products which arrive later in 2021 (maybe as soon as September).",
    "As Tom’s Hardware reports, Intel revealed some further nuggets of info about Raptor Lake (alongside details of DG2, its incoming high-end gaming graphics card range). That included Raptor Lake being compatible with the same motherboards used with Alder Lake (and the LGA 1700 socket).",
    "Although that’s no surprise, because if Raptor Lake is indeed the successor to Alder Lake – which looks pretty definite now – it would be extremely unlikely that Intel would shift away to a different socket over the span of one generation.",
    "This likely means that those who buy an Alder Lake processor and motherboard will be able to upgrade directly to Raptor Lake if they wish, and simply drop one of the latter CPUs into their rig – but given that we haven’t had official confirmation from Intel about any of this yet, of course, we should still be cautious.",
    "All this makes sense, though, and ties in with the previous speculation that Raptor Lake will simply be a refresh of Alder Lake, pretty much keeping things the same in terms of the design, and quite possibly core configurations (using a big.LITTLE style approach, as we’ve seen), but just tweaking and honing performance.",
    "Meteor Lake, which should follow Raptor Lake, will be the next big change as Intel finally moves to 7nm (Alder Lake is 10nm, and Raptor Lake should be a 10nm refresh as indicated).",
    "Raptor Lake could make some interesting additional tweaks to the Alder Lake formula, mind you, and we’ve heard on the grapevine that it’ll implement an improved CPU cache for gaming. Large pinches of salt at this point, of course, for all this really.",
    "Tom’s further notes that the info spilled by Intel indicates that the mobile chips for Raptor Lake – in other words, the products designed for laptops – will continue to run with an integrated Thunderbolt 4 controller using the Burnside Bridge TB4 retimer.",
    "In theory, we’ve also glimpsed as far down the line as the successor to Meteor Lake, which could be Lunar Lake, chips that would be scheduled to debut in 2024 going by the current timeframes floating down from the rumor mill. Of course, even if this is Intel’s plan right now, that could well change if delays are encountered…"
  ],
  "headers": {
    "6": "Raptor refresh"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Raptor Lake actually mentioned in official Intel documentation": "https://www.techradar.com/news/intel-raptor-lake-cpus-spotted-likely-to-be-alder-lakes-successor",
    "maybe as soon as September": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/intel-confirms-raptor-lake-compatible-with-alder-lake",
    "incoming high-end gaming graphics card range": "https://www.techradar.com/news/intels-high-end-gaming-gpu-possibly-spotted-in-testing-hinting-at-a-2021-debut",
    "using a big.LITTLE style approach, as we’ve seen": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought",
    "next big change as Intel finally moves to 7nm": "https://www.techradar.com/news/intel-finally-nails-7nm-but-meteor-lake-cpus-wont-hit-until-2023",
    "it’ll implement an improved CPU cache for gaming": "https://www.techradar.com/news/intel-finally-nails-7nm-but-meteor-lake-cpus-wont-hit-until-2023",
    "which could be Lunar Lake": "https://www.techradar.com/news/intel-lunar-lake-spotted-again-but-rumored-14th-gen-cpus-may-not-arrive-for-ages"
  }
}