{
  "source": "https://www.techradar.com/news/shang-chi-star-promises-to-improve-the-mcu-in-one-specific-way",
  "title": "Shang-Chi star 'promises' to improve the MCU in one specific way",
  "category": "entertainment",
  "updated": "2021-05-17T15:46:38Z",
  "author": "tom-power",
  "summary": "Marvel's Shang-Chi movie sounds like it'll be an all-action affair",
  "article": [
    "Shang-Chi and the Legend of the Ten Rings will introduce more than just a new MCU hero when it arrives in September.",
    "The upcoming MCU movie, which will be the second MCU Phase 4 movie to land after July's Black Widow, is the first to have an Asian actor – Simu Liu – as its lead character, and one Marvel hopes will go some way to rectifying the company's complicated history concerning East Asian representation in its comics.",
    "Alongside those key commitments, though, Shang-Chi's star \"promises\" to deliver on another intriguing proposal. Namely, producing the best action sequences in a Marvel film to date.",
    "Speaking to Entertainment Online about the Shang-Chi movie, Liu was quizzed on the film's action scenes. After all, the superhero movie's first trailer gave fans a glimpse of some tight and impressive close-quarters combat when it landed online on April 19.",
    "\"I promise that Shang-Chi and the Legend of the Ten Rings is going to deliver action sequences in a way that MCU fans, or any fans, have never seen before,\" Liu confidently replied. \"And that is personal promise. You can stamp it, you can quote it, you can guarantee it. You guys are in for a treat, for sure. And I'm so excited.\"",
    "It's hard to say. Naturally, you'd expect Liu to talk up his movie's chances in the action stakes. Judging by the footage we've seen so far, there will be plenty of action to go alongside the family drama that Shang-Chi will portray.",
    "Adding to Liu's comments in an earlier chat with Entertainment Weekly, producer Jonathan Schwartz was also rather bullish about the movie's action. \"I think this is the best action [Marvel has] ever done,\" he said in April. \"Every punch is meaningful, every fighting style is meaningful, and the story is told visually in such a great way.\"",
    "What Liu and Schwartz's comments boil down to, though, is the context in which they're making them. If the duo are talking about close-quarters combat, then Shang-Chi will likely be fighting for top spot in the MCU's action stakes.",
    "There are other contenders, such as the Captain America movies, that employ lots of in-your-face action, but there's also lots of ranged combat in films such as Iron Man and Captain Marvel. If Shang-Chi is solely (or predominantly, at the very least) a close-quarters action type of movie, Liu and Schwartz could end up being right in their assertions.",
    "The problem, however, arises if the pair are talking about all of the MCU's action sequences. If they are, there are lots of potential candidates for the best MCU action scenes of all-time.",
    "Shang-Chi wouldn't top, say Avengers: Infinity War or Endgame in terms of size and scope with its battles. Black Panther, Captain America: Civil War and Guardians of the Galaxy Vol. 2 all had strong set-piece moments, too, so Shang-Chi's action would really need to be top drawer if it wants to out-do any of those.",
    "Hopefully, Shang-Chi and the Legend of the Ten Rings can back up Liu and Schwartz's quotes when its release date rolls around. Shang-Chi is currently schedule to be released theatrically worldwide on September 3."
  ],
  "headers": {
    "5": "Analysis: will Marvel's Shang-Chi deliver on its promise?"
  },
  "links": {
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Entertainment Online": "https://www.eonline.com/news/1269790/how-shang-chi-star-simu-liu-is-preparing-for-life-as-a-superhero-and-role-model",
    "Entertainment Weekly": "https://ew.com/movies/shang-chi-and-the-legend-of-the-ten-rings-simu-liu-first-look/"
  }
}