{
  "source": "https://www.techradar.com/news/the-legend-of-zelda-skyward-sword-hd-for-nintendo-switch-everything-you-need-to-know",
  "title": "The Legend of Zelda: Skyward Sword HD – everything you need to know",
  "category": "gaming",
  "updated": "2021-06-15T19:32:51Z",
  "author": "samuel-tolbert",
  "summary": "The Wii classic Skyward Sword is coming to Nintendo Switch",
  "article": [
    "The Legend of Zelda: Skyward Sword is coming to the Nintendo Switch. A Wiimote-swinging hit on the Wii upon its original release back in November of 2011, a new-and-improved version is set to land just ahead of the game's tenth anniversary, and the 35th anniversary of the Zelda franchise as a whole.",
    "First shown off during a Nintendo Direct earlier in 2021, ahead of a July release, this HD port won't massively mix up the formula, though Nintendo has promised a few key tweaks ahead of its return.",
    "While the sequel to The Legend of Zelda: Breath of the Wild doesn't currently have a release date, anyone looking for an older Zelda experience should be happy when Skyward Sword hits Nintendo's latest platform on July 16, 2021.",
    "Regardless of whether or not you played the original game or this is your first time going into this interesting entry in the Zelda franchise, we've got you covered. Here's everything you need to know about The Legend of Zelda: Skyward Sword HD.",
    "You can check out the official announcement trailer for the game below, which was revealed in February 2021.",
    "The Legend of Zelda: Skyward Sword HD is a port of an older Nintendo game, but promises to bring with it a raft of improvements. The original game, which was released for the Wii back in November 2011, made heavy use of the Wii Remote Plus and Nunchuk accessory for motion controls.",
    "Meanwhile, Skyward Sword HD supports two control schemes. One version uses the Joy-Cons to replicate the motion controls, while the alternative control setup maps the sword to the right analog stick, forgoing motion controls.",
    "The latter isn't just handy for anyone who doesn't want to flail around with their Joy Cons - it's essential for playing on the Switch Lite, which can't detach its controllers.",
    "While this isn't exactly a remaster, the graphics do seem to run at a higher resolution. The game also now runs at 60 FPS, providing much smoother gameplay overall. Given that it is still running on the original Switch hardware, though, don't expect too much of a graphical improvement.",
    "However, not all \"improvements\" have been met with praise. Nintendo intends to lock a new fast travel system for the game, removing some of its tedious back-tracking, behind an Amiibo purchase. To use the new fast travel system being added to Skyward Sword, players will need to buy the new 'Zelda and Loftwing' Amiibo to access it, at additional cost.",
    "The Legend of Zelda: Skyward Sword, despite critical praise and commercial success (it sold well over three million copies in 2011), is seen as somewhat controversial. Parts of the game were received by the fanbase as being too safe or repetitive, to the point that Nintendo drew on the criticism when crafting the next entry in the franchise, The Legend of Zelda: Breath of the Wild.",
    "However, there's lots of fun to be had. The motion controls, at the time, were viewed very favourably, as players could accurately swing Link's sword to swipe at bad guys and parry blows. It also had a wonderful, pastel-colored art style which you can certainly see evolved and refined for Breath of the Wild.",
    "The Legend of Zelda: Skyward Sword HD is currently set to release for the Nintendo Switch on July 16, 2021, and will be priced at $60 / £49 / AU$68.",
    "Players can also pick up Skyward Sword-styled Zelda-themed Joy Cons, which are themed and colored after the series' mainstay Master Sword and Hylian Shield in the right and left controllers, respectively. They're slated to come out on the same day as Skyward Sword HD for the Switch, and will be priced at $79 / £69 / AU$119."
  ],
  "headers": {},
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "sequel to The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Zelda-themed Joy Cons": "https://www.techradar.com/news/the-legend-of-zelda-skyward-sword-joy-con-are-wonderfully-regal"
  }
}