{
  "source": "https://www.techradar.com/news/sky-global-apparently-shuts-down-following-police-arrests",
  "title": "Sky Global apparently shuts down following police arrests",
  "category": "phones",
  "updated": "2021-03-19T23:33:10Z",
  "author": "anthony-spadafora",
  "summary": "Another encrypted phone service for criminals has been shuddered",
  "article": [
    "The encrypted phone service Sky Global has shut down its operations after BlackBerry cut off the firm's access to its United Endpoint Manager services.",
    "The shut down comes after Sky Global's CEO Jean-Francois EAP was recently indicted by the Department of Justice alongside a former distributor of encrypted smartphones for selling devices to international drug traffickers to help them avoid being detected by law enforcement.",
    "In a statement announcing the indictment, Assistant US Attorneys Meghan E. Heesch and Joshua C. Mellor provided further insight on Sky Global's business model, saying:",
    "“Sky Global’s devices are specifically designed to prevent law enforcement from actively monitoring the communications between members of transnational criminal organizations involved in drug trafficking and money laundering. As part of its services, Sky Global guarantees that messages stored on its devices can and will be remotely deleted by the company if the device is seized by law enforcement or otherwise compromised.”",
    "Just like with the subscription-based phone system EncroChat that was shut down last year, Sky Global provided criminals with modified Nokia, Google, Apple and BlackBerry smartphones that had their cameras, microphones and GPS capabilities removed to make them harder to track.",
    "Once a criminal purchased one of the company's modified devices, they would then sign up for its end-to-end encrypted messaging software Sky ECC that came preinstalled on its smartphones.",
    "As first reported by MotherBoard, Sky Global's website has been seized by US and Canadian authorities and it now displays an official government banner complete with the logos of the FBI, DEA, US Marshals Service and the Royal Canadian Mounted Police.",
    "However, before Sky Global's operations and site were shut down, a final message went out to the company's customers warning them that their communications could soon be intercepted by law enforcement.",
    "While Sky Global is no more, another encrypted phone service will likely rise up in its place due to how profitable supplying criminals with untraceable phones can be.",
    "Via The Register"
  ],
  "headers": {
    "4": "Sky Global investigation"
  },
  "links": {
    "BlackBerry": "https://www.techradar.com/news/blackberry-sells-smartphone-patents-to-huawei",
    "Department of Justice": "https://www.techradar.com/news/us-department-of-justice-takes-down-rogue-domain-names",
    "statement": "https://www.justice.gov/usao-sdca/pr/sky-global-executive-and-associate-indicted-providing-encrypted-communication-devices",
    "EncroChat": "https://www.techradar.com/news/police-arrest-hundreds-of-criminals-after-infiltrating-their-encrypted-phone-system",
    "Sky ECC": "https://www.techradar.com/news/sky-ecc-says-it-was-hit-by-complex-phishing-campaign",
    "MotherBoard": "https://www.vice.com/amp/en/article/88aybp/sky-secure-shuts-down-blackberry",
    "The Register": "https://www.theregister.com/2021/03/19/sky_global_ecc_shuts_down_indictment_raids/"
  }
}