{
  "source": "https://www.techradar.com/news/how-to-watch-ncis-online-stream-the-season-18-premiere-from-anywhere-today",
  "title": "How to watch NCIS season 18 online: stream all-new episodes 4 and 5 from anywhere",
  "category": "computing",
  "updated": "2021-01-19T16:23:21Z",
  "author": "kevin-lynch",
  "summary": "Special agent Gibbs and the team are back from holiday hiatus",
  "article": [
    "Well into its second decade on the small screen, the Naval Criminal Investigative Service is back for a new run of shows, which kicked off with an intriguing backward time jump and now returns from a short holiday break for all-new episodes this week. Read on to find out how you can watch NCIS season 18 online and stream every new episode, no matter where you are in the world right now.",
    "*Warning: minor spoilers for NCIS season 18 may exist below*",
    "The show returned in late-2020 with a season premiere which flashed back to Special Agents Leroy Jethro Gibbs (Mark Harmon) and Tobias Fornell (Joe Spano) in pursuit of the leader of a crime ring who supplied drugs to Fornell’s daughter.",
    "The second episode of the new season, and landmark 400th episode, promised a similar time-travelling effect. Rolling back the years, the special episode served as something of an origin story, examining the early days of Gibbs’ NCIS career and his longtime friendship with medical examiner Dr. Donald ‘Ducky’ Mallard (David McCallum).",
    "The unusual narrative arc for normally straightforward NCIS leaves us to wonder how the show will resume in 2021 when it airs episodes 3 and 4 as a double-bill on January 19 following a short holiday break for the series. Season 18 is also tipped to mark a farewell to the team's Forensic Psychologist Jack Sloane (Maria Bello) with the character's storyline widely being reported as coming to an end within the first eight episodes of new run.",
    "Follow our guide below to watch NCIS season 18 online and stream every new episode from anywhere in the world this week.",
    "Watch more NCIS:",
    "If you're abroad today but still want to get your NCIS fix just as you would if you were at home, you'll need a VPN to do so. This is because of the pesky digital phenomenon known as geo-blocking, which means watching a stream of NCIS season 18 from your usual provider might not be possible in certain parts of the world.",
    "However, a Virtual Private Network offers a legal solution to this common internet woe and is remarkably easy to set up and operate. Here's how it works and where to get started.",
    "Use a VPN to watch NCIS season 18 online from anywhere",
    "And don't forget that a VPN isn't just for reality TV - there's loads you can do with these clever bits of software. From unblocking restricted sites and watching Netflix in other countries, to adding an extra layer of security for online shopping and banking, Virtual Private Networks offer loads of benefits beyond streaming TV like NCIS."
  ],
  "headers": {
    "7": "How to watch NCIS season 18 online from outside your country",
    "11": "How to watch NCIS online in Australia"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}