{
  "source": "https://www.techradar.com/news/these-superb-bose-qc35-ii-deals-slash-the-price-of-the-noise-cancelling-headphones",
  "title": "These superb Bose QC35 II deals slash the price of the noise-cancelling headphones",
  "category": "audio-visual",
  "updated": "2021-07-21T10:34:46Z",
  "author": "olivia-tambini",
  "summary": "But should you buy them now?",
  "article": [
    "The Bose QuietComfort 35 II are among the best noise-cancelling headphones you can buy – and right now, you can snag them with some hefty discounts in the US and the UK.",
    "In the US, Amazon has slashed the price of the Bose headphones from $299 to $249 – a huge saving when you consider they launched at $349.",
    "Meanwhile, UK buyers can get the QuietComfort 35 II for £162, reduced from £179.99. That may not seem like a significant discount, but it's a big saving compared to the original £330 RRP. (Not in the US or UK? Scroll down for the best Bose headphones prices in your region.)",
    "The Bose Quiet Comfort 35 II feature world-class noise cancellation technology with three different levels to fit any environment. As the name implies, the lightweight headphones offer a comfortable around-ear fit with pillow-like cushions that provide all-day comfort. The wireless headphones also work with Amazon Alexa and the Google Assistant so you can control your music, check the weather, and more completely hands-free.",
    "So, buying them at these prices may seem like a no-brainer. However, it's worth considering that Bose may be on the verge of releasing a new model in the QuietComfort range.",
    "The audio company recently submitted an FCC filing for the Bose QuietComfort 45, which suggests that a launch could be imminent – and that means the price of the QuietComfort 35 II could plummet as a result.",
    "Still, if you're looking for an excellent pair of noise-cancelling headphones and don't want to wait on the off-chance that Bose does release a new model in the near future, these deals are well worth taking advantage of.",
    "Not in the US or UK? We've rounded up the best Bose headphones deals in your regions below:",
    "Shop more Bose offers with the best Bose QuietComfort 35 II prices and sales and shop more of the cheapest noise-cancelling headphone deals that are currently available."
  ],
  "headers": {
    "3": "Today's best Bose headphones deals"
  },
  "links": {
    "to $249": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBose-QuietComfort-Wireless-Headphones-Cancelling%2Fdp%2FB0756CYWWD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9207994640249651000-20",
    "for £162": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FBose-QuietComfort-Wireless-Headphones-Cancelling-Black%2Fdp%2FB0756CYWWD%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1107685018929337600-21",
    "Bose Quiet Comfort 35 II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "an FCC filing for the Bose QuietComfort 45": "https://www.techradar.com/news/bose-quietcomfort-45-headphones-revealed-in-fcc-filing",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Bose QuietComfort 35 II prices and sales": "https://www.techradar.com/deals/the-cheapest-bose-quietcomfort-35-ii-prices-and-sales-in-october-2019",
    "cheapest noise-cancelling headphone deals": "https://www.techradar.com/deals/cheap-noise-canceling-headphone-deals"
  }
}