{
  "source": "https://www.techradar.com/news/audio-technica-upgrades-its-best-headphones-with-hi-res-audio-and-50-hour-battery-life",
  "title": "Audio-Technica upgrades its best headphones with hi-res audio and 50-hour battery life",
  "category": "audio-visual",
  "updated": "2021-08-19T03:12:46.236Z",
  "author": "olivia-tambini",
  "summary": "Technically brilliant headphones get a new lease of life",
  "article": [
    "Audio-Technica has announced its latest headphones, the ATH-M50xBT2. The new cans build on the success of the company's best-sounding headphones, with a raft of extra features that could see them rival the best over-ear headphones on the market today.",
    "The ATH-M50xBT2 retain the 45mm large-aperture drivers, wireless design, and in-app EQ adjustment of their predecessors (the ATH-M50xBT), but come with a new DAC (digital-to-analog converter) and internal headphone amp that the company says will provide \"clear, high fidelity sound\".",
    "Hi-res audio is also now catered for, with support for AAC and LDAC codecs, as well as the standard SBC, while a low-latency mode should keep audio and video in sync if you use the headphones for gaming or watching TV.",
    "Beamforming mics should ensure clearer phone calls, as well as making it easier to communicate with the Alexa voice assistant built into the headphones. Meanwhile, sidetone circuitry should allow you to hear your voice coming through the headphones while making calls – a handy feature if you're prone to shouting down the phone while wearing headphones because you can't hear how loudly you're speaking.",
    "A new mute button, alongside buttons to control your music playback and summon your voice assistant of choice (you can use Google Assistant or Siri if you prefer) is built into the left earcup, so you won't have to dig out your phone if you need to quickly mute yourself on work video calls.",
    "For Android users, there's also now support for Google Fast Pair, so you should be able to connect the M50xBT2 to your smartphone with a single tap of your screen.",
    "Best of all, the battery life of the Audio-Technica headphones has been improved. You now get 50 hours of playback compared to their predecessors' 40-hour battery life, and a rapid 10-minute charge via USB-C will give you three hours of use. That's better than most wireless headphones you can buy today, though the Jabra Elite 45h do match this number.",
    "In spite of these improvements, the price of the ATH-M50xBT2 hasn't increased since the previous model. They're available to buy for $199 / £179 / AU$349. That's not cheap by any means, but for a pair of over-ear headphones from a trusted brand like Audio-Technica, the price isn't bad at all.",
    "If the Audio-Technica ATH-M50xBT2 are anything like their predecessors, they'll be a very impressive pair of over-ear headphones indeed. However, there's one missing feature that could put them at a disadvantage: active noise cancellation.",
    "Noise-canceling headphones like the Sony WH-1000XM4 and the Bose Noise Cancelling Headphones 700 have exploded in popularity over the last few years. The technology is getting better all the time, with many models able to block out everything from the roar of an airplane cabin to noisy colleagues in an office.",
    "They've become even more necessary as more of us have begun working from home than ever before, due to the ongoing effects of the Covid-19 pandemic. We demand more features from our headphones than ever – ANC, long battery lives, comprehensive codec support, and fast pairing to name a few – and omitting any of modern conveniences these could be to Audio-Technica's detriment.",
    "However, it's worth remembering that the original ATH-M50x headphones were designed to bridge the gap between professional studio headphones and the ones you plug into your phone for casual listening.",
    "Studio headphones would never come with ANC, and it's possible that including this feature would drive the M50xBT2 too far away from their pro roots.",
    "We certainly felt that the previous model walked this line very effectively – and with more music streaming services offering access to hi-res audio, the new support for AAC and LDAC codecs combined with an audiophile soundstage could be enough to make buyers consider Audio-Technica's latest over ANC headphones from the likes of Sony and Bose."
  ],
  "headers": {
    "8": "Analysis: can headphones without noise-cancellation compete in 2021?"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "best over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "ATH-M50xBT": "https://www.techradar.com/reviews/audio-technica-ath-m50xbt-headphones",
    "Hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "ATH-M50x headphones": "https://www.techradar.com/reviews/audio-technica-ath-m50x"
  }
}