{
  "source": "https://www.techradar.com/news/scan-your-face-to-see-how-exercise-affects-your-mental-health",
  "title": "Asics wants to scan your face to see how workouts affect your wellbeing",
  "category": "fitness",
  "updated": "2021-06-02T09:43:26Z",
  "author": "cat-ellis",
  "summary": "Check your mental state before and after a workout",
  "article": [
    "Asics has launched a new online study, asking you to report how you feel before and after a workout as part of a global study on the effect of exercise on mental health.",
    "The study launched today (June 2) to coincide with Global Running Day. To take part, visit the Asics Mind Uplifter website (accessibly on mobile and desktop), where you'll be prompted to scan your face to read your emotional state. You'll then be prompted to answer a set of questions designed to gauge your brain function, before working out for at least 20 minutes.",
    "Although Asics is best known for its running shoes, this can be any kind of exercise. In fact, the study aims to capture a wide range of activities, and there are 25 activities included as options.",
    "Once you've finished, return to the website, take another scan, and repeat the survey question and scan to make your contribution and see your results. You'll also have the opportunity to upload the results to social media with the hashtag #UpliftingMinds, if you want.",
    "Your data will contribute towards an interactive map, where you can see the effect of sport in cities, countries and around the world.",
    "You may be worried about the implications of submitting a scan of your face (and understandably so), so TechRadar asked what happens to this data, and how it's protected.",
    "\"Asics has been very careful to ensure that participants do not need to enter any personal data in order to use the Mind Uplifter,\" the company told us.",
    "\"While facial scanning technology is used as part of the tool, no footage or screenshots of participants’ faces are saved and participants are not identifiable having not provided any personal data.\""
  ],
  "headers": {
    "5": "Saving face"
  },
  "links": {
    "Asics Mind Uplifter": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2106557975597358600&xs=1&url=http%3A%2F%2Fminduplifter.asics.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fscan-your-face-to-see-how-exercise-affects-your-mental-health",
    "running shoes": "https://www.techradar.com/best/best-running-shoes"
  }
}