{
  "source": "https://www.techradar.com/news/editing-microsoft-excel-files-online-could-finally-get-a-lot-simpler",
  "title": "Editing Microsoft Excel files online could finally get a lot simpler",
  "category": "computing",
  "updated": "2021-12-07T15:02:06Z",
  "author": "mike-moore",
  "summary": "Microsoft Excel for the Web can now open and edit more files than ever",
  "article": [
    "Editing spreadsheets on the go or at work should soon be easier than ever thanks to a significant update to the web version of Microsoft Excel.",
    "Microsoft has revealed a number of spreadsheet softwareupgrades that it says will help close the gap with its desktop-based sibling, including better support for larger files, as well as those with legacy features.",
    "\"We are excited to share that you can now open and edit more files on the web and complete your job anywhere, in the browser of your choice,\" Microsoft noted in an Excel blog post announcing the news.",
    "Going forward, Microsoft Excel for the Web will now allow users to open and edit large files from SharePoint up to 100MB in size. This will expand possible files to thousands of rows of data, and means users will not have to switch to the Desktop version of Excel to finish work.",
    "Users can also now edit files containing what Microsoft calls Legacy Art objects and SmartArt objects - including the likes of Form Controls, ActiveX Controls, Camera Tools, and OLE objects. The company says this will allow users to access and interact with any such workbooks but not with the objects themselves.",
    "Elsewhere, users can now also access password-protected workbooks on Excel for the Web, meaning there's no need to switch back to a desktop in order to open & interact with secured files. Similarly, users can now also edit files which are protected for editing using a password to modify, meaning you'll be able to access and interact with different types of protected workbooks on the browser itself.",
    "That's not all, as Microsoft also noted that more features will also be added soon, including support for Microsoft 365 subscribers to edit large files up to 100 MB from OneDrive, and further support for editing workbooks with legacy shared features and data wizard connections.",
    "The news comes shortly after Microsoft revealed it will be bringing support for smoother scrolling to the Excel Desktop app, hopefully resulting in a much better user experience."
  ],
  "headers": {
    "3": "Excel for Web upgrade"
  },
  "links": {
    "Microsoft Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "spreadsheet software": "https://www.techradar.com/best/spreadsheet-software",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1180685494612242400&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fexcel-blog%2Fopen-amp-edit-more-files-in-excel-for-the-web%2Fba-p%2F3031194&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fediting-microsoft-excel-files-online-could-finally-get-a-lot-simpler",
    "smoother scrolling to the Excel Desktop app": "https://www.techradar.com/news/microsoft-excel-has-finally-solved-one-of-its-most-annoying-issues"
  }
}