{
  "source": "https://www.techradar.com/news/exclusive-how-nikon-designed-the-nikon-zfc-and-why-it-thinks-the-future-is-retro",
  "title": "Exclusive: How Nikon designed the Nikon Z fc – and why it thinks the future is retro",
  "category": "cameras",
  "updated": "2021-08-17T12:39:13Z",
  "author": "mark-wilson",
  "summary": "Interview: Nikon tells us how and why it made the new Z fc",
  "article": [
    "Touchscreens might have taken over the world, but tactile tech isn't going away quietly. Turntables, valve amps and mechanical watches have all carved out defiant niches – and the Nikon Z fc is the camera giant's attempt to hit a similar spot for photographers.",
    "Even if you're not a Nikon fan, or a photography fan, it's easy to see that the Nikon Z fc is a special camera. The model it's based on, the full-frame Nikon FM2 from 1982, is a design classic that was renowned for being virtually indestructible. And who doesn't love a gadget that's covered in silver dials?",
    "Yet this is far from the first time that a camera maker has returned to the past to make its camera of the future. Fujifilm, Olympus and Leica have all built their reputations on immaculate vintage aesthetics. Nikon has played the retro card before, too, with the fun-but-flawed Nikon Df from 2013.",
    "So what's different this time and why make the Nikon Z fc now? Luckily, Nikon's Nelson Hau (UX Planning Department, 1st UX Planning Section) and designer Shu Suzuki (ID Group, Design Center) were both happy to answer these questions and many more during an exclusive interview with TechRadar.",
    "And yes, we did ask when we're going to get a full-frame Nikon Z fc...",
    "It's no secret that camera manufacturers, even giants like Nikon, are in a bit of a bind. Smartphones have devoured the entry-level end of the market and their silicon-powered momentum shows no sign of slowing.",
    "This is something Nikon acknowledges. \"With the rise of smartphones, anyone can easily experience photography, so we need to go beyond that,\" says Nelson Hau. \"We believe that the Z fc has a value which goes beyond technical specifics. It has a viewfinder that makes users want to look through it, its dials feel comfortable, and there is an aesthetic that makes users proud as they carry it around\" he adds.",
    "But it's not enough to just make a camera that people enjoy looking at. In some ways, this was the mistake Nikon made with the Nikon Df in 2013, which married a similar retro aesthetic with a slightly plasticky, mid-range SLR. It was also too expensive for such a half-baked concept.",
    "So did Nikon learn any lessons from making the Df? \"The Z fc was developed with a different concept than the Df, but both cameras were designed with a focus on joy of ownership\", says Shu Suzuki. \"We consider the balance between practical value and joy of ownership to be crucially important.\" The Nikon Df never quite felt like a cohesive whole – partly because it was a bulky SLR – but the more compact Z fc does handle like a modern-day Nikon FM2.",
    "Still, this \"practical value\" that Shu Suzuki refers to does mean that, underneath its retro body, the Z fc is a very modern camera. In specs terms, it's effectively a Nikon Z50, which is the only other camera in Nikon's mirrorless camera range with an APS-C sensor. Like that model, you get a 20.9MP sensor and Nikon's latest hybrid autofocus system – plus, unlike the Nikon Df, the ability to shoot 4K/30p video.",
    "Photography purists, then, might still prefer to pick up a battered Nikon FM2, a mechanical tool that could famously work without any batteries. But Nikon has worked hard on making sure the Z fc has retained the spirit of the FM2, if not its indestructible, weather-resistant build.",
    "\"While the design of the Z fc takes its inspiration from the FM2, the goal was never to reproduce the silhouette exactly, but rather create a new framework which preserves the overall essence of the earlier model,\" says Shu Suzuki.",
    "\"Restructuring the framework to fit the new mirrorless technology was the most important aspect of the design, and balancing the dimensions of camera body and pentaprism proved to be one of the biggest challenges, especially with the large-diameter Z mount and the pentaprism area minimized due to the adoption of the EVF\" he added.",
    "Shu Suzuki was certainly in a good position to bring those little FM2-style flourishes to the Nikon Z fc. \"I personally use a Nikon FM that was handed down to me from my grandfather,\" he says. \"This camera features a full mechanical operation and I find that the comfortable dials and levers, as well as the process of changing shooting settings and winding film, inspire excitement before I release the shutter\" he adds.",
    "Naturally, the Nikon Z fc isn't an exact replica of the Nikon FM series, but it's also a long way from a shallow cash-in, too. \"Although the mechanism is different in the Z fc, I wanted to create an experience that inspires a similar excitement with shooting,\" Shu Suzuki says.",
    "So are there any little design elements that he's particularly proud of, beyond the retro Nikon logo? \"The corners of the camera are intentionally 'crushed' to make it look as if it was made by press work from the FM2's era,\" he says. \"In addition, on the corners of the body, we also reproduced the 'sagging' [a smooth surface created by pulling the surface of the material] that happens with press work. We were particular about \"FM2-ness\" in every detail,\" he adds in Jony Ive fashion.",
    "The key to a good remake is that it doesn't just look the part, but captures the feeling of the original – just ask anyone who sat through the dire Total Recall reboot. And one of the keys to achieving this on a retro-inspired camera is the dials, which recreate a tactile shooting experience that's a welcome contrast to the soulless screen-prodding of smartphones.",
    "These dials were another area where Shu Suzuki wanted to recreate the FM2 feel and spirit. \"The dials were a key differentiator of the FM2 and have been reimagined for the Z fc,\" he says. \"The dials on the Nikon FM2 were made of a black resin, but machined metal dials have been adopted for this camera. Careful consideration was given to every facet of the Z fc’s design, even down to the 'clicks' the user feels when operating the dials and switches, to ensure it delivers an enjoyable shooting experience,\" he adds.",
    "The Nikon Z fc certainly does deliver the \"enjoyable shooting experience\" promised by Shu Suzuki, based on our experience with it. And crucially, that experience is a very different one to the similar Nikon Z50. But no camera is perfect, and not all of the Z fc's design details have received universal approval.",
    "For example, unlike the Nikon Z50, there's no grip on the front of the Nikon Z fc, which makes it less suitable for longer lenses. Why did Nikon decide not to include one? \"There are two reasons for this,' explains Nelson Hau. \"Firstly, even with a lens attached, we believe it would be easier for a user to carry the camera without a grip. This is true especially for the younger generation the Z fc intends to target,\" he says.",
    "\"Secondly, again, size and proportions are important considerations – in order to perfect the aesthetic of a classically-styled camera, we decided not to include a grip\" he adds. While that may be an issue for telephoto fans, it does match the Nikon FM2 (which also lacked a grip to help differentiate it from pro SLRs) and you can also buy a grip accessory for the camera.",
    "It's a similar story with another of the Z fc's neat design touches – the tiny little aperture window on its top plate. This is another fun retro flourish, yet we couldn't help but wish it included more information like battery life. When we asked Shu Suzuki and Nelson Hau about this, they again explained that \"careful consideration was given to every aspect of the design to ensure the Z fc was reminiscent of the FM2, but reimagined for the mirrorless generation.\"",
    "In other words, remakes are a careful balancing act between modern conveniences and remaining faithful to the original – and in what was perhaps a lesson learned from the Nikon Df, the manufacturer has erred on the side of making the Nikon Z fc a modern-day clone of the Nikon FM2. And we're certainly not complaining.",
    "Still, one area where the Nikon Z fc doesn't ape its predecessor is its sensor size –unlike the 35mm full-frame equivalent FM2, it has an APS-C crop sensor. Does this reflect who the Nikon Z fc is aimed at?",
    "\"We think that the camera will appeal to young people, who are its primary intended users, because of the way it can – in general – complement their lifestyles and approach to taking images,' explains Nelson Hau. \"Some of those old enough to remember the Nikon FM2 may feel a certain familiarity about the Z fc's details, including the overall size and proportions, making them feel nostalgic and drive interest in the product,\" he added.",
    "Indeed, the reason why Nikon picked the FM2 as the Z fc's blueprint was because it struck a chord with beginners almost forty years ago. \"In the 1980s many of our core fan base used it [the FM2] as their back-up camera, because of its excellent strength, durability and performance,\" says Nelson Hau.",
    "\"For others it was a great first camera, due to its ease of use and intuitive operation that made it a great teaching tool. We chose to reflect elements of the FM2 with the hope that the Z fc will appeal not only to existing Nikon fans, but also to new and aspiring photographers purchasing their first camera,\" he added.",
    "But what about existing fans who want the Nikon Z fc's charms coupled with the full-frame power of a camera like the Nikon Z6 II? Would Nikon consider making a full-frame version of the Z fc? \"Depending on how the Z fc is received by the market, and on customer demand, we will continue to explore ideas for future models,\" says Nelson Hau. We'll take that as a qualified yes.",
    "We think Nikon has certainly nailed the design and shooting experience of the Nikon Z fc. The only real drawback is the lack of native lenses for its APS-C sensor. The new Nikkor Z 28mm f/2.8 SE lens matches the Z fc's design nicely and is a good lens for portraits. But it's one of only two native Z-series lenses for the camera, with the other being the 16-50mm kit lens.",
    "This was the only real area that Nikon wouldn't be drawn on when chatting to us about the Nikon Z fc – and it does face strong competition from the likes of Fujifilm in this respect. Still, the Z fc will soon get a trio of affordable, manual-focus lenses from TTArtisan (a 50mm f/1.2, 35mm f/1.4 and 17mm f/1.4) and we're hoping more third-party manufacturers might help flesh out its native lens lineup.",
    "Smartphone cameras may still be improving by the day, but two things they can't computationally simulate are heritage and a fun, tactile shooting experience. Or as, Shu Suzuki and Nelson Hau referred to it, the \"joy\" factor of using a camera like the Z fc.",
    "This points to a wider nostalgic trend at the moment not only in our TV show and movie choices, but our tech. Our best record players 2021 list proves people do still love modern tech, but there's something forever appealing about retro styling that isn't going away any time soon.",
    "Here's hoping the Z fc sells half as well as the Nikon FM2 – if only because we might then see the ultimate Nikon mirrorless body for camera nerds, a Nikon Zfp (or 'Fusion Professional') with a full-frame sensor. Until then, the Nikon Z fc will do quite nicely."
  ],
  "headers": {
    "5": "Smart move",
    "9": "Vintage twin",
    "13": "Film star",
    "18": "Losing its grip",
    "23": "History repeating",
    "28": "The glass is greener"
  },
  "links": {
    "Nikon Z fc": "https://www.techradar.com/news/nikon-zfc-release-date-price-specs-and-features",
    "Nikon Df": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/nikon-df-review-1196518/review",
    "Nikon Z50": "https://www.techradar.com/reviews/nikon-z50",
    "Nikon Z6 II": "https://www.techradar.com/reviews/nikon-z6-ii",
    "best record players 2021": "https://www.techradar.com/news/best-turntables"
  }
}