{
  "source": "https://www.techradar.com/news/google-chat-is-finally-getting-this-fundamental-messaging-feature",
  "title": "Google Chat is finally getting this fundamental messaging feature",
  "category": "computing",
  "updated": "2021-10-19T11:52:31Z",
  "author": "joel-khalili",
  "summary": "Mark messages as unread in Google Chat",
  "article": [
    "Google has announced it is pushing out a simple but important new feature for its instant messaging service, Chat.",
    "As per the company’s latest blog post, Google Chat and Spaces (the group chat equivalent) will soon benefit from the ability to mark messages as read or unread, on both mobile and desktop.",
    "“Marking a message as unread can help remind you to return to it later in Chat. In 1:1 and group DMs, you can mark a thread as unread starting from a particular message,” wrote Google.",
    "To access the functionality, users can hover over a relevant message and select the dedicated “mark as unread” button from the pop-up menu.",
    "The new feature is rolling out incrementally, but should be available to all Google account holders by early November.",
    "Although Google has invested plenty of energy and resources into its Workspace suite since the start of the pandemic, the company’s messaging service has lagged behind the competition in more ways than one.",
    "With the ability to mark messages as unread, Google is at least addressing one of the insufficiencies separating Chat from the likes of Slack and Teams. But the company still has a long way to go.",
    "Although the Google Chat progressive web app (PWA) offers more flexibility and functionality than the old browser extension, it’s not as slick as the native clients offered by other services on the market.",
    "Further, while Google has worked to deliver new synergies between Chat and its other products (Drive, Meet, Calendar etc.), the service does not benefit from a deep range of third-party integrations in the same way others do.",
    "That said, the signs suggest Google is aware of these kinds of shortcomings. Last week, for instance, the firm announced it will increase its investment in the Workspace app marketplace, with a view to helping customers squeeze more value from its productivity software."
  ],
  "headers": {
    "5": "Google Chat upgrade"
  },
  "links": {
    "instant messaging": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "Chat": "https://www.techradar.com/reviews/google-chat",
    "blog post": "https://workspaceupdates.googleblog.com/2021/10/mark-google-chat-messages-as-unread.html",
    "Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "browser": "https://www.techradar.com/best/browser",
    "Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Calendar": "https://www.techradar.com/reviews/google-calendar",
    "Last week": "https://www.techradar.com/news/google-has-a-cunning-plan-to-dethrone-microsoft-365",
    "productivity software": "https://www.techradar.com/best/best-productivity-apps"
  }
}