{
  "source": "https://www.techradar.com/news/the-best-siri-easter-eggs-how-apples-voice-assistant-can-entertain-you",
  "title": "The best Siri Easter eggs: how Apple’s voice assistant can entertain you",
  "category": "smart-home",
  "updated": "2021-09-25T07:00:00Z",
  "author": "carrie-marshall",
  "summary": "Hey, Siri! What Easter eggs are you hiding?",
  "article": [
    "For many of us, Apple’s voice assistant Siri has become an integral part of everyday life. Whether you want to know if you need to take an umbrella on your walk to work, want it to play DJ by starting your favorite playlist on your HomePod, or even set reminders and timers, just ask.",
    "While Apple’s voice assistant may have started life on iPhone, it can now to be found in Apple’s whole range of devices including iPads, Macs, HomePod speakers, and the Apple TV streaming device, Apple TV, further expanding what Siri can do. For example, with Siri on Apple TV you can control your smart home devices, such as changing the color your smart lights illuminate and even seeing a live feed from your video doorbell on the TV when it's been pressed.",
    "Sometimes it’s nice to have a bit of fun, and Siri can help here too. There are lots of Easter eggs in Siri’s code that are there for no other reason than to make you smile. Here are some of our favorites, although there are plenty more for you to discover.",
    "Read on to discover some of Siri's best Easter eggs, or if you want to get Appple's voice assistant in your life now, check out the best prices for the latest Apple devices with the voice assistant built in.",
    "Siri’s pretty good at controlling your music, but it can also amuse you with some fun musical in-jokes. If you tell Siri that “I see a silhouetto of a man” you’ll be treated to a spoken word version of Bohemian Rhapsody.",
    "Ask “Hey Siri, can you rap?”, and Siri will provide a funny demonstration, although Apple’s voice assistant won’t be winning a Grammy for its efforts anytime soon. if you say “Hey Siri, sing for me” you’ll discover that Siri isn’t as confident as you might expect. Our favorite is to ask “Hey Siri, beatbox for me”, which Siri responds to with audible delight.",
    "Siri can also tell you “What does the fox say?”, “how many roads must a man walk down before you can call him a man?” or “where is Elvis Presley?” but if you ask them “who let the dogs out?” you’ll get a somewhat huffier response.",
    "Siri loves TV and movies, so it’s hardly surprising to discover a host of Easter eggs dedicated to famous shows and films. Siri will happily respond to famous movie lines such as “Hey Siri, I am your father”, “Hey Siri, beam me up Scotty” or “Hey Siri, open the pod bay door”, and you can also ask Siri “what is your favorite movie?”.",
    "Some of the responses are more mischievous: try asking “Hey Siri, is Jon Snow alive?”, “are you HER?”, “Is Winter coming?” or “Hey Siri, can I name you Jarvis?”; you’ll also get interesting responses to “Hey Siri, cease all motor functions” or “Hey Siri, find me directions to Mordor”.",
    "There are many more: try “supercalifragilisticexpialidocious”, “mirror mirror on the wall, who is the fairest one of all?”, “will you be my thunder buddy?” or “blue pill or red pill?” to see if Siri is part of The Matrix.",
    "Some of Siri’s responses are seasonal, so for example you can ask “What should I go as for Halloween?” There are a few festive Easter eggs dedicated to Christmas too: you can ask Siri “Where does Santa live?” and no matter what time of year, say “wish me a Merry Christmas” to get a seasonally appropriate response. If you’re feeling brave you could ask Siri to “kiss me underneath the mistletoe”, but don’t worry: if the kids ask “does Santa exist?” Siri isn’t going to spill any secrets.",
    "Siri is very well-read, and likes a good literary gag: if you ask “tell me a story” you’ll get a very different take on a famous fairy tale, and if you ask “what’s the meaning of life?” there’s a 50/50 chance of getting some wisdom or getting a book joke. It’s fun to ask “Hey Siri, do you follow the three laws of robotics?” if you’re a Sci-Fi fan, and if you’re a fan of the Hitch-hiker’s Guide To The Galaxy, say to Siri: “read me a poem” and “make sure you know where your towel is”. Siri will also respond to “do you like green eggs and ham?”",
    "Apple’s engineers have packed Siri with tech jokes, references and self-deprecating humor, and you can have fun by saying things like “Hey Siri, OK Google”, “Apple or PC?” or “Who is the best assistant?”. On a Mac, ask Siri “What is the best computer?”",
    "There are plenty of others to try, including “testing, 1, 2, 3”, “what is zero divided by zero?”, “do you have any pets?” and “what do you think about the Google assistant?”",
    "Siri can even help with your love life: ask “What’s your best pick-up line?” and Siri can offer several suggestions.",
    "Most digital assistants can tell a few really bad jokes, and Siri is no exception. Try “knock knock”, “tell me a joke”, “why did the chicken cross the road?” or “Hey Siri, talk dirty to me” for some groan-inducing responses, or ask “how much wood could a woodchuck chuck if a woodchuck could chuck wood?” for something more surprising.",
    "Siri isn’t just here for the little things. You can ask the big questions too. Questions like “Will pigs fly?” or “hey Siri, can I borrow some money?”. You can ask for advice, such as “what should I wear today?” or “what music should I listen to??” There are some limits, though: Siri isn’t impressed if you say “I need to hide a body.”",
    "There are many more. Siri can answer “why is the sky blue?”, “when will Hell freeze over?” and even “what’s your favorite animal?”, and you can also ask “if a tree falls in the woods and no-one is around, does it make a sound?” to get a surprisingly sensible response.",
    "We’re not sure what this says about Apple customers, but a lot of Siri’s snappy responses are for romantic and/or personal questions such as “what do you look like?”, “what are you doing later?”, “what are you wearing?”, “do you have a girlfriend?” and “will you marry me?”. You can ask Siri how old they are, if they ever sleep, whether they like cats, how much they cost or how tall they are, and it’s always nice to ask “how are you?”"
  ],
  "headers": {
    "4": "Siri’s musical Easter eggs",
    "7": "TV tropes and movie moments: Siri’s TV and film Easter eggs",
    "10": "Halloweeen and holidays: will Siri kiss you underneath the mistletoe?",
    "11": "Do it by the books: Siri’s literary Easter eggs",
    "12": "Get your geek on: Siri’s tech jokes and references",
    "15": "Knock knock, who’s there? It’s Siri, with some bad jokes",
    "16": "Will pigs ever fly, and other big questions you can ask Siri to answer"
  },
  "links": {
    "iPhone": "https://www.techradar.com/reviews/iphone-13",
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "video doorbell": "https://www.techradar.com/best/best-video-doorbells"
  }
}