{
  "source": "https://www.techradar.com/news/intel-core-i9-12900k-leak-shows-an-overclocked-cpu-that-could-seriously-worry-amd",
  "title": "Intel Core i9-12900K leak shows an overclocked CPU that could seriously worry AMD",
  "category": "computing",
  "updated": "2021-10-20T12:13:39Z",
  "author": "darren-allan",
  "summary": "Apparently this is the finished CPU overclocked to 5.2GHz on the performance cores",
  "article": [
    "Intel’s Core i9-12900K, the incoming Alder Lake flagship which could be revealed next week, has been spotted in yet another leaked benchmark, this time showing how competitive the finished product will supposedly be with rival AMD silicon.",
    "According to the leaker who brought this CPU-Z benchmark into the spotlight, namely HXL on Twitter, this is the Core i9-12900K retail version which has been run through its paces on Bilibili, with an overclock applied across all performance cores (but not the low-power efficiency ones).",
    "The performance cores have been overclocked to 5.2GHz, as noted (up from a default all-core boost which is supposedly 5GHz), and the results compared to the Ryzen 9 5950X. Intel’s chip – salt to hand, as ever – recorded a single-thread result of 851, compared to 648 for the Ryzen 5950X, meaning Team Blue was 31% faster here.",
    "For multi-threaded, the 12900K managed 11,987, just edging out the Ryzen CPU which hit 11,906 (a less than 1% advantage, but still technically a win for Intel).",
    "Apparently the Core i9-12900K slurped some 330W of power while overclocked to this level, although we only have the original benchmark maker’s word for that, with no actual evidence of power consumption provided (only the CPU-Z results were shared as a screen grab).",
    "Okay, so CPU-Z is not the best way of benchmarking the abilities of a processor, and we should take this result – and the possibility that it may not be genuine – with a great deal of caution. But what it does offer is an interesting point of comparison between the (purported) finished 12900K, and engineering samples which have been used in leaked benchmarks in the past.",
    "In a previous such CPU-Z leak, the sample 12900K easily beat the 5950X in single-thread as you might expect, but in multi-threaded the AMD chip was 3% faster. In this new benchmark, the Intel CPU just edges it, and to beat the 32-thread Ryzen 5950X – remembering that the 12900K only has 24-threads – is quite an achievement.",
    "Yes, 3% isn’t a huge difference, and yes, the Intel processor is overclocked as observed, but this is still another positive hint of what we might expect from the finished Core i9-12900K. Of course, further bear in mind that not only is this all unofficial pre-release benchmarking, but we know nothing about the comparative systems used (though we do know that DDR4 RAM was employed in the previous CPU-Z benchmark mentioned above where Ryzen wins in multi-threaded).",
    "What’s perhaps the clearest signal of all, though, is that suggestions that Alder Lake will be a seriously good performer keep leaking out, and that consistency is something to get excited about (or worried about if you’re AMD, naturally, particularly when the 12th-gen chip’s synergy with Windows 11 is brought into play).",
    "Via VideoCardz"
  ],
  "headers": {
    "5": "Analysis: Compare and contrast – but with caution"
  },
  "links": {
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "could be revealed next week": "https://www.techradar.com/news/new-intel-alder-lake-rumor-suggests-cpu-launch-is-imminent",
    "Bilibili": "https://t.bilibili.com/583591531888281277?tab=2",
    "Ryzen 9 5950X": "https://www.techradar.com/news/amd-ryzen-5000",
    "In a previous such CPU-Z leak": "https://www.techradar.com/news/intel-core-i9-12900k-cpu-leak-suggests-it-could-be-a-ryzen-5950x-killer",
    "suggestions that Alder Lake": "https://www.techradar.com/news/intel-alder-lake-benchmark-gives-first-look-at-impressive-core-i9-12900-performance",
    "seriously good performer": "https://www.techradar.com/news/intel-core-i9-12900k-benchmark-could-be-most-worrying-alder-lake-leak-for-amd-yet",
    "leaking out": "https://www.techradar.com/news/intel-alder-lake-leak-shows-a-flagship-cpu-that-could-be-an-amd-ryzen-5950x-killer",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "VideoCardz": "https://videocardz.com/newz/intel-core-i9-12900k-overclocked-to-5-2-ghz-on-all-performance-cores-reportedly-consumes-330w-of-power"
  }
}