{
  "source": "https://www.techradar.com/news/microsoft-teams-update-gives-you-absolutely-nowhere-to-hide",
  "title": "Microsoft Teams update gives you absolutely nowhere to hide",
  "category": "computing",
  "updated": "2021-06-17T10:27:00Z",
  "author": "joel-khalili",
  "summary": "Step aside Zoom, Microsoft Teams has the largest gallery view in the land",
  "article": [
    "Microsoft is readying a new feature for collaboration platform Teams that will scale video conferencing sessions to new heights.",
    "In the latest preview build for desktop, the Microsoft Teams gallery view has effectively doubled in size, from a maximum of 49 on-screen participants to a whopping 98.",
    "To ensure video feeds remain legible, the new layout mode does not allow all 98 attendees to appear on screen at once, but rather splits them into two 7x7 grids that users can snap between.",
    "The upgrade is currently available in early access on Windows and macOS, but should be pushed out with a full public build in the near future, barring any hiccups in testing.",
    "Although the new Teams mode will likely only be useful in a handful of scenarios - during a company all-hands, for instance - it’s certainly an impressive spectacle and could serve to reignite the video conferencing arms race, which has fizzled of late.",
    "During the early months of the pandemic, competition between Microsoft and Zoom was fierce, as both companies rushed to secure new business and roll out functionality to help companies transition to remote working.",
    "As is common in the software space, the rival firms took inspiration and borrowed new features from one another, which has resulted in almost identical feature sets where video calling is concerned.",
    "However, Microsoft has laid down the gauntlet once more with the new Teams gallery view, which now offers a greater number of video feeds than Zoom by a factor of two.",
    "TechRadar Pro has asked for clarification as to whether the two 7x7 grids can be split across screens, if the user is running a dual-monitor setup.",
    "Via OnMSFT"
  ],
  "headers": {
    "4": "Microsoft Teams gallery view"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "OnMSFT": "https://www.onmsft.com/news/microsoft-teams-meetings-chat-bubbles-expanded-large-gallery-view"
  }
}