{
  "source": "https://www.techradar.com/news/lg-rollable-patent-may-have-revealed-the-phones-second-screen-and-more",
  "title": "LG Rollable patent may have revealed the phone’s second screen and more",
  "category": "phones",
  "updated": "2021-02-09T11:49:27Z",
  "author": "rhys-wood",
  "summary": "LG’s on a roll with these promising details",
  "article": [
    "LG has been granted a new patent for a rollable smartphone, which appears to reveal new details about the LG Rollable phone that the company is currently developing.",
    "From what we know currently, the LG Rollable will feature a rolling screen rather than a foldable screen like we’ve seen from competitors like Samsung and Huawei. The idea behind this is to prevent creasing of the screen when stored away for lengthy periods of time.",
    "The patent gives us a glimpse of some other key details about the device that weren’t previously known, including its dual display. As well as the main rollable display, the LG Rollable could feature a more general purpose display on the back of the phone so you won’t always need to unfurl it to answer a phone call or do some other tasks.",
    "The rollable display will be able to automatically unravel thanks to a motorized mechanism inside the phone. Looking at the patent, we can see that the smaller screen on the back of the device wraps around the camera. The camera itself looks to take up a decent chunk of real estate away from the screen, though.",
    "Interestingly, there are no physical buttons in any of the patent’s imagery. It’s unlikely the final device will be missing those buttons, though.",
    "The camera module shown off in the patent has three lenses. This is a clear update to patents for the LG Rollable we’ve seen in the past, where no cameras were visible at all.",
    "There’s no guarantee that this patent will be reflective of the final product we see for the LG Rollable, but it seems likely that this is a similar phone, so we’re likely to see at least some implementation of this tech in the final product.",
    "So far, reports have suggested that the LG Rollable will be released in March 2021, with impressive specs such as a 7.4-inch screen when fully rolled out, offering a 1600 x 2428 resolution, as well as a Qualcomm Snapdragon 888 chipset and 16GB of RAM.",
    "All this great tech certainly won’t come cheap, though. One source claims the device will cost an eye-watering $2,359 (about £1,750, AU$3,000), so here’s hoping that early adopters get good value for that price tag."
  ],
  "headers": {
    "3": "So how will it work?"
  },
  "links": {
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "currently developing": "https://www.techradar.com/news/lg-rollable-teased-as-the-first-phone-with-a-rollable-screen",
    "reports have suggested": "https://www.techradar.com/news/lg-rollable-could-launch-earlier-than-we-expected-heres-why"
  }
}