{
  "source": "https://www.techradar.com/news/another-publisher-regrets-not-using-smart-delivery-wont-make-same-mistakes-again",
  "title": "Another publisher regrets not using Smart Delivery, but won’t make same mistake again",
  "category": "gaming",
  "updated": "2021-09-06T09:12:48Z",
  "author": "hamish-hector",
  "summary": "Free next-gen upgrades for all?",
  "article": [
    "Control was one of the best games from the PS4 and Xbox One era of consoles, but when next-gen hardware arrived at the end of 2020 Control tripped at the last hurdle by not offering a free PS5 and Xbox Series X upgrade to all players.",
    "Publisher 505 Games has now acknowledged that its next-gen upgrade plans for Control missed the mark, and it won’t be repeating its mistakes with future games.",
    "For those that don’t remember, Control players only received a free next-gen upgrade of the game if they had purchased Control Ultimate Edition (which launched later and combined the main game with its DLC into one package). This meant players who owned the Standard Edition of Control would but stuck with the older generation’s graphics quality and performance unless they bought the game all over again.",
    "Speaking with GamesIndustry.biz, publisher 505 Games president Neil Ralley explained that certain “blockers meant that at least one group of players ended up being left out of the upgrade for various reasons.” While Ralley doesn’t offer details on what those blockers were, he added “We made certain decisions [that] restricted how we could perform Smart Delivery for the next-gen version of Control. They were the correct decisions at the time, but they created those blockers.”",
    "“We learnt a lot from that. Did we as a publisher handle it in the best way and communicate it in the best way to the audience? Maybe not. But we did our best to satisfy consumers... Moving forwards, we will be able to do this in a much better way.”",
    "Ralley stops short of promising free next-gen upgrades on 505 Games' future lineup of games, but we're sure it'll be paying closer attention to what fans expect going forward.",
    "505 Games isn't the only company noticing the player upset. Much to the disappointment of fans – us included – last week Sony announced that Horizon Forbidden West’s PS4 version wouldn’t upgrade to the PS5 version for free unless you bought the more expensive Digital Deluxe, Collector’s, or Regalla Editions of the game.",
    "However, Sony has now backtracked on that decision and will offer the Horizon Forbidden West upgrade for free. It adds that future PlayStation first-party exclusive cross-gen titles like God of War: Ragnarok can be upgraded from PS4 to PS5 for a $10 digital payment.",
    "This approach to next-gen upgrades is definitely better than Sony’s original plan, but it’s hard to argue that a paid next-gen enhancement is preferable to the free Smart Delivery next-gen upgrade offered by Xbox with its games. This is on top of the savings Xbox is already offering its players with services like Game Pass Ultimate.",
    "We’ll have to see which strategy wins out in the long run, but players will be sure to let us and publishers know how they feel about the situation every step of the way."
  ],
  "headers": {
    "6": "Analysis: Smart Delivery is the smartest option"
  },
  "links": {
    "Control": "https://www.techradar.com/reviews/control-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "GamesIndustry.biz": "https://www.gamesindustry.biz/articles/2021-09-03-from-cooking-mama-to-control-the-rise-of-505-games",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Horizon Forbidden West upgrade for free": "https://www.techradar.com/news/sony-backtracks-horizon-forbidden-west-ps5-upgrade-which-will-now-be-free",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate"
  }
}