{
  "source": "https://www.techradar.com/news/google-fi-vpn-now-available-on-iphones",
  "title": "Google Fi VPN now available on iPhones",
  "category": "computing",
  "updated": "2021-08-23T18:12:30Z",
  "author": "anthony-spadafora",
  "summary": "iOS users can now enable Google Fi's built-in VPN",
  "article": [
    "iPhone users looking to further protect their privacy online are in luck as Google Fi VPN is now widely available for customer's on the company's MVNO network.",
    "The search giant's MVNO has long offered a built-in VPN service for customers using Android smartphones but those with Apple devices were unable to use this feature until now.",
    "While Google had originally said that Google Fi VPN would begin rolling out to iPhone users this spring, the rollout has gone a bit slower than expected.",
    "As reported by 9to5Mac, Google Fi VPN is now rolling out to iPhone users after being delayed and once updated, a new “Privacy & security” section will be available under Phone Settings in the Google Fi companion app.",
    "In order to turn on the service's VPN, users will need to toggle on the “Protect your online activity” setting at the top of the “Privacy & security” tab. From here, a dialog box explains that users need to tap “Allow” on the system-level prompt so that Fi can add VPN Configurations. You'll also need to use Touch ID or Face ID to confirm this new VPN Configuration.",
    "Now that Google Fi VPN has been configured on your iPhone, you'll see a VPN icon in the status bar and will be able to enable or disable the service either from the app itself or by going to Settings > General > VPN.",
    "For those who interested in signing up for Google Fi, the service offers an Unlimited for 1 plan for $70 per month as well as a Flexible for 1 plan for $20 per month though both plans come with a built-in VPN.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "Google Fi VPN on iPhone"
  },
  "links": {
    "Google Fi VPN": "https://www.techradar.com/news/google-fi-vpn-is-finally-rolling-out-to-iphones",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "reported": "https://9to5google.com/2021/08/21/google-fi-vpn-iphone/",
    "companion app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8945152495655624000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fgoogle-fi%2Fid1413936031%3Firgwc%3D1%26aosid%3Dp239%26cid%3Daos-us-aff-ir%26irchannel%3D13631%26irpid%3D221109%26clickid%3DXxswTMVG9xyLWthSdgSDKTDJUkBWqP3xRwaLwE0%26ircid%3D7613",
    "VPN Configurations": "https://www.techradar.com/vpn/how-to-download-set-up-and-install-a-vpn-on-iphone",
    "Unlimited for 1 plan": "https://fi.google.com/about/plans?utm_medium=paid_social&utm_source=twitter&utm_campaign=privacy_security&utm_content=20210623_privacy_iosvpn",
    "Flexible for 1 plan": "https://fi.google.com/about/plans?utm_medium=paid_social&utm_source=twitter&utm_campaign=privacy_security&utm_content=20210623_privacy_iosvpn",
    "9to5Google": "https://9to5google.com/2021/08/21/google-fi-vpn-iphone/"
  }
}