{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-disney-plus-and-more-this-weekend-september-4-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, Disney Plus and more this weekend",
  "category": "entertainment",
  "updated": "2021-09-03T14:00:18Z",
  "author": "axel-metz",
  "summary": "Here’s what’s dropping on streamers this weekend",
  "article": [
    "In these bleak pandemic times, there’s been a distinct lack of triple-A TV shows on hand to abate our cabin fever, with the likes of Stranger Things season 4, Succession season 3 and Sex Education season 3 all getting pushed back due to Covid-related production delays.",
    "Sure, Disney Plus rode in with some original Marvel adventures along the way (we ranked them, if you’re interested), but they didn’t quite provide that same rush of excitement as the return of a flagship series.",
    "Thankfully, the era of pandemic-hampered TV looks to be (finally) coming to an end, and this weekend Money Heist season 5 hits Netflix to quench our thirst for big-budget drama.",
    "Below, we round up seven of the biggest new arrivals coming to the likes of Amazon Prime Video, Disney Plus and Hulu over the next few days, and explain where to watch them in the US and UK.",
    "Mega-popular Spanish drama series Money Heist (or La Casa De Papel, if we’re being particular) returns to Netflix this weekend for its fifth and final season, which is being split into two volumes (the second is arriving on December 3).",
    "The show – which quickly became the most-viewed non-English TV series on Netflix – picks up directly after the events of previous episodes, with the bank-robbing gang having been shut inside the Bank of Spain for over 100 hours.",
    "Álex Pina, the show’s creator, has said the decision to split the show down the middle was based on a desire to ensure season 5 lives up to fans' expectations of a finale, so expect a bullet-ridden fiesta from the get-go.",
    "Now available to stream on Netflix",
    "Ah, Cinderella, the most famous fairy tale ever told – and told it has been, many, many times. So how do you breathe new life into a centuries-old story which has already been turned into countless books, movies, TV shows and musicals? You cast James Corden as an anthropomorphic mouse, of course!",
    "In this Amazon adaptation of the classic tale, pop star Camilla Cabello stars in the titular role as an ambitious young dressmaker with dreams of making it big, while the ever-charismatic Billy Porter is on hand as Cinderella’s fairy godmother (or Fab G, in this case).",
    "Pierce Brosnan and Idina Menzel also star in this part-musical movie, so there may actually be some fun original songs, after all. Just don’t expect it to reinvent the wheel.",
    "Now available to stream on Amazon Prime Video",
    "Ahead of the 20th anniversary of the September 11th attacks, Worth arrives on Netflix to tell the untold true story of the 9/11 Victim Compensation Fund, which sought to reimburse those families affected by the tragedy – though not on equal terms.",
    "Michael Keaton stars as Kenneth Feinberg, head of the operation, alongside Stanley Tucci and Amy Ryan, with the team behind Spotlight and 12 Years a Slave on hand as producers.",
    "Early reviews have been largely positive on this timely drama, which debuted at Sundance earlier this year, so expect emotional boardroom bust-ups and vintage Keaton.",
    "Now available to stream on Netflix",
    "Like Monsters at Work before it, Dug Days lands on Disney Plus as the latest spin-off show based on a classic Pixar adventure. This time, it’s Up that gets the episodic treatment, turning to the mishaps of talking (and squirrel-loving) golden retriever Dug.",
    "Carl and Russell are back, too, while the original movie’s co-writer and co-director, Bob Peterson (who also provides the voice of Dug), writes and directs. Don’t expect much opening-sequence-level emotion from this limited series – which is available to stream in its four-episode entirety today – but Dug Days looks to be a fun, if entirely unexpected, reintroduction to some beloved Pixar characters.",
    "Incidentally, Ed Asner, the voice of Carl in this show and Up, passed away only last week, so this series’ arrival seems a fitting tribute.",
    "Now available to stream on Disney Plus",
    "After Billions’ fifth season came to an abrupt end following a pandemic-driven halt in production, the question of when its final five episodes would air hung on fans’ lips for months.",
    "This weekend, though, Damien Lewis' hedge fund magnate Bobby Axelrod and Paul Giamatti's powerful attorney Chuck Rhoades once again return to screens in this New York-based drama.",
    "Episodes eight to 12 are streaming every Sunday until October on Showtime in the US, while UK viewers can expect the new season to appear on Sky Atlantic in the coming weeks.",
    "Now available to stream on Showtime On Demand in the US",
    "Naturally, we had to include a new superhero adventure on this week’s list, and Q-Force lands on Netflix to mix up the comic book formula by introducing a rogue team of LGBTQ+ heroes known as – you guessed it – the Q-Force.",
    "In development since 2019, this animated comedy series was created by Gabe Liedman – a writer on Kroll Show, Brooklyn Nine-Nine, Broad City and PEN15 – and stars the assorted voices of David Harbour, Gary Cole, Laurie Metcalf, Patti Harrison, Matt Rogers, Wanda Sykes and more.",
    "The animation style looks pretty cool on this one, too, so Q-Force is definitely one to check out if you’re into your butt-kicking secret agents.",
    "Now available to stream on Netflix",
    "Jemaine Clement’s mockumentary comedy horror series (which is based on the 2014 film of the same name) returns this weekend for its third season, continuing the misadventures of several flat-sharing vampires in Staten Island.",
    "Series mainstays Kayvan Novak, Matt Berry, Natasia Demetriou, Harvey Guillén and Mark Proksch all return for season 3’s 10-episode run, while a fourth season has already been ordered.",
    "New episodes will air on FX every Thursday, before dropping on Hulu the following day. UK viewers, fear not – we expect this one to land on BBC iPlayer sometime soon.",
    "Now available to stream on Hulu"
  ],
  "headers": {
    "4": "Money Heist Part 5 Volume 1 (Netflix)",
    "8": "Cinderella (Amazon Prime Video)",
    "12": "Worth (Netflix)",
    "16": "Dug Days (Disney Plus)",
    "20": "Billions season 5 part 2 (Showtime)",
    "24": "Q-Force (Netflix)",
    "28": "What We Do in the Shadows season 3 (Hulu)"
  },
  "links": {
    "Stranger Things season 4": "https://www.techradar.com/news/stranger-things-season-4",
    "Succession season 3": "https://www.techradar.com/news/succession-season-3",
    "Sex Education season 3": "https://www.techradar.com/news/sex-education-season-3-finally-has-a-release-date-netflix-confirms",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "ranked them": "https://www.techradar.com/news/now-loki-has-ended-lets-rank-the-marvel-disney-plus-shows-so-far"
  }
}