{
  "source": "https://www.techradar.com/news/nzxt-launches-h510-flow-case-and-white-kraken-cpu-coolers",
  "title": "NZXT Launches H510 Flow Case and white Kraken CPU coolers",
  "category": "computing",
  "updated": "2021-09-24T16:45:29Z",
  "author": "jess-weatherbed",
  "summary": "These new white components look seriously 'cool'",
  "article": [
    "NZXT, a popular manufacturer of PC components and accessories, has dropped a fresh batch of new products this week, including the highly anticipated H510 Flow case.",
    "This isn't the first PC case that NZXT has introduced, but particular attention has been paid to maximize airflow and community feedback was used to design it. The H510 Flow is customizable to accommodate a range of different motherboard sizes, has a tempered glass side panel, and will be available for $109.99 (around £80 / AU$150) amongst other features.",
    "NZXT Claims you can expect the following from the H510 Flow:",
    "This 'Make A Splash' campaign also introduces high-performance AER series fans in both 120mm and 140mm sizes, plastered with plenty of RGB trim. You can pick both the case and fans up in either white or black to suit your personal build.",
    "Among the introduction of white-themed products is an update that NZXT fans have been asking for since the release of the iconic Kraken AIO series of CPU coolers. The full size spectrum of both the Kraken X (featuring a branded infinity mirror) and the Kraken Z (that instead features a fully customizable display) series are now available in white, from the radiator through to the tubing.",
    "NZXT claim's that it's \"taking the challenge out of achieving an all-white build. This family of white cooling products came directly from community feedback, allowing users to express themselves by giving them more options for the ideal build.\"",
    "This means that fans of the NZXT Kraken AIO products won't need to modify the product themselves to suit an all-white PC build as many have done in the past. Modifying PC components isn't new, and in some cases can be considerably easier than you think, but doing so will almost certainly void the manufacturer's warranty."
  ],
  "headers": {
    "2": "Go with the Flow",
    "3": "Blinded by the white"
  },
  "links": {
    "H510 Flow case": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1136484152111456800&xs=1&url=https%3A%2F%2Fnzxt.com%2Fproduct%2Fh510-flow&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnzxt-launches-h510-flow-case-and-white-kraken-cpu-coolers",
    "Make A Splash": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1098119640141312900&xs=1&url=https%3A%2F%2Fnzxt.com%2Fcollection%2Fmake-a-splash&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnzxt-launches-h510-flow-case-and-white-kraken-cpu-coolers",
    "CPU coolers": "https://www.techradar.com/news/best-cpu-coolers",
    "Kraken X": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2857459358572084000&xs=1&url=https%3A%2F%2Fnzxt.com%2Fcollection%2Fkraken-x&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnzxt-launches-h510-flow-case-and-white-kraken-cpu-coolers",
    "Kraken Z": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3615659778463181300&xs=1&url=https%3A%2F%2Fnzxt.com%2Fcollection%2Fkraken-z&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnzxt-launches-h510-flow-case-and-white-kraken-cpu-coolers"
  }
}