{
  "source": "https://www.techradar.com/news/another-iphone-13-leak-points-to-in-screen-touch-id-and-a-smaller-notch",
  "title": "Another iPhone 13 leak points to in-screen Touch ID and a smaller notch",
  "category": "phones",
  "updated": "2021-03-14T10:30:42Z",
  "author": "david-nield",
  "summary": "The old tech returning in a new form?",
  "article": [
    "The iPhone 13 is starting to come into view, and the latest updates from the rumor mill add extra weight to some of the speculation we've been hearing so far – that the phone will feature an in-screen Touch ID sensor as well as a smaller display notch.",
    "That's according to industry analysts speaking to representatives from inside Apple's supply chain, via MacRumors. Analyst predictions aren't always right, but in the past they've usually been pretty accurate when it comes to plotting future Apple moves.",
    "The 2017 iPhone X was the first iPhone flagship to do away with the Touch ID fingerprint sensor, though it is still used on Apple handsets such as the iPhone SE. It now looks as though it's heading back to the premium-level iPhones, in a different form.",
    "Android phones have had in-screen fingerprint sensors for years of course, with varying degrees of speed and reliability, and it would appear that Apple has now got the technology to a level of quality that it feels happy with.",
    "The analysts go on to say that Face ID will still be deployed alongside a Touch ID under the sensor, which backs up previous rumors around the iPhone 13. Users would be able to use facial or fingerprint recognition to get into their handset.",
    "The Face ID system is going to be improved, according to the analysts, allowing the front display notch to be made smaller – and again that's another rumor that's been doing the rounds already. Both developments are now looking likely to happen.",
    "One final note from this particular report is that the LiDAR depth-sensing technology, which helps with background blur in photos and augmented reality apps, will continue to be exclusive to the Pro models – as is the case with the iPhone 12 series.",
    "The iPhone 13 should be launching around September time, and there has been plenty of chatter around what to expect when the time comes. The new phone is said to be getting improvements in ultrawide photography, battery life, screen refresh rates, and more."
  ],
  "headers": {
    "4": "The countdown has begun"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "MacRumors": "https://www.macrumors.com/2021/03/12/iphone-13-touch-id-under-display/",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "previous rumors": "https://www.techradar.com/news/iphone-13-could-feature-in-screen-face-id-or-touch-id-unlock",
    "doing the rounds": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "ultrawide photography": "https://www.techradar.com/news/iphone-13-pro-cameras-may-take-even-sharper-ultra-wide-photos-than-iphone-12-pro",
    "battery life": "https://www.techradar.com/news/iphone-13-leak-says-battery-life-will-be-better",
    "screen refresh rates": "https://www.techradar.com/news/iphone-13-might-have-the-highest-refresh-rate-of-any-phone"
  }
}