{
  "source": "https://www.techradar.com/news/sony-has-two-new-spatial-audio-speakers-for-your-living-room",
  "title": "Sony's new spatial audio speakers pick up where the Apple HomePod left off",
  "category": "audio-visual",
  "updated": "2021-03-23T15:47:57Z",
  "author": "nick-pino",
  "summary": "The Sony SRS-RA5000 and SRS-RA3000 are shipping now",
  "article": [
    "During CES 2021, Sony announced two new spatial audio speakers – the Sony SRS-RA5000 and Sony SRS-RA3000 – that will be the first two speakers with Sony 360 Reality Audio support. Now, those speakers are shipping out to the public.",
    "Starting March 22, you’ll be able to pick up a Sony SRS-RA5000 or Sony SRS-RA3000 on Amazon for $699.99 / £499 (about AU$900) or $299.99 / £299 (about AU$380), respectively.",
    "Beyond having complicated names, the Sony SRS-RA5000 and 3000 have a pretty neat party trick – they’re able to connect to your home Wi-Fi network to stream spatial audio. Specifically, they’re some of the first speakers to stream Sony 360 Reality Audio songs (the Amazon Echo Studio was able to tap into that well first, however) and, in the case of the RA5000, it’s also Hi-Res Audio compatible as well.",
    "The speakers may be pricey, but they’re the only spatial audio speakers on the market outside of the now-discontinued Apple HomePod and Amazon Echo Studio.",
    "In order to tap into Sony’s library of 360 Reality Audio music, you’ll need to have access to Deezer, Tidal or, thanks to a new partnership, Amazon Music HD.",
    "According to Sony, there are currently around 4,000 songs available in Sony 360 Reality Audio from artists like Alicia Keys, Megan Thee Stallion, Noah Cyrus, Zara Larsson, Paloma Faith and more – all of which should be on Amazon Music HD starting on April 6.",
    "The speakers will offer Bluetooth and Wi-Fi functionality; however, due to the limitations of Bluetooth, you’ll need to use the latter if you want to hear songs in Sony’s spatial audio format. Sony says Sony 360 Reality Audio will be available through Chromecast in the future as well, but haven't set a date for it yet.",
    "We'll be anxiously awaiting the speakers to see how they stack up against the two spatial audio speakers out there right now – but, on paper at least, things are looking promising for Sony's long-awaited 360 Reality Audio speakers."
  ],
  "headers": {
    "4": "Sony 360 Reality Audio coming to Amazon Music HD"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Sony SRS-RA5000 and Sony SRS-RA3000": "https://www.techradar.com/news/new-sony-wireless-speaker-boasts-unusual-design-with-an-important-audio-purpose",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review"
  }
}