{
  "source": "https://www.techradar.com/news/google-chrome-update-reinvents-a-classic-web-browser-feature",
  "title": "Google Chrome update reinvents a classic web browser feature",
  "category": "computing",
  "updated": "2021-10-04T10:10:53Z",
  "author": "joel-khalili",
  "summary": "Google wants to modernize the browsing history",
  "article": [
    "Google is working on an experimental new feature for its web browser Chrome that it hopes will make locating specific pieces of information much simpler.",
    "According to a new blog post, members of the Chrome early-access program will soon get the chance to try out a feature called Journeys, which divides up the browsing history into a series of different topics.",
    "For example, if someone has been reading around the topic of artificial intelligence over multiple sessions, Chrome will cluster all this material together in a dedicated panel under History. This way, Google says, it will be much easier for users to pick up where they left off.",
    "Currently, journeys are based on activity data from a single device. However, depending on how well the feature is received, Google says it may allow users to access their journeys across multiple devices in future.",
    "With this latest experiment, Google is attempting to modernize the concept of browsing history, a feature that has become less and less helpful as the time people spend on the web has increased. As a result of the rise of SaaS and remote working, for example, many of us are visiting more web pages than ever before, which has made locating specific activity data a hassle.",
    "As explained in the blog post, the company is also thinking closely about how it can introduce functionality that better aligns with the way people move through the internet, almost always in an organic and unstructured fashion.",
    "“When you’re looking for a certain piece of information or working on a project, your path through the internet likely isn’t a linear one,” explained Yana Yushkina, Product Manager for Chrome.",
    "“You might search for the same thing multiple times, jump between pages, head back to Google Search again, or parse through your history for that one page you can’t seem to find again. It can be challenging, and more importantly, it can take up time you could be using to get things done.”",
    "However, the new Journeys feature ensures specific information is always readily available, without the user having to trawl through their bloated browsing history.",
    "The feature is currently undergoing testing in the Chrome Canary channel and the company has not set out a timeline for its introduction to a full public build, so regular users will have to exercise patience for now."
  ],
  "headers": {
    "4": "Modernizing the web browser"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "blog post": "https://blog.chromium.org/2021/10/helping-users-explore-web-and-continue.html",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}