{
  "source": "https://www.techradar.com/news/ford-mustang-mach-e-gt-first-drive",
  "title": "The Ford Mustang Mach-E GT is a fantastic and sporty battery-electric crossover",
  "category": "car-tech",
  "updated": "2021-10-19T10:56:21Z",
  "author": "myriam-joire",
  "summary": "Giving the Model Y Performance a run for its money",
  "article": [
    "By all accounts - including our own review - Ford’s Mustang Mach-E is the only battery-electric crossover on the market today that can truly give Tesla's best-selling Model Y a run for the money.",
    "And now there’s a new, faster pony in town: Ford’s Mustang Mach-E GT. It competes directly with Tesla’s speedy Model Y Performance and brings more power and torque to the table, plus upgraded suspension, brakes, and appearance.",
    "So, needless to say, when Ford invited us to drive the Mustang Mach-E GT, we jumped on the opportunity.",
    "We spent a few hours driving both the Mustang Mach-E GT and the GT Performance Edition trims on the winding back roads of Marin County, near San Francisco, and even drove the GT Performance Edition on an autocross course Ford set up for the occasion.",
    "In the US, the Mustang Mach-E GT comes in two trims. The GT trim ($59,900 before incentives) basically inherits most of the features and specs from the Mustang Mach-E Premium with the 91kWh (usable) extended battery and e-AWD system, but gains a larger front motor, 10mm lower ride height, and bigger front and rear brakes.",
    "It’s good for 0-60mph in 3.8 seconds thanks to 480hp (358kW) and 600ft-lb (814Nm) of torque.",
    "Other upgrades include unique 20-inch aluminum wheels with aero covers and P245/45 R20 Continental all-season tires, a bespoke front and rear fascia with an illuminated Mustang logo in front and GT badge in back, and Sport Contour front seats with copper metallic stitching and matching interior accents.",
    "Two options are available: BlueCruise Level 2 ADAS plus a 360-degree view ($1900), and a panoramic fixed glass roof ($1500).",
    "The GT Performance Edition ($64,900 before incentives) takes the GT trim, tunes the larger front motor for even more performance, and adds MagneRide magnetic dampers plus Brembo front brake calipers.",
    "Torque is increased to 634ft-lb (860Nm) for a 0-60mph sprint in 3.5 seconds. It also gains unique 20-inch aluminum wheels with P245/45 R20 Pirelli summer tires, and Ford Performance front seats with silver interior accents.",
    "EPA range is 270mi (434km) for the GT trim, and 260mi (418km) for the GT Performance Edition.",
    "In the UK, the GT trim (£67,225 before incentives) is equivalent to the GT Performance Edition sold in the US, includes the 360-degree view and panoramic fixed glass roof options, accelerates from 0-62mph (0-100km/h) in 3.7 seconds, and boasts a WLTP range of 310-mile (499km). Sadly, the Mustang Mach-E isn’t available in Australia.",
    "Both Mustang Mach-E GT trims feature a 91kWh (usable) battery and support up to 150kW DC fast charging (CCS Combo 1 in the US, and CCS Combo 2 abroad), plus 11kW AC charging.",
    "Ford’s Blue Oval Charge Network aggregates multiple charging networks via the FordPass app and includes plug-and-charge support at Electrify America charging stations, plus smart route planning using topography, weather, and traffic.",
    "Like other Mustang Mach-E models, both GT trims feature a large, center-mounted, volume knob-equipped 15.5-inch portrait touchscreen running Ford’s Sync 4A infotainment system, and a wide but slender 10.2-inch landscape instrument display.",
    "This setup is complemented by a 10-speaker Bang & Olufsen audio system that sounds great and includes Bluetooth and USB audio functionality, along with Sirius-XM satellite radio.",
    "Speaking of which, there are USB Type-C and Type-A ports in both the front and the back, and a pair of Qi wireless charging pads in the center console.",
    "The instrument display isn't configurable but shows the essentials (speed, range, outside temperature, gear selection, and odometer) plus whatever information is pertinent at the time, like navigation directions, seat belt warning, lane-keeping, and BlueCruise status.",
    "We didn't spend much time playing with the Mustang Mach-E GT’s infotainment system since our focus was on driving, but we found it intuitive enough to use - if a little sluggish at times.",
    "It’s a minor niggle, but Sync 4A is definitely less responsive and feature-rich than Tesla’s Netflix-capable infotainment system. Then again, Ford's setup supports both wired and wireless Apple CarPlay and Android Auto.",
    "Ford’s Sync 4A infotainment system also provides LTE connectivity for over-the-air updates and WiFi hotspot functionality. The FordPass app enables vehicle remote control, lets you manage charging, and turns your phone into a key.",
    "Both Mustang Mach-E GT trims also come with Ford’s Co-Pilot360 driver assistance as standard. BlueCruise Level 2 ADAS, self-parking, and a 360-degree view are bundled as a $1,900 option.",
    "Co-Pilot360 includes forward collision warning and automatic emergency braking, blind spot warning and rear traffic alert, lane departure warning and lane keeping assist, front and rear parking sensors, auto high-beams, adaptive cruise control, and traffic sign recognition.",
    "We briefly tried Ford's BlueCruise Level 2 ADAS on the freeway, and while it worked reasonably well, it simply didn't feel as confident as Tesla's Autopilot.",
    "Also, unlike Autopilot, which works pretty much anywhere, BlueCruise is only available on select stretches of freeways and divided highways in North America. That's annoying.",
    "On the plus side, it monitors your gaze, so you don’t have to regularly nudge the wheel as long as you’re watching the road. Regardless, BlueCruise is nothing more than a basic Level 2 ADAS at this point, and Ford still has a lot of catching up to do.",
    "The Mustang Mach-E is a battery-electric crossover, and as the Mustang branding implies, it’s meant to be a sporty vehicle. While we aren’t big fans of crossovers, we think Ford’s done a fine job with the Mustang Mach-E’s design.",
    "The exterior is muscular, and despite being a taller car with four doors, it features lovely coupe-like proportions. It certainly looks better than Tesla’s Model Y. The Mustang styling cues are also a nice touch.",
    "We particularly like the funky front door handles, and the black side mirrors, roof, and rocker panels.",
    "Both Mustang Mach-E GT trims get a bespoke front and rear fascia with a carbon gray grille and illuminated Mustang logo in front, and a GT badge in back, plus unique 20-inch aluminum wheels, for an even sportier appearance.",
    "The interior of the GT trims also carries over from other Mustang Mach-E models, but with different front seats.",
    "On the GT trim, you get a black interior and Sport Contour front seats with copper metallic stitching and matching accents.",
    "The GT Performance Edition also packs a black interior, but with Ford Performance front seats and silver accents. During our drive, we found the seats offered on the GT trim more comfortable and more adjustable than those featured on the GT Performance trim, and the copper accents look fantastic.",
    "The Mustang Mach-E GT’s interior is a nice place to be. We like the interior design, build quality, and materials; the ergonomics, seating position, and visibility are pretty good; and - get this - there are no irritating capacitive buttons anywhere. Yes, we're looking at you, Volkswagen.",
    "The center-mounted, volume knob-equipped 15.5-inch portrait touchscreen is somehow more imposing than the Model Y’s similarly-sized landscape display.",
    "Perhaps it’s because of the way the screen is angled? It’s almost vertical, which feels odd.",
    "The Mustang Mach-E GT is spacious, especially in front. But keep in mind that the three cars we drove came with the panoramic fixed glass roof, a $1,500 option.",
    "Rear passengers might find legroom a little tight when the front seats are positioned all the way back, and rear headroom is somewhat limited because of the sloping roofline.",
    "The Model Y’s back seats are definitely roomier. Storage is plentiful, though, with multiple cubbies (some covered) in the center console, big door pockets, plus a generously-sized frunk with 4.7 cubic feet (139.5 liters) of space.",
    "The trunk features a foot-activated power liftgate and provides 29.7 cubic feet (822 liters) of storage with the 60/40 folding rear seats up, and 59.7 cubic feet (1689 liters) with the rear seats down.",
    "We drove three different Mustang Mach-E GTs. First, we spent two hours driving the GT trim (blue car) on the winding back roads of Marin county.",
    "Second, we took the GT Performance Edition (yellow car) for a spin on similar B-roads for a couple more hours.",
    "Finally, the next day, we drove a GT Performance Edition (red car) for about 15 minutes on an autocross course (four laps) in Alameda, across the bay from San Francisco.",
    "Once you settle into the driver’s seat, you’ll immediately notice that you’re sitting in a crossover. The seating position is definitely higher than in most sporty cars. It’s not really a problem, but it’s worth mentioning.",
    "You’re also reminded that you can’t drive until you press the (anachronistic) start/stop button. Ford should follow Volkswagen and Tesla’s lead here. Powering up the car should be as simple as pressing the brake pedal.",
    "The gear selector is a knob in the center console, which you rotate to select the appropriate gear, and includes a “low” gear (L). More on this later.",
    "Drive modes include Whisper, Engage, and Unbridled. Think of Whisper as the eco or “chill” mode, with little regen braking when lifting off the throttle. Engage is the comfort mode, and provides some regen braking. Unbridled is the sport or performance mode, with more regen braking.",
    "Besides changing the amount of regen braking, these modes also adjust throttle response, steering weight, and - on the GT Performance trim - the stiffness of the MagneRide suspension. While the difference between these drive modes is noticeable, it’s not drastic.",
    "Regardless of the drive mode, there’s a one-pedal driving setting which increases regen braking. Selecting the “low” gear (L) has the same effect.",
    "The propulsion sound setting is interesting if you like fake engine noises. It’s well done, but as long-time EV drivers, we turned it off.",
    "Unbridled also includes an Unbridled Extend setting, which is basically a track mode. It optimizes drivetrain cooling and lowers peak performance slightly for repeated high-performance driving. We used it during our autocross, and our GT Performance car didn’t break a sweat, even after multiple runs.",
    "By default, the Mustang Mach-E GT will creep forward when no pedals are pressed, unless one-pedal driving is enabled. While there’s an auto hold setting in the driver assistance menu, you can’t force auto hold by pressing hard on the brake pedal.",
    "We also noticed that when one-pedal mode is enabled, and you come to a complete stop, then immediately slam the throttle, there’s a brief (but annoying) delay before the car accelerates.",
    "Speaking of acceleration, both Mustang Mach-E GT trims are really fast. That’s not really surprising when you consider the sub-four-second 0-60mph specs.",
    "Still, while this car’s acceleration is impressive, neither GT trim delivers quite the same initial neck-snapping kick as the Model Y Performance. The steering is quick and provides decent feedback (at least for a modern vehicle). We have no complaints here.",
    "Ford’s done an excellent job blending regen and hydraulic braking on the Mustang Mach-E GT. The brakes feel linear and are easy to modulate, even during spirited driving. Suspension tuning is interesting.",
    "Take a look at the Ford Mustang Mach-E GT from all angles in our photo gallery below.",
    "We’re very impressed with the GT trim’s ride. It’s firm enough to be sporty, but compliant enough to soak up bumps - perfect for the kind of curvy, undulating B-roads we drove on. Handling is nimble, thanks to that low center of gravity.",
    "This makes the GT trim an absolute blast to drive. As for the GT Performance Edition, the MagneRide suspension did wonders at the autocross, but we found the ride too harsh and stiff for the winding back roads of Marin County - at least in Unbridled mode.",
    "Engage mode turned things down a notch, making the ride significantly more pleasant. We didn’t notice the GT Performance Edition’s extra torque. Both are just very fast.",
    "Overall, the GT trim is the better choice for a weekend drive in the twisties, while the GT Performance Edition excels on the track.",
    "Day-to-day, there’s no doubt we’d pick the GT trim over the GT Performance Edition. But no matter which trim you choose, we think the Mustang Mach-E GT is a fantastic battery-electric crossover and a great sporty car. It’s going to sell like hotcakes, and we can’t wait to spend more time driving it."
  ],
  "headers": {
    "4": "Mustang Mach-E GT specs and features",
    "14": "Mustang Mach-E GT tech",
    "26": "Mustang Mach-E GT design",
    "40": "Mach-E GT driving impressions",
    "57": "Takeaway"
  },
  "links": {
    "our own review": "https://www.techradar.com/news/ford-mustang-mach-e",
    "Tesla’s Netflix-capable infotainment system": "https://www.techradar.com/news/tesla-model-3-long-range-2021-review",
    "we're looking at you, Volkswagen": "https://www.techradar.com/news/vw-id4-awd-first-drive"
  }
}