{
  "source": "https://www.techradar.com/news/citrix-reportedly-eyeing-up-dollar2bn-deal-for-wrike",
  "title": "Citrix closes $2bn deal for Wrike",
  "category": "computing",
  "updated": "2021-01-19T15:39:49Z",
  "author": "barclay-ballard",
  "summary": "Deal is Citrix’s biggest-ever purchase",
  "article": [
    "US software giantCitrix has completed a deal to acquire project management platform Wrike in a deal likely to cost in excess of $2 billion.",
    "The news is Citrix’s biggest-ever purchase, and the company might feel that the financial outlay would be worthwhile in the long-run, as it would enable Citrix to become a significantly bigger player in the collaboration software market.",
    "Although Citrix once played a fairly sizable role in the business collaboration space, the company sold its GoTo Meeting software to LogMeIn in 2016 for $1.8 billion. This means that Citrix does not have a killer app to help businesses with remote work collaboration – something that could potentially be addressed through the Wrike purchase.",
    "“Work today is happening everywhere – at home, in the office and on the road. We believe that in the future, success will go to those companies that can support flexible and hybrid work models and provide a consistent, secure and efficient experience that removes the complexity and noise from work so employees can focus and perform at their best, wherever they happen to be,” said David Henshall, President and CEO, Citrix.",
    "“Together, Citrix and Wrike will deliver the solutions needed to power a cloud-delivered digital workspace experience that enables teams to securely access the resources and tools they need to collaborate and get work done in the most efficient and effective way possible across any channel, device or location.”",
    "Of course, no discussion regarding the current state of workplace collaboration would be complete without mention of the coronavirus pandemic.",
    "Since the virus began its spread, many businesses have had to adopt remote working policies – meaning the value of remote collaboration tools has skyrocketed. If Wrike is purchased for $2 billion, it would represent a huge profit for current owners Vista Equity, which bought the platform for $800 million in 2018.",
    "Wrike has gained a plethora of satisfied customers by offering a cross-department work management platform. Users can harness the software to track projects, manage assignments, and gather real-time performance analytics."
  ],
  "headers": {
    "3": "Wrike takeover"
  },
  "links": {
    "Wrike": "https://www.techradar.com/reviews/wrike"
  }
}