{
  "source": "https://www.techradar.com/news/the-xiaomi-mi-tv-q1-is-the-most-gorgeous-affordable-75-inch-4k-tvs-youll-never-see",
  "title": "The Xiaomi Mi TV Q1 is the most gorgeous, affordable 75-inch 4K TV you'll never see",
  "category": "televisions",
  "updated": "2021-02-09T19:53:14Z",
  "author": "nick-pino",
  "summary": "We hear the details on Xiaomi’s big 75-inch Mi TV Q1 that we might never get",
  "article": [
    "Xiaomi is taking the wraps off its new 75-inch Mi TV Q1, its flagship 4K HDR TV that incorporates both Dolby Vision and HDR10+ and packs Android 10. It’s Xiaomi’s most premium TV to date and, the company told me in an interview, could rival the Samsung Q80T in both specs and usability.",
    "How? Emory Babb, a product marketing manager at Xiaomi, tells us that the Q1 TV will have an HDMI 2.1 port with auto low latency, a native 120Hz refresh rate that will pair nicely with the Xbox Series X and PS5, and a full array local dimming panel with 192 zones. The result should be that it offers ultra-wide viewing angles and high color saturation that rivals Samsung.",
    "“The TV we had in mind was the Q80T 75-inch, as far as specs go. We like to think we compete pretty closely with them – but we’re separating ourselves by offering the HDR10+ and Dolby Vision as well,” Babb says. “It’s the TV we’d compare ourselves to the most – but at a more affordable price.”",
    "To that point, while the Samsung Q80T costs $2,499 for a 75-inch model, the Xiaomi Mi TV Q1 will cost a mere €1,299 (around $1,550, £1,140, AU$2,000).",
    "So what’s the catch? Babb and the team at Xiaomi says that, while the TV will be rolling out in over a dozen countries today – with special limited-time discounts in Spain, Germany, Italy and France – the US, UK and Australia won’t be among the countries getting one.",
    "Based on the specs and expected price, that’s an utter shame.",
    "If you live in most parts of Asia, Xiaomi is a brand you know intimately for its Mi Series, Mi Note Series, Mi Max Series, Mi Mix Series, Redmi and POCO Series Android devices. It’s currently the third-largest smartphone maker in the world, surpassing Apple (and, briefly, Huawei) in global sales, and has over 300 million active users.",
    "Alongside the Mi TV Q1, Xiaomi is also announcing Mi Electric Scooter Pro 2 special edition – because yes, it also makes scooters. That's not all, though: Xiaomi recently debuted its Xiaomi Mi 10i 5G flagship phone back in January, and just last week showed off a quad-curved concept phone that doesn’t have any ports or buttons.",
    "On the AV side of things, the company moved into TVs and expanded the reach into the European market – a competitive space usually dominated by Samsung, Panasonic, Philips and LG – but that didn’t stop Xiaomi from releasing its Mi TV 4 in Spain, Germany and Russia in 2020 while the US got the Mi TV Stick.",
    "The company hasn’t moved its flatscreen TV business to the United States or United Kingdom, countries that are smaller markets than Asia, but are equally as competitive because of just how many manufacturers, both big and small, try to vie for a spot on the shelves here.",
    "Not helping matters, though, is that Xiaomi also had a bit of a problem with the US government, whose concerns about its ties to Communist Chinese military led to the company being put on a blacklist for US investors – the same thing that happened to one of its biggest rivals, Huawei, a few years ago.",
    "That wasn’t something Babb was authorized to speak to me about, unfortunately, though Xiaomi has put out a statement saying that it is not owned, controlled or affiliated with the Chinese military and is not a “Communist Chinese Military Company” as defined by the National Defense Authorization Act (NDAA), recently filing a lawsuit against the United States for that allegation.",
    "It’s important to understand how Xiaomi fits within the global landscape before we hit you with the bad news: despite this TV being a properly-priced 120Hz 4K TV that could finally answer our question of where all the affordable 120Hz HDMI 2.1 TVs are, it’s definitely not coming to the US, and a release in the UK or Australia doesn't look likely, either.",
    "That’s a shame considering what the Xiaomi Mi TV Q1 brings to the table.",
    "In some specs shared by Babb and the team at Xiaomi, the Q1 uses a quantum dot filter to hit 95% of the DCI-P3 color space with a peak brightness of over 1,000 nits. Babb says that the TV has a viewing angle of 178 degrees without significant desaturation, and uses a quad-core Mediatek processor.",
    "Admittedly, a lot of smart TVs use quad-core processors to power their individual upscaling algorithms that upscale HD content into 4K images, so that's not unique to this TV, but it's worth mentioning, if just for clarity.",
    "Moreover, fans of next-gen consoles will appreciate that the TV has an HDMI 2.1 port, with support for auto low latency mode. The Q1 has Chromecast built-in and Miracast support as well for screen sharing, and outputs 30W of sound via two tweeters and four woofers.",
    "Because it uses Android TV, it’ll also have a voice assistant and IoT integrations as well. “We’ll have Google Assistant built into the TV that can hear you from three meters away,” Babb says. “Speak and you shall receive.” However, if you’re concerned about the smart assistant listening when it shouldn’t, there’s also a physical switch to turn off active listening.",
    "While there’s still some specs that could be pushed higher – the peak brightness is only 1,000 nits instead of, say, 2,000 or 2,500 that Samsung’s top QLEDs can reach – these are some very decent specs for a 75-inch TV that costs as much as most 65-inch screens.",
    "With solid specs and a salivating price tag, there’s little doubt that a TV like the Xiaomi Mi TV Q1 would win some fans in the AV community – but could Xiaomi stand up to the crowded American and British TV markets?",
    "According to Babb, Xiaomi isn’t afraid of the competition.",
    "“We embrace the competition,” Babb says. “It drives us to do better – to further innovate. But we think our user experience is really going to set us apart. I mentioned the far-field mic, but we also have a mic built into the remote – which, instead of IR, uses Bluetooth. We also, of course, have the most accessible price.”",
    "In India, Xiaomi has definitely found its footing. Sudhanshu Singh, who reviewed the Xiaomi Mi TV 4X Pro for TechRadar, said it was the top choice for an affordable 55-inch television and a superb value for the sticker price of Rs 39,999 (around $550 / £400 / AU$700).",
    "But the US has TCL and Vizio, two extremely popular TV companies that routinely pump out 55-inch 4K HDR TVs for around the same price, as well as big names like Samsung, LG and Sony that charge more for similar specs.",
    "Even if you disregard the recent drama with the US government, how Xiaomi could co-exist with these companies is a bit of a mystery. While new players have certainly come to the market and succeeded in the last 20 years – just look at TCL and Hisense, for example – for every success story there’s a failure as well (see: LeEco, Panasonic, or Toshiba, all of whom left the US market).",
    "“At this point we’ve got the streaming stick and streaming box that have been pretty successful. And we would love to bring our products to more people around the world,” Babb continued, while clarifying that “we currently don’t have any plans for the United States at this time.”",
    "Whether Xiaomi isn’t entering the market because of its fear of being overshadowed, out-priced, outmatched or something else entirely isn’t clear. But, on paper at least, the Mi TV Q1 looks like it could hang with the best of them, should Xiaomi ever decide to offer its TV stateside."
  ],
  "headers": {
    "6": "Xiaomi: a quick primer for the American AV community",
    "12": "The 75-inch TV you might never get to see",
    "19": "Could Xiaomi make it in America or the UK?"
  },
  "links": {
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Samsung Q80T": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xiaomi Mi 10i 5G": "https://www.techradar.com/news/xiaomi-mi-10i-sale",
    "Mi TV Stick": "https://www.techradar.com/reviews/xiaomi-mi-tv-stick-india",
    "a statement": "https://twitter.com/Xiaomi/status/1350039882970763265/photo/1",
    "filing a lawsuit against the United States": "https://www.techradar.com/news/xiaomi-sues-us-government-over-military-designation",
    "120Hz 4K TV": "https://www.techradar.com/best/120hz-4k-tvs",
    "where all the affordable 120Hz HDMI 2.1 TVs are": "https://www.techradar.com/news/where-are-all-the-cheap-xbox-series-x-and-ps5-friendly-4k-120hz-tvs",
    "smart TVs": "https://www.techradar.com/news/best-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Xiaomi Mi TV 4X Pro": "https://www.techradar.com/reviews/xiaomi-mi-tv-4x-pro-55-inch"
  }
}