{
  "source": "https://www.techradar.com/news/oops-samsung-galaxy-buds-2-unboxing-video-reveals-wireless-earbuds-before-launch",
  "title": "Oops – Samsung Galaxy Buds 2 unboxing video reveals wireless earbuds before launch",
  "category": "audio-visual",
  "updated": "2021-08-05T09:37:53Z",
  "author": "olivia-tambini",
  "summary": "Our best look at the Samsung Galaxy Buds 2 yet",
  "article": [
    "The Samsung Galaxy Buds 2 have been subject to a number of leaks ahead of their expected launch on August 11 – and now an unboxing video has given us our best look yet at the wireless earbuds, despite no confirmation from Samsung on their existence.",
    "The video, which was uploaded by The Mobile Central, shows off a pair of the new Galaxy Buds in an olive green hue, with a square charging case in white. As presenter Rohit Sadhwani notes, the inside of the charging case corresponds to the color of the buds themselves, which is reminiscent of the Google Pixel Buds A-Series.",
    "It looks like you get a USB-A to USB-C charging cable, ear tips in a range of sizes, and warranty documents in the box.",
    "The back of the box also reveals some features we've heard about before, including active noise cancellation and two-way drivers.",
    "Interestingly, the packaging also says that the Galaxy Buds 2 come with 5-20 hours of playtime – we're assuming that lower number refers to the battery life you get from the earbuds themselves with ANC turned on.",
    "Sadhwani also tried pairing the Galaxy Buds 2 with his S21 Ultra smartphone – all he had to to do is open the lid of the charging case, and the true wireless earbuds popped up on the screen.",
    "It seems you can also pair the Galaxy Buds 2 by long-pressing the touch-sensitive housings on both earbuds while they're still in their case. Once paired, you can use the Galaxy Wearable app to customize the earbuds' settings; this includes assigning different touch controls, adjusting the noise cancellation, and tweaking the EQ settings.",
    "As for the sound? Sadhwani seemed to be impressed with the bass response of the buds, and said that he was \"enjoying what he was listening to\". Of course, we'll need to test them for ourselves, but it's a promising first impression.",
    "We're hoping for some big improvements compared to the Samsung Galaxy Buds Pro, which are the best-sounding Samsung buds yet, but do leave something to be desired, particularly in terms of clarity in the mid and high frequencies. We won't have too long to find out, anyway – we're expecting to see the new buds at Samsung Galaxy Unpacked on August 11."
  ],
  "headers": {
    "5": "Easy pairing"
  },
  "links": {
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "The Mobile Central": "https://www.youtube.com/c/TheMobileCentral/about",
    "Google Pixel Buds A-Series": "https://www.techradar.com/reviews/google-pixel-buds-a-series-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Samsung Galaxy Unpacked": "https://www.techradar.com/news/samsung-galaxy-unpacked-will-indeed-be-august-11-bixby-assistant-confirms"
  }
}