{
  "source": "https://www.techradar.com/news/the-last-of-us-remake-is-coming-to-ps5-according-to-report",
  "title": "The Last of Us remake is coming to PS5, according to report",
  "category": "gaming",
  "updated": "2021-04-09T11:48:28Z",
  "author": "vic-hood",
  "summary": "A new Uncharted game is reportedly in the works, too",
  "article": [
    "Naughty Dog is reportedly working on a remake of The Last of Us for PS5.",
    "That's according to a report by Bloomberg, which claims that Sony's Visual Arts studio was initially working on a remake of the 2013 hit, before Naughty Dog took over the project.",
    "The report also confirms rumors that a new Uncharted game is in the works, claiming that one group at Visual Arts was assigned to work on a multiplayer game (likely The Last of Us 2's multiplayer) while the other was assigned to \"work on a new Uncharted game with supervision from Naughty Dog.\"",
    "According to the report, Visual Arts also pitched a remake of the first Uncharted game for PS5 to Sony.",
    "\"That idea quickly fizzled because it would be expensive and require too much added design work,\" the report reads. \"Instead, the team settled on a remake of Naughty Dog’s 2013 melancholic zombie hit, The Last of Us.\"",
    "Bloomberg states that Visual Arts planned to make The Last of Us remake have a \"similar look and feel\" to The Last of Us 2, which was in development at the time, so the game's could be packaged together upon release.",
    "According to the report, the pitch was accepted by Sony, who allegedly wanted to keep the project secret, and codenamed T1X. When many of the Visual Arts were moved to help with development on The Last of Us 2, the remake reportedly moved under Naughty Dog's control.",
    "While Naughty Dog hasn't confirmed it's working on a The Last of Us remake, director Neil Druckmann revealed earlier this year that the team is working on 'several cool things' for PS5. If Bloomberg's report is accurate then one of these projects is The Last of Us remake.",
    "What's more, rumors that a new Uncharted game could be in the works for PS5 at 'secret' studio ignited, when Michael Mumbauer, former studio head and senior director of Visual Arts at PlayStation World Wide Studios, updated his LinkedIn profile to say that he has built a \"brand new, all-star, AAA Action/Adventure development team for Playstation\" based in San Diego.",
    "It's always worth taking these types of reports with a pinch of salt, but Bloomberg's Jason Schreier has a reputation for trustworthy leaks. Neither Sony nor Naughty Dog have confirmed either game is in the works."
  ],
  "headers": {
    "5": "Double bill"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-04-09/sony-s-obsession-with-blockbusters-is-stirring-unrest-within-playstation-empire",
    "new Uncharted game is in the works": "https://www.techradar.com/news/new-uncharted-game-could-be-in-the-works-for-ps5-at-secret-studio",
    "'several cool things' for PS5": "https://www.techradar.com/news/the-last-of-us-developer-is-working-on-several-cool-things-for-ps5",
    "LinkedIn profile": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1400166524794904600&xs=1&url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fmichael-mumbauer-a185401%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-last-of-us-remake-is-coming-to-ps5-according-to-report"
  }
}