{
  "source": "https://www.techradar.com/news/oracle-wants-to-drastically-simplify-app-development-with-new-low-code-service",
  "title": "Oracle wants to drastically simplify app development with new low-code service",
  "category": "computing",
  "updated": "2021-01-14T21:29:57Z",
  "author": "anthony-spadafora",
  "summary": "Oracle's APEX is now available as a managed cloud service",
  "article": [
    "Oracle has announced that it has made its popular low code development platform APEX available as a managed cloud service to enable developers to easily build data-driven enterprise applications quickly.",
    "The company's APEX Application Development expands on two decades of APEX functionality already used by 500,000 developers as a browser-based service for creating modern web and mobile apps.",
    "While the original APEX platform was only available as part of the Oracle Database, APEX Application Development is now available as a standalone service that works with a variety of applications. The service runs on Oracle Cloud Infrastructure (OCI) and starts at $360 per month for more than 500 users with unlimited applications.",
    "Developers that want to break away from traditional coding and begin building low code apps using the new APEX Application Development service can do so for free as it is included as part of the Oracle Cloud free tier. Applications built using the service also benefit from the security, scalability and performance provided by Oracle Autonomous Database.",
    "As the APEX service is pre-configured with Oracle REST Data Services (ORDS) and SQL Developer Web, developers can use ORDS to create custom REST APIs against their application data and SQL Developer Web to compose SQL queries and graphically model data.",
    "If a business requires traditional coding beyond what can be done in APEX, one click developers can upgrade the service to a full Oracle Autonomous Transaction Processing database that supports full Oracle Database client APIs, SQL Net and Autonomous Data Guard.",
    "EVP of database server technologies at Oracle, Andrew Mendelsohn explained in a press release why the company has decided to make its low code platform available as a managed cloud service, saying:",
    "“Oracle continues to support developer communities and the new APEX service is the latest example, enabling citizen developers, business analysts, and professional developers to rapidly create and deploy beautiful, responsive, data-driven applications with minimal effort/ APEX is powerful enough to build the vast majority of business applications. Building data-driven applications with traditional coding should now be the exception rather than the rule.”"
  ],
  "headers": {
    "4": "Building low code apps with Oracle"
  },
  "links": {
    "Oracle": "https://www.techradar.com/news/oracle-is-the-latest-tech-giant-to-quit-silicon-valley",
    "low code": "https://www.techradar.com/news/low-code-could-lead-to-job-satisfaction-for-it-developers",
    "Oracle Database": "https://www.techradar.com/news/oracles-new-converged-cloud-database-enters-general-availability",
    "Oracle Cloud": "https://www.techradar.com/news/zoom-picks-oracle-cloud-to-help-meet-surge-in-demand",
    "press release": "https://www.oracle.com/news/announcement/oracle-apex-application-development-service-011321.html"
  }
}