{
  "source": "https://www.techradar.com/news/camera-rumors",
  "title": "Camera rumors 2021: the biggest and best camera rumors around",
  "category": "cameras",
  "updated": "2021-09-24T14:25:41Z",
  "author": "mark-wilson",
  "summary": "What new cameras can we still expect to see in 2021?",
  "article": [
    "Although the pandemic has thrown many industries into crisis, there's still plenty of cameras making their way onto the market - especially it seems of late at the high/pro end of the scale. The latest rumors suggest that the market isn't slowing down any time soon, and we could be in store for even more releases before the year is through.",
    "Recent headlines have been dominated by those pro-level models such as the Sony A1, Canon EOS R3 and the development announcement of the Nikon Z9. We might therefore reasonably expect to see some upgrades to those lower down the scale sitting in the mid-tier or entry-level ranges. More affordable options will be good news for the average consumer who doesn't have thousands to fritter away on the latest high-end model.",
    "Before the end of the year, we might reasonably expect to see some more travel-friendly/cheaper APS-C mirrorless options, as well as some full-frame cameras too.",
    "Although the DSLR is far from dead, it feels reasonably unlikely that we'll be seeing any new ones making their way onto the market before the holiday season, with manufacturers tending to use this time to purge their old stock before making new announcements.",
    "So with all that in mind, you might be wondering what the latest camera rumors we've heard this year are... you might be also be thinking about how the pandemic and other global problems might have affected release and availability schedules. This round-up aims to bring all of the latest camera rumors in one place, using our extensive knowledge of typical release schedules, as well as scouring the web for the latest rumors, insights and leaks, we'll bring you all the latest camera gossip you could ever need."
  ],
  "headers": {
    "5": "Camera rumors 2021"
  },
  "links": {}
}