{
  "source": "https://www.techradar.com/news/uk-smes-are-in-for-a-treat-with-new-wix-and-yell-collaboration",
  "title": "UK SMEs are in for a treat with new Wix and Yell collaboration",
  "category": "computing",
  "updated": "2021-07-06T14:39:08Z",
  "author": "abigail-opiah",
  "summary": "Wix and Yell bring Smart Websites to the UK SME market",
  "article": [
    "Popular website builder Wix has partnered with managed digital marketing services Yell in building, managing and growing its online presence.",
    "Henceforth, Wix will be the technology provider for Yell's new 'Smart Websites - powered by Wix', which will enable Yell's digital experts to offer its SME (Small Medium Enterprises) customers a faster customised website or online store build. It will also include a broader range of functionalities.",
    "Both digital companies will work on helping SMEs in the UK to build and grow their online presence.",
    "The websites created on the Wix platform will be optimized for all devices as standard and SSL certified. The aim will be to provide a fast, secure and engaging online experience for visitors.",
    "\"We're thrilled to bring Wix's platform to the tens of thousands of businesses working with Yell,\" said Wix Chief Business Officer Yaniv Vakrat.",
    "\"This collaboration provides Yell customers with a professionally designed and secure website, optimised for all search engines and devices and most importantly, gives them the ability to build and grow their online business.",
    "\"Consumers are increasingly shopping and searching online, and business owners need to ensure they have a great online presence to meet this demand. Our partnership allows Yell to continue providing their customers with market leading solutions.\"",
    "To further support SMEs as they build their business profiles, the new Smart Websites also offer extensive analytics, built-in Customer Relationship Management capabilities, automated task triggers, appointment and restaurant bookings, event management facilitation and acceptance of credit cards and other forms of payments.",
    "Claire Miles, Yell CEO, said: \"This partnership with Wix ensures we can offer a truly unique website proposition to UK SMEs. We know SMEs have had to be creative in keeping their businesses up and running during the pandemic and they've told us a key priority is being able to establish a prominent and successful online presence.",
    "\"We can now meet this need in better ways than ever before, with our digital experts building brilliant websites packed with enhanced functionality using the world class Wix platform, and our customer care agents providing ongoing support for customers once their website is up and running.\"",
    "She added that Yell chose Wix as its partner because of the website builder's leading technology and ongoing commitment to invest in their platform.",
    "In the last few months, Wix has launched a series of apps and new offerings including Dine by Wix for restaurants and an update on its POS solutions with its partnership with Stripe and HP."
  ],
  "headers": {
    "3": "Wix website builder"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Wix": "https://www.techradar.com/reviews/wix",
    "SSL certified": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Dine by Wix": "https://www.techradar.com/news/ordering-food-from-restaurants-made-simple-with-new-wix-app",
    "partnership with Stripe and HP": "https://www.techradar.com/news/wix-is-working-with-stripe-and-hp-to-deliver-a-complete-commerce-solution"
  }
}