{
  "source": "https://www.techradar.com/news/ford-is-building-android-into-its-cars-starting-in-2023",
  "title": "Ford is building Android into its cars starting in 2023",
  "category": "car-tech",
  "updated": "2021-02-03T12:09:26Z",
  "author": "rhys-wood",
  "summary": "Do Androids dream of electric cars?",
  "article": [
    "Ford is now one of many automotive manufacturers to share the reins of production with a tech giant. The Michigan based company has teamed up with Google to add its Android operating system to its vehicles beginning in 2023.",
    "Ford has signed a six-year long partnership with the tech giant, which cements Google Cloud as the primary provider when the updated vehicles roll out in 2023.",
    "Much like Tesla’s own operating system, Android will be installed into Ford vehicles and will not require external Android devices to function. Drivers will be able to make use of Google Assistant, Maps and more. However, Ford has not yet specified which specific models will receive all this digital finery.",
    "Instead, the company opted to say that “millions” of cars under the Ford and Lincoln brands will receive the upgrades. Naturally, we’d expect the rollout to begin with its more high end vehicles at first. The vehicles will be available worldwide excluding China where Google suffers a blanket ban on all their services.",
    "Apple enthusiasts need not despair. Ford explained that its vehicles will still share compatibility with Apple CarPlay.",
    "Ford making use of Android is not unprecedented, either. Ford joins other car manufacturers such as General Motors and Volvo in partnering with Google for Android integration in their vehicles. It’s a move that’s becoming increasingly common as tech firms seem keener than ever to offer in-vehicle smartphone and infotainment experiences.",
    "Both Google and Ford have also formed Team Upshift, billed as a task force of employees from both Ford and Google to drive innovation as part of the new partnership.",
    "Writing in a Medium post, David McClelland, VP of Strategy and Partnerships at Ford, stated that innovations “may include projects ranging from modernizing our plants through vision AI, developing new retail experiences when buying a vehicle, creating new ownership offers based on connected vehicle data, and more.”",
    "The partnership has all the makings of a success, offering the best of Google’s technologies in a hands-free format. The voice activated Assistant is sure to be useful on the go, perhaps if the driver is in an unfamiliar area and looking for points of interest.",
    "On the other hand, we can potentially spot a number of privacy concerns stemming from such a partnership. These “new retail experiences” as mentioned by McClelland point to drivers’ data becoming a treasure trove of saleable information for Google.",
    "Via The Verge"
  ],
  "headers": {
    "5": "A smart partnership"
  },
  "links": {
    "Ford": "https://www.techradar.com/news/after-testing-fords-connected-car-app-its-hard-to-go-back-my-regular-dumb-car",
    "Android": "https://www.techradar.com/best/best-android-apps-2021",
    "Tesla’s": "https://www.techradar.com/news/tesla-video-teases-new-speak-to-pedestrians-feature",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Google suffers a blanket ban": "https://www.techradar.com/vpn/which-websites-and-online-services-are-banned-in-china",
    "Apple CarPlay.": "https://www.techradar.com/news/best-apple-carplay-apps",
    "Medium post,": "https://medium.com/@ford/heres-why-we-re-co-creating-our-future-with-google-d6bd49bf497b",
    "The Verge": "https://www.theverge.com/2021/2/1/22260176/ford-google-android-infotainment-os-2023"
  }
}