{
  "source": "https://www.techradar.com/news/why-photoshops-super-resolution-trick-falls-short-of-its-promise-for-now",
  "title": "Why Photoshop's Super Resolution trick falls short of its promise – for now",
  "category": "cameras",
  "updated": "2021-04-05T05:00:00Z",
  "author": "dave-stevenson",
  "summary": "New 'enhance' tool is frustratingly inconsistent",
  "article": [
    "Adobe Photoshop has been embracing the power of AI to a mildly terrifying degree recently, but now it's getting something slightly less scary than neural filters – a new feature called Super Resolution.",
    "The handy new tool, which is now available in Camera Raw 13.2 and will be landing soon on Lightroom and Lightroom Classic, has a simple claim – to be able to double the resolution of your photos using machine learning, while improving their quality.",
    "This is a big deal for most photographers, particularly those of us who remember the early days of the megapixel wars. Back in the day (we’re old, okay?) you couldn’t go near a camera launch without the megapixel count of a camera being thrust at you.",
    "Four megapixels. Eight. 12. 18. We remember when the Canon EOS 5D Mark IV, with its 30.4MP sensor, arrived – that was it, the end of the resolution wars. From that point on, virtually any camera you could buy would offer enough resolution to do virtually anything with the images you wanted.",
    "That’s doubly true in the age of Instagram. Actually, it’s 25 times more true in the age of Instagram, as in most cases you only ever need to upload a 1080 x 1080 image – just 1.2MP’s worth of photography.",
    "Adobe doesn’t think resolution worries have gone away, though, which is why its new Super Resolution has made its way to Adobe Camera Raw. It advertises something simple – it will take an image (JPGs and raws are both supported) and doubles the number of pixels along the horizontal and vertical edges.",
    "Sceptics will be reaching for their “but it already does that” comments as we speak, but Super Resolution uses machine learning, theoretically allowing it to produce superior-quality results. But does it? We ran it through some tests to find out.",
    "Using the tool is simple. Use Adobe Bridge and open an image in Adobe Camera Raw (ACR), then right-click your image and click Enhance – or use CMD-Shift-D if you’re in a rush.",
    "The Super Resolution tool itself is a simple one – a lonesome checkbox marked Super Resolution, and the ability to click and hold on your image preview to see what ACR is going to do.",
    "Click Enhance (it's good to see Adobe finally embracing the terminology of late-90s classic Enemy of the State), and your computer will whir away for a bit. Super Resolution is heavily dependent on your system’s GPU, so the more you spent on that, the faster your results will come.",
    "Of course, Photoshop, Bridge and Lightroom (other photo editors are available) have offered image upscaling for years, so what advantages does Super Resolution offer? Having read some breathlessly enthusiastic experiences, we eagerly set up a few comparisons and…results were variable, to put it mildly.",
    "If all you want is to create a supersize version of a decent, un-cropped image, you can save substantial amounts of time – and even image quality – using Photoshop’s bog standard image resize.",
    "We tried a few images – opening them, resizing them to 200% their original linear dimensions, and then layering an 'enhanced' resize on top. While there was always a difference between the two, the difference was rarely in Super Resolution’s favor.",
    "A good example of the limitations of Photoshop's Super Resolution mode is this frame of a robin. On the left is what the original image (which you can see here) looks like resized to twice its original dimensions using Photoshop’s basic image re-sizer, with resampling set to automatic. You can see the full-size version here.",
    "And the version on the right (which you can see in full-size here) is what it looks like after being 'enhanced'. Can you tell the difference? Us neither, although with Super Resolution producing an enormous DNG file each time you use it, our hard disk certainly could.",
    "Also, zooming into 100% showed a problem. The difference is almost unbearably slight, but the basic resize (left) shows more sharpness and fine detail than the far more processor and hard disk intensive Super Resolution file on the right. That makes the score '1-0' in favor of doing things the old fashioned way.",
    "Next up, we tried comparing the two techniques on this photo of a rhino. This time we’ll skip straight to the side-by-side comparison, as there’s no way you’ll spot the difference otherwise.",
    "This time, our subject does show a slight improvement in texture and sharpness where we’ve used Super Resolution (right) versus using the basic resize tool (left). You can see the full-size version here.",
    "However, it’s also mis-colored our image, dropping in some violet aberrations that now need fixing. Even if these weren’t here we’d still wonder whether Adobe’s new AI-powered tool was worth it.",
    "Resizing an image using Photoshop’s bargain-basement re-sizer – in these first two examples – produced similar or better results and was ridiculously fast (about 22 seconds, versus over 54 seconds) compared to the Super Resolution tool.",
    "It’s not all doom and gloom for Super Resolution, though – our experiments suggest there will be times when the feature is worth its weight in, if not gold, at least something reasonably heavy-duty.",
    "For example, here’s a picture of the bank-side in photo-friendly Porto.",
    "And below is a super-aggressive crop of the same image. After the crop we were left with an image just 2,733 x 1,822 pixels, which is pretty tight if you’re looking to print.",
    "We resized the image using Photoshop’s old-style re-sizer and the Super Resolution tool, and the results are actually pretty striking. For a closer look, check out the full-size version.",
    "You still need to be paying attention, but the basic-resize version (left) is way softer than the Super Resolution version on the right.",
    "There’s more detail, sharpness, and although the trained eye will pick up a slightly raised amount of chromatic aberration (purple and green fringing), it’s barely worth mentioning.",
    "Our last Super Resolution test was this photo of a tiger, which is cropped down from this original snap.",
    "And, after upscaling using both Super Resolution and Photoshop’s old-school image re-sizer, here’s the side-by-side comparison of the results. Or you can get a closer look by checking out the full-size version here.",
    "At this point we began to question our eyes, our sanity, our reason for being. The basic resize – which took seconds – is visibly, appreciably sharper than the Super Resolution version on the right.",
    "All of this leaves us struggling to make a call. There isn’t really a buying decision, as such – if you have a Creative Cloud subscription that includes Photoshop, you already have Super Resolution, so the question is if it’s worth the extra time.",
    "In some cases, appreciably, yes – you’ll be able to enlarge images, preserving, or even creating, extra sharpness as you go. In other cases, appreciably, no – your images could very well end up slightly softer, and in either case you’ll be splitting hairs between getting Photoshop to do a basic up-rezzing job or spending more time having Adobe Camera Raw doing its 'Enhance' job.",
    "All of which is before you consider Topaz’ popular Gigapixel AI software. It’s long-winded and expensive at $99.99, but given our crop of Porto to work on, it produced a visibly stronger image than either of Photoshop’s efforts. This is particularly noticeable in the full-size image.",
    "Then we tried using Gigapixel on our robin image – just as a sanity check, you see – and the whole thing fell apart again, with our Gigapixel image introducing a load of previously-absent noise, mottling the fine detail of our bird.",
    "If ever there was a topic of image editing that deserved the deployment of the shrug emoji, image resizing appears to be it. Get a closer look with the full-size version of the below comparison.",
    "Still, despite these mixed results, the writing’s certainly on the wall for image editing – AI and cloud-based edits are going to be the way of the future. Has Adobe cracked it?",
    "Super Resolution is an interesting but irritatingly inconsistent way of up-rezzing images, particularly compared to some excellent third party software. But if you’re unwilling to spend the money for Gigapixel, if you find yourself frustrated with how Photoshop upscales using its traditional tools, we’d give the cloud a try."
  ],
  "headers": {
    "7": "How to use Adobe's Super Resolution mode",
    "10": "How long does Super Resolution take and is it worth it?",
    "13": "1.) The robin test",
    "16": "2.) The rhino test",
    "20": "3.) The Porto redemption",
    "26": "4.) The tiger test",
    "29": "The verdict",
    "31": "The alternative: Gigapixel"
  },
  "links": {
    "Adobe Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2021",
    "mildly terrifying degree": "https://www.techradar.com/news/why-photoshop-and-luminars-ai-tools-arent-quite-ready-to-kill-real-photography",
    "Canon EOS 5D Mark IV": "https://www.techradar.com/reviews/canon-eos-5d-mark-iv-review",
    "photo editors": "https://www.techradar.com/news/best-photo-editor",
    "here": "https://cdn.mos.cms.futurecdn.net/bxCXByqoaZrz6oDXGUvMFm.jpeg",
    "full-size version here": "https://cdn.mos.cms.futurecdn.net/NWAHJRN7L5ZdxgkyWUYU5X.jpeg",
    "full-size version": "https://cdn.mos.cms.futurecdn.net/ctxDzqzt7YsbwEAGmLLAjA.jpeg",
    "Gigapixel AI software": "https://topazlabs.com/gigapixel-ai/",
    "full-size image": "https://cdn.mos.cms.futurecdn.net/jUkKKk4xEzqtQBn8wPpiB3.jpeg"
  }
}