{
  "source": "https://www.techradar.com/news/linux-foundation-launches-free-webassembly-course",
  "title": "Linux Foundation launches free WebAssembly course",
  "category": "computing",
  "updated": "2021-01-12T09:09:34Z",
  "author": "mayank-sharma",
  "summary": "Six hour course includes both written and video content",
  "article": [
    "Linux Foundation, the non-profit organization that works to promote the commercial adoption of Linux, has recently released a free training course to help individuals get up to speed with WebAssembly.",
    "WebAssembly is a new runtime that lives alongside the JavaScript virtual machine and is increasingly being referred to as the fourth official language of the web along with HTML, CSS, and JavaScript.",
    "Introduction to WebAssembly is a six-hour self-paced introductory course that is available for free on the edX non-profit learning platform.",
    "In a blog post, the Linux Foundation shares that the course has been developed and conducted by Colin Eberhardt, Technology Director at Scott Logic, a UK-based software consultancy.",
    "The course uses a mix of video, written material and hands-on exercises to familiarize students with WebAssembly and how it can be leveraged in and beyond the browser.",
    "“WebAssembly is one of the most exciting technologies I have come across for years,” shares Eberhard. “Its initial promise was a fast and efficient multi-language runtime for the web, but it has the potential to be so much more. We are already seeing this runtime being used for numerous applications beyond the browser, including serverless and blockchain, with more novel uses and applications appearing each week!”",
    "The course is broadly divided into five chapters that involve hands-on sessions to help students create simple WebAssembly modules using the WebAssembly Studio online IDE. It’ll also introduce the language-specific toolchains, along with several examples of the kinds of applications people are building with WebAssembly.",
    "Besides this course, the Linux Foundation offers several other free courses on edX on a variety of topics. You can optionally pay a fee and upgrade to the verified track to receive a certificate on the successful completion of the course."
  ],
  "headers": {
    "3": "Free for all"
  },
  "links": {
    "Linux Foundation": "https://www.techradar.com/news/the-linux-foundation-is-getting-into-the-access-management-game",
    "Introduction to WebAssembly": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1094443715298009000&xs=1&url=https%3A%2F%2Fwww.edx.org%2Fcourse%2Fintroduction-to-webassembly-runtime&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Flinux-foundation-launches-free-webassembly-course",
    "free courses on edX": "https://www.techradar.com/news/free-linux-course-has-already-taught-one-million-people"
  }
}