{
  "source": "https://www.techradar.com/news/the-future-of-working-from-home",
  "title": "The future of working from home",
  "category": "computing",
  "updated": "2021-08-10T10:42:58Z",
  "author": "pietro-renda",
  "summary": "Finding the right workplace balance",
  "article": [
    "As the nation embarks on a post-pandemic return to ‘normal’ life, many may wish for a return to the life they lived before Covid-19 derailed it. The fact is that life has – in some shape or form - changed for all of us, whether personally or professionally.",
    "In a professional capacity, the greatest change for many was the move to Working From Home (WFH).",
    "Although not a new working model, it wasn’t an especially common working practice until the pandemic arrived. Its uptake was hindered by some companies’ insistence that required staff to be present at all times at a work site, or by the technical and security complications that made working from home impractical for staff and their employers. Of the two, it was actually resistance to change that meant many companies were slow to adopt the WFH model. The pandemic forced change though, at which point even organizations against the idea had to accept that adopting it during the pandemic was the only way to keep their staff safe and their business operational during an economically crippling time. It’s not an exaggeration then to say that WFH was central to many businesses’ survival.",
    "The many benefits of the WFH model – from a better work/life balance to reduced pollution and traffic congestion during peak times and less of a requirement for large, expensive to run offices – are well documented. But how will the WFH model fare? Will it prove to be the optimal working model for the future, or is it one that was mainly suitable for a pandemic-type scenario? I believe that it will take six months or so of businesses operating in the ‘new normal’ before we get a real idea of the role WFH will play in the future. Then we will see which businesses adopted it because it was the right thing - the only thing! – to do at the time, and which businesses will decide its benefits are far too good to give up.",
    "In the meantime, we see that many companies are managing the WFH dynamic in various ways. Some have given their employees permission to continue working remotely until at least the end of 2021. Others have recalled staff to the workplace on different schedules and in staggered groups, while many are leaving it entirely up to individual workers to decide where to base themselves.",
    "Equally, many businesses around the world are starting to think about the longer term, including alternative ways to structure work communication and hours as well as physical presence. And what many are converging on amid the ongoing uncertainty, is different models of hybrid working: combining remote working with office-based work.",
    "I believe that once the pandemic subsides and the remaining lockdown measures are lifted, working from home two days a week will be optimal for balancing collaborative and productive work, while benefitting from the reduced stress of less commuting. Of course, hybrid working patterns won’t suit everyone or every organization. In general, there’s enormous socioeconomic and racial inequality between who is able to work from home and who is not; long-term, that needs to be addressed if everyone is able to enjoy the advantages that hybrid working offers.",
    "There are other issues that need to be considered, too. Partially distributed teams also commonly report communication problems. Conflict is more likely on digital communication platforms, partly because social inhibitions and behavior codes are more powerful when working face-to-face than they are online. Additionally, the lack of shared social identity that is more common in partially distributed teams can harm team effectiveness and performance, by impairing trust and team spirit.",
    "Organizations have of course learned how to run complex meetings on collaborative platforms. Client management has been handled so efficiently remotely that many clients now prefer this mode of interaction. This massive shift in preference has persuaded even the most skeptical and converted them into happy users of remote working practices and platforms. This mindset shift – or, change management - is a key enabler in the switch to the hybrid work model.",
    "That said, managers would need to demonstrate greater empathy to navigate the team who are handling challenges within the hybrid work model. Team meetings in specific intervals, leaders checking on team members, accessibility to resources, flexibility in dynamic working environments, shifting gears from technology dependent work to human interactions, are all critical aspects of how performance should be measured in the hybrid work environment.",
    "The pandemic has accelerated the pace at which WFH has been adopted en-masse. By doing so, it has established a whole new perspective on work, the workplace, hierarchy, team structures, and performance measurement. While there are many merits of the hybrid model, there are multiple challenges that leaders and businesses need to think through and overcome. But as organizations become more agile and flatter as a result of the fast-changing nature of the workspace dynamic, it is important for them to embrace this change positively, and look at the immense scope of possibility that it opens up by ‘knitting’ the world closer together… wherever employees are working from."
  ],
  "headers": {
    "3": "Is WFH forever?",
    "6": "Finding the right workplace balance",
    "8": "A blend of technology and management"
  },
  "links": {
    "Working From Home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "offices": "https://www.techradar.com/best/best-office-desks",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams"
  }
}