{
  "source": "https://www.techradar.com/news/beyond-good-and-evil-2-job-listings-show-the-game-is-still-in-the-works",
  "title": "Beyond Good and Evil 2 job listings show the game is still in the works",
  "category": "gaming",
  "updated": "2021-10-06T19:03:42Z",
  "author": "emma-boyle",
  "summary": "Keeping the dream alive",
  "article": [
    "A handful of job listings for Beyond Good and Evil 2 show that the game is still in active development at Ubisoft.",
    "Ubisoft has recently posted listings for a range of roles on the Beyond Good and Evil 2 team, which range from programmers and animators, to technical artists, to a development tester. The roles are based at a range of Ubisoft’s studios in France, Germany and Spain.",
    "Overall, the job listings don’t give a huge amount away about the specifics of Beyond Good and Evil 2, though a listing for a Technical Artist does provide a little tease by calling it “one of the most innovative productions at Ubisoft” with \"an entire Galaxy, where the gamer is free to explore unique planets (each with its own cities, ecosystem and culture)\". What these listings do, at least, confirm is that development on the game is still moving along.",
    "It’s been a while since we last saw anything from Beyond Good and Evil 2; the last trailer drop and a look at some gameplay took place in 2018. Ubisoft’s financial reports have been a slight source of news, with the most recent call in July 2021 (via PCGamer) confirming that development is “progressing well”, while sidestepping an opportunity to commit to a fiscal 2024 release, deeming it “too early to tell you at this stage.“",
    "Thus far, then, Beyond Good and Evil 2 has received no release date or release window and it remains unclear when we’ll see one announced.",
    "So, yeah, things have been pretty quiet on the Beyond Good and Evil 2 front. An update back in September 2020 suggested that we would see the game in action at some point in 2021 and it’s kind of hard not to notice that 2021 is rapidly running out of months. Still, it’s not necessarily the worst thing that the game still hasn’t been shown. It seems likely that the silence just means the development team is keeping its head down and pushing forward with creating the game. These job listings certainly suggest that's the case.",
    "The ongoing coronavirus pandemic has caused significant disruption for development studios across the world. It’s not hard, then, to imagine that the team behind Beyond Good and Evil 2 has faced disruptions of its own. That’s not to mention the announcement of the departure of director Michel Ancel back in 2020, when it was confirmed that he hadn’t been directly involved with the project for “some time” already.",
    "I attended a behind-closed-doors preview of the game all the way back at E3 2018 so I can at least confirm it’s actually a real game that exists in some form, even if it kind of feels like a dream now. I didn’t play a single bit of it for myself (it wasn’t at that stage yet) but I did watch some developers take it for a spin in a very controlled demo. My overwhelming impression during the session was “well, that's ambitious”. Certainly, it struck me as a big game with a lot of moving parts that will take some time to get right. After the trouble Cyberpunk 2077 has had, there’s rightly a wariness around over-promising and under-delivering, so perhaps the quiet around Beyond Good and Evil 2 is for the best.",
    "The original Beyond Good and Evil was released in 2003—that’s 18 years ago—and it’s been 13 years since Beyond Good and Evil 2 was first teased at Ubidays in 2008. Given we’ve waited this long, we can probably stand to wait a little longer. Admittedly, “a little longer” feels somewhat optimistic right now but, hey, good games take time, right?",
    "Via GameRant"
  ],
  "headers": {
    "5": "Analysis: Probably best not to rush"
  },
  "links": {
    "Beyond Good and Evil 2": "https://www.techradar.com/news/beyond-good-and-evil-2",
    "programmers": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-1355337432946449700&sharedId=trd-us&u=https%3A%2F%2Fwww.ubisoft.com%2Fen-us%2Fcompany%2Fcareers%2Fsearch%2F743999766424620-3d-programmer-graphics-programmer-beyond-good-and-evil-2-f-m-d-",
    "animators": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-1020523567540279000&sharedId=trd-us&u=https%3A%2F%2Fwww.ubisoft.com%2Fen-us%2Fcompany%2Fcareers%2Fsearch%2F743999775519206-technical-animator-beyond-good-evil-2",
    "technical artists": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-1286000653001512200&sharedId=trd-us&u=https%3A%2F%2Fwww.ubisoft.com%2Fen-us%2Fcompany%2Fcareers%2Fsearch%2F743999758439354-technical-artist-beyond-good-and-evil-2-paris-f-h-nb",
    "development tester": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-4977921808122975000&sharedId=trd-us&u=https%3A%2F%2Fwww.ubisoft.com%2Fen-us%2Fcompany%2Fcareers%2Fsearch%2F743999766197829-development-tester-beyond-good-and-evil-2-f-m-nb-",
    "a listing for a Technical Artist": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-8370499040592968000&sharedId=trd-us&u=https%3A%2F%2Fwww.ubisoft.com%2Fen-us%2Fcompany%2Fcareers%2Fsearch%2F743999758439354-technical-artist-beyond-good-and-evil-2-paris-f-h-nb",
    "the last trailer": "https://www.youtube.com/watch?v=IsoIUHDrPcg",
    "look at some gameplay": "https://www.youtube.com/watch?v=Y2229DmJLIY",
    "PCGamer": "https://www.pcgamer.com/after-more-than-ten-years-its-still-too-soon-to-say-when-beyond-good-and-evil-2-might-be-out/",
    "An update": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-6260874665569262000&sharedId=trd-us&u=https%3A%2F%2Fnews.ubisoft.com%2Fen-au%2Farticle%2F6ptJuA0jx7qhvhTnSosl8L%2Fan-update-on-beyond-good-evil-2",
    "announcement": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-5562700330558894000&sharedId=trd-us&u=https%3A%2F%2Fnews.ubisoft.com%2Fen-au%2Farticle%2F6ptJuA0jx7qhvhTnSosl8L%2Fan-update-on-beyond-good-evil-2",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "GameRant": "https://gamerant.com/beyond-good-and-evil-2-still-hiring-developers/"
  }
}