{
  "source": "https://www.techradar.com/news/ericsson-sues-apple-in-5g-patent-dispute",
  "title": "Ericsson sues Apple in 5G patent dispute",
  "category": "computing",
  "updated": "2021-10-07T15:10:07Z",
  "author": "steve-mccaskill",
  "summary": "Ericsson wants fair terms for the use of its innovation",
  "article": [
    "Ericsson has taken legal action against Apple in a bid to make the iPhone manufacturer pay what the former considers to be fair rates for its 5G patents.",
    "Standards Essential Patents (SEPs) are innovations that have been contributed to industry standards, such as 5G, and can be used by anyone else provided they pay a fair price for the privilege. These rates are known as fair, reasonable and non-discriminatory (FRAND) terms.",
    "In effect, this means anyone that uses an SEP in their product pays a royalty to the owner of the patent. Some companies with large portfolios of SEPs often introduce royalty caps in a bid to prevent the likelihood of a legal dispute – which are not uncommon among major vendors.",
    "For example, Huawei has capped its royalties at $2.50 per device and Nokia has imposed a $3.57 limit.",
    "Ericsson and Apple have been engaged in court cases before, most notably in 2015, when the disagreement culminated in a seven-year deal which will expire in 2022. During that particular episode, Apple had argued its devices did not infringe Ericsson’s patents, that the patents in question weren’t essential, and that Ericsson’s royalty demands were excessive.",
    "Specifically, Apple argued that payments should be calculated according to the value of components that uses the technology – not the overall value of the device.",
    "In a lawsuit filed by Ericsson in Texas, Ericsson has alleged that Apple still wants to use its own methodology to determine which individual patents are SEP, are valid, and have been infringed.",
    "The Swedish telecoms equipment manufacturer says this approach is an attempt to avoid paying reasonable fees and ignores the wide-ranging patent arrangements that are traditionally agreed upon between firms.",
    "“On October 4, 2021, Ericsson has asked the United States District Court for the Eastern District of Texas, Marshall Division, for a declaration that Ericsson has, in its negotiations with Apple, complied with its FRAND commitment and all other applicable laws and policies that would affect the terms of Ericsson and Apple’s prospective license,” an Ericsson spokesperson told TechRadar Pro.",
    "“For technology leaders like Ericsson, making early and heavy investments in R&D, the possibility for fair compensation through patent licensing is important to ensure new investments in innovation and the continued success of open, collaborative standardization.",
    "“The case is ongoing, and Ericsson will refrain from making any further comments at this point.”",
    "Apple has not yet responded to TechRadar Pro’s request for comment."
  ],
  "headers": {
    "3": "Ericsson patents"
  },
  "links": {}
}