{
  "source": "https://www.techradar.com/news/how-to-watch-table-tennis-at-olympics-2020-key-dates-free-live-stream",
  "title": "How to watch Table Tennis at Olympics 2020: key dates, free live stream and more",
  "category": "computing",
  "updated": "2021-07-26T16:40:09Z",
  "author": "adam-marshall",
  "summary": "Can anybody stop China's domination on the ping pong table?",
  "article": [
    "In an Olympics fortnight when speed is often paramount, not many events look faster than the lightning-quick table tennis action. Whether you call it ping-pong, whiff-whaff or any other weird and wonderful names, you've landed on the right page to discover how to watch an Olympics table tennis live stream at Tokyo in 2021 - with free options explained, alongside the key dates to pop in your diary.",
    "There aren't many Summer Olympics events that are dominated more resoundingly by one nation than table tennis. You have to go back all the way to 2004 to find an event that China didn't win gold at, with them taking the clean sweep across all categories in 2008, 2012 and 2016.",
    "And, frankly, you can probably expect more of the same this time around, too, with China dominating the world rankings. And this year there's one extra gold they can go for, with mixed doubles joining the singles and team disciplines. Ma Long is the reigning male champ, but will do well to beat world number one Fan Zhendong, while we'll have a brand new women's gold medallist following Ding Ning's retirement.",
    "Hosts Japan are probably best placed to break up the Chinese whitewash. Look out for Tomokazu Harimoto and Mima Ito vying to become national heroes in Tokyo.",
    "Keep reading to find out the key dates schedule of this year's gold medal matches, as well as all the information you need to get a table tennis live stream at the Olympics in 2021.",
    "- Mixed doubles final: Monday, July 26 from 8pm JST / 12pm BST / 7am ET",
    "- Women's singles final: Thursday, July 29 from 8pm JST / 12pm BST / 7am ET",
    "- Men's singles final: Friday, July 30 from 8pm JST / 12pm BST / 7am ET",
    "- Women's team final: Thursday, August 5 from 7.30pm JST / 11.30am BST / 6.30am ET",
    "- Men's team final: Monday, July 26 from 7.30pm JST / 11.30am BST / 6.30am ET",
    "The free, online Olympics Channel looks set to have highlights and other programming. But if you want more in-depth coverage, you'll need to look at domestic broadcasters. Those living in the UK have the benefit of the BBC's free-to-air coverage for example, with plenty of key events being shown on BBC iPlayer.",
    "It's a similar story in the likes of Ireland (RTE), France (TF1) and, Germany (ARD and ZDF). And from what we've seen, Australia appears to have the most bases covered with Channel 7 and its 7plus platform online. We have further information about worldwide Olympics streams below.",
    "You should be able to find an Olympic Games stream (whether paid or free) in whatever country you happen to be in. But you may find that: a) your usual domestic coverage is geo-blocked when overseas; or b) that your place of work or college has blocked the ability to watch online where you are.",
    "There's a really easy way to solve those issues, thankfully. By downloading and installing a VPN, you can effectively trick your computer, phone or tablet into thinking that it's somewhere completely different. That way you can enjoy your usual coverage without having to find an illegal stream.",
    "Use a VPN to watch Tokyo 2020 Olympic Games from anywhere",
    "Using a VPN is as easy as one-two-three...",
    "1. Download and install a VPN - as we say, our top choice is ExpressVPN",
    "2. Connect to the appropriate server location - open the VPN app, hit 'choose location' and select the appropriate location",
    "3. Go to the broadcaster's live stream - so if you're from the UK, just head to BBC iPlayer",
    "It won't come as a surprise that the Olympics is being shown in most corners of the globe - although with varying levels of coverage and without free broadcasters in some countries.",
    "If you're not in any of the countries mentioned above, then we'd suggest taking a look at the dedicated Wikipedia page of all of the world's Olympic Games channels."
  ],
  "headers": {
    "5": "Olympics 2020 table tennis: key dates and times",
    "10": "Free Olympics table tennis live stream",
    "12": "How to watch your Olympics live stream when abroad",
    "19": "Other 2020 Olympics broadcasters around the world"
  },
  "links": {
    "Olympics Channel": "https://olympics.com/en/live/",
    "BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "7plus platform online": "http://7plus.com.au/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "head to BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "Wikipedia": "https://en.wikipedia.org/wiki/List_of_2020_Summer_Olympics_broadcasters"
  }
}