{
  "source": "https://www.techradar.com/news/the-unexpected-benefits-of-playing-video-games-at-work",
  "title": "The unexpected benefits of playing video games at work",
  "category": "computing",
  "updated": "2021-10-16T03:12:40Z",
  "author": "joel-khalili",
  "summary": "Could regular gaming breaks be the key to maximizing productivity?",
  "article": [
    "One of the few silver linings of the pandemic is that it has thrown into stark relief the problems with working culture that have gone unaddressed for decades.",
    "Ironically, despite spending most of the time cooped up in their own homes, workers have enjoyed an unusual level of freedom over the last 18 months. The rise of remote working proved that staff don’t need to be chained to a desk to be productive, and nor do they need to be watched like a hawk. Meanwhile, school closures and other extenuating circumstances have meant employees have been afforded the chance to work outside conventional nine-to-five hours.",
    "As the world emerges from the pandemic, businesses will need to think closely about which elements of this new working culture they will keep and which they will discard. Some will attempt to revert almost completely to old ways of working, in the view that there is no greater productivity hack than bringing people together in the office.",
    "However, according to Tom Fairey, CEO and co-founder of Stakester, this transitional period has created fertile ground for experimentation. Instead of retreating backwards into their comfort zone, he says, businesses should be looking for ways to lean into the positive cultural change brought about by the pandemic.",
    "“A startup is just an experiment,” he told TechRadar Pro. “A lot of startups talk about experimenting with product or marketing strategies, but few talk about experimenting with culture.”",
    "“We don’t want to create a culture whereby people are turning up at 9am, taking their lunch break in the middle of the day and then heading off home in the evening. If you want to get the best out of people, this doesn’t make sense.”",
    "Although Fairey has concocted a number of experiments in recent months, one his most successful initiatives has been to allow his employees an hour of gaming time each day, whenever they want to take it.",
    "Founded in 2019, Stakester is a mobile platform for Android and iOS that connects people looking to play video games (like FIFA, Call of Duty and Rocket League) competitively, with real money at stake.",
    "Before a match begins, each player puts down a sum of money, ranging from $1 to $25. The role of Stakester is to facilitate the match, but also to handle settlement and ensure there is no foul play afoot.",
    "At first glance, Stakester looks a lot like a gambling platform, and by the technical definition perhaps it is. But Fairey says he is categorically against the idea of gambling for the sake of gambling, so the company only allows its users to play skill-based games and only in a one-on-one context.",
    "With most people spending more time at home than usual, Stakester has taken off since the turn of the year. According to Fairey, the company currently has 60,000 active users and is growing at a rate of between 15% and 20% per month. And the platform’s most committed players have featured in hundreds of different matchups.",
    "While picking through this data, however, Fairey noticed another trend. Activity on the Stakester platform showed a 4,500% increase in the number of people playing video games between 2pm and 4pm. At least a proportion of this increase, it was fair to assume, could be attributed to people working from home.",
    "Captured by the idea that gaming could play a role in creating a healthier working day, Fairey made the decision to use his own employees as guinea pigs. And he has been pleasantly surprised with the results.",
    "Although he has no hard data to back up his claims, Fairey told us that productivity levels are notably higher since the introduction of the new gaming policy. He also says relationships between team members have strengthened, his staff are able to solve problems in a more creative way and people are actively choosing to spend more time at the office.",
    "Asked whether the success of his experiment reveals something specific about gaming as a medium, Fairey told us he thinks it speaks more to the value of a particular element of gaming: competition.",
    "While not all employees choose to take up the option of an hour of gaming time at Stakester, many of them do. And Fairey says the majority choose to play multiplayer games against one another, as opposed to more meditative single-player titles.",
    "The company has set up a bot in Slack to pair employees together at random, which means staff are encouraged to build closer relationships with people outside of their immediate team or department. And while there have been some heated contests, people are broadly in a better mood, Fairey reports.",
    "His theory is that the positive effects of competition in a gaming context are similar to those of physical exercise; like physical activity, gaming both demands players’ whole focus (thereby tuning out any work-related matters that might be playing on the mind) and raises the heartbeat to above the normal level. As a keen sportsperson himself, Fairey is convinced that these qualities are key to helping employees remain productive throughout the day.",
    "“We want to be the best company for people to work for. To do that, we try to create an athlete’s mindset; we work on the premise that work + rest = success,” he explained.",
    "“You would never expect a sportsperson to produce their best for four hours straight. So creating an environment where people are incentivized to take active rest has a number of benefits: people are healthier, more relaxed and they can give their brains a chance to reset.”",
    "Of course, Stakester is a very specific kind of company, one already built on the foundation of competition and already embedded in the gaming ecosystem. However, Fairey insists that an experiment like his own would yield the same kinds of results in any business.",
    "“Fundamentally, I think most businesses make the mistake of trying to treat symptoms of low productivity after the fact, rather than trying to encourage people to be healthier in the first place, both mentally and physically,” he told us.",
    "“Naturally, different people escape in different ways. But really it’s about letting people know it’s okay to take a break.”"
  ],
  "headers": {
    "7": "A new trend",
    "13": "The beauty of competition"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Slack": "https://www.techradar.com/reviews/slack"
  }
}