{
  "source": "https://www.techradar.com/news/money-heist-season-5-gets-official-release-date-and-netflix-promises-war-is-coming",
  "title": "Money Heist season 5 gets official release date – and Netflix promises war is coming",
  "category": "entertainment",
  "updated": "2021-05-24T15:55:51Z",
  "author": "axel-metz",
  "summary": "Lock and load",
  "article": [
    "Netflix has announced the release date for Money Heist season 5 – and it’ll be arriving in two parts.",
    "The next 10 episodes of the acclaimed Spanish drama, officially titled La Casa De Papel, will be released in two volumes on September 3 and December 3, 2021, respectively.",
    "Álex Pina, the show’s creator, has suggested the decision to split the show down the middle was based on a desire to ensure season 5 – which will mark the last of the series – lives up to fans' expectations of a finale.",
    "“When we began to write Part 5 in the midst of the pandemic, we felt that we had to change what was expected from the ten-episode season and used every tool we could to create the sensation of a season finale or series finale in the first volume itself,” Pina said in a media statement.",
    "“We decided to work in an extremely aggressive genre, putting The Gang on the ropes. In volume 2, we focus more on the emotional situation of the characters. It is a journey across their sentimental map that connects us directly to their departure,” he added.",
    "Season 5 of the mega-popular series – which quickly became the most-viewed non-English TV show around – will pick up directly after the events of previous episodes, with the gang having been shut inside the Bank of Spain for over 100 hours.",
    "In an official media release, producers gave a hint as to what we can expect from upcoming episodes: “Just when it seems like nothing else could go wrong, an enemy comes on the scene that is much more powerful than any they’ve faced: the army. The end of the greatest heist in history is approaching, and what began as a robbery will turn into a war.”",
    "Expect an even higher body count, then.",
    "This isn’t the first time a Netflix product has seen its final season split down the middle.",
    "Following in the footsteps of shows like The Walking Dead before it, Lucifer season 5 is being released in two parts – with the final episodes arriving later this month. Ozark season 4 will similarly be broken into two lots of episodes.",
    "Given Pina’s comments regarding the change in tone between volumes 1 and 2 of Money Heist season 5, it’s safe to assume that this new format might present the illusion of two totally separate seasons.",
    "We can, at least, expect volume 1 to focus on the show’s trademark run-and-gun action, before making way for a more thoughtful final few episodes in volume 2. The small matter of which characters make it that far is an altogether larger question.",
    "Still, with a December release date set for the series’ true finale, you can bank on another six months of Money Heist-induced hysteria. That is, until the Korean remake comes along to continue its spirit."
  ],
  "headers": {
    "8": "Split down the middle"
  },
  "links": {
    "Ozark season 4": "https://www.techradar.com/news/ozark-season-4",
    "Korean remake": "https://www.techradar.com/news/netflix-is-remaking-one-of-its-most-popular-tv-shows?region-switch=US"
  }
}