{
  "source": "https://www.techradar.com/news/dolby-vision-on-samsung-tvs-why-isnt-it-supported",
  "title": "Dolby Vision on Samsung TVs: why isn’t it supported?",
  "category": "televisions",
  "updated": "2021-07-15T16:00:48Z",
  "author": "rachael-phillips",
  "summary": "Samsung continues to scorn Dolby Vision HDR – but why?",
  "article": [
    "When it comes to HDR video on today's smart TVs, there are a few different formats – including HLG, Dolby Vision, HDR10, and HDR10+. But Dolby Vision is by far the most popular.",
    "So when Samsung – whose screens make up 32.9% of the global TV market, making them one of the world's largest TV producers – chooses to embrace HDR10+ instead of Dolby Vision, it certainly raises some questions.",
    "Samsung has stated that it wouldn’t support Dolby Vision due to added manufacturing costs and an additional license fee – though also because it trusts its own TV processing system and hardware, which it says can optimise HDR10 images without the need for Dolby Vision. Samsung, therefore, decided to support the royalty-free dynamic metadata HDR system HDR10+ exclusively.",
    "HDR10+ is a direct rival to Dolby Vision and has been developed by Samsung in tandem with 20th Century Fox and Warner Bros. But with television manufacturers including Hisense, Panasonic, and Philips supporting both Dolby Vision and HDR10+, are Samsung users missing out and is HDR10+ really the better option?",
    "When it comes to the difference between these two formats, Dolby Vision is considered to be more precise than regular HDR (displayed through the HDR10 format) because content can be encoded frame by frame, which means what you're watching will appear more colorful and dynamic, and be better tailored towards the individual capabilities of the TV it's being played on.",
    "TVs that support Dolby Vision IQ, too, can use brightness sensors to auto-calibrate the picture settings based on the level of light in your room.",
    "The maximum spec for consumer TVs using Dolby Vision goes up to 12-bit colour depth with a possible 68 billion colours on offer. And as for brightness, Dolby allows for levels of up to 10,000 nits (even if no commercial TVs currently hit that spec).",
    "HDR10+ is an HDR format created by Samsung, but as a royalty-free standard, content creators and manufacturers don't have to pay hefty fees to use it. Whilst standard HDR10 uses static metadata, which means that the brightness settings are set at the start of the content you’re watching and don’t change, HDR10+ applies a layer of dynamic metadata to the HDR10 stream. So like Dolby Vision, HDR10+ enhances the HDR images in each frame or scene, so you get better color and much more tonal detail.",
    "HDR10+ has an impressive 10-bit color, which you may think doesn’t stand up to Dolby Visions 12-bit colour system, but it’s worth noting that consumer TVs these days aren't capable of a 12-bit color depth anyway. But that doesn’t mean that the technology to offer 12-bit colour isn’t going to be available in the near future.",
    "So, in essence, HDR10+ and Dolby Vision are similar because they both use dynamic metadata to improve colour, brightness and contrast, which can level up any at-home viewing experience – though both rely on a long pipeline of content creators, distributors and manufacturers playing ball.",
    "There is also the little matter of money, as HDR10+ is an open, royalty-free standard, whilst Dolby Vision requires manufacturers, providers and content creators to pay a license fee to use the system.",
    "Streaming services tend to carry Dolby Vision and HDR10+ content on a title by title basis, meaning it won't be available for most of the content on one service's library.",
    "There are also many 4K Ultra HD Blu-rays that support Dolby Vision, including Blade Runner 2049, Wonder Woman, and Avengers Infinity War. But when it comes to streaming services, Netflix, Disney Plus and Apple TV all offer support for Dolby Vision – with Amazon favoring HDR10+.",
    "Dolby Vision is also available via 4K Apple TV, Google Chromecast Ultra, Fire TV Stick 4K and the Fire TV Cube. Nearly all of these devices support HDR and HDR10+, with the exception of Apple TV 4K, which doesn't offer support for HDR10+.",
    "The Roku Express 4K and Roku Ultra media streaming devices have also been upgraded to include HDR10+ support.",
    "Mark Ely, Vice President of Retail Product Strategy at Roku, confirmed support by saying, \"At Roku, we are dedicated to providing consumers with easy-to-use products that offer a lot of value and choice. We recently announced Roku OS 10, a free software update rolling out to Roku devices, and we have enabled HDR10+ on the all-new Roku Express 4K+, Roku Express 4K and Roku Ultra (2020) products for an even more vivid and bright viewing experience on TVs that support it.\"",
    "Since HDR10+ doesn’t require content creators and manufacturers to pay a license fee, it’s surprising there isn’t much more support for this format. However, the involvement of 20th Century Fox and Warner Brothers means there are over 100 HDR10+ Blu-Ray titles on the market, such as Bohemian Rhapsody and Wonder Woman 1984.",
    "When it comes to streaming services, Amazon Prime Video holds the most content in HDR10+ format. They announced their partnership back in 2017 and have continued to go from strength to strength by making all of its HDR-mastered content available in HDR10+. Google Play, Rakuten, Paramount+ and YouTube are also amongst those that are also on board with ensuring their content is compatible with HDR10+.",
    "Netflix is yet to adopt HDR10+, but told TechRadar back in 2017 that they are open to supporting it in the future. Netflix's Senior Product Manager of its Partner Ecosystem, Richard Smith, said that Netflix would be open to supporting other HDR formats beyond HDR10 and Dolby Vision.",
    "\"We do already support HDR10, not the HDR10+ variant, there’s a possibility we’ll support that in the future, but it’s not something that’s on our roadmap at the moment,\" he said.",
    "But I guess we are still waiting for that partnership to happen. Netflix does, however, support HDR10.",
    "When it comes to apps such as Disney Plus and Apple TV, the services will automatically detect your system's capabilities and play the content in HDR10 if your TV supports HDR, and auto-play in Dolby Vision if that standard is supported / available for the content too.",
    "The HDR10+ website states that over 700 models of TV, Blu-Ray players, and mobile devices are compatible with the HDR10+ format.",
    "All Samsung UHD TV’s made from 2016 will have HDR10+ capabilities. However, new models such as Terrace, Sero, The Frame, or the latest QLED and Mini LED ranges will be even better at displaying HDR10+ content thanks to HDR10+ Adaptive, which will use the TV light sensor to calibrate the picture in response to ambient light, meaning viewers can experience a cinematic experience regardless of the viewing environment.",
    "If you have a Samsung TV that was made between 2016 and 2020, check that your firmware has been updated to enjoy the HDR10+ feature.",
    "Whilst we don’t think that HDR10+ can overtake the popularity of Dolby Vision, it certainly can hold its own – especially with electronics juggernaut Samsung backing it.",
    "Dolby Vision benefits from more advanced technology and support for 12-bit colour at up to 10,000 nits of brightness. In comparison, HDR10+ offers 10-bit of colour and just 4,000 nits of brightness – though Samsung's ultra-bright QLED TVs certainly get closer to the latter brightness spec than OLED TVs do for Dolby Vision.",
    "The open-source nature of HDR10+ could be tempting to some content creators and production companies, too, who don't want to pay a premium for Dolby Vision.",
    "What complicates the question is that many TVs and media streamers simply support both formats. Broad HDR support will package in both, as well as regular HDR10 and even the HLG HDR broadcast standard, and it's likely to get even more rare for devices to only pick one of the above.",
    "It’s also worth mentioning that HDR10+ technology isn’t just available on Samsung televisions. They’ve also included this format on their mobile phones and tablets so you can get 4K video and content whilst on the move. Samsung mobile phone users can even shoot HDR10+ video on their phones.",
    "It's likely that HDR10+ and Dolby Vision are both here to stay for the near future, and as long as they continue to feature on TVs that offer exceptional picture quality, there’s certainly room for both."
  ],
  "headers": {
    "4": "Dolby Vision vs HDR10+",
    "11": "How to watch Dolby Vision",
    "16": "What can you watch in HDR10+?",
    "22": "What Samsung TVs support HDR10+?",
    "25": "Can Samsung and HDR10+ really take on Dolby Vision?"
  },
  "links": {
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision IQ": "https://www.techradar.com/news/dolby-vision-iq-is-about-to-make-hdr-tvs-even-better-to-look-at",
    "4K Ultra HD Blu-rays": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481/news/video/blu-ray/the-best-4k-ultra-hd-blu-ray-movies-1329414",
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "4K Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Google Chromecast Ultra": "https://www.techradar.com/news/new-chromecast-ultra-might-finally-offer-android-tv-interface-and-remote",
    "Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "Roku Express 4K": "https://www.techradar.com/reviews/roku-express-4k-2021",
    "Roku Ultra": "https://www.techradar.com/reviews/roku-ultra-2020",
    "Bohemian Rhapsody": "https://www.techradar.com/news/video/blu-ray/the-best-4k-ultra-hd-blu-ray-movies-1329414/5",
    "TechRadar": "https://www.techradar.com/news/netflix-open-to-supporting-hdr10-standard-in-the-future",
    "HDR10+ website": "https://hdr10plus.org/adopters/",
    "Terrace": "https://www.techradar.com/news/samsung-the-terrace-is-the-first-outdoor-tv-to-get-a-visibility-award",
    "Sero": "https://www.techradar.com/reviews/samsung-sero-tv-review",
    "The Frame": "https://www.techradar.com/news/should-i-buy-samsung-the-frame-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "HDR10+ Adaptive": "https://www.techradar.com/news/new-samsung-tvs-will-calibrate-hdr10-movies-in-response-to-ambient-light"
  }
}