{
  "source": "https://www.techradar.com/news/e3-2021-will-highlight-indie-developers-thanks-to-this-new-partnership",
  "title": "E3 2021 will ‘highlight’ indie developers, thanks to this new partnership",
  "category": "gaming",
  "updated": "2021-05-19T17:02:45Z",
  "author": "emma-boyle",
  "summary": "“We are reimagining E3 in a variety of ways”",
  "article": [
    "E3 is traditionally the event for announcements from some of the biggest publishers and developers in gaming. This year, however, it looks like there will be more opportunities for smaller indie developers to showcase their games, too.",
    "For E3 2021, the ESA has announced that it’s partnering with the nonprofit International Game Developers Association (IGDA) to “elevate” indie developers and provide more opportunities for IGDA members to show off their games at this year’s E3 and beyond.",
    "Details on how exactly this will work are currently a little thin on the ground but in a press release, the ESA mentions that the IGDA will be able to offer its members “special packages and opportunities” for E3 2021, with the hope of expanding this offering into 2022 and beyond.",
    "In a statement, Renee Gittins, Executive Director of the IGDA, said, “The IGDA is thrilled to partner with the ESA to uplift Indies during this year’s E3 and beyond,” adding, “Indies provide heartfelt stories and groundbreaking creativity that lead progress of our industry. It is an honor to help Indies onto this grand stage for the first time so they can share their efforts and inspiration worldwide.”",
    "President and CEO of the ESA, Stanley Pierre-Louis called indie developers “a critical part of the video game industry” and said that the ESA is “thrilled to expand our offerings to create opportunities to showcase their work worldwide.”",
    "“We are reimagining E3 in a variety of ways,” Pierre-Louis said, “and part of that is engaging with indie developers by offering opportunities to help highlight them and their work on a global stage.”",
    "E3 is, indeed, changing things up for 2021. This year, for example, the show is going all-digital for the first time. With a brand new app and portal, the ESA is looking to engage its viewers in more ways than ever before. It seems that this new online approach will be part of showcasing indie developers.",
    "In the E3 2021 portal and app, exhibitors will be able to create their own ‘virtual booths’ and these booths will apparently offer “additional ways for indie developers to engage with media, industry professionals and fans around the world.” It will be interesting to see how this works in more detail during the show.",
    "This year, E3 will take place between June 12 and June 15 and, as mentioned, it’s going to be entirely online. Alongside these indie developers, we’re expecting to see announcements from Nintendo, Microsoft, Ubisoft, Square Enix and more.",
    "Over four days, gaming fans will be able to watch a live broadcast comprising a mix of publisher press conferences, interviews and commentary, as well as explore an interactive online portal with ‘virtual booths’, discussion areas and leaderboards.",
    "Overall, we’ve got a pretty big few months ahead of us as far as games news is concerned. Other than E3, Geoff Keighley’s Summer Game Fest is now confirmed to be kicking off on June 10; Steam Next Fest will get underway on June 16; EA Play taking place slightly later than usual on July 22; then Gamescom (also all-digital this year) in August. Regardless of your preferred gaming platform, there's a good chance that, somewhere in all of that, there's going to be an announcement to interest you."
  ],
  "headers": {
    "6": "Making changes"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "press release": "https://e3expo.com/news/e3-news/the-esa-partners-with-igda-e3-2021",
    "all-digital for the first time": "https://www.techradar.com/news/e3-2021-app-and-online-portal-revealedheres-how-the-all-digital-event-will-work",
    "Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-lineup-confirmed-to-include-playstation-xbox-and-weezer",
    "Steam Next Fest": "https://www.techradar.com/news/steam-next-fest-is-coming-in-june-with-hundreds-of-game-demos",
    "EA Play": "https://www.techradar.com/news/ea-play-2021-confirmed-for-july-following-rumored-battlefield-june-reveal",
    "Gamescom": "https://www.techradar.com/news/gamescom-2021-is-to-be-an-all-digital-event"
  }
}