{
  "source": "https://www.techradar.com/news/rtx-3080-super-and-rtx-3070-super-laptop-gpus-might-have-just-leaked",
  "title": "RTX 3080 Super and RTX 3070 Super laptop GPUs might have just leaked",
  "category": "computing",
  "updated": "2021-06-02T21:17:11Z",
  "author": "john-loeffler",
  "summary": "Super-charged Ampere laptop GPUs on the way?",
  "article": [
    "An allegedly leaked roadmap from Lenovo might have just revealed that Nvidia is getting ready to release new RTX 3080 Super and RTX 3070 Super laptop GPUs in the near future.",
    "The roadmap, which was posted to reddit by user Dr_B_M_Rigney, purports to show the specs for the Lenovo ThinkPad X1 Extreme G4, listing the Nvidia RTX 3070 Super 8GB GDDR6 and RTX 3080 Super 16GB GDDR6 as configuration options for the laptop's GPU, along with the RTX 3060 8GB GDDR6 and GTX 1650 Ti 4GB GDDR6.",
    "For good measure, the laptop also looks to feature Tiger Lake-H processors, a 16-inch, 16:10 display in either 2.5k or 4k resolution, and up to 64GB DDR4 RAM.",
    "We reached out to Lenovo for comment on the purported roadmap and will update this story if we hear back from the company.",
    "There is still an open question about which GPU would power the two Super cards, as Videocardz notes. According to reliable Nvidia leaker kopite7kimi, the GA103 GPU is likely canceled at this point, but Videocardz argues that this GPU is the only one that makes sense for a Super refresh since the RTX 3080 mobile is already maxing out with the GA104 GPU.",
    "There isn't very much information on the GA103 and it doesn't look like any information is really forthcoming, but that does beg the question of what exactly an RTX 3080 Super mobile GPU will look like.",
    "For the RTX 3070 Super, on the other hand, bumping it up to the GA104-400 would add another 1,024 CUDA cores, which would definitely by an upgrade to the mobile RTX 3070's 5,120 CUDA cores, and given that this is the same GPU powering the new RTX 3070 Ti, it makes sense for a mobile RTX 3070 Super to use this chip.",
    "Having just announced the RTX 3080 Ti and RTX 3070 Ti at Computex 2021 this week, making the pivot to mobile GPUs for its next big announcement seems like the most natural move for Nvidia at this point.",
    "So while it's always best to take these kinds of leaks with a grain of salt, especially when the source is a reddit post, it makes perfect sense for these new laptop GPUs to make their way out into the market sooner rather than later.",
    "Just like the inevitability of Ti variants of RTX 3060, RTX 3070, and RTX 3080 cards following – and in the case of the RTX 3060, preceding – the release of the base models, everyone is expecting to see RTX 3000-series Super cards and laptops before too long."
  ],
  "headers": {
    "7": "RTX 3000-series Super GPUs almost certainly coming"
  },
  "links": {
    "Dr_B_M_Rigney": "https://www.reddit.com/r/thinkpad/comments/nqhkhf/i_dont_know_if_it_was_already_posted_or_if_i_am/",
    "Videocardz": "https://videocardz.com/newz/lenovo-expects-geforce-rtx-3080-super-and-rtx-3070-super-laptop-gpus",
    "kopite7kimi": "https://twitter.com/kopite7kimi",
    "isn't very much information": "https://www.techpowerup.com/gpu-specs/nvidia-ga103.g989",
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "RTX 3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "Computex 2021": "https://www.techradar.com/news/computex-2021"
  }
}