{
  "source": "https://www.techradar.com/news/samsung-and-amds-exynos-chip-could-power-your-next-laptop-and-smartphone",
  "title": "Samsung and AMD’s Exynos chip could power your next laptop and smartphone",
  "category": "computing",
  "updated": "2021-05-10T12:58:26Z",
  "author": "hamish-hector",
  "summary": "Apple’s M1 had better watch out",
  "article": [
    "Samsung’s next Exynos chip might not just feature in its smartphones but we could see it in laptops too. While we don’t yet know much about the chipset, it will likely feature an AMD GPU and is set to be Samsung’s latest efforts to combat Apple’s powerful M1 processor.",
    "According to The Korea Economic Daily, industry sources have said that the premium Exynos 2200 chip (set to be unveiled in June) will be used in both Samsung’s smartphones and laptops. This suggests that its phones will not only get a serious bump in processing power but Samsung could be turning its suite of devices into a more unified platform.",
    "That unified approach has been employed by Apple for some time, and with its M1 chip already making the reverse jump from MacBooks to the iPad Pro, it might not be long before we see M1 powered iPhones. Samsung is likely wanting to get out ahead of that announcement with its own souped-up line of handsets and laptops.",
    "Samsung’s laptop Exynos SoC (system on a chip) hasn’t been officially revealed, so until then we won't know how it stacks up for sure. But we can compare what's been leaked about it to Apple's M1 to get an idea of how the processors might compare to each other.",
    "Rumors suggest that the Exynos SoC will use also use a 5nm process, like the M1, suggesting both chips will have similar energy efficiency. Though we could see the Exynos pulling ahead with its AMD GPU.",
    "AMD has a solid footing in the GPU market – making some of the best dedicated graphics processors out there. We'd hope its experience means the Exynos chipset will beat out the M1 in terms of graphical power.",
    "If Samsung can also pull off impressive processing capabilities, its upcoming Exynos chip could be a force to be reckoned with."
  ],
  "headers": {
    "3": "Can the new Exynos chip stand up to M1?"
  },
  "links": {
    "The Korea Economic Daily": "https://www.kedglobal.com/newsView/ked202105090002",
    "MacBooks": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "best dedicated graphics processors": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458"
  }
}