{
  "source": "https://www.techradar.com/news/should-i-buy-a-laser-tv",
  "title": "Should I buy a laser TV?",
  "category": "televisions",
  "updated": "2021-06-03T15:36:08Z",
  "author": "henry-st-leger",
  "summary": "Hisense's TV-projector hybrid explained",
  "article": [
    "Should you buy a laser TV? That's a question that will almost certainly be defined by the amount of spare cash lying around, given the expensive nature of the technology – but those of you with a sizable home cinema budget may be wondering whether laser TV designs are worth buying.",
    "The laser TV is something of a misnomer – it's really an ultra-short throw projector, using a fixed-size projection onto a dedicated ALR screen, theoretically using the advantages of both TV and projector technology in one piece of hardware.",
    "Laser TVs tend to be expensive, but do offer generously-sized images far beyond the upper limits of traditional LCD or OLED screens.",
    "There aren't many players in the laser TV market, most notably Hisense with its 120-inch L5F Laser Series, though Epson has been releasing its own models too. Here's what you need to know about the technology, and which models are available should you want to bring one into your home.",
    "Technically, calling them 'laser TVs' is a bit of a misnomer. They're based on ultra-short throw projection technology, and use an ALR (ambient light reflection) projection screen to effectively reflect light back towards the viewer.",
    "Hisense and Epson use the term laser TV for a few reasons, one of which is almost certainly marketing buzz, but also due to the fact that they feature built-in speakers, a smart platform, and a TV tuner.",
    "As more and more projectors pack in built-in audio and comprehensive smart platforms – something that wasn't the norm even a few years ago – this distinction is starting to soften, though, and there's little reason for the 'laser TV' branding in our minds.",
    "However, that doesn't mean they're not any good! Ultra-short throw laser projection is incredibly handy, allowing you to place it almost flush against a wall or screen without figuring out an ideal distance and placement elsewhere in the room (as with short-throw or long-throw projectors).",
    "Laser projection is bit more expensive than DLP or LCD lamp technology, but offers a crisp picture and generally higher brightness – making it a better choice for daytime viewing or those without a light-proof home cinema room.",
    "Laser TVs retail for around the same amount as premium ultra-short throw projectors (which makes sense, because they're pretty much the same thing!). That means you'll find models starting at around $3,500 / £3,500 / AU$5,000 and going up to as much as $7,000 / £7,000 (AU$7,000 in Australia too), but you'll find more specific information on models in your region below.",
    "There are a handful of Hisense TVs to choose from, which vary slightly between regions.",
    "In the UK, the largest Hisense 'L5' laser TV is 100 inches (£4,999), with a smaller 88-inch (£3,499) model, both of which are pretty sizable compared to today's massive 75-inch TVs).",
    "They're both 4K HDR models, supporting HDR10 and HLG (but not Dolby Vision or HDR10+, which rarely feature on projectors), and come with 2x15W Dolby Atmos speakers. You're getting 10 bit color depth, wide color gamut, and decent 70-degree viewing angles – though the newest 100-inch L5 has a slightly narrow viewing angle of 36 degrees. Both run on the Vidaa U smart platform too, with support for Netflix, Amazon Prime, YouTube and Freeview Play. You won't get HDMI 2.1 or eARC though.",
    "The step-down 100-inch 'Laser' model (£6,999) also offers 4K HDR, but not the Dolby Atmos audio, and can dip to just 8 bit color depth in certain iterations. It does, however, come with a wireless 60W subwoofer to make up for things. Projection distance is apparently 19cm from the screen.",
    "In the US, things are slightly larger. You can opt for the 100-inch L5F ($3,999), or its new-for-2021 iteration that comes in at 120 inches ($4,999) instead. These models run on Android TV, rather than Vidaa U. Otherwise specs are on a par with the UK models above.",
    "Hisense has also released its 100-inch L5 in Australia, where it retails for AU$6,999.",
    "Right now if you're looking for an Epson laser TV, you're looking at the Epson EpiqVision Ultra LS500 Laser Projection TV (yes, it's a mouthful). As with Hisense's largest model, it projects a 4K image onto a 120-inch ALR screen, with 10-bit HDR color depth, and you can see it in action below.",
    "The LS500 currently retails for $4,499 in the US and launched in late 2020, meaning it's still a relatively new model. Versions of it can be hard to find in the UK, but there is a LS500 model with Android TV still retailing for £2,399. If you're in Australia, on the other hand, you'll be able to get the LS500 for AU$5,499.",
    "More recently, Epson released an EpiqVision Ultra LS300 model, which also boasts a 120-inch screen and a sound system designed in partnership with Yamaha, and retails for $1,999 / AU$3,999 in the US and Australia.",
    "While there aren’t many laser TVs on the market, there are enough that they’re worth your consideration if you’re torn between a laser TV (essentially an ultra-short throw projector) and an LED-LCD TV.",
    "Comparing the two is a bit like comparing apples and oranges given the different light emission and display technologies that they employ, but in practice most high-end 4K LED-LCD TVs are going to be just as bright and colorful as this laser TV, and cost a a lot less. They're also likely to support more HDR formats (the Hisense L5F only supports HLG and HDR10) and TVs don't have to worry about replacing the light bulb every 25,000 hours.",
    "The argument for Hisense laser TVs is that they're more versatile in where they can go because you don't need massive pieces of furniture to put them on, and they can obviously offer a slightly larger screen size than LED-LCD screens can. But they also sacrifice one of the main advantages of projectors – that is, the ability to hide away the 'screen' when not in use – so you should think carefully about what your specific home cinema needs.",
    "Ultimately, both have their own advantages and disadvantages, and which one you should go with should be decided by how much space you want to fill and how much you're willing to drop on some new AV gear."
  ],
  "headers": {
    "4": "Laser TVs: how do they work?",
    "9": "Laser TVs: what do they cost?",
    "10": "Hisense laser TVs: what models are there?",
    "16": "Epson laser TVs: what models are there?",
    "19": "Should I buy a laser TV?"
  },
  "links": {
    "projector": "https://www.techradar.com/best/4k-projector",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "75-inch TVs": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "Dolby Atmos speakers": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide"
  }
}