{
  "source": "https://www.techradar.com/news/microsoft-365-will-tell-your-boss-if-youre-misbehaving-online",
  "title": "Microsoft 365 will tell your boss if you're misbehaving online",
  "category": "computing",
  "updated": "2021-10-20T11:15:57Z",
  "author": "joel-khalili",
  "summary": "New Microsoft 365 features will held admins identify potential insider threats",
  "article": [
    "Microsoft is working on a couple of updates for its productivity suite that will help businesses keep closer tabs on the ways their employees are using the web.",
    "As per a new entry in the company’s product roadmap, the Microsoft 365 compliance center (a service for IT administrators) will soon provide “increased visibility of risky activity using browsers and associated insider risk policy templates”.",
    "A second entry, meanwhile, suggests Microsoft will deploy new machine learning (ML) techniques to more accurately detect potential threats and “uncover hidden insider risks”.",
    "In a break from the norm, Microsoft has simply marked these roadmap items as “in development”, without providing more specific timelines.",
    "Although businesses face a wide range of threats from external actors, the security risk created by employees (either intentionally or otherwise) is also significant. According to projections from security firm Mandiant, for example, insider threat will account for a third of all incidents this year.",
    "To help businesses combat this challenge, Microsoft 365 compliance center has long provided administrators with ways to configure alerts that trigger when employees perform certain actions online.",
    "“Web browsers are often used to access both sensitive and non-sensitive files within an organization. Insider risk management allows your organization to detect and act on browser exfiltration signals for all non-executable files viewed in Microsoft Edge and Google Chrome,” a Microsoft guide explains.",
    "Under this system, administrators can choose to be alerted when a member of staff copies files to personal cloud storage or a USB flash drive, for example, or when files are transferred to an insecure network share.",
    "Although the new roadmap entries are rather vague, the suggestion is that the upgrades will provide admins with an increased level of visibility over employee behavior online (perhaps at an interface level), as well improving the likelihood that these kinds of risky activities are detected."
  ],
  "headers": {
    "4": "Microsoft 365 tackles insider threat"
  },
  "links": {
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1453799390815454700&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D82144",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "browsers": "https://www.techradar.com/best/browser",
    "second entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1282118568654431000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3DMicrosoft%2520Compliance%2520center%26searchterms%3D82145",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Microsoft guide": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1354281063787509800&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fmicrosoft-365%2Fcompliance%2Finsider-risk-management-browser-support%3Fview%3Do365-worldwide",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "USB flash drive": "https://www.techradar.com/news/best-usb-flash-drives"
  }
}