{
  "source": "https://www.techradar.com/news/boses-best-noise-cancelling-headphones-get-dollar100-slashed-off-price-in-epic-deal",
  "title": "Bose's best noise-cancelling headphones get $100 slashed off price in epic deal",
  "category": "audio-visual",
  "updated": "2021-06-08T16:02:23Z",
  "author": "mackenzie-frazier",
  "summary": "Get the brilliant Bose QuietComfort 35 II on sale for $249",
  "article": [
    "Snag some of the best noise cancelling headphones on the market with this fantastic deal that we've spotted at Amazon. For a limited time, you can get the Bose QuietComfort 35 II on sale for $249 (was $349.99). That's a $100 discount and the best price we've found for the wireless earphones. If you're interested in Bose's most premium noise cancelling headphones, Amazon also has the top-rated Bose 700 on sale for a record-low price of $329 (was $379.99).",
    "The Bose Quiet Comfort 35 II feature world-class noise cancelation technology with three different levels to fit any environment. As the name implies, the lightweight headphones offer a comfortable around-ear fit with pillow-like cushions that provide all-day comfort. The wireless headphones also work with Amazon Alexa and the Google Assistant so you can control your music, check the weather, and more completely hands-free. The Bose Quiet Comfort 35 II are some of the best noise-cancelling headphones on the market, and this is the lowest price we've seen all year. We can't guarantee you'll see a better deal during the upcoming Amazon Prime Day sale, so you should take advantage now before it's too late.",
    "Not in the US? See the best Bose headphone deals in your region below.",
    "Shop more Bose offers with the best Bose QuietComfort 35 II prices and sales and shop more of the cheapest noise-canceling headphone deals that are currently available."
  ],
  "headers": {
    "1": "Bose headphone deals"
  },
  "links": {
    "on sale for $249": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0756CYWWD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8334860461727026000-20",
    "on sale for a record-low price of $329": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07Q9MJKBV%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3224511805753703000-20",
    "Bose Quiet Comfort 35 II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Bose QuietComfort 35 II prices and sales": "https://www.techradar.com/deals/the-cheapest-bose-quietcomfort-35-ii-prices-and-sales-in-october-2019",
    "cheapest noise-canceling headphone deals": "https://www.techradar.com/deals/cheap-noise-canceling-headphone-deals"
  }
}