{
  "source": "https://www.techradar.com/news/yubicos-new-security-keys-are-available-in-even-more-form-factors",
  "title": "Yubico's new security keys are available in even more form factors",
  "category": "computing",
  "updated": "2021-05-05T17:00:15Z",
  "author": "anthony-spadafora",
  "summary": "YubiKey 5 FIPS Series supports FIDO2, WebAuthn and even smart cards (PIV/CAC)",
  "article": [
    "Yubico has announced that its long-awaited YubiKey 5 FIPS Series of security keys are now generally available with several new mobile-friendly form factors.",
    "The YubiKey 5 FIPS Series is also the industry's first set of multi-protocol security keys with support for FIDO2, WebAuthn and even smart cards (PIV/CAC). With Yubico's new security keys, organizations can achieve strong authentication across both legacy as well as modern infrastructures and devices.",
    "Whether you're using an Android smartphone or an iPhone, the company's new security keys will work with your device as the full FIPS lineup now supports USB-A, USB-C, NFC and Lightning connections. At the same time, the YubiKey 5 NFC, YubiKey 5C NFC and YubiKey 5Ci address the 'tap-and-go' needs of mobile users.",
    "According to the US Department of Defense (DoD), YubiKeys are one of three government-approved alternate authenticators which is why they've become particularly popular with government agencies trying to prevent phishing attempts.",
    "In a press release, a spokesperson for the US Treasury Department provided further insight on Yubico's commitment to the federal market, saying:",
    "“We certainly understand how difficult it is to go through these certification processes, and the Yubico team has shown an unwavering understanding for our evolving needs, particularly during this pandemic. Yubico is a partner that consistently goes above and beyond to support their clients, so we’re thrilled to celebrate this great progress today!”",
    "In addition to the release of the new YubiKey 5 FIPS Series, Yubico has also released the smallest FIPS-validated hardware security module (HSM) in the world, the YubiHSM 2 FIPS.",
    "While the the YubiHSM 2 first launched in 2017, there has never been a version of the product with FIPS (Federal Information Processing Standards) validation.",
    "Now though, high-risk users can achieve and maintain compliance thanks to the YubiHSM 2 FIPS' advanced protection for certificate authority (CA) keys, database master keys, code signing, authentication/access tokens, manufacturing process and component authenticity checks, IoT gateways or proxies, file encryption, cryptocurrency exchanges and more.",
    "As traditional rack-mounted and card-based HSMs are often impractical due to their size and deployment complexity, the YubiHSM 2 FIPS offers a portable 'nano' form factor that allows for fast and flexible deployment across a wide variety of environments. The device also fits easily into a USB-A slot, lying almost flush in order to remain concealed.",
    "All of the new devices in the YubiKey 5 FIPS Series are now available on Yubico's site and they can be purchased individually, in packs of two, in packs of ten or in a tray of 50 for enterprise deployments."
  ],
  "headers": {
    "6": "YubiHSM 2 FIPS"
  },
  "links": {
    "security keys": "https://www.techradar.com/best/best-security-key",
    "FIDO2": "https://www.techradar.com/news/yubico-and-microsoft-want-to-finally-kill-off-passwords-for-good",
    "WebAuthn": "https://www.techradar.com/news/making-secure-login-accessible-to-all-qanda-with-yubico/news/mfa-could-be-the-future-of-workplace-security",
    "Android smartphone": "https://www.techradar.com/best/best-android-phones",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "press release": "https://www.gopjn.com/t/8-12281-101987-191575?sid=trd-us-7795568055657738000&website=194177&url=https%3A%2F%2Fwww.yubico.com%2Fblog%2Fthe-yubikey-5-fips-series-is-here-and-there-are-5-things-you-need-to-know%2F",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "cryptocurrency exchanges": "https://www.techradar.com/best/mining-rigs",
    "enterprise deployments": "https://www.techradar.com/news/yubico-makes-it-easier-for-businesses-to-adopt-security-keys"
  }
}