{
  "source": "https://www.techradar.com/news/hisenses-next-gen-dualcell-4k-tvs-are-finally-coming-to-the-us",
  "title": "Hisense's next-gen Dual Cell 4K TVs are finally coming to the US",
  "category": "televisions",
  "updated": "2021-05-05T17:42:46Z",
  "author": "henry-st-leger",
  "summary": "Here's what's coming from Hisense in 2021",
  "article": [
    "Hisense has unveiled its 2021 TV range for the US, including a Hisense U9DG model that's poised to bring the company's Dual Cell technology to the US for the first time.",
    "Dual Cell is a new would-be premium technology that Hisense is hoping will capture the imaginations of TV shoppers, using (as the name suggests) two TV panel layers for enhanced visuals. Specifically, it uses a 'luminance layer' behind a 4K grayscale panel, effectively outputting a monochrome image and a colored image all at once.",
    "We've seen Dual Cell in action at a host of expos like CES and IFA over the years, but it seems Hisense is finally confident enough to bring it to the US market.",
    "The Hisense U9DG (coming mid-2021) features two million local dimming zones, which on paper is a big step up from the tens of thousands of dimming zones on the latest Mini LED TVs – even if it pales in comparison to the per-pixel lighting of OLED screens. You'll get a 120Hz panel, up to 1,000 nits peak brightness, as well as a host of gaming features such as VRR, ALLM, FreeSync, and \"high-speed HDMI ports\" (which we hope refers to HDMI 2.1, for next-gen gaming capabilities).",
    "That's not all, though. Hisense unveiled yet another 8K TV, showing increasing confidence in the premium display technology – even if the company doesn't offer the multiple 8K model iterations of Samsung or LG. This new set, the U800GR (coming mid-2021), packs in 33 million pixels as well as the beloved Roku smart TV platform and AI upscaling. It features Dolby Vision and Dolby Atmos too, and also 1,000 nits peak brightness – not as bright as new Samsung TVs, certainly, but a pinch higher than today's best OLED TVs.",
    "Other mid-range models include the Hisense U8G ULED (launching May, with 1,500 nits brightness, 4K resolution, Dolby Vision IQ (for calibrating brightness in response to ambient light), Dolby Vision and an anti-glare screen.",
    "There's also a gamer-specific model called the Hisense U7G (coming mid-2021), with a 4K display and 120Hz panel, as well as HDMI 2.1, VRR, ALLM and Freesync Premium for high-spec video passthrough and anti-screen-tearing technologies.",
    "The Hisense U6G (available now) is the lowest specified model in the new 4K TV lineup, making do with a 60Hz panel and 600 nits peak brightness, though it does pack in full array local dimming (rather than edge lighting) as well as Dolby Vision / Dolby Atmos format support. Budget models A6, R6, and R7 didn't get shown off during the announcement event, but the A series set is already available while the R series models are coming late 2021.",
    "Every new TV screen listed here runs on Android TV except for the Hisense 8K Roku model cited above. We've yet to receive pricing information, other than a $4,999 price tag for a new iteration of Hisense's 120-inch projection laser TV (the L5F, available now), though we'll be sure to update you on the news when we get it.",
    "Hisense's 2021 TV event was also hosted by American actor-comedian Joel McHale (Community, The Joel McHale Show), for some reason – but given the oft-dry nature of these events, it was a welcome diversion."
  ],
  "headers": {
    "4": "There's more!"
  },
  "links": {
    "Dual Cell technology": "https://www.techradar.com/news/hisense-dual-cell-tvs-are-here-but-will-they-fare-better-than-the-o8b-oled",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "120Hz": "https://www.techradar.com/best/120hz-4k-tvs",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "Samsung or LG": "https://www.techradar.com/news/samsung-vs-lg-tv-which-tv-brand-is-better",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "best OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Dolby Vision IQ": "https://www.techradar.com/news/dolby-vision-iq-is-about-to-make-hdr-tvs-even-better-to-look-at"
  }
}