{
  "source": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
  "title": "Sony TV 2021: every Master Series and Bravia OLED announced so far",
  "category": "televisions",
  "updated": "2021-12-07T15:32:14Z",
  "author": "henry-st-leger",
  "summary": "Every Sony TV that's been released in 2021",
  "article": [
    "The Sony TV 2021 lineup is one of the smartest, fastest and most feature-rich range of TVs that the Japanese company has ever released.",
    "That’s big praise, of course, but thanks to the new Cognitive XR Processor in every new Sony TV, from the high-end Master Series all the way through to the mid-spec X90J, it really rings true. That’s because the new processor brings even smarter intelligence analysis, which results in better picture and better sound.",
    "One of the best Sony TVs we’ve had the pleasure of reviewing in 2021 is the Sony A90J OLED TV. We awarded it 5 out of 5 stars due to its fantastic picture quality, robust sound, new OS and much more. However, with prices starting at $2,799 / £2,699 it’s not exactly cheap.",
    "Step down from the premium models and you’ll find mid-range displays, like the Sony X95J, which is the flagship 4K LCD of 2021. If you’re looking for cheaper still, there’s the TVs in the entry-level Bravia series for 2021, including the Sony X90J and X80J. We awarded the X90J 4.5 out of 5 stars when we reviewed it and believe it’s one of the best mid-range 4K TVs money can buy in 2021.",
    "There are no big changes in terms of display size or new models this year, everything out in 2021 has improved upon its predecessor – but often significantly. In this guide we’ll run through all of the new Sony TVs of 2021, as well as take a look at how the range has improved on the best displays of 2020.",
    "Sony Z9J Master Series LED-LCD 8K TV (available in 85- and 75-inches): This is the 8K TV in Sony’s Z9J Master Series.",
    "What makes the Z9J appealing is that it uses the Cognitive XR Processor to enable a feature called XR Contrast Booster 15 that greatly enhances contrast by boosting brightness and black levels with better zone controls, and has the highest-performing upscaling algorithm in the lineup that it needs to fill all those pixels.",
    "It has X-Anti Reflection that reduces glare and X-Wide Angle viewing that helps you see every detail from anywhere in the room and both a light and color temperature sensor that reads the intensity of the ambient light in the room and adjusts the picture accordingly. Last but not least, the legs of the Z9J can be adjusted to fit both wide and narrow TV stands, or it can be wall-mounted if that works better for your space.",
    "Sony A90J Master Series OLED 4K TV (available in 83-, 65- and 55-inches): The A90J earns its Master Series status by being one of the brightest OLED TVs ever made - this is because of Sony’s work on thermal dissipation and the new Cognitive XR Processor that can accurately balance the RGB and White subpixels simultaneously for extreme brightness.",
    "You'll be getting 4K resolution, as well as 4K/120Hz video at 48Gbps through multiple (at least two) HDMI 2.1 ports, and both VRR (variable refresh rate) and ALLM (auto low latency mode). The A90J also supports Dolby Atmos passthrough, as well as HDR10 and Dolby Vision dynamic HDR. That said, it's not cheap (you can see the pricing below).",
    "Read more: Sony A90J OLED",
    "Sony A80J OLED 4K TV (available in 77-, 65- and 55-inches): The Sony A80J is the lesser of the two Sony 2021 OLEDs, but only because it lacks the higher brightness of the A90J. Even without it, the A80J has some seriously impressive technical specs and uses XR 4K Upscaling, XR Triluminos Color Pro and XR Motion Clarity.",
    "Because it’s not as fully specified as the A90J, we’re expecting the A80J to be the more affordable of the two OLEDs, and if it can deliver most of the same performance then it will be a seriously compelling alternative to the LG CX OLED and LG BX OLED from last year.",
    "Read more: Sony A80J OLED",
    "Sony X95J 4K LED-LCD TV (available in 85-, 75- and 65-inches): The Sony X95J is the first step down in that middle range of the Sony TV lineup from the pricey premium models. That said, you’re not sacrificing a ton of features to be here: the X95J still offers the XR Contrast Booster that the Master Series uses (though it won’t be as bright) and the XR 4K Upscaling technology. It has X-Wide Angle, XR Motion Clarity and 3D Audio Upscaling thanks to the Cognitive XR Processor, but will only have X-Anti-Reflection on the two larger models.",
    "In terms of changes compared to last year’s X950H/XH95, one of our favorite Sony TVs from 2020, the X95J is slimmer by about 10mm and adds HDMI 2.1 ports for 4K/120 gameplay – perfect for the PS5 and Xbox Series X. That was a huge sore spot on last year’s X950H, so it’s great that Sony has added them in for this year.",
    "Read more: Sony X95J",
    "Sony X90J and X92J LED-LCD TV (available in 75-, 65-, 55- and 50-inches, X92 available in 100-inches): While the X90J doesn’t have all the fancy features like the color sensor of the Z9J or the X-Contrast Pro of the A90J OLED, the X90J has the one feature that really counts: the Cognitive XR Processor. With it, the X90J has the same XR 4K Upscaling as the other TVs, the same XR Triluminos Pro tech to enhance colors and 3D Surround Upscaling.",
    "It has Dolby Atmos passthrough and 4K/120 support. It has the potential to offer unparalleled value to anyone who wants a cinephile-quality TV at an affordable price, and we can’t wait to test it for ourselves. The X92J model is the 100-inch option.",
    "Read our full Sony X90J review",
    "Sony X80J / X81J LED-LCD TV (available in 43, 50, 55, 65, 75-inch): If you want an even cheaper option, the Sony X80J is a step-down model with a 60Hz panel, meaning you won't get the benefits of HDMI 2.1 found on the X90J above. You will, however, get a 4K HDR panel, the Google TV platform, and the capable X1 processor from previous Sony TV ranges. The X80J also packages all this at around half the price of the X90J, starting at $749 / £584 (around AU$1,000) for a 43-inch model. The Sony X81 variation in the UK adds some more advanced motion processing and will cost slightly more at smaller sizes too.",
    "So, what’s new with Sony TVs this year? The main change comes in the form of its Cognitive XR processor, which brings an upgrade in capability to its 2021 TV range.",
    "Can Sony one-up the X1 Ultimate processor that's been driving its premium TVs for the past few years? Sony certainly thinks so, saying that the Cognitive XR chip utilizes a “completely new processing method designed to replicate the ways humans see and hear”, detecting a so-called “focal point” in the TV’s picture to focus processing around the more important parts of the image. “While conventional Artificial Intelligence (AI) can only detect and analyze picture elements like color, contrast and detail individually, the new processor can cross-analyze an array of elements at once, just as our brains do,” Sony says.",
    "On top of the new processor, each model of the Sony 2021 line-up uses the new Google TV smart platform instead of the older Android TV software. That means you’ll essentially get a Chromecast with Google TV built into your TV which, considering that a standalone streaming stick would set you back $49 / £59 / AU$99, feels like a nice perk. Baked in support for Google Assistant is a given, though you can also connect your TV to smart speakers like the Amazon Echo (which uses Alexa) too.",
    "In an interview with TechRadar, Sony told us that many of its 2021 TVs support 4K/120Hz with at least two 48Gbps HDMI 2.1 ports, and the Master Series will also offer a third HDMI port that’s 8K/60Hz-enabled. VRR (variable refresh rate) and ALLM (auto low latency mode) features are supported for gamers, helping to ensure responsive play and a smooth picture, while eARC (enhanced audio return channel) allows for lossless audio passthrough from the TV to a connected soundbar.",
    "You’ll also get Dolby Vision support across the series as well as Dolby Atmos passthrough in every model as well.",
    "While that last bit makes the Sony 2021 series perfect partners for a Sony-made Dolby Atmos soundbar, the company is making some major changes to the built-in audio of its TVs that will make them sound a lot better out of the box. The highlight of these features is called XR Surround that can take a two-channel or 5.1 surround signal and convert it to 5.1.2 – meaning you’ll have a basic faux-Atmos system with every TV you purchase. The impact of this will, we expect, vary between the audio capabilities of individual sets.",
    "We've also seen the return of Sony’s Acoustic Surface Audio+ technology, which uses motor-driven ‘actuators’ placed around the set’s casing to vibrate sound across the whole panel. It’s a neat concept in theory, though it can serve to muddy the audio somewhat as it spreads it around.",
    "The much-marketed Netflix Calibrated Mode makes a return, too – even if we wouldn’t bother using it – but IMAX Enhanced is also supported for those with compatible content.",
    "Sony Z8H 8K LCD (available in 75, 85 inches): Sony's flagship 8K display was one of two new sets shown off at CES this year, with an X1 Ultimate processor, 4K video at 120Hz, Dolby Vision / Atmos, Netflix Calibrated Mode, and even moveable feet for easy placement in your home. Its new 'frame tweeters' should enhance Sony's Acoustic Surface Audio+ tech, too.",
    "Pricing starts at $5,999 / £5,999 for the 75-inch model, going up to $8,999 / £8,999 for the 85-inch – which is a good sight cheaper than last year's Z9G model. Buyers in Australia only get the larger size, which will set them back AU$18,999.",
    "Read our full Sony Z8H/ZH8 8K TV review",
    "US models: XBR-75Z8H, XBR-85Z8H",
    "UK models: KD-75ZH8, KD-85ZH8",
    "Sony A8H 4K OLED (available in 55, 65 inches): This 4K/HDR display may have lower specs than the Z8H flagship, but it's still a heavyweight in Sony's 2020 TV lineup. Its OLED panel will ensure deep blacks and incredible brightness control, with the X1 Ultimate processor, Dolby Vision / Atmos support, and Netflix Calibrated Mode to make it shine. This year's OLED also gets Sony's X-Motion Clarity technology for the first time, which should help smooth out fast-moving scenes.",
    "The A8H retails at $1,899 / £1,799 for the 55-inch, and $2,799 / £2,799 for the 65-inch. It's now on sale, too.",
    "Read our full Sony A8H/AH8 4K OLED TV review",
    "US models: XBR-55A8H, XBR-65A8H",
    "UK models: KD-55AH8, KD-65AH8",
    "Sony A9G 4K OLED (new 48-inch size): Hold on, isn't this a 2019 model? Correct! But Sony is using the stellar A9G to introduce its first 48-inch OLED display. Other manufacturers such as LG will be doing the same in their TV ranges, but Sony will still be one of the first few doing so. It's now available to preorder for £1,799 in the UK, with a similar $1,799 pricing expected in the US shortly.",
    "Read our full 48-inch OLED TV guide",
    "US models: XBR-48A9G",
    "UK models: KD-48AG9",
    "X950H 4K LCD (available in 49, 55, 65, 75, 85 inches): Another LCD set with the X1 Ultimate processor, Dolby Vision / Atmos, and the Sound-from-Picture Reality tech for pinning audio to its source onscreen. The 55-inch, 65-inch, and 75-inch models have a flush design with minimal bezel, too.",
    "Pricing starts at £1,199 / $999 for the 49-inch size, with successive sizes costing £1,599 / $1,399, £1,999 / $1,999, and (a considerably higher) £3,199 / $3,499 respectively. The largest 85-inch model is priced at £3,999 / $4,499 too.",
    "Sony is making a number of improvements this year like the expansion of X-Wide Angle technology to the 55- and 65-inch models and improved Acoustic Multi-Audio, one of the biggest issues we had with last year’s X950G.",
    "Read our full Sony Bravia X950H/XH95 TV review",
    "US models: XBR-49X950H, XBR-55X950H, XBR-65X950H, XBR-75X950H, XBR-85X950H",
    "UK models: KD-49XH9505, KD-55XH9505, KD-65XH9505, KD-75XH9505, KD-85XH9505",
    "X900H 4K LCD (available in 55, 65, 75, 85 inches): A 4K/HDR set that uses the less advanced X1 processor. You won't get as advanced picture processing, but you still get the same format support and full-array local dimming for detailed brightness control.",
    "Read our full Sony X900H/XH90 TV review",
    "US models: XBR-55X900H, XBR-65X900H, XBR-75X900H, XBR-85X900H",
    "UK models: KD-55XH9005, KD-65XH9005, KD-75XH9005, KD-85XH9005",
    "X800H 4K LCD (available in 43, 49, 55, 65, 75, 85 inches): Same X1 processor as above, but without the full array local dimming – meaning brightness won't be as consistent. UK shoppers will be able to choose between the XH80, XH81 and XH85, with each varying slightly in the design, feet, and sizing.",
    "The 43-inch version will cost $699 / £649 (around AU$1,150), the 55-inch will come in at $999 / £949 (around AU$1,650) while the 65-inch and 75-inch come in at $1,199 / £1,099 (around AU$1,980) and $1,799 / £1,899 (around AU$2,970), respectively, and the range-topping 85-inch X800H at $2,699 / £2,499 (around AU$4,450). These prices are for the XH80 model, with the XH81 and XH85 varying only slightly.",
    "US models: XBR-43X800H, XBR-49X800H, XBR-55X800H, XBR-65X800H, XBR-75X800H",
    "UK models: KD-43XH8505, KD-49XH8505, KD-43XH8196, KD-49XH8196, KD-55XH8196, KD-65XH8196, KD-43XH8096, KD-49XH8096, KD-55XH8096, KD-65XH8096, KD-75XH8096, KD-85XH8096",
    "X70 4K LCD (available in 49, 55, 65 inches): Likely the cheapest 4K/HDR set in the Sony 2020 TV lineup, this UK-only set ditches the Dolby Atmos and Dolby Vision support for simpler television offering. Expect lower-spec processing too.",
    "The X70 starts at just £599 (around $740 / AU$1,220) for the 43-inch model, with additional 49-inch, 55-inch, and 65-inch sizes available – at £699 (around $860 / AU$1,430), £799 (around $990 / AU$1,630) and £899 (around $1,110 / AU$1,840) respectively.",
    "UK models: KD-49X7052, KD-55X7052, KD-65X7052",
    "Everything you need to know about the best TVs of 2021:",
    "Best TV 2021: the best flatscreen televisions from the past year",
    "Best smart TV 2021: every smart TV platform and which set does it best",
    "Best 65-inch 4K TV: the best big screen TVs for any budget",
    "TV stands: finding the best TV stand to suit your living room cinema needs"
  ],
  "headers": {
    "21": "Sony 2021 TV technology",
    "29": "2020 Sony TVs"
  },
  "links": {
    "X90J": "https://www.techradar.com/reviews/sony-x90j-xr-65x90j",
    "Sony A90J OLED TV": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "Sony X95J": "https://www.techradar.com/news/sony-x95j-4k-tv-price-release-date-specs-sizes",
    "Sony X90J and X80J.": "https://www.techradar.com/news/cant-afford-oled-these-sony-4k-tvs-are-much-better-value",
    "Sony A90J OLED": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "Sony A80J OLED": "https://www.techradar.com/news/sony-a80j-oled-price-specs-release-date",
    "PS5 and Xbox Series X": "https://www.techradar.com/news/ps5-vs-xbox-series-x-which-next-gen-console-should-you-buy",
    "Sony X90J review": "https://www.techradar.com/reviews/sony-x90j-xr-65x90j",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "43-inch": "https://www.techradar.com/news/best-40-inch-tv",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review/reviews/amazon-echo-2020",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "IMAX Enhanced": "https://www.techradar.com/news/imax-enhanced-an-inside-look-at-the-new-standard-heading-to-home-theaters",
    "Z9G": "https://www.techradar.com/reviews/sony-bravia-master-series-z9g-8k-hdr-tv",
    "Sony Z8H/ZH8 8K TV review": "https://www.techradar.com/reviews/sony-z8hzh8-8k-tv",
    "now on sale": "https://www.techradar.com/news/the-sony-a8h-oled-is-a-4k-hdr-tv-with-smooth-blur-free-action-and-its-now-on-sale",
    "Sony A8H/AH8 4K OLED TV review": "https://www.techradar.com/reviews/sony-bravia-a8h-oled-tv",
    "It's now available to preorder": "https://www.techradar.com/news/sonys-first-48-inch-oled-tv-is-finally-here",
    "48-inch OLED TV": "https://www.techradar.com/best/48-inch-oled-tv",
    "55-inch": "https://www.techradar.com/best/55-inch-4k-tv",
    "65-inch": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "75-inch": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "Sony Bravia X950H/XH95 TV review": "https://www.techradar.com/reviews/sony-bravia-x950hxh95-4k-led-lcd-tv",
    "Sony X900H/XH90 TV review": "https://www.techradar.com/reviews/sony-xh90-kd-75xh9005-4k-tv",
    "Best TV 2021": "https://www.techradar.com/news/best-tv-uk",
    "Best smart TV 2021": "https://www.techradar.com/news/best-tv",
    "Best 65-inch 4K TV": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "TV stands": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs"
  }
}