{
  "source": "https://www.techradar.com/news/rumored-canon-eos-r5c-could-fix-the-canon-eos-r5s-video-weaknesses",
  "title": "Rumored Canon EOS R5c could fix the Canon EOS R5's video weaknesses",
  "category": "cameras",
  "updated": "2021-03-18T10:06:07Z",
  "author": "mark-wilson",
  "summary": "Overheating, begone",
  "article": [
    "The Canon EOS R5c is strongly rumored to be an incoming, video-focused version of the Canon EOS R5 – and yet another powerful mirrorless camera for pro filmmakers in 2021.",
    "Canon Rumors has posted a very confident declaration stating that the Canon EOS R5c is \"confirmed\" and \"is going to be announced this year\". The site has also given the rumor its highest trust rating, which it reserves for when \"we're sure what we're posting if a fact\".",
    "The EOS R5c sounds likely a pretty likely launch, then, but what kind of camera will it be? Canon Rumors says the EOS R cinema camera \"will be equipped with the same image sensor as the EOS R5 and will have all of the same recording options\".",
    "But the big news is that it's expected to have \"a slightly bigger body with active cooling\" and will \"also remain a hybrid camera for stills shooting\". As a camera that'll be aimed at pro cinematographers, it'll also apparently have C-Log 2 profile, which helps preserves dynamic range so the footage can be color graded afterwards.",
    "Given the EOS R5c is tipped to have the same sensor as the Canon EOS R5, this means we can expect it to have a 45MP resolution with Dual Pixel AF II, plus the ability to shoot 8K/30p. Like its more photography-focused sibling, it'll also likely be able to shoot raw video internally and slo-mo 4K/120p, too.",
    "The big question, though, is how much larger the rumored Canon EOS R5c will be, and whether it'll have the same level of weather-resistance as the EOS R5. Canon already has the Canon EOS C70 in its lineup, which is its lightest Cinema EOS camera and smaller than DSLRs like the Canon EOS 1DX Mark III. But it's possible the EOS R5c will slot in between than cinema camera and the EOS R5.",
    "These rumors about a Canon EOS R5c follow a big recent trend of camera manufacturers blurring the lines between their best mirrorless cameras and their cinema lines – in order to produce small, powerful bodies that can slot into tight spaces on production sets or be used for high-quality b-roll footage.",
    "Sony recently launched the Sony FX3 which, like the rumored Canon EOS R5c, straddles the border between its Alpha cameras (aimed primarily at photographers) and its Cinema range. While the Sony A7S III already filled a similar role to the FX3, its design had photography leanings due to its Alpha heritage – so Sony built the FX3 entirely for filmmakers.",
    "Like the rumored Canon EOS R5c, this included features like fan-assisted active cooling, which helps it shoot longer continuous clips. One of the biggest criticisms of the Canon EOS R5 has been its overheating issues when shooting video, in particular the long recovery times needed after shooting 8K or 4K/60p video, so it's no surprise to hear that the Canon EOS R5c might have fans to help it overcome this.",
    "But it'll also be interesting to see if Canon matches Sony in providing accessories like the FX3's bundled handle, which brings the twin XLR/TRS jacks needed for pro audio recording that are usually missing on smaller mirrorless cameras.",
    "We may have a little wait to find out for sure, with Canon Rumors expecting the Canon EOS R5c's announcement to be in \"ate 2021, with availability in early 2022\". But with the site promising \"more to come\" on the rumors front, there could yet be more intriguing leaks in the meantime."
  ],
  "headers": {
    "6": "Blurring the lines"
  },
  "links": {
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Canon Rumors": "https://www.canonrumors.com/confirmed-a-canon-eos-r5c-is-going-to-be-announced-this-year-cr3/",
    "EOS R5": "https://www.canonrumors.com/recommends/canon-eos-r5/",
    "Canon EOS 1DX Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "best mirrorless cameras": "https://www.techradar.com/news/best-mirrorless-camera",
    "Sony FX3": "https://www.techradar.com/news/sony-fx3-is-officially-its-smallest-cheapest-cinema-camera-for-pro-filmmakers",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii"
  }
}