{
  "source": "https://www.techradar.com/news/windows-10-may-2021-21h1-update-is-out-but-dont-get-too-excited",
  "title": "Windows 10 May 2021 (21H1) Update is out, but don’t get too excited",
  "category": "computing",
  "updated": "2021-05-19T08:57:16.725Z",
  "author": "darren-allan",
  "summary": "21H1 doesn’t do much, and it sounds like Microsoft is going for a cautious initial rollout",
  "article": [
    "Windows 10 May 2021 Update has arrived, but the first feature update of 2021 really isn’t anything to get excited about for several reasons.",
    "Windows 10 21H1, as the upgrade is also referred to, is just a minor update, as we already knew, mostly consisting of fine-tuning the operating system and fixing bugs, although some small feature additions and tweaks have been applied (more on those later).",
    "Overall, Windows 10 21H1 doesn’t do much, and also, it sounds like Microsoft is being quite cautious with the rollout. The software giant says: “In the current environment, we know that you continue to rely on your PCs more than ever. As a result, we are initially taking a measured seeker-based approach to the rollout of the May 2021 Update.",
    "“We are throttling availability up over the coming weeks to ensure a reliable download experience for all, so the update may not be offered to you right away.”",
    "This is standard practice for a Windows 10 feature update deployment, of course, as the phased rollout ensures that not too many devices will be affected by any unforeseen problems which crop up as more computers receive the upgrade.",
    "However, the way it’s phrased here – the ‘current environment’ of working from home in many cases, and therefore the PC being a vital tool to keep up and running flawlessly – makes us think that it sounds like Microsoft could be going for an extra cautious opening of the update floodgates.",
    "That would make sense, particularly as there is nothing hugely compelling to get with the Windows 10 May 2021 Update. The small feature additions we mentioned at the outset include Windows Hello getting multi-camera support, and some bolstering on the security front with performance improvements for Windows Defender Application Guard.",
    "There are also improvements to Windows Management Instrumentation (WMI) Group Policy Service (in remote working scenarios in particular) and a bunch of security updates.",
    "If you do want the Windows 10 21H1 update on your machine right now, you’ll have to be running version 2004 of the OS (20H1 or May 2020 Update) or 20H2 (October 2020 Update) – either of last year’s upgrades, in other words – and you’ll need to manually search for the May 2021 Update.",
    "To do this, go to ‘Windows Update settings’ (simply search for that in the Windows 10 search box on the taskbar) and click ‘Check for updates’. If your PC is ready for the update, it’ll appear – but bear in mind that only some hardware configurations will be eligible to upgrade, and this is a gradual (possibly very cautious) rollout as mentioned, so you may have to wait a while anyway.",
    "If you do get the opportunity to grab the upgrade, it’ll be a quick download and install, seeing as this is just another enablement package for Windows 10 (meaning the files are already in place, in the background, for 20H1 and 20H2 users, a switch just needs ‘flicking’ to enable them – which was also the case for those upgrading from 20H1 to 20H2)."
  ],
  "headers": {
    "8": "Seek and install (maybe)"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 10 21H1": "https://www.techradar.com/how-to/how-to-get-the-windows-10-may-2021-21h1-update",
    "as we already knew": "https://www.techradar.com/news/windows-10-may-2021-update-is-finally-done-and-should-be-rolling-out-soon",
    "says": "https://blogs.windows.com/windowsexperience/2021/05/18/how-to-get-the-windows-10-may-2021-update/",
    "May 2020 Update": "https://www.techradar.com/how-to/windows-10-may-2020-update-problems-how-to-fix-them",
    "October 2020 Update": "https://www.techradar.com/news/windows-10-october-2020-update-is-finally-ready-heres-how-to-download-it",
    "enablement package for Windows 10": "https://www.techradar.com/news/windows-10-leak-shows-21h1-update-is-a-minor-one-and-could-arrive-sooner-than-expected"
  }
}