{
  "source": "https://www.techradar.com/news/forget-the-iphone-usb-c-might-also-be-the-new-universal-laptop-charger",
  "title": "Forget the iPhone, USB-C might also be the new universal laptop charger",
  "category": "computing",
  "updated": "2021-09-28T10:11:44Z",
  "author": "jess-weatherbed",
  "summary": "Sweet market consistency",
  "article": [
    "USB-C has been discussed on the news a fair bit this week after new legislation being proposed by the European Commission looks to introduce a universal charging standard for smartphones.",
    "As it turns out, a new USB-C Type 2.1 standard has been released that could see a similar proposal for laptops and 2-in-1 devices over the coming years. This beefier USB-C cable is capable of delivering 240 W (with the current USB-C Type 2.0 limited to 100 W), which is more than enough juice to power even the hungriest of gaming laptops and mobile workstations.",
    "Given Apple may be forced to ditch its Lightning port connector on future iPhones if this legislation being proposed comes into force, it's not too farfetched to foresee something similar being proposed outside of the smartphone industry to cut down on e-waste.",
    "As PC Gamer points out in its reporting, the previous 100 W (20V at 5A) limitation was sufficient for ultrabooks and gaming laptops running older graphics cards like the GTX 1650 Ti, but didn't pack enough power to top up more powerful laptops while it was in use, instead, consuming the power as it was coming in.",
    "There are plenty of laptops that also support Thunderbolt 3 connections (a port identical to a standard USB-C) alongside whatever charging brick they also use, allowing you to keep your laptop charged up while hooked up to external monitors and expansion docks, and some devices like the Apple MacBook Air that have already adopted the USB-C as its default charger.",
    "The EU forcing Apple to switch to a universal charging standard may feel out of line, but we can certainly see the appeal of only requiring a single charger for numerous devices, just as we've been seeing with the booming popularity of USB-C over the last few years.",
    "It can be frustrating that many of the best laptops on the market support USB-C charging or Thunderbolt 3, but maintain that hefty, external power brick for you to carry around. It's far too early for the EU to get involved with a universal charging cable legislation outside of the mobile phone industry, but given so many new laptops already support it (and indeed, some devices have already made the switch entirely) we believe a similar proposal would be largely welcome.",
    "Outside of people concerned about regulations like this 'suffocating creativity', having such a wide array of different charging styles feels incredibly ineffective and wasteful. Every new tablet or smart device these days comes with a charger, be it a pin, USB-A or USB-C to the point where most households have accumulated a charging cable graveyard.",
    "Cables do not need to be creative, they serve a single purpose – to keep your device running. If USB-C can now potentially power even the most demanding of hardware, we'd be thankful to not have yet another niche power brick to add to our households."
  ],
  "headers": {
    "5": "Analysis: Thunderbolt 3 could soon be universal"
  },
  "links": {
    "universal charging standard for smartphones": "https://www.techradar.com/news/your-next-iphone-may-finally-ditch-lightning-for-usb-c-because-of-this-new-law",
    "USB-C Type 2.1 standard has been released": "https://usb.org/document-library/usb-type-cr-cable-and-connector-specification-revision-21",
    "2-in-1 devices": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "mobile workstations": "https://www.techradar.com/news/best-mobile-workstations",
    "PC Gamer points out in its reporting": "https://www.pcgamer.com/usb-type-c-2-1-240w-gaming-laptop-power/",
    "Apple MacBook Air": "https://www.techradar.com/news/mobile-computing/laptops/macbook-air-2016-news-release-date-and-rumours-1318167?region-switch=1613260800",
    "best laptops on the market": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361"
  }
}