{
  "source": "https://www.techradar.com/news/nvidia-rtx-4000-gpus-rumored-to-be-a-major-refresh-on-5nm-in-2022",
  "title": "Nvidia RTX 4000 GPUs rumored to be a ‘major refresh’ on 5nm in 2022",
  "category": "computing",
  "updated": "2021-11-30T12:48:01Z",
  "author": "darren-allan",
  "summary": "Fresh leak comes direct from supply chain in Taiwan",
  "article": [
    "Nvidia has new ‘Lovelace’ graphics cards that are due to arrive in 2022 which will use TSMC’s 5nm process, a fresh rumor asserts.",
    "And this time – we have, of course, heard this from the grapevine before – the info comes purportedly direct from the supply chain.",
    "The latest speculation is from DigiTimes, which is a somewhat hit-and-miss source, so let’s remain skeptical. The report was highlighted on Twitter by prolific leaker Retired Engineer, and it claims that the word from the factories in Taiwan which will manufacture the GPUs is that ‘Lovelace’ is indeed on 5nm as previously rumored, and will be a ‘major refresh’ for Nvidia (as expected).",
    "As noted, the Hopper GPUs are heavyweight cards for data center usage, and might go the MCM chiplet route, meaning multiple chips on the card, whereas the RTX 4000 products will supposedly stick with a monolithic design (a single GPU).",
    "No other details are imparted by the DigiTimes article, but previous rumors hold that the RTX 4090 could have 18,432 CUDA cores, and be armed with 24GB of GDDR6X VRAM and a 384-bit memory interface. It’s expected to be clocked at around 2.3GHz to 2.5GHz, and to be an extremely powerful GPU – possibly in the order of 2.5x faster than the current RTX 3090.",
    "All the above, including the latest info from the supply chain revealed here, should be taken with a massive amount of salt, naturally. This new leak adds considerable weight to the 5nm TSMC assertion, of course – although we were already fairly sure about that prospect – and we can take it from all the previous spillage around the RTX 4090 flagship that it’s likely to be seriously powerful. Which means, of course, that the rest of the range will follow broadly in line with that.",
    "The obvious concern for such a powerful next-gen graphics card, though, is the kind of price tag that this CUDA core-loaded monster might command (as if the RTX 3090 wasn’t expensive enough as is). And as we’ve already heard before, it’s not just about the demands it might make on your wallet, but also your PSU (which, if you need to upgrade the power supply, will mean more cash needing to be stumped up).",
    "Backing up the early pessimism about the potentially seriously steep power demands from ‘Lovelace’ cards is the fresh rumor that the pepped-up RTX 3090 Ti could up its TDP to 450W (100W more than the current RTX 3090).",
    "Via Wccftech"
  ],
  "headers": {
    "5": "Analysis: Seriously powerful and proportionately pricey no doubt"
  },
  "links": {
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "possibly in the order of 2.5x faster than the current RTX 3090": "https://www.techradar.com/news/fresh-leak-hints-at-how-amd-vs-nvidia-next-gen-gpu-battle-is-shaping-up",
    "but also your PSU": "https://www.techradar.com/news/next-gen-nvidia-rtx-4000-gpus-could-be-twice-as-fast-and-power-hungry-as-rtx-3000",
    "upgrade the power supply": "https://www.techradar.com/news/best-pc-power-supply",
    "fresh rumor": "https://www.techradar.com/news/nvidia-may-be-launching-an-rtx-3090-ti-after-all",
    "pepped-up RTX 3090 Ti could up its TDP to 450W": "https://www.techradar.com/news/nvidia-rtx-3090-ti-could-arrive-with-faster-vram-but-will-anyone-be-able-to-buy-it",
    "Wccftech": "https://wccftech.com/nvidia-geforce-rtx-40-series-graphics-cards-ada-lovelace-gpu-tsmc-5nm-2022-launch/"
  }
}