{
  "source": "https://www.techradar.com/news/using-pdfs-online-is-about-to-get-more-interactive-than-ever",
  "title": "Using PDFs online is about to get more interactive than ever",
  "category": "computing",
  "updated": "2021-02-03T00:30:00Z",
  "author": "anthony-spadafora",
  "summary": "You can now convert, protect, split or merge PDFs right from your browser",
  "article": [
    "In an effort to make it easier to work with PDFs online, Adobe has developed a new solution called Acrobat web that allows users to tackle a number of PDF tasks right from their browsers.",
    "With Acrobat web, users can complete a number of different actions such as converting a file to a PDF, converting PDFs to other file types, protecting a PDF, splitting a PDF into two, merging multiple PDFs together and even e-signing online without having to download additional software.",
    "Using Acrobat web is simple as well as users can just drag and drop files from their computers to edit or convert them into PDFs.",
    "To get started you'll need to sign in with an Adobe ID which can be created for free on the company's site. However, those who need more specific PDF tools such as editing text and images, redacting or OCRing, can upgrade to an Acrobat subscription which also gives you access to mobile and desktop apps in addition to Acrobat web.",
    "Last summer Adobe teamed up with Google to create and launch a number of simple Acrobat shortcuts for the search giant's .new domain.",
    "After seeing more than 10m clicks in just a few months though, Adobe has now created several additional Acrobat shortcuts which can be typed into the address bar of your browser. These include PDF.new, Sign.new, CompressPDF.new, ConvertPDF.new and WordtoPDF.new.",
    "As both individuals and businesses continue to use PDFs while working from home, the launch of Acrobat web and the addition of several new Acrobat shortcuts will likely help boost productivity as users will no longer need to go to their search engine to figure out how to convert files into Adobe's PDF format."
  ],
  "headers": {
    "4": "PDF.new"
  },
  "links": {
    "PDFs": "https://www.techradar.com/best/free-pdf-editor",
    "Adobe": "https://www.techradar.com/news/adobe-is-adding-ai-smarts-to-its-marketing-software",
    "e-signing": "https://www.techradar.com/best/best-esign-software-solutions",
    "Acrobat subscription": "https://www.techradar.com/news/what-is-adobe-creative-cloud",
    ".new domain": "https://www.techradar.com/news/google-brings-its-new-tld-to-the-rest-of-the-internet",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}