{
  "source": "https://www.techradar.com/news/whatsapp-will-soon-let-you-create-and-use-custom-animated-stickers-heres-how",
  "title": "WhatsApp will soon let you create and use custom animated stickers – here's how",
  "category": "phones",
  "updated": "2021-03-03T10:03:42Z",
  "author": "cat-ellis",
  "summary": "Give your chats the personal touch",
  "article": [
    "WhatsApp is rolling out a new feature that will let you install and use custom animated sticker packs to add some more personality to your messages.",
    "Stickers are small cartoon images that you can insert into a WhatsApp chat. They're larger and more detailed than emoji, and are collected together into themed 'packs' that are visible when you tap the sticker button in the app.",
    "Last year we saw the introduction of animated stickers, plus a sticker search tool that makes it easier to find exactly the right one. Now, things are about to get even more interesting with the addition of animated third-party sticker sets that you can install and use directly within the app.",
    "It's already possible to create static stickers with apps like Sticker Maker and Wemoji, but the ability to bring them to life with animation is a fun new option. You can make animated stickers using existing video files or GIFs, and import packs into WhatsApp as WEBP files.",
    "It's worth noting that, according to WhatsApp's release notes, custom sticker packs can contain either static or animated stickers – not a combination of both.",
    "As WABetaInfo reports, the feature is rolling out now, and is currently available to users in Brazil, Iran and Indonesia. If you're in one of those countries and can't add your own bespoke moving stickers yet, don't worry – you should be able to do so within the next couple of days.",
    "When it's available globally, we'll bring you a full tutorial showing exactly how to make and install your own bespoke animated stickers. Stay tuned."
  ],
  "headers": {
    "5": "A sticky situation"
  },
  "links": {
    "animated stickers": "https://www.techradar.com/news/whatsapp-is-planning-a-fun-new-feature-to-jazz-up-your-messages",
    "sticker search tool": "https://www.techradar.com/news/whatsapp-is-getting-a-big-update-that-should-be-lots-of-fun",
    "Sticker Maker": "https://play.google.com/store/apps/details?id=com.marsvard.stickermakerforwhatsapp&hl=en_GB&gl=US",
    "Wemoji": "https://play.google.com/store/apps/details?id=com.picmax.wemoji&hl=en_GB&gl=US",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-is-rolling-out-the-possibility-to-import-third-party-sticker-packs/"
  }
}