{
  "source": "https://www.techradar.com/news/why-the-loki-trailer-could-be-teasing-lady-loki-not-black-widow",
  "title": "Why the Loki trailer could be teasing Lady Loki, not Black Widow",
  "category": "entertainment",
  "updated": "2021-04-06T15:31:09Z",
  "author": "tom-power",
  "summary": "A trick of the light",
  "article": [
    "Loki is the next Marvel TV show coming to Disney Plus after Falcon and the Winter Soldier. Even though we're two months out from its official launch, Marvel Studios released a new trailer for the series on Monday - and one particular moment has caused plenty of fan debate online since it dropped.",
    "In the series' official trailer, it appears that Loki is sitting with none other than Black Widow - aka Natasha Romanoff - on an unknown planet. As you might expect, fan fervour went into overdrive about Natasha's possible MCU return, but things aren't always as they seem with the trickster god.",
    "It's easy to see why fans have made the connection between Natasha and this character. The light from the planet's distant stars make her hair glow red, the individual has a similar hairstyle to Black Widow, and her black silhouette is almost identical to the character's costume.",
    "However, we think that this isn't Black Widow at all. Check out the blink-and-you'll-miss-it scene at 2:06 in the trailer below, and then read on for our thoughts about who this mystery character could be.",
    "Spoilers for Avengers: Endgame follow.",
    "Yep, we actually think that Loki is sitting alongside Lady Loki, a female incarnation of the character who has appeared in Marvel comics in the not-too-distant past.",
    "In a 2008 Thor comic book run, Loki ends up taking over a female human body, intended for Lady Sif, which enables him to shapeshift into a female version of the character. This individual was christened Lady Loki, and the character stuck around for a number of years, including Marvel's Dark Reign comic series, and she possessed the personality and traits of the God of Mischief. This may be true of the MCU's adaptation, if it is Lady Loki who is briefly seen in the trailer, but we may get two versions of Loki here rather than one character who shapeshifts into the other.",
    "The Black Widow and Lady Loki fan debate has raged online since the new trailer dropped on April 5, but we're firmly in the latter camp over this character's real identity. And there's fairly solid evidence as to why this is the case.",
    "Way back in March 2020, a side-by-side comparison of two Loki characters was posted by Twitter user LokiSnakes. Real name Cade, LokiSnakes suggested that Lady Loki might be part of Loki's Disney Plus series, and used the similarities between the costumes that actors Tom Hiddleston and Sophia Di Martino were wearing. While Hiddleston hasn't been seen wearing Loki's traditional costume in the TV show's trailers so far, Di Martino's is eerily similar to that of the trickster's.",
    "Check out the tweet below:",
    "Hiddleston, as we know, has played Loki since 2011 MCU movie Thor. Di Martino, however, hasn't appeared in a Marvel film. In fact, while she's a confirmed cast member of the upcoming MCU series, her character's identity has yet to be revealed on production websites including IMDb.",
    "That's not all. Upon further inspection of LokiSnakes' picture comparison, Di Martino's hairstyle is almost identical to that of the character sitting next to Loki at the 2:06 mark in the new trailer. The silhouette of this mystery character makes it look like Black Widow but, given Di Martino's costume and hair, it stands to reason that it's her, and not Scarlett Johansson's Natasha Romanoff, in that scene.",
    "What does this all mean, then? Well, we know that Loki has messed up the timeline by stealing the tesseract during the Avengers' time heist in Avengers: Endgame. As the trailer points out - itself a callback to the Ancient One's explanation of time stones to Bruce Banner in Endgame - Loki's removal of the tesseract from its current timeline causes reality to break down. This leads to timelines branching off from the MCU reality that we're used to and, by virtue, creates a multiverse scenario.",
    "The Time Variance Authority, who captures and imprisons Loki for stealing the tesseract, seem to end up using him to fix the timeline and prevent further issues down the line. It's possible, then, that Loki bumps into Lady Loki in one of these alternate realities - hence why the duo are sitting together observing a light show near the end of the trailer.",
    "Of course, it's currently unclear if it is Lady Loki who is sitting with her male counterpart. In our opinion, though, the evidence points towards this, particularly with Black Widow dying in Avengers: Endgame.",
    "We won't have long to find out though. Loki launches exclusively on Disney Plus on June 11, so here's hoping we're right in our assumption."
  ],
  "headers": {
    "4": "Loki on Disney Plus will introduce Lady Loki"
  },
  "links": {
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1100291846432787700&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "Falcon and the Winter Soldier": "https://www.techradar.com/news/falcon-and-the-winter-soldier-episode-3-will-be-the-longest-entry-yet",
    "IMDb": "https://www.imdb.com/title/tt9140554/?ref_=nm_flmg_act_1"
  }
}