{
  "source": "https://www.techradar.com/news/black-friday-could-spell-disaster-for-the-samsung-galaxy-s21-fe-launch",
  "title": "Black Friday could spell disaster for the Samsung Galaxy S21 FE launch",
  "category": "phones",
  "updated": "2021-09-24T14:09:24Z",
  "author": "tom-bedford",
  "summary": "Is late October too late?",
  "article": [
    "We've been hearing about the Samsung Galaxy S21 FE since the launch of the Galaxy S21 series in February, but we've almost forgotten about it at this point, due to its no-show at Samsung's August event and the myriad leaks and speculation that suggest it's not coming.",
    "Well, apparently it's on the way after all, because Korean news site ETNews has reported as such. Apparently, Samsung has just resumed production on the Galaxy S21 FE, after pausing it in July due to the ongoing chipset shortage - this implies the phone could be on its way in the next month.",
    "According to ETNews, the phone could come as \"early as October\", but the launch date will likely be in the \"fourth quarter of the year\" so October, November or December. That's way later than the August launch of the Galaxy S20 FE.",
    "We generally don't see smartphones launch that late in the year, with mid-October usually the cut-off point before launches stop until the new year. Occasionally the odd phone or two will debut in November or December, but it's usually a China-only launch.",
    "So if it does come in late October as this news suggests, or even later, the phone could launch at a very risky time.",
    "Phone launches don't disappear at the end of the year for no reason: the one-two punch of Black Friday and Christmas mean people aren't going to buy themselves expensive new gadgets, as they can buy older tech in the sales, or wait to be gifted things at the end of the year.",
    "If the Samsung Galaxy S21 FE does launch in the build-up to Black Friday, as it seems it will, the company might have trouble convincing people to buy the new phone. After all, why buy a pricey new device when you could simply wait for the Black Friday phone deals to pick up a cut-price bargain?",
    "This late-year release could seriously impact sales of the phone. But perhaps that's no bad thing.",
    "It's been reported that the reason the Samsung Galaxy S21 FE is later than expected, is because the global chipset shortage meant Samsung couldn't produce enough phones to match demand. Well, if demand is low because of Black Friday, then the company won't need to make as many phones until the new year, when production can ramp back up.",
    "Either way, the Samsung Galaxy S21 FE likely won't be launched with as much fanfare or pizazz as the Galaxy Z Fold 3 and Z Flip 3 got in August. We expected the FE then, but perhaps foldable phones are Samsung's focus now."
  ],
  "headers": {
    "5": "Analysis: too little, too late"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "ETNews": "https://www.etnews.com/20210922000108",
    "Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday phone deals": "https://www.techradar.com/black-friday/black-friday-phone-deals-2021",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones"
  }
}