{
  "source": "https://www.techradar.com/news/new-huawei-phones-fall-foul-to-us-sanctions-as-they-ship-without-5g",
  "title": "New Huawei phones launch without 5G, as company blames US sanctions",
  "category": "phones",
  "updated": "2021-08-09T14:29:04Z",
  "author": "henry-st-leger",
  "summary": "Would you buy a new Huawei phone without 5G?",
  "article": [
    "Huawei has unveiled the P50 and P50 Pro, two premium smartphones running the company’s proprietary HarmonyOS platform – rather than the standard Android UI – but without 5G connectivity (via Financial Times).",
    "We’d heard as much in specs leaks for the P50 earlier in the year. It’s something of a step back for Huawei, as an early adopter and cheerleader of 5G technology, but restrictions on trading with US companies has seemingly prevented it from accessing 5G version of Qualcomm’s Snapdragon 888 processors (as Chinese competitor Xiaomi has done without issue in the Mi 11 handset).",
    "In an online event, Huawei exec Richard Yu specifically called out “US sanctions” as the reason why “our new smartphones cannot run on 5G wireless connections even though we are surely the global leader in 5G technology.”",
    "Yu paints a positive picture still, saying that “with 4G, Wi-Fi 6 connectivity and our AI computing algorithms, we still can provide as powerful a performance as all the 5G phones” – though there is certainly a sense of Huawei’s wings having been clipped, and the capabilities of the P50 and P50 Pro being less than desired by the Huawei and its customers alike.",
    "Huawei’s 5G ambitions have been somewhat dampened over the past few years, as tensions between the US and China have risen, and countries around the world have grown more wary of Huawei as a trustworthy telecommunications partner.",
    "In the UK, Huawei was initially positioned as a low-cost provider of 5G services – although the UK government followed suit with the US in 2020, banning the sale of new Huawei phones and ordering the removal of Huawei technology from national communication networks by 2027.",
    "Huawei’s issues on the global stage have prevented it from accessing the parts and processors other companies are currently enjoying in their products, and even restricted its ability to offer services to existing customers – with the US banning it from offering Google-run services such as Gmail and YouTube.",
    "5G is, while a relatively technology, becoming increasingly standardised on premium smartphones, and the loss of 5G connectivity for the P50 series will no doubt be a blow to the company – as well as any Huawei fans who will be making do with 4G on these devices.",
    "However, with no announcement yet of these phones shipping outside of China, it’s an uncertain future for the company’s handsets worldwide, especially if it can’t access the 5G chipsets needed to compete with Apple, Samsung and Xiaomi’s flagship phones."
  ],
  "headers": {
    "4": "Analysis: Falling at the 5G hurdle"
  },
  "links": {
    "Financial Times": "https://www.ft.com/content/79e3f647-adc5-4820-b5e9-25342b9aa996",
    "specs leaks for the P50 earlier in the year": "https://www.techradar.com/news/huawei-p50-might-not-be-a-5g-phone-according-to-head-scratching-leak",
    "ordering the removal of Huawei technology from national communication networks by 2027": "https://www.bbc.co.uk/news/technology-53403793"
  }
}