{
  "source": "https://www.techradar.com/news/save-dollar25799-on-a-cheap-gaming-laptop-deal-in-dells-latest-sale",
  "title": "Save $257.99 on a cheap gaming laptop deal in Dell's latest sale",
  "category": "computing",
  "updated": "2021-01-20T13:17:01Z",
  "author": "alex-whitelock",
  "summary": "A great option for those on a budget this week",
  "article": [
    "If you're hunting for gaming laptop deals on a budget, we reckon this Dell G5 15 for $656.99 is an absolutely solid buy today at the official Dell store.",
    "Alongside a huge $257.99 price cut, this machine rocks a GTX 1650 Ti graphics card, 8GB of RAM, 256GB SSD, and an Intel Core i5-10300H processor - all very modern specs which are great for a first-time gaming machine.",
    "This Dell G5 15 is particularly good for the price because the GTX 1650 Ti is ever so slightly better than the standard 1650 you normally see on gaming laptops at this budget. It's still not an incredibly powerful card, but considering you rarely see it on a machine for under $700 and it'll still do 1080p gaming pretty well, this one's a great value proposition.",
    "Gaming laptop deals are definitely starting to get cheaper now the next generation of RTX 3060 cards is now on the way. Those, however, are still going to carry a premium for potentially years to come, so those on a budget will still be well served by opting for a cheaper 1600 series machine.",
    "Subsequently, if you're more of a casual gamer, or strictly on a budget, this Dell is a good option. If, however, you'd like to see more premium machines, we've got plenty more over at our main gaming laptop deals page to check out as well.",
    "Not in the US? See a roundup of the best gaming laptop deals near you just below.",
    "For more great gaming-related content, check out this week's best cheap gaming mice deals and best gaming headset deals."
  ],
  "headers": {
    "6": "Gaming laptop deals at Dell"
  },
  "links": {
    "for $656.99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5746004255395224000/https://www.dell.com/en-us/member/shop/dell-laptops/dell-g5-15-gaming-laptop/spd/g-series-15-5500-laptop/gn5500ekkrh",
    "gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "best cheap gaming mice deals": "https://www.techradar.com/news/best-gaming-mouse-deals",
    "best gaming headset deals": "https://www.techradar.com/deals/the-best-cheap-gaming-headset-deals"
  }
}