{
  "source": "https://www.techradar.com/news/windows-10-update-finally-waves-goodbye-to-edge-legacy",
  "title": "Windows 10 update finally waves goodbye to Edge Legacy",
  "category": "computing",
  "updated": "2021-04-14T20:45:53Z",
  "author": "anthony-spadafora",
  "summary": "Edge Legacy will be automatically replaced with Chromium-based Edge",
  "article": [
    "As part of its latest Patch Tuesday update for Windows 10, Microsoft's Edge Legacy browser will be replaced with Chromium-based Edge instead.",
    "First released in January of last year, Chromium-based Edge is designed to replace Edge Legacy which was released by the software giant all the way back in 2015.",
    "While Microsoft first began pre-installing its new browser on business laptops and other devices that shipped with the Windows 10 October 2020 Update, users running older versions of the operating system had to download Chromium Edge and install it manually.",
    "Now though when Windows users install the April edition of Microsoft's Patch Tuesday updates, Edge Legacy which is based on EdgeHTML will be removed entirely from their systems and replaced with Chromium-based Edge which is based on Blink.",
    "Once the April Patch Tuesday update is applied, Microsoft Edge will become both an essential and mandatory component of Windows 10.",
    "For users that have blocked the Chromium Edge update by using group polices or registry hacks, these settings will be ignored with the new update and Edge Legacy will be automatically removed. This is because support for Edge Legacy ended last month and now Microsoft wants to ensure that all Windows 10 users are using the same version of its browser.",
    "If you've yet to test out Chromium-based Edge on your Windows 10 PC yet, now is the time to do so as Microsoft is constantly adding new features such as vertical tabs, sleeping tabs, a reinvented toolbar and more to its browser in an effort to get users to make the switch from Google Chrome or Mozilla Firefox to Edge."
  ],
  "headers": {
    "4": "So long Edge Legacy"
  },
  "links": {
    "Patch Tuesday update": "https://www.techradar.com/news/microsoft-update-patches-multiple-critical-windows-10-security-flaws",
    "browser": "https://www.techradar.com/best/browser",
    "Chromium-based Edge": "https://www.techradar.com/news/microsoft-officially-launches-chromium-based-edge-browser-for-all-platforms",
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "ended last month": "https://www.techradar.com/news/microsoft-edge-legacy-is-dead-but-the-chromium-version-is-fast-gaining-traction",
    "vertical tabs": "https://www.techradar.com/news/microsoft-edge-gets-a-vertical-makeover-and-speed-upgrade",
    "sleeping tabs": "https://www.techradar.com/news/microsoft-edge-update-might-actually-make-vertical-tabs-useful",
    "a reinvented toolbar": "https://www.techradar.com/news/microsoft-edge-is-attempting-to-reinvent-the-toolbar"
  }
}