{
  "source": "https://www.techradar.com/news/how-the-digital-diy-movement-thrived-in-2020",
  "title": "How the ‘Digital DIY’ movement thrived in 2020",
  "category": "computing",
  "updated": "2021-01-19T11:14:03Z",
  "author": "rhys-davies",
  "summary": "How Digital DIY thrived in 2020",
  "article": [
    "Living through an extended period of lockdown this year forced many of us into becoming DIY “try-ers”, either tackling jobs in the house we would normally avoid or simply trying something new as a way to be creative. For many, this mindset was entirely novel, but for an army of online builders, it was merely an extension of what has already been done previously.",
    "Active before the pandemic, but able to operate through it, the collection of brains behind ‘Digital DIY’ are continually focused on making the latest applications and software packages. From the smart home to novel robotics, these tinkerers and makers, as they are known, are taking advantage of open source software and online communities to solve a whole host of challenges.",
    "There are two main ways in which lockdown has made people more interested in tinkering. First, being stuck at home has led to more free time; instead of going out and socializing or losing time to commuting, people have had more time to themselves, and so able to take on new hobbies or learn new skills. For the technical and the curious out there, this has turned into capacity for new projects. For some, this will mean using software to solve challenges for the first time, while for those already involved in ‘Digital DIY’, they have had more time to get to the end of existing projects, solving the problems they first set out to tackle.",
    "An example of this is the creation of a Raspberry Pi-powered sous chef, which is configured to automate pan-cooking tasks so that the user can focus on more advanced culinary activity. This tinkerer created an ‘Onion Bot’ to autonomously control the temperature of the pan on the stove, using a PID control system, and is set-up to remind the chef if they haven’t stirred the pan after a designated time. This type of project is typical of the home-based ‘Digital DIY' we have seen during lockdown, with people taking on more challenges than they have before.",
    "The second reason for the expansion during lockdown is more online socializing. More people are signing up to forums or looking for communities surrounding their hobbies and interests and are involving themselves in these communities. For the tinkerers out there, this has led to a boost in traffic and greater visibility of their pages and discussions. The increase in traffic has led to more contributors, more sign ups and more tutorials. The size of the community has expanded because of this and led to more people getting involved in open source software.",
    "Digital DIY is an umbrella term for countless different projects that people are involved in, whereby anyone can build things or learn about technology. This could be someone learning on their own or by interacting with hundreds of different communities of like-minded, curious, enthusiastic people, who share their passion. This isn't a new movement, because digital creation and tinkering has been around for decades. The availability of affordable hardware, meanwhile, has played a huge part in ‘Digital DIY’ from the beginning. Hardware like Raspberry Pi, or derivatives of similar use, opened the door to a new realm of digital making. Beforehand, this was done predominantly on web, desktop or mobile apps, with code, where only tech companies with a sizable research and development budget could work on digital device projects.",
    "With the addition of affordable hardware, individuals could suddenly make their own devices, or products, adding a whole new dimension to what digital making was. This makes ‘Digital DIY’ possible even with something as obscure as e-paper (the material used for Kindle devices), which have been used to create an IoT-controlled message board using Raspberry Pi. This is configured by connecting the e-paper to a Google Docs API, so that it becomes possible for the message board to poll a Google Sheet and update itself whenever there is new data. This is an example of small-scale DIY that can be done within the home and is increasingly possible even without significant budget or hardware.",
    "A key aspect of this is people’s ability to solve problems through open source software and online communities. These communities enable the sharing of support, advice, ideas, and general encouragement. This simplifies the flow of ideas and means people can share their experiences quicker, as more people working on open source code or ideas will result in quicker turn arounds and better solutions.",
    "Countless enterprises have emerged from DIY/tinkering; start-ups appear every year based on one form of digital making or another. Enterprises are realizing the vast untapped potential within tinkering and the tinkering community. Big businesses are good for platforms, for creating, maintaining and supporting the platforms on which tinkerers and digital makers work. The more that big business turns to open source and invests in these tools and platforms, the easier and greater the quality of digital making becomes. Because of this, it’s easier for people to make their own projects and products, and form communities that carry innovative weight."
  ],
  "headers": {
    "2": "The impact of lockdown",
    "5": "Affordable hardware",
    "8": "Impact on enterprise"
  },
  "links": {
    "smart home": "https://www.techradar.com/news/smart-home-devices",
    "open source software": "https://www.techradar.com/best/best-open-source-software",
    "Raspberry Pi": "https://www.techradar.com/news/best-raspberry-pi-distro",
    "desktop": "https://www.techradar.com/best/virtual-desktop-services",
    "mobile apps": "https://www.techradar.com/best/best-mobile-app-development-software",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know"
  }
}