{
  "source": "https://www.techradar.com/news/cyberpunk-2077-developer-has-become-the-victim-of-a-targeted-cyber-attack",
  "title": "Cyberpunk 2077 developer has become the victim of a 'targeted cyber attack'",
  "category": "gaming",
  "updated": "2021-02-09T13:54:01Z",
  "author": "vic-hood",
  "summary": "'Our internal systems have been compromised'",
  "article": [
    "Cyberpunk 2077 developer CD Projekt Red has been hit by a ransomware attack.",
    "The developer released a statement earlier today, revealing that it has become \"a victim of a targeted cyber attack\" which saw an unauthorized actor accessing data within the company's internal network.",
    "According to CD Projekt Red, the actor collected \"certain data\" belonging to the CD Projekt Red capital group and encrypted some devices within the company's network (which have been recovered through backups) and left behind a ransom note. You can check out the statement and the ransom note below:",
    "According to the ransom note, the unauthorized actors were able to access source codes for Cyberpunk 2077, Witcher 3, Gwent and the unreleased version of Witcher 3. In addition, they claimed to have gained access to \"documents relating to accounting, administration, legal, HR, investor relations and more\".",
    "The ransom note goes on to say that if the hackers demands are not met (though the note does not specify these demands) then the data shall be sold or leaked online.",
    "CD Projekt Red says in its statement that it \"will not give in to the demands nor negotiate with the actor\" even though it may mean the compromised data is leaked.",
    "The statement also reassured fans that, to the best of CD Projekt Red's knowledge, no personal data of players or users had been breached - though the incident is still being investigated by authorities.",
    "Since the rocky release of Cyberpunk 2077, CD Projekt Red has seen shares plumpet and its developers suffer tirades of online abuse from some players. The company offered refunds for Cyberpunk 2077 following the negative reception to the game's numerous bugs, which also saw the game pulled from the PlayStation Store.",
    "This ransomware attack could potentially leak some of the team's personal data as well as detailed aspects of the company's inner workings.",
    "CD Projekt Red is currently working with the \"relevant authorities\", which includes law enforcement, IT forensic specialists and the President of the Personal Data Protection Office, to investigate the matter."
  ],
  "headers": {
    "7": "Continuous abuse"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "backups": "https://www.techradar.com/best/best-cloud-backup",
    "shares plumpet": "https://www.techradar.com/news/cyberpunk-2077-issues-have-cost-founders-more-than-dollar1-billion-according-to-report",
    "offered refunds for Cyberpunk 2077": "https://www.techradar.com/how-to/how-to-get-a-cyberpunk-2077-refund",
    "pulled from the PlayStation Store": "https://www.techradar.com/news/sony-pulls-cyberpunk-2077-from-playstation-store-offers-full-refund"
  }
}