{
  "source": "https://www.techradar.com/news/ubuntu-2104-hirsute-hippo-has-entered-public-beta",
  "title": "Ubuntu 21.04 'Hirsute Hippo' has entered public beta",
  "category": "computing",
  "updated": "2021-04-04T12:08:54Z",
  "author": "mayank-sharma",
  "summary": "No hair-raising features with Ubuntu 21.04",
  "article": [
    "The upcoming Ubuntu 21.04 release is now available in beta, giving users and testers a taste of the new features in advance of the final release later this month.",
    "The beta images are a snapshot of the development build and aren’t meant for general consumption. Instead, they are designed to give users an opportunity to visualize the features of the upcoming release, while the testers poke and prod it to find any inconsistencies and breakages.",
    "If all goes well, the beta release of the popular open source Linux distro will be followed by a release candidate on April 15, before the final release on April 22.",
    "Ubuntu 21.04 is a regular short term release that will be supported for nine months. Despite the usual slew of updates, the release is rather light on show-stopping features. It will perhaps be best known for fixing a long standing security issue that was first reported over a decade ago, back in 2006.",
    "Ubuntu usually uses the regular releases to introduce new developments that it hopes to stabilize by the time the next long term release (LTS) rolls around. However, Ubuntu 21.04 will notably be missing the recently launched GNOME 40 desktop environment, which brings in new workflows and a move to the GTK4 toolkit.",
    "Instead, Ubuntu 21.04 will ship with Gnome 3.38 as it waits for the larger GNOME ecosystem to migrate to GTK4.",
    "Ubuntu 21.04 is to be powered by the Linux 5.11 stable kernel, and the use of the Wayland display server by default is its headline change. Ubuntu tried using Wayland by default back with 17.10, before reverting to Xorg for subsequent releases."
  ],
  "headers": {
    "3": "Regular release"
  },
  "links": {
    "Ubuntu": "https://www.techradar.com/reviews/ubuntu",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "Linux distro": "https://www.techradar.com/best/best-linux-distros",
    "usual slew of updates": "https://discourse.ubuntu.com/t/hirsute-hippo-release-notes/19221",
    "long standing security issue": "https://www.techradar.com/news/ubuntu-2104-will-finally-fix-this-long-time-security-concern"
  }
}