{
  "source": "https://www.techradar.com/news/ring-makes-using-its-video-doorbells-and-security-cameras-more-secure",
  "title": "Ring makes using its video doorbells and security cameras more secure",
  "category": "smart-home",
  "updated": "2021-07-13T13:30:00Z",
  "author": "carrie-ann-skinner",
  "summary": "End-to-end video encryption is being rolled out worldwide following US technical preview",
  "article": [
    "The best video doorbells and home security cameras let you view a live feed from the camera on your smartphone, even when you’re not at home, so you can keep a check on your property. But with this ability comes privacy concerns; namely ensuring unauthorized users can’t tap into this video feed.",
    "With this in mind Ring is rolling out end-to-end encryption of video, which was first launched in the US in January this year as a technical preview, to its users worldwide to ensure videos can only be viewed on specified mobile devices.",
    "Ring already encrypts video from its devices when they are uploaded to the cloud and stored on its servers, but this opt-in feature offers an extra layer of security. One which Ring told TechRadar it views as the equivalent to “a second deadbolt on a door”.",
    "End-to-end encryption is supported on wired Ring devices, including the Ring Video Doorbell Pro and Ring Video Doorbell Pro 2 as well as the Ring Video Doorbell Wired - the brand’s most affordable home security device, and the Ring Floodlight Cam. At present, battery-powered devices such as the Ring Video Doorbell 4 and the Spotlight Cam battery can’t be used with end-to-end encryption.",
    "Josh Roth, Chief Technology Officer at Ring, told TechRadar this is because the battery-operated devices don’t have enough computing power and end-to-end encryption also drains the battery too quickly. However, Roth added that he thought it was likely the feature will be made available to battery-powered devices in the future but he couldn’t say when.",
    "It's also worth noting that by switching on end-to-end encryption, some features are no longer supported. These include shared users, which allow friends and family to access the video doorbell’s live feed from their devices, and integration with Amazon Alexa that means Amazon Echo speakers and Echo Show smart displays can be used to answer the video doorbells and converse with anyone in their field of view.",
    "At the same time, Ring is also adding support for authenticator apps such as Google authenticator and Microsoft authenticator, which will generate a code required to be entered into the Ring app before you can access the live feed from the video doorbell or home security camera.",
    "There’s no denying video doorbells and home security cameras have ensured securing your property is easier and requires far less cables running around your home than traditional CCTV systems, but they also come with some big privacy concerns.",
    "We’re pleased to see Ring is taking those concerns seriously and we think end-to-end encryption will be welcomed by those who cite privacy as a high priority. However we’re a little disappointed that the feature currently isn’t available on battery-powered devices, and that you have to compromise on some of Ring’s most useful features, including Alexa integration."
  ],
  "headers": {
    "3": "Wired devices only",
    "7": "Analysis: privacy is key"
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Ring Video Doorbell Pro": "https://www.techradar.com/reviews/ring-video-doorbell-pro-review",
    "Ring Video Doorbell Pro 2": "https://www.techradar.com/reviews/ring-video-doorbell-pro-2-review",
    "Ring Video Doorbell Wired": "https://www.techradar.com/reviews/ring-video-doorbell-wired-review",
    "Ring Floodlight Cam": "https://www.techradar.com/news/ring-floodlight-cam-wired-pro",
    "Ring Video Doorbell 4": "https://www.techradar.com/news/ring-video-doorbell-4",
    "Spotlight Cam battery": "https://www.techradar.com/reviews/ring-spotlight-cam"
  }
}