{
  "source": "https://www.techradar.com/news/the-most-exciting-pc-games-coming-in-2021",
  "title": "The most exciting PC games coming in 2021",
  "category": "computing",
  "updated": "2021-02-10T16:01:56.860Z",
  "author": "rosario-blue",
  "summary": "PC Games to watch 2021",
  "article": [
    "2020 has been a challenging year for gaming: with many games studios moving to remote working, release schedules have slowed down – to a stop, in some cases.",
    "Despite all of this gaming has thrived, providing much-needed solace to many people feeling out of sorts because of the rubbish year many of us have had.",
    "Fear not! 2021 is finally here, which means a fresh start and some new PC games to carry you through a hopefully much better year.",
    "Elden Ring is one of, if not the most, anticipated PC game on this list.",
    "An action RPG developed by FromSoftware and published by Bandai Namco Entertainment, it promises to be a jaw-dropping collaboration between Dark Souls director Hidetaka Miyazaki and A Song of Ice and Fire writer George R. R. Martin.",
    "Elden Ring will be available on all platforms and is due for release at some point in 2021. With such big and respected names behind it, we expect it to be near-perfection.",
    "Also highly-anticipated, New World is a visually breathtaking MMO fantasy RPG developed and published by Amazon Games.",
    "New World is a great opportunity for Amazon Game Studios to redeem itself after its two failed titles Breakaway and Crucible left people wondering whether or not Amazon should have got into the video games market in the first place.",
    "The MMORPG features crafting, survival elements as well as the usual quests, sieges and PVP gameplay to look forward to.",
    "Due for release on 25 May 2021, New World is available to preorder now through Steam or Amazon.",
    "Riot Games announced early this year that it would be releasing Ruined King, a turn-based fantasy RPG with a rich storyline.",
    "It’s the first game to be released by its publisher label Riot Forge, and is developed by Airship Syndicate. It will feature as playable characters favorite League of Legends champions Illaoi, Yasuo, Miss Fortune, Pike, and Ahri.",
    "Ruined King begins in Bilgewater, a port city familiar LoL players, and takes the player on a journey to the Shadow Isles where the Ruined King himself resides.",
    "Ruined King is due for release in 2021 on PC through Steam and the Epic Games Store and will be available on all consoles.",
    "Crimson Desert is an MMO fantasy action RPG due for release in winter 2021, and it looks set to be a visually stunning affair.",
    "It’s the newest game from Black Desert Online developers Pearl Abyss, and what's going to set it aside from other MMOs of a similar style like Black Desert Online remains to be seen.",
    "A big concern is just how demanding Crimson Desert will be on people's rigs, considering its cutting-edge graphics. There's a worry that you may need a powerful gaming PC to play this at a steady, high framerate.",
    "Pearl Abyss is still working on the title, so expect to see and learn more up till its winter release.",
    "Evil West is a singleplayer narrative-driven action beat ’em up published by Focus Home Interactive and developed by Flying Wild Hog.",
    "It’s centered around a gunslinging cowboy superhero fighting to save the Old West from a plethora of vampires and monsters.",
    "Evil West is reminiscent of Dark Watch, or an amalgamation of Red Dead Redemption and Devil May Cry. While it's predominantly a singleplayer game, it features a co-operative mode that allows two players to take on the monstrosities that lie in wait.",
    "Evil West will be released on the 31st December 2021 on PC and console; in the meantime you can add it to your wishlist on Steam.",
    "Grinding Gear Games is back with another instalment of its extremely popular free-to-play action RPG Path of Exile.",
    "Path of Exile 2 has a seven-act storyline, an improvement on the three acts of its predecessor, whose story it continues 20 years later.",
    "The skill system is getting a full overhaul, with 19 new ascendancies to look forward to. If you’ve unlocked any of the 19 from the previous game, you’ll still have access to them in PoE 2. The visuals also look great, making PoE 2 certainly one to watch in 2021.",
    "PoE 2 will be most likely be available on Steam in 2021, but Grinding Gear Games have not yet confirmed a date.",
    "The spiritual successor to the much-loved Left4Dead franchise, Back4Blood is a first-person cooperative shooter brought to you by Warner Bros. Studios and developed by Turtle Rock studios, who are comprised of the team that brought us previous Left4Dead titles.",
    "If you love Left4Dead you’ll hardly need our recommendation to get excited about Back4Blood, since it features the same zombie-killing action its predecessors are known and loved for. The co-op story mode is still there, along with the competitive multiplayer mode, and the visuals are looking great as well!",
    "Back4Blood will be available on Steam on June 22 2021.",
    "Fatshark are back with another title to add to their already impressive roster of Warhammer games.",
    "Warhammer 40,000: Darktide is, similarly to its developers’ award-winning Vermintide franchise, a 4 player co-op first person shooter. It's true to Warhammer in every way, capturing the universe’s gothic atmosphere, but really pushes the envelope with its dark horror themes. Visually the game looks amazing, and promises to be a huge upgrade over previous Vermintide titles.",
    "Darktide is available on Steam and, while you can’t preorder it just yet, you can add it to your Steam wishlist. It’s expected to be out sometime in 2021.",
    "Humankind is a 4X turn-based strategy game published by Sega and developed by Amplitude Studios.",
    "Humankind allows you to create your very own civilization, which can be built from a number of different historical cultures, with each choice leading to endless opportunities to grow.",
    "There are over 60 cultures to choose from and you can choose how you want to manage your units, as well as how you want to develop your cities. And if you wanna win, make sure you get those Fame points up: that’s the only way to achieve a victory.",
    "It’s available to preorder on Steam, now with 17% off the Digital Deluxe edition.",
    "Vampire: The Masquerade – Bloodlines 2 is a singleplayer action RPG published by Paradox Interactive and Developed by Hardsuit Labs.",
    "The game is set in a dark reimagined Seattle where you have to fight up through the ranks to reach your ultimate form as a powerful Vampire. How you progress through the game depends on what choices you make, and there are a number of different routes you can take in order to complete the game.",
    "It’s available on Steam for preorder, and is expected to be released at some point in 2021.",
    "Let’s face it, 2021 has a lot more than ten great games coming out, so honorable mentions go to The Evil Dead and Hitman 3, both of which will come out on PC and consoles. We can't wait to play them as well."
  ],
  "headers": {
    "3": "1. Elden Ring",
    "6": "2. New World",
    "10": "3. Ruined King: A League of Legends Story",
    "14": "4. Crimson Desert",
    "18": "5. Evil West",
    "22": "6. Path of Exile 2",
    "26": "7. Back4Blood",
    "29": "8. Warhammer 40,000: Darktide",
    "32": "9. Humankind",
    "36": "10. Vampire: The Masquerade – Bloodlines 2",
    "39": "Honorable mentions"
  },
  "links": {
    "FromSoftware": "https://www.fromsoftware.jp/ww/",
    "Bandai Namco Entertainment": "https://en.bandainamcoent.eu/elden-ring/elden-ring",
    "Elden Ring": "https://www.fromsoftware.jp/jp/eldenring/index.html#1",
    "Amazon Games": "https://www.amazongames.com/en-us",
    "New World": "https://www.newworld.com/en-us",
    "Steam": "https://store.steampowered.com/app/532790/Vampire_The_Masquerade__Bloodlines_2/",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07HYZ6SBM%3Fref_%3DAGS_NW_ENUS_WBST_DM_ALL_DLX%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6459111191837264000-20",
    "Riot Forge": "https://riotforgegames.com/en_US/",
    "Airship Syndicate": "https://www.airshipsyndicate.com/",
    "Ruined King": "https://ruinedking.com/",
    "Bilgewater": "https://universe.leagueoflegends.com/en_US/region/bilgewater/",
    "Shadow Isles": "https://universe.leagueoflegends.com/en_US/region/shadow-isles/",
    "Epic Games Store": "https://www.epicgames.com/store/en-US/product/ruined-king-a-league-of-legends-story/home",
    "Pearl Abyss": "https://www.pearlabyss.com/en-US",
    "Crimson Desert": "https://crimsondesert.pearlabyss.com/en-US/Main/Index",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Focus Home Interactive": "https://www.focus-home.com/en-us",
    "Flying Wild Hog": "https://flyingwildhog.com/",
    "Evil West": "https://www.focus-home.com/en-us/games/evil-west",
    "Grinding Gear Games": "https://www.grindinggear.com/",
    "Path of Exile": "https://www.pathofexile.com/",
    "Path of Exile 2": "https://www.pathofexile.com/exilecon/one",
    "Warner Bros. Studios": "https://www.warnerbrosgames.com/",
    "Turtle Rock studios": "https://turtlerockstudios.com/",
    "Back4Blood": "https://back4blood.com/en-us",
    "Fatshark": "https://www.fatshark.se/",
    "Sega": "https://www.sega.com/",
    "Amplitude Studios": "https://www.amplitude-studios.com/",
    "Humankind": "https://humankind.game/",
    "Vampire: The Masquerade – Bloodlines 2": "https://www.bloodlines2.com/",
    "Paradox Interactive": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1736792816209496300&xs=1&url=https%3A%2F%2Fwww.paradoxplaza.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-most-exciting-pc-games-coming-in-2021",
    "Hardsuit Labs": "https://www.hardsuitlabs.com/"
  }
}