{
  "source": "https://www.techradar.com/news/samsung-teases-the-galaxy-z-fold-3-ahead-of-its-official-announcement",
  "title": "Samsung teases the Galaxy Z Fold 3 ahead of its official announcement",
  "category": "phones",
  "updated": "2021-07-30T10:06:16Z",
  "author": "rhys-wood",
  "summary": "A sneak peek to tide us over?",
  "article": [
    "The Samsung Galaxy Unpacked event is happening soon on August 11, 2021, but the company has given us a teaser trailer to gloss over while we wait. It's worth a look, too, giving us a sneak peek at the upcoming Samsung Galaxy Z Fold 3 phone.",
    "The trailer races through silhouettes of much older phones, and eagle-eyed viewers may be able to spot some iconic stalwarts from past decades, including the loveable Nokia 3310. Following the slogan “is ‘good’ good enough,” we’re treated to a glimpse at the Galaxy Z Fold 3 that’s more Inception homage than device reveal - a nice effect that unfortunately obscured the phone with an abundance of CGI buildings.",
    "Besides the Galaxy Z Fold 3, we’re expecting to see a bunch of other new additions to the Samsung family announced during the Galaxy Unpacked event. These include the Galaxy Z Flip 3 as well as the Galaxy Watch 4 and the Galaxy Buds 2, which have recently been rumored to retail for cheaper than what we initially expected.",
    "Samsung’s range of foldable phones, so far, have been quite impressive. The Galaxy Z Fold 2 ended up being a worthwhile investment thanks to its gorgeous display, but was slightly let down by the price and so-so cameras.",
    "A recent leak suggested that the Galaxy Z Fold 3, though, could retail at a cheaper price point than its predecessor, which would be an improvement if true, even if the overall saving isn’t expected to be that much.",
    "It’s hard to imagine foldable smartphones will become more commonplace anytime soon, especially considering they’re typically more expensive than the average smartphone, and still so few of them on the market.",
    "That being said, Samsung’s efforts with the Galaxy Z Fold 3 could nudge the foldable design to be more mainstream, as the company is clearly committed to making new foldable models on a seemingly annual basis. The company clearly believes there’s a consumer demand to satisfy.",
    "However, we wouldn’t want to get your hopes up about a foldable revolution right now. Foldable phones, by and large, are still far too expensive to be considered anything other than an enthusiast’s choice, especially while more traditionally designed smartphones like the iPhone 12 and OnePlus 9 offer more for less, be that in terms of an impressive camera or sharp OLED displays."
  ],
  "headers": {
    "5": "Analysis: will foldables become the new norm?"
  },
  "links": {
    "Samsung Galaxy Unpacked": "https://www.techradar.com/news/samsung-galaxy-unpacked-will-indeed-be-august-11-bixby-assistant-confirms",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Nokia 3310": "https://www.techradar.com/reviews/new-nokia-3310-2017-review",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "retail for cheaper": "https://www.techradar.com/news/samsung-galaxy-buds-2-price-leaks-and-they-could-be-cheaper-than-the-airpods-pro",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "than its predecessor": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-have-more-storage-and-a-lower-price-than-the-fold-2",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OLED": "https://www.techradar.com/news/what-is-oled"
  }
}