{
  "source": "https://www.techradar.com/news/why-not-store-halo-infinite-on-a-halo-themed-hard-drive-huh",
  "title": "Why not store Halo Infinite on a Halo-themed hard drive, huh?",
  "category": "gaming",
  "updated": "2021-08-27T14:53:40.026Z",
  "author": "jamel-smith",
  "summary": "Master Chief’s armor has never looked so good...on a hard drive at least...",
  "article": [
    "Master Chief lovers, time to start smiling from ear to ear because Seagate has announced a Halo Infinite-themed special edition HDD game drive, designed for Xbox consoles. Decked out with the Chief’s Mjolnir power armor plates (if they were made from plastic, that is) this external hard drive will store all your Xbox games and keep Cortana happy. Along with the Halo Infinite SE Drive, Seagate has announced a few other gaming-focused storage systems – Game Drive and the Game Drive Hub.",
    "All new drives are designed for the Xbox Series X/S and Xbox One consoles, but will likely work with other consoles and PC too. Seagate has also made sure there’s an easy installation process on the Xbox OS, completing in under two minutes, so you’ll have more time to stare at the multi-colored LEDs on each of the new storage drives.",
    "The new drives are available this month. The Game Drive comes with 2TB ($92.49/£74.99) and 4TB ($124.99/£104.99) capacities, the Halo Infinite SE version comes with 2TB ($99.99/£79.99) and 5TB ($169.99/£129.99) capacities (Halo fans, you’ll be paying a bit more for the master chief armor design compared to the normal 2TB game drive), and the Game Drive Hub comes solely in an 8TB capacity ($219.99/£184.99). That extra expense also adds dual front-facing high-speed USB-C and USB-A ports.",
    "The drives are going to be perfect to hold Xbox One and other backward compatible games, but you can also hold your Series X/S games on the HDD and transfer games back to the internal SSD of the console when you’re ready to play them. But you’ll not see the benefits of the SSD-like faster loading times for anything played from the Game Drives’ HDD storage.",
    "This does lead to the question, when will Xbox and Seagate finally start releasing more storage options for the Series X/S expandable SSD card, which currently only comes with a 1TB capacity. The size of 3rd party and 1st party Xbox Series X/S games are quite large with games like Call of Duty Warzone being over 100 GB, and even Halo Infinite expected to come in at a large 97 GB. And with the Xbox Series X having 802 GB of usable storage out of the box and the Xbox Series S having a measly 364 GB, storage space will start to become scarce on the Series X/S (especially with the Series S).",
    "What also doesn’t help is that Xbox doesn’t have a decompression technology similar to the PS5’s Kraken to help alleviate the storage issue. This has meant PS5 can have smaller versions of the same game compared to Xbox. For instance, the Control Ultimate Edition is 42.5 GB on the Xbox Series X/S and only 25.79 GB on the PS5. Therefore, the only solution to alleviate this growing storage issue on Xbox is to have more storage capacity options through the Xbox official expansion card (currently only available in a 1TB format), something PlayStation currently allows, as you’re able to expand your PS5 with up to a 4TB M2 SSD – and beyond as larger M2 SSD drives are released compatible with the system in the future.",
    "Seagate’s new drives might help with the storage of the games, but there’s still a hurdle to be crossed when it comes to actually playing next-gen Xbox titles on anything other than the internal SSD or official expansion card."
  ],
  "headers": {
    "3": "Opinion: Storage struggles"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "drives are available this month.": "https://www.seagate.com/products/gaming-drives/xbox-gaming/",
    "storage space will start to become scarce on the Series X/S": "https://www.techradar.com/news/halo-infinites-huge-file-size-isnt-a-surprise-but-its-a-growing-problem-on-xbox-series-x",
    "expand your PS5 with up to a 4TB M2 SSD": "https://www.techradar.com/how-to/how-to-upgrade-ps5-internal-ssd-storage"
  }
}