{
  "source": "https://www.techradar.com/news/ericsson-signs-dollar85bn-verizon-5g-deal",
  "title": "Ericsson signs $8.5bn Verizon 5G deal",
  "category": "computing",
  "updated": "2021-07-17T00:27:19Z",
  "author": "anthony-spadafora",
  "summary": "Landmark deal will improve the coverage and speed of Verizon's 5G network",
  "article": [
    "Ericsson and Verizon are expanding their long-standing partnership with the announcement of a new landmark $8.5bn multi-year agreement in which the Swedish network equipment vendor will provide the US telecom with its 5G solutions.",
    "Through the deal, Verizon plans to accelerate the deployment of its 5G network throughout the US after first beginning its rollout of the next generation of mobile internet connectivity back in 2019.",
    "President and head of Ericsson North America Niklas Heuveldop provided further insight on both companies' strategic partnership in a press release, saying:",
    "“This is a significant strategic partnership for both companies and what we’re most excited about is bringing the benefits of 5G to U.S. consumers, enterprises and the public sector. We’re looking forward to working with Verizon to leverage solutions like Cloud RAN and our Street Macro, adding depth and versatility to 5G network rollouts across the U.S.”",
    "As part of the new $8.3bn agreement, Verizon will deploy Ericsson's 5G MIMO C-band, low-band and millimeter wave (mmWave) solutions to boost and expand its 5G Ultra Wideband coverage, network performance and user experience.",
    "Ericsson's technology solutions, which include Massive MIMO, Ericsson Spectrum Sharing and Ericsson Cloud RAN, complement its Ericsson Radio System portfolio to support 5G services.",
    "Verizon and Ericsson have worked together in the past and last year, Verizon was the first telecom to receive a commercial 5G mmWave Street Marco base station from Ericsson's US smart factory in Lewisville, Texas.",
    "Verizon customers will soon see a performance boost as well as better coverage when using a 5G smartphone on its network and we'll likely hear more regarding the deal once the telecom begins rolling out Ericsson's equipment."
  ],
  "headers": {
    "4": "Landmark deal"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Verizon": "https://www.techradar.com/news/phone-and-communications/mobile-phones/verizon-wireless-plans-1321179",
    "press release": "https://www.ericsson.com/en/press-releases/2021/7/ericsson-and-verizon-ink-landmark-multi-year-%248.3-billion-5g-deal",
    "mmWave": "https://www.techradar.com/news/tim-and-ericsson-set-new-long-distance-record-for-mmwave-5g",
    "5G Ultra Wideband": "https://www.techradar.com/news/verizon-offers-5g-business-internet-in-21-more-us-cities",
    "RAN": "https://www.techradar.com/news/google-furthers-telco-push-with-o-ran-alliance-and-ericsson-5g-partnerships",
    "5G smartphone": "https://www.techradar.com/best/best-5g-phones"
  }
}