{
  "source": "https://www.techradar.com/news/totally-rated-weve-gone-flipping-mad-for-this-new-samsung-galaxy-phone",
  "title": "Totally Rated: we've gone flipping mad for this new Samsung Galaxy phone",
  "category": "gaming",
  "updated": "2021-09-03T15:59:45Z",
  "author": "rhys-wood",
  "summary": "Dead Space, Samsung and GTA 6 round out this week's Totally Rated",
  "article": [
    "In this week’s Totally Rated, we get a better look at the Dead Space remake due to release in 2022 for PC, PS5 and Xbox Series X/S consoles.",
    "TechRadar's David Lumb speaks favorably of the new Samsung Galaxy Z Flip 3 phone, stating it to be an excellent and affordable introduction to the world of foldables.",
    "Finally, we round out with a look at a GTA 6 related blunder on a German TV show... but was it even a blunder at all?",
    "First up, we've got all-new details to share on the Dead Space remake via a live stream this week from Motive Studio, the developer behind the PS5 and Xbox Series X/S remake.",
    "One major difference we’ll be seeing in the remake of the 2008 survival horror classic is that our protagonist, Isaac, will actually have a voice this time. Originally Isaac wasn't voiced until the sequel, Dead Space 2. For the remake, though, Gunner Wright reprises his role as Isaac, who voiced the character in both Dead Space 2 and Dead Space 3.",
    "We also saw some pre-alpha gameplay showcasing improvements to the dismemberment mechanics and a new \"peeling\" mechanic – with Necromoph flesh now designed to peel away from the bone as you blast with surgical weapons. This new mechanic should please fans of the original's commitment to blood and gore, as Motive is now able to render Necromorphs in more stunning and shocking detail than ever before.",
    "The power of current-gen visuals will allow for more gore than ever before, so much so that you may need to bring a few sick bags along for the ride this time. In the meantime, you can play the original Dead Space trilogy on Xbox Game Pass.",
    "This week, TechRadar’s US mobile editor David Lumb took a look at the Samsung Galaxy Z Flip 3 and delivered a strongly positive verdict of 4 out of 5 stars:",
    "\"The Samsung Galaxy Z Flip 3 is the best clamshell foldable you can buy. It’s got specs and a price point comparable with flagship phones, but its relatively small battery holds it back.",
    "\"When it comes to cameras, the Z Flip 3 has an acceptable offering, but not comparable to what you’ll find on phones like the comparably-priced Samsung Galaxy S21 Plus.",
    "\"Wary consumers may want to wait to see what innovations come in the next iteration – but if you want a phone that folds up to fit easier into bags and pockets, and still competes with similar performance to other flagship phones, the Z Flip 3 is a good option to buy today.\"",
    "History is destined to repeat itself, and it seems like the foldable phone future has well and truly arrived. But is this more affordable entry price point enough to get you in on the trend, or do you prefer a more traditional-feeling smartphone experience?",
    "Finally, we're a step closer to knowing GTA 6's release date. Kind of. Not really, actually. But the following story was a fun one, nonetheless.",
    "On a recent episode of German game show Schlag den Star, a peculiar man burst onto the stage asking to know when he'll get to play the next title in the Grand Theft Auto series. Yes, really.",
    "A clip of the interruption was posted to the GTA 6 subreddit, where members set to making sense of what had transpired.",
    "The emboldened GTA fan encouraged the show's moderator to shout \"where is GTA 6?\" into the camera. But he simply and humorously responded that he hasn’t even finished GTA 5 yet.",
    "The stage saboteur was swiftly led away by security, followed by the host oddly suggesting he'd been paid off by Rockstar's parent company, Take-Two Interactive.",
    "The response to the incident online has been varied; some German viewers have complained that the unexpected guest didn't use his temporary platform to highlight something more important, while some conspiracy theorists claimed he came through suspiciously clearly over the show's audio, leading to the thought that the whole thing could have been a bizarre marketing stunt to kick off the game's publicity.",
    "Right now, there's no official word on the release of GTA 6. However, some recent reports suggest that Rockstar might be targeting a 2025 release date. In the meantime, we have the rumored GTA Trilogy Remaster to potentially look forward to.",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every week."
  ],
  "headers": {
    "3": "The Necromorphs are coming",
    "7": "Samsung Galaxy Z Flip 3: a flipping marvelous phone?",
    "12": "Grand Theft Oopsie"
  },
  "links": {
    "Dead Space remake": "https://www.techradar.com/news/dead-space-remake",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "GTA Trilogy Remaster": "https://www.techradar.com/news/gta-remastered-trilogy"
  }
}