{
  "source": "https://www.techradar.com/news/the-xbox-windows-app-will-soon-tell-you-how-well-games-will-play-on-your-pc",
  "title": "The Xbox Windows app will soon tell you how well games will play on your PC",
  "category": "computing",
  "updated": "2021-12-06T17:49:49Z",
  "author": "john-loeffler",
  "summary": "Xbox Windows App is testing a performance check feature",
  "article": [
    "Microsoft is testing a new feature in the Xbox App for Windows that will let you know how well a game should run on your PC.",
    "The feature is currently available for certain games as part of the Xbox Insiders program, and features a label on a game's page that indicates how well a game should run.",
    "At this time, several titles don't have a label, stating that 'Performance check not available yet', which indicates that the feature isn't tied to simply cross-checking your system specs against a game's listed system requirements.",
    "As The Verge notes, this is probably because Microsoft is building up a database of games with different performance evaluations using different hardware, which should provide a much better indication than just checking a system against listed system requirements, like other third-party tools do currently.",
    "PC gaming has a reputation for being a fairly opaque endeavor, thanks in large part to the sometimes totally incomprehensible system requirement listings and the unfamiliarity of many gamers with computer hardware specs.",
    "If you're just trying to get into PC gaming, is an AMD Radeon RX 5600XT better than an Nvidia Geforce RTX 2060 Super? An RTX 3080? What about processor generations? How many people could tell you if they were running on a seventh-generation Intel processor or better?",
    "It might be a small thing, but an easy-to-read label is a great start. Hopefully this feature will one day tell you what specifically isn't up to snuff on your PC, but for now, anything that makes people's gaming experience better is a step in the right direction."
  ],
  "headers": {
    "4": "Analysis: anything that makes PC games more accessible is a great thing"
  },
  "links": {
    "Xbox App for Windows": "https://www.techradar.com/how-to/how-to-use-the-xbox-app-to-stream-games-on-your-windows-pc",
    "Xbox Insiders": "https://www.techradar.com/how-to/how-to-join-the-xbox-insider-program-and-reach-its-highest-levels",
    "The Verge": "https://www.theverge.com/2021/12/6/22819752/xbox-windows-app-performance-check-feature",
    "AMD Radeon RX 5600XT": "https://www.techradar.com/reviews/amd-radeon-rx-5600-xt",
    "Nvidia Geforce RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}