{
  "source": "https://www.techradar.com/news/n64-games-on-nintendo-switch-contain-a-great-option-for-purists",
  "title": "N64 games on Nintendo Switch contain a great option for purists",
  "category": "gaming",
  "updated": "2021-10-11T14:27:30Z",
  "author": "gerald-lynch",
  "summary": "Refresh rate confirmed",
  "article": [
    "More details on Nintendo's long-awaited Nintendo 64 update to the Nintendo Switch Online subscription service have been shared today by the gaming giant.",
    "After some speculation circulated as to what versions of N64 games would be coming to Nintendo's retro gaming library, Nintendo has now confirmed that all titles will be offered up in their 60Hz, English language variants.",
    "However, select titles will also include the option to run titles at the 50Hz standard that PAL (e.g, European) editions of games of the N64 era released in. It's a great option for purists who want to play games just how they remembered them in their youth – even if that means taking a hit to refresh rate to do so.",
    "Even with these clarifications, there are still some details Nintendo has yet to confirm for its Switch Online upgrade.",
    "Key among these is price. We know that this new-and-expanded retro library for Nintendo Switch Online will come with a price bump to the monthly service, but whether or not people will consider it worth the cost will of course be dependant on just how much more they're expected to pay out.",
    "Secondly is the precise date. So far, all we know is to expect these changes to come into play at the \"end of October\", but no exact date has been given.",
    "Finally, prior to the N64 announcement, there was lots of whispers suggesting that Game Boy and Game Boy Advance titles will be joining the service. The Switch has more than enough power to deliver these ageing handheld titles, but whether or not Nintendo has the desire to deliver them remains to be seen.",
    "In the meantime, we've got the following N64 titles to look forward to – confirmed to be joining the service are Super Mario 64, The Legend of Zelda: Ocarina of Time. Mario Kart 64, Lylat Wars, Sin and Punishment, Dr. Mario 64, Mario Tennis 64, Operation: WinBack and Yoshi's Story."
  ],
  "headers": {
    "3": "More info to follow"
  },
  "links": {
    "Nintendo 64": "https://www.techradar.com/news/best-games-consoles-nintendo-64-the-console-that-brought-3d-gaming-to-life",
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer"
  }
}