{
  "source": "https://www.techradar.com/news/intel-and-amd-chip-war-heats-up-once-more-with-ice-lake-launch",
  "title": "Intel and AMD chip war heats up once more with Ice Lake launch",
  "category": "computing",
  "updated": "2021-04-07T10:44:44Z",
  "author": "mike-moore",
  "summary": "Intel Ice Lake processors bring 10nm to the data center",
  "article": [
    "Intel has unveiled its latest weapon in the fight against AMD in the data center wars with the release of its new Ice Lake chips.",
    "The new 3rd Gen Intel Xeon Scalable chips are the company's first 10nm data center processors, and look to play a crucial part in the company's push for supremacy in the increasingly smart and digital world around us.",
    "Intel says the new chips will also play a key role in expanding 5G usage in areas such as edge computing, offering a huge increase in performance and efficiency when dealing with network workloads.",
    "The launch forms the latest salvo between Intel and AMD, and was the first time new Intel CEO Pat Gelsinger has presided over since taking the top job.",
    "“It’s a new day at Intel,” Gelsinger said at the launch. “We are no longer just the CPU company. Only Intel can bring together software, silicon and platforms, packaging and process with at-scale manufacturing for our customers so they can build their next-generation innovations. This is our unique advantage as an integrated device manufacturer, or IDM.”",
    "The new chips look to address a number of data-heavy workloads across the business space as Intel looks to demonstrate its hardware flexibility to all these new customers.",
    "The company says that Ice Lake is the only data center CPU with built-in AI acceleration, extensive software optimizations and turnkey solutions, meaning it is possible to bring AI into applications from the edge to the cloud.",
    "Intel says it can deliver 74% faster AI performance compared with its prior generation, and provide up to 1.5 times higher performance across a broad mix of 20 popular AI workloads versus AMD EPYC 7763.",
    "Ice Lake also features built-in Intel Crypto Acceleration, offering \"breakthrough performance\" on a number of cryptographic algorithms. The company says that this should help businesses such as online retailers processing millions of customer transactions per day as well as encryption-intensive workloads, keeping customer data safe whilst also ensuring high performance and uptime.",
    "The chips also offer comprehensive built-in security measures, with Intel saying that its SGX offering now protects sensitive code and data with the smallest potential attack surface within the system.",
    "In total, 36 seperate SKUs are being made available by Intel, which the company hopes will cover the range of its customer base. Intel says it has already signed up support from top server OEMs including Dell, Hewlett Packard Enterprise, Lenovo, and Cisco, among others, alongside the top public cloud providers such as Microsoft Azure, Amazon Web Services, Google Cloud, and Oracle Cloud."
  ],
  "headers": {
    "3": "Ice ice baby"
  },
  "links": {
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Intel and AMD": "https://www.techradar.com/news/amd-unleashes-record-breaking-3rd-generation-epyc-cpus",
    "Pat Gelsinger": "https://www.techradar.com/news/intel-chooses-vmwares-pat-gelsinger-to-replace-bob-swan-as-ceo"
  }
}