{
  "source": "https://www.techradar.com/news/iphone-13-pro-max-could-be-better-at-portraits-and-night-shots",
  "title": "iPhone 13 Pro Max could be better at portraits and night shots",
  "category": "phones",
  "updated": "2021-03-31T08:57:36Z",
  "author": "james-rogerson",
  "summary": "An aperture upgrade",
  "article": [
    "The iPhone 12 Pro Max already has an excellent camera, coming in third on our list of the best camera phones. But the iPhone 13 Pro Max could be shooting for the top spot, as a new report suggests it will have an upgraded main lens.",
    "According to Ming-Chi Kuo (an analyst with a good track record for Apple information) in a note seen by Apple Insider, the iPhone 13 Pro Max will have an aperture of f/1.5 on its main camera.",
    "That’s only a slight shift from the f/1.6 aperture on the iPhone 12 Pro Max, but it means a larger lens opening, allowing more light in. That in turn can obviously improve low-light performance, but it also allows for a shallower depth of field – meaning less is in focus, which is ideal for portrait shots with blurred backgrounds.",
    "The rest of the range meanwhile (expected to include the iPhone 13, iPhone 13 mini, and iPhone 13 Pro) will apparently stick with an f/1.6 main lens that’s the same as or similar to the ones found on the iPhone 12 range. All of these phones will also apparently have a seven-element lens, just like the current models.",
    "So it sounds like for upgrades to the main snapper you might have to opt for the top iPhone 13 model. And some of the other camera upgrades could also be reserved for premium models, with Kuo previously claiming for example that “high-end” iPhone 13 models would get upgraded telephoto cameras.",
    "So far though it doesn’t sound like any of the iPhone 13 range will be getting huge camera improvements, with more exciting features like periscope cameras reportedly not landing until the iPhone 14 or later. So if you’re hoping for a camera overhaul, this might not be the year to upgrade."
  ],
  "headers": {
    "3": "Similar snappers"
  },
  "links": {
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13",
    "Apple Insider": "https://appleinsider.com/articles/21/03/31/iphone-13-pro-max-to-feature-f15-wide-angle-camera-kuo-says",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "would get upgraded telephoto cameras": "https://www.techradar.com/news/iphone-periscope-cameras-could-be-years-away",
    "not landing until the iPhone 14 or later": "https://www.techradar.com/news/apple-preps-a-10x-zoom-camera-but-the-iphone-13-wont-get-it"
  }
}