{
  "source": "https://www.techradar.com/news/good-news-for-vw-id3-and-id4-owners-as-free-updates-roll-out-to-the-electric-cars",
  "title": "Good news for VW ID.3 and ID.4 owners as free updates roll out to the electric cars",
  "category": "car-tech",
  "updated": "2021-11-08T12:36:59Z",
  "author": "chris-teague",
  "summary": "ID. Software 2.3 is now available to download",
  "article": [
    "Like most major automakers these days, Volkswagen is well on its way to becoming a tech-forward, electric-first company.",
    "The German auto giant currently offers a few EV models (ID.3, ID.4 and ID.4 GTX), only one of which is available in the United States, but all of which come with the latest tech and safety features.",
    "To capitalize on that hardware, VW recently announced that it would use over-the-air updates (OTAs) to introduce new features and improve existing functionality.",
    "While OTAs were previously only available to owners who registered for VW's \"ID. First Movers Club,\" all ID. models will receive regular updates going forward, starting with \"ID. Software 2.3\" which is available to download to vehicles now.",
    "The OTAs will be offered for free, and will add functionality to the cars' infotainment systems, improve safety tech, and benefit other aspects of the vehicles' operation.",
    "VW believes the updates will facilitate a better ownership experience for its customers.",
    "One of the most common complaints new owners have about their vehicles is that the technologies are hard to use or don't work as expected, so an automaker having the ability to issue fixes or deliver new content could significantly improve connections with its customers.",
    "As VW notes, OTAs also open the door for new revenue streams through subscription services and performance upgrades.",
    "Other automakers offer similar features to their customers, some of which extend the vehicles' physical performance, so there are several avenues that VW could take here.",
    "Though Volkswagen doesn't directly address it, the potential impact that over-the-air updates could have on vehicle lifecycles is a critical point to note.",
    "While software updates can't physically change a vehicle's hardware, such as its suspension, brakes, or engine, they can be used to enhance the car in other ways.",
    "More apparent benefits of OTAs include adding new infotainment features and upgrading maps in the navigation system, but a software update can also improve fuel economy, bring better acceleration, increase range and change how various advanced safety features work.",
    "Rather than buying a new car to get the latest features, owners can pay or subscribe to an update. By doing so, vehicle owners save money, and by holding onto the vehicle for longer, there's less waste."
  ],
  "headers": {
    "6": "Analysis: free for now, but there may be costs ahead"
  },
  "links": {}
}