{
  "source": "https://www.techradar.com/news/bitcoin-is-no-longer-the-cryptocurrency-king",
  "title": "Bitcoin is no longer the cryptocurrency king",
  "category": "computing",
  "updated": "2021-05-06T11:01:43Z",
  "author": "anthony-spadafora",
  "summary": "Ethereum has crossed the $3,000 mark",
  "article": [
    "The world's first cryptocurrency has some competition on its hands as Ethereum has finally reached the $3,000 milestone as its token Ether has quadrupled in price since the beginning of this year.",
    "While Bitcoin has been the world's go-to cryptocurrency for some time now, Ethereum's recent rise suggests that there is still room for competition as the crypto market evolves.",
    "One thing that sets Ethereum apart from Bitcoin is the fact that it provides the infrastructure for both the NFT (non-fungible token) and decentralized finance (DeFi) industries which have both seen tremendous growth over the last six months.",
    "However, Bitcoin still has a much larger market cap at $1.1tn compared to Ethereum's $390bn but this could certainly change with more investors and projects buying into the Ethereum blockchain. In fact, just last week, the European Investment Bank (EIB) announced its plans to launch a digital bond sale on the network at the price of $100m.",
    "At the time of writing, one Ether is currently valued at $3,291 and Ethereum has seen its value rise by 10 percent on Monday alone.",
    "Other factors that have contributed to Ethereum's recent rally include the fact that next generation of the Ethereum blockchain, known as Ethereum 2.0, went live at the end of last year and the cyrptocurrency exchange Coinbase was listed on the NASDAQ exchange under the ticker COIN last month.",
    "At the end of last year Ethereum was trading at less than $1000 per coin before it shot up in January 2021 and hasn't slowed down since. Now that Ethereum has hit $3,000, some investors are wondering if the cryptocurrency will continue its rally to reach $5,000. Bitcoin on the other hand has failed to recover since it fell from a mid-April record of almost $64,870.",
    "Only time will tell if Ethereum continues to gain ground or if we'll see another market correction similar to the one which took place in 2017.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies.",
    "Via Bloomberg"
  ],
  "headers": {
    "4": "Ethereum rally"
  },
  "links": {
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "Ethereum": "https://www.techradar.com/news/worlds-second-largest-cryptocurrency-sets-new-all-time-high-price",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "NFT": "https://www.techradar.com/news/what-is-an-nft-non-fungible-tokens-explained-and-why-you-shouldnt-dismiss-this-fad",
    "DeFi": "https://www.techradar.com/news/what-is-defi-everything-you-need-to-know",
    "Ethereum blockchain": "https://www.techradar.com/news/ethereum-a-victim-of-its-own-success",
    "digital bond sale": "https://www.techradar.com/news/ethereum-jumps-to-record-high",
    "Ethereum 2.0": "https://www.techradar.com/news/against-all-odds-ethereum-20-is-finally-here",
    "cyrptocurrency exchange": "https://www.techradar.com/news/best-bitcoin-wallets",
    "COIN": "https://www.techradar.com/news/bitcoin-ether-surge-to-new-all-time-highs-ahead-of-coinbase-float",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-03/bitcoin-s-crypto-dominance-falls-as-ether-and-other-coins-soar"
  }
}