{
  "source": "https://www.techradar.com/news/google-workspace-update-will-block-spillover-between-corporate-and-personal-accounts",
  "title": "Google Workspace update will block spillover between corporate and personal accounts",
  "category": "computing",
  "updated": "2021-09-14T20:31:55Z",
  "author": "anthony-spadafora",
  "summary": "Google is bringing data protection to Google Chat on iOS",
  "article": [
    "Google has announced a new update for Google Workspace aimed at protecting Google Chat data sharing between users' professional and personal accounts on iOS.",
    "Earlier this year the search giant announced a new admin setting that restricts data and content sharing between Workspace accounts and personal Google accounts in Gmail, Drive, Docs, Sheets and Slides on iOS. Now though, the company is expanding this admin setting to include Google Chat.",
    "With data protection, users are only able to share or save content such as files, emails, chat messages or copied and pasted content within Google Workspace accounts. This protects users from accidentally or even intentionally sharing a Chat message with their personal Google accounts or saving data to their personal account.",
    "As Google's applications on iOS support multi-user logins that allow users to access Gmail, Google Drive, Docs, Sheets, Chat and Slides with their personal and Workspace accounts, keeping these accounts separate is of the utmost importance from a security standpoint.",
    "By giving admins the ability to control how data is shared across user accounts, organizations can help minimize accidental data sharing.",
    "Together with Google's copy and paste and drag and drop restrictions and its protection against data sharing between Google Workspace and personal Google accounts, these measures expand data protection coverage and help increase the security of corporate data on iOS.",
    "While admins can visit the Help Center to learn more about controlling whether users can copy work data to personal apps on iOS devices, end users will be able to securely share enterprise Google Chat content once this feature is enabled by their organization."
  ],
  "headers": {
    "3": "Google Chat data protection"
  },
  "links": {
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Google Chat": "https://www.techradar.com/news/google-chat-update-will-finally-shield-you-from-the-barrage-of-notifications",
    "iOS": "https://www.techradar.com/news/ios-15-update",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "Docs": "https://www.techradar.com/reviews/google-docs",
    "Sheets": "https://www.techradar.com/reviews/google-sheets",
    "Chat": "https://www.techradar.com/reviews/google-chat",
    "Slides": "https://www.techradar.com/reviews/google-slides",
    "corporate data": "https://www.techradar.com/news/remote-work-could-be-putting-sensitive-corporate-data-at-risk",
    "copy work data to personal apps": "https://support.google.com/a/answer/6328700#data_protection&zippy=%2Cdata-protection"
  }
}