{
  "source": "https://www.techradar.com/news/save-over-30-on-the-incredible-dell-xps-13-in-this-early-black-friday-deal",
  "title": "Save over 30% on the incredible Dell XPS 13 in this early Black Friday deal",
  "category": "computing",
  "updated": "2021-11-11T11:39:20Z",
  "author": "jess-weatherbed",
  "summary": "$300 dollars back in your pocket",
  "article": [
    "Dell often has some of the best early Black Friday deals, and this year is no exception, with the current model of Dell XPS 13 available for just $649.99, down from $949. (Not in the US? Scroll down for deals in your region).",
    "That's a saving of 31% on one of the best laptops currently on the market, which means you won't need to compromise performance for affordability if you're looking to buy a high-quality portable workstation on a tight budget.",
    "This is the smallest laptop in the Dell XPS family, but that smaller, more portable size doesn't mean it's a less capable device. In fact, this is one of the few laptops to fairly compete against the MacBook Air, is one of the most appealing portables available, making this one of the best Ultrabooks for working professionals and students alike.",
    "This saving is applied to the base model, which comes equipped with an 11th generation Intel i5-1135G7 processor, 8GB of super speedy DDR4x RAM and a 256GB SSD for storage, which is ideal as an everyday laptop for web browsing, office tasks like spreadsheets and checking emails, and homework.",
    "This is also the model without a touchscreen, but you can include one for an additional $300, which still saves you $100 on the usual retail price.",
    "If you need something with a little more juice then the flagship XPS 13 is also available with a beefed-up Intel i7-11655G7 processor, 16GB of RAM, a 1TB SSD, and that full HD touch display for $1,399.99, saving you $150 on the usual $1,549.99.",
    "The Dell Black Friday sale often starts early, getting a leg up in the run-up to the big event itself, but they also tend to take offers down quickly when stock has been depleted so if you want to snag yourself a real bargain, you'll need to act fast.",
    "No matter where you live, you'll find all the lowest prices for the Dell XPS 13 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "7": "More Dell XPS 13 deals",
    "8": "More Black Friday deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "portable workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Dell Black Friday": "https://www.techradar.com/black-friday/dell-black-friday-deals"
  }
}