{
  "source": "https://www.techradar.com/news/valves-vr-headsets-are-just-a-stepping-stone-to-something-much-bigger",
  "title": "Valve's VR headsets are just a stepping stone to something much bigger",
  "category": "wearables",
  "updated": "2021-12-02T10:25:51Z",
  "author": "rhys-wood",
  "summary": "Brain computer interfaces, you say?",
  "article": [
    "Many of us are unironically and perhaps foolishly waiting for that elusive third main entry in the Half-Life series. But Valve co-founder Gabe Newell may have let slip that his company's future lies in the evolvement of VR, AR and \"brain computer interfaces,\" or BCI.",
    "As reported by RoadToVR, Newell, speaking at the Sancta Maria College in Auckland, New Zealand, made a comment that perhaps had a little more gravitas than the audience was expecting.",
    "\"There are interesting questions,\" Newell said, \"like: are things sort of stable end goals or are they transition points? My view, which is not in the accepted middle realm, is that VR and AR are transition points towards brain-computer interfaces.",
    "\"Everything you have to do in terms of controls in games, in terms of understanding visual processing, in terms of competent design are leading you towards brain-computer interfaces and what they do.",
    "\"I think brain-computer interfaces are going to be incredibly disruptive, one of the more disruptive technology transitions we’re going to go through. So I think it’s super valuable. We’re making big investments in new headsets and games for those application categories, but also looking further down the road and saying, 'what’s that evolve into?'\"",
    "Valve, of course, has already made significant strides in the VR space. The company co-developed the HTC Vive headset all the way back in 2015, following up with the Valve Index in 2019, a premium VR headset and arguably the best on the market, if you can afford it.",
    "The company also released Half-Life: Alyx in 2020, arguably the biggest and easily one of the best VR games to date. The scope and scale of that game is potentially indicative of Valve's future plans with virtual and augmented reality.",
    "Newell confirmed as much at the same talk, stating: \"Half-Life: Alyx was sort of our best statement on what we think the opportunities are, and I think that encapsulates our current best thinking on that. And it also informs the decisions we’re making on the next generation of headsets we’re developing.\"",
    "Currently, our best guess as to Valve's general objective with its future VR headsets, based on Newell's comments, is to create hardware that better supports large-scale games and apps like we saw with Half-Life: Alyx.",
    "Even though we're starting to see more ambitious VR projects like Resident Evil 4 VR, many virtual reality experiences still boil down to quick tech demos or specific gimmicks. The tech still has very few genuine killer apps that have people rushing out to buy one of the best VR headsets.",
    "As for the concept of brain computer interfaces, it's not a new concept for Valve. Newell has previously dabbled with the idea, stating \"we're way closer to The Matrix than people realize.\"",
    "Which... taken at face value, is a bit of a scary thought, even if Newell clarified that brain computer interfaces (or BCI) should be about making games and apps more of an immersive package and not, in fact, an indistinguishable virtual world we're all unknowingly trapped within.",
    "It's still obviously very early days, and Newell's own comments on what BCI tech can offer for gaming and other VR experiences are conceptual at best. That said, we can't say we're not a little intrigued by the concept of exploring a fully realized virtual world that our senses can actively react to. Time will tell if the tech pans out to be anything remotely realistic, or if it will remain the pipe dream of ambitious inventors for decades to come."
  ],
  "headers": {
    "8": "Analysis: Erm, brain computer interfaces?"
  },
  "links": {
    "RoadToVR": "https://www.roadtovr.com/gabe-valve-vr-headset-bci-investments/",
    "Half-Life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "best VR games": "https://www.techradar.com/best/the-best-vr-games",
    "Resident Evil 4 VR": "https://www.techradar.com/reviews/resident-evil-4-vr-review",
    "best VR headsets": "https://www.techradar.com/news/the-best-vr-headset",
    "dabbled with the idea": "https://www.roadtovr.com/gabe-newell-brain-computer-interfaces-way-closer-matrix-people-realize/"
  }
}