{
  "source": "https://www.techradar.com/news/xbox-game-pass-was-almost-a-complete-disaster",
  "title": "Xbox Game Pass was almost a complete disaster",
  "category": "gaming",
  "updated": "2021-11-15T16:33:24Z",
  "author": "rhys-wood",
  "summary": "Would Xbox Game Pass have succeeded as a rental service?",
  "article": [
    "Xbox Game Pass is often touted as one of the best deals in gaming. And if you own an Xbox Series X/S, Xbox One or a gaming PC, the subscription service that lets you download and fully play its library of games is almost too good to pass up.",
    "But that wasn't always the case. As GQ reports, Xbox Game Pass could have spun off in a different direction entirely, and it's one that doesn't sound all that great. The service's concept actually dates back to 2013, during the dawn of the Xbox One, and was originally going to focus on rentals.",
    "Rentals didn't last long as a concept, however, as the rise of services like Spotify and Netflix seemed to tell Microsoft that a subscription model would have been preferable to a rental system.",
    "Xbox's head of gaming ecosystems, Sarah Bond, explained that not even the subscription model for Xbox Game Pass was well received at first: \"They were like, 'no way, [Game Pass] is going to devalue games.'\"",
    "And as an untested concept at the time, that's not an unreasonable opinion to have. Of course, Game Pass debuted with the launch of Sea of Thieves which, after spending some time finding its sea legs, has since clocked over 25 million players.",
    "Similarly large numbers are attracted to Xbox Game Pass releases even today, with the recently launched Forza Horizon 5 already drawing in 6 million players during its first week.",
    "We couldn't be happier that Microsoft shifted to the subscription model we know for Xbox Game Pass, as it might not even be around today if the company stuck to its guns with a rental service. If it did, the service likely would've bit the dust like Blockbuster Video, or faded into obscurity much the same way LoveFilm did. Anyone remember LoveFilm?",
    "It's also worth noting that streaming king Netflix also began as a DVD rental service. The company didn't grow exponentially until it shifted to its current subscription model. As such, it's likely that Microsoft saw the sea change at the time, and decided to pivot away from the diminishing rental format.",
    "Not only are rentals something of an outdated concept in the entertainment space, they simply don't work well at all for gaming. And sure, some apps do still offer a digital rental option, like Prime Video, but that's a last resort when streaming that movie or show simply isn't an option.",
    "As for gaming, imagine coming to the end of your rental time right before you're about to take on the final boss. Your character draws their sword, the sweeping orchestra kicks in, and all of a sudden you get a pop-up prodding you to \"add more game time to keep playing!\" It would completely sour the moment and instantly disintegrate any immersion you would otherwise have had.",
    "EA Play's 10-hour trials, available to download through the Xbox Game Pass Ultimate tier of subscription, are probably the closest thing the service still has to a rental system. But in this case, it's still a part of your monthly sub fee and available to play at no extra cost. These are also for very recent releases like FIFA 22 and Battlefield 2042, so it's understandable that EA would make them available in a more limited capacity."
  ],
  "headers": {
    "6": "Analysis: Rentals would have sunk Game Pass"
  },
  "links": {
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "GQ": "https://www.gq-magazine.co.uk/culture/article/xbox-phil-spencer-todd-howard-interview",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-review",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "6 million players": "https://www.gameinformer.com/2021/11/15/update-forza-horizon-5-surpasses-6-million-players-during-launch-week",
    "Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042"
  }
}