{
  "source": "https://www.techradar.com/news/ransom-ddos-could-be-the-next-big-threat",
  "title": "Ransom DDoS could be the next big threat",
  "category": "computing",
  "updated": "2021-08-19T11:05:58Z",
  "author": "sead-fadilpasic",
  "summary": "RDDoS is easier to pull off than ransomware attacks",
  "article": [
    "Ransom extortion under threat of a distributed denial of service (DDoS) attack is a lot easier to pull off than a full-blown ransomware assault, which is why this model of cybercrime is rapidly increasing in popularity.",
    "US telecoms company Lumen Technologies recently published its quarterly distributed denial of service (DDoS) report for Q2 2021, which encourages businesses to prepare to combat a new wave of RDDoS attacks.",
    "This type of attack is growing in destructive power, as well as in sheer volume, the company warns.",
    "Regular DDoS attacks are also growing in number and destructive power. Compared to Q1 2021, there were 14% more attacks mitigated in Q2, with the largest attack by bandwidth coming in at 419 Gbps.",
    "The largest by packet rate was recorded at 132 packets, and the longest attack mitigated by Lumen lasted a full 10 days.",
    "Compared to the previous quarter, Gafgyt and Mirai, two of the most fearsome botnets out there, spawned 22% more unique command and control (C&C) centers.",
    "The United States had the most servers hosted in a single country (431), as well as most commands coming from a single country (131). Meanwhile, Brazil is emerging as a C&C superpower of sorts, with a 173% increase in the number of botnets hosted in the country.",
    "\"The threat actors aren't just looking to disrupt – they are frequently running criminal campaigns looking to make a profit,” said Mike Benjamin, VP Security at Lumen.",
    "“Some businesses are purely digital, and that makes them more vulnerable because when the potential attack surface increases, this also increases the opportunity for threat actors. The best defense is a DDoS mitigation service that stops these attacks before they happen.\""
  ],
  "headers": {
    "3": "DDoS grows more dangerous"
  },
  "links": {
    "DDoS": "https://www.techradar.com/news/best-ddos-protection"
  }
}