{
  "source": "https://www.techradar.com/news/ways-of-working-in-2021-rethink-refresh-and-revise-how-you-work",
  "title": "Ways of working in 2021: rethink, refresh and revise how you work",
  "category": "computing",
  "updated": "2021-02-04T11:15:17Z",
  "author": "shawn-rosemarin",
  "summary": "Professional learnings from 2020",
  "article": [
    "To say that 2020 was a tumultuous year would be an understatement. We faced disruption and upheaval to every facet of our personal and professional lives, including routines that we have relied on for years if not decades, right down to buying groceries and exercising. Understandably, many of us have been left wondering when things might go back to normal. Not so long ago, 91 year-old Margaret Keenan from the UK became the first person in the world to be given the Covid-19 vaccine, and there are early signs that we may be on the road back to normality.",
    "However, just because we may be able to return to the status quo in 2021, who’s to say that we should? I speak in the context of our professional lives. This year has presented us with an opportunity to take pause and rethink the way we live and work, as well as the chance to establish a new sense of balance moving forwards. 2020 was a challenging year but the optimist in me sees the silver linings. For example, many of us have eliminated long or costly commutes and traded non-essential meetings and international travel for tele-working and Zoom calls, resulting in more time spent with our families, room for hobbies, a lower carbon footprint and a decrease in global emissions to name a few.",
    "In particular, over the last several months I have spent a lot of time thinking about how we have navigated this change, how to apply key learnings, and how to help my colleagues and their teams adapt to the new normal that’s set to arrive in 2021 and beyond. Here’s what I’ve learned so far:",
    "Empathy comes first – At this time, more than ever, empathy must come first in every conversation. “Seek to understand before seeking to be understood” – Stephen Covey.",
    "Energy stores are generated by Self, Family, Work in that order – Focus on your own health and your family bond in order to supercharge your energy available at work.",
    "Perspective helps people process change – Maximize your exposure to a wide array of opinions, including ones that conflict with what you believe. Challenge your thinking and create new opinions. Share your learnings with your teams.",
    "Get beyond the walls of your office – Get out of your home office, enjoy nature, listen to a podcast, or even take a call the “old school” way while walking around the neighborhood. Video conferencing is an incredible technology but it is not intended to replace every other form of communication.",
    "Remote meetings – evolve your format - Don’t simply leverage Zoom as a platform for your meetings, evolve the way you conduct meetings to drive engagement, participation and most importantly collaboration – think about breakout rooms, post-it notes and whiteboard functionality to really change the experience.",
    "Integrate podcasts to break-through monotony of webinars. In my opinion thoughtful dialogue delivered via podcast provides a different forum than conference calls or webinars and within my organization, overall knowledge and learnings have dramatically improved.",
    "Ruthlessly prioritize – Focus on what is important, eliminate “busy work” with no tangible outcomes and help your teams prioritize outcomes over activity. Inspect the outcomes, not the tasks.",
    "Communicate to your teams with an emphasis on ‘why’ – Help your teams connect every announcement or corporate change with the relevance to your organization and why it matters. You should also make the connection clear as to how changes and developments will help employees deliver a better service/experience to your customers.",
    "Cut yourself some slack – This is hard and not every idea you try is going to work. Be honest with yourself and your teams about what is working and what is not. Don’t be afraid to show humility. We are going through 10 years of change in less than 12 months and there are bound to be bumps along the road.",
    "There are countless other lessons to be learned from this year, but if you can integrate some of these learnings into your work life you’ll soon see the benefits. Your colleagues will appreciate a conscious effort to lead by example through compassion and a laser-focus on outcomes. Indeed, companies and managers who place physical and mental health of employees first and foremost are set to attract and retain the best talent.",
    "It’s the leaders who champion empathy, an innovative way of doing business and an understanding and recognition of their employees’ unique personal lives who will get the most out of their staff, regardless of whether this is in-person or remote. It will be interesting to see which companies get it right, and whether new companies emerge to take market share from those unable to adapt to this uniquely challenging environment."
  ],
  "headers": {
    "2": "How to navigate change",
    "12": "Lessons learned"
  },
  "links": {
    "Zoom": "https://www.techradar.com/best/zoom-alternatives",
    "office": "https://www.techradar.com/best/best-office-desks",
    "Video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "webinars": "https://www.techradar.com/best/best-webinar-software",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "remote": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}