{
  "source": "https://www.techradar.com/news/apex-legends-could-get-titanfall-2s-best-feature",
  "title": "Apex Legends could get Titanfall 2’s best feature",
  "category": "gaming",
  "updated": "2021-03-25T16:38:32Z",
  "author": "rhys-wood",
  "summary": "Stand by for...",
  "article": [
    "An Apex Legends dataminer has shared findings that Titans could be making their way to the popular battle royale game by way of a not-yet-announced character’s unique abilities. The leaker, Biast12, shared a datamined clip on Twitter showing the character spawning a Titan – the iconic giant robots from the Titanfall series – but with some tweaks suggesting we might not get the same mech action we know and love.",
    "In the clip, we can see the new character calling in an Auto-Titan which, when dropped onto the map, lays down suppressive fire in a conal area. Unfortunately for fans eager to jump in the cockpit, it looks like the Titan won’t be able to be piloted by the player and will instead be entirely controlled by the AI.",
    "It’s a welcome callback to Respawn Entertainment’s Titanfall series, which the developer has confirmed shares the same universe as Apex Legends. Speaking of throwbacks, Biast12’s tweet shows that the new character should be recognizable to fans of the Titanfall games and their memorable villains.",
    "The character in question is none other than Blisk, a primary antagonist from the Titanfall series (and leader of the Apex Predators mercenary unit as well as rumored founder of The Syndicate, which created the Apex Games battle royale portrayed in Apex Legends). If the datamine’s information is true, then Apex Legends players invested in the lore of the wider series should have even more to chew on, especially when it comes to the future of both Apex Legends and Titanfall.",
    "While nothing has been confirmed on either EA or Respawn Entertainment’s side, we can see Blisk’s addition to Apex Legends acting as a bridge between it and a potential Titanfall 3, should it ever come. There’s no better time for it, either, especially with the current console generation in full swing with PS5 and Xbox Series X/S.",
    "Titanfall 3 could also land a sizable playerbase at launch, too, if it’s featured on EA Play. This EA subscription service allows players to delve into a vast back catalog of EA titles, and has been integrated into Xbox Game Pass.",
    "That said, Apex Legends is still a popular multiplayer game, so EA might not yet be willing to eat into its player base with a third Titanfall entry. But a year or two down the line from now, that could be something that changes as players feel naturally inclined to move onto other games."
  ],
  "headers": {
    "3": "Titan's boon"
  },
  "links": {
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Biast12": "https://twitter.com/Biast12/status/1374560617458249728?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1374560617458249728%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.techradar.com%2F",
    "Titanfall": "https://www.techradar.com/news/titanfall-2-review",
    "rumored": "https://www.looper.com/211679/the-entire-apex-legends-story-explained/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}