{
  "source": "https://www.techradar.com/deals/latest-kindle-deals-drop-the-paperwhite-to-its-lowest-price-ever",
  "title": "New Kindle deals at Amazon include the Paperwhite for its lowest price ever",
  "category": "tablets",
  "updated": "2021-12-04T02:59:26Z",
  "author": "james-pickard",
  "summary": "Plus, great discounts on the Kindle and Kids Edition",
  "article": [
    "A new wave of Kindle deals is now available in both the US and UK at Amazon, featuring some of the lowest prices we've ever seen for the popular ereader.",
    "The best offer is on the Kindle Paperwhite, which is currently discounted by $50 and repeating its lowest ever Prime Day price of $79.99. Meanwhile, UK bookworms can get the Kindle Paperwhite for £69.99 – that's £50 off the normal price and an even better deal than we saw over Prime Day this year.",
    "The Kindle Paperwhite has a couple of useful upgraded features compared to the standard model. There's a higher resolution 300dpi screen that fervent readers will appreciate for the clearer and superior reading experience. The Paperwhite also has a waterproof design that should give you added peace of mind if you like to flick through a book in the bath, at the beach or by the pool.",
    "If your budget doesn't quite stretch to the Paperwhite or your reading habits are a bit more sporadic, you could save yourself a bit of cash and pick up the standard Kindle while it's reduced to $64.99 in the US and £54.99 in the UK.",
    "It's not quite the cheapest Kindle deal we've ever seen (that was when it was reduced to $54.99/£49.99 for Prime Day), but that's still a decent $25/£15 discount off the usual price and great value for one of the best ereaders.",
    "Plus, with every one of these Kindle deals, you can also sign up for three months of Kindle Unlimited for free. With this, you get access to over two million ebooks as part of your subscription to pick and choose from. Keep in mind that'll you'll need to cancel your membership before those 90 days are up or it will be auto-renewed for another month at the regular price of $9.99.",
    "Whichever one you go for, know you'll be getting one of the best cheap Kindle deals we've seen this year.",
    "Not in the US or UK? Scroll down for even more Kindle deals from your region.",
    "Need some extra help deciding which model is the right one for you? Take a look at our Kindle vs Paperwhite comparison guide to see if you think it's worth spending more money. You can also read more into the Kindle Unlimited free trial to see how to get the most out of your included subscription time.",
    "You might also want to check out Amazon Prime Day Kindle deals."
  ],
  "headers": {
    "8": "More of the best Kindle deals"
  },
  "links": {
    "lowest ever Prime Day price of $79.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FKindle-Paperwhite-Waterproof-Storage-Special%2Fdp%2FB07CXG6C9W%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5955848637040492000-20",
    "Kindle Paperwhite for £69.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fkindle-paperwhite-waterproof-6-inch-high-resolution-display-8gb-twilight-blue%2Fdp%2FB07S3844V8%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-2238555161665741300-21",
    "$64.99 in the US": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FKindle-Now-with-Built-in-Front-Light%2Fdp%2FB07978J597%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1049880834861619300-20",
    "£54.99 in the UK": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fkindle-now-with-a-built-in-front-light%25E2%2580%2594with-special-offers%25E2%2580%2594black%2Fdp%2FB07FQ4DJ7X%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-3860147649478566000-21",
    "best ereaders": "https://www.techradar.com/best/best-ereader",
    "Kindle Unlimited": "https://www.techradar.com/news/amazon-kindle-unlimited-price-how-much-does-it-cost",
    "cheap Kindle deals": "https://www.techradar.com/news/portable-devices/portable-media/kindle-deals-1296345",
    "Kindle vs Paperwhite": "https://www.techradar.com/news/amazon-kindle-vs-kindle-paperwhite",
    "Kindle Unlimited free trial": "https://www.techradar.com/news/amazon-kindle-unlimited-free-trials-all-the-offers-available-now",
    "Amazon Prime Day Kindle deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-kindle-deals-2020"
  }
}