{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-design-revealed-in-unofficial-renders",
  "title": "Samsung Galaxy S21 FE design revealed in unofficial renders",
  "category": "phones",
  "updated": "2021-04-11T09:30:03Z",
  "author": "david-nield",
  "summary": "No surprises here",
  "article": [
    "Samsung usually pushes out a more affordable Fan Edition version of its flagship S series phones each year, and it looks as though 2021 will be no different – the Samsung Galaxy S21 FE is expected soon, and now we have what could be our first look at the device.",
    "The early preview comes courtesy of well-known tipster @OnLeaks, whose unofficial renders are usually on the mark in terms of accuracy. Unsurprisingly, the new images don't show too many design changes from the Samsung Galaxy S21 series.",
    "One aesthetic tweak is that the rear camera module is a more integrated part of the back casing, rather than extending from the metal frame at the side – that means it's the same color as the rear of the phone for a more consistent look.",
    "The Galaxy S21 FE is also apparently going to be 4 mm taller and 3.3 mm wider than the standard Galaxy S21 that came before it, though it'll be the same thickness. The display size is set to increase from 6.2 inches to 6.4 inches as well.",
    "On the front of the smartphone, the punch hole selfie camera is staying, and around the back it sounds as though Samsung is going to use the same glass-and-plastic material mix that it used on the Galaxy S21 – something it calls 'glasstic'.",
    "\"The Galaxy S20 FE was a huge hit because it retained the best features of the Galaxy S20 but cost substantially less,\" writes @OnLeaks, aka Steve Hemmerstoffer. \"The good news is Samsung looks set to repeat this successful formula with the Galaxy S21 FE.\"",
    "We don't get any details about specs from this particular leak, though a price of $700 is mentioned as a target that Samsung would do well to hit. The Samsung Galaxy S20 FE phone launched with a retail price of $699 / £699 / AU$1,149 for the 5G model.",
    "Previous rumors have suggested that the Galaxy S21 FE phone is going to make an appearance in August, possibly with a front-facing 32MP camera and light green, white, gray, purple, and pink color options."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "@OnLeaks": "https://www.voice.com/post/@onleaks/exclusive-first-look-at-the-samsung-galaxy-s21-fe-1618092108-1463111506",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "in August": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-launch-in-august-per-leaked-roadmap",
    "color options": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-and-camera-details-leaked"
  }
}