{
  "source": "https://www.techradar.com/news/netflixs-witcher-is-teasing-a-cd-projekt-team-up-but-what-could-it-be",
  "title": "WitcherCon is coming from Netflix and CD Projekt Red (updated)",
  "category": "entertainment",
  "updated": "2021-06-11T16:42:13Z",
  "author": "tom-power",
  "summary": "The Witcher is bringing Netflix and CD Projekt Red together for an event",
  "article": [
    "Update: Here's what it is – a digital event from Netflix and CD Projekt Red focused specifically on The Witcher called WitcherCon, and it's coming on July 9. Expect to find out loads more about season 2 there, and probably some new games news.",
    "Original story: It seems that The Witcher, the book series originally created by Polish author Andrezj Sapowski, is set for a bumper few weeks.",
    "Netflix's hit adaptation of the franchise is getting some form of announcement during day 5 of Netflix Geeked Week later today (Friday, June 11), but it appears that there's more in store for The Witcher beyond that potential reveal.",
    "How so? According to a Twitter exchange between Netflix and CD Projekt Red (the studio behind the critically-acclaimed Witcher game series), something big will go down in July.",
    "The brief chat began when the official Twitter account for The Witcher's game series asked Netflix if they were free on Friday, July 9:",
    "Netflix's Twitter account for its Witcher adaptation responded positively, before CD Projekt ended the discussion by saying \"It's a date!\"",
    "As you'd expect, numerous Twitter users have begun speculating about what this potential reveal could be.",
    "There were no hints as to what this reveal could entail in Netfix's or CD Projekt's tweets, but that won't stop us from speculating.",
    "The first (and most obvious) announcement would be a release date for The Witcher season 2 on Netflix. It's what most fans are leaning towards in response to the duo's Twitter exchange and, given we don't have a launch date yet, it's easy to see why that's been chosen.",
    "Of course, we could get a season 2 release date reveal as part of day 5 of Netflix Geeked Week. If we do, then this tease from Netflix and CD Projekt will be related to something else.",
    "What could Netflix and CD Projekt be hinting at, if not The Witcher season 2's launch date? One option is Nightmare of the Wolf, an upcoming 2D animated film that's due to land on the streamer later in 2021.",
    "Serving as a spin-off to Netflix's live-action Witcher adaptation, Nightmare of the Wolf will focus on the origins of Geralt's mentor Vesemir.",
    "If this is what Netflix and CD Projekt are teasing, though, it seems strange that CD Projekt would be heavily involved in it, given that they're not involved in the TV show's production. That extends to Netflix's other Witcher spin-off projects, including The Witcher: Blood Origin.",
    "If CD Projekt are part of this announcement, we suspect that it'll be more gaming-related and not tied to Netflix's various Witcher productions.",
    "We could see Henry Cavill's Geralt turned into a playable character skin in CD Projekt's latest Witcher game Wild Hunt. While that game originally released back in May 2015, a next-gen version (for PS5 and Xbox Series X/S) is set to be released later in 2021. It could be, then, that Cavill's Geralt will be a free character skin that players can use in-game when the next-gen editions arrive.",
    "If this isn't related to The Witcher 3: Wild Hunt, how about The Witcher 4? Whilst an announcement about an in-development fourth Witcher game would be huge, we can't see this being the July 9 reveal. For one, Geralt won't be the lead character in any subsequent Witcher games, and it wouldn't make sense for Netflix to be involved in a game-related announcement anyway.",
    "In summary, the July 9 reveal will depend on what's announced on Netflix Geeked Week Day 5. If The Witcher season 2 gets a release date today, the July 9 announcement will be something we don't know much (if anything) about.",
    "If Netflix doesn't give us a launch date for season 2, however, we should get that on July 9."
  ],
  "headers": {
    "8": "Analysis: what can we expect from the upcoming Witcher reveal?"
  },
  "links": {
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "The Witcher: Blood Origin": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect",
    "later in 2021": "https://www.techradar.com/news/the-witcher-3-on-ps5-and-xbox-series-x-coming-later-this-year",
    "won't be the lead character": "https://www.techradar.com/news/the-witcher-4-release-date"
  }
}