{
  "source": "https://www.techradar.com/news/final-fantasy-7-remake-intergrade-was-the-perfect-way-to-end-my-lockdown",
  "title": "Final Fantasy 7 Remake Intergrade was the perfect way to end my lockdown",
  "category": "gaming",
  "updated": "2021-06-12T18:23:30Z",
  "author": "jackie-thomas",
  "summary": "Opinion: Final Fantasy was my pandemic timeline",
  "article": [
    "I got my hands on Final Fantasy VII Remake just a few days after my office closed for the Covid-19 pandemic, which means I started off a year-long lockdown by playing and reviewing the long-awaited JRPG remake. And a little more than a year later, Final Fantasy VII Remake: Intergrade came out on the exact date marking two weeks after my second vaccine shot.",
    "In a lot of ways, my lockdown experience was totally defined and bookended by Final Fantasy. The new DLC was the perfect way to mark the end of staying at home constantly and the beginning of going outside and living again.",
    "Yuffie has always been one of my favorite characters in Final Fantasy VII, so I was already on board to see her character develop beyond the comedic relief she provided in the original game.",
    "In the 1996 game, she was an optional unlock, and kind of a pain in the ass to get if you didn't already know how to add her to the party. And because of that, she didn't really have a huge impact on the original story in the same way Aerith, Red XIII or Barrett had. But with Final Fantasy VII Remake Intergrade, she takes center stage – and the DLC turns out to be the best part of Final Fantasy VII Remake, as well as an absolutely essential entry for any Final Fantasy fan.",
    "The expansion is way more upbeat right off the bat, mainly because you're playing an upbeat teenager rather than Cloud, who is literally the polar opposite. Immediately this changes the way you're engaging with the world, and even though your goal is similar – you're still out to destroy the dastardly Shinra corporation – it feels like a completely different game.",
    "This is reflected in the gameplay, too. You can only play as Yuffie in the DLC, leaving you unable to swap between teammates like the base game, which means you have to be able to do ranged combat and close-up combat with the same character. She does that by using her boomerang ninja-star thing, which you can throw at an enemy, chain off some hits at range, then hit triangle again to teleport right to the enemy to do higher damage up close.",
    "It still carries the same level of difficulty as the base game, at least on normal, and I did hit a couple of game overs. But that was mostly because I got sucked into the fast-paced action and just started mindlessly mashing buttons to see what would happen.",
    "The combat is so fun that I basically ignored most of the side content – at least after playing the Fort Condor mini-game a couple times – and focused entirely on the main story. I couldn't put it down, and I was easily able to get through the expansion in around 4 hours and 40 minutes.",
    "I'm not going to spoil anything, but the last hour of the game is an emotional roller coaster that brought me to tears and then left me extremely hopeful for Final Fantasy VII Remake Part 2 – whenever that finally comes out. And it's that hopeful mood that I'm carrying with me as I start to venture back into the world.",
    "In a lot of ways, I felt like the world was ending throughout 2020, even though I knew on, like, a rational level that the Covid-19 pandemic would eventually end and a semblance of normality would return. But it's hard to keep that in mind in the middle of something like that, especially if you have problems dealing with anxiety like I do.",
    "In short, I was a wreck basically all year, and I know I'm not alone in that, but I really needed an escape, and in the past that was always MMOs – typically World of Warcraft. But because I was so enamored with Final Fantasy VII Remake, Final Fantasy was obviously at the front of my mind when I was looking for an MMO so I could bury my head in the sand of grinding and raiding. It was probably not a huge surprise that I eventually picked up the hit MMORPG Final Fantasy XIV Online, which now has a free trial up to level 60 and includes the award-winning expansion Heavensward.",
    "Final Fantasy XIV has always been on my radar, and it's the kind of game that I always dabbled in for a few days before unsubscribing. I did some digging through my email and it turns out that I first started playing on September 16, 2013, and then immediately stopped playing. I only vaguely remember that, but that was during the disastrous 1.0 version of the game, which was, uh, bad.",
    "That kind of tainted my view of the game for years, but the pandemic was the excuse I needed to go all-in on the game and see what all the hype was about years after it had been overhauled. And, well, it stuck.",
    "A Realm Reborn was a drag to get through. But after I got to Heavensward I flew to endgame pretty quickly and it's largely thanks to the Free Company I found.",
    "I came across Way of the Wump advertised somewhere, don't remember where, and saw that they billed themselves first and foremost as LGBTQ+-friendly. Because I was already anxious due to what was going on all around me in the real world, that was my first and only priority for finding a community. And I'm glad I found them, because they've become some of my closest friends – even if they're all thousands of miles away from me.",
    "So, some of the best memories I have during the pandemic are either in the world of Final Fantasy XIV or just hanging out in Discord with the people I play Final Fantasy with. They even stayed up with me as I struggled to buy a house in FFXIV (the housing system needs a massive overhaul by the way).",
    "With the background of a global pandemic, both the game Final Fantasy XIV and the community of folks I play it with are what got me through it. And in no small part, I wouldn't have even got around to trying the game again if I didn't get the chance to review Final Fantasy VII Remake. Instead, I probably would have tried to get back into World of Warcraft raiding, been called some slurs, given up, and just ended up playing a bunch of the single-player games that are now in my backlog because I spent all my time raiding in Final Fantasy XIV.",
    "I was a pretty big fan of Final Fantasy before the pandemic started. I've played a lot of the mainline entries – not even going to pretend I've played all of them, I'm only human. But throughout the last year, because I couldn't really do much else, it was really easy to just dump hour after hour into giant RPGs.",
    "So either way, I would have been incredibly excited for Final Fantasy VII Remake Intergrade. But when I heard about it initially I was already on the edge of my seat for any Final Fantasy content I could get my hands on. And by the time it actually came out earlier this week, I just kind of needed it.",
    "So I guess take it with a grain of salt when I tell you that Final Fantasy VII Remake Intergrade is my favorite game of the year so far – even if it's just an add-on to a remake of a game that originally came out 25 years ago. I probably would have loved Intergrade either way, but even with my probably excessive expectations, I was still blown away by how good it was, and how excited it has left me for whatever Square Enix's Tetsuya Nomura has in store for Part 2 whenever that comes out.",
    "Until then, at least I have Final Fantasy XIV: Endwalker to look forward to."
  ],
  "headers": {
    "2": "FF7 Remake Intergrade is excellent",
    "9": "A year of Final Fantasy and anxiety",
    "17": "Final Fantasy forever"
  },
  "links": {
    "Final Fantasy VII Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "Final Fantasy VII Remake: Intergrade": "https://www.techradar.com/news/final-fantasy-7-remake-intergrade-was-the-perfect-way-to-end-my-lockdown",
    "Final Fantasy VII Remake Part 2": "https://www.techradar.com/news/final-fantasy-7-remake-part-2"
  }
}