{
  "source": "https://www.techradar.com/news/apple-smart-contact-lenses-could-be-coming-but-youll-be-waiting-a-long-time",
  "title": "Apple smart contact lenses could be coming, but you’ll be waiting a long time",
  "category": "wearables",
  "updated": "2021-03-08T09:58:52Z",
  "author": "james-rogerson",
  "summary": "Augment your eyes",
  "article": [
    "We’re still waiting for the long-rumored Apple Glasses to arrive, but Apple might have far more ambitious plans beyond those, with a new report suggesting that augmented reality contact lenses could be in the company’s future.",
    "This comes from Ming-Chi Kuo (an analyst with a great track record for Apple information), in a research note seen by MacRumors. However, he says we probably won’t see them until the 2030s.",
    "Kuo claims that these contact lenses probably won’t have independent computing power and storage, which suggests they’d likely be connected to an iPhone or other device.",
    "He describes them as bringing electronics from the era of \"visible computing\" to \"invisible computing,\" – which is to say, the smart devices that we use wouldn’t be things that we hold or visibly wear.",
    "Kuo didn’t go into any further details about Apple’s smart contact lenses, but if they’re augmented reality then that means they’d display a virtual layer over the real world. That layer could potentially serve any number of purposes – arrows overlaid on a road for navigation, messages popping directly into your eyeline, and all sorts of other things.",
    "The smart contact lenses would probably be a bit like the smart glasses that we’re starting to see now, and that Apple is rumored to be working on, just without all the bulk.",
    "All that said, the 2030s are a long way off yet, and Kuo claims that there’s “no visibility” on these contact lenses currently, which suggests this might just be an educated guess rather than anything he’s actually heard that Apple’s working on.",
    "So we’d take both the possibility of these lenses and the timing of their launch with a serious helping of salt. But they would be a logical next step after smart glasses.",
    "First up though there’s the Apple VR headset, which is rumored to be landing in 2022 and to offer both virtual and augmented reality features. Then there’s the Apple Glasses, which might land in 2023 or later. Then, maybe, we can start talking more seriously about Apple contact lenses."
  ],
  "headers": {
    "6": "Don't hold your breath"
  },
  "links": {
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses",
    "MacRumors": "https://www.macrumors.com/2021/03/07/kuo-apple-ar-contact-lenses-2030s/",
    "Apple VR headset": "https://www.techradar.com/news/apple-vr-headset"
  }
}