{
  "source": "https://www.techradar.com/news/microsoft-secretly-fixes-nasty-windows-10-bug",
  "title": "Microsoft secretly fixes nasty Windows 10 bug",
  "category": "computing",
  "updated": "2021-04-30T10:04:58Z",
  "author": "darren-allan",
  "summary": "File History now fixed, but with no official announcement",
  "article": [
    "Windows 10’s File History backup feature has reportedly been misfiring for some folks since February, but apparently Microsoft has now silently solved the issue.",
    "If you recall, the File History bug seemed to appear with the cumulative update for February (patch KB4601319) which also broke some webcams. Users reported the backup system failing, reporting the size of backups as zero bytes, and generally throwing up errors – problems which all disappeared when the patch in question was removed.",
    "Microsoft didn’t acknowledge this issue at the time we wrote about it, and still hasn’t, but as mentioned at the outset, the bug is purportedly now cured.",
    "This is according to Windows Latest, which tells us that the problem has been fixed for most users, with the site being informed by someone who suffered from the bug: “I saw a note on Microsoft Community yesterday that KB5001330 finally fixes this issue. I installed it last night and confirmed that this is so. No idea if it’ll help with the other errors people are having. Nor have I any idea if Microsoft ever publicly acknowledged that the problem existed. But the good news is that it finally works.”",
    "KB5001330 is the patch which brought in some problems itself – notably gaming performance issues, which have now been resolved too – and it applies to the latest build of the imminent Windows 10 May 2021 Update, as well as both of the most recent versions of Windows 10 from last year (20H2 and 2004 – all of which are, of course, built on the latter, as the updates following 2004 are minor ones).",
    "In other words, those on build 19041.928, 19042.928 and 19043.928 (the latter being the preview update still being finalized) should find the File History problem is no more (fingers crossed, anyway).",
    "As you may have noticed, Windows 10 continues to be the victim of various worrying bugs, but that hasn’t stopped the OS from seriously picking up the pace of adoption, and becoming distinctly more popular in recent times."
  ],
  "headers": {
    "4": "Patchy patch"
  },
  "links": {
    "Windows 10’s": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "File History bug": "https://www.techradar.com/news/windows-10-update-has-a-serious-bug-that-could-mess-up-backups",
    "Windows Latest": "https://www.windowslatest.com/2021/04/29/windows-10-update-fixes-a-critical-bug-that-could-mess-up-backups/",
    "brought in some problems itself": "https://www.techradar.com/news/new-windows-10-update-is-causing-a-whole-world-of-pain",
    "now been resolved": "https://www.techradar.com/news/windows-10-gets-a-fix-for-bug-that-caused-stuttering-or-worse-in-games",
    "Windows 10 May 2021 Update": "https://www.techradar.com/news/windows-10-may-2021-update-is-finally-done-and-should-be-rolling-out-soon",
    "updates following 2004 are minor ones": "https://www.techradar.com/news/microsoft-finally-confirms-the-next-windows-10-update-wont-be-anything-exciting",
    "seriously picking up the pace of adoption, and becoming distinctly more popular": "https://www.techradar.com/news/despite-its-problems-windows-10-is-slowly-taking-over-the-world"
  }
}