{
  "source": "https://www.techradar.com/news/the-batman-official-art-has-been-leaked-by-a-calendar",
  "title": "The Batman official art has been leaked - by a calendar",
  "category": "entertainment",
  "updated": "2021-05-20T09:02:53Z",
  "author": "tom-power",
  "summary": "Batman and the Riddler take center stage",
  "article": [
    "The Batman, Warner Bros' latest reboot of the iconic DC superhero, was supposed to be getting released next month. Thanks to the Covid-19 pandemic, however, we're still waiting to see Robert Pattinson's version of the Dark Knight appear on the big screen.",
    "With its launch date pushed back from June 2021 to March 2022, companies have had to delay, or change, their Batman branded merchandise to fall in line with the movie's revised release.",
    "For some manufacturers, the long wait for The Batman to arrive in theaters has seen their products begin to leak online. The latest company to fall prey to such a move is the one behind The Batman's official 2022 calendar - and we've received our best look yet at Pattinson's Batman and Paul Dano's Riddler as a result.",
    "Multiple social media users, including Mikhail Villarreal, have been sharing the leaked images online. As you can see below, we get a much clearer look at Pattinson in his Batman suit, which looks more like a cross between Christian Bale's Dark Knight attire from Christopher Nolan's trilogy and Michael Keaton's costume from his 1989 and 1992 movies.",
    "Check out the tweet below for a closer look:",
    "Villarreal's tweet also gives us a glimpse at the Riddler's mask, but it's hard to get a better view of it. Thankfully, another Twitter User (@nightwaynes) has enlarged the image, seen on the back of the calendar, which shows the Riddler's face covering in more detail.",
    "As you can see, the Riddler's mask comprises gray masking tape, cloth, glasses and what appears to be a leather mouth covering. That mouth piece is likely to be a way of disguising his real voice, much like Batman does when he makes his voice sound more ominous and gravely.",
    "Check out the Riddler's mask below:",
    "What's interesting about the leaked Riddler image is that of it is eerily reminiscent of the villain from a 2007 David Fincher movie.",
    "If you flick through @nightwaynes' images until you reach the final one, you'll see the Riddler's calling card, which he'll presumably leave for Batman and the Gotham PD whenever he makes a fresh kill.",
    "The Riddler's iconic question mark symbol is at the center of the logo, but it's surrounded by what appears to be a crosshair. The question mark aside, that crosshair design is similar to that used by Fincher in his movie adaptation of Robert Graysmith's 1986 novel Zodiac.",
    "Fincher's film tells the story of the manhunt for the Zodiac Killer, a mass murderer who stalked the San Fransisco bay region in the 1960s and 1970s. The killer's costume in Fincher's adaptation had a crosshair symbol on his chest, and it seems that The Batman has taken cues from this for its Riddler.",
    "Of course, that could just be a big coincidence. Zodiac and The Batman are only two examples of movies, or other forms of media, where crosshair symbols have been used by villains and anti-heroes. This may be speculation on our part, then, and we're making links between two serial killers based on their crosshair logo designs.",
    "The other intriguing thing to note about the Riddler's mask is how close it resembles another Batman villain - Hush.",
    "This fairly new Batman foe, who first appeared in 2003 comic series Batman: Hush, has a face mask made up of surgical bandages. These don't just tie into Hush's backstory (we won't spoil it here in case you want to read it), but it also looks like the homemade mask that The Batman's Riddler is wearing, too.",
    "The Riddler's face covering doesn't just look as if it's made up of masking tape. It appears to have a cloth-esque aesthetic, too, which has ties (no pun intended) to Hush's own mask.",
    "Is it possible that Dano will portray a combination of the Riddler and Hush? Or could his character in The Batman actually be Hush, who is simply using the Riddler's signature question mark logo to throw Batman and Gotham police officers off his scent? It would be a fun twist in the movie if that proved to be the case.",
    "We're still a long way from finding out if that's the case anyway. The Batman will arrive in theaters on March 4, 2022."
  ],
  "headers": {
    "8": "Analysis: the Riddler's look is apparently inspired by a 2007 David Fincher movie"
  },
  "links": {
    "The Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer"
  }
}