{
  "source": "https://www.techradar.com/news/microsoft-wants-to-hear-what-you-really-think-about-its-microsoft-365-apps",
  "title": "Now's your chance to say what you really think about Microsoft 365",
  "category": "computing",
  "updated": "2021-11-12T12:12:53Z",
  "author": "anthony-spadafora",
  "summary": "Feedback portal allows users to share ideas directly with Microsoft",
  "article": [
    "Microsoft has launched a new feedback portal in an attempt to learn more onwhat users really think about its Microsoft 365 apps and services.",
    "Feedback for Microsoft 365 is a new community feedback experience built on the software giant's Dynamics 365 Customer Service.",
    "Users can go to Feedback to share their ideas about Microsoft's products with the company as well as with others. In addition to submitting new feedback for the community, users can also participate in existing feedback by voting, commenting or sharing it online.",
    "While Feedback is now available in preview for Microsoft 365 apps and services and Microsoft Edge, the company plans to make the service available at a later date for Windows 11 and its other products.",
    "Feedback for Microsoft 365 also includes a personal My Feedback section where users can view feedback they've submitted publicly or private feedback they've given Microsoft from within its products. Whether they're reviewing public or private feedback, users can review the impact of their feedback as well as the status by viewing official responses from teams at Microsoft working on these products.",
    "While a feedback tool isn't the most exciting new product launch from Microsoft, it will likely benefit users of its products in the long run.",
    "For instance, during our coverage of Microsoft Teams last year, we noticed that many of the updates and new features added to the company's video conferencing software in posts on the Microsoft 365 Roadmap were based on user suggestions such as being able to use multiple Teams accounts on desktop or being able to reply to specific messages in conversations.",
    "We'll likely hear more from Microsoft once Feedback exits preview but in the meantime, you can check out the new portal to share your own ideas and even criticisms with the software giant.",
    "We've also featured the best online collaboration tools, best productivity tools and best project management software"
  ],
  "headers": {
    "4": "My Feedback"
  },
  "links": {
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Feedback for Microsoft 365": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9402718009921040000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-365-blog%2Fintroducing-feedback-for-microsoft-365%2Fba-p%2F2747224&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-wants-to-hear-what-you-really-think-about-its-microsoft-365-apps",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "multiple Teams accounts": "https://www.techradar.com/news/microsoft-teams-may-finally-be-about-to-get-this-super-useful-feature",
    "reply to specific messages": "https://www.techradar.com/news/microsoft-teams-update-will-fix-one-of-its-most-frustrating-shortcomings",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "best productivity tools": "https://www.techradar.com/best/best-productivity-apps",
    "best project management software": "https://www.techradar.com/best/best-project-management-software"
  }
}