{
  "source": "https://www.techradar.com/news/atandt-will-use-ericsson-radio-kit-to-spread-c-band-5g",
  "title": "AT&T will use Ericsson radio kit to spread C-band 5G",
  "category": "phones",
  "updated": "2021-10-12T15:34:19Z",
  "author": "steve-mccaskill",
  "summary": "AT&T hopes to cover 75m Americans with C-band 5G",
  "article": [
    "Ericsson and AT&T have signed a five-year deal that will facilitate the US carrier’s 5G network expansion and rollout of C-band spectrum.",
    "The two companies have worked together for more than two decades and this latest agreement will help AT&T achieve its ambition of covering 70-75 million people with 5G using C-band airwaves acquired by the operator earlier this year.",
    "5G networks use more diverse array of spectrum than previous generations of mobile technology, with various frequencies serving different user groups.",
    "Low-band spectrum such as 700MHz offers wide coverage but lower capacity while millimetre Wave (mmWave) frequencies that offer massive capacity over a short range. Mid-band C-band spectrum, located between 3.4GHz and 3.8GHz, offers a happy compromise between these two desirable outcomes.",
    "AT&T will use Ericsson technologies, including advanced antennas and 5G carrier aggregation and advanced RAN coordination, to improve the coverage, capacity and latency of mid-band and high-band deployments.",
    "The technologies will also pave the way for future innovations, including Cloud RAN, that enhances the agility and capability of 5G networks.",
    "“As we continue to expand our nationwide 5G network, Ericsson’s technology offerings and 5G expertise will assist with our network evolution,” declared Scott Mair, President, AT&T Network Engineering and Operations.",
    "“This latest agreement provides the pathway for us to deploy Ericsson’s next-generation centralized RAN architecture, enabled by Fronthaul Gateway, with the ability to support future network enhancements, like the evolution to Cloud RAN.”",
    "“This agreement reinforces our long-standing partnership of innovation and execution with AT&T,” added Niklas Heuveldop, President and Head of Ericsson North America. “5G networks will enable unprecedented, sustainable and exponential growth, accelerating the digital transformation of industries and the public sector, for the benefit of consumers, enterprises and society at large. Ericsson is excited to join forces with AT&T to help make this vision a reality.”",
    "Ericsson’s latest estimate is that there will be 580 million 5G subscriptions by the end of 2021."
  ],
  "headers": {
    "3": "Ericsson 5G AT&T"
  },
  "links": {}
}