{
  "source": "https://www.techradar.com/news/samsungs-new-the-frame-tv-is-closer-to-a-real-picture-frame-than-ever-heres-why",
  "title": "Samsung’s new The Frame TV is closer than ever to a real work of art – here’s why",
  "category": "televisions",
  "updated": "2021-01-06T16:00:15Z",
  "author": "henry-st-leger",
  "summary": "Samsung’s fashion-forward QLED TV has been updated",
  "article": [
    "Samsung's The Frame TV is one of the most unique offerings in the TV maker’s annual product ranges, and its 2021 iteration is no different.",
    "This year’s version of the fashion-forward set – which apes the form of a picture frame and packs in a dedicated Art Mode to display artworks and photography when not in use – is one of the first sets Samsung has unveiled during CES 2021. And it’s come with some notable changes from previous iterations of the set.",
    "The 2021 Frame TV refines its aesthetic philosophy, with a thinner-than-ever body that's just 24.9mm thick – that compares to 45.8mm for the 2020 model, meaning it's almost halved in depth.",
    "Perhaps most notably, the 43-inch model will be compatible with a portrait view, meaning you can mount it however you like to fit in with other photos or paintings on your wall. It won’t be able to rotate on demand, though – you’ll need the Samsung Sero for that – and we wouldn’t recommend this for regular TV watching. But it may be a good fit for those mainly wanting to use Samsung’s new TikTok smart TV app.",
    "There are also new bezel options for a greater variety of decors and styles, rather than the simple reds, whites, browns, and blacks of previous models. We’re told users will be able to opt for bezels of varying styles and sizes, “from slim, neutral, and minimalist to big, ornate, and bold [...] With near-endless options for customization”.",
    "When it comes to the Art Store, subscribers to the 1,400 paywalled artworks (beyond the 20 or so thrown in for free) will get the benefit of an “AI-based auto-curation technology” to help match you with images you’ll like. We wouldn’t back any algorithm as much as a discerning critic, of course, but we expect it’ll be useful for picking your decor nonetheless.",
    "Samsung tells us that The Frame has been a growing success for the company, with sales increasing by 170% (almost tripling, then) between its 2017 and 2020 iterations. We gave last year’s model a strong four stars for its impressive and stylish design, even if we knocked it a star for its edge-lit panel and average processing.",
    "The Frame is a boon for occasional TV watchers who are mainly concerned with how the TV looks the rest of the day – you’ll have to look at it on your wall or counter, after all. With a proven record of steady improvements, and more customization options than ever, this year’s The Frame may be the most worthwhile yet – and we’ll be sure to let you know once we’ve put it through our tests."
  ],
  "headers": {
    "6": "Framing the future"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "2020 model": "https://www.techradar.com/reviews/samsung-the-frame-tv-2020",
    "43-inch": "https://www.techradar.com/news/best-40-inch-tv",
    "Samsung Sero": "https://www.techradar.com/reviews/samsung-sero-tv-review",
    "Samsung’s new TikTok smart TV app": "https://www.techradar.com/news/new-samsung-tvs-are-getting-a-tiktok-app-heres-why-that-matters"
  }
}