{
  "source": "https://www.techradar.com/news/mygames-hires-activision-blizzards-philippe-sauze",
  "title": "MY.GAMES hires Activision Blizzard’s Philippe Sauze",
  "category": "news",
  "updated": "2021-10-27T15:47:08Z",
  "author": "sponsored",
  "summary": "Meet MY.GAMES, the company that just hired top executive VP Philippe Sauze",
  "article": [
    "You may not have heard of MY.GAMES until recently, but there’s a good chance you’ve played one of their titles. And with industry veteran Philippe Sauze taking the helm of MY.GAMES’ European Operations after more than 20 years of combined experience working with the likes of Electronic Arts and Activision Blizzard, there’s an even better chance you’ll encounter MY.GAMES titles going forward.",
    "The fast-growing publisher, developer, and investor has been recently making waves in gaming. What started 15 years ago as a PC game publishing division within Russian IT-giant VK became a force to be reckoned with within the industry - MY.GAMES is among the top 50 gaming companies worldwide. And with now-former Activision Blizzard executive Philippe Sauze on board, the company is willing to reach even further with its ambitious goal of becoming a top 25 gaming business.",
    "MY.GAMES is consistently diversifying its portfolio and delivering new hits, with the recently released Rush Royale becoming one of the top mobile tower defense games on the market. The company has also announced a Closed Beta Test for their reworked tactical online FPS, World War 3.",
    "“I am delighted to join the MY.GAMES team of professionals as the head of the European office,” says Sauze. “The company is growing rapidly, outperforming average market growth and conquering new markets, and we have ambitious plans ahead for the development of our European publishing hub here in Amsterdam that will focus on bringing MY.GAMES titles to the global market.”",
    "Over the course of Sauze’s long career in the industry, he’s held executive spots at several major organizations. This includes 15 years at Electronic Arts, two years as president of French industry syndicate SELL, and five and a half years at Activision Blizzard.",
    "“I’m impressed with the talented people at the company today,” he adds. “The fact that MY.GAMES is a people-centered operation with mechanisms in place for collaboration and knowledge sharing means that it’s a great fit for me and my professional experience.”",
    "A people-centered approach is what separates MY.GAMES from many other big publishers — the company is known for its ability to grow its teams and scale established businesses. After MY.GAMES’ acquisition of Pixonic in 2016, the newly acquired studio grew fivefold. BeIngame, Deus Craft, and other studios have also experienced growth after joining the MY.GAMES family.",
    "“The office in Amsterdam already covers the spectrum of game production,” Sauze continues, “including publishing, localization, and operating games in the region. It will be a great honor to build, innovate and expand upon this foundation. Our immediate plan is to strengthen the team with strong professionals from the industry.”"
  ],
  "headers": {},
  "links": {
    "MY.GAMES": "https://my.games/en"
  }
}