{
  "source": "https://www.techradar.com/news/how-to-watch-the-livestream-of-nasas-mars-drone-take-off",
  "title": "How to watch the NASA Ingenuity drone's post-flight news livestream",
  "category": "cameras",
  "updated": "2021-04-19T16:54:44Z",
  "author": "mark-wilson",
  "summary": "Hear from the team behind the successful NASA drone flight",
  "article": [
    "The NASA Ingenuity drone successfully took off on Mars today, making history as the first ever powered flight on another planet – and the team behind is hosting a live-streamed news conference very soon.",
    "If you didn't manage to catch the live take-off earlier today, you can catch up with what happened in the embedded video further down this page. The short video of the take-off, shot by the Perseverance Rover, starts at 41:35 in the recorded YouTube stream.",
    "The Ingenuity drone had been due to attempt its lift-off on April 11, but was delayed while NASA sorted out a software fix for a technical problem.",
    "This was successfully sorted out over the last week, so the autonomous aircraft got the green light to make its maiden flight at around 7am ET / 12pm GMT / 9pm AEST today.",
    "Impressively, it did just that, as you can see from its airborne photo below, taken from around 3m in the air as Ingenuity hovered for around a minute.",
    "Understandably, the Mission Control team were a little preoccupied with celebrations and handling the data that the autonomous helicopter was relaying back to earth to give detailed press briefings on what exactly had happened.",
    "But fortunately, NASA is about to livestream such a news briefing very soon – here's how to catch it.",
    "Fancy getting more stories, stats and potentially images from the team behind the successful NASA Ingenuity drone take-off? NASA is hosting a live news briefing on this very soon on YouTube and Facebook.",
    "You can watch it either below or at NASA's YouTube channel from 3pm ET / 7pm GMT, which works out as 5am on April 20 for those in Australia.",
    "It's not clear how long the briefing will last, but NASA is promising to let us know \"all about Ingenuity’s historic first flight\".",
    "If you'd rather catch the livestream on Facebook, NASA will also be streaming it there on its official channel.",
    "Unlike the take-off stream earlier, it doesn't look like you'll be able to watch the news briefing on either Twitter or Twitch.",
    "NASA says that the Ingenuity drone helicopter is solely a demonstration of tech, rather than something that will support the findings of the Perseverance mission that it's part of – but it's a mighty impressive demonstration all the same.",
    "The solar-powered aircraft is actually powered by a Qualcomm Snapdragon 801 chip, the same as the one you'd find in Android phones from five or six years ago like the Samsung Galaxy S5.",
    "But that's still more than powerful enough to power its flight in the thin Martian air and support its on-board computers, navigation sensors and two cameras.",
    "These two cameras are a black-and-white, 0.5MP navigation camera (which took the first photo further up this page) and a 13MP front-facing one. It's not yet clear what other images Ingenuity might send back, but we did also get a video shot by the Perseverance Rover – which itself has some pretty impressive cameras, as we saw from its incredible video of the Mars landing."
  ],
  "headers": {
    "7": "How to watch the NASA Mars drone news briefing",
    "12": "What tech is powering the NASA Mars drone?"
  },
  "links": {
    "NASA's YouTube channel": "https://www.youtube.com/watch?v=JM_2hmdRnfQ",
    "official channel": "https://www.facebook.com/NASAJPL",
    "Samsung Galaxy S5": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s5-1226990/review",
    "incredible video of the Mars landing": "https://www.techradar.com/news/heres-how-nasa-perseverance-shot-its-incredible-video-of-the-mars-landing"
  }
}