{
  "source": "https://www.techradar.com/news/two-iphone-13-models-rumored-to-be-getting-ltpo-120hz-display-upgrades",
  "title": "Two iPhone 13 models rumored to be getting LTPO, 120Hz display upgrades",
  "category": "phones",
  "updated": "2021-04-17T16:00:21Z",
  "author": "david-nield",
  "summary": "Top screen tech on the way",
  "article": [
    "The iPhone 13 launch date – expected to be in September – is getting closer and closer, and the most recent rumor around the Apple handset is that both of the Pro models are going to come with LTPO, 120Hz display technology on board.",
    "That's as per well-known industry analyst Ross Young, who tweeted that the screen upgrade wouldn't just be limited to the most expensive Pro Max model. In a follow-up tweet, Young confirmed that the two Pro handsets are expected to have the tech.",
    "Rumors about a screen and refresh rate upgrade for the iPhone have been swirling for a while now, all the way back to before the iPhone 12 appeared. It would seem that Apple finally has everything in place to make it happen this time around.",
    "Apple already deploys LTPO OLED technology in the Apple Watch and in the iPad Pro tablets, so it's really no surprise that it's making its way to the iPhone as well – though it looks as though the standard iPhone 13 and the iPhone 13 mini will miss out.",
    "LTPO (low-temperature polycrystalline oxide) display tech essentially improves power efficiency while also allowing for a variable refresh rate – all the way up to 120Hz in this case, if the rumors are correct.",
    "It's thought that Apple has been reluctant to add LTPO to the iPhone series because of concerns about battery life, so we're assuming that the engineers at the company have figured out a way to make it work without the demands on the battery being too great.",
    "Neither the LTPO technology or the 120Hz refresh rate are new rumors as far as the iPhone 13 goes – we've been hearing supply chain rumblings since all the way back in November that the next Apple handsets would come with these screen upgrades.",
    "Samsung has been tipped as the manufacturer supplying the high refresh rate panels for the iPhone 13 this year. Other recent rumors we've heard around the handset include talk of a minor processor and performance upgrade.",
    "Via MacRumors"
  ],
  "headers": {
    "4": "How LTPO works"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "in September": "https://www.techradar.com/news/iphone-13-release-date-looks-to-be-on-schedule-for-september",
    "tweeted": "https://twitter.com/DSCCRoss/status/1383098367102709765",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "in November": "https://www.techradar.com/news/iphone-13-looks-likely-to-get-the-variable-refresh-rate-featured-on-the-ipad-pros",
    "been tipped": "https://www.techradar.com/news/iphone-13-could-use-samsungs-advanced-high-refresh-rate-displays",
    "performance upgrade": "https://www.techradar.com/news/new-iphone-13-chipset-rumor-could-disappoint-some",
    "MacRumors": "https://www.macrumors.com/2021/04/16/ltpo-120hz-display-iphone-13-pro-models/"
  }
}