{
  "source": "https://www.techradar.com/news/sennheiser-cx-true-wireless-vs-sennheiser-cx-400bt-whats-new-with-the-wireless-earbuds",
  "title": "Sennheiser CX True Wireless vs Sennheiser CX 400BT: what’s new with the wireless earbuds?",
  "category": "audio-visual",
  "updated": "2021-07-19T15:19:41.537Z",
  "author": "olivia-tambini",
  "summary": "Should you buy the latest wireless earbuds from Sennheiser?",
  "article": [
    "Sennheiser is one of the most well-regarded audio brands in the world, and we’re big fans of its true wireless earbuds, with every new model bringing improvements in design and sound quality.",
    "Its latest release, the Sennheiser CX True Wireless, are no exception, bringing a host of upgrades over their predecessors, the CX 400BT, including better connectivity and a longer battery life.",
    "In spite of these upgrades, the CX True Wireless are actually cheaper than the CX 400BT were when they launched in 2020. So, should you buy the latest Sennheiser wireless earbuds? And, are there any times when you would be better off opting for the older model?",
    "We’ve tested both models extensively, and we’re here to help you make the right decision if you’re trying to choose between the CX True Wireless and CX 400BT earbuds.",
    "The Sennheiser CX True Wireless are available to buy now for $129.95 / £119.99 / AU$199.95, which makes them significantly cheaper than the CX 400BT, which launched in September 2020 at $199 / £169 / AU$299. However, while the cheaper CX True Wireless may seem the obvious choice, bear in mind that the CX 400BT are likely to be discounted now that they’ve been usurped by a newer model.",
    "We’ve seen prices drop as low as $99 / £87 / AU$146, so the older CX 400BT may be the best option if you’re looking for a budget-friendly pair of true wireless buds.",
    "The designs of the Sennheiser CX True Wireless and the CX 400BT are very similar, with both featuring large, square housings and coming with bulky charging cases.",
    "The most obvious difference between the two is that Sennheiser has done away with the silver logo on the outer housings of the CX 400BT, swapping it for the all-black design seen on the CX True Wireless.",
    "You get a range of eartips with both models, so you should be able to find a good fit. Be warned, though – if your ears are on the smaller side, you may find those large, protruding housings to be quite uncomfortable.",
    "One feature of the CX True Wireless that will appeal to fitness fans is the inclusion of an IPX4 water resistance rating, which means you can use them during workouts without needing to worry about a little sweat or rain damaging your earbuds. The CX 400BT don’t offer the same protection.",
    "Both models sport touch-sensitive housings, allowing you to control your music playback, accept, reject, and end calls, and summon your device’s voice assistant; these controls are customizable via the Sennheiser Smart Control app.",
    "The charging cases for the CX True Wireless and CX 400Bt are very similar, too, sporting flip-top cases and USB-C connectivity. Neither model supports wireless charging.",
    "Both the Sennheiser CX True Wireless and CX 400BT excel when it comes to audio performance. While both models offer an expansive soundstage, good detail and a dynamic listening experience, there are some subtle differences between the two.",
    "For example, the CX True Wireless provide a slightly bassier sound profile, handling low frequencies with dexterity and control, whereas the CX 400BT offer a more naturalistic sound. That’s not to say that the CX 400BT can’t handle a good bass line – they offer plenty of attack when it comes to lower-frequency sounds.",
    "While audiophiles may prefer the natural sound of the CX 400BT, we did find that the older earbuds could sound a little harsh when playing high frequencies. We prefer the sound of the CX True Wireless, but there’s very little difference between the two models.",
    "Both models support hi-res audio, and you can adjust their EQ settings in the Sennheiser Smart Control app, either by manually altering the frequency sliders or by choosing from a selection of presets.",
    "The Sennheiser CX True Wireless offer a slightly longer battery life than their predecessors, with nine hours from the earbuds themselves and a further 18 hours provided by the charging case. Meanwhile, the CX 400BT come with seven hours of onboard battery life, and 13 hours from the charging case.",
    "Connectivity has also been upgraded with the CX True Wireless, which come with Bluetooth 5.2 and support for SBC, AAC, and aptX codecs – the CX 400BT also support these codecs, but use the slightly older Bluetooth 5.1. In any case, we didn’t experience any issues with either model when it came to pairing.",
    "The CX True Wireless come with a few extra tricks, too, including the ability to use each earbud independently, and a new Sidetone feature that makes it easier to hear your own voice during phone calls.",
    "You can’t really go wrong with either of these wireless earbuds, and whichever model you opt for you can be sure that you’re getting some of the best-sounding true wireless earbuds on the market.",
    "However, if you want the latest connectivity technology, longer battery life, and the ability to use each earbud independently, you should opt for the newer Sennheiser CX True Wireless.",
    "You shouldn’t write off the CX 400BT, though. Since the CX True Wireless were launched, the older Sennheiser buds have been widely discounted, with prices dropping well below their original price. If you’re on a strict budget, the CX 400BT are well worth considering, especially as both models offer nearly identical designs, similar sound profiles, and support for hi-res audio."
  ],
  "headers": {
    "4": "Sennheiser CX True Wireless vs Sennheiser CX 400BT: price and availability",
    "6": "Design",
    "12": "Audio performance",
    "16": "Battery life and connectivity",
    "19": "Takeaway"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Sennheiser CX True Wireless": "https://www.techradar.com/reviews/sennheiser-cx-true-wireless-review",
    "CX 400BT": "https://www.techradar.com/reviews/sennheiser-cx-400bt-true-wireless",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}