{
  "source": "https://www.techradar.com/news/windows-11s-new-emoji-including-clippy-wont-be-coming-to-windows-10",
  "title": "Windows 11’s new emoji – including Clippy – won’t be coming to Windows 10",
  "category": "computing",
  "updated": "2021-11-26T14:46:36Z",
  "author": "darren-allan",
  "summary": "No fancy emoji for those still on the older desktop OS",
  "article": [
    "Windows 11 has just got some nifty looking new emoji, as you may recall, which are Fluent-style and modern-looking affairs – but these won’t be coming to Windows 10.",
    "They landed earlier this week as part of a preview update for Windows 11, so are officially still only in testing even on that OS, although Microsoft will send them fully live for Windows 11 in December (on Patch Tuesday, which will be December 14).",
    "The emoji – which include the paperclip being replaced by Clippy, the iconic assistant who pestered, er, we mean helped us in Word back in the day – will not arrive in Windows 10, or at least that appears to be Microsoft’s plan as reported by Windows Latest.",
    "The tech site claims that Microsoft has no intention of drafting the modern emoji over to Windows 10, and that they will remain exclusive to Windows 11, at least for the time being anyway. Windows Latest does further observe that Microsoft might change its mind in the future, though.",
    "Of course, many Windows 10 users will say that they won’t especially be losing much sleep over the lack of refreshed emoji, and that’s a fair point. They aren’t a huge deal, and not a reason anyone would be upgrading to Windows 11, that’s for sure.",
    "That said, they are nice to have, and it wouldn’t be much of an effort to pipe them over to Windows 10. Maybe Microsoft feels that they’d stick out a bit as odd, as the old operating system hasn’t had the benefit of the Fluent Design-style makeover that Windows 11 arrived with.",
    "Whatever the reasoning right now, we could see them ported over eventually, as the report observes. In the meantime, Windows 10 users will just have to stick with their tired old vanilla emoji."
  ],
  "headers": {
    "4": "Analysis: Emoji aren’t high on most folks’ Windows 10 wish-lists"
  },
  "links": {
    "nifty looking new emoji": "https://www.techradar.com/news/windows-11-users-voted-for-the-return-of-clippy-and-now-its-back-sort-of",
    "paperclip being replaced by Clippy": "https://www.techradar.com/news/microsoft-365-clippy-is-making-a-triumphant-return",
    "Windows Latest": "https://www.windowslatest.com/2021/11/26/microsoft-has-no-plans-to-bring-windows-11-emojis-to-windows-10/",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}