{
  "source": "https://www.techradar.com/news/hbo-maxs-friends-reunion-finally-has-a-filming-date-says-star-and-its-soon",
  "title": "HBO Max's Friends reunion finally has a filming date, says star – and it's soon",
  "category": "entertainment",
  "updated": "2021-03-04T17:09:36Z",
  "author": "tom-power",
  "summary": "When will it happen?",
  "article": [
    "The Friends reunion announcement sparked huge excitement among the show's massive fanbase when it was first announced in February 2020. The Covid-19 pandemic, however, scuppered plans to shoot the special in time for HBO Max's launch in May 2020.",
    "Since then, fans have been eagerly awaiting news on when production on the reunion will start up again. Now, David Schwimmer - who played Ross Gellar - has revealed that the Friends special will begin filming in Los Angeles in April. Speaking on Sirius XM's Radio Andy show (you can listen to the clip on Radio Andy's YouTube channel) Schwimmer confirmed that everyone was preparing to shoot the reunion in a matter of weeks.",
    "\"It's happening,\" he said when asked for an update on production. \"Actually, in a little over a month I'm heading out to L.A. Finally, we figured out a way to film it safely, and there's gonna be a portion of it that we filmed outside because of safety protocols.\"",
    "A Friends reunion has been spoken about for years, but it wasn't until last February that fans were finally given the gift that they've longed for. The main cast, including Jennifer Aniston, took to social media to announce the news and, at the time, it was hoped that the special would launch alongside HBO Max later in the spring.",
    "With the arrival of the Covid-19 pandemic, though, production was halted indefinitely. Following that postponement, co-creator Marta Kauffman revealed that the entire cast had wanted the reunion to happen and, in the wake of the pandemic, that everyone was prepared to wait until it was safe to film in front of a live audience - just like the original series had.",
    "\"We all want it to happen,\" she told Entertainment Tonight. \"We just have to wait until it is safe. This is a show that is not scripted, but this is the way the show works - we are going to need a live audience. Even if we socially distance that live audience, it really is a huge part of what Friends is... We can not do it without them. Everyone is all in and we are just waiting for that time when it feels connected to bring in a live audience.\"",
    "It's unclear if April's taping will happen in front of a live audience or when the special will be released. Previously, Lisa Kudrow - who portrayed Phoebe Buffay - had told the Literally! With Rob Lowe podcast (via E! Online) that filming would begin in the spring, and that she had already shot some footage for the reunion before the pandemic hit."
  ],
  "headers": {
    "3": "The Friends reunion timeline"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Radio Andy's YouTube channel": "https://www.youtube.com/watch?v=VgAHrJYSh80&feature=youtu.be",
    "Entertainment Tonight": "https://www.etonline.com/marta-kauffman-talks-women-in-film-special-and-how-they-convinced-friends-cast-to-reunite-exclusive",
    "E! Online": "https://www.eonline.com/uk/news/1227498/lisa-kudrows-update-on-the-friends-reunion-is-the-most-promising-yet"
  }
}