{
  "source": "https://www.techradar.com/news/comparis-warns-customers-of-attacks-following-data-breach",
  "title": "Comparis warns customers of attacks following data breach",
  "category": "computing",
  "updated": "2021-07-19T11:14:39Z",
  "author": "sead-fadilpasic",
  "summary": "Scammers are targeting Comparis customers following breach",
  "article": [
    "Swiss price comparison company Comparis has warned customers to up their security after it recently fell victim to a ransomware attack and data breach.",
    "Despite the company's best efforts to curb the July 7 attack by bringing its systems offline, criminals still managed to make away with customer data, including hashed passwords, stored both on Comparis’ and its sister companies’ servers.",
    "Multiple Comparis customers have now reported users are reporting receiving various phone calls from people claiming to be part of the mitigation effort. Some users have been contacted by people claiming to be call center employees that offer advice on how to deal with the aftermath of a data breach, while others talked to alleged insurance brokers in possession of information on their health insurance company and similar data.",
    "\"Should your data be affected, we cannot rule out the possibility of it being used by third parties for commercial or fraudulent purposes,\" the company in an official statement.",
    "\"We urge you to be extremely vigilant in general, but especially if you are contacted by an unknown party claiming to work for a bank or insurance company and who is in possession of particular information about you. Please report any such incidents to us so that we may pass the information on to the investigating authorities.\"",
    "Comparis is one of the biggest price comparison sites in Switzerland, with more than 80 million visits a year, Bleeping Computer explained. The Swiss can use it to compare health insurance prices, or telecommunications services prices, among other things.",
    "Comparis did not say which ransomware group was behind the attack, but it did say that the demand was $400,000 and that it wasn’t paid.",
    "Via: Bleeping Computer"
  ],
  "headers": {
    "3": "Reporting fraud attempts to law enforcement"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "passwords,": "https://www.techradar.com/best/password-manager",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/security/comparis-customers-targeted-by-scammers-after-ransomware-attack/"
  }
}