{
  "source": "https://www.techradar.com/news/oracle-is-making-its-cloud-databases-easier-to-use",
  "title": "Oracle is making its cloud databases easier to use",
  "category": "computing",
  "updated": "2021-03-18T16:22:09Z",
  "author": "mayank-sharma",
  "summary": "Database giant wants to democratize the use of data warehousing tools",
  "article": [
    "Oracle says the latest release of its cloud-based Autonomous Data Warehouse will help transform complex data transformation activities into point-and-click tasks.",
    "The Oracle Autonomous Data Warehouse is a software-as-a-service cloud data warehouse that Oracle says is designed to reduce the complexities of developing data driven applications by automating critical provisioning and configuration tasks.",
    "With this updated release, the company hopes to make the data warehouse service easier to operate for both professionals and non-IT users.",
    "As per reports, the most interesting feature of the new release is AutoML, which will automate several time intensive tasks and instead help users create machine learning (ML) models using a no-code interface.",
    "Business users will be drag-and-drop data sets that AutoML will then run through different ML algorithms in order to produce meaningful information that can be easily interpreted and digested by business users.",
    "To please its advanced users, the service is now also compatible with the Python programming language, which is one of the most popular open source languages for writing machine learning models. Data scientists can now leverage all of the service’s ML algorithms into their custom code.",
    "Speaking to VentureBeat, Oracle’s VP of product management, George Lumpkin said that Oracle’s objective is to make the service simple to use for both professionals and citizen data analysts. “We’re trying to provide what a cloud data warehouse should be,” he adds.",
    "Many businesses are increasing their IT spending to acquire the tools and skilled operators to help them process their large hordes of data into meaningful information. With the new release Oracle hopes to lower the skill level required to crunch the data by offloading the complex processing tasks to its cloud-based ML algorithms.",
    "Via: VentureBeat"
  ],
  "headers": {
    "3": "Lower barriers to entry"
  },
  "links": {
    "cloud-based": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud data": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "Python programming language": "https://www.techradar.com/best/python-online-courses",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "VentureBeat": "https://venturebeat.com/2021/03/17/oracle-updates-cloud-data-warehouse-to-boost-access-for-data-analysts/"
  }
}