{
  "source": "https://www.techradar.com/news/updated-godaddy-website-builder-dashboard-shows-how-your-business-is-performing",
  "title": "Updated GoDaddy website builder dashboard shows exactly how your business is performing",
  "category": "computing",
  "updated": "2021-09-09T11:24:22Z",
  "author": "abigail-opiah",
  "summary": "All the web analytics your SMB will need on one dashboard",
  "article": [
    "Small business owners will get extra help from GoDaddy after the domain registrar and web hosting company introduced new updates to its Websites + Marketing offering.",
    "The upgrade includes a new metrics dashboard enhancements for SMB owners to better understand the health of their business, as well as improve their social presence.",
    "The metrics dashboard includes improved analytics on visitors, sales, orders, and bookings over time in addition to social views. The social metrics have been put in place to help SMBs optimize content to grow their business.",
    "Other capabilities that GoDaddy’s new dashboard update includes are:",
    "- At-a-glance look at social views, with the ability to compare views, engagement, and overall performance of all their social platforms like Facebook, Instagram, Yelp, and Google My Business",
    "- Analytics on website traffic, sales, orders, and bookings over time for trend spotting",
    "- Tailored recommendations on how to improve conversion, boost visibility, optimize content, and more",
    "In a blog post announcing the news, GoDaddy said: “This new wholistic view of business performance helps small business owners look at their company from several angles to quickly identify their strengths, as well as areas that could use beefing up.",
    "“The added visibility into social media performance is especially critical in a world where 54% of Gen Z and 49% of Millennials say social media is their preferred channel for discovering new products or services.”",
    "As well as the dashboard update, GoDaddy released new email design templates that help with the creation, sending and personalization of marketing emails.",
    "Speaking about the email template update, GoDaddy added: “A well-designed email is also an excellent way to extend brand awareness far and wide.",
    "“With the ability to select everything from logo, color scheme, fonts, button sizes and shapes and the power to lock in preferences, customers will always recognize a brand’s emails in their inbox.”"
  ],
  "headers": {
    "3": "SMB online presence"
  },
  "links": {
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "blog post": "https://aboutus.godaddy.net/newsroom/company-news/news-details/2021/GoDaddys-Updated-Website-Builder-Metrics-Dashboard-Puts-Business-Owners-in-the-Growth-Mindset-/default.aspx"
  }
}