{
  "source": "https://www.techradar.com/news/first-trailer-for-netflixs-red-notice-crams-in-massive-star-power-and-big-action",
  "title": "First trailer for Netflix's Red Notice crams in massive star power and big action",
  "category": "entertainment",
  "updated": "2021-09-03T03:25:53Z",
  "author": "stephen-lambrechts",
  "summary": "Could this become the most successful Netflix movie ever?",
  "article": [
    "If you've ever wanted to see Wonder Woman take on Black Adam and Deadpool in a single movie, Netflix's new heist film Red Notice might be as close as you'll ever get.",
    "The film stars Dwayne 'The Rock' Johnson as John Hartley, an FBI agent who's hot on the trail of two of the world's most wanted art thieves, Nolan Booth (Ryan Reynolds) and Sarah Black (Gal Gadot).",
    "When Black outplays both Hartley and Booth by setting them up to take the fall over the theft of a priceless Fabergé egg, the pair must reluctantly team up in order to take her down.",
    "The blockbuster film, which reportedly has a $200 million budget, has now received a funny, action-packed first teaser trailer, which you can check out below.",
    "Based on the trailer above, it appears that Red Notice has all the makings of a fun, star-driven caper movie with plenty of humor and action – two things which writer/director Rawson Marshall Thurber (Central Intelligence, Skyscraper) has displayed a knack for in the past.",
    "And, given the incredible star wattage of the film's three leads (each one's films having grossed billions of dollars at the box office), it's very likely that Red Notice will end up being one of the most successful films in Netflix's history.",
    "Netflix has already had a massively successful year when it comes to original blockbusters, having scored an enormous number of viewers with Zack Snyder's Army of the Dead (75 million viewers as of July 2021), and last year offered such megahits as Extraction (99 million viewers), Spenser Confidential (83 million viewers) and The Old Guard (78 million viewers), as revealed by What's on Netflix.",
    "Ryan Reynolds' previous Netflix Original outing, 6 Underground, also brought viewers to the streaming service in droves, with 83 million viewers checking out the film despite its many negative reviews.",
    "Combine Reynolds' drawing power with that of Johnson's and Gadot's, and we have every reason to believe Red Notice could end up being the most-watched Netflix movie of all-time. Of course, we'll have to wait until after its November 12 release date to find out just how successful it ends up being."
  ],
  "headers": {
    "4": "Analysis: Red Notice looks like a winner for Netflix"
  },
  "links": {
    "What's on Netflix": "https://www.whats-on-netflix.com/news/every-viewing-statistic-netflix-has-released-so-far-july-2021/"
  }
}