{
  "source": "https://www.techradar.com/news/nominet-ceo-finally-ousted-after-months-of-wrangling",
  "title": "Nominet CEO finally ousted after months of wrangling",
  "category": "computing",
  "updated": "2021-03-26T14:16:32Z",
  "author": "mayank-sharma",
  "summary": "Nominet’s CEO and chairman have left the board with immediate effect",
  "article": [
    "In an extraordinary turn of events, half of Nominet’s board has been voted out with immediate effect; the culmination of a long-drawn public campaign calling for the board’s overhaul.",
    "Board members of the Internet infrastructure firm Nominet, which regulates UK domain names, had been under fire for several months now for their decisions to take the company away from its not-for-profit mission.",
    "“I find it sad that we’ve got to this point,” said board chairman Mark Wood at the start of the extraordinary general meeting (EGM) as reported by The Register. “In the past, we clearly haven’t listened well enough to our members. We know that many things we need to do better,” said Wood, who was one of the members voted out, along with Nominet CEO Russell Haworth.",
    "The PublicBenefit.uk campaign, led by Simon Blackler, the CEO of web hosting company Krystal, took objection to several decisions taken by Nominet’s board between 2016 and 2020 that were contrary to its Articles of Association.",
    "Their shenanigans came to naught as both men along with three other members were removed with a 52.7% majority vote in the EGM that had 53 Nominet members present and voting.",
    "While it isn’t exactly clear what happens next, as things stand, non-executive director Rob Binns has been asked to serve as acting chair.",
    "Via: The Register"
  ],
  "headers": {
    "3": "Back to formula"
  },
  "links": {
    "Nominet": "https://www.techradar.com/news/nominet-suspends-thousands-of-dodgy-uk-domains",
    "domain names": "https://www.techradar.com/news/best-domain-registrars",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "The Register": "https://www.theregister.com/2021/03/22/nominet_board_sacked/"
  }
}