{
  "source": "https://www.techradar.com/news/microsoft-issues-warning-against-dangerous-new-phishing-campaign",
  "title": "Microsoft issues warning against dangerous new phishing campaign",
  "category": "computing",
  "updated": "2021-09-23T11:55:53Z",
  "author": "mayank-sharma",
  "summary": "Sharing details could help improve protection for everyone, reasons Microsoft",
  "article": [
    "The Microsoft 365 Defender Threat Intelligence Team has revealed details about a large-scale phishing operation it discovered while investigating recent campaigns against businesses.",
    "Named BulletProofLink, the Phishing-as-a-service (PhaaS) operation sells phishing kits, email templates, hosting, and automated services at a relatively low cost.",
    "“In researching phishing attacks, we came across a campaign that used a rather high volume of newly created and unique subdomains—over 300,000 in a single run. This investigation led us down a rabbit hole as we unearthed one of the operations that enabled the campaign,” share the researchers.",
    "Known as BulletProofLink, BulletProftLink, and Anthrax, the service is currently advertised on underground cybercrime forums, and builds on the demand for phishing kits to a whole new level.",
    "In addition to offering hundreds of phishing templates that mimic popular brands and services, BulletProofLink also offers additional conveniences as well such as hosting and email-sending services.",
    "The PhaaS can be employed in either one-off or monthly subscription-based business models to ensure that it suits the budgets of all kinds of threat actors, around the world.",
    "Interestingly, Microsoft researchers also observed that BulletProofLink keeps copies of the credentials phished by its customers, which it then presumably hawks in other underground marketplaces."
  ],
  "headers": {
    "3": "No honor among thieves"
  },
  "links": {
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "share": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7252183251026439000&xs=1&url=https%3A%2F%2Fwww.microsoft.com%2Fsecurity%2Fblog%2F2021%2F09%2F21%2Fcatching-the-big-fish-analyzing-a-large-scale-phishing-as-a-service-operation%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-issues-warning-against-dangerous-new-phishing-campaign",
    "hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "email-sending": "https://www.techradar.com/news/best-email-hosting-providers"
  }
}