{
  "source": "https://www.techradar.com/news/4-things-weve-learned-about-the-galaxy-z-fold-3-and-the-galaxy-z-flip-3-this-week",
  "title": "4 things we've learned about the Galaxy Z Fold 3 and the Galaxy Z Flip 3 this week",
  "category": "phones",
  "updated": "2021-05-14T18:30:37Z",
  "author": "david-nield",
  "summary": "More Samsung foldables are coming",
  "article": [
    "Foldable phones have been with us for several years at this point, but the 2021 generation of bending devices are promising a substantial step forward for the form factor: better durability, more powerful features, and – dare we say it – a lower price too.",
    "Rumors around the Samsung Galaxy Z Fold 3 and the Samsung Galaxy Z Flip 3 are rolling in at a regular pace now, which isn't surprising considering the phones are expected to launch within the next two or three months. To help you keep up with everything that we've found out this week, we've put together a little recap for you.",
    "These latest leaks add to everything we already know about these foldable phones, which are being tipped to get their grand unveiling at the same time, alongside the Samsung Galaxy S21 FE. As the launch date gets closer, we'll continue to report on everything that we hear about these devices.",
    "As tempting as foldable phones are, because of their advanced screen tech and powerful performance, they remain at the very top-end of the price scale. The original Galaxy Z Fold 2 starting price was $1,999 / £1,799 / AU$2,999, while the 5G version of the Galaxy Z Flip first went on sale for $1,449 / £1,399 / AU$2,599 (though there have since been price drops). Those are substantial prices.",
    "Who's going to complain about a discount? Absolutely no one, and it looks as though the Galaxy Z Flip 3 will go on sale at a more affordable price point (no word yet on whether the Galaxy Z Fold 3 will join it). According to one tipster, the Z Flip 3 will be available from $999 at its cheapest configuration, which is a third off the original price of its predecessor and around a quarter off that phone’s current cost.",
    "It's not clear exactly what could be enabling this price reduction, apart from the usual trend for electronics components and manufacturing processes to gradually get cheaper over time. It's possible that Samsung is going to try and make some savings in other areas – in the cameras or the processing power, perhaps – but as long as the device still shuts with a satisfying snap then we're going to be happy.",
    "Under-display selfie cameras are already here, but they're only in a handful of devices and they don't work very well. While these in-screen lenses enable the display notch to be removed completely, the display layers above them need to be engineered in such a way that they're able to take a decent photo.",
    "We think Samsung might be able to get the technology right in time for the Galaxy Z Fold 3 – or at least that's the rumor. If the foldable phone does come with an under-display camera, removing the need for the notch on the main screen, then it would be the first Samsung device to do so.",
    "We'd rate this leak as very plausible indeed: it's no secret that Samsung has been working on this kind of technology, along with the rest of the smartphone industry, and it's just a question of when it will have been developed to a high enough standard that Samsung considers putting it in an actual product.",
    "All the signs are pointing to the Galaxy Note 21 being canceled completely this year, but it's still not 100% confirmed. Among the evidence for the absence of a Note phone – for this year at least – is a patent we've seen that says stylus support is going to be coming to the Samsung Galaxy Z Flip 3.",
    "S Pen support is of course one of the key selling points of the Galaxy Note phones, and if it's going to be added to the Z Flip 3 then that makes the Note 21 a lot less necessary. There have also been whispers that stylus support will be added to the Z Fold 3, and it's already built into the Galaxy S21 Ultra.",
    "If you think about everything else that the Galaxy Note phones bring with them, including large screens and high-end performance, it's very possible that the Samsung foldables could take their place in the market. It would certainly make Samsung's production processes and launch schedules a bit simpler.",
    "So when are we going to see these wonderful folding phones? The latest rumor points to a launch date sometime in August, which actually lines up with previous leaks that we've spotted. It's possible that August 19 is going to be the big day, but we've only seen that specific date mentioned by one source so far.",
    "And if the speculation is right, this is going to be a bumper launch event: not only are the Galaxy Z Fold 3 and the Galaxy Z Flip 3 rumored to be appearing, but we're also hearing that the Samsung Galaxy S21 FE will make its debut at the same time (that's the more affordable take on the standard Galaxy S21).",
    "The last Galaxy Z Fold launched in August 2020 and the last Galaxy Z Flip launched in July 2020, so an August 2021 window for unveiling the new devices would make sense. Samsung has been keen to get its gadgets out this year, with the S21 series appearing a month earlier than the Galaxy S handsets usually do."
  ],
  "headers": {
    "3": "1. These foldable phones could be more affordable",
    "6": "2. The Z Fold 3 could be the first Samsung phone with an under-display camera",
    "9": "3. It's not looking good for the Galaxy Note 21",
    "12": "4. We'll probably see these phones launched in August"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "price drops": "https://www.techradar.com/news/samsung-galaxy-z-flip-5g-now-the-cheapest-foldable-alongside-motorola-razr",
    "one tipster": "https://www.techradar.com/news/the-samsung-galaxy-z-flip-3-could-cost-less-than-we-thought",
    "already here": "https://www.techradar.com/news/this-android-phones-under-display-selfie-camera-isnt-great-but-its-a-sign-of-the-future",
    "that's the rumor": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-camera-leak-includes-details-of-an-under-display-lens",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "a patent we've seen": "https://www.techradar.com/news/evidence-mounts-the-samsung-galaxy-z-flip-3-is-really-the-note-21s-replacement",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "The latest rumor": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-and-z-fold-3-foldables-tipped-to-launch-in-august",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}