{
  "source": "https://www.techradar.com/news/sony-wont-let-you-rent-or-purchase-movies-or-tv-shows-from-the-playstation-store-soon",
  "title": "Sony's PlayStation Store won't let you rent or purchase movies and TV shows soon",
  "category": "gaming",
  "updated": "2021-03-02T17:13:14.492Z",
  "author": "adam-vjestica",
  "summary": "Movie night is over for PlayStation owners",
  "article": [
    "Sony has announced that users will no longer be able to rent or purchase movies or TV shows from the PlayStation Store when using a PS5, PS4 or PS4 Pro.",
    "In a post of the PlayStation Blog, Sony pointed towards the “tremendous growth from PlayStation fans using subscription-based and ad-based entertainment services on our consoles” as the reason behind its decision.",
    "Sony has said the change will take effect on August 31, 2021 and that users can still access movie and TV content they have purchased through the PlayStation Store for on-demand playback.",
    "The move to stop movie and TV show purchases might not seem too surprising considering the rise of streaming services like Netflix and Disney Plus, but for those who do like to own digital copies of their favorite films, or like to indulge in the odd movie rental, it's obviously a shame this option will no longer be available on PlayStation hardware.",
    "Buying movies and TV shows digitally is also a great alternative when one of the many streaming services doesn't have those shows available, which happens more often than you'd think.",
    "Ultimately, it seems that Sony isn’t making enough money from allowing users to buy or rent movies or TV shows from the PlayStation Store, and if the demand isn’t there, then it’s a smart business decision moving forward.",
    "Microsoft currently lets users purchase and rent movies and TV shows from the Microsoft Store on Xbox and Windows 10, so it will be interesting to see whether the company follows Sony’s decision in the coming months.",
    "If you’re not a fan of watching your films digitally, both the PS5 and Xbox Series X are equipped with 4K HD Blu-Ray players – though it appears the PS5 has a better 4K HD Blu-Ray player than the Xbox Series X."
  ],
  "headers": {
    "6": "Xbox, play a movie"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "a post": "https://blog.playstation.com/2021/03/02/playstation-store-to-discontinue-movie-and-tv-purchases-and-rentals/",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5 has a better 4K HD Blu-Ray player than the Xbox Series X": "https://www.techradar.com/news/ps5-has-a-better-4k-blu-ray-player-than-xbox-series-x"
  }
}