{
  "source": "https://www.techradar.com/news/windows-11-dark-mode-soundscape-is-just-objectively-better",
  "title": "Windows 11 Dark Mode soundscape is just objectively better",
  "category": "computing",
  "updated": "2021-08-24T09:03:49Z",
  "author": "rhys-wood",
  "summary": "Opinion: Softer sounds equal happier users",
  "article": [
    "If you're a frequent internet browser or a social media night owl, there's a good chance you prefer the Dark Modes offered by various websites, and it seems like Windows 11 is taking that to heart.",
    "Reported by MSPoweruser (where you can also check out some previews of the new Windows 11 sounds), Microsoft has detailed that Windows 11's Dark Mode won't only change to a darker color palette, but it'll sound slightly different, too, in an aim to best represent the operating system's new theme of \"calmness.\"",
    "That element of calmness, in a first for Windows operating systems, is now extending to the soundscape, too. All those little beeps and jingles you hear on a daily basis will sound slightly different in Windows 11's Dark Mode, with Microsoft putting a focus on less grating sound effects.",
    "A Microsoft spokesperson broke down the process of softening the soundscape to CNBC, stating: \"The new sounds have a much rounder wavelength, making them softer so that they can still alert/notify you, but without being overwhelming. Just like we rounded UI [user interface] visually, we rounded our soundscape as well to soften the overall feel of the experience.\"",
    "The soundscape featured in Windows 11's Dark Mode shouldn't just be available for that specific screen orientation. They should outright become the default sounds for Windows 11, as they are far more appealing to listen to, lacking any of the abrasiveness of the sound effects of Windows' past.",
    "The new Windows 11 Dark Mode sound effects are significantly less grating than those found in Windows 10, especially. We've all been unpleasantly surprised by an obnoxiously loud, tuning fork-esque Windows 10 alert sound while wearing headphones, and Microsoft appears to have recognized this for Windows 11, opting to take some of the needless edge out of the soundscape.",
    "By comparison, as Microsoft describes, these new Windows 11 sounds are much softer. A lot of care has gone into the creation of the sound effects for the Windows 11 operating system.",
    "Sounds don't linger or sustain for nearly as long, and they've been created digitally, as opposed to with a real instrument. This gives the creators better control over the intended effect of the alert in question, rather than relying on the more limited sounds offered by traditional instruments.",
    "Ultimately, though, these softer alerts aren't just a nice change. They could subtly impact the mood of Windows 11 Dark Mode users for the better. Say you're working on a project late into the night. You're tired, but you're immersed enough to keep going. The last thing you want to hear in that moment is a sudden, echo-like sound that could reduce your level of concentration.",
    "These new sounds still do the job of alerting you, but it's more of a gentle prod than a forceful nudge. We're really digging the new Windows 11 Dark Mode sound effects, but really, anything sounds better than the ones we were stuck with on Windows 10."
  ],
  "headers": {
    "4": "Windows 11's Dark Mode sounds should be the default"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "MSPoweruser": "https://mspoweruser.com/windows-11-dark-mode-will-sounds-different-to-light-mode/",
    "Windows 11's Dark Mode": "https://www.techradar.com/news/many-windows-11-pcs-will-ship-in-dark-mode-by-default",
    "CNBC": "https://www.cnbc.com/2021/08/22/microsoft-delivers-calm-system-sounds-in-windows-11.html"
  }
}