{
  "source": "https://www.techradar.com/news/inmotion-hosting-vs-dreamhost-pick-the-best-web-hosting-for-your-business",
  "title": "InMotion Hosting vs DreamHost: Pick the best web hosting for your business",
  "category": "computing",
  "updated": "2021-07-19T10:56:04Z",
  "author": "anna-sevilla",
  "summary": "Need to jumpstart your website? We've narrowed down your options to help you choose",
  "article": [
    "These days, a website is just as important as setting up a physical shop, especially if you want your business to extend its reach to other countries. If you don’t want to make the same mistake most business owners make, ensuring that your business’s extension, i.e., your website, has high quality needs to be prioritized.",
    "For one, your website needs to be available and accessible at all times, otherwise potential customers will show themselves out and shop elsewhere. To make this happen, you need a reliable web hosting provider for your site. In this article, we’ll provide a head to head comparison of two of the most notable web hosting providers today: InMotion Hosting and DreamHost, to help you go with the perfect choice for your website.",
    "Both InMotion Hosting and DreamHost are based in Los Angeles, California and have been around for quite some time. Both also have a track record in excellent customer support and server uptime, and offer unlimited bandwidth and data storage. Both also hold the top spots in the most affordable web hosting plans in the market.",
    "Whereas DreamHost’s shared hosting plans offer unlimited storage, InMotion Hosting only gives out 10GB. Support-wise, InMotion’s phone support is the key difference, as DreamHost does not offer this. Inmotion also uses cPanel, a widely-used intuitive interface, while DreamHost has a user-friendly built-in control panel that’s also beginner-friendly.",
    "DreamHost’s entry level aptly named Shared Starter plan goes for as low as $2.59 per month paid annually. This plan hosts a website with a free domain, unlimited traffic, pre-installed WordPress, free migration, access to the WordPress builder, and a lot more. Their next plan, Shared Unlimited, has all of the previously mentioned features plus more, offered for only $3.95 per month billed annually.",
    "InMotion has four plans, Lite, Launch, Power and Pro. The lowest tier goes for $2.49 per month and their next plan, which is a little higher than DreamHost’s, is $4.99 per month. A little bit steeper, but this does include hosting for two websites, 50GB of SSD storage, 10 email addresses, unlimited bandwidth, and more. Oddly, their third highest tier, Power, goes for the same amount but offers just a bit more features including 50 instead of two websites, 100GB instead of 50GB storage, etc. Inmotion’s highest tier package is $12.99 per month.",
    "While users get a WordPress website builder across all of DreamHost and InMotion’s plans, there are notable differences in most features these platforms are offering.",
    "DreamHost takes security seriously with features that include a tool called Malware Remover, free and open SSL/TLS certificates that encrypt data, free domain privacy, http/2 support, and mod_security, an industry-standard web application firewall.",
    "InMotion, on the other hand, doesn’t fall behind in the level of security they offer. Users can download the Sucuri Security plugin for free and scan for malware and other security risks. Inmotion also offers IP Deny Manager, password-protected directories, and Hotlink protection to combat the common hacking attacks today.",
    "As an added security feature, users will find automatic backups to be extremely helpful, and while DreamHost offers this for free, InMotion has an extra fee for this.",
    "DreamHost offers various types of hosting plans, and all of these plans run on the operating system called Ubuntu. For users who aren’t expecting heavy traffic on their site, the basic shared hosting plan can easily provide users with their website needs. For larger traffic expectations, the VPS, dedicated or DreamPress (WordPress) plans are the options available. Dreamhost also offers cloud hosting where users are able to design their server without limits so that they can meet their needs.",
    "InMotion, on the other hand, has reseller hosting and bare metal hosting on top of VPS, dedicated, cloud and WordPress hosting. InMotion’s shared hosting is known to be cost-effective, reliable and fast, especially for small businesses and large resellers alike. The reseller hosting plan includes free domain reseller, free white label branding and messaging, and a free billing software. Inmotion going an extra mile makes it a better choice for small businesses.",
    "At best, DreamHost competes well performance-wise, and users do get a bang for the buck with their cheap plans. DreamHost’s average page speed of 445ms is a remarkable speed for any site’s SEO performance. There is also a 100% uptime guarantee offer where users are compensated their current hosting cost for one day of service for each hour of interruption, or 10% of their next pre-paid hosting renewal fee.",
    "Serving over 170,000 customers, InMotion has also made a name as a fast and reliable web hosting provider. InMotion offers an uptime reliability of 99.9%, which is just as good as DreamHost’s guarantee. Their server response time is also just as competitive as DreamHost, which has a record of 63ms.",
    "Both DreamHost and InMotion offer more flexibility and reliability in their services and plans, and there’s not much of a difference in their performance, although there are reports of DreamHost being just a little bit slower in terms of website loading speed. InMotion Hosting does, on the other hand, pass tests with flying colors every time.",
    "Dreamhost and InMotion plans all include a free SSL certificate. The difference lies in the backups and domain privacy (as mentioned above). Where DreamHost is generous with free domain privacy, which ensures the protection of the users’ personal information, and daily backups, these features come with extra fees with InMotion.",
    "DreamHost’s additional free security features include Modsecurity that blocks malicious HTTP requests and SQL attacks and http/2 support. InMotion uses an anti-DDoS system called Corero to block attacks, and their servers use Smartwall Threat Defense System, an in-house system that makes sure users feel protected.",
    "Beginners in website building need to have help available anytime. Both InMotion and DreamHost are excellent in customer support, with a knowledge base that provides video tutorials, forums, and articles about hosting problems users might encounter. This is especially useful during times when phone or live chat reps are unavailable to address pressing matters.",
    "InMotion’s customer support channels include live agents via chat, a ticketing system, and phone support. Users can get a hold of a rep 24 hours a day, 7 days a week to help solve hosting issues. Although available, there might be a 2-minute wait to get a hold of someone, but even if it takes longer, the high quality support received is well worth the wait.",
    "DreamHost also has a ticketing system and live chat support, but lacks phone support. For users who prefer to have someone walk them through solving an issue via a phone call, this can prove challenging. Additionally, DreamHost’s live chat channel isn’t available 24/7 like InMotion’s is, and the wait time usually takes up to five minutes.",
    "It is a close fight between these two web hosting providers. Although DreamHost outperforms InMotion uptime and speed-wise, InMotion offers a little more extra with their free site migration, free backups and domain privacy, and better customer support feedback. DreamHost’s comprehensive plan prices seem to make up for this, and for the fact that the basic tier only includes basic features.",
    "Though slightly more expensive than DreamHost, InMotion’s better services, additional features and outperforming DreamHost overall makes it a smart choice. For inexperienced users who prefer help every step of the way and are willing to pay a little extra for a few more options, InMotion is a great choice. On the other hand, users who know what they want and what they’re looking for on a website, DreamHost is not at all a bad choice."
  ],
  "headers": {
    "2": "InMotion Hosting vs DreamHost: main similarities and differences",
    "4": "Pricing",
    "6": "Features",
    "10": "Hosting types",
    "12": "Performance",
    "15": "Security",
    "17": "Support",
    "20": "Verdict"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "InMotion Hosting": "https://www.techradar.com/reviews/inmotion-hosting",
    "DreamHost": "https://www.techradar.com/reviews/dreamhost",
    "domain": "https://www.techradar.com/news/best-domain-registrars",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider"
  }
}