{
  "source": "https://www.techradar.com/news/google-pixel-phones-get-a-big-change-to-social-media-in-new-quarterly-feature-drop",
  "title": "Google Pixel phones get a big change to social media in new quarterly feature drop",
  "category": "phones",
  "updated": "2021-03-02T10:03:41Z",
  "author": "tom-bedford",
  "summary": "As well as other little extras",
  "article": [
    "Google Pixel phones get extra tools added every few months, in what the company calls the Pixel Feature Drop, and the newest one of these is rolling out now. So if you have a recent phone from the company - that's a Pixel 3, Pixel 3 XL, Pixel 3a, Pixel 3a XL, Pixel 4, Pixel 4 XL, Pixel 4a, Pixel 4a 5G or Pixel 5 - your smartphone is about to get better.",
    "After a leak suggesting as such, Google has confirmed these new features. The brand doesn't say when the Feature Drop will start rolling out to smartphones, but some users are reporting getting it already - it likely depends on which phone you have and where you live too, though, so it could take a few days to reach your device.",
    "The biggest new feature coming to Pixel phones, and the one we mentioned in the headline, is the roll-out of Smart Compose to new messaging apps. Smart Compose uses AI to predict what you're writing, offering you suggestions to make typing easier, and currently it's only available on select Google apps.",
    "While Google doesn't say which new messaging apps it'll now work on, it seems likely that popular social media tools like Facebook, Twitter and WhatsApp could be included.",
    "Apparently this feature will only be available in the US, and for English-language predictions, but we hope both of those will change over time. This isn't the only new Pixel feature though, and the others can be enjoyed by people in other countries.",
    "A new feature that'll be useful to some people is a change to the Recorder app, which records and transcribes audio. Now, you'll be able to easily send recordings to people who don't have a Pixel phone for them to listen to, via recorder.google.com, and with this site you'll also be able to search and back-up your own recordings.",
    "The new Pixel Feature Drop also brings a few new backgrounds, particularly for International Women's Day (on March 8), with some custom illustrations for the occasion.",
    "Very few people will make the most of this next feature (we imagine), but Pixel phones will now work alongside a smartphone dive case from Kraken Sports, so you can use all kinds of camera features when underwater - perfect for s-eel-fies with your aquatic friends (or maybe Por-trout shots?)",
    "Finally, Google has redesigned the bedtime features of the Pixel phone when it's used in conjunction with a Pixel Stand. This sounds like purely a design change.",
    "There's another feature Google mentions is coming to Pixel phones, that technically isn't part of the Feature Drop, and that's the roll-out of a feature we already heard about. We previously heard Google Fit will be able to find your heart rate using your smartphone camera, and from \"next week\" (as of March 1) this will come to eligible Pixel phones.",
    "So those are the new Google Pixel features, some of which are really useful, and some of which may find a more niche user base. Expect to see the update roll out to your smartphone very soon."
  ],
  "headers": {
    "5": "More new Pixel features"
  },
  "links": {
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Pixel 3 XL": "https://www.techradar.com/reviews/google-pixel-3-xl-review",
    "Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Pixel 3a XL": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
    "Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "Pixel 4 XL": "https://www.techradar.com/reviews/google-pixel-4-xl-review",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Google has confirmed these new features": "https://blog.google/products/pixel/march-2021-feature-drop/",
    "recorder.google.com": "http://recorder.google.com/",
    "smartphone dive case": "https://krakensports.ca/product/universal-smart-phone-housing-2/",
    "Google Fit will be able to find your heart rate using your smartphone camera": "https://www.techradar.com/news/your-google-pixel-could-track-your-heart-rate-with-just-its-rear-camera"
  }
}