{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
  "title": "Samsung Galaxy S21 FE release date rumors, news, price and leaks",
  "category": "phones",
  "updated": "2021-12-05T23:51:13Z",
  "author": "james-rogerson",
  "summary": "The Samsung Galaxy S21 FE will be a fan-friendly phone",
  "article": [
    "While the Samsung Galaxy S21 range was unveiled in early 2021, there's more to come: it seems certain that Samsung will follow the initial trio up with a Samsung Galaxy S21 FE (or Galaxy S21 Fan Edition as it might be called) in the coming months.",
    "What makes us so certain is that Samsung itself has accidentally mentioned the phone by name – although on the other hand there have also been hints that the phone is in danger of being canceled.",
    "It didn't show up at the Samsung Unpacked October 2021 event, and we're still waiting for it to break cover. Most of the smart money now seems to be on it making an appearance at some point during January 2022.",
    "The Galaxy S21 FE would be a cheaper, lower end alternative to the S21, much as the Samsung Galaxy S20 Fan Edition is to the Samsung Galaxy S20. However, the reduction in cost and specs are both likely to be minimal, with the S21 Fan Edition still likely to be fairly high-end – and priced accordingly.",
    "The news and rumors around this phone continue to roll in rapidly – we've covered all the best ones below, and come up with a list of things we want from the Samsung Galaxy S21 Fan Edition, along with our best educated guesses at the release date and price.",
    "For a long time we thought the Samsung Galaxy S21 FE was sure to land, even though there has only been one Fan Edition model so far. As SamMobile reported, the company said it would launch a new one every year.",
    "There have been doubts though: a report that the phone may have been canceled due to the global chipset shortage, a Samsung official saying that the phone was under review, and Samsung removing support pages for the Galaxy S21 FE from its websites. Those documents have since reappeared.",
    "The S20 FE launched in August, so it's clear that the S21 FE is way overdue at this point, but we're hopeful that it's still coming. Predictions of a launch in October haven't been accurate, but we've seen predicted launch dates come and go before.",
    "A recent leak asserts that the Galaxy S21 FE is indeed January, potentially even taking the release window of the Samsung Galaxy S22 (a second source has now backed that up, saying that it could land at CES 2022, which takes place from January 5-8), while another source points to January 11. So sometime in January looks likely.",
    "The price is something that we don’t have much idea of either, but it may have a launch price in line with the Samsung Galaxy S20 Fan Edition, which cost $699 / £699 / AU$1,149 for a 5G model, or £599 / AU$999 for a 4G one (with this version not being available in the US) - and with more S20 FE deals appearing still at the moment.",
    "If anything though the Samsung Galaxy S21 FE might be cheaper than its predecessor, as the Samsung Galaxy S21 has a lower launch price than the Galaxy S20 did.",
    "A listing for the Samsung Galaxy S21 FE on a Chinese certification database has revealed that the phone likely has a 6.4-inch 1080 x 2340 Super AMOLED screen with a 120Hz refresh rate and an in-screen fingerprint scanner - specs that are very similar to the S20 FE. The phone apparently also has an IP68 rating, meaning it's dust and water resistant.",
    "One other rumor has mentioned a 1080 x 2009 resolution though, which is strange. At the moment, the 1080 x 2340 option seems more likely, as it more closely matches the S21.",
    "As for the design, numerous leaks have now shown us the possible appearance of the Samsung Galaxy S21 FE, starting off with one from reputable tipster @OnLeaks, and we've embedded one of their tweets below.",
    "The upcoming phone will apparently be slightly taller and slightly wider than the main Galaxy S21, with a 6.4-inch display rather than a 6.2-inch one. The rear camera bump, meanwhile, will supposedly be connected to the rear casing rather than the metal frame.",
    "Since this leak, LetsGoDigital has shared unofficial renders based on leaked information, and they look very similar to those above, as you can see in the images below.",
    "Note however that the colors chosen here aren't all rumored for the phone (more on which further down), they were simply chosen because they're \"high-profile.\"",
    "There have been further leaks too: check out these renders (one of which we've embedded below) from seasoned tipster Evan Blass, which are based on details of the supposed dimensions and design of the Galaxy S21 FE.",
    "Since then, Blass has returned with updated renders, showing the Samsung Galaxy S21 FE in green, white, blue, violet and grey, which you can see below.",
    "The shades are slightly different to those in his previous leak, and probably more accurate, but the design is much the same.",
    "A different leaker points to black, white, pink and green versions of the phone, with no blue like we've seen elsewhere.",
    "Blass has one-upped himself yet again, this time with 360-degree GIFs showing the phone from all sides, some of which you can see below.",
    "While we can't guarantee that the final phone will look exactly like this, these pictures seem likely to be close to the mark – and it seems as though we're going to get a lot of colors to pick from as well.",
    "Speaking of which, we've elsewhere heard that it could come in light green, white, gray, purple, and pink shades. A subsequent leak has provided some of those same colors, listing gray, white, violet and green - that's a similar, though not identical, list.",
    "We've also now seen what appears to be photos of the back cover and inside of the phone, and you can see the same design as above, complete with black, white, purple and green shades. For even more of an idea of what the phone is going to look like, check these leaked case images.",
    "That back cover has also been attached to the frame of a Galaxy S10 on video, giving us a clear look at how the S21 FE might look.",
    "One of the more recent leaks we've seen spilled a whole host of information about the Galaxy S21 FE, including some of the key specs and the official case designs we can expect from Samsung. There were also some images that look like official promo materials from Samsung, which you can see below.",
    "A certification listing for the Samsung Galaxy S21 FE mentioned a 12MP main camera, a 12MP ultra-wide one, and an 8MP telephoto one with 3x optical zoom, along with a 32MP selfie camera.",
    "We've also previously heard that it will reportedly have a 32MP front-facing camera, and from the renders above it looks to have a triple-lens rear camera, so that matches what we've heard.",
    "When it comes to battery capacity, one tipster says there'll be a 4,500mAh battery installed in the Samsung Galaxy S21 FE, beating the 4,000mAh capacity battery in the regular Galaxy S21.",
    "It could also charge faster than any other S21 model, with a certification listing pointing to 45W charging - even the Galaxy S21 Ultra only supports 25W, so that would be an impressive spec.",
    "We've also seen both that battery size and charging speed mentioned a second time, with wireless charging also mentioned.",
    "That said, the phone almost certainly won't come with a charger, as a leaked user manual for the Samsung Galaxy S21 FE says that wall chargers are sold separately. This manual does mention both wireless and reverse wireless charging though.",
    "Some sources claim that a phone with the model number SM-G990B is in development, and it's believed that might be the Samsung Galaxy S21 FE. At the very least the model number would seem to place it in the Galaxy S21 range.",
    "On its own that doesn't tell us much, but that model number has also now been spotted in a benchmark, where a Snapdragon 888 chipset, 6GB of RAM and Android 11 are also mentioned.",
    "We've also seen the phone listed on a Chinese certification database, with a Snapdragon 888, 8GB of RAM, 128GB or 256GB of storage, and a microSD card slot mentioned. Those specs have since been backed up by a subsequent leak as well.",
    "A similar model number (SM-G990U) was also spotted on the FCC (Federal Communications Commission) database, with mention of the same chipset.",
    "In another benchmark though we've seen the Exynos 2100 mentioned, alongside 8GB of RAM. So it's possible the Galaxy S21 FE will have a different chipset in different regions, as Samsung does that with some of its phones.",
    "Both of those chipsets are very powerful though, and are currently among the best you can get in a smartphone.",
    "A multi-chipset approach may work, as a report suggests Samsung is going to use both its own Exynos, and Qualcomm's Snapdragon chipsets in order to avoid further release date delays. If true, we'll likely see the Snapdragon version of the phone in the US and Asia, and Exynos versions elsewhere - the latter will probably be slightly weaker than the Qualcomm counterpart.",
    "We were moderately impressed by the Samsung Galaxy S20 Fan Edition, but there are a few key improvements we’d like to see from the S21 FE.",
    "The Samsung Galaxy S20 Fan Edition has a fairly premium price but its ‘Glasstic’ back (plastic that’s designed to feel like glass) is anything but.",
    "This was one of our biggest disappointments with the phone, and we really want to see Samsung up the quality of materials for the Galaxy S21 Fan Edition. Either that or lower the price, or better yet both.",
    "However, since we made this wish Samsung launched the Galaxy S21 with a Glasstic back, and it seems unlikely that the Samsung Galaxy S21 FE will get a more premium rear than that phone.",
    "As noted above, the Galaxy S20 Fan Edition is quite an expensive phone, and that’s despite being the baby of the Galaxy S20 range.",
    "While the specs and features go some way towards justifying the price (plastic back notwithstanding), the Samsung Galaxy S21 FE could certainly stand out more if it were a bit more affordable.",
    "This may way well come to pass, given that the rest of the Galaxy S21 range is cheaper than the Galaxy S20 range.",
    "We were generally quite impressed by the Galaxy S20 Fan Edition’s screen, but one aspect that could use some improvement is its brightness.",
    "In our review we noted that it struggled in direct sunlight, and that the automatic brightness sometimes felt dimmer than it should. So for the Samsung Galaxy S21 Fan Edition we want both a higher maximum brightness and improvements to the auto brightness mode.",
    "While the Galaxy S20 Fan Edition has a 4,500mAh battery, we found that it didn’t actually last very long, and often struggling to even reach a full day before it needed charging again.",
    "That’s just not good enough, especially when you consider that over time the battery will begin to wear out and become even more problematic, so we want big improvements here for the Samsung Galaxy S21 FE.",
    "4,500mAh isn’t actually a bad size, so it’s likely poor optimization that’s at fault, but whether through a bigger battery or improvements elsewhere, we want to be able to comfortably get a day of life from the Samsung Galaxy S21 Fan Edition at an absolute minimum.",
    "Another issue we have with the battery in the Samsung Galaxy S20 Fan Edition is its charging speed.",
    "At 25W (or 15W for wireless charging) it’s not terrible, but when even the substantially cheaper OnePlus Nord can manage 30W charging, and some phones are up to 65W or higher, we really want increased charging power from the Samsung Galaxy S21 FE.",
    "You might also want to check out the Samsung Galaxy S21 vs Samsung Galaxy S20 comparison."
  ],
  "headers": {
    "5": "Samsung Galaxy S21 FE release date and price",
    "11": "Design and display",
    "27": "Camera and battery",
    "33": "Specs and features",
    "40": "What we want to see",
    "41": "1. A glass back",
    "44": "2. A lower price",
    "47": "3. A brighter screen",
    "49": "4. Better battery life",
    "52": "5. Faster charging"
  },
  "links": {
    "mentioned the phone by name": "https://www.techradar.com/news/samsung-galaxy-s21-fe-accidentally-confirmed-by-samsung-itself",
    "Samsung Unpacked October 2021": "https://www.techradar.com/news/live/samsung-galaxy-unpacked-live-blog-todays-colorful-launch-as-it-happens",
    "Samsung Galaxy S20 Fan Edition": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "SamMobile": "https://www.sammobile.com/news/samsung-flagships-get-fan-edition-every-year/",
    "a report": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-be-canceled-according-to-mysterious-report",
    "saying that": "https://www.techradar.com/news/apparently-even-samsung-doesnt-know-if-the-galaxy-s21-fe-is-coming-out",
    "removing support pages": "https://www.techradar.com/news/samsung-galaxy-s21-fe-is-almost-certainly-canceled-as-samsung-removes-support-page",
    "since reappeared": "https://www.techradar.com/news/samsung-drops-a-big-hint-that-the-galaxy-s21-fe-is-still-on-the-way",
    "launch in October": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-may-be-way-way-later-than-we-expected",
    "asserts that": "https://www.techradar.com/news/samsung-galaxy-s22-may-be-delayed-with-galaxy-s21-fe-taking-its-place-in-january",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "second source": "https://www.techradar.com/news/galaxy-s22-and-galaxy-s21-fe-launch-dates-revealed-in-latest-leaks",
    "points to January 11": "https://www.techradar.com/news/heres-what-the-samsung-galaxy-s21-fe-might-look-like",
    "S20 FE deals": "https://www.techradar.com/deals/samsung-galaxy-s20-fe-deals",
    "listing for the Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fe-listing-reveals-the-specs-in-full",
    "One other rumor": "https://www.techradar.com/news/key-samsung-galaxy-s21-fe-specs-may-have-been-revealed-by-google",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/samsung-s21-fan-edition/",
    "unofficial renders": "https://www.techradar.com/news/samsung-galaxy-s21-fe-renders-show-off-the-phone-in-full",
    "these renders": "https://www.techradar.com/news/samsung-galaxy-s21-fe-appears-in-colorful-unofficial-renders",
    "updated renders": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leak-reveals-full-design-in-a-range-of-colors",
    "different leaker": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leak-shows-off-all-the-phones-color-options",
    "360-degree GIFs showing the phone from all sides": "https://www.techradar.com/news/heres-an-early-look-at-all-the-devices-samsung-is-launching-on-august-11",
    "elsewhere heard": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-and-camera-details-leaked",
    "subsequent leak has provided some of those same colors": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-leak-shows-fewer-options-than-for-the-galaxy-s20-fe",
    "photos of the back cover": "https://www.techradar.com/news/samsung-galaxy-s21-fe-shown-off-in-photos",
    "leaked case images": "https://www.techradar.com/news/the-samsung-galaxy-s21-fe-leaks-again-this-time-in-its-official-cases",
    "been attached to the frame of a Galaxy S10": "https://www.techradar.com/news/heres-what-the-samsung-galaxy-s21-fe-might-look-like",
    "recent leaks": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leaks-reveal-marketing-materials-specs-and-cases",
    "certification listing": "https://www.techradar.com/news/samsung-galaxy-s21-fe-listing-reveals-the-specs-in-full",
    "will reportedly": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-and-camera-details-leaked",
    "one tipster says": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-pack-a-bigger-battery-than-the-regular-galaxy-s21",
    "a certification listing": "https://www.techradar.com/news/samsung-galaxy-s21-fe-listing-reveals-faster-charging-than-the-galaxy-s21-ultra",
    "mentioned a second time": "https://www.techradar.com/news/samsung-galaxy-s21-fe-listing-reveals-the-specs-in-full",
    "leaked user manual": "https://www.techradar.com/news/another-big-samsung-phone-could-come-without-a-charger",
    "sources": "https://www.techradar.com/news/samsung-s21-fe-a-cheaper-galaxy-phone-is-reportedly-on-the-way",
    "spotted in a benchmark": "https://www.techradar.com/news/samsung-galaxy-s21-fe-benchmark-suggests-it-will-be-as-powerful-as-we-hoped",
    "listed on a Chinese certification database": "https://www.techradar.com/news/samsung-galaxy-s21-fe-listing-reveals-the-specs-in-full",
    "by a subsequent leak": "https://www.techradar.com/news/key-samsung-galaxy-s21-fe-specs-may-have-been-revealed-by-google",
    "also spotted on the FCC": "https://www.techradar.com/news/samsung-galaxy-s21-fe-listing-reveals-faster-charging-than-the-galaxy-s21-ultra",
    "another benchmark": "https://www.techradar.com/news/the-galaxy-s21-fe-will-come-in-two-variants-according-to-the-latest-leak",
    "a report suggests": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-might-not-be-delayed-by-much-but-at-a-big-cost",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Samsung Galaxy S21 vs Samsung Galaxy S20": "https://www.techradar.com/news/samsung-galaxy-s21-vs-samsung-galaxy-s20"
  }
}