{
  "source": "https://www.techradar.com/news/scammers-turn-to-facebook-marketplace-as-it-hits-a-billion-users",
  "title": "Scammers turn to Facebook Marketplace as it hits a billion users",
  "category": "computing",
  "updated": "2021-09-24T15:54:07Z",
  "author": "abigail-opiah",
  "summary": "Facebook Marketplace users urged to beware scammers",
  "article": [
    "Shortly after Facebook revealed that its ecommerce platform reached the milestone of one billion active users, reports have claimed scammers are using this growth to launch bigger campaigns.",
    "Capitalizing off the social media giant’s success, ProPublica found that one Facebook Marketplace account was hacked and used to post roughly 100 scam listings for mobile phones and cars.",
    "TechRadar Pro reached out to Facebook for a comment regarding the claims and its strategy to safeguard its users from scammers.",
    "Facebook claims to protect its users through a combination of automated systems and human reviews, but ProPublica’s investigation found those measures, put in place to protect buyers and sellers from fake accounts and scam listings, all apparently failed.",
    "Launched in 2016, Facebook Marketplace looked to promote the buying and selling of items with people amongst their local communities.",
    "In April 2021, the platform hit one billion users as the global pandemic boosted the ecommerce market.",
    "In Facebook’s recent Q2 2021 results, founder and CEO, Mark Zucherberg said: \"We had a strong quarter as we continue to help businesses grow and people stay connected.",
    "\"I'm excited to see our major initiatives around creators and community, commerce, and building the next computing platform coming together to start to bring the vision of the metaverse to life.\"",
    "ProPublica’s investigation was a combination of internal corporate documents, interviews and law enforcement records that exposed the alleged hacking activity.",
    "The scams included listings that violate Facebook’s ecommerce policies, including a network of fake and suspicious accounts posting listings for untrustworthy male enhancement supplements.",
    "Facebook has published a guide to help its Marketplace users avoid scammers online, including telling users to be wary of gift card scams and look out for counterfeit items.",
    "Via ProPublica"
  ],
  "headers": {
    "4": "Facebook Marketplace"
  },
  "links": {
    "ecommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Facebook": "https://www.techradar.com/news/facebook-could-soon-be-recommending-other-businesses-in-your-news-feed",
    "the platform hit one billion users": "https://www.techradar.com/news/facebook-marketplace-now-has-over-a-billion-customers",
    "ProPublica": "https://www.propublica.org/article/facebook-grew-marketplace-to-1-billion-users-now-scammers-are-using-it-to-target-people-around-the-world"
  }
}