{
  "source": "https://www.techradar.com/news/the-jbl-charge-5-update-makes-one-of-the-best-bluetooth-speakers-even-better",
  "title": "The JBL Charge 5 update makes one of the best Bluetooth speakers even better",
  "category": "audio-visual",
  "updated": "2021-01-08T11:35:58Z",
  "author": "olivia-tambini",
  "summary": "This is one rugged Bluetooth speaker",
  "article": [
    "JBL has launched the latest model in its popular line of Bluetooth speakers, bringing in enhanced connectivity and a more rugged design with the new JBL Charge 5.",
    "Following in the footsteps of the JBL Charge 4 – which made our round up of the best Bluetooth speakers you can buy in 2021 – the Charge 5 comes with Bluetooth 5.1, a significant improvement from its predecessor's support for Bluetooth 4.2.",
    "JBL has also made the new outdoor speaker fully dust-proof as well as water-resistant, with an IP67 rating making it suitable for taking to the beach as well as your backyard.",
    "Inside the JBL Charge 5 is a racetrack-shaped driver, as well as a separate tweeter and dual passive radiators, which the brand says will deliver \"impressive audio clarity and deep bass\".",
    "Like its predecessor, the Charge 5 comes with JBL's PartBoost feature, which means you can hook it up to other compatible JBL speakers to boost the sound even further.",
    "Battery life comes in at 20 hours, so there's no change there – though that's still an impressive figure, making it longer-lasting than many outdoor speakers on the market. You can also charge your device using the speaker's built-in powerbank, making it ideal for when you're on the move.",
    "Design-wise, the Charge 5 doesn't look dramatically different compared to other speakers in the line, though it does come with silicone bumpers on each side to protect it from falls.",
    "Coming in black, blue, gray, red, teal, and an eye-catching camouflage design, the JBL Charge 5 will be available to buy in March for $179.99 / £159.99. While global pricing is still to be announced, that works out at around AU$230.",
    "If you're on a strict budget, don't forget that the introduction of a new model means that the JBL Charge 4 will likely be discounted – in fact, we've seen prices drop as low as $120 / £99 / AU$180. So, if you want to save some money, you can check out the best JBL Charge 4 deals in your region below:",
    "Check out all of TechRadar's CES 2021 coverage. We're remotely covering the online-only show to bring you all the breaking tech news and launches, plus a smattering of hands-on reviews."
  ],
  "headers": {
    "3": "Rugged design"
  },
  "links": {
    "JBL Charge 4": "https://www.techradar.com/reviews/jbl-charge-4",
    "best Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Check out all of TechRadar's CES 2021 coverage": "https://www.techradar.com/news/ces-2021-highlights"
  }
}