{
  "source": "https://www.techradar.com/news/google-is-creating-new-synergies-between-workspace-apps",
  "title": "Google is creating new synergies between Workspace apps",
  "category": "computing",
  "updated": "2021-06-30T15:32:23Z",
  "author": "joel-khalili",
  "summary": "Google Chat is about to become a little more intelligent",
  "article": [
    "Google has lifted the lid on an upgrade for instant messaging service Chat, which will now work more closely with other Google Workspace applications.",
    "In a blog post, the company announced that Chat will now make intelligent suggestions based on data drawn down from Google Calendar.",
    "For example, if someone has a meeting coming up, Chat will create a temporary messaging channel that can be used to notify co-workers of any delays or share resources ahead of the session. This channel will become available ten minutes before the meeting and remain live for ten minutes after.",
    "The new functionality builds upon an almost identical feature that applies to one-on-one meetings marked in Google Calendar, introduced back in March.",
    "The change will begin to go live for all users over the next two weeks and will be available via the Google Chat web app and Gmail widget.",
    "Since the launch of G Suite in 2006, Google has competed directly with Microsoft in the office software space, going up against the famous Microsoft 365 suite, which includes the likes of Word, PowerPoint, Excel etc.",
    "In recent years, one of the defining features of Microsoft’s offering has been tight integration between apps and services, extending all the way out to the Windows operating system on which most business devices run.",
    "Google gave itself a fresh start last year, rebranding G Suite to Workspace, which also involved an overhaul of the logo and other iconography. The impetus behind the decision was to create a more “deeply integrated user experience”, by improving the interoperability of its various productivity software for a more fluid feel.",
    "At the time, for example, Google unveiled a picture-in-picture mode for Docs and Slides that allowed workers to both see and hear their colleagues while collaborating on a document on presentation.",
    "“Ten years ago, when many of our products were first developed, they were created as individual apps that solved distinct challenges,” wrote Javier Soltero, VP and GM, Google Workspace.",
    "“Over time, our products have become more integrated, so much so that the lines between our apps have started to disappear. Our new Google Workspace brand reflects this more connected, helpful and flexible experience, and our icons will reflect the same.”",
    "The latest Google Chat announcement can be considered an extension of efforts to create a more closely integrated suite of productivity and collaboration tools, and thereby mount a genuine challenge to Microsoft 365."
  ],
  "headers": {
    "5": "Google Workspace"
  },
  "links": {
    "Chat": "https://www.techradar.com/reviews/google-chat",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "blog post": "https://workspaceupdates.googleblog.com/2021/06/google-chat-will-automatically-suggest.html",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "office software": "https://www.techradar.com/news/office-365-vs-g-suite-whats-the-best-office-software",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "PowerPoint": "https://www.techradar.com/reviews/microsoft-powerpoint",
    "Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "rebranding G Suite to Workspace": "https://www.techradar.com/news/g-suite-gets-massive-overhaul-rebranded-as-google-workspace",
    "productivity software": "https://www.techradar.com/best/best-productivity-apps",
    "Docs": "https://www.techradar.com/reviews/google-docs",
    "Slides": "https://www.techradar.com/reviews/google-slides",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}