{
  "source": "https://www.techradar.com/news/microsoft-admits-you-can-still-upgrade-to-windows-10-for-free-heres-how",
  "title": "Microsoft admits you can still upgrade to Windows 10 for free - here’s how",
  "category": "computing",
  "updated": "2021-03-17T12:52:23Z",
  "author": "rhys-wood",
  "summary": "You might be able to upgrade at no extra cost",
  "article": [
    "If you’ve been thinking of upgrading to Windows 10, but didn’t want to pay for it, it turns out there’s another way. Several ways, actually, according to a Microsoft employee who confirmed that methods still exist to upgrade to Windows 10 for free.",
    "The Microsoft employee detailed how to go about getting the Windows 10 upgrade for free in a support thread, addressing a user’s question if they could make the leap from Windows 8.1 to Windows 10 at no cost.",
    "The instructions provided by the employee are refreshingly simple, and there’s not that many hoops to jump through in order to get yourself the Windows 10 upgrade, should you want it. However, the employee was adamant that this free upgrade path might not be guaranteed to work, urging users to exercise caution.",
    "First off, you’ll need to be using a genuine copy of Windows 7 or later. If, for some reason, you’re still using an operating system earlier than that, the upgrade unfortunately won’t work for you.",
    "Once you’ve got that confirmed, head over to the Windows 10 software download page. When you’re there, download and open the Windows 10 Media Creation Tool and select the option to “Upgrade this PC now.”",
    "Accept the terms and conditions presented, and make sure to choose the upgrade option that lets you keep your files and information. The Microsoft employee in the support thread warned that upgrading via a fresh install isn’t guaranteed to work, so be sure to stick to the former option to keep your files and avoid any potential risks.",
    "After the installation has been completed, ensure your PC’s connected to the internet and open your Settings app. Scroll down to “Update & Security” and click on the “Activation” tab. Here, you can confirm whether or not the Windows 10 upgrade has worked. If not, there may be an “Activate” button you’ll need to click that will establish a connection to Microsoft’s servers to create a digital Windows 10 product key for you.",
    "Finally, the employee in the support thread stated that if you’re unable to obtain the license, you can enter your existing Windows operating system product key to manually complete the upgrade to Windows 10."
  ],
  "headers": {
    "3": "How do I upgrade to Windows 10 for free?"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "a support thread": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9890278631036230000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fanswers%2Fquestions%2F308572%2Fupdate-windows-81-to-windows-10-for-free.html",
    "Windows 10 software download page": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1027216979869652000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fsoftware-download%2Fwindows10"
  }
}