{
  "source": "https://www.techradar.com/news/amazon-is-being-fined-nearly-dollar1bn-fine-over-data-storage-breach",
  "title": "Amazon is being fined nearly $1bn fine over data storage breach",
  "category": "computing",
  "updated": "2021-07-31T08:00:12Z",
  "author": "anthony-spadafora",
  "summary": "US ecommerce giant plans to appeal the decision though",
  "article": [
    "Amazon is facing the largest fine levied by the European Union to date after being hit with a €746m ($888m) penalty for violating the EU's General Data Protection Regulation (GDPR).",
    "As reported by Bloomberg, the ecommerce giant was fined by Luxembourg's National Commission for Data Protection (CNPD) earlier this month over how it allegedly processed personal data in a way that violated GDPR.",
    "While reporting its second quarter earnings in a 10-Q filing recently submitted to the SEC, Amazon said that the CNPD's decision is “without merit”. The company also provided further details on the situation in a statement, saying:",
    "“There has been no data breach, and no customer data has been exposed to any third party. These facts are undisputed. We strongly disagree with the CNPD’s ruling, and we intend to appeal. The decision relating to how we show customers relevant advertising relies on subjective and untested interpretations of European privacy law, and the proposed fine is entirely out of proportion with even that interpretation.”",
    "The reason why Amazon is being fined by Luxembourg's CNPD is due to the fact that its EU headquarters is located within the small European country",
    "Although the company has publicly commented on the decision, the CNPD has not as local laws prevent it from commenting on individual cases or even confirming receipt of a complaint.",
    "The US-based company has faced increased scrutiny over the past few years due to the amount of data it collects on its customers. Amazon has defended its data collection practices though as they allow it to offer an improved and more personalized customer experience. However, both lawmakers and regulators have voiced concerns that the company has leveraged this data to gain an unfair advantage in the marketplace.",
    "Amazon isn't the only tech giant to receive a hefty fine for violating GDPR as Google was fined €50 million ($57m) by France's data regulator CNIL back in January of 2019.",
    "We'll have to wait and see how Amazon's appeal proceeds to find out whether or not the company will end up paying the CNPD's $888m fine.",
    "Via Bloomberg"
  ],
  "headers": {
    "4": "Record fine"
  },
  "links": {
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know",
    "reported": "https://www.bloomberg.com/news/articles/2021-07-30/amazon-given-record-888-million-eu-fine-for-data-privacy-breach",
    "10-Q filing": "https://ir.aboutamazon.com/sec-filings/default.aspx",
    "SEC": "https://www.techradar.com/news/sec-steps-in-to-prevent-investors-from-buying-the-wrong-zoom",
    "CNPD": "https://www.techradar.com/news/amazon-could-face-the-biggest-gdpr-fine-yet",
    "customer experience": "https://www.techradar.com/best/cx-tools",
    "Google was fined €50 million": "https://www.techradar.com/news/google-fined-pound44m-by-french-data-regulator",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-07-30/amazon-given-record-888-million-eu-fine-for-data-privacy-breach"
  }
}