{
  "source": "https://www.techradar.com/news/amazons-latest-ipad-deals-feature-the-lowest-prices-yet-in-the-us-and-uk",
  "title": "Amazon's latest iPad deals feature the lowest prices yet in the US and UK",
  "category": "tablets",
  "updated": "2021-03-18T13:14:14Z",
  "author": "alex-whitelock",
  "summary": "There are iPad deals for everyone today",
  "article": [
    "iPad deals hunters in the US and UK will be pleased to see the latest batch of Apple sales from Amazon this week, which include the lowest prices yet on a whole range of premium iOS tablets.",
    "In the US, we've just spotted the standard new iPad 10.2 return back down to its record-breaking $299 (was $329) sales price this week. While $30 doesn't seem like the biggest deal in the world, this tablet is exceptionally popular right now and we've seen heavy fluctuations over the past few weeks. Subsequently, if you want to bag one we'd be quick - especially since immediate stock has already sold out.",
    "For those with a little bit more cash to flash (to put it mildly), you can now get the cellular 2020 iPad Pro 12.9 for its lowest price yet on both its 512GB capacity (now $1,329), and its 1TB capacity (now $1,499). With a gorgeous Liquid Retina display, powerful processor, and array of cutting-edge features, there's no better premium tablet on the market right now - especially if you want to make use of that cellular connectivity while traveling.",
    "In the UK, shoppers can treat themselves to the lowest prices yet on both the new iPad Air 4 (going for £529.97) and the new iPad Pro 11 for (now £705.09). Both these are pretty stellar iPad deals on a pair of premium tablets that have so far proven quite elusive in regards to truly significant discounts. The catch? These sales prices are only available on the Silver colours right now. Still, if that doesn't phase you then this is a good opportunity to bag an Apple tablet for less.",
    "Outside the US or UK? See the best iPad deals in your region just below.",
    "For more Apple goodness, we recommend checking out our main Apple iPad deals and Apple MacBook deals articles, which feature today's best prices across the entire range of devices and territories."
  ],
  "headers": {
    "5": "iPad deals in the UK"
  },
  "links": {
    "$299 (was $329)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-iPad-10-2-inch-Wi-Fi-32GB%2Fdp%2FB08J65DST5%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3626264517950219000-20",
    "(now $1,329)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08632RQWD%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9603366821420136000-20",
    "now $1,499": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08639348Q%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1354148610431428400-20",
    "going for £529.97": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FApple-iPad-Air-10-9-inch-Wi-Fi-64GB%2Fdp%2FB08J6HDRD5%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1080170762281194100-21",
    "now £705.09": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB08633FF3L%2Fref%3Duk_a_ipad_1%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1676889081918176300-21",
    "Apple iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "Apple MacBook deals": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699"
  }
}