{
  "source": "https://www.techradar.com/news/spotifys-car-thing-replaces-your-air-vents-with-a-smart-music-streaming-device",
  "title": "Spotify's Car Thing replaces your air vents with a smart music streaming device",
  "category": "audio-visual",
  "updated": "2021-04-13T23:58:22Z",
  "author": "nick-pino",
  "summary": "A limited-time experiment to make your morning commute a bit better",
  "article": [
    "Spotify has announced that its Car Thing experiment will become an official product that will ship to selected Spotify Premium customers.",
    "Car Thing, an unfortunately chosen name for a streaming media player, works by syncing up with your car’s stereo system, either via Bluetooth or with an included 3.5mm aux cable. The idea is that Car Thing will work with all older cars that don’t use CarPlay or Android Auto, and still rely on older head units for their audio.",
    "When it’s synced, Car Thing displays your favorite music, podcasts, playlists and trending content on Spotify, which can then be selected using touch controls, the dial, four quick select buttons or the built-in voice assistant that can be summoned by saying “Hey Spotify”.",
    "The player is expected to cost $79.99 (around £60, AU$100) when it’s available to the public, but Spotify will make it available for just $6.99 (the shipping cost in the US) for Spotify Premium subscribers who sign up on Spotify’s website to get one during the limited window. Unfortunately, though, it's available only in the US for now for a limited time and Spotify has yet to announce global availability.",
    "Spotify made the announcement about Car Thing on its blog, emphasizing that the device was made in response to the issue that its everyday users face – namely, getting Spotify to play on older cars for their morning commute. To that end, Spotify says, don’t expect it to turn into a hardware company overnight:",
    "“Our focus remains on becoming the world’s number one audio platform – not on creating hardware – but we developed Car Thing because we saw a need from our users, many of whom were missing out on a seamless and personalized in-car listening experience.",
    "“No matter the year or model of your vehicle, we feel everyone should have a superior listening experience,” Spotify said in the blog post.",
    "Admittedly, smartphones can do a lot of what the Car Thing can do – like play music on Spotify using a voice assistant over Bluetooth or a 3.5mm cable – but Spotify's player is certainly a unique solution that gets a lot of style points."
  ],
  "headers": {
    "4": "Spotify’s first piece of hardware is... certainly something"
  },
  "links": {
    "Car Thing experiment": "https://www.techradar.com/news/the-spotify-car-thing-dashboard-device-shows-up-at-us-regulators",
    "CarPlay": "https://www.techradar.com/reviews/car-tech/apple-carplay-1246127/review",
    "Android Auto": "https://www.techradar.com/reviews/android-auto-review",
    "Spotify’s website": "https://carthing.spotify.com/",
    "blog": "https://newsroom.spotify.com/2021-04-13/spotify-launches-our-newest-exploration-a-limited-release-of-car-thing-a-smart-player-for-your-car/"
  }
}