{
  "source": "https://www.techradar.com/news/windows-11-and-the-new-microsoft-store-could-fix-one-of-edges-biggest-problems",
  "title": "Windows 11 and the new Microsoft Store could fix one of Edge's biggest problems",
  "category": "computing",
  "updated": "2021-07-02T10:41:17Z",
  "author": "daryl-baxter",
  "summary": "A Windows 11 shopping mall",
  "article": [
    "The store in Windows 11 is gaining yet another feature to appeal for users, in the form of web extensions for Microsoft Edge.",
    "While the previous iteration of the Store was something to avoid between Windows 8 and Windows 10, the newly redesigned Store in Windows 11 is something of a redemption moment, with restrictions for apps being lowered and Android apps from the Amazon Store arriving soon as well.",
    "With extensions being available directly through Google’s Chrome browser and the Mac App Store for Apple’s Safari browser, it could be another aspect of Microsoft’s efforts in luring users to use the store in Windows 11 primarily as a one-stop shop for everything.",
    "While the Store was given a few mentions at the Windows 11 event, it’s definitely a big focus for Microsoft, after seemingly neglecting it since Windows 8.",
    "By typing in ‘Microsoft Edge’ in the search bar in the Microsoft Store of Windows 11, the results will show a plethora of extensions that will be able to be installed into the web browser. It looks as though the main extension store, found within Microsoft Edge, isn’t going away anytime soon, but this is still a great way for a user to look for an extension.",
    "The new Microsoft Store will only be available on the upcoming Windows 11, due towards the end of 2021.",
    "If there was one aspect to appeal to Windows 11 users, it would be this new redesign of the Microsoft Store. It brings in Android apps, third-party apps such as OBS Studio and TikTok, and now Microsoft Edge extensions, all rolled into one storefront.",
    "Since the first version of the store debuted in Windows 8 back in 2012, it was first seen as a way of managing your apps on both your computer and your Windows Phone device. Once this aim was abandoned, and many feel so was the store, until Windows 11.",
    "It could help new users of Windows 11 who may be unsure of what apps and extensions to find. With this new focus on curation for the store, it could be the easiest way to find everything you need to install in one place.",
    "If you would like to try out the Windows 11 preview, we have a handy guide on how to download Windows 11. But as it is prone to bugs, we advise you not to install it on your main machine just yet.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Another extension to the Store",
    "6": "Analysis: a promising start for the new store"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "how to download Windows 11": "https://www.techradar.com/news/how-to-download-windows-11",
    "Windows Latest": "https://www.windowslatest.com/2021/06/30/microsoft-edge-extensions-are-coming-to-windows-11-store/"
  }
}