{
  "source": "https://www.techradar.com/news/apple-has-blocked-this-popular-vpn-from-delivering-important-security-updates",
  "title": "Apple has blocked this popular VPN from delivering important security updates",
  "category": "computing",
  "updated": "2021-03-24T14:00:25Z",
  "author": "joel-khalili",
  "summary": "Updates for ProtonVPN on iOS have been barred over the phrasing of the app description",
  "article": [
    "Proton, the company behind ProtonVPN, has hit out at Apple after updates for its VPN service were blocked by the firm.",
    "In a blog post, Proton founder Andy Yen expressed his alarm at the reasons provided by the App Store Review team, which centered on the possibility the VPN app could be used to challenge the authority of governments.",
    "In an email to Proton, Apple asked the company to “ensure the app is not presented in such a way that it encourages users to bypass geo-restrictions or content limitations”. According to Proton, these requirements jeopardize its ability to assist those most in need of the service.",
    "As a consequence of the ban, users of ProtonVPN for iOS will not receive updates designed to shield against account takeover attempts that could compromise privacy. The requirements, if Proton chooses to adhere to them, will also presumably limit the discovery of the app by anyone looking to bypass internet censorship.",
    "The complaint published by Proton is framed around the ongoing military coup in Myanmar, which has led to the deaths and imprisonment of thousands of peaceful protesters. Internet shutdowns designed to prevent incriminating material from leaving the country have forced citizens of Myanmar to seek alternative methods of accessing the internet.",
    "VPN services, such as ProtonVPN, provide an avenue for people living under censorious regimes to access news, communicate with one another and document events.",
    "However, according to Yen, it is precisely these qualities that Apple has objected to. By cutting off access to ProtonVPN updates, he suggests, Apple is “actively hampering the defense of human rights”.",
    "“Proton has long been a defender of freedom and democracy around the world,” wrote Yen. “We feel every corporation has a responsibility to protect basic human rights wherever they are under threat. Unfortunately, by blocking ProtonVPN security updates, Apple has demonstrated that it does not share this philosophy.”",
    "The Proton founder also accused Apple of hypocrisy, suggesting that the company is willing to challenge the authority of governments “when it is in its own financial self-interest”. As examples, he gestured towards Apple’s alleged avoidance of EU tax and evasion of antitrust charges.",
    "Apple did not respond to our request for comment."
  ],
  "headers": {
    "4": "Apple vs. ProtonVPN"
  },
  "links": {
    "ProtonVPN": "https://www.techradar.com/reviews/protonvpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "blog post": "https://go.getproton.me/aff_c?offer_id=25&aff_id=1046&source=trd&aff_click_id=trd-us-4849025081853870000&url=https%3A%2F%2Fprotonvpn.com%2Fblog%2Fapple-blocks-app-updates%2F%3FvisitorId%3Dho-%7Btransaction_id%7D%26aid%3D%7Baffiliate_id%7D%26offer_id%3D%7Boffer_id%7D%26url_id%3D%7Boffer_url_id%7D%26utm_campaign%3Dww-all-2a-vpn-gro_aff-g_acq-partners_program%26utm_medium%3Dlink%26utm_source%3Daid-tune-%7Baffiliate_id%7D%26utm_content%3D%7Boffer_id%7D%26hfp%3Dfalse%26spl%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fapple-has-blocked-this-popular-vpn-from-delivering-important-security-updates"
  }
}