{
  "source": "https://www.techradar.com/news/all-nvidia-rtx-3000-founders-edition-gpus-will-get-game-boosting-technology",
  "title": "All Nvidia RTX 3000 Founders Edition GPUs will get game boosting technology",
  "category": "computing",
  "updated": "2021-03-02T11:30:53Z",
  "author": "jess-weatherbed",
  "summary": "Resizable BAR will be coming to your GPU soon.",
  "article": [
    "Nvidia has announced that support for the framerate-boosting Resizable BAR will come to all Founders Edition 3000 series cards by late March. If you're lucky enough to have your hands on video cards like the RTX 3070 or RTX 3080 then you'll soon be able to enjoy an average performance increase of 10% on specific game titles. This feature was just included in the latest edition to Nvidia's gaming graphics card family, the GeForce RTX 3060 graphics card, with mobile 3000 GPUs already taking advantage of this feature.",
    "Functionality for the Resizable BAR feature is only enabled on eight games at the time of writing, but additional games are expected to have compatibility announced by the end of March 2021. We don't have any confirmation on what the titles will be as Resizable BAR can potentially reduce performance output in some games. Nvidia is currently testing various titles and only those that see a benefit from Resizable BAR will be enabled to run the feature, which makes sense as nobody wants to include a new feature that can actually reduce framerate or performance.",
    "This PCIe Resizable BAR capability first came to light when AMD introduced it with the launch of Big Navi graphics cards, in the form of Smart Access Memory, otherwise known as 'SAM'. Basically, Resizable BAR works by lifting memory constraints on CPU to GPU data access, which has the potential to give a good performance uplift dependant on the game you're running. Some titles saw an increase of up to 20% in initial tests, though a ballpark of 10% is what should be reasonably expected. This may seem low initially, but this technology is still in its early stages and has room to grow over the next few years - with any luck we could see this optimized across more titles for a positive performance gain. You'll need compatible hardware to make use of the Resizable BAR feature, so if you're looking to squeeze a few extra framerates out of games like Battlefield V or Assassin’s Creed Valhalla then be sure to reference your build on Nvidia's blog post. For anyone still hunting for a new GeForce 3000 series GPU, check out our where to buy guides for cards like the RTX 3080 to see who has stock available. With any luck, you might secure one for yourself before the bots or crypto miners get to them.",
    "Via NoteBook Check"
  ],
  "headers": {
    "2": "What is Resizable BAR?"
  },
  "links": {
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "GeForce RTX 3060 graphics card": "https://www.techradar.com/news/leaked-nvidia-rtx-3060-prices-are-good-news-and-bad-for-people-looking-for-a-deal",
    "eight games at the time of writing": "https://www.techradar.com/news/nvidia-rtx-3060-gpu-comes-with-bonus-tech-thatll-make-some-games-run-faster",
    "Big Navi graphics cards": "https://www.techradar.com/news/amd-big-navi",
    "Smart Access Memory": "https://www.techradar.com/news/amds-new-big-navi-gpu-benchmarks-suggest-nvidia-could-be-in-more-trouble-than-we-thought",
    "Nvidia's blog post.": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-1138888151309487700&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-us%2Fgeforce%2Fnews%2Fgeforce-rtx-30-series-resizable-bar-support%2F%3Fncid%3Dafm-chs-44270%26ranMID%3D44270%26ranEAID%3DkXQk6%2AivFEQ%26ranSiteID%3DkXQk6.ivFEQ-TXETzNgWY6KsFBJJNT.vjQ",
    "NoteBook Check": "https://www.notebookcheck.net/NVIDIA-to-bring-Resizable-BAR-support-to-all-RTX-30-Founders-Edition-cards-by-late-March-AIBs-will-issue-VBIOS-updates-too-but-initial-performance-benefits-will-be-minimal.525794.0.html"
  }
}