{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-price-leaked-and-its-higher-than-wed-hoped",
  "title": "Samsung Galaxy Watch 4 price leaked and it’s higher than we’d hoped",
  "category": "wearables",
  "updated": "2021-07-02T14:28:50Z",
  "author": "james-rogerson",
  "summary": "On the rise",
  "article": [
    "The Samsung Galaxy Watch range has always been fairly premium as far as smartwatches go, but for the Samsung Galaxy Watch 4 – and especially the Samsung Galaxy Watch 4 Classic – the prices could be even higher than normal.",
    "According to industry sources speaking to MySmartPrice, the Samsung Galaxy Watch 4 (which is thought to be the Samsung Galaxy Watch Active 4 in all but name) will come in 40mm and 44mm sizes, with the former costing around 350-370 euros (roughly $425/£310/AU$570) and the latter coming in at approximately 380-400 euros (around $460/£335/AU$615).",
    "The Samsung Galaxy Watch 4 Classic meanwhile, which looks to be what we’d originally expected the Galaxy Watch 4 to be, will apparently come in 42mm and 46mm sizes. The 42mm one is said to be between 470-500 euros (approximately $575/£416/AU$765), and the 46mm one is supposedly 500-530 euros (roughly $610/£440/AU$815).",
    "For reference, the Samsung Galaxy Watch Active 2 starts at $279.99 / £269 (or AU$549 in Australia, which only gets the larger model), and the Samsung Galaxy Watch 3 begins at $399 / £399 / AU$649. So the prices here certainly look higher. Of course, we wouldn’t expect exact conversions from the euro price, but the euro price is also higher than the current models.",
    "This leak also includes a few other details, adding that apparently the Samsung Galaxy Watch 4 will be available in black, silver, green and gold shades, while the Samsung Galaxy Watch 4 Classic will be sold in black and silver.",
    "It notes that previous leaks have mentioned a grey color and a 44mm size for the Galaxy Watch 4 Classic, but this source has no details of those.",
    "As ever we’d take these leaks with a pinch of salt, especially the prices as this is the first we’ve heard of them. Hopefully they’re wrong, but if not, we really hope these wearables are a big upgrade to justify the outlay. We should know soon, with leaks pointing to an August 3 announcement."
  ],
  "headers": {
    "3": "A hefty outlay"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "MySmartPrice": "https://www.mysmartprice.com/gear/samsung-galaxy-watch-4-watch-4-classic-galaxy-buds-2-price-colour-variants-revealed-launch/",
    "Samsung Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "previous leaks": "https://www.techradar.com/news/samsung-galaxy-watch-4-classic-leak-gives-a-first-look-at-this-mysterious-wearable",
    "pointing to an August 3 announcement": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch"
  }
}