{
  "source": "https://www.techradar.com/news/dynabook-expands-its-tecra-line-with-new-secure-laptops",
  "title": "Dynabook expands its Tecra line with new secure laptops",
  "category": "computing",
  "updated": "2021-06-16T18:00:37Z",
  "author": "anthony-spadafora",
  "summary": "Tecra A40-J and Tecra A50-J are built for secure, hybrid work",
  "article": [
    "Dynabook is expanding its iconic Tecra line with two new business laptops designed to meet the needs of today's mobile professionals.",
    "The company's new 14-inch Tecra A40-J and 15-inch Tecra A50-J laptops have been completely redesigned for hybrid working while also reducing strain on IT managers.",
    "VP of marketing and engineering at Dynabook Americas, Philip Osako explained what makes the latest additions to its Tecra line stand out in a press release, saying:",
    "\"The new modern designs of the Tecra A40 and A50 truly stand out from the crowd. These new laptops incorporate the power and performance of a professional-grade laptop with a premium style that looks great in any work environment.\"",
    "First introduced by Toshiba 25 years ago, the Tecra brand is a staple of Dynabook's growing portfolio of business laptops and these new devices both feature a new sleek and stylish Mystic Blue chassis with a distinct raised wave detail on the lid. The Tecra A40-J and Tecra A50-J also incorporate IONPURE IPL EPA-approved antimicrobial paint to help prevent the growth of bacteria.",
    "Dynabook's new laptops both feature the company's in-house BIOS with extensive security features, Trusted Platform Module (TPM) 2.0, enterprise-grade encryption and optional Windows Hello fingerprint and face authentication. The Tecra A40-J and Tecra A50-J even meet the requirements for Microsoft's Secured-core PCs. IT departments will also find it easier to support and manage Dynabook's new Tecra laptops as they come equipped with Intel Active Management Technology (AMT) which enables them to be managed remotely.",
    "When it comes to performance, both devices feature 11th Gen Intel Core processors and Intel Iris Xe powered graphics. The Tecra A40-J and Tecra A50-J can be outfitted with up to 32GB of RAM and up to 1TB of SSD storage. Both laptops also include Wi-Fi 6 and an array of full-size ports including HDMI 2.0, Ethernet, two Thunderbolt 4 enabled USB-C ports, a microSD slot and a USB-A 3.2 port for connecting additional business accessories.",
    "Whether you're working from home or have already returned to the office, Dynabook's new laptops feature an impressive battery life of up to 10.4 hours and a quick charge function means their batteries can be charged up to 40 percent in just 30 minutes.",
    "Dynabook will offer pre-configured Tecra A40-J and Tecra A50-J models but customers can also customize their own devices when both laptops ship in July."
  ],
  "headers": {
    "5": "Built for secure work"
  },
  "links": {
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "press release": "https://www.prnewswire.com/news-releases/dynabook-rolls-out-next-generation-tecra-laptops-delivering-all-new-designs-and-modern-productivity-301312374.html",
    "Toshiba": "https://www.techradar.com/news/toshiba-ceo-resigns-following-takeover-offer",
    "TPM": "https://www.techradar.com/news/microsoft-unveils-its-most-secure-laptop-yet-and-its-powered-by-amd-ryzen",
    "Microsoft's Secured-core PCs": "https://www.techradar.com/news/microsofts-secured-core-pcs-will-defend-against-firmware-level-threats",
    "Intel Iris Xe": "https://www.techradar.com/news/intel-iris-xe-finally-gets-an-official-driver-for-rocket-lake-s-desktops",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-routers-the-best-wi-fi-6-routers-you-can-buy-in-2019",
    "business accessories": "https://www.techradar.com/news/the-best-business-technology-and-productivity-gadgets",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}