{
  "source": "https://www.techradar.com/news/xbox-series-x-game-drought-could-soon-be-over-heres-why",
  "title": "Xbox Series X game drought could soon be over - here's why",
  "category": "gaming",
  "updated": "2021-06-10T13:00:14Z",
  "author": "vic-hood",
  "summary": "Opinion: the future looks bright for first-party Xbox games",
  "article": [
    "Microsoft has announced that it aims to release at least one, new first-party title on Xbox Game Pass every quarter, a strategy that should hopefully clear up the current Xbox Series X game drought.",
    "During a recent What’s Next For Gaming briefing, Microsoft revealed that its first-party studios currently have a mix of games in the works, including RPGs, shooters, strategy and adventure games, to ensure that there is “a steady stream of compelling exclusive content to explore”.",
    "“In terms of the overall lineup, we want to get to a point of releasing a new game every quarter,” Head of Xbox Game Studios, Matt Booty, said. “We know that a thriving entertainment service needs a consistent and exciting flow of new content. So our portfolio will continue to grow as our service grows.”",
    "Even though Microsoft specifically mentions Xbox Game Pass, it means that we can expect at least one new first-party title from the publisher every few months - likely on both console and PC. While we’re not expecting all these titles to be big hitters, it does suggest that the Xbox Series X game lineup is going to become more robust in the future.",
    "At present, the Xbox Series X library isn’t exactly brimming with exclusives. Many Xbox Series X titles are optimized Xbox One titles rather than brand new exclusives, while others - like The Medium - are rumored to be making their way to PS5.",
    "The saving grace for Microsoft here has been Xbox Game Pass which, while needing to be purchased as a separate subscription, gives players access to hundreds of Xbox games for a monthly fee. Xbox Game Pass has bolstered the Xbox Series X library considerably, allowing players to play something while waiting on flagship titles like Halo Infinite.",
    "And while Xbox Game Pass is home to hundreds of games, including EA and Bethesda titles, it’s still somewhat lacking for those who want to play brand new first-party titles. Yes, new first-party Xbox Series X games will come to Xbox Game Pass on day one, but we haven’t seen much in the way of first-party game releases this year to take advantage of that promise.",
    "Microsoft’s announcement is welcome news then, as we know that the publisher plans to ramp up its first-party releases in the future and - what’s more - they will be coming to Xbox Game Pass from launch.",
    "It’s not only good news for those who want some new Xbox games to sink their teeth into, but it makes Xbox Game Pass an even more enticing proposition. While the service is already excellent value, and we highly recommend pairing it with your new Xbox Series X, a slew of new games will give it a serious advantage over Sony’s $70 PS5 game offerings.",
    "As we look ahead to the future of Xbox Series X games, things seem to be looking up. With first-party exclusives like Halo Infinite, Psychonauts 2, along with games from independent developers like Sable and The Ascent slated to release in 2021, we’re hoping that Microsoft is starting to seriously get the ball rolling with offering some major Xbox exclusive offerings. After all, with a bunch of new studios under its wing, including juggernaut Bethesda, Microsoft has a pretty good hand - we just want to finally see them play it."
  ],
  "headers": {
    "4": "Lacklustre offering",
    "7": "Brighter future"
  },
  "links": {
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "The Medium": "https://www.techradar.com/reviews/the-medium",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox Series X games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "PS5 game": "https://www.techradar.com/best/best-ps5-games"
  }
}