{
  "source": "https://www.techradar.com/news/playstation-has-just-snagged-another-ps5-exclusive-studio",
  "title": "PlayStation has just snagged another PS5-exclusive studio",
  "category": "gaming",
  "updated": "2021-09-30T15:27:13Z",
  "author": "gerald-lynch",
  "summary": "Remake masters join the Sony stable",
  "article": [
    "Sony has just announced it’s bagged yet another studio for its stable of exclusives – and it’s one that won’t be a surprise to those that have been keeping tight tabs on PlayStation’s recent greatest hits.",
    "Hermen Hulst, head of PlayStation Studios, took to Twitter to announce Sony’s acquisition of Bluepoint Games, the development team responsible for the lavish, big-budget remakes of Demon’s Souls for the PS5 and Shadow of the Colossus on the PS4. They also developed the God of War Collection and Metal Gear Solid HD Collection for PS3 and PSVita.",
    "It’s been a fruitful relationship, then, with the studio reimagining some of PlayStation’s best-loved franchises over the past decade. And while the announcement wasn’t paired with any news on what the studio is working on next, it will be interesting to see if Bluepoint Games turns its hand to an original property, or continues its spree of high-end remakes.",
    "Sony has been tipped to acquire Bluepoint Games for a number of months now, particularly after a premature tweet was published by PlayStation Japan’s Twitter account after the company announced the acquisition of Returnal developer Housemarque back in June 2021.",
    "While it may have taken longer than expected to become official, the move makes sense for PlayStation, which has worked closely with Bluepoint on numerous projects in the past. It also strengthens the long-running rumor that the studio could be working on a Metal Gear Solid remake that will be exclusive to PS5 – especially given Bluepoint’s early work on the Metal Gear Solid HD Collection.",
    "With Microsoft snapping up studios left, right, and center last year – the most notable being the acquisition of ZeniMax Studios, the parent company of Bethesda – Sony has responded in kind by purchasing Insomniac Games, Housemarque, Firesprite, and now Bluepoint Games.",
    "Of course, buying studios is one thing, but having a steady stream of titles for gamers to enjoy is the ultimate goal. By securing more studios to develop exclusive content for PS5, Sony has shown its commitment to delivering more unique games for PlayStation 5 owners, and that's all that matters."
  ],
  "headers": {
    "3": "Analysis: Sony’s spending spree continues"
  },
  "links": {
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "acquisition of Returnal developer Housemarque": "https://www.techradar.com/news/sony-buys-returnal-developer-and-leaks-another-huge-ps5-acquisition",
    "Metal Gear Solid remake": "https://www.techradar.com/news/a-metal-gear-solid-remake-could-be-coming-exclusively-to-ps5",
    "Bethesda": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive"
  }
}