{
  "source": "https://www.techradar.com/news/nordvpn-maker-has-expanded-its-bug-bounty-program",
  "title": "NordVPN maker has expanded its bug bounty program",
  "category": "computing",
  "updated": "2021-03-31T22:00:20Z",
  "author": "anthony-spadafora",
  "summary": "Bug bounty program now includes NordVPN, NordPass and NordLocker",
  "article": [
    "Nord Security, the parent company of NordVPN, has officially launched a bug bounty program for its VPN service as well as for its password manager NordPass and its file encryption service NordLocker.",
    "NordVPN first launched its bug bounty program back in December of 2019. However, as Nord Security's product family has expanded, the company has now extended the program to include NordPass and NordLocker.",
    "Through its bug bounty program, Nord Security is giving ethical hackers the chance to discover potential security vulnerabilities, report them and earn monetary rewards. The company's CTO Marijus Briedis provided further insight on its bug bounty program in a press release, saying:",
    "“Security is our number one priority in all of our products. Therefore, we want to engage as many expert penetration testers as we can. The Bug Bounty initiative allows us to utilize all the security talent available and empowers everyone in the community to help us build a safer online world.”",
    "Nord Security's bug bounty program is implemented via the HackerOne platform which helps connect businesses with penetration testers and security researchers around the world. In fact, many of the world's biggest brands including Starbucks, Sony and many others depend on the company's services for their own bug bounty programs.",
    "“Nord Security uses a managed service from HackerOne, which helps us progress in better program design and bug management and provides us with additional support running our program from end to end”, added Briedis.",
    "Nord Security and HackerOne plan to celebrate the program's launch by running a two-week event from March 31 to April 14 where ethical hackers will receive double the normal amount for finding high and critical vulnerabilities in NordVPN. However, only reports related to NordVPN's desktop and mobile apps will be considered eligible during the event.",
    "While security researchers and ethical hackers can now earn bounties for finding vulnerabilities in NordVPN, NordPass and NordLocker, Nord Security's customers can rest easy knowing that their software is secure."
  ],
  "headers": {
    "4": "Bug bounty program"
  },
  "links": {
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "bug bounty program": "https://www.techradar.com/news/nordvpn-boosts-security-with-new-bug-bounty-program",
    "NordPass": "https://www.techradar.com/reviews/nordpass",
    "NordLocker": "https://www.techradar.com/reviews/nordlocker",
    "HackerOne": "https://www.techradar.com/news/building-the-worlds-largest-bug-bounty-platform",
    "Starbucks": "https://www.techradar.com/news/ordering-starbucks-through-your-phone-might-get-you-more-than-just-coffee",
    "Sony": "https://www.techradar.com/news/playstation-announces-bug-bounty-program",
    "earn bounties": "https://www.techradar.com/news/bug-bounties-have-made-these-hackers-millionaires"
  }
}