{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-classic-leak-gives-a-first-look-at-this-mysterious-wearable",
  "title": "Samsung Galaxy Watch 4 Classic leak gives a first look at this mysterious wearable",
  "category": "wearables",
  "updated": "2021-07-01T08:58:41Z",
  "author": "james-rogerson",
  "summary": "In three shades",
  "article": [
    "The Samsung Galaxy Watch 4 Classic is a wearable that we only heard about recently, but it looks like it’s going to be the classy smartwatch that we expected the Samsung Galaxy Watch 4 to be, and we now have more evidence of that, thanks to what appears to be official renders that have leaked.",
    "Shared by Android Headlines, these renders show a smartwatch with a rotating bezel, and two large buttons on the right edge. It will apparently come in black, white and grey shades, all of which are pictured, and unusually is said to come in three sizes, rather than the two that Samsung typically offers. These are apparently 42mm, 44mm and 46mm.",
    "You’ll also apparently be able to choose either a stainless steel or aluminum case, with all three sizes available for both materials. Interestingly, the display is said to be protected by Gorilla Glass DX if you opt for stainless steel, but the less-premium aluminum will apparently get more-premium screen protection with Gorilla Glass DX+.",
    "Other details about the Samsung Galaxy Watch 4 Classic listed here include that it will supposedly support standard 20mm watch straps, and have 5ATM water resistance, and MIL-STD-810G certification. The first of those means it should be swim-safe, while the latter means it should be able to survive basic bumps, drops and scrapes.",
    "The only other detail to note here is that there’s a 28 on the screen in these renders, which could mean the Samsung Galaxy Watch 4 Classic will be announced or released on the 28th of some month – likely August, as that’s when we’ve heard rumors that it will arrive. That said, the latest leak suggests an announcement on August 3, and it would seem a long wait to August 28 if that’s the release date, so maybe the number isn’t hinting at anything.",
    "Still, while the release date might be unclear, at least the Samsung Galaxy Watch 4 Classic itself is now less of a mystery. It appears to be the Galaxy Watch 4 in all but name, while the actual Samsung Galaxy Watch 4 looks set to essentially be the Samsung Galaxy Watch Active 4. So Samsung might be retiring the Active name, but continuing both its sporty and stylish watch lines."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Android Headlines": "https://www.androidheadlines.com/exclusive-samsung-galaxy-watch-4-classic",
    "an announcement on August 3": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
    "Samsung Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review"
  }
}