{
  "source": "https://www.techradar.com/news/sony-xperia-1-iii-release-date-leak-will-disappoint-sony-phone-fans",
  "title": "Sony Xperia 1 III release date leak will disappoint Sony phone fans",
  "category": "phones",
  "updated": "2021-05-12T15:08:09Z",
  "author": "tom-bedford",
  "summary": "The Xperia 5 III looks late too",
  "article": [
    "When the Sony Xperia 1 III and Xperia 5 III were unveiled, the new Sony phones had the vague 'early summer' release date - but the possible actual date has come out and people might not be happy.",
    "As spotted by a Reddit user, US store B&H has added possible shipping dates to its listings for the Xperia 1 III and Xperia 5 III, as August 31. At the time of writing, the date is still visible on the website, suggesting it's not a typo.",
    "We can't find this date repeated on other websites, which suggests it's just a placeholder or similar, but it seems a strange coincidence that this news is breaking on the same date as the Sony Xperia 10 III, the sibling of the aforementioned phones, gets launched in a few countries worldwide, and has its price announced in more.",
    "So what's going on? Is this the official release date for the new Sony phones, or is this a placeholder, or just plain wrong? We can't know for now, and Sony's official website still doesn't list any kind of date. For now, take it under advisement, but it's perhaps not set in stone.",
    "It's worth pointing out that this is regarding the US release date, as it's different in various countries.",
    "If this August 31 date is correct, the Sony Xperia 1 III and 5 III might come much later than we expected - it's hard to argue that's still 'early summer', as Sony initially stated the release date would be.",
    "Lots of people have been waiting to buy one of the new Mark 3 phones, but at the time of writing that release date is still three months away. So if you were waiting for the launch to buy a new phone, you're likely going to have to wait longer than you expected.",
    "The Xperia 1 III and 5 III have lots of competition in 2021, like from the Samsung Galaxy S21, OnePlus 9, Oppo Find X3 and Xiaomi Mi 11 lines, and you can pick any of those up right away.",
    "Saying that, Sony Xperia fans are known for being loyal to their mobile brand, so perhaps a few months more is no obstacle if it means picking up a super-powerful smartphone. And you never know - maybe B&H is wrong."
  ],
  "headers": {
    "5": "Is it worth the wait?"
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Xperia 5 III": "https://www.bhphotovideo.com/c/product/1634540-REG/sony_xqbq62_b_xperia_5_iii_smartphone.html?BI=20811&KBID=16572&SID=trd-us-1313340407048459000",
    "Reddit user": "https://www.reddit.com/r/SonyXperia/comments/na0mdl/1_iii5_iii_back_in_us_website_ships_aug_31_bh/",
    "Xperia 1 III": "https://www.bhphotovideo.com/c/product/1634539-REG/sony_xqbc62_b_xperia_1_iii_smartphone.html?BI=20811&KBID=16572&SID=trd-us-1334731520113489400",
    "Sony Xperia 10 III": "https://www.techradar.com/reviews/sony-xperia-10-iii",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review"
  }
}