{
  "source": "https://www.techradar.com/news/marshalls-first-true-wireless-earbuds-could-be-rocking-apple-airpods-alternatives",
  "title": "Marshall’s first true wireless earbuds could be rocking Apple AirPods-alternatives",
  "category": "audio-visual",
  "updated": "2021-03-04T15:02:45Z",
  "author": "olivia-tambini",
  "summary": "Give your ears the rockstar treatment",
  "article": [
    "Marshall has unveiled its first pair of true wireless earbuds, having largely focused on over-ear headphones, wired earphones, and portable speakers for the last few years.",
    "The brand, which is most famed for its iconic guitar amps, claims the Marshall Mode II wireless earbuds will deliver “a thunderous audio experience”, while being “effortlessly portable” thanks to their compact charging case.",
    "The new earbuds retain the look of previous Marshall headphones, with the brand’s ‘M’ logo embossed on their outer housings, as well as a leather-look charging case.",
    "They come with four differently-sized ear tips, so you should be able to find a secure fit, while an IPX4 water-resistance rating means you could feasibly use the Mode II for working out, without the worry that sweat or rain will break them.",
    "Inside the earbuds are 6mm dynamic drivers, which Marshall says will deliver “growling bass, natural-sounding mids, and crisp trebles”. We were impressed with the audio quality of the Minor II neckbuds (though we found them unbearably uncomfortable), so hopefully Marshall has taken some cues from its previous model. Saying that, the Minor II sported 14.2mm drivers, so the new Mode II may not be quite as powerful.",
    "You can control your music playback, as well as activate the transparency mode, by tapping the earbuds, thanks to touch-sensitive housings. Meanwhile, Bluetooth 5.1 connectivity should ensure fast pairing times and a stable connection.",
    "Battery life comes in at five hours from the earbuds themselves, with a further 20 provided by the charging case – that’s about the same as the Apple AirPods, though it’s certainly not a class-leading battery life.",
    "So, how much do they cost? You’ll be able to buy the Marshall Mode II from March 18, and they’ll set you back $179 / £159 (about AU$230).",
    "We can’t help but feel a little surprised at that price. After all, these wireless earbuds don’t come with active noise cancellation, and all the other specs seem to be quite… average. The Mode II may be Marshall’s first true wireless earbuds, but the form factor has evolved quite a bit over the last few years, and we’d expect buds of this price to sport a few extra features to set them apart from the plethora of budget wireless earbuds on the market.",
    "Aside from Bluetooth 5.1 connectivity and a rock-inspired design, there’s really not much difference between these and the 2019 Apple AirPods.",
    "Still, if the Marshall Mode II sound exceptionally good, those average specs won’t matter at all. As with any pair of headphones, it’s all about delivering an outstanding audio performance, and that’s what we’ll be looking for when we test the brand’s first true wireless earbuds for ourselves."
  ],
  "headers": {
    "7": "Is it enough?"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "wired earphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "portable speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Minor II neckbuds": "https://www.techradar.com/reviews/marshall-minor-ii-wireless-in-ear-headphones",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340"
  }
}