{
  "source": "https://www.techradar.com/news/ghost-of-tsushima-directors-cut-locks-ps5-features-behind-a-paywall-and-thats-dishonorable",
  "title": "Ghost of Tsushima: Director's Cut locks PS5 features behind a paywall – and that's dishonorable",
  "category": "gaming",
  "updated": "2021-07-03T15:30:00Z",
  "author": "adam-vjestica",
  "summary": "Opinion: It’s time Sony gave up the Ghost",
  "article": [
    "Ghost of Tsushima hasn’t even reached its first anniversary, but that hasn’t stopped Sony from making one of the best PS5 games even better thanks to the recently announced Ghost of Tsushima: Director’s Cut, which releases on August 20, 2021.",
    "But there’s something rather dishonorable about this upcoming release of Sucker Punch’s critically-acclaimed PS4 exclusive. Particularly with how the paid upgrade to the PS5 version works – and it’s one that's worth lamenting.",
    "If you missed the announcement, Ghost of Tsushima: Director’s Cut includes every additional piece of content developer Sucker Punch has sold to date, and a brand-new separate adventure in the form of Iki Island. Iki neighbors the island of Tsushima where the original game takes place, and players will get to experience a whole new story, meet new characters, and explore a completely new area as the game’s samurai protagonist, Jin.",
    "Ghost of Tsushima: Director’s Cut will also include PS5 exclusive features, such as PS5 3D audio, support for the DualSense controller’s haptic feedback and adaptive triggers, as well as target a 4K resolution at 60 frames per second. Oh, and Japanese lip sync has also been added, which is a really nice touch for those who played with Japanese VO, like myself.",
    "It all sounds great, then, and as someone who absolutely adored Ghost of Tsushima and had the pleasure of playing it at silky-smooth 60fps on PS5, I’m more than ready to wield my katana once again as Jin Sakai.",
    "At least, I thought I was...",
    "So what’s the situation with the Director’s Cut, and is it a free upgrade? Unfortunately not. If you haven’t played Ghost of Tsushima before, you can pick up the Director’s Cut for $59.99 on PS4 and $69.99 on PS5, which is par for the course. You’re buying a brand-new game after all.",
    "But what about those who already own Ghost of Tsushima? Well, this is where things get a bit… cheeky. Those who own the game will need to pay $19.99 to upgrade to the Director’s Cut on PlayStation 4, and $29.99 to do so on PS5. If you buy the PS4 version of the Director’s Cut and pick up a PS5 at a later date, you’ll be able to upgrade for $9.99.",
    "From the pricing Sony has provided, then, we can deduce that the Iki Island and supplementary content that was released during Ghost of Tsushima’s year on sale is worth $19.99 to the company’s coffers. However, on PS5, the Director’s Cut upgrade costs $29.99, which means players are being charged an additional $9.99 for the PlayStation 5-specific features mentioned above. Also, the Iki Island DLC isn’t available to purchase as a standalone option – it’s only available as part of the Director’s Cut.",
    "This doesn’t sit right with me. Was it really unreasonable to think that Sony and Sucker Punch might give the PS5-specific upgrades to existing owners for free? As we’ll see below, maybe, but only because Sony’s approach doesn’t compare favorably to how Microsoft has handled Xbox Series X upgrades of its first-party Xbox One games.",
    "Let’s compare Ghost of Tsushima: Director’s Cut to Gears 5, a title that was released in September 2019. Gears 5 received a substantial graphical overhaul for Xbox Series X that included improved shadows, increased details, a 120fps mode in multiplayer, and it didn’t cost a penny for existing owners. If you own Gears 5 on Xbox One, you’ll get access to the Xbox Series X/S version for free.",
    "On December 15, 2020, around two months after the Xbox Series X launched, developer The Coalition added a separate single-player expansion for the game called Hivebusters, which costs $19.99 and was free to those who subscribe to Xbox Game Pass Ultimate.",
    "The difference here should be obvious. Unlike Ghost of Tsushima: Director’s Cut on PS5, The Coalition didn’t lock Gears 5’s juicy next-gen update inside the Hivebusters DLC: it was free to all, and Hivebusters is rightfully an optional extra.",
    "That’s one example, then, but let’s take a look at Sea of Thieves as another. While it’s a slightly looser comparison due to the fact Rare’s seafaring adventure game follows a “live service” approach, it still received a free next-gen upgrade that made 60fps as standard on Xbox Series X and Xbox Series S, and also added an 120fps mode on Microsoft’s flagship console.",
    "The game might be over three years old, but it recently received it’s biggest expansion yet in the form of the Sea of Thieves: A Pirate’s Life, an ambitious Pirates of the Caribbean crossover. Perhaps somewhat surprisingly, it’s completely free to existing players, and even if it was paid content, the next-gen version of the game would still be available to all.",
    "But that's just two examples. A quick look at Microsoft’s first-party output (excluding Bethesda titles) shows that Forza Horizon 4, Halo: The Master Chief Collection, Gears 5, Gears Tactics, Sea of Thieves, State of Decay 2, Minecraft Dungeons, Ori and the Will of the Wisps and Grounded have all received free next-gen upgrades.",
    "Sony, meanwhile, has opted to release free 60fps updates to God of War, Ratchet and Clank, Days Gone, The Last of Us 2 and, of course, Ghost of Tsushima. But as welcome as these updates were, they only boosted the framerate, and didn’t touch any other aspects of the game.",
    "That means there are nine games on Xbox Series X in total that have been enhanced for next-gen, without costing existing owners a single penny – while Sony hasn’t given existing owners any next-gen upgrades on its first-party games, other than the aforementioned framerate boosts (something which Microsoft has delivered to a further 97 games thanks to its FPS Boost program, it should be said).",
    "It would have been lovely, then – a pleasant surprise even – if Sony or Sucker Punch at least offered a free PS5 upgrade to all Ghost of Tsushima owners who have the PS4 version and a PlayStation 5. But instead, existing owners will have to pay an additional $29.99 on top of what they already paid for Ghost of Tsushima to experience the original game with some PS5-specific flourishes.",
    "The whole thing seems like a clear ploy to incentivise existing PS5 owners to purchase the Director’s Cut, then, instead of relying on the Iki Island DLC to pull players in on its own merit. After all, if that wasn’t the case, why isn't the Iki Island DLC available as a separate purchase like Gears 5 Hivebusters was?",
    "While it was great to see Ghost of Tsushima get a 60fps patch on PS5 and a free multiplayer mode (which now seems almost miraculous all things considered), it’s irritating that system-level features such as 3D audio, adaptive triggers and haptic feedback are now locked behind a paywall in the form of the Director’s Cut. It’s just as bad as how Nintendo has locked fast-travel in The Legend of Zelda: Skyward Sword HD behind a plastic paywall, otherwise known as an amiibo.",
    "I’m more than happy to pay for additional content, don’t get me wrong – but as this generation has proved in probably one of the most pro-consumer moves we’ve ever seen, next-gen upgrades are now commonplace and almost always completely free. You need only look at the exemplary Metro Exodus upgrade that dropped as a recent example of this trend in action. If these publishers and studios can do it without a fee, why does Sony, the platform holder, demand one?",
    "Ghost of Tsushima holds the honor of being only the second game I’ve ever played that managed to make me weep like a baby - a title that had been held exclusively by Klonoa: Door to Phantomile for a number of decades. Now, though, it’s Sony’s pricing policies that continue to make make me feel close to tears."
  ],
  "headers": {
    "6": "A cutting blow",
    "10": "Grinds my gears",
    "15": "Green with envy",
    "19": "Ghost of generosity"
  },
  "links": {
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "best PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "Ghost of Tsushima: Director’s Cut": "https://www.techradar.com/news/dont-start-playing-ghost-of-tsushima-on-ps5-until-august-20",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox One games": "https://www.techradar.com/best/best-xbox-one-games",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review",
    "120fps mode": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support",
    "Xbox One": "https://www.techradar.com/reviews/original-2013-xbox-one",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-release-date-news-and-features",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Sea of Thieves: A Pirate’s Life": "https://www.techradar.com/news/sea-of-thieves-a-pirates-life-is-the-biggest-most-impactful-update-ever",
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review",
    "Halo: The Master Chief Collection": "https://www.techradar.com/news/halo-the-master-chief-collection-is-getting-a-serious-xbox-series-x-upgrade",
    "Minecraft Dungeons": "https://www.techradar.com/reviews/minecraft-dungeons",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Days Gone": "https://www.techradar.com/news/the-ps5-will-give-ps4-exclusive-days-gone-a-serious-backwards-compatibility-boost",
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "FPS Boost": "https://www.techradar.com/news/list-of-xbox-fps-boost-games-on-xbox-series-x-and-xbox-series-s",
    "The Legend of Zelda: Skyward Sword HD": "https://www.techradar.com/news/the-legend-of-zelda-skyward-sword-hd-for-nintendo-switch-everything-you-need-to-know",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review"
  }
}