{
  "source": "https://www.techradar.com/news/mint-mobiles-new-promotion-takes-on-atandt-and-verizon-with-free-credit-for-switchers",
  "title": "Mint Mobile's new promotion takes on AT&T and Verizon with free credit for switchers",
  "category": "phones",
  "updated": "2021-08-20T16:31:59Z",
  "author": "alex-whitelock",
  "summary": "Looking to switch? Score yourself a nice little freebie",
  "article": [
    "New Mint Mobile customers who switch over from either AT&T or Verizon will score $25 of account credit for free as part of a new promotion from the well-known prepaid carrier.",
    "Available until the end of August, the new promotion gives those looking to escape the shackles of pricey big carrier unlimited plans a nice little further incentive to try one of the best-prepaid plans on the market. Of course, you could still opt for an unlimited data plan at Mint Mobile, which will only set you back $30 per month at its cheapest rate.",
    "Mint Mobile operates a rather unique pricing system where you buy your data upfront in multi-month installments. Simply put, if you buy more months upfront, it'll essentially average out at a cheaper rate per month on average - with a year being the best value overall.",
    "It's worth noting that this isn't technically a 'first-month free' offer, it's essentially some renewal credit that you can use after your initial three months is up. Think of it as a 'buy three months, get one-month free' promotion instead - not a huge deal, but a nice little freebie nonetheless if you were thinking about making the switch.",
    "On the fence? See our really helpful guide to this month's Mint Mobile plans for a detailed breakdown of costs, features, and how best to save cash with this excellent carrier. If you'd like to cast the net out further and see what other carriers we recommend at this price point, see our page on this month's best cheap cell phone plans."
  ],
  "headers": {
    "4": "More Mint Mobile content at TechRadar"
  },
  "links": {
    "Mint Mobile": "https://www.techradar.com/deals/mint-mobile-what-is-it-and-is-it-worth-it",
    "$25 of account credit for free": "https://mint-mobile.pxf.io/c/221109/444520/7915?subId1=trd-us-1115383736257234300&sharedId=trd-us&u=https%3A%2F%2Fwww.mintmobile.com%2Fbest-value-wireless%2F%3Fdnfemfkahqkdlf%3Dswitch",
    "best-prepaid plans": "https://www.techradar.com/deals/best-prepaid-plans",
    "Mint Mobile plans": "https://www.techradar.com/deals/best-mint-mobile-plans",
    "cheap cell phone plans": "https://www.techradar.com/deals/best-cheap-cell-phone-plans"
  }
}