{
  "source": "https://www.techradar.com/news/save-big-with-this-razer-power-up-v2-bundle-at-walmart",
  "title": "Save big with this Razer Power Up V2 bundle at Walmart",
  "category": "computing",
  "updated": "2021-11-22T22:14:47Z",
  "author": "john-loeffler",
  "summary": "Four essential Razer pieces for $61 off over buying them separately",
  "article": [
    "Razer PC peripherals are some of the most exciting Black Friday PC gaming deals, and Walmart+ members can get this Razer Power Up V2 Bundle over at Walmart for just $79 in one of the best Black Friday PC gaming deals we've seen so far.",
    "This year's Black Friday deals are rolling out in earnest, so jump on this Razer bundle while you can. Featuring the Razer Cynosa Lite wired keyboard, Razer Gigantus V2 L desk mat, Razer DeathAdder Essential wired mouse, and the Razer BlackShark V2 X wired headset, you're saving $61 over buying all these items on their own.",
    "(Not in the US? Scroll down for deals in your region).",
    "If you're looking to outfit your PC gaming setup with some essential peripherals, this bundle is a great option to get you started. These aren't Razer's most premier items, for sure, but they're still Razer peripherals, so they come with the kind of quality the company is known for.",
    "The BlackShark V2 X headset by itself is almost the price of this entire bundle, so you're getting a lot of value. Everything is wired, though (except for the desk mat, that is), so if you're looking for wireless options you'll have to look elsewhere.",
    "But as a quick and easy swap for a new gaming PC's basic keyboard and mouse, you can't beat this setup.",
    "No matter where you live, you'll find all the lowest prices for the Razer Power Up V2 Bundle from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Razer Power Up V2 Bundle Black Friday deals",
    "6": "More Razer Power Up V2 Bundle deals",
    "7": "More Black Friday deals"
  },
  "links": {
    "Black Friday PC gaming deals": "https://www.techradar.com/deals/best-black-friday-pc-gaming-deals-2019",
    "Razer Power Up V2 Bundle over at Walmart for just $79": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-7768193683472287000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FRazer-Power-Up-Bundle-V2-Cynosa-Lite-Gigantus-V2-L-DeathAdder-Essential-BlackShark-V2-X-US-Layout%2F377460042",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Razer Cynosa Lite wired keyboard": "https://www.techradar.com/reviews/razer-cynosa-lite"
  }
}