{
  "source": "https://www.techradar.com/news/want-an-iphone-13-but-dont-want-a-pricey-plan-visible-is-your-best-option",
  "title": "Want an iPhone 13 but don't want a pricey plan? Visible is your best option",
  "category": "phones",
  "updated": "2021-09-29T11:22:45Z",
  "author": "alex-whitelock",
  "summary": "A cheap plan, and some free gifts to entice you over too",
  "article": [
    "If you're eying up a new iPhone 13 but want to break out of the shackles of the big carriers we think there's one standout option right now - Visible Wireless.",
    "Specifically, the carrier's new free Apple HomePod Mini smart speaker and $200 online gift card promo has caught our eye - which is eligible for all new customers purchasing an iPhone 13 series phone.",
    "Before you ask - yes, you will have to pay upfront at full price for the device, but hear us out - it's actually one of the cheapest options around right now. You've probably already heard of the latest iPhone 13 deals from the big names like Verizon, AT&T, or T-Mobile. Free devices are being handed out like candy right now but there's one obvious big catch - you need to sign on the dotted line for a pricey unlimited plan to be eligible.",
    "Considering these plans will set you back anywhere between $2,000 to $2,500 over 24 to 36 months, they're a heavy investment indeed. By comparison, Visible's unlimited data plan can be bought for as little as $25 per month (with Party Pay).",
    "How much will you save? Well, let's do a little math. Let's say you sign up on the lowest monthly rate at Visible ($25pm) and stay with the service for two years. Even if you buy your device outright you'll pay a total of $1,416 over that time. That's at least $600 cheaper than a big carrier - and that's not counting the welcoming gifts you'll get as a new customer.",
    "So, it's worth considering Visible's latest iPhone 13 deals in our eyes. If you'd like to read more about this service, and other good cheap options, we'd recommend reading our guide to the best prepaid plans.",
    "Outside the US? See the best iPhone deals in your region just below.",
    "But, if you did want to see what Verizon, AT&T, and other big carriers are offering for these awesome new devices, head on over to our main iPhone deals page."
  ],
  "headers": {
    "7": "Need a cheaper option? Consider the iPhone 12"
  },
  "links": {
    "free Apple HomePod Mini smart speaker and $200 online gift card": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-3801261408654903000&sharedId=trd-us&u=https%3A%2F%2Fwww.visible.com%2Fshop%2Fsmartphones%2Fiphone-13%2F%3Fsku%3DMLMN3LL%2FA",
    "iPhone 13 deals": "https://www.techradar.com/deals/apple-iphone-13-deals",
    "$25 per month": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-3086558340757835000&sharedId=trd-us&u=https%3A%2F%2Fwww.visible.com%2Fplan%2F",
    "best prepaid plans": "https://www.techradar.com/deals/best-prepaid-plans",
    "iPhone deals": "https://www.techradar.com/deals/iphone-deals"
  }
}