{
  "source": "https://www.techradar.com/news/psychonauts-2-proves-that-mental-health-awareness-can-be-funny",
  "title": "Psychonauts 2 proves that mental health awareness can be funny",
  "category": "gaming",
  "updated": "2021-07-19T14:52:22Z",
  "author": "vic-hood",
  "summary": "Opinion: A lesson in mental health wellbeing",
  "article": [
    "The lights go up and Razputin \"Raz\" Aquato finds himself on an old-school television show set, complete with overly shiny algae-green floors, red draped curtains and a subtle smoke haze that has been coughed from a machine somewhere. To his side cowers Compton Boole, one of the original founding members of the Psychonauts, the international group of psychic secret agents that Raz is desperately trying to earn his place among. But, to look at Boole now – fearful and dubious – you wouldn’t think it was the same agent Raz had read about in his comic books. We’ve entered Boole’s mind and things are about to get weird.",
    "A goat hand puppet – sporting the luscious, Zeus-like beard of Psychonauts head Truman Zanotto – welcomes an audience made up of eggs, strawberries, bread and other cooking ingredients to “Ram It Down”, a cooking show where Raz and Boole are the only contestants. The host introduces the judges, made up of three more goat hand puppets taking the form of original Psychonaut members, each finicky, gluttonous and immediately critical of Boole’s efforts before he’s even begun.",
    "The aim of the game show is for Raz to whip around the studio, picking up ingredient audience members and frying, chopping, blending or boiling them before returning them to the main stage, ready for Boole to assemble into a delicious dish – all within a set time period.",
    "Every time a dish is served, the goat judges devour it before giving their version of a positive verdict, such as “surprisingly acceptable” ,“moderately pleasant” or “better than eating egg shells”. Everybody’s a critic, eh?",
    "As Raz flies around the studio, grabbing up (oddly) willing audience members to become part of the feast, I find my own heart racing. How will I get this done in the time limit? I should have boiled the talking egg before chopping up the wise-cracking pig. The entire setup is a manifestation of Boole’s own anxieties – constantly judged, never worthy and horrendously overwhelmed – and I relate to it massively.",
    "But, despite the high-pressure environment, I find myself laughing out loud at the sheer ridiculousness of the situation, particularly at how dark and tongue-in-cheek the whole endeavour is – audience members begging to be cooked alive, arguing their case with witticisms as the camera pans over them.",
    "And, between each course Raz calms Boole, telling him that it’s fine to take a breather before doing the next big scary thing. It’s poignant advice and hits hard even when it’s wrapped in the guise of a wacky cooking show. I found myself soothed by Raz’s words while simultaneously belly laughing. As the show went on, with Boole growing in confidence and independence, it felt like only developer Double Fine could do this to me. Only Double Fine’s Psychonauts 2 could make me laugh about my own anxieties and mental health struggles – and get away with it.",
    "The cooking show manifestation was one of four Psychonauts 2 levels I played as part of a preview, but each level boasts its own unique take on a different mental health struggle.",
    "In one level, Raz discovers how powerful (and dangerous) mental associations can be – a new ability introduced in Psychonauts 2. As he attempts to break one Psychonauts member’s association that risky situations can result in death, he instead links risk with money – resulting in their mind becoming a casino and kicking off a gambling addiction. While I don’t want to spoil the particular details of this level, we do see Raz discovering how fragile the psyche can be and learning that creating new mental pathways isn’t always that simple. Raz even learns about consent when entering someone else’s mind – something which was less prevalent in the original game.",
    "Another level sees Raz learning about archetypes, as he attempts to free the various identities of former Psychonaut Cassie O’Pia – each of which has been locked away by a controlling librarian following a traumatic experience.",
    "But it’s not just the environments and overall themes which lend themselves to Psychonauts 2’s mental health depictions. The action platformer is packed to the brim with metaphors for various aspects of mental wellbeing, whether that’s the return of emotional baggage (which needs sorting out) or enemies like Enablers (who cheer on the bad thoughts), Regrets (which try to weigh Raz down) or Doubts (which try to eat you).",
    "As a sequel, Psychonauts 2 brilliantly builds on what made the first so unique, without falling into the all-too-common trap of simply retracing the original. Instead, there are plenty of new quality-of-life and accessibility features, along with new characters, enemies, environments and optional side missions to undertake – not to mention new abilities to learn. It’s the perfect serotonin-fuelled adventure.",
    "Double Fine has a knack for seeing the funny side of mental health while not punching down on those affected. In the original Psychonauts, that line was crossed on occasion – something that Double Fine head Tim Schafer admits to – with the stereotypical depiction of an asylum, among other issues. But with Psychonauts 2 the developer seems to have done its due diligence to ensure that hasn’t happened this time around.",
    "What results is a wonderfully bizarre and poignant sequel. Psychonauts 2 will have you roaring in laughter at a ridiculous pun or dad joke one second, and feel like the most enjoyable therapy session you’ve ever had the next. It’s a lesson in mental health wellbeing, wrapped in a world of memorable characters, psychedelic environments and action-packed gameplay, proving that not every depiction of mental health or mental illness needs to leave you emotionally drained. Instead, it can recharge you.",
    "Psychonauts 2 releases on Xbox Series X/S, Xbox One, PC, PS4, and PS5 via backwards compatibility on August 25, 2021."
  ],
  "headers": {
    "7": "The fragility of the mind",
    "12": "A brilliant balance"
  },
  "links": {}
}