{
  "source": "https://www.techradar.com/news/sony-xperia-1-iii-video-leaves-very-little-to-the-imagination",
  "title": "This revealing Sony Xperia 1 III video might spoil the surprise at its eventual launch",
  "category": "phones",
  "updated": "2021-02-04T16:05:28Z",
  "author": "tom-bedford",
  "summary": "What's left to see?",
  "article": [
    "We've heard a few Sony Xperia 1 III leaks now and there's little at the phone's eventual launch event that could surprise us (well, unless the leaks and rumors all turn out to be wrong). Adding to that pile of leaks is a new video showing the upcoming handset in full.",
    "This new video comes from leaker Steve Hemmerstoffer, posted on his Voice (a website where leakers can show off their details). It's not a leak from Sony in itself, but was created based on previous rumors, so it gives us a good idea of what to expect from the upcoming Xperia 1 III.",
    "If you've been keeping up with the Sony Xperia 1 III rumors, you'll know there isn't anything hugely new in this video.",
    "On the front we see a large screen and a front-facing camera housed in a notch, on the back there's a big three-camera array, and there's also a USB-C port and 3.5mm headphone jack present and accounted for.",
    "While this Sony Xperia 1 III video doesn't bring anything new, it does collate lots of previous rumors in one place. It also gives us a sense of the size of the phone, as you can use the size of both ports (the sizes of which are standards) to compare it to your own handset.",
    "We've heard lots of Sony Xperia 1 III leaks and, for the most part, it sounds like an iterative update on the Xperia 1 II. There don't seem to be any huge changes, and instead there are tweaks that improve on the older phone.",
    "It seems the big news at the Sony Xperia 1 III launch, whenever that is, could be the simultaneous launch of the Sony Xperia Compact, an anticipated small-body phone Sony is rumored to be working on.",
    "Still, perhaps Sony has some new software or camera tricks we haven't heard that make the Xperia 1 III a worthy buy. Possibly instead it's going the Samsung Galaxy S21 route of offering a similar phone to its predecessor but with a lower price tag?",
    "We'll have to wait and see, and the next Sony phone's launch is expected to crop up in the coming months so stay tuned for that."
  ],
  "headers": {
    "5": "An iterative update"
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Voice": "https://www.voice.com/post/@onleaks/exclusive-360-spinning-view-at-the-gorgeous-sony-xperia-1-iii-1612349150-466744105",
    "Sony Xperia 1 III leaks": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Sony Xperia Compact": "https://www.techradar.com/reviews/sony-xperia-5-iii",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}