{
  "source": "https://www.techradar.com/news/us-ecommerce-could-be-a-trillion-dollar-market-by-2022",
  "title": "US ecommerce could be a trillion-dollar market by 2022",
  "category": "computing",
  "updated": "2021-03-17T00:43:48Z",
  "author": "anthony-spadafora",
  "summary": "Pandemic led to a 20 percent boost in online shopping in the US",
  "article": [
    "Next year could be the first trillion-dollar year for ecommerce in the US as the pandemic has changed how consumers shop according to a new report from Adobe.",
    "To compile its 2020 Digital Economy Index, the firm analyzed data from Adobe Analytics which covers over 1tn visits to retail sites in the US as well as over 100m SKUs in 18 product categories to show how online shopping increased in the country from March of last year through February 2021.",
    "Over the course of last year, consumers in the US spent a total of $844bn online and during the pandemic, online shopping saw a huge boost of $183bn. This additional $183bn was nearly the size of the last holiday shopping season when US shoppers spent 188.2bn online between November and December of last year.",
    "At the same time, this additional spending during the pandemic produced a “rare step change in online spending, equivalent to a 20% boost”, according to Adobe.",
    "At current growth rates, Adobe expects the 2021 calendar year to bring in somewhere between $850bn and $930bn. However, the company expects 2022 to be the first trillion-dollar year for ecommerce in the US.",
    "So far in the first two months of 2021, US consumers spent $121 billion online which represents 34 percent growth year over year. One reason consumers are spending more online this year is due to the fact that more businesses are offering them the option to buy now, pay later. For instance, last September PayPal introduced a new short-term installment offering for customers in the US called Pay in 4 that allows them to pay for purchases between $30 and $600 over a six-week period in four installments.",
    "Perhaps a downside to increased online spending in the US is how branded shopping days such as Memorial Day, Labor Day, President's Day and others lost importance. According to Adobe, Memorial Day 2020 commerce grew 20 percent less than other days that week resulting in $32m less revenue while the five days between Thanksgiving and Cyber Monday 2020 contributed nine percent less to revenue share during the holiday season, equivalent to $600m.",
    "Another new trend that emerged during the pandemic that is likely here to stay is buy-online-pickup-in-store (BOPIS) or curbside shopping. In a survey of more than 1,000 US consumers conducted by Adobe, 30 percent said they prefer curbside/in-store pickup over standard delivery options.",
    "Only time will tell whether the US ecommerce market will continue to grow but even with vaccines now being widely distributed, consumers have grown accustomed to shopping online or using curbside to avoid the crowds.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "Ecommerce is here to stay"
  },
  "links": {
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Adobe": "https://www.techradar.com/news/adobe-is-adding-ai-smarts-to-its-marketing-software",
    "2020 Digital Economy Index": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-8910457395244093000&url=https%3A%2F%2Fwww.adobe.com%2Fexperience-cloud%2Fdigital-insights%2Fdigital-economy-index.html",
    "online shopping": "https://www.techradar.com/best/best-shopping-cart-software/news/an-alternative-history-of-online-shopping",
    "buy now, pay later": "https://www.techradar.com/news/buy-now-pay-later-businesses-facing-stronger-clampdown-on-credit-terms",
    "PayPal": "https://www.techradar.com/news/paypal-now-allows-bitcoin-purchase-and-selling",
    "Pay in 4": "https://www.techradar.com/news/paypal-launches-installment-payment-plans",
    "BOPIS": "https://www.techradar.com/news/how-a-pos-system-can-help-you-manage-your-inventory",
    "TechCrunch": "https://techcrunch.com/2021/03/15/u-s-e-commerce-on-track-for-its-first-1-trillion-year-by-2022-due-to-lasting-pandemic-impacts/"
  }
}