{
  "source": "https://www.techradar.com/news/bitmain-teases-monstrous-new-crypto-mining-rig-especially-for-ethereum",
  "title": "Bitmain teases monstrous new crypto mining rig, especially for Ethereum",
  "category": "computing",
  "updated": "2021-05-06T11:03:15.295Z",
  "author": "mayank-sharma",
  "summary": "But no word on availability or pricing yet",
  "article": [
    "Chinese mining firm Bitmain has released a teaser of the company's upcoming Antminer E9 Ethereum mining rig, built around a new application-specific integrated circuit (ASIC) chip.",
    "The Antminer E9 reportedly delivers a hash rate of up to 3 GH/s when mining Ether cryptocurrency. In its teaser, Bitmain claims this is equivalent to the hash rate of 32 GeForce RTX 3080 graphics cards.",
    "Assuming that a single GeForce RTX 3080 has a hash rate of around 95 MH/s, HotHardware extrapolates that calculation to equate the performance of the Antminer E9 to that of 25 GeForce RTX 3090 graphics cards, each of which dishes around 120 MH/s.",
    "Many observers rate the Linzhi “Phoenix” ASIC miner as the current fastest Ethereum miner. If Bitmain manages to deliver the figures it promises in the teaser, it’ll slightly edge out the 2.6 GH/s hash rate of the Phoenix.",
    "More importantly though, the Bitmain Antminer E9 draws up to 2557 watts together with a power efficiency of 0.85 J/M, which could make it nearly fifteen percent more efficient than the Phoenix, which guzzles about 3000 watts.",
    "While Bitmain hasn’t shared any details about the availability or the pricing of the Antminer E9, rest assured it’ll cost quite a penny. While the Phoenix sells for $11,300 and $13,700, the word on Twitter is that the Antminer E9 would cost somewhere $25,000 and $30,000.",
    "HotHardware again breaks out back-of-the-envelope calculations to suggest that, given the current prices of graphics cards, particularly the crypto-favorite GeForce RTX 3080, the rumored price tag would still be an “absolute bargain\".",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies.",
    "Via HotHardware"
  ],
  "headers": {
    "3": "No word on availability"
  },
  "links": {
    "Bitmain": "https://www.techradar.com/best/asic-devices",
    "mining rig": "https://www.techradar.com/best/mining-rigs",
    "application-specific integrated circuit (ASIC)": "https://www.techradar.com/best/asic-devices",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "HotHardware": "https://hothardware.com/news/bitmain-antminer-e9-ethereum-mining-asic-packs-power-of-32-geforce-rtx-3080-gpus"
  }
}