{
  "source": "https://www.techradar.com/news/heres-what-nvidias-new-cryptocurrency-mining-cards-might-look-like",
  "title": "Here's what Nvidia's new cryptocurrency mining cards might look like",
  "category": "computing",
  "updated": "2021-03-11T21:23:14Z",
  "author": "bill-thomas",
  "summary": "Images of a Gigabyte Nvidia CMP 30HX card have leaked",
  "article": [
    "When Nvidia announced the Nvidia GeForce RTX 3060, it said that not only would it have limitations in place for Ethereum mining, but that Team Green would be releasing specialized GPU boards for mining – and images of one of those boards has leaked out.",
    "You can find the pictures over at Videocardz, along with the rumored specs of the cards. The Gigabyte CMP 30HX that's pictured over there isn't just an RTX 3080 without display output. Instead, it's based on the TU116 GPU, which is found in the Nvidia GeForce GTX 1650 – so it's not exactly a powerhouse.",
    "Still, while the GTX 1650 was never the best graphics card in Nvidia's lineup, the 30HX, according to the rumored specifications on Videocardz, will provide an Ethereum Hash Rate of 26MH/s. However, if the images of this Gigabyte card are accurate, it looks like it will come with an extremely robust cooler, that extends further than the PCB, which will do an excellent job of keeping the card cool during intense mining workloads.",
    "We still don't know when these crypto-focused graphics cards are coming, but hopefully it makes it easier for people to get their hands on cheaper versions of Nvidia Ampere graphics cards. The 26MH/s hashrate of this rumored CMP 30HX likely won't put a dent in the demand for the RTX 3080 or RTX 3090, but it might make more mainstream cards more available."
  ],
  "headers": {},
  "links": {
    "Nvidia GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "Videocardz": "https://videocardz.com/newz/first-nvidia-cmp-crypto-mining-processor-has-been-pictured",
    "best graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}