{
  "source": "https://www.techradar.com/news/how-to-watch-rutherford-falls-online-stream-new-peacock-comedy-from-anywhere",
  "title": "How to watch Rutherford Falls online: stream new Peacock comedy from anywhere",
  "category": "computing",
  "updated": "2021-04-22T10:06:32Z",
  "author": "kevin-lynch",
  "summary": "The Office's Ed Helms heads up the cast in this new sitcom",
  "article": [
    "Boasting the talents of The Good Place, Brooklyn Nine-Nine, The Office US and Parks and Recreation creator Michael Schur, new Peacock exclusive Rutherford Falls looks like it has all the credentials for being a comedy insta-hit.",
    "Follow our guide as we explain how to watch Rutherford Falls online and stream the new Peacock sitcom from anywhere in the world today.",
    "The show teams up Schur once more with fellow Office cast member and co-creator Ed Helms, who takes the lead role as Nathan Rutherford, a descendant of the man the small town in upstate New York was named after.",
    "Proud of the family legacy, Nathan runs tours educating the public of his family's history.",
    "But things begin to unravel for Nathan when a campaign is launched by the city's mayor and its citizens for a statue of his ancestor Lawrence Rutherford to be removed.",
    "Amid a reassessment of Larry's treatment of the local Native American community, Nathan battles awkwardly to preserve his family's history and the \"Big Larry\" sculpture while also trying to save face.",
    "With what is said to be one of the latest indigenous-staffed writers’ rooms on US television behind it, the show looks set to confront the heavy subject of American colonisation while somehow maintaining a light enough tone to work as a primetime comedy.",
    "Read on as we explain how to watch Rutherford Falls and stream the new comedy show online with Peacock today.",
    "Heading abroad again now that global travel restrictions are easing? Then trying to tune into Peacock like you would from home is likely going to be impossible because of geo-blocking.",
    "Fortunately, there is a solution in the form of a VPN. This nifty bit of software changes your IP address so that you can access all the content you normally would at home, only from anywhere in the world.",
    "Use a VPN to watch Rutherford Falls online from anywhere"
  ],
  "headers": {
    "8": "How to watch Rutherford Falls from outside your country",
    "11": "How to watch Rutherford Falls: stream online in Austraia"
  },
  "links": {
    "Peacock": "https://www.techradar.com/news/peacock-tv-how-to-watch-for-free-cost-devices-shows-movies-and-more",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}