{
  "source": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers",
  "title": "Gran Turismo 7 release date, news, cars, trailers and what we want to see",
  "category": "gaming",
  "updated": "2021-12-08T18:24:07Z",
  "author": "hamish-hector",
  "summary": "Will Gran Turismo 7 drive into pole position?",
  "article": [
    "Gran Turismo 7, Sony's premier racing sim series, is coming to PS5 and PS4 on March 4, 2022.",
    "The latest game in the long-running Gran Turismo series is set to be the best yet thanks to the power of the PS5, which should make the game feel even more realistic than ever before. Players will have the opportunity to hone their skills in single-player races, then head online to challenge the best of the best in multiplayer matches.",
    "Gran Turismo was originally believed to be a PS5 exclusive headed to the console in 2021, but it will also be coming to the PS4. Delays caused by the coronavirus pandemic mean the game missed its initial 2021 release window.",
    "Multiple rumors suggested a PS4 release was incoming and then Sony accidentally revealed it in response to outrage about Horizon Forbidden West's PS4 to PS5 upgrade policy. At that time, Sony said that PS4 players of Gran Turismo 7 would be able to upgrade to the PS5 edition with a $10 / £10 digital purchase, which will still be the case.",
    "Read on for everything we currently know about GT7 and what improvements we hope the game makes.",
    "[Update: A recent trailer has offered us a brand new look at Gran Turismo 7. Watch it for yourself below.]",
    "Gran Turismo 7 is set to be released on March 4, 2022. The announcement was made during Sony's PlayStation Showcase 2021. The game missed its initial release window of 2021 due to the coronavirus pandemic impacting development, and it's also set to come to PS4 as well as PS5.",
    "In an interview with GQ Magazine, Sony Interactive Entertainment CEO Jim Ryan was asked whether GT7 was still set to release in 2021, only for a Sony PR representative to step in and reveal that Gran Turismo 7 has been impacted by Covid-related production challenges, and will therefore release in 2022.",
    "\"With the ongoing pandemic, it's a dynamic and changing situation and some critical aspects of game production have been slowed over the past several months,\" the representative said. \"We'll share more specifics on GT7's release date when available.\"",
    "New gameplay at the Deep Forest Raceway",
    "Sony has released a fresh look at Gran Turismo 7 with a cockpit-view PS5 gameplay trailer set on the Deep Forest Raceway, a classic, fan favorite circuit from the series.",
    "Porsche Vision GT",
    "Polyphony Digital has unveiled the Porsche Vision GT, a virtual car exclusively designed for Gran Turismo 7. No exact specifications have been revealed for the car just yet, but you can watch a presentation from Porsche which goes over some of the design decisions behind it. You can also watch the unveiling trailer below:",
    "Gran Turismo 7 - Tracks (Behind the Scenes)",
    "In a new behind the scenes video for Gran Turismo 7, Kazunori Yamauchi discusses the game’s tracks and what the studio has put into making them as realistic as possible. There’s no full track list confirmation or anything like that in here but it does offer an interesting look at lighting conditions and dynamic weather.",
    "Gran Turismo 7 - Tunes (Behind The Scenes) Polyphony Digital's CEO Kazunori Yamauchi is back again to discuss the pleasure of tuning and customizing cars. Tuning a car can have a dramatic impact on how a car performs, looks, and feels when out on the road. GT7 will have the most number of parts for tuning in the series' history, so you should be able to get the exact setup you desire.",
    "Gran Turismo 7 - Livery (Behind The Scenes) In the latest trailer for GT7, Polyphony Digital's CEO Kazunori Yamauchi discusses the importance of liveries in the racing world, and how they can turn a blank canvas into a medium of expression. Usability has been improved in GT7, so it should be easier to create more custom car designs than ever before.",
    "Gran Turismo 7 - Collectors (Behind The Scenes) Join Polyphony Digital's CEO Kazunori Yamauchi in the latest trailer for GT7 as he explains what it means to be a car collector. Check it out below.",
    "Gran Turismo 7 x Porsche - first look If you're a fan of Porsche, you'll be pleased to know that a wide selection of the German manufacturer's car will be available in Gran Turismo 7, including the 917 Living Legend concept car, which pays homage to the original 24 Hours of Le Mans-winning race car.",
    "Release date trailer",
    "Sony dropped a new Gran Turismo 7 trailer during its PlayStation Showcase 2021 event, which showed off the game's cars, tracks, modification system and so much more. Most importantly, it gave us a solid release date for the game: March 4, 2022. You can check it out below:",
    "Announcement trailer",
    "A 3-minute reveal trailer for Gran Turismo was shown back at Sony's PS5 game reveal event. We got a good glimpse of Gran Turismo 7, including a peek at the gameplay via a race on the iconic Trial Mountain circuit.",
    "Hopefully, we'll have another chance to learn more about Gran Turismo 7's new features, such as the GT Cafe mode shown off in the game's menu, before it releases later this year.",
    "Official wheel unveiled",
    "Fanatec has revealed the official racing wheel for Gran Turismo 7 and, with prices starting at $699.95 / €699.95, it’ll cost you more than the PS5 you’ll play the game on.",
    "The Gran Turismo DD Pro from Fanatec is a direct drive steering wheel which uses force feedback technology for a more realistic, next-gen driving experience when you play. According to Fanatec, the wheel was designed by Gran Turismo 7’s development studio, Polyphony Digital, especially for the game and the bundle comes with the wheel base, steering wheel, and pedals. The wheel is compatible with PS4, PS5 and PC. Pre-orders for a March 2022 delivery are open now.",
    "Most of Gran Turismo 7 is online-only",
    "Most of Gran Turismo 7, including the game's campaign mode, will require an internet connection to play.",
    "Speaking to Eurogamer, series creator Kazunori Yamauchi that an online connection is required to prevent players from cheating.",
    "\"The requirement for the online connection isn't specific to the Cafe per se,\" Yamauchi said. \"It's just to prevent cheating overall from people trying to modify the save data, so that's the reason for the online connection.\" The only mode that won't require an online connection, in fact, is the game's arcade mode as it doesn't use save data.",
    "Gran Turismo 7 pre-order and 25th Anniversary Edition bonuses revealed Sony has detailed the pre-order bonuses for Gran Turismo 7, as well as a 25th Anniversary Edition of the game. Anyone who pre-orders the game will receive the following items: Toyota Castrol TOM’S Supra, Mazda RX-VISION GT3 Concept (Stealth), Porsche 917K Living Legend and 100,000 in-game Credit (CR).",
    "Those who opt for the 25th Anniversary Edition of Gran Turismo 7 will get a limited-edition SteelBook case, 1,100,000 in-game credit, Toyota GR Yaris with country-specific livery, 30 Manufacturer / Partner Avatars, the Music of Gran Turismo Official Soundtrack as well as the same cars listed above.",
    "Dynamic weather returns Gran Turismo 7's dynamic weather and time system will see both moving in \"real-time\", with the weather having an effect on driving conditions and the time simulation allowing you to race from morning to noon.",
    "The feature was missing from GT7's predecessor, Gran Turismo Sport, but returns along with an improved damage model.",
    "Crossplay confirmed Gran Turismo 7 will allow for crossplay between PS5 and PS4, the series creator has confirmed.",
    "In an interview with Eurogamer, Gran Turismo creator Kazunori Yamauchi confirmed that the next entry in the veteran racing series will allow PS4 and PS5 players to race against one another.",
    "GT7 gets a release date",
    "Gran Turismo 7 is set to launch on March 4, 2022. The announcement was made during Sony's PlayStation Showcase event via a brand new trailer.",
    "A PS4 version is confirmed",
    "After months of rumors that the game wouldn't be exclusive to the PS5, Sony accidentally confirmed that Gran Turismo 7 would have a PS4 version.",
    "In response to fan outrage about Horizon Forbidden West's confusing PS4 to PS5 upgrade policy Sony backpedaled by offering a free upgrade on all versions of Horizon but made it clear that \"moving forward, PlayStation first-party exclusive cross-gen titles will offer a $10 digital upgrade option from PS4 to PS5.\"",
    "In that same statement, Sony president Jim Ryan specifically namechecked God of War Ragnarok and Gran Turismo 7 as examples of games that would be part of this new upgrade policy.",
    "It looks like there could be a beta eventually",
    "It looks likely that Gran Turismo 7 will get an open beta prior to its release after GTPlanet spotted a mention of one on the Experience PlayStation site. According to GT Sport, there’s a way to navigate the Experience PlayStation section of the official PlayStation site which leads to access to a way to “unlock the Beta code early”.",
    "The codes given are just placeholders and can’t be redeemed but it does suggest plans for a public event that isn’t ready to be revealed. PlayStation has, of course, yet to reveal any official plans or details around a beta but it wouldn’t be too much of a surprise if something was done given there’s previously been a beta for GT Sport.",
    "PSVR 2?",
    "Sony has announced that it will release the second iteration of its PSVR headset, that we're calling PSVR 2. This announcement raises questions of whether or not Gran Turismo 7 will support the new technology. Following the success of Gran Turismo Sport on PSVR, it seems quite possible. That said, nothing has been confirmed by Sony just yet. But there are positive signs. In June 2021, Sony said that we should expect \"experiences synonymous with PlayStation\" on PSVR 2, which suggests titles that lean into Sony's back catalog of exclusive franchises, such as Gran Turismo.",
    "Going slightly further back in time to 2019, in a roundtable interview with GT Planet, Gran Turismo series creator Kazunori Yamauchi revealed that, when it comes to harnessing the power of next-gen consoles, Polyphony Digital is interested in VR.",
    "“The first thing that’s going to be affected by more power is VR,” Yamauchi told GT Planet. “I don’t think that there’s anything else that requires that much processing power. I really like VR; I’m one to believe in the possibilities of it, and it’s very suited for a driving game.”",
    "“VR is something that really depends on the evolution of GPU power, and the hardware for it, like display devices even. It’s something where you can never have enough computing power; there’s always going to be that hardware limit, and that limit is never going to be high enough for us! Obviously, that’s going to gradually improve over time and we’ll make sure to follow that.”",
    "The fact that PSVR 2 will bring the technology forward does make it look promising that Gran Turismo 7 could have some kind of VR support.",
    "No E3 2021 appearance",
    "As expected, Gran Turismo 7 was absent from E3 2021 after Sony confirmed it wouldn't be attending the entirely online show.",
    "This isn't, of course, the first time that Sony has skipped E3. The company missed out E3 2019 entirely and last year it opted to have its own State of Play stream. Given E3 2021 is all digital anyway this year, it’s possible Sony sees more benefits in doing its own online event again or perhaps even doing a dedicated stream like its May Horizon Forbidden West stream.",
    "“No concessions” on detail",
    "Polyphony CEO, Kazunori Yamauchi, has emphasized the studio’s attention to detail while speaking at the FIA Gran Turismo Championships in December 2020 (via VGC).",
    "“We always pursue the best at Polyphony Digital,” Yamauchi said. “We don’t want to make concessions on anything. We want to deliver the best to everyone. And this is no longer just my thinking, but it’s the mindset of all 200 or so staff at our company.",
    "“They say in Japan that ‘divinity comes to reside in the details and it’s so true. How much attention you pay to the fine details, how to perfect it, hone it to perfection, and applying an incredible amount of attention to this, is our production style.”",
    "This bodes well for Gran Turismo 7, though it also goes some way to explaining why the game's release date shifted from 2021 to 2022.",
    "Making the most of PS5",
    "It's looking likely that Gran Turismo 7 will release on PS4 but that won't stop the game from taking full advantage of the PS5’s exclusive features such as haptic feedback and adaptive triggers on the DualSense controller, a super-fast SSD, and 3D audio.",
    "Speaking to The Guardian, Sony executive vice-president Simon Rutter said he believes that Gran Turismo 7 will be a showcase for the console, and detailed exactly how its realistic racing game will wow players with the PS5’s new technology.",
    "First of all, loading times will be seriously sped up thanks to the PS5’s SSD. “The loading times will be next to nothing compared to what they have been in the past,” said Rutter, which will come as a huge relief to many Gran Turismo fans, as load times have always been painfully long.",
    "Rutter also said that when it comes to 3D audio, players can expect an immersive experience. “Sitting in the cockpit, the 3D audio allows you to hear the thunderous roar of a Ferrari behind you or in front of you, and you can recognize the difference between that and the engine noise of a Maserati.”",
    "Finally, when it comes to the DualSense controller, Rutter had this to say: “Driving the car using the DualSense controller, you’ll have a different feeling in your hands from the smooth undulating tarmac of a racetrack, compared to the gritty sensation on a gravel track,” adding, “Pressing a soft accelerator will feel very different than pressing on a stiff brake pedal or gear paddle.”",
    "Meaningful damage modeling This hope precedes every Gran Turismo entry and Gran Turismo 7 is no exception. The franchise seems almost allergic to damage-modeling, preferring that its beautifully rendered cars maintain a factory clean sheen – but we want to see it. If we careen off-track and smash into a wall at many miles per hour, we’d expect our vehicle to be pretty banged up and not just sporting a few minor scratches.",
    "This level of realism has been captured in many other modern racing sims, and with the PS5 boasting some seriously powerful next-gen hardware, it’s time that Gran Turismo put it to good use.",
    "Better AI Another long-standing issue with Gran Turismo games is the AI. A race’s challenge has either been far too easy or too heavily choreographed depending on the difficultly level, so it's time for Gran Turismo 7 to finally bring some realism to its computer-controller competitors.",
    "We want to see AI drivers react to our actions and learn to match our skills behind the wheel. Earning better vehicles should provide a meaningful reward in improved race performance, but not at the expense of leaving the competition behind in the dust. We hope that Gran Turismo 7’s drivers will give us a run for our money, then.",
    "Better offline content Gran Turismo Sport, the last installment in the series, was often criticized for its lack of quality offline content. Whether it was because of server maintenance or your own connection, the game would only let you play Arcade Mode, which blocked any meaningful progression which could have been made when offline. Hopefully Gran Turismo 7 improves its offline capabilities.",
    "Tuning Tuning, a feature missing from Gran Turismo Sport, is set to make a return in Gran Turismo 7. Players will be able to spend their in-game credits in order to unlock upgrades and make changes to their cars to better suit certain tracks and races.",
    "This feature can also be used to make improvements to a car you've fallen in love with to keep it competitively viable for as long as possible.",
    "Career Mode It might be under the new name \"Campaign Mode\" as Kazunori Yamuchi, CEO of Polyphony Digital, put it, but let's just call a spade a spade. This single-player content can be a great way to get to grips with Gran Turismo's core driving gameplay, giving you a chance to try out different vehicles in different challenges. We'll have to wait and see how Gran Turismo 7's Campaign Mode pans out."
  ],
  "headers": {
    "6": "Gran Turismo 7 release date",
    "9": "Gran Turismo 7 trailers",
    "24": "Gran Turismo 7 news and rumors",
    "66": "What we want to see in Gran Turismo 7",
    "71": "Returning features in Gran Turismo 7"
  },
  "links": {
    "Horizon Forbidden West's": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PlayStation Showcase 2021": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "GQ Magazine,": "https://www.gq-magazine.co.uk/culture/article/playstation-vr-jim-ryan-interview-2021",
    "watch a presentation": "https://www.youtube.com/watch?v=FLakYHkieck",
    "open now": "https://gtddpro.fanatec.com/",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-09-16-the-big-gran-turismo-7-interview",
    "rumors that the game wouldn't be exclusive to the PS5": "https://www.techradar.com/news/gran-turismo-7-likely-wont-be-ps5-exclusive-sony-reveals",
    "$10 digital upgrade option from PS4 to PS5": "https://www.techradar.com/news/prepare-to-pay-a-god-of-war-2-and-gran-turismo-7-ps5-upgrade-fee",
    "GTPlanet spotted": "https://www.gtplanet.net/gran-turismo-7-beta-test-appears-on-playstation-website/",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "said": "https://www.techradar.com/news/psvr-2-games-will-include-familiar-franchises-synonymous-with-playstation",
    "GT Planet": "https://www.gtplanet.net/next-gran-turismo-will-be-a-combination-of-past-present-and-future/",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "May Horizon Forbidden West stream": "https://www.techradar.com/news/horizon-forbidden-west-gameplay-demo-shows-us-a-grappling-hook-glider-and-more",
    "VGC": "https://www.videogameschronicle.com/news/gran-turismo-7-head-claims-hell-make-no-concessions-on-detail-for-ps5/",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "3D audio": "https://www.techradar.com/news/how-the-ps5s-3d-audio-chip-could-transform-your-gaming-experience",
    "The Guardian": "https://www.theguardian.com/games/2020/jun/16/exclusive-games-playstation-5-sony"
  }
}