{
  "source": "https://www.techradar.com/news/iphone-12-pro-max-vs-samsung-galaxy-note-20-ultra-old-rivals-get-ultra-competitive",
  "title": "iPhone 12 Pro Max vs Samsung Galaxy Note 20 Ultra: old rivals get ultra-competitive",
  "category": "phones",
  "updated": "2021-07-31T12:00:41Z",
  "author": "jon-mundy",
  "summary": "Two 2020 super-phones",
  "article": [
    "If spending upwards of £1,000 on the latest premium smartphone sounds like a tough sell, then what about once those premium smartphones are no longer as fresh as they used to be?",
    "While we absolutely love the iPhone 12 Pro Max and the Samsung Galaxy Note 20 Ultra, both devices rolled out in 2020. That makes them relatively long in the tooth in smartphone terms, which makes a direct comparison all the more fascinating.",
    "There was little to separate these two titanic phones when they first hit the market, with both securing 9 out of 10 ‘Recommended’ awards from us. So how do they stack up to one another now that they’re a little more seasoned?",
    "The iPhone 12 Pro Max landed with a bang on November 13, with pricing starting at $1,099 / £1,099 / AU$1,849 for the 128GB model. That leaps up to $1,199 / £1,199 / AU$2,019 for 256GB, and $1,399 / £1,399 / AU$2,369 for 512GB.",
    "The Samsung Galaxy Note 20 Ultra hit shops several months earlier on August 21. The entry-level 128GB model initially set you back $1,299 over in the US, whereas in the UK and Australia a 256GB variant cost £1,179 / AU$1,849. In each territory, a 512GB model bears the RRP of $1,449 / £1,279 / AU$2,199.",
    "That launch was quite a long time ago now, and while Apple’s prices remain consistent, you may just be able to find a nice discount on the Samsung. Thanks to its unique status and enduring quality, however, the Galaxy Note 20 Ultra has retained its value relatively well.",
    "The iPhone 12 Pro Max and the Samsung Galaxy Note 20 Ultra were arguably the two most iconic smartphone designs of late 2020. They’re both still gorgeous specimens today.",
    "With the iPhone 12 Pro Max, Apple ditched the overfamiliar curves and went with a dramatically flat-edged and sharp-cornered look. We haven’t seen the likes since the days of the original iPhone SE.",
    "While that look applies across the whole iPhone 12 range, only the Pro models get you a shiny stainless steel rim. The phone is fronted by a unique Ceramic Shield, which provides a four-fold increase in drop protection over bog standard display glass, at least according to Apple.",
    "The Samsung Galaxy Note 20 Ultra is arguably even more handsome than the iPhone 12 Pro Max, at least in its stunning Mystic Bronze tone. It’s a little more generic, but the matte back and shiny rim - tapering to a fine point on the edges and flattening out on the top and bottom - give the phone a real sense of class.",
    "We also love the boldness of the Galaxy Note 20 Ultra’s sticky-outy camera module, despite the fact that you can’t lie the phone down flat as a result.",
    "These are both very big phones, though the proportions are slightly different. At 160.8 x 78.1mm, the iPhone 12 Pro Max is shorter yet wider than the 164.8 x 77.2mm Samsung Galaxy Note 20 Ultra. Similarly, while Apple’s phone is a fair bit thinner at 7.4mm (versus 8.1mm), it’s also quite a bit heavier at 228g (versus 208g).",
    "Apple’s distinctive display notch is definitely more intrusive than Samsung’s tiny central hole-punch, but it also supplies Face ID. With the Samsung, you have to make do with a slightly sluggish (but very secure) ultrasonic in-display fingerprint sensor to gain access.",
    "All in all, the Galaxy Note 20 Ultra feels a little more wieldy and manageable than the iPhone 12 Pro Max, which gives it the slight edge in design terms. But make no mistake, these are two design icons that haven’t suffered with the arrival of fresher rivals.",
    "If the design category is a close-run thing, then Samsung wins a clearer victory when it comes to display technology. The Galaxy Note 20 Ultra’s screen was the best of its time at launch, and it still rocks.",
    "While both screens are large, bright, and sharp OLEDs with vibrant colors, the Galaxy Note 20 Ultra wins on the details.",
    "At 6.9-inches, it’s larger than the iPhone 12 Pro Max’s 6.7-inch panel. It also gets brighter to the tune of 1,500 nits, as opposed to the iPhone’s 1,200 nits.",
    "The Galaxy Note 20 Ultra display can also hit an elevated 120Hz refresh rate, while the iPhone 12 Pro Max is stuck at a disappointing 60Hz. While it’s hitting that super-fast refresh rate, however, the Galaxy Note 20 Ultra can only attain an FHD+ resolution. The iPhone 12 Pro Max, by contrast, outputs at a consistent 2778 x 1284.",
    "Of course, if you drop the Note 20 Ultra’s display to 60Hz, you’ll be able to up the pixel count to a massive QHD (1440 x 3088), so it’s still advantage Samsung.",
    "The Note 20 Ultra’s slightly curved display isn’t totally distortion-free, unlike the perfectly flat iPhone. But as we’ve already mentioned, its selfie camera is much less disruptive than the iPhone 12 Pro Max’s Face ID notch.",
    "These were two of the best camera offerings of 2020, and they continue to be competitive even with the arrival of the 2021 crowd.",
    "Both phones offer accomplished triple camera set-ups, but they have subtly different areas of expertise.",
    "The iPhone 12 Pro Max offers a balanced collection of three 12MP cameras covering wide, ultra-wide, and telephoto shots. The main sensor is the real strong point here, with a 47% bigger sensor size compared to the rest of the iPhone 12 phones.",
    "It’s not as big as the Galaxy Note 20 Ultra’s, though. As is Samsung’s wont, it brings out the big hardware guns with a meaty 1/1.33\" 108MP wide sensor.",
    "The iPhone hits right back with a wider f/1.6 aperture (the Samsung’s is f/1.8), sensor-shift stabilization (which is superior to the Samsung’s OIS), and a LiDAR sensor for sharp low light autofocus. Add in Apple’s unmatched Night Mode algorithms, and this is a camera system that can really excel even in limited lighting.",
    "Indeed, nighttime is where the iPhone 12 Pro Max really shows its metal, as it can employ Night mode across all of its cameras - even the selfie camera.",
    "Where the Samsung Galaxy Note 20 Ultra camera excels is with its zoom capabilities. The iPhone 12 Pro Max might pack a 2.5x optical zoom - the largest zoom of any iPhone - but the Samsung tops it with its 5x optical zoom capabilities. Ignore the claims of a 50x hybrid zoom - they look horrendous. Still, the Galaxy Note 20 Ultra can certainly take decent 10x hybrid shots. The iPhone 12 Pro Max can’t even get close in terms of detail and quality.",
    "Hardware differences aside, much of the contrast here comes down to the color science employed by Apple and Samsung, and which approach you prefer the look of. Apple traditionally adopts a more naturalistic tone that more closely mirrors what you’re actually seeing. Samsung typically punches colors up way more, presenting a more exaggerated and Insta-worthy take on reality.",
    "Apple’s software really is an advantage here. It employs some impressive software tricks, including Smart HDR 3 and Deep Fusion for smarter shot selection and better contrast. Its ProRAW function employs the super-detailed RAW format without sacrificing the computational improvements of the JPEG format.",
    "When it comes to video, Apple continues to rule the roost. While it only gets to 4K video at 60fps, and the Galaxy Note 20 Ultra can go to 8K at 24fps, Apple’s footage simply looks better and more stable.",
    "Overall, the iPhone 12 Pro Max has the better, more complete camera system. It’s also the best that Apple offers, whereas Samsung has one-upped itself with the more recent Samsung Galaxy S21 Ultra. But really, you’re not going to be disappointed with either phone’s camera chops.",
    "It’s not even close when it comes to a straight performance face-off between these two phones. The iPhone 12 Pro Max blitzes the Samsung Galaxy Note 20 Ultra, though that might not matter quite as much as you’d think.",
    "A large part of that performance gap comes down to Apple’s imperious custom chip operation, which means that the latest Apple A-series silicon obliterates the off-the-shelf opposition. Sure enough, the A14 Bionic that powers the iPhone 12 Pro Max is an absolute beast.",
    "It might only be backed by 6GB of RAM (the Samsung has 12GB), but that’s neither here nor there considering the differences between iOS and Android.",
    "But there’s a double whammy at play here. Just as Apple’s own chips are very fast, Samsung’s own Exynos chips have rather fallen behind the leading pack of late. And it’s the Exynos 990 that powers the global model of the Samsung Galaxy Note 20 Ultra.",
    "Our readers in the US and China have the benefit of getting a Galaxy Note 20 Ultra with a Snapdragon 865 Plus from Qualcomm, which is a fair bit faster and more efficient than the Exynos. But even then, it’s not as fast as the Apple A14 Bionic.",
    "What kind of difference are we talking about? The iPhone 12 Pro Max gets an average Geekbench 5 multi-core score of 4106, and a single-core score of 1591. A fully up-to-date Samsung Galaxy Note 20 Ultra (Exynos model) scores 2748 and 900 respectively.",
    "But we suggested at the outset that this performance gap might not matter all that much. Why is that?",
    "Quite simply because in general and even advanced use, there’s very little noticeable difference between these two phones. Both feel fast and fluid in general navigation, and in fact the Samsung arguably feels slightly nippier with that 120Hz display.",
    "3D games, too, run at full whack on both devices. Yes, the iPhone 12 Pro Max is capable of running the most demanding games at superior frame rates, and with more visual effects. But few games will really be fully optimized for this - at least right now.",
    "The future is a different matter, and the iPhone 12 Pro Max is certainly the more forward-looking phone of the two. Not only does it have more performance headroom, but Apple’s peerless software support will keep its device relevant for longer.",
    "Indeed, software could prove the deciding factor here for many people. Samsung’s UI has greater potential for customization and tweaking, while Apple’s is cleaner, more uniform, and less cluttered. Google's Play Store is also better populated than the Apple App Store, according to data, though all the big hitters are present on both.",
    "Elsewhere, both phones give you a choice of 128GB, 256GB, or 512GB of storage. Only the Galaxy Note 20 Ultra supplies a microSD slot for expansion purposes, however.",
    "One unique feature of the Samsung Galaxy Note 20 Ultra is the S Pen. Samsung’s stylus slots away nicely into the body of the phone, and grants a point of interaction that the iPhone 12 Pro Max can’t match.",
    "Being able to make hand-written notes and have those transcribed into proper digital text feels magical, as does being able to draw a picture with a full suite of artistic tools at your disposal. You’ll have to invest in a modern iPad and an Apple Pen to experience something similar on iOS.",
    "The Samsung Galaxy Note 20 Ultra has a much larger battery than the iPhone 12 Pro Max. We’re talking 4500 mAh versus 3687 mAh.",
    "But a direct physical comparison will only get you so far. As we’ve already mentioned, iOS and Android use their resources in very difference ways, and Apple’s OS is traditionally far more frugal.",
    "In practical terms, the iPhone 12 Pro Max proves to have the best stamina in the iPhone 12 family. It’s the only one that will last through a full day of intensive usage, even on dodgy mobile networks.",
    "The Samsung Galaxy Note 20 Ultra isn’t as good as its rival, especially with the less efficient Exynos chip, but it’ll still get you all day performance. We would tend to get to the end of a fairly heavy day with 20% left in the tank, and those were days filled with taking photos and videos, and watching YouTube on its large screen.",
    "Neither phone is at the top of the game when it comes to recharging. The iPhone only gives you a cable with no power brick included, and it’ll only support up to 20W wired and 15W wireless. The Galaxy Note 20 Ultra is better, as it supports up to 25W wired charging, and actually includes a power brick in the box. It too can cope with 15W wireless charging.",
    "Both of these massive phones have aged remarkably gracefully. They’re still two of the most striking-looking (and feeling) phones on the market, and the Galaxy Note 20 Ultra’s S Pen facility continues to keep it relevant despite the presence of newer, faster models of phone.",
    "The Samsung also sports a superior display to the iPhone 12 Pro, which really looks a little old hat with a mere 60Hz refresh rate. And we know which phone we’d want in our pockets for those zoomed-in camera shots.",
    "In terms of future prospects, however, we’d have to give the iPhone 12 Pro the edge. It’s much, much faster, and together with Apple’s unmatched legacy support, it’s going to feel that way for years longer than its rival.",
    "While both phones take great pictures, the iPhone 12 Pro Max has superior all-around chops. It takes better videos, and its Night Mode is arguably the best in the business.",
    "Add in superior battery life, and the iPhone 12 Pro would probably stand as the better buy in 2021. But really, both phones have their own unique perks and quirks. It’s a tribute to their enduring quality that we’d happily take either."
  ],
  "headers": {
    "3": "iPhone 12 Pro Max vs Samsung Galaxy Note 20 Ultra price and availability",
    "6": "Design",
    "14": "Display",
    "20": "Camera",
    "31": "Specs and performance",
    "45": "Battery",
    "50": "Takeaway"
  },
  "links": {
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Samsung Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "according to data": "https://www.statista.com/statistics/276623/number-of-apps-available-in-leading-app-stores/"
  }
}