{
  "source": "https://www.techradar.com/news/hearthstone-forges-new-expansion-and-takes-cues-from-world-of-warcraft-with-a-classic-mode",
  "title": "Hearthstone forges new expansion and takes cues from World of Warcraft with a ‘Classic’ mode",
  "category": "computing",
  "updated": "2021-02-20T12:46:59Z",
  "author": "darren-allan",
  "summary": "Forged in the Barrens comes with 135 new cards",
  "article": [
    "Hearthstone revelations have come thick and fast at BlizzCon 2021, with the next expansion being announced – ‘Forged in the Barrens’ – as well as a new ‘Classic’ format that takes the game back to when it was first launched, plus a fresh Hearthstone Mercenaries game mode.",
    "Forged in the Barrens is based on the renown Warcraft zone of the same name, and will bring in some 135 new cards when it arrives in the spring.",
    "The expansion will also introduce ranked spells, which are spells that increase in power (from rank 1 to 3) as the game goes on (when you reach 5 mana crystals and then 10), regardless of whether you’ve actually drawn the card into your hand.",
    "So for example, the Imp Swarm spell initially summons a 3/2 imp (though a single creature doesn’t make much of a swarm), but at 5 mana, it’ll call forth two imps – and when you hit 10 mana, a bunch of three of them.",
    "Blizzard is also introducing a new ‘Frenzy’ keyword, and cards bearing this will have their frenzy ability triggered when damage is first inflicted on them – if they survive the damage, that is (so they need to be one-shotted if something really nasty is going to be triggered, in other words).",
    "Spells will also now be grouped into schools to add further synergies, so for example, the Spirit Healer will add two health to a random minion on your side every time a ‘holy’ spell is cast (for example, the new Desperate Prayer spell, which restores five health to both heroes).",
    "The expansion will also usher in 10 Legendary mercenary minions.",
    "Hearthstone’s ‘Year of the Gryphon’ will also come bristling with a new Core set of 235 cards, replacing the current Basic and Classic cards in Standard (29 of the incoming Core set cards will be new).",
    "Furthermore, the game will get a ‘Classic’ mode as we mentioned at the outset. This will turn back time and give you the Hearthstone experience exactly as it was just after the game was released seven years ago, with 240 original cards all as they were when created (meaning without any tweaks and balancing changes that have since been implemented).",
    "That’ll be quite the nostalgic blast from the past in much the same vein as World of Warcraft Classic.",
    "Finally, there’s a brand new game mode, Hearthstone Mercenaries, promising strategic RPG gameplay based around building and levelling a squad of said mercenaries, engaging in randomly generated encounters (plus there’ll be a PvP mode where mercenary teams can face off against each other).",
    "Blizzard says that this mode will offer a “fast-paced combat system that rewards cunning and anticipation”. Sounds like another welcome addition to the Hearthstone melting pot."
  ],
  "headers": {
    "7": "Classic nostalgia"
  },
  "links": {
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "World of Warcraft Classic": "https://www.techradar.com/news/world-of-warcraft-classic-the-burning-crusade-release-date-beta-and-everything-we-know"
  }
}