{
  "source": "https://www.techradar.com/news/ozark-season-4-will-end-on-netflix-in-2022-new-trailer-confirms",
  "title": "Ozark season 4 will end on Netflix in 2022, new teaser confirms",
  "category": "entertainment",
  "updated": "2021-09-25T16:30:00Z",
  "author": "samuel-roberts",
  "summary": "Get a first look at the Byrdes' return",
  "article": [
    "Netflix has revealed the first trailer for Ozark season 4, teasing the Byrdes' new situation in the show's final run. Divided into two parts, the crime saga will wrap up in 2022, with both halves arriving during that year.",
    "The trailer doesn't give much away – it simply shows Marty Byrde (Jason Bateman) cleaning blood off of Wendy Byrde (Laura Linney) before a door opens, followed by a release window. But it's no doubt enough to get fans excited about what's to come.",
    "Star Jason Bateman revealed at Netflix's Tudum event that the show is still filming. Check out the first look trailer below:",
    "We know 14 episodes have been ordered for this final season, though it's unclear how long the gap will be between releases.",
    "Netflix is keeping quiet about plot details around this final season, simply teasing us with the description of, \"The Byrdes are back and the stakes have never been higher.\"",
    "Several new cast members have been added for Ozark season 4, including Ali Stroker and Veronica Falcón.",
    "Ozark's popularity seemed to skyrocket last year when the pandemic hit, after its third season rolled out in March 2020. Over time, the show has gone from feeling maybe a little derivative to the likes of Breaking Bad to carving out its own voice – helped by shifting focus to Linney's character, and finding disturbing depth to Wendy Byrde.",
    "\"While Breaking Bad ultimately condemned Walt’s pursuit of testosterone, there’s no need to retread it. In Linney’s Wendy, Ozark has found a star just as disturbing, and much more contemporary,\" we said last year.",
    "Fans will no doubt be delighted to have it back."
  ],
  "headers": {},
  "links": {
    "Ozark season 4": "https://www.techradar.com/news/ozark-season-4",
    "we said last year": "https://www.techradar.com/news/why-ozark-is-netflixs-most-underrated-series"
  }
}