{
  "source": "https://www.techradar.com/news/ratched-season-2",
  "title": "Ratched season 2: everything we know",
  "category": "entertainment",
  "updated": "2021-09-13T01:51:11Z",
  "author": "vikki-blake",
  "summary": "Ratched season 2 is confirmed, but what do we know about it?",
  "article": [
    "Ratched season 1 helped take our minds off of real-world events when it dropped in 2020, with Sarah Paulson's sinister take on the One Flew Over the Cuckoo's Nest character capturing our imaginations in this campy horror series. Netflix subscribers loved it, too, with 48 million tuning in after its debut. Ratched season 2, then, is highly anticipated – but when we'll actually get it is a big mystery.",
    "Closing that first season on an agonizing cliffhanger, all thoughts now turn to when we'll next see Ratched in action again. Beyond confirmation that a new series is indeed on the way, Murphy and co-creator Evan Romansky have been coy about what's next in store for the folks we met at Lucia State Hospital, but to save you rooting around the internet, we've collected everything we know so far about the highly-anticipated second series. So, settle in and buckle up – Nurse Ratched's ready for her next patient.",
    "While we've tried to be careful not to give too much away, this article contains spoilers for Ratched season 1 as well as season 2, so please proceed with caution if you'd like to keep the story revelations a surprise!",
    "Netflix didn't pull its punches when securing Murphy's latest project. The initial order way back in 2017 was for two seasons, not just the one we've seen, so there's definitely a second on the way.",
    "Interestingly, Paulson – who plays the titular character – intimated to Elle.com that there could be more on the way, although it's yet to be formally confirmed.",
    "\"We’re definitely doing a second season, but if we were to go on, the plan would be to do about four seasons,\" she revealed. \"And in the fourth season, we end up in the Cuckoo's Nest era.\"",
    "There's no confirmed release date for Ratched season 2 just yet. Nothing has been stated about when season 2 is filming – but we wouldn't expect it before 2022 at this point. \"Nobody knows anything about season 2 because Ryan, with the number of things he has going on, who’s to know when when that’s all going to begin, and you throw in the pandemic and then we think well who knows,\" Paulson said back in September 2020 to Variety. In the intervening year, there haven't been any fresh updates, as far as we can tell – just Paulson shooting down a rumor that season 2 was coming in 2021, back in July.",
    "Honestly? Not much, and that includes the cast, too.",
    "\"I'm as curious as anyone to know what will happen in season 2,\" added Cynthia Nixon, who plays Gwendolyn Briggs, Ratched's love interest. In an interview with OprahMag.com, she intimated that she's \"sure there's a lot of pathos and heartbreak up ahead\".",
    "That said, however, Paulson did reveal the direction she would like to see her titular role travel, as well as things she wouldn't like to explore in subsequent series, which we suspect will take Mildred Ratched's story right up to the infamous events of One Flew Over the Cuckoo's Nest.",
    "“I think it wouldn’t have been interesting to me to explore the parts of Mildred Ratched that aren’t porous,\" Paulson told Variety. \"In the movie, she is calcified, there’s a hardness, nothing ekes out, and I remember when I first saw the movie thinking that she was absolutely a villain and evil and all this stuff.",
    "\"And then when I rewatched it before we started, I thought, you know this is a woman who is a victim of a patriarchal infrastructure in this hospital, and could it be considered that she didn’t have any choice about whether or not she can access her heart in her way, if she could bring her femininity and her womanhood to the job.”",
    "At the close of Ratched season 1, we saw the \"star\" patient of Lucia (Finn Wittrock) team up with patient Charlotte (Sophie Okonedo) and motel owner Louise (Amanda Plummer) to escape the hospital and make a break for Mexico, where Mildred had fled with her unwell partner, Gwendolyn (Nixon).",
    "While the ending doesn't confirm all these performers will definitely reprise their roles in Ratched season 2, it certainly hints at which characters might pop up again.",
    "We'll also likely see the reappearance of Californian governor George Wilburn (Vincent D'Onofrio) and – fingers crossed – Ratched's brilliant arch-rival, Nurse Bucket (Judy Davis).",
    "With the two-year time jump right at the end of season 1, however, there's plenty of time for these characters to succumb to various ailments and injuries along the way, particularly as we ended on that shocking and murderous reveal. Watch this space, eh?",
    "In her conversation with Elle, Paulson intimated that even if the show did stretch beyond the two currently confirmed seasons, she doesn't think we'll ever see her play the Ratched that terrified us in One Flew Over the Cuckoo's Nest.",
    "\"I don't believe we will ever find ourselves in the hospital [from the movie], unless it's pre McMurphy being admitted, unless it's pre all those patients being there. Unless you want to see computer-generated Danny DeVitos and Jack Nicholsons acting with me, which, I don’t know that that’s the way to do it.\" McMurphy, of course, is the character played by Nicholson in Miloš Forman's 1975 movie that inspired the show.",
    "\"We have an end game. There's an end to the story as we know it, culturally,\" Paulson told OprahMag. \"But so little is known about Mildred Ratched in the movie and the book. There's nothing about her past. She's a monolith. It's almost like she's not really a person.\"",
    "Expect to see Ratched get deconstructed further in season 2, then, as one of the great villains takes a closer step to fully inhabiting the character she'll eventually become."
  ],
  "headers": {
    "3": "Ratched season 2 is confirmed",
    "6": "Ratched season 2 release date: when to expect it",
    "7": "Ratched season 2 plot: what do we know so far?",
    "12": "Ratched season 2 cast: who we expect to see return",
    "16": "We probably won't see the Ratched we know from One Flew Over the Cuckoo's Nest"
  },
  "links": {
    "Elle.com": "https://www.elle.com/culture/movies-tv/a34064835/sarah-paulson-ratched-netflix-interview/",
    "Variety": "https://variety.com/2020/tv/news/sarah-paulson-ahs-production-restart-ratched-1234756090/",
    "shooting down a rumor": "https://twitter.com/MsSarahPaulson/status/1418725214607667205",
    "OprahMag.com": "https://www.oprahmag.com/entertainment/a34045518/ratched-season-2-release-date-cast-news/"
  }
}