{
  "source": "https://www.techradar.com/news/global-smartphone-sales-fall-as-component-shortage-bites",
  "title": "Global smartphone sales fall as component shortage bites",
  "category": "phones",
  "updated": "2021-11-23T14:47:58Z",
  "author": "steve-mccaskill",
  "summary": "Gartner says sales decreased by 6.8% in Q3",
  "article": [
    "Global smartphone sales fell by 6.8% during the third quarter of 2021 as manufacturers an ongoing shortage of components in the industry, new figures have shown.",
    "The ongoing shortage of key components in the mobile industry contributed to a decline on global smartphone sales during the third quarter of 2021.",
    "Figures from Gartner show worldwide sales to end users fell by 6.8% as manufacturers struggled to get their hands on components such as radio frequency units, power management circuits, and other chips.",
    "This had an inevitable impact on production schedules, leading to lower inventory and delayed product availability. This meant consumers had fewer choices at a retail level and may have delayed or abandoned purchases.",
    "“Despite strong consumer demand, smartphone sales declined due to delayed product launches, longer delivery schedule and insufficient inventory at the channel,” said Anshul Gupta, senior research director at Gartner. “Supply constraints impacted the production schedule of basic and utility smartphones much more than premium smartphones.”",
    "Indeed, the premium segment of the market actually increased during the three-month period. Samsung remains the world’s leading manufacturer with 20.2% of the market, a drop from 22.1% last year, but its share of high-end sales increased thanks to demand for its flagship handsets, including the Galaxy Fold.",
    "Meanwhile Apple, which only competes at the premium end, saw sales rise by almost eight million units and its share rise from 11.1% to 14.2%. This was enough to see it reclaim second spot from Xiaomi, which fell to third despite increasing its share from 12.1% to 13%. – despite sales remaining flat. Vivo increased its share from 8.1% to 10.5%, while Oppo increased from 8.1% to 9.8%.",
    "It’s unclear when the supply of components will return to normal, with some suggesting it could drag until as long as 2023.",
    "If your desired phone is in stock, have a look at our best mobile phone deals"
  ],
  "headers": {
    "3": "Smartphone sales"
  },
  "links": {
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "best mobile phone deals": "https://www.techradar.com/deals/mobile-phone-deals"
  }
}