{
  "source": "https://www.techradar.com/news/what-stock-shortage-ps5-has-sold-10-million-consoles-faster-than-the-ps4",
  "title": "What stock shortage? PS5 has sold 10 million consoles faster than the PS4",
  "category": "gaming",
  "updated": "2021-08-30T02:01:29Z",
  "author": "hamish-hector",
  "summary": "Sony's fastest-selling console",
  "article": [
    "Against all the odds, despite plenty of stock shortages, the PS5 has sold over 10 million units since its launch. However, what is even more surprising is that it’s sold even faster than the PS4.",
    "That's right – Sony’s latest hardware has been able to beat its older sibling to the milestone by almost two weeks. The PS4 was released in the US on 15 November 2013 and the PS5 came out almost exactly 7 years later in 2020, on 12 November. Though while the PS4 was able to reach its 10 million console milestone in eight months and 28 days, the PS5 did it in eight months and 16 days.",
    "The PS4 has sold incredibly well overall too, with the latest figures putting its total sales at over 115 million. This currently makes it Sony’s second best-selling console (behind the PS2), but if the PS5 continues to outpace it, we might eventually see the PS4 relegated to the third-place spot.",
    "Xbox Series X and Series S consoles are also selling incredibly well too. In a recent investor call, Microsoft boss Satya Nadella revealed that the Xbox Series X and S are the fastest-selling consoles in the company's history. No specifics were given, but it shows that stock shortages aren't stopping the latest and greatest consoles from succeeding financially.",
    "Given each company has a very different approach planned for this console generation, it'll be interesting to see who does better. Will Xbox's Game Pass plan put it ahead or will PlayStation's more traditional route give it a reliable lead? We'll have to wait and see.",
    "You'd be forgiven for being surprised at the PS5 hitting this huge sales milestone. After all, when so people are still struggling to get their hands on the console, how can it be selling this well? Well, there are quite a few reasons.",
    "For starters, we can thank everyone’s (least) favorite people, scalpers. Third-party resellers have been blamed by many for adding to the sense of console scarcity that's been created by electronic component shortages. However, these same vendors are still buying up PS5 consoles, boosting Sony’s sales numbers while simultaneously keeping the hardware out of regular folks’ hands.",
    "On top of that, it could be that the PS5 is just way more popular than even the PS4 was. With everyone being trapped inside for most of the last year and a half, thanks to Covid-19 restrictions across the globe, indoor activities like gaming have increased in popularity considerably – much like how high-quality OLED TVs have seen a sales boost.",
    "We also wouldn’t be surprised to find out that many Xbox fans are jumping ship over to Sony hardware. Not only does the PS5 give them a huge upgrade over their older Xbox One console, but thanks to backward compatibility they’d finally be able to play great games like God of War and Horizon Zero Dawn from the PS4 era, as well as all the next-gen games that coming out (such as Ratchet and Clank: Rift Apart).",
    "Finally, it’s worth noting that while the PS4 was released in certain regions in November 2013, it didn’t come out in Japan until February 2014, three months later. This is a very important country for gaming hardware, especially from Japanese companies like Sony, so we wonder if this delay also caused the console sales to lag behind the PS5’s too.",
    "For these reasons and more the PS5 is currently the fastest-selling PlayStation Sony has ever produced. We’d be surprised to see it overtake the PS2 anytime soon, but who knows what could happen over the coming years. If you’re after your own PS5, be sure to follow our PS5 restock tracker Matt Swider for all the latest updates."
  ],
  "headers": {
    "5": "Analysis: These numbers can’t be right... right?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4.": "https://www.techradar.com/reviews/ps4-pro",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Game Pass": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "high-quality OLED TVs have seen a sales boost": "https://www.techradar.com/news/2021-is-the-year-were-all-finally-getting-an-oled-tv",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "PS5 restock tracker Matt Swider": "https://twitter.com/mattswider"
  }
}