{
  "source": "https://www.techradar.com/news/now-you-can-buy-fitbit-smartwatches-and-fitness-trackers-directly-from-google",
  "title": "Now you can buy Fitbit smartwatches and fitness trackers directly from Google",
  "category": "wearables",
  "updated": "2021-02-17T10:48:33Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Wearables are now available to buy in the Google Store",
  "article": [
    "It is around a month since Google completed its acquisition of Fitbit, after more than a year of wrangling with regulatory authorities. With the official side of things now sorted, the search giant is ready to not only promote Fitbit devices, but also to sell them.",
    "The arrival of Fitbit-branded smartwatches and fitness trackers in the Google Store was inevitable, but now the big day has arrived. You can now buy four Fitbit devices alongside Google's own Pixel and Nest ranges.",
    "The quartet of devices breaks down as two smartwatches (namely the Versa 3 and Sense) and two trackers (the Inspire 2 and Charge 4). If you were hoping that buying direct from Google might mean making a bit of a saving, prepare to be disappointed. All four products have the same price tags before.",
    "Somewhat strangely, it is only these four Fitbit devices that are to be found in the Google Store. The Fitbit category of the store lists these wearables, but if you are interested in anything else – including a Fitbit Premium subscription – you'll be transported to the usual Fitbit website.",
    "For anyone looking for anything besides the base models of each device, the Google Store listing are a little disappointing.",
    "The Versa 3 is available in Black/Black Aluminium or Pink Clay/Soft Gold Aluminium variants, the Sense in Carbon/Graphite Stainless Steel or Lunar White/Soft Gold Stainless Steel, the Inspire 2 in Black or Desert Rose, and the Charge 4 in Black or Rosewood.",
    "For anyone looking for color customization through use of different bands, a trip to the Fitbit website is needed. At the moment, it is only the US version of the Google Store that includes Fitbit products, but this is likely to change over the coming months.",
    "Via 9to5Google"
  ],
  "headers": {
    "4": "Shop for fitness"
  },
  "links": {
    "Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "Charge 4": "https://www.techradar.com/reviews/fitbit-charge-4",
    "Fitbit category": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-8739566789154763000/https://store.google.com/us/category/fitbit?hl=en-US",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "9to5Google": "https://9to5google.com/2021/02/16/fitbit-google-store/"
  }
}