{
  "source": "https://www.techradar.com/news/managing-your-wordpress-sites-just-got-a-lot-less-stressful",
  "title": "Managing your WordPress sites just got a lot less stressful",
  "category": "computing",
  "updated": "2021-01-04T17:00:05Z",
  "author": "anthony-spadafora",
  "summary": "You can now manage multiple WordPress sites directly from cPanel",
  "article": [
    "Managing multiple WordPress sites can now be done directly in cPanel as the company has released a new user-friendly toolkit for site owners.",
    "WP Toolkit for cPanel is available in both a free Lite version as well as in a paid Deluxe version. The new WordPress tool is designed to help site owners save time by simplifying the management of single or multiple WordPress installations.",
    "Chief technical officer at cPanel J. Nick Koston explained why the company developed WP Toolkit for cPanel in a press release, saying:",
    "\"We set out to reinforce our alignment with, and investment in, the global WordPress community. We then developed this product as a long-term solution based on conversations with our Partners about the evolving needs of their customers. The Toolkit really does check every box we had in mind.\"",
    "One of things that sets WP Toolkit for cPanel apart from other WordPress tools is the fact that it includes numerous one-click features including Smart Updates, automatic hardening to protect against security vulnerabilities and the auto-installation of themes and plugins.",
    "Existing cPanel users can access the free Lite version by upgrading to version 86 LTS, 90 and 92 of cPanel. The feature-packed Deluxe version meanwhile is available through cPanel Partners and the cPanel Store.",
    "It's worth noting that the pricing for WP Toolkit for cPanel changes depending on how many accounts a customer requires with 1 account costing $7.50 per month, 5 accounts for $15 per month and 10 accounts for $22.50 per month. cPanel also allows you to secure more than 10 accounts for an additional $15 per month per 10 accounts.",
    "Being able to manage multiple WordPress installations directly from cPanel will likely save site owners time and since the Lite version is free, they can test it out for themselves just by upgrading to a supported cPanel version."
  ],
  "headers": {
    "4": "One-click features"
  },
  "links": {
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "WP Toolkit for cPanel": "https://cpanel.net/coming-soon-wp-toolkit/",
    "press release": "https://www.prnewswire.com/news-releases/announcing-wp-toolkit-for-cpanel-301199200.html",
    "themes": "https://www.techradar.com/news/best-wordpress-theme",
    "plugins": "https://www.techradar.com/best/best-wordpress-plugins"
  }
}