{
  "source": "https://www.techradar.com/news/battlefield-6-gameplay-images-leak-ahead-of-june-reveal",
  "title": "Battlefield 6 gameplay images leak ahead of June reveal",
  "category": "gaming",
  "updated": "2021-06-11T16:56:15.762Z",
  "author": "emma-boyle",
  "summary": "In our sights",
  "article": [
    "Screenshots reported to be from Battlefield 6 (now confirmed to be Battlefield 2042) have leaked online, just ahead of the game’s planned June 9 reveal.",
    "There are four images in total, all posted by the Twitter account Battlefield News and uploaded to Imgur as well. The images show a city scape, a ground-based view of a helicopter and player-view of a tank and aircraft in use. They also give a look at the game’s UI, with the mini-map, party lists and equipment lists appearing in three of the four screenshots.",
    "According to Battlefield News (via GamesRadar), the images were taken from a recent “game test“ and one of the images is marked as being “pre-alpha footage”. While there isn’t any confirmed source for the images and it's always best to take these things with a pinch of salt, established Battlefield leaker Tom Henderson has tweeted to claim “they are real”.",
    "It’s worth noting that what’s shown in the images appears to match up with the near-future setting that previous reports and leaks have suggested the game will have.",
    "This isn’t the first time we’ve seen images apparently from Battlefield 6 leaked online. It was only a couple of weeks ago that footage and screenshots from what is supposedly the game’s reveal trailer were leaked.",
    "Though these images are less blurry and redacted than those that have been leaked previously, it’s still hard to get a real sense of how the game is going to look from them.",
    "Fortunately, it’s really not long to wait until we see official, proper, crystal clear footage from Battlefield 6 (and presumably find out its official title beyond the widely used Battlefield 6 placeholder). EA has confirmed that the game’s official reveal will take place just ahead of E3 2021, on June 9 at 3pm BST / 7am PT / 10am ET (or June 10 at 12am AEST). It’s likely there’ll be even more to see at EA Play Live 2021, set to take place in July.",
    "When it launches, Battlefield 6 will be playable on PS5, Xbox Series X/S and PC, as well as last generation consoles, PS4 and Xbox One."
  ],
  "headers": {
    "5": "More to come"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "planned June 9 reveal": "https://www.techradar.com/news/battlefield-6-reveal-date-set-but-what-will-we-see",
    "Battlefield News": "https://twitter.com/BF2042News/status/1400841598087335940?s=20",
    "Imgur": "https://imgur.com/a/tsxLqAJ#rqqs1xc",
    "GamesRadar": "https://www.gamesradar.com/latest-battlefield-6-leaked-images-show-near-future-vehicles-in-a-warring-city/",
    "tweeted": "https://twitter.com/_Tom_Henderson_/status/1400849336075014145?s=20",
    "previous reports and leaks": "https://www.techradar.com/news/battlefield-6-trailer-leak-shows-modern-setting-androbots",
    "couple of weeks ago": "https://www.techradar.com/news/battlefield-6-trailer-might-have-been-revealed-using-leaked-screenshots",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "EA Play Live 2021": "https://www.techradar.com/news/ea-play-2021-confirmed-for-july-following-rumored-battlefield-june-reveal",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391"
  }
}