{
  "source": "https://www.techradar.com/news/knives-out-2-casts-hamilton-star-heres-why-that-matters",
  "title": "Knives Out 2 casts Hamilton star - here's why that matters",
  "category": "entertainment",
  "updated": "2021-05-19T09:15:14Z",
  "author": "tom-power",
  "summary": "Knives Out 2 on Netflix is building a diverse cast",
  "article": [
    "It appears that nobody can keep Knives Out 2 out of the news recently. Netflix's upcoming murder mystery sequel is gearing up for a summer long shoot in Greece, which has led to a number of casting announcements since May 10.",
    "In comparison to last week's glut of reveals, casting announcements were notably quiet earlier this week. Now, though, we've received reports of the next actor to join the movie's burgeoning line-up. According to The Hollywood Reporter, Hamilton and One Night in Miami star Leslie Odom Jr. has also signed on to appear.",
    "Odom Jr. joins Dave Bautista, Edward Norton, Kathryn Hahn and Janelle Monae as new cast members for Rian Johnson's upcoming whodunit flick. That quintet will star alongside Daniel Craig, who will reprise his role as Detective Benoit Blanc from the 2019 movie.",
    "As with the other announcements, Odom Jr.'s role is unknown at this time. It would be easy to speculate that he'll play the bad guy - Odom Jr. did star as Aaron Burr in Hamilton, after all - but Knives Out 2's villain could be anyone, including stars who are yet to be announced as part of its cast.",
    "Hopefully, we'll get an official synopsis for Knives Out 2 when principal photography begins later this year.",
    "It's been interesting to follow each Knives Out 2 casting announcement so far. As brilliant as the first movie was, there's no denying that its cast was predominantly white.",
    "Yes, that spoke to one of Knives Out's underlying themes of critiquing white upper-class privilege. The movie's cast, though, wasn't as ethnically representative as it could have been. Knives Out had a solitary Black actor (Lakeith Stanfield) and two Hispanic cast members (Ana de Armas and Marlene Forte), with this trio accounting for just 16% of the movie's overall cast.",
    "Knives Out 2 appears to going in the opposite direction. Of the six cast members who have reportedly joined the production, two are Black (Odom Jr. and Monae) and another (Bautista) is of Filipino descent.",
    "With a 50% split between white and ethnic minority actors in its cast so far, Knives Out 2 is already more diverse than its predecessor. If it maintains this ratio with future actor reveals, it'll be the most representative cast in a Rian Johnson movie so far, and one that better reflects the world around us."
  ],
  "headers": {
    "5": "Analysis: Knives Out 2 is building a more diverse cast than the original"
  },
  "links": {
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/leslie-odom-jr-knives-out-sequel-1234954701/"
  }
}