{
  "source": "https://www.techradar.com/news/huawei-could-launch-a-samsung-galaxy-z-flip-3-rival-soon",
  "title": "Huawei could launch a Samsung Galaxy Z Flip 3 rival soon",
  "category": "phones",
  "updated": "2021-09-29T09:08:36Z",
  "author": "james-rogerson",
  "summary": "Apparently it's coming this year",
  "article": [
    "Other than Samsung, Huawei has arguably been the biggest force in foldable phones, but so far all of its devices – such as the Huawei Mate Xs – have had large, tablet-like screens. Now though, the company might be preparing to launch a clamshell foldable, more in line with the Samsung Galaxy Z Flip 3 and Motorola Razr 2020.",
    "That’s according to leaker @Panda is bald, who on Weibo (a Chinese social network), claimed that just such a phone will be landing this year, with the name Huawei Mate V.",
    "Apparently this will have a Kirin 9000 chipset like the Huawei Mate 40 Pro. That was a high-end chipset in 2020 but it’s a bit dated now, and will be even more so when the Huawei Mate V launches.",
    "But this could be one way to keep the cost down, in a similar way to how Motorola did with the Razr 2020, which uses a mid-range Snapdragon 765G.",
    "This leak doesn’t include any additional details, so we don’t know when this year the Huawei Mate V might land, but there's not much year left, and the company is making some sort of announcement on October 21, so perhaps we'll see it then.",
    "That said, we’d take this with a pinch of salt, especially as the source doesn’t have as much of a track record as some leakers, and as we'd think we'd have heard more about this phone if it was coming soon.",
    "But this isn’t quite the first we’ve heard of the Huawei Mate V. Back in 2020, Huawei both applied to trademark the Mate V name and filed a patent application for a clamshell foldable phone. So it’s an idea that the company is at least exploring, and a name that might be used for some product or other.",
    "The smartphone market has arguably started to become a bit stagnant when it comes to new features and innovation. Most phones now – particularly at the high end – perform well, and upgrades are often fairly minor or niche, but foldable phones could provide a bright future.",
    "They’re the biggest change we’ve seen to smartphones arguably ever, and they bring whole new form factors and use cases, so they could make the industry exciting again.",
    "Right now though, it’s mostly just Samsung forging ahead with them. Huawei, Motorola and others have dabbled, but only Samsung seems committed, and for foldables to really take off we need more than one company making them.",
    "We need competition to ensure ever better products and – importantly – lower prices, along with just more foldable choice. So hopefully the Huawei Mate V is on the way, and hopefully it’s just the next in a long-line of Huawei foldables.",
    "Via GSMArena"
  ],
  "headers": {
    "7": "Opinion: keep those foldables coming"
  },
  "links": {
    "Huawei Mate Xs": "https://www.techradar.com/reviews/huawei-mate-xs",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Motorola Razr 2020": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "Weibo": "https://m.weibo.cn/detail/4686711600712874",
    "Huawei Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "GSMArena": "https://www.gsmarena.com/huawei_mate_v_clamshell_scheduled_to_arrive_this_year-news-51178.php"
  }
}