{
  "source": "https://www.techradar.com/news/xbox-series-xs-full-potential-will-take-time-for-developers-to-fully-embrace",
  "title": "Xbox Series X’s full potential will take time for developers to ‘fully embrace’",
  "category": "gaming",
  "updated": "2021-05-20T09:40:15Z",
  "author": "adam-vjestica",
  "summary": "The Ascent developer believes there are big things to come",
  "article": [
    "Microsoft’s Xbox Series X may be six months old, but we’re yet to see what the new system can really do. Countless games have been optimized to deliver higher frame rates and to target 4K resolution, but in terms of games that have been developed with only the Xbox Series X and Xbox Series S in mind, The Medium is one of the few titles that springs to mind.",
    "However, according to Tor Frick, creative director of The Ascent, it’s going to take some time for developers to really get to grips with what Microsoft’s new hardware offers.",
    "In an interview with GamingBolt, Frick explained that developers are still in the early stages of working with the hardware, and noted that the SSD will help smaller developers “bridge the gap” on what’s expected from AAA studios.",
    "“I think it will take some time before it becomes apparent how big of a shift this will be,” Frick said. “It will take some time before the development community will have the possibility to fully embrace the new baseline of hardware.",
    "“The fast load times will allow developers to create experiences that are more seamless, richer, more detailed and more varied. It will help smaller developers bridge the gap between budget titles and what we would traditionally expect from AAA studios. I think we will just see even more variety of games being made from studios of all sizes, which is amazing.”",
    "The Ascent is an isometric, action RPG set in a cyberpunk world. It’s exclusive to Xbox consoles and PC and is set to launch day one on Xbox Game Pass on July 29. You can play the game alone or team up with three friends in local or online co-op, and even though the game is being developed by a small team at Neon Giant, it looks like The Ascent will be an impressive showcase of the Xbox Series X’s horsepower.",
    "With E3 2021 just around the corner, we’re expecting to get more news on some previously announced Xbox Series X exclusives, like Halo Infinite, Forza Motorsport, State of Decay 3 and Hellblade 2. Microsoft’s acquisition of Bethesda means we’re also likely to hear more information on Starfield and possibly The Elder Scrolls 6."
  ],
  "headers": {
    "5": "Ascension day"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "The Medium": "https://www.techradar.com/reviews/the-medium",
    "GamingBolt": "https://gamingbolt.com/it-will-take-some-time-for-developers-to-fully-embrace-the-xbox-series-xs-full-potential-the-ascent-developer",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "Hellblade 2": "https://www.techradar.com/news/senuas-saga-hellblade-2-release-date-trailers-news-and-rumors",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors"
  }
}