{
  "source": "https://www.techradar.com/news/sonys-state-of-play-outlined-a-boring-few-months-for-the-ps5",
  "title": "Sony’s State of Play outlined a boring few months for the PS5",
  "category": "gaming",
  "updated": "2021-02-26T18:33:30.885Z",
  "author": "vic-hood",
  "summary": "Opinion: the recent State of Play left a lot to be desired",
  "article": [
    "Without a PS5 launch to look forward to, Sony State of Play is considerably more boring. Throughout last year we waited with bated breath for a morsel, a crumb of news on the PS5 at each and every State of Play. On many occasions, we were left disappointed, though we should have known better as Sony kept its biggest announcements for specific events like Future of Gaming and The Road to PS5. Regardless, like moths to a flame, we kept coming back for more.",
    "But the disappointment was part of the whirlwind that surrounded the upcoming PS5 launch. We speculated and we hoped, knowing that at some point Sony would have to share more details on its upcoming console - so we tuned in thinking “it might happen this time”.",
    "Fast forward to 2021 and the PS5 is out in the wild. As I awaited February 2021’s Sony State of Play, the memories of dismay from the previous State of Plays faded away and I let my mind wander to the endless possibilities of what Sony could showcase at the event.",
    "“Maybe a new God of War Ragnarok trailer (I really hope it’s not delayed)? Perhaps we’ll get a release date for Horizon Forbidden West (it’ll definitely be November, right?)? Will Kena: Bridge of Spirits be on PS Plus this March (I need that wholesome in my life)?” All this, despite Sony explicitly saying it would focus on third-party and indie games - we’re creatures of wishful thinking, after all.",
    "So when State of Play didn’t give us as many big announcements we were hoping for, it stung more than before.",
    "As I’ve said before, Sony was pretty straight-shooting with what the most recent State of Play would offer: focus on indies and third-party titles. We got an update on Crash Bandicoot 4 (which we already knew about), another new trailer for Deathloop, a closer look at gameplay for Solar Ash, Five Nights at Freddy’s: Security Breach and Returnal, plus a release date (finally) for Oddworld: Soulstorm and Kena: Bridge of Spirits - with the latter unfortunately seeing a delay from March until August.",
    "The biggest news of the evening was that Final Fantasy 7 Remake is getting a PS5 upgrade called Intergrade, which has already been rumored, and a couple of mobile games. But even then, all these reveals and announcements felt a bit lackluster. It left me wanting more.",
    "Where were the big PlayStation releases that we’re waiting for? While the focus on third-party and indie games was expected, I thought Sony would pull something big out of the bag at the end - like it did with the PS5 design reveal In fairness, perhaps the Final Fantasy 7 Remake news would have fired us up more if there hadn’t been a leak beforehand.",
    "Of course, nothing is going to be as big as the launch of a new console, but rough roadmaps (or even some more gameplay trailers and details) for big hitters like Horizon Forbidden West and God of War would help to build a brand new hype train, and it would go a long way in helping potential PS5 adopters know whether they need a console amongst the current chaos, or if they can afford to wait.",
    "With Sony now officially confirming next-generation VR for the PS5 (or PSVR 2), this is the perfect time to get fans excited about another Sony innovation - particularly as Microsoft has no plans to release VR for the Xbox Series X.",
    "Right now, it feels like we know very little about some of Sony’s biggest upcoming releases and hardware plans outside of those in the next couple of months and, as a result, my anticipation for them has waned. Out of sight, out of mind.",
    "I would love to see Sony gradually ramping up the anticipation for both its upcoming big hitters and PSVR 2 as it did for PS5: a little blog post here, a cryptic tweet there. Always keeping these products in the forefront of fans’ heads. Then, by the time the next State of Play arrives, fans will be frothing at the mouth for confirmed juicy details.",
    "With the PS5 release marred by stock issues, a lack of details on expandable internal storage at launch and a lackluster game offering, PS5 owners have the right to ask a bit more of Sony when it comes to transparency. Sony should be doing its utmost to encourage PlayStation fans that they should sit in virtual queues for hours to get a PS5. That the next year of PS5 is something that they do want to be part of, even if the process of getting there is painful.",
    "After all, Sony’s newest console is a big investment. But amidst a pandemic, maybe I’m asking a lot. Who knows, maybe I’m just trying to ride that PS5 hype wave again..."
  ],
  "headers": {
    "5": "Wishful thinking",
    "8": "What we want to see next"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Future of Gaming": "https://www.techradar.com/news/ps5-june-4-console-and-game-reveal-event",
    "The Road to PS5": "https://www.techradar.com/news/ps5-wont-use-dolby-atmos-in-games-and-may-require-you-to-send-sony-a-picture-of-your-ears",
    "God of War Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "Crash Bandicoot 4": "https://www.techradar.com/reviews/crash-bandicoot-4-its-about-time-review",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Final Fantasy 7 Remake is getting a PS5 upgrade": "https://www.techradar.com/news/final-fantasy-7-remake-ps5-upgrade-brings-new-story-content-and-visual-upgrades",
    "Final Fantasy 7 Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "officially confirming next-generation VR for the PS5": "https://www.techradar.com/news/sony-confirms-psvr-2-is-coming-to-ps5-along-with-a-new-vr-controller",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}