{
  "source": "https://www.techradar.com/news/bridgertons-best-character-is-getting-a-spinoff-but-will-netflix-do-it-justice",
  "title": "Netflix needs to tread carefully with its Bridgerton prequel – here's why",
  "category": "entertainment",
  "updated": "2021-05-17T13:38:14Z",
  "author": "henry-st-leger",
  "summary": "Flawless, my dear",
  "article": [
    "Netflix's hit period drama Bridgerton is getting a spinoff for Queen Charlotte, building on the success of the first season with a prequel limited series set decades further into the past.",
    "Billed as an \"origin story\" for the trendsetting monarch – whose whims of approval and disapproval shape the fortunes of much of the aristocracy in the show – it will dial back the clock to long before the heady romance of the Duke of Hastings and Daphne Bridgerton.",
    "It's an exciting development for fans of the show – especially fans of Queen Charlotte, who is played with such aplomb in the first season by Golda Rosheuvel – with younger iterations of both Violet Bridgerton and Lady Danbury also set to appear. These women are some of the show's strongest characters, though we expect some age-appropriate recasting for the prequel's earlier time period.",
    "We expect to see Bridgerton season 2 first, of course, with much of the casting confirmed and filming ongoing – and two successive seasons planned for after that. It's clear Netflix is going all in on its 2020 hit, then, matching similar plans for The Witcher, which has a season 2 incoming as well as a roadmap for an additional five.",
    "There's no set release date for this prequel or the next Bridgerton season, though we think the latter could land on Netflix before 2021 is out.",
    "Of course, the particular details of Queen Charlotte's life do suggest this prequel series might have something of a different tone to the mainline seasons of Bridgerton – and it may make some prospective viewers wary of celebrating the spinoff news just yet.",
    "It's unclear whether this Bridgerton spinoff will match season 1 in tone, given the focus on Queen Charlotte. Her relationship with her husband (King George III) was one of the most fraught in the series, with the king being prone to fits of paranoia in the brief moments he appeared. This only scratches at the surface of the ailments and mental illness of the real-life King George III – something well documented by historians and storytellers alike, as in Alan Bennett's 1991 stage play The Madness of King George III.",
    "As ScreenRant puts it: \"The historical accounts of King George III’s illness include symptoms like convulsions, frothing at the mouth, rambling incoherently, bouts of depression and, later in his life, the loss of his hearing, vision, memory, and ability to walk.\"",
    "While we saw the king in middle-to-late age in Bridgerton season 1, it's very likely we'll see a younger iteration of the monarch struggling with early-onset symptoms of these conditions, with the resulting stress on the regal relationship. We'll be keen to see how sensitively this is handled, if the limited series does focus on this aspect of Queen Charlotte's life – especially given the uncomfortable handling of sexual assault midway through Bridgerton season 1.",
    "Of course, there's also the matter of the character's race.",
    "Bridgerton season 1 was widely praised for its 'color-blind' casting, overcoming one of the common criticisms (and barriers to enjoyment) in traditional English period dramas – namely, all-white casting that erases figures of any other ethnicity from British history.",
    "However, the show's writers make it clear that there's also a narrative justification, with Lady Danbury (Adjoa Andoh) telling the young Duke that “We were two separate societies divided by color until a king fell in love with one of us [...] Love, Your Grace, conquers all.”",
    "The message here is that the relationship between King George III and Queen Charlotte was some kind of catalyst for racial unity in 19th-century Britain – a seismic plot point that rewrites centuries of colonial and post-colonial history, but was given only seconds of breathing space amid the more pressing relationship dramas of Bridgerton's aristocracy.",
    "We can't imagine a Queen Charlotte prequel that doesn't address this, though, and it could see Bridgerton take a more hard-hitting tone, actually addressing the historical revisionism hinted at in the first season.",
    "Salamishah Tillet writes for the New York Times about the conflict between Bridgerton's escapism and its attempt to grapple with deep-rooted racial tensions, saying that \"By avoiding both slavery and the fervent British abolition movement that flourished in London in the early 19th century, 'Bridgerton' ultimately opts for 'Downton' escapism over a nuanced exploration of real-time racial dynamics, mostly relegating such aspects to the story’s past.\"",
    "It's worth noting that this prequel won't have a book to tie its story to, and it'll be interesting to see how successfully Netflix is in expanding the world of the Bridgerton novels without a written blueprint, especially if this spinoff does narrow in on the royal couple's racial dynamics and mental illnesses. If it doesn't even try to – well, that would be something of a disappointment in itself."
  ],
  "headers": {
    "6": "A harder-hitting period drama?",
    "10": "Love conquers all"
  },
  "links": {
    "Bridgerton season 2": "https://www.techradar.com/news/bridgerton-season-2-first-look-and-what-we-know",
    "a roadmap for an additional five": "https://www.techradar.com/news/are-you-ready-for-seven-seasons-of-the-witcher-tv-show-it-could-happen",
    "handling of sexual assault": "https://www.vox.com/22194033/bridgerton-netflix-rape-scene-novel",
    "New York Times": "https://www.nytimes.com/2021/01/05/arts/television/bridgerton-race-netflix.html"
  }
}