{
  "source": "https://www.techradar.com/news/halo-infinite-is-thankfully-getting-more-multiplayer-modes-before-2022",
  "title": "Halo Infinite is thankfully getting more multiplayer modes before 2022",
  "category": "gaming",
  "updated": "2021-12-06T16:37:18Z",
  "author": "rhys-wood",
  "summary": "Great news if you hate Capture The Flag",
  "article": [
    "Even though Halo Infinite's campaign lands on December 8 for Xbox Series X/S and PC, it looks like it won't be the only piece of content keeping Halo fans occupied before the year is out, as developer 343 Industries has confirmed more fan-favorite modes are coming to the game's multiplayer suite.",
    "Halo community manager John Junyszek tweeted that playlists for Fiesta, Tactical Slayer (SWAT), and Free-For-All modes should be ready before the end of the year.",
    "A stalwart Halo mode, SWAT takes away your shields and motion tracker while spawning you with a \"hitscan\" weapon (the projectiles of which hit instantly and have no travel time) like the battle rifle. The result is an intense game mode where a single shot can be fatal.",
    "Fiesta, meanwhile, spawns players with a random pairing of weapons. That's any weapon, too, meaning you could seriously luck out and spawn with a rocket launcher and energy sword. It's a more casual mode where cheap kills are expected and it isn't meant to be taken too seriously.",
    "Free-For-All is a much simpler \"every player for themselves\" game type that provides a much more chaotic alternative to the team-based modes like Slayer and Oddball. FFA is always a serious test of skill in any Halo title, so we're looking forward to having it back in Halo Infinite before the end of the year.",
    "While it's been great having Halo Infinite's multiplayer suite drop early, ahead of the campaign, the number of modes available to play certainly leave something to be desired.",
    "At present, only four game types are available in standard matchmaking (with three Big Team Battle variants featured on a separate playlist), those being Slayer, Oddball, Capture The Flag, and Strongholds. And while most of these are great fun, offering a variety of objectives, it's all too common to see the same mode show up several times in a row.",
    "Being able to switch things up with more returning game modes is sure to keep things fresh. And hopefully we'll be able to continue levelling the game's battle pass in the new modes, in spite of the more casual affair like Fiesta.",
    "It's a decent start to Halo Infinite's multiplayer suite before the year is out, then, and with other mainstay modes like Forge and the co-op campaign still a long way off, we hope 343 Industries can keep supporting its multiplayer with a range of beloved (and hopefully some completely new) modes."
  ],
  "headers": {
    "5": "Analysis: More modes, no problems"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc"
  }
}