{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-vs-samsung-galaxy-note-20-ultra",
  "title": "Samsung Galaxy S21 Ultra vs Samsung Galaxy Note 20 Ultra: two top-end treats",
  "category": "phones",
  "updated": "2021-03-20T14:00:57Z",
  "author": "jon-mundy",
  "summary": "What happens when Ultra flagship meets Ultra flagship?",
  "article": [
    "With the arrival of the Samsung Galaxy S21 Ultra, Samsung didn’t just comprehensively replace the Samsung Galaxy S20 Ultra – it threatened to make the imperious Samsung Galaxy Note 20 Ultra seem utterly irrelevant.",
    "In fact, with the Galaxy S21 Ultra treading on the Galaxy Note 20 Ultra’s toes in a number of key ways, some have come to question the Note range’s entire future.",
    "So is the Samsung Galaxy S21 Ultra really the one phone to rule them all? Or does the Samsung Galaxy Note 20 Ultra still have something to offer? Let’s find out.",
    "The Samsung Galaxy S21 Ultra arrived earlier than we expected on January 29, 2021. Prices start at $1,199 / £1,149 / AU$1,849 for the 128GB model, while the 256GB model costs $200 / £200 / AU$300 more, and the 512GB model ups the price by the same amount again.",
    "The Samsung Galaxy Note 20 Ultra rolled out just five months earlier, on August 21, 2020. Prices started at $1,299 for the baseline 128GB model in the US, while £1,179 / AU$1,849 got you 256GB of storage in the UK and Australia. Bumping the storage capacity up to 512GB cost you $1,449 / £1,279 / AU$2,199.",
    "While the Galaxy S21 Ultra has the cheaper launch price, however, you can now get yourself a handy discount on the older Galaxy Note 20 Ultra. At the time of writing, Amazon US was offering the 256GB model for $1,045, while Amazon UK was offering the 512GB model for £1,275.",
    "These are two handsome smartphones, and it’s tough to pick an outright winner. What’s great is that they also look quite distinctive from one another, despite obviously being from shared Samsung stock.",
    "The Samsung Galaxy S21 Ultra is, to use a technical term, seriously gorgeous. In the matte Phantom Black finish in particular, it’s a chic monolith of glass and metal, with few visible seams. You can also get it in Phantom Silver, Phantom Titanium, Phantom Navy, and Phantom Brown. That last one makes us laugh out loud every time, for some reason.",
    "Samsung actually took this matte finish approach from the Galaxy Note 20 Ultra, dropping the shiny finish of the Galaxy S20 series into the bargain. It was a smart choice.",
    "The Galaxy Note 20 Ultra was arguably the best-looking smartphone of 2020, particularly in its Mystic Bronze guise, which was arguably the most beautiful gold-ish tone we’d seen at the time. You could also get it in Mystic Black or Mystic White if you were boring.",
    "The Galaxy S21 Ultra is a rounder, smoother device than the Galaxy Note 20 Ultra. The corners curve off, whereas they finish at a flat-topped point on the Galaxy Note 20 Ultra. We love both.",
    "Similarly unique and striking is the way the two phones address the ‘problem’ of having a prominent camera module. As we’ll discuss, both phones have seriously meaty camera systems, but both wear these proudly as accessories.",
    "On the Galaxy S21 Ultra, that means a dramatic swoop that seems to flow out of the aluminum frame itself, before dropping off abruptly along its inner edges. On the Galaxy Note 20 Ultra, it means an audaciously vertical camera mount, with no attempt to smooth or break up its thick metal rim.",
    "It might surprise you to learn that the Samsung Galaxy Note 20 Ultra is the smaller phone of the two in most ways. There isn’t an awful lot in it, but at 164.8 x 77.2 x 8.1mm and 208g it’s a smidgen shorter, a fair bit thinner, and quite a lot lighter than the Galaxy S21 Ultra.",
    "At 165.1 x 75.6 x 8.9mm and 228g, the Samsung Galaxy S21 Ultra isn’t what you’d call unwieldy, but ultimately, this gives the slightest of edges to the Galaxy Note 20 Ultra on the design front.",
    "These are two of the best smartphone displays you can find on any smartphone. The Note 20 Ultra screen is slightly bigger at 6.9 inches, though the Galaxy S21 Ultra isn’t far behind at 6.8 inches. Both screens are huge, two-handed affairs.",
    "But the Galaxy S21 Ultra has one distinct advantage over the Galaxy Note 20 Ultra: it’s the first Samsung phone capable of running at a 120Hz refresh rate and at a Quad HD resolution at the same time.",
    "All previous phones – including the Galaxy Note 20 Ultra and even the rest of the Galaxy S21 family – forced you to choose one or the other. We’re glad to have both available in the same package, and it’s really not before time. Phones like the OnePlus 8 Pro were doing this in early 2020.",
    "But the difference between QHD and FHD in smartphone displays isn’t as noticeable as you might think. Unless you’re pixel-peeping in Google Photos, watching a beautifully shot native 2K video stream, or using mobile VR (remember that?), you might struggle to perceive a meaningful difference.",
    "Far more consequential is the availability of 120Hz, which both phones have. With this active, the display refreshes twice as fast as on the iPhone 12 Pro Max. Both of these Samsung displays can smartly scale from 10Hz up to 120Hz depending on what you’re doing on your phone, thus saving battery life when fluid on-screen motion isn’t necessary.",
    "Also key is the sheer quality of Samsung’s AMOLED display technology. Samsung is the undisputed champ at this stuff, with its screens able to output vibrant, natural colors and deep blacks.",
    "While both displays can hit a peak brightness of 1,500 nits, however, the Galaxy S21 Ultra has been shown to go slightly brighter on average. It takes home the win in this category, but we’re talking varying degrees of fabulous here.",
    "Samsung has upped its camera game significantly in recent years, and that’s most apparent with these two phones. They’re multi-eyed monsters. Both are led by ‘standard’ wide-angle cameras with 1/1.33-inch 108MP wide sensors and fast f/1.8 apertures. In both cases these use 9-in-1 pixel binning techniques to render sharp, well-lit shots in a range of lighting conditions.",
    "Both phones also have identically sized 12MP f/2.2 ultrawide cameras for those 120-degree landscape shots. They also both benefit from laser-assisted phase-detection autofocus, which helps them lock onto their subjects way better than the problematic Galaxy S20 Ultra.",
    "It’s when we consider the telephoto offerings of these two phones that things start to differ. The Galaxy S21 Ultra has an extra camera, for one thing, in the shape of a dedicated 10MP f/2.4 70mm telephoto snapper.",
    "Both phones have periscope telephoto sensors for optically zoomed shots, but while the Galaxy Note 20 Ultra goes with a 12MP f/3.0 120mm unit for a 5x optical zoom and 50x hybrid zoom, the Galaxy S21 Ultra goes longer with a 10MP f/4.9 240mm for 10x zoomed shots and a 100x hybrid zoom.",
    "Needless to say, the Galaxy S21 Ultra is the camera to turn to if you want (relatively) crisp zoomed-in shots. Neither phone is a slouch in this department, but the newer phone definitely picks out distant details better, and it’ll also lock the viewfinder so that your preview doesn’t lurch around on extreme close-ups.",
    "Even in normal shooting with those similar 108MP sensors, however, the Galaxy S21 Ultra has an advantage, rendering generally brighter shots with superior dynamic range. Its night-time performance has also been improved, which is an area where Samsung has tended to lag behind its closest rivals.",
    "Both phones can shoot 8K video at 24fps, but you’re more likely to use their 4K 60fps modes. The Galaxy S21 Ultra can shoot this across all five of its cameras, including the selfie cam. The new Director’s View mode helps facilitate this, and is a godsend for budding vloggers.",
    "Talking of selfie cameras, the Galaxy S21 Ultra outstrips its older brother with a whopping 40MP sensor, whereas the Galaxy Note 20 Ultra can only muster 10MP.",
    "While just five months separate these two phones, they straddle a clear generational divide, and this is most obvious when you consider the processors that power them.",
    "While the Galaxy S20 Note Ultra runs on either the Snapdragon 865 or the Exynos 990, the Galaxy S21 Ultra packs the new Snapdragon 888 or the Exynos 2100. In both cases, it’s a year-on-year upgrade.",
    "Benchmark tests will show a modest performance bump for the newer chips, and processor-intensive tasks like transcoding a 4K video clip will take a touch less time on the Galaxy S21 Ultra. But you won’t really notice the difference in day-to-day usage, or even when playing high-end 3D games. Both phones are very fast, and will remain so for years to come.",
    "Oh, and if you’re wondering what’s with the multiple chips, that’s just a unique (read: deeply annoying) quirk of Samsung’s approach to hardware. It splits the processor provision for its flagship phones between itself and Qualcomm.",
    "That divide runs along regional lines, with US and China customers getting Qualcomm chips and the rest of the world getting Samsung’s. The trouble is, Qualcomm’s Snapdragon chips are invariably a little faster and more efficient than Samsung’s Exynos chips.",
    "Owners of the Exynos-powered Galaxy S21 Ultra aren’t losing out by much in this regard, because the difference between the two regional models is narrower than ever. And, as mentioned, in all cases the differences are minimal.",
    "Both Galaxy S21 Ultra and the Note 20 Ultra pack a capacious 12GB of RAM, too, which is more than enough for any tasks you can throw at them. The top 512GB model of the Galaxy S21 Ultra takes things even further with an indulgent 16GB, which is double what most rival Android flagships offer.",
    "Aside from there being a 4G Galaxy Note 20 Ultra available in Australia, these are two firmly 5G-ready phones, so they’re both able to take advantage of cutting-edge mobile network speeds where available.",
    "Away from those internal specifications, the key spec that separates the Galaxy Note 20 Ultra from the Galaxy S21 Ultra is the S Pen. Samsung’s signature stylus is housed neatly within the body of the Note 20 Ultra, and it opens up a whole bunch of cool features via the company’s comprehensive software.",
    "You can whip out your phone and scrawl on the screen without waking it when you want to take a quick note. Or you can open Samsung’s powerful Notes app and have your handwritten musings transcribed into digital text. Budding artists, meanwhile, can compose surprisingly nuanced pictures thanks to the S Pen’s refined handling and analogue pressure sensitivity.",
    "The inclusion of the S Pen would typically help keep the Note relevant for a full year at least, even with the arrival of a new Galaxy S, but this year, the Galaxy S21 Ultra has gained S Pen compatibility – buy yourself an S Pen (it’s not included with the S21 Ultra), and you’ll be able to get a very similar ‘Note’ experience.",
    "It’s not an identical experience, though. In addition to the fact that you have to purchase the stylus separately, there’s nowhere to house it, so you’ll need to buy a bulky case to clip this larger (and admittedly more comfortable) variant to. Given that the Galaxy S21 Ultra is already a little tubby, adding weight is far from desirable.",
    "Also, there isn’t feature parity between these two S Pens, with the Galaxy S21 Ultra variant missing out on the Bluetooth shortcuts for triggering the camera and other apps.",
    "The key reason why the Galaxy S21 Ultra is bigger and heavier than the Galaxy Note 20 Ultra is because it has a much bigger battery.",
    "While the Galaxy Note 20 Ultra has a 4500mAh power pack, the Galaxy S21 Ultra cranks things up to 5000mAh. It also has a more efficient processor, which bodes well for stamina.",
    "Of course, the newer phone needs this leg-up if it’s to run at QHD and 120Hz; there’s a reason Samsung didn’t feel confident about activating this dual mode before.",
    "We described the Galaxy S21 Ultra’s battery life as “solid” in our review. On a typical day of moderate use, we were able to get through a full day without the phone giving out if we stuck to the default 1080p/120Hz settings. When we cranked it up to full QHD/120Hz, however, the battery dropped noticeably quicker.",
    "That QHD/120Hz combo isn’t an issue for the Galaxy Note 20 Ultra, and we got similar all-day performance from its standard FHD/120Hz mode. We would tend to average 20% left in the tank at the end of the day, and those were days filled with taking photos and videos, and watching YouTube on the large screen.",
    "Power users should be happy with either phone, but you might still want to carry a charger with you on extended days out. The addition of 120Hz and 5G has definitely come at a cost to stamina.",
    "Both phones support up to 25W wired charging, which is a little disappointing given that some of Samsung’s rivals have upped their charging tech to 65W. Both phones also support 15W wireless charging, as well as reverse wireless charging.",
    "Given Samsung’s two-pronged approach to its premium smartphone offering, the Samsung Galaxy S21 Ultra and the Samsung Galaxy Note 20 Ultra sit alongside one another as the brand’s current flagship devices.",
    "Thanks to the Galaxy Note 20 Ultra’s impressive design, specs, and performance, it continues to feel fit for purpose as we write this comparison article, seven months after its launch. But the Samsung Galaxy S21 Ultra is a real statement of intent.",
    "The newer phone seems to have been explicitly designed to overshadow its immediate predecessor, with superior performance, a heftier design, a display that’s almost as big, and an improved camera – and it even steals the Galaxy Note 20 Ultra’s signature trick by supporting the S Pen.",
    "That doesn’t mean you should write off the Galaxy Note 20 Ultra though. Its design and S Pen integration are more elegant, and its all-round performance remains competitive. The Galaxy S21 Ultra is the better phone overall, but having seen a price drop since that phone launched, the Galaxy Note 20 Ultra may just be the better buy."
  ],
  "headers": {
    "3": "Samsung Galaxy S21 Ultra vs Samsung Galaxy Note 20 Ultra: price and availability",
    "6": "Design",
    "15": "Display",
    "22": "Camera",
    "30": "Specs and performance",
    "43": "Battery life",
    "50": "Takeaway"
  },
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Samsung Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review"
  }
}