{
  "source": "https://www.techradar.com/news/automated-hiring-software-is-rejecting-millions-of-suitable-job-candidates",
  "title": "Automated job hiring software could have rejected millions of candidates",
  "category": "computing",
  "updated": "2021-09-07T14:42:13Z",
  "author": "mayank-sharma",
  "summary": "Researchers blame software’s strict adherence to very specific parameters",
  "article": [
    "Automated talent management tools that are designed to help the hiring process by weeding out inappropriate applications, are in fact kicking out qualified candidates, even for a slight deviation from the defined criteria for the job.",
    "Compiled by Accenture and the Harvard Business School, the report states that such systems have helped create a new strata of talent that the authors refer to as hidden workers.",
    "The report notes that one of the leading reasons for the constant swelling in the number of hidden workers is the increasing reliance on automated systems such as Applicant Tracking Systems (ATS) and Recruiting Management or Marketing Systems (RMS).",
    "“These systems are vital; however, they are designed to maximize the efficiency of the process. That leads them to hone in on candidates, using very specific parameters, in order to minimize the number of applicants that are actively considered,” note the authors.",
    "The authors suggest that over the years, automation has pervaded virtually all steps of the recruiting process.",
    "Thanks to the use of Artificial Intelligence (AI), machine learning (ML), and natural language processing (NLP), these automated systems sift through an incredible number of applications to identify a limited number of candidates who most closely match specified criteria.",
    "Unfortunately, this means they leave out a whole lot of candidates with minor gaps that the authors argue could’ve been filled with a little training.",
    "Illustrating the fallacies of these automated systems, the researchers say that most use factors such as a college degree or possession of precisely described skills, to match against attributes such as skills, work ethic, and self-efficacy.",
    "Most also use factors such as a gap in full-time employment as a basis for excluding a candidate overruling their other qualifications.",
    "“A large majority (88%) of employers agree, telling us that qualified high-skills candidates are vetted out of the process because they do not match the exact criteria established by the job description. That number rose to 94% in the case of middle-skills workers,” the researchers shared, while suggesting ways businesses can tap into this pool of hidden workers."
  ],
  "headers": {
    "4": "Victims of automation"
  },
  "links": {
    "talent management tools": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "the report": "https://www.hbs.edu/managing-the-future-of-work/Documents/research/hiddenworkers09032021.pdf",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "ML": "https://www.techradar.com/news/what-is-machine-learning",
    "NLP": "https://www.techradar.com/news/over-a-third-of-businesses-are-now-using-ai"
  }
}