{
  "source": "https://www.techradar.com/news/dancing-bears-drones-and-clocks-the-weirdest-alexa-devices-weve-seen-so-far",
  "title": "Dancing bears, drones, and clocks: the weirdest Alexa devices we've seen so far",
  "category": "smart-home",
  "updated": "2021-09-26T10:00:18Z",
  "author": "olivia-tambini",
  "summary": "Alexa really is everywhere",
  "article": [
    "Amazon’s Alexa is probably the most well-known virtual voice assistant in the world, with just under 70% of US smart speaker users projected to use an Echo speaker in 2021.",
    "The voice assistant’s popularity is largely down to the sheer number of things it can do. You can use Alexa to control your smart home devices, set calendar reminders, and even make calls. And it’s not restricted to Amazon’s own devices: there are plenty of third-party wireless speaker and smart home device manufacturers that have added the voice assistant to their own products.",
    "While adding Alexa to a smart speaker seems like a no brainer, there are plenty of strange devices that have been given the AI assistant’s skills. From dancing teddy bears to washing machines, Alexa really is everywhere - and there could be a new influx of Alexa devices coming to your smart home soon.",
    "Amazon has announced that it will hold its annual hardware and services event on September 28 at 9am PST / 12pm EST / 5pm BST - that’s 2am AEST on September 29 if you’re in Australia.",
    "In the run up to the big event, where we could see new Echo speakers as well as upgrades to Amazon Music, Prime Video, and Amazon Luna, we’ve taken a look back at the weirdest devices to get Alexa compatibility.",
    "Having Alexa work with a clock actually seems like a good idea - after all, one of the biggest questions asked of the voice assistant is ‘what’s the time?’, so having that physically represented in the Amazon Echo Wall Clock makes sense.",
    "Priced at $29.99 / £29.99 / AU$49, it comes with a 10-inch clock face with 60 LEDs that light up to indicate timers set on a paired Echo device. Annoyingly, there are no microphones or speakers built-in to the clock itself, so you’ll need to give commands to a separate Alexa speaker.",
    "Like the Alexa Wall Clock, Amazon’s smart microwave only works alongside a separate Echo speaker. As well as working with your voice, the microwave features an Ask Alexa button that you can tap to tell it what’s cooking - Amazon has a number of cooking presets, so you can ask it to ‘reheat coffee’ or ‘cook one potato’.",
    "Costing $59.99 (about £45 / AU$80), the microwave now seems to have been discontinued - at least, it's not available on Amazon at the time of writing. Suppress your snickers, though: as Forbes’ Steve Aquino points out, the Alexa microwave made cooking accessible for those who aren’t able to operate regular buttons by adding a voice option.",
    "Last year’s Amazon hardware event saw a total design refresh for the Echo speaker line up - as well as a continuation of the company’s love affair with drones, with its home security company Ring, taking to the skies. The $250 (about £180 / AU$345) Ring Always Home Cam is an autonomous indoor drone that flies around your home that gives you a live mobile feed of what’s going on if it spots an intruder - pretty futuristic, if not a little voyeuristic. Like other Ring security cameras, you should be able to ask Alexa to show the feed on an Echo Show smart display, fast-forwarding and rewinding with your voice alone. Despite launching a year ago, we still don’t have a firm release date, but the upcoming Amazon event could change that.",
    "Unveiled at CES 2019 (anyone else remember in-person tech events?!), this kitchen range from Sharp consists of a 75-liter oven, a four-door fridge/freezer, a smart dishwasher, and a 10kg washing machine, all supporting commands via Alexa. As Kevin Lynch reported at the time, the washing machine was what really got us going. It’s of skills comprise 22 specialist stain-busting programs, which include a dedicated chocolate cleaning option that will likely be popular with parents.",
    "This is where things get really silly. The Gemmy Twerking Bear does pretty much exactly what you’d expect, shaking its rude thang to the beat of your Amazon Music tracks. When you ask Alexa a question, it will even move its animatronic lips in response, as if Alexa is inhabiting its very soul. Not satisfied with only dancing to music, the Gemmy Twerking Bear also grooves when an Alexa timer, alarm, reminder, or notification is triggered."
  ],
  "headers": {
    "5": "Amazon Echo Wall Clock",
    "7": "Amazon Basics Alexa Microwave",
    "9": "Ring Always Home Cam",
    "10": "Sharp Smart Works with Alexa range",
    "11": "Gemmy Twerking Bear"
  },
  "links": {
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "in 2021": "https://techcrunch.com/2020/02/10/nearly-70-of-u-s-smart-speaker-owners-use-amazon-echo-devices/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAABG4nJDLZ_nl4BJJaLw0JVVLTw04Bxx_x2M34Z9RkC4G8sb4ODxIWPoPA3RnqN1Mb5CdgijzJi2piehtXfawRa_0xeWzMohf_hmQLEcGKlwKwCY7oOrMUPqyo2dHHTZ9RDulnVuDIYwi57nlq59jWKKdlDz5BapJp6WK3GmHrHba",
    "smart home devices": "https://www.techradar.com/reviews/meross-smart-wi-fi-plug-mini-mss110/news/smart-home-devices",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "Amazon has announced": "https://www.techradar.com/news/amazon-is-set-to-launch-new-echo-and-alexa-devices-on-september-24",
    "Echo speakers": "https://www.techradar.com/news/the-best-alexa-speakers",
    "Amazon Music": "https://www.techradar.com/deals/how-much-does-amazon-music-unlimited-cost-and-is-the-price-worth-it?region-switch=IN",
    "Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "Amazon Luna": "https://www.techradar.com/news/amazon-luna-first-look-is-amazons-game-streaming-service-worth-trying",
    "Amazon Echo Wall Clock": "https://www.techradar.com/reviews/amazon-echo-wall-clock-review",
    "Alexa speaker": "https://www.techradar.com/news/the-best-alexa-speakers",
    "Amazon’s smart microwave": "https://www.techradar.com/reviews/amazon-smart-oven/in/news/amazons-alexa-will-soon-be-able-to-help-you-cook-with-your-microwave-or-oven",
    "points out": "https://www.forbes.com/sites/stevenaquino/2021/01/14/the-amazonbasics-microwave-with-alexa-shows-how-gimmicks-are-gold/?sh=1142f3605ce4",
    "Last year’s Amazon hardware event": "https://www.techradar.com/news/everything-from-the-amazon-2020-event-new-echo-speakers-flying-ring-security-cameras-and-amazon-luna",
    "love affair with drones": "https://www.techradar.com/news/incoming-amazon-prime-air-drones-are-one-step-closer-to-takeoff",
    "security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "CES 2019": "https://www.techradar.com/news/the-weirdest-gadgets-from-ces-2019",
    "As Kevin Lynch reported at the time": "https://www.techradar.com/news/sharp-debuts-alexa-powered-oven-fridge-and-washing-machine",
    "Gemmy Twerking Bear": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FGemmy-Twerking-Bear-Bluetooth-Plush%2Fdp%2FB07G3XQ5GB%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3046279409134591000-20"
  }
}