{
  "source": "https://www.techradar.com/news/lg-has-another-rollable-patent-but-it-doesnt-mean-the-smartphone-will-release",
  "title": "LG has another Rollable patent, but it doesn’t mean the smartphone will release",
  "category": "phones",
  "updated": "2021-02-22T13:38:10Z",
  "author": "hamish-hector",
  "summary": "Still might not be rolling out",
  "article": [
    "Despite claims that the LG Rollable may not end up going on sale after all, patents for the foldable phone keep getting published, showing variants on the design for the device. A new design is seemingly pretty similar to LG’s other Rollable patent we saw recently with a few subtle differences, though don’t get your hopes up for a release anytime soon.",
    "MySmartPrice claims to have discovered the patent - which was filed by LG Electronics with CNIPA (China National Intellectual Property Administration) - at the beginning of 2020 and only released to the public on February 12, 2021. However, given how long ago the patent was filed it doesn’t contradict reports that LG is leaving the smartphone market.",
    "Both designs feature a rear-facing second display - though rather than taking up most of the back with a large cutout for the cameras, the new patent shows a much thinner screen. The patent also shows side buttons on the phone’s casing, which were missing from the previous design.",
    "Even if LG diverts its business priorities away from smartphones, it would still own any patents it’s been awarded. LG could then choose to sell or license its patented designs if it wanted to, getting paid by anyone who wants to use them in their own products.",
    "Alternatively, LG could hold onto its designs, either because it someday plans to return to smartphones or wants to implement the ideas into rollable displays for non-smartphone products.",
    "What's most likely, though, is that these were alternative versions of the LG Rollable that the company decided against. For each new product, a company will test multiple versions of it, and only decide on one - perhaps this was a version of LG's rolling device that didn't make the cut."
  ],
  "headers": {
    "3": "What will happen to LG’s patents?"
  },
  "links": {
    "may not end up going on sale after all": "https://www.techradar.com/news/we-might-not-see-the-lg-rollable-go-on-sale-after-all",
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "LG’s other Rollable patent": "https://www.techradar.com/news/lg-rollable-patent-may-have-revealed-the-phones-second-screen-and-more",
    "MySmartPrice": "https://www.mysmartprice.com/gear/upcoming-lg-rollable-smartphone-may-feature-large-secondary-display-patent-reveals/",
    "LG is leaving the smartphone market": "https://www.techradar.com/news/lg-has-revealed-that-it-might-stop-making-smartphones"
  }
}