{
  "source": "https://www.techradar.com/news/huge-growth-in-digital-sales-recorded-for-the-2020-holiday-season",
  "title": "2020 set new records for online sales",
  "category": "computing",
  "updated": "2021-01-13T13:38:37Z",
  "author": "rob-clymo",
  "summary": "The UK alone boosted its digital spend by 73% according to Salesforce data",
  "article": [
    "UK digital sales grew by about 75% in the five days leading up to Christmas according to CRM specialists Salesforce",
    "The company's Salesforce 2020 Holiday Shopping Report indicate that online purchases are up by 50% year-on-year having now reached $1.1 trillion globally.",
    "The ongoing coronavirus pandemic has pushed increasing numbers of consumers towards purchasing goods online via e-commerce websites, with the figure up from $723 billion spent worldwide in 2019.",
    "Sales started increasing in October thanks to heavy discounting during Cyber Week, which produced digital sales of $270 billion globally. The first two weeks of December produced a similarly impressive $181 billion in online sales around the globe.",
    "Click-and-collect style pick-up's boosted sales with many consumers preferring to purchase online and then make use of drive-through collection options. The Salesforce findings show that retailers in the US that offered this service increased digital revenues by around 49% year-on-year.",
    "Spreading the cost of purchases has also proved popular in the 2020 results. Many consumers chose to pay for larger purchases by installments. Indeed, buy-now-pay-later usage saw an increased of 109%, with purchasers taking most advantage of the flexible pay option in the week before Christmas.",
    "Sporting goods and home purchases were the most popular categories for online sales. The former grew by 108% while digital sales of home goods increased by 89%. Food and Beverage sales weren’t far behind showing an 80% increase.",
    "However, a downside to the increased online sales and boost for e-commerce business is returns. Over $300 billion of purchases via the internet are expected to be returned globally, which accounts for around 30% of all purchases made.",
    "\"The 2020 holiday season was defined by the pandemic and forced retailers and brands to innovate quickly with the introduction of services like curbside pickup, virtual concierges and a focus on social, messaging and live streaming to reach shoppers in new ways,” said Rob Garf, VP, Industry Strategy for Retail, Salesforce.",
    "“We expect to see these new innovations remain in 2021 with holiday strategies becoming the new standard that consumers expect from their favorite retailers and brands.”",
    "Salesforce collected data from over one billion shoppers globally in more than 40 countries, using its Commerce Cloud systems, monitoring consumer habits between November 1 and December 31."
  ],
  "headers": {
    "4": "Digital sales"
  },
  "links": {
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "e-commerce websites": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Cyber Week": "https://www.techradar.com/black-friday/black-friday-vs-cyber-monday-whats-the-difference",
    "e-commerce business": "https://www.techradar.com/news/best-ecommerce-hosting"
  }
}