{
  "source": "https://www.techradar.com/news/gaming-laptop-deals-at-newegg-could-save-you-over-dollar400-on-an-rtx-2060-machine",
  "title": "Gaming laptop deals at Newegg could save you over $400 on an RTX 2060 machine",
  "category": "computing",
  "updated": "2021-01-13T12:02:12Z",
  "author": "alex-whitelock",
  "summary": "A superb mid to high range option from Newegg",
  "article": [
    "We're always on the hunt for gaming laptop deals here at TechRadar and today we've spotted a particularly good one in the form of this 15.6-inch Gigabyte Aorus 5 at Newegg for $1,099 (was $1,499).",
    "This Gigabyte Aorus 5 features an RTX 2060 graphics card, 10th gen Intel Core i7-10750H processor, 16GB of RAM, and a 512GB SSD - some superb high-end specs which are coming in at $400 cheaper today. For 1080p gaming, these components should handle high settings without a sweat and the 144Hz screen will also come in especially handy when you're pushing some high frame rates with that graphics card.",
    "Note: You can email Gigabyte for a $100 rebate card after purchase for an even bigger saving on this gaming laptop deal - although we're not sure what kind of saving this actually entails. It could be a simple check to cash in, or it could be some sort of voucher, so we're a little way of saying the total saving here is $500, even though that could in fact be the case.",
    "On more of a budget? We've added a bonus gaming laptop deal in the form of this $300 sale on an MSI GF65 at Best Buy, which is going for just $899 currently. With this particular machine you'll not only be saving some significant cash, but you'll also be securing yourself that RTX 2060 graphics card, albeit with a few trade-offs. This MSI does only have 8GB of RAM, a slightly older processor, and we suspect a 60Hz screen, although it's not specified by Best Buy exactly. Still, this is a great, powerful machine for the money, and perfect if you're looking to get a lot of bang for the buck at this price point.",
    "If you'd like to see a few more options, including more budget orientated alternatives, we recommend checking out our main cheap gaming laptop deals page, where you'll find plenty more great machines from Dell, Acer, Asus, and more."
  ],
  "headers": {
    "4": "Gaming laptop deals"
  },
  "links": {
    "for $1,099 (was $1,499)": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-3450661422128991700&murl=https%3A%2F%2Fwww.newegg.com%2Fp%2FN82E16834725086",
    "Gigabyte Aorus 5": "https://www.techradar.com/reviews/gigabyte-aorus-5-review",
    "for just $899": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-4573746506076536300&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fmsi-gf65-15-6-gaming-laptop-intel-core-i7-8gb-memory-nvidia-geforce-rtx-2060-512gbsolid-state-drive-black%2F6421620.p%3FskuId%3D6421620&article_name=Gaming%20laptop%20deals%20at%20Newegg%20could%20save%20you%20over%20%24400%20on%20an%20RTX%202060%20machine&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fgaming-laptop-deals-at-newegg-could-save-you-over-dollar400-on-an-rtx-2060-machine",
    "cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000"
  }
}