{
  "source": "https://www.techradar.com/news/a-new-xbox-series-xors-dynamic-background-is-available-and-its-perfect-for-halo-fans",
  "title": "A new Xbox Series X|S dynamic background is available, and it’s perfect for Halo fans",
  "category": "gaming",
  "updated": "2021-08-27T09:06:31.510Z",
  "author": "adam-vjestica",
  "summary": "Good to see you, Chief",
  "article": [
    "Halo Infinite fans, rejoice. A new Xbox Serie X|S dynamic background has stealth dropped onto the console like a cloaked Covenant Elite – you know, the ones with the Energy Swords that ruin a perfectly good Legendary run.",
    "The dynamic background, which is only available on Microsoft’s current-gen consoles – sorry, Xbox One owners – features Halo Infinite’s gorgeous cover art, with Master Chief standing prominently in the foreground against the backdrop of Installation 07.",
    "It's the first dynamic background we've seen that specifically centers around an individual game, which means we could see more game-focused themes in the future, like one for Forza Horizon 5.",
    "The release of the new dynamic background joins a whole host of other Halo related announcements, as Microsoft finally unveiled the release date for Master Chief’s next adventure at Gamescom Opening Night Live. The campaign and multiplayer mode for Halo Infinite will be released on December 8, 2021.",
    "Halo Infinite’s impending release is also being celebrated in the form of two new limited edition pieces of hardware: a limited edition Xbox Series X and Xbox Elite Wireless Controller Series 2.",
    "The Halo Infinite limited edition Xbox Series X will be released on December 8, 2021, which features a striking, space-age design, as well as unique flourishes like a blue internal fan and custom, Halo-themed startup sounds.",
    "The limited edition Halo Infinite Xbox Elite Wireless Controller Series 2 is set to release a little earlier on November 15, 2021, and is modeled on Master Chief’s famous Mark VI armor.",
    "If you’d like to use the Halo Infinite dynamic background for yourself, head to Settings > Personalization > My Background > Dynamic Backgrounds and you’ll find it nestled at the end of the row. If you can’t see it right away, try rebooting your console.",
    "One of the criticisms leveled at the Xbox Series X and Xbox Series S at launch was that the familiar UI we’d been using on the Xbox One for the past few years didn’t feel like a generational leap that gamers are used to. In comparison to the PS5, which has a completely redesigned UI, things felt a little dull on Microsoft’s new consoles, but that’s beginning to change.",
    "With the addition of dynamic backgrounds, a feature that was never available on Xbox One, Microsoft console is rife for personalization options, something which is distinctly lacking on PS5. The UI itself will also soon look a lot sharper on 4K displays, as Microsoft is updating the dashboard to output at a higher resolution on Xbox Series X consoles.",
    "Now, if Microsoft could just implement some sort of background music, that would be ace. I’d love to hear the famous Halo monks wailing every time I boot up the console."
  ],
  "headers": {
    "8": "Analysis: The Xbox Series X|S UI is slowly improving"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Gamescom": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Elite Wireless Controller Series 2": "https://www.techradar.com/reviews/xbox-elite-wireless-controller-series-2-review",
    "Halo Infinite limited edition Xbox Series X": "https://www.techradar.com/news/halo-infinite-xbox-series-x-console-is-a-space-themed-monolith-how-to-get-it",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Microsoft is updating the dashboard to output at a higher resolution": "https://www.techradar.com/news/xbox-series-x-is-getting-a-4k-upgrade-but-not-how-you-might-expect"
  }
}