{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-lite-might-launch-in-march-without-a-key-mi-11-feature",
  "title": "Xiaomi Mi 11 Lite might launch in March, without a key Mi 11 feature",
  "category": "phones",
  "updated": "2021-01-06T10:09:30Z",
  "author": "bodhisatwa-ray",
  "summary": "But we have our doubts",
  "article": [
    "The new Xiaomi Mi 11 recently launched without the Lite and Pro versions we were expecting, but a new leak suggests the former phone could be coming soon. There's something about this new information that's off, though – the leak claims the Mi 11 Lite isn't a 5G phone, which seems unlikely.",
    "The leak comes from the Vietnamese YouTube channel The Pixel, which also shared some images and specs of the leaked Mi 11 Lite, listed below. The channel doesn't have a track record of leaking information though, which is another reason to take this with a big pinch of salt.",
    "The Xiaomi Mi 10 series consists of three 5G phones (in fact the Mi 10 Lite was the first affordable handset with 5G compatibility in most regions), and the Mi 10T line also has a 'standard', Lite and Pro model all with 5G compatibility. Yet the new leak suggests the Mi 11 Lite will only be a 4G phone.",
    "We're hesitant to believe Xiaomi would stop its push into 5G and introduce a 4G model into its flagship line, making the new leak hard to believe.",
    "According to The Pixel the Xiaomi Mi 11 Lite will have a screen with a 120Hz refresh rate and possibly a Full HD+ resolution. The leak suggests it'll be an LCD display, but might not have an in-display fingerprint scanner – if that turns out to be the case it's possible the scanner would be side-mounted, as on the Mi 10T line.",
    "The leaker further claims the Xiaomi Mi 11 Lite will come with a Snapdragon 732G chipset paired with 6GB RAM and 128GB storage. That's a 4G chipset, with no 5G modem – and as mentioned, we find this implausible.",
    "The video states that the rear camera setup includes a 64MP main camera, an 8MP secondary lens, and another 5MP one, though it doesn't say what lenses are paired with them.",
    "Besides that, renders shown seem to suggest the smartphone will feature a screen that's flat at the edges (unlike the screen on the Mi 11, which curves at all four sides), and a cut-out for the front camera. On the back, we see a square camera module with the three lenses.",
    "The YouTuber claims that the Mi 11 Lite will be priced at 7,500,000 VND or 8,000,000 VND in Vietnam and will appear by the end of March – that price converts to about $340 / £250 / AU$440. Those price conversions are in the ballpark for the prices we'd expect, but as with everything else about this leak we'll have to wait and see if it turns out to be right."
  ],
  "headers": {
    "4": "Xiaomi Mi 11 Lite: leaked specs"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "5G phone": "https://www.techradar.com/best/best-5g-phones",
    "The Pixel": "https://www.youtube.com/watch?v=Mk57Jf1Cji0&feature=youtu.be&ab_channel=ThePixel",
    "Xiaomi Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Mi 10T": "https://www.techradar.com/news/xiaomi-mi-10t-release-date"
  }
}