{
  "source": "https://www.techradar.com/news/prolific-open-source-developer-named-white-house-director-of-technology",
  "title": "Prolific open source developer named new White House Director of Technology",
  "category": "computing",
  "updated": "2021-01-06T12:10:09Z",
  "author": "mayank-sharma",
  "summary": "A champion of open standards",
  "article": [
    "Long time open source developer and open standards advocate David Recordon has been named the White House Director of Technology by the transition team of incoming President Joe Biden.",
    "A recipient of the Google-O'Reilly Open Source Award, Recordon has worked on several open source projects and is best known for his work with the OpenID and OAuth open standards.",
    "Recordon comes to the White House from the non-profit Chan Zuckerberg Initiative Foundation where he was the VP of infrastructure and security. Before that he was the Engineering Director at Facebook.",
    "Recordon joined Facebook in 2009 to work on open source and standards. He shared his open source journey in an exclusive interview with our sister publication Linux Format magazine, back when he was with the social network.",
    "Recordon is joined by Austin Lee who will serve as his deputy in the White House. Commenting on the appointments, a release from the Biden-Harris transition team says “the technology leaders will play an important role in restoring faith across the federal government by encouraging collaboration to further secure American cyber interests.”",
    "Recordon had earlier served as the first Director of White House Information Technology during President Barack Obama's term. During that time, he worked on IT modernization and cybersecurity issues, according to the release.",
    "Via: ZDNet"
  ],
  "headers": {
    "3": "Second stint"
  },
  "links": {
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "interview": "https://www.techradar.com/news/software/facebook-and-open-source-we-ve-come-a-long-way-933166",
    "ZDNet": "https://www.zdnet.com/article/open-source-developer-and-manager-david-recordon-named-white-house-director-of-technology/"
  }
}