{
  "source": "https://www.techradar.com/news/this-new-gmail-update-could-be-a-major-help-against-email-phishing",
  "title": "This new Gmail update could be a major help against email phishing",
  "category": "computing",
  "updated": "2021-04-30T09:04:50Z",
  "author": "mike-moore",
  "summary": "Better Gmail labelling hopefully means less threats",
  "article": [
    "Google is updating its Gmail service to help users stay safe from the ever-growing threat of email spam and malware.",
    "Going forward, Gmail threads with recipients outside your organization will be now labeled “External”, with a yellow button displayed by the email header at the top of the page.",
    "The “External” label will be visible on Gmail on desktop and Android devices starting from the end of April 2021, with the full roll out expected to take up to 15 days - with Google saying it will provide an update when the feature becomes available on iOS.",
    "\"The “External” label and the reply warning banner and label are helpful reminders for users to treat external messages with caution,\" Google wrote in its Workspace Updates blog. \"This can help avoid unintentionally sharing confidential information with recipients outside of their organization.\"",
    "Google notes that admins can turn these warning labels on or off for their organization, and that secondary and alias domains are exempted from being labeled as “External”.",
    "End users don't need to do anything to experience the new feature, which will be enabled by their admin. All Google Workspace customers will be able to see it, as well as G Suite Basic and Business customers.",
    "The new alert goes alongside the current warning displayed by Gmail asking users if they are happy contacting someone outside of their organization, especially the recipient isn't already in their contacts.",
    "The update comes weeks after Microsoft announced a similar feature for its Outlook service, also aimed at keeping users better protected from email-based threats. After updating to the latest version of Microsoft Outlook, users will see a new external label at the top of emails in their inbox. Tapping on the label will reveal the sender's email address so that users can decide whether or not it is safe to open links or attachments in the email."
  ],
  "headers": {
    "3": "External threats"
  },
  "links": {
    "email": "https://www.techradar.com/news/best-email-provider",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "blog": "https://workspaceupdates.googleblog.com/2021/04/external-label-gmail.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "Outlook service": "https://www.techradar.com/news/new-microsoft-outlook-update-looks-to-keep-all-your-mobile-emails-safe"
  }
}