{
  "source": "https://www.techradar.com/news/how-micheal-keatons-batman-could-fix-the-dc-extended-universe",
  "title": "How Michael Keaton's Batman could fix the DC Extended Universe",
  "category": "entertainment",
  "updated": "2021-01-05T12:51:14Z",
  "author": "gerald-lynch",
  "summary": "A role in the new Flash movie could change the DCU forever",
  "article": [
    "If you’re a fan of Batman’s silver screen adventures, you almost certainly fall into one of two camps – those that are fans of Christian Bale’s gritty and grounded Bruce Wayne, and those that prefer Michael Keaton’s gothic take on the Caped Crusader. There’s a third camp for anyone who favors Val Kilmer, George Clooney or Ben ‘Batfleck’ Affleck, but that’s a camp for idiots.",
    "Fans of the Keaton / Tim Burton era of the Gotham Knight may finally be spotting a bat signal in the sky that they like the look of again. According to DC Films boss Walter Hamada, Michael Keaton is returning as Batman in the 2022 movie The Flash, almost 30 years after hanging up the cowl following 1992’s Batman Returns.",
    "This is potentially great news, not only because Keaton is perhaps the finest Bruce Wayne that cinema has ever seen, but for the potential ramifications an older Batman could have on the wider DC cinematic universe.",
    "Here’s how that could work, and why you should be excited.",
    "Staring Ezra Miller (and teased in the Justice League film), The Flash is essentially a comic book take on the Back to the Future concept – Barry ‘The Flash’ Allen uses his powers to travel back in time to prevent the murder of his mother, but in doing so creates an all-new DC timeline.",
    "In the world of comic books, DC used this so-called ‘Flashpoint’ event to wipe the slate clean of its timeline continuity, kicking off the DC’s ‘New 52’ universe – a jumping-on point for readers who couldn’t keep up with the mounting decades’ worth of comic book lore.",
    "It’s here where Micheal Keaton’s Batman will make an appearance, likely as an older mentor-like figure in the same vein as Samuel L. Jackson’s Nick Fury in the rival Marvel cinematic universe. Though in the original Flashpoint comic, the older Batman character was Thomas Wayne, rather than Bruce.",
    "Such a continuity-shaking event would give ample room for new creative directions for the DC Extended Universe, which, despite box-office success from the likes of Man of Steel and Wonder Woman, hadn’t glued cohesively together by the time the Justice League team-up movie debuted.",
    "A Flashpoint cinematic event, creating alternate universes for these characters to exist in, allows for the in-universe justification of smashing these characters (and in-contract actors) together with a degree of plausibility. Keaton can coexist alongside Pattinson, while a potentially-returning Henry Caville-shaped Superman could appear with them, as could Jason Mamoa’s well-received (and very bankable) Aquaman and Gal Gadot’s Wonder Woman.",
    "Keaton’s Batman could be offered a new lease of life too – an older Batman would allow for live action takes on Batman Beyond (where Wayne mentors a younger breed of Batfolk), or even a Dark Knight Returns adaptation – often considered the finest of Bat tales.",
    "And then there are the unfinished threads of Tim Burton’s Batman films themselves. What happened to Michelle Pfeiffer’s Selina Kyle? What if Billy Dee Williams’ Harvey Dent had made the transformation to Two-Face? The possibilities are near endless, and Keaton’s return would allow a very messy DC slate to be wiped clean."
  ],
  "headers": {
    "4": "A Flashpoint universe",
    "8": "Creative possibilities, cameos and more"
  },
  "links": {
    "Michael Keaton is returning as Batman": "https://www.techradar.com/news/dc-confirms-michael-keaton-will-return-as-batman"
  }
}