{
  "source": "https://www.techradar.com/news/students-can-now-create-websites-for-free-with-namecheap",
  "title": "Students can now create websites for free with Namecheap",
  "category": "computing",
  "updated": "2021-12-01T21:42:02Z",
  "author": "abigail-opiah",
  "summary": "400,000 students have received a .me domain since 2014",
  "article": [
    "US-based domain registrar and web hosting firm Namecheap has extended its complimentary services to students returning to school from the summer holidays by offering a free .me domain name and hosting services from GitHub.",
    "The company said the initiative was put in place to encourage students to kickstart building their online presence with their first website, online portfolio or blog.",
    "So far, almost 400,000 students have claimed their free .me domain since Namecheap launched the program in 2014.",
    "The most domains registered through the 'Namecheap for Education' program came from the University of Waterloo in Canada where students have registered 3,344 free .me domains to date.",
    "Namecheap is encouraging students who have a .edu email address to take part in 'Namecheap for Education' initiative.",
    "The company also ran a seven-day sale for students and teachers and offered price cuts on digital products and productivity tools.",
    "“Virtually every college student in the US, UK, Canada, Australia, and many other locations around the world (with .edu or college email address) is eligible to take part in the free website program,\" Namecheap said.",
    "The company also supported the initiative by releasing a 20-minute virtual class for educators to use and teach students and online novices the Internet basics.",
    "The lesson is still available on Namecheap’s YouTube channel and includes a step by step guide on how to build and launch a website for the first time.",
    "Back in February 2021, Namecheap launched its own website builder, known by the name ‘Visual’, which offers a range of creative design tools."
  ],
  "headers": {
    "3": "Student websites"
  },
  "links": {
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Namecheap": "https://www.techradar.com/reviews/namecheap",
    "blog": "https://www.techradar.com/news/the-best-free-blogging-sites",
    "free website": "https://www.techradar.com/news/the-best-free-website-builder",
    "Namecheap launched its own website builder": "https://www.techradar.com/news/namecheap-launches-new-website-builder"
  }
}