{
  "source": "https://www.techradar.com/news/israels-web-hosting-rating-could-boost-online-security-worldwide",
  "title": "Israel's new web hosting rankings could boost online security worldwide",
  "category": "computing",
  "updated": "2021-04-23T12:39:29Z",
  "author": "abigail-opiah",
  "summary": "Platinum, gold and silver ranks could offer web hosting customers greater clarity over data security measures",
  "article": [
    "Israel's National Cyber Directorate is trialling a new safety benchmark system for web hosting security which, if successful, could have implications worldwide.",
    "The program demands website hosting services showcase the measures in place to keep their customers' sensitive data secure.",
    "As with any other type of ranking system, the new benchmark scheme will provide a way for businesses to identify the most secure web hosting services, based on how each service is ranked.",
    "Depending on the outcome of the trial, it may not take long for this type of ranking system to make its way to other countries across the globe.",
    "In May of last year, thousands of Israeli websites were hacked and defaced with anti-Israel messages, all because the hacker gained access to just one local WordPress hosting provider.",
    "More than 2,000 websites were hit with malicious code seeking permission to access visitors' webcams.",
    "According to a report from the Times of Israel, the new program will have three levels of security; web hosting service providers will fall under gold, silver or platinum depending on their ranking.",
    "Should the idea materialize, the web hosting providers will be put through a series of tests by The National Cyber Directorate, although the program will be purely voluntary.",
    "The goal of the scheme is to serve as a protection tool for websites in Israel and ultimately establish a new set of security standards.",
    "The report explained the directorate will recommend the silver ranking as the minimum standard of security, while the gold ranking will be for websites equipped to handle personally identifiable information (PII).",
    "The platinum ranking, meanwhile, will be reserved for websites that offer the necessary level of security for financial transactions.",
    "Via The Times of Israel"
  ],
  "headers": {
    "4": "Web hosting rating"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "WordPress hosting provider": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "webcams": "https://www.techradar.com/best/best-business-webcams",
    "The Times of Israel": "https://www.timesofisrael.com/israels-cybersecurity-watchdog-seeks-to-rate-security-of-web-hosts/"
  }
}