{
  "source": "https://www.techradar.com/news/intel-and-google-are-working-on-a-new-breed-of-server-chip",
  "title": "Intel and Google are working on a new breed of server chip",
  "category": "computing",
  "updated": "2021-10-28T14:13:15Z",
  "author": "mayank-sharma",
  "summary": "New chip will be made available to customers everywhere",
  "article": [
    "Intel and Google Cloud have announced that they are working together to create a new category of chips, one that Intel hopes will find large scale acceptance in the broader cloud computing market.",
    "To that end, while Intel is working on the new chip, called Mount Evans with Google, Reuters reports that the chip will be offered to other cloud vendors as well.",
    "The Mount Evans chip, which Google and Intel are referring to as an \"infrastructure processing unit\" (IPU), is designed keeping in mind the specific demands and peculiarities of cloud computing environments.",
    "\"We see this as strategically vital. It's an extremely important area for us and for the data center,\" Nick McKeown, senior vice president of the network and edge group at Intel, told Reuters.",
    "According to reports, the IPU takes special care of cloud-specific tasks, separating them from the main computing tasks, in order to speed them up.",
    "A positive side-effect of separating these tasks is that it’ll also help ensure the safety of those functions against hackers, while adding flexibility to the data center.",
    "\"As traffic and data comes in from the networks, its job is to figure out where does it go to next,\" Nick McKeown, Intel's vice president of communications and networking, told Protocol.",
    "Furthermore, in addition to the hardware itself, Intel and Google are also said to be developing a set of software tools, which will be offered for free to help other customers induct the chip into their data centers, perhaps to help tweak them as per their specific workloads and demands.",
    "Protocol says that Mount Evans is Intel's first application-specific integrated circuit (ASIC) built under the company's IPU business, and will support up to four Xeon processors.",
    "Earlier in the year, Intel CEO Pat Gelsinger had announced his IDM 2.0 vision, an overhauled take on Intel’s integrated device manufacturing (IDM) model, which would see the company manufacture chips for clients. It isn’t immediately clear if the collaboration with Google is part of this new strategy, but it does have all the hallmarks of one."
  ],
  "headers": {
    "4": "Designed for the cloud"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Google Cloud": "https://www.techradar.com/news/microsoft-azure-and-google-cloud-results-soar-as-the-world-goes-digital",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Reuters reports": "https://www.reuters.com/technology/intel-teams-with-google-cloud-develop-new-class-data-center-chip-2021-10-27/",
    "data center": "https://www.techradar.com/pro/data-centre-cloud",
    "Protocol": "https://www.protocol.com/enterprise/intel-mount-evans-google-cloud",
    "IDM 2.0 vision": "https://www.techradar.com/news/intel-records-mixed-q1-but-pc-sales-offer-a-silver-lining"
  }
}