{
  "source": "https://www.techradar.com/news/this-is-what-an-iphone-with-usb-c-could-be-like",
  "title": "This is what an iPhone with USB-C could be like",
  "category": "phones",
  "updated": "2021-10-12T10:40:26Z",
  "author": "james-rogerson",
  "summary": "What could have been – and what might one day be",
  "article": [
    "While just about every non-Apple smartphone (and most other portable gadgets) charges over USB-C, Apple has stubbornly stuck with its proprietary Lightning connector, but now a talented robotics student has shown what could have been.",
    "Ken Pillonel has for a while been working on modifying an iPhone so that it both charges and transfers data via USB-C, and he’s finally completed his project.",
    "In a short YouTube video (below) you can see the result. It’s an iPhone that looks unspoiled, except there’s a USB-C port in place of the Lightning port, and you can see that it starts charging when plugged in.",
    "It’s an impressive outcome, and Pillonel claims that he’ll have a video up showing how he achieved this before long. In the meantime, he already has an older video showing the start of his USB-C journey.",
    "This probably isn’t a modification that you’re going to want to do for yourself. While we haven’t seen the full process, we imagine that it’s lengthy and challenging. Still, this shows that it’s possible without any real redesigns to the iPhone.",
    "If you’re hoping that an iPhone with USB-C could one day become a reality without having to make it yourself, you could be in luck, as the EU wants that to happen too.",
    "It’s announced plans to make USB-C be the universal charging standard for smartphones and most other portable devices – which would mean Apple would have to include a USB-C port for any phones sold in the EU. And if it had to do that, it’s likely that it would switch to USB-C for the rest of the world too.",
    "Don’t get too excited though. These plans aren’t finalized and even if and when they are, Apple will have 24 months to make the change. Plus, Apple could always choose to make the iPhone portless instead and rely purely on wireless charging. That should technically satisfy the terms of the law.",
    "Still, a USB-C iPhone is much less of a fantasy now than it once was, and given how convenient it is to be able to charge everything with one cable, it could be a positive change.",
    "Via PocketLint and Reddit"
  ],
  "headers": {
    "5": "Analysis: a real USB-C iPhone could be on the way"
  },
  "links": {
    "YouTube video": "https://www.youtube.com/watch?v=SAekbJf4Gsw",
    "an older video": "https://www.youtube.com/watch?v=WCEzdj_8YwU",
    "the EU wants that to happen too": "https://www.techradar.com/news/iphone-lightning-port-ban",
    "PocketLint": "https://www.pocket-lint.com/phones/news/apple/158681-this-guy-built-the-world-s-first-iphone-with-usb-c",
    "Reddit": "https://www.reddit.com/r/apple/comments/q50lf5/worlds_first_usbc_iphone_mod/"
  }
}