{
  "source": "https://www.techradar.com/news/how-to-watch-modern-love-season-2-online-stream-every-new-episode-of-the-amazon-original-show",
  "title": "How to watch Modern Love season 2 online: stream every new episode of the Amazon Original show",
  "category": "computing",
  "updated": "2021-08-12T21:30:50Z",
  "author": "daniel-pateman",
  "summary": "Fall in love again with this star-studded show",
  "article": [
    "Fancy snuggling up with a selection of stories about lovelorn couples experiencing the rollercoaster ride of human relationships in their various forms? Then you’ll want to read our guide about how to watch Modern Love season 2 online, an Amazon Prime original series with an excellent cast and inspired by The New York Times column of the same name.",
    "Since 2004, the eponymous column has featured weekly personal essays by New Yorkers sharing their take on intimacy in the 21st Century. That’s ample material for this Amazon Original series to draw on, whose second series consists of eight 30-minute-long episodes: each variously charting the thrill of new love, romantic desire, the platonic bonds of friendship, familial affection, and love lost or unrequited.",
    "While the show’s debut was New York-centric, season 2 will see love blossom further afield. Kit Harrington and Lucy Boynton feel the initial kindling of attraction on a train journey through Dublin, but their attempted reunion is stalled when the pandemic erupts. Meanwhile, in the London-set “Second Embrace, With Hearts and Eyes Open”, a divorced couple (Sophie Okonedo and Tobias Menzies) begin a passionate reconnection, heightened when one of them receives a life-changing medical diagnosis.",
    "Uniting another impressive group of A-listers, among them Minnie Driver, Anna Paquin, Jack Reynor, Miranda Richardson and Garrett Hedlund, Modern Love continues to woo viewers with its varied depictions of that difficult to define emotion. Keep reading as we explain below how to watch Modern Love season 2 online when you subscribe to Amazon Prime Video.",
    "If you're a Prime Video subscriber and find yourself stuck in a country where the service isn't available, or you can’t access the same content provided back home, then that's probably down to geo-blocking restrictions.",
    "Luckily, there’s a simple solution. Downloading a VPN will let you to watch Modern Love season 2 online no matter where you are, simply by changing your IP address to one that's back in your country of residence. Now, here's how to get started with this essential bit of streaming software.",
    "More from Amazon Prime:"
  ],
  "headers": {
    "4": "How to watch Modern Love season 2 from abroad"
  },
  "links": {
    "Amazon Prime Video": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Famazonprime%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1968956684139044400-20",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}