{
  "source": "https://www.techradar.com/news/android-12-looks-set-to-borrow-one-of-the-best-ios-features-wi-fi-sharing",
  "title": "Android 12 looks set to borrow one of the best iOS features - Wi-Fi sharing",
  "category": "phones",
  "updated": "2021-01-21T09:15:54Z",
  "author": "tom-bedford",
  "summary": "A real Android improvement",
  "article": [
    "While Android 11 didn't bring many new features to Android phones it seems 2021's version of the Google-built software will, as we've now heard about one great Android 12 feature.",
    "This comes from GizChina, which spotted a new entry to the Android Open Source Project (AOSP) regarding a 'Share Wi-Fi' feature. This apparently shares Wi-Fi passwords with nearby devices of your choosing, even ones in other rooms to you.",
    "Android is open-source software, meaning people can copy it, tweak it, and make it their own if they want - indeed most phone makers do so for their own handsets. New entries to it, and changes to the source code (as this is) are therefore likely to be new Android features.",
    "This new AOSP entry hasn't been 'merged' yet, which basically means it's not official, but since it came from a Google engineer it could get merged soon. Until then we can't say for sure if it's coming to Android 12, but by the sounds of it, we'd sure hope so.",
    "Current builds of Android let you share Wi-Fi via QR codes, so if you're connected to the Wi-Fi you can get your phone to provide a QR code, and the person who needs the Wi-Fi can scan the code to get access to the internet.",
    "The system works, but it can be a bit fiddly, especially for people who don't know how to scan QR codes or don't have a readily-available scan app.",
    "Apple products like those on iOS, iPadOS and macOS have a much better system - if somebody near you starts trying to connect to the internet, a prompt appears on your device letting you share your Wi-Fi information with them. It's particularly handy if you've got multiple devices you're trying to connect to the web.",
    "That's a beloved feature among Apple fans, and it certainly is handy, so a similar feature in Android phones would be appreciated.",
    "We'll have to wait and see if this feature does make its way to Android 12 at the end of the year when that operating system is set to launch, though the roll-out of various betas in the first half of the year should give us some clues."
  ],
  "headers": {
    "4": "An iOS feature"
  },
  "links": {
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "GizChina": "https://www.gizchina.com/2021/01/20/android-12-will-allow-users-to-share-wifi-passwords-via-the-share-nearby-function/"
  }
}