{
  "source": "https://www.techradar.com/news/cybersecurity-in-a-5g-post-covid-future",
  "title": "Cybersecurity in a 5G post-COVID future",
  "category": "computing",
  "updated": "2021-03-22T12:03:14Z",
  "author": "alexander-schlager",
  "summary": "The impact of 5G and COVID-19 on the security landscape",
  "article": [
    "The threat from cybercriminals is omnipresent and unceasing. Their approach to cybercrime is becoming increasingly sophisticated. Their tools, techniques, and technologies are evolving at rapid speeds. And they need only expose one weakness in an organization’s defenses, and the walls can come crashing down.",
    "While 5G has been branded as the great enabler, unlocking a wealth of exciting new technologies and experiences, it has also presented cybercriminals with new opportunities to evolve their attack methods and gain access to a company’s infrastructure.",
    "The COVID-19 pandemic has created even more challenges for CIOs and security teams, sparking a surge in cybercrime across the globe. Here, we take a look at some of the key cybersecurity trends to be aware of as we usher in the new, 5G-powered age, and how the pandemic has thrust these security issues into even sharper focus.",
    "While it always pays to approach cybersecurity with scrupulous detail, the industry has learned many lessons over the years that will put us in good stead when it comes to 5G security. Indeed, many of the key learnings from 3G and 4G security have already been embedded into the 5G architecture.",
    "What’s more, security is the central pillar of the 3rd Generation Partnership Project (3GPP) – the collective of standard development organization for mobile telecoms – around which all its standards are built. This means a huge range of new capabilities and architecture concepts have been built into 5G, helping network transport be inherently more secure.",
    "Despite all this, vulnerabilities will always exist. That’s why 5G also enables Zero Trust, which means no component of a network can execute any action or transmit any data to another entity without being authenticated and authorized.",
    "Additionally, 5G incorporates comprehensive encryption standards and encryption methodologies, so data is secured and encrypted in transit. There’s no doubting that, despite the rise in cybercrime sparked by the COVID-19 pandemic, 5G is the most secure generation technology in history.",
    "Regardless of 5G’s robust security standards and Zero Trust approach, vulnerabilities will always exist. And while 5G doesn’t inherently create more risks, enterprises must be able to recognize the dangers associated with the new use cases that 5G enables, particularly around the proliferation of IoT and increasing connectivity between devices.",
    "To meet these security issues head on, organizations must abandon the historical approach of building security from the bottom up. It’s time to flip this logic and build security capabilities with individual use cases in mind. By examining the risk exposure and worst-case scenarios of each use case, companies need to build security for each application, while enabling fast and effective capabilities. Effort should be proportional to the risk, meaning each use case should be treated differently.",
    "There’s no doubting that 5G will enable a plethora of exciting new opportunities, but if security risks aren’t addressed, consumer trust will quickly erode and disappear. And businesses can’t build that consumer trust in the first place if they’re unable to demonstrate how they protect 5G-enabled environments.",
    "There’s no arguing that the pandemic changed everything – across every sector and industry imaginable. In terms of cybersecurity, if anything, the pandemic threw the need for a more robust security structure into even sharper context.",
    "The remote nature of today’s workforce has exposed a multitude of new cybersecurity risks. For example, the widespread and rapid migration to cloud to enable remote working has resulted in a much broader attack surface for cybercriminals looking to find ways into an organization.",
    "Pre-COVID-19, cybercriminals were successfully using tried and tested methods to penetrate businesses and obtain sensitive data. It goes without saying that if these tactics worked in a stable business environment, they’ve been working even better in an era of such disruption and uncertainty. Even tech giants like Microsoft, Facebook and Twitter have suffered attacks, alongside state and government services.",
    "So far, we have seen three common threat methods increase throughout the pandemic:",
    "5G brings opportunity and challenges in equal measure, especially around cybersecurity. And, while there’s no denying that the rise of new, 5G-enabled use cases will invite more cyberattacks, our ability to cope and adapt to the disruption and uncertainty of 2020 serves as a key learning moving forwards.",
    "The pandemic helped us all realize that we can move quicker than we thought possible, and in security terms, it highlighted the need for a more robust – yet bespoke – cybersecurity infrastructure: an infrastructure that will serve the needs of a 5G-powered world, with security sitting at the very heart of it."
  ],
  "headers": {
    "3": "Zero Trust cybersecurity with 5G",
    "7": "A new way of building security",
    "10": "The impact of COVID-19 on global cybersecurity",
    "14": "Security lessons learned"
  },
  "links": {
    "5G": "https://www.techradar.com/best/best-5g-phones",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "data": "https://www.techradar.com/best/best-data-recovery-software",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "cloud": "https://www.techradar.com/best/best-cloud-backup",
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams"
  }
}