{
  "source": "https://www.techradar.com/news/oracle-offers-to-migrate-business-apps-to-its-cloud-for-free",
  "title": "Oracle offers to migrate business apps to its cloud for free",
  "category": "computing",
  "updated": "2021-03-31T13:49:23Z",
  "author": "mayank-sharma",
  "summary": "Oracle’s offer is open to both existing and new customers",
  "article": [
    "Oracle has announced a new program that will help customers migrate their business workloads to its cloud computing service - for free.",
    "The Oracle Cloud Lift Service program has reportedly helped over a hundred enterprises already and is now open to existing and new Oracle Cloud customers as well.",
    "“Our customers want a seamless path to the cloud with the right guidance, solution architecture, and hands-on help we can provide,” said Oracle Cloud Infrastructure’s senior vice president Vinay Kumar.",
    "As part of the program, Oracle will give Oracle Cloud customers access to technical tools as well as its cloud specialized engineering resources to enable them to transition to the cloud.",
    "The company shares that it will help customers through the entire migration process from planning, architecting, to prototyping and managing the transition.",
    "Speaking to Reuters, Kumar shared that Oracle has already earmarked a thousand personnel to focus on Cloud Lift Services. In addition to the hands-on migration support, the company will also provide post-migration support as well.",
    "While the program apparently doesn’t require any commitments in return for the free service, it will reportedly be limited to a handful of applications that are particularly difficult for the customer.",
    "Via: Reuters"
  ],
  "headers": {
    "3": "No minimum commitments"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "migration": "https://www.techradar.com/best/best-data-migration-tools",
    "Reuters": "https://www.reuters.com/article/idUSKBN2BN1LQ"
  }
}