{
  "source": "https://www.techradar.com/news/ibm-snaps-up-taos-in-latest-cloud-push",
  "title": "IBM snaps up Taos in latest cloud push",
  "category": "computing",
  "updated": "2021-01-15T12:43:08Z",
  "author": "barclay-ballard",
  "summary": "Purchase will help IBM ramp up its cloud capabilities",
  "article": [
    "Technology giant IBM has announced that it has agreed to acquire managed service provider Taos in an undisclosed deal.",
    "The purchase will help IBM ramp up its cloud migration and transformation capabilities.",
    "Taos has more than 30 years of experience in the enterprise technology space and has garnered a reputation as one of the leading managed service providers in the US. The company has also created strong partnerships with cloud industry players, including Microsoft Azure, Google Cloud, and AWS.",
    "IBM’s decision to invest further in its long-term cloud strategy is likely to have been influenced by events of the last twelve months. The COVID-19 pandemic has meant that many businesses have had to rely on cloud solutions to help them deliver essential services. The cloud professional services market is expected to grow beyond $200 billion by 2024, with many organizations using multiple hybrid cloud environments to meet their IT needs.",
    "IBM will be hoping that this trend continues, with businesses coming to rely increasingly on outsourced IT support from managed service providers. With cloud solutions becoming more popular, this looks like a safe bet but internal IT staff may put up some resistance to bringing in outside service providers.",
    "As always, the acquisition of Taos by IBM is subject to the usual regulatory conditions and is expected to close in the first quarter of this year.",
    "\"Taos adds the deep expertise, public cloud partnerships and innovative solutions needed to drive growth and adoption of IBM's hybrid cloud platform throughout the Americas,\" John Granger, Senior Vice President of Cloud Application Innovation and Chief Operating Officer at IBM Global Business Services, said.",
    "\"The platform gives enterprises the freedom to choose from multiple providers to best meet their business and IT needs, and we are committed to helping our clients successfully navigate their open hybrid cloud journeys with those providers.\"",
    "Via Venture Beat"
  ],
  "headers": {
    "3": "Cloud competition"
  },
  "links": {
    "IBM": "https://www.techradar.com/news/ibm-most-companies-woefully-ill-prepared-for-digital-future",
    "said": "https://newsroom.ibm.com/2021-01-14-IBM-Boosts-Its-Hybrid-Cloud-Consulting-Capability-with-Taos",
    "Venture Beat": "https://venturebeat.com/2021/01/14/ibm-acquires-taos-to-supplement-its-cloud-expertise-as-workloads-shift/"
  }
}