{
  "source": "https://www.techradar.com/news/elden-ring-may-look-amazing-even-on-xbox-one-consoles",
  "title": "Elden Ring may look amazing even on Xbox One consoles",
  "category": "gaming",
  "updated": "2021-10-18T10:24:58Z",
  "author": "gerald-lynch",
  "summary": "Leaked footage points to Elden Ring being beautiful on older machines, too",
  "article": [
    "It’s perhaps the most anticipated game of this nascent generation of consoles – but you might not need an Xbox Series X or PS5, to be wowed by Elden Ring’s gorgeous looks.",
    "A new leak of alleged footage from the game shows Elden Ring running on what is said to be an Xbox One-generation console – likely an Xbox One X, given the solid framerate.",
    "Posted by Gamebeat’s Jeff Grub to his Twitter page, it’s a rather sedate clip. The player character is shown standing on a cliff edge, with a huge glowing tree behind them. The camera spins around to show a distant city across a large open plain, while a few eagles fly away as the player approaches them, feathers fluttering to the ground as they take off.",
    "According to a follow up from The Washington Post’s Gene Park, this isn’t footage from a recent press showing either, suggesting that this is indeed a clip from the near-final game build.",
    "What’s most fascinating here is just how good the last-generation footage looks – if indeed it is a last-generation clip. The game is headed to the new Xbox Series X and S consoles, PS5, PC and older Xbox One and PS4 machines. But on the (admittedly slim) basis of this footage, you might wonder why anyone would bother upgrading to the new systems at all.",
    "The cross-gen divide right now is a bit of a double-edged sword. At present, it’s still difficult to pick up the newer consoles, with stock remaining low since launch. So being able to play top-notch versions of the same games across generations is welcome for those that haven’t had any luck so far.",
    "But on the other hand, there’s still the sense that, for the majority of cross-gen releases, we’re not really seeing the power of the newer machines being harnessed, making the purchase of the expensive latest-generation consoles seem a bit premature.",
    "For now we can take comfort in the fact that Elden Ring looks though it will be a blast whatever console you manage to play it on. But it is now perhaps tempering our expectations as to what future-gazing newer console delights it will be serving up."
  ],
  "headers": {
    "4": "Analysis: True next-gen?"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "The Washington Post’s Gene Park": "https://twitter.com/JeffGrubb/status/1449446404070412289"
  }
}