{
  "source": "https://www.techradar.com/news/amd-rx-6700-and-6600-xt-gpus-could-both-load-up-with-12gb-vram",
  "title": "AMD RX 6700 and 6600 XT GPUs could both load up with 12GB VRAM",
  "category": "components",
  "updated": "2021-03-11T11:40:19Z",
  "author": "darren-allan",
  "summary": "12GB all-round for mid-range Navi 22 GPUs, perhaps?",
  "article": [
    "AMD’s graphics cards which are expected to follow the recently launched Radeon RX 6700 XT could all run with 12GB of GDDR6 RAM, going by the latest leak surrounding the firm’s Navi 22-powered GPUs.",
    "The RX 6700 is purportedly in the pipeline, along with the RX 6600 XT, and both have recently turned up in filings with the EEC (Eurasian Economic Commission), with entries for the former just spotted by VideoCardz.",
    "Filings with the EEC usually occur not long before a hardware product is likely to launch, sometimes giving away spec details like this in the model names, and the latest graphics cards uncovered are two Asus Phoenix models of the RX 6700, both listed with 12GB of RAM.",
    "This is interesting news because previously, RX 6700 products (from ASRock and PowerColor) were spotted in EEC listings with 6GB of video memory, whereas RX 6600 XT models appeared with a 12GB VRAM loadout. So it was thought that AMD might be taking a similar route to Nvidia in terms of having a lesser GPU with more video memory (the situation with the RTX 3060 Ti and vanilla 3060, though remember that quantity is far from everything – the Ti card boasts faster memory).",
    "At any rate, it seems that this is now not the plan for AMD, and these (still only rumored) Navi 22 cards could all have a uniform 12GB of memory on-board.",
    "It would certainly make sense for the RX 6700 to go with 12GB, in terms of making it competitive with Nvidia’s RTX 3060 (which has 12GB), although what could happen is that the RX 6600 XT is nerfed down to 6GB (if there has been a change of plans, there could be repercussions elsewhere).",
    "With the Navi 22 cards all employing a 192-bit memory bus, AMD can either run with 6GB or 12GB of video memory, but as ever, we’ll just have to wait and see exactly how this pans out.",
    "How quickly AMD will flesh out its more wallet-friendly RX 6000 offerings, obviously we don’t know – but of course given all the chatter around production problems and stock shortages, we can only guess that pushing forward with new launches will be tempered appropriately given the overall continuing picture with manufacturing.",
    "AMD’s new RX 6700 XT – which is positioned to go up against Nvidia’s RTX 3070 GPU – is the model underneath its existing Big Navi offerings, the RX 6900 XT, RX 6800 XT and RX 6800."
  ],
  "headers": {
    "5": "Staying competitive?"
  },
  "links": {
    "recently launched Radeon RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "VideoCardz": "https://videocardz.com/newz/asus-radeon-rx-6700-phoenix-non-xt-spotted-with-12gb-at-eec",
    "Nvidia’s RTX 3060": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-find-stock-here",
    "Nvidia’s RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "RX 6900 XT": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
    "RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800"
  }
}