{
  "source": "https://www.techradar.com/news/us-holds-30-nation-ransomware-summit-but-without-russia-or-china",
  "title": "US holds 30 nation ransomware summit - but without Russia or China",
  "category": "computing",
  "updated": "2021-10-14T14:18:18Z",
  "author": "mayank-sharma",
  "summary": "Russia could be part of future meetings, suggest US officials",
  "article": [
    "The US has convened a two-day virtual event to discuss matters of cybersecurity with representatives from 30 countries around the world, as promised by President Biden earlier in October.",
    "The meeting dubbed the “Counter-Ransomware Initiative” is part of the Biden administration’s effort to quash the emerging threat of ransomware.",
    "While the meeting has representatives from US’ NATO allies and G7 countries, Russia and China are inconspicuous by their absence.",
    "“In this first round of discussions we did not invite the Russians to participate for a host of reasons,” a senior administration official told reporters during a call earlier in the week.",
    "An unnamed National Security Council spokesperson later told The Record that the decision to not extend an invitation to China was a conscious one as well.",
    "The Senior administration official reportedly said that holding the first meeting without Russia doesn’t “preclude future opportunities for them to participate as we do further sessions.”",
    "Tensions on the cybersecurity front between Russia and US have been brewing ever since it emerged that a majority of ransomware operators and cybercriminals, such as the ones that targeted Colonial Pipeline, and forced the shutdown of one of the major fuel pipelines in the country, operate out of Russia or one of the other former Soviet states.",
    "Following the revelations, President Biden met his Russian counterpart President Putin on the sidelines of the Geneva Summit earlier in the year, reportedly to discuss Russia’s apparent inaction against the cyber outlaws.",
    "The administration official added that there have been “candid and direct” talks within the experts group that was established after the meeting of the two Presidents about the actions US expects from Russia against ransomware gangs operating inside its borders.",
    "“We’ve seen some steps by the Russian government and are looking to see follow-up actions,” the official claimed without elaborating. However he asserted that there will be future meetings, and that Russia could be a part of those if it takes decisive actions against the threat actors.",
    "Via The Record"
  ],
  "headers": {
    "5": "Show of intent"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "promised by President Biden": "https://www.techradar.com/news/president-biden-wants-to-kill-off-ransomware-for-good",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "forced the shutdown": "https://www.techradar.com/news/major-us-fuel-pipeline-taken-down-by-ransomware-attack",
    "Russia or one of the other former Soviet states": "https://www.techradar.com/news/this-weird-hack-might-help-keep-your-pc-safe-from-russian-hackers",
    "met his Russian counterpart": "https://www.techradar.com/news/biden-putin-talks-look-to-draw-line-under-infrastructure-cyberattacks",
    "The Record": "https://therecord.media/u-s-convenes-30-countries-on-ransomware-threat-without-russia-or-china/"
  }
}