{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-active-4-renders-give-us-our-first-look-at-the-likely-design",
  "title": "Samsung Galaxy Watch Active 4 renders give us our first look at the likely design",
  "category": "wearables",
  "updated": "2021-06-24T09:29:27Z",
  "author": "james-rogerson",
  "summary": "Shown in four colors",
  "article": [
    "We’ve heard a bunch of things about the Samsung Galaxy Watch Active 4, but only now are we getting a look at the possible design of the wearable, and it looks a lot like the Samsung Galaxy Watch Active 2, but with some key changes.",
    "Unofficial renders supplied to GizNext by @OnLeaks (a leaker with a great track record) show the Samsung Galaxy Watch Active 4 as having a circular screen, but with flatter edges than the Galaxy Watch Active 2, and a different shape to the buttons.",
    "Those buttons also appear more prominent, so they’re likely to be easier to find and tap without looking, and unlike the Galaxy Watch Active 2 there’s no gap between the strap and the body.",
    "This leak also includes other details, adding that the Samsung Galaxy Watch Active 4 will apparently have an aluminum body and come in 40mm and 44mm sizes. That’s the same as the Watch Active 2, but is also at odds with a previous leak, which suggested the largest size would be just 42mm.",
    "Additionally, the wearable will apparently come in the black, silver, green and gold shades you can see above, though the source notes that these colors might not be represented accurately in the renders.",
    "As for the specs, this leak agrees with earlier claims that the Samsung Galaxy Watch Active 4 will have a new 5nm chipset, will run Google’s overhauled Wear OS that’s set to land later this year, and will have narrow bezels, with flat 2D glass on the screen.",
    "Finally, the Samsung Galaxy Watch Active 4 will apparently cost under Rs 30,000 (around $400 / £290 / AU$530) and be launched on June 28. However we’d take that last claim with a real pinch of salt, as while Samsung is holding an event on that date, it’s thought to be focused on smartwatch software rather than hardware, and we’ve elsewhere heard that the wearable might not land until August 3.",
    "Still, either way it’s probably not too far off now, and with the Samsung Galaxy Watch 4 likely landing alongside it, this could be an exciting time for smartwatch fans.",
    "Via PhoneArena"
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "GizNext": "https://www.giznext.com/news/giznext-exclusive-samsung-galaxy-watch-active-4-5k-renders-details/",
    "the largest size would be just 42mm": "https://www.techradar.com/news/samsung-galaxy-watch-4-and-active-4-likely-to-land-soon",
    "a new 5nm chipset": "https://www.techradar.com/news/samsung-galaxy-watch-active-4-could-be-a-very-powerful-smartwatch",
    "Google’s overhauled Wear OS": "https://www.techradar.com/news/samsung-galaxy-watch-4-wear-os-rumors-get-huge-new-hint-from-google-itself",
    "might not land until August 3": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "PhoneArena": "https://www.phonearena.com/news/samsung-galaxy-watch-active-4-design-renders-colors-leak_id133051"
  }
}