{
  "source": "https://www.techradar.com/news/no-the-next-apple-watch-wont-measure-blood-glucose-and-alcohol",
  "title": "No, the next Apple Watch won't measure blood glucose and alcohol",
  "category": "fitness",
  "updated": "2021-07-15T10:49:34Z",
  "author": "cat-ellis",
  "summary": "Hopefully some day, but not just yet",
  "article": [
    "Rumors are circulating that the next Apple Watch could be able to monitor blood glucose and alcohol levels – but we wouldn't hold our breath.",
    "Speculation about an Apple Watch capable of measuring blood glucose first arose in May this year, when the company began asking users about the apps they use to monitor their levels. Now those rumors have been further stoked by news that one of Apple's suppliers, Rockley Photonics, has developed a wearable 'clinic on the wrist' capable of monitoring biometrics including core body temperature, blood pressure, hydration, and blood alcohol and glucose.",
    "It's an impressive list, and includes many metrics that can't be measured by any existing smartwatch.",
    "Some watches (such as the Samsung Galaxy Fit 2) can estimate blood pressure using data from their optical sensors, and many fitness trackers can measure skin temperature, but these aren't as accurate as a blood pressure cuff or thermometer.",
    "Skin temperature is affected by factors like ambient temperature and exercise, which makes it less reliable than a digital thermometer, and blood pressure sensors in smartwatches must be regularly calibrated using a cuff.",
    "So far, no watches can even estimate blood glucose levels; any smartwatch apps that 'track' your levels are simply a way to record readings from a finger-prick monitor. Doing this non-invasively would be extremely useful for people with diabetes, who currently have to measure their levels using finger-prick blood tests. People can also use a small probe that sits just under the skin and measures glucose in the fluid around cells, but this is still invasive, and less accurate then a blood test.",
    "Whereas current smartwatches shine a broad-spectrum LED onto your skin and analyzing changes in the light that's reflected back, Rockley's sensor module uses many discrete laser outputs from a single chip. Put simply, this means it can identify and assess many more biometric markers, including the properties of blood, interstitial fluids, and different layers of the skin.",
    "We'll need to be patient, though. Rockley has said that it's targeting the consumer electronics market, but we very much doubt its new tech will be appearing in Apple Watches any time soon.",
    "For starters, the sensor stack would need approval from the FDA and other public health bodies before they could be used in a commercially available watch, and so far the system is nowhere near that stage. Rockley is planning to begin its own in-house human studies over the coming months, so it'll be a long time before the wearable lab is ready for the big time.",
    "Things are also complicated on the software and processing side. Rockley's system relies heavily on cloud computing, and transfers data to custom, cloud-based analytics engines via a smartphone app. This is sensitive medical information, so Apple would need to ensure that it was fully protected in compliance with GDPR and other data protection laws in all the countries where it operates.",
    "The servers would also need to be able to cope with and process the enormous volume of data generated by millions of users.",
    "Then there's the practical matter of size and weight. The sensor module Rockley has produced for its human studies is impressively small, but is likely to need shrinking down even further to avoid increasing the size of the Apple Watch, whose slim, discreet design has remained unchanged for several generations.",
    "We're very keen to see where Rockley and Apple take wearable tech in the coming years, and we'd be happy to be proved wrong, but we don't anticipate non-invasive blood glucose and alcohol monitoring arriving on our wrists just yet."
  ],
  "headers": {
    "6": "How does the 'wearable lab' work?"
  },
  "links": {
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "the company began asking users": "https://www.techradar.com/news/could-the-apple-watch-7-really-measure-blood-glucose-and-why-is-it-important",
    "Rockley Photonics": "https://rockleyphotonics.com/",
    "clinic on the wrist": "https://www.businesswire.com/news/home/20210714005499/en/Rockley-Photonics-Unveils-End-to-end-Digital-Health-Monitoring-Solution-Based-on-Spectrophotometer-on-a-chip-Sensing-Module",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Samsung Galaxy Fit 2": "https://www.techradar.com/reviews/samsung-galaxy-fit-2",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "blood glucose": "https://www.techradar.com/news/could-the-apple-watch-7-really-measure-blood-glucose-and-why-is-it-important"
  }
}