{
  "source": "https://www.techradar.com/news/future-oneplus-phones-could-hide-a-selfie-camera-in-the-bezel",
  "title": "Future OnePlus phones could hide a selfie camera in the bezel",
  "category": "phones",
  "updated": "2021-02-11T09:47:39Z",
  "author": "jitendra-soni",
  "summary": "Unlikely to happen soon",
  "article": [
    "Smartphone makers have tried different ways to hide the selfie camera so that it doesn’t hinder the immersive viewing experience offered by large and brilliant displays, and a new patent suggests OnePlus is experimenting with a new idea.",
    "It looks like OnePlus is trying a unique workaround by housing a selfie camera in the bezel of the phone. This new patent, first spotted by Lets Go Digital, describes that a phone will have an OLED display with a tiny hole on the bezel, which in turn is covered by the glass that we interact with.",
    "The report also hints that this hole is significantly smaller than most punch-hole cutouts that we are used to seeing on modern phones. The bezel on the patent is reportedly smaller than you'd expect as well, but there aren't any dimensions provided.",
    "Other ways we've seen smartphone manufacturers try to hide the selfie camera include a camera at the chin of the device, pop-up cameras, swivel cameras, tiny hole punch cutouts and even an under-display camera setup that is making inroads now.",
    "However, each of these solutions come bundled with compromises that leave users wanting for more and force brands to continue innovating to find the perfect setup. Will a selfie camera in the bezel of the phone be that solution?",
    "The benefits of cutting out a hole in the bezel rather than placing the camera under the display are significant. First and foremost, the cost of a display with a hole punched in is higher than having a plain panel without a cutout. Additionally, an under-display camera will need to be more technologically advanced as it has to process images from under the illuminated pixels.",
    "As of now, the results of under-display cameras have not been satisfactory as users and reviewers have reported that the images taken from these camera setups have been washed out, oversaturated and lack detail. A camera in the bezel could solve the problem easily.",
    "A fixed camera setup is almost always preferred by users since moving parts in phones are considered to be fragile.",
    "That said, cramming a camera in the small space available under the bezel may be another task. Aside, components like the earpiece and other sensors are generally housed in the bezel, hence OnePlus needs to find a place to include them as well.",
    "This patent isn't a gurantee that we'll see OnePlus release a phone with this technology either. Instead, it may be that OnePlus is just experimenting with different ideas on how to hide its selfie tech.",
    "The next smartphone from the company is rumored to land in March or April this year, and we've yet to see any OnePlus 9 leaks that suggest the selfie camera is hiding inside the bezel on those upcoming phones."
  ],
  "headers": {
    "5": "Pros and cons of a bezel camera setup"
  },
  "links": {
    "Lets Go Digital": "https://nl.letsgodigital.org/smartphones/oneplus-smartphone-camera",
    "camera at the chin": "https://www.techradar.com/news/xiaomi-mi-mix-vs-mi-mix-2-whats-new",
    "pop-up cameras": "https://www.techradar.com/news/samsung-all-set-to-pop-up-with-a-selfie-camera-in-a-new-device",
    "swivel camera": "https://www.techradar.com/news/a-new-oppo-smartphone-may-have-a-trick-to-hide-the-rear-camera-entirely",
    "under-display camera setup": "https://www.techradar.com/news/smartphones-with-under-screen-cameras-are-a-step-closer-to-reality",
    "compromises": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "OnePlus 9 leaks": "https://www.techradar.com/reviews/oneplus-9-review"
  }
}