{
  "source": "https://www.techradar.com/news/oracle-offering-new-cost-perks-for-customers-moving-to-cloud",
  "title": "Oracle offering new cost perks for customers moving to cloud",
  "category": "computing",
  "updated": "2021-06-23T10:58:33Z",
  "author": "joel-khalili",
  "summary": "Frequent flyer miles, but for Oracle cloud customers",
  "article": [
    "Oracle has announced a new scheme designed to incentivize on-premises customers to make the switch to Oracle Cloud Infrastructure (OCI).",
    "Under the Support Rewards program, Oracle technology license support customers will earn $0.25 for every $1-worth of OCI Universal Credits purchased and utilized. These credits can be used to pay for any OCI service on a pay as you go (PAYG) basis.",
    "Customers with Oracle Unlimited License Agreements (UCLA), meanwhile, will save at an even greater rate: $0.33 on the dollar. The company says this means a qualifying customer could effectively write off a $500,000 support bill by migrating $1.5m of on-prem workloads to the cloud.",
    "The scheme will operate like frequent flyer miles, Oracle explained, with rewards dropped into the OCI console at the end of each month.",
    "The new rewards scheme builds upon a range of existing Oracle initiatives devised to encourage customers to commit fully to digital transformation.",
    "The company also recently added 13 new services to the Oracle Cloud Free Tier, which gives IT teams the opportunity to “kick the tyres” and learn how to deploy workloads on OCI.",
    "“Oracle believes the cloud should be engineered to support every application, instead of re-engineering applications to work with the cloud, and these two programs are further commitment to helping customers realize this,” explained the firm.",
    "According to Larry Ellison, Oracle Chairman and CTO, the company is in a privileged position, with strength in both the applications and infrastructure markets, which he sees as highly complementary.",
    "“OCI is Oracle’s fastest growing business because we built a unique Generation 2 cloud infrastructure platform capable of running the most demanding mission-critical workloads faster, more reliably, and more securely than our on-premises systems,” said Ellison.",
    "“We want to enable more customers to take advantage of our Gen 2 Oracle Cloud Infrastructure. Oracle Support Rewards gives customers an easy way to simultaneously reduce their software support spend as they increase the speed of their cloud adoption.”"
  ],
  "headers": {
    "4": "Oracle Cloud rewards"
  },
  "links": {
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}