{
  "source": "https://www.techradar.com/news/marvel-is-planning-a-new-spider-man-trilogy-after-no-way-home-says-sony-producer",
  "title": "Marvel is planning a new Spider-Man trilogy after No Way Home, says producer",
  "category": "entertainment",
  "updated": "2021-12-01T17:43:01Z",
  "author": "axel-metz",
  "summary": "Tom Holland is expected to return, too",
  "article": [
    "Both Sony and Marvel are planning a second Tom Holland-led Spider-Man trilogy after No Way Home, producer Amy Pascal has confirmed.",
    "Speaking to Fandango in a recent interview, Pascal revealed that the studio is “getting ready to make the next Spider-Man movie with Tom Holland and Marvel,” adding that “we’re thinking of [the Homecoming trilogy] as three films, and now we’re going to go onto the next three. This is not the last of our MCU movies.”",
    "While Sony insiders have attached the caveat that no plans are official just yet (per THR), the studio supposedly has a “strong relationship” with Holland and Marvel boss Kevin Feige, boosting hopes that collaboration will continue between all three parties.",
    "The news comes just weeks before the release of Spider-Man: No Way Home, which is set to hit theaters on December 15, 2021 and intended to tie up the so-called Homecoming trilogy of movies (following Homecoming and Far From Home in 2017 and 2019, respectively).",
    "In the upcoming film – which is inarguably the most anticipated Marvel movie since 2019’s Avengers: Endgame – Peter Parker will, for the first time, be forced to deal with the consequences of being unmasked. In an effort to rectify the situation, he enlists the help of Doctor Strange, and the pair unwittingly trigger a series of multiverse-opening events.",
    "Sony’s third Spider-Man movie will also be the final release in what’s been a jam-packed year for MCU films, with Black Widow, Shang-Chi, and Eternals all arriving earlier this year. It'll be the last Marvel movie for a while, too, with Doctor Strange 2 not set to release until May 2022.",
    "It’s clear that audiences have an appetite for more Spider-Man adventures – the 78 million views on No Way Home’s first trailer prove that – but Holland’s willingness to don the red and blue suit for a further three movies is less certain.",
    "In a recent interview with GQ, the star revealed that he still isn’t sure whether he’d be willing to reprise the role after No Way Home. “Maybe it is time for me to move on,” he said, adding that “maybe what’s best for Spider-Man is that they do a Miles Morales film [next]. If I’m playing Spider-Man after I’m 30, I’ve done something wrong.”",
    "Still, Holland did allude to those aforementioned plans for a brand new Spidey trilogy: “I might do Spider-Man 4, 5 and 6, finish when I’m 32, and never make another. I’m not sure what I want to do.”",
    "The question of whether Marvel and Sony can keep their leading man, then, remains unanswered for now. We know for certain, though, that Spider-Man: No Way Home is going to take the global box office by storm."
  ],
  "headers": {
    "6": "Is Tom Holland’s Spidey-Sense still tingling?"
  },
  "links": {
    "No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Fandango": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3618178873757960700/https://www.fandango.com/movie-news/spider-man-no-way-home-producer-amy-pascal-reveals-more-about-the-historic-film-and-confirms-tom-hollands-future-as-spider-man-754461?cjid=cj_10504407_100039678_58287X1516327Xff2505e29341f3bc982b646d82d7bc93&cjevent=7c41dadc513311ec81b507cd0a1c0e0e&clickid=7c41dadc513311ec81b507cd0a1c0e0e",
    "THR": "https://www.hollywoodreporter.com/movies/movie-news/spider-man-movies-marvel-sony-no-way-home-1235054015/",
    "Marvel movie": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Black Widow": "https://www.techradar.com/news/black-widow-is-a-bona-fide-spy-thriller-and-the-mcu-is-all-the-better-for-it",
    "Shang-Chi": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame",
    "Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "No Way Home’s first trailer": "https://www.techradar.com/news/spider-man-no-way-home-trailer-5-things-you-may-have-missed",
    "GQ": "https://www.gq.com/story/tom-holland-superhero-of-the-year-2021"
  }
}