{
  "source": "https://www.techradar.com/news/samsung-galaxy-a82-an-upcoming-cheap-phone-gets-leaks-leaks-and-more-leaks",
  "title": "Samsung Galaxy A82 could be a cheap phone with a really huge battery",
  "category": "phones",
  "updated": "2021-05-05T12:20:38Z",
  "author": "tom-bedford",
  "summary": "Possibly up to 6,000mA",
  "article": [
    "The Samsung Galaxy A82 is one of the next cheap phones we're expecting from Samsung, and a series of leaks has us excited for this upcoming device.",
    "Firstly Samsung itself as spotted by Android Central, listed the Galaxy A82 on the support part of its website. At the time of writing, you can find mention of the A82 on the security updates list for 'quarterly security updates'.",
    "So why would Samsung list the phone? Well, it seems likely that the company jumped the gun with updating its website - but this implies the new cheap phone could launch very soon.",
    "The phone's listed as the 'A82 5G', telling us the upcoming phone will work with the next-gen data network, and it's also listed as the top phone of the AX2 line, implying it could be the highest-spec A-series phone this year.",
    "The biggest news, though, regards the phone's battery.",
    "A leaked teaser for the Samsung Galaxy A82 has been posted on Twitter by popular leaker Max Weinbach.",
    "This teaser doesn't tell us too much - there's no image of the phone, mainly - but the repeated battery imagery is far from subtle. It's likely a long battery life will be one of the selling points of the phone.",
    "Quite a few Galaxy A phones have big batteries, like the Galaxy A72, 42 or 12 with their 5,000mAh power pack which is pretty huge. However if battery is the selling point, the thing to make the A82 stand out from its competitors, maybe the power pack is even bigger - 6,000mAh? More?",
    "Maybe the phone will have a two-day battery life, something few phones achieve, or maybe it'll go even longer - the sky's the limit! There's also a graphic of the battery icon filling up - perhaps the phone will have fast charging.",
    "That's unlike the Samsung Galaxy A80, as the unique selling point of that phone was its pop-up and flip-around rear camera. The lack of a mention of that in the teaser implies, though doesn't confirm, that this novel form factor has been dropped.",
    "It's hard to ascertain much about the phone from a promotional video like this, but its existence - and the Samsung leak - both suggest the Galaxy A82 could launch very soon. We'll let you know when it does."
  ],
  "headers": {
    "5": "Leaked Galaxy A82 teaser"
  },
  "links": {
    "Samsung Galaxy A82": "https://www.techradar.com/news/samsung-galaxy-a82",
    "cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "Android Central": "https://www.androidcentral.com/samsung-accidentally-confirms-galaxy-a82-5g",
    "security updates list": "https://security.samsungmobile.com/workScope.smsb",
    "cheap phone": "https://www.techradar.com/best/best-cheap-phones",
    "Max Weinbach": "https://twitter.com/MaxWinebach/status/1389764052402917377",
    "Galaxy A72": "https://www.techradar.com/news/samsung-galaxy-a72",
    "Samsung Galaxy A80": "https://www.techradar.com/reviews/samsung-galaxy-a80-review"
  }
}