{
  "source": "https://www.techradar.com/news/firefoxs-proton-redesign-waves-goodbye-to-some-ui-elements",
  "title": "Firefox's Proton redesign waves goodbye to some UI elements",
  "category": "computing",
  "updated": "2021-05-11T13:53:11Z",
  "author": "sofia-wycislik-wilson",
  "summary": "One of the latest victims of the cull is the Page Actions menu",
  "article": [
    "Mozilla is planning to remove one of Firefox's most commonly used menus to simplify the browser's design.",
    "It's not very often that web browsers – or any software, for that matter – undergoes a dramatic overhaul. Changes have a tendency to be slow, small and gradual so as to minimize disruption and to give users a chance to get used to things",
    "With its Proton redesign, however, Mozilla is making some serious changes to the look, feel and operation of Firefox. We've know about the upcoming design refresh for a while now, and more and more details and glimpses of what's to come have been seeping out here and there. The latest revelations show that in addition to visual changes, the introduction of the Proton look means that some features and elements of the browser are getting the chop.",
    "The new look is due to land in Firefox 89 which is scheduled for release on June 1, but Proton redesign can already be seen in the beta version of the browser. Mozilla has already shown us many of the changes we can expect to see, but the decision to cut the Page Actions menu from the browser is likely to be divisive.",
    "The Page Actions menu is the one that appears when you click the three-dot menu in the right-hand side of the address bar, and it's something that has been around for years. It gives access to various page-related functions such as creating a bookmark, copying the URL, sharing the page, sending the tab to another device and saving it to Pocket. But with the release of Firefox 89, this handy menu will be gone.",
    "But while the menu itself may be getting cut from the browser, many of the entries found in it will remain in Firefox, albeit in different places. Developers from Mozilla confirm that \"the Page Actions menu was removed in our redesign and all its items moved to other places in the interfaces\".",
    "If you want to see what the future has in store for Firefox with the Proton redesign, you can test out the Beta and Nightly builds. These early release versions of the browser aren't a guarantee of what will happen in the final release, but the absence of the Page Actions menu in both the Firefox 89 Beta and 90 Nightly makes it seem all but certain.",
    "Via TechDows"
  ],
  "headers": {
    "5": "Change is coming"
  },
  "links": {
    "web browsers": "https://www.techradar.com/best/browser",
    "many of the changes": "https://www.techradar.com/news/take-a-sneak-peek-at-the-upcoming-firefox-redesign",
    "Beta and Nightly builds": "https://www.mozilla.org/firefox/channel/desktop/",
    "TechDows": "https://techdows.com/2021/05/firefox-proton-redesign-removes-page-actions-menu.html"
  }
}