{
  "source": "https://www.techradar.com/news/jpmorgan-bitcoin-could-reach-heights-of-dollar146000-but-not-just-yet",
  "title": "JPMorgan: Bitcoin could reach heights of $146,000, but not just yet",
  "category": "computing",
  "updated": "2021-01-05T22:09:23Z",
  "author": "anthony-spadafora",
  "summary": "Investors believe Bitcoin could compete with gold as an asset",
  "article": [
    "As cryptocurrencies become increasingly mainstream, JPMorgan believes that Bitcoin could rise to a high of $146,000 per coin in the future.",
    "In a new note, strategists from the investment banking company led by Nikolas Panigirtzoglou shared their thoughts on how Bitcoin could compete with gold as an asset class. However, in order to do so, Bitcoin's market capitalization of around $575bn would need to rise by more than four times.",
    "JPMorgan's outlook for the cryptocurrency's future also depends on increased institutional investment which will likely take some time.",
    "The strategists explained that their Bitcoin price target won't be reached anytime soon in their note, saying:",
    "“A crowding out of gold as an ‘alternative’ currency implies big upside for Bitcoin over the long term. A convergence in volatilities between Bitcoin and gold is unlikely to happen quickly and is in our mind a multiyear process. This implies that the above-$146,000 theoretical Bitcoin price target should be considered as a long-term target, and thus an unsustainable price target for this year.”",
    "At the beginning of December, a single Bitcoin was worth around $20,000 but over the weekend, the cryptocurrency rose above $34,000 for the first time in its history.",
    "On Monday of this week though, the cryptocurrency slid by as much as 17 percent in the biggest drop since March of last year. While Bitcoin does appear to be on the rise, this swing serves as a reminder of just how volatile cryptocurrencies can be.",
    "Despite this, more institutions as well as investors have either started moving funds into Bitcoin or have said they are open to doing so.",
    "We'll have to wait some time to see if JPMorgan's predictions about Bitcoin come true but until then holding on to any cryptocurrency you have may be the best idea.",
    "Via Bloomberg"
  ],
  "headers": {
    "5": "Backing Bitcoin"
  },
  "links": {
    "JPMorgan": "https://www.techradar.com/news/jpmorgan-chase-to-offer-speedy-card-payments-service-for-businesses",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-01-05/jpmorgan-sees-146-000-plus-bitcoin-price-as-long-term-target?srnd=technology-vp"
  }
}