{
  "source": "https://www.techradar.com/news/heres-how-attitudes-towards-the-workplace-have-changed-thanks-to-covid",
  "title": "Here's how attitudes towards the workplace have changed – thanks to Covid",
  "category": "computing",
  "updated": "2021-07-06T10:33:14Z",
  "author": "nick-jones",
  "summary": "Our survey lays bare the impact the pandemic has had on the workplace",
  "article": [
    "You may have noticed this already, but the way we work has changed for good. The Covid pandemic and subsequent lockdown has, most likely, accelerated the move to flexible hybrid working, with previously-reluctant employers and employees being introduced to the benefits of the home office, and the collaboration tools that made this all possible in the first place.",
    "Let’s face it: no one’s going back to a working life as it was before the lockdown. TechRadar Pro's recent survey with our partners at SmartBrief has confirmed anecdotal evidence, and provides real insight into not only the day-to-day changes to the workplace, but also the change in attitudes of both workers and employers.",
    "In this article we’ll reveal the key stats, talking points, and the questions that both employers and employees will need to answer in this brave new working world.",
    "Before lockdown a good number of our respondents enjoyed flexible working hours, with over half of employers (52%) allowing some remote working opportunities; 30% of people were already working remotely either multiple days a week or permanently.",
    "Post-pandemic, the number of employers permitting remote working shot up, at nearly 80% (79.5%).",
    "Not everyone was able to work from home over lockdown, however, but the number is still unsurprisingly high, with nearly nine out of 10 (89.9%) remotely working during the pandemic, and 80% still working from home now.",
    "Some people did choose to relocate during the lockdown, but very few due to Covid or opportunities afforded by lockdown. Of the 6% of respondents who did relocate, 30% of these moved to lower the cost of living, 25% because of a new job opportunity, and 26% to be closer to family, so perhaps some effect of Covid can be seen in that number, given that many people were unable to travel long distances to see loved ones for months.",
    "Other reasons included more space needed, lower taxes, and offers of permanent remote working from a new employer (10%) were enough to tempt people to switch jobs and relocate.",
    "So, while the lockdown was in place the vast majority of people did stay put: a resounding 94%. Not a big surprise given the uncertainty and job insecurity that came with the first few months of the pandemic.",
    "There were some clear winners in the popularity of software used during the lockdown, with Microsoft Teams (75%) and Zoom (80%) far and away the most-used apps. Skype, Cisco Webex, and Dropbox also proved important to companies, with Google some way behind its main competitors in the space. Google Chat, for instance, was used by only 11% of respondents.",
    "Meanwhile, a significant number of people (63%) reported they’d purchased office-related equipment such as supplies, furniture, and electronics, to improve their remote-working experience. Interestingly, 29% said they intended on making further purchases, indicating that the home office is now integral to our working lives.",
    "Home-office comfort was a huge priority for people, with over 95% citing it as ‘moderately’ to ‘very’ important. In fact, nearly 27% reported suffering from neck or back pain brought on by remote working. So it should come as no surprise that half the 29% of people considering a new purchase, were intent on investing in a new chair.",
    "In terms of returning to the office, attitudes were split. 40% of people reported being either ‘unhappy’ or ‘very unhappy’ with returning to the office, with a smaller number, 34%, saying they were either ‘happy’ or ‘very happy’ about it. The remaining 26% said they felt neutral about a return.",
    "Q. How do you feel about returning to the office?",
    "Employees tend to favor a more flexible workplace in future, with 27% saying they want to work from home permanently, contrasting with 15% wanting to work full time in the office. The remainder of people surveyed (58%) said they wanted to work from home at least one day per week, with most (37%) suggesting 2 or 3 days working remotely would be their ideal.",
    "Interestingly, these numbers don’t reflect what employers are prepared to offer. 20% of employees said they were expected to return to the office full time, with just 16% being offered full-time remote work. 23% said they had the option to work remotely part time, with 41% saying that company policy on this had not been decided or communicated yet.",
    "But what can employers expect to find when they do return? Well, only 69% of employees said their employer had communicated or implemented new health and safety measures for the return.",
    "A quarter of employers are implementing ‘hot-desking’ as part of their return to work strategy, suggesting that office space will largely remain at pre-pandemic levels and only some businesses will take the opportunity to downsize and reduce costs with employees coming into the office on a semi-regular basis.",
    "With this changing workplace landscape, there are many questions that still need to be answered. Such as, who foots the bill? And what compromise to privacy are people willing to accept, if any at all?",
    "People were clear on who should pay for remote working costs, such as internet and office equipment. 71% either ‘agreed’ or ‘strongly agreed’ that employers should provide at-home office equipment for remote workers, with 55% saying their employer should subsidize their internet bills.",
    "In terms of employee tracking, 30% ‘disagreed’ or ‘strongly disagreed’ that employers have the right to track them on work devices, with 51% saying that, in fact, they did have the right. Less than 20% were neutral on the subject.",
    "So there appears to be a compromise here: employers should pay something towards home-office costs, but people are willing for their employer to track them while at home.",
    "Anecdotally, a lot of people told us they felt they were much more productive working from home, but some did report a fall in productivity, citing collaboration and communication as major challenges to productivity.",
    "Some suggested that training new staff and maintaining company culture would be another challenge with more people working remotely in the future.",
    "Others remarked on the benefits of working remotely, outside of business ones, citing improvements in their family relationships and having a better work-life balance.",
    "A few people were only interested in working from home on a permanent basis, and said they were actively seeking new opportunities from employers who offered this opportunity. It seems that, for some people at least, it’s impossible to go back.",
    "And finally, there was no love lost for some of that working and office culture that we can all relate to, such as the daily commute, worrying about what to wear in the office, arguing over the air-con, remembering to pack a lunch and, of course, the costs associated with travel, daily coffees, and lunches.",
    "Our survey shows that not only has the future of work changed, but that people’s attitudes to the future of work have changed too. And for good. The vast majority of people will enjoy some level of remote working in the future, and that this flexible approach will – if it hasn’t already – become the new normal.",
    "There are expectations that employers will at least make some contribution to the costs of having a flexible workforce and that people have discovered that there are many benefits – both business and personal – from working remotely.",
    "This change represents a huge opportunity for both employers and employees, as well as for the companies that make the software that made this great workplace experiment possible in the first place. Zoom and Microsoft were the big winners this time, but look out for companies like TeamViewer that can give employers peace of mind that employees are being as productive as they say they are in our brave new working world.",
    "If you enjoyed this article, sign up for SmartBrief’s free email on leadership, among SmartBrief's more than 200 industry-focused newsletters."
  ],
  "headers": {
    "3": "Lockdown: before and after",
    "9": "Lockdown behaviour: software and the home office",
    "12": "Return to the office",
    "18": "Return to work questions",
    "22": "Notes from the future of work",
    "27": "In summary",
    "31": "More on the results of this survey"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "SmartBrief": "https://www.smartbrief.com/",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "leadership": "http://www.smartbrief.com/Leadership/index.jsp?campaign=84dd6609",
    "more than 200 industry-focused newsletters": "http://smartbrief.com/subscribe"
  }
}