{
  "source": "https://www.techradar.com/news/this-leaked-snapdragon-chipset-could-power-the-best-android-phones-of-2022",
  "title": "This leaked Snapdragon chipset could power the best Android phones of 2022",
  "category": "phones",
  "updated": "2021-06-04T08:55:56Z",
  "author": "james-rogerson",
  "summary": "Expect huge graphics upgrades",
  "article": [
    "Right now, most of the top Android phones – from the OnePlus 9 range to US versions of the Samsung Galaxy S21 - are powered by the Snapdragon 888, but by next year that will be old news, and we’re already hearing about its successor. If the latest leak is accurate then it could be a huge upgrade.",
    "Evan Blass (a leaker with an excellent track record) has leaked a number of details about the unnamed chipset, including that it will apparently be manufactured on a 4nm process. That’s down from 5nm on the Snapdragon 888, and is a change that will likely lead to improved power and efficiency.",
    "But that’s hardly surprising, what’s more surprising is that it apparently has an Adreno 730 GPU. That’s up from an Adreno 660 GPU in the Snapdragon 888, but to put the number jump in context, last year’s flagship chipset (the Snapdragon 865) had an Adreno 650 GPU, so that was only a ten number jump, while this one is supposedly a 70 number jump.",
    "Of course, these numbers don’t always mean much, but as PhoneArena points out the last similar jump in numbers was found on the Snapdragon 845 several years ago, and that did offer a significant performance boost.",
    "The rest of the leaked components also sound like they could make for notable upgrades, such as a new Spectra 680 ISP (image signal processor) replacing the Spectra 580 in the Snapdragon 888, plus a new Snapdragon X65 5G modem, and more.",
    "Some of these improvements sound in line with what we’d expect, but combined they could make for an across the board improvement, with serious boosts to graphics processing in particular. That’s if this leak is right, and if the numbers mean much, so we’d take this with a pinch of salt for now.",
    "In any case, we hope this new Snapdragon chipset is as promising as it sounds, because it’s likely to power the OnePlus 10, US models of the Samsung Galaxy S22 range, the Sony Xperia 1 IV, and most other top Android flagships in at least the first half of next year. So if this really is a big boost then these phones could be even more exciting than normal."
  ],
  "headers": {},
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Evan Blass": "https://twitter.com/evleaks/status/1400520509897510912/photo/1",
    "PhoneArena": "https://www.phonearena.com/news/qualcomm-snapdragon-888-sequel-leaked-specs-features-cpu-gpu_id132577",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22"
  }
}