{
  "source": "https://www.techradar.com/news/the-seagate-firecuda-530-is-down-to-its-lowest-ever-price-with-this-ps5-ssd-deal",
  "title": "The Seagate FireCuda 530 is down to its lowest-ever price with this PS5 SSD deal",
  "category": "gaming",
  "updated": "2021-12-07T10:20:53Z",
  "author": "adam-vjestica",
  "summary": "One of the best PS5 SSDs is the cheapest it's ever been",
  "article": [
    "Black Friday and Cyber Monday may have been and gone, but the terrific PS5 SSD deals keep on coming.",
    "In the US the Seagate FireCuda 530 SSD 1TB with heatsink is down to just $249.99 at Amazon, while if you're in the UK you can pick up the drive for just £175.49, which is the lowest price we've seen for this highly sought-after SSD. (Not in the US or UK? Scroll down to see the best prices in your region.)",
    "That US price isn't quite the lowest we've seen for this PS5-compatible drive in the US, but it's mighty close at only $10 more.",
    "You'll have to wait five days for delivery in the US due to demand, while in the UK the drive is temporarily out of stock, but you can still order it. With a PS5 SSD deal that beats Black Friday and Cyber Monday, you can rest assured you're getting the best price here.",
    "The Seagate FireCuda 530 is a fantastic performer, and one that far exceeds Sony’s 5,500 MB/s recommended speed, with blazing-fast read speeds of 7,300 MB/s. With a heatsink pre-installed, you can also game without worrying about heating issues.",
    "You could also choose to put the Seagate FireCuda 1TB SSD in your gaming PC if you don’t own a PS5 – as long as your motherboard and CPU support the PCIe 4.0 standard, it’ll work without a hitch.",
    "The PS5 only has 664GB of usable storage, and you can fill that up in no time. You can only play PS5 games from the console's internal storage, so if you like having a large library of games available to flick through, you'll need to install an SSD.",
    "This PS5 SSD deal is well worth it, then, as you're adding significantly more capacity to your PlayStation 5, and can rest assured that every existing and future PS5 game will run smoothly.",
    "Not in the US or UK? Check out the best PS5 SSD deals where you are below."
  ],
  "headers": {
    "6": "Today's best PS5 SSD deals",
    "8": "More PS5 SSD deals"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/news/ps5-ssd-black-friday-deals",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "down to just $249.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0977LW48F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1067228069721833200-20",
    "just £175.49": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FSeagate-FireCuda-Internal-Solid-State%2Fdp%2FB0977LW48F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-5224046136529570000-21",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "PS5 game": "https://www.techradar.com/best/best-ps5-games"
  }
}