{
  "source": "https://www.techradar.com/news/these-prime-day-lego-city-deals-slash-prices-on-some-great-gifts-and-perfect-presents",
  "title": "These Prime Day Lego City deals slash prices on some great gifts and perfect presents",
  "category": "appliances",
  "updated": "2021-06-22T01:34:28Z",
  "author": "tom-bedford",
  "summary": "Trains, lanes and automobiles",
  "article": [
    "Some of the best Prime Day deals on Lego sets cut the price of kits in the Lego City range, letting you save cash whether you're buying a gift for a loved one or something for yourself.",
    "Lego City sets depict everyday situations like police stations, fire stations, building sites, vehicles, space stations... (well, okay, not necessarily 'everyday' in all cases). The Prime Day deals have slashed costs on all different types of set.",
    "We've rounded up all the best deals , so you can easily shop through all the Lego City discounts we've found on Amazon. You can see them below, including up to 50% off some. Whether you're looking for a treat for yourself or a gift for a loved one, there's likely to be some good pickings below.",
    "(Not in the US or UK? Scroll down for deals in your region).",
    "There are a good few Lego City kits as part of the Prime Day deals, including popular ones like the Fire Station and Passenger Train. Most of these kits are at all-new prices, especially the ones with massive discounts like the trains.",
    "One of the best parts of the Lego City kits is that they come with loads of minifigures and vehicles, not like Star Wars kits for example which usually only have two or three. They'll be great for kids who like to roll-play with all the different vehicles.",
    "No matter where you live, you'll find all the lowest prices for Lego City kits from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Lego City deals on Prime Day in the UK",
    "6": "More Lego City deals",
    "7": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}