{
  "source": "https://www.techradar.com/news/going-digital-was-crucial-to-the-survival-of-most-smbs-during-the-pandemic",
  "title": "Going digital was crucial to the survival of most SMBs during the pandemic",
  "category": "computing",
  "updated": "2021-09-14T01:30:38Z",
  "author": "anthony-spadafora",
  "summary": "Adopting digital-first technologies was essential to surviving the pandemic",
  "article": [
    "Going digital helped 71 percent of growing small and medium businesses (SMBs) survive the pandemic according to new research from Salesforce.",
    "To compile the fifth edition of its “Small and Medium Business Trends” report, the CRM giant had The Harris Poll survey 2,500 SMB owners and leaders across North America, South America, Europe and Asia Pacific. The report's results highlight the ways in which SMBs have found success in a digital world.",
    "According to Salesforce, the most successful SMBs are those that have taken action to earn employee trust. Of the SMBs surveyed, 50 percent of those with growing revenue offered flexible working arrangements to their employees during the pandemic compared to 38 percent of their declining peers.",
    "Building trust with customers is important too with 75 percent of growing SMBs saying their customers expect online transactions. As a result, 72 percent of them have an ecommerce presence including over one-third (35%) that added it within the past year. At the same time, 95 percent of growing SMBs are taking action to secure company data and to protect customer information from cyberattacks.",
    "Many small businesses weren't prepared for the pandemic and its economic impact and were forced to digitize as a result. They did this by ensuring their employees had access to the online collaboration tools and video conferencing software they needed to do their jobs.",
    "While 71 percent of SMBs say they survived the pandemic through digitization, 66 percent said their businesses would not have been able to survive using technology from a decade ago. Additionally, 72 percent of SMBs have increased their company's online presence over the past year while 42 percent have accelerated their technology investments over the past year (compared to 33% in August 2020).",
    "While the pandemic will eventually come to an end, 75 percent of SMBs believe shifts they've made to their business operations over the past year will benefit their businesses long term. When it comes to the future of work, 43 percent plan to have employees split their time between in-person and remote work by adopting a hybrid work policy.",
    "The pandemic has changed the nature of work on a global scale but thankfully many SMBs realized early on that they would have to go digital if they wanted to survive it."
  ],
  "headers": {
    "4": "Embracing a digital-first world"
  },
  "links": {
    "Salesforce": "https://www.techradar.com/news/salesforce-is-launching-its-own-streaming-service",
    "Small and Medium Business Trends": "https://www.salesforce.com/form/pdf/2021-small-business-trends-report/?d=7013y000000ZmORAA0&nc=7013y000000ZmOWAA0&utm_source=Newsroom&utm_medium=&ban&utm_campaign=us_esmb&utm_content=5th-smb-trends-report_7013y000000ZmORAA0&utm_term=us_Newsroom",
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "flexible working arrangements": "https://www.techradar.com/how-to/remote-working-vs-flexible-working-how-to-know-the-difference",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "online presence": "https://www.techradar.com/news/ionos-why-the-pandemic-has-put-digitalization-firmly-in-the-spotlight",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}