{
  "source": "https://www.techradar.com/news/samsung-galaxy-buds-pro-appear-on-the-brands-site-ahead-of-rumored-launch",
  "title": "Samsung Galaxy Buds Pro appear on the brand's site ahead of rumored launch",
  "category": "audio-visual",
  "updated": "2021-01-02T12:18:55Z",
  "author": "olivia-tambini",
  "summary": "An imminent launch looks increasingly likely",
  "article": [
    "The Samsung Galaxy Buds Pro have been all but confirmed after a listening for the rumored true wireless earbuds appeared on the tech giant's own website.",
    "As spotted by SamMobile, Samsung Canada has listed the Galaxy Buds Pro on its website, confirming the name and the model number (SM-R190).",
    "Unfortunately, that's all the information included in the listing, with no word on price or an official release date.",
    "We may not have to wait long to find out more, though. The Galaxy Buds Pro are expected to be announced alongside the Samsung Galaxy S21, which is rumored to be launched on January 14, 2021.",
    "Leaks and rumors surrounding the Samsung Galaxy Buds Pro have been circulating in earnest over the past few weeks – and if the rumors are to be believed, they’ll be the company’s best wireless earbuds yet.",
    "So far, we've heard that Samsung Galaxy Buds Pro will come with active noise cancellation and support for Dolby Atmos – making them a potential alternative to the Apple AirPods Pro for Android users.",
    "The earbuds are also said to come with AKG-tune audio, a longer battery life than their predecessors, support for Bluetooth 5.1, and USB-C charging. Those specs certainly sound promising, but Samsung's mixed history when it comes to audio devices means we're tempering our expectations; the Galaxy Buds Plus, for example, were let down by limited audio codec support and a disappointing IPX2 water-resistance rating.",
    "Still, we're excited to see what Samsung comes up with – and with a rumored price of $199 (about £110 / AU$260), the Galaxy Buds Pro could undercut competing earbuds with support for object-based surround sound, including Apple's premium buds."
  ],
  "headers": {
    "4": "Promising specs"
  },
  "links": {
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "SamMobile": "https://www.sammobile.com/news/samsung-galaxy-buds-pro-confirmed/",
    "website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1360494419449118000&xs=1&url=https%3A%2F%2Fwww.samsung.com%2Fca%2Fsupport%2Fmodel%2FSM-R190NZKAXAC%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-galaxy-buds-pro-appear-on-the-brands-site-ahead-of-rumored-launch",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "best wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Dolby Atmos": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925"
  }
}