{
  "source": "https://www.techradar.com/news/intel-is-making-some-of-the-thinnest-gaming-laptops-ever-at-ces-2021",
  "title": "Intel is behind some of the thinnest gaming laptops ever at CES 2021",
  "category": "computing",
  "updated": "2021-01-11T21:30:32Z",
  "author": "jackie-thomas",
  "summary": "Do some high-end gaming on the go",
  "article": [
    "Back at IFA 2019, we were blown away by the Razer Blade 13, as it was able to shove a dedicated graphics card into a 13-inch Ultrabook chassis, making for a super-portable gaming laptop. However, at CES 2021, Intel has taken that idea and went even further.",
    "This year, Intel is launching its 11th generation Tiger Lake-H35 processors. These will be three high-performance processors Intel is launching to power gaming laptops that are thinner and lighter than ever before. The focus here is on the ability to get some high-end gaming done, in a chassis that you can easily travel with.",
    "These new processors will be available with up to 4 cores and 8 threads, and will boost up to 5GHz on a single core. Intel claims that this will be able to deliver up to 15% faster single-threaded performance over a 10th-generation H-series Core i7 processor.",
    "The ability to pack this much performance into laptops that are, as Intel cites, around 18mm (0.7 inches) thin, should be a massive improvement for anyone that wants to work or play games on the go.",
    "Intel didn't give an exact Tiger Lake H35 release date, or even spell out the full lineup of its new processor. However, we're sure more information will be coming out very soon – just don't expect these new thin-and-light gaming laptops to come cheap.",
    "Here are the Tiger Lake H35 processors:",
    "Of course, more traditional gaming laptops aren't going anywhere any time soon, and Intel has fresh silicon for those, too.",
    "Starting January 2021, two new Intel Comet Lake-H processors will be available: the Intel Core i5-10500H and Core i7-10870H. These are minor updates that will bring boost clocks up to 5.3GHz in more than 40 new gaming laptops. But the real refresh is the 11th-gen Tiger Lake-H processors coming a little later in 2021.",
    "Intel hasn't announced the full lineup of processors, but it did talk a little about the upcoming Intel Core i7-11375H. Intel claims that this CPU is faster than the previous Intel Core i9-10980HK in single-threaded workloads, and further claims that it's the fastest processor in single-threaded performance ever. Again, these are Intel's performance claims, so take them with a grain of salt. We'll test gaming laptops with Intel Tiger Lake-H processors as soon as we get a chance to review one.",
    "These Tiger Lake gaming laptop processors will also support PCIe 4.0, which means that the best gaming laptops can finally take advantage of the fastest SSDs on the market.",
    "Now we just have to wait for Intel to release more information. Hopefully we see some fresh gaming laptops soon."
  ],
  "headers": {
    "6": "Thick gaming laptops are getting some love too"
  },
  "links": {
    "IFA 2019": "https://www.techradar.com/news/ifa-2019-news",
    "Razer Blade 13": "https://www.techradar.com/reviews/razer-blade-stealth-13",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "processors": "https://www.techradar.com/news/best-processors"
  }
}