{
  "source": "https://www.techradar.com/news/google-pixel-5-just-got-a-big-performance-boost",
  "title": "Google Pixel 5 just got a big performance boost",
  "category": "phones",
  "updated": "2021-12-02T11:43:23Z",
  "author": "james-rogerson",
  "summary": "As did the Google Pixel 4a 5G",
  "article": [
    "We’re fans of the Google Pixel 5, but one area where it didn’t fully excel was its power, as reflected in benchmark scores. That’s in part because of its mid-range Snapdragon 765G chipset, but seemingly also in part down to software issues – and those issues have reportedly now been solved.",
    "Google’s April 2021 security update has started rolling out to the Pixel range, and while it’s largely focused on bug fixes, it also mentions performance optimizations for certain graphics-intensive apps and games on the Pixel 5 and the Google Pixel 4a 5G.",
    "While it doesn’t go into any more detail, Andreas Proschofsky (an editor at Austrian newspaper Der Standard) reports that the Pixel 5’s results on the 3DMark benchmark are now 30-50% better than before.",
    "Even more impressively, Andrei Frumusanu from Anandtech claims that the Pixel 5's “performance has been essentially doubled.”",
    "This is great news, and a much-needed change, given that the Google Pixel 5 was benchmarking even lower than some much cheaper phones when we reviewed it. Now it sounds like it’s more in line with where it should have been at launch, and presumably the improvements on the Pixel 4a 5G are similarly big, as that phone also underperformed at launch.",
    "And while that’s the most exciting part of this update, it also includes improvements to camera quality in certain third-party apps for the Pixel 5 and Pixel 4a 5G, so you might see a boost to your photos and videos in some circumstances too.",
    "Via Android Community"
  ],
  "headers": {
    "3": "Double the performance"
  },
  "links": {
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Google Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Andreas Proschofsky": "https://twitter.com/suka_hiroaki/status/1379153849559179264",
    "Andrei Frumusanu": "https://twitter.com/andreif7/status/1379143336943058952",
    "Pixel 5 and Pixel 4a 5G": "https://www.techradar.com/news/google-pixel-5-vs-google-pixel-4a-5g-vs-google-pixel-4a",
    "Android Community": "https://androidcommunity.com/recent-pixel-5-update-improves-gpu-gaming-performance-20210406/"
  }
}