{
  "source": "https://www.techradar.com/news/cloud-migration-is-still-accelerating-despite-security-concerns",
  "title": "Cloud migration is still accelerating, despite security concerns",
  "category": "computing",
  "updated": "2021-09-22T10:56:35Z",
  "author": "sead-fadilpasic",
  "summary": "Businesses are moving business-critical apps at pace",
  "article": [
    "The number of businesses planning to move business-critical applications from on-premises onto the cloud has spiked this year, despite growing concerns over potential cybersecurity incidents, new research has found.",
    "A report from Equinix polling 2,600 IT decision-makers across the Americas, Asia-Pacific, and EMEA found that 37% of firms currently have plans to move business-critical apps to the cloud, up 11% year-on-year.",
    "At the moment, more than half (54%) of all IT infrastructure is estimated to already be in the cloud, despite cybersecurity concerns, with almost four in five (79%) of respondents in the UK saying that moving to the cloud is a top priority.",
    "At the same time, almost half (47%) are wary of data leaks and cyberattacks that may come as a result of this migration. Their fears aren’t unfounded, either. According to a seperae study recently published by Equinix, the number of user devices and cloud resources is growing, which means businesses need to keep DDoS attacks and similar distributed security risks in mind.",
    "After all, it claims, these attacks have grown 270% globally, year-on-year.",
    "“The cloud has the power to deliver increased connectivity and flexibility, improve network optimization and facilitate real-time connections to global digital ecosystems,” says Russell Poole, Managing Director, UK, Equinix.",
    "“Transforming legacy IT infrastructures in this way means businesses can leverage new and innovative technologies to generate increased flexibility and scalability.”",
    "However, security must remain front and center for these firms. Luckily, most of them seem to be aware of it, as 80% of digital leaders confirmed to be prioritizing improving their organization’s cybersecurity. Equinix says this is a “significant increase” from the 66% who said the same just a year ago."
  ],
  "headers": {
    "5": "Power to transform"
  },
  "links": {}
}