{
  "source": "https://www.techradar.com/news/theres-been-another-huge-cyberattack-on-a-crypto-exchange",
  "title": "There's been another huge cyberattack on a crypto exchange",
  "category": "computing",
  "updated": "2021-08-20T14:25:02Z",
  "author": "mayank-sharma",
  "summary": "Is it the work of another white hat hacker?",
  "article": [
    "Japanese cryptocurrency exchange Liquid Global has revealed it was hit by hackers who have managed to get away with almost $100 million in cryptocurrencies.",
    "This is the second major cryptocurrency theft in as many weeks, following the recent break-in at Poly Network where the hacker made away with $600 million in cryptocurrencies.",
    "\"We are sorry to announce that #LiquidGlobal warm wallets were compromised, we are moving assets into the cold wallet,\" the company said on Twitter.",
    "While the total amount stolen from Liquid has yet to be determined, BBC reports that according to estimates by blockchain analytics firm Elliptic, the value taken in over a dozen cryptocurrencies and coins could be upward of $97 million.",
    "As it announced the news of the heist, Liquid shared that it is actively tracing the movement of the stolen cryptocurrencies and working with other exchanges to freeze and recover the assets.",
    "“We are currently investigating and will provide regular updates. In the meantime deposits and withdrawals will be suspended,” tweeted the exchange.",
    "Just as with the Poly Network heist, Liquid too has published the wallet addresses used by the hacker, along with the details of the funds, and is working to have the assets frozen and blacklisted.",
    "While the Poly Network hacker returned the loot within hours, claiming to be a white hat hacker who only took the funds to draw Poly’s attention towards a vulnerability in their implementation, for now it appears Liquid has been attacked by good ol’ for-profit goons.",
    "“Liquid’s teams are still assessing the attack vector used and taking measures to mitigate the impact to users” noted the company in a blog post.",
    "Despite their supposedly anonymous nature, cryptocurrencies can be blacklisted and their transactions tracked. Cryptocurrency robbers usually wait several years for the heat to die down before they can spend their ill-gotten stash, and it’ll be interesting to see the response of the ones that hit Liquid.",
    "Via BBC"
  ],
  "headers": {
    "4": "Turning on the heat"
  },
  "links": {
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "break-in at Poly Network": "https://www.techradar.com/news/crypto-exchange-hack-sees-dollar600m-stolen",
    "said on Twitter": "https://twitter.com/Liquid_Global/status/1428176357515612165",
    "returned the loot within hours": "https://www.techradar.com/news/poly-crypto-hacker-pleads-innocence-as-loot-is-returned",
    "blog post": "https://blog.liquid.com/warm-wallet-incident",
    "BBC": "https://www.bbc.com/news/business-58277359"
  }
}