{
  "source": "https://www.techradar.com/news/save-big-on-this-sony-soundbar-with-dolby-atmos-in-this-early-prime-day-deal",
  "title": "Save big on this Sony soundbar with Dolby Atmos in this early Prime Day deal",
  "category": "audio-visual",
  "updated": "2021-06-15T09:33:06Z",
  "author": "olivia-tambini",
  "summary": "The Sony HT-Z9F soundbar has been reduced by $100",
  "article": [
    "If you're on the hunt for a soundbar that will boost your home cinema setup, this excellent deal from Amazon is worth checking out.",
    "Usually $900, Amazon has slashed the price of the Sony HT-Z9F Soundbar to just $798, saving you over $100 ahead of Prime Day 2021. (Not in the US? Scroll down for the best Sony HT-Z9F Soundbar prices in your region.)",
    "While we've seen prices drop to $698 in the past, this is still an excellent deal on this Dolby Atmos soundbar, which comes with a wireless subwoofer included. And, if you want to go all out, you can throw in a pair of wireless rear speakers too, with the whole package reduced from $1,200 to $1,096.",
    "The Sony HT-Z9F is a a 3.1-channel soundbar that can virtually create a 5.1.2 system, without taking up precious space. Plus, with a wireless subwoofer included (and rear speakers if you wish), you should get a powerful sound with thumping bass.",
    "Virtual Dolby Atmos means that you also get an immersive cinematic soundstage that makes you feel like you're in the heart of the action, whether you're watching TV shows, movies, or playing games.",
    "The HT-Z9F isn’t just about movies, though. It’s compatible with hi-res FLAC 192kHz 24bit and DSD, and the result is more engaging than you might imagine. If you have low-res audio sources, Sony offers DSEE HX plumping.",
    "We awarded the Sony HT-Z9F four out of five stars in our review, thanks to its support for virtual Dolby Atmos and DTS:X, though you may find a more convincing performance from soundbars with upfiring tweeters like the Sonos Arc.",
    "It's worth bearing in mind that Amazon Prime Day is kicking off soon, and while we don't think this particular soundbar will drop much further in price, more recent models could be discounted heavily. But, if you want a compact soundbar that can deliver an immersive sound, this deal is worth snapping up.",
    "Not in the US? Check out the best Sony HT-Z9F soundbar deals below:",
    "TechRadar is rounding up all the top deals in the run up to the Amazon Prime Day 2021 sales period, and we’ve put together a hub of all the Amazon Prime Day 2021 news you'll need to prepare yourself for the discount period."
  ],
  "headers": {
    "3": "Today's best soundbar deals"
  },
  "links": {
    "to just $798": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSony-3-1ch-Wireless-Subwoofer-HT-Z9F%2Fdp%2FB0793HNSQG%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5810906193445470000-20",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "reduced from $1,200 to $1,096": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSony-3-1ch-Wireless-Subwoofer-HT-Z9F%2Fdp%2FB07BMRB49C%3Fref_%3DOct_DLandingS_D_5d480b1f_61%26smid%3DATVPDKIKX0DER%26th%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5614388526304225000-20",
    "Sony HT-Z9F": "https://www.techradar.com/reviews/sony-ht-z9f-soundbar",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc"
  }
}