{
  "source": "https://www.techradar.com/news/pcloud-backup-wants-to-make-sure-you-never-lose-a-document-again",
  "title": "pCloud Backup wants to make sure you never lose a document again",
  "category": "computing",
  "updated": "2021-12-04T08:46:07Z",
  "author": "mayank-sharma",
  "summary": "New pCloud Backup service supports block level transfers",
  "article": [
    "File sharing and hosting service pCloud has announced a new cloud backup service that enables customers to automatically back up their data from their computers to the cloud.",
    "Based in Switzerland, pCloud is a cross-platform cloud storage service that boasts over ten million users, making it one the top five cloud file hosting providers globally.",
    "The new pCloud Backup service will start automatically saving the folders you chose to the cloud as soon as you begin backing up, with any future changes applied to your pCloud account and your device.",
    "pCloud already offers a synchronization feature with its desktop app called pCloud Drive. Using the file synchronization option in the app users can keep the contents of a local folder in sync with their pCloud account. The feature also supports block level syncing which means it’ll only transfer the parts of the files that have changed.",
    "The new backup service, which has no file size or speed limits. appears to work in the same fashion. You can mark the files and folders that you need to save to the cloud, and pCloud will automatically upload their contents to your pCloud account.",
    "Any changes you make to the files and folders that have been marked for backup on your computer will be carried over to your cloud account in real-time. If you edit the content while offline, they’ll be backed up as soon as you connect to the Internet.",
    "pCloud Backup, just like pCloud Sync, also supports block level transfers. Furthermore, there are no file size or speed limits with the new backup service.",
    "The one major difference between the backup service and the sync functionality, is that with backup pCloud offers to keep deleted files for up to a month, though you can extend this period to a year by paying an additional fee. The backup service will also keep multiple snapshots of your data giving you an option to view multiple versions of the content."
  ],
  "headers": {
    "3": "Sync and Backup"
  },
  "links": {
    "pCloud": "https://www.techradar.com/reviews/pcloud",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "file hosting": "https://www.techradar.com/best/file-hosting-and-sharing-services",
    "sync functionality": "https://www.techradar.com/reviews/zippyshare"
  }
}