{
  "source": "https://www.techradar.com/news/apple-macs-with-m1-chip-could-soon-get-a-fix-for-reported-bluetooth-issues",
  "title": "Apple Macs with M1 chip could soon get a fix for reported Bluetooth issues",
  "category": "computing",
  "updated": "2021-01-12T11:10:11Z",
  "author": "darren-allan",
  "summary": "Solution could be inbound, but this isn’t an official statement from Apple sadly",
  "article": [
    "Apple Macs with the new M1 chip which have been experiencing problems with Bluetooth connectivity are going to get a fix for macOS Big Sur – at least in theory.",
    "We say that because Apple hasn’t made an official statement on the Bluetooth bug – which has apparently been affecting buyers of the new Mac mini, and MacBooks with the M1 processor according to a report by Wccftech – but rather an Apple support representative has.",
    "Ian Bogost, a contributing writer at The Atlantic, spilled the news about a macOS fix being inbound – and coming soon – but later clarified that this news was shared by Apple support, so should be taken with a grain of salt.",
    "Time will tell, but still, this is a hopeful sign. We’ve got in touch with Apple to check if there is indeed a solution for this fix in progress, and we’ll update this story if we hear back from the company.",
    "As you may recall, the Bluetooth issues purportedly involved with the M1 chip are quite perplexing, and some users report intermittent loss of connectivity with peripherals. The problem might go away for a few days, but then it comes back, which is obviously quite a frustrating situation.",
    "It seems to be the new Mac mini that’s mainly hit here, although there are some reports from affected M1-toting MacBook owners too (but these seem to be rarer, as we made clear in our previous story on this).",
    "There are also reports of similar Bluetooth issues with the previous Mac mini from 2018, although that’s seemingly a separate issue from the wireless niggles with the M1 chip. At any rate, as mentioned, hopefully we’ll hear back from Apple to clarify the situation around these bugbears – fingers crossed."
  ],
  "headers": {
    "4": "Perplexing issues"
  },
  "links": {
    "new M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "macOS Big Sur": "https://www.techradar.com/how-to/how-to-download-and-install-macos-11-big-sur",
    "been affecting buyers of the new Mac mini": "https://www.techradar.com/news/mac-mini-m1-2020-is-reportedly-having-problems-with-bluetooth-connectivity",
    "Wccftech": "https://wccftech.com/fix-for-m1-macbook-air-pro-and-mini-bluetooth-issues-is-on-its-way/",
    "Mac mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "made clear in our previous story on this": "https://www.techradar.com/news/mac-mini-m1-2020-is-reportedly-having-problems-with-bluetooth-connectivity"
  }
}