{
  "source": "https://www.techradar.com/news/jeff-bezos-is-heading-to-space-in-his-own-rocket",
  "title": "Jeff Bezos is heading to space in his own rocket",
  "category": "appliances",
  "updated": "2021-06-07T14:22:13Z",
  "author": "axel-metz",
  "summary": "One giant leap for billionaires",
  "article": [
    "Amazon CEO Jeff Bezos will be one of the first three human passengers sent into space by his aerospace company, Blue Origin.",
    "Announcing the news on Instagram, Bezos confirmed he would be making the trip alongside his brother, Mark, on July 20. The pair will be joined by a third passenger, whose seat will be auctioned off by the company, the bid for which currently stands at $2,800,000.",
    "Formerly the world's richest man, the Amazon boss said the space flight is something he has wanted to do \"all [his] life,” and that it will be “meaningful” to embark on the journey with his brother.",
    "Blue Origin had announced in May that it would be aiming to launch its first crewed flight in July, but it hadn’t since mentioned any plans to include Bezos himself in the maiden crew voyage.",
    "The pair will be traveling aboard Blue Origin’s 59-foot New Shepard rocket, which can land vertically on the ground after returning from its journey. It is named after Alan Shepard, the second person and first US citizen to fly into space.",
    "New Shepard's passenger capsule will head toward the edge of space on an 11-minute flight that the Blue Origin says will reach more than 60 miles above the Earth, before landing in the West Texas desert with the help of parachutes.",
    "Speaking in the video, Bezos said: “I want to go on this flight because it’s the thing I’ve wanted to do all my life. It’s an adventure. It’s a big deal for me.”",
    "If Bezos goes ahead with his plan to ride aboard Blue Origin’s first crewed space voyage, he will become the first of the billionaire tech giants to travel inside the space technology they have each spent years – and billions of dollars – developing.",
    "British billionaire Richard Branson has also expressed an interest in travelling aboard one of his own rockets as part of the Virgin Galactic space program, though such a flight is not expected to take place until later in 2021.",
    "Elon Musk, too, whose SpaceX company seemed to be making the most strides in the quest for commercially-viable space travel, looks unlikely to ride in one of his crewed rockets any time soon.",
    "Perhaps Bezos’ bold move will encourage the other tech tycoons of the world to follow suit? It’s certainly not out of this world to think so.",
    "Via The Verge"
  ],
  "headers": {
    "7": "Follow the money"
  },
  "links": {
    "Instagram": "https://www.instagram.com/p/CP0MSOqnYEo/",
    "The Verge": "https://www.theverge.com/2021/6/7/22522313/jeff-bezos-space-launch-brother-blue-origin-july-20"
  }
}