{
  "source": "https://www.techradar.com/news/iphone-13-range-could-include-three-new-exciting-colors",
  "title": "iPhone 13 range could include three new exciting colors",
  "category": "phones",
  "updated": "2021-09-14T08:27:42Z",
  "author": "james-rogerson",
  "summary": "Pink, bronze and black",
  "article": [
    "While the iPhone 13 range isn’t being announced until September 14, one store has listed them early, and has even included color and storage details.",
    "The site in question is KTC (a Ukrainian web store), and it claims that the iPhone 13 and iPhone 13 mini will be available in red, purple, blue, pink, black and white. Of those, pink is the only new color, and it seemingly replaces the green shade in the iPhone 12 range.",
    "The iPhone 13 Pro and iPhone 13 Pro Max meanwhile are listed as coming in gold, silver, bronze and black. Of those, the bronze and black shades would be new, and would seemingly replace the graphite and pacific blue shades from the iPhone 12 Pro range. These are all colors that we’ve heard rumored as possibilities before, so they could well be accurate.",
    "The site additionally says that the iPhone 13 and iPhone 13 mini will come in 64GB and 128GB models. Oddly there’s no mention of 256GB, even though the iPhone 12 range was available in that size, but we doubt Apple would have removed this option.",
    "The iPhone 13 Pro and iPhone 13 Pro Max are shown in the same sizes as their predecessors, namely 128GB, 256GB and 512GB. This suggests that the rumored 1TB models might not emerge, though equally this store’s information could well be wrong, so we’d take all of this with a pinch of salt.",
    "If this leak is right then Apple is seemingly sticking with its established pattern of offering fairly muted, smart colors on its Pro range, while providing brighter colors (and more choice of colors) on the standard iPhone 13 and iPhone 13 mini.",
    "Given that this is what Apple tends to do it’s not surprising to see, in fact we’d be surprised if Apple didn’t do this, but it will be disappointing for anyone who wants top-end hardware in a more showy shade, as that just won’t be possible.",
    "So it’s a bit of a shame to see, but of course nothing is certain just yet. We won’t be sure what colors the iPhone 13 range is landing in until the phones are unveiled on September 14. Head back to TechRadar then for all the news and analysis on Apple’s new handsets.",
    "Via Tom's Guide"
  ],
  "headers": {
    "5": "Analysis: Apple still isn’t offering bright colors on premium phones"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "KTC": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1061858134498959100&xs=1&url=https%3A%2F%2Fktc.ua%2Fsmartphone%2Fbrand-apple%2Fsmartphone_series-apple_iphone_13%2F%3Fadmitad_uid%3D8df79d9294431259a7fcbfc1ae48a997&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fiphone-13-range-could-include-three-new-exciting-colors",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Tom's Guide": "https://www.tomsguide.com/news/iphone-13-colors-just-tipped-to-include-pink-and-bronze"
  }
}