{
  "source": "https://www.techradar.com/news/10-things-you-should-know-before-you-buy-a-macbook-for-students",
  "title": "10 things you should know before you buy a MacBook for students",
  "category": "news",
  "updated": "2021-08-02T22:31:25Z",
  "author": "bryan-m-wolfe",
  "summary": "Before making this educational investment, consider these essential tips.",
  "article": [
    "If you’re a student, there are some things you should know before you buy a new MacBook. As kids start to go back to school, you’ll want to narrow your options so you don't overpay or get something that doesn’t quite fit the bill. These tips will help you towards that end.",
    "Maybe you’ve been eyeing some of the best laptops already, machines that are great for students due to their superb battery life, portability, and performance. Quite a few of the best MacBooks already make that list. That’s due to the fact that, on top of sharing those characteristics of the other laptops, they’re also very stable. After all, the last thing you want is a student trying to troubleshoot a computer bug in the middle of a lecture.",
    "So, while MacBooks can come at a premium, there are ways to get a quality Apple machine without breaking the bank. Read on to figure out the best machine for you or your student and how to take advantage of things like student discounts to get the best value. Here are the 10 things you should know before you buy a MacBook for students.",
    "Apple has two laptop lines, MacBook Air and MacBook Pro. Each product line is somewhat distinct for offering different screen sizes. Your first decision should be to decide on the screen size you want. If you want a 13.3-inch model, you'll have to decide whether to get a MacBook Air or 13-inch MacBook Pro based on other specifications.",
    "Along with screen size, be aware of the weight of the machine and how that could affect portability. All of today's MacBook models are lighter than past models. However, some remain heavier than the others. Especially for those on a large campus, there's a big difference in carrying a 2.75 pound MacBook Air and 4 pound 15-inch MacBook Pro.",
    "Apple doesn't allow you to swap out parts on any of the current MacBook models. With this in mind, zero in on what you can afford and go with it -- starting with the processor speed. Expect to pay around $200 more as you move up to a better processor. However, don't go overboard.",
    "If you're only purchasing a new laptop to take notes and write reports, save yourself some money and purchase less. Conversely, if you're planning on doing creative work using an Adobe product or something like Final Cut Pro, go with a bigger processor.",
    "Deciding how much computer memory to buy is also crucial. Random access memory, or RAM, is your system's short-term data storage. The larger the RAM, the quicker your computer can access data. Additionally, the more programs your system is running, the more memory you'll need.",
    "Again, Apple doesn't let you change RAM on MacBooks after purchase, so you'll want to choose wisely.",
    "With the advent of cloud-based computing, the amount of onboard storage on computers isn't nearly as significant as it was just a few years ago. With this in mind, I recommend not purchasing the minimum storage that's available on any given MacBook. That number, which currently stands at 256GB, probably isn't enough for most people over the long-term. Conversely, having over 1TB of storage on a laptop is perhaps too much for most folks.",
    "You should back up your MacBook regularly using the built-in Time Machine feature. For this, you should invest in a portal hard drive. These come in various sizes and price points with many often being on sale.",
    "MacBooks are beautiful devices. Unfortunately, they are also fragile. To protect your investment, be sure to purchase a case or bag.",
    "Buying a MacBook isn't cheap; replacing parts without a warranty is also expensive. Each Apple laptop comes with one year of hardware repair coverage. I recommend purchasing AppleCare+ to extend that coverage to three years. You can buy your coverage at the time of purchase or at any time during the first year.",
    "Year-round Apple provides discounts to qualifying higher-education students, parents purchasing on behalf of higher-education students, and faculty and staff at higher-education and K-12 institutions. In the lead-up to new school years throughout the world, Cupertino typically adds extra incentives to convince you to buy through them.",
    "Promotions are available through Apple's online store, retail stores, and authorized campus stores.",
    "After years of bickering, Amazon and Apple began playing nice with one another at the end of 2018. Since then, Amazon has fast become one of the most popular places online to purchase Apple products, including a full line-up of current and past MacBook models.",
    "Amazon has been aggressive when it comes to discounting Apple products. However, don't expect to see huge discounts on current models. Instead, the largest deals can be found on new past models, which are always marked as previous model.",
    "At the time of this writing, for example, you should expect to pay hundreds of dollars less on an older MacBook than its original retail price. Ultimately, it's up to you to decide whether the older model has the specs that you need. Typically, however, Apple only offers minor hardware changes between products year-to-year.",
    "A word of caution: Be on the lookout from Apple products on Amazon marked Renewed. These products are not new.",
    "According to Amazon:",
    "Here's a breakdown of what's different with each MacBook model:",
    "MacBook Air: This is Apple's least expensive laptop. It even has Touch ID and is the only current MacBook model to come in gold.",
    "13-inch MacBook Pro: The smaller of the two Pro models is excellent for those looking for a smaller laptop but still want premium parts inside.",
    "16-inch MacBook Pro: Here's the one for designers and anyone else who wants a large display. It's also the most expensive model, even at its entry-level."
  ],
  "headers": {
    "3": "Decide on a screen size first and portability",
    "5": "Buy as much processor speed as you can afford",
    "7": "Same goes for RAM",
    "9": "How about storage?",
    "10": "Consider a portable hard drive",
    "11": "Get a case",
    "12": "Do buy AppleCare+",
    "13": "Yes, education pricing is available",
    "15": "But check Amazon, too",
    "20": "Finally, look at our cheat sheet"
  },
  "links": {
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "best MacBooks": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "various sizes and price points": "https://www.imore.com/best-usb-c-hard-drives-mac",
    "provides discounts": "https://www.imore.com/e?link=https%3A%2F%2Fapple.sjv.io%2Fc%2F159229%2F554233%2F7613%3FsubId1%3DUUimUdUnU54282YYwYd%26subId2%3Ddim%26u%3Dhttps%253A%252F%252Fwww.apple.com%252Feducation%252F&token=NUlo04Sk",
    "playing nice": "https://www.imore.com/apple-devices-now-amazon"
  }
}