{
  "source": "https://www.techradar.com/news/nikon-flagship-mirrorless-camera-to-surpass-the-nikon-d6-is-coming-in-2021",
  "title": "Nikon: flagship mirrorless camera to 'surpass' the Nikon D6 is coming in 2021",
  "category": "cameras",
  "updated": "2021-03-08T10:56:52Z",
  "author": "mark-wilson",
  "summary": "But will it have the Sony A1's sensor?",
  "article": [
    "Nikon has added its voice to the growing chorus of speculation about next-gen flagship mirrorless cameras by revealing in an interview that it's planning to launch a Nikon D6 \"surpassing\" camera this year.",
    "The Nikon D6 is a full-frame professional DSLR that launched in February 2020, but it's widely thought that the D6, along with the Canon EOS 1D X Mark III, are going to be the last professional flagship DSLRs ever made, with the next generation instead relying on mirrorless tech.",
    "That now appears to have been confirmed in an interview between Keiji Oishi, Department Manager of Nikon's Imaging Business Unit, and DPReview. When asked how far away a mirrorless equivalent of the Nikon D6 is, Keiji Oishi responded: \"A flagship Nikon Z-series mirrorless camera can be expected within the year, and is being developed with the goal of surpassing the D6\".",
    "Interestingly, he went on to reveal that this mirrorless D6 successor will \"debut a newly developed high-resolution stacked CMOS sensor\" and that Nikon's engineers are \"considering powerful video features such as 8K that respond to the needs of all kinds of content creators and professionals\".",
    "So far, the only high-resolution, stacked CMOS sensor we've seen for full-frame cameras is on the recent Sony A1 – so it's possible that Nikon's new flagship will be built around the same chip. The benefit of that stacked sensor design is incredibly fast data read-out speeds which, when combined with a powerful processor, allow the camera to, for example, shoot photos at a lightning fast 30fps.",
    "That would certainly be of interest to professional sports shooters – although, like Canon, Nikon will need to balance the introduction of next-gen features with retaining the comfortable familiarity of the D6's shooting experience. This is something Nikon has done well with its Nikon Z6 II and Nikon Z7 II mirrorless cameras, but its new pro flagship will likely go for an even more traditional design.",
    "Aside from next-gen burst shooting speeds, the other big area where Nikon's new flagship mirrorless camera will likely take a big leap forwards is video.",
    "As Nikon's Keiji Oishi stated, 8K video is on the cards, which means it would join the Canon EOS R5, Sony A1 and rumored Canon EOS R1 in being a hybrid camera that can shoot video at that resolution.",
    "8K video remains something of a future-proofing feature, but it can also bring benefits today. Cameras like the Canon EOS R5 use the sensor's resolution to shoot oversampled 4K footage, which can offer improved sharpness and detail compared to a standard 4K mode.",
    "And Nikon's Keiji Oishi expanded on this point in the DPReview interview, stating: \"And though we simply say '8K', this feature encompasses several user needs, whether it be to shoot video that is as high definition as it gets; to cut out footage into 4K video; or to generate high-definition still image cutouts to avoid missed photo opportunities.\"",
    "Overall, it's no surprise to hear Nikon talking about a flagship mirrorless camera for pro sports shooters in an Olympics year. And compared to rumors about the Canon EOS R1, which would be its main rival and is expected to have a global shutter, the leaps forward are more like relatively conservative strides. But for pro photographers who are fans of the Nikon D6, the prospect of having a sensor like the Sony A1 in a Nikon body will be a very exciting one indeed."
  ],
  "headers": {
    "6": "Movie maestro"
  },
  "links": {
    "Nikon D6": "https://www.techradar.com/reviews/nikon-d6",
    "Canon EOS 1D X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "DPReview": "https://www.dpreview.com/interviews/9636338352/interview-nikon-a-flagship-nikon-z-series-mirrorless-camera-can-be-expected-within-the-year",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Nikon Z6 II": "https://www.techradar.com/reviews/nikon-z6-ii",
    "Nikon Z7 II": "https://www.techradar.com/reviews/nikon-z7-ii",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Canon EOS R1": "https://www.techradar.com/news/canon-eos-r1-release-date-price-rumors-and-leaks"
  }
}