{
  "source": "https://www.techradar.com/news/quick-sony-wh-1000xm4-deals-just-dropped-to-new-price-lows-but-not-for-long",
  "title": "Sony WH-1000XM4 deals drop below previous $278 sales price",
  "category": "audio-visual",
  "updated": "2021-05-24T12:46:12Z",
  "author": "tabitha-baker",
  "summary": "Though they were cheaper over the weekend",
  "article": [
    "Newegg ran some excellent Sony WH-1000XM4 deals over the weekend, knocking the industry leading cups down to just $247.99. While that was a flash sale that has since ended, you can still pick up the powerful noise cancelling headphones for less than their previous $278 sales price. Newegg is still offering the Sony WH-1000XM4s for just $274.98 (was $349.99) - an extra $4 off.",
    "That previous $278 sales price had proven stubborn over sales periods since last year's Prime Day deals. While this offer isn't quite as good as the one we saw a few days ago, you're only spending an extra $26 here. Plus, many retailers are moving back to MSRP as well.",
    "The Sony WH-1000XM4s are top of our list of the best headphones of 2021, and with good reason. From fantastic audio quality to industry leading noise cancellation, and not forgetting the intuitive adaptive sound control features, these cups are miles ahead of their competition.",
    "Not in the US? Scroll down for more Sony WH-1000XM4 prices in your region.",
    "If you're looking for something a little cheaper, check out the Sony WH-1000XM3s ($214.96 at Amazon). While the design remains the same, the additional power in adaptive sound (your noise cancellation levels can change to suit your daily routine, dimming when ordering a coffee, for example), and boosted sound quality is well worth the extra cash here.",
    "Keep an eye out for more discounts in the upcoming Memorial Day sales, or if you're looking to scope out the competition a little more, check out the cheapest noise cancelling headphone deals available now. We're also rounding up all the latest Sony WH-1000XM3 deals if you do opt for the older, slightly cheaper, model."
  ],
  "headers": {
    "4": "Today's best Sony WH-1000XM4 deals",
    "5": "More Sony WH-1000XM4 deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM4 prices": "https://www.techradar.com/deals/best-sony-wh-1000xm4-sales-deals-and-prices",
    "$214.96 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB089NZYF8D%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4113994522302183000-20",
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "cheapest noise cancelling headphone deals": "https://www.techradar.com/deals/cheap-noise-canceling-headphone-deals",
    "Sony WH-1000XM3 deals": "https://www.techradar.com/deals/the-best-sony-wh-1000xm3-sales-prices-and-deals"
  }
}