{
  "source": "https://www.techradar.com/news/netflixs-movie-hit-the-old-guard-is-getting-a-sequel-and-its-filming-soon",
  "title": "Netflix's movie hit The Old Guard is getting a sequel – and it's filming soon",
  "category": "entertainment",
  "updated": "2021-07-01T15:43:58.193Z",
  "author": "samuel-roberts",
  "summary": "74 million subscribers couldn't be wrong",
  "article": [
    "Last year's The Old Guard starring Charlize Theron arrived at just the right time. It was July 2020 and, instead of the Marvel and Fast and Furious movies we thought we'd be enjoying, we had nothing. So along came Netflix to the rescue with a not-so-bad action movie with a daft premise about immortal soldiers, based on a comic book by writer Greg Rucka.",
    "The result? 74 million households watched it – or, at least, they watched two minutes of it, which is what Netflix counts as a view. This firmly made it one of Netflix's most watched movies ever, and it was followed by immediate sequel talk.",
    "Now, Netflix is moving ahead with a sequel, Theron has told Variety, and it's due to film in early 2022. The script has already been written. Alongside Theron's character Andy, the actress confirmed two characters from the first movie will also be returning: Joe (Marwan Kenzari) and Nicky (Luca Marinelli), whose characters had a widely praised gay romantic relationship on-screen.",
    "Director Gina Prince-Bythewood previously expressed interest in a trilogy of movies based on The Old Guard comics, so this seems like a move in the right direction.",
    "It's unclear when this sequel will arrive, but we wouldn't expect it before the end of 2022.",
    "74 million households is a lot of people, and is more than a third of Netflix's 207.64 million (current) subscribers. The Old Guard was as widely watched as any major blockbuster you can think of – it just happened to be seen at home, and not on the big screen.",
    "Netflix is clearly now committed to finding its own franchises that have name recognition. What it doesn't have is a property with a major history, like Marvel or Star Wars or James Bond. So it has to either grow those from scratch, or make big acquisitions.",
    "The streaming service has already made sequels to movie hits on the platform – see the likes of the To All The Boys I've Loved Before... movies, or The Babysitter horror comedies.",
    "This is a different ball game, though. Netflix is making stuff like The Old Guard, Army of the Dead and the upcoming Chris Evans spy movie The Gray Man because it wants to show it can compete in that same sphere. See also its acquisition of two Knives Out sequels. Netflix isn't trying to replace the cinema experience, but it's clearly trying to be an increasingly competitive alternative."
  ],
  "headers": {
    "5": "Analysis: Netflix wants its own movie franchises"
  },
  "links": {
    "The Old Guard": "https://www.techradar.com/news/the-old-guard-netflix-review",
    "urious movies": "https://www.techradar.com/how-to/how-to-watch-the-fast-and-furious-movies-in-order",
    "Netflix's most watched movies ever": "https://www.techradar.com/news/netflixs-top-10-most-watched-movies-ever-are-a-weird-bunch",
    "Variety": "https://variety.com/2021/film/columns/charlize-theron-old-guard-sequel-1235009262/",
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "James Bond": "https://www.techradar.com/how-to/how-to-watch-the-james-bond-movies-in-order",
    "The Gray Man": "https://www.techradar.com/news/netflixs-massive-spy-movie-stars-chris-evans-as-a-really-interesting-villain"
  }
}