{
  "source": "https://www.techradar.com/news/best-valentines-day-games-for-couples-top-titles-to-play-with-your-loved-one",
  "title": "Best Valentine’s Day games for couples: top titles to play with your loved one",
  "category": "gaming",
  "updated": "2021-02-12T18:55:09Z",
  "author": "matthew-forde",
  "summary": "Fill your heart meter",
  "article": [
    "Ah, Valentine's Day. The one day a year when we can shamelessly show affection to our significant other. Some choose to do so with flowers, some choose a romantic meal out, while others spend the entire weekend binge-watching the latest hit show.",
    "But if, like us, you want to take advantage of this date to spend quality time with both of your true loves, we’ve selected the best games out there for playing with your partner this Valentine’s Day.",
    "We realize there are a number of us who are coupled with somebody who may not be as enthused about the latest game releases as ourselves, but this list aims to make sure both players will have a whale of a time, covering a range of games including co-operative playthroughs, episodic encounters or captivating single-player narratives that are sure to keep both viewers glued to the screen for hours on end.",
    "Ready to fill your heart meter? Read on for the best Valentine’s Day games for couples.",
    "Platforms: PS4, Xbox One, PC, Xbox 360, PS3, Android and Mac",
    "Some games you don’t play so much as you simply experience. Life is Strange is one of those games and brings with it a real emotional rollercoaster. Ever wanted to feel closer to your significant other? Make your way through the five-part episodic graphic adventure and your emotions will be tugged at from all directions.",
    "The story follows 18-year old Max, who suddenly discovers she has the ability to rewind time. From this, a whole host of decisions must be made that impact the story as a whole, with every choice more consequential than the last. Each episode lasts approximately two hours and offers a worthy rival to any Netflix series sitting on your watchlist.",
    "Life is Strange is technically a single-player game, but teaming up with a loved one to make some big decisions (which will affect the whole story - no pressure) makes it even more enjoyable. Well, until you disagree...",
    "Platforms: PS4, Xbox One and PC",
    "Supermassive Games’ Dark Pictures Anthology is currently made up of two games: Little Hope and Man of Medan. Both games are interactive survival horrors in the vein of classic teen slasher movies, with the aim being to get all the characters out alive. Whether or not you do this is based on the choices you make, and it’s very easy to make one bad decision and then have the jock torn apart by some big, bad supernatural being.",
    "While you can play both games with one player in the driver’s seat as it were, The Dark Pictures Anthology also offers two multiplayer modes: Movie Night, which allows you and your beloved to divvy up the characters between you, or Shared Story which sees you both playing co-op online with other players. We advise going for Movie Night, so you can share the experience of shouting at each other when someone makes a character decision that sees a horny teen being killed off.",
    "Platforms: Nintendo Switch, Xbox One, PS4 and PC",
    "Teamwork makes the dream work. And in puzzle-platformer Unravel Two, you have no other choice. You and your partner-in-crime play as two “Yarnies” - yarn creatures that look like a knock-off teddy your grandma made you - who are joined by a length of (you guessed it) yarn. Together, you must overcome obstacles and puzzles which see you utilizing your “unique” bond to reach the end of each set level.",
    "Unravel Two is an adorable and laid back adventure, with a beautiful soundtrack. It’s not exactly an action-filled romp, and the actual story can be hard to follow, but it’s great for building those all-important communication skills through phrases like: “No, you pull me up” and “Don’t go yet….NOW!”",
    "Platforms: PS5 and Xbox Series X",
    "Think your relationship or friendship is rock solid? Nothing can get between you? Think again.",
    "Overcooked pushes any relationship to its absolute limits. Expect raised voices, exasperated exhales, death stares and plenty of foul language… all while you attempt to cook a variety of dishes in this beautifully frantic co-op game. The premise is simple - you and your buddy are chefs in a kitchen, the orders roll in, you make them and send the meals out, all in exchange for some sweet sweet cash.",
    "The ‘All You Can Eat’ edition combines all the levels from Overcooked 1 and 2, plus all the DLC which came along with both games. That means there’s plenty of playtime to feast on - assuming you’ve not rage quit and ended things between each other - with over 200 levels, all rendered in 4K and playable at 60fps.",
    "If you aren’t lucky enough to have secured yourself a PS5 or Xbox Series X yet, fear not as Overcooked 1 and Overcooked 2 are also available on PS4, Xbox One, Nintendo Switch and PC.",
    "Platforms: Nintendo Switch, PS4, Xbox One, PC and Mac",
    "It may seem like we’re trying to just include games that will cause you and your partner to scream at each other, but we promise that’s not our goal (it’s just a nice bonus). Moving Out is one such game, running in a similar vein to Overcooked, which sees you trying to move some furniture out of people’s homes. Easy right? Think again. These aren’t normal homes and sometimes not even the furniture is normal, but the aim is to get everything into your moving van before time runs out - whatever state it happens to be in.",
    "If you think real-life moving is stressful then you’re in for an absolute treat. While Moving Out isn’t quite as dynamic as Overcooked, there are plenty of varied levels to work your way through and plenty of fun to be had.",
    "Platforms: Nintendo Switch, Android, PC and Mac",
    "If you don’t have a whole heap of time to play a full game, then you might want to check out the multi-award-winning Florence. Following 25-year-old protagonist, Florence, the interactive narrative takes us through her daily routine before running into love interest Krish.",
    "Consisting of clever puzzles that simulate how awkward a first-date can be (next to the difficulties of holding a career and relationship), this 45-minute window into Florence’s life is a breath of fresh air. Released originally on Valentine’s Day 2018, the music, art-style and general storytelling are extraordinary, placing it at the peak of what the mobile gaming market has to offer.",
    "Platforms: PS4, Nintendo Switch, Xbox One, PS3, Xbox 360, Wii U and PC",
    "Everyone loves Rayman, so why hog the little guy all to yourself? Rayman Legends can be played with one person, but it’s much better with two. The platformer game is simple for even a non-gamer to pick and sees you taking on a myriad of themed levels in an effort to save the poor Teensies. Rayman Legends is great, straightforward fun and offers hours of playtime - and keep an eye out for the game’s musical levels which are a definite highlight.",
    "Platforms: PS4, Xbox One and PC",
    "From the peculiar mind of Josef Fares, A Way Out is the story of two prisoners who must work with one another to escape incarceration. Designed specifically around local split-screen co-op (although online co-op is available too), each player controls either Leo or Vincent and must work in unison to help further the plotline.",
    "Comparable to a walking-simulator at times, even those unfamiliar with game controls can figure their way through this. The action-adventure is full of drama, twists, and a whole lot of cheese. If you can handle that, A Way Out offers an exhilarating six hours, with both friendship and relationships at the focal point of the narrative. Best of all, mid-way through, you can sit down for a cheeky game of Connect Four. Winner.",
    "Platforms: Nintendo Switch, PS4, PC and Mac",
    "Looking for a game to play this Valentine’s Day that’s actually about romance - kind of. Then look no further. Lovers in a Dangerous Spacetime has everything you want from a game for couples: space, lovers, evil anti-love forces, teamwork and kidnapped space bunnies. If you’re not sold already, we don’t know what to tell you.",
    "In all seriousness, Lovers in a Dangerous Spacetime is a great co-op game that sees you and your partner working together to explore a colorful galaxy in your battleship - fending off any anti-love forces that think about taking you on. In no time, you’ll be operating like a beautiful well-oiled machine. Ain’t love grand?",
    "Platform: Nintendo Switch",
    "Snipperclips is a delightfully cute co-op puzzle game inspired by papercraft. When the two characters - Snip and Clip - overlap you can cut out part of the other to alter their shape to fit your problem. Using this one simple mechanic players are tasked with solving a variety of puzzles in a beautiful crafts-themed setting, from fitting inside a shape template Hole in the Wall-style to trying to put a basketball through a net.",
    "If you or your partner aren’t gamers, don’t fret. Snipperclips is brilliant for beginners, and with fairly intuitive puzzles you should both be able to find a solution, no matter your experience.",
    "Platforms: PS4, Xbox One, PC and Mac",
    "You know what they say, the couple that survives the wilderness together survives life together. Ok, so we made that up, but it’s probably true. If it is then Don’t Starve Together will have you and your partner set for life. The co-op survival game sees you and your loved one trying to survive in a strange and dangerous world full of creatures that try to eat you and other unexpected dangers.",
    "Alongside trying to not get killed by the world itself, you both need to also ensure you’re eating enough, getting enough sleep and generally keeping your mental health in a good place. The best way to survive is to harvest resources from the world, craft handy survival tools and hope you’ll make it through to another day. Sounds romantic, right?"
  ],
  "headers": {
    "4": "Life is Strange",
    "8": "The Dark Pictures Anthology",
    "11": "Unravel Two",
    "14": "Overcooked: All You Can Eat",
    "19": "Moving Out",
    "22": "Florence",
    "25": "Rayman Legends",
    "27": "A Way Out",
    "30": "Lovers in a Dangerous Spacetime",
    "33": "Snipperclips",
    "36": "Don't Starve Together",
    "39": "Best Valentine’s Day games for couples: at a glance"
  },
  "links": {
    "Life is Strange": "https://www.techradar.com/news/gaming/life-is-strange-and-the-importance-of-contemplation-1313600",
    "Man of Medan": "https://www.techradar.com/news/how-supermassive-games-man-of-medan-is-leading-the-social-gaming-charge"
  }
}