{
  "source": "https://www.techradar.com/news/microsoft-teams-onedrive-users-will-soon-be-able-to-upload-whopping-great-files",
  "title": "Microsoft Teams, OneDrive users will soon be able to upload whopping great files",
  "category": "computing",
  "updated": "2021-01-13T12:01:03Z",
  "author": "joel-khalili",
  "summary": "Sharing large files over Microsoft Teams and OneDrive is about to become a whole lot easier",
  "article": [
    "Microsoft has announced it will expand the maximum file size limit for uploads to its cloud storage service OneDrive and, by extension, its collaboration software Teams.",
    "Currently, OneDrive users can only upload files up to 100GB in size, but Microsoft is working to expand this limit to 250GB, per an entry in the company’s product roadmap.",
    "Because files shared over Microsoft Teams are also hosted on OneDrive, the effective file size limit for the collaboration platform will also more than double in size.",
    "The upgrade has not yet taken effect, but Microsoft has suggested the new limit will come into play before the end of the month.",
    "Sharing large files over the internet has never been particularly straightforward. Email services, which may be the first port of call for many, are known to cap attachment sizes at roughly 20-25MB.",
    "Dedicated file transfer services, meanwhile, are able to transport much heftier files, but even paying users can only share single files of up to 20GB (in the case of WeTransfer).",
    "Alternatively, file compression software provides a means of reducing the size of files that need to be transferred, but also adds additional steps to the process and introduces an opportunity for data loss or corruption.",
    "The ability to upload large files directly to OneDrive, in their original form, will therefore be a welcome addition for many professionals, particularly those that are required to handle high-resolution video content.",
    "It’s worth noting, however, that the upgrade will only apply to paying Microsoft 365 customers, because the total storage capacity allocated to free OneDrive users is only 5GB, a long way short of the new single file upload limit."
  ],
  "headers": {
    "4": "Microsoft Teams, OneDrive file size limit"
  },
  "links": {
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "product roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-6764478486943508000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D70558",
    "Sharing large files": "https://www.techradar.com/best/best-ways-to-share-big-files",
    "file compression software": "https://www.techradar.com/news/the-best-file-compression-software",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review"
  }
}