{
  "source": "https://www.techradar.com/news/with-nvidia-rtx-30-series-gpu-prices-finally-falling-is-it-time-to-build-a-gaming-pc",
  "title": "With Nvidia RTX 30-series GPU prices finally falling, is it time to build a gaming PC?",
  "category": "computing",
  "updated": "2021-08-10T12:15:00Z",
  "author": "matt-hanson",
  "summary": "Nvidia prices are falling faster than AMD",
  "article": [
    "Could the GPU nightmare finally be over? Perhaps – as there’s some encouraging signs that Nvidia’s RTX 30-series graphics cards, including the excellent RTX 3080 and RTX 3060, may finally be dropping in price after months of inflation.",
    "The global chip shortage – in part caused by the Covid-19 pandemic – combined with pent-up demand and a boom in cryptocurrency mining, has caused a perfect storm that has made new graphics cards extremely hard to get hold of. To make matters worse, when GPUs are in stock, some retailers or resellers are selling them at inflated prices.",
    "This has made upgrading your PC, or building a new one from scratch, a real headache, as well as being more expensive than usual. So, a new report from 3DCenter.org, as spotted by Toms Hardware, which suggests prices for certain GPUs may be dropping, is certainly good news.",
    "Before we dig in to what this means, there are some caveats. For a start, the report looks at prices in Germany only. However, Germany is one of the biggest markets for PC components, so a trend there could hint at wider market implications.",
    "What’s also interesting about the report is that while Nvidia graphics card prices appear to be falling, the prices for AMD graphics cards are actually rising. This has led to some Nvidia GPUs being better value than AMD ones. What a world we live in.",
    "According to the report, back in may Nvidia cards were selling at a whopping 300% above their MSRP (manufacturer's suggested retail price). However, a month later that inflation had dropped to 191%, and is now at 150%. While still above MSRP, it’s still a substantial drop.",
    "While these price drops are good news for people wanting an Nvidia graphics card, for AMD fans, it appears to be a different matter, as prices haven’t dropped quite as much. New AMD RX 6000 series cards were selling at 214% of their MSRP recently, and that has dropped to just 159%.",
    "Of course, the price of AMD cards didn’t have as far to fall as Nvidia ones, but with its rival’s prices dropping faster, it could leave AMD’s GPUs looking like a worse value proposition.",
    "So, what’s going on? For a start, while Nvidia has been implementing hash rate limiters to stop its GPUs being so attractive to cryptocurrency miners, which could have a knock-on effect of miners and scalpers mass-buying its GPUs and inflating prices, AMD hasn’t followed suit.",
    "There’s also the fact that Nvidia’s GPUs are vastly outselling AMD’s graphics cards – with the ultra-high-end RTX 3090 outselling all AMD RX 6000 GPUs according to a recent Steam Hardware Survey.",
    "This would suggest there’s less leeway (or desire) for retailers to start dropping the prices of AMD GPUs as quickly.",
    "With graphics cards being so scarce, or selling for such high amounts recently, many people have been holding off building or upgrading their PCs. So, does this drop in price suggest now’s the time to build your dream rig?",
    "In one way – yes. If you find an Nvidia RTX 30-series GPU on sale right now for a price you can afford, it’s worth getting. There’s a good chance it’s being sold for less than it would have been going for a few months ago.",
    "GPU stock still remains low, so if you don’t buy one now, it may go out of stock and you may not be able to get hold of one for months, further delaying your build.",
    "However, there are also reasons to wait, if you can. The prices are going in the right direction, but they are still being sold above MSRP. By holding on, you may find prices drop further – though there’s no guarantee they will.",
    "What this does mean is that PC gamers finally have a bit of flexibility. A few months ago with inflated prices and low stock, we recommended not upgrading your PC. However, with prices dropping, for some people now is a good time.",
    "With Black Friday and Cyber Monday coming up later in the year, we may see prices drop a little further. We don’t expect any bargains, but we may finally be able to upgrade our PCs without spending obscene amounts. We hope."
  ],
  "headers": {
    "6": "What about AMD?",
    "11": "Is now a good time to build or upgrade?"
  },
  "links": {
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "boom in cryptocurrency mining": "https://www.techradar.com/news/crypto-miners-could-flock-to-the-nvidia-rtx-3080-leaving-gamers-out-in-the-cold",
    "3DCenter.org": "https://www.3dcenter.org/news/hardware-und-nachrichten-links-des-78-august-2021",
    "by Toms Hardware": "https://www.tomshardware.com/uk/news/rtx-30-prices-cheaper-than-rx-6000",
    "Nvidia graphics card": "https://www.techradar.com/news/nvidia-geforce",
    "AMD graphics cards": "https://www.techradar.com/news/amd-graphics-cards",
    "RTX 3090 outselling all AMD RX 6000 GPUs": "https://www.techradar.com/news/nvidia-geforce-rtx-3090-outsells-all-amd-rx-6000-gpus-is-amd-in-trouble",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}