{
  "source": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect",
  "title": "The Witcher: Blood Origin on Netflix: release date, cast, story and what to expect",
  "category": "entertainment",
  "updated": "2021-07-23T07:56:01Z",
  "author": "rob-dwiar",
  "summary": "What we know about Netflix’s hotly anticipated prequel series",
  "article": [
    "Set over a millennium before the adventures of Geralt of Rivia, prequel series The Witcher: Blood Origin is set to take us back to a pivotal time in the history of the Continent. Announced by Netflix in July 2020, the live-action series will explore the origins of Witchers and the ancient Elven civilisation before it fell.",
    "Star Trek: Discovery's Michelle Yeoh has already signed up to head up the cast, while The Witcher showrunner Lauren S Hissrich has teamed up with season 1 writer Declan de Barra to shepherd the spin-off to the screen. That a second series in the Witcher universe was greenlit so soon after the first series aired in December 2019 is an indication of how serious Netflix is about the franchise – and hopes are high it'll result in more memorable stories based in the vast world of author Andrzej Sapkowski.",
    "So with The Witcher: Blood Origin set to begin production in August 2021, here's everything we know so far (including cast and character details) about the hotly anticipated prequel series.",
    "There is currently no The Witcher: Blood Origin release date – and don't expect one any time soon. The Witcher season 2 only wrapped its epic shoot in April 2021, ahead of its December 2021 debut, and the production process on the prequel series is likely to be just as long.",
    "We do know that, as of October 31 2020, the writing process was well underway, with showrunner Declan de Barra saying that “all the writers are off to outline or script”.",
    "And by March 2021, de Barra was busy showing off (redacted) pre-production drafts of The Witcher: Blood Origin scripts.",
    "Now Deadline is saying the show is set to go before the cameras in August. So, after what we're guessing will be a lengthy shoot, followed by all the usual VFX work, we'd be surprised if we see the six episodes of The Witcher: Blood Origin on Netflix before 2023.",
    "It’s still early days, but there have already been some announcements about The Witcher: Blood Origin cast:",
    "With early rumors about Aquaman star Jason Momoa taking a starring role now unlikely to come to fruition, the biggest name currently attached to The Witcher: Blood Origin is Star Trek: Discovery and Shang-Chi and the Legend of the Ten Rings star Michelle Yeoh. Her involvement in the show was announced in early July 2021, and she’ll be playing Scían, the last of a tribe of Elven nomads.",
    "The character description reveals that she is, “the very last of her nomadic tribe of sword-elves. No one can come close to her artistry with the blade, and no one carries as much loss within their heart. When a chance presents itself to retrieve a stolen sacred sword, taken from her fallen tribe by nefarious means, she launches herself into a deadly quest that will change the outcome of the Continent.”",
    "This promises to be a major role for Yeoh, so it’ll be interesting to see how it impacts her long-mooted Discovery spin-off Section 31 – if it goes ahead.",
    "According to Deadline, Yeoh will be joined by Giri/Haji and Marcella star Sophia Brown as Éile. Brown replaces Queen & Slim star Jodie Turner-Smith, who had to leave The Witcher: Blood Origin due to a scheduling conflict. Éile is described as “an elite warrior blessed with the voice of a goddess, who leaves her clan and position as Queen’s guardian to follow her heart as a nomadic musician. A grand reckoning on the Continent forces her to return to the way of the blade in her quest for vengeance and redemption.”",
    "The third confirmed member of The Witcher: Blood Origin cast is, Variety reported in March, Laurence O’Fuarain – a veteran of episodes of both Vikings and Game of Thrones. He’ll play a character named Fjall.",
    "According to the character synopsis, he’s “born into a clan of warriors sworn to protect a King, Fjall carries a deep scar within, the death of a loved one who fell in battle trying to save him. A scar that won’t let him settle, or make peace with himself or the world around him. In his quest for redemption, Fjall will find himself fighting beside the most unlikely of allies as he carves a path of vengeance across a continent in turmoil.”",
    "Given Blood Origin's setting and where it sits on the timeline, we can expect to see an extensive list of as-yet unfamiliar characters. More generally, we can expect the 'Elder races' – those who existed in the Continent before humans – to play a much more prominent role. There's likely to be a particular emphasis on Elves, due to their importance in the Conjunction and beginning the Elder bloodline.",
    "As stated in the Netflix’s original announcement about the show, The Witcher: Blood Origin will be set 1200 years before the world of The Witcher during the universe-altering Conjunction of the Spheres. Expect an emphasis on the ancient Elven society, tensions between races as they are introduced to each other, and the appearance – and disappearance – of the world due to the Conjunction.",
    "Setting the scene for the content of the show, show creators Lauren S Hissrich and Declan de Barra have tweeted a little about what to expect. Hissrich said she \"always wanted to dive deeper into the myth and lore of the continent…\" And a prequel not bound to existing stories in the Witcher books – while still being able to draw on the rich world of the Continent – is a promising starting point and premise.",
    "De Barra said that he has long wanted to answer the question of \"What was the Elven world really like before the cataclysmic arrival of the humans?\", and added that the series \"will tell the tale of the Elven civilization before its fall, and most importantly reveal the forgotten history of the very first Witcher.\"",
    "That's plenty to pique interest already. However, we can also glean some information and make educated guesses about the show's story from what we already know.",
    "Using Netflix's official synopsis as a starting point, we can start to dig into the series' events and stories: \"Set in an elven world 1200 years before the world of The Witcher, Blood Origin will tell a story lost to time – the origin of the very first Witcher, and the events that lead to the pivotal ‘conjunction of the spheres', when the worlds of monsters, men, and elves merged to become one,\" says Netflix's synopsis. We think the two most important clues in this are the term 'Blood Origin' and the 'Conjunction of the Spheres' event.",
    "Blood Origin is surely a nod to the Elder Blood: the bloodline that Ciri, aka the Lion Cub of Cintra in The Witcher, belongs to, and that distinguishes her as special and powerful – dangerously so. The Elder Blood began with elven mages and was originally meant to be kept solely within the Elven race. This did not occur as one prominent carrier strayed from the elven line to begin a relationship with a human. Given this relates to such an important, and now established character in Ciri, it'll be incredibly interesting to see if The Witcher; Blood Origin shows us how the bloodline began.",
    "The Conjunction of the Spheres is arguably the single most important event in the world of The Witcher. According to the mythology, it was a great magical cataclysm that linked many worlds, with multiple timelines and dimensions crossing over each other simultaneously. This resulted in the world being full to bursting with diverse races (including the introduction of humans, and the beginning of the gradual fall of the Elven society), and the vast array of terrifying monsters, and the introduction of magic.",
    "The Conjunction of the Spheres had effects that would last hundreds of years in this universe, and is responsible for the rich and diverse make-up of the world – but also the danger, chaos, and uncertainty that prevails throughout it. So important is the Conjunction to the entire world of The Witcher, it harbors enormous potential for storytelling and framing the entire universe.",
    "A last, but important, note: the Elven/human mixing of the Elder Bloodline happened after the Conjunction of the Spheres, and the Witcher order came well after the Conjunction, too, so there's plenty of leaps that will need to be made to compress it all into the six episodes.",
    "The Witcher: Blood Origin is likely to appeal to all fans of the universe – whether you came into the stories via the Netflix show, the books or the games. The origin story of the Witchers is a hell of a hook for a prequel."
  ],
  "headers": {
    "3": "The Witcher: Blood Origin release date: when we expect to see it",
    "7": "The Witcher: Blood Origin cast: who's in the prequel series?",
    "15": "The Witcher: Blood Origin: when will it be set?",
    "16": "The Witcher: Blood Origin: what's going to happen?",
    "24": "More Witcher is only a good thing for fans"
  },
  "links": {
    "Announced by Netflix": "https://www.techradar.com/news/the-witcher-prequel-tv-series-is-coming-to-netflix",
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Deadline": "https://deadline.com/2021/07/witcher-blood-origin-netflix-sophia-brown-michelle-yeoh-laurence-ofuarain-1234788420/",
    "Aquaman": "https://www.techradar.com/news/aquaman-2-release-date-cast-and-what-else-we-know-about-dcs-return-to-atlantis",
    "Star Trek: Discovery": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "Her involvement in the show was announced in early July 2021": "https://www.techradar.com/news/netflixs-the-witcher-blood-origin-prequel-just-cast-a-major-star",
    "Section 31": "https://www.techradar.com/news/star-trek-section-31-release-date-cast-plot-how-it-ties-into-canon-and-more",
    "Variety": "https://variety.com/2021/tv/news/witcher-blood-origin-prequel-series-netflix-laurence-ofuarain-1234938855/",
    "the Witcher books": "https://www.techradar.com/how-to/how-to-read-the-witcher-books-in-order"
  }
}