{
  "source": "https://www.techradar.com/news/wild-rift-public-beta-is-finally-launching-in-the-us-on-march-29",
  "title": "Wild Rift public beta is finally launching in the US on March 29",
  "category": "gaming",
  "updated": "2021-03-09T18:27:45Z",
  "author": "david-lumb",
  "summary": "Play League of Legends Mobile on March 29",
  "article": [
    "League of Legends: Wild Rift, the mobile version of the popular MOBA, has been in open beta for months – and now it’s finally coming to the US and the rest of the Americas on March 29.",
    "To clarify, the beta is launching in North, Central, and South America on March 29, and unlike previous beta launches that focused on Android users, this Americas beta is fully open to both iOS and Android players. And just like the desktop version, Wild Rift will be free to play, with ways to earn champions or purchase them with in-game microtransactions.",
    "Riot Games, makers of League of Legends, strived to preserve its core gameplay when transitioning to mobile, though they did make some adjustments for smartphone gaming: the map is smaller, the matches are shorter, and some champions’ abilities have been altered to better suit touch controls.",
    "Wild Rift has been optimized to play on new and old phones, supporting a minimum spec of Android phones with 1.5GB of RAM, a Snapdragon 410 chipset, Adreno 306 GPU, and 32-bit Android processor support, and iPhone 6S or better (at least for the beta – the full launch may support even older phones).",
    "It’s not so much graphical power as framerate that matters, Riot Games’ Trent Cambell, Principal Technical Project Manager on Wild Rift told TechRadar.",
    "“On devices like the iPhone 6S (our minimum spec on iOS), our data shows a consistent framerate of near 30fps, and players have the option to change graphic quality settings to match their needs,” Campbell stated in an emailed reply to TechRadar’s questions. “We think the game still looks and feels great at the lowest graphics setting!”",
    "Wild Rift launched its first closed beta in September 2021 in the Philippines, Indonesia, Singapore, Malaysia, and Thailand, before expanding to Taiwan, Vietnam, Oceania, and parts of Europe in December. They had openly planned to launch in the Americas in March 2021, meaning they’ll squeak in their expected launch window."
  ],
  "headers": {
    "3": "Wild Rift: a MOBA for most mobile phones"
  },
  "links": {
    "League of Legends: Wild Rift": "https://www.techradar.com/news/league-of-legends-mobile",
    "told": "https://www.techradar.com/news/iphone-12-vs-iphone-6s-see-the-difference-in-game-graphics-youre-missing-out-on"
  }
}