{
  "source": "https://www.techradar.com/news/lookout-snaps-up-ciphercloud-to-offer-end-to-end-business-protection",
  "title": "Lookout snaps up CipherCloud to offer end-to-end business protection",
  "category": "computing",
  "updated": "2021-03-17T02:42:55Z",
  "author": "anthony-spadafora",
  "summary": "End-to-end platform will secure data from endpoints to the cloud",
  "article": [
    "The cybersecurity firm Lookout has acquired the cloud-native security company CipherCloud which operates in the emerging Secure Access Service Edge (SASE) market for an undisclosed sum.",
    "By combining its Mobile Endpoint Security offering with CipherCloud's SASE technologies, Lookout plans to provide businesses across industries with an end-to-end platform that secures their entire data path from endpoints to the cloud.",
    "CipherCloud currently offers solutions that span several developing SASE categories including Cloud Access Security Broker (CASB), Zero-Trust Network Access (ZTNA), Secure Web Gateway (SWG) and Data Loss Prevention (DLP). Many of the world's largest global enterprises and government institutions depend on the company to deliver comprehensive visibility, data security, threat protection and compliance for cloud-based applications.",
    "CEO of Lookout, Jim Dolce explained in a press release how the company's acquisition of CipherCloud will allow it to further expand in the enterprise market, saying:",
    "“We couldn’t be more excited to welcome the CipherCloud team to Lookout. Our two organizations share a common passion for accelerating cloud adoption with cloud-native solutions that secure mission-critical data. Joining forces with CipherCloud is the next phase of our enterprise market expansion, extending our reach from the endpoint into the cloud where the applications and data reside. Through this combination, we will deliver endpoint-to-cloud security by tying together elements of our individual solutions into a single cloud-delivered offering.”",
    "As a result of the proliferation of remote users working from home, the adoption of cloud applications, data moving to the cloud and more network traffic flowing to public cloud services, the need for an integrated endpoint-to-cloud security solution has grown significantly.",
    "At the same time, only a fully integrated solution can close the gaps created by multiple point products from separate security vendors as the signals and control points needed to stop zero-day attacks are scattered across the entire end-to-end path.",
    "Over the next five years, Gartner predicts the SASE market will grow at a compound annual growth rate of 42 percent to reach almost $11bn by 2024 and this puts Lookout in a unique position to capitalize on this growth.",
    "Once the acquisition closes, founder and CEO of CipherCloud Pravin Kothari will join Lookout as the company's EVP of product and strategy for SASE and CipherCloud will operate under the Lookout brand and leadership."
  ],
  "headers": {
    "5": "Endpoint-to-cloud security"
  },
  "links": {
    "Lookout": "https://www.techradar.com/reviews/lookout-security-and-antivirus",
    "SASE": "https://www.techradar.com/news/the-next-big-thing-in-networking-technology",
    "endpoints": "https://www.techradar.com/news/best-endpoint-security-software",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "DLP": "https://www.techradar.com/best/best-data-loss-prevention-service",
    "press release": "https://www.lookout.com/company/media-center/press-releases/lookout-to-acquire-ciphercloud-to-deliver-security-from-endpoint-to-cloud",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "public cloud": "https://www.techradar.com/news/what-is-public-cloud",
    "zero-day attacks": "https://www.techradar.com/news/google-chrome-users-still-vulnerable-to-multiple-zero-day-attacks"
  }
}