{
  "source": "https://www.techradar.com/news/inspirational-black-figures-in-gaming-and-technology",
  "title": "Inspirational Black figures in gaming and technology",
  "category": "computing",
  "updated": "2021-10-22T16:14:37Z",
  "author": "jamel-smith",
  "summary": "Black figures we all should know",
  "article": [
    "October is Black History Month in the UK, but you might not know that from looking at the tech and gaming worlds. Compared to recent years, there doesn’t seem to be much out there in the way of content celebrating Black History month, and that’s something we at TechRadar would like to help put right.",
    "Black people have made and are making an undeniable impact in the gaming and technology industry, but to this Black writer their impact has often felt underappreciated and undervalued – and, in the case of pioneering figures in these fields, forgotten – to the point where I was genuinely surprised about some of the things I discovered while researching this article.",
    "And I wasn’t just surprised – I was disappointed and frustrated. The tech and gaming industries are certainly working to address issues of inclusion and diversity, but with mixed results, and, in my opinion, not quickly enough. But right now we’re here to celebrate, by looking at the lives and achievements of three pioneering Black figures in the fields of tech and gaming, and one woman who’s having a huge impact on the world of gaming today.",
    "A tech pioneer whose name had been almost forgotten, but who in recent years was rediscovered, and given the recognition he richly deserves, Jerry Lawson revolutionized the nascent video game industry in the 1970s, heading up the video games division at Fairchild Semiconductor International, and laying the foundations for the gaming industry we know today.",
    "Lawson and his team developed the Fairchild Channel F (Channel Fun), which was released in November 1976, and was the first console ever to use swappable ROM cartridges that held different types of games; previous consoles like the Magnavox Odyssey held games on the device itself. The Channel F was also the first console to feature a ‘pause’ button, and pioneered the use of a single dedicated CPU in a console to drive game logic.",
    "Lawson was also one of only two black members of the Silicon Valley Homebrew Computer Club, a club famously attended by Apple founders Steve Jobs and Steve Wozniak – although in a 2009 interview with the website Vintage Computing, Lawson recalled that he “wasn’t impressed” by the pair. (Wozniak also interviewed, unsuccessfully, with Lawson for a job at Fairchild.)",
    "The Channel F, though revolutionary, only saw short-term success, selling 350,000 units by 1979. The console was largely overshadowed by the Atari 2600, which was released a year after the Channel F and sold in the millions, and Fairchild sold its console technology to Zircon International. Lawson left Fairchild in 1980 and founded Videosoft, the first Black-owned video game development company, which made games for the Atari 2600.",
    "Lawson died in 2011 aged 70, and is survived by his wife, Catherine, and children Anderson and Karen. It’s astonishing that a Black man born in Jim Crow-era America, and raised in the South Jamaica district of Queens in New York did so much to revolutionize gaming, an industry that’s expected to be worth more than $200 billion in 2023. Not only that, he also left behind a tremendous legacy for young Black kids looking to forge a career in gaming, science, and tech.",
    "“[Black kids] need to understand that they’re in a land by themselves,” Lawson told Vintage Computing in his 2009 interview. “Don’t look for your buddies to be helpful, because they won’t be. You’ve gotta step away from the crowd and go do your own thing. You find a ground, cover it, it’s brand new, you’re on your own – you’re an explorer. That’s about what it’s going to be like. Explore new vistas, new avenues, new ways – not relying on everyone else’s way to tell you which way to go, and how to go, and what you should be doing.”",
    "Another all-but-forgotten pioneer in gaming, Muriel Tramis was the first Black female game designer. Tramis was born in 1958 on the French-governed West Indian island of Martinique, and started working at the French video game development company Coktel Vision in 1986, where her talent for game design and development was quickly recognized.",
    "Though Tramis’s most popular games were the 90s Gobliiins series and The Bizarre Adventures of Woodruff and the Schnibble, which were family-oriented adventure and puzzle titles, her adult-themed games were her most unique and memorable. They explored topics such as slavery and erotica, in stark contrast to the family-friendly games that dominated the gaming industry in the late 80s and early 90s.",
    "Tramis collaborated with longtime friend Patrick Chamoiseau to make her first game, Mewilo, released in 1987. Mewilo was the first video game based on West Indian culture, with a story based on an old Martinican fable, The Legend of Gold Bars. The legend tells story of plantation masters who buried their gold along with dead slaves, so that the slaves’ restless spirits would keep outsiders away, and the game has you playing a paranormal expert in Martinique trying to find the hidden treasure. The game was a success, and Tramis followed it up with Freedom: Rebels in the Darkness, released in 1988, a game about slaves orchestrating a rebellion against their slave masters.",
    "Tramis changed direction radically for her next game. Emmanuelle, released in 1989, which has you playing a man trying to enhance his sexual prowess to win back his ex, Emmanuelle. Tramis returned to the theme of erotica for her following game, Geisha, which was released the following year, in which the player travels to Japan to stop a mad scientist from turning their girlfriend into a robotic Geisha. Her next game, Lost in Time, was promoted as being the first interactive adventure film using full-motion video technology.",
    "It’s astonishing to think that a Black female game developer was exploring these dark and adult themes back in the late 80s and early 90s, when the wider gaming community was still debating whether it should be tackling them at all. Last year, The Last of Us Part II garnered a huge amount of criticism due to its depiction of adult, dark and brutal themes that had largely been exclusive to movies and TV shows until then. Some critics found the game too dark and harrowing, but three decades earlier Tramis had shown us that games are art, and a reflection of humanity, and that developers shouldn’t shy away from exploring serious themes.",
    "“I would say that video games are similar to cinema, like film d’auteur,” Tramis told gaming and tech website The Icon in a 2020 interview. “I wanted to propose my own scenarios, like a movie director who desires a subject to be about something pleasing and motivating to them and makes them want to put it into cinematic pictures. Well, it’s a bit the same in video games with the themes that I wanted to explore, like sexuality or slavery. These are difficult subjects on which I wanted to experiment, and I had a way, a medium that allowed me to express myself.”",
    "Tramis left Coktel Vision in 2003, and later started her own company, Avantilles, which specialized in creating 3D applications for the web. In 2018 she was appointed a Knight of the Legion of Honor, the highest title of merit for French citizens. She now campaigns for young women and people of color to pursue careers in tech and science; as she told The Guardian in a recent interview, if women represent 50% of digital users, “they must also be 50% of designers, engineers and technicians”.",
    "Ed Smith was one of the first Black electronic engineers in the video game industry. In the late 70s and early 80s, Smith worked for consumer electronics firm APF Electronics Inc, where he took the lead in designing the prototype for the APF-MP1000, also known as the APF Microcomputer System, a cartridge-based video game console released in 1978. He also worked on the expansion computer module for the APF-MP1000, The Imagination Machine, which was released in 1979, and which effectively created a hybrid gaming console/computer.",
    "Neither machine sold well in the face of competition from Atari, Apple, and Commodore, and the company also suffered as a result of the video game crash of 1983. Smith later transferred to sales at APF, and his achievements in the tech field were recognized by Black Enterprise Magazine in 1982.",
    "While working in tech, it became immediately obvious to Smith how badly Black people were underrepresented in that world. “Well, the clear memory from day one, since the time that I went to that Consumer Electronics Show, and throughout my career – almost to date – is how there are still just a handful of folks of color in this industry,” Smith told Vintage Computing in 2017. “Even when I was at my first show, I was one of three in a room of 50,000 that I could see, I was shocked.”",
    "Things aren’t much better today. Black people represent just 4.4% of Google’s workforce in 2021, and in 2020 they made up 9% of Apple’s workforce and just 3.8% of Facebook’s. It’s frankly shameful that Black people are still so badly underrepresented in the tech world some 40 years after Smith and Jerry Lawson were blazing their trails.",
    "Stephanie Ijoma founded the multicultural and inclusive gaming platform NNE SAGA in 2015. It’s now one of the biggest platforms of its kind, and “not only caters to Black women/femmes but everyone. Men, non-binary, people of color, white, indigenous – you name it”.",
    "Ijoma has secured deals and partnerships with PlayStation, Xbox, Elgato, Nintendo, EA, just to name a few, and NNE SAGA has garnered a huge following on Twitch, YouTube and Twitter by delivering original, entertaining and engaging content.",
    "Ijoma’s priority, though, is to amplify Black and other marginalized groups. She told TechRadar: “I grew up playing games with all kinds of people, and that’s what I want reflected both online and offline.”",
    "A quick look at NNE SAGA’s Twitter feed gives you an idea of how hard it’s working to increase Black and other minority representation in the gaming industry. For Black History Month, NNE SAGA has highlighted eight Black British gamers and content creators, and partnered with streaming hardware specialists Elgato to support them throughout October.",
    "While Ijoma has firmly established herself as a trailblazer in the gaming industry, she tells us that she still feels she has “a long way to go”. We asked how she feels about being such an influential figure in her industry, and she told us: “My goal is to leave a legacy, so that those after me do not have to suffer or go through the trials and tribulations I’ve been going through over the last six years.”",
    "Ijoma started NNE SAGA in response to the chronic underrepresentation of Black women and other minorities in the gaming industry, but she feels that the industry still has a very long to go, and isn’t currently doing enough.",
    "“There are many solutions, and it’s right there in front of them, but in an industry where there’s systematic racism, everything is a choice,” she says. “Ultimately, you choose what you want to market, sell, support and promote, and if the top dogs are constantly not choosing Black women and people to be a part of the campaigns or launches, or even hire Black people, then we are stuck in this constant box. “For me, I’m going to continue kicking down the doors and opening more opportunities for us until the rooms change.”"
  ],
  "headers": {
    "3": "Gerald ‘Jerry’ Lawson",
    "9": "Muriel Tramis",
    "16": "Edward 'Ed' Smith",
    "20": "Stephanie Ijoma"
  },
  "links": {
    "Vintage Computing": "https://www.vintagecomputing.com/index.php/archives/1230/ed-smith-interview",
    "selling 350,000 units by 1979": "https://www.fastcompany.com/3040889/the-untold-story-of-the-invention-of-the-game-cartridge",
    "$200 billion in 2023": "https://www.forbes.com/sites/mattgardner1/2020/09/19/gaming-industry-value-200-billion-fortnite-microtransactions/?sh=10cb506b2bb4",
    "The Last of Us Part II": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "The Icon": "https://www.theicon.com/a-first-lady-of-gaming/",
    "The Guardian": "https://www.theguardian.com/games/2021/may/05/gaming-in-colour-uncovering-video-games-black-pioneers",
    "Black Enterprise Magazine in 1982": "https://books.google.co.uk/books?id=N6pacvfrf0wC&lpg=PA44&ots=gh-vhV9aWC&dq=Ed+smith+black+enterprise&pg=PA40&redir_esc=y#v=onepage&q&f=false",
    "4.4% of Google’s workforce": "https://www.statista.com/statistics/311810/google-employee-ethnicity-us/",
    "and in 2020": "https://www.cnbc.com/2020/06/12/six-years-into-diversity-reports-big-tech-has-made-little-progress.html",
    "NNE SAGA": "https://nnesaga.co.uk/",
    "Twitch": "https://www.twitch.tv/nnesaga",
    "YouTube": "https://www.youtube.com/nnesaga",
    "Twitter": "https://twitter.com/nnesaga?s=20"
  }
}