{
  "source": "https://www.techradar.com/news/trading-212-has-stopped-taking-on-new-customers-amid-market-mania",
  "title": "Trading 212 has stopped taking on new customers amid market mania",
  "category": "computing",
  "updated": "2021-01-29T01:19:38Z",
  "author": "anthony-spadafora",
  "summary": "New users will be able to register once the existing queue is processed",
  "article": [
    "The stock trading app and FCA-regulated broker Trading 212 is no longer taking on new users after retail investors began signing up for the service in droves.",
    "The London-based firm said that it would once again allow new accounts to be created only after it had processed all of the existing applications in its queue.",
    "Trading 212 isn't the only platform having difficulties though as Robinhood, IG Group and others have experienced outages as the number of retail trades have soared this week.",
    "In a statement posted on Twitter, the company provided further details on its decision to stop onboarding new clients, saying:",
    "“Due to the unprecedented demand, we have temporarily stopped onboarding new clients. Once we process the existing queue, we will be open for new registrations. We apologise for the caused inconvenience and highly appreciate your understanding”",
    "Before announcing that it would stop onboarding new users, Trading 212 also experienced difficulties in transmitting orders due to the high level of demand. This led existing orders to possibly be executed with a delay while placing new orders became impossible using the service.",
    "For those out of the loop, the current market mania is a direct result of Reddit users on the subreddit WallStreetBets. Once these users realized that hedge funds were shorting the stock of the brick and mortar video game retailer GameStop, they began buying up the company's stock themselves.",
    "Once GameStop's stock increased from $20 a share to a high of $347 on Wednesday, WallStreetBets users then began trying to inflate the price of other company's stocks including AMC, BlackBerry and Nokia. This led Trading 212, Robinhood and other platforms to halt trading and no longer allow their users to purchase GameStop stock.",
    "Trading 212 will soon start onboarding new users but the US financial market and even global financial markets for that matter will likely crackdown on WallStreetBets and other retail investors organizing online.",
    "Via Finance Magnates"
  ],
  "headers": {
    "5": "Service disruptions"
  },
  "links": {
    "stock trading app": "https://www.techradar.com/best/best-stock-trading-apps",
    "Trading 212": "https://www.techradar.com/reviews/trading-212",
    "Robinhood": "https://www.techradar.com/reviews/robinhood",
    "posted on Twitter": "https://twitter.com/Trading212/status/1354707372334264328",
    "Reddit": "https://www.techradar.com/news/reddit-considers-letting-users-tip-each-other-with-real-money",
    "GameStop": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "AMC": "https://www.techradar.com/news/fast-and-furious-studios-movies-wont-be-shown-by-amc-and-odeon-after-lockdown",
    "BlackBerry": "https://www.techradar.com/news/blackberry-sells-smartphone-patents-to-huawei",
    "Nokia": "https://www.techradar.com/news/nokia-10",
    "Finance Magnates": "https://www.financemagnates.com/forex/brokers/trading-212-shuts-out-new-accounts-amid-massive-influx-of-redditors/"
  }
}