{
  "source": "https://www.techradar.com/news/fortnites-approach-to-guest-characters-is-aggressively-dull",
  "title": "Fortnite’s approach to guest characters is aggressively dull",
  "category": "gaming",
  "updated": "2021-02-26T17:35:06.628Z",
  "author": "rhys-wood",
  "summary": "Opinion: a lesson in how not to do a crossover",
  "article": [
    "There’s no denying the monolithic success of Fortnite Battle Royale. Like a phoenix rising from the ashes, the mode once considered ancillary to Save the World – Fortnite’s co-op-centric horde mode that pitted players against waves of zombies – eclipsed it in no time at all.",
    "In the years since, Fortnite has surpassed other battle royale giants like PUBG to become the undisputed leader in terms of player numbers, revenue and in-game events. It's a shame, then, that its crossover events with other franchises feel woefully tacked on.",
    "In the long term, Epic Games' commitment to guest character inclusion in Fortnite usually ends up being a total misrepresentation of whoever’s in the spotlight at the time. Usually, these boil down to a character skin or two and a brief marketing window, nothing that will shake up Fortnite's status quo.",
    "Fortnite’s history with crossover content dates back almost three years at this point. Its first big collaboration was with Marvel to promote Avengers: Infinity War. In this event, a player lucky enough to find the iconic Infinity Gauntlet could transform into Thanos, the primary villain of the latter Avengers movies.",
    "It was an interesting way for Epic to test the waters on future crossover events. The event was only available for a limited time, and it provided a unique, somewhat refreshing spin on the Fortnite formula in the form of a powerful and player-controlled threat on the map.",
    "Fortnite continued to work with Marvel, offering skins of beloved characters like Iron Man, Captain America and Captain Marvel to name but a few, and these represented perhaps the peak of Fortnite’s crossover potential, as Chapter 2: Season 4 implemented a swathe of map changes alongside unique Marvel-themed items and powers.",
    "It got more interesting when Epic Games went on to throw DC characters into the mix. Aquaman, Batman, The Flash et al are able to join the fray alongside or against Marvel’s best, technically making Fortnite the first official Marvel vs. DC crossover game. There is a problem with that, though, as I’ll get into later.",
    "Things only grew increasingly puzzling from there. Fortnite began to pepper in crossovers and obtainable guest character skins from a plethora of different franchises in the following years. Many felt right at home on Fortnite’s chaotic, ever-changing island map, including Marvel’s own Deadpool, whose manic fourth-wall-breaking charm fit effortlessly into the game’s mayhem.",
    "Others still felt incredibly bizarre. Additions like NFL players, God of War’s Kratos and Street Fighter’s Ryu and Chun-Li all feel remarkably out of place wielding weapons largely based on real-world guns.",
    "I have to admit that if I was a child watching all this crossover chaos unfold, I would be beside myself with joy. Fortnite has intentionally marketed itself as a giant interactive toy box with its scattershot approach to crossovers. There’s something undeniably appealing about watching Stranger Things’ Hopper mow down The Joker with a minigun.",
    "Yet therein lies the issue – these lovable characters barely do anything that is distinctly associated with them. They act like any other outfit you can obtain in Fortnite, albeit originating from recognizable third-party brands. Some are graced with unique emotes at least, such as Chun-Li’s Lightning Kick and She-Hulk’s transformation. Nevertheless, I can’t see these guest appearances as anything other than a cynical cash grab.",
    "For the sake of comparison, let’s look at another game that heavily features guest characters as paid downloadable content, that being Super Smash Bros. Ultimate. What does Smash do right that Fortnite doesn’t? Well, the key is in how these characters are represented.",
    "Since Super Smash Bros. Brawl on the Wii, the series has had a steady focus on the inclusion of characters outside of Nintendo’s purview. Brawl kicked off the insanity in 2008 with Sonic the Hedgehog and Metal Gear’s Solid Snake.",
    "2018’s Super Smash Bros. Ultimate exploded in terms of guest content. Since that game’s launch, characters like Joker from Persona 5, Steve from Minecraft and Final Fantasy VII’s infamous villain Sephiroth all made playable appearances.",
    "Each of these characters is celebrated in Smash with painstaking attention to detail. Each features moves and abilities recognizable from their games of origin, and they’re always paired with a stage showcasing the game or series they’re from, alongside a suite of music tracks.",
    "Smash, alongside other crossover-happy games like SoulCalibur 6 and Tekken 7 shows how a developer can elevate a game by handling guest content with care. These games speak to something bigger than the individual characters – they are representing what makes those franchises so special and why people love them to this day.",
    "Meanwhile, Fortnite’s approach to guest characters smacks of throwing wads of cash at whatever’s popular at the moment. Given Fortnite’s insane success, Epic certainly has the financial power to do this. Sadly, the game time and again chooses a flavor-of-the-month junk food approach, just because it can.",
    "I want to see Epic do better with its guest inclusions in Fortnite. It has the resources and manpower to be able to do so. I don’t want to play as Master Chief because “oh, hey, that’s Master Chief. I like Master Chief.” I want to play as him because I love Halo as a whole and want to be reminded of what makes that series so good in the first place. If I’m playing as Master Chief, I want movement to feel swift but decidedly heavy. I want to hear those shields pop when I’m low on health, ringing out that iconic warning klaxon.",
    "A 'less is more' approach could work wonders here. Fortnite could really benefit from featuring less crossovers with more content in each one. How cool would it be if Chun-Li could perform her iconic Lightning Kick attack to knock down structures in place of the familiar pickaxe?",
    "How about a Halo themed event period where we can see the iconic ring on the horizon, with Covenant ships frequently flying over the island for an extra layer of fan immersion? To its credit, the actual Halo event did feature a recreation of the classic Blood Gulch map, but it was locked behind Fortnite’s Creative Mode and wasn’t hugely substantial.",
    "If they’d have thrown in event-specific items and weapons like Overshields and Halo’s iconic arsenal, paired with that goosebump-inducing main theme, you’ve got a winner of a collab in my book.",
    "The problem here, of course, is that Fortnite is a very different game compared to the likes of Super Smash Bros. Fortnite operates as a live service – a game that is being constantly updated with new content.",
    "The quick turnover of Fortnite’s Battle Pass system leaves more substantial events with little room in the spotlight. Instead of giving crossover content more room to breathe, Fortnite is trapped in the perpetual live service cycle, ready to swap out content based on whatever the zeitgeist is.",
    "As such, I’ve grown so very tired of Fortnite’s approach to crossover content, even when it’s representing characters and series I actually love. The bitesize nature of these inclusions feel like they come and go in a flash with little fanfare. That’s the exact opposite of what guest characters are supposed to achieve.",
    "While I’ll always remember Super Smash Bros. Ultimate as the game that let me beat up Sephiroth with Terry Bogard in front of a Minecraft village, I’m worried that Fortnite’s legacy will be buried in a veritable heap of forgettable crossovers that the game could have done so much more with."
  ],
  "headers": {
    "3": "Crossover conundrums",
    "9": "V-Buck where it's due",
    "17": "Quantity over quality"
  },
  "links": {
    "Fortnite Battle Royale": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "PUBG": "https://www.techradar.com/news/fortnite-vs-playerunknowns-battlegrounds-which-is-the-game-for-you",
    "Avengers: Infinity War": "https://www.techradar.com/news/thanos-is-coming-to-fortnite-complete-with-the-avengers-infinity-war-gauntlet",
    "God of War’s": "https://www.techradar.com/news/god-of-war-review",
    "Street Fighter’s": "https://www.techradar.com/news/street-fighter-could-collide-with-fortnite-in-the-next-crossover-event",
    "Super Smash Bros. Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review",
    "Metal Gear’s": "https://www.techradar.com/news/a-metal-gear-solid-remake-could-be-coming-exclusively-to-ps5",
    "Minecraft": "https://www.techradar.com/news/the-next-super-smash-bros-ultimate-fighter-is-actually-four-minecraft-characters",
    "Final Fantasy VII’s": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "Tekken 7": "https://www.techradar.com/how-to/tekken-7-tips-and-tricks",
    "Master Chief": "https://www.techradar.com/news/master-chiefs-next-game-isnt-halo-infinite-its-fortnite",
    "Halo": "https://www.techradar.com/news/halo-the-master-chief-collection-is-getting-a-serious-xbox-series-x-upgrade",
    "Terry Bogard": "https://www.techradar.com/news/super-smash-bros-ultimate-dlc-characters-fighters-leaks"
  }
}