{
  "source": "https://www.techradar.com/news/whatsapp-is-getting-an-awesome-read-later-feature",
  "title": "WhatsApp is getting an awesome 'read later' feature",
  "category": "computing",
  "updated": "2021-01-13T13:36:03Z",
  "author": "sofia-wycislik-wilson",
  "summary": "New tool will act as a replacement for Archived Chats",
  "article": [
    "Beta versions of WhatsApp often give and exciting glimpse into the future, and the latest one for Android is no exception. In this most recent release, there are sign of new feature called Read Later, and serves as a nice distraction from all of the current talk about WhatsApps changes to its Terms of Service.",
    "Strictly speaking, Read Later is not a completely new feature. It's really a replacement for the existing Archived Chats option, and it includes various improvements and enhancements over its predecessor.",
    "Being called Read Later makes the feature sound very much like an old article bookmarking service called Read It Later (now called Pocket), but this is nothing to do with links that are shared in chats. Instead, it gives you a way to push certain conversations out of the way so you are not bothered by constant notifications about them.",
    "Any new messages that are sent to the chat – be it a one-on-one, or a group chat – will arrive silently leaving you free to check in and read them at your leisure. Although you are not notified about new messages, you can still easily access chats that have been added to Read Later as there is a handy shortcut at the top of your chats list.",
    "Read Later is great for those occasions when you simply don't want to be interrupted by a constant barrage of messages, or you don’t have the time to respond to a busy group chat. When the time comes that you are ready to start interacting with the chat once again, you can head to Read Later settings and move the messages back into the main chats list and you'll receive notifications from this point forward.",
    "The new Read Later feature can be found in WhatsApp beta for Android 2.21.2.2. If you'd like to become a beta tester for the app and get early access to features like this, you can sign up to take part in the testing program via Google Play.",
    "Via WABetaInfo"
  ],
  "headers": {
    "4": "Very well read"
  },
  "links": {
    "Google Play": "https://play.google.com/apps/testing/com.whatsapp/join",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-2-2-whats-new/"
  }
}