{
  "source": "https://www.techradar.com/news/revil-is-dominating-the-global-ransomware-scene",
  "title": "REvil is dominating the global ransomware scene",
  "category": "computing",
  "updated": "2021-10-04T14:20:47Z",
  "author": "mayank-sharma",
  "summary": "Brazen campaigns could led to unprecedented action",
  "article": [
    "Cybersecurity experts traced a clear majority (73%) of ransomware detections in Q2 2021 to one group - the REvil gang.",
    "For its October Advanced Threat Research Report, McAfee Enterprise crunched threat data from over a billion sensors across multiple threat vectors around the world.",
    "“Names such as REvil, Ryuk, Babuk, and DarkSide have permeated into public consciousness, linked to disruptions of critical services worldwide. And with good measure, since the cybercriminals behind these groups, as well as others, have been successful at extorting millions of dollars for their personal gain,” noted Raj Samani, McAfee Enterprise fellow and chief scientist.",
    "According to the report, cloud incidents that attacked businesses in the US accounted for 34% of incidents recorded in Q2 2021. Notably, even though Europe saw the largest increase in reported incidents (52%), the UK registered a drop of 19% in the time period.",
    "According to the researchers, Q2 2021 was an interesting quarter for ransomware as it managed to attract unprecedented attention from the US administration.",
    "In fact, the response to DarkSide’s attack on Colonial Pipeline, and REvil’s campaign against the global IT infrastructure provider Kaseya, caused both groups to halt their operations abruptly.",
    "Interestingly, the fear of repercussions from the authorities even prompted the cybercriminal underground forums that provide safe haven for these cybercriminals to institute a ban on ransomware advertisements.",
    "However, as the report notes, these actions appear to be temporary measures, as REvil has reared its head on the forums once again, while DarkSide seems to have evolved into BlackMatter.",
    "The good however is that the report shows that attacks across several sectors, such as information and the manufacturing sectors, were down.",
    "“Organizations shouldn’t get complacent, however, and should use this as an opportunity to figure out what has worked well and how they could tighten up their defences against future attacks,” suggested Adam Philpott, EMEA President at McAfee Enterprise.",
    "If the threat actors were expecting the threat of action from the authorities has blown over, they have another thing coming as US President Joe Biden has announced plans to bring together over 30 countries to jointly tackle the rising ransomware menace."
  ],
  "headers": {
    "4": "Evolving landscape"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "McAfee": "https://www.techradar.com/reviews/mcafee-2020-antivirus-solutions",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Colonial Pipeline": "https://www.techradar.com/news/major-us-fuel-pipeline-taken-down-by-ransomware-attack",
    "Kaseya": "https://www.techradar.com/news/kaseya-ceo-says-thousands-of-firms-may-be-affected-by-ransomware-attack",
    "REvil has reared its head": "https://www.techradar.com/news/revil-is-back-and-wants-to-rebuild-its-reputation",
    "BlackMatter": "https://www.techradar.com/news/camera-giant-olympus-hit-by-ransomware-attack",
    "bring together over 30 countries": "https://www.techradar.com/news/president-biden-wants-to-kill-off-ransomware-for-good"
  }
}