{
  "source": "https://www.techradar.com/news/sony-airpeak-drone-finally-takes-off-with-an-astronomical-price-tag",
  "title": "Sony Airpeak drone finally takes off, with an astronomical price tag",
  "category": "cameras",
  "updated": "2021-12-02T11:03:16Z",
  "author": "mark-wilson",
  "summary": "And that's before you add a camera",
  "article": [
    "Just over a year on from its first official teaser, the Sony Airpeak drone has finally gone on sale – and the price tag pitches it firmly at professional filmmakers with studio budgets.",
    "The Airpeak S1 is Sony's first drone, and is available to order for $8,999 in the US (around £6,760 / AU$12,670). Shipping is expected to start on December 24, which means it may just miss the Christmas stockings of excited film directors.",
    "Still, it's good to hear that the Airpeak will soon be out in the wild, given that the project was first announced in November 2020. Unlike DJI's drones, which mostly have built-in cameras, the Sony Airpeak is designed to carry Sony's full-frame mirrorless cameras, like the Sony A7S III and Sony FX3.",
    "Mount a Sony A1 camera in the Airpeak, and you'll have a full-frame drone that's capable of shooting in 8K resolution. While we've already seen an 8K drone in the Autel Evo II, that drone has a significantly smaller 1/2-inch sensor.",
    "So what else do you get for your $9,000? Beyond the ability to carry full-frame cameras, another benefit of the Airpeak's size is its wind resistance – Sony claims it can remain stable in winds of 44.7mph, which is about twice the wind resistance of one of its closest rivals, the DJI Inspire 2.",
    "The Airpeak S1 can also hit top speeds of 55.9mph, making it nimble enough to chase cars in action scenes, while its combination of stereo cameras and a vision-sensing processor gives it real-time 3D spatial awareness, much like drones from the likes of DJI and Skydio.",
    "You also get a RCR-VH1 controller, which lets you control the drone, gimbal and camera, although there's also a Dual Operation mode that allows two people to independently control the aircraft and camera. This is likely to be the most common setup on professional shoots, particularly with over $10,000 of equipment in the air.",
    "Slightly more limiting, though, is the estimated 22 minutes of flight time – and that's without a payload. Once you have a camera on board, like the Sony A7S III with an FE 24mm f/1.4 GM lens, this battery life drops to just 12 minutes. Even though you can hot-swap batteries without powering the Airpeak down, it does mean that filmmakers will need to be very clear as to the shot they want before take-off.",
    "The Sony Airpeak S1 may not be the direct DJI rival that hobbyist fliers were hoping for, but it makes complete sense as the debut drone for the maker of professional full-frame cameras.",
    "In recent years, DJI has focused more on making folding, compact drones for filmmakers, recently packing its latest tech into the comparatively tiny DJI Mavic 3. While the latter weighs under 900g, the Airpeak is 3.5x heavier without any battery packs – and is something of an albatross in terms of wingspan, too.",
    "DJI does have the Inspire 2 in its lineup, which is similarly aimed at professional cinematographers, and supports cameras like the Zenmuse X5S for shooting 5.2K/30p footage. But it's now five years old, and DJI's other large drones – like the mildly terrifying Matrice 300 Series – are instead built more for the emergency services, aerial security and search-and-rescue teams.",
    "It's possible that DJI may respond with a Airpeak rival, but the integration of Sony's drone with its full-frame cameras – not to mention studios like Sony Pictures – mean it's likely to be the aerial rig of choice for many pro cinematographers, particularly those who already use Alpha cameras on the ground.",
    "The question for amateur fliers is whether or not the Airpeak S1 will be the flagship drone of a series that eventually includes consumer models, or is simply a one-off toy for film directors. Our money is on Sony sticking to the high-end professional space, but that doesn't mean we aren't also very keen to see a mini Sony Airpeak RX100."
  ],
  "headers": {
    "8": "Analysis: Sony flies into an aerial space vacated by DJI"
  },
  "links": {
    "Sony Airpeak": "https://www.techradar.com/news/sony-airpeak-drone-release-date-price-rumors-and-leaks",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Sony FX3": "https://www.techradar.com/news/sony-fx3-is-officially-its-smallest-cheapest-cinema-camera-for-pro-filmmakers",
    "DJI Mavic 3": "https://www.techradar.com/reviews/dji-mavic-3"
  }
}