{
  "source": "https://www.techradar.com/news/hp-streamlines-the-printing-experience-with-new-service",
  "title": "HP is bundling all your printing needs in one package",
  "category": "computing",
  "updated": "2021-07-13T13:22:09Z",
  "author": "mayank-sharma",
  "summary": "New HP service aims to streamline the printing experience",
  "article": [
    "HP has announced a new all-in-one printing solution to facilitate work-from-home environments for individuals and small businesses.",
    "Dubbed HP+, the new service is pitched as a complete printing solution, bundling a WiFi-enabled printer together with the HP Smart app for computers and smartphones, along with a subscription service for ink/toner refills.",
    "HP+ banks on the fact that home printer sales shot up over recent months, with the company also seeing large success in its refill subscription service.",
    "The HP+ offering will be available starting May 2021 and covers a wide range of inkjet and laserjet printers, from the HP DeskJet 2700e Series to the HP OfficeJet Pro 9000e Series.",
    "The HP+ bundle includes a cloud-connected HP printer that’s equipped with dual-band Wi-Fi and can automatically detect and resolve connectivity issues.",
    "The printers can be operated using the Smart App, which offers all the usual functions you’d expect from a printing and scanning app.",
    "The HP+ bundle also includes six months of free ink/toner refills, which can be optionally extended.",
    "“We’ve put our best printing innovation together into one, smart system for consumers and small businesses. From category leading hardware, to the largest supplies subscription service now including toner, to the best-in-class print app now in the cloud, each of our enhanced experiences for HP+ were designed to meet the expanded needs of those who depend on their printers most,” said Gary Tierney, UK&I Printing Category Director, HP."
  ],
  "headers": {
    "3": "All-in-one bundle"
  },
  "links": {
    "HP": "https://www.techradar.com/best/best-hp-printers",
    "work-from-home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "printer": "https://www.techradar.com/news/best-wireless-printers",
    "HP printer": "https://www.techradar.com/best/best-hp-printers"
  }
}