{
  "source": "https://www.techradar.com/news/mobile-devices-are-being-attacked-more-frequently-than-ever-before",
  "title": "Mobile devices are being attacked more frequently than ever before",
  "category": "computing",
  "updated": "2021-06-16T13:33:38Z",
  "author": "mayank-sharma",
  "summary": "Move towards remote working has put mobile devices in the crosshairs",
  "article": [
    "A large number of IT decision makers believe their organizations are more vulnerable to cyberattacks on business smartphones than ever before.",
    "A survey over 600 IT decision makers commissioned by Menlo Security found that while a majority of the respondents admitted that they’re either more susceptible to mobile attacks or have already encountered one, a surprisingly high percentage of respondents (88%) still felt confident in the ability of their organization to both identify and prevent them.",
    "Menlo says that its study aimed to look at the increasing security considerations and concerns around mobile usage as more businesses shift towards remote working.",
    "“Although many organizations are confident in their ability to identify and prevent mobile attacks, oftentimes this is just overconfidence in legacy solutions that are not able to provide 100% protection against the latest waves of socially engineered attacks such as Phishing and Smishing or zero-days,” said Mark Guntrip, senior director of cybersecurity strategy for Menlo Security.",
    "Threat actors are always on the lookout for targets that are easy to exploit, and given the large number of remote working employees, attackers are now concentrating their efforts on mobile devices, reasons Guntrip.",
    "He believes the issue is further compounded by the fact that these devices often make it difficult to identify the classic signs of malicious emails or links, such as URL addresses.",
    "In addition to assessing the mobile security threat landscape, the survey also questioned respondents about the strategies that are most often used by organizations to address the threats.",
    "It discovered that isolation adoption hovers around 40%, and lags behind more traditional approaches such as mobile device management (84%).",
    "“Unfortunately, mobile security has often been an afterthought for enterprise security strategies. Today’s businesses must rethink how they’re safeguarding their networks and what avenues are most susceptible to threats in the remote work landscape,” Guntrip stresses."
  ],
  "headers": {
    "4": "Mobile devices are new targets"
  },
  "links": {
    "business smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "remote working": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "Phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "mobile devices": "https://www.techradar.com/news/best-phone",
    "mobile device management": "https://www.techradar.com/best/best-mdm-solutions"
  }
}