{
  "source": "https://www.techradar.com/news/how-to-buy-a-refurbished-phone-the-promises-and-pitfalls-of-going-second-hand",
  "title": "How to buy a refurbished phone: the promises and pitfalls of going second hand",
  "category": "phones",
  "updated": "2021-10-03T08:00:51Z",
  "author": "sean-cameron",
  "summary": "Is it worth going second hand?",
  "article": [
    "New phone time comes for us all. Whether through age, damage, market competition or otherwise, our mobile devices inevitably lose their luster, and so comes the point when they need to be retired to make way for new blood.",
    "Finding a new phone is a difficult proposition, there have never been so many new options to choose from, and finding the right one can become an overwhelming obsession. But what if the right phone isn’t in fact new?",
    "Last year’s flagship devices will often offer better performance in almost all categories (camera, power, display, battery etc) than mid-range competitors launched the year after, and at a very similar price point. So why doesn’t everyone buy old?",
    "Whether pre-loved or pre-hurt, finding not only the right device but one in the right state of repair can be a significant challenge in itself. While there are a host of players offering refurbished devices for sale, each has their own standards of repair and not all are equal.",
    "Read on for our guide on buying refurbished devices, what to look for and what to avoid.",
    "When buying a new phone, the transaction is simple - you are the first owner and the device will be pristine. When buying refurbished, things become a little more complicated. If ‘New’ is the perfect state a device can be in, everything that then follows is in degrees of degradation from that point.",
    "There are a host of players selling refurbished phones both domestically and internationally. These can range widely in quality and service, though some may offer attractive price-tags they may come with significant caveats in tow.",
    "A good example of this can be found in Gumtree/Craigslist or equivalent. Many devices in varying states of repair can be found, but care needs to be taken to ensure you have a positive transaction.",
    "If this is your preferred route, make sure that the device you have picked is listed with photos of it in hand and powered on. Placeholder listings with stock imagery should be avoided like the plague.",
    "The seller should list the general state of repair, listing any cosmetic or further damage to the device, and they should be responsive to any questions you might have. If they want to make an exchange in person, never go alone, and if they want cash then run for the hills as the device in question may be a little ‘too hot to handle’.",
    "Away from the Wild West that is the Gumtree/Craiglist field, things improve considerably.",
    "Most professional refurbishers will list devices with a condition grade, which will range from the equivalent of A+ (Mint/Excellent) to C (Average). They will post images of the device in use and powered on, will be responsive to questions asked and will often offer a limited guarantee on devices purchased, usually for six months.",
    "While it may seem that all condition grading schemes are the same, it is always worth looking at the grading offered by your seller of choice, different options have differing standards.",
    "As might be expected given the smartphone boom, there are host of options to choose from when it comes to professional refurbishers. Many smartphone manufacturers, from Apple and Samsung to others, offer official refurb stores. Following this, many carriers will offer refurbished devices for sale, as will retailers such as department stores and electronics chains.",
    "With so much choice on offer, it can be a little easy to get lost however. Luckily there are more generalist options available which guarantee a similar level of quality while offering more powerful search options.",
    "The first such option is the venerable eBay, though it has diminished in standing from years past, it still offers a host of interesting opportunities. Here you can search by device for options which might interest you. Many retailers have online outlets which are managed through eBay, we would recommend that you should give these priority over others due to the increased ease of return if necessary.",
    "With eBay, the usual provisos apply. If you are using the approved storefront of a known retailer, you can relax slightly. Should you choose to go down an alternate route, ensure that the device you hope to purchase is pictured with it in the ‘on’ state in in use at least once.",
    "Other options than eBay exist of course, an interesting alternative in Europe and the USA is Back Market. Acting as a marketplace exclusively for refurbished phones, this has gained significant traction in Europe since its inception and is now expanding to the UK as well as the USA.",
    "User reviews are placed front and centre, condition reports are detailed clearly and each sale comes with a relatively robust returns policy. If you are looking to replace your handset and want a minimum of fuss in doing so, Back Door may be worth a shout. It is worth mentioning that the service positions itself as Amazon does, that is as a ‘service’ rather than a vendor.",
    "If the seller becomes difficult for whatever reason, it isn’t explicitly detailed where the ‘service’ will step in to mediate the exchange. It isn’t to be expected that this will come about, but is worth bearing in mind regardless.",
    "This applies too to Swappa, which has significant reach within the USA. Though the service provides an easy way to find a refurbished handset, there are some guarantees which aren’t quite as clear as they should be.",
    "None of this is to say that buying a refurbished phone is difficult, for this is far from the truth. There have never been so many second-hand units in need of a good home, which will provide excellent value for their owners, and for the environment too.",
    "In buying a refurbished handset, doing your homework will always pay dividends."
  ],
  "headers": {
    "5": "A Question of Trust",
    "15": "Choosing an online marketplace"
  },
  "links": {}
}