{
  "source": "https://www.techradar.com/news/wireless-electric-car-charging-pads-now-available-for-drivers-of-special-renault-evs",
  "title": "Wireless electric car charging pads now available for drivers of special Renault EVs",
  "category": "car-tech",
  "updated": "2021-10-18T14:44:22Z",
  "author": "rhys-wood",
  "summary": "Year-long trial wants to bring wire-free charging to the masses",
  "article": [
    "UK-based firm Char.gy has begun a 12-month trial featuring wireless charging pads it has developed for electric cars, in an effort to make wireless EV charging more accessible.",
    "As reported by Autocar, the trial will initially take place in Marlow, Buckinghamshire in the UK, where a wireless car charging pad has been set up in a dedicated parking space. Nine more locations are reported to follow, spread out across the county.",
    "The trial will make use of ten modified Renault Zoe EVs, and are rentable by the general public via car hire platform Hiyacar. The rates are fairly low, too, at £1 per hour or £5 for the day (plus added insurance costs).",
    "A Char.gy spokesperson gave some additional context on what the project hopes to achieve, stating: \"This new charging solution will mean that in the near future, those without access to private charging via garages, driveways or other off-street parking options will be able to charge their vehicles efficiently and cable-free.",
    "\"This infrastructure means no charging cable - potentially hazardous for other road or pavement users – and no lamp-post charging and is only activated when an EV parks over it.\"",
    "We love the idea of wireless car charging technology becoming more readily available to the public, and while this Char.gy-led project is somewhat limited in scope, it could hopefully raise awareness for the benefits of going electric.",
    "Especially with tech as cool as wireless charging pads, and vehicles as zippy and robust as the Renault Zoe.",
    "The idea of charging an EV with a cable-based solution isn't hugely appealing to everyone, especially when filling up at a petrol station takes a fraction of the time it would to fully charge an EV.",
    "However, technology like wireless charging pads could take the stress - and the wires - away from replenishing an EV's batteries, especially if they become readily available enough for most drivers to park on.",
    "Wireless electric car charging is seeing a surge in activity in 2021, with Genesis revealing its first EV - the GV60 - will have a wireless charging option, while the state of Indiana in the US has confirmed it will build a one mile stretch of wirelessly charging road.",
    "It's a good time to trial new EV technology like wireless charging pads. A Next Green Car report revealed that the number of registered EVs (both BEVs and PHEVs) in the UK ballooned in 2021 to just over 600,000, so demand is clearly rising.",
    "Hopefully we'll see more wireless charging projects sprout up should Char.gy's efforts prove a success."
  ],
  "headers": {
    "5": "Analysis: More trials like this, please"
  },
  "links": {
    "Autocar": "https://www.autocar.co.uk/car-news/electric-cars/uk-firm-begins-public-trial-wireless-ev-chargers",
    "wireless car charging": "https://www.techradar.com/news/wireless-electric-vehicle-charging",
    "Renault Zoe": "https://www.techradar.com/news/renault-zoe",
    "the GV60 - will have a wireless charging option": "https://www.techradar.com/news/finally-wireless-car-charging-is-coming-to-an-electric-car-youll-be-able-to-buy",
    "a one mile stretch of wirelessly charging road": "https://www.techradar.com/news/charging-your-electric-car-wirelessly-while-you-drive-has-taken-a-major-step-forward",
    "Next Green Car report": "https://www.nextgreencar.com/electric-cars/statistics/"
  }
}