{
  "source": "https://www.techradar.com/news/android-12s-biggest-feature-might-not-be-on-many-phones-at-launch",
  "title": "Android 12's biggest feature might not be on many phones at launch",
  "category": "phones",
  "updated": "2021-10-11T09:30:00Z",
  "author": "tom-bedford",
  "summary": "A Material Coup",
  "article": [
    "Arguably the biggest Android 12 feature is Material You, a way of personalizing the user interface design of your smartphone by choosing the colors, icon shapes and more. It sounds like many devices won't actually have this feature when they upgrade to Android 12 though.",
    "In a briefing on ColorOS 12, a version of Android 12 used for Oppo phones and adapted by Oppo from Google's original software, one of the team discussed how Material You wasn't part of the Android Open Source Project (AOSP).",
    "Oppo followed this up with a comment to TechRadar saying, \"Material You is not with Android 12’s AOSP, so it’s not available to original equipment manufacturers (OEMs). We will need to wait until Google confirm when they plan to release it in the code.\"",
    "The Android Open Source Project is a repository into which Google uploads code for versions of Android, so other companies like Oppo, OnePlus and Xiaomi can create their 'forks' from it. On October 4, Google uploaded what we believed to be Android 12's full code to the AOSP, but it's only now that we're hearing this wasn't, in fact, the full code.",
    "ColorOS 12 rolls out at the end of the year for the Oppo Find X3 Pro, and in 2022 for most the brand's other new phones. In the briefing, the company speculated a newer version of ColorOS 12 with Material You could come in early 2022.",
    "In a blog post from Google Developers dated October 4, the company lists new features that Android 12 brings, but the language used in the Material You section doesn't actually confirm the code has been added to the AOSP, with an alpha version offered instead.",
    "The post says to \"watch for support for Jetpack Compose coming soon\". Jetpack Compose is a Google tool for designing user interfaces, so this all suggests Material You support is still upcoming.",
    "Google itself declined to comment on this news story. We did get an additional comment from OnePlus, however, as its OxygenOS is made by the same team as Oppo's ColorOS (due to a recent merger between the companies).",
    "A spokesperson for OnePlus said, \"OnePlus evaluates and customizes the software experience on OxygenOS to best fit OnePlus users‘ needs. At the moment, we are still evaluating Material You and will continue to listen to our users’ feedback.\"",
    "This shows Material You won't be on OxygenOS 12, which is currently in beta for the OnePlus 9 and 9 Pro.",
    "The fact that Material You isn't included in the Android Open Source Project means that, when phone brands start rolling out their forked versions of Android 12 to relevant smartphones, the user-interface-designing features won't be available straight away.",
    "We've spoken to a variety of phone companies regarding each's Material You plans, and we will update this news story with comment if we hear more.",
    "Some phone brands are expecting to roll out Android 12 upgrades towards the end of the year, but many haven't laid out a roadmap just yet, meaning it'll likely be 2022 before the newest version of Google's operating system gets ported to some eligible phones.",
    "Even then, it'll take programmers a while to adapt Material You so it's appropriate for the specific Android update, and works well with the existing systems in the phone. Given that Material You brings a system-wide redesign to apps and menus, this'll likely take some time.",
    "Oppo is one of the first companies to unveil its Android 12 roadmap, and if even it doesn't expect Material You before 2022, it's likely that other brands will only be able to offer the feature later that year.",
    "This won't be the case with phones from brands like Pixel, Nokia and Motorola, which offer 'stock' Android, without tweaks or changes. These brands could feasibly roll out Android 12 as it is in the AOSP, so wouldn't need to spend time tweaking Material You.",
    "Obviously, this doesn't help now, since the feature is missing from the AOSP, but when it's added these brands can bring it to their phones quickly.",
    "If you need Material You on a phone as soon as possible, it's likely the Google Pixel 6 and Pixel 6 Pro will debut with Android 12 intact - after all, they're made by Google, and Pixel phones typically act as a showcase for the newest version of the company's operating system.",
    "But why wouldn't Google include Material You in the AOSP, thereby locking other phone brands out of this top feature? The cynic inside us says \"so Pixel phones have an extra big feature to showcase\" but the reality is probably less dire - the fact that the feature is still in alpha via the Google Developer website, suggests it's not fully ready yet.",
    "Indeed, when we tested the Android 12 beta on a Pixel 4a 5G, the feature seemed promising but lacked a diverse range of customization options. Perhaps Google is increasing its effectiveness.",
    "So when your smartphone gets the Android 12 update in the coming months, don't be too surprised if Material You isn't available straight away."
  ],
  "headers": {
    "10": "Analysis: so when could Material You show up?"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Oppo phones": "https://www.techradar.com/news/best-oppo-phones",
    "Google uploaded what we believed to be Android 12's full code": "https://www.techradar.com/news/android-12-is-sort-of-out-but-you-cant-get-it-yet",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "blog post from Google Developers": "https://android-developers.googleblog.com/2021/10/android-12-is-live-in-aosp.html",
    "recent merger between the companies": "https://www.techradar.com/news/whats-next-for-oneplus-oxygenos-and-coloros-teams-become-one",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 4a 5G,": "https://www.techradar.com/reviews/google-pixel-4a-5g-review"
  }
}