{
  "source": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
  "title": "Peloton: everything you need to know about the workout streaming service",
  "category": "fitness",
  "updated": "2021-05-17T10:07:30Z",
  "author": "cat-ellis",
  "summary": "Prices, equipment, free trials, mobile apps and more",
  "article": [
    "When you think of Peloton, you probably think of at-home spinning workouts – and there are certainly plenty of those – but there's also a lot more to the subscription exercise service.",
    "Here, we've aimed to answer all the questions you're likely to have about Peloton, from pricing and availability, through to exercise bikes, free trials and mobile apps.",
    "Updates: in May 2021, Peloton announced that it was recalling both its Tread and Tread+ treadmills for safety reasons. The treadmills are no longer available to buy, and anyone who owns one has been advised to stop using it immediately and contact the company for a refund or (in the case of the Tread) a repair.",
    "Right now, Peloton is available in the US, UK, Canada and Germany. There are plans to bring the workout service to other countries in the future, and you can register for updates to find out when it's expanding.",
    "Peloton Digital Membership is the cheaper option, costing $12.99 / £12.99 per month. It gives you access to the full range of classes and workouts on your phone, tablet or smart TV through the Peloton app.",
    "Peloton All-Access Membership costs $ / £39 per month, and gives everyone in your household access to the full range of workouts and classes through any supported device. This is the membership you'll need if you decide to buy a Peloton bike.",
    "Yes, you can try Peloton Digital free for 30 days. You'll need to enter your payment details, but you won't be charged until the trial period is up, and you can cancel any time.",
    "No, it's not essential. A Peloton Digital subscription gives you access to thousands of workouts that you can follow with just an exercise mat, hand weights, or no equipment at all.",
    "You can follow the exercise bike and treadmill workouts with a non-Peloton branded treadmill provided you can see a tablet or TV screen (Peloton's own treadmills are no longer available to buy having been recalled). There are also outdoor running programs that you can follow with the Peloton app for your Apple Watch.",
    "Investing in Peloton's own hardware means there's an HD touchscreen right in front of you, plus a sound system, camera and microphone. The Peloton Bike Plus can also adjust the resistance automatically during workouts.",
    "There are two indoor cycles: the Peloton Bike and the Peloton Bike Plus. Both are high quality static exercise bikes with built-in HD screens and speakers so you can follow instructor-led workouts. They're also equipped with cameras and microphones so you can chat with friends while riding.",
    "Both can be bought alone, or as part of a set with accessories like hand weights, floor mats, and chest-strap heart rate monitors.",
    "We've put together a guide detailing all the differences between the two, but the key things to note are:",
    "In May 2021, Peloton issued recalls for both its treadmills following a fatal accident involving a child, as well as several other accidents leading to injuries. If you own either the Peloton Tread or Tread+, you are advised to stop using it immediately and contact the company.",
    "If you own the Peloton Tread+ (the more advanced model, which was only ever available in the US) you can request a full refund.",
    "If you own the Tread (which was affected by a less serious safety issue involving the screen), you can either return the treadmill for a refund, or request a repair from an engineer. Neither machine is now available to buy.",
    "The original Peloton Tread was launched in 2018 as a high-end running machine with a large screen and shock-absorbing slatted belt. In 2020 the company announced a new, more affordable treadmill, and the original machine was rebranded was the Peloton Tread+.",
    "The new Peloton Tread was launched in 2020, and was available to buy in the US, UK and Germany.",
    "The Peloton app is available for Android. iPhone, iPad, Apple TV, Apple Watch, Amazon Fire TV and Fire Tablet, and Roku.",
    "There's no shortage of home workout services available right now, but the one you're most likely to consider as an alternative is Apple Fitness Plus. To help you pick the right one for you, we've put together a full guide to Apple Fitness Plus vs Peloton. covering all the key differences between the two.",
    "If cash is tight, Nike Training Club, is now free, and offers home workouts covering strength, cardio and flexibility.",
    "If you have a Fitbit device, a subscription to Fitbit Coach will give you a wide range of personalized workouts that will fit neatly with your training goals.",
    "Aaptiv is a particularly good option if you like the idea of audio-led workouts, and new classes are added every week."
  ],
  "headers": {
    "3": "Where is Peloton available?",
    "4": "How much does Peloton cost?",
    "6": "Can I get a free trial of Peloton?",
    "7": "Do I need a bike or treadmill to use Peloton?",
    "10": "What are Peloton's bikes like?",
    "13": "What about Peloton's treadmills?",
    "18": "What platforms is the Peloton app available on?",
    "19": "What are the alternatives?"
  },
  "links": {
    "Peloton announced that it was recalling both its Tread and Tread+ treadmills": "https://www.techradar.com/news/peloton-recalls-all-treadmills-in-the-us-what-you-should-do",
    "register for updates": "https://global.onepeloton.com/#:~:text=Peloton%20is%20going%20global.,%2C%20Canada%2C%20UK%20and%20Germany.",
    "£12.99": "https://www.onepeloton.co.uk/membership",
    "£39": "https://www.onepeloton.co.uk/membership",
    "try Peloton Digital free for 30 days": "https://www.onepeloton.com/app",
    "having been recalled": "https://www.techradar.com/news/peloton-recalls-all-treadmills-in-the-us-what-you-should-do",
    "Apple Watch": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1032678705069237400&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fapple-store%2Fid792750948%23%3Fplatform%3DappleWatch",
    "a guide detailing all the differences between the two": "https://www.techradar.com/news/peloton-bike-vs-peloton-bike-plus",
    "Peloton issued recalls for both its treadmills": "https://www.techradar.com/news/peloton-recalls-all-treadmills-in-the-us-what-you-should-do",
    "Android": "https://play.google.com/store/apps/details?id=com.onepeloton.callisto&hl=en_GB&gl=US",
    "iPhone": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1379636706686371600&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fapple-store%2Fid792750948",
    "iPad": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2734731491920024600&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fapple-store%2Fid792750948%23%3Fplatform%3Dipad",
    "Apple TV": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1155326931308529000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fapple-store%2Fid792750948%23%3Fplatform%3DappleTV",
    "Amazon Fire TV": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB07FTXNXCF%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6603440221692391000-20",
    "Fire Tablet": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB07FTXNXCF%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6136486489746707000-20",
    "Roku": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1056722064219754100/https://channelstore.roku.com/details/1343dddb228c4a302c2639f49c78cc90/peloton-at-home-fitness",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Apple Fitness Plus vs Peloton": "https://www.techradar.com/news/apple-fitness-plus-vs-peloton",
    "Nike Training Club": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1219453773833764400/https://www.nike.com/gb/ntc-app",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Fitbit Coach": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8251184241066729000/https://coach.fitbit.com/welcome/register?redirect_url=%2F",
    "Aaptiv": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1038603068132430700&xs=1&url=https%3A%2F%2Faaptiv.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fpeloton-everything-you-need-to-know-about-the-workout-streaming-service"
  }
}