{
  "source": "https://www.techradar.com/news/polestar-1-review",
  "title": "Polestar 1 review: Swedish smarts with American muscle looks",
  "category": "car-tech",
  "updated": "2021-08-08T08:30:34Z",
  "author": "john-mccann",
  "summary": "A cool collector's piece that's difficult to justify beyond that",
  "article": [
    "The Polestar 1 is a rare car. It's the only plug-in hybrid model the Swedish firm will ever produce, with its Polestar 2 and future vehicles set to be fully electric, making it somewhat of a collector's piece.",
    "And it's a very expensive collector's piece – a car that's almost a concept in its nature, delivering striking design, a huge amount of power and the title of the plug-in hybrid vehicle (PHEV) with the longest electric range.",
    "While most PHEVs offer between 20 and 40 miles of electric range (where the car uses just its battery and electric motor, with the combustion engine off), the Polestar 1 can go for more than 70 miles on a single charge.",
    "That's quite a difference, especially for those who primarily travel short distances. As such, there are some serious fuel savings to be had; but let's not forget about that asking price.",
    "As an offshoot of Volvo, the Polestar 1's design inspiration is clear, from the light blocks to the infotainment system.",
    "The gold accents on the brake calipers, valve caps and seat belts provide a wonderful contrast to the muted range of body colors (white, grey, blue and black), while the vehicle's low, aggressive stance gives it an essence of an American muscle car.",
    "The infotainment system itself is perfectly serviceable, if not a little on the basic side. However, there is support for wired Apple CarPlay and Android Auto, plus the HUD (heads-up display) is a nice additional feature beaming information driving data into your eye line.",
    "Inside the Polestar 1 is a comfortable place to be, but the low seating position may prove tricky for some to get in and out of. As for the rear seats, they're simply not fit for purpose, while the trunk is shockingly small.",
    "If you're after a striking, and rare, sports car that also does its bit for the environment, the Polestar 1 fits the bill. However, its high list price means that there are plenty of alternatives available to tempt those who can afford it.",
    "The Polestar 1 price is $155,000 / £139,000, which makes it super-expensive. Not only that, but it may also prove potentially tricky to get hold of since the car is now in its final production run.",
    "Once its build slots are filled, that will be it for the Polestar 1. Add to that the fact it's only available in North America, Europe and China, and the Polestar 1 becomes even more of a rare breed.",
    "None of its production runs have been huge in terms of numbers either, so it’s also difficult to find one for sale second hand.",
    "If you're after a more easily available (and slightly more affordable) vehicle from the brand, check out the fully electric Polestar 2. This four-door sedan may not be quite as sporty, but it still turns heads.",
    "The Polestar 1 has an eye-catching design. Its low, powerful stance with wide rear haunches and sizable 21-inch wheels makes for a striking, muscle car-esque look.",
    "You don't immediately realize that it's a plug-in hybrid capable of driving in a fully EV mode.",
    "There's a large door on either side, with the handles sitting flush to the bodywork for a sleek, streamlined look – they pop out for use when you unlock the car.",
    "While the paint options for the Polestar 1 are generally quite muted (it's available in white, grey, blue or black), there's a hint of interest from the gold accents on the brake calipers, valve caps and seat belts.",
    "This injection of color draws more attention to the car and is a pleasing contrast to the rest of the exterior and interior.",
    "There are hints of Volvo (Polestar's parent company) in the car's design, too, from the headlights and tail lights to the interior dashboard, main display and air vents.",
    "Unlock the car in the evening or at night, and you'll spot the Polestar logo projection on the panoramic glass roof. It's a subtle touch, but one we enjoyed seeing.",
    "Open the door and you'll find the low driving position makes it a little awkward to get in and out of the car. Once you've maneuvered your way into the driving seat, however, the cabin feels airy, with plenty of leg and headroom for the driver and front-seat passenger.",
    "The sports-style seats curve round to hug you, but are comfortable, even on long journeys. There are decent-sized door pockets, plus two central cup holders and a small netted area in the passenger-side footwell that can be used to hold a phone or other small items.",
    "A shallow storage area can be found under the central armrest, which has room to hold a phone, but not much else.",
    "Another style point worthy of mention is the crystal-effect drive selector, complete with Polestar logo. It gives the cabin a point of interest and provides a premium detail. It sits above another little oddity, which is the twist-to-start ignition switch.",
    "Most cars offer up a button here, but Polestar (and Volvo) use this every-day action as a point of differentiation. It’s a little strange at first, but you’ll quickly get used to it.",
    "Note that the Polestar 1 is only available as a left-hand drive, which is fine for the majority of the markets in which it’s available; but in the UK, it means you’ll be sitting on the opposite side of the car when driving. No right-hand drive option highlights the limited production of the Polestar 1.",
    "Technically, the Polestar 1 is a four-seater, but the reality is that the rear seats here are really just for show. First up, while the front seats slide and fold forward, they don’t leave much space to get into the back.",
    "Once you're in there, you’ll find leg room is almost non-existent – and all but the shortest of passengers will also find headroom severely compromised since the roofline slopes down dramatically.",
    "As such, these rear seats may just about work for young children – there are ISO fix points here – but you'll likely struggle to fit many car seats into the space, too.",
    "On the plus side, the rear seats do provide useful additional storage for bags and coats, which is just as well because the Polestar 1's trunk is also tiny.",
    "Flip open the trunk and you'll be greeted with a space that can fit in two carry-on flight cases and… well, that's about it. There's no frunk (front trunk) here either, since the Polestar 1 has a full-sized internal combustion engine under the hood.",
    "For those who like a view of the inner workings of a car, the trunk features a small window into the plug-in hybrid setup of the car, with a perspex screen showing some important cabling inside the car, complete with labels.",
    "If you were a fan of the Apple iMac G3 or transparent GameBoy Pocket and N64, then this glimpse may well give you a warm fuzzy feeling inside. For those of you with large suitcases, that feeling may be more rage.",
    "The Polestar 1 comes with the performance to back up it's muscle-car looks, although it isn't quite as rapid as the Tesla Model S or Porsche Taycan 4S – both of which are comfortably cheaper and fully electric.",
    "That said, the Polestar 1 can still go from 0-62mph (0-100km/h) in 4.8 seconds and hit a (limited) top speed of 155mph (250km/h), with a total power output of 619hp from the 2.0-liter, four-cylinder turbo- and supercharged engine and accompanying electric motor.",
    "If you want to get close to the 0-62mph time, you'll need to shift from the default 'Hybrid' drive mode to 'Power', which stiffens the suspension and increases throttle response.",
    "The Polestar 1 has a low center of gravity, thanks to its sporty design and batteries that sit in the floor of the car. This means it's very well-grounded, and can whip round corners nicely.",
    "Put your foot down, and you can feel the power of the car propelling you up the road, allowing you to overtake with ease. Get above 62mph (100km/h) and a small spoiler will raise itself from the rear of the Polestar 1, remaining up until your speed dips below 44mph (70km/h).",
    "You also have the option to force the rear wing up and down via buttons on the driver's side door.",
    "The inclusion of a 34kWh battery and electric motor in the Polestar 1 provide the option to drive in a full electric mode – which is dubbed 'Pure' in the drive mode menu.",
    "What's special about this plug-in hybrid is that it offers the longest electric driving range of any PHEV, with Polestar claiming it can do up to 77 miles WLTP on a single charge.",
    "In North America you'll see this range quoted as 52 miles EPA, as a different system is used to measure electric car range.",
    "During our time with the car, we found that we could easily cover over 70 miles in 'Pure' mode. Most PHEVs tend to average 20-40 miles in EV mode.",
    "This range means you'll be able to drive around town with ease, in the knowledge that you're unlikely to even touch the combustion engine at all.",
    "And since the Polestar 1 has a smaller battery than a fully electric car, it charges more quickly: a full charge is attainable in under four hours using a 22kWh home charger.",
    "The Polestar 1 lifts most of its in-car tech from parent company Volvo, so those familiar with the Swedish firm's way of doing things will feel at home in this regard.",
    "You get a centralized, portrait-oriented touch display in the middle of the dash, with a row of physical buttons below it, offering quick control for volume, heated windows and hazard lights.",
    "Everything else – including climate – is controlled via the 9-inch touchscreen. The operating system is easy to learn and use, thanks to its simple layout. The tiled home screen provides access to core features such as the radio and navigation, while a swipe from right to left will bring up further options.",
    "We found the sat nav worked well, although it wasn't quite as detailed or feature-rich as Google Maps navigation on your phone.",
    "Navigation directions are mirrored on the digital cluster display behind the steering wheel, and also in the HUD (heads-up display), which projects key information onto the windscreen and into your eye line.",
    "Bluetooth connectivity allows you to stream audio from your handset through the Polestar 1's pleasingly powerful Bowers & Wilkins sound system, providing the ability to safely make and receive calls while on the move.",
    "You also get wired support for Apple CarPlay and Android Auto, allowing you to plug your phone into the car and mirror key apps on the main display.",
    "This means you can use the likes of Apple Maps and Google Maps for navigation, and access Messages and music applications, too.",
    "We used our OnePlus 9 to test the Android Auto integration, and while it worked, the system seemed to struggle with slow load times and occasional input issues where it wouldn’t recognize our taps.",
    "Another slight oddity is when using these smartphone integration features in the portrait orientation of the screen, since the systems operate in landscape.",
    "That means only a portion of the display is used; if the screen was landscape, CarPlay and Auto could utilize all of it.",
    "Shifting focus to the second display, which acts as the instrument cluster in the Polestar 1, we found that while it was clear and easy to read, the customization options were minimal, which reduces the information you can choose to have displayed.",
    "It isn't a big issue, but we’ve seen other manufacturers offer a wide variety of options here – and, considering the Polestar 1's price, it feels a little like a missed opportunity.",
    "You do get a suite of driver aids that work well and make journeys less taxing. There are blind-spot indicators on the wing mirrors, automatic lights, lane assist and adaptive cruise control with pilot assist.",
    "The latter pretty much drives the car for you when you're on a highway. You need to keep a hand on the wheel at all times, but the Polestar 1 can accelerate, decelerate and keep you in lane on its own, which makes long-distance driving far more manageable.",
    "Visibility from the driver's seat in the Polestar 1 isn't the best for parking, as a result of the low seating position and bulbous body of the car.",
    "However, help is at hand with 360-degree cameras and parking sensors, which makes it easy to safely slide into spots.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "Two minute review",
    "9": "Polestar 1 price and availability",
    "13": "Polestar 1 design",
    "33": "Polestar 1 drive, range and charging",
    "45": "Polestar 1 specs and tech",
    "62": "Don't buy it if…"
  },
  "links": {
    "Polestar 2": "https://www.techradar.com/news/polestar-2-review",
    "Porsche Taycan 4S": "https://www.techradar.com/news/porsche-taycan-4s-review"
  }
}