{
  "source": "https://www.techradar.com/news/how-to-watch-2021-tour-de-france-stage-19-and-20-free-live-stream-from-anywhere",
  "title": "How to watch 2021 Tour de France Stage 19 & 20 free: live stream from anywhere",
  "category": "computing",
  "updated": "2021-07-16T16:06:28Z",
  "author": "mo-harber-lamond",
  "summary": "Pogacar holds a 5-minute lead – is the winner decided already?",
  "article": [
    "After the savage Pyrenean ascents preceding them, Stages 19 and 20 look like a positively relaxing way to round off the Tour. However, will Saturday's time trial provide us with similar upsets to last year, when Pogacar snatched the yellow jersey on the final day? Only time will tell, and all you need to do is sit back and watch a Tour de France live stream of Stages 19 and 20 – which you can do from anywhere and, in some cases, for free, thanks to our guide.",
    "The final mass-start stage of the Tour, Stage 19 opened with excitement, and Brit Mark Cavendish had his eyes on a record 35th stage win. However, those hopes were dashed early on through opening crashes, and a 20-odd breakaway developed. Matej Mohoric then went solo and took a win of over 4 minutes ahead of the pack, and 21 ahead of the peloton.",
    "Stage 20 is the decider, and the time trial takes place over a 30.8km route from Libourne to Saint-Emilion. We'll breeze past famous Bordeaux wineries, and the beautiful course is flat and will see riders maintaining maximum speed for much of its duration. Expect to see out-and-out sprinters dominate here – although anyone in good shape after three gruelling weeks will fancy their chances.",
    "These are the last competitive stages of the 2021 Tour de France, so prepare for hours of glorious cycling this weekend – our guide to watch Stages 19 and 20 will explain how.",
    "Stages 19 and 20 are looking like unmissable days of cycling. Thankfully, European TV networks around the continent offer free ways to watch:",
    "UK - ITV4 and ITV Hub streaming service / S4C and S4C on BBC iPlayer",
    "France - France TV Sport",
    "Belgium - RTBF",
    "Italy - Rai Sport",
    "Australia - SBS",
    "If you're desperate to watch the Tour de France but you're away from home and the coverage is geo-blocked, then you could always use a VPN to access it (assuming you're not breaching any broadcaster T&Cs, of course). You may be surprised how simple it is to do.",
    "Use a VPN to get a Tour de France live stream from anywhere",
    "Using a VPN is as easy as one-two-three...",
    "1. Download and install a VPN - as we say, our top choice is ExpressVPN",
    "2. Connect to the appropriate server location - open the VPN app, hit 'choose location' and select the appropriate location",
    "3. Go to the broadcaster's live stream - so if you're from the UK, just head to ITV Hub and watch the cycling as if you were back at home!"
  ],
  "headers": {
    "4": "Who has a free Tour de France live stream in 2021?",
    "10": "How to watch Tour de France 2021 from outside your country",
    "16": "How to watch 2021 Tour de France: live stream cycling in New Zealand"
  },
  "links": {
    "ITV Hub streaming service": "https://www.itv.com/",
    "S4C on BBC iPlayer": "https://www.bbc.co.uk/tv/s4c",
    "France TV Sport": "https://www.france.tv/sport/",
    "RTBF": "https://www.rtbf.be/",
    "Rai Sport": "https://www.raiplay.it/",
    "SBS": "https://www.sbs.com.au/ondemand/channels/sbs-viceland",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "head to ITV Hub": "https://www.itv.com"
  }
}