{
  "source": "https://www.techradar.com/news/marvels-next-mobile-game-is-an-open-world-rpg-with-50-player-matches",
  "title": "Marvel’s next mobile game is an open-world RPG with 50-player matches",
  "category": "phones",
  "updated": "2021-06-29T16:17:56Z",
  "author": "david-lumb",
  "summary": "Marvel Future Revolution, developed by Netmarble, is the next big superhero mobile game",
  "article": [
    "The next big Marvel mobile game is new territory for the superhero brand – and smartphone gaming in general. Marvel Future Revolution is an open-world action RPG with modes supporting 50-player simultaneous combat, expanding the size and scale of on-the-go gaming with some of the most well-known properties out there.",
    "Mobile gaming megastudio Netmarble Games is following up its six-year-old previous hit, Marvel: Future Fight, with the upcoming Marvel Future Revolution. While the new game doesn’t have a release date yet, pre-registration is open now, with a global launch planned on iOS and Android.",
    "How will the new game differ from the old? It’s all about scale: players will be able to load in and roam around five new worlds with other players controlling a lineup of Marvel’s top heroes. From there, they’ll be able to dive into various multiplayer modes fighting computer-controlled enemies, teams of other heroes, and dive into a 50-player free-for-all.",
    "And all set in the Marvel Universe, loaded with nearly a century of superhero comic continuity to base on. TechRadar got an early look at Marvel Future Revolution, and while there’s a lot we still don’t know about how the game plays and progresses, what we’ve seen in teaser footage is plenty exciting. With good graphics and persistent open world action, Future Revolution could be one of the first big open-world mobile RPG games – and certainly the first to star superheroes.",
    "Marvel Future Revolution’s big advancement is its open world design. Players will be able to roam large areas alongside many other players, fight enemies, follow the game’s story, and play side missions, all without the action stopping in the main area.",
    "In addition to story content in the overworld, players can take their heroes in four-player player-versus-environment (PvE) matches called Blitz/Raids against big villains like Thanos, Ultron, Loki, and Kingpin. Other modes pit players against players (PvP), like Omega War with teams of five-versus-five matches – or the Dark Zone, a real-time massive free-for-all with players trying to take down colossal bosses (and each other).",
    "With writing by Marvel writer Marc Sumerak, who wrote for Marvel Future Fight and the Nintendo Switch game Marvel: Ultimate Alliance 3, Marvel Future Revolution’s plot premise seems like it may live up to the comics it’s based on: a catastrophe causes earths from different realities to clash, and thanks to a hero’s sacrifice, the worlds collapse into one prime earth.",
    "Developers have announced eight playable heroes so far, including Spider-Man, Captain Marvel, Black Widow, Doctor Strange, and Storm, but given its predecessor Future Fight has a roster of over 200 characters, more could be coming when Future Revolution launches.",
    "From that come the inventive areas playable in Future Revolution: the gleaming New Stark City, the Hydra Empire overrunning America, the desert gladiator lands of Sakaar, the Asgardian-settled Midgardia, and Xandearth resettled by the Nova Corps after Thanos devastated the original Xandar.",
    "Fans of the MCU films will remember the latter plot point from Avengers: Infinity War, and there’s a lot that’s been inherited from the movies. Players will be able to control heroes from the MCU (as well as kit them in costumes from the films).",
    "Given the premise of multiple realities, of course, there are plenty of costume parts from other settings players will be able to choose, including decades of comics continuity, TV shows, and the new settings in Future Revolution itself. Per the game’s developers, players will have 400 million combinations of different costume parts from which to assemble their favorite outfits.",
    "Marvel has a long, long history. While Future Revolution’s heroes, plot points, and costume parts will pay homage to well-known comics plotlines and touch on aspects from the MCU films for fans of all interest levels – including folks whose first experience with the heroes is with the game itself.",
    "“Stan Lee once said that every Marvel comic could be someone’s first comic, so we want to be very accessible,” said Bill Rosemann, VP and Head of Creative for Marvel Games. “We want to create a world and characters that may be familiar to you if you watch Marvel movies, but then again, if you’re a really long-time reader, we want to reward you as well.”",
    "We don’t have many details about what those rewards will be – Marvel and Netmarble are tight-lipped about plot details and which other heroes will round out the roster when the game launches. Both have promised more content will be released at regular intervals to keep players engaged, but likewise didn’t hint at what’s in store.",
    "“This project is a result of fanboys living their dreams and trying to be a half-step ahead of everyone else,” said Joe Lee, Executive Producer of Netmarble.",
    "The expectations are high, but so is the potential for a game that stretches what mobile gaming can do.",
    "“So we hope that both casual gamers and also hardcore gamers. That’s what we are aiming for,” said Simon Sim, President of Netmarble US (who is a huge Iron Man fan, by the way). “We put a lot of efforts to meet fans’ expectations.”"
  ],
  "headers": {
    "4": "Open-world superheroes",
    "11": "Future Revolution for old fans and new"
  },
  "links": {}
}