{
  "source": "https://www.techradar.com/news/zoom-is-finally-adding-this-essential-feature-on-windows-and-macos",
  "title": "Zoom is finally adding this essential feature on Windows and macOS",
  "category": "computing",
  "updated": "2021-11-30T01:00:28Z",
  "author": "anthony-spadafora",
  "summary": "A new automatic update feature is now rolling out to Zoom for Windows and macOS",
  "article": [
    "The days of having to update your video conferencing software before joining a call are over as Zoom has announced that its bringing automatic updates to its Windows and macOS clients.",
    "Not only do updates provide new features and functionality but they are also used to patch software bugs and other vulnerabilities that can be exploited by hackers to launch cyberattacks and infect your devices with malware.",
    "Just like with other software companies, Zoom routinely releases updates for its desktop clients and mobile apps. However, not all of these updates are installed by end users which can put their devices and data at risk.",
    "For this reason, Zoom is now rolling out a new automatic update feature for its Windows and macOS clients to ensure that everyone is running the latest version of its software before starting a call.",
    "According to a new blog post from Zoom, in order to turn on automatic updates in its Windows or macOS clients, you'll first need to open the software's Settings menu, head to the General tab and select the “Automatically keep my Zoom up to date\" option.",
    "From here, you'll be prompted to enter admin credentials to allow the company's automatic update feature permission to run but this will only be required when enabling this setting for the first time.",
    "Going forward, when a new version of Zoom is available and you're not already in a video call, you will be prompted to install the update. If you ignore this prompt, don't worry as the update will be installed automatically the next time you restart your Zoom client.",
    "If you're not keen on receiving frequent updates, the “Slow” option is selected by default which focuses on maximum stability instead of giving you access to the latest features. Power users though can enable the “Fast” option which will let you download and install the latest features and updates as soon as they become available. It's also worth noting that critical security updates are pushed out by Zoom to everyone regardless of which option they've selected.",
    "While some end users will need to enable automatic updates by themselves, if you're part of an organization that uses Zoom while working from home, your IT admin will need to enable this feature for you.",
    "We've also rounded up the best video conferencing software and best online collaboration tools"
  ],
  "headers": {
    "4": "Enabling automatic updates"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "blog post": "https://blog.zoom.us/get-automatic-updates-in-the-zoom-client/",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "best video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}