{
  "source": "https://www.techradar.com/news/salesforce-is-launching-its-own-streaming-service",
  "title": "Salesforce is launching its own streaming service",
  "category": "computing",
  "updated": "2021-08-11T02:52:51Z",
  "author": "anthony-spadafora",
  "summary": "First ESPN+, then Disney+ and now Salesforce+",
  "article": [
    "Salesforce is moving beyond CRM software as the company has announced that it will launch its own streaming service which will feature live and on demand content for every role, industry and line of business, all in one place.",
    "The new streaming service, called Salesforce+, will arrive just in time for the company's annual four-day Dreamforce conference that will be held in-person at the Moscone Center in San Francisco in September though it will also be shown online as a virtual event.",
    "Just like with other streaming services, Salesforce+ will be packed with content including live experiences, original series, podcasts and other programming.",
    "President and CMO of Salesforce, Sarah Franklin explained in a press release how the company's experiences during the pandemic led to the creation of its new streaming service, saying:",
    "\"Over the last 18 months, we've had to reimagine how to succeed in the new digital-first world. We reimagined our events, shifting them to all-digital brand experiences and introduced new, relevant, original content. We're not going back, we're creating the future now. Just as brands like Disney, Netflix and Peloton have done with streaming services for consumers, Salesforce+ is providing an always-on, business media platform that builds trusted relationships with customers and a sense of belonging for the business community.\"",
    "Ahead of the launch of its new streaming service, Salesforce Studios has been busy putting together a team of writers, editors, directors and producers to bring new original programming to Salesforce+.",
    "So far the current Salesforce+ lineup includes a weekly program detailing how business leaders dealt with the pandemic called “Leading Through Change”, a series that showcases some of the world's most innovative marketers from IBM, Levi's and other companies called “Connections”, a program about CEOs and their backstories called “The Inflection Point”, a career advice series called “Boss Talks” and a short-form video series titled “Simply Put”.",
    "However, in the coming months, Salesforce+ will debut even more original content featuring leaders in fields such as sales and services as well as a new series on how Trailblazers are re-skilling to find new career opportunities.",
    "We'll likely hear more about Salesforce's new streaming service ahead of Dreamforce 2021 which is scheduled to take place from September 21-23."
  ],
  "headers": {
    "5": "Salesforce+"
  },
  "links": {
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Dreamforce": "https://www.techradar.com/news/salesforce-ceo-get-ready-for-the-all-digital-working-world",
    "virtual event": "https://www.techradar.com/best/best-virtual-event-platforms",
    "podcasts": "https://www.techradar.com/news/best-podcasts",
    "press release": "https://investor.salesforce.com/press-releases/press-release-details/2021/Announcing-Salesforce-a-New-Streaming-Service-for-Live-Experiences-and-Original-Content-Series/default.aspx"
  }
}