{
  "source": "https://www.techradar.com/news/jp-morgan-is-now-using-alipay-to-process-credit-card-payments",
  "title": "JP Morgan is now using Alipay to process credit card payments",
  "category": "computing",
  "updated": "2021-09-16T21:00:34Z",
  "author": "anthony-spadafora",
  "summary": "Using your US credit card on Alibaba's online store just got a whole lot easier",
  "article": [
    "Purchasing items on Alibaba's online store is about to get a whole lot easier for consumers in the US as JP Morgan has announced that it is now processing credit card payments for the Chinese ecommerce giant using Alipay.",
    "The US bank's announcement that it is working together with Alipay to process payments on Alibaba.com comes just one month before Alibaba's annual Singles Day Sale on November 11 which brought in $74.1bn last year, up from 38.4bn back in 2019.",
    "Global head of wholesale payments at JP Morgan, Takis Georgakopoulos praised the new partnership between the two companies in a press release, saying:",
    "“J.P. Morgan is proud to be the only global bank that can manage the payments lifecycle for marketplaces – from when a customer makes a purchase, to accepting and storing that value, to ensuring that the funds reach the seller’s bank accounts. We are thrilled to begin processing payments for Alibaba.com as they continue to expand in the U.S., providing ease of doing business across buyers and sellers.”",
    "According to Statista, online sales hit more than $4.2tn in 2020 with the rise of marketplaces, which accounted for almost half of all online purchases last year, being one of the biggest trends in ecommerce.",
    "As ecommerce has grown though, both small and micro businesses need a fast, easy and safe way to seamlessly accept payments from their global customers across different payment methods and channels.",
    "With support for JP Morgan's payment processing capabilities, Alipay can now provide improved card payment services in the US for Alibaba's free payment and order protection service Trade Assurance.",
    "Global strategic partnerships and investments lead as well as SVP of the Ant Group, Douglas Feagin explained in a press release how the company's new partnership with JP Morgan will allow Alibaba's customers to use their preferred method of payment, saying:",
    "“We’re delighted to be partnering with J.P. Morgan on digital payments to help empower small and medium sized businesses in the U.S. to pivot to digital and go global. We are always looking for strategic relationships with international partners to not only help merchants to better connect with suppliers around the world, but also to enable all parties to use their preferred method of payment.”"
  ],
  "headers": {
    "4": "Seamlessly accept payments"
  },
  "links": {
    "JP Morgan": "https://www.techradar.com/news/jpmorgan-bitcoin-could-reach-heights-of-dollar146000-but-not-just-yet",
    "processing credit card payments": "https://www.techradar.com/best/best-credit-card-processing-service",
    "Alipay": "https://www.techradar.com/news/shopify-signs-alipay-partnership-to-allow-more-purchases-across-the-world",
    "Singles Day Sale": "https://www.techradar.com/news/singles-day-2020-is-already-the-biggest-shopping-event-in-history",
    "press release": "https://www.businesswire.com/news/home/20210916005216/en/J.P.-Morgan-Supports-Alipay-to-Provide-Card-Payment-Services-for-Alibaba.com-in-the-U.S.",
    "Statista": "https://www.statista.com/topics/871/online-shopping/",
    "online purchases": "https://www.techradar.com/news/social-media-and-impulse-purchases-fuelling-online-sales-survey-finds",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "accept payments": "https://www.techradar.com/best/best-payment-gateways",
    "Ant Group": "https://www.techradar.com/news/alibaba-hit-with-record-fine-by-chinese-authorities"
  }
}