{
  "source": "https://www.techradar.com/news/intel-could-have-a-new-tactic-to-undermine-amd-slashing-prices-on-comet-lake-cpus",
  "title": "Intel could have a new tactic to undermine AMD – slashing prices on Comet Lake CPUs",
  "category": "computing",
  "updated": "2021-02-11T10:18:27Z",
  "author": "darren-allan",
  "summary": "Core i7-10700F looks a massive bargain now at Amazon, for starters",
  "article": [
    "Intel would appear to be on a drive to cut the prices of its 10th-gen processors, at least looking at the way some of these Comet Lake CPUs are dropping at some retailers currently.",
    "Tom’s Hardware flagged this up, observing that some of Intel’s most popular models are dropping like a stone. A good example is the Intel Core i7-10700F (‘F’ means it doesn’t have an integrated GPU, which won’t bother most gamers who have a separate discrete graphics card), which is now down to $229 on Amazon in the US. At the end of January, less than a couple weeks ago, it was $315.",
    "That chip began life pitched at $349, so at $229, it’s actually a third cheaper than at launch – and incredibly impressive value for a fast 8-core chip with great gaming chops. Compare that to AMD’s current 8-core offering, the Ryzen 5800X, which retails at $449 (if you can find it – and where it is on sale, pricing is generally inflated by a good margin).",
    "Looking at AMD’s 5600X as an alternative, this chip does pip the 10700F for gaming, even if it is two-cores short of the Intel CPU – though it’s admittedly pretty much a dead heat in many games – but the 5600X costs $300 (again, if you can find it for that price). So now the 10700F is almost 25% cheaper while delivering pretty much the same performance in games (and better performance for the apps where those 8-cores fully kick in).",
    "Even looking at the Ryzen 3700X, the last-gen 8-core stalwart from AMD, that’s selling for around $330 currently – a hundred bucks more than the Core i7-10700F’s new price on Amazon (and the Intel CPU outperforms the 3700X slightly).",
    "Similarly, the Core i5-10400F was down to $142 at Staples, but is now sold out (perhaps unsurprisingly – this chip launched at $160 and has been popular for budget builds, again delivering impressive gaming performance for the money, even at that launch price).",
    "Intel’s top-tier Core i9-10900KF was also knocked down to $450 by Amazon, according to the report, but again has sold out already.",
    "As mentioned, AMD’s Ryzen 5000 chips are still suffering from some supply issues, so perhaps this is Intel’s way of attacking the competition before next-gen Rocket Lake processors come onto the scene (theoretically in March, but we don’t know that for sure – it could be later).",
    "There’s evidence of similar discounts in the UK, too, if we look at the Intel Core i7-10700F. While the CPU still runs close to £300 at some online retailers, Currys has it for £250, and Box for £242 (down from £330).",
    "As Tom’s observes, it’s not an unreasonable guess to make that Intel is throwing some of its weight behind retailers here, in order to facilitate some of these very tempting prices. And as mentioned, it certainly makes sense that this would be the obvious avenue to attack Ryzen 5000 (and 3000) CPUs before Rocket Lake hits, while AMD is struggling with its well-documented stock issues."
  ],
  "headers": {
    "7": "Pre-launch price cuts"
  },
  "links": {
    "Comet Lake CPUs": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/Intel-10th-generation-cpus-cheaper-than-amd",
    "$229 on Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FIntel-i7-10700F-Desktop-Processor-Graphics%2Fdp%2FB086MN2XYL%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4283671925580820500-20",
    "AMD’s Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "suffering from some supply issues": "https://www.techradar.com/news/amd-cpu-stock-rumor-is-bad-news-for-would-be-ryzen-5950x-and-5900x-buyers",
    "Rocket Lake processors": "https://www.techradar.com/news/intel-core-i9-11900k-leak-suggests-a-record-breaking-cpu-that-could-be-trouble-for-amd",
    "theoretically in March": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "Currys": "https://www.awin1.com/awclick.php?awinmid=1599&awinaffid=103504&clickref=trd-us-6891189992439714000&p=https%3A%2F%2Fbusiness.currys.co.uk%2Fcatalogue%2Fcomputing%2Fcomponents-upgrades%2Fprocessors%2Fintel-core-i7-10700f-2-9-ghz-processor%2FP267874P",
    "Box for £242": "https://track.webgains.com/click.html?wgcampaignid=138485&wgprogramid=13045&clickref=trd-us-3961509676140011500&wgtarget=https%3A%2F%2Fwww.box.co.uk%2FIntel-Core-i7-10700F-10th-Gen-Processor_2939884.html"
  }
}