{
  "source": "https://www.techradar.com/news/airpods-3-expected-to-land-later-this-year",
  "title": "AirPods 3 expected to land later this year",
  "category": "audio-visual",
  "updated": "2021-06-24T09:44:33Z",
  "author": "axel-metz",
  "summary": "The rumor mill spins again",
  "article": [
    "It’s been nearly two years since the release of Apple’s second-generation true wireless earbuds, the AirPods (2019), but we’ve just spotted the biggest clue yet to suggest its next iteration, the AirPods 3, will arrive in 2021.",
    "According to multiple reports, several Apple suppliers have begun shipping substrate components (aka circuit boards) for various upcoming Apple products, including the AirPods 3.",
    "We’ve previously reported on rumors hinting that the next-gen earbuds were already in development, but this is the most promising sign yet to indicate their imminent arrival.",
    "As for what the AirPods 3 will bring to the table, reports have pointed towards a design overhaul that could see Apple’s entry-level wireless earbuds mimic the look of its noise-cancelling offering, the AirPods Pro.",
    "Essentially, that means we expect to see shorter stems at the bottom of the AirPods – though perhaps not quite as short as those on the recently-announced Beats Studio Buds. Check out the below tweet to see what this rumored re-design might look like.",
    "That’s not to say Apple’s cheaper buds will arrive with noise-cancelling functionality, though, since the company is expected to continue to omit the feature in an effort to keep their price low and battery life high.",
    "We do, however, expect the third-gen earbuds to pack some degree of improved noise reduction, as well as better endurance. Tipsters have hinted at motion sensors for fitness tracking and integration with Apple Fitness Plus, too, which could see ambient light sensors added",
    "The rumors that AirPod-related circuit board shipments have begun align with previous reports we’ve seen suggesting the new models would arrive in the “third calendar quarter of 2021.” That’s according to an investor report spotted by established Apple analyst Ming-Chi Kuo, so there’s certainly reason to believe the AirPods 3 could arrive sometime between August and October this year.",
    "There’s no sign of new AirPods Pro components in these shipments, though.",
    "The same report does, however, suggest an updated pair of Apple’s pricier wireless earbuds will arrive in 2022, along with updated motion trackers and a focus on fitness – similar to the AirPods 3, then, if rumors are to be believed.",
    "And what of the new AirPods’ price? Given that Apple’s Pro earbuds retail for $249 / £249 / AU$399, we expect the AirPods 3 to arrive with a similar price tag to their current-gen counterpart, the AirPods (2019), which cost $159 / £159 / AU$249 at launch.",
    "There’s every chance that figure could increase, though – especially if Apple decides to add those new features we’ve mentioned above.",
    "In any case, stay tuned for TechRadar for all the latest AirPods 3 news."
  ],
  "headers": {
    "8": "No Pro"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "AirPods (2019)": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "multiple": "https://wccftech.com/airpods-3-launch-later-this-year-apple-suppliers-kick-off-shipments/",
    "previously reported": "https://www.techradar.com/news/apple-airpods-3-release-date-leak-says-itll-be-here-in-2021-heres-what-will-change",
    "reports": "https://www.bloomberg.com/news/articles/2021-05-28/apple-plans-redesigned-airpods-for-2021-new-airpods-pro-in-2022?sref=10lNAhZ9",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Beats Studio Buds": "https://www.techradar.com/reviews/beats-studio-buds-review",
    "tweet": "https://twitter.com/LeaksApplePro/status/1369642089387024386",
    "Tipsters": "https://www.bloomberg.com/news/articles/2021-05-28/apple-plans-redesigned-airpods-for-2021-new-airpods-pro-in-2022?sref=10lNAhZ9",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "ambient light sensors": "https://www.techradar.com/news/future-airpods-could-feature-light-sensors-for-better-health-monitoring",
    "Ming-Chi Kuo": "https://appleinsider.com/articles/21/03/15/airpods-3-not-coming-until-the-fall-says-ming-chi-kuo"
  }
}