{
  "source": "https://www.techradar.com/news/new-macbook-pro-could-have-an-iphone-style-notch-unlikely-rumor-claims",
  "title": "New MacBook Pro could have an iPhone-style notch, unlikely rumor claims",
  "category": "computing",
  "updated": "2021-10-16T12:56:09Z",
  "author": "darren-allan",
  "summary": "Super-slim bezels for the revamped models, accompanied by a notch?",
  "article": [
    "With Apple’s new MacBook Pro 14-inch and 16-inch models expected to launch at the start of next week, rumors around the purported laptops are reaching fever pitch, and quite literally with the latest one, which seems like the product of a fevered imagination in all likelihood, claiming that – among other things – Apple is set to introduce a notch, iPhone-style, to the notebooks.",
    "We’ll discuss the believability of this in more depth shortly – because there’s more to this than meets the eye at first glance – but upfront we should note that the sources here are shaky, and we should consider this speculation with even more trepidation than normal.",
    "This is one MacRumors flagged up, and it originally comes from an unknown Weibo user in China, as highlighted by DuanRui on Twitter (who reposts leaks from Chinese social media platforms).",
    "Even DuanRui admits that this is best looked on as something of a ‘joke’, but the very tentative theory is that the new MacBook Pros could get some extremely slender bezels indeed – the original source mentions ‘thinner bezels’ among a list of other rumored changes for the laptops – with the notch needing to be present to provide a space for the webcam.",
    "As MacRumors observes, this is backed up by a poster on Reddit – a leaker who has no track record, mind, and confesses that they’re just pulling together various second-hand (or even third-hand) nuggets of info from the supply chain over in Asia – claiming that the notch is indeed coming for the new MacBook Pros. The further claim is that this notch will be a standard size, not the smaller one as seen in the iPhone 13 range, but it won’t play host to Face ID tech – rather, it’ll just have an improved 1080p webcam (as previously rumored), mic and True Tone sensor.",
    "The Redditor also throws in a ‘bonus leak’ that the next MacBook Air, which is expected to debut next year, will also come with this notch (and previous speculation about multiple new colors for the Air is true, the leaker adds).",
    "The Weibo leak also contends that the Touch Bar will be ditched (another rumor which was floated in the past), MagSafe will be present, and that the laptop chassis will be thicker and squared-off, with the new MacBook Pros being heavier.",
    "As we’ve said, this is clearly one to take with a sackful of salt. For starters, on that last point, why would Apple introduce a new MacBook Pro 14-inch, and bring in the new M1X Apple chip with the revamped 16-inch model, with these supposedly super-slim bezels, while making these portables thicker in the body, and heavier? That seems contradictory in terms of design aims, and you’d hope that the use of Apple silicon in the 16-inch model would help trim things down with the chassis of the larger offering, if anything.",
    "As well as the rather iffy sources of the notch rumor, the controversy there would doubtless be around this design change also makes its introduction seem unlikely (to say the least) that this is the road Apple is looking down for the new Pro laptops.",
    "However, if we indulge this theory, how would the notch work? Wouldn’t it get in the way of the top menu bars on the screen? On this score, a potential explanation, as the Reddit leaker discusses, comes thanks to a previous MacRumors story on the possible resolutions of the 14-inch and 16-inch screens (discovered via the beta of macOS Monterey), which are supposedly 3024 x 1964 and 3456 x 2234-pixels respectively.",
    "What’s interesting about those resolutions is that they are 74 pixels of height away from being 16:10, the aspect ratio currently used by Apple’s MacBooks – so what we could have here is an added touch of breathing space either side of the notch. In other words, that could mean the desktop fully fits within the 16:10 area of the display, with no top menu bars being eclipsed by the notch, and there’d be a bit of space (74 pixels high) either side of the notch which could maybe be used for the battery level display, clock and so forth.",
    "Yes, it all seems far-fetched, as does Apple running with a large notch with no need for incorporating Face ID in there, which doesn’t make much sense arguably (along with the speculation about a thicker and heavier device – counterintuitive to say the least). File this one under ‘extremely flimsy’, then, but you just never know; there’s enough here to give at least a slight pause for thought, and Apple might just be poised to take what would definitely be seen as a big risk design-wise."
  ],
  "headers": {
    "7": "Analysis: Some farfetched speculation, then – but there are interesting points therein"
  },
  "links": {
    "MacBook Pro 14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "launch at the start of next week": "https://www.techradar.com/news/hyperspeed-macbook-pro-2021-coming-next-week-apple-hints-with-invite",
    "MacRumors": "https://www.macrumors.com/2021/10/15/new-macbook-pro-could-have-a-notch/",
    "Weibo": "https://weibo.com/1947043867/KCrTOsDBk?type=comment#_rnd1634303092343",
    "Reddit": "https://www.reddit.com/r/apple/comments/q8gxit/notch_present_face_id_not_and_other_major_leaks/",
    "new MacBook Pros": "https://www.techradar.com/news/apples-new-macbook-pro-will-lure-people-to-upgrade-heres-how-many-will-bite",
    "previously rumored": "https://www.techradar.com/news/the-next-macbook-pros-are-rumored-to-be-getting-a-1080p-webcam-upgrade",
    "multiple new colors for the Air is true": "https://www.techradar.com/news/the-new-macbook-air-has-leaked-and-it-looks-a-lot-like-the-colorful-new-imac",
    "another rumor which was floated in the past": "https://www.techradar.com/news/new-macbook-pro-could-kill-off-touch-bar-rumors-suggest",
    "Apple might just be poised": "https://www.techradar.com/news/apple-unleashed-october-2021-event-what-we-expect-to-see"
  }
}