{
  "source": "https://www.techradar.com/news/major-apple-car-decision-may-mean-it-has-no-steering-wheel-or-pedals",
  "title": "Major Apple Car decision may mean it has no steering wheel or pedals",
  "category": "car-tech",
  "updated": "2021-11-19T11:22:55Z",
  "author": "axel-metz",
  "summary": "Apple gets ambitious",
  "article": [
    "It looks like the wheels are finally moving on the Apple Car project. The company has decided to press ahead with development on a fully autonomous driving system and, despite previous forecasts, is now targeting a 2025 release.",
    "As per a recent Bloomberg report, strategy chief Kevin Lynch has opted to shift away from plans to create a vehicle with limited self-driving capabilities to instead focus on an Apple Car that requires zero driver intervention.",
    "Apple has reportedly set an internal target to release a road-worthy vehicle within the next four years, though insiders have suggested that window is subject to expansion should the company be unable to develop the desired autonomous technology before 2025.",
    "As Apple Car news goes, this is the most significant we've heard for a while. Recent months have seen the company acquire several high-profile industry names to assist on the project – like Tesla's former Autopilot software director, Christopher Moore – but concrete developments have been few and far between.",
    "We know that Apple still hasn't nailed down an automotive manufacturer to partner with on the project, though, and the question of which car brand to do business with has been the major subject of conversation – and controversy – around the Apple Car vision.",
    "For instance, we've previously reported on ongoing negotiations between Apple and Hyundai, Kia and even LG Electronics, though no deal has yet to see the light of day – publicly, at least.",
    "Of course, there's every chance that the tech giant won't ever find a suitable collaborator on its Apple Car plans.",
    "It's no wonder, though, that the big car brands have seemed reluctant to become a bit-part supplier – in the same way Foxconn is to Tesla – on a vehicle that would ultimately bear the Apple name.",
    "But Apple is well aware of that fact. As a consequence, we've seen more recent reports hinting that the company may be prepared to shoulder the entire development process on its own – similar to the approach taken by Elon Musk's Tesla.",
    "This shift towards in-house development would corroborate Bloomberg's claims regarding Apple's re-tooled focus on creating an innovative autonomous technology base, the likes of which the auto industry has never seen before.",
    "In fact, Apple's new plans are so ambitious, that Bloomberg claims the company is now aiming to develop a car with no steering wheel or pedals, and an iPad-like infotainment system in the center of the cabin.",
    "It's clear, then, that Apple's pivot away from convention may indeed prove the company's capacity for innovation beyond the computing and mobile industries – but a 2025 target is more than a little ambitious, in our opinion."
  ],
  "headers": {
    "4": "Could anyone spare a crumb of partnership?"
  },
  "links": {
    "Apple Car": "https://www.techradar.com/news/apple-car",
    "recent Bloomberg report": "https://www.bloomberg.com/news/articles/2021-11-18/apple-accelerates-work-on-car-aims-for-fully-autonomous-vehicle",
    "acquire several high-profile industry names": "https://www.techradar.com/news/heres-another-sign-the-long-rumored-apple-car-is-on-the-way",
    "Hyundai": "https://www.techradar.com/news/report-hyundai-confirmed-its-in-early-talks-to-help-make-apple-car",
    "Kia": "https://www.techradar.com/news/apple-may-have-chosen-the-manufacturer-to-build-the-apple-car",
    "LG Electronics": "https://www.techradar.com/news/apple-could-be-turning-to-an-old-rival-for-its-apple-car",
    "reports": "https://www.techradar.com/news/apple-may-have-to-work-alone-on-its-electric-car-after-failing-to-find-a-partner"
  }
}