{
  "source": "https://www.techradar.com/news/the-latest-microsoft-teams-update-is-like-something-straight-out-of-black-mirror",
  "title": "The latest Microsoft Teams update is like something straight out of Black Mirror",
  "category": "computing",
  "updated": "2021-10-12T11:22:31Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams will provide a history of the praise you give and receive - but at least it won't show your manager",
  "article": [
    "Microsoft is working on an update for collaboration platform Teams that, although well-intentioned, hints at a worrying new trend in the world of work.",
    "The company is developing new functionality for the Praise app in Microsoft Teams, which is supposed to provide an avenue for employees to exchange thanks and pat one another on the back for tasks well done.",
    "Currently, that’s as far as the application goes. However, according to a post in the Microsoft product roadmap, Teams users will soon be able to access a history of the praise they have sent and received. This history will extend back six months and can be viewed via the Viva Insights application for Teams.",
    "The update is still under development, but will reportedly roll out to all Teams users by the end of November.",
    "With the rise of remote working during the pandemic, businesses have sought new ways to celebrate the good work of employees, in lieu of an in-person thank you or shoutout. And this is exactly the hole the Praise app for Teams is designed to fill.",
    "However, it’s easy to imagine a system whereby employees tally up the praise they receive creating problems for people in the long run, especially if cursory praise delivered over Teams becomes a replacement for proper dialogue between managers and their staff.",
    "Although Microsoft says administrators will not have access to the praise history of employees, which means the app cannot be used to assess the performance of employees, the very existence of a praise tally implicitly tells people that their worth is tied to the number of congratulations they receive.",
    "The Praise app stops well short of assigning each person a score or star-rating (a concept explored in season three of TV series Black Mirror) based on the praise they garner, but could potentially act as a crude proxy for such a system.",
    "As businesses adapt to new hybrid working models in the aftermath of the pandemic, they will have to ensure they are attuned to the potential ramifications of the technologies they deploy, as well as their immediate benefits.",
    "Update: This story has been updated to reflect the fact that neither managers nor administrators will have access to data relating to the praise given and received by employees."
  ],
  "headers": {
    "4": "A worrying new trend?"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-6294435796569544000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26filters%3D%26searchterms%3D85639",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}