{
  "source": "https://www.techradar.com/news/amazons-latest-kindle-deals-include-lowest-price-yet-plus-free-kindle-unlimited",
  "title": "Amazon's latest Kindle deals include lowest price yet plus free Kindle Unlimited",
  "category": "tablets",
  "updated": "2021-12-08T15:59:25Z",
  "author": "alex-whitelock",
  "summary": "And, if you're looking for a cheap membership that's also available",
  "article": [
    "Two excellent Kindle deals have landed over at Amazon this week, offering what's quite possibly the best set of promotions for book lovers all year.",
    "First up, the standard Amazon Kindle is on sale for $54.99 (was $89.99) right now, which is actually its cheapest price ever. Better still, Amazon is throwing in three months of Kindle Unlimited for free on top. That's essentially an extended free trial, but either way, it's a lot of free books to check out over the holidays.",
    "And, at this price, the standard Amazon Kindle is pretty close to a perfect Christmas gift too. It, of course, lacks the waterproofing and adjustable warm light filter of the more expensive Kindle Paperwhite, but it's almost a third of the price today and still very much a great little reader. It comes with 8GB of storage, enough for thousands of books, and can still last up to four weeks on a single charge of battery.",
    "Secondly, for those who already have an e-reader or are signed up to Kindle Unlimited, there are significant discounts being offered on digital membership gift cards right now. Available in 6-months ($47.86), 12-months ($80.30), or 24-months ($143.80), these discounts are arriving just in time for Christmas and offer the perfect chance to top up those existing accounts. Note, if you're wondering whether you can gift yourself a membership, then the answer is yes - that's absolutely possible.",
    "Outside the US? Check out more of today's Kindle deals in your region just below.",
    "Want to read more about Kindle unlimited? Head on over to our Kindle Unlimited price guide to see whether it's worth it for you. Also worth checking out is our main Kindle deals page, where we've got all the best prices for the other models in the range."
  ],
  "headers": {
    "5": "Today's Amazon Kindle deals"
  },
  "links": {
    "for $54.99 (was $89.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB085VX2RKH%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9835733794704660000-20",
    "Kindle Paperwhite": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08KTZ8249%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6285548100791432000-20",
    "$47.86": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fkindleunlimitedgift%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6764405970249132000-20",
    "$80.30": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fkindleunlimitedgift%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1404175362228437000-20",
    "$143.80": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fkindleunlimitedgift%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9342292807536603000-20",
    "Kindle Unlimited price": "https://www.techradar.com/news/amazon-kindle-unlimited-price-how-much-does-it-cost",
    "Kindle deals": "https://www.techradar.com/news/portable-devices/portable-media/kindle-deals-1296345"
  }
}