{
  "source": "https://www.techradar.com/news/marvels-secret-invasion-has-seemingly-just-cast-a-huge-game-of-thrones-star",
  "title": "Marvel's Secret Invasion has seemingly just cast a huge Game of Thrones star",
  "category": "entertainment",
  "updated": "2021-04-21T08:59:48Z",
  "author": "tom-power",
  "summary": "Emilia Clarke has seemingly confirmed her involvement",
  "article": [
    "It's been a busy 24 hours for Marvel's Secret Invasion casting announcements. The upcoming Disney Plus TV show reportedly added Oscar winner Olivia Colman to its cast on Monday, and now it appears that a Game of Thrones star has joined its growing ensemble cast.",
    "Per Variety, Emilia Clarke is in final talks to join the likes of Samuel L. Jackson in the MCU series. Naturally, the report doesn't divulge what role Clarke will play but, given their leading actor status in shows including Game of Thrones and movies such as Terminator: Genisys, it's likely to be a main role.",
    "Variety's report stated that Clarke's representatives and Marvel Studios declined to comment on the rumor, but Clarke has seemingly provided confirmation of her casting via her personal Instagram account.",
    "Taking to her Instagram Stories on Wednesday morning, Clarke - who played Daenarys Targaryen on Game of Thrones - posted a screenshot on Variety's article alongside the 'rock on' emoji, which would appear to confirm that she's on board.",
    "Check out the tweet below, courtesy of an Emilia Clarke Twitter fan account, for a screenshot of her Story post:",
    "Clarke isn't the only big name who will appear in Marvel's Secret Invasion TV series on Disney Plus. Jackson is set to reprise his long-running role as Nick Fury, while Ben Mendelsohn is also returning as the Skrull known as Talos.",
    "Joining Clarke as newcomers to the MCU are The Favorite and Broadchurch star Colman, as well as One Night in Miami's Kingsley Ben-Adir. The latter, who recently portrayed Malcolm X in Amazon Prime Video's feature film, is thought to be playing the villain in Secret Invasion, but Clarke and Colman's roles are yet to be determined. Marvel hasn't officially confirmed any members of the cast yet.",
    "It's possible that either or both actors could have been cast as new Skrulls, who may be masquerading as humans on Earth or as part of Fury's spaceship entourage, which we glimpsed at the end of Spider-Man: No Way Home. If the duo don't end up being Skrull secret agents, they could simply be lieutenants to Fury on board his space craft, or potential enemies that could help Ben-Adir's character to try and cause some mayhem on Earth or in space.",
    "Secret Invasion will likely focus on the Skrulls' secret-but-peaceful invasion of Earth, and presumably see Fury and Talos looking to locate other Skrulls who were forced to seek shelter on other planets following the Skrull-Kree war. During that lengthy battle, the Kree destroyed the Skrulls' home planet of Skrullos, and it's likely that Secret Invasion will be the backdrop to finding a new home for the remaining Skrulls to live peacefully on.",
    "Marvel's Secret Invasion currently has no release date, but it is expected to consist of six episodes and start filming in the UK and Europe in late 2021."
  ],
  "headers": {
    "5": "Marvel's Secret Invasion sounds like it'll have a stellar cast"
  },
  "links": {
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-5987858342927110000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "added Oscar winner Olivia Colman": "https://www.techradar.com/news/marvels-secret-invasion-on-disney-plus-sounds-like-itll-be-a-big-deal",
    "Variety": "https://variety.com/2021/film/news/emilia-clarke-secret-invasion-marvel-1234955746/"
  }
}