{
  "source": "https://www.techradar.com/news/the-best-and-worst-james-bond-cars-from-dr-no-to-no-time-to-die",
  "title": "The best and worst James Bond cars, from Dr No. to No Time To Die",
  "category": "entertainment",
  "updated": "2021-10-09T13:49:22Z",
  "author": "axel-metz",
  "summary": "Bond’s best (and worst) wheels",
  "article": [
    "After an 18-month hiatus, No Time to Die has finally landed in cinemas, bringing to a close Daniel Craig’s tenure as 007 by serving up an emotional and typically action-heavy espionage adventure.",
    "But although Cary Fukunaga’s take on James Bond – the 25th movie in the age-old franchise – shows off a decidedly different side to the iconic character (no spoilers, but M is called “darling” at one point), No Time to Die is nonetheless jam-packed full of gadgets, gags and, perhaps most important of all, eye-wateringly beautiful cars.",
    "In light of Craig’s final bow, then, we’ve put together a list of the best and worst Bond cars in the 60-year history of the franchise – including models from Dr No. to No Time to Die.",
    "Look, GoldenEye is indisputably Pierce Brosnan’s best film – nay, it’s one of the best in the whole franchise – but his ride, a sky blue BMW Z3, is up there with Bond’s most forgettable. It was the first BMW ever driven by the character, which presented 007 with a chance to push the brand’s famed German engineering to the max, but ultimately the car is merely driven to an airstrip and passed on to another agent – entirely neglecting the many gadgets (stinger missiles, radar and an ejector seat) Q so meticulously highlights in an earlier scene. If anything, then, the BMW Z3 was just a four-wheeled product placement.",
    "The Citroën 2CV driven by Roger Moore’s Bond in For Your Eyes Only was affectionately known as \"an umbrella on wheels\" – and it’s easy to see why. In fairness, this yellow matchbox doesn’t actually belong to him in the movie – rather his lady friend, Melina Havelock – and it does end up forming part of an impressive chase sequence through rural Spain, but that doesn’t take away from the fact that this is possibly the most un-Bond-like Bond car of them all.",
    "Easy pickings, this one. Not only is Die Another Day considered one of the worst Bond films (and certainly the worst of Brosnan’s tenure) but it also features one of the dumbest Bond cars. This Aston Martin Vanquish could turn invisible, for a start, and possessed wheel spikes, machine guns and a mouthful of heat-seeking rockets that Bond, smartly, deploys while skating around on a glacier. It’s an undoubtedly beautiful machine, but one let down by a studio more interested in silly toys than maintaining the series’ penchant for automotive elegance.",
    "We’re all for nostalgia here at TechRadar, but just because the Sunbeam Alpine marked the first Bond car of the lot, that doesn’t make it a good one. It was small, slow and home to some downright terrible rear camera shots that miserably fail the test of time. Sure, it manages to drift its way into sending a much larger pursuer off a cliff and into a ball of fire, but the Alpine didn’t re-appear in later films for good reason. Those white wheels were smart, at least?",
    "Many will claim Bond should never have set foot in an American muscle car – 007 is, admittedly, neither American nor particularly muscly – but the red Ford Mustang Mach 1 driven by Sean Connery in Diamonds are Forever isn’t a problem in itself. The problem comes from how the car is used (or rather, filmed) at the end of the movie’s Vegas-based chase sequence. In a desperate attempt to evade capture, Bond puts the Mustang on its two right wheels to slip down an alleyway, only to re-emerge on the other side with the car balanced on its left set. Producers clearly spotted the error, but botched the scene even further by adding an improbable car-rotating shot to justify the mistake. Sure, none of that was the car’s fault – but it nonetheless forms a major part of an irredeemable gaffe.",
    "In any other Bond movie, a Japanese car might have seemed an odd choice, but the Tokyo backdrop of You Only Live Twice proved a fitting playground for Sean Connery and the Toyota 2000GT Roadster. Often considered the first seriously collectible Japanese car and the country’s first supercar, the Roadster rips and roars through motorways and hills while maintaining the beauty of its cream exterior right to the last. Even cooler – and rare, in a Bond movie – the car spends the majority of its screen time being driven by Bond’s accomplice, Akiko Wakabayashi’s Aki.",
    "An underrated car for an underrated Bond, Timothy Dalton’s Aston Martin V8 Vantage in The Living Daylights is nothing less than a supermodel of a machine, and possibly the best-looking brown (brown!) car of all time. Its gadgets were also pretty damn cool, too, giving 007 lasers, rockets and skis in a way that didn’t seem gimmicky (take notes, Die Another Day) as he and cellist passenger Kara traverse snowy Slovakia. If ever we needed confirmation of the car’s enduring legacy, the V8 Vantage returns to action in No Time to Die.",
    "A truly modern Aston Martin fit for the 20th century, the DBS V12 quickly became the envy of every well-pennied Brit the moment Craig’s Bond set foot inside its suede-laden interior in Casino Royale. The car gets put through its paces, too, saving 007’s life with its built-in defibrillator and then almost taking it again by somersaulting seven times through the Montenegro mountains – resulting in a Guinness World Record and a reported production bill of almost $1.2 million. A black version of the DBS V12 also appears in the opening sequence of Quantum of Solace, which is arguably the movie’s best – one guess why.",
    "You knew it was coming. Throughout much of The Spy Who Loved Me, Roger Moore’s Lotus Esprit S1 is a decidedly unremarkable, ugly car – until he drives it off a bridge and turns it into a submarine, that is. The car produces fins, propellers and a roof-mounted missile that somehow manages to shoot a helicopter out of the sky, all before taking audiences on a picturesque aquatic journey through Sicilian waters. It’s the movie’s most famous, most ridiculous scene – and peak Moore – but one nonetheless seared into the collective consciousness of ‘70s Bond.",
    "It had to be, didn’t it? Not only is the Aston Martin DB5 Bond’s most iconic car, it's also the character’s most popular. After first appearing in 1964’s Goldfinger, the DB5 would go on to feature in Thunderball, GoldenEye, Tomorrow Never Dies, Casino Royale, Skyfall, Spectre and – spoilers? – No Time to Die. Three different 007 actors have driven the car, and each has looked just as cool doing so as the last. The DB5 is everything Bond is, but in car form – stylish, elegant, aggressive, quintessentially British – and has become, undeniably, the vehicular face of the franchise. Whoever inherits the 007 mantle from Craig in the future, you can be sure we’ll see them rolling up in an Aston Martin DB5 at some point."
  ],
  "headers": {
    "3": "BMW Z3 (GoldenEye,1995)",
    "4": "Citroën 2CV (For Your Eyes Only,1981)",
    "5": "Aston Martin Vanquish (Die Another Day, 2002)",
    "6": "Sunbeam Alpine (Dr. No, 1962)",
    "7": "Ford Mustang Mach 1 (Diamonds are Forever, 1971)",
    "8": "Toyota 2000GT Roadster (You Only Live Twice, 1967)",
    "9": "The Aston Martin V8 Vantage (The Living Daylights, 1987)",
    "10": "Aston Martin DBS V12 (Casino Royale, 2006)",
    "11": "Lotus Esprit S1 (The Spy Who Loved Me, 1977)",
    "12": "Aston Martin DB5 (Goldfinger, 1964)"
  },
  "links": {
    "No Time to Die": "https://www.techradar.com/news/no-time-to-die-is-a-fitting-end-for-daniel-craigs-bond-but-its-no-skyfall",
    "gadgets": "https://www.techradar.com/best/best-james-bond-gadgets",
    "inherits the 007 mantle from Craig": "https://www.techradar.com/news/the-next-james-bond-10-stars-who-could-replace-daniel-craig"
  }
}