{
  "source": "https://www.techradar.com/news/intel-ceo-says-amd-lead-is-over-as-it-considers-software-first-move",
  "title": "Intel CEO says AMD lead is over as it considers \"software-first\" move",
  "category": "computing",
  "updated": "2021-10-06T13:20:13Z",
  "author": "mayank-sharma",
  "summary": "Intel CEO bets big of software as he hopes to turn things around at Intel",
  "article": [
    "Intel CEO Pat Gelsinger suggests software will play a much larger role in the future of the company, as he prepares to once again take the fight to AMD, according to reports.",
    "Betting big on software in an interview with CRN, Gelsinger wants Intel to adopt a “software-first” approach to help the company trump the competition in all applications, from the cloud to the edge.",
    "“We have to deliver the software capabilities, and then we have to empower it, accelerate it, make it more secure with hardware underneath it. And to me, this is the big bit flip that I need to drive at Intel,” shared Gelsinger.",
    "He added that if there’s one thing that he learnt from his 11 year stint at VMware, it’s that “delivering silicon that isn’t supported by software is a bug.”",
    "In the interview Gelsinger admitted that he knew Intel wasn’t in the best of shape when he took over as CEO in February, with an eroding market share thanks to rapidly improving silicon from AMD on one hand, and the delayed delivery of its 7nm chips, on the other.",
    "But that’ll change soon, asserts Gelsinger, thanks to a multi-pronged approach that will see the culmination of new advancements in manufacturing and architecture over the next few years, coupled with Intel’s revamped integrated device manufacturing strategy, IDM 2.0.",
    "Gelsinger’s outlook might seem a bit too optimistic with the ongoing silicon crunch, which is something Intel’s CEO has himself expressed concern about a couple of times in the past.",
    "However, it appears that Intel will be able to capitalize on the silicon crunch to aggressively push its IDM 2.0 strategy, and as Tom’s Hardware says it could also help evaporate any disadvantage of the delay in the production of its upcoming Xeon Scalable Sapphire Rapids processors.",
    "“We’re ready to get the mojo back in that respect,” beamed Gelsinger.",
    "Via CRN"
  ],
  "headers": {
    "4": "“Here we come”"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "took over as CEO": "https://www.techradar.com/news/intel-chooses-vmwares-pat-gelsinger-to-replace-bob-swan-as-ceo",
    "improving silicon from AMD": "https://www.techradar.com/news/another-top-cloud-vendor-picks-amd-processors-over-intel",
    "7nm chips": "https://www.techradar.com/news/intel-admits-7nm-cpus-delayed-perhaps-until-2023-falling-further-behind-amd-ryzen-chips",
    "IDM 2.0": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
    "expressed concern": "https://www.techradar.com/news/intel-ceo-says-chip-shortage-could-stretch-into-2023",
    "delay in the production": "https://www.techradar.com/news/intel-quietly-delays-next-generation-sapphire-rapids-xeon-processors",
    "CRN": "https://www.crn.com/news/components-peripherals/intel-ceo-pat-gelsinger-the-silicon-man-with-the-software-plan"
  }
}