{
  "source": "https://www.techradar.com/news/mcdonalds-ps5-controller-giveaway-gets-shut-down-by-sony",
  "title": "McDonald’s PS5 controller giveaway gets shut down by Sony",
  "category": "gaming",
  "updated": "2021-08-30T01:58:49Z",
  "author": "adam-vjestica",
  "summary": "Sony isn’t lovin’ it",
  "article": [
    "McDonald’s Australia recently announced plans to give away a bunch of custom PS5 controllers to celebrate its 50th anniversary, but Sony has since stepped in to block the global fast food chain from delivering on its promise.",
    "The McDonald’s PS5 controller featured the company’s famous Golden Arches logo on the touchpad, a yellow D-Pad and face buttons, along with a picture of some fries and what appears to be a Big Mac Burger on the handles of the DualSense pad.",
    "Unfortunately, it appears that McDonald’s didn’t get permission from Sony before creating the custom controller, and has blocked McDonald’s from giving away any of the garish-looking pads during its ‘Stream Week’ event.",
    "In a statement to Press Start, McDonald’s Australia said: “Unfortunately, McDonald’s stream week has been postponed and won’t be going ahead this Sunday. We are unable to confirm a new date for the proposed event at this time. We will have some great prizing [sic] including Macca’s 50th Birthday Hoodies and 50 channel subscriptions for each streamer to give away. We will be in contact with the new timing as soon as we have it confirmed.",
    "“Sony PlayStation has not authorised the use of its controller in promotional materials related to the proposed Stream Week event and we apologise for any inconvenience caused. McDonald’s stream week has been postponed and Sony PlayStation controllers will not be included in the giveaway.”",
    "While it may seem like Sony is playing the role of the party pooper by blocking McDonald’s PS5 controller from being given away, it isn’t really surprising. We’ve seen Sony protect its intellectual property in the past, as the company has previously blocked the sale of PS5 faceplates from being manufactured. However, that didn’t stop custom skin maker dbrand from creating and releasing their own PS5 Darkplates, which let you turn the white PS5 into a fetching looking black model.",
    "It seems rather shortsighted if McDonald’s Australia, who will be all too aware of the legalities involved in making such a move, didn’t reach out to Sony to strike up an agreement for its custom PS5 DualSense controller to be given away before making an announcement. Any partnership or branding for such events usually has to be agreed by both parties, so while it might be easy to be frustrated with Sony, McDonald’s Australia should also shoulder some of the blame.",
    "Currently, the PS5 DualSense only has three variations available: you can purchase it in Original White, Cosmic Red and Midnight Black. We’re sure to see more color options and unique designs in the future, but as it stands, the McDonald’s PS5 controller won’t be one of them."
  ],
  "headers": {
    "5": "Analysis: Sony’s stance isn’t a surprise"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Press Start": "https://press-start.com.au/news/playstation/2021/07/31/mcdonalds-has-created-a-limited-edition-ps5-controller-that-aussies-can-win/",
    "PS5 faceplates": "https://www.techradar.com/news/ps5-custom-faceplate-orders-cancelled-as-sony-takes-legal-action",
    "Darkplates": "https://www.techradar.com/news/okay-so-i-kind-of-love-the-darkplates-that-have-given-me-a-black-ps5",
    "Cosmic Red and Midnight Black": "https://www.techradar.com/news/ps5s-dualsense-gets-two-new-color-options-and-you-can-pre-order-them-now"
  }
}