{
  "source": "https://www.techradar.com/news/is-google-building-a-wearos-powered-fitbit-smartwatch",
  "title": "Is Google building a WearOS-powered Fitbit smartwatch?",
  "category": "fitness",
  "updated": "2021-05-13T08:58:29Z",
  "author": "cat-ellis",
  "summary": "Google is investing in its smartwatch operating system again",
  "article": [
    "Google has recently begun pumping new resources into improving its smartwatch operating system, WearOS, suggesting it may release a new device in the near future – which might be a Google-branded Fitbit.",
    "Google acquired Fitbit in early 2021, following over a year of negotiations and investigations into how users' privacy would be protected. Some of those reviews were still ongoing at the time (Australia's competition watchdog the ACCC and the US Department of Justice had yet to complete their work), but the two companies announced that the deal was final in mid-January.",
    "It's still early days for the partnership, but new developments suggest that a lot might be happening behind the scenes, and a device that combines the two companies' smartwatch tech could be on the horizon.",
    "WearOS, formerly known as Android Wear, is used by companies including Fossil, Mobvoi and Huawei to produce smartwatches that are more affordable than their Apple equivalents, but still pack a solid collection of features – particularly for anyone who relies on tools like Google Maps, Pay, Calendar and Gmail.",
    "However, the popularity of WearOS seems to be waning, dwindling in comparison to Apple and Samsung's market share. It's also notable that Google has yet to release its own branded smartwatch to really showcase the OS, as it has with its ChromeOS-powered Pixelbook laptops.",
    "As Michael Perrigo at Chrome Unboxed has spotted, Google has recently begun pumping extra resources into WearOS, including adding Gboard support for typing in text and emoji. That's not a minor undertaking, so make that kind of investment if there weren't new plans on the horizon?",
    "Until now, all Fitbit devices have used the company's proprietary Fitbit OS operating system, but switching to WearOS would give the company a lot more options, including full support for Google Fit, plus tools from the likes of Strava and Adidas right on the user's wrist.",
    "The Fitbit smartphone app is already compatible with many third-party fitness tools, but WearOS would give users a lot more options on the watch itself (much like the excellent Fossil Sport).",
    "Fitbit isn't in the habit of giving away details early (unless they accidentally leak, as happened with the new Fitbit Luxe) so if such a device is indeed in the works, we're unlikely to know before its official launch.",
    "Alternatively, we might soon see a version of Fitbit OS augmented with Google tech, including built-in apps for quick access to your calendar so you can schedule workouts and meditation sessions in advance, or Google Pay as an alternative to the less widely supported Fitbit Pay.",
    "We'll keep you updated as soon as news emerges, so stick with TechRadar to make sure you're up to date."
  ],
  "headers": {
    "3": "Why now?",
    "8": "What's next (maybe)"
  },
  "links": {
    "WearOS": "https://www.techradar.com/news/best-wear-os-watch",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Google acquired Fitbit": "https://www.techradar.com/news/google-finalizes-fitbit-acquisition-despite-continuing-antitrust-investigations",
    "Australia's competition watchdog the ACCC": "https://www.smh.com.au/technology/accc-considers-legal-action-after-google-completes-2-7-billion-fitbit-deal-20210115-p56ufc.html",
    "US Department of Justice": "https://www.bloomberg.com/news/articles/2021-01-14/google-closes-fitbit-deal-amid-ongoing-u-s-doj-review",
    "seems to be waning": "https://www.statista.com/statistics/750328/worldwide-smartwatch-market-share-by-platform/",
    "Pixelbook": "https://www.techradar.com/news/best-chromebook",
    "Michael Perrigo at Chrome Unboxed": "https://chromeunboxed.com/gboard-on-wear-os-fitbit-future-of-health-accountability",
    "Fitbit OS": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8607324558727757000/https://help.fitbit.com/articles/en_US/Help_article/2302.htm",
    "Fossil Sport": "https://www.techradar.com/reviews/fossil-sport-review",
    "Fitbit Luxe": "https://www.techradar.com/reviews/fitbit-luxe"
  }
}