{
  "source": "https://www.techradar.com/news/vodafone-switches-on-europes-largest-standalone-5g-network",
  "title": "Vodafone switches on Europe's largest standalone 5G network",
  "category": "phones",
  "updated": "2021-04-13T09:44:05Z",
  "author": "steve-mccaskill",
  "summary": "Operator completes its largest European SA 5G deployment to date",
  "article": [
    "Vodafone has switched on Europe’s biggest commercial Standalone 5G network (SA 5G) in Germany, claiming the development will help consumers and businesses realise the full potential of next generation networks.",
    "Nearly all commercial 5G deployments to date have relied on Non-standalone 5G (NSA 5G), which uses new radio technologies but still relies on the underlying 5G core.",
    "SA 5G uses a new virtual, cloud-based core that allows data to be processed closer to the point of collection and enables features like network slicing. This allows for guaranteed speeds, enhanced reliability and ultra-low latency.",
    "These characteristics will be essential for some of the most revolutionary 5G applications – including the Industrial Internet of Things (IIoT). Vodafone has deployed SA 5G in other locations, including at the University of Coventry, but never on this scale.",
    "“We are clearing the way for real-time connectivity. 5G is standing on its own two feet in Germany for the first time,” declared Vodafone Germany CEO Hannes Ametsreiter. “We are the first network operator to put aside the LTE support wheels for 5G - not for internal tests, but for our customers, who can experience real-time connections.”",
    "SA 5G is now available in several major German cities, including Dusseldorf, Frankfurt, Leipzig and Munster. In these cities, the operator’s 3.5GHz radio equipment is now connected to a cloud-based core powered by Ericsson’s technology. Testing of the network was done using an Oppo Find X3 Pro smartphone which is powered with a Qualcomm Snapdragon 888 5G platform.",
    "Vodafone is touting the potential for SA 5G to transform and enable entirely new industrial and public sector applications and to offer enhanced mobile broadband services. There are other benefits too, not least a 20% reduction in energy consumption when compared to NSA 5G.",
    "These savings not only lower the environment impact of 5G but lower the cost-per-bit of transmission for operators. Ericsson and Vodafone have also converted a data centre in the Frankfurt area to enable cloud data processing that will support customers in the region.",
    "\"Our 3.5GHz range 5G network is now completely independent of LTE technology. At initial available locations, it is possible to achieve latency times of 10 to 15 milliseconds – that's as fast as the human nervous system,” added Vodafone Germany CTO Gerhard Mack.",
    "“These ultra-low latency times are now arriving step-by-step to consumers across Germany as we put more and more 5G facilities into operation.”"
  ],
  "headers": {
    "3": "5G speed record"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}