{
  "source": "https://www.techradar.com/news/exclusive-turns-out-realmes-and-oppos-magsafe-rivals-are-the-same-thing",
  "title": "Exclusive: Turns out Realme's and Oppo's MagSafe rivals are the same thing",
  "category": "phones",
  "updated": "2021-08-26T10:05:58Z",
  "author": "tom-bedford",
  "summary": "Not as much a surprise as it sounds",
  "article": [
    "The iPhone 12 brought with it Apple's MagSafe, a tech that let you magnetically clip on peripherals like chargers and wallets. In early August Realme unveiled MagDart, an equivalent for its own phones, and a few weeks later Oppo showed off MagVOOC, yet another magnetic phone charger.",
    "But, as it turns out, MagDart and MagVOOC are the same thing. In a statement to TechRadar, Oppo confirmed \"we have shared our MagVOOC technology with Realme\".",
    "This makes it sound like Oppo developed the tech and Realme developed its own version, but we've reached out to the latter company for clarity and will update this article when we hear back.",
    "MagDart and MagVOOC similarities aren't as surprising as they may seem. Both Oppo and Realme are owned by BBK Electronics, a Chinese tech conglomerate, and though the exact relationship between BBK subsidies is notoriously vague, some of the brands (a list which includes Vivo and OnePlus as well as Oppo and Realme) have been known to share tech.",
    "Plus, when MagDart was announced, Realme confirmed to TechRadar, \"The tech we launched is a standard, so if other companies' devices fit it, it can also be used\", making it clear that other brands were free to use MagDart.",
    "Oppo suggesting it developed the magnets first doesn't quite fit this narrative, though.",
    "In Oppo's statement to TechRadar, it continued \"Oppo is open to collaborations across industries to jointly build a VOOC flash charge ecosystem, providing a superior flash charging experience for consumers around the world”, which suggests some of the other accessories Realme unveiled for its magnetic charging MagDart could work on Oppo phones. These include stands, wallets and cases.",
    "Neither MagDart nor MagVOOC is currently available on phones you can buy - both were unveiled as concepts, that'll likely make their way to future Realme and Oppo phones in the near future. Until then, we can't tell if the Dart and the VOOC will literally work together - but by Oppo's statement, it sounds very likely they will."
  ],
  "headers": {},
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "MagDart, an equivalent for its own phones": "https://www.techradar.com/news/realme-flash-is-a-new-android-phone-with-a-better-version-of-iphones-magsafe"
  }
}