{
  "source": "https://www.techradar.com/news/6-gadgets-to-help-you-work-out-even-though-youre-at-home",
  "title": "6 gadgets to help you work out even though you're at home",
  "category": "wearables",
  "updated": "",
  "author": "james-peckham",
  "summary": "How to stay motivated at home",
  "article": [
    "2020 saw many around the world spend a lot more time at home, and encouraging yourself to workout can be a difficult task when you're adapting to a new daily routine.",
    "Maybe your gym has closed, maybe your normal workout regime has stopped, or perhaps you're just lacking motivation: technology can help you get back into workouts.",
    "There are a variety of home workout gadgets you can use to encourage you to workout from home with top choices like wearables that remind you when you're due to get your heart pumping or other options to give you a top sweaty workout even though you're in your living room.",
    "We've put together a variety of tech you may want to consider to upgrade your workouts at home, even though it can be a little tough to find that motivation sometimes.",
    "A smartwatch may be the ultimate tool to encourage you to work out from home, and it could offer a whole world of other benefits on top of simple reminders.",
    "Our top picks for the best smartwatches will help you decide on the best choice for you, but our best example of anyone looking for a watch that will remind them to workout is the Fitbit Versa 3. It's a slick smartwatch that is compatible with both iPhones and Android phones.",
    "You can set up the smartwatch to give you a reminder to \"Get your heart pumping\", if you're subscribed to the Fitbit Premium service. This can give you that buzz to remind you to workout when you most need it.",
    "The reminders aren't just about exercise though. There are other reminders you can set up for things like drinking water or even washing your hands for up to three times a day.",
    "If you're looking for a device that will remind you to work out, this may be exactly the right choice for you to give you that prod that gets you up from your desk and into your gym kit.",
    "Gamifying your workouts may be the ultimate way to encourage you to get up off your sofa, and this Nintendo Switch compatible accessory is one of the best tools for that right now.",
    "The Ring Fit Adventure isn't the most specialist tool you'll find on this list, but it is a way that you can sneak workouts into your daily routine. It's essentially a game that you play on your Nintendo Switch using with it being a game that works with an exercise peripheral, and it means you want to keep coming back for more each time.",
    "A Nintendo Ring Fit Adventure costs extra on top of a Nintendo Switch, but it's suitable for many who want to mix up their workouts with something a little different and downright fun too.",
    "High intensity interval training is great for many who don't have a huge amount of space, and a subscription to Fiit would allow you to do this with ease at home either on your lunch break or whenever you need to fit it in with your schedule.",
    "Fiit offers a variety of studio classes that you can do from home with the app either working on your phone or connecting directly to your TV to give you the best picture of a virtual boutique class.",
    "You'll need to motivate yourself to get a workout underway, but once you're there a virtual trainer will talk you through what you need to do and you’ll soon find yourself being caught up in each workout.",
    "It comes with a heart rate monitor - your stats will appear on the screen so you can ensure you're in the right heart rate zone at all times - and it only costs £120 a year (about $150 / AU$220) per year).",
    "This is a little different to the other options on this list, but if you struggle to hydrate, you may enjoy a smart water bottle that gives you a consistent schedule for sipping to ensure you're drinking water throughout the day.",
    "Some options will light up - or even buzz your smartphone - to remind you to take a drink to help you hydrate through the day, and that should help you be in a better place for your workout when it comes around.",
    "For example, the Hidrate Spark 3 bottle will connect to your smartphone to give you a reminder to your home screen that it's time to take a sip.",
    "Looking for one of the ultimate tools to help you work out from home? The Peleton bike has become a go to option for many who want to be able to do intensive and enjoyable workouts from home, and - if you're willing to spend money on it - you may find it great too.",
    "A Peleton bike is a spinning bike that comes with a flat screen 22-inch HD TV that gives you workouts with trainers that you'll grow to know over your time with the service. It offers a variety of different spinning workouts and plans depending on your experience or what you're looking to achieve.",
    "The aim is for this to be as exciting as a real life spin class, but it's built for those who don't want to or can't attend physical classes.",
    "If you struggle to get the motivation to head to your local class or gym, this is a great option but it's very, very expensive. The entry level bike costs $1,895 / £1,750 (about AU$2,600) and then there's a monthly subscription fee on top of that too.",
    "Perhaps the simplest option to help you workout from home is a new app on your smartphone. These are often cheaper than most of the other tech on this list - in fact, some options are even free - and they're easy to download right away, so you can get started straight after you finish reading this article.",
    "This won't be enough for everyone, but apps like Fitbit Coach or Aaptiv may be perfect for you to get your workout underway and these take away the stress of deliberating on what you need to do today in a workout.",
    "Some will even offer tailored notifications to appear on your smartphone when you're most in need of a buzz to get you ready for a workout.",
    "If you're able to set these up for exactly how you want them to appear, this may be great motivation to get you up and sweating again."
  ],
  "headers": {
    "4": "1. A smartwatch",
    "9": "2. Ring Fit Adventure",
    "12": "3. Fiit",
    "16": "4. A smart water bottle",
    "19": "5. A Peleton bike",
    "23": "6. A workout app"
  },
  "links": {
    "best smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Ring Fit Adventure": "https://www.techradar.com/reviews/nintendo-ring-fit-adventure-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Fiit": "https://www.awin1.com/awclick.php?awinmid=20261&awinaffid=103504&clickref=trd-us-6582353450668508000&p=https%3A%2F%2Ffiit.tv%2F",
    "Hidrate Spark 3 bottle": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4242048274238339600&xs=1&url=https%3A%2F%2Fhidratespark.com%2Fproducts%2Fblack-hidrate-spark-3&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2F6-gadgets-to-help-you-work-out-even-though-youre-at-home",
    "Peleton": "https://www.onepeloton.co.uk/"
  }
}