{
  "source": "https://www.techradar.com/news/space-jam-a-new-legacy-isnt-the-sequel-that-the-original-deserved",
  "title": "Space Jam: A New Legacy isn’t the sequel that the original deserved",
  "category": "entertainment",
  "updated": "2021-07-16T15:35:11Z",
  "author": "tom-power",
  "summary": "Space Jam deserved so much better",
  "article": [
    "Space Jam was one of my favorite movies as a kid. Yes, it was cheesy – the 1990s were notorious for it – and it looks dated now but, as a Looney Tunes fan, I enjoyed seeing Bugs Bunny, Daffy Duck and the rest of the gang take part in an over-elaborate basketball game alongside Michael Jordan and Bill Murray (though I didn’t know they were so famous at the time).",
    "When news broke that, after 25 years, a sequel was finally in production, I was excited. If Space Jam: A New Legacy could even be half as good as the original, I thought, it would still make for a decent watch regardless of what its plot was about.",
    "It’s a pity, then, that Space Jam: A New Legacy is a bloated, overly long follow-up that fails to recapture the heart and spirit that made Space Jam a cult classic to many 90s kids.",
    "The movie stars LeBron James – yes, the legendary LA Lakers, Cleveland Cavaliers and Miami Heat basketball player – as he attempts to rescue his youngest son Dom (Cedric Joe) from an evil AI program called Al-G Rhythm (Don Cheadle).",
    "After the duo find themselves uploaded into the ‘Seververse’, Warner Bros’ MCU-style universe, by Al-G Rhythm, James is tasked with teaming up with the Looney Tunes to beat the AI’s superpowered digital basketball stars in order to be reunited with Dom and return to the real world.",
    "So it’s a movie that focuses its themes around family, comes packaged with beloved Looney Tunes characters, and it’s a sequel to a cult classic animated feature. What’s not to love?",
    "For starters, the unashamed stuffing of Warner Bros. owned properties into the film is incredibly egregious. From the get go, Space Jam: A New Legacy doesn’t feel like it’s about the James family or the Looney Tunes, who aren’t even introduced until half an hour into the film.",
    "From Game of Thrones to Superman, and Harry Potter to Wonder Woman, A New Legacy is packed with references to Warner Bros’ other movies and TV shows – and it sucks. The constant allusion to various Warner Bros. properties, and meta commentary on the studio itself, is painful to listen to and it sticks around for the entire movie, which doesn’t make for enjoyable viewing.",
    "Sure, there are story reasons for their inclusions, but why were these properties used as plot devices to begin with? We don’t need to be told about the DCEU, or have other properties thrust down our throats, during a child-friendly movie, especially when A New Legacy contains baffling references to R-rated and mature movies like A Clockwork Orange and It.",
    "It feels like unnecessary marketing and, if anything, it relegates the Looney Tunes to the sidelines in a film that they’re supposed to be co-starring in. They’re part of what made Space Jam such a fun movie, so the fact that they don’t show up for a while in their own animated flick means this isn’t the movie that I, and I imagine other fans, actually wanted.",
    "And then there’s LeBron James. To be fair, James isn’t the worst part of the film – in fact, he’s not bad, all things considered – even though his character also suffers from needless meta commentary by stating that “athletes and acting never goes well” during one scene.",
    "Just like Warner Bros. shoehorning its own back catalog into the film, however, we get product placement as part of James’ inclusion. For one, Nike are prevalent throughout. Yes, you can understand why the sports company features heavily, given James' longstanding association with them, but it’s irrelevant in a movie that, in essence, is about an evil AI program that dukes it out with cartoon characters on the basketball court.",
    "What makes A New Legacy all the more frustrating, though, is that there are good aspects that show what could have been if it wasn’t for all of the shameless self-promotion.",
    "Cheadle’s Al-G Rhythm, for instance, is a charismatic villain. Of all the supporting human characters, Cheadle does most of the heavy lifting acting-wise, and his role in the story actually has some weight and meaning to it.",
    "Lola Bunny (voiced by Zendaya), too, gets some much-needed character development. Upgraded from the femme fatale character she was introduced as in the original (let's not get into the nightmarish world of debating her revised character design), Lola has an actual role in proceedings and gets more to do than just being Bugs’ love interest this time.",
    "You sense that she could have a life (albeit a cartoon one) outside of the movie’s events, just like her fellow Tunes, which is progress from what we got in Space Jam. In this sense, Lola’s arc is arguably the biggest plus that A New Legacy holds over its predecessor.",
    "Without spoiling anything, there are also a couple of standout callbacks to Space Jam. One particular bait and switch is so good, in fact, that it did make me laugh out loud – a rarity where A New Legacy is concerned.",
    "That this Easter egg and Lola’s character arc are the best parts of Space Jam: A New Legacy, though, speaks volumes about the rest of the movie. It starts to come good as it enters its final 30 minutes but, by then, it’s too late to salvage what could have been a decent summer flick.",
    "Sure, Space Jam: A New Legacy is a family-oriented animated film that will entertain the kids for a couple of hours. Some viewers, too, may not care much about Warner Bros. filling the screen with its metatextual commentary and numerous other properties.",
    "Space Jam: A New Legacy, though, could have been so much more in my opinion. It feels weighed down, tacky and that it just doesn’t get what made the original a cult classic to so many '90s kids, myself included.",
    "“It’s all about the fun, remember?” Bugs says at one point. I do, but I wasn’t having much of it throughout Space Jam: A New Legacy’s 115-minute runtime – and that’s the biggest disappointment of all.",
    "Space Jam: A New Legacy is available to watch in theaters and on HBO Max via its ad-free tier now."
  ],
  "headers": {},
  "links": {
    "Space Jam: A New Legacy": "https://www.techradar.com/news/how-to-watch-space-jam-a-new-legacy-online-stream-the-new-hbo-max-movie-today",
    "DCEU": "https://www.techradar.com/how-to/how-to-watch-the-dceu-movies-in-order"
  }
}