{
  "source": "https://www.techradar.com/news/is-2021-the-year-of-the-chrombook",
  "title": "2021 is the year of the Chromebook: here's why",
  "category": "computing",
  "updated": "2021-04-01T22:16:32.665Z",
  "author": "john-loeffler",
  "summary": "Incredible market growth hastens Chrome OS adoption",
  "article": [
    "For several years now, the best Chromebooks have slowly gained a pretty dedicated following as former skeptics became converts - and even prosthelytizers - of the lightweight Chrome OS and the highly affordable laptops it powers. Still, it hasn't come close to challenging Microsoft or Apple - or even Linux - as the operating system of choice for the vast majority of consumers.",
    "There are a whole host of reasons for this, not the least of which is Microsoft's far-sighted strategy of licensing its operating systems to OEMs, which helped it capture over 95% of the PC market in the early to mid 1990s, a market position that has only slightly eroded due to the popularity of Apple's competing OSX-powered laptops and desktops.",
    "As it stands, Windows installs account for just over 76% of desktop operating systems according to GlobalStats, a category that includes laptop computers. Apple's OSX accounts for another 17% of desktop OS installs, comprising just over 93% of desktop installations.",
    "Chrome OS, meanwhile, accounts for just 1.83% of OS installs - hardly an enviable market position - but that number doesn't tell the whole story.",
    "With the novel coronavirus pandemic disrupting educational routines across the world, Chromebooks have become a vital lifeline for schools having to transition almost overnight to remote learning.",
    "The low cost laptops have made it possible for students everywhere, regardless of means, to continue their education with some semblance of a normal routine and the infrastructure for remote learning that was hastily built in the early days of the pandemic will continue on in many ways once the pandemic subsides.",
    "Any teacher will tell you that there is no replacing in-person instruction, so students will one day leave the Zoom classes behind and return to the physical classroom - but they will be bringing their Chromebooks with them, and the impact of that on the future of Chrome OS and the Chromebooks they power will be long-lasting.",
    "Desktop PC sales took a huge hit in Q3 2020, according to market analyst Canalys, falling 27% short year over year for desktop workstations and 33% for tower and small desktop PCs. This is hardly surprising given offices around the world closed down to adhere to social distancing protocols.",
    "Instead, laptops saw a huge spike in overall sales as the global workforce made the move to working from home, accelerating an existing trend towards mobile computing systems like laptops and tablets.",
    "With the new academic year starting in Fall 2020, schools and families everywhere turned to Chromebooks as low-cost solutions to the challenge of remote learning, fueling a 122% growth in Chromebook sales in Q3 2020.",
    "In total, 9.4 million Chromebooks were sold that quarter, and while Q4 2020 and Q1 2021 aren't likely to see the same kind of raw units sold as the start of an academic year, the reliance on Chromebooks to meet the educational needs of students isn't going to disappear with the end of the pandemic.",
    "We don't want to overstate the case. The 9.4 million Chromebooks sold in Q3 2020 are a fraction of the 124.5 million computers (including tablets) sold in the quarter (roughly 7.5%), so nobody should expect Chromebooks to suddenly challenge the Windows/OSX duopoly in 2021, if ever.",
    "But just as important as the number of Chromebooks being sold - perhaps even more important – is who ends up using them.",
    "One of the brilliant insights of Microsoft's market strategy in the 1990s was that by putting their OS on as many computers as possible, they ensured that a family's first PC was almost guaranteed to be a Windows PC. Kids in the 1990s grew up using Windows and quickly became comfortable with the system, making it more likely they would continue to buy Windows PCs in the future.",
    "If anyone doubts this, just look at what happened in the late 2000s and early 2010s when netbook manufacturers tried to keep costs low by installing a Linux OS instead of Windows.",
    "Now, however, children are using computers as an integral part of their education in ways they never have before, and for many of them, Chrome OS is the first operating system that they become familiar with.",
    "As Extremetech points out, this fact isn't lost on Microsoft, and is likely behind many of its recent moves to solidify its presence in the education space with products like Office 365 and requiring Microsoft accounts in order to use several of its non-education products like Minecraft.",
    "And while there's no question that those same kids whose first computer is a Chromebook will eventually need to work within the Microsoft and Apple ecosystems as well, that established familiarity with Chrome OS and Chromebooks make it much more likely that they will be open to buying Chromebooks in the future.",
    "It's ironic that for many players, Cyberpunk 2077 was much more stable – and even just playable – on Google Stadia than it was on their PCs or game consoles. But if you know anything about cloud computing, it isn't at all surprising.",
    "By offloading all the resource intensive work to the cloud, Chromebooks with a solid internet connection are increasingly able to hold their own against Windows and OSX devices in terms of functionality. In fact, there a couple of things that Chromebooks have over legacy OS systems that are going to be a major market advantage going forward.",
    "While the relatively low cost of a Chromebook is obvious, perhaps even more significant is its lower system overhead. Chrome OS was designed to be especially lightweight to allow it to run on low-end hardware, but we're seeing more powerful Chromebooks making their way to market.",
    "The Samsung Galaxy Chromebook 2 features some pretty impressive specs at a reasonable price while looking great at the same time. Meanwhile, AMD is introducing a new line of mobile Ryzen processors that emphasize efficiency while still providing far more performance than an ARM-based processor.",
    "With so much of a Chromebook's functionality tied to the cloud, having the kind of specs normally reserved for Windows or OSX laptops with a light-touch OS means you'll be able to get some really great performance with the new upgraded hardware.",
    "This is especially important with the other major feature of the Chromebook: access to the Android app ecosystem. While Windows might have the most desktop installs of any operating system out there, it isn't actually the most popular operating system in the world.",
    "That would be Google's Android OS, which powers 41.58% of \"computers\" in the world, when you account for phones and tablets. With so many Android users in the world, Chromebooks have the additional advantage of tying in the world's most popular app ecosystem that can unite a consumer's phone, tablet, and laptop under a single unified ecosystem under a single Google account. That is something Windows laptops simply can't do.",
    "All of this points to the continued growth of Chromebooks over the next few years, and 2021 could very well be the year that Chromebooks finally start winning over the masses."
  ],
  "headers": {
    "7": "How remote learning turbocharged Chromebook sales",
    "13": "Chrome OS is increasingly the first OS students ever encounter",
    "18": "Chromebooks are more robust than ever"
  },
  "links": {
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "GlobalStats": "https://gs.statcounter.com/os-market-share/desktop/worldwide/#monthly-202010-202101",
    "Canalys": "https://www.canalys.com/newsroom/worldwide-pc-market-Q3-2020",
    "Extremetech": "https://www.extremetech.com/extreme/316603-chromebooks-gain-market-share-as-education-goes-online#:~:text=IDC%20now%20reports%2090%20percent,total%20PC%20shipments%20last%20quarter.",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Samsung Galaxy Chromebook 2": "https://www.techradar.com/reviews/samsung-galaxy-chromebook-2"
  }
}