{
  "source": "https://www.techradar.com/news/elden-ring",
  "title": "Elden Ring release date, trailers, news and pre-orders",
  "category": "gaming",
  "updated": "2021-12-09T16:42:12Z",
  "author": "vic-hood",
  "summary": "Elden Ring will release in February 2022",
  "article": [
    "Highly-anticipated RPG Elden Ring is on its way and we finally know when to expect it, though it is slightly later than we originally thought. Following a delay, the game has been pushed back to February 25 from January 21 2021.",
    "The game was first revealed at games industry expo E3 in 2019 and, after a couple of years of silence, we finally have a full-length trailer and a growing collection of screenshots along with that official release date.",
    "Elden Ring is an open-world, third-person action RPG, which comes from the studio behind the Dark Souls franchise, FromSoftware, in collaboration with Game of Thrones creator George R.R. Martin.",
    "The game's first official gameplay trailer gave us a good look at Elden Ring. We saw a bleak world filled with mythical monstrosities, dragons and epic combat. Think Dark Souls, Game of Thrones and Lord of the Rings, with influences from myths and legends all over the world.",
    "Below we’ve collected together everything we know about Elden Ring. We’ll be updating this guide as and when more details emerge so keep checking back.",
    "Update: Even though we have a release date for Elden Ring, and some playable tests behind us, we may see From Software's latest make an appearance at The Game Awards 2021, in which host Geoff Keighley has teased \"four or five things of that level\" in reference to the Elden Ring reveal trailer shown at Gamescom 2021. If you want to be first in the know, check out our guide on how to watch The Game Awards to catch all the action live.",
    "Elden Ring releases on February 25, 2022, following a delay, for PS4, Xbox One (where the game reportedly could still look excellent), PS5, Xbox Series X, Xbox Series S and PC.",
    "Elden Ring pre-orders are live right now for PlayStation and Xbox consoles across generations. However, PC pre-orders aren't currently live – we will update this page when these become available. Below, you'll find links to Elden Ring pre-orders.",
    "Elden Ring Gameplay Preview On November 4, 2021, we were treated to a new gameplay preview of Elden Ring, which gave us the biggest look yet at the fundamentals of the game. A lot was covered in the preview, including various mixes of horseback, on-foot and stealth-based combat.",
    "Alongside that was some light exploration of the open world, showing off how level design affords the player options in how they want to approach any given area. We also got a brief look at smaller and major dungeons that populate the world, which are loaded with loot, enemies, traps and of course, boss encounters.",
    "Reveal trailer The Elden Ring reveal trailer was shown during the Summer Game Fest: Kickoff Live showcase. The trailer gives us our best look yet at the world George R.R. Martin and FromSoftware have cooked up: and it's pretty dark. The trailer features grotesquely unique mythical creatures, werewolves, moving pots, mounted combat and epic battles. Check it out below:",
    "Announcement trailer The announcement trailer for Elden Ring doesn't give away anything in terms of gameplay, but with more than one sword shown, and a spear and hammer given screen time, it looks like it will be as melee-focused as FromSoftware's past games. Check it out below:",
    "Want to see even more Elden Ring screenshots? We've included some below that are just too pretty not to show you:",
    "Elden Ring is set in the Lands Between, a name invented by George R.R. Martin. Miyazaki told IGN, that the name is meant \"supposed to invoke this feeling of something that's very mysterious and very ethereal\".",
    "But what's Elden Ring's story? Here's Elden Ring's story outline, according to a press release from Bandai Namco:",
    "\"The Golden Order has been broken. Rise, Tarnished, and be guided by grace to brandish the power of the Elden Ring and become an Elden Lord in the Lands Between.",
    "\"In the Lands Between ruled by Queen Marika the Eternal, the Elden Ring, the source of the Erdtree, has been shattered. Marika's offspring, demigods all, claimed the shards of the Elden Ring known as the Great Runes, and the mad taint of their newfound strength triggered a war: The Shattering. A war that meant abandonment by the Greater Will. And now the guidance of grace will be brought to the Tarnished who were spurned by the grace of gold and exiled from the Lands Between. Ye dead who yet live, your grace long lost, follow the path to the Lands Between beyond the foggy sea to stand before the Elden Ring.",
    "\"And become the Elden Lord.\"",
    "But what does that all mean? Miyazaki has explained that the Lands Between were previously blessed by the Elden Ring, with the Erdtree symbolizing the presence of the Elden Ring. The presence of the Elden Ring gave a blessing to those living in the Lands Between, with those who were blessed being identifiable by a golden light that's seen in their eyes.",
    "However, over time, there were those who lost this blessing and the light diminished from their eyes, resulting in them - and their ancestors - having being exiled from the land. But when the Elden Ring is shattered in a \"historical event\", the land and its inhabitants lose the blessing, with the Tarnished being guided back to the Land Between. This is apparently where Elden Ring begins, with players taking on the role of a Tarnished.",
    "Bandai Namco has revealed that players will \"encounter adversaries with profound backgrounds, characters with their own unique motivations for helping or hindering your progress, and fearsome creatures\" and that \"players will choose the fate of this cursed land by unraveling its secrets and myths.\"",
    "Open-world action RPG Elden Ring is set to be FromSoftware's biggest game yet, with clear Norse mythology influences and gameplay similar to Dark Souls.",
    "\"However, that doesn’t mean that it plays out in the same way,\" director Miyazaki told IGN. \"With a more open and vast environment, the way combat plays out becomes fundamentally different.”",
    "A press release for Elden Ring states that the open-world RPG will feature \"fantastical landscapes\" and \"shadowy complex dungeons that are connected seamlessly.\" Players will cross \"grassy plains, suffocating swamps and lush forests\" as they explore the Lands Between. In addition, on your quest to become the Elden Lord, you will \"ascend spiraling mountains, enter breathtaking castles, and witness other sites of grandeur on a scale never seen before in a FromSoftware title.\"",
    "Speaking with IGN, following Elden Ring's reveal, Hidetaka Miyazaki explained there are six distinct regions in the game, each ruled by a demigod that has \"inherited the mad tainted power of the Elden Ring once it shattered\". And while there's an \"apparent\" order to go through the regions, players aren't technically required to do so.",
    "“We wanted to give a free level of progression and exploration through the Lands Between, so there’s a lot of different ways,\" Miyazaki said. \"You won’t be able to access everything from the start, but there are a lot of different ways you can approach each area. And there’s a lot of freedom as to which order you tackle different areas as well\".",
    "There's going to be a \"hub\" connecting these six regions, similar to how Firelink Shrine in Dark Souls served as a central connecting point for the different interconnecting pathways.",
    "You'll be able to traverse the Lands Between on foot or on horseback, with an option to play online with up to three other players. In addition, the world features natural weather cycles and time-of-day progression as well as fast-travel.",
    "Elden Ring will allow you to customize your character, rather than having a set protagonist.",
    "Miyazaki told Xbox Wire that Elden Ring \"puts more focus on RPG elements\" than FromSoftware's Sekiro: Shadows Die Twice, which Miyazaki described as having \"a heavy focus on action\".",
    "\"Of course, we are not shying away from the fun of responsive melee-based combat, and these elements will be present as well,\" Miyazaki said.",
    "Elden Ring will let players experiment with a variety of weapons, magic and other skills found throughout the world, with an aim to giving you more control over your playstyle. It's up to players whether they want to go charging into battles or to take a more stealthy approach, with the option to call upon allies for aid also available - you can even summon the spirits of deceased enemies and use them as allies in battles. This choice also extends to exploration.",
    "\"Along with this new vast world, we have created a number of new action systems and game systems to enhance this, and to go hand-in-hand with the vast new world,\" Miyazaki told IGN. \"For instance, the player can jump now, you can ride on horseback, and there's a number of new additions to combat, which just raise the level of freedom higher than our previous games. And it all matches with the sense of scale of the world itself.\"",
    "Players will also be able to customize and craft items using resources found in the world - there will also be a stamina bar in the game, though this is set to have \"less influence\" than in previous titles from the developer. According to Miyazaki, there will also be more health resources available than in previous FromSoftware games as players will be \"fighting for a longer time than before\".",
    "On the official Elden Ring page on Bandai Namco's website, the publisher explains the breadth of choice that will be available to players in terms of exploration and approaching combat. Apparently, it’ll be possible to use the environment, the weather and even the time of day to your advantage in battle. Players will also be able to experiment with “dozens of skills” to find out what suits them best, use stealth to take enemies by surprise and master arcane spells.",
    "“Ultimately,” the page says, “your journey will be defined by the strength of your own ambition. The greater your goals, the greater the challenge will be.”",
    "Miyazaki has also emphasized that FromSoftware wants to retain a sense of progression and flow in Elden Ring - but confirmed that the title will feature permadeath. Speaking on how Sekiro: Shadows Die Twice's resurrection system helped the game retain a sense of rhythm, Miyazaki said:",
    "\"We have a couple of elements in Elden Ring, which come from a similar kind of breed. Something that will keep them going and keep them encouraged to explore further. But you won't be able to resurrect in this game.\"",
    "We've rounded up all the biggest news and rumors surrounding Elden Ring, below:",
    "Could still look amazing even on older consoles",
    "Based on some apparent leaked footage, it looks like Elden Ring could look great on older consoles as well as the latest generation. The alleged footage from the game shows Elden Ring running on what is said to be an Xbox One-generation console – likely an Xbox One X, given the solid framerate.",
    "Posted by Gamebeat’s Jeff Grub to his Twitter page, it shows the player character standing on a cliff edge, with a huge glowing tree behind them. The camera spins around to show a distant city across a large open plain, while a few eagles fly away as the player approaches them, feathers fluttering to the ground as they take off.",
    "According to a follow up from The Washington Post’s Gene Park, this isn’t footage from a recent press showing either, suggesting that this is indeed a clip from the near-final game build.",
    "Closed Network Tests coming in November",
    "Alongside the announcement that Elden Ring’s release date was pushed back, the development team revealed that a closed network test is coming in November for consoles only—that’s PS5, PS4, Xbox One, or Xbox Series X/S, with cross-play supported within console families. The test will run from November 12 to 14 but if you want to take part, you’ll need to register on the Elden Ring website before November 1. We've put together a guide with full details on how to sign up for the Elden Ring closed network test.",
    "In the “final stages of development”",
    "During a chat with Famitsu as part of Tokyo Game Show (via PCGamer), the game’s producer Yasuhiro Kitao revealed that development is “moving forward quietly” and has entered the “final stages of development”.",
    "Kitao also revealed some other interesting tidbits about the game, including that it’s got a “very unusual map structure” with things that players haven’t seen in a FromSoftware game before. Apparently, there’ll be no errand quests on the open map but it’s “a system that lets you go anywhere you want, but also tells you when you're in trouble.” To help find your way around, you’ll also be able to collect map fragments which allow you to mark your way with a beam of light in the sky.",
    "Gamescom screenshots",
    "New screenshots from Elden Ring have been posted online following a behind-closed-doors gameplay screening during Gamescom 2021. Geoff Keighley posted the images to Twitter, giving a fresh look at mounted combat and some of the incredible creatures players will encounter in the game.",
    "Elden Ring Steam page appears",
    "Elden Ring has appeared on Steam with its own page, confirming resolutely that the game won't be an Epic Games Store exclusive. Though it doesn’t give much more away about the game —no system requirements just yet, unfortunately — it does describe the game’s “multilayered story told in fragments” and the ability to “freely combine the weapons, armor, and magic that you equip” as well as the option to “develop your character according to your play style, such as increasing your muscle strength to become a strong warrior, or mastering magic.”",
    "The page also confirms the game’s online multiplayer elements “where you can directly connect with other players and travel together” with an option to enjoy “a unique asynchronous online element that allows you to feel the presence of others.”",
    "Support for VR headset and PSVR controllers",
    "The Elden Ring PlayStation Store listing states that the game is compatible with VR headsets and PSVR aim controllers, but specifies that it does not support PlayStation VR. So, while we know that Elden Ring won't release on PSVR any time soon, it does have compatibility with VR headsets, suggesting that the compatibility is there if FromSoftware wanted to bring the game to PC VR in the future.",
    "“Very difficult but can be handled”",
    "Elden Ring director Hidetaka Miyazaki has touched on the game's difficulty in a recent interview with Japanese magazine Famitsu (via GamesRadar). According to Miyazaki, FromSoftware is making the game difficult, as difficult as Dark Souls 3, while giving players a range of ways to overcome the difficulties, saying it’s a game that's “very difficult, but it can be handled.” This means there won’t be traditional difficulty settings but players will find features that may help to mitigate difficulty, from character customisation, to co-op play, to greater freedom of choice in combat and exploration.",
    "George R.R. Martin’s work finished up years ago",
    "George R.R. Martin has revealed that his role in the development of Elden Ring was actually done years ago. Speaking to WTTW News Chicago, the Game of Thrones creator said that, from him, FromSoftware “wanted a world created to set the game in.”",
    "\"World building is a big factor in fantasy and science fiction,“ he explains, ”You’re not only talking characters and the plot, but the setting is almost as important as everything else: Tolkien’s Middle-Earth, Robert E. Howard’s Hyborian Age, the foundation universe of Isaac Asimov.”",
    "Martin says he “worked up a fairly detailed background for them” and that the developer “took it from there.” As a result, his “work on it was actually done years ago. These games, they’re like movies, they take a long time to develop.”",
    "After this, Martin only saw occasional glimpses of the game and says he is \"as excited as anyone else to see it.\"",
    "Extra materials It's possible we could see spin-off Elden Ring material in the future, with Bandai Namco President Yasuo Miyakawa saying: \"We will continue to develop Elden Ring not only as a game but also in a variety of other areas in order to deliver the worldview and charm of this title to our fans around the world.\"",
    "Multiplayer A press release for Elden Ring states that you can explore the world \"alone or online with friends\", in addition, the release says that Elden Ring can be played with \"1-4 players\". It's unclear whether this multiplayer will take the same form as Bloodborne, where you can beckon other players to help you out or whether we'll be able to freely team up with friends.",
    "Smart Delivery and free upgrade Elden Ring supports Smart Delivery on Xbox consoles as well as a free upgrade to PS5 for players who purchase the PS4 version. Players who purchase the physical disc version of the game cannot upgrade on the PS5 Digital Edition, due to the lack of hard drive, while players who purchase the digital version for PS5 on the PlayStation Store can also download the PS4 at no additional cost. Those who buy the game once on either Xbox One or Xbox Series X/S, can play across both console generations.",
    "What's with the name? The name 'Elden Ring' is apparently a mysterious concept that defines the game world itself. One of the key themes of the action RPG is that the Elden Ring has been shattered, but it remains a mystery exactly what that means for the game's narrative.",
    "George R.R. Martin has written the \"overarching mythos\" Miyazaki revealed that the George R.R.Martin collaboration came about as the developer is a huge fan of Martin's work. This collaboration has resulted in Martin writing the \"overarching mythos\" of Elden Ring.",
    "\"The actual collaboration itself begun with Mr. Martin ever so politely confirming what sorts of themes, ideas as well as many game-related aspects I had envisioned for the game,\" Miyazaki told Xbox Wire. \"This allowed us to have many free and creative conversations regarding the game, in which Mr. Martin later used as a base to write the overarching mythos for the game world itself.",
    "\"This mythos proved to be full of interesting characters and drama along with a plethora of mystical and mysterious elements as well. It was a wonderful source of stimulus for me and the development staff.",
    "\"Elden Ring’s world was constructed using this mythos and stimulus as a base.\"",
    "Development started after Dark Souls 3 DLC In an interview with Xbox Wire, Miyazaki revealed that Elden Ring development began just after Dark Souls 3 DLC development has ended. The second and final Darks Souls DLC, The Ringed City, was released in 2017.",
    "\"At the time, Elden Ring was being planned as a more classic fantasy title compared to others that were either being considered or already in the early stages of development,\" Miyazaki said.",
    "More variety than previous FromSoftware games When asked by Xbox Wire whether Elden Ring will be as challenging as previous FromSoftware games, Miyazaki said:",
    "\"Yes, I do. The importance we place on the joy the player experiences through overcoming challenges will be the same as it is in our other titles. I believe it will prove to be a very satisfying experience.",
    "\"Earlier I had said that this title focuses more heavily on RPG elements. This title will include a wide variety of weapons, magic, and ways to engage enemies, that make it possible to provide users with a style of gameplay and strategy that suits them.",
    "\"Even when compared to the Dark Souls series, I believe this title will provide even more variety in the ways for players to overcome challenges and tweak their tactics when facing enemies.\"",
    "Phil Spencer has played Elden Ring Speaking to GameSpot, Xbox boss Phil Spencer revealed that he's been playing Elden Ring and thinks its Miyazaki's \"most ambitious game\" yet.",
    "\"As somebody who's played all of Miyazaki's games over at least the last decade, this is clearly the most ambitious game that he's done,\" Spencer said. \"I mean, I love his games, but seeing some of the gameplay mechanics stuff that he's tackling, he and the team are tackling this time, of the setting, working with another creator in terms of story. I love it.\"",
    "Biggest FromSoftware game yet Speaking to Xbox Wire, Miyazaki explained that one of the big differences Elden Ring has from FromSoftware's previous titles is its sheer size.",
    "\"If I were to put aside the world full of fresh stimulus thanks to our collaboration with Mr. Martin, I would have to say the biggest difference is it being open world,\" Miyazaki said.",
    "\"Due to this, the scale of the world and its narrative, as well as the depth and freedom of exploration have increased dramatically. It is without a doubt our biggest title yet in terms of sheer volume.\""
  ],
  "headers": {
    "6": "Elden Ring: cut to the chase"
  },
  "links": {
    "pushed back to February 25": "https://www.techradar.com/news/elden-ring-has-been-delayed-to-the-busiest-gaming-week-of-2022",
    "The Game Awards 2021": "https://www.techradar.com/news/game-awards-2021-the-nominees-and-what-we-expect-to-see",
    "\"four or five things of that level\"": "https://www.techradar.com/news/the-game-awards-has-four-or-five-things-as-big-as-the-elden-ring-reveal",
    "how to watch The Game Awards": "https://www.techradar.com/how-to/the-game-awards-2021-how-to-watch-and-what-to-expect",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "could still look excellent": "https://www.techradar.com/news/elden-ring-may-look-amazing-even-on-xbox-one-consoles",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "IGN": "https://www.ign.com/articles/elden-ring-interview-largest-open-world-map-summer-of-gaming",
    "Xbox Wire": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1367721596455684400&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2019%2F06%2F09%2Fhidetaka-miyazaki-and-george-rr-martin-present-elden-ring%2F%3FranMID%3D24542%26ranEAID%3DkXQk6%2AivFEQ%26ranSiteID%3DkXQk6.ivFEQ-9gw4nfPKqp96jUrxfTmiiQ%26epi%3DkXQk6.ivFEQ-9gw4nfPKqp96jUrxfTmiiQ%26irgwc%3D1%26OCID%3DAID2000142_aff_7593_1243925%26tduid%3D%2528ir__zjh2qba9bgkftk3lkk0sohz3zu2xpdkskxjh2i1r00%2529%25287593%2529%25281243925%2529%2528kXQk6.ivFEQ-9gw4nfPKqp96jUrxfTmiiQ%2529%2528%2529%26irclickid%3D_zjh2qba9bgkftk3lkk0sohz3zu2xpdkskxjh2i1r00",
    "Sekiro: Shadows Die Twice": "https://www.techradar.com/reviews/sekiro-shadows-die-twice",
    "website": "https://en.bandainamcoent.eu/elden-ring/elden-ring",
    "apparent leaked footage": "https://www.techradar.com/news/elden-ring-may-look-amazing-even-on-xbox-one-consoles",
    "Elden Ring website": "https://beta.bandainamcoent.eu/en/cb/elden-ring-beta",
    "how to sign up for the Elden Ring closed network test": "https://www.techradar.com/how-to/how-to-sign-up-for-the-elden-ring-closed-network-test-and-play-the-game-early",
    "PCGamer": "https://www.pcgamer.com/elden-ring-map-comments-producer/",
    "Steam": "https://store.steampowered.com/app/1245620/ELDEN_RING/",
    "GamesRadar": "https://www.gamesradar.com/elden-ring-is-very-difficult-but-it-can-be-handled-thanks-to-all-the-new-character-build-options/",
    "revealed": "https://www.techradar.com/news/george-rr-martins-work-on-elden-ring-wrapped-up-years-ago",
    "Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "GameSpot": "https://www.gamespot.com/articles/phil-spencer-has-played-quite-a-bit-of-elden-ring-calls-it-miyazakis-most-ambitious-game/1100-6484314/"
  }
}