{
  "source": "https://www.techradar.com/news/laptop-maker-gigabyte-hit-by-ransomware-attack",
  "title": "Laptop maker Gigabyte hit by ransomware attack",
  "category": "computing",
  "updated": "2021-08-09T11:15:35Z",
  "author": "mayank-sharma",
  "summary": "Gigabyte has acknowledged reports of attack, but hasn’t shared specific details",
  "article": [
    "Taiwanese hardware manufacturer Gigabyte has been attacked by a ransomware operator, who has reportedly encrypted and exfiltrated over 100 GB of sensitive data .",
    "Gigabyte has acknowledged reports of the cyberattack, claiming that it’d affected a small number of servers, according to the Chinese news site United Daily News.",
    "While Gigabyte has not officially revealed details about the malicious campaign, BleepingComputer has learnt that the company was attacked by the RansomEXX gang.",
    "According to reports, the attack occurred in the middle of last week and forced the company to shut down systems in Taiwan, as well as its support site and portions of the Taiwanese website.",
    "Reportedly, whenever RansomEXX operators encrypt files on a target, they drop a link to a non-public page on the encrypted device.",
    "A source shared the link to the non-public page with BleepingComputer, which reveals that the ransomware gang is in possession of 112GB of Gigabyte data, including many documents under non-disclosure agreements (NDA).",
    "The gang also shared screenshots of four such sensitive documents, threatening to put them out in the open if the ransom isn’t paid.",
    "The documents reportedly include an American Megatrends debug document, an Intel \"Potential Issues\" document, an \"Ice Lake D SKU stack update schedule,\" and an AMD revision guide.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Classic double-extortion"
  },
  "links": {
    "Gigabyte": "https://www.techradar.com/reviews/gigabyte-aorus-17g-2021",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "United Daily News": "https://money.udn.com/money/story/5612/5655901?from=edn_referralnews_story_ch5591",
    "RansomEXX": "https://www.techradar.com/news/over-600-new-malware-threats-are-detected-every-minute",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/computer-hardware-giant-gigabyte-hit-by-ransomexx-ransomware/"
  }
}