{
  "source": "https://www.techradar.com/news/is-this-nintendo-switch-rival-the-ayn-odin-the-ultimate-retro-handheld",
  "title": "Is this Nintendo Switch rival, the Ayn Odin, the ultimate retro handheld?",
  "category": "gaming",
  "updated": "2021-08-18T10:38:35.134Z",
  "author": "gerald-lynch",
  "summary": "Forget the Nintendo Switch 2, I’m more interested in the Ayn Odin instead",
  "article": [
    "It sometimes feels as if we’ll wait for hell to freeze over before Nintendo releases Nintendo 64 or GameCube games on its Switch handhelds – or at least until it finally reveals whatever Nintendo Switch Pro device is rumored to be waiting in the wings.",
    "But a powerful new handheld device, designed with the retro gamer in mind, may beat it to the punch. The Odin, a crowdfunded device by Chinese manufacturer Ayn, looks set to be the ultimate in handheld gaming.",
    "While the core specs of the device remain shrouded in secrecy, there’s evidence that the Odin could be among the most powerful handheld gaming devices ever built. Running Android and powered by some of the latest mobile internal hardware, it’ll have enough grunt to run the most demanding of mobile games, like Genshin Impact, at top settings without breaking a sweat, while also being able to emulate 3D consoles up to and including the likes of the GameCube flawlessly.",
    "Though specs have yet to be officially released, leaks point to three models of the Odin being released. At present, it’s believed both the “Base” and “Pro” Odin models will run off the Snapdragon 855+ SoC, with 4GB of RAM in the Base model and 8GB of RAM in the Pro model, backed by 64GB and 128GB of storage respectively, and with retail pricing for the two models expected to land somewhere between $199 and $299. A third model, an entry level version, will come in at under $200, and make use of the weaker MediaTek Dimensity D1000C chipset, with 64GB of storage and 4GB of RAM, if rumors are to be believed.",
    "All feature similar sizings and designs to the Nintendo Switch Lite, with 6-inch, 1080p IPS touchscreen displays, dual analog sticks, pressure-sensitive analog triggers, and a hidden pair of additional mappable buttons in the grips. USB-C, 4K HDMI out, Wi-Fi 5 and Bluetooth 5 are all baked in, as well as an active cooling system to keep the chip from throttling under heavy load.",
    "But this is just the tip of the iceberg of what makes the Odin special.",
    "For starters, unlike other rival Chinese handhelds, Ayn is set to offer a sold-separately docking station for the Odin, which (much like the Switch) will let you enjoy your on-the-go games on the big-screen when at home. It’s going one better than the majority of docks however by offering ports for native or third party N64 and GameCube controllers. It also has USB 3.0 ports, Ethernet, USB-C, 4K / 60fps HDMI, and space for a 2.5-inch hard drive.",
    "The handheld itself features a custom, game-focused launcher on top of Android, fully customizable to let you tweak the layout of your apps and emulators to your liking – far more customizable than the Switch’s current UI. But it also features an excellent touchscreen-to-pad button mapping interface, letting you assign the handheld’s buttons to corresponding touchscreen commands. What’s more, when docked, these mapping profiles can be lined up with wireless controllers, letting you lean back on the couch to play Android games with physical controls.",
    "With an expected release window of November 2021, Odin is just about the most exciting handheld device we’ve seen come out of China.",
    "Nintendo may have set the standard with the Nintendo Switch, but in the intervening years, the competition has not only heated up, but caught up with the Japanese masters. The Odin represents not only the first time that a Chinese handheld appears to have matched Nintendo’s feature set, but also surpassed it, too.",
    "Of course, Nintendo’s ace up its sleeve is its first party development studios – you won’t see Breath of the Wild 2 on the Odin, for instance, with Nintendo’s quality seal software exclusive to its hardware. But the desire to play Nintendo (and other manufacturers’) back catalogue of games cannot be underestimated, and there are many gamers willing to dip into the murky waters of game emulation to access them. With the likes of the GameCube, N64, Sega Dreamcast and noughties and nineties-era PlayStation console titles hard to legally come by right now, it’s no wonder handheld makers like Ayn are filling the gap by providing intrepid (and legally dubious) gamers with the tools to once again to play those games.",
    "Nintendo has competition from other noted manufacturers looking to enter into its space too – the Steam Deck from Valve is looking equally impressive, comes from a respected and trusted brand, and looks similarly flexible in terms of what it can play to the Odin. Its trump card of course is access to the Steam catalogue of PC games, something the Odin even can’t match – though the Android base of Odin would open it up to the many PC game streaming services, like Xbox Game Pass, that are starting to spring up.",
    "It’s an exciting time to be a handheld gamer then, and Ayn’s Odin may be a dark horse in this new generational fight.",
    "Can’t wait for Nintendo Switch Pro? Onexplayer handheld PC is the answer"
  ],
  "headers": {
    "6": "Docks, button mapping and more",
    "9": "Analysis: A new generation of handheld devices"
  },
  "links": {
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "a crowdfunded device by Chinese manufacturer Ayn": "https://www.indiegogo.com/projects/odin-the-ultimate-gaming-handheld/coming_soon",
    "Genshin Impact": "https://www.techradar.com/news/genshin-impact-free-zelda-clone-to-play-while-you-wait-for-breath-of-the-wild-2",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Can’t wait for Nintendo Switch Pro? Onexplayer handheld PC is the answer": "https://www.techradar.com/news/cant-wait-for-nintendo-switch-pro-onexplayer-handheld-pc-is-the-answer"
  }
}