{
  "source": "https://www.techradar.com/news/iphone-13-battery-leak-shows-improvements-but-its-still-not-great",
  "title": "iPhone 13 battery leak shows improvements, but it's still not great",
  "category": "phones",
  "updated": "2021-06-03T08:24:24Z",
  "author": "tom-bedford",
  "summary": "An average battery life",
  "article": [
    "iPhones used to be mocked for their terrible batteries, and while the last few Apple smartphone generations haven't been as bad, we haven't seen an iPhone with an outright 'good' battery life - and it seems the iPhone 13 won't change that.",
    "This comes from popular leaker Digital Chat Station, posting on Chinese social media platform Weibo. DCS has posted the supposed battery capacities of the upcoming iPhone 13 range, giving us an idea of how the phones could compare to their predecessors.",
    "Apparently the iPhone 13 mini has a 2,406mAh battery, just over the 2,227mAh of the iPhone 12 mini. The iPhone 13 and 13 Pro are said to hit 3,095mAh, a similar jump up from the 2,805mAh of the iPhone 12 and 12 Pro. Finally, the iPhone 13 Pro Max apparently reaches 4,352mAh compared to the 3,687mAh of the iPhone 12 Pro Max.",
    "If this leak is correct, the Pro Max model has the only major capacity increase over its predecessor. While battery capacity isn't exactly the same as battery life, with the latter affected by software optimization, screen size and your use of the phone, we're expecting the iPhone 13 series to have the same screens sizes and similar software to the iPhone 12 series. So the capacity changes are noteworthy.",
    "One-day battery life is about average for a smartphone, though many models exceed that (half of all phones do - that's how averages work, after all) and go up to, or beyond, two days. While Apple is much closer to average than it used to be, we were hoping the company would go further.",
    "It seems not, though, because these battery capacities still fall behind the competition. Samsung, Xiaomi and more put 5,000mAh batteries in their premium phones (their iPhone rivals), and as a result they have more staying power.",
    "Sure, if iOS brought loads of battery optimizations, or iPhones were notably smaller than those aforementioned rivals, perhaps a smaller battery would be fine. But that's not the case - apart from the small-sized iPhone 12 mini obviously, though it has an equally minuscule battery.",
    "Maybe this leak will be wrong, and the iPhone 13 series will have decent battery life. But if DCS is correct - which they generally are - we could be in for another disappointing year of iPhones (in terms of battery, at least)."
  ],
  "headers": {
    "4": "iPhone 13 battery"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Digital Chat Station": "https://www.weibo.com/u/6048569942?is_all=1",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review"
  }
}