{
  "source": "https://www.techradar.com/news/huawei-p50-launch-date-confirmed-for-july-29-and-it-wont-be-alone",
  "title": "Huawei P50 launch date set for July 29, but you won't be able to buy it right away",
  "category": "phones",
  "updated": "2021-07-19T16:39:50Z",
  "author": "jitendra-soni",
  "summary": "Huawei P50 Pro and Pro Plus are also expected",
  "article": [
    "Months later than expected, we now know the Huawei P50 launch date. As revealed by Huawei's CEO, Richard Yu, it's set to show up on July 29 along with some other devices.",
    "That is a China-only launch for now, so there's no official word on whether the Huawei P50 series will be coming to markets like Europe. If it does, you can likely expect a further event after July 29 to confirm that availability.",
    "The China launch was revealed by a post on Chinese social media platform Weibo. We still expect to learn all about the new handsets, including the specs of each individual phone, during the July 29 unveiling.",
    "Yu added that, as with previous Huawei P phones, photography is the main focus of the new line.",
    "The post reads, “The road forward has no end, this time we surpass ourselves in the field of imaging again. On July 29th, the #HuaweiP50 series will soon release a new mobile imaging technology pioneered in the industry, and the new era of mobile imaging will set sail, so stay tuned!”.",
    "Clearly the Huawei P50 isn't coming alone, hence the reference to a 'series'. We'd expect a P50 Pro and P50 Pro Plus, if 2020's range of devices is an example to follow, with maybe a Lite device as well.",
    "Huawei is evidently trying to make a comeback after restrictions placed by the US government affected the software and components the company could use. Earlier in 2021 it launched HarmonyOS, its brand-new Android-rivaling operating system, with a few devices running it. The P50 handsets will almost definitely be the first HarmonyOS smartphones.",
    "We don't know too many of the Huawei P50 specs or features just yet. However, rumors suggest that with this range, Huawei will introduce a 1-inch Sony sensor in the main camera that was recently seen on the Sharp Aquos R6 and Leitz Phone 1 from Leica.",
    "Powering the device could be a Huawei-made Kirin 9000 chipset, however, it could also have a modified Snapdragon 888 chipset according to some inside sources. That said, the Snapdragon chipset that could power the phone is expected to be a 4G-only one, since the US sanctions limit 5G component supplies to Huawei.",
    "For more information about the Huawei P50, we'll have to wait until launch - but since that's so near, we won't be waiting long. Stay tuned until July 29, and we'll bring you all the need-to-know information about the new phones."
  ],
  "headers": {
    "6": "What's next for Huawei?"
  },
  "links": {
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "Weibo": "https://m.weibo.cn/detail/4660601169646352#comment",
    "HarmonyOS": "https://www.techradar.com/news/harmonyos-2",
    "Sharp Aquos R6": "https://www.techradar.com/news/sharps-latest-flagship-phone-is-the-first-with-a-massive-1-inch-camera-sensor",
    "Leitz Phone 1": "https://www.techradar.com/news/the-leica-phone-is-real-but-its-a-rebadged-clone-with-a-ridiculous-lens-cap",
    "modified Snapdragon 888 chipset": "https://www.techradar.com/news/qualcomms-4g-only-snapdragon-888-could-be-coming-with-huawei-p50"
  }
}