{
  "source": "https://www.techradar.com/news/nvidia-rtx-3080-ti-might-have-been-delayed-again",
  "title": "Nvidia RTX 3080 Ti might have been delayed again",
  "category": "computing",
  "updated": "2021-03-24T17:04:57Z",
  "author": "carly-page",
  "summary": "Report claims the GPU won't be launching until mid-May",
  "article": [
    "Nvidia has reportedly delayed the launch of its rumored Nvidia RTX 3080 Ti until mid-May.",
    "Recent rumors suggested that Nvidia was preparing to launch the souped-up RTX 3080 in mid-April, but ITHome reports that the launch has been pushed back by a month. The company has reportedly put out an internal memo which confirmed that the RTX 3080 Ti will now be released “around mid-May”.",
    "This isn’t the first time the so-called RTX 3080 Ti has been delayed. The card, which was originally rumored to arrive as the RTX 3080 20GB, was reportedly scheduled to launch in December, but Nvidia is said to have pushed this back until January, and then again to February.",
    "Since, the SKU has received new specs and a memory downgrade to 12GB, and now looks set to land on in two months time, alongside the rumored Nvidia RTX 3070 Ti.",
    "As well as a memory downgrade, recent rumors suggest the Nvidia RTX 3080 Ti will ship with fewer CUDA cores than previously expected, with Nvidia planning to equip the GPU with 10,240 rather than the previously rumored 10,496.",
    "Speculation also suggests that Nvidia is planning to limit the crypto-mining capabilities of the incoming GPU to ensure it ends up in the hands of gamers.",
    "Nvidia will reportedly be implementing the same hash rate limiter that debuted with GeForce RTX 3060, which means the GPU’s firmware will be able to detect the kind of mathematical hashing operations used to mine Ethereum and throttle the graphic card's performance and cut the mining efficiency go the GPU in half.",
    "While it looks like the GPU will make its official debut in May, it remains to be seen how easy it'll be to get your hands on one. However, with recent reports suggesting GPU shortages could last until next year, it looks like buying any Ampere graphics card in the near future is likely to be a serious struggle."
  ],
  "headers": {},
  "links": {
    "Nvidia was preparing to launch the souped-up RTX 3080 in mid-April": "https://www.techradar.com/news/nvidia-rtx-3080-ti-gpu-could-go-on-sale-mid-april-aiming-to-combat-crypto-miners",
    "ITHome": "https://www.ithome.com/0/542/004.htm",
    "Nvidia RTX 3070 Ti": "https://www.techradar.com/news/the-nvidia-rtx-3070-ti-might-actually-release-after-cancellation-rumor",
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "mathematical hashing operations": "https://www.techradar.com/news/how-cryptomining-is-making-it-harder-to-find-the-graphics-cards-you-want",
    "with recent reports suggesting GPU shortages could last until next yea": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere"
  }
}