{
  "source": "https://www.techradar.com/news/xbox-series-s-price-pre-order-specs-live-now",
  "title": "Where to buy Xbox Series S: all the latest restock updates",
  "category": "gaming",
  "updated": "2021-07-14T10:54:08Z",
  "author": "vic-hood",
  "summary": "We're showing you exactly where to buy Xbox Series S",
  "article": [
    "Still searching where to buy Xbox Series S? Microsoft's cheaper next-gen console has been popping up at more retailers in recent months, with stock tending to stick around much longer than previously.",
    "We've mostly seen Xbox Series S bundles that include Xbox Game Pass Ultimate or an additional controller, but the console is starting to be sold on its own more frequently. The Xbox Series S is also being sold via Xbox All Access, Microsoft's payment plan offering which lets consumers pay in installments.",
    "If you're searching where to buy Xbox Series S in the US, we'd recommend checking in at Microsoft, Best Buy and Amazon for new Xbox Series S restocks. Meanwhile, UK shoppers should keep a close eye on Amazon, Very, Currys and Microsoft for more stock drops as well.",
    "We're rounding up everything you need to know about where to buy Xbox Series S right here, as well as going into more detail on exactly what you get for your cash in terms of specs and features. Keep checking the retailers below for the latest updates on Xbox Series S restocks and where to buy Xbox Series S.",
    "Find the latest information on where to buy Xbox Series X.",
    "US:",
    "UK:",
    "Xbox Series S costs $299.99 / £249.99 / AU$499. It's the cheaper, digital-only alternative to the Xbox Series X. Yes, Microsoft is releasing not one but two next-gen consoles this generation.",
    "It's worth noting, however, that the lower price tag is due to the Xbox Series S having less powerful specs, less storage and no 4K Blu-Ray drive. That means if you own many of the best Xbox One games on disc, you might want to consider an Xbox Series X.",
    "This disc-less, next-gen Xbox Series S specs are, however, substantially more powerful than the (now discontinued) Xbox One S All-Digital console.",
    "The Xbox Series S launched alongside the main Xbox Series X console on November 10, 2020. Pre-orders went live in September, 2020, and it's been difficult finding where to buy Xbox Series S ever since.",
    "The Xbox Series S price sits at $299.99 / £249.99 / AU$499, which was a little lower than many expected. It's less powerful than the Xbox Series X, but still capable of all the next-gen bells and whistles (resolution aside) that the larger console can deliver.",
    "If we compare it to the Xbox Series X's price of $499 / £499 / AU$749, the Xbox Series S undercuts it significantly by $200. In the US, the Xbox One S's RRP was $100 less than that of the Xbox One X at launch, while the Xbox One S All-Digital's launch RRP was $200 less than the Xbox One X's. The Xbox Series S is a tempting proposition for those looking to experience next-gen games without breaking the bank, then, so we're helping you find where to buy Xbox Series S.",
    "The Xbox Series S is also available on Microsoft's Xbox All Access subscription service in select regions, including the US, UK and Australia. Xbox All Access bundles together the console with Xbox Game Pass Ultimate on a 24-month plan (giving you access to the latter for the duration) at a price of $24.99 / £20.99 / AU$33 a month, with no upfront costs.",
    "Xbox All Access is offered through various different providers, depending on your region, so if you're in the UK or US you'll want to check the official Xbox site for more details. If you're in Australia, Xbox All Access is offered through Telstra, with pre-registrations open now.",
    "Microsoft highlights exactly what its cheaper Xbox can do in the console's official launch trailer, which you can watch below.",
    "The Xbox Series S is up to 60% smaller than the Xbox Series X, making it the smallest Xbox ever made. Games will target a resolution of 1440p instead of 4K on Xbox Series X, and will be capable of 120fps.",
    "There's also support for ray tracing, 4K media playback, 4K game upscaling, variable rate shading and variable refresh rates - same as on Xbox Series X. The console is all-digital, meaning there's no disc drive, and it has a custom NVME 512GB SSD.",
    "If you're worried about running out of disk space, Microsoft has also released a 1TB expansion card. An external hard drive can also be used to store Xbox One games and backwards-compatible titles, as well as Xbox Series S optimized games. However, you'll have to transfer them back to the internal drive if you want to play them.",
    "The Xbox Series S will also support Spatial Sound, including Dolby Atmos, and Dolby Vision via streaming media apps at launch. Dolby Vision support for gaming will also come first to next-gen Xbox consoles in 2021.",
    "The Xbox Series S will primarily act as a digital gateway for both Microsoft’s game-streaming service, Project xCloud, and its ever-growing Xbox Game Pass service (which now also includes EA Play for Xbox Game Pass Ultimate and Xbox Game Pass for PC subscribers).",
    "Xbox Cloud gaming aims to leverage Microsoft’s existing data centers across the globe, literally loading up servers with the component parts of multiple Xbox One consoles, and using these to run the games streamed directly to your mobile device of choice, thought it's only available on Android devices for now.",
    "This means that gamers will be able to play the likes of Halo Infinite, Forza and other classic console and PC big hitters on their phones, tablets or Windows 10 computers.",
    "Meanwhile, Xbox Game Pass is essentially a Netflix for games, allowing subscribers to access lots of Xbox games digitally. The service has grown massively since its launch in 2017, boasting over 10 million subscribers.",
    "Services such as Xbox Cloud gaming and Xbox Game Pass prove that physical discs aren't always necessary, with Microsoft offering plenty of content for those who choose to go digital-only. Xbox Series S will undoubtedly take this initiative into the next generation, proving that these services alone can support a next-gen console."
  ],
  "headers": {
    "5": "Where to buy Xbox Series S - quick links"
  },
  "links": {
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/deals/cheapest-xbox-game-pass-deals-prices",
    "where to buy Xbox Series X": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "best Xbox One games": "https://www.techradar.com/best/best-xbox-one-games",
    "Xbox One S All-Digital console": "https://www.techradar.com/reviews/xbox-one-s-all-digital-edition",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox One S All-Digital'": "https://www.techradar.com/reviews/xbox-one-s-all-digital-edition",
    "pre-registrations open now": "https://ad.doubleclick.net/ddm/trackclk/N7535.1470588TECHRADAR.COMAU/B24327516.281810965;dc_trk_aid=475791438;dc_trk_cid=115103549;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;gdpr=%24%7BGDPR%7D;gdpr_consent=%24%7BGDPR_CONSENT_755%7D?https://www.telstra.com.au/entertainment/gaming/xbox-all-access",
    "official launch trailer": "https://www.youtube.com/watch?v=KHLfCFMKxPg",
    "1TB expansion card": "https://www.techradar.com/news/seagate-reveals-how-its-xbox-series-x-expansion-card-boosts-storage-without-sacrificing-ssd-performance",
    "external hard drive": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Project xCloud": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "boasting over 10 million subscribers": "https://www.techradar.com/news/xbox-game-pass-hits-10-million-subscribers-leaving-ps-now-in-the-dust"
  }
}