{
  "source": "https://www.techradar.com/news/razers-project-hazel-has-us-genuinely-excited-to-wear-a-smart-face-mask",
  "title": "Razer's Project Hazel has us genuinely excited to wear a smart face mask",
  "category": "wearables",
  "updated": "2021-08-03T10:57:38.864Z",
  "author": "jess-weatherbed",
  "summary": "Practical techwear from CES 2021",
  "article": [
    "Never one to disappoint on crazy designs, Razer has revealed a seriously smart face mask at CES 2021. And with everything that's going on in the world, it might even be more appealing than its concept convertible gaming chair, 'Project Brooklyn'.",
    "While the aesthetics won't be a hit for everyone, before you make any rash judgments on this RGB-injected medical wear, you should know that every part of the design has an important part to play – even the funky lighting.",
    "The mask is a surgical N95-grade face-covering made from recycled materials, which falls in line with Razer's sustainability ethos (check out the collaboration between Razer and Conservation International for more info). To reduce waste created by disposable masks, Razer's mask uses replaceable and rechargeable disc-type ventilators. The carry case for the mask also acts as a charging box and has a disinfecting UV light that promises to kill off any bacteria.",
    "The RGB lighting on the mask will indicate low power levels or let you know when your filter need replacing, though you can turn off the lighting if you prefer. The mask is also waterproof, scratchproof, and face-fitting thanks to a silicone liner that forms a seal to prevent rogue airflow. The tight hugging fit will be a blessing to any glasses wearers out there, who may have been viewing the world through a fog for many months now, as it should prevent hot air from escaping upwards.",
    "The clear face-panel design was purposely included for better socialization and to help those who require lip reading for assisted communication. You don't have to raise your eyebrows to the old lady in the supermarket anymore to let her know you're smiling (even if she might be put off by the futuristic-looking mask itself). The mask also includes interior lights to softly illuminate your face during low lighting, so you can still wear the mask effectively outside of daylight hours. Razer is also currently patenting its 'Razer Voiceamp Technology', which prevents the tight seal of the mask from muffling your voice by using a built-in mic and amplifier to give your speech crystal clear clarity.",
    "While the design has working prototypes, Razer has made it clear that Project Hazel is a work in progress and will continue to be optimized with the help of community feedback. There isn't currently any mention of when we can expect to see the mask hitting shelves or an estimated retail price, but if feedback on social media is anything to go by, it could be a popular product.",
    "Razer dedicated a lot of manufacturing space in 2020 to help out during the pandemic, and donated one million disposable facemasks to front-line workers to combat shortages. It also released its own line of reusable cloth face masks. Razer's efforts to keep fans healthy and safe shouldn't come as a surprise, then, even if the cyberpunk-esque design has caused so much online chatter. Project Hazel is extremely identifiable as a Razer product and is sure to be a hit with fans of techwear and streetwear fashion. The design might not be to everyone's taste, but with such an uncertain future ahead of us, the concepts emerging for more sustainable medical-grade face masks may make the transition to a 'new normal' a little easier."
  ],
  "headers": {
    "4": "The world's smartest mask"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "gaming chair": "https://www.techradar.com/news/best-pc-gaming-chair-5-best-chairs-to-game-in-comfort",
    "Project Brooklyn": "https://www.techradar.com/news/razers-project-brooklyn-gaming-cockpit-makes-us-wish-ces-2021-was-in-person",
    "check out the collaboration between Razer and Conservation International for more info": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-2936298919112067600&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fcampaigns%2Fsneki-snek",
    "reusable cloth face masks": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-1119467581006115600&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fgear-accessories%2Frazer-cloth-mask%2FRC81-03680200-0000"
  }
}