{
  "source": "https://www.techradar.com/news/the-market-for-hacked-paypal-accounts-is-seriously-hot-right-now",
  "title": "Stolen PayPal accounts are seriously hot property right now",
  "category": "computing",
  "updated": "2021-09-08T20:28:59Z",
  "author": "sead-fadilpasic",
  "summary": "Price of PayPal accounts has increased almost three times since the pandemic",
  "article": [
    "The price of a stolen PayPal account rose significantly during the pandemic, while the cost of a stolen credit card decreased over the same time, new analysis has found.",
    "The findings from Comparitech examined multiple dark web marketplaces to study how the prices of stolen payment information changed over time, and found that right now, the cost of a stolen PayPal account is 9.2 cents per dollar in the account balance.",
    "The average price of a hacked PayPal account or balance transfer is now $197, the report states.",
    "For stolen credit cards, on the other hand, the price is about $0.0033 per dollar of credit limit, or $17.36 per card, on average. A cloned physical card would set a buyer back $0.0575 per dollar of credit limit, or $171, on average. Cloned cards are more expensive to buy because the seller needs physical equipment to create it, and needs to pay for its shipping, as well.",
    "Compared to similar research carried out by Comparitech eight months ago, the price of a stolen PayPal account is now 194% higher. At the same time, the price for a stolen credit card fell by 27%. Compared to pre-pandemic times, the cost of a stolen PayPal account rose by 297%.",
    "Of all the different types of cards, MasterCard accounts seem to be the most expensive, costing 6.47 cents per dollar of credit limit, followed by Discover with 6.27 cents per dollar. With 5.75 cents per dollar, Visa rounds off the top three, followed by American Express (5.13 cents per dollar).",
    "Similar to cards, PayPal accounts also have different tiers, such as Premier or Business, but these don’t affect the price, Comparitech said. Instead, the cost is governed mostly by account balance.",
    "Stolen PayPal accounts, the report concludes, are growing in popularity because unlike credit cards, they can be accessed from anywhere with a web browser, usually have existing balances, and are easy to use. Furthermore, it became a common form of payment, with many merchants accepting it.",
    "At the same time, credit cards have gotten more difficult to abuse, especially since Visa introduced its Verified By Visa service."
  ],
  "headers": {
    "5": "Account balance governs the price"
  },
  "links": {
    "credit card": "https://www.techradar.com/best/best-mobile-card-payment-reader"
  }
}