{
  "source": "https://www.techradar.com/news/christopher-nolans-upcoming-world-war-ii-movie-is-heading-to-universal",
  "title": "Christopher Nolan's upcoming World War II movie is heading to Universal",
  "category": "entertainment",
  "updated": "2021-09-15T09:53:37Z",
  "author": "axel-metz",
  "summary": "A done deal",
  "article": [
    "Universal Pictures has landed the rights to Christopher Nolan’s next movie, ending speculation that the acclaimed director’s forthcoming project may arrive on HBO Max.",
    "As first reported by Deadline, Nolan has left long-time collaborators Warner Bros. – the studio behind almost all his films since 2002’s Insomnia – in favor of guaranteeing an exclusive theatrical release for his upcoming movie, which is set to tell the story of atom bomb creator J. Robert Oppenheimer.",
    "Nolan was notoriously critical of WarnerMedia’s desire to see his last film, Tenet, released in theatres and on HBO Max simultaneously, even going as far as to describe the platform as “the worst streaming service” in December last year (per THR).",
    "As such, we knew a move away from the studio was coming – we just didn’t know where Nolan would decide to go.",
    "Deadline recently reported that the director had been shopping around multiple distributors in recent weeks, with Sony, Paramount and eventual deal-landers Universal among the bidding parties.",
    "The news also ends the albeit-loose speculation that Nolan may have partnered with Netflix on his upcoming movie. We knew the streamer wanted to handle the project, with its film chief, Scott Stuber, claiming he would do “everything [he] can” to work with Nolan “if and when he comes up with his new movie.”",
    "Given the director’s criticism of streamers, though, that collaboration always looked unlikely.",
    "Still, among the world’s largest movie studios, Sony Pictures is the only one without its own streaming service. Since Nolan has instead opted to partner with Universal, then, it’s safe to assume that the director has negotiated a clause that prevents his new distributor from planting his next movie on its sister streamer, Peacock – until it’s had a lengthy theatrical run, at least",
    "As for details on what that next movie is, there’s not much concrete information to go on beyond a loose premise and rumored star.",
    "Cillian Murphy, who collaborated with Nolan on two of The Dark Knight films, Inception as well as Dunkirk, is reportedly the front-runner for the role of atom bomb creator J. Robert Oppenheimer – though this hasn’t been confirmed as yet.",
    "As well as following the story of the infamous bomb’s creation, the movie will also reportedly track Oppenheimer’s later decision to call for more international control of nuclear weapons, as well as his eventual opposition to the development of the hydrogen bomb.",
    "We do know Universal will be financing the project to the tune of $100 million, which is significantly less than the figures demanded by the likes of Tenet, The Dark Knight and Interstellar – so perhaps we’re in for a more story-driven affair (à la The Prestige) this time around.",
    "Filming is set to begin in 2022, with a release date planned for either late 2023 or early 2024."
  ],
  "headers": {
    "8": "A creative bombshell"
  },
  "links": {
    "speculation": "https://www.techradar.com/news/christopher-nolans-next-movie-may-not-launch-on-hbo-max",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Deadline": "https://deadline.com/2021/09/christopher-nolan-universal-pictures-sets-next-film-j-robert-oppenheimer-development-atom-bomb-world-war-two-1234832975/",
    "THR": "https://www.hollywoodreporter.com/business/business-news/christopher-nolan-rips-hbo-max-as-worst-streaming-service-denounces-warner-bros-plan-4101408/",
    "reported": "https://deadline.com/2021/09/christopher-nolan-next-movie-development-of-atom-bomb-robert-oppenheimer-world-war-ii-1234829960/",
    "wanted to handle the project": "https://www.techradar.com/news/netflix-wants-christopher-nolans-next-movie-but-would-he-do-it"
  }
}