{
  "source": "https://www.techradar.com/news/audis-new-fully-electric-car-is-its-cheapest-yet",
  "title": "Audi's new fully electric car is its cheapest yet",
  "category": "car-tech",
  "updated": "2021-04-15T09:46:46Z",
  "author": "axel-metz",
  "summary": "Introducing the Audi Q4 e-tron electric SUV",
  "article": [
    "The all-electric Audi Q4 e-tron has been officially announced, the latest vehicle to join the firm's electric car fleet, alongside the e-tron and e-tron GT.",
    "The EV will arrive in two models, as a regular SUV and a Sportback version, and pack impressive power, range and charging specs to challenge the likes of the VW ID.4 and BMW iX.",
    "Audi claims the Q4 e-Tron can boast 80 miles of range after just 10 minutes of fast charging, which could see it become an attractive option to drivers looking for a future-facing EV that combines practicality and performance.",
    "The entry-level Q4 e-Tron features a 52kWh battery with a single motor and rear-wheel-drive, giving it a modest 168bhp and 216-mile range (similar to the xDrive40 variant of the BMW iX).",
    "As you'd expect, rising up the model variants sees those figures increase dramatically. The superior Quattro model boasts a 77kWh battery and a 295bhp motor, while the Q4 40 e-tron Sport lays claim to an impressive to 316 miles of range.",
    "This isn't an EV preoccupied with its internal specs, though, rather a car with the latest and greatest tech at the forefront of its interior and exterior design.",
    "Three-dimensional spoilers positioned ahead of its front wheels are designed to optimize airflow, adding, Audi says, almost nine miles to the car's range. Then there's the Matrix LED headlights, which allegedly utilize 16 individually triggered LEDs that allow the driver to switch between four different light signatures.",
    "Inside, an augmented reality HUD actively displays navigation directions in the driver's field of view – much like the latest Mercedes S-Class – and also creates visual markers to ensure distance is kept from the car in front when in adaptive cruise control.",
    "Like other larger Audi models, the 10.1-inch touchscreen utilizes haptic feedback, and the company says an 11.6-inch display will become available at a later date – which would mark the largest ever display in an Audi.",
    "The sound system in the Q4 e-Tron looks pretty good, too. For the first time, audio company Sonos will provide speakers exclusively to an Audi vehicle.",
    "Perhaps the most attractive feature of the new Audi Q4 e-Tron, though, is its price. The entry-level SUV model – available for UK order in April and worldwide later in the year – is expected to start at around £37,000 (about $57,000 / AU$65,000), making it Audi's cheapest EV yet.",
    "For a German-made SUV built with the future in mind, that's not a figure to scoff at – but it's certainly not a budget electric car, either."
  ],
  "headers": {
    "5": "It's what's on the inside that counts"
  },
  "links": {
    "e-tron": "https://www.techradar.com/news/audi-e-tron",
    "e-tron GT": "https://www.techradar.com/news/the-audi-e-tron-gt-is-the-most-powerful-audi-ev-to-date-and-its-a-beauty",
    "BMW iX": "https://www.techradar.com/news/all-electric-bmw-ix-has-the-range-to-worry-audi"
  }
}