{
  "source": "https://www.techradar.com/news/video/roku-deals-1315966",
  "title": "The best cheap Roku sales and deals for December 2021",
  "category": "audio-visual",
  "updated": "2021-12-01T11:19:29Z",
  "author": "tabitha-baker",
  "summary": "All of the best sales on Roku media streamers",
  "article": [
    "Roku sale prices are discounted regularly throughout the year as competition in the streaming stick world is seriously intense. Good thing you've landed here then, as we're here to tell you which Roku deals are best for your needs and where to find the hottest sales on them too.",
    "Roku's Streaming sticks and boxes plug into your TV via an HDMI port, essentially turning any old HD/4K TV into a smart TV or boosting the number of apps on any modern smart TV that seems to be missing a few of your favorites. In a video streaming device world dominated by Amazon, Google, and Apple, Roku is the plucky underdog that continues to hold its own.",
    "In addition to worldwide services like Netflix, Amazon, and Spotify, you'll find plenty of apps for your country. HBO Now, Hulu, Sling, and CBS All Access in the US and BBC iPlayer, All 4, and Now TV in the UK, for example. Frankly, Roku can't be beaten as far as the number and quality of streaming services it supports. And yes, there are options to view in 4K HDR too.",
    "There are a lot of Roku devices out there in the wild, though, and some of them have been discontinued as they've been made obsolete by newer releases. Some, however, have an advantage or feature that new sticks don't cater for, so we've kept price comparison charts around for those models.",
    "Generally, though, we've cut down the list to include the most relevant Roku streaming devices that are readily available and represent great value of money for you.",
    "The Roku Express 4K Plus was released in April of this year and allows you to stream your favorite content in 4K Ultra HD resolution with support for HDR10+. The affordable streaming stick includes a Roku voice remote so you can launch movies, search for titles and adjust the volume completely hands-free. The 4K streaming device launched in the US and UK with a starting price of $39.99/£39.99. Even though the Roku Express 4K is a new release, we've already seen slight discounts on the streaming device, and we're hoping to see a record-low price during the upcoming Black Friday 2021 sale.",
    "Roku continues to give rival streaming devices something to worry about as the new Roku Streaming Stick Plus is super modern, super small and, most importantly, super cheap. Not to mention, unlike many of the older models it's been released in the UK too. Now Brits can finally join the 4K Roku party like the US has been enjoying for years! You're even getting HDR content from supported apps too.",
    "While Amazon's 4K Fire TV Sticks are similarly priced and have a more intuitive remote design, plus Alexa support, you might find the wider range of streaming services on the Roku more appealing.",
    "This is the cheapest streaming device in the Roku family. The Roku Express is newer and cheaper than the other standard Roku Streaming Stick and does all the same jobs. If you want to turn any HDMI TV into a Smart TV for as little as possible - this is for you.",
    "However, we'd be tempted to keep an eye out for a good deal on the 4K version mentioned earlier just to avoid having to buy one once 4K content becomes the norm.",
    "This Roku was not released in the UK. So don't expect many (if any) UK prices. The Roku Ultra is the most feature-packed of all the Roku media streamers. It has all the quality 4K and HDR streaming and ports of the Roku Premiere Plus. So what do you get for the extra cash? The remote control gets the most attention on the Ultra as it can be used for voice search, it has extra buttons to make it a handy game controller and there's even a little speaker to help you find it via a button on the console. There's also a USB storage slot and an optical out audio port. We're loving the option for private listening via the bundled-in JBL headphones headphones that you can plug into the remote too.",
    "If you're not bothered about the extra audio ports, expandable storage and using the Roku for gaming, then you should opt for one of the Roku deals we mentioned earlier and save a big chunk of cash."
  ],
  "headers": {},
  "links": {
    "Roku Express 4K Plus": "https://www.techradar.com/reviews/roku-express-4k-2021",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}