{
  "source": "https://www.techradar.com/news/intel-core-i9-11900k-leak-suggests-a-record-breaking-cpu-that-could-be-trouble-for-amd",
  "title": "Intel Core i9-11900K leak suggests a record-breaking CPU that could be trouble for AMD",
  "category": "computing",
  "updated": "2021-02-08T10:18:38Z",
  "author": "darren-allan",
  "summary": "Fastest single-core result ever seen in Geekbench, assuming this leak is genuine",
  "article": [
    "Intel’s Core i9-11900K processor, supposedly the soon to be launched flagship of the next-gen Rocket Lake range, has been spotted again in an online benchmark which shows the CPU comfortably beating out AMD’s Ryzen chips in single-core performance – and doing well enough in multi-core, too.",
    "In the Geekbench result highlighted by VideoCardz (via Wccftech), Intel’s incoming 8-core flagship is shown with what is purportedly its final spec – a top boost clock of 5.3GHz (with Thermal Velocity Boost), and base clock of 3.5GHz (although the latter would be 200MHz slower than the 10900K).",
    "Testing the processor over a few runs in Geekbench, the highest score the 11900K achieved (in a Gigabyte Z490 Aorus Master motherboard with 32GB of 3600MHz RAM) was a towering 1,905 in single-core, with 10,994 hit in multi-core.",
    "That single-core result is the fastest ever seen in Geekbench, and 13% faster than the flagship Ryzen 9 5950X. Of course, the result is much more in favor of AMD’s processor when it comes to multi-core, as the Ryzen tips just over 14,000, so it’s around 27% faster. But then it bristles with 16-cores, compared to just 8-cores for the Rocket Lake flagship.",
    "Looking at its current 8-core rival, the 11900K is almost 15% faster than AMD’s 5800X, and for multi-core Intel’s chip is just over 5% swifter than the 5800X, going by the results picked out by Wccftech.",
    "Furthermore, the 11900K just edges out the current Comet Lake flagship 10900K in multi-core, but by less than 30 points, so it’s pretty much a dead heat here.",
    "Remember, though, that the 10900K has two more cores (it’s a 10-core flagship), and is running at the same boost clock, so theoretically this is an impressive result and architectural performance uplift for Rocket Lake. That said, there’s a slight caveat here in that it’s not clear whether overclocking might have been applied for the 11900K in these tests.",
    "Naturally, the 11900K blows away the 10900K in single-core, to the tune of 35% in fact.",
    "Of course, with the slight question marks around overclocking, we need to be careful here – and we should be cautious around leaked benchmarks anyway. Even if these are genuine results, there are limited conclusions that can be drawn around a single run of benchmarks of a pre-release chip.",
    "Other notable question marks that remain include the power consumption (and heat levels) of Rocket Lake chips, and the issue of pricing, as ever (though there has been a positive rumor on the latter front recently).",
    "At any rate, in terms of pure performance, other leaks have pointed to Intel’s Rocket Lake silicon making considerable progress, and this is more fuel to the fire that 11th-gen Core chips could keep Intel firmly in the desktop game – at least for the time being. Rocket Lake CPUs are expected to debut in March, according to the rumor mill.",
    "What will happen with 12th-gen Alder Lake processors – which take an entirely different approach in terms of a big.LITTLE design, ARM-style, and are expected to land later in 2021 – is another question."
  ],
  "headers": {
    "8": "Question marks"
  },
  "links": {
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "VideoCardz": "https://videocardz.com/newz/intel-core-i9-11900k-breaks-1-9k-points-barrier-in-geekbench-single-core-benchmark",
    "Wccftech": "https://wccftech.com/intel-core-i9-11900k-rocket-lake-cpu-flagship-geekbench-fastest-single-core-performance-ever-recorded/",
    "final spec": "https://www.techradar.com/news/rocket-lake-leak-reveals-final-specs-of-flagship-intel-core-i9-11900k-desktop-cpu",
    "Ryzen 9 5950X": "https://www.techradar.com/news/amd-ryzen-9-5950x-16-core-monster-could-be-the-first-ryzen-chip-to-hit-5ghz",
    "AMD’s 5800X": "https://www.techradar.com/reviews/amd-ryzen-7-5800x",
    "positive rumor on the latter front": "https://www.techradar.com/news/intel-rocket-lake-leak-suggests-core-i9-11900k-could-get-a-price-cut-to-compete-with-amd",
    "leaks": "https://www.techradar.com/news/intel-core-i9-11900k-cpu-leak-could-disappoint-those-hoping-for-faster-boost-speeds",
    "pointed": "https://www.techradar.com/news/intel-core-i9-11900k-leak-is-our-first-glimpse-of-rocket-lake-gaming-potential",
    "expected to debut in March": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "expected to land later in 2021": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september"
  }
}