{
  "source": "https://www.techradar.com/news/zack-snyders-army-of-the-dead-netflix-movie-gets-a-release-date",
  "title": "Zack Snyder’s Army of the Dead Netflix movie gets a release date",
  "category": "entertainment",
  "updated": "2021-02-22T14:15:42Z",
  "author": "tom-power",
  "summary": "And a trailer is coming this week",
  "article": [
    "Army of the Dead - Zack Snyder’s upcoming zombie heist movie - will arrive on Netflix on May 21.",
    "Taking to his personal Twitter account to reveal the movie’s release date, Snyder also confirmed that the first trailer would land on February 25. The announcement was accompanied by a teaser poster, which gives us a glimpse at the gory, Vegas-style undead action that we can expect to see later this year.",
    "Snyder’s latest Army of the Dead drop comes over a month after fans got a first look at the action-horror title. Back then, we were given a brief glimpse at the movie’s cast, but Thursday’s trailer will offer a prime introduction to the Justice League and Watchmen director’s forthcoming flick, which is his first for Netflix.",
    "Take a look at the poster below:",
    "Army of the Dead sees Snyder return to his horror roots after an almost two decade hiatus. The 2004 remake of Dawn of the Dead was the last time that Snyder directed a horror or zombie-oriented movie, and Army of the Dead sounds like it could be one of his most original and intriguing works yet.",
    "The movie stars Dave Bautista (Guardians of the Galaxy, Spectre) as Scott Ward, who leads a group of mercenaries into the heart of Las Vegas to pull off the greatest heist in world history. Unfortunately for the group, the so-called Entertainment Capital of the World is overrun with zombies. Venturing into the quarantined Nevada-based city to score a hefty payday, then, really will be a matter of life and death for the criminal gang.",
    "Bautista is joined by the likes of Ella Purnell (Miss Peregrine’s Home for Peculiar Children), Ana de la Reguera (The Book of Life), and Garret Dillahunt (Justified) in Army of the Dead. Snyder’s Stone Quarry production company has produced the horror-action flick, and the film will be followed by a prequel movie and an anime TV series called Army of the Dead: Lost Vegas."
  ],
  "headers": {
    "4": "What is Zack Snyder’s Army of the Dead?"
  },
  "links": {
    "first look": "https://www.techradar.com/news/netflix-reveals-first-look-at-one-of-its-biggest-new-movies-of-2021",
    "will be followed": "https://deadline.com/2020/09/zack-snyder-netflix-army-of-the-dead-movie-prequel-anime-series-1234569725/"
  }
}