{
  "source": "https://www.techradar.com/news/this-top-vpn-is-being-sued-by-filmmakers",
  "title": "This top VPN is being sued by filmmakers",
  "category": "computing",
  "updated": "2021-03-11T13:53:24Z",
  "author": "mayank-sharma",
  "summary": "Lawsuit seeks damages and ban on ports commonly used by torrents",
  "article": [
    "A group of movie producers have filed lawsuits against the owners of a VPN service alleging the service encourages its users to pirate movies.",
    "According to reports, the makers of popular films such as Hunter Killer, and Automata have dragged LiquidVPN's former and current owners to court accusing them of using the service to promote and facilitate piracy.",
    "While file hosting and sharing services are the usual targets of piracy lawsuits, this is the first instance of filmmakers going after a VPN itself.",
    "The plaintiffs include Voltage Pictures and Millennium Funding, who have pursued similar legal action against several piracy players in the past including apps such as Popcorn Time and Showbox, and sites such as YTS.",
    "It’s being reported that the group has now trained its weapons on an individual, David Cox, as well as his hosting company SMR Hosting, which allegedly operated LiquidVPN until early 2019. They've also filed another lawsuit against the current owners of the service, which is Puerto Rican company 1701 Management and its sole shareholder Charles Muszynsky.",
    "According to court documents, the filmmakers allege that “the LiquidVPN Defendants state their LiquidVPN service can be used to “Watch Popcorn Time without being detected by your ISP and P2P tracking software.”",
    "The complaint notes several other references of the service promoting copyright infringing activities. The plaintiffs appeal to the court to focus on this aspect of the service, over the fact that LiquidVPN itself doesn't host any copyrighted material.",
    "In addition to monetary damages, the producers want LiquidVPN to prevent users from accessing piracy-promoting websites and to block ports 6881-6889, which it claims are usually used for torrent traffic.",
    "Via: Techspot"
  ],
  "headers": {
    "3": "Thin end of the wedge"
  },
  "links": {
    "VPN service": "https://www.techradar.com/vpn/best-vpn",
    "LiquidVPN": "https://www.techradar.com/reviews/liquidvpn",
    "file hosting": "https://www.techradar.com/best/file-hosting-and-sharing-services",
    "Techspot": "https://www.techspot.com/news/88852-moviemakers-sue-vpn-service-promoting-facilitating-piracy.html"
  }
}