{
  "source": "https://www.techradar.com/news/the-kindle-paperwhite-gets-a-dollar35-price-cut-at-amazon-for-valentines-day",
  "title": "The Kindle Paperwhite gets a $35 price cut at Amazon for Valentine's Day",
  "category": "tablets",
  "updated": "2021-02-03T16:53:54Z",
  "author": "mackenzie-frazier",
  "summary": "Get the waterproof e-reader on sale for $94.99",
  "article": [
    "Just in time for Valentine's Day, Amazon's deal of the day includes a nice price cut on its best-selling e-reader. For a limited time, you can get the Kindle Paperwhite on sale for $94.99. That's a $35 discount and the best price we've found for the waterproof e-reader.",
    "The Kindle Paperwhite features a glare-free 6-inch display and twice the storage of the previous generation. The handheld e-reader is also thinner and lighter than previous models and has a battery that will last for weeks on a single charge. Perhaps the coolest feature of the all-new Paperwhite, though, is its IPX8 water resistance protection, so you can enjoy reading your Kindle at the beach, pool, or in the bath and not worry about it getting wet. While this isn't the lowest price we've found for the Kindle Paperwhite, it's the best deal you can find right now and only $10 more than the record-low Black Friday price. Valentine's Day is less than two weeks away, and the e-reader would make a great gift for your loved one or a nice treat for yourself.",
    "Not in the US? See the best Kindle sales in your region below.",
    "See more of the best cheap Amazon Kindle sales that are happening now and shop more offers with our roundup of the best Presidents' Day sales from Best Buy, Home Depot, and more."
  ],
  "headers": {
    "1": "Amazon Kindle Paperwhite deal"
  },
  "links": {
    "on sale for $94.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07CXG6C9W%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1950380253858688300-20",
    "Kindle Paperwhite": "https://www.techradar.com/reviews/amazon-kindle-paperwhite-2018-review",
    "best cheap Amazon Kindle sales": "https://www.techradar.com/news/portable-devices/portable-media/kindle-deals-1296345",
    "best Presidents' Day sales": "https://www.techradar.com/news/presidents-day-sales-deals-2021"
  }
}