{
  "source": "https://www.techradar.com/news/whatsapps-new-privacy-policy-requires-you-to-share-data-with-facebook",
  "title": "WhatsApp's new privacy policy requires you to share data with Facebook",
  "category": "phones",
  "updated": "2021-01-07T17:36:18Z",
  "author": "balakumar-k",
  "summary": "Comes into effect on February 8",
  "article": [
    "Millions of WhatsApp users have started receiving a notification from the popular messaging service platform WhatsApp asking them to either accept its new Terms of Service and Privacy Policy by February 8, or lose access to the app.",
    "The in-app notification from the Facebook-owned platform, sent both to Android and iOS users, mentions key updates, such as how the company processes user data, how businesses can use Facebook hosted services to store and manage their WhatsApp chats and how the company partners with Facebook to offer integrations across its products.",
    "WhatsApp’s new terms and its privacy policy will kick into effect on February 8, 2021. Users will need to accept these terms and changes in order to keep using their WhatsApp accounts after the deadline. Those who don't accept the new privacy policy will not be able to use the app anymore. Basically, WhatsApp has left users with no choice.",
    "One of the major changes included relates to its data collection, and it means you'll be sharing your data with Facebook.",
    "“When a user forwards media within a message, we store that media temporarily in encrypted form on our servers to aid in more efficient delivery of additional forwards,” WhatsApp said on its site.",
    "The new terms of service and privacy policy also makes sharing information with Facebook mandatory for WhatsApp users. Prior to the update, existing users were provided with the option to choose not to have their WhatsApp account information shared with Facebook.",
    "WhatsApp currently shares certain categories of information with Facebook Companies.",
    "“We may use the information we receive from them, and they may use the information we share with them, to help operate, provide, improve, understand, customize, support, and market our Services and their offerings, including the Facebook Company Products,” says WhatsApp.",
    "\"The information we share with the other Facebook Companies includes your account registration information (such as your phone number), transaction data, service-related information, information on how you interact with others (including businesses) when using our Services, mobile device information, your IP address, and may include other information identified in the Privacy Policy section entitled ‘Information We Collect’ or obtained upon notice to you or based on your consent,\" it adds.",
    "WhatsApp said it collects user information to be able to provide services and customize the experience for the user.",
    "The information that you share with WhatsApp that will be shared are your phone number, app logs, status messages, your profile name, your profile picture and your IP address.",
    "If you don't want to allow Facebook to do this, your only alternative is to switch to another messaging service such as Telegram or Signal."
  ],
  "headers": {
    "6": "You can't stop WhatsApp sharing info with Facebook"
  },
  "links": {
    "WhatsApp": "https://www.techradar.com/how-to/whatsapp-disappearing-messages-now-available-heres-how-to-use-it",
    "WhatsApp said on its site": "https://www.whatsapp.com/legal/updates/privacy-policy/?lang=en"
  }
}