{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-could-feature-the-snapdragon-898-in-these-parts-of-the-world",
  "title": "Samsung Galaxy S22 could feature the Snapdragon 898 in these parts of the world",
  "category": "phones",
  "updated": "2021-09-06T13:17:12Z",
  "author": "david-nield",
  "summary": "Which one are you getting?",
  "article": [
    "Leaks about the Samsung Galaxy S22 continue to drip in, although we're not expecting to see the phone officially unveiled until January – and the latest rumor to arrive concerns the processor that's going to be packed into the flagship phone when it appears.",
    "The Galaxy S phones, including the Galaxy S21, have traditionally been released in two versions depending on the market: one with an Exynos chipset made by Samsung itself, and one with a Snapdragon chipset manufactured by Qualcomm. Next year it looks as though the latter will be much more common outside of Europe.",
    "Well-known tipster FrontTron has revealed that the Snapdragon 898 will power the Galaxy S22 phones just about everywhere outside of Europe. In the past, the Snapdragon version of these flagship Samsung phones has mostly been restricted to the US.",
    "South Korea, Hong Kong, India and other southeast Asian countries are \"highly likely\" to get the Snapdragon 898 chipset, according to the leak. The United States is tipped to get the Snapdragon version too, as normal, though the word is that US carrier Verizon wants a deal to stock the Exynos variant.",
    "Meanwhile, Europe and South America are almost certain to be given the Samsung Galaxy S22 with the Exynos 2200 processor inside it. That said, FrontTron also mentions that a final decision has yet to be taken, so it sounds as though there might be changes between now and launch day.",
    "From what we've heard so far, the Galaxy S22 isn't going to be a huge leap forward from what we saw with the Galaxy S21. We're expecting a few tweaks to the cameras, similar kinds of RAM and storage configurations, and maybe even a reduction in battery capacity (if not battery life).",
    "The rumors of Snapdragon 898 and Exynos 2200 availability shared in this leak match up almost identically with previous information from another source, which lends some extra credibility to it – even if neither chipset has been officially announced yet.",
    "The next question is how these two configurations might affect Galaxy S22 performance. The good news is that in most previous Galaxy S series phones, the processor choice hasn't hugely affected the speed or capability of the handsets, so to some extent it doesn't matter which version you get hold of.",
    "In the case of the Galaxy S21, the Galaxy S21 Plus and the Galaxy S21 Ultra, the Snapdragon 888 and Exynos 2100 chipsets were both built using a 5nm manufacturing process and featured octa-core CPUs. The Snapdragon 888 is largely considered to have the edge, but the differences are mostly negligible.",
    "We'll have to wait and see on the performance levels of the Snapdragon 898 and Exynos 2200 of course – but Samsung will know how important it is that all variants of the Galaxy S22 offer the same top-level power, and will be working hard behind the scenes to make sure that's the case.",
    "Via Notebookcheck"
  ],
  "headers": {
    "3": "Around the world",
    "6": "Analysis: waiting on processor performance"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "until January": "https://www.techradar.com/news/the-samsung-galaxy-s22-could-arrive-in-january-2022-according-to-a-new-leak",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "FrontTron": "https://twitter.com/FrontTron/status/1434484803626102785",
    "isn't going to be": "https://www.techradar.com/news/samsung-galaxy-s22-sounds-a-lot-like-the-galaxy-s21-in-latest-leak",
    "tweaks to the cameras": "https://www.techradar.com/news/samsung-galaxy-s22-camera-leak-points-to-a-fascinating-change-from-the-s21",
    "RAM and storage configurations": "https://www.techradar.com/news/samsung-galaxy-s22-specs-leak-is-bad-for-samsung-but-good-for-buyers",
    "reduction in battery capacity": "https://www.techradar.com/news/samsung-galaxy-s22-leak-reveals-new-plus-and-ultra-battery-capacities",
    "previous information": "https://www.techradar.com/news/samsung-galaxy-s22-specs-leak-is-bad-for-samsung-but-good-for-buyers",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Notebookcheck": "https://www.notebookcheck.net/Galaxy-S22-Samsung-to-use-the-Snapdragon-898-in-most-markets-outside-Europe.558882.0.html"
  }
}