{
  "source": "https://www.techradar.com/news/shang-chi-is-getting-a-sequel-and-a-comedy-spinoff-show",
  "title": "Shang-Chi is getting a sequel – and a comedy spinoff show",
  "category": "entertainment",
  "updated": "2021-12-07T09:43:55Z",
  "author": "tom-power",
  "summary": "More Shang-Chi projects make us very happy",
  "article": [
    "Shang-Chi and the Legend of the Ten Rings is getting a sequel and a Disney Plus comedy spinoff show, according to various reports.",
    "Following the Marvel movie's successful stint at the box office, Deadline reports that Shang-Chi director Daniel Destin Cretton has penned a multi-year deal with Marvel Studios to create new projects centered around the Asian-American superhero. Cretton's deal will also see him develop TV projects for Hulu under the company's Onyx Collective brand.",
    "Shang-Chi's ending and post-credits scenes heavily hinted that the character's MCU journey was far from over, so it's unsurprising to learn that Shang-Chi 2 is in the works.",
    "What is more intriguing, though, is the prospect of a spinoff TV series alongside the mainline films.",
    "According to Variety, sources claim that Cretton is developing an MCU comedy show for Disney Plus. It's unclear if this project will be an offshoot of Shang-Chi, which Cretton directed. But, given his familiarity with this part of the MCU, and the fact that Shang-Chi is one of the funniest Marvel films in recent memory, it wouldn't be a surprise to learn if Cretton's Disney Plus series is based on the film's supporting cast.",
    "Per Deadline, Cretton is set to write and direct Shang-Chi's next big-screen adventure. With the Marvel Phase 4 superhero flick earning over $430m worldwide since its September 3 release, it isn't a shock to learn that the No Mercy director will be back in hot seat for the character's follow-up film.",
    "In a statement about the announcement, Cretton said: \"Working on Shang-Chi with Kevin [Feige] and the Marvel Studios team was one of the highlights of my life, and I couldn’t be more excited about Tara [Duncan]’s vision for Onyx Collective. I can’t wait to explore new stories and build new worlds with this community.\"",
    "Spoilers follow for Shang-Chi and the Legend of the Ten Rings.",
    "There are two main options for a Shang-Chi comedy spinoff series.",
    "First, we could see a humorous TV show that's based on the Ten Rings organization. As one of the film's post-credits scenes revealed, Shang-Chi's sister Xialing (Meng'er Zhang) has taken control of the Ten Rings following their father's death. Razor Fist (Florian Munteanu) is now her right-hand man, Xialing's forces are now training men and women as fighters, and her father's old palace has been given a makeover with graffiti adorning the walls.",
    "A stinger that read \"The Ten Rings will return\" following this scene confirmed that we'd see them again in the future. And, despite Cretton exclusively telling TechRadar that plans for a potential Ten Rings Disney Plus show were up in the air – shortly before the film's release – it appears that we could be getting a Ten Rings spinoff after all.",
    "Zhang and Munteanu have already showcased their comedy skills as part of Shang-Chi and the Legend of the Ten Rings, so it wouldn't be a stretch for them to lead a humor-led Disney Plus series. Throw in cameo appearances from the likes of Sir Ben Kingsley's Trevor Slattery, too, and a Ten Rings comedy series would have the makings of an Office-esque project.",
    "Alternatively, we could see a Shang-Chi spinoff show that focuses on Awkwafina's Katy.",
    "As someone with plenty of experience in comedic roles, Awkwafina would be a great fit for a Disney Plus comedy series. We could see what she gets up to when she's not hanging out with Shang-Chi: that is, if she has any hobbies outside of drunken karaoke sessions. Or the series could put her in unusual situations where she needs to use magical MCU items to save the day. She's already saved the world once alongside Shang-Chi, Xialing and company, so it wouldn't be a stretch to put her in similar but smaller-scale scenarios.",
    "Either way, a Shang-Chi comedy spinoff sounds like the perfect addition to Marvel's growing slate of Disney Plus TV shows. Hopefully, it won't be too long until we find out more about this this potential spinoff."
  ],
  "headers": {
    "7": "Analysis: What will Shang-Chi's comedy show be about?"
  },
  "links": {
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Marvel movie": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Deadline": "https://deadline.com/2021/12/destin-daniel-cretton-marvel-hulu-onyx-collective-deal-shang-chi-sequel-1234885502/",
    "Hulu": "https://www.techradar.com/news/hulu-how-to-sign-up-app-devices-shows-live-tv-explained",
    "Shang-Chi's ending and post-credits scenes": "https://www.techradar.com/news/shang-chi-ending-and-post-credits-scenes-explained",
    "Variety": "https://variety.com/2021/film/news/shang-chi-sequel-marvel-1235127253/",
    "Marvel Phase 4": "https://www.techradar.com/news/marvel-phase-4",
    "exclusively telling TechRadar": "https://www.techradar.com/news/inside-shang-chi-the-mcu-movie-thats-as-culturally-important-as-black-panther",
    "Disney Plus TV shows": "https://www.techradar.com/news/agatha-harkness-spin-off-leads-new-slate-of-marvel-disney-plus-shows"
  }
}