{
  "source": "https://www.techradar.com/news/google-will-soon-make-two-factor-authentication-mandatory",
  "title": "Google will soon make two-factor authentication mandatory",
  "category": "computing",
  "updated": "2021-05-06T21:00:05Z",
  "author": "anthony-spadafora",
  "summary": "Search giant plans to automatically enroll users in two-step verification",
  "article": [
    "In order to commemorate this year's World Password Day, Google has announced that it will soon start automatically requiring two-factor authentication (2FA) for user accounts.",
    "According to a new blog post from the search giant, passwords are the single biggest threat to your online security as they are easy to steal, hard to remember and managing them can be tedious. While many users try to come up with long and complicated passwords, this can also put their security at risk as they are more likely to reuse the same password across multiple online accounts. If one account is compromised, all of their accounts are then vulnerable.",
    "This is why many users have begun to rely on password generators to create strong, complex passwords and password managers to store them securely online. Most modern browsers, including Google Chrome, have password managers built in but if you're looking for additional security, you can always sign up for a paid service such as LastPass.",
    "Google's password manager is entirely free to use and one of the best things about it is the fact that its integrated into the company's single-click Security Checkup which can tell you if any of your passwords have been compromised or involved in a data breach.",
    "One of the best ways to protect your online accounts is to have a second form of verification in place as this allows them to confirm that it is really you trying to log in.",
    "Google has been doing this for years by asking users to enroll in two-step verification (2SV) to confirm it's really them by tapping on a prompt on their smartphone whenever they sign in. However, soon the company will begin automatically enrolling users in 2SV if their accounts are properly configured.",
    "At the same time though, Google is also building advanced security technologies into devices to make its multi-factor authentication seamless and even more secure than a password. For instance, the company has build security keys directly into Android devices and brought its Google Smart Lock app to iOS to allow users to use their phones as a secondary form of authentication.",
    "Director of product management, identity and user security at Google, Mark Risher explained in a blog post that until we move to a passwordless future, the company will continue its work to keep its users' passwords safe, saying:",
    "“One day, we hope stolen passwords will be a thing of the past, because passwords will be a thing of the past, but until then Google will continue to keep you and your passwords safe.”"
  ],
  "headers": {
    "4": "Two-step verification"
  },
  "links": {
    "World Password Day": "https://www.techradar.com/news/happy-world-password-day-our-roundup-of-password-managers",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "reuse the same password": "https://www.techradar.com/news/millions-of-microsoft-users-are-reusing-passwords",
    "password generators": "https://www.techradar.com/best/password-generator",
    "password managers": "https://www.techradar.com/best/password-manager",
    "browsers": "https://www.techradar.com/best/browser",
    "LastPass": "https://www.techradar.com/reviews/lastpass/reviews/lastpass",
    "Security Checkup": "https://www.techradar.com/news/chrome-can-now-check-the-security-of-your-passwords-heres-how",
    "2SV": "https://www.techradar.com/news/two-factor-authentication-vs-two-step-verification-youve-probably-missed-this-tiny-difference",
    "security keys": "https://www.techradar.com/best/best-security-key",
    "blog post": "https://blog.google/technology/safety-security/a-simpler-and-safer-future-without-passwords/",
    "passwordless future": "https://www.techradar.com/news/using-identity-to-forge-a-new-passwordless-future"
  }
}