{
  "source": "https://www.techradar.com/news/cheal-black-friday-laptop-deals-are-live-get-an-hp-laptop-for-just-dollar279-at-walmart",
  "title": "Cheap Black Friday laptop deals are live: get an HP laptop for just $279 at Walmart",
  "category": "computing",
  "updated": "2021-11-10T23:55:24Z",
  "author": "john-loeffler",
  "summary": "Don't miss these early Black Friday laptop deals at Walmart",
  "article": [
    "Early Black Friday deals continue to roll out ahead of the big day, and Walmart just dropped some incredible Black Friday laptop deals, including shockingly low prices on two 15.6-inch HP laptops.",
    "First, there's this 15.6-inch HP Windows 10 S-mode laptop for just $279, a $120 savings from its original $399 retail price.",
    "If you want something a bit more powerful, there is also this 15.6-inch HP Windows 11 laptop for just $379, which is one of the best laptops we've seen for less than $400.",
    "(Not in the US? Scroll down for deals in your region).",
    "First up, unlike a lot of sub-$300 laptops, this HP Windows 10 S-Mode laptop comes with genuinely decent hardware, like an Intel Core i3 processor, 8GB RAM, and a 256GB SSD. It is also upgradable to Windows 11 S-Mode for free.",
    "While this definitely isn't the most powerful laptop on the market right now, it's more than powerful enough to handle most people's general computing needs like web browsing, video streaming, and light productivity work.",
    "It also has some of the best hardware we've seen on a Windows 10 S-mode laptop in a while, so if you're fine with restricting yourself to software available on the Windows Store, this is definitely one of the best Black Friday laptop deals you're going to find.",
    "If you want something more powerful, or want a full-fledged Windows 11 OS, then this HP Windows 11 laptop is definitely worth taking a look at. Featuring an Intel Core i5-1135G7 with Iris Xe graphics, a full HD 15.6-inch display, 8GB RAM, and a 256GB M.2 NVMe SSD, this is one of the best-specced laptops we've seen for less than $400.",
    "Neither of these HP laptops will be the most powerful laptop out there, for sure, but they offer more versatility than similarly specced and priced Chromebooks, which feature the Chrome OS operating system.",
    "While we happen to love Chrome OS and we're big boosters of Chromebooks generally, there are some things that you simply need a Windows laptop for, and you won't find much better than these Black Friday laptops deals from Walmart.",
    "No matter where you live, you'll find all the lowest prices for laptops from HP, Dell, and other major laptop makers around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Black Friday laptop deals",
    "10": "More Black Friday laptop deals",
    "11": "More Black Friday deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "15.6-inch HP Windows 10 S-mode laptop for just $279": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-7818118012412876000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FHP-15-I3-SILVER-AE%2F416132914",
    "15.6-inch HP Windows 11 laptop for just $379": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-1455414662208912600&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FHP-15-I5-SILVER-AE%2F348196199",
    "this HP Windows 10 S-Mode laptop": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-9739093367761967000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FHP-15-I3-SILVER-AE%2F416132914",
    "Black Friday laptop deals": "https://www.techradar.com/black-friday/black-friday-laptop-deals",
    "this HP Windows 11 laptop": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-5452409157830090000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FHP-15-I5-SILVER-AE%2F348196199"
  }
}