{
  "source": "https://www.techradar.com/news/how-to-watch-nomadland-online-stream-the-new-frances-mcdormand-movie-on-hulu-today",
  "title": "How to watch Nomadland online: stream the award-winning movie on Hulu today",
  "category": "computing",
  "updated": "2021-04-29T02:00:43Z",
  "author": "daniel-pateman",
  "summary": "Streaming service exclusive a big favorite for Oscars",
  "article": [
    "What do you get when you combine Frances McDormand, acclaimed auteur Chloé Zhao, and the Oscar-nominated producer of Call Me By Your Name, Peter Spears? Awards dynamite, that’s what!",
    "We detail here how to watch Nomadland online with a Hulu subscription, so you can finally catch the explosively understated drama that made the critics swoon in 2020 and emerged as one of the big winners at the Golden Globes.",
    "Based on Jessica Bruder’s non-fiction book Nomadland: Surviving America in the Twenty-First Century, the movie finds middle-aged Fern (McDormand) unemployed after the economic collapse of her Nevada home town.",
    "With few prospects, she sells all her belongings and drives off across America, seeking a greater sense of peace in the nomadic lifestyle. Along the way she falls in with a group of fellow wanderers: experiencing hardship and grief, joy and freedom, against the majestic backdrop of the American West.",
    "This skeletal story might sound trite, but it powerfully resonates. McDormand is profoundly engaging as an actress, and as Fern, a woman worn down by life’s tough realities, she’s quietly devastating. Meanwhile, writer-director Zhao – who stunned critics with 2017’s The Rider – brings an understated, earthy, documentary sensibility to Nomadland, which helps to render the reality of life on society's periphery.",
    "Judging by its amazing awards tally, it’s a film that has to be seen and one of the early Oscars 2021 favorites. It’s the first ever to win both the Golden Lion at Venice Film Festival and TIFF’s People’s Choice Award, while the Golden Globes saw it take home Best Film and Zhao win Best Director. So, prepare to be floored by a modern masterpiece as we detail how you can watch Nomadland online, and exclusively on Hulu.",
    "And if it's sports and entertainment you’re after, minus the high price tag, you’re in luck if you're in the US. Hulu lets you bundle together three OD platforms – ESPN, Disney +, and Hulu – for the ridiculously low fee of $12.99 a month. That combo guarantees something to suit every mood: live sports events, The Simpsons, movies, documentaries, and binge-worthy TV.",
    "More on Hulu:"
  ],
  "headers": {
    "6": "How to save money on Hulu"
  },
  "links": {
    "Oscars 2021": "https://www.techradar.com/news/when-are-the-oscars-2021-watch-online",
    "ESPN, Disney +, and Hulu": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-7471965030914337000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle"
  }
}