{
  "source": "https://www.techradar.com/news/iphone-13-successors-could-tell-you-when-its-screen-is-cracked-and-broken",
  "title": "iPhone 13 successors could tell you when its screen is cracked and broken",
  "category": "phones",
  "updated": "2021-08-10T22:44:53Z",
  "author": "david-lumb",
  "summary": "What if your iPhone could warn you of small screen cracks before they got bigger?",
  "article": [
    "What if Apple phones coming after the iPhone 13 could tell you when your display has been damaged or cracked?",
    "A newly-published Apple patent reveals the company has explored advanced displays that can detect damage in the screen via a ‘strain sensing resistor’ that gathers strain measurements. Presumably, this would enable the phone to find cracks that are too small to notice and alert users of the damage before it gets worse and potentially harms them or the phone’s delicate internals.",
    "The patent doesn’t just cover static displays but also includes ‘flexible displays’ as well, potentially including a folding Apple phone like the rumored iPhone Flip, as AppleInsider pointed out. It’s still unclear what kind of display Apple would use in its own foldable, but given prior devices in the niche like the original Samsung Galaxy Fold have had more scratch-prone screens than handsets with glass displays, in-screen damage detection could be helpful. We know Apple is concerned – a previous patent conceptualized a crack-preventing layer for foldable phone displays.",
    "While future flat and folding iPhones may be best suited for crack-detecting screen tech given how often users damage phone displays, the patent doesn’t limit its tech to just handsets. Indeed, it openly lists different product categories that such display tech could feature in, like computers and wristwatch devices.",
    "In other words, we could see everything from MacBook Pros to iMacs to Apple Watches to iPads pack displays that automatically detect cracks – which would be universally helpful. There’s no reason for Apple not to include it.",
    "That presupposes a lot about the detection technology, though – we have no idea whether it would be just as feasible to implement in a large 27-inch iMac screen as it would in the latest iPhones, which max out at a 6.7-inch display. It would make sense to deploy it first in Apple phones and then roll it out to its broader lineup.",
    "Lastly, it would just be cool for Apple to one-up its rivals in the display arena given how it typically lags behind in mobile screen tech – we only just got OLED displays in last year’s iPhone 12 range, which is years after Samsung and other Android phonemakers added them to their premium handsets.",
    "We wouldn’t expect Apple to roll out crack detection anytime soon, especially since this is the first we’re hearing about it. Currently, the company is slowly upgrading its devices’ displays to mini-LED like in the 12.9-inch iPad Pro 2021 (and, rumor has it, the MacBook Pro 2021 laptops), so crack detection could be the screen tech that comes after as the next must-have advancement in Apple’s lineup."
  ],
  "headers": {},
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "patent": "https://www.techradar.com/news/iphone-13-could-be-a-foldable-phone-thats-built-to-last",
    "iPhone Flip": "https://www.techradar.com/news/foldable-iphone",
    "AppleInsider": "https://appleinsider.com/articles/21/08/10/future-iphones-could-automatically-warn-users-of-display-cracks-and-damage",
    "12.9-inch iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "rumor": "https://www.techradar.com/news/macbook-pro-2021-models-could-get-stunning-mini-led-screens"
  }
}