{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-classic-has-a-watch-face-that-looks-like-a-monkeys-bum",
  "title": "Samsung Galaxy Watch 4 Classic has a watch face that looks like a monkey's bum",
  "category": "wearables",
  "updated": "2021-08-28T08:23:13Z",
  "author": "tom-bedford",
  "summary": "A bit of a gorillass",
  "article": [
    "I've just started testing the Samsung Galaxy Watch 4's Classic version, and when I was scrolling through the watch faces list to pick one, the clock you can see in the picture above caught my eye.",
    "Yep. It looks like the clock face is sticking out of the monkey's bum. While the picture actually shows the monkey from the side, at a glance it's not clear if the two closer legs are the chimp's right ones, or rear ones - maybe the ape is faced away from us and looking over its shoulder.",
    "As soon as I saw the monkey-bum-watch-face, I couldn't unsee the monkey-bum-watch-face. I did a studious survey of everyone in the TechRadar offices, and the consensus was 'yes, that's a monkey-bum-watch-face'.",
    "I don't mind the Samsung Galaxy Watch 4's monkey-bum-watch-face. In fact, I've become somewhat fascinated with the monkey-bum-watch-face. This chimp seems so brazen, so happy, to shake its baboonty like that - even though they clearly misunderstood what a 'howler monkey' is.",
    "You can change the animal by tapping on the watch, to show a rabbit or cat or sheep, but none of them line up with the watch face to have a clock on their rear. No, I'll stick with the little marm-arse-et.",
    "Something I've been told by many graphic designers and artist friends and acquaintances is that when you're designing or drawing something simple, you have to really scrutinize it afterwards. You need to think like the filthiest-minded viewer possible, to see if the graphic could be misconstrued for something else.",
    "In this case, an artist at Samsung HQ probably needed to ask themselves \"does it look like the clock is sticking out of the monkey's bum?\", and put themselves in the shoes of childish journalists. Maybe they could have reworked the little ca-poo-chin slightly so it was clear from one look that it was side-on.",
    "Alternatively, it's very possible the designer just drew the (admittedly very lovely) monkey without having the clock hands to lay over it, so didn't find out about the monkey-bum-watch-face coincidence.",
    "This isn't a problem, really, and there must be some people reading this article who don't see it. But I've shown the icon to enough people who did see the monkey bum to know that I'm not alone.",
    "Oh, and if you've been enjoying these monkey puns, for the record I know that 'titi' and 'macaque' are species too, but they just felt too easy. I may see monkey bums on my watch, but I'm not that childish."
  ],
  "headers": {
    "5": "Anal-ysis: double check your graphics"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review"
  }
}