{
  "source": "https://www.techradar.com/news/logitech-scribe-wants-to-make-hybrid-meetings-a-lot-more-collaborative",
  "title": "Logitech Scribe wants to make hybrid meetings a lot more collaborative",
  "category": "computing",
  "updated": "2021-05-19T10:03:27Z",
  "author": "sead-fadilpasic",
  "summary": "New Logitech tool looks to bring whiteboards into the digital realm",
  "article": [
    "Logitech has released a new platform that aims to improve education and online collaboration experiences for remote workers and students.",
    "Logitech Scribe is mounted above a whiteboard or other dry erase surface and allows remote participants to get a clear, digitalized version of the whiteboard content, directly on their screens. It can capture surfaces up to six by four feet.",
    "The tool is AI-powered, Logitech claims, enabling it to digitally remove the presenter from in front of the whiteboard. That way, all participants get a “front-row seat”.",
    "Besides digitally tracking markers, Scribe can also enhance their colors, as well as track various Post-it stickers that get glued onto the whiteboard.",
    "It’s compatible with all major communications platforms, including Microsoft Teams and Zoom, and plays well with Microsoft Teams Rooms and Zoom Rooms.",
    "To start sharing whiteboard content into video meetings, in-room participants need only press the wireless button that’s included with Scribe, or tap the meeting room touch controller. The wireless button currently works with Zoom Rooms, and support for Teams Rooms will come later this year, Logitech explained.",
    "Scribe also works as a USB content camera with “virtually any video conferencing application”. The device is now available in select markets with MSRP starting at $1,199.",
    "“Logitech Scribe works because it takes advantage of what people already know how to do: pick up a marker and draw on a whiteboard,” commented Scott Wharton, general manager and vice president, Logitech Video Collaboration.",
    "“Now, we’re able to elevate non-digital collaborative content for everyone to see in high fidelity while being extremely easy to use and share, thanks to its compatibility with today's most popular cloud services like Teams and Zoom.”",
    "Logitech promises a device with a clean design and “thoughtful” cable management, saying it will “elegantly” blend into any modern office or classroom."
  ],
  "headers": {
    "6": "Whiteboard beater"
  },
  "links": {
    "education": "https://www.techradar.com/best/best-online-learning-platforms",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Zoom": "https://www.techradar.com/reviews/zoom"
  }
}