{
  "source": "https://www.techradar.com/news/microsoft-edge-now-has-a-secret-super-duper-secure-mode",
  "title": "Microsoft Edge now has a secret ‘Super Duper Secure Mode’",
  "category": "computing",
  "updated": "2021-11-24T14:32:04Z",
  "author": "joel-khalili",
  "summary": "New maximum security mode comes to Microsoft Edge",
  "article": [
    "Microsoft has quietly rolled out a new mode for its web browser Edge that offers users an even greater level of security, in exchange for some loss of functionality.",
    "First teased in the summer, Super Duper Secure Mode is now available to anyone running the latest stable Microsoft Edge build (v. 96.0.1054.29).",
    "There are two separate configurations - Balanced and Strict - which determine the level of additional protection the user receives.",
    "The largest difference is that Balanced mode learns which sites the user frequents and loosens restrictions on these domains, whereas Strict mode applies restrictions across all websites, which may mean some elements no longer work as intended.",
    "Users can also create exceptions manually for websites they would like to be exempt from the extra security measures.",
    "The main way in which Super Duper Secure Mode shields users from attack is by disabling a browser technology known as the Just in Time Engine (JIT), the role of which is to accelerate JavaScript tasks.",
    "According to Johnathan Norman, Microsoft Edge Vulnerability Research Lead, almost half of all security issues that affect the V8 JavaScript engine are caused by JIT. So by disabling JIT, Microsoft is able to reduce the level of threat dramatically, in one fell swoop.",
    "When active, Super Duper Secure Mode also enables control-flow enforcement technology (CET), a hardware-based exploit mitigation from Intel, and arbitrary code guard (ACG). Both security features were previously set to off by default, for performance-related reasons.",
    "“Performance and complexity often come at a cost, and often we bear this cost in the form of security bugs and subsequent patches,” wrote Norman when the new mode was first announced.",
    "“This reduction in attack surface kills half of the bugs we see in exploits and every remaining bug becomes more difficult to exploit. To put it another way, we lower costs for users but increase costs for attackers.”",
    "Super Duper Secure Mode can be switched on at the foot of the Privacy tab in the Edge settings menu."
  ],
  "headers": {
    "5": "Microsoft Edge security"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "teased": "https://www.techradar.com/news/microsoft-edge-is-getting-a-super-duper-secure-mode",
    "now available": "https://twitter.com/spoofyroot/status/1462871833942773763",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "domains": "https://www.techradar.com/news/best-domain-registrars",
    "JavaScript": "https://www.techradar.com/best/best-online-courses-to-learn-javascript",
    "wrote": "https://microsoftedge.github.io/edgevr/posts/Super-Duper-Secure-Mode/"
  }
}