{
  "source": "https://www.techradar.com/news/ios-15-tweaks-may-have-just-been-hinted-at-by-apple-itself",
  "title": "iOS 15 tweaks may have just been hinted at by Apple itself",
  "category": "phones",
  "updated": "2021-05-21T05:45:00Z",
  "author": "daryl-baxter",
  "summary": "A refined UI may be on the cards",
  "article": [
    "Earlier this week, Apple announced a multitude of accessibility features including being able to clench your fist in order to answer a call with your Apple Watch.",
    "Looking into the screenshots on the press release, the user interface of the iPhone looked amiss, which makes us wonder if these features are coming to iOS 15 instead.",
    "It’s rare for Apple to announce features without naming which version of the operating system it’s arriving on. Usually it’s an emoji announcement that ends with the version it's coming to.",
    "But here, it’s different - the UI takes an improved form than anywhere else found on iOS at present.",
    "Looking at Apple’s press release, there are a collection of screenshots that show iOS showcasing three accessibility features coming soon.",
    "The below screenshot shows the upcoming Background Sounds feature, where you can play a variety of sounds to help you focus in a certain situation.",
    "However, the layout used here is not seen anywhere else in iOS, or third-party apps. This is because these inset cells, which are the edges in a box to make sure they're all aligned correctly when being displayed, are only available on iPadOS for now, not iPhone. It’s a useful feature for the user interface that can help you tell apart different settings in one screen.",
    "When a developer creates an application for iOS or iPadOS, they have to use XCode, a macOS application that can create, debug and compile their iPhone or iPad apps, ready to send to Apple so that it can be released on the App Store.",
    "There are plenty of methods that developers can use in XCode to help create the user interface, and one of these is Card View. It looks as though these screenshots allow the merging of certain navigation windows, such as a scroll meter and a way of inputting numbers into one card.",
    "It doesn’t seem to be a coincidence that these features have been announced, with no mention of what version of iOS 14 these will be appearing in. Especially due to the latest release of iOS 14.7 for developers doesn’t have any of these accessibility features either, only a new timer option for HomePod users.",
    "It’s certainly a blink and you’ll miss it feature, but it could hint towards a subtle refresh of the UI in iOS that could be coming to the next version soon.",
    "With this year’s WWDC 2021 only weeks away, we could be seeing more improvements to how developers can use more features for their apps in the user interface.",
    "There’s certainly more hope for more features in iPadOS 15 especially, but the event at WWDC next month could be so feature packed that Apple had no choice but to announce these accessibility features early in order to have their own time to shine.",
    "However, it makes sense for these improvements to be brought over from iPadOS regardless, in order to bring more unification to both the operating systems and developers who work on both platforms."
  ],
  "headers": {
    "4": "Take a Bow to Card View",
    "10": "Hung Up on WWDC 2021"
  },
  "links": {
    "Apple announced a multitude of accessibility features": "https://www.techradar.com/news/apple-is-expanding-memoji-and-accessibility-features-in-ios-ipados-and-watchos",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "press release": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7688267373606077000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F05%2Fapple-previews-powerful-software-updates-designed-for-people-with-disabilities%2F",
    "inset cells": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7950539175207566000&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fdocumentation%2Fcoregraphics%2Fcgrect%2F1624499-inset",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15"
  }
}