{
  "source": "https://www.techradar.com/news/american-express-launches-new-digital-receipts-feature",
  "title": "American Express launches new ‘Digital Receipts’ feature",
  "category": "computing",
  "updated": "2021-02-19T12:30:43Z",
  "author": "rob-clymo",
  "summary": "Amex customers will soon get a better insight into their purchases",
  "article": [
    "American Express has launched a new Digital Receipts service that allows customers to gain a better insight into their purchases from the likes of Google, Microsoft, Square, Apple and a host of other e-commerce merchants.",
    "The move isn’t just to give consumers a better overview of their spending habits; it should also reduce the number of queries about transactions. Following a recent survey by Amex, 79% of merchants surveyed believed that digital receipts would be a positive addition to the purchasing power of customers.",
    "With e-commerce sales still on the increase consumers are looking for more efficient ways of tracking their spending, particularly with the ever-present issues around online security. Digital Receipts will let consumers cross-check their purchases against transactions listed in their credit card account.",
    "The launch of American Express Digital Receipts will let Amex customers view detailed purchase information, including the merchant name, their logo, any order number, the date of their order and the item or items purchased. Any costs and a merchant description will round out the comprehensive data that customers can pick over if they have an issue with an item they’ve bought.",
    "Customers will be able to access the information from their Amex app or by going to their online account. The new service could help to reduce the number of calls being made to credit card companies in relation to queries about purchases.",
    "Amex research data recently revealed that 70% of consumers in the US have contacted their card company with a question about a transaction, only to discover that it was a legitimate charge they or a family member had made.",
    "Owners of business, in both e-commerce and traditional retail sectors felt that they stood to benefit from the rollout too. Implementing the wider use of digital receipts will help to reduce disputes, cut down on chargebacks and remove unnecessary costs.",
    "They also thought that using digital receipts would make it easier to pinpoint fraudulent charges, as well as improving the customer experience. Ultimately, they felt it would help to increase customer satisfaction levels as a whole.",
    "American Express plans to rollout the new Digital Receipts feature in the next few months."
  ],
  "headers": {
    "4": "Online account"
  },
  "links": {
    "e-commerce merchants": "https://www.techradar.com/best/best-payment-gateways",
    "digital receipts": "https://www.techradar.com/best/best-expense-trackers",
    "e-commerce sales": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "credit card companies": "https://www.techradar.com/best/best-credit-card-processing-service",
    "e-commerce": "https://www.techradar.com/news/best-ecommerce-hosting"
  }
}