{
  "source": "https://www.techradar.com/news/why-our-relationship-with-video-calls-needs-to-adapt-post-pandemic-to-avoid-complete-burnout",
  "title": "Why our relationship with video calls needs to adapt post-pandemic to avoid complete burnout",
  "category": "computing",
  "updated": "2021-03-24T17:17:39Z",
  "author": "oeyvind-reed",
  "summary": "Now is the time to identify the changes needed to avoid total video call burnout",
  "article": [
    "One year after lockdowns and travel restrictions swept across the world, it’s fair to say our relationship with video calls has changed dramatically.",
    "Video meeting platforms witnessed record growth as everyone sought to recreate human physical interaction - both with colleagues working remotely as well as friends and families unable to meet in person.",
    "As usage proliferated and the pandemic wore on, our relationship with the technology changed. More calls were happening than ever, the phrase ‘video meeting fatigue’ began to appear in the news, and bad habits started to creep in.",
    "With a full year’s experience using the technology on a mass scale, now is the time to pause, reflect and identify the behaviour changes we need to make in order to avoid complete video call burnout.",
    "One trend we noticed was the disappearance of the lunch hour. Since lockdown, lunchtime (12-1pm) has been the most popular time in the UK to start a video meeting, which in part explains why some have found it challenging to “switch off” while working from home.",
    "As lockdown became a reality for many, video call usage quickly ramped up. April was the busiest month of the year as businesses adapted to new restrictions - the 24th, 28th and 30th April, for example, saw video meetings increase by 57% compared to the daily average. The 28th - a Tuesday - was the busiest day of all.",
    "Conversely, the quietest day since March was New Year’s Day, when video call usage was 99% down on the daily average. We can only assume this was evidence that users had already sent their good wishes to friends and family the night before.",
    "Moreover, the type of video calls Brits were making altered completely. Before the pandemic, 46.3% of calls made from the UK were to people in other countries.",
    "After March 15th 2020 however, that figure dropped to 15.3% as people used video conferencing to stay in touch with, well everyone! Friends, work colleagues as well as those living overseas.",
    "“How can we protect our lunch hour?” I hear you cry. Well, the solution is actually fairly straightforward - we need to get better at conducting video meetings.",
    "Better meetings require changes to be made by both those organising them and their participants.",
    "Recent research from Dr Steven Rogelberg - author of The Surprising Science of Meetings - explored how the rise in video calls has impacted productivity levels and found we need to spend more time encouraging people to stay focused while meeting online.",
    "In the survey, 66% of individuals said they multitasked on calls when they wouldn’t normally in in-person meetings. Of these, 68% said they checked emails during video meetings, while 25% admitted to texting.",
    "On an individual level, it’s crucial to give a video meeting your undivided attention. Although cramming multiple tasks at once might give the illusion you’re flying through your to-do list, research shows doing so actually costs up to 40% of productive time in the long run.",
    "Best practice is to close any tabs or apps which may tempt attention - your response to an email or Slack message will always be more considered and thorough when you are not half-concentrating on a video chat.",
    "The Rogelberg study also revealed that 34% of 1-on-1 meetings are scheduled spontaneously, with people looking to recreate low stakes office settings such as popping by a colleague’s desk to bounce ideas around.",
    "In my experience, these meetings are rarely conducive to satisfactory outcomes. The best virtual meetings begin with thoughtful preparation and clear goals to ensure everyone gets the most out of the time. We all know the sensation of coming off a call feeling like nothing was achieved.",
    "The solution is to have a clear, pre-planned agenda for video meetings - in doing so, everyone can go away feeling as though they have achieved something.",
    "At the start of the pandemic, when remote working was still a new phenomenon, it’s clear that many businesses decided to move every single meeting into a virtual format.",
    "This is evidenced by April being the most popular month for video calls. Yet often, a video meeting would be scheduled without fully considering whether it was the appropriate method of communication. As a result, people were often faced with back-to-back meetings and the feeling they were drowning in more and more tasks with no allocated time to actually complete them - hence the multi-tasking.",
    "There are a number of ways we can fix this. Firstly, keep meetings short. It sounds simple, but shorter meetings result in better engagement. The longer a meeting goes on, the greater the risk of fatigue - the combination of being sedentary while constantly constantly watched on screen is a recipe for tiredness and distraction.",
    "If a meeting cannot be shortened, try to schedule breaks for grabbing a coffee or checking emails. Just knowing that a break is around the corner can be really helpful in ensuring all participants remain focused.",
    "People actually spend most time on video calls staring at their own face - which is another problem we need to fix. Avoid this temptation by maximising the video of the guest you are speaking to - this also will make the meeting more human, recreating what it would be like in person.",
    "Most importantly, it’s vital that everyone actually turns their video on. Not being able to read body language is not only quite stressful, but can lead to poor discussions and decisions.",
    "To maintain relationships with our colleagues, customers and clients, the human element is paramount. Just a few minutes chatting at the start of a meeting to warm up is a great way to build trust and rapport - in turn laying the foundation for great conversations and outcomes."
  ],
  "headers": {
    "4": "What happened last year?",
    "9": "We need better meetings, not more",
    "18": "What else do we change - and how?"
  },
  "links": {
    "video calls": "https://www.techradar.com/best/best-video-conferencing-software",
    "working remotely": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}