{
  "source": "https://www.techradar.com/news/upgrade-your-youtube-studio-with-these-bargain-prime-day-accessories",
  "title": "Upgrade your YouTube studio with these bargain Prime Day accessories",
  "category": "cameras",
  "updated": "2021-06-21T15:38:32.872Z",
  "author": "mark-wilson",
  "summary": "Snap up some bargain boosts for your Youtube studio",
  "article": [
    "Looking to upgrade your home Youtube studio or vlogging setup? Today is a very good time to do it, as some of the best Prime Day deals have served up big price cuts on many of the best Youtube and vlogging accessories, from ring lights to chroma key backdrops, RGB lights, gimbals and more.",
    "These days, some very affordable accessories can make a huge difference to the production quality of your home videos or Twitch streams. From a simple green screen background to a ring light or colored RGB lights, there a huge number of ways to take your Youtube studio or Twitch streaming setup to the next level – and also boost your work video conferencing game in the process. Fortunately, Prime Day has landed to make these accessories more affordable than ever.",
    "Whatever stage you're at with your Youtube studio or vlogging setup, there's likely to be something for you in our top accessory picks below. For example, if you're just starting out, the Neewer Advanced 18in ring light (currently 26% off) is a good way to eliminate shadows and light your subject (most likely you) evenly.",
    "A C-stand is always an incredibly useful filmmaking accessory and in the US there's a great offer on the Neewer Pro C Stand (down to only $107 thanks to a 38% discount). Strip lights are always Youtube studio essential, so check out the Govee LED strip lights (only $37.99, after a 20% discount), and Prime Day has also delivered the first big discount on the excellent DJI OM 4 smartphone gimbal (now just $119), or £115 in the UK.",
    "If you're a UK-based YouTuber, you can also get a huge 39% off the DJI Ronin-SC gimbal for mirrorless cameras, while the excellent Manfrotto Befree Live Video tripod is down to just £134.99, following its 30% price slash.",
    "Of course, you might also be looking for the fulcrum of your Youtube studio or home vlogging setup, a camera, so we've picked out the best Prime deals for those below, too. Standout deals include 30% off the Panasonic Lumix G95 with 12-60mm f/3.5-5.6 lens (in the US) and a massive 29% off the Panasonic Lumix S5 with a 20-60mm kit lens (in the UK).",
    "Whatever your budget or video style, there's likely to be a Youtube studio accessory bargain in the deals below – with many of these deals hot or Lightning deals, though, we'd recommend snapping them up quickly, as some are likely to sell out before Prime Day's end.",
    "Whether you're looking for a simple ring light to give you a more uniform glow or fancy tinkering with a motorized camera slider to add some movement to your shots, there are some great price cuts in the Prime Day sales on Youtube studio or vlogging accessories. We've rounded up all of the best ones below in our regularly updated list and will be adding more as we find them."
  ],
  "headers": {
    "7": "Prime Day's best YouTube studio accessory deals",
    "8": "More Amazon Prime Day deals in the UK"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Neewer Advanced 18in ring light (currently 26% off)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07ZF5V9LZ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6012359774220325000-20",
    "Neewer Pro C Stand (down to only $107 thanks to a 38% discount)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdeal%2F9c1257c9%3FshowVariations%3Dtrue%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3015991692369628000-20",
    "Govee LED strip lights (only $37.99, after a 20% discount)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07ZF5V9LZ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8035878863903110000-20",
    "DJI OM 4 smartphone gimbal (now just $119": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FDJI-OM-Handheld-Smartphone-Stabilizer%2Fdp%2FB08CMVGVQY%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7643218138741153000-20",
    "£115 in the UK": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB08C7TV8TN%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-7259892073215121000-21",
    "39% off the DJI Ronin-SC gimbal": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB07R48NZVD%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-9336960640482558000-21",
    "Manfrotto Befree Live Video tripod is down to just £134.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB07HHBWV3V%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1405087365034016000-21",
    ",": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB07HHBWV3V%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8790616256915987000-21",
    "30% off the Panasonic Lumix G95 with 12-60mm f/3.5-5.6 lens": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07PZB47HN%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5426963861007551000-20",
    "29% off the Panasonic Lumix S5 with a 20-60mm kit lens": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB08Q8H7D2T%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1317687795593631000-21"
  }
}