{
  "source": "https://www.techradar.com/news/you-should-probably-avoid-downloading-the-android-12-beta-heres-why",
  "title": "You should probably avoid downloading the Android 12 beta - here's why",
  "category": "phones",
  "updated": "2021-05-19T12:35:12Z",
  "author": "tom-bedford",
  "summary": "The risk-list is long",
  "article": [
    "The Android 12 beta is now available to download on a range of smartphones - here's how. But before you rush to download the early-days build of the next Google-developed operating system, it's worth weighing up the risks.",
    "Betas of all kinds can be risky, as they're unstable with many features missing. It's always worth backing up your data and learning how to revert to the old, stable operating system, before you enrol in such programs.",
    "But while there's always a risk of disaster with betas, with Android 12 you're not just flirting with danger, but walking straight into the firing line. While the beta is available on loads of Android phones, not just Google-built ones, most phones are running a developer preview of the OS - that is, a version designed for app designers, not normal users - which is pretty unstable.",
    "In fact, most phone makers have published long lists of problems with the developer previews - these aren't just risks, but confirmed problems that'll plague your smartphone.",
    "While Google phones are fine, as they're running the proper consumer beta, if you download the developer preview beta on another Android phone, you'll find features are missing or broken. So if you use your smartphone as your everyday device, we'd recommend avoiding these betas until newer, more stable builds are released.",
    "Most companies have been upfront about the risks the Android 12 beta brings.",
    "As per the OnePlus forums, if you download the beta onto one of its compatible devices your data will be wiped, neither fingerprint unlocking or face unlocking will work, the front camera won't let you run video calls, there will be changes to the user interface on some screens, some apps won't work and the phone could crash at random.",
    "That list is identical to the one Oppo published on its website - it's not plagiarism, since the two companies are owned by the same parent corporation.",
    "The Xiaomi website lists its problems by phone, but common ones seem to be that emergency calls don't work when the phone is locked, information doesn't appear correctly along the top of the phone, and when the device is locked, you have to swipe the entire length of the screen to unlock it.",
    "Our favorite list of problems must be TCL's. If you download the beta, all your content will be lost. You can't set a screen lock, Bluetooth doesn't work, you can't connect to 5G networks (bear in mind the only compatible phone literally has 5G in the name), Wi-Fi won't connect through VPNs, you can't view videos in the photos app, the 'tap to wake' function doesn't work, and the brightness will default to 0%. That's a big old list of big problems.",
    "Each company participating in the Android 12 beta has published similar lists of disastrous problems with the software - except Google, as we said, which isn't on a developer preview but a full-fat beta.",
    "If you're an average phone user, using your everyday smartphone for the beta, the above lists should be all you need to avoid downloading Android 12.",
    "You don't have to wait forever though, as the developer previews will quickly make way for full versions of the Android 12 beta for smartphones - ones without all these huge problems.",
    "So if your finger was hovering on the 'download' button for the Android 12 beta, we'd recommend holding your horses for a month or so, as the experience will be far better then."
  ],
  "headers": {
    "5": "What problems could occur?",
    "11": "Why should you wait?"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "here's how": "https://www.techradar.com/how-to/how-to-get-the-android-12-beta-on-your-smartphone",
    "OnePlus forums": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-2717911541077939700&sharedId=trd-us&u=https%3A%2F%2Fforums.oneplus.com%2Fthreads%2Fandroid-12-developer-preview-program-for-oneplus-9-and-oneplus-9-pro.1437113%2F",
    ",": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-8017080539152985000&sharedId=trd-us&u=https%3A%2F%2Fforums.oneplus.com%2Fthreads%2Fandroid-12-developer-preview-program-for-oneplus-9-and-oneplus-9-pro.1437113%2F",
    "its website": "https://developers.oppomobile.com/wiki/doc/index#id=91",
    "Xiaomi website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6568533186861513000&xs=1&url=https%3A%2F%2Fwww.mi.com%2Fglobal%2Fservice%2Fsupport%2Fandroidsbeta.html&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fyou-should-probably-avoid-downloading-the-android-12-beta-heres-why",
    "TCL": "https://www.tcl.com/global/en/android-12-beta.html"
  }
}