{
  "source": "https://www.techradar.com/news/microsoft-edge-makes-it-easier-to-keep-work-and-home-browsing-separate",
  "title": "Microsoft Edge makes it easier to keep work and home browsing separate",
  "category": "computing",
  "updated": "2021-04-13T09:46:12Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Workspaces is Edge's take on Tab Groups – but better",
  "article": [
    "Microsoft Edge will soon make it easy to keep groups of work and personal browser tabs separate.",
    "The coronavirus pandemic means that more people are currently working from home than ever before. This in turn means that unprecedented numbers of people are having to balance not only work and home life differently, but also work and personal computing.",
    "Microsoft Edge is going to be gaining a feature that will make this much easier. Building on the Tab Groups found in Google Chrome, the browser is essentially a combination of the idea of grouped tabs with that of virtual desktops – like the feature that's built into Windows 10.",
    "Workspaces will give Edge users the ability to group a number of related tabs together – these could be tabs relating to work, tabs relating to personal browsing, tabs relating to shopping or different projects. The workspace can be named and customized with a color to make it easier to identify, and then access from a new W button in the regular tab strip, regardless of whether horizontal or vertical tabs are in use.",
    "Over on Reddit, user Leo Varela shared screenshots and animated GIFs of Workspaces in action. Each Workspace can contain multiple tabs, and Leo points out that if you close an Edge window without deleting a workspace, it will remain available the next time you launch the browser.",
    "Other Reddit users speculate whether or not workspaces will work like Containers in Firefox, occupying separate processes that can be signed into different accounts at the same time. It is difficult to assess this at the moment as the Workspaces features is only available in the Canary build of Microsoft Edge.",
    "But even if you have this experimental preview version of the browser installed, it is no guarantee that you will be able to try out the new feature. It seems that Microsoft is currently only making Workspaces available to a limited number of users. If you'd like to try your luck, you can download Edge Canary and cross your fingers.",
    "Via MSPowerUser"
  ],
  "headers": {
    "5": "Keep 'em separated"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "Leo Varela": "https://www.reddit.com/r/MicrosoftEdge/comments/mnitfr/microsoft_is_testing_a_new_feature_that_will/",
    "download Edge Canary": "https://www.microsoftedgeinsider.com/download",
    "MSPowerUser": "https://mspoweruser.com/microsoft-is-working-on-its-own-version-of-chrome-tab-groups-called-workspaces/"
  }
}