{
  "source": "https://www.techradar.com/news/the-uncharted-movie-with-tom-holland-sounds-just-like-the-playstation-games",
  "title": "The Uncharted movie with Tom Holland sounds just like the PlayStation games",
  "category": "entertainment",
  "updated": "2021-08-25T11:42:51Z",
  "author": "samuel-roberts",
  "summary": "Drake tumbles from a moving aircraft",
  "article": [
    "The first images of the Uncharted movie, coupled with the decision to make it an origin story about young Nathan Drake, didn't make us overly optimistic about the adaptation of Sony's popular shooter games. But according to those who have seen the first footage of Ruben Fleischer's film, it's a lot closer to the source material than we previously thought.",
    "Reports on the first footage of the movie are coming out at CinemaCon, where Sony Pictures has been showing off a de-aged Alfred Molina in Spider-Man: No Way Home, as well as a first look at its Spider-Verse sequel, among other things. Uncharted stars Tom Holland as Nathan Drake, with Mark Wahlberg – once cast as Nate himself in a previous iteration of this movie – as Sully.",
    "According to io9, the footage of the movie showed off two iconic moments adapted from the games. In one, Nathan stands in front of a pirate ship in a dark and watery cave, a scene clearly designed to evoke one of the open world sections in the dazzling Uncharted 4: A Thief's End.",
    "Another moment, though, sounds even closer to the games. Uncharted 3's signature set piece – where Nathan Drake gets dragged out of an enemy cargo plane while in mid-flight, hanging on for dear life – is apparently in this film, with Holland flung out of an aircraft in a similar fashion. Overall, impressions of the footage seem pretty positive.",
    "There's not a lot else to chew on from what was revealed – just Wahlberg's Sully asking Holland's Drake if he wants to have an adventure like those he's only read about in the past. The Uncharted movie is set to release in theaters on February 18, 2022.",
    "It's hard not to see any movie based on the Uncharted games ending up as a superfluous romp – like watching any other sub-Indiana Jones adventure film, such as 2003's Welcome to the Jungle with The Rock, or indeed the first two Tomb Raider movies with Angelina Jolie. These films are hard to get right.",
    "After all, the pleasure of the games in the first place was that they captured the vibe of a good adventure movie in an interactive form – complete with well-realized characters and fantastic dialogue from the games' main writer, Amy Hennig. Divorced from that context of putting you in control of Nathan Drake, an Uncharted movie has the potential to be pretty flat.",
    "Still, replicating set pieces wholesale from the games has the potential to be pretty fun, if they're done right – Uncharted fans might just want to see it for the sheer novelty of watching Nathan Drake tumble out of a moving aircraft in live-action, and to see which other references they've welded into the film.",
    "This isn't the stuff of masterful cinema on paper, then, but the fact that they're paying attention to the games' strengths is a positive sign."
  ],
  "headers": {
    "5": "Analysis: What would make an Uncharted movie watchable?"
  },
  "links": {
    "first images of the Uncharted movie": "https://www.techradar.com/news/new-uncharted-movie-images-tease-tom-hollands-first-adventure",
    "de-aged Alfred Molina in Spider-Man: No Way Home": "https://www.techradar.com/news/5-things-you-might-have-missed-from-the-spider-man-no-way-home-trailer",
    "io9": "https://gizmodo.com/cinemacon-s-uncharted-film-footage-feels-ripped-from-th-1847544648",
    "Uncharted 4: A Thief's End": "https://www.techradar.com/news/gaming/uncharted-4-a-thief-s-end-review-1320412"
  }
}