{
  "source": "https://www.techradar.com/news/tcls-ces-2021-lineup-includes-the-cheapest-5g-phone-yet",
  "title": "TCL 20 5G series unveiled at CES 2021, and it includes a remarkably cheap 5G phone",
  "category": "phones",
  "updated": "2021-01-19T19:08:42Z",
  "author": "david-lumb",
  "summary": "Plus another respectable budget phone",
  "article": [
    "TCL made a splash when it debuted a trio of phones at last year's CES 2020 – the first it released under its own brand, with surprisingly good specs and value for a first effort. Now, it’s following up with two new handsets at CES 2021, including one of the cheapest 5G handsets we’ve seen.",
    "The TCL 20 5G packs mid-range specs at a budget price, opting for a little less power than its TCL 10 5G predecessor in order to come in notably cheaper, and the new phone is one of the cheapest 5G-capable devices on the market. It packs a 6.67-inch LCD Full HD display, Snapdragon 695G chipset, 6GB of RAM, 128GB of storage, a 4,500mAh battery, and a triple rear camera (48MP main, ultra-wide, and depth sensor).",
    "The TCL 20 SE is 4G LTE-only, but specs-wise, it’s a contender for our best cheap smartphones list if it works well. It has a 5,000mAh battery with reverse charging and quad speakers.",
    "This is only part of an expected five phones TCL will announce in the weeks to come that will make up some (but perhaps not all) of the brand’s 2021 mobile device lineup.",
    "Last year, TCL announced three phones at CES 2020 and trickled out more over the following months for a total of seven by year’s end – not an outrageous number (Samsung released six flagships and ten A-series mid-range and budget phones, for instance), but a lot for the brand’s first year. We could see more come out later in 2021.",
    "We've yet to hear price or release date information for either the TCL 20 5G or the TCL 20 SE, but the company has confirmed to us the phones will be available in the UK and US.",
    "TCL is known for its TVs, and it’s certainly announcing its latest 5-series and 6-series models to come out in 2021. But on the mobile side, it’s expanding on its breakout year’s lineup with plenty of new devices – and more than just phones.",
    "TCL has three tablets it’s introducing, including the affordable TCL 5G tablet, one of the first 5G-connecting tablets on the market. Also in the mix is the TCL NXTPAPER tablet, which uses the titular technology introduced in September to deliver an electronic paper-like color display with longer battery life that’s easier on the eyes; though it’s not backlit and requires environmental lighting to see in low-lit areas, TCL is including a light in the box. Finally, the TCL Tab 10s is an affordable refinement of its existing Tab 10 slate in both WiFi-only and 4G LTE models.",
    "TCL, known for its high-quality displays, is also introducing a product without a screen: the Move PetTracker, a GPS tracker with fun and flexible cases and a 14-day battery life. While it can track anything, it’s mainly aimed at consumers who want to monitor and geofence their pets.",
    "Finally, TCL touched on a couple devices that aren’t ready for the market but, they assured TechRadar, are still in development. The first is the TCL Rollable, a rollable phone we’ve been hearing rumors about, which TCL expects will be a more consumer-friendly format than foldable phones, given how much easier it is to stretch out a screen than fold it in half. While we didn't hear about it at TCL's CES presentation on Monday, sources told CNET that the Rollable we know – which extends from the sides – is nearly market-ready and could arrive this year.",
    "This being CES, TCL had other rollable device concepts it did show off during a presentation – including the vertically-extending phone above. The tech is still in its early stages: they have the rolling screen working, but not in a market-ready slim phone format, as this tweeted footage of a CES 2021 floor model shows.",
    "TCL also showed off a larger 17-inch 'Printed Flexible OLED Scrolling Display' concept that unfurled like a scroll – and yes, there was an official tweet of a floor model showing off this tech, too, though it's also not ready for market.",
    "The last concept TCL confirmed was still in the works, Project Archery, are VR glasses that deliberately don’t close off peripheral vision in order to decrease discombobulating motion sickness – and allow them to be less clunky than encompassing headsets. TCL thinks these will be well-suited for the couch or the commute – though we’ll have to see if Project Archery ever gets its full release."
  ],
  "headers": {
    "6": "TCL’s CES 2021: More, more, more"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "TCL 10 5G": "https://www.techradar.com/reviews/tcl-10-5g-review",
    "best cheap smartphones": "https://www.techradar.com/best/best-cheap-phones",
    "introduced": "https://www.prnewswire.com/news-releases/tcl-debuts-the-companys-nxtpaper-display-technology-along-with-tcl-10-tabmax-and-tcl-10-tabmid-tablets-at-ifa-2020-301123644.html",
    "rumors": "https://www.techradar.com/news/lg-rollable-could-launch-earlier-than-we-expected-heres-why",
    "CNET": "https://www.cnet.com/news/whoa-the-lg-rollable-phone-we-saw-at-ces-is-actually-real-coming-out-in-2021/",
    "footage": "https://twitter.com/phonewisdom/status/1348719333069922304",
    "tweet": "https://twitter.com/phonewisdom/status/1348727020461596672"
  }
}