{
  "source": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
  "title": "Apple Music and Amazon Music now offer hi-res audio at no extra cost",
  "category": "audio-visual",
  "updated": "2021-05-18T10:24:03Z",
  "author": "olivia-tambini",
  "summary": "Hi-res music streaming without the premium price tag",
  "article": [
    "Apple Music and Amazon Music have both announced that they're bringing hi-res audio to subscribers – and at no extra cost.",
    "The announcements came at roughly the same time, with Apple bringing a slew of upgrades to its music streaming service, including Spatial Audio with support for Dolby Atmos, as well as the ability to listen to over 75 million tracks in Lossless Audio.",
    "Meanwhile, Amazon Music has said that going forward, its high-quality streaming tier, Amazon Music HD, will be available to all eligible Amazon Music Unlimited subscribers without an accompanying price hike.",
    "The news comes after weeks of speculation that Apple would launch a new subscription tier for hi-res audio at no extra cost – and while Apple hasn't introduced a new tier per se, it's true that the extra features, including lossless streaming for its entire catalogue, won't cost existing users a penny more than usual.",
    "According to Apple, subscribers will \"be able to hear the exact same thing that artists created in the studio\", with Lossless Audio. To begin listening to Lossless Audio, you can turn it on in Settings > Music > Audio Quality, where you'll be able to choose the resolution of your music based on your connection (cellular, Wi-Fi, or download).",
    "The Lossless tier starts at CD quality (16 bit / 44.1kHz), and goes up to 24 but / 48 kHz, and can be played natively on Apple devices. And, for audiophiles, there's Hi-Resolution Lossless, which goes all the way up to 24 bit / 192kHz.",
    "So, what difference does that actually make? Well, the increased bit depth of HRA improves the dynamic range of your music, basically giving you more detail and clarity from the recording, and bringing the reproduction much closer to how it sounded in the studio.",
    "Previously, Apple Music’s streaming quality maxed out at 256kbps AAC, and while that's very crisp and clear, it's still compressed – if you've got a high-end speaker set or pair of headphones, you'll be able to hear the difference.",
    "As well as Lossless Audio, Apple Music is getting Spatial Audio with support for Dolby Atmos.",
    "The immersive sound technology was initially designed for cinema, bringing a sense of height as well as width to soundtracks and effects, making it feel as though sound is coming at you from all angles.",
    "If you have a pair of AirPods or Beats headphones with either the H1 or W1 chip, Apple Music will now automatically play Dolby Atmos tracks by default – according to the company, \"thousands\" will be available at launch, with more to follow.",
    "Apple says that it will be constantly adding new Dolby Atmos tracks to the service, as well as curating dedicated playlists to help you find your favorite tracks in the 3D sound format. Albums that are available in Atmos will also have a badge on its detail page, so you should be able to spot them quickly.",
    "In a word, yes. To our knowledge, Apple Music and Amazon Music will be the only music streaming services to offer hi-res audio as a standard, at no extra cost to subscribers – and that will give it a huge leg up over the competition.",
    "Rumors that Apple was working on bringing lossless streaming to the platform began building up after Spotify announced its own hifi tier in February. Spotify HiFi is set to launch later this year, and brings CD-quality (but not hi-res) audio to the world’s most popular streaming service.",
    "Right now, Spotify HiFi is yet to be given a price, though it’s expected to cost more than a regular Spotify Premium subscription ($9.99 / £9.99 / AU$11.99).",
    "The introduction of these frankly brilliant upgrades could well be enough to lure listeners away from Apple Music's competitors. After all, Apple Music is more widely used than the likes of Deezer, it's cheaper than Tidal, and it integrates seamlessly with the company’s products (such as the HomePod), making it an attractive prospect for audiophiles and Apple devotees alike.",
    "Both Spotify and Apple are playing catch-up In to a certain extent. Tidal, Deezer, and Qobuz, have long offered their own lossless streaming tiers, beating both platforms to the audiophile market. However, all of these services charge a premium for access to hi-res audio streaming – Apple is offering this, as well as spatial audio, for its usual price of $9.99 / £9.99 / AU$11.99.",
    "As for Amazon Music HD? The service launched in 2019, and gives subscribers the ability to stream more than 70 million lossless, High Definition (HD) songs, with a bit depth of 16 bits and a sample rate of 44.1kHz (CD quality).",
    "There are also more than seven million songs in Ultra HD (better than CD quality), with a bit depth of 24 bits and a sample rate up to 192 kHz. meeting the threshold for hi-res audio.",
    "Amazon Music HD also brings songs remixed in Dolby Atmos and Sony 360 Reality Audio – though these spatial audio tracks are limited to the Amazon Echo Studio, and Sony's RA5000 and RA3000 speakers via Alexa Cast.",
    "The tier used to cost an additional $5 per month for subscribers to the Amazon Music Unlimited Individual or Family Plan. However, you can now access the hi-res and spatial audio tracks for your regular price of $7.99 / £7.99 per month for Prime members, $9.99 / £9.99 per month for Amazon customers, or $14.99 / £14.99 per month if you're on the Family Plan.",
    "If Spotify wants to retain its fanbase, it'll either need to increase its CD-quality HiFi tier to include true hi-res audio, or offer Spotify HiFi for free. Otherwise, Apple Music or Amazon Music Unlimited could easily take the crown as the best music streaming service in 2021."
  ],
  "headers": {
    "8": "Spatial smarts",
    "12": "Should Spotify be worried?"
  },
  "links": {
    "music streaming service": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Beats headphones": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Deezer": "https://www.techradar.com/reviews/deezer",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "Sony's RA5000": "https://www.techradar.com/reviews/sony-srs-ra5000",
    "best music streaming service": "https://www.techradar.com/best/the-best-music-streaming-services-2021"
  }
}