{
  "source": "https://www.techradar.com/news/email-is-50-years-old-but-theres-life-in-the-old-dog-yet",
  "title": "Email is 50 years old, but there's life in the old dog yet",
  "category": "computing",
  "updated": "2021-05-04T09:09:49Z",
  "author": "joel-khalili",
  "summary": "Email has been declared dead many times over",
  "article": [
    "Half a century ago, an MIT graduate named Ray Tomlinson became the first person to transmit a message from one computer to another, although it would be years before anyone referred to this practice as email.",
    "Tomlinson worked for an engineering firm called Bolt Beranek and Newman (now Raytheon BBN), which had been contracted by the US Defence Department to help build the Advanced Research Projects Agency Network (ARPANET), itself a precursor to the internet as we know it today.",
    "At the time, computers were isolated from one another and also extremely expensive, so each was used by tens of different people and notes for fellow users were dropped into numbered mailboxes.",
    "With the arrival of ARPANET, which connected roughly 20 machines (used by more than 1,000 different people), the ability to send memos to and fro between computers became invaluable.",
    "At some point in 1971 (the precise date has been lost to history), Tomlinson glued together the existing ARPANET SENDMSG utility and a file-transfer program he had been working on. Using his creation, he fired a message into an inbox on another machine on the network, separating the user identifier and destination address with the @ symbol.",
    "In the period since the first email was delivered, countless different technologies have been invented, adopted and superseded. Although email has been declared bound for the grave many times over, it’s currently used by billions of people worldwide and remains the primary mode of business communication.",
    "According to data from Statista, roughly 306 billion emails were sent and received each day in 2020, which equates to more than 110 trillion across the course of the year. Projections suggest this figure is set to rise to 375 billion per day by 2025.",
    "However, the continued popularity of email doesn’t mean the venerable technology hasn’t evolved in the 50 years since Tomlinson changed the face of communication.",
    "Although the death of email never materialized, the technology has been through a process of multiple rebirths, forced to adapt as the landscape changed shape around it. It’s just that these changes aren’t immediately apparent, because all of the work happens under the hood.",
    "“While it hasn’t been replaced, the technology underpinning email has evolved over the time. Just as video technology has evolved from VHS, to DVD, to streaming, email has evolved as well,” a spokesperson from email service ProtonMail told TechRadar Pro.",
    "The ability to attach files to emails, for example, didn’t exist until the arrival of the Multipurpose Internet Mail Extensions (MIME) protocol in 1992, which created a whole new use case for the service.",
    "The arrival of smartphones also necessitated an overhaul to the way email products were built, and the same can be said of the proliferation of c and phishing scams, which has played an influential role in the development of email protocols.",
    "The Simple Mail Transfer Protocol (SMTP), used for sending emails to mail servers, was first created in 1981, but has since been updated and extended multiple times to allow for the introduction of authentication, encryption and other upgrades.",
    "Both the Internet Message Access Protocol (IMAP) and Post Office Protocol (POP), open standards for retrieving emails from mail servers, have cycled through a number of different iterations designed to improve speed and security.",
    "According to ProtonMail, this process of repeated reinforcement will continue on in years to come, driven by greater public awareness of issues related to security and data privacy.",
    "“At the moment, the biggest providers leave their users’ personal data unprotected and available for collection and monetization,” said the firm. “Public opinion is shifting away from surveillance capitalism and it’s only a matter of time before all consumers demand greater control over who can access their data.”",
    "Beyond the underlying technology, however, the way email is used has also changed considerably. Over time, email has become a business-first mode of communication, rather than a service used to correspond with friends and family.",
    "Available to anyone for free, email has also become a universal passport for the internet, permitting access to web-based services and providing the basis for online transactions.",
    "“A crucial thing to remember about email is its openness and that it can be used by and large for free,” said Len Shneyder, who heads up industry relations for email API platform Twilio SendGrid.",
    "“Email was built as an open platform with few barriers to entry, it doesn’t require an app to be downloaded, it is a core function of smart devices, PCs, tablets, laptops and the most basic way of creating an account on other platforms.”",
    "Without email, in other words, there could be no e-commerce, no social media and no web-based services. This development has placed email at the heart of internet activity, from which position it will be extremely difficult to dislodge.",
    "Since the commercialization of email, the market has undergone a complete changing of the guard. A process of consolidation has seen a wide range of email providers reduced to just a handful.",
    "The first commercial email service was MCI Mail, launched in 1983. The 1990s brought a slew of memorable names, such as AOL Mail, Hotmail (now Outlook), Lycos, Mail.com and Yahoo! Mail, which were joined by Gmail in 2004.",
    "However, a process of selection and acquisition has whittled down this pool of providers, so that just a select few companies have come to dominate the market.",
    "Data from Litmus Email Analytics suggests Apple, Google and Microsoft are responsible for eight of the world’s top ten most popular email clients, controlling 89% of the market. When it comes to email hosting, Google and Microsoft rule the roost, although up-to-date statistics are not readily available.",
    "The slimming of the market can be attributed in-part to difficulties in monetizing email, which is both free to use and expensive to run. The companies that thrive in the email market today use their services to hook users into a wider ecosystem of products and to collect valuable data that can be applied elsewhere.",
    "“At base, email is a universal agreement between people about how messages can be exchanged,” explained Rogen Kay, VP Security Strategy at email client INKY.",
    "“As a lingua franca, email can be exchanged among phone and computer users, Mac, Windows and Android users, on any browser or email client. This kind of inertial is hard to move.”",
    "But the same forces that have created a market prone to monopolization have also guaranteed the technology’s continued relevance, says Jan Oetjen, CEO at email service GMX. By establishing itself as “the backbone of the internet”, email has given proprietary challengers a steep (and perhaps insurmountable) hill to climb.",
    "“What makes email so relevant is the openness of its standard,” he told us. “It eludes the attempts of tech giants to create their own proprietary platforms that only their customers can communicate on. You can be sure that your email will reach its recipient independent of what email service provider they use.”",
    "And despite the dominance of just a few large companies, Oetjen is bullish about the opportunity for smaller providers, especially as public opinion begins to swing in opposition to surveillance capitalism.",
    "“Due to the network effects, we have a market structure that has a negative impact on the intensity of competition. Google in particular uses its dominance in Android operating systems to tie users to Gmail,” he said.",
    "“However, big US companies have lost a lot of trust in recent years. This is a starting point for smaller providers to position themselves as a more secure and trustworthy alternative.”",
    "The case against email is predicated on the idea that collaboration services do everything that email does, as well as addressing all of its shortcomings - from siloed data and clunky user interfaces to the opportunity for security incidents.",
    "However, a direct comparison between email and services such as Slack or Microsoft Teams is inappropriate in a number of ways, because the two are used for different (albeit adjacent) purposes.",
    "According to Andrea Loubier, CEO at email client Mailbird, it’s “like comparing apples and oranges”. “There are many new tools that challenge the use cases for email, [but] I see these technologies as complimentary,” she says.",
    "For example, the rise of collaboration platforms has changed the way colleagues communicate by championing a more informal approach. Gone are the days of “sincerely” and “kind regards” and come is the hour of the comedy GIF and reaction emoticon.",
    "But while the ability to build deeper personal relationships with remote colleagues is one of the main value propositions of collaboration platforms, this is also one of the fundamental reasons they haven’t displaced email, as some predicted they would.",
    "The inbox has become the last bastion of purely functional, transactional and asynchronous communication. It’s the place where the most serious and, frankly, boring communication happens, and that’s why it’s so valuable.",
    "Another respect in which the two services differ is in expected response time. Although collaboration vendors claim to facilitate asynchronous communication, in reality these platforms incentivize near instantaneous responses. In a shared channel, for example, a query will be buried beneath a torrent of fresh messages if not dealt with immediately.",
    "However, it’s widely accepted that email does not always demand an immediate response. In a world in which hundreds of push notifications vye for our attention every day, the ability to communicate in an asynchronous manner is vital for the purposes of productivity, but also sanity.",
    "This style of communication also affords interlocutors more time to consider their response. For a quick request or informal chat, collaboration tools are by far the superior option, but email thrives when due diligence is required.",
    "“Email is tried and trusted; it’s been around for such a long time because it works, despite the many frustrations that come with it,” added Loubier.",
    "“Our tool belt for productivity and communication has broadened, with email becoming the core technology framework to which new tools contribute efficiencies and workflows.”",
    "Companies operating in the collaboration market, however, tend to see email’s core attributes through a different lens; as limited and sluggish, rather than task-specific and slow by design.",
    "And this perspective is also backed up by data. A recent survey from Mail Manager found that 32% of workers spend at least an hour managing their inboxes each day, which amounts to an eighth of the working week or more.",
    "If an employee is paid $30,000 per year (close to the US average), time wasted on email management can be said to cost the employer $3,750 per year. A business that employs 1,000 people, a third of whom are bogged down by email management, will effectively flush away $1.2 million per annum.",
    "This is a productivity hole that collaboration services believe they are equipped to fill, in part by integrating a wide range of functions into a single application.",
    "Many collaboration tools began as simple messaging apps or video conferencing services, but have since become centralized hubs for work, absorbing cloud storage, file-sharing, project management and customer support functionalities into one package.",
    "Some players in the space, like Asana, view their relationship with email as a reluctant symbiosis. According to Simon O’Kane, the company’s Head of EMEA, email is a “communication tool misused for work coordination”.",
    "“We know that managing work effectively goes beyond back-and-forth message threads. As a communication-based tool, email will never be able to help businesses coordinate their work,” he told us.",
    "“Email isn’t likely to become fully extinct; despite its limitations, it is still a globally-adopted means of communication. [But] it is organizations which identify the most helpful tools and push away legacy systems that will thrive.”",
    "Microsoft sits on both sides of the fence, operating both email products and a collaboration service. Nick Hedderman, Director of the Modern Work & Security Business Group at Microsoft UK, told us that the use cases for each product type will become increasingly divergent over time.",
    "“Email is here to stay as a core productivity tool, especially useful for ‘open loop’ communications, such as connecting with customers. There is also a role for collaboration tools, as a way to connect with an ‘inner loop’ of colleagues,” he said",
    "“Empowering employees to work on their teams with cloud-based software that is always up-to-date, can be accessed on different devices and built on a secure platform will be critical.”",
    "Other companies in the space, however, are frank about their ambitions to consign email to the technology scrapheap. The pandemic in particular, they say, has provided a perfect case study in the pitfalls of email.",
    "“Although it remains the default option among some more traditional firms, the pandemic has brought the truth about email to light: it is an archaic and ineffective means of workplace communication,” said Stuart Templeton, Head of UK at Slack.",
    "“Knowledge work is collaborative work, and remote working has underlined how openness and transparency in communication is key to creating alignment and to enabling better and faster decisions to be made. [Email] eradicates visibility through direct messages and closed threads, sharing knowledge only with a handful of people and insulating it from the wider workforce.”",
    "Templeton even went as far as to predict a transition away from email as businesses shift towards a hybrid working model, whereby employees divide their time between home and the office.",
    "“Email in the workplace is a tool suited to closed-door decision making, siloing key information away from those who need it most. The days of being copied into long email chains may well be numbered, and that is something we can all be grateful for.”",
    "The case for the death of email is built on the idea that email’s best qualities can be replicated by services that are also able to buff out its imperfections. But this is a theory, not a truth universally acknowledged.",
    "One of the most significant problems for email challengers is their proprietary nature. With an install base as large as email’s and taking into account its centrality to the operation of the web, it’s difficult to see how any one rival might topple email from its perch.",
    "Further, if email were to be superseded by an alternative, questions would need to be asked about what happens to mail in storage. The WayBack Machine catalogues the history of the internet, but there is no such equivalent for email, so to eliminate the technology would be to erase a significant portion of recent human history.",
    "Nonetheless, with such a large target painted on its back, email will need to continue to develop. Asked how the technology might change in the years to come, those we consulted largely sang to the same tune.",
    "A few suggested it will be displaced or augmented by emerging communications technologies, others believe security and data privacy concerns will demand wholesale changes, but the majority agree that the future for email lies in integration.",
    "“At the moment, there is no business application in sight that could compete with the reach of email and it remains the only common and open standard for business communication,” said Oetjen, CEO at email service GMX. “The silver bullet will be to link it intelligently with other means of communication.”",
    "Pip White, MD UK & Ireland at Google Cloud, also believes tighter integration could paper over the insufficiencies of the 50-year-old technology.",
    "“Email will remain central to businesses’ evolving work plans, helping to bridge the gap between the in-person and the ‘somewhere else’, but as part of a much broader suite of tools,” she said.",
    "“People are overloaded with many tasks across many tools with blurring lines on where work happens. It’s important that the essential communication and collaboration tools including email, but also video and chat, work better and more closely together.”",
    "If and when email makes it to its 100th anniversary, then, it will likely have become a different beast entirely."
  ],
  "headers": {
    "8": "A process of evolution",
    "21": "A changing of the guard",
    "33": "Email is boring, but in a good way",
    "44": "The noisy neghbors",
    "60": "The future of email"
  },
  "links": {
    "email": "https://www.techradar.com/news/best-email-provider",
    "data from Statista": "https://www.statista.com/statistics/456500/daily-number-of-e-mails-worldwide/",
    "ProtonMail": "https://go.getproton.me/aff_c?offer_id=26&aff_id=1046&source=trd&aff_click_id=trd-us-8119409606840606000&url=https%3A%2F%2Fprotonmail.com%2F%3FvisitorId%3Dho-%7Btransaction_id%7D%26aid%3D%7Baffiliate_id%7D%26offer_id%3D%7Boffer_id%7D%26utm_campaign%3Dww-all-2a-mail-gro_aff-tune%26utm_medium%3Dlink%26utm_source%3Daid-tune-%7Baffiliate_id%7D%26utm_content%3D%7Boffer_id%7D%26offer%3Dplus-professional-visionary%26url_id%3D%7Boffer_url_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Femail-is-50-years-old-but-theres-life-in-the-old-dog-yet",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone#",
    "c": "https://www.techradar.com/best/best-malware-removal",
    "PCs": "https://www.techradar.com/news/best-business-desktop-pcs",
    "tablets": "https://www.techradar.com/news/best-business-tablets",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "Litmus Email Analytics": "https://emailclientmarketshare.com/",
    "email clients": "https://www.techradar.com/best/best-email-clients",
    "browser": "https://www.techradar.com/best/browser",
    "collaboration services": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "recent survey": "https://blog.mailmanager.com/new-blog/new-research-reveals-email-dominates-business-communication-but-poor-processes-kill-productivity-and-frustrate-employees",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "file-sharing": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "project management": "https://www.techradar.com/best/best-project-management-software",
    "customer support": "https://www.techradar.com/best/best-helpdesk-software",
    "Asana": "https://www.techradar.com/reviews/asana"
  }
}