{
  "source": "https://www.techradar.com/news/amd-could-continue-to-eat-intels-market-share-and-thats-good-news-for-consumers",
  "title": "AMD could continue to eat Intel’s market share – and that’s good news for consumers",
  "category": "components",
  "updated": "2021-04-29T11:28:55Z",
  "author": "matt-hanson",
  "summary": "Analyst suggests a “price war” is coming",
  "article": [
    "AMD is going from strength to strength, and leading analysts were quick to head praise on the company after its latest financial results – and one has suggested that its momentum in the CPU marketplace could trigger a price war with Intel.",
    "As MarketWatch reports, AMD’s strong results showed growth across almost all of its products, and could see sales of around $14.65 billion this year, smashing the $13.46 billion average estimates from analysts.",
    "Cowen analyst Matthew Ramsay points out that “AMD is continuing to gain material share in large and growing markets with the strength of its PC and server CPU road maps and customer partnerships,” and that the momentum of the company shows no sign of slowing down.",
    "Another analyst, Mark Lipacis, said that “We continue to expect AMD’s share gains to accelerate from 50-100bps/qtr to 100-300 bps per quarter through 2021 and 2022 while AMD maintains its 1-yr process node lead.”",
    "This is all well and good, but what does it actually mean? As we’ve often remarked in the past, AMD’s momentum against Intel could be great news for consumers. Not only does it mean AMD has been putting out some brilliant products, but it could also scare Intel out of its complacency, after so many years being relatively unchallenged.",
    "In fact, Citi Research analyst Christopher Danley, has been one of the more down-beat analysts over AMD’s performance, suggesting that the company’s gains from Intel in market share could soon come to an end, after Intel CEO Pat Gelsinger’s recent comments on how Intel will aggressively respond.",
    "“Expect a price war when PCs cool,” Danley has been quoted by MarketWatch. “While AMD gained share and we expect the company to continue to gain share at least over the next couple of years, we also expect Intel to initiate a price war in 2H21 to try to maintain market share.”",
    "This means in the second half of 2021, we could see Intel drastically cut prices of its existing CPU lineup, while releasing aggressively-priced new products, such as its Alder Lake processors.",
    "AMD has traditionally had the price/performance advantage over Intel, so it makes sense that Intel could be looking at changing that and win back customers. Of course, this in turn could make AMD become more aggressive with its prices as well.",
    "Whatever the result, they’ll be one winner – those of us looking to buy CPUs. With the two processor giants duking it out to release ever more powerful, yet affordable, processors, we could soon be entering a golden age of CPUs. We just need the chip shortages to end first."
  ],
  "headers": {
    "4": "What does it mean for consumers?"
  },
  "links": {
    "MarketWatch reports": "https://www.marketwatch.com/story/amd-equity-analysts-say-market-share-grab-from-intel-is-just-the-beginning-11619627072"
  }
}