{
  "source": "https://www.techradar.com/news/intel-xe-high-end-gaming-gpu-could-be-faster-than-nvidias-rtx-3070",
  "title": "Intel Xe high-end gaming GPU could be faster than Nvidia’s RTX 3070",
  "category": "computing",
  "updated": "2021-04-09T09:48:17Z",
  "author": "darren-allan",
  "summary": "Intel might also be working on its own rival for DLSS",
  "article": [
    "Intel’s Xe high-end desktop graphics card (codenamed DG2) could outgun Nvidia’s RTX 3070, if the latest from the rumor mill is to be believed.",
    "Intel’s DG2 has (again) been covered by YouTuber Moore’s Law Is Dead in a big leak which has lots of interesting points to chew over, adding to what Moore’s Law has previously said in the past about the graphics card.",
    "According to word from the usual unspecified sources – so as ever, treat this with a lot of skepticism – the Xe-HPG (high-performance gaming) card will be built on TSMC’s 6nm node (or it could possibly use an enhanced 7nm process, as we’ve previously heard).",
    "The flagship model is expected to have 512 Execution Units and to run at clock speeds of up to 2.2GHz, with 16GB of GDDR6 video RAM on board (and a 256-bit memory bus). The TDP could reach up to around the 275W mark, or perhaps slightly less, but obviously take these specs in particular with a healthy helping of condiments.",
    "Especially the following assertion of Moore’s Law, which is that the performance achieved by this Xe graphics card is set to be pitched in-between Nvidia’s RTX 3070 and 3080. In other words, it should be quicker than the vanilla RTX 3070, and therefore maybe something in the ballpark of the RTX 3070 Ti (whenever that card turns up – supposedly soon going by the latest speculation).",
    "Moore’s Law has compared DG2 to the RTX 3070 in the past, so if anything, he is now hinting that the GPU could even be slightly stronger (or rather, his sources are). That’s obviously good news in terms of having a genuine competitor to Nvidia and AMD, and it’s not an unbelievable assertion given the aforementioned rumored specs. Let’s not get carried away with those hopes, though…",
    "Another interesting nugget here is the claim that Intel could be planning an equivalent for Nvidia’s DLSS (remember AMD has its own rival tech in the form of FidelityFX Super Resolution). Intel supposedly might debut ‘XeSS’, but the leak is vague on this, and as Tom’s Hardware, which spotted all this, points out, it’ll be a big ask for Intel to get a DLSS rival out – and get support from game developers.",
    "It’s a big enough ask breaking into the two-horse GPU race, and perfecting the software in the form of graphics drivers, as it is. Tom’s observes that one possible solution for Intel might simply be to adopt AMD’s FidelityFX Super Resolution, as it’s an open source effort, so this could be feasible – providing AMD can nail the tech and get it performing well, naturally.",
    "Still, it could be the case that Intel has some vague plans for a DLSS rival right now, but that these might not see fruition until much later down the line – presumably when Intel has carved out a chunk of market share in the GPU arena and is in the position of being a serious player, and therefore will have more leverage.",
    "The release date of DG2 was also touched upon, with Intel apparently still targeting the end of the year (Q4) for the debut of the high-end Xe graphics card.",
    "In his video, Moore’s Law also provides us with a glimpse of some images of the purported DG2 engineering sample (shown with dual fans), which could be taken as another indication that progress is speeding along nicely with the GPU, and maybe that rumored late 2021 launch date might just happen.",
    "A lot will, of course, depend not just on Intel’s progress with DG2, along with the drivers and related software side, but also on exactly how the current chip shortage pans out. The truth is there are a lot of variables, really, to be pinning too much hope on a particular timeframe."
  ],
  "headers": {
    "6": "DLSS rival?"
  },
  "links": {
    "Intel’s Xe high-end desktop graphics card": "https://www.techradar.com/news/intels-high-end-gaming-gpu-possibly-spotted-in-testing-hinting-at-a-2021-debut",
    "Nvidia’s RTX 3070": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3070-find-stock-here",
    "as we’ve previously heard": "https://www.techradar.com/news/intels-gaming-graphics-card-could-be-built-by-tsmc-and-sounds-like-a-threat-to-nvidia-and-amd",
    "3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "supposedly soon going by the latest speculation": "https://www.techradar.com/news/nvidia-could-be-about-to-hit-amd-hard-with-launch-of-rtx-3080-ti-and-3070-ti-gpus",
    "compared DG2 to the RTX 3070 in the past": "https://www.techradar.com/news/intels-high-end-gaming-gpu-sparks-into-life-and-its-rumored-to-challenge-nvidias-rtx-3070",
    "Nvidia’s DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "AMD has its own rival tech in the form of FidelityFX Super Resolution": "https://www.techradar.com/news/amds-fidelityfx-super-resolution-wont-require-machine-learning-unlike-nvidia-dlss",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/rtx-3070-competitor-dg2-intel-xe-512eu"
  }
}