{
  "source": "https://www.techradar.com/news/rumored-ipad-2022-spec-points-to-serious-performance-and-battery-life-upgrades",
  "title": "Rumored iPad 2022 spec points to serious performance and battery life upgrades",
  "category": "tablets",
  "updated": "2021-07-02T09:37:14Z",
  "author": "david-nield",
  "summary": "Goodbye 5nm, hello 3nm",
  "article": [
    "Rumblings from the Apple supply chain suggest that one or more of the iPad tablets launched in 2022 could be powered by 3-nanometer chipsets, offering substantial performance and battery life upgrades over the current 5nm silicon.",
    "That's according to Nikkei Asia (via MacRumors), which says Apple's partner Taiwan Semiconductor Manufacturing Company (TSMC) is in line to supply the necessary chipsets over the course of the next year.",
    "Shrinking down nanometer production technology to smaller and smaller numbers essentially means packing more transistors into a tighter space. The major benefits of this shrinkage are that the chipset can work faster while drawing less energy at the same time.",
    "We won't know exactly how big the performance and battery life gains will be until Apple actually launches the tablet in question, but TSMC says 3nm architecture can increase processing performance by 10-15% while reducing power draw by 25-30%, compared to 5nm. Apple will have its own tweaks and optimizations to add too.",
    "What the report doesn't make clear is which iPad this is going to apply to in 2022. The most powerful tablets that Apple makes are the iPad Pro and the iPad Air – both of which currently use 5nm chipsets – so they would seem the most likely to get the spec upgrade.",
    "Of the two models, the iPad Pro was updated most recently (April 2021 vs October 2020), but then the Pro does tend to get refreshed more frequently by Apple than the iPad Air does, so it might be the first Apple tablet to make it to market with a 3nm chipset.",
    "At the same time, Apple is also expanding the number of devices running on its own bespoke processors. Last November Apple launched the 5nm M1 chip, which first appeared on the MacBook Air, 13-inch MacBook Pro and Mac Mini, and has since made it into other computers and the 2021 iPad Pros.",
    "We'll have to wait and see whether the 2022 iPad Pro is the first to get the new and improved 3nm technology inside. We're also expecting the next Pro refresh to add support for the MagSafe magnetic charger standard introduced with the iPhone 12."
  ],
  "headers": {
    "4": "Choose your iPad"
  },
  "links": {
    "iPad tablets": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "Nikkei Asia": "https://asia.nikkei.com/Business/Tech/Semiconductors/Apple-and-Intel-become-first-to-adopt-TSMC-s-latest-chip-tech",
    "MacRumors": "https://www.macrumors.com/2021/07/02/apple-debut-3nm-chip-in-2022-ipad/",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPad Air": "https://www.techradar.com/reviews/ipad-air-4-review",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "2022 iPad Pro": "https://www.techradar.com/news/apples-2022-ipad-could-bring-a-major-screen-improvement",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12"
  }
}