{
  "source": "https://www.techradar.com/news/apple-is-expanding-memoji-and-accessibility-features-in-ios-ipados-and-watchos",
  "title": "Apple is expanding Memoji and accessibility features in iOS, iPadOS and WatchOS",
  "category": "phones",
  "updated": "2021-05-20T04:21:29Z",
  "author": "harry-domanski",
  "summary": "Including sign language and audio description support",
  "article": [
    "Apple has announced a slew of updates for its iPhone, iPad and Apple Watch devices that aim to make life a little easier for people with disabilities, introducing a number of accessibility features.",
    "One such feature, called SignTime, is launching today (May 20). SignTime is a service that allows those with a hearing impairment to communicate with AppleCare and Retail Customer Care using sign language via a web browser (and without the need to make a booking).",
    "The service is landing in the US, UK and France for now with plans to expand to additional countries in the future, and will facilitate each region's respective language – American Sign Language (ASL), British Sign Language (BSL), and French Sign Language (LSF).",
    "For Apple Watch users, a new feature dubbed AssistiveTouch will help those with limited mobility to interact with their device without the need to operate the touch interface.",
    "This will work via a series of sensors – the accelerometer, gyroscope, motion sensors, and optical heart rate sensor – in order to \"detect subtle differences in muscle movement and tendon activity, which lets users navigate a cursor on the display through a series of hand gestures, like a pinch or a clench\".",
    "An iPadOS update will introduce support for third-party MFi eye-tracking devices, allowing users to navigate the screen using their gaze and 'tap' using extended eye contact.",
    "For those with visual impairments, an iOS update will bring a host of improvements to the iPhone's VoiceOver screen reading technology, allowing further details in text and table data, as well as positional descriptions of people and objects within photos.",
    "All three of the aforementioned features (AssistiveTouch, eye-tracking, and VoiceOver) are due to be released in software updates 'later this year', so we don't have a concrete release date for them at this stage.",
    "Many further improvements are outlined in full in Apple's announcement, including iPhone support for bi-directional hearing aids, as well as the ability to recognize audiograms and adjust their audio to their liking.",
    "For the neurodiverse iPhone users, a new 'background sounds' feature provides \"balanced, bright, or dark noise, as well as ocean, rain, or stream sounds\" in order to block out unwanted noise and calm the user.",
    "A new set of Memoji customizations in support of inclusivity will land some time this year as well, including visual representations of cochlear implants, oxygen tubes, and soft helmets.",
    "For the exhaustive list of improvements, refer to Apple's full announcement post. While the SignTime feature is rolling out from today in supported regions, the other features will continue to drop in updates on the respective devices throughout 2021."
  ],
  "headers": {
    "8": "Further accessibility tweaks"
  },
  "links": {
    "announced": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2889968022787369000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F05%2Fapple-previews-powerful-software-updates-designed-for-people-with-disabilities%2F",
    "iPhone": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPad": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-6-review",
    "full announcement post": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3968254593842356000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F05%2Fapple-previews-powerful-software-updates-designed-for-people-with-disabilities%2F"
  }
}