{
  "source": "https://www.techradar.com/news/maximize-performance-for-professional-tools-with-amd-ryzentm-pro-processor",
  "title": "Maximize performance for professional tools with AMD Ryzen™ PRO processors",
  "category": "news",
  "updated": "",
  "author": "sponsored",
  "summary": "A perfect balance of performance and productivity.",
  "article": [
    "Today’s work environment is more flexible and demanding than it has ever been. Knowledge workers are required to jump between video calls, continually research projects and competitors, build presentations, and more, often all at the same time.",
    "Whereas often teams were able to focus on one task at a time and collaborate in the office to get answers and complete tasks, now everyone is having to shift to a more distilled, yet still demanding, workflow.",
    "As a result, employees are demanding more from their computers than they have ever before. Not only do they need the power and performance to keep them going throughout their workflow, they also need the flexibility to do their jobs from anywhere.",
    "AMD, a global leader in processor technology, built its Ryzen™ PRO 5000 Series mobile processors specifically to tackle the challenges of the new professional workforce.",
    "These processors offer the advanced technology needed to maximize performance for professional applications and collaboration tools essential to business productivity, anywhere.",
    "Power",
    "Each of the 5000 series processors is built on the industry leading Zen 3 architecture from AMD which features a completely redesigned chip architecture to allow for even more performance over the previous generation.",
    "Compared to the current 11th generation Core i7 and Core i5 processors from Intel, the AMD Ryzen™ PRO 7¹ and PRO 5² series processors saw up to 23% faster performance in Microsoft Office applications such as Excel¹.",
    "This performance is made possible by the up to eight available high performance processing cores designed to provide responsive multitasking across productivity, collaboration, and content creation apps.",
    "Professional applications often have demanding compute requirements and the AMD Ryzen™ PRO 5000 series delivers exceptional single-threaded and multi-threaded performance to handle the full spectrum of professional tools.",
    "Whether you need incredibly fast responsiveness for a powerful application or you need speed and reliability when multitasking, the AMD Ryzen PRO 5000 series can help handle it all.",
    "Security",
    "Business professionals need more than just raw power in today’s new work environment. With employees working from a wide variety of locations, keeping data secure is more vital than ever.",
    "Every AMD Ryzen™ chip is designed from the ground up with multiple layers of security to protect and secure sensitive data from even the most sophisticated attacks. AMD Secure Processor is integrated directly into the chip to help protect sensitive data and Memory Guard provides real-time encryption of system memory to protect against physical attacks.",
    "New for the AMD Ryzen™ PRO 5000 series is AMD Shadow Stack, which offers hardware enabled protections against control-flow attacks.",
    "The AMD Ryzen™ PRO 5000 Series Mobile Processors also fully support Microsoft Secured-core PC initiative, which helps protect from firmware vulnerabilities, shield the operating system, and prevent unauthorized access to devices and data.",
    "Portability",
    "Power and security doesn’t help much if your team can’t work where they need to. The AMD Ryzen™ PRO 5000 series are designed to give you the perfect balance of performance, security, and portability so you can have peace of mind that your team can get the job done and your company’s data is secure.",
    "AMD strikes this balance by optimizing the responsiveness of navigating through daily tasks to ensure you get the performance you need without draining the battery unnecessarily. Instead of pulling lots of power to push demanding applications, processing power is intelligently delivered where it’s needed more and conserved when it’s not.",
    "Using the industry-standard MobileMark 18 battery life benchmark, the HP Elitebook 835 G8 was able to achieve up to 20 hours of battery life with a Ryzen 7 PRO 5850U processor.",
    "As the needs and demands of business and professionals continue to evolve, IT leaders are faced with the ever more challenging task of providing workers the tools they need to do their jobs in a wide range of environments.",
    "To ensure your team has the power, security, and portability they need, make sure your PCs are equipped with the new AMD Ryzen™ PRO 5000 Series Mobile Processors.",
    "1. Testing as of 12/8/2020 by AMD Performance Labs utilizing MSI Prestige 14 Evo with Intel® Core i7-1185G7 processor @ 28W TDP, Intel(R) Iris(R) Xe Graphics, 16 GBytes RAM - 4267 MHz, Kingston Technology SSD Drive with Win Pro vs. AMD Reference Design with Ryzen 7 PRO 5850U mobile processor @ 15W TDP, ATI/AMD Ryzen PRO 5000 Series - Internal GPU , 16GB LPDDR4 RAM - 4266, Samsung 970 Pro 512GB Drive with Win Pro, Using the following tests: PCMark® 10 Benchmark, PCMark® 10 Gimp Cold App Startup (seconds), PCMark® 10 APP Performance Overall , PCMark® 10 App Performance_Word, PCMark® 10 App Performance_Excel, PCMark® 10 App Performance_PowerPoint, PCMark® 10 App Performance_Edge. PC manufacturers may vary configurations yielding different results. Results may vary. PCMark® is a registered trademark of Futuremark Corporation. CZP-16",
    "2. Testing as of 12/8/2020 by AMD Performance Labs utilizing DELL XPS 13 9310 with Intel® Core i5-1135G7 processor, Intel(R) Iris(R) Xe Graphics, 16 GBytes RAM - 4267 MHz, Micron 2300 NVMe 512GB Drive with Win Pro vs. AMD Reference Design with Ryzen PRO 5000 Series processor, ATI/AMD Ryzen PRO 5000 Series - Internal GPU , 16GB LPDDR4 RAM - 4266, Samsung 970 Pro 512GB Drive with Win Pro, Using the following tests: PCMark® 10 Benchmark, PCMark® 10 Gimp Cold App Startup (TTC) seconds, PCMark® 10 APP Performance Overall , PCMark® 10 App Performance_Excel, PCMark® 10 App Performance_Edge, . PC manufacturers may vary configurations yielding different results. Results may vary. PCMark® is a registered trademark of Futuremark Corporation. CZP-08"
  ],
  "headers": {},
  "links": {}
}