{
  "source": "https://www.techradar.com/news/bjorn-again-is-the-abba-voyage-digital-concert-tech-the-future-of-live-music",
  "title": "Bjorn again: Is the Abba Voyage digital concert tech the future of live music?",
  "category": "entertainment",
  "updated": "2021-09-06T10:24:54Z",
  "author": "gerald-lynch",
  "summary": "Can hologram-like representations of Abba live up to the band's heyday?",
  "article": [
    "My my! Abba are back – but not as you’ve ever seen them before.",
    "It’s been forty years since the Swedish foursome, responsible for some of the most recognisable songs in pop music history, last released new music. But Agnetha Fältskog, Björn Ulvaeus, Benny Andersson, and Anni-Frid Lyngstad are back with new tracks – a new album, Abba Voyages, to be released in November 2021 – and more excitingly, new live shows.",
    "Except, Abba themselves won’t be present at the shows, set to take place in London from May 2022. Instead, they’ll be there in digital form – and de-aged to appear just how they were at the height of their powers toward the end of the 1970s.",
    "Teaming up with George Lucas’s Industrial Light and Magic (ILM), the Abba Voyage shows will see the band perform ‘live’ night after night, having had a performance (choreographed by Wayne McGregor, resident artist at London’s Royal Ballet) recorded in 3D in front of 160 cameras by a motion capture team. This footage was directed by Baillie Walsh, and produced by Johan Renck (worked on the superb Chernobyl TV show) and Svana Gisla, who teamed up with Renck on promo videos for David Bowie’s final record, Blackstar. The talent behind the camera is just as astonishing as it is in front of it, then.",
    "These recordings were then handed over to close to 1,000 digital artists at four of ILM's global studios, who used archive footage to take the scans of the band and roll back the years, ready for a performance that will give the illusion that the band of the 70s have been teleported to the roaring 2020s.",
    "“We’re truly sailing in uncharted waters. With the help of our younger selves, we travel into the future,” Benny Andersson told the Guardian.",
    "This isn’t the first time we’ve seen digital representations of much-loved artists. Remember Tupac’s surprise digital resurrection at the 2012 Coachella festival? It was the start of a whole new industry for holographics performances, with long-dead stars returning to stages around the world. And while it’s not an identical technology to what Abba is using (which appears to be a form of advanced 2D projection giving the appearance of depth), it’s conceptually the same.",
    "David Nussbaum, CEO of PORTL, a telecommunications company that uses hologram-like projection technology to beam lifesize appearances of individuals in real time anywhere around the world, has worked on many such hologram gigs throughout his career.",
    "“We would bring lots of dead people back to posthumously perform in sold out cities around the country and around the world,” he told TechRadar. Nussbaum worked on live performances from departed artists like Jackie Wilson, Billie Holiday and even Whitney Houston (for a duet with the very-much-alive Christina Aguilera, for an episode of the US version of The Voice which never aired).",
    "While such gigs have primarily been used to bring back deceased performers Nussbaum anticipates that this is just the beginning of creative uses of bringing both the living and dead to new performance locations – and to preserve them for future ages to enjoy.",
    "“You can hit the record button on any of these performances and create hologram jukeboxes,” posits Nussbaum.",
    "“Imagine going to the Rock and Roll Hall of Fame or any of these artist Hall of Fames and instead of seeing a picture on a wall, or a plaque, or statue, seeing the artist performing the music that he or she was made famous for. Imagine interacting with them, talking to them, having them talk back. I believe people are most excited by physical interaction, close up, experiences, and almost having that VIP to share the same space as these as these amazing performers”",
    "Nussbaum’s PORTL tech, though primarily envisaged for business use, could be similarly applied to the performance space.",
    "Its box-like appearance offers “25,000 lumens of super bright white interior light, all projecting onto a single projection area where a 4k resolution image is revealed, the content. It works in almost all forms of light,” describes Nussbaum.",
    "“You can pre record any piece of content and play it back. It's great for advertising, it's great for conventions and stuff. It’s the evolution of the mobile phone, it's the evolution of holograms. We would be able to beam you in real time to interact with any person in any venue, around the world on a whim.”",
    "Unless you have ready access to a time machine, you’re not going to be able to head back to Abba’s late 70s heyday and see them in all their pop pomp and glam glory. So this really is as good as it’s going to get.",
    "And all the signs point to this being a really well considered venture for the band, and a special experience for its legion of fans. From the care that’s gone into the motion capture, to the fact it’s taking place in a purpose-built arena, specially designed to best present the tech in a flattering and convincing manner, suggests we could be in for the time of our lives at the shows.",
    "Abba Voyage has a benefit that all previous, similarly-tech-fuelled revivals and resurrections have lacked – all members of Abba are alive and well. So not only do the designers of the show have classic archive footage to base performances on, but they’ve been able to work alongside the band themselves, capturing the mannerisms and movements exactly before applying a lick of de-ageing paint to the foursome. In addition, it’s not necessarily a karaoke show either – all four members have been back in the studio, laying down new recordings and vocals of the classic hits. It may be a pre-recorded show, but at least it’s one that will have never been heard before opening night.",
    "Perhaps most appealing though is the price – with the digital Abbatars performing five times a week (sometimes with two performances happening per day), ticket prices have been able to stay relatively low, with the cheapest starting at just £21 a pop. Performing takes a great physical effort, particularly for older stars, but the Abba Voyage tech means the band can ‘play’ night after night without burning out, allowing for more shows and cheaper tickets.",
    "“I think this will be a regular thing that people do,” says Nussbaum, “instead of jumping on a plane, spending six or seven hours in the air, getting checked into a hotel.",
    "“This is going to be what people prefer. It not just saves them money and saves them time but it's saving the Earth. I've seen over the last 18 months companies not just saving millions or even billions of dollars in air travel, but their carbon footprint goes down to virtually nothing.”",
    "In a post-covid age, this could be a glimpse at a potential future of touring for bands – record a motion capture show, and send the digital files to be broadcast anywhere in the world from the largest arenas to tucked away theatres. It may never capture the full experience of an in-the-flesh, sweaty star singing their hearts out and all the potential spontaneity that comes with it. But for bands entering their twilight years, it’ll let the songs keep playing long after their last notes have been sung."
  ],
  "headers": {
    "6": "The next generation of live performance",
    "15": "Will it be any good?"
  },
  "links": {
    "Guardian": "https://www.theguardian.com/music/2021/sep/02/abba-reunite-for-voyage-first-new-album-in-40-years",
    "David Nussbaum, CEO of PORTL": "https://www.portlhologram.com/"
  }
}