{
  "source": "https://www.techradar.com/news/why-im-selling-my-dji-mavic-2-pro-for-the-dji-air-2s",
  "title": "Why the DJI Air 2S has convinced me to sell my DJI Mavic 2 Pro",
  "category": "cameras",
  "updated": "2021-04-17T16:00:00Z",
  "author": "james-abbott",
  "summary": "Opinion: The Air 2S is actually an upgrade from its pricier sibling",
  "article": [
    "I’ve been the happy owner of a DJI Mavic 2 Pro for a couple of years, and during this time I’ve been hugely impressed with its flying performance and camera. I’ve also flown and reviewed almost every consumer DJI drone released in the last few years, but it’s only now that I’m starting to think about upgrading my drone – and that's all thanks to the arrival of the DJI Air 2S.",
    "As a reviewer who frequently handles some of the best new camera gear money can buy, it takes something truly special to catch my eye – otherwise I’d be pretty skint. Most recently it’s been the DJI Air 2S that has caught my attention; a drone weighing 595g and featuring a 20MP 1-inch sensor is a very attractive proposition to an outdoor photographer who often carries both stills cameras and a drone while out shooting.",
    "Getting the weight of my kit down is always a challenge, so the Air 2S raises a tantalizing question: should I sell my DJI Mavic 2 Pro (vital stats: 907g and 214×91×84mm folded) and use the cash to buy the brand new Air 2S, which weighs only 595g and folds down to only 180×97×80mm.",
    "Sure, the folded size isn’t dramatically different, but that weight saving of 312g (plus smaller and lighter batteries) simply can’t be ignored. And it's not the only reason I'm looking to sell my Mavic 2 Pro.",
    "I’m primarily a stills photographer, so it’s my normal camera kit that takes priority in my bag while out shooting. When I was originally considering which drone to buy in 2018, I wanted something compact and lightweight, and the three best options at the time were the DJI Mavic Air, DJI Mavic 2 Zoom and DJI Mavic 2 Pro.",
    "I ended up buying the Mavic 2 Pro for a few simple reasons. Firstly, it’s smaller and lighter than the Phantom series thanks to its foldable design. It also offers a larger 1-inch sensor than the original Mavic Air and Mavic 2 Zoom. And lastly, its adjustable aperture could be used to increase depth-of-field alongside providing the ability to adjust exposure while shooting video on the fly.",
    "At the time, the Mavic 2 Pro was also producing the best quality images of all of DJI’s consumer drones. And to be honest, it’s still up there with the best, so I’m positive that buying this drone was indeed the best choice. Only a smaller and lighter DJI drone with a 1-inch sensor could ever have a chance of making me consider a replacement...",
    "I reviewed the DJI Mavic Air 2 last year and loved it, but moving down in sensor size felt like a step backwards, so I never thought much more about it. But when the Air 2S came along it was a completely different story.",
    "In terms of general flight features, flight modes and safety features, there’s not a huge amount to choose between the Mavic 2 Pro and Air 2S. Of course, the newer Air 2S offers upgraded features in most areas, but these improvements, while welcome, don’t make a huge difference to flying or overall image quality. So, what makes the Air 2S a potentially more appealing drone than the Mavic 2 Pro?",
    "The Air 2S features a 20MP 1-inch sensor, while the camera provides an 88-degree field of view and full-frame equivalent focal length of 22mm with a fixed f/2.8 aperture. There’s also a digital zoom with works well up to 2x, but zooming in any further looks rubbish and needs to be avoided. Still, the advantage here is that you can fly at safe and legal distances from people and buildings, but zoom in 2x to get a much closer shot.",
    "The main differences with the Mavic 2 Pro are that it also offers a 20MP 1-inch sensor, but does this with an equivalent focal length of 28mm and an adjustable f/2.8-f/11 aperture. This is particularly useful when shooting video because if the light changes you can change the aperture, rather than always needing to land the drone to change the ND (Neutral Density) filter.",
    "Still, the Mavic Air 2S, in the Fly More Bundle, comes with a set of four ND filters, which during my testing were perfect for controlling shutter speed while shooting video in a range of conditions. I did miss the flexibility of an adjustable aperture, but the reduction in weight of the Air 2S makes the loss of this useful feature much more palatable.",
    "In terms of image quality, the Air 2S and Mavic 2 Pro are very similar – there’s a whisker between them, too little to influence any decision over which is better.",
    "But one area where the Air 2S excels is in high ISO handling, which is traditionally terrible with drones when set to anything above ISO 100. With the Air 2S, images taken at all ISO settings are extremely clean up to ISO 3200, and it’s only at ISO 6400 where chroma and luminance noise become more noticeable, but not much.",
    "The reason for this is that DJI applies 'Temporal Denoising Technology' to raw files in-camera to reduce high ISO noise. The results are fantastic, but correcting any image characteristics that might be deemed negative in a raw file using in-camera processing could be seen by some as slightly misleading. Especially when there doesn’t be an option to turn the feature on and off. Plus, the idea of a raw file is that it’s exactly that – raw and unprocessed.",
    "I’ve never been a fan of automatic in-camera raw processing, and fortunately, you see it rarely, but it nearly always relates to noise handling. I would certainly prefer the option to be able to turn off the feature, but for a drone that’s not my main camera, it’s not a dealbreaker. However, if this technology was applied to my main stills cameras with no option to turn it off, I certainly wouldn’t have bought any of them.",
    "Where the Air 2S does excel in image quality is in video resolution – you get up to 5.4K at 30fps, 4K at up to 60fps and 1080p at up to 120fps. The Mavic 2 Pro is capable of a slightly more pedestrian 4K at 30fps and 1080p up to 120fps, which is fine for the majority of people.",
    "Both drones shoot in D-Log (10-bit) and HLG (10-bit) for professional video, alongside Standard mode for footage that doesn’t need to be processed and color-graded, so there's no real downgrade here by moving to the Air 2S either.",
    "Overall, the main reason I’m upgrading from my Mavic 2 Pro to the Mavic Air 2S with the Fly More Bundle is all down to those weight savings. Combined savings of around 500g when carrying two spare batteries alongside one in the drone is pretty significant.",
    "I mainly shoot stills with my drone, so losing the ability to change aperture isn’t the end of the world. And since image quality in terms of video and stills is so similar, this again points to the weight saving of carrying a lighter drone with smaller and lighter batteries.",
    "The Air 2S' application of de-noising to raw files in-camera to reduce high ISO noise is annoying, but hopefully the ability to turn this off will arrive in a firmware update. And if not, the results do look good – so on this occasion, I could overlook it. Plus, in reality, 99% of my shooting is at ISO 100 anyway.",
    "Thinking about upgrading or changing any photographic kit takes a lot of thought, and while I haven’t taken the plunge on the Air 2S just yet, my Mavic 2 Pro is being gently eased back into its box."
  ],
  "headers": {
    "4": "High and Pro",
    "7": "Air force fun",
    "12": "Twin peaks",
    "18": "Light and airy"
  },
  "links": {
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s",
    "DJI Mavic Air": "https://www.techradar.com/reviews/dji-mavic-air",
    "DJI Mavic 2 Zoom": "https://www.techradar.com/reviews/dji-mavic-2-zoom",
    "DJI Mavic Air 2": "https://www.techradar.com/reviews/dji-mavic-air-2-review"
  }
}