{
  "source": "https://www.techradar.com/news/are-blenders-healthy-or-do-they-destroy-nutrients",
  "title": "Are blenders healthy or do they destroy nutrients?",
  "category": "appliances",
  "updated": "2021-09-28T09:30:00Z",
  "author": "helen-mccue",
  "summary": "Healthy smoothies are quick and easy to make in a blender but do the sharp rotating blades also damage delicate nutrients?",
  "article": [
    "Increasing the amount of fruit and vegetables in our diets is an easy way to eat more healthily. As well as ensuring we’re getting the right level of dietary fiber, which aids digestion and prevents constipation, it will also increase the amount of vitamins and minerals consumed too.",
    "The best blenders can blitz fruit and vegetables into a refreshing drink, which contains more fresh produce than you’d consume if you were eating it whole. However, blenders are extremely versatile and can also be used to make dips, sauces and even desserts.",
    "So it’s no surprise, at least 90% of US households report owning at least one personal or full size blender with eating healthier being the top reason for using this appliance more, research by the Association of Home Appliance Manufacturers revealed.",
    "Furthermore, 31% of blender users say they are using their appliance more because they’re drinking more smoothies. Smoothies are blended drinks that can contain fruit and vegetables, and in many cases yogurt, milk, oats, and nut butters.",
    "However, there are also lots of extra ingredients that can be added to boost the nutrient content even further such as chia seeds, ground flaxseed and protein powder. Most blenders have very high-speed sharp blades designed to completely pulverize everything in the pitcher including tiny seeds in raspberries and strawberries.",
    "With all these healthy ingredients in one refreshing drink, blending must be healthy, right? Turns out it’s not quite as cut and dried as that, as blenders can generate heat, which can destroy nutrients.",
    "Got your mind set on getting a blender? Rather than read on and find out if they’re healthy, check out the best prices for some of our top models.",
    "Some blenders produce heat from the blades when they’re switched on for prolonged periods, this heat can affect nutrients. Some B vitamins, as well as vitamins C, A, D, E and K, can all be damaged and reduced by heat. It’s not just vitamins either, some minerals like potassium and magnesium will also be affected.",
    "But before you ditch your blender in the trash, it’s important to remember that this heat is very minor in comparison to cooking and only for a very short time. Yes, you may lose a small amount of heat-sensitive nutrients if your blender gets warm but not as much as you would through boiling or cooking foods in an oven, which means blended raw foods are still a good option.",
    "The other way nutrients are lost in the blending process is through oxidation, this happens when fruits and vegetables are cut and exposed to oxygen. When you slice an apple and leave it, oxidation is the process that causes it to turn brown. Oxidation is a common process that happens not just when fruits and vegetables are blended but when they’re chopped, shredded, or peeled too.",
    "It’s not something you need to be too concerned about because it’s not a process that is exclusive to blending and will happen with many other food preparation methods too.",
    "Fiber plays an important role in slowing down the digestion of sugar when you eat whole fruits and vegetables. Fiber doesn’t get destroyed by your blender, but the blending process releases fructose sugar and makes it easier to absorb, so if your smoothie contains lots of fruit, this can mean you’re more likely to get spikes in blood sugar than if you were eating the fruit whole.",
    "Often, it’s the more inexpensive and lower quality blenders that can produce lots of heat when blending, so to minimize this problem it’s worth investing in one of the best blenders. The other way to reduce heat when blending is to blend for the minimum possible time, the longer you blend for - the more heat will be produced, so stick to short bursts and stop as soon as you’ve achieved the result you’re looking for.",
    "Oxidation is a natural process, which can’t be stopped. However, if you leave your smoothie in a glass or container that’s not sealed before drinking it, further oxidation can occur. So it's a good idea to drink your smoothies as soon as you make them. Again, blending for the minimum time required will reduce the amount of oxygen sucked into the blender during the blending process so will help to reduce nutrient loss.",
    "There’s little you can do to stop the fiber being broken down by your blender, but by adding plenty of low sugar leafy greens and vegetables like celery and cucumber you can reduce the overall sugar content. It’s also important that you still consume whole fruits and vegetables and don’t rely on smoothies for all of your five daily portions of fruits and vegetables.",
    "The short answer is no, blended smoothies contain stacks of macro and micronutrients that aren’t affected by heat or oxidation and can still be included as part of a healthy balanced diet. Plus, if it’s a choice between missing out on these nutrients altogether and getting them in the form of a smoothie, then it’s better to have them than not at all.",
    "Get the most from your smoothies by including a variety of different ingredients like fruits, vegetables, nut butters, seeds, oats, and yogurt."
  ],
  "headers": {
    "7": "So, do blenders destroy nutrients?",
    "12": "How to reduce nutrient loss when blending",
    "15": "Should I give up blending?"
  },
  "links": {
    "best blenders": "https://www.techradar.com/best/best-blenders",
    "Association of Home Appliance Manufacturers": "https://blog.aham.org/facts-about-blenders-a-kitchen-staple/"
  }
}