{
  "source": "https://www.techradar.com/news/prime-members-get-an-echo-dot-for-just-dollar099-in-this-early-amazon-prime-day-deal",
  "title": "Prime members - get an Echo Dot for just $0.99 in this early Amazon Prime Day deal",
  "category": "smart-home",
  "updated": "2021-05-20T11:02:07Z",
  "author": "alex-whitelock",
  "summary": "Amazon is practically giving this device away",
  "article": [
    "Amazon Prime Day is slowly closing in now, and, while we're still a few weeks away from the big day itself, there are already some great goodies being dropped for Prime members.",
    "Case in point - this Amazon Echo Dot and Amazon Music Unlimited bundle for just $8.99 (was $39). With this promotion, new customers don't even have to wait until the official Amazon Prime Day deals to bag one of the best small smart speakers around for just $0.99 - it's being offered for that price right now alongside a month of Amazon Music Unlimited.",
    "Ok, so there are a few caveats to consider here. Firstly, this promotion is currently available to new customers only - which we interpret as customers who don't already own an Echo device or are existing Amazon Music Unlimited subscribers. Secondly, like all Amazon Prime Day deals you do need to be an Amazon Prime member to be eligible for this discount. Finally, it's not the latest Amazon Echo model, but the slightly older 3rd generation on offer here.",
    "That last point, while not optimal, isn't much of a dealbreaker in our eyes. The leap from the 3rd generation to the 4th generation of Echo Dot devices brought mostly aesthetic changes, so you're still getting a really great little smart speaker here. The latest generation also retails for $49.99 currently, so the bang-for-the-buck is unquestionably better with this deal.",
    "If you'd prefer to wait for the big day itself, you can see what to expect in our guide to the upcoming Amazon Prime Day Echo deals."
  ],
  "headers": {
    "4": "Not an Amazon Prime member?"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "for just $8.99 (was $39)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB0873B5ZVQ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3665518090006538000-20",
    "for $49.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07XJ8C8F5%2Fr%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1127109815292361000-20",
    "Amazon Prime Day Echo deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-echo-deals-a-slew-of-early-bargains-already-live"
  }
}