{
  "source": "https://www.techradar.com/news/apple-macbook-air-might-be-getting-a-major-design-overhaul-for-2021",
  "title": "Apple MacBook Air might be getting a major design overhaul for 2021",
  "category": "computing",
  "updated": "2021-01-23T12:04:39Z",
  "author": "carly-page",
  "summary": "'Thinner and lighter' laptop might also bring back MagSafe charging",
  "article": [
    "Apple’s next-generation MacBook Air will reportedly ditch USB-C in favour of MagSafe charging, a feature also tipped to be returning to the 16-inch MacBook Pro.",
    "Bloomberg News reports that Apple is working on a “thinner and lighter” version of the MacBook Air that is planned to be released during the second half of 2021 “at the earliest”, or in 2022.",
    "Much like Apple’s rumored 16-inch MacBook Pro (2021), the redesigned MacBook Air will reintroduce the magnetic MagSafe charger, ditching the USB-C port that debuted on recent MacBooks.",
    "MagSafe, for the uninitiated, was a proprietary connection that quickly and easily connected, and disconnected, to a MacBook via a magnet. If the cable was accidentally pulled, the MagSafe connector would safely come away from the MacBook without damaging it - unlike the USB-C charger that ships with current MacBooks.",
    "The incoming MacBook Air is also likely to feature reduced bezels surrounding its 13-inch screen and two USB 4 ports, and Apple’s next-generation ARM-based processor, which will succeed the M1 that features inside Apple’s latest MacBook Air laptop, according to the report.",
    "Bloomberg News also notes that Apple considered launching a larger 15-inch version of the MacBook Air, but has scrapped those plans.",
    "The redesign of the MacBook Air doesn’t sound as drastic as the rumored design overhaul of the MacBook Pro. According to an earlier report from Bloomberg, Apple is planning to kill off the controversial Touch Bar on the next-generation 16-inch MacBook Pro.",
    "The thin touchscreen that sits above the MacBook’s keyboard has divided opinion since it was first introduced on the 15-inch MacBook Pro in 2016. Some sing its praises, while others claim it’s not as good as the physical buttons it replaced.",
    "The redesigned 16-inch MacBook Pro is also expected to feature squared-off sides like the iPad Pro and a built-in SD card reader."
  ],
  "headers": {},
  "links": {
    "tipped to be returning to the 16-inch MacBook Pro": "https://www.techradar.com/news/apple-could-be-killing-off-one-of-the-macbook-pro-16-inchs-most-controversial-features",
    "Bloomberg News": "https://api.narrativ.com/api/v0/redirect/?url=https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2021-01-22%2Fapple-aapl-plans-new-macbook-air-with-magsafe-macbook-pro-with-sd-card-slot%3Fsref%3DkKj7hWAI%26utm_campaign%3Dsocialflow-organic%26utm_content%3Dtech%26utm_source%3Dtwitter%26cmpid%3Dsocialflow-twitter-business%26utm_medium%3Dsocial%26cmpid%253D%3Dsocialflow-twitter-tech&a=1730137996912196571&uuid=6db3b75c-1baf-4f7e-925d-9463335cdca6&uid_bam=1729030545528318348&ar=1730138127537557592",
    "MacBook Air": "https://www.techradar.com/reviews/macbook-air-2020",
    "15-inch MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-15-inch-late-2016"
  }
}