{
  "source": "https://www.techradar.com/news/expressvpn-executive-facing-fine-over-uae-spying-probe",
  "title": "ExpressVPN executive facing fine over UAE spying probe",
  "category": "computing",
  "updated": "2021-09-16T15:25:24Z",
  "author": "mayank-sharma",
  "summary": "Executive is charged for his role in Project Raven",
  "article": [
    "(ed: ExpressVPN has issued a statement on its website explaining the role of Daniel Gericke in more details and why the company has stuck with his CIO.)",
    "Daniel Gericke, chief information officer of ExpressVPN, is among the three former US intelligence and military personnel who have agreed to jointly pay a fine of more than $1.6million to resolve cybercrime charges against them.",
    "According to a release issued by the US Department of Justice (DoJ), the three have been charged for their involvement in Project Raven, where they allegedly worked as mercenary hackers for the United Arab Emirates.",
    "“Despite being informed on several occasions that their work for U.A.E. CO, under the International Traffic in Arms Regulations (ITAR), constituted a “defense service” requiring a license from the State Department’s Directorate of Defense Trade Controls (DDTC), the defendants proceeded to provide such services without a license,” explains the DoJ.",
    "The DoJ explains that three have decided to pay the fine to resolve the charges that included overseeing the creation of “zero-click computer hacking and intelligence gathering systems” for the UAE government.",
    "According to reports, Project Raven, first exposed in 2019, involved the creation and use of zero-click surveillance tools by the UAE allegedly against vocal critics of UAE’s human rights record.",
    "The three defendants have now agreed to cooperate with US authorities and pay the fine in exchange for deferred prosecution.",
    "The release notes that the three have also forfeited foreign and US security clearances and face future employment restrictions, though ExpressVPN stressed in an email to CNET that its trust in Gericke \"remains strong.\"",
    "\"We've known the key facts relating to Daniel's employment history since before we hired him, as he disclosed them proactively and transparently with us from the start. In fact, it was his history and expertise that made him an invaluable hire for our mission to protect users' privacy and security,\" ExpressVPN told CNET.",
    "Notably, the DoJ resolution comes on the heels of ExpressVPN’s acquisition by Kape Technologies in a deal valued close to $1 billion.",
    "Via CNET"
  ],
  "headers": {
    "5": "Busy week for ExpressVPN"
  },
  "links": {
    "statement on its website": "https://xvtelink.com/blog/daniel-gericke-expressvpn/?a_fid=744&data1=trd-us-8276931627154627000",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "According to a release": "https://www.justice.gov/opa/pr/three-former-us-intelligence-community-and-military-personnel-agree-pay-more-168-million",
    "exposed in 2019": "https://www.reuters.com/investigates/special-report/usa-spying-raven",
    "zero-click surveillance tools": "https://www.vice.com/en/article/3aq9a5/us-company-sold-zero-click-exploit-project-raven-uae",
    "privacy": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "ExpressVPN’s acquisition": "https://www.techradar.com/news/expressvpn-to-join-kape-in-largest-deal-ever-in-vpn-industry",
    "CNET": "https://www.cnet.com/tech/services-and-software/expressvpn-cio-among-three-facing-1-6-million-doj-fine-project-raven/"
  }
}