{
  "source": "https://www.techradar.com/news/rewatching-the-x-files-heres-an-exciting-way-to-do-it-in-2021",
  "title": "Rewatching The X-Files? Here's an exciting way to do it in 2021",
  "category": "entertainment",
  "updated": "2021-06-25T16:59:08Z",
  "author": "andy-kelly",
  "summary": "The truth is out there",
  "article": [
    "So you want to rewatch The X-Files. Understandable – it's one of the best science fiction TV series ever made, and some baggy '90s suits aside, hasn't aged much at all. But 218 episodes is a big commitment, especially with a hundred other, newer shows vying for your attention. But there is a way to rewatch The X-Files that's not only less time consuming, but also lets you experience Chris Carter's influential series in a way that makes it feel like a completely different show.",
    "There are two distinct types of X-Files episode: 'Monster of the Week' and what's known as 'Mytharc'. Monster of the Week episodes are mostly self-contained stories where Mulder and Scully encounter bizarre paranormal phenomena – whether it's the sewer-dwelling monster known as the Flukeman, stretchy serial killer Eugene Victor Tooms, or something more subtle, but no less terrifying, like the fluorescent flesh-eating alien bugs in Darkness Falls.",
    "Elements of the larger mythology will sometimes crop up in these episodes, but for the most part they're pretty standalone. Mytharc episodes, on the other hand, are part of a continuing arc that spans all 11 seasons. When the show originally aired, they would usually appear after a few Monster of the Week episodes, slowly building a twisting, mind-bending narrative about secret government experiments, shapeshifting bounty hunters, sentient black oil, and even an extraterrestrial plot to colonize the Earth.",
    "Even though the Monster of the Week episodes are arguably the best ones, if you want to experience The X-Files in a new way, consider a Mytharc-only rewatch. That means no standalone episodes – only ones that tie into the mythos and contribute to the overarching plot. This amounts to 78 episodes (plus the first X-Files movie from 1998), and it's an interesting, and occasionally very weird, way to relive this story.",
    "If you've never seen The X-Files before, don't even think about watching the show this way. It was never intended to be viewed like this. But for fans looking to revisit the series, who know every Monster of the Week episode inside out, it's worth doing at least once.",
    "You can find a suggested watch order at the end of this article, but for now, let's lay out some of the reasons why you should do a Mytharc rewatch – and, for balance, some reasons that it could be a bad idea. Because it can be, let's say challenging, at times.",
    "It totally transforms the pace of the show",
    "The X-Files is generally a pretty leisurely series, with lots of great character development, time spent exploring the agents' personal lives (as well as the supporting cast), and plenty of offbeat comedy episodes to lighten the mood. This is obviously great, and part of the show's magic. But when you mainline Mytharc episodes, suddenly it becomes a fast-paced, relentless, and exciting sci-fi thriller, with superb action set pieces and beloved characters constantly throwing themselves into wild, dangerous situations.",
    "Everything makes more sense",
    "The problem with a regular rewatch is that, by the time the next Mytharc episode comes along, you've lost track of what's going on. \"Wait, who's Kryceck working for again? The Syndicate did what? Uh, why don't those guys have faces?\" But watching them back to back, wrapping your head around the increasingly complex mythology is a lot easier. It also gives you a newfound appreciation for how Chris Carter and his team constructed the story over the years. It's less confusing than you remember. Seriously.",
    "The revelations come thick and fast",
    "When The X-Files originally aired, Mytharc episodes were pretty spaced out. You could wait weeks, or even months, for a resolution to something. And even binging the show today on a streaming service, there's still a lot to get through before you learn the truth about its many tangled plot threads. But there are no such issues with a Mytharc rewatch. It's quite the opposite, in fact: you're positively overloaded with information, and pretty much every episode uncovers some massive new revelation to mull over. It's overwhelming (more on that later), but hugely entertaining and satisfying.",
    "The characters don't get room to breathe",
    "A lot of the best character moments happen in the relatively chill Monster of the Week episodes. In the frantic, dramatic Mytharc episodes, Mulder and Scully rarely get any downtime to hang out, joke around, and learn about each other. This happens almost exclusively in the 'between' episodes, and this wonderfully written character development makes the emotional life-or-death situations in the mythology episodes hit way harder.",
    "It reveals too much, too fast",
    "When The X-Files was on TV, a Mytharc episode was almost like a reward for your patience. You've made it this far, now here's a killer two-parter to end the season and give you a big, gratifying hit of new mythology. As we explained earlier, this means the plot is constantly in motion, and you're never left hanging. The downside of this is that the show's central mysteries are exposed and stripped of their mystique a little too quickly. Usually it would take a hundred episodes to learn some of these earthshaking plot details – but in this rewatch it takes half that, which isn't always a good thing.",
    "The quality dips, sometimes quite severely",
    "The truth is, as good as The X-Files is, it really loses its way around season 6 – especially where the mythology is concerned. It's still fun to watch, but compared to the heights of seasons 3, 4, and 5, it's clear the writers were running out of ideas and hitting narrative dead ends. On a regular rewatch, the still-great Monster of the Week episodes soften this dip in quality, which makes a Mytharc rewatch quite challenging in places. But, thankfully, it picks up again towards the end of the show's pre-revival run.",
    "If you've decided a Mytharc rewatch is for you, here's the best way to do it. Some of these technically aren't Mytharc episodes, but introduce characters who are important to the mythology – for example, the first appearance of Alex Krycek in Sleepless, and the introduction of X in The Host.",
    "We've also added some episodes, Conduit being a prime example, that don't explicitly tie into the arc in a major way, but reveal additional details about key events such as the abduction of Mulder's sister, Samantha. In short, this episode selection is about as exhaustive as it gets.",
    "Season 1 (1993)",
    "Pilot / Deep Throat / Conduit / Fallen Angel / E.B.E.",
    "Season 2 (1994)",
    "Little Green Men / The Host / Sleepless / Duane Barry / Ascension / One Breath / Red Museum / Colony / End Game / Anasazi",
    "Season 3 (1995)",
    "The Blessing Way / Paper Clip / Nisei / 731 / Piper Maru / Apocrypha / Talitha Cumi",
    "Season 4 (1996)",
    "Herrenvolk / Musings of a Cigarette Smoking Man / Tunguska / Terma / Leonard Betts / Memento Mori / Tempus Fugit / Max / Zero Sum / Demons / Gethsemane",
    "Season 5 (1997)",
    "Redux / Redux II / Christmas Carol / Emily / Patient X / The Red and the Black / Travelers / The Pine Bluff Variant / The End",
    "The X-Files: Fight the Future (1998)",
    "Season 6 (1998)",
    "The Beginning / Dreamland / Dreamland II / S.R. 819 / Two Fathers / One Son / Biogenesis",
    "Season 7 (1999)",
    "The Sixth Extinction / The Sixth Extinction II: Amor Fati / Sein Und Zeit / Closure / En Ami / Requiem",
    "Season 8 (2000)",
    "Within / Without / The Gift / Per Manum / This Is Not Happening / DeadAlive / Three Words / Vienen / Essence / Existence",
    "Season 9 (2001)",
    "Nothing Important Happened Today / Nothing Important Happened Today II / Trust No 1 / Provenance / Providence / Jump the Shark / William / The Truth",
    "Season 10 (2016)",
    "My Struggle / My Struggle II",
    "Season 11 (2018)",
    "My Struggle III / Ghouli / My Struggle IV",
    "The X-Files is now streaming on Disney Plus via Star in the UK, and Hulu in the US."
  ],
  "headers": {
    "6": "Why you should do a Mytharc rewatch of The X-Files",
    "12": "Why you might not want to do a Mytharc rewatch",
    "18": "Episode guide to a Mytharc rewatch of The X-Files"
  },
  "links": {}
}