{
  "source": "https://www.techradar.com/news/intel-declares-war-on-amd-with-demo-of-tiger-lake-8-core-laptop-cpu-gaming-at-5ghz",
  "title": "Intel declares war on AMD with demo of Tiger Lake 8-core laptop CPU gaming at 5GHz",
  "category": "computing",
  "updated": "2021-03-19T11:24:18Z",
  "author": "darren-allan",
  "summary": "Total War declared, in fact, with demo showing the strategy battler running smoothly",
  "article": [
    "Intel has shown off an incoming 8-core Tiger Lake laptop CPU running a game demo at 5GHz across multiple cores.",
    "This happened at the GDC Showcase virtual conference in a session presented by Roger Chandler, who is VP and general manager of Client XPU Products and Solutions at Intel, as spotted by VideoCardz.",
    "It’s made clear that this is a Tiger Lake-H (10nm) Core i9 8-core (16-thread) processor, although the exact model isn’t given, but what we are told is that it is running at 5GHz on more than a single core (it’s a fair bet that this is the flagship Core i9-11980HK, given that feat).",
    "The game being demonstrated is Total War and it looks like the Tiger Lake chip copes well with the masses of CPU-taxing on-screen action, keeping things running nice and smoothly (presumably with integrated graphics – although it isn’t made clear what the rest of the system spec of the preproduction ‘enthusiast’-level laptop is).",
    "The presentation also underlined at several points that Tiger Lake-H delivers 20 PCIe Gen4 lanes, to support PCIe 4 SSDs and discrete GPUs, for better performance all-round.",
    "The overall positioning here is a mobile chip with “desktop-caliber performance” and Chandler confirms the expected Q2 launch for the Tiger Lake-H range, so we’ve not got long to wait. Computex, which takes place at the start of June, has been widely bandied about as the most likely launch platform for Intel.",
    "Recent rumors indicate that the 11980HK will have a TDP of 45W, but will supposedly offer a 65W mode which could be the avenue for multiple cores to reach 5GHz boost speeds, as (theoretically) seen here. Thermals and cooling will, of course, be another major part of the puzzle in terms of sustaining this kind of performance.",
    "It’s thought that the flagship Core i9-11980HK will be backed up by a Core i9-11900H and Core i7-11800H which will also be 8-core and 16-thread mobile processors, but with somewhat slower clock speeds (as you would expect). Previously, 11th-gen Tiger Lake laptop chips topped out at quad-core models, although these are still impressively competitive."
  ],
  "headers": {
    "6": "Power up"
  },
  "links": {
    "Tiger Lake": "https://www.techradar.com/news/intel-tiger-lake-announced-to-power-the-next-generation-of-laptops",
    "VideoCardz": "https://videocardz.com/newz/intel-demos-8-core-16-thread-tiger-lake-h-cpu-running-at-5-0-ghz",
    "Tiger Lake-H": "https://www.techradar.com/news/intel-tiger-lake",
    "Recent rumors indicate": "https://www.techradar.com/news/the-latest-intel-11th-gen-tiger-lake-leak-might-disappoint-you",
    "these are still impressively competitive": "https://www.techradar.com/news/year-in-review-how-intel-did-in-2020"
  }
}