{
  "source": "https://www.techradar.com/news/how-tcl-is-leveraging-its-vertical-integration-to-outpace-competitors",
  "title": "How TCL is leveraging its vertical integration to outpace competitors",
  "category": "audio-visual",
  "updated": "",
  "author": "sponsored",
  "summary": "TCL has the parts it needs",
  "article": [
    "When you buy a product from any brand, it may seem logical that that company was behind the entire creation of the product. But for complex items, like phones and TVs, that can be far from the case.",
    "A car you buy will have parts coming from all over the place. It can have wheels made by one company, windows maybe by a second, and a transmission made by a third. A TV may sound a lot simpler compared to a car, but it can similarly have its display panel built by one supplier, its processor built by another, and it may only be the assembly and housing that are made by the brand you see on the TV’s label.",
    "While that may be the natural order of things for many companies, it’s not always advantageous. TCL does things a bit differently.",
    "TCL has been making TVs and phones for years, and it has all the production capabilities it needs to build many of its products entirely on its own. For instance, Chris Larson, the former vice president of sales and marketing and now senior vice president for TCL of North America, told Forbes, “We make our own plastic. We mold our own cabinets. We make our boards. We even have a factory that makes speaker drivers. The only thing we have to buy, really, is the main processor and the memory that goes along with that.”",
    "This vertical integration is allowing TCL to operate more quickly, coming out with new products that leverage newer technologies at a pace that can outstrip competition and undercut costs. Other companies that don’t have this vertical integration have to wait on their suppliers to send them samples before they can finalize the design of their products, which makes for a delay between the time a new technology is introduced and when it shows up in a completed product.",
    "Since TCL is fully involved in the development of the new technologies that will go into its products, it can be ready to incorporate them as soon as they’re finished. Lason says, “We know exactly what is going to be coming off the line in four, five, or six months, and can design a TV around it today.”",
    "TCL has already used its vertical integration to make many compelling TVs. It is driving the market forward with QLED, 4K, 8K, and even Mini-LED displays, and many of its products cost far less than its competitors’ offerings. TCL’s expertise isn’t limited to just TVs though.",
    "The company is working on many more product categories. TCL has recently begun to put out its own smartphones with the latest 5G connectivity, and it’s doing so at a fraction of the price of other smartphones. It has also been able to take its TV expertise and apply it to its phones, as is the case with TCL’s NXTVISION image processor, which works for both the phone displays and its cameras.",
    "Kevin Wang, the CEO of TCL Industrial Holdings said, “With our unique mix of manufacturing expertise and vertical integration, TCL can now offer a full ecosystem of products, while looking into a future that will create a fully integrated and connected experience for our customers.”",
    "So, we can expect to see plenty more coming from TCL with technologies and prices that lead the pack.",
    "Learn more about TCL here."
  ],
  "headers": {},
  "links": {
    "Learn more about TCL here": "https://www.tcl.com/global/en.html?utm_source=tg&utm_medium=tgblog&utm_campaign=tcl&utm_term=home&utm_content=blog"
  }
}