{
  "source": "https://www.techradar.com/news/macbook-air-2022-could-get-mini-led-screen-and-no-controversial-notch",
  "title": "MacBook Air 2022 could get Mini-LED screen – and no controversial notch",
  "category": "computing",
  "updated": "2021-10-22T15:10:10Z",
  "author": "darren-allan",
  "summary": "But it could be divisive in another way, if white bezel speculation is on the money",
  "article": [
    "Apple’s next MacBook Air might come equipped with a Mini-LED screen like the new MacBook Pros – maybe minus the notch – when it purportedly arrives in mid-2022, as well as an M2 chip, with an off-white color keyboard and bezels.",
    "All this is the latest we’re hearing from the grapevine, so as ever, be cautious around this rumored info, which comes from a few tweets by known Apple leaker Dylandkt, and DigiTimes.",
    "The DigiTimes report claims the Air could arrive with Mini-LED tech, though note that it’s couched in terms of Apple being ‘likely’ to use the new screens for an incoming MacBook Air 13.3-inch due at some stage in 2022, according to the usual anonymous industry sources. (As well as purportedly adopting Mini-LED for the iPad Pro 11, as a side-note).",
    "DigiTimes has previously claimed that Mini-LED is inbound for the MacBook Air 2022, as has well-respected Apple analyst Ming-Chi Kuo‌.",
    "Dylandkt, the other source here, also isn’t sure on the Mini-LED front, observing similarly that it’s ‘likely’ to happen, but without ProMotion tech (which allows for faster refresh rates). Interestingly, the Twitter-based leaker isn’t sure on the notch either, and can’t confirm its presence yet, but the Air apparently won’t have Face ID (but then neither do the new MacBook Pros with the notch).",
    "Away from the display, Dylandkt makes a variety of other assertions about the MacBook Air which he believes will arrive mid-2022.",
    "That includes the (fanless) laptop getting MagSafe and a 1080p webcam, with color options similar to the iMac 2021 (which has seven colors on offer). The MacBook Air 2022 will supposedly have a keyboard with full-size function keys which is off-white in color, plus the bezel will be off-white too (again like the iMac).",
    "Dylandkt further notes that the “design will be similar to the new MacBook Pro while being thinner, lighter”, and that there will be no SD card slot, no tapered design, and no HDMI port. Oh, and as expected it’ll run with the M2 chip.",
    "Many of these rumors have been floated before, and indeed Dylandkt tweets to say as much, crediting Jon Prosser and Ian Zelbo for their previous digging and speculation sharing.",
    "The main point here, of course, is the display. On one hand, it makes some logical sense that Apple would look to push Mini-LED tech to more devices, including the iPad Pro 11 and the MacBook Air. On the other hand, the MacBook Air remains the only vaguely budget-friendly Apple laptop, and the inclusion of Mini-LED would inevitably push the price skywards – and that wouldn’t go down well.",
    "Indeed, Dylandkt does say that the starting price of the Air is expected to have a ‘slight’ increase for the 2022 offering, but if Mini-LED is incoming, we’d expect it’d be more than a touch of a price hike. We remain skeptical around this one, then, although there’s always the possibility that Apple could keep the current MacBook Air around if the 2022 model debuts with Mini-LED, and that’d represent the wallet-friendly choice. In much the same way that the MacBook Pro 13-inch remains on sale alongside the new costly MacBook Pros.",
    "The notch has proved divisive on the freshly revealed MacBook Pro 14-inch and 16-inch models, so the possibility that it may not come on a Mini-LED-toting MacBook Air will doubtless please some folks. If the white bezel rumor comes to fruition, though, that could prove just as controversial as the dreaded notch, as many folks aren’t keen on that, seeing it as a distracting color for the screen surround…",
    "Via MacRumors (1), (2)"
  ],
  "headers": {
    "9": "Analysis: How would Mini-LED pan out, price-wise?"
  },
  "links": {
    "Apple’s next MacBook Air": "https://www.techradar.com/news/macbook-air-2022",
    "DigiTimes": "https://www.digitimes.com/news/a20211015PD206.html",
    "iPad Pro 11": "https://www.techradar.com/reviews/ipad-pro-11-2021-review",
    "well-respected Apple analyst Ming-Chi Kuo‌": "https://www.techradar.com/news/macbook-air-2022",
    "observing": "https://twitter.com/dylandkt/status/1451273814105632774",
    "iMac 2021": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "notes": "https://twitter.com/dylandkt/status/1451273783051005954",
    "much": "https://twitter.com/dylandkt/status/1451371248785711110",
    "current MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pro 14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "16-inch models": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "1": "https://www.macrumors.com/2021/10/22/2022-macbook-air-mini-led-display-rumor/",
    "2": "https://www.macrumors.com/2021/10/21/macbook-air-2022-details-leaked/"
  }
}