{
  "source": "https://www.techradar.com/news/sylveon-is-finally-in-pokemon-go-heres-how-to-get-it",
  "title": "Sylveon is finally in Pokémon Go – here's how to get it",
  "category": "phones",
  "updated": "2021-05-26T15:24:18Z",
  "author": "axel-metz",
  "summary": "What's in a name?",
  "article": [
    "Sylveon has finally been added to Pokémon Go, marking the last of the Eevee evolutions coming to the popular mobile game.",
    "Originally introduced in Pokémon X and Y, Sylveon is a fairy-type Pokémon adorned with pink ribbons and bows arriving to sit alongside Jolteon, Vaporeon, Flareon, Umbreon, Espeon, Leafeon and Glaceon.",
    "To get it – and let’s be honest, we all want it – you’ll have to use the naming trick, which we’ll walk you through below.",
    "The easiest way to the Eevee evolution your heart desires is to give it a specific nickname before it evolves, and Sylveon is no different.",
    "So, grab yourself an Eevee and the 25 candies you’ll need to evolve it, and then give it the nickname “Kira”. Once you do that, you should see a silhouette appear underneath the standard “evolve” button. Tap that, and you’ve got yourself a Sylveon.",
    "It’s worth bearing in mind, though, that this method only works once for each Eeveelution.",
    "For help obtaining all seven of the other Eevee evolutions through the naming trick – as well as the tricks to getting more than one – check out our guide.",
    "Pokémon Go has now been going strong for near-on five years, so where does it go next?",
    "Well, the game’s developer, Niantic, recently hinted at the future of the mega-popular mobile game, suggesting that \"exciting things are in the works.\"",
    "In an exclusive interview with TechRadar, lead product manager for augmented reality (AR) at Niantic, Kjell Bronder, described the company’s ambition to reach the multiplayer potential of Pokémon Go first established by its launch trailer back in 2016.",
    "“If you look at that original Pokémon Go trailer,” Bronder said, “you'll see that there's a lot of stuff in there we still want to do.” This coincides with the launch of Niantic’s new developer platform, Niantic Lightship, which aims to bring a host of new AR capabilities to market – suggesting Pokémon Go could be set for a major update very soon.",
    "In the meantime, catching Sylveon should keep you busy."
  ],
  "headers": {
    "7": "The end of an era?"
  },
  "links": {
    "Pokémon Go": "https://www.techradar.com/news/gaming/pokemon-go-updates-everything-you-need-to-know-about-what-s-coming-next-1330140",
    "guide": "https://www.techradar.com/how-to/pokemon-go-eevee-evolutions-guide",
    "recently hinted": "https://www.techradar.com/news/pokemon-go-developer-teases-what-the-future-holds-for-the-popular-mobile-game",
    "exclusive interview": "https://www.techradar.com/news/pokemon-go-creators-are-raising-the-bar-for-ar-again"
  }
}