{
  "source": "https://www.techradar.com/news/exclusive-gamestop-ps5-restock-time-confirmed-by-techradar",
  "title": "GameStop PS5 restock: 1,000 people bought the console from our exclusive reporting",
  "category": "gaming",
  "updated": "2021-12-10T15:29:12Z",
  "author": "matt-swider",
  "summary": "We had the scoop on the GameStop PS5 restock news ahead of today, and our exclusive details helped over 1,000 people buy the console.",
  "article": [
    "The PS5 restock at GameStop restock sold out for Tuesday, and 1,000 people bought the console by following our coverage. Our exclusive reporting confirmed the PlayStation 5 restock at GameStop well in advance of the actual restock time.",
    "Update: The GameStop PS5 restock time was actually a little early, happening at 10:57am EDT.",
    "Our exclusive news reporting nailed the GameStop PS5 restock last week, and we're back doing it again having knowledge of the retailer's PlayStation 5 in-stock dates.",
    "It was scheduled for today, Tuesday, August 3, according to our GameStop sources, and the time was later confirmed by the GameStop newsletter: 11am EDT / 10am CDT / 9am MDT / 8am PDT.",
    "The final version of the GameStop PS5 restock newsletter showed that the retailer will only have PS5 bundles, with no planned Xbox Series X restock today. In fact, we haven't seen the Sony rival with a GameStop restock since July 15.",
    "Yes, the GameStop language in its email suggested only PS5 console bundles would be available to purchase on August 3. This meant the PS5 Disc and PS5 Digital Editions are going to be in stock – and there were three bundles.",
    "Here's why this is a good thing: reseller-controlled bots are always scooping up the standalone PlayStation 5 inventory from stores like Amazon and Walmart, but it's much harder for the same resellers to profit off of bundles. The games, accessories and gift cards included are intended for gamers.",
    "Yes, GameStop is requiring anyone seeking to buy a PS5 console bundle to have its PowerUp Reward Pro membership, which costs $15 a year (or $20 if you want the print edition of the magazine Game Informer). This membership gives you access to a 'Welcome certificate' worth $5, a month reward certificate ($5 per month for a $60 annual value) and a 10% bonus on trade-ins.",
    "Of course, the most important perk right now is \"early access\" to next-gen consoles, including the PS5. GameStop has been putting up this barrier to entry as another way to prevent resellers from buying and profiting from console purchases.",
    "Important note: While the forthcoming GameStop email suggests that you need to have been a PowerUp Rewards Pro member before 12:59am EDT / 11:59pm CDT / 9:59pm PDT, we've confirmed that customers have been able to buy a PS5 console bundle after this time. Obviously, don't take that chance if you have time to buy it, but if the deadline has passed, you still have a shot.",
    "No, GameStop's language is less clear, but you're going to need a PowerUp Rewards membership that costs $15 annually. The August 2 restock suggests that it's only needed for \"early access\" but the PS5 console inventory almost always runs out before it ever opens up to the public. Only one time did it open up to everyone when a glitch happened, allowing non-members to check out through Apple Pay. That glitch has since been plugged.",
    "In other words, if you really want to buy a PS5 and don't mind spending extra on a bundle (in which everything is at face value), then the $15 is a decent offer.",
    "No, there's no in-store GameStop restock, with all orders taking place online and all of the consoles bundles bought tomorrow scheduled to ship to customers.",
    "You won't have to wait long. GameStop often delivers PS5 orders in 3-5 days, according to our analysis. That's faster than StockX or eBay, which have next-gen consoles costing more than $800 without games, taking up to several weeks to get to you.",
    "We're hours from the GameStop PS5 restock, and that means we'll have more helpful tips happening on Twitter and YouTube. If you're eager to buy the console, you'll want to stay tuned for those updates that walk you through the process of buying the system as quickly as possible. We're also tracking a potential Best Buy PS5 restock for later this week.",
    "With over 60,000 people having gotten a next-gen console through our Twitter alerts, it's only a matter of time before everyone has it. Of course, come October, it's going to be much harder to buy a PS5, so you should make your best effort today."
  ],
  "headers": {
    "1": "GameStop PS5 restock time sold out in 30 minutes",
    "4": "Was it just the PS5 consoles? Yes",
    "5": "Did GameStop have only PS5 bundles?",
    "7": "Do I need to be a GameStop PowerUp Pro member?",
    "10": "GameStop PS5 restock without a membership?",
    "12": "Will the GameStop PS5 restock happen in stores?",
    "14": "More GameStop PS5 restock updates to come"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "Xbox Series X restock": "https://www.techradar.com/news/xbox-series-x-restock-at-gamestop-date-and-time-confirmed-heres-when",
    "Best Buy PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "much harder to buy a PS5": "https://www.techradar.com/news/ps5-in-stock-august-2021"
  }
}