{
  "source": "https://www.techradar.com/news/nintendo-switch-deals",
  "title": "The cheapest Nintendo Switch bundles and deals in December 2021",
  "category": "gaming",
  "updated": "2021-12-07T16:49:07Z",
  "author": "james-pickard",
  "summary": "Here's where to find a Nintendo Switch bundle for the cheapest price.",
  "article": [
    "Christmas is a big time of the year for Nintendo Switch deals as many are looking for a cheap bundle for themselves or as the perfect gift for a loved one. Whatever your needs, we've got all the best Nintendo Switch deals right here, as well as the best bundle offers on both the standard console and the new Nintendo Switch OLED.",
    "We had high expectations of the Nintendo Switch deals that were coming on Black Friday and Cyber Monday. For the most part, they didn't disappoint. Things in the US were fairly stable as a familiar Nintendo Switch bundle was made available for another year. Meanwhile, in the UK, the recent permanent price cut to the Switch console pushed prices down even further to as low as £239.",
    "Now that those big sales events have passed, we're back to a fairly quiet offering when it comes to Nintendo Switch bundle deals. The console is completely out of stock in the US, but a new bundle has just launched at Walmart. There are still some discounts to be found, but not to the same level we saw last month.",
    "The good news - at least for the UK - is that Nintendo Switch OLED stock is still readily available as we head into Christmas. You can find the new version of the console at Amazon, Very and the My Nintendo Store right now, with a few bundle deals up for grabs as well.",
    "Remember, to play online multiplayer and get other benefits like free games, you'll want to pick up a Nintendo Switch Online subscription deal as well.",
    "So, we won't waste any more of your time: here are all the best Nintendo Switch deals available right now. Keep your eyes peeled throughout the weeks ahead in the Christmas sales and Boxing Day sales for the possibility of even bigger discounts on games and accessories later this year.",
    "The comparison chart below will bring you the best Nintendo Switch deals on the console by itself. As stock fluctuates, however, we have seen prices rise and fall with demand. Don't pay any more than the US MSRP of $299 and the UK RRP of £259, then, because as dire as stock may seem those costs do ultimately drop back down again with a new wave of inventory.",
    "Scroll down a little further for all the Nintendo Switch bundles on offer.",
    "If you're after a cheaper alternative, the Nintendo Switch Lite can be found for around $199 (£199). This handheld only console doesn't dock, however, and doesn't feature detachable Joy-Con. We're rounding up all the best Nintendo Switch Lite bundles if you want to check it out in more detail.",
    "Just because Nintendo Switch bundles are cheap might not mean they are good deals. Many retailers often include cheaper games with their Nintendo Switch bundles and still charge standard price. Games readily available for $20 - $30 can sneak their way into the premium-priced deals, lowering the overall value of the offering.",
    "In this case, it's worth picking up a Nintendo Switch bundle with a full $60 game and grabbing the cheaper title separately if you're desperate to play it. For this reason, it's always worth double checking the going price of the bundled game you're picking up against the overall cost to make sure you're getting a good deal. Nintendo Switch sales outside of busy shopping periods (Black Friday or the holidays) are more likely to try this tactic.",
    "As mentioned above, first-party releases are the games you'll want to look for in order to get the best Nintendo Switch bundle deals. These are the games that have been developed and produced by Nintendo themselves, so that's the likes of Mario Kart, Mario Party, The Legend of Zelda, Metroid and so on.",
    "As these titles do not usually fall much below their usual price (even years after launch) your best option to get them for cheap is as part of a Nintendo Switch bundle. We've seen games effectively receive discounts of up to 50% when bought as part of a bundle.",
    "The best Nintendo Switch deals are usually found around the holiday period. You'll find the year's biggest games tend to release between October and December, which gives bundles a higher value when these titles are included at a discount price. However, a new Nintendo Switch bundle generally pops up along with any big first-party release. We'll be looking out for any featuring Metroid Dread when that launches later this year to help you save some cash on your Switch.",
    "The Nintendo Switch Lite was released at just $199.99/£199.99 in 2019. That's $100/£80 less than the original Switch console. If you want to play games on the TV as well, you should go for the standard Nintendo Switch instead as the Lite is only playable in handheld mode.",
    "The Nintendo Switch Lite comes in multiple colour options. You can pick one up now in turquoise, gray, yellow or coral pink, as well as a special Pokemon Zacian & Zamazenta Edition.",
    "Looking for something to play? Some of the latest Nintendo Switch deals and bundles might not be offering the game you're looking to get into first. If not, use this price comparison chart below to find the cheapest Switch titles around.",
    "If you're looking for more multiplayer options, you might want to check out the latest Joy-Con deals. These controllers come in $10 more expensive than the Pro Controller (more on that below) but you do get two separate controllers to expand your options. Nintendo Switch deals rarely include these controllers in their bundles as well, so it's not worth holding out for a mega-bundle.",
    "Or maybe you just fancy some different colors for your own use - the Neon Red / Blue Joy-Con pack offers opposing colors to the ones the console ships with, for example (left red and right blue). Check out the latest prices below, or shop the best cheap Joy-Con sales going right now.",
    "You won't actually need a Nintendo Switch Pro controller to play any games, so don't feel pressured in to buying one. The Nintendo Switch Pro controller is a more traditional-style pad and launched alongside the Nintendo Switch. Prices aren't cheap though, starting around $69.99/£64.99. Nintendo Switch bundles have offered the Pro Controller in the past, but these are rare - and often higher value bundles setting you back a bit more cash - so we wouldn't recommend waiting for them. Check out more Nintendo Switch Pro Controller deals in our dedicated guide.",
    "Possibly not! Remember how the Joy-Con controller splits in two? Turn them sideways and you get two basic controllers, each with their own analogue stick and face buttons - the d-pad acts as face functions on the left controller. We've seen 2K's NBA series, Snipper Clips, FIFA 19, and Mario Kart being used this way for local multiplayer in both docked and tablet modes. So you get multiplayer functionality straight out of the box with no additional purchase required.",
    "However, if you want to play four-player games, then you're going to need to invest in an extra pair of Joy-Con controllers or some Pro controllers. We'd buy the Joy-Cons as a pair (see our comparison chart above) as you'll save a bit of cash over buying them separately. Better yet, if your friends own a Switch, ask them to bring their controllers to the party!",
    "Nintendo Switch bundles rarely offer extra controllers at the standard price, as these are particularly pricey gamepads. However, retailers sometimes include a Pro Controller in their Nintendo Switch sales with a slightly higher price tag.",
    "With only 32GB of internal storage, you'll be wanting to pick up a cheap memory card or two for your new Nintendo Switch for any digital purchases or the inevitable game-fixing patches. Don't fret though, they're actually surprisingly cheap, with even 64GB ones coming in at under £20/$25.",
    "What memory cards does the Nintendo Switch need? Those will be Micro SD cards also known as, depending on their size, as MicroSDHC (up to 32GB) or MicroSDXC (up to a huge 2TB soon). Nintendo also has their own branded cards, but you'll be paying more just for a label. So for now, we'd take a look at this range of cheap MicroSDXC Nintendo Switch-friendly cards."
  ],
  "headers": {
    "6": "The latest cheap Nintendo Switch deals",
    "9": "Nintendo Switch bundles: how to spot a good deal",
    "11": "The best games to get in a Nintendo Switch bundle",
    "13": "When to shop for Nintendo Switch deals",
    "20": "Do I need to buy extra controllers for multiplayer on Nintendo Switch?"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "has just launched at Walmart": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-7303772787007128000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FNintendo-Switch-with-Neon-Blue-Neon-Red-Joy-Con-12-Month-Individual-Membership-Online-Carrying-Case%2F498089523",
    "Nintendo Switch OLED stock": "https://www.techradar.com/deals/nintendo-switch-oled-stock-where-to-buy",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fgp%2Fproduct%2FB098TVDYZ3%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-6637507400521603000-21",
    "Very": "https://www.awin1.com/awclick.php?awinmid=3090&awinaffid=103504&clickref=trd-us-5406677213503644000&p=https%3A%2F%2Fwww.very.co.uk%2Fe%2Fq%2Fswitch-oled.end%3F_requestid%3D237474",
    "My Nintendo Store": "https://www.awin1.com/awclick.php?awinmid=12777&awinaffid=103504&clickref=trd-us-9331884437978855000&p=https%3A%2F%2Fstore.nintendo.co.uk%2Fen_gb%2Fconsoles%2Fnintendo-switch-consoles%2Fnintendo-switch-oled-model%2F",
    "Nintendo Switch Online subscription deal": "https://www.techradar.com/news/nintendo-switch-online-deals-prices-subscription",
    "Christmas sales": "https://www.techradar.com/news/after-christmas-sales-2020",
    "Boxing Day sales": "https://www.techradar.com/news/boxing-day-sales-january-sales",
    "best Nintendo Switch Lite bundles": "https://www.techradar.com/deals/cheap-nintendo-switch-lite-prices-bundle-deals",
    "best cheap Joy-Con sales": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "Nintendo Switch Pro Controller deals": "https://www.techradar.com/deals/nintendo-switch-pro-controller-price-sales-cheap"
  }
}