{
  "source": "https://www.techradar.com/news/new-kindle-paperwhite-leaked-by-amazon-itself-and-its-a-big-upgrade",
  "title": "New Kindle Paperwhite leaked by Amazon itself, and it's a big upgrade",
  "category": "tablets",
  "updated": "2021-09-20T17:43:44Z",
  "author": "tom-bedford",
  "summary": "And it looks like there's a 'Signature Edition' too",
  "article": [
    "If you've been patiently waiting for a new Amazon Kindle Paperwhite since the last one released in 2018, the end may be closer than that final George R R Martin book: Amazon could soon unveil a new version of its mid-range ereader.",
    "As spotted by multiple members of the r/kindle subreddit on Reddit, various regional Amazon websites have listed a new Kindle Paperwhite, with improved specs over the 2018 Kindle Paperwhite. There's also something called the Kindle Paperwhite Signature Edition, which sounds like a premium version of the base device.",
    "One of the listings was spotted on Amazon's Mexico site, while another was on Amazon Canada ; at the time of writing, both of these have been taken down by Amazon, but the images remain on Reddit, giving us a glimpse at the specs. We haven't seen any mention of the devices on Amazon's US or UK sites.",
    "The fact that the listings were removed suggests the company wasn't planning to break cover with this information just yet, but it looks like we can expect an official launch soon. We contacted for Amazon for comment, but a spokesperson told us the company had nothing to share just yet.",
    "According to the listing, the Kindle Paperwhite (2021) has a 6.8-inch screen, which is 0.8 inches bigger than the 2018 model – that size increase could mean the ereader itself is larger, or simply that the bezel around the edge is slimmer.",
    "Another display boost is that the screen will apparently be backlit by 17 LEDs, up from five on the older model – this would make the display brighter, and will improve its contrast too.",
    "The listing suggests the Paperwhite will also get an 'adjustable warm light', which we've already seen on the Kindle Oasis (2019); this lets you choose a warmer (or redder) hue, which can be more comfortable to look at especially at night.",
    "As for the Kindle Paperwhite Signature Edition, this ereader apparently has 32GB storage (compared to 8GB on the base device), auto-adjusting light sensors (likely so brightness will be changed depending on where you are) and wireless charging.",
    "Amazon started putting out Plus versions of its Fire tablets in 2020, and the Signature Edition sounds like a similar concept, but for an ereader.",
    "Finally, the Kindle Paperwhite price is listed, but we don't think it's accurate. On the Canadian page, both the new Paperwhite and the Signature Edition are listed for CAD$680, but that's a huge amount more than the CAD$139.99 of the 2018 Paperwhite, while the new 'standard' Kindle would likely be cheaper than the Signature Edition, so we assume those prices were just placeholders.",
    "The new Kindle Paperwhite sounds like a solid improvement on the three-year-old current-gen model, but we'll wait for an official confirmation from Amazon before we take any of this information as fact."
  ],
  "headers": {
    "4": "The new Amazon Kindle Paperwhite"
  },
  "links": {
    "new Amazon Kindle Paperwhite": "https://www.techradar.com/news/new-amazon-kindle-paperwhite",
    "2018 Kindle Paperwhite": "https://www.techradar.com/reviews/amazon-kindle-paperwhite-2018-review",
    "Amazon's Mexico site": "https://www.reddit.com/r/kindle/comments/prlu13/there_is_a_new_kindle_paperwhite_and_kindle/",
    "Amazon Canada": "https://www.reddit.com/r/kindle/comments/prmc26/this_one_is_from_amazon_canada_new_kindle/?utm_medium=android_app&utm_source=share",
    "Kindle Oasis (2019)": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review"
  }
}