{
  "source": "https://www.techradar.com/news/ipad-pro-2021-owners-claim-noticeable-light-blooming-on-mini-led-displays",
  "title": "iPad Pro 2021 owners claim noticeable light ‘blooming’ on Mini LED displays",
  "category": "phones",
  "updated": "2021-05-25T22:54:08Z",
  "author": "david-lumb",
  "summary": "Some Liquid Retina XDR displays are reportedly leaking light around high contrast areas",
  "article": [
    "While the iPad Pro 2021's Liquid Retina XDR display on the 12.9-inch models have gotten a lot of hype for its Mini LED displays, users have reported noticeable ‘blooming’ effects on the screen.",
    "The iPad Pro 12.9-inch’s Mini LED screen is made up of 2,500-odd local dimming zones that dim some areas down to near-total blackness for better contrast against other brightened areas, but this can result in some of the brightness ‘blooming’ or leaking into adjacent dark areas, presenting a ghostly halo effect, as PhoneArena explained.",
    "It’s not a flaw per se, just visual artifacts resulting from the Mini LED tech – but it doesn’t happen on OLED displays like those on the iPhone 12 that change light on a pixel-by-pixel basis.",
    "Apple itself acknowledges blooming effects in its Liquid Retina XDR (aka the Mini LED) screens in a support article explaining the new display tech, as MacRumors pointed out: “The Liquid Retina XDR display improves upon the trade-offs of typical local dimming systems, where the extreme brightness of LEDs might cause a slight blooming effect because the LED zones are larger than the LCD pixel size.”",
    "Whether the blooming is noticeable seems to depend on the person and environment – the effect seems to be more apparent when viewing high-contrast content (lots of dark and light sections adjacent to each other) when in a room with very little ambient lighting. In other words, if you’re sitting in the dark watching shows or movies with lots of visual contrast, the effect might be greater for you than it would be otherwise.",
    "Still, the Liquid Retina XDR display is a step up from the ‘global dimming’ in the IPS LCD screens of prior iPads (and to a lesser degree, the 11-inch iPad Pro 2021), which dims the entire screen at once – no local zones, just uniform levels of darkness and color.",
    "Apple reportedly planned to bring Mini LED screens to its next line of MacBooks – heck, even noted analyst Ming-Chi Kuo predicted 14-inch MacBooks would arrive with Apple-built M1 chipsets in Q3 2021 – but a recent rumor suggested this transition might be delayed until the 2022 lineup of laptops. While another report suggested this is the result of component shortages caused by the pandemic, we may get a better idea of Apple's plans at WWDC 2021 in June."
  ],
  "headers": {
    "5": "Mini LED, now and later?"
  },
  "links": {
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "PhoneArena": "https://www.phonearena.com/news/ipad-pro-display-blooming-issues-explained-fix-mini-led_id132334",
    "support article": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4226878091478272500&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT212527",
    "MacRumors": "https://www.macrumors.com/2021/05/24/users-notice-blooming-on-ipad-pro-xdr-display/",
    "predicted": "https://www.techradar.com/news/apple-may-have-a-14-inch-macbook-pro-coming-later-this-year-kuo-suggests",
    "Q3 2021": "https://www.techradar.com/news/new-macbooks-with-apple-chips-could-finally-fix-one-of-our-biggest-complaints-in-2021",
    "rumor": "https://www.techradar.com/news/the-latest-macbook-rumor-could-disappoint-a-lot-of-people",
    "suggested": "https://www.techradar.com/news/new-apple-macbooks-and-ipads-could-get-delayed-due-to-chip-shortages",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog"
  }
}