{
  "source": "https://www.techradar.com/news/sonys-new-wearable-neck-speaker-aims-to-make-home-working-easier",
  "title": "Sony’s new wearable neck speaker aims to make home working easier",
  "category": "audio-visual",
  "updated": "2021-07-06T16:09:01Z",
  "author": "axel-metz",
  "summary": "Stroke of genius, or another pain in the neck?",
  "article": [
    "Sony has announced a successor to its SRS-WS1 wearable speaker, the SRS-NB10, a high-concept alternative to headphone listening.",
    "A wireless neckband speaker, the SRS-NB10 is designed to rest on the shoulders of the user, allowing you to take conference calls, listen to music and “walk around in total comfort all day,” according to Sony.",
    "This time around, the audio-based wearable will come boasting up to 20 hours of battery life, a splash-proof design and the company’s Precise Voice Pickup Technology, which aims to ensure users are heard even when background noise is at its loudest.",
    "Sony says the SRS-NB10 features a full-range speaker unit that’s angled upwards, so sound is optimised for the user’s ears only. Passive radiators are embedded at the back of the speaker, too, which the brand claims will boost the bass to ensure sound is as well-balanced as possible.",
    "The clear selling point of the wireless neckband speaker, though, will be its supposedly light and comfortable design, which is intended to allow users to wear it with ease all day – even while “doing daily chores like washing up.” Thanks, Sony.",
    "The SRS-NB10 will come in a choice of charcoal grey or white – colors designed to match most home or office décor – and be available from September 2021 for around $175 / £130 / $230.",
    "This might seem like a stroke of genius from Sony. After all, what could be better for home working than a stylish, comfortable, portable speaker that can be worn all day, every day?",
    "Well, temper your expectations, because its predecessor, the SRS-WS1, was terrible.",
    "OK, it wasn’t terrible, but our verdict labelled the company’s inaugural wearable effort an extremely niche speaker that offered average sound. It didn’t have Bluetooth or a microphone, so it wasn’t particularly useful, and its sound was artificial and lacked bass.",
    "It was also $300 (about £230, AU$451), which just wasn’t good value for money.",
    "With the improvements Sony claims to have made with its successor, though, the SRS-NB10 may address those deal-breaking concerns. The wearable does now, at least, have a purpose as a workplace assistant, and sound improvements to the speaker itself appear to represent a giant leap over the disappointing dual speakers found in the SRS-WS1.",
    "It’s almost half the price, too – so could Sony’s latest effort actually prove a worthy investment?",
    "It’s too early for us to say just yet, but stay tuned to TechRadar for our review of the SRS-NB10 wireless neckband speaker when it arrives in September."
  ],
  "headers": {
    "6": "A pain in the neck"
  },
  "links": {
    "SRS-WS1": "https://www.techradar.com/reviews/sony-srs-ws1-wearable-speaker",
    "headphone": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342"
  }
}