{
  "source": "https://www.techradar.com/news/playstation-games-could-be-coming-to-your-smartphone",
  "title": "PlayStation games could be coming to your smartphone",
  "category": "phones",
  "updated": "2021-04-12T09:18:34Z",
  "author": "rhys-wood",
  "summary": "PlayStation in your pocket",
  "article": [
    "You might start seeing your favorite PlayStation franchises appearing on your smartphone in the next few years, judging by a recent job listing for Head of Mobile at PlayStation Studios.",
    "The Head of Mobile job listing was spotted on the forum site Resetera, and asks the successful candidate to “promote the vision, mission, strategy for mobile game development within PlayStation Studios.” The standout quote, though, is certainly “a focus on successfully adapting PlayStation’s most popular franchises for mobile.”",
    "Don’t expect your favorite PlayStation franchises to appear on mobile overnight, though, as the PlayStation Studios Head of Mobile job listing emphasizes a 3-5 year time frame for mobile game development.",
    "PlayStation’s ambition for mobile follows in the footsteps of other major publishers who have seen massive success within the mobile market. Both Pokémon Go and Fire Emblem Heroes showcase two lucrative mobile projects from Nintendo’s franchises. Meanwhile, both Activision and PUBG Corp have seen colossal revenues generated by Call of Duty Mobile and PUBG Mobile respectively.",
    "PlayStation itself is going through a shift in how it’s making its games available to consumers. This newfound focus on mobile gaming comes closely in the wake of the company confirming that its PS3, PSP and PS Vita storefronts will be closing down in July.",
    "As for which franchises PlayStation wishes to adapt to mobile, that remains to be seen. But by focusing on the job listing’s phrasing of “most popular franchises,” that narrows speculation down to flagship series like God of War, Horizon, The Last of Us and Ratchet & Clank.",
    "Mobile could also provide an avenue for long-neglected franchises to undergo a resurgence. Why not a Killzone battle royale, or maybe even a PaRappa the Rapper rhythm game? We can only dream."
  ],
  "headers": {
    "3": "PlayStation Go"
  },
  "links": {
    "Head of Mobile job listing": "https://boards.greenhouse.io/sonyinteractiveentertainmentplaystation/jobs/3051283",
    "Pokémon Go": "https://www.techradar.com/news/gaming/pokemon-go-updates-everything-you-need-to-know-about-what-s-coming-next-1330140",
    "Fire Emblem Heroes": "https://www.techradar.com/news/fire-emblems-heroes-brings-nintendos-strategy-series-to-your-smartphone",
    "PUBG Mobile": "https://www.techradar.com/news/pubg-mobile-season-18",
    "PS3, PSP and PS Vita storefronts": "https://www.techradar.com/news/sony-could-close-ps3-vita-and-psp-stores-in-july",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Horizon": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "The Last of Us": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Ratchet & Clank": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart"
  }
}