{
  "source": "https://www.techradar.com/news/ipad-2020-vs-ipad-air-4",
  "title": "iPad (2020) vs iPad Air 4: which Apple tablet is made for you?",
  "category": "tablets",
  "updated": "2021-08-01T10:00:49Z",
  "author": "jennifer-allen",
  "summary": "Which Apple tablet is for you?",
  "article": [
    "The cheapest current iPad out there right now, the iPad (2020), looks a tempting proposition on paper if you simply want to join the Apple ecosystem or add to your arsenal, but then there's the iPad Air 4.",
    "More expensive, the iPad Air 4 also offers more for your money. Is it worth investing and spending the extra for an iPad Air 4 or are you smart to stick with the iPad (2020)?",
    "That's a lot to ponder which is why we've looked at both tablets in-depth to figure out what's best for you. Ultimately, like so many good quality purchases, it comes down to how you plan on using your iPad.",
    "Both tablets are good purchases to make but some consumers might find it's worth spending the extra on the prowess of the iPad Air 4 while others may be just fine with sticking tightly to their budget.",
    "We've looked at all the features and specs of both tablets, while also paying attention to any design changes, pricing differences, and mostly anything else you might need to know before you head over and buy one.",
    "The standard iPad (2020) starts at £329/$329/$499 for a fairly low 32GB of storage. That price rises to £429/$429/$649 for 128GB of storage.",
    "If you want to go the cellular/4G/LTE route, that costs a bit more at about an extra £130/$130/$200 for the privilege. It does give you the practicality of not needing to rely solely on Wi-Fi though.",
    "The iPad Air 4 starts at £579/$599/AU$899 for 64GB of storage or £729/$749/AU$1,129 for 256GB of storage. Again, cellular/LTE connectivity costs more adding on about £120/$130/AU$200 to the usual price.",
    "Both tablets are available from Apple direct as well as pretty much any third-party retailer that you can think of that would normally stock tablets. While discounts are typically still fairly modest, it can be worth looking around to save a little along the way.",
    "Both the iPad (2020) and iPad Air 4 look quite similar on the surface. They have similar heights and widths and they both have rather thick bezels around the screen. Where things differ is that the iPad Air 4 is much lighter at 458 grams compared to the iPad (2020)'s 490 grams and it's also much thinner at 6.1mm compared to the iPad (2020)'s 7.5mm depth.",
    "Other than that though, the height and width are near identical with the iPad (2020)'s 250.6mm x 174.1mm x 7.5mm measurements and the iPad Air 4's 247.6mm x 178.5mm x 6.1mm.",
    "That's all remarkably similar really given the iPad (2020) offers a 10.2-inch display compared to the iPad Air 4's 10.9-inch screen but more on that in a bit.",
    "The iPad (2020)'s top bezel houses its selfie camera while the home button on the bottom offers a built-in Touch ID sensor. In contrast, the iPad Air 4's top button works as the Touch ID sensor.",
    "There are two speakers for the iPad (2020) compared to the iPad Air 4's four. They're functional if nothing impressive with the iPad Air 4 slightly better thanks to quantity and the fact its speakers are spread across the top and bottom of the device.",
    "The iPad Air 4 also has the edge with connections thanks to offering USB-C compared to the iPad (2020)'s increasingly dated feeling Lightning connection. Looking to hook up other devices? The iPad (2020) offers support for the Apple Pencil (1st generation) and Smart Keyboard while the iPad Air 4 extends that to the Apple Pencil (2nd generation), Magic Keyboard, and Smart Keyboard Folio - much like the far more expensive iPad Pro.",
    "Color choice wise, the iPad Air 4 wins. It's possible to buy in Space Gray, Silver, Rose Gold, Green, or Sky Blue, while the iPad (2020) is only available in more standard Apple colors - Space Gray, Silver, and Gold.",
    "We'll cut to the chase - the iPad Air 4 has the far superior screen. It has a 10.9-inch display that uses Apple's Liquid Retina display technology plus it uses True Tone. In comparison, the iPad (2020 is a standard 10.2-inch Retina display.",
    "That translates to a resolution of 2360 x 1640 for the iPad Air 4 compared to 2160 x 1620 for the iPad (2020). Both offer the same ppi of 264 as well as the same max brightness of 500 nits.",
    "The iPad Air 4 screen is also rather well made elsewhere too with a fully laminated display, anti-reflective coating and wide color display (P3). That all brings it more in line with the iPad Pro although obviously, it's not quite as potent.",
    "Both tablets also only offer 60Hz refresh rates with 120Hz refresh rates reserved for the top-end iPad Pro range, but at this price, that's a fair concession to make and you won't really miss the extra silky smooth browsing unless you've got used to it elsewhere.",
    "It's unlikely you're buying a tablet for its camera quality but it's nice to know that both the iPad (2020) and iPad Air 4 can take a few decent snaps when needed.",
    "The iPad (2020) has an 8MP wide camera with ƒ/2.4 aperture while the iPad Air 4 offers a 12MP wide camera and ƒ/1.8 aperture so it's clear which one is the better camera lens. Both offer a digital zoom up to 5x while the iPad (2020) offers HDR for photos and the iPad Air 4 provides Smart HDR 3 for photos, like the iPad Pro.",
    "When it comes to video recording, the iPad Air 4 clearly has the edge thanks to more powerful hardware. It can achieve 4K video recording at 24 fps, 25 fps, 30 fps or 60 fps, while the iPad (2020) sticks solely to 1080p video recording at 30 fps. There's also an advantage for the iPad Air 4 with slo-mo video too, able to support 1080p at 120 fps or 240 fps while the iPad (2020) sticks to 720p.",
    "Selfie/video call camera wise, the iPad (2020) has the very basic 1.2MP FaceTime HD camera while the iPad Air 4 bumps that up a bit to 7MP. Neither is amazing, of course, but it's a subtle but key difference for those times you want to look good when taking a call. Don't count on complex features like the iPad Pro offers, however, with no sign of Portrait Mode on the front camera.",
    "Battery life is considered to be identical on both tablets. Up to 10 hours of browsing or watching video, with up to 9 hours if you're relying on the cellular connection. Respectable enough, then.",
    "As expected, it's the hardware underneath the hood that separates the pricier iPad Air 4 from the iPad (2020). The iPad (2020) uses the older A12 Bionic chip while the iPad Air 4 has the A14 Bionic chip. Neither will compete with the far more expensive M1 chip we've seen in the iPad Pro, but it's clear the iPad Air 4 has the edge by quite a distance.",
    "Ultimately though, that all depends on how you plan on using your tablet. The iPad (2020) is still quick enough for opening apps and it's only really multitasking where the difference is noticeable so it all depends on how you use the tablet. For occasional, casual use, the iPad (2020) is more than good enough but the iPad Air 4 has the edge if you plan on using it for the odd bout of video editing or anything a bit intense (although, obviously, if that's a regular habit then you should consider an iPad Pro instead of either of these).",
    "The lowest storage options for either the iPad (2020) or iPad Air 4 are honestly too low. The iPad (2020) starts at a fairly pathetic 32GB while the iPad Air 4 begins at 64GB. You really need to invest in the larger storage options - 128GB or 256GB respectively - as there's no way to expand storage after you've bought it and you won't want to rely solely on cloud storage for your files.",
    "Both tablets run the latest iPadOS and apps are generally very well optimized. The OS continues to be arguably the best OS out there for any tablet and is generally a dream to use, although there is a slight learning curve if you're more used to Android.",
    "The iPad (2020) offers a Lightning connection while the iPad Air 4 provides a USB-C port. As mentioned previously, accessory compatibility is a little better for the iPad Air 4 as it offers support for the latest Apple Pencil, Smart Keyboard Folio, and Magic Keyboard.",
    "Both the iPad (2020) and iPad Air 4 are respectable tablets worth your time but the difference comes down to how you plan on using them.",
    "They both offer fairly similar designs with some minor tweaks, but the iPad Air 4 offers the better screen and more powerful hardware.",
    "That hardware makes a difference if you plan on using your iPad regularly. For occasional browsing and the odd game, the iPad (2020) is perfectly good enough and spending a fair bit more on the faster iPad Air 4 would be overkill. However, if you're considering doing a little video editing on the move, want to use the latest Apple Pencil, or simply like to know you have the fastest device for your money then the iPad Air 4 is a far more tempting idea.",
    "If you simply need a 'cheap' iPad then the iPad (2020) is fine but if you can stretch that bit further, the iPad Air 4 will last you a longer time. It all comes down to how far you can future proof and also how old your existing tablet is.",
    "Neither is the ultimate iPad experience (hello, iPad Pro) but the iPad (2020) is the best budget option right now while the iPad Air 4 is a happy middle ground for everyone else."
  ],
  "headers": {
    "5": "iPad (2020) vs iPad Air 4 price and availability",
    "9": "iPad (2020) vs iPad Air 4 design",
    "16": "iPad (2020) vs iPad Air 4 display",
    "20": "iPad (2020) vs iPad Air 4 camera and battery",
    "25": "iPad (2020) vs iPad Air 4 specs and features",
    "30": "Takeaway"
  },
  "links": {
    "iPad (2020)": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPadOS": "https://www.techradar.com/news/ipados-145"
  }
}