{
  "source": "https://www.techradar.com/news/cloudflare-pages-is-now-available-to-everyone",
  "title": "Cloudflare Pages is now available to everyone",
  "category": "computing",
  "updated": "2021-04-13T13:50:51Z",
  "author": "mayank-sharma",
  "summary": "Platform currently supports building static websites",
  "article": [
    "Web infrastructure company Cloudflare has opened its cloud hosting service to all users.",
    "Announced in December 2020, Cloudflare Pages enables frontend developers to build sites using Jamstack, which is a set of frameworks popular for developing and deploying websites at scale.",
    "“It’s been incredible to see what happens when you put a powerful tool in developers’ hands. In just a few months of beta, thousands of developers have deployed over ten thousand projects, reaching millions of people around the world,” wrote Rita Kozlov, Product Manager, Cloudflare Pages, while throwing open the platform for production use.",
    "In her post, Kozlov also discussed some of the new features the developers had been working on during the beta, including web analytics, built in redirects, protected previews, live previews, and optimized images.",
    "Collaboration is a big part of the new product and soon after it rolled out the beta, Cloudflare acquired automation platform Linc to give more flexibility and functionality to help its front-end developers collaborate and build webapps with ease.",
    "While Cloudflare Pages can currently only be used to build static pages, Kozlov shares that their long-term plan is to make full-stack application development a walk-in-the-park.",
    "As a production-ready product, Cloudflare Pages takes on other Jamstack supporting providers including Netlify and Vercel."
  ],
  "headers": {
    "3": "Production ready"
  },
  "links": {
    "Cloudflare": "https://www.techradar.com/reviews/cloudflare",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "December 2020": "https://www.techradar.com/news/cloudflare-is-launching-its-very-own-cloud-hosting-service",
    "build sites": "https://www.techradar.com/news/best-web-development-tool",
    "throwing open the platform": "https://blog.cloudflare.com/cloudflare-pages-ga/",
    "developers": "https://www.techradar.com/news/best-laptop-for-programming",
    "web analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "acquired automation platform Linc": "https://www.techradar.com/news/cloudflare-looks-to-make-web-app-automation-easier-with-linc-deal"
  }
}