{
  "source": "https://www.techradar.com/news/apple-m1-macs-can-now-run-photoshop-natively",
  "title": "Apple M1 Macs can now run Photoshop natively",
  "category": "computing",
  "updated": "2021-03-11T00:10:24Z",
  "author": "anthony-spadafora",
  "summary": "M1 chip support brings a serious performance boost to Photoshop",
  "article": [
    "Adobe has announced that its photo editing software Photoshop can now run natively on M1 Macs and take full advantage of the performance improvements built into Apple's new architecture.",
    "Late last year Apple unveiled its new Arm-based M1 chip alongside a new MacBook Air, MacBook Pro and Mac Mini. Unfortunately for creatives that wanted to use one of these devices as either a workstation or even a mobile workstation, many popular apps didn't support Apple's latest devices at launch.",
    "Thankfully though, software developers have been hard at work adapting their applications to run on M1 chips. For instance, you can now run Windows 10 on an M1 Mac using Parallels' virtual machine software and you will soon be able to run Android apps too as BlueStacks is working on adding support for Arm-based chips.",
    "While these two examples might not appeal to everyone, being able to run Photoshop on the latest Macs will likely be welcomed by creative professionals, web designers and others who rely on Creative Cloud to get their jobs done.",
    "According to a new blog post from Adobe, the company's internal tests on M1 Macs show a wide range of features in Photoshop running an average of 1.5 times faster when compared to similarly configured previous generation systems.",
    "The tests conducted by the company covered a broad scope of activities in Photoshop including opening and saving files, running filters and even compute-heavy operations like Content-Aware Fill and Select Subject. Additionally, its early benchmarking shows that some operations are substantially faster with Apple's new chip.",
    "However, there are still a few features that Adobe hasn't finished porting to run on the new M1 chip including Invite to Edit Cloud Documents and most notably Preset Syncing. In the end, the company decided to release Photoshop for M1 Macs without these features due to the fact that performance gains across the rest of the application were so great.",
    "Adobe plans to continue working together with Apple to further optimize the performance of Photoshop and the rest of its software over time."
  ],
  "headers": {
    "4": "M1 chip support"
  },
  "links": {
    "photo editing software": "https://www.techradar.com/best/free-photo-editor",
    "M1 Macs": "https://www.techradar.com/news/apple-m1-chip",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "virtual machine software": "https://www.techradar.com/best/best-virtual-machine-software",
    "BlueStacks": "https://www.techradar.com/news/apple-m1-macbooks-will-soon-be-able-to-run-android-apps-as-well-as-ios",
    "Creative Cloud": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "blog post": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-3819949894608519700&url=https%3A%2F%2Fblog.adobe.com%2Fen%2Fpublish%2F2021%2F03%2F10%2Fadobe-photoshop-ships-on-macs-with-apple-silicon-gains-speedier-selections-filters-and-performance-boosts.html%23gs.v8ua26",
    "Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2019"
  }
}