{
  "source": "https://www.techradar.com/news/realme-gt-is-the-brands-new-champ-and-hits-our-list-of-the-best-android-phones",
  "title": "Realme GT is the brand's new champ, and hits our list of the best Android phones",
  "category": "phones",
  "updated": "2021-06-15T15:08:00Z",
  "author": "tom-bedford",
  "summary": "Racing onto the scene",
  "article": [
    "Our list of the best Android phones is full of high-priced powerhouses, but a new champion has raced onto the scene - the Realme GT has loads of top specs but without the huge price.",
    "Launched in China in March 2021 and globally in June, the Realme GT is named after the 'grand tourer' type of luxury vehicle, and its specs and design echo that sentiment of elegance and speed.",
    "In our Realme GT review we gave it four-and-a-half stars out of five, saying \"there’s a lot to like about it, most importantly the price, as this device is a lot more affordable than its specs suggest\".",
    "We particularly liked the phone's design, powerful Snapdragon 888 processor and its 65W charging, which can power the phone to full in half an hour or less. We had some software issues, and found the phone heated up quite quickly, but these are far from deal-breakers.",
    "The cherry on top is the phone's price, as it costs just €449, which converts to about $550, £390 or AU$710. While the phone could go on sale in Australia, and already is in the UK, Realme doesn't sell its handsets in the US.",
    "We'd have ranked the Realme GT even higher in our Android phone rankings, but it's a little fiddly to buy, as in the UK you can't pick it up via a carrier and have to use the import site AliExpress.",
    "Realme is having a cracking 2021, with its GT powerhouse following on from the Realme 8 and 8 Pro which were released earlier in the year. Those devices had low prices but some impressive specs, and also received positive reviews from us.",
    "So it seems Realme is making a name for itself in the budget and mid-range markets, enough perhaps to worry the likes of Motorola and Xiaomi, which currently hold the market tight.",
    "That's impressive, given Realme isn't quite a household name, but its popularity is evidently skyrocketing: according to Counterpoint Research, Realme was the fastest-growing phone brand of 2020, rocketing up with 65% year-on-year growth in terms of market share. For context, according to the same data, Apple, Samsung and Huawei all lost market share that year.",
    "So Realme is definitely a brand to watch, and if you're interested in low-cost Android phones, you should really keep both eyes peeled on what phones come next from the brand."
  ],
  "headers": {
    "6": "A Realme year"
  },
  "links": {
    "best Android phones": "https://www.techradar.com/best/best-android-phones",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "Realme GT review": "https://www.techradar.com/reviews/realme-gt",
    "Realme 8": "https://www.techradar.com/reviews/realme-8-review",
    "8 Pro": "https://www.techradar.com/reviews/realme-8-pro",
    "Counterpoint Research": "https://www.counterpointresearch.com/global-smartphone-share/#:~:text=realme%20emerged%20as%20the%20fastest,2020%20with%2065%25%20YoY%20growth."
  }
}