{
  "source": "https://www.techradar.com/news/season-2-of-apple-tv-plus-flagship-show-finally-has-a-release-date",
  "title": "Season 2 of Apple TV Plus' flagship show finally has a release date",
  "category": "entertainment",
  "updated": "2021-06-14T14:12:13Z",
  "author": "tom-power",
  "summary": "A new day dawns for The Morning Show",
  "article": [
    "It's been 18 months since The Morning Show dropped its first season, and fans of Apple TV Plus' flagship drama series have been wondering when it'll return to their screens.",
    "Now, we have the answer. The Morning Show season 2 release date has been announced – and the first footage for its next instalment has also arrived by way of a first trailer.",
    "Announced on Apple TV Plus' social media accounts (including Twitter), The Morning Show season 2 will land on the streaming platform on September 17.",
    "The release date reveal was accompanied by the first trailer for season 2, which picks up events not long after The Morning Show season 1's final episode.",
    "As the footage shows, Alex Levy (Jennifer Aniston) has left her role as co-host of the titular news program following season 1's explosive finale. Levy's co-host Bradley Jackson (Reese Witherspoon), though, has stayed on in her role, and it appears that the duo's different paths will be a key cornerstone of season 2's plot.",
    "Check out the first trailer for The Morning Show season 2 below:",
    "Ted Lasso was Apple TV Plus' biggest show to date, and captured the level of attention the electronics giant was probably hoping the streaming service would capture from the start.",
    "Nonetheless, while it's hard to gauge how successful some of Apple's other shows have been, The Morning Show was a hit on the awards circuit. The show also got a fair bit of recognition, with Billy Crudup winning the best supporting actor Emmy for his role in the series, while Aniston and Carell also got nominations.",
    "There's a lot of potential to build on for this second season, then. And some of those curious Ted Lasso subscribers will now find a whole host of acclaimed shows to check out on the platform – like the comedy Mythic Quest, or sci-fi drama For All Mankind, which drew praise for its second season earlier this year.",
    "It feels like Apple is playing the long game, in a lot of ways, but demonstrating faith in its productions is a great starting point. We wouldn't be surprised to see The Morning Show go the distance, and get as many seasons as its creators want to tell its story."
  ],
  "headers": {
    "6": "Analysis: Apple TV Plus slowly but surely builds up its library"
  },
  "links": {}
}