{
  "source": "https://www.techradar.com/news/better-call-saul-season-6",
  "title": "Better Call Saul season 6: what we know",
  "category": "entertainment",
  "updated": "2021-09-12T21:50:06Z",
  "author": "harry-shepherd",
  "summary": "The sixth and final season of the Breaking Bad prequel is filming again",
  "article": [
    "When Better Call Saul began in February 2015, it didn't immediately catch fire like its predecessor, Breaking Bad. Presenting a slower burn character show with a lot of legal drama, over five excellent seasons it proved itself worthy – with many even praising it as superior to the show that spawned it.",
    "Now, fans have been waiting a while for Better Call Saul season 6 – and if you've been paying attention to the news lately, you'll no doubt have noticed that a big event affected the production of the show this year. Star Bob Odenkirk sadly suffered from a heart attack during filming and collapsed. He's subsequently recovered, however, which is great news, and filming resumed in September 2021. This means we're probably going to see the show return in 2022.",
    "Co-creator Peter Gould and the writers spent five years carefully developing each complex character, and now the stories of Jimmy, Kim, and the drug kingpins of New Mexico are ready to reach their climax. Speaking to Deadline, Gould says Better Call Saul season 6 is “going to be big, and it’s going to be resolved.” The co-creator has since provided more story hints to tide us over - more on that below.",
    "We already have a few clues as to who will survive, at least. As he plays a role in Breaking Bad, set six years after the prequel starts, it's essentially confirmed that Jimmy ‘Saul Goodman’ McGill is safe, but there are plenty of characters that are ripe for the chop. So let's get to it and break down what we know about the Better Call Saul season 6 release date, cast, and story. Be warned, season 5 spoilers follow.",
    "Variety originally reported that the Better Call Saul season 6 release date was 2021, but that's clearly no longer the case. Season 6 officially kicked off filming in March 2021, and this time you're getting 13 episodes rather than the usual 10.",
    "If you've been paying attention to the news, you no doubt heard that star Bob Odenkirk collapsed on set back in late July with a heart attack. As of early September 2021, the actor has thankfully recovered and filming has resumed:",
    "We weren't expecting the final season to land before the end of the year, and now we're expecting to see it roll out some time in the first half of 2022.",
    "The season 5 finale set up two major storylines: Kim against Howard Hamlin, and Lalo Salamanca versus, well, everyone. In the final scene we left Lalo fuming with rage after Gus’ failed assassination attempt. With his house ablaze and mother dead, “Lalo has vengeance in his eyes and is heading north for revenge,” Tony Dalton told the LA Times. We know Lalo survives, though, since we recall Goodman’s terrified line to Walter White in Breaking Bad: “Did Lalo send you?”",
    "One of the men with a target on his back is Nacho Varga, and Gould told The Wrap he’s “in deep, deep trouble.” Nacho disappears during the assassination, and the extended shot of Lalo fixating on the drinks he shared with Varga moments earlier confirms that he suspects his former colleague’s involvement. Nacho never appears in Breaking Bad, so don’t bet on him making it out alive.",
    "Another central Better Call Saul character missing in Breaking Bad is Jimmy’s wife, Kim Wexler, and she doesn’t seem to be on a danger-free path either. After standing up to Lalo - so she has one foot in the grave already - it seems like the taciturn attorney is getting a taste for chaos: she wants to scam goody-two-shoes Howard out of his illustrious legal career, making the newlyweds millions.",
    "Gould is also concerned for Wexler: in an interview with The Wrap, he says “The title of the penultimate episode this season was Bad Choice Road. And, certainly, Kim Wexler seems to be on a bad choice road.” In a virtual Deadline panel, Rhea Seehorn reflected on her time on the show so far, explaining that playing Kim was more complex than just \"one giant arc of this mask coming off\" as her backstory interweaves with Jimmy's present. But while Seehorn claimed to not know where her story is going yet, Gould said \"We have a lot of ideas.\"",
    "In many ways, the roles of Kim and Jimmy have reversed. Following ‘Saul Goodman’s’ near-death experience in the desert, he’s reverted back to the unsure Jimmy McGill. Speaking to Deadline, Bob Odenkirk said “Jimmy is in a vulnerable place. He’s in a weak and uncertain and frightened place inside.”",
    "We know that McGill makes it through Better Call Saul season 6, but will it be worth it? “He is an accessory to just awful, awful things, not just in the Walter White of it, but all the other things that he’s done,” Gould said to Deadline. “I feel that he has a karmic burden. Does this guy earn a happy ending?”",
    "While Gould is naturally keen to keep the upcoming story threads under wraps, he did highlight the kinds of questions we should be asking with EW, pointing us in the direction of season 6's major preoccupations. First is Gene Takovic, McGill's alter ego we see in black-and-white flash-forwards at the beginning of each season. Gould encourages us to consider \"What does this man deserve?\" as much as \" What's going to happen to him?\"",
    "Then, when asked for a final cryptic hint, he says we should \"Keep your eye on the bottle stopper\" Kim took from her office as she resigned her job as a lawyer at Schweikart & Cokely. It's hard to know what he's getting at, but this will certainly be reveal as the complex machinations of season 6 come to a head.",
    "Better Call Saul wouldn’t exist without the man himself, so Odenkirk will return as Goodman. The Better Call Saul season 6 cast list isn’t confirmed, but we’ll certainly see more from Rhea Seehorn (Kim Wexler), Jonathan Banks (Mike Ehrmantraut), Patrick Fabian (Howard Hamlin), Micheal Mando (Nacho Varga), Giancarlo Esposito (Gus Fring), and Tony Dalton (Lalo Salamanca).",
    "But while Gould has already confirmed that we won’t see Jesse (Aaron Paul) or Walter (Bryan Cranston), could we see any other Breaking Bad cameos? We were already treated to the return of Hank (Dean Norris) and his DEA buddy, Steven (Steven Michael Quezada) in season 5...",
    "It didn’t take long for Better Call Saul to justify its existence in its own right. Its undivided focus on character development makes it not only better than Breaking Bad in some ways, but one of the finest shows around. And chances are, it’s only going to get better."
  ],
  "headers": {
    "4": "Better Call Saul season 6 release date: what we know",
    "7": "Better Call Saul season 6 story: who will survive?",
    "15": "Better Call Saul cast: will more Breaking Bad characters return?",
    "17": "Will Better Call Saul season 6 outshine Breaking Bad?"
  },
  "links": {
    "Deadline": "https://deadline.com/2020/04/better-call-saul-season-5-finale-spoilers-bob-odenkirk-peter-gould-interview-1202913136/",
    "Variety": "https://variety.com/2020/tv/news/better-call-saul-renewed-final-season-1203470181/",
    "LA Times": "https://www.latimes.com/entertainment-arts/tv/story/2020-04-20/better-call-saul-breaking-bad-lalo-salamanca-tony-dalton",
    "The Wrap": "v",
    "virtual Deadline panel": "https://deadline.com/2020/06/better-call-saul-whats-next-bob-odenkirk-peter-gould-rhea-seehorn-interview-contenders-1202964910/",
    "EW": "https://ew.com/tv/better-call-saul-creator-final-season-questions/"
  }
}