{
  "source": "https://www.techradar.com/news/zoom-wants-to-power-your-whole-hybrid-working-world",
  "title": "Zoom wants to power your whole hybrid working world",
  "category": "computing",
  "updated": "2021-06-10T01:00:12Z",
  "author": "anthony-spadafora",
  "summary": "Zoom Phone Appliances combine the best of VoIP with video conferencing software",
  "article": [
    "As many employees will soon be returning to the office after working from home over the past year, Zoom has announced the launch of a new category of hardware designed for hybrid working called Zoom Phone Appliances.",
    "The company's new Zoom Phone Appliances combine the technology behind its video conferencing software with hardware from Poly and Yealink to provide users with an all-in-one desk phone solution capable of making and receiving both video calls and phone calls.",
    "Zoom's head of Zoom Phone and Zoom Rooms, Graeme Geddes explained in a press release how its new Zoom Phone Appliance program will enable workers to communicate more easily whether they're working from home or back in the office, saying:",
    "“The traditional workplace is evolving and adapting, and our goal is to empower the workforce to accomplish more by blurring the lines between voice and video. The new Zoom Phone Appliance program boasts a selection of purpose-built Zoom Phone hardware from Poly and Yealink, streamlining communications, removing friction, and enabling a powerful communications experience.”",
    "Unlike a business laptop or workstation, Zoom Phone Appliances are always on and ready for instant communication and collaboration so that workers can easily start ad-hoc or scheduled meetings, make and receive phone calls, check their voicemail and collaborate with others using content sharing and annotation.",
    "This new class of devices also makes things much easier for IT admins as they feature zero-touch provisioning and can be easily managed in one central location through the Zoom Admin Portal.",
    "While Poly and Yealink are the first hardware partners for Zoom Phone Appliances with the Poly CCX 600 Desk Phone, CCX 700 Desk Phone with integrated camera and the Yealink VP59 Smart Video Phone, others will soon follow with new devices.",
    "Zoom Phone Appliances will be available through Zoom's Hardware-as-a-Service program as well as through authorized Poly and Yealink resellers."
  ],
  "headers": {
    "4": "Zoom Phone Appliances"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "press release": "https://www.globenewswire.com/news-release/2021/06/09/2244445/0/en/Zoom-Launches-Zoom-Phone-Appliances-Empowering-the-Hybrid-Workforce.html",
    "business laptop": "https://www.techradar.com/news/best-business-laptops",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "Zoom Admin Portal": "https://www.techradar.com/news/zoom-just-got-a-whole-host-of-funky-upgrades",
    "Hardware-as-a-Service program": "https://www.techradar.com/news/zoom-launches-hardware-subscription-service"
  }
}