{
  "source": "https://www.techradar.com/news/zimaboard-lets-you-supercharge-your-smart-home-systems",
  "title": "The $69 ZimaBoard lets you supercharge your smart home systems",
  "category": "computing",
  "updated": "2021-01-25T12:18:06Z",
  "author": "mayank-sharma",
  "summary": "Device is designed to be fully open for a range of processes",
  "article": [
    "Setting up a smart home system could be set to get a lot easier thanks to a new pint-sized device that is designed to be used as a DIY, hackable server.",
    "While ZimaBoard isn’t the first of its kind, the fanless server offers a number of unique features, which would explain how it managed to reach its funding goal in less than ten minutes. The project has received pledges for over $160,000 over the weekend against its initial target of about $6500.",
    "“ZimaBoard allows users to build a personal NAS, private VPN, 4K media server, software router, and so much more,” writes Lauren Pan, founder of Shanghai-based IceWhale Technology, that’s developed the ZimaBoard.",
    "ZimaBoard is a single board computer, which unlike similar devices is powered by a 6-watt Intel Apollo Lake processor.",
    "It’s equipped with two SATA 6.0 Gb/s ports that can be used for hooking up SSDs. You also get a single PCIe 2.0 4x interface, a couple of USB 3.0 Type-A ports, two Gigabit Ethernet ports, as well as one Mini-DisplayPort that can output in up to 4K at 60 Hz.",
    "There are two versions of the ZimaBoard. The $99 ZimaBoard 216 uses 2GB of LPDDR4 RAM with 16GB of eMMC storage, while the ZimaBoard 832 retails for $179 and is equipped with 8GB of LPDDR4 RAM with 32GB of eMMC storage. Backers on Kickstarter can snag them at discounted prices starting at $69.",
    "According to IceWhale Technology, the ZimaBoard ships with Linux but is compatible with Windows, OpenWrt, pfSense, Android and LibreELEC. Pan suggests that this allows ZimaBoard to be used as a personal NAS, private VPN, a 4K media server, software router, and much more."
  ],
  "headers": {
    "3": "Open and dexterous"
  },
  "links": {
    "server": "https://www.techradar.com/best/best-linux-server-distro",
    "ZimaBoard": "https://www.kickstarter.com/projects/icewhaletech/zimaboard-single-board-server-for-creators"
  }
}