{
  "source": "https://www.techradar.com/news/dead-space-remake-could-release-as-soon-as-late-2022-according-to-a-new-report",
  "title": "Dead Space remake could release as soon as late 2022, according to a new report",
  "category": "gaming",
  "updated": "2021-08-07T09:51:58Z",
  "author": "emma-boyle",
  "summary": "We could see more before the end of the year",
  "article": [
    "EA Motive's highly-anticipated Dead Space remake could be aiming for a release window of 2022, according to a new report.",
    "The report from GamesBeat’s Jeff Grubb claims that \"sources familiar with development\" have said the game is scheduled for a \"fall 2022\" release, though this is dependent on things continuing to go according to plan.",
    "According to the report, the internal aim at EA is to see the game launch during its 2023 fiscal year. It should be noted, though, that EA itself hasn’t revealed an official release window for the game and, when approached for comment, told GamesBeat, \"We haven’t shared a release date for the game, and we don’t have any comment based on the current rumor and speculation. But we’re glad people are excited for the game!\"",
    "Given the Dead Space remake was only officially revealed to the world during EA Play Live 2021, a late 2022 release may be sooner than fans would have expected but the report goes on to say that EA is hoping to show more of the game before the end of 2021.",
    "Grubb suggests it could be something as small as dropping a new trailer on the company's YouTube page or something a little more attention-grabbing, speculating it could be \"another candidate to show up at The Game Awards in December\".",
    "Of course, taking into account that this isn’t a release window that's been publicly confirmed by EA and the continued turbulence the pandemic is causing development studios, it's probably wise not to look at fall 2022 as any kind of dead cert for Dead Space.",
    "But what can we expect from Dead Space when it does launch, whenever that may be? Well, elsewhere online, EA has posted a blog post introducing some of the game’s development team: Senior Producer Philippe Ducharme, Creative Director Roman Campos-Oriola and Art Director Mike Yazijian.",
    "Re-emphasising that Dead Space is a remake, \"rebuilding everything from scratch\" in Frostbite while keeping the same story and structure, the post touches on what the team wants to achieve with the game.",
    "The aim, according to Philippe Ducharme, is immersion, \"to have players pick up the controller and completely lose track of time\". As part of that Roman Campos-Oriola adds that the team's intention is to use the \"the super-fast SSDs on modern systems\", which allow for quick loading and unloading, to “offer a fully unbroken experience, it will be an uninterrupted sequence shot, from the start screen to the end credit, without interruption\".",
    "\"We're playing with volumetric effects,\" adds Philippe Ducharme, \"so instead of just having sprites, you’re really able to feel the depth of a room, the thickness of the air. We're playing with shadows, with dynamic lighting, so not only does it create the mood and the atmosphere, but it also has an effect on gameplay, because the player has the ability to control the lighting in certain areas of the ship. Audio also plays an important role reinforcing that sense of immersion. This is one area of the original game that still resonates with players. We are working on enhancing the experience and providing believable audio that focus on objects positioning and 3D sounds propagation.\"",
    "Despite all the new things that the latest tech is enabling the team to bring to the game, the post also makes clear that \"the main source of inspiration is the original vision for Dead Space\".",
    "According to Mike Yazijian, \"We make sure we're following the story, the art direction, everything, out of respect for the original game. We are taking the opportunity to also do away with some things that don't work, and make sure the game stays relevant to modern audiences – but even that has to be done surgically.\"",
    "When Dead Space does launch, it's expected on PS5, Xbox Series X and PC."
  ],
  "headers": {
    "6": "Expecting immersion"
  },
  "links": {
    "Dead Space": "https://www.techradar.com/news/dead-space-remake",
    "report from GamesBeat’s Jeff Grubb": "https://venturebeat.com/2021/08/05/dead-space-will-launch-in-late-2022-if-development-goes-to-plan/",
    "revealed to the world during EA Play Live 2021": "https://www.techradar.com/news/a-dead-space-remake-couldnt-come-at-a-better-time",
    "EA has posted a blog post": "https://www.ea.com/ea-studios/motive/news/meet-the-team-leading-the-remake-of-dead-space?setLocale=en-us",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}