{
  "source": "https://www.techradar.com/news/the-dos-and-donts-of-telematics",
  "title": "The dos and don'ts of telematics",
  "category": "computing",
  "updated": "2021-03-18T09:17:38Z",
  "author": "kurt-wyman",
  "summary": "Tips to help fleet managers stay on the right track",
  "article": [
    "Telematics can provide incredible insights to fleet managers about the productivity and safety of their drivers and fleet. Telematics that incorporate machine learning or artificial intelligence (AI) can even help fleet managers predict and make impactful business decisions.",
    "Since there are so many data sets available to fleet managers, implementing some best practices will help you maximize the functionality of your telematics systems and engage in useful data management.",
    "Here are some dos and don’ts of telematics to help fleet managers stay on the right track.",
    "Focus on driver safety by implementing a driver coaching system and rewarding good performance The data gathered from telematics can provide important insights into driver behavior. These insights can highlight both positive and negative patterns using AI and predictive analytics and suggest any modifications that should be addressed. Fleet managers will want to discuss these suggested modifications with drivers to reduce losses and increase safety on the roads. A driver coaching program is a great way to facilitate road safety discussions and state expectations, and the program should incorporate both written and verbal communication.",
    "Additionally, it will be important to recognize the drivers who maintain safe driving behavior and be sure to reward them (whether it be a cash bonus, gift card, etc.). This will reinforce performance as well as demonstrate that the company appreciates the actions of each individual driver. This can help mitigate driver turnover, but more importantly, decrease risk associated with poor driving.",
    "Monitor the data collected regularly and take corrective action in a timely manner By continually monitoring data collected by your telematics system, you will more easily be able to spot important patterns or potential future problems in productivity or safety. Additionally, by staying on top of the information, you are demonstrating that the company is serious about driver safety and performance, as well as the driver coaching program.",
    "Frequent monitoring also allows companies to maintain top-notch customer service since having these detailed insights on productivity and vehicle conditions can allow managers to anticipate, plan for, and prevent any foreseeable fleet-related issues that may impact delivery completion rates throughout the supply chain.",
    "As such, if any concerning patterns arise, act in a timely manner — don’t wait until the end of the week or month to receive the generated telematics data report to address matters. Take advantage of the real-time data insights provided by today’s telematics systems as these immediate data points can be used in a proactive manner to address issues surrounding fuel usage, routing, delivery delays and even inconsistencies with time spent on sites.",
    "Furthermore, newer systems allow you to customize your notification preferences. By setting up custom alerts in your telematics system, you can be notified in real-time when issues arise and fix them before the problem persists long enough to be increasingly harmful to your bottom line or employee safety.",
    "Clearly define and communicate the key metrics that you want to track Do pay attention to details, but avoid obsessing over each tiny data set. Telematics can provide fleet managers with a great deal of data, so it’s imperative to have goals and an overall operational plan. This could include benchmarks in driver productivity and efficiency, safety, fleet maintenance and any other business-related goals. By spotlighting data that makes sense for your relevant objectives, it will allow you to adjust and make decisions that move the needle in a meaningful way for your set criteria.",
    "Further to this point, be intentional with your internal communication plan and be transparent in sharing with employees which key performance indicators will be measured when they are hired. Have managers and team leads set clear expectations upfront regarding productivity and safety. Fleet managers can garner driver buy-in for safety coaching programs and performance feedback reviews by consistently communicating with employees and establishing an efficient and easy system for employees to provide feedback, address concerns and have questions answered.",
    "Another communication approach would be to start small and only focus on the most impactful metrics at first. Tracking only important data points first — such as idling rates, delivery times and basic driving behaviors — can prevent drivers from feeling overwhelmed and heavily monitored when adopting a new telematics system, and fleet managers can expand upon the initial list of tracked metrics as time goes on.",
    "Rely on telematics as the only way to evaluate employees and identify bad drivers Yes, it is important to carefully analyze the collected data, but do not use this as the sole form of driver evaluation. This could lead to distrust between managers and employees. There may have been extenuating circumstances, such as traffic delays or road accidents, that caused a reduction in driver efficiency, so make sure to review the entire situation before labeling someone as a bad driver. As discussed in the “dos,” a holistic approach to employee evaluation is rooted in open communication. By having conversations with customers, coworkers and, most importantly, the driver in question, you will gain a more accurate representation of an employee’s performance.",
    "Use telematics to micromanage or scare drivers No one wants to feel like they’re always being watched. That can just cause additional stress and anxiety about driver performance. Additionally, don’t report every single event that could be construed as non-safe, such as one-off instances of a rolling stop, speeding down or uphill and similar events. Doing so could potentially lead to “spamming” the driver and not only minimize the effectiveness of the telematics system, but create tension between employees and managers. Instead, focus on patterns of concerning behaviors or unsafe driving events rather than one-time occurrences.",
    "Monitor live streams at all times While streaming footage is incredibly useful in playing back accidents or incidents, it’s not an ideal tool for casual monitoring. Although smart dashboard cameras may capture every minute of driving time, recordings are only activated and saved when triggered by an incident or anomaly. As such, watching live streams of your drivers is not necessary, as all important driving events are captured using artificial intelligence technology.",
    "Telematics have a lot to offer fleet managers and following best practices will help them get the most out of their systems. From driver coaching and safety programs to productivity tracking to business benchmarks, telematics can provide insights into almost every area of fleet management. Smart data management and application will help fleet managers maximize the functionality of their systems. By following the dos and avoiding the don’ts, telematics will drive fleet managers to success."
  ],
  "headers": {
    "3": "Dos",
    "12": "Don'ts",
    "15": "Do telematics right"
  },
  "links": {}
}