{
  "source": "https://www.techradar.com/news/google-adds-end-to-end-encryption-to-android-messages-app",
  "title": "Google adds end-to-end encryption to Android Messages app",
  "category": "computing",
  "updated": "2021-06-16T09:55:58Z",
  "author": "joel-khalili",
  "summary": "Android Messages service will benefit from an important new data privacy feature",
  "article": [
    "Google has unveiled a series of upgrades for Android, including a new messaging feature that privacy-conscious users in particular will celebrate.",
    "In a blog post, Google revealed that end-to-end encryption (E2EE) is coming to the in-built Messages app on Android. The feature was released in beta in November, but is now rolling out to all devices with access to Rich Communication Services, or RCS (essentially, a more advanced version of SMS).",
    "The option will be available for one-on-one conversations, provided both users have RCS enabled under chat settings. When E2EE is active, a small lock icon will appear next to the send button.",
    "Google might not be renowned for its high standards of data privacy, but this latest update and early peeks at Android 12 suggest the company is making a concerted effort to improve its reputation in this area.",
    "End-to-end encryption is considered the gold standard for security when it comes to messaging. Under this system, messages are encrypted using cryptographic keys held only on users’ devices and no third-party has the power to intercept and decrypt the data.",
    "“No matter who you’re messaging with, the information you share is personal. End-to-end encryption in Messages helps keep your conversations more secure while sending,” Google explained.",
    "“It ensures that no one can read the convent of your messages as they travel between your phone and the phone of the person you’re messaging.”",
    "Although encrypted messaging via Android Messages is unlikely to tempt smartphone users away from WhatsApp, because the facility does not cover group chats nor extend to messages with iOS contacts, it’s still a step in the right direction.",
    "When it lands later this year, Android 12 will bring with it a range of additional security and privacy improvements. For example, a new privacy dashboard will give users an overview of the user data collected by specific apps. And the Android status bar will notify users whenever an application accesses the phone camera or microphone.",
    "The combined effect should be that Android users enjoy greater levels of oversight and control where their personal data is concerned."
  ],
  "headers": {
    "3": "Android encrypted messaging"
  },
  "links": {
    "upgrades for Android": "https://www.techradar.com/news/android-phones-will-get-six-new-features-and-you-dont-need-to-wait-until-android-12",
    "blog post": "https://www.android.com/google-features-on-android/summer-2021/#summer-2021-end-to-end-contents",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "encrypted messaging": "https://www.techradar.com/best/best-encrypted-messaging-app-android"
  }
}