{
  "source": "https://www.techradar.com/news/connectivity-is-now-a-top-priority-for-new-home-buyers",
  "title": "Connectivity is now a top priority for new home buyers",
  "category": "computing",
  "updated": "2021-09-03T21:46:39Z",
  "author": "anthony-spadafora",
  "summary": "Builders, home buyers, landlords and renters now see connectivity as an amenity",
  "article": [
    "The transition to working from home during the pandemic has led prospective home buyers and renters to prioritize connectivity in their new living spaces according to a new report from Samsung SmartThings.",
    "To learn more about the current trends among home buyers and renters as well as what they mean for future building development and maintenance, the company's IoT and connected device division decided to conduct a survey.",
    "When it came to smart devices, more than 81 percent of respondents said that they are familiar with connected technology and its ability to help with everyday tasks such as turning off the lights and locking doors. However, almost 75 percent said that smart home capabilities are an important feature when looking for a place to live though price has been the main deterrent for residents thinking about creating a connected home.",
    "Those surveyed also said that when it came to ranking the most important connected devices, smart cameras took the top spot followed by smart lights, smart appliances, smart speakers, smart plugs and finally smart locks.",
    "In addition to making life easier for residents, smart home devices can also be used by landlords to simplify repairs. Through systems such as Greystar, Entrata and Willow that are integrated with Samsung SmartThings, alerts are automated for faster repairs and reduced appliance downtime.",
    "By using the company's app, property managers can also make the move in and out process easier by granting and revoking access to devices and appliances remotely without having to be on-site. Additionally, maintenance tickets are automatically generated in the property management system which helps increase staff productivity by freeing up their time.",
    "At the same time, residents can use smart home devices to manage transactions and communications with their property management with ease resulting in better service for everyone.",
    "Companies such as CommScope RUCKUS and iQuee are creating connected experiences by incorporating SmartThings technology directly into new home builds. Through this integration, all of the appliances in a home are connected and new home owners already have a solid foundation to begin building out their own smart home setup.",
    "Homes, apartments and other buildings are likely only going to get smarter as IoT devices and other connected technologies improve."
  ],
  "headers": {
    "4": "Building for a connected future"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Samsung SmartThings": "https://www.techradar.com/news/you-can-now-track-energy-consumption-with-samsungs-smartthings",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "smart devices": "https://www.techradar.com/news/smart-home-devices",
    "creating a connected home": "https://www.techradar.com/news/creating-a-smart-home-could-get-you-cheaper-insurance",
    "smart cameras": "https://www.techradar.com/news/best-home-security-camera",
    "smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "smart plugs": "https://www.techradar.com/news/best-smart-plugs-and-switches",
    "smart locks": "https://www.techradar.com/news/smart-locks",
    "landlords": "https://www.techradar.com/news/smart-buildings-and-cybersecurity-what-you-need-to-know",
    "property managers": "https://www.techradar.com/best/best-property-management-software"
  }
}