{
  "source": "https://www.techradar.com/news/this-all-terrain-sports-e-bike-is-built-for-mud-speed-and-grocery-shopping",
  "title": "This all-terrain sports e-bike is built for mud, speed – and grocery shopping",
  "category": "fitness",
  "updated": "2021-05-19T15:00:00Z",
  "author": "cat-ellis",
  "summary": "Fat tires for all",
  "article": [
    "Juiced Bikes, a company known for its all-terrain sports e-bikes, has released a new version of its RipCurrent S with a step-through frame that makes it easier to hop on and off.",
    "Step-through e-bikes make a lot of sense, and manufacturers are taking note. The addition of a motor makes cycling accessible to a lot of people who'd otherwise avoid it, and the ability to mount and dismount with minimal effort makes it even more appealing to people who are perhaps a little older, are recovering from injury, or have limited mobility.",
    "The step-through design is also good for commuters, who may need to hop off quickly to wheel their bike along a pavement, and might want to ride to work in their regular clothes rather than donning Lycra shorts.",
    "Cowboy, maker of one of the best electric bikes we've tested to date, recently released a new step-through version of its fourth-generation bike, which previously only had a single frame size and design.",
    "The RipCurrent S, however, is something new. Whereas e-bikes like the Cowboy 4 are sleek machines built for city riding, the RipCurrent S Step-Through is a chunky beast with fat tires, a huge 52V power pack for charging up hills – and a rear pannier rack for carrying your groceries.",
    "The new bike is available to pre-order from today (May 19) starting at $2,699 (about £1,900 / AU$3,500). That's a very reasonable price for a mid-range e-bike, and is around the same as our current top-rated bike, the Ribble Hybrid AL e.",
    "If you're interested in the new RipCurrent S Step-Through, make sure you check out the rules on electric bikes where you live first. It's set up as a Class 2 e-bike as standard, meaning it can't be ridden without pedalling, but it can also be set up as a Class 3 model, which can be ridden using the throttle to control the speed, and is more like an electric motorbike.",
    "Territories have different rules on speed as well. The RipCurrent S can hit a top speed of 28mph, but in the UK for example, electric bikes are limited to a maximum of 15.5mph with the motor engaged."
  ],
  "headers": {
    "5": "Juiced up"
  },
  "links": {
    "e-bikes": "https://www.techradar.com/best/electric-bike",
    "RipCurrent S": "https://www.juicedbikes.com/products/ripcurrent-s-step-through",
    "best electric bikes": "https://www.techradar.com/best/electric-bike",
    "a new step-through version": "https://www.techradar.com/news/cowboys-sleek-new-e-bikes-solve-the-brands-biggest-problem",
    "Ribble Hybrid AL e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "Class 2 e-bike": "https://classic.avantlink.com/click.php?tt=cl&mi=19453&pw=27131&ctc=trd-us-3248732971028953600&url=https%3A%2F%2Fwww.aventon.com%2Fblogs%2Faventon_bikes%2Fdifference-between-a-class-123-ebike"
  }
}