{
  "source": "https://www.techradar.com/news/microsoft-is-warning-users-to-move-to-teams-before-its-too-late",
  "title": "Microsoft is warning users to move to Teams before it's too late",
  "category": "computing",
  "updated": "2021-02-03T13:00:12Z",
  "author": "barclay-ballard",
  "summary": "Skype for Business Online is being retired in six months",
  "article": [
    "Microsoft has reminded users of Skype for Business Online that the clock is ticking in the race to move across to Teams. The Redmond-based firm has told Skype for Business Online users that they have until July 31, 2021, to complete the migration.",
    "Skype for Business Online users have had plenty of time to prefer for the move, having first been informed of Microsoft’s intention to retire the solution on July 30, 2019. Nevertheless, it is clear that organizations are taking the migration at their own pace. This is why Microsoft has issued a six-month warning.",
    "For Skype for Business Online users that are already working with Teams using Overlapping Capabilities or Select Capabilities, they will have started the process of migrating workloads. The remaining months before the Skype shutdown can simply be used to double-check organizational readiness.",
    "However, it seems that some companies may struggle to have everything in place before the Skype for Business Online retirement date. The COVID-19 pandemic has certainly not helped matters, impacting the availability of IT personnel.",
    "“Some organizations may not be far along in the Teams upgrade planning process,” a Microsoft Teams blog post explained. “It’s understandable as the events of the past year have impacted strategies, priorities, and resources for so many. Don’t worry, you still have time. In fact, there are numerous examples of organizations that have made the upgrade from Skype for Business Online, or hybrid deployments or Skype for Business Server to Teams in a matter of months. With six months until retirement, we encourage you to begin planning today to accommodate the technical, process, and user scenarios that may be unique to your organization. But rest assured, there are resources to guide you step-by-step.”",
    "Helpfully, Microsoft pointed users in the direction of these resources, including Microsoft Teams admin documentation, Teams upgrade planning workshops and Microsoft Chalk Talks workshops. It also reiterated that some Skype for Business Online customers may be eligible for automated upgrades to Microsoft Teams.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Feeling the pressure"
  },
  "links": {
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4509325228705020400&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-teams-blog%2Fskype-for-business-online-retires-in-six-months-what-you-need-to%2Fba-p%2F2108481&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-warning-users-to-move-to-teams-before-its-too-late",
    "ZDNet": "https://www.zdnet.com/article/microsoft-warns-youve-only-got-six-months-to-move-from-skype-for-business-online-to-teams/"
  }
}