{
  "source": "https://www.techradar.com/news/baldurs-gate-3-could-get-nvidia-dlss-when-it-arrives-in-2022",
  "title": "Baldur’s Gate 3 could get Nvidia DLSS when it arrives in 2022",
  "category": "gaming",
  "updated": "2021-07-09T12:36:42Z",
  "author": "darren-allan",
  "summary": "Devs appear to be on the brink of testing the frame rate boosting feature",
  "article": [
    "Baldur’s Gate 3 should hopefully be getting DLSS support when it launches at some point next year.",
    "Developer Larian Studios is ready to spring a new patch next week (Patch 5) for the early access game on Steam, and studio head Swen Vincke let us know that the release of the full game should come “hopefully somewhere in [20]22”, as PC Gamer reports. That does leave a little room for doubt, although obviously enough concrete promises are something it’s very unwise to make as a game developer.",
    "Furthermore, Wccftech flagged up that a denizen of Reddit (a certain ‘makisekurisudesu’) spotted info on the Steam Database which points to Baldur’s Gate 3 being readied for testing Nvidia DLSS, hinting that it may get support for Team Green’s nifty frame rate boosting feature at some stage down the line.",
    "Naturally, don’t take that for granted, but Larian has previously indicated that ray tracing support is something that it’s aiming to include for the RPG at launch. DLSS would come hand-in-hand with that, theoretically, and help players achieve smooth frame rates if they want to turn on ray-traced shininess.",
    "The previous Patch 4 for Baldur’s Gate 3 added the druid class, with Patch 5 – which will debut on July 13 – set to change camping, as well as giving the dice-rolling mechanics an overhaul (now displaying modifiers during rolls), among other tweaks."
  ],
  "headers": {
    "3": "Smoothing things over"
  },
  "links": {
    "Baldur’s Gate 3": "https://www.techradar.com/news/baldurs-gate-iii-may-just-be-the-future-of-pc-rpgs-and-im-so-here-for-it",
    "PC Gamer": "https://www.pcgamer.com/baldurs-gate-3-will-release-hopefully-somewhere-in-2022/",
    "Wccftech": "https://wccftech.com/baldurs-gate-3-dlss/",
    "The previous Patch 4 for Baldur’s Gate 3 added the druid class": "https://www.techradar.com/news/baldurs-gate-3-gets-druid-class-loaded-dice-and-more-in-latest-patch"
  }
}