{
  "source": "https://www.techradar.com/news/cybershoes-could-offer-true-vr-movement-on-oculus-quest-2",
  "title": "Oculus Quest 2 gets a boost from immersion-enhancing Cybershoes",
  "category": "wearables",
  "updated": "2021-05-26T16:00:00Z",
  "author": "rhys-wood",
  "summary": "Cybershoes could prove that you were born to run",
  "article": [
    "A new model of Cybershoes, bespoke footwear simulating natural movement through virtual reality via actual foot motions, is now available to buy on Amazon. The shoes will work with a range of compatible games on Oculus Quest and Oculus Quest 2 VR headsets, including In Death: Unchained and The Wizards – Dark Times.",
    "After a successful crowdfunding campaign, we'd heard the new Cybershoes would come in May as a refined version of the prototype we saw at CES 2019 built to work with the new Oculus Quest 2.",
    "The latest wireless Cybershoes model is available to purchase on Amazon in the US for $349 (around £250 / AU$450). There’s currently no word as to whether this Oculus Quest 2-compatible Cybershoes model will be made available globally, however.",
    "Cybershoes slip over your actual shoes like a snug sandal and communicate wirelessly with your Oculus Quest 2 VR headset. When the user (who remains seated) ‘slides’ the shoes along the ground to simulate walking or running, the action is mimicked in-game, allowing players to control their movement and speed in a natural way.",
    "Cybershoes CEO Michael Bieglmayer explained the decision to launch the product on Amazon, stating: “Launching on Amazon is huge for us because it allows easier access to Cybershoes for Quest gamers who might have been on the fence for our crowdfunding campaigns.”",
    "As such, it looks like the company is preparing Cybershoes to become more readily available in the near future. As previous Cybershoes models have been made available globally, we expect this new model to follow suit in due time.",
    "Current Cybershoes models already support big-name VR titles like No Man’s Sky, Half-Life Alyx and Boneworks. And soon, the new Cybershoes model will be compatible with classic first-person shooters like Return to Castle Wolfenstein, Doom 64 and Ultimate Doom – just when you thought id Software’s iconic and demonic shooter couldn’t be ported to anything else.",
    "Cybershoes as a product potentially bridges that immersion gap for VR, where players are still expected to move around with traditional analog controls. We love the idea of using them to move Leon around in the upcoming Resident Evil 4 VR, for example, desperately sprinting from chainsaw-wielding psychopaths as fast as our legs can carry us."
  ],
  "headers": {
    "4": "One, two, buckle my Cybershoe"
  },
  "links": {
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "heard": "https://www.techradar.com/news/vr-cybershoes-that-let-you-walk-on-the-spot-ready-for-oculus-quest-this-may",
    "prototype": "https://www.techradar.com/news/cybershoes-are-a-visceral-way-to-move-in-vr-at-ces-2019",
    "No Man’s Sky": "https://www.techradar.com/news/games-of-the-generation-no-mans-sky-does-exploration-in-the-best-possible-way",
    "Half-Life Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "Resident Evil 4 VR": "https://www.techradar.com/news/resident-evil-4-vr-resurrects-the-classic-game-for-oculus-quest-2"
  }
}