{
  "source": "https://www.techradar.com/news/ps-plus-free-games-for-june-include-another-brand-new-ps5-game",
  "title": "PS Plus free games for June include another brand new PS5 game",
  "category": "gaming",
  "updated": "2021-05-26T17:05:17Z",
  "author": "samuel-tolbert",
  "summary": "Strap in for another great month",
  "article": [
    "Sony revealed the latest games headed to PlayStation Plus via a post on PlayStation Blog. In June, PS4 and PS5 players can look forward to three new games: Operation: Tango, Star Wars: Squadrons and Virtua Fighter 5: Ultimate Showdown.",
    "For Operation: Tango, only the PS5 version is being offered on PlayStation Plus, even though the game is also available for purchase on PS4. The game features co-op as players work together in the roles of a hacker and agent, providing very different perspectives on shared problems.",
    "Star Wars: Squadrons does not have an official PS5 version but the game does look better and run smoother on Sony's high-end console, similar to other games with small improvements but not a fully separate version.",
    "Additionally, anyone who owns a PSVR headset can play through the entirety of Star Wars: Squadrons in virtual reality. Players take on the role of an Imperial or New Republic pilot across the campaign and multiplayer, engaging in vicious dogfights with iconic craft like the X-Wing or TIE Fighters.",
    "Virtua Fighter 5: Ultimate Showdown is also a PS4 game, providing classic fighting game action in local co-op or online.",
    "Operation: Tango and Star Wars: Squadrons will be offered through July 5, while Virtua Fighter 5: Ultimate Showdown will be available to grab until August 2.",
    "The games being offered on PlayStation Plus for May, such as Battlefield 5 and Stranded Deep, are still available right now. If you haven't added them to your account, make sure to do so before June, so you can keep them forever.",
    "Since the launch of the PS5, Sony has made sure to include at least one PS5 game alongside the free PS4 titles, ensuring that even if you haven't been able to grab a PS5 yet, you're enabled in building a library of PS5 games that'll be waiting for you whenever you are able to take the plunge."
  ],
  "headers": {
    "6": "Don't forget the May games"
  },
  "links": {
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-deals",
    "PlayStation Blog": "https://blog.playstation.com/2021/05/26/playstation-plus-games-for-june-operation-tango-virtua-fighter-5-ultimate-showdown-star-wars-squadrons/",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}