{
  "source": "https://www.techradar.com/news/huawei-founder-would-welcome-phone-call-from-president-biden",
  "title": "Huawei founder would 'welcome' phone call from President Biden",
  "category": "phones",
  "updated": "2021-02-09T12:31:55Z",
  "author": "steve-mccaskill",
  "summary": "Ren Zhengfei reiterates hope for an olive branch from Biden administration",
  "article": [
    "Hopes that Joe Biden’s tenure as US president would lead to a reprieve for Huawei appear to be unfounded following comments from his nominee for commerce secretary.",
    "Huawei, along with several other Chinese companies, has been on the US ‘non-entity’ list since 2019, a status that prevents US companies from doing business with it without a licence. This has limited its access to key technologies such as Google applications and US-manufactured components.",
    "Gina Raimondo had initially not committed to keeping Huawei on the list, prompting senate republicans to seek a delay to her confirmation until the matter was clarified.",
    "Huawei has persistently denied any allegations of wrongdoing, while China has suggested the US stance on Huawei and other affected companies is politically motivated. But despite these protestations, concerns have extended to other parts of the world. In the UK, operators are banned from using Huawei’s equipment in their 5G infrastructure.",
    "In his first comments since Biden’s inauguration, Ren expressed his hope of constructive dialogue and argued that a softened stance would aid US suppliers who are struggling because they cannot sell their wares to Huawei. The US, he said, would benefit from China’s growth.",
    "“I would welcome such phone calls and the message is around joint development and shared success,” Ren is quoted as saying at the opening of a new lab in northern China. “The US wants to have economic growth and China wants to have economic growth as well.",
    "“If Huawei’s production capacity can be expanded, that would mean more opportunities for U.S. companies to supply too. I believe that’s going to be mutually beneficially.”",
    "Whether a rapprochement under the new administration is possible remains to be seen. Gina Raimondo, Biden’s nominee for commerce secretary, has said she sees “no reason” to review Huawei’s non-entity status in the immediate future.",
    "Huawei has previously said the sanctions have threatened the future of its smartphone business. The measures have certainly ended any ambitions of becoming the world leading smartphone manufacturer. It is refocusing on the high-end segment of the market and has sold its Honor subsidiary – in part so it can escape the impact of US sanctions.",
    "Via CNBC"
  ],
  "headers": {
    "3": "Huawei-US relations"
  },
  "links": {
    "Huawei": "https://www.techradar.com/news/huawei-ban",
    "not committed to keeping Huawei on the list": "https://www.techradar.com/news/biden-nominee-suggests-no-change-in-us-huawei-stance",
    "Huawei’s equipment in their 5G infrastructure": "https://www.techradar.com/news/huawei-banned-from-uk-5g-networks",
    "CNBC": "https://www.cnbc.com/2021/02/09/huawei-ceo-ren-zhengfei-welcome-phone-call-from-us-president-biden.html"
  }
}