{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-flip-3s-success-hints-at-an-optimistic-future-for-foldable-phones",
  "title": "Samsung Galaxy Z Flip 3's success suggests cheap foldable phones are finally in",
  "category": "phones",
  "updated": "2021-10-08T13:32:51Z",
  "author": "tom-bedford",
  "summary": "Affordable trumps top-spec",
  "article": [
    "While foldable phones have previously been a luxury item, reserved for people with lots of money or a burning desire for the newest tech, the August launch of Samsung's Galaxy Z Fold 3 and Galaxy Z Flip 3 suggest they could become a lot more accessible pretty soon.",
    "According to The Korea Herald, combined sales of Samsung's two new foldable phones have hit a million in South Korea, Samsung's home country. And there's a clear winner between the two.",
    "Apparently, the Galaxy Z Flip 3 makes up a startling 70% of those sales - or roughly 700,000 units - while the Z Fold 3 has a relatively modest 300,000 sales. That shows a big preference for the smaller, more affordable device over the super-premium one.",
    "Of course, sales in other regions might vary, as the pricing and availability of the phones in various regions isn't always identical. However we'd expect the split to be roughly similar, if not the exact same percentages, in different markets around the world.",
    "In many countries, Samsung likely boosted its sales by offering trade-in deals and free gifts for buying the phones, which make them a better value proposition than the price tags alone suggest.",
    "Other than the form factor, one of the key distinguishing factors between the Fold and Flip is the price point - while the Z Fold 3 started at a $1,799 / £1,599 / AU$2,499, the Flip 3 started at a relatively modest $999 / £949 / AU$1,499.",
    "While the Z Flip 3 is far from a cheap phone, that's still the lowest cost we've seen for a foldable phone, making this the budget option for people looking for a flexible device.",
    "The popularity of the Galaxy Z Flip 3 over its pricier premium sibling suggests there's a big appetite for foldable phones that don't break the bank. This flipper gives buyers a futuristic form factor without having to pay too much money (at least, compared to the Z Fold 3), which is likely why it's so popular.",
    "Like Jerry Maguire, tech companies want to be shown the money, and there's little doubt that the success of this 'affordable' foldable will be noticed by Samsung, as well as other companies making foldables like Motorola and Huawei.",
    "As a result, it's likely that more inexpensive foldables will be released in the future, to hit this desire for phones that bend but don't break the bank. We've already seen some companies toy with the idea, like TCL teasing a super-low-cost bending device, but so far nothing like that has hit the market.",
    "But the success of the Samsung Galaxy Z Flip 3 will be an indicator to companies that they too could see success if they put out this kind of budget bender, so hopefully through 2022 we'll see more such devices. That's good news if you like this type of smartphone, but don't have all the money to splash on one just yet."
  ],
  "headers": {
    "5": "Analysis: a good sign for cheap foldables"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "The Korea Herald": "http://www.koreaherald.com/view.php?ud=20211006000678"
  }
}