{
  "source": "https://www.techradar.com/news/watch-forza-horizon-5s-spectacular-opening-right-here-right-now",
  "title": "Watch Forza Horizon 5's spectacular opening right here, right now",
  "category": "gaming",
  "updated": "2021-08-24T18:30:48Z",
  "author": "axel-metz",
  "summary": "Forza goes all-terrain",
  "article": [
    "Forza fans, start your engines – as expected, Forza Horizon 5 formed a big part of the Xbox stream at Gamescom 2021, where the game’s cover cars and opening moments were revealed.",
    "Both the Mercedes-AMG One and 2021 Ford Bronco Badlands will adorn the cover of Forza Horizon 5, sticking with the supercar-plus-SUV theme of the franchise (its predecessor saw the McLaren Senna joined by a Land Rover Defender).",
    "Footage of both cars in action was shown, too, and while we already had an idea of how the game would look on Xbox Series X thanks to an initial announcement trailer, Playground Games’ Mexico setting looks certain to be the series’ most vibrant, detailed and expansive environment yet.",
    "Check it out in action in the new trailer below:",
    "At the showcase, Mike Brown, creative director for Forza Horizon 5, shared footage of the game’s initial drive, which the developer says “sets the stage for everything to come.”",
    "And boy, does that stage look like fun. The game will feature several completely different environment types, giving players the chance to burn rubber around cargo planes, active volcanoes, music festivals and even a dense jungle canopy.",
    "We also get a glimpse of the game's dynamic weather, including dust storms and how different seasons will change the world around you. For example, in winter, expect to find snow when driving around the Gran Caldera volcano. Forza Horizon 5 is set to release on November 9, 2021 on Xbox One, Xbox Series X, Xbox Series S and PC. It'll be available on Xbox Game Pass on day one, too."
  ],
  "headers": {},
  "links": {
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Gamescom 2021": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}