{
  "source": "https://www.techradar.com/news/windows-11-will-let-you-switch-back-to-the-classic-start-menu-heres-how",
  "title": "Windows 11 will let you switch back to the classic Start menu - here’s how",
  "category": "computing",
  "updated": "2021-06-16T09:57:37Z",
  "author": "daryl-baxter",
  "summary": "Back to the Start",
  "article": [
    "An early build has leaked apparently confirming the Windows 11 name and its new look, and users have already found a way to bring back the classic start menu, as well as shifting it back to the left side of the taskbar.",
    "The Windows community were up in arms when the build was leaked, mainly because of the new look and the new name now being confirmed. These features were expected to be for the ‘Sun Valley’ update of Windows 10, scheduled to arrive later this year. However, this now looks to be a minor update, with Windows 11 instead bringing the big changes, coming after six years of Windows 10.",
    "In Windows 11, it looks like the start menu has been given a refresh and is now placed in the middle of the taskbar, which runs along the bottom of the screen, which may put off some users.",
    "Fortunately, the community has already discovered a way to bring the classic start menu back.",
    "After six years of Windows 10, Microsoft is gearing up to announce the successor, Windows 11. After yearly updates that brought refinements to various apps, the user interface and more, it seems Microsoft is now ready to move on from Windows 10..",
    "According to a leaked build, it showcases a user interface that’s reminiscent of the recently cancelled Windows 10X, with a centered start menu and icons, followed by rounded windows and refreshed icons across the operating system.",
    "Microsoft is still expected to announce Windows 11 on June 24 at an event, which we will be updating you on as soon as it’s shown.",
    "While some are enthusiastic about the new look, others aren’t best pleased with the placement of the start menu, but thankfully a method has been discovered to revert it back to its older place.",
    "Once a user logs back into Windows 11, they will be greeted with the tried and tested start menu in the same position it’s been in for almost thirty years.",
    "Via Windows Central"
  ],
  "headers": {
    "4": "What is Windows 11?",
    "7": "How to change the Start Menu"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "Sun Valley": "https://www.techradar.com/news/windows-10-21h2-update",
    "Windows 10X": "https://www.techradar.com/news/windows-10x",
    "Windows Central": "https://www.windowscentral.com/microsoft-may-let-users-switch-between-old-and-new-start-menus-windows-11"
  }
}