{
  "source": "https://www.techradar.com/news/amd-radeon-rx-6700-xt-support-arrives-in-new-driver-plus-a-cool-feature-for-overclockers",
  "title": "AMD Radeon RX 6700 XT support arrives in new driver, plus a cool feature for overclockers",
  "category": "components",
  "updated": "2021-03-19T20:16:04Z",
  "author": "darren-allan",
  "summary": "Performance Tuning tool allows you to fully test that overclock",
  "article": [
    "AMD’s latest Radeon Adrenalin driver, freshly released with support for the new RX 6700 XT GPU, comes with a built-in utility that allows overclockers to stress test their tweaked graphics cards.",
    "The Performance Tuning tool is built right into the Radeon software (version 21.3.1), so you don’t have to bother trying to find a third-party solution to install separately in order to test the stability of any overclocking you perform.",
    "That integrated stress test option feeds back info on your GPU and memory clock speeds, plus info on temperatures and power consumption, and related fan speeds – everything you could want to know about whether you might be pushing the card too hard.",
    "As well as a current readout of those various stats, you also get a graph showing how these values have recently peaked or troughed.",
    "As well as this boon for GPU tweakers, the version 21.3.1 driver also brings in some new features for DX12 games (features which were originally DX11-only). Namely Radeon Boost, which uses the variable rate shading hardware in RX 6000 cards to boost performance in supported titles via dynamic resolution scaling (when the action is happening thick and fast, the resolution is dialed back, the theory being this won’t be noticeable).",
    "Then there’s Radeon Anti-Lag, which catered for DX9 as well as DX11 previously, and can now help out DX12 games, aiming to lower response times – meaning the input from your peripherals and the delay it takes before you see the result actually happen on the monitor – for generally snappier gameplay.",
    "This is particularly important in the likes of competitive shooters, as you can imagine, where even a slight increase in overall responsiveness could be the difference between virtual life and death.",
    "Via PC Gamer"
  ],
  "headers": {
    "4": "Boost bonus"
  },
  "links": {
    "RX 6700 XT GPU": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "GPU": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Radeon Anti-Lag": "https://www.techradar.com/news/nvidias-new-ultra-low-latency-mode-for-gpus-beats-amds-radeon-anti-lag-feature",
    "shooters": "https://www.techradar.com/news/best-fps-games",
    "PC Gamer": "https://www.pcgamer.com/amds-latest-gpu-driver-adds-a-tool-to-stress-test-your-overclocked-graphics-card/"
  }
}