{
  "source": "https://www.techradar.com/news/can-harley-become-the-apple-of-e-bikes",
  "title": "Can Harley become the Apple of e-bikes?",
  "category": "fitness",
  "updated": "2021-08-12T09:09:26Z",
  "author": "tom-may",
  "summary": "Harley Davidson is working hard to make the e-bike a fashion must-have",
  "article": [
    "Whether or not you're a motorcyclist, the words 'Harley Davidson' are recognised the world over. And it's hard to think of a brand that's quite so, well, cool.",
    "So the fact that the American motorbike manufacturer is now going hard for the electronic bike market is a big deal. And Harley Davidson's latest e-bike is really making the world sit up and pay attention.",
    "For the past year, Harley has been releasing surprisingly affordable e-bikes under its Serial One sub-brand, and they've gone down a storm. Now it's grabbing fresh headlines by designing a series of one-off, custom e-bikes and putting them up for worldwide auction.",
    "The first is called the Mosh Chopper. It's inspired by Schwinn's iconic Sting-Ray bike, and you still have a few hours left to bid for it online.",
    "Dubbed a “psychedelic, hand-painted banana seater\", it's got bike fans and commentators salivating at its stylish retro looks, including its long-and-low banana seat, high-rise handlebar, ‘60s-style “Street Freak” paint job, and natty finishings such as intricate panels, freak drops, hand pinstriping and single-stroke hand lettering.",
    "Of course, with the current bid at $8,600 (around £6,200 / AU$1,200), few of us are actually going to bid on either this, or future bikes, at auction. But that's not really the point.",
    "This kind of stunt performs much the same job as a Milan catwalk show does for the clothing industry. It showcases luxurious designs to lure a mass audience, who fall in love with the brand... and then make a beeline for the cheaper version.",
    "It's an intriguing approach, and one that comes at a pivotal moment for electronic bikes. Because they currently have an image that's functional, but not necessarily fashionable. Could Harley be changing all that?",
    "It's certainly worth a try, as demand for the best e-bikes is mounting. For instance, in July last year, research by Shimano suggested that only 7% of Brits were interested in buying an e-bike. However, in a survey carried out this month by Bosch eBike Systems, a huge 55% said they were considering buying an e-bike, and 66% would consider buying one if the government introduced e-bike grants.",
    "That in itself seems quite likely to happen. Because last July the UK government published its Gear Change document, which states: \"We will establish a national e-bike support programme, which could include loans, subsidies, or other financial incentives, using the learning from other schemes in the UK and abroad for e-bikes, adapted e-bikes and other e-vehicles.\"",
    "So there's a lot of potential market to play for. But before we get too excited, we should remember that there's often a gap between people liking the sound of a product, and actually buying it.",
    "Remember how Microsoft launched the first tablet computer in 2003? To be honest, most people don't. It may have been revolutionary tech that everyone agreed seemed super-useful. But almost nobody bought it. Then Steve Jobs came along in 2010, launched a very similar device called the iPad, and changed the game.",
    "Why? Because like the iPhone before it, the iPad didn't look just look great and function brilliantly, it was cool.",
    "Apple pulled off the same trick since with the Apple Watch, and when Beats headphones also became a must-have fashion item (even for people who care little about specs and audio quality), they snapped that brand up too.",
    "Could Harley Davidson become the brand to make the e-bike truly cool, and make it a must-have purchase for millions of people? For our money, the strategy they're currently pursuing stands a good chance of succeeding.",
    "Releasing one-off luxury custom builds keeps the media interested, and pulls in people who might never otherwise have thought about ebikes. Twin that with a range of reliable, high-performing models that nonetheless cost little more than the average ebike, and you have a formula for success.",
    "To that, we add the fact that we're talking about Harley Davidson. And that kind of name recognition really can shift the needle when it comes to mainstream markets.",
    "If we're right, there's one inescapable conclusion: if you are thinking about buying a Harley e-bike, it's probably good to get one earlier rather than later. Because just like the latest iPhones or Beats headphones, once they achieve true fashion icon status, brands have much more flexibility in putting up the prices. Alternatively, they might even become scarce commodities as everyone fights to get hold of one. You have been warned!"
  ],
  "headers": {},
  "links": {
    "affordable e-bikes": "https://www.techradar.com/news/harley-davidson-spinoff-serial-one-reveals-its-first-e-bikes-and-theyre-surprisingly-affordable",
    "Mosh Chopper": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6987429591138889000&xs=1&url=https%3A%2F%2Fwww.serial1.com%2Fproduct%2Fmosh-chopper%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fcan-harley-become-the-apple-of-e-bikes",
    "the best e-bikes": "https://www.techradar.com/best/electric-bike",
    "Gear Change": "https://www.gov.uk/government/news/pm-kickstarts-2bn-cycling-and-walking-revolution",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Beats headphones": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753"
  }
}