{
  "source": "https://www.techradar.com/news/wandavisions-fantastic-four-mystery-was-an-accident",
  "title": "WandaVision's Fantastic Four mystery was an accident",
  "category": "entertainment",
  "updated": "2021-03-09T10:56:10Z",
  "author": "samuel-roberts",
  "summary": "The 'aerospace engineer' was not an intentional mystery, director says",
  "article": [
    "Due to the mysterious nature of WandaVision on Disney Plus, fan theories ran wild for its nine-episode run – but one of the show's biggest question marks was that of the 'aerospace engineer', a figure teased in multiple episodes by Monica Rambeau (Teyonah Parris). Many (optimistic) fans thought this character was going to turn out to be Reed Richards of the Fantastic Four.",
    "But it turned out not to be the case, with the engineer just being a random ally of Monica's. Now, WandaVision's director Matt Shakman has weighed in on how that speculation was accidentally created by the show.",
    "\"Some of those Easter eggs are absolutely intentional, and then some things, like trying to clarify what was Monica's plan with regards to the Hex, we did reshoot a little thing there – changed some dialogue, added the aerospace engineer,\" Shakman told Kevin Smith's podcast. \"Which was never an intention on our side, to set up the Fantastic Four.\"",
    "Instead, Shakman was actually trying to get the audience excited about the then-upcoming set piece, where Monica drives a big armored vehicle into Westview.",
    "\"Some of [the theories] I find charming and wonderful, the fanbase is so smart and knowledgeable that they can create theories better than the ones we created in the room. We're building to this rover set piece, which I've worked my butt off on for well over a year, creating this rover, and suddenly everyone wants to know who's gonna meet her there. And I know it's going to be this wonderful actress [Rachael Thompson] who's playing Major Goodner, and it's not gonna be Reed Richards.\"",
    "The widely-shared theory, then, was not something Shakman was anticipating. In addition, the director says that episode 6's use of the words 'kick ass!' was not a reference to the movie Kick-Ass, which starred both Aaron Taylor-Johnson and Evan Peters, both of whom have played Quicksilver on the big screen.",
    "Sometimes, then, these things really do happen by accident.",
    "Jon Watts' Fantastic Four movie doesn't have a release date, yet, but we'd expect to see it in 2023 or later. His next movie, Spider-Man: No Way Home, releases this December.",
    "It's possible the Fantastic Four could be revealed in a future MCU film or TV show before featuring in their own movie – now that Marvel is playing with the idea of multiverses, it's not impossible Doctor Strange or Wanda Maximoff could encounter the characters before we see the team assemble in their reality. But this is just a theory.",
    "Marvel has plenty of form with introducing heroes before they star in their own movies. Captain America: Civil War introduced both Spider-Man and Black Panther, after all.",
    "So, while Reed Richards didn't make an appearance in WandaVision, it's not implausible he'll turn up elsewhere before the First Family's own MCU film finally lands."
  ],
  "headers": {
    "7": "So, when could the Fantastic Four show up?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "told Kevin Smith's podcast": "https://www.youtube.com/watch?v=qFxn1q-KqW8&ab_channel=KevinSmith",
    "Jon Watts' Fantastic Four movie": "https://www.techradar.com/news/marvel-confirms-mcu-fantastic-four-movie-from-spider-man-director"
  }
}