{
  "source": "https://www.techradar.com/news/apple-co-founder-steve-wozniak-announces-private-space-venture-unlike-the-others",
  "title": "Apple co-founder Steve Wozniak announces private space venture 'unlike the others'",
  "category": "appliances",
  "updated": "2021-09-14T00:51:45Z",
  "author": "john-loeffler",
  "summary": "Privateer to 'keep space safe and accessible to all humankind'",
  "article": [
    "Apple co-founder Steve Wozniak and Ripcord Inc. founder Alex Fielding announced a new space company, Privateer, which aims to \"keep space safe and accessible for all humankind.\"",
    "Wozniak, who co-founded Apple in April 1976 with Steve Jobs, isn't new to launching new ventures of all sorts – he's been doing that over the years – so a private space company isn't totally out of step for him. That said, there's no indication yet what Privateer aims to achieve actually.",
    "The company does plan to provide more details in private group sessions at the upcoming AMOS conference this week, presumably with potential investors, according to Space Explored.",
    "The new company did release a trailer of sorts announcing itself, which may provide some clue as to its purpose, including footage of past rocket launches and spaceflights, something that looks like a burning crash test dummy with a missing arm, a rotating space station, and an assortment of fire-streaked asteroids threatening to ruin someone's day for sure.",
    "On the one hand, another private space company entering the fray is getting so passé that it barely qualifies as news at all.",
    "Private space operations are starting to heat up, with several new startups like Firefly Aerospace coming onto the scene in recent years aimed at providing low cost, small satellite launch services for the broader public beyond just government agencies, various militaries, and the handful of private businesses who already have a presence in low-earth orbit.",
    "On the other hand, Wozniak is involved with this one, which does raise our level of interest. What makes his involvement notable is that Wozniak has a reputation for being a tech geek's tech geek. While Steve Jobs gets the lion's share of the accolades as Apple's pioneer-in-chief (not undeservedly), Wozniak has always been the one behind the stage with the soldering iron and screwdriver over an open computer case.",
    "While Steve Job's sold the public on the Apple II personal computer and revolutionized the world, Wozniak was the chief designer of the computer itself, and has gone in the years since to become something of a public advocate for issues like net neutrality, right to repair, and open access technology. He is most definitely not the \"Money Guy\" in the room, and in the private space venture sector, the money guys dominate. We have no clue what Woz is up to, but we are most definitely intrigued."
  ],
  "headers": {
    "4": "Analysis: what the heck is Woz getting up to now?"
  },
  "links": {
    "Space Explored": "https://spaceexplored.com/2021/09/13/apple-co-founder-steve-wozniak-creating-new-space-company-privateer/",
    "Firefly Aerospace": "https://www.techradar.com/news/watch-firefly-aerospaces-new-alpha-rocket-blow-up-in-spectacular-fashion",
    "Wozniak was the chief designer of the computer itself": "https://www.cmswire.com/customer-experience/steve-wozniak-the-apple-ii-and-the-reason-im-here/"
  }
}