{
  "source": "https://www.techradar.com/news/rivian-r1t-electric-trucks-are-arriving-with-customers-but-the-pace-needs-to-pick-up",
  "title": "Rivian R1T electric trucks are arriving with customers, but the pace needs to pick up",
  "category": "car-tech",
  "updated": "2021-10-25T15:07:24Z",
  "author": "chris-teague",
  "summary": "Leaving the door open for Ford",
  "article": [
    "The world of EVs is heating up, as new vehicles seem to be hitting the streets every day. Electric trucks are just starting to reach buyers' driveways, but they're not from the big-name automakers you might expect.",
    "Startup Rivian is the first to deliver a fully-electric pickup truck to American buyers, but despite its early success, the company's latest filing with the SEC shows that its production line is not quite rolling full steam ahead.",
    "In the filing, which Rivian submitted to the SEC in late October, the automaker states that it has begun production of the R1T truck, but the numbers it claims aren't exactly full-scale in their scope.",
    "\"As of September 30, 2021, we produced 12 R1Ts and delivered 11 R1Ts, and as of October 22, 2021, we produced 56 R1Ts and delivered 42 R1Ts\" the filing reads.",
    "That's around two trucks rolling off the Rivian production line each day – not quite mind blowing.",
    "We know Rivian has stout orders for Amazon vans, but the company has noted that production of those vehicles isn't scheduled to start until December.",
    "It also plans to start delivering its next consumer electric vehicle around the same time, with the filing stating; \"we plan to launch and commence customer deliveries for the R1S, a three-row seven-passenger sports utility vehicle (\"SUV\") in December 2021 following the completion of ongoing vehicle validation and all required testing.\"",
    "Still, at two trucks per day, Rivian has quite a way to go before it will be able to fulfill the 48,390 pre-orders it says are lined up for the R1T and R1S.",
    "It's unclear what is holding the company back - the likelihood is the production line is still working on getting up to speed - but what is clear is it has serious competition coming soon.",
    "The Ford F-150 Lightning is due next year and the GMC Hummer EV won't be far behind.",
    "An exciting product that no one can get isn't all that great, so Rivian will have to accelerate quickly to keep its buyers from wandering off to Ford or another automaker for an electric truck.",
    "Via Inside EVs / Rivian Forums"
  ],
  "headers": {
    "5": "The long road to 48,000"
  },
  "links": {
    "the filing": "https://sec.report/Document/0001193125-21-305592/d157488ds1a.htm",
    "Ford F-150 Lightning": "https://www.techradar.com/news/ford-f-150-lightning-first-look",
    "Inside EVs": "https://insideevs.com/news/542908/rivian-production-numbers-first-month/",
    "Rivian Forums": "https://www.rivianforums.com/forum/threads/rivian-discloses-56-r1t-produced-and-42-r1t-delivered-as-of-october-22-2021.2548/"
  }
}