{
  "source": "https://www.techradar.com/news/the-razer-usb-c-gan-charger-is-going-to-be-the-stocking-stuffer-for-techies-on-black-friday",
  "title": "The Razer USB-C GAN Charger is going to be THE stocking stuffer for techies on Black Friday",
  "category": "computing",
  "updated": "2021-10-22T21:11:54Z",
  "author": "jackie-thomas",
  "summary": "Opinion: seriously, trust me",
  "article": [
    "I'm an editor at a tech site, so it's probably not terribly surprising to know that I'm constantly carrying either one or two laptops in my bag at all times, along with at least one phone and a pair of wireless headphones. That's up to four devices that are part of my daily routine that all need charging. And for me, the Razer USB-C GAN charger has been a lifesaver.",
    "Razer sent it to me back when I reviewed the Razer Blade 15, and I've literally been using it every single day since then. So, now that Black Friday is coming up and you may be thinking of easy gifts for tech addicts let me just rant about this little thing that's in my backpack every day.",
    "If you want this charger and you don't wait for a Black Friday 2021 sale to cut the price, the Razer USB-C 130W GaN Charger will cost you $179 (£159, about AU$239). That's definitely a lot to pay for what's essentially a fancy phone charger, I definitely get that. But that's exactly why you should be looking for deals on Black Friday.",
    "It's a 130W charger with two USB-C ports and two USB-A ports, and 100W of that power budget goes to the USB-C ports - and will split it evenly between the two. That means you basically get two fast chargers with one plug-in. And because it's 100W, it even charges my MacBook Pro 13 pretty quickly.",
    "It's totally trimmed down the number of chargers I have to carry on a daily basis down from two or three to just one. Which makes its weight a bit easier to bear.",
    "Because, yeah, it's a bit hefty - for a little charging brick, at least. It weighs 1.2 oz, which is a lot for what it is. But when you consider that it's going to replace three our four chargers that also weigh close to that, it makes a lot of sense for someone that carries a ton of tech with them.",
    "Because while it adds a bit of weight to my bag, it's at the point where I absolutely won't leave the house without it.",
    "The Razer USB-C GAN charger is easily one of the most convenient pieces of tech we carry on a day-to-day basis. With this one charging brick, you can charge your laptop, your phone, and your wireless headphones at the same time, with one wall outlet. If you have any tech addicts on your Christmas shopping list, this should be at the top of your list when you're looking around on Black Friday."
  ],
  "headers": {
    "2": "It is a bit expensive but so worth it"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "my backpack": "https://www.techradar.com/news/best-backpack",
    "Razer USB-C 130W GaN Charger": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-7868106676129437000&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fgaming-pc-accessories%2Frazer-usb-c-gan-charger%2FRC21-01700100-R3M1"
  }
}