{
  "source": "https://www.techradar.com/news/nvidia-geforce-now-gives-you-another-way-to-play-far-cry-6",
  "title": "Nvidia GeForce Now gives you another way to play Far Cry 6",
  "category": "computing",
  "updated": "2021-10-07T13:00:51Z",
  "author": "darren-allan",
  "summary": "Alternative option for those with underpowered PCs",
  "article": [
    "Nvidia’s GeForce Now service is offering Far Cry 6 for streaming as of now, on the launch day of the shooter.",
    "Six more games will join it in this week’s fresh offerings, including PC Building Simulator (come on, you can’t wait to try that freebie – don’t deny it).",
    "Plus there’s more good news for later in October, with Marvel’s Guardians of the Galaxy joining the GeForce Now streaming party, as well as Riders Republic, both at launch (as had been announced previously, along with Far Cry 6).",
    "Here’s the full list of games coming this week:",
    "And these are the titles due to arrive later in October:",
    "In total, that makes 23 new games coming to GeForce Now in October, which is a tidy amount (following a whirlwind of 59 new introductions in September, notably including games from EA). In short, Nvidia’s service is rapidly picking up steam (ahem), and certainly having some big-name titles on launch day this month represents some serious extra feathering of the streaming cap.",
    "Far Cry 6 is of course the central gem in October’s game streaming crown, with the shooter being much-anticipated (and having some major pull in terms of Breaking Bad’s Giancarlo Esposito playing the part of the dictatorial villain).",
    "Given that the recommended spec calls for an AMD Ryzen 5 3600X or Intel Core i7-7700 CPU, plus a GTX 1080 or RX Vega 64 GPU, and 16GB of system RAM, there may be some folks who are looking for an alternative way to play Far Cry 6 on a lower-powered machine – and that’s where streaming comes in, naturally. Although you are then reliant on the quality of your internet connection rather than hardware.",
    "Further note that Marvel’s Guardians of the Galaxy comes with ray tracing and DLSS, and GeForce Now subscribers will get those RTX-powered benefits, too."
  ],
  "headers": {
    "5": "Analysis: Forging ahead with plenty of new games"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "Marvel’s Guardians of the Galaxy": "https://www.techradar.com/reviews/marvels-guardians-of-the-galaxy",
    "notably including games from EA": "https://www.techradar.com/news/nvidia-geforce-now-just-got-a-bunch-of-new-ea-games",
    "Nvidia’s service is rapidly picking up steam": "https://www.techradar.com/news/i-tried-nvidia-geforce-now-on-everything-i-own-could-it-replace-my-gaming-pc",
    "Marvel’s Guardians of the Galaxy comes with ray tracing and DLSS": "https://www.techradar.com/news/marvels-guardians-of-the-galaxy-promises-to-look-stunning-on-pc-with-nvidia-dlss-and-ray-tracing"
  }
}