{
  "source": "https://www.techradar.com/news/sony-airpeak-drone-release-date-price-rumors-and-leaks",
  "title": "Sony Airpeak drone release date, price, rumors and news",
  "category": "cameras",
  "updated": "2021-06-10T08:00:02Z",
  "author": "mark-wilson",
  "summary": "Sony’s debut drone has now officially landed",
  "article": [
    "After months of teasers and development announcements, the Sony Airpeak S1 drone has now officially landed – and it’s a powerful aerial cinematography tool for filmmakers.",
    "Sony’s Airpeak project was first announced back in November 2020, before Sony took the wraps off its first drone at CES 2021. But we’ve only been given basic specs and glimpses of what this Alpha-friendly flying machine can do – until now.",
    "Sony has now revealed the specs, pricing and release date of the Airpeak S1, and these show that the Airpeak S1 is very much gunning for the pro filmmaking space that’s currently inhabited by the aging DJI Inspire 2.",
    "Designed to whisk full-frame Sony Alpha cameras over high-budget film sets, the Airpeak S1 certainly isn’t a beginner-friendly drone in the vein of DJI’s Air and Mavic series. But it is an exciting glimpse of how far drones have come in the past few years and will almost certainly be responsible for shooting some creative aerial scenes in your favorite films and TV shows over the next few years.",
    "Here’s everything we know about Sony’s mildly terrifying, but very capable, flying machine and new DJI rival…",
    "The Sony Airpeak S1 is available to pre-order now ahead of its availability in “Fall 2021”, which for those outside the northern hemisphere means somewhere between September and December.",
    "Given its professional leanings, we expected the Airpeak to be pricey – and that’s certainly the case. It’s priced at $8,999 (around £6,350 / AU$11,620), and that’s without either a gimbal or camera.",
    "The Airpeak S1’s gimbal is a custom version of the Gremsy T3, which is a three-axis affair with a quick-release setup. Sony says this custom version will cost in the region of the current model, which is around $1,750 (or about £1,235 / AU$2,260).",
    "When you factor in the cost of a full-frame Sony Alpha camera, like the Sony A7S III ($3,499 / £3,800 / AU$5,999), it’s clear that the Sony Airpeak S1 is a five-figure setup for professional filmmakers and studios.",
    "Still, its closest rival, the four-year-old DJI Inspire 2, isn’t exactly cheap at $3,299 / £3,059 / AU$4,699. And a closer look at the Airpeak S1’s tech and integration with Sony Alpha cameras suggest it’ll very much be a new aerial toy that big budget filmmakers will be tempted by.",
    "The Sony Airpeak was officially announced at CES 2021, with Sony offering an exciting first glimpse at its new flying machine through a series of product shots and an impressive promotional video.",
    "And what an entrance it was, with the Airpeak filmed soaring above a snowy landscape and carrying a Sony A7S III, as it kept pace with a prototype Sony Vision S car at a race track.",
    "That short demo video emphatically answered our main question about Sony Airpeak – what kind of drone will it be? With its mildly terrifying wingspan, nifty retractable landing gear and high-end Sony Alpha payload, there was no doubting its professional pedigree (and price tag).",
    "And now Sony’s full announcement of the Airpeak S1, as it’ll be known, has filled in the many gaps. There will be three main parts to the Airpeak system: the drone itself, the new iOS-only Airpeak Flight app, and the Airpeak Plus cloud service.",
    "The Airpeak S1 will be capable of very quick acceleration for a 2.53kg drone, with Sony claiming it can go from 0-50mph in only 3.5 seconds. That’s 1.5 seconds faster than the DJI Inspire 2, its main rival, so it’s clear Sony is going for fast-action sequences (like the Sony Vision S demo).",
    "This is backed up by a 56mph top speed and the ability to withstand winds of up to 44.7mph, although it’s not clear if this is a steady breeze of gusts coming from different directions. Either way, that’s around twice the wind resistance quoted by the DJI Inspire 2.",
    "This newer video (below) shows the Airpeak being tested in a wind tunnel and able to withstand wind speeds of over 19m/s. Camera footage remained remarkably steady, although it's worth adding that the wind appeared to be coming from one direction at a fairly consistent speed, rather than some more realistic gusts.",
    "Still, this is an impressive feat nonetheless, with the Inspire 2 – expected to be the Airpeak's closest competitor – only able to withstand maximum wind speeds of around 10m/s. That's half what Sony is hinting at for the Airpeak in its wind tunnel tests.",
    "Sony says that these tests on a prototype at the Japan Aerospace Exploration Agency show that it's \"aiming for a high-level of wind resistance as we continue developing Airpeak’s frame\".",
    "Aiding that stability is a huge array of cameras and sensors: there are five stereo cameras, two infrared sensors and Sony’s own Vision Sensing Processor, which will all work together to keep this aerial platform as stable as possible for its Alpha payloads.",
    "Another important component of drone stability is the camera’s gimbal, which is an area that DJI has long excelled at. For this, Sony has turned to the third-party manufacturer Gremsy, which already makes Alpha-friendly gimbals. Gremsy has made a custom version of its three-axis T3 gimbal for the Airpeak S1, although this isn’t included in its price tag.",
    "Perhaps the one slight disappointment of the Airpeak S1’s specs is its flight time. It can last only 12 minutes in the air when carrying a camera, or 22 minutes without one. That seems a little meagre compared to the 30-minute flight times of today’s consumer drones like the DJI Air 2S, but it’s not exactly surprising when you consider the Airpeak’s weight when carrying a full-frame camera.",
    "The Airpeak’s professional operators will be carefully planning flights using AirPeak Base, which is a flight planning editor, fleet manager and logbook viewer, rather than taking off and searching for shots, so this flight time shouldn’t prove a hindrance for the kind of cut scenes the S1 will likely be used for.",
    "To fly the drone, they’ll also be using a combination of its controller and the new Airpeak Flight app. This app is iOS-only, which seems a bit strange when you consider Sony Xperia phones run on Android. But pilots will mostly be using iPads rather than the smaller screens of smartphones, and Apple has the tablet market pretty much sewn up.",
    "The Airpeak Flight app will provide separate control over the drone, camera and gimbal, while a dual operation mode will also give you independent control over the aircraft and gimbal, allowing one person to fly while the other acts as the film director.",
    "The arrival of such a high-end professional drone would be appear to dash earlier hopes that we might see Airpeak rival some of DJI's popular consumer drones, like the DJI Mavic Air 2.",
    "Sony has also called Airpeak a new business targeted at \"professional photography and video production\". But there was a small glimmer of hope for hobbyists when Sony said that this was just the \"first phase of this project\".",
    "Could we eventually see a Sony drone that's the flying equivalent of a Sony RX100 VII, rather than a professional rig for filmmakers? We'd love to see it, but for the timebeing it looks unlikely.",
    "That said, Sony has given us a glimpse what that concept could like with some patents over the past couple of years. Of course, patents don't necessarily lead to final products – in fact, more often than not, they remain wireframe concepts. But they at least show that Sony has been considering a more consumer-focused drone.",
    "The first patent for a Sony drone was picked up by Sony Alpha Rumors back in 2018. This showed a folding design where the rotors all fold into a square holder, which is fronted by a touchscreen controller. The idea being that you can detach the touchscreen holder in order to fly the drone.",
    "This concept was further developed in another patent in October 2019 which hinted at other features like gesture control – for example, one page contains an idea labelled \"stretch out palm under flying device\".",
    "Interestingly, much of these patents refer to a device that has more in common with entry-level drones like the AirSelfie 2, which arrived back at CES 2018, rather than a aerial powerhouse like the new Sony Airpeak drone.",
    "But one thing is clear from both the patents and official Airpeak announcement – Sony's idea of a drone is an AI-powered flying camera that does a lot of the heavy lifting, in both flying and image-taking terms, for you. Whether Sony applies this philosophy to a DJI-rivaling consumer drone, though, remains to be seen."
  ],
  "headers": {
    "5": "Sony Airpeak drone release date and price",
    "10": "Sony Airpeak drone news, rumors and features",
    "25": "Will we see other Sony Airpeak drones?"
  },
  "links": {
    "announced": "https://www.techradar.com/news/sony-teases-upcoming-airpeak-drone-taking-its-camera-smarts-airborne",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "DJI Mavic Air 2": "https://www.techradar.com/reviews/dji-mavic-air-2-review",
    "Sony RX100 VII": "https://www.techradar.com/reviews/sony-cyber-shot-rx100-vii",
    "Sony Alpha Rumors": "https://www.sonyalpharumors.com/this-patent-shows-the-first-images-of-the-new-sony-drone-camera/",
    "another patent": "https://www.sonyalpharumors.com/sony-might-be-very-seriously-considering-launching-this-drone/",
    "AirSelfie 2": "https://www.techradar.com/news/the-drones-of-ces-2018-air-selfies-dolphins-and-typhoons"
  }
}