{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-are-real-and-theyre-samsungs-cheapest-foldables-yet",
  "title": "Samsung Galaxy Z Fold 3 and Z Flip 3 are Samsung's cheapest foldables yet",
  "category": "phones",
  "updated": "2021-08-12T13:40:52.981Z",
  "author": "david-lumb",
  "summary": "The Samsung Galaxy Z Flip 3 is now the cheapest foldable on the market",
  "article": [
    "The Samsung Galaxy Z Fold 3 has finally launched alongside the Samsung Galaxy Z Flip 3 at Samsung Unpacked on August 11, giving us a look at the next generation of foldables – which are finally as affordable as ‘flat’ flagship phones.",
    "The Samsung Galaxy Z Fold 3 headlined the event, improving on its predecessor with slightly better specs and, of course, S Pen support. Not all Samsung styluses work with the new foldable phone – just the new S Pen Pro and S Pen Fold Edition.",
    "The Samsung Z Fold 3 packs a Snapdragon 888 chipset, 12GB of RAM, and either 256GB or 512GB of storage. Otherwise, most of it is the same, from its exterior and interior displays to its cameras – though there are some incremental improvements, such as the 12MP main and 12MP telephoto lenses both getting optical image stabilization (OIS).",
    "The Samsung Galaxy Z Fold 3 price starts at $1,799 / £1,599 / AU$2,499 for the 12GB RAM and 256GB of storage version, which is cheaper than its predecessor. You can upgrade the storage to 512GB for a higher $1,899 / £1,699 / AU$2,649 pricetag.",
    "The Samsung Galaxy Z Flip 3 likewise has a few notable upgrades on its predecessor – but the biggest is absolutely its price, which at $999 / £949 / AU$1,499 for the 8GB RAM and 128GB storage version, costs as much as flagship phones. The price only rises a bit to $1,049 / £999 / AU$1,599 for the 256GB version.",
    "That nearly outshines the other big advance – the outer screen has been enlarged to 1.9 inches, which is nearly four times the size of the original Samsung Galaxy Z Flip’s 1.1-inch display – big enough for app functionality, like controlling media.",
    "The dual external cameras alongside the external display haven’t changed, with a 12MP f/1.8 Dual Pixel main lens with OIS and 12MP f/2.2 ultra-wide shooter. As expected, the Z Flip 3 packs an updated Snapdragon 888 chipset along with 8GB RAM, but the phone also comes in 128GB storage in addition to 256GB, likely to curb costs and lower prices.",
    "Samsung has its own set of external cases for its new foldables, showing the phonemaker is putting more thought into how folks are using their shape-changing devices. To wit, they’re selling Z Flip 3 cases with rings and straps to give buyers a better handle on their smaller phones.",
    "There’s plenty else that Samsung’s announced at Unpacked, including the Samsung Galaxy Watch 4 and Galaxy Watch 4 Classic as well as the Samsung Galaxy Buds 2. Even among this lineup, the foldables are perhaps the most exciting news, especially now that consumers can pick one up for the same price as the best phones on the market."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2"
  }
}