{
  "source": "https://www.techradar.com/news/alan-wake-2",
  "title": "Alan Wake 2 trailer, news, rumors and more",
  "category": "gaming",
  "updated": "2021-12-10T17:34:26Z",
  "author": "vic-hood",
  "summary": "It's time to wake up (again) Alan",
  "article": [
    "It's finally happening, Alan Wake 2 is officially in the works. Following months of speculation, developer Remedy Entertainment confirmed an Alan Wake sequel will release in 2023, with a CGI reveal trailer premiering at The Game Awards 2021.",
    "But there's a twist. While its predecessor was an action game with horror elements (according to Remedy), Alan Wake 2 will be the developer's first full-blown survival horror title. According to the sequel's Epic Game Store listing, Alan Wake 2 will have an \"intense atmosphere and a twisted, layered, psychological story\" - so expect things to be considerably scarier this time around.",
    "Want to know more? Read on for everything we know so far about Alan Wake 2, including all the latest news and rumors.",
    "There's a while yet to wait until we can get our hands on the long-awaited Alan Wake sequel. Remedy Entertainment has confirmed Alan Wake 2 will release in 2023, though an exact date hasn't been confirmed yet.",
    "Remedy has also confirmed that Alan Wake 2 will be available on PlayStation 5, Xbox Series X, Xbox Series S and PC (via Epic Game Store).",
    "The Game Awards 2021 announcement Alan Wake 2 was officially announced at The Game Awards 2021 with an announcement trailer lasting just under one minute. The CGI is as dark and ominous as you'd expect, showing a crime scene with a bloody body on an altar before cutting to Alan standing in a road in ever-changing locations amid torrential rain. \"This story is about a monster,\" Alan says. \"And monsters wear many faces.\" This certainly seems to be a shift into a more survival horror genre and we can't wait to see how it develops. It's age-restricted, but you can watch the trailer here.",
    "Below, we've rounded up all the latest news and rumors on Alan Wake 2. Details are a bit thin on the ground right now, but we'll update this page as and when we find out more.",
    "Crossover with Control Could Control's AWE expansion hint at what we can expect from Alan Wake 2? It certainly sounds that way. In a PlayStation Blog post, Creative Director at Remedy Entertainment, Sam Lake, hinted at the crossovers between Control and Alan Wake 2.",
    "\"With Control, our game from 2019, we established the Remedy Connected Universe, where both Control and Alan Wake exist in the same universe,\" Lake wrote in the blog post. \"AWE, the second expansion of Control, builds a crossover event between the two games, and hints of things to come.\"",
    "You don't need to play Alan Wake to enjoy the sequel According to Sam Lake, you don't need to play the first Alan Wake or Alan Wake Remastered to play Alan Wake 2. In the PlayStation Blog post announcing the sequel for PS5, Lake said: \"I also want to make it clear that playing our previous games is not required in any way to fully enjoy Alan Wake 2, but to those interested it will add to the backstory of it.\"",
    "Remedy likely won't share more until \"Summer 2022\" Remedy Entertainment is \"going to go dark for a while\" is it develops the sequel, but the developer expects to share more in \"Summer 2022\"."
  ],
  "headers": {
    "3": "Alan Wake 2: cut to the chase"
  },
  "links": {
    "The Game Awards 2021": "https://www.techradar.com/news/the-game-awards-2021-the-biggest-announcements-and-reveals",
    "Epic Game Store listing": "https://www.epicgames.com/store/en-US/p/alan-wake-2",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "here": "https://youtu.be/crQobuzpVps",
    "PlayStation Blog post": "https://blog.playstation.com/2021/12/09/alan-wake-2-announced-for-ps5/",
    "Alan Wake Remastered": "https://www.techradar.com/reviews/alan-wake-remastered"
  }
}