{
  "source": "https://www.techradar.com/news/amd-ryzen-7-5700g-leak-suggests-a-seriously-promising-8-core-apu",
  "title": "AMD Ryzen 7 5700G leak suggests a seriously promising 8-core APU",
  "category": "computing",
  "updated": "2021-02-22T15:50:07Z",
  "author": "darren-allan",
  "summary": "Engineering sample chip spotted with some seriously cranked up system RAM",
  "article": [
    "AMD’s Ryzen 7 5700G, a purported desktop APU from the ‘Cezanne’ family, has been spotted being tested online.",
    "The 5700G is a theoretically incoming 8-core (16-thread) Zen 3-based chip which should be great for budget builds, giving a good level of performance coupled with an integrated GPU (delivering solid enough graphics oomph while saving the expense of a discrete graphics card).",
    "As spotted by Komachi_Ensaka on Twitter, over at the Chiphell forum – a common source of hardware leaks – an engineering sample of the processor was tested with DDR4 system RAM running at some pretty fast speeds (using a solid platform for testing, namely MSI’s MEG B550 Unify-X motherboard).",
    "Using 16GB of memory (dual-channel), the poster ran at 4333MHz and then 5000MHz, followed by 5333MHz (but only for a brief time in the latter case).",
    "As the poster observes, there is a marked improvement on the performance of the memory here compared to the previous Ryzen 4700G APU – and we’ve got to remember this is a pre-release sample chip, too. Meaning that the finished version of the 5700G could potentially do better (salt to hand, as ever).",
    "That comes on top of some recently spilled benchmarks of the 5700G which are also impressive, comparing nicely to the 5800X when you take into account the lower TDP of the 5700G – which is purportedly pitched at 65W, with boost to 4.4GHz (although some rumors have the latter pegged higher).",
    "The Ryzen 7 5700G may be one to watch, then, although the prevailing feeling seems to be that this may end up an OEM-only APU, like its predecessor Ryzen 4000 offerings. In other words, consumers won’t be able to purchase it directly, only system builders will (so you’ll have to buy a PC that comes with the chip to get hold of one – or a 5700G model being resold, of course).",
    "We first heard whispers of the 5700G back at the start of January, when a listing for the APU appeared on the USB Implementers Forum, where the Ryzen 9 5980HX was also spotted. The latter is an APU aimed at laptops, a different kettle of fish to the 5700G which is destined for desktop PCs.",
    "Via Wccftech"
  ],
  "headers": {
    "5": "One to watch"
  },
  "links": {
    "Zen 3": "https://www.techradar.com/news/amd-zen-3",
    "Komachi_Ensaka": "https://twitter.com/KOMACHI_ENSAKA/status/1363473828190564353",
    "Chiphell": "https://www.chiphell.com/thread-2303276-1-1.html",
    "recently spilled benchmarks": "https://www.tomshardware.com/uk/news/amd-ryzen-7-5700g-cinebench-leak",
    "appeared on the USB Implementers Forum": "https://www.techradar.com/news/some-juicy-amd-ryzen-5000-gaming-laptop-processors-have-just-appeared-online",
    "Wccftech": "https://wccftech.com/amd-ryzen-7-5700g-8-core-cezanne-zen-3-desktop-apu-benchmarks-ddr4-5333-mhz-memory/"
  }
}