{
  "source": "https://www.techradar.com/news/you-wont-get-an-nvidia-rtx-3080-on-black-friday-but-dont-give-up-hope",
  "title": "You won’t get an Nvidia RTX 3080 on Black Friday – but don’t give up hope",
  "category": "computing",
  "updated": "2021-11-13T12:30:17Z",
  "author": "matt-hanson",
  "summary": "Want to upgrade your gaming rig? You’ll still have options",
  "article": [
    "If you’re hoping for Nvidia RTX 3080 Black Friday deals, or offers on any of Nvidia’s latest graphics cards, then we have some bad news, as there are unlikely to be any noteworthy discounts when Black Friday rolls around on November 26.",
    "This is because Nvidia’s lineup of Ampere graphics cards, which also include the likes of the RTX 3080 Ti, RTX 3070 and RTX 3090, remain incredibly hard to buy. This is due to a number of reasons, including the global chip shortage which continues to impact the availability of many in-demand products, like the PS5, and general pent-up demand for these GPUs, many of which are the best graphics cards in the world.",
    "Add in a cryptocurrency bubble, which led to miners buying up lots of GPUs, and you have a recipe for disaster for anyone who wants to buy a new graphics card. Because of this, it’s highly unlikely that retailers will be selling many standalone GPUs over Black Friday – and they certainly won’t be offering any deals, considering these products sell out of stock almost as soon as they go live.",
    "However, that doesn’t mean you should give up hope entirely for getting a new GPU on Black Friday. Here are some alternative ideas that could help net you a new RTX 3080, or other GPU of your choice.",
    "Every year we see retailers off excellent Black Friday gaming PC deals, and we expect this year to be no different. Many of these gaming PCs come with high-end and in-demand graphics cards, and they could be your best bet of getting one on Black Friday.",
    "Of course, this isn’t ideal if you already have a gaming PC, and are just after a GPU. However, buying a new gaming PC on Black Friday could be a great way to upgrade all parts of your rig at once.",
    "Also, due to some GPU prices being drastically inflated by unscrupulous sellers, we’ve seen certain cases where a gaming PC deal offers you an entire setup for not much more (and sometimes even less) than buying a GPU on its own would currently cost.",
    "To help justify buying an entire new gaming PC, you could always sell your current PC, or even sell the rest of the PC you bought that you don’t need, to help recoup costs.",
    "These are the best early Black Friday gaming PC deals we’ve found so far, and they are definitely worth considering if you want an RTX 3080 or other GPU on Black Friday.",
    "Another way to get hold of Nvidia’s latest graphics technology is to grab a gaming laptop Black Friday deal. As with gaming PCs, many retailers offer some truly tempting offers on gaming laptops, often knocking hundreds of dollars off the asking price during Black Friday and Cyber Monday.",
    "Many of the laptops that go on sale come with Nvidia RTX 3080 (or RTX 3070 or RTX 3060) graphics. While these aren’t quite the same as the graphics cards found in desktop gaming PCs, as they don’t quite match the raw performance, they are still excellent GPUs that can play the best PC games with ease. They also support all the advanced features modern Nvidia GeForce RTX graphics cards come with, including DLSS for faster, more consistent, frame rates and advanced ray tracing lighting effects.",
    "Best of all, they bring the power of Nvidia’s best GPUs to portable laptops. So, while you may have been looking for a new GPU for your desktop PC, this could be a good excuse to invest in a gaming laptop instead.",
    "Again, there will be certain Black Friday gaming laptop deals that end up costing not a lot more than buying a single GPU would, and if you’re desperate to experience ray tracing but can’t find a GPU, this could be a great compromise. We've listed some of the best gaming laptop deals below:",
    "If these don’t sound like ideal alternatives, you could always try streaming games until GPU stock improves. Before you dismiss this, Nvidia actually has a new subscription tier for its GeForce Now service that offers the power of an RTX 3080 rig via the cloud.",
    "How this works is that you log in to a remote Nvidia server that’s powered by the RTX 3080 (or RTX 3080-level GPU) via your PC, and use the remote power to play PC games. It’s a great way of playing graphically intensive games on hardware that wouldn’t usually be able to cope, such as older PCs, Chromebooks, and Nvidia’s own Shield TV console.",
    "According to Nvidia, the new RTX 3080 GeForce Now tier offers ‘cloud gaming’s highest resolutions and fastest frame rates, paired with the lowest latency.’",
    "The RTX 3080 GeForce Now tier is available to pre-order in the US, with other locations coming later, and it offers RTX 3080-level performance, eight-hour sessions lengths and up to 1440p at 120FPS gameplay on PC and Mac, and up to 4K with HDR on the Shield TV. It costs $99.99 for six months.",
    "We haven’t had a chance to try out the RTX 3080 GeForce Now membership, but will hopefully be able to have a play soon. However, we have used GeForce Now with our ‘Founders’ membership tier, and we were really impressed.",
    "Depending on your internet connection, the results can be really good, especially if you play on a device that wouldn’t normally be able to play it. We had a blast playing Assassin’s Creed: Valhalla on our Samsung Galaxy S21+ using the Razer Kishi controller (which turns the phone into a Switch-like handheld console) and using GeForce Now.",
    "Best of all, GeForce Now allows you to play games you already own, so you don’t have to rebuy any games. This could be handy for using GeForce Now until GPU stock sorts itself out. Once you are able to buy a GPU, you can continue to play all the games you were playing via GeForce Now without paying for them again.",
    "Sure, it’s not as good as playing the games natively with a brand new RTX 3080 GPU installed in your gaming rig, but it’s a good alternative while you wait for stock shortages to sort themselves out. We’re not sure if there will be any GeForce Now deals on Black Friday, but we could see price cuts on bundles with the Shield TV console. It could be the most affordable way to get enjoy RTX-level gaming at the moment, so it’s well worth checking out."
  ],
  "headers": {
    "4": "Black Friday gaming PC deals",
    "9": "Black Friday gaming laptop deals",
    "13": "Streaming options"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "global chip shortage": "https://www.techradar.com/news/intel-ceo-says-chip-shortage-could-stretch-into-2023",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "Black Friday gaming PC deals": "https://www.techradar.com/deals/best-black-friday-pc-gaming-deals-2019",
    "gaming laptop Black Friday deal": "https://www.techradar.com/black-friday/black-friday-gaming-laptop-deals",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "new subscription tier for its GeForce Now service": "https://www.techradar.com/news/nvidia-geforce-now-rtx-3080-top-tier-membership-is-now-live",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Shield TV": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "According to Nvidia": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-5441099082068686000&murl=https%3A%2F%2Fnvidianews.nvidia.com%2Fnews%2Fnvidia-introduces-the-next-generation-in-cloud-gaming",
    "costs $99.99 for six months": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-3139428158111792600&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-us%2Fgeforce-now%2F",
    "Assassin’s Creed: Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "Samsung Galaxy S21+": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Razer Kishi": "https://www.techradar.com/reviews/razer-kishi"
  }
}