{
  "source": "https://www.techradar.com/news/loki-season-2-has-been-officially-confirmed-by-marvel-studios",
  "title": "Loki season 2 has been officially confirmed by Marvel Studios",
  "category": "entertainment",
  "updated": "2021-07-14T11:28:23Z",
  "author": "hamish-hector",
  "summary": "The god of mischief will return",
  "article": [
    "Marvel has officially confirmed that we will be getting a Loki season 2. We know very few details about this follow-up run right now beyond its existence, but the end credits for the latest episode of the series proclaimed ‘Loki will return in season 2.’",
    "Marvel's own official website also confirmed it this morning with the words 'Loki will return in Season 2' in a spoiler-y explainer article (we'd recommend watching the episode first).",
    "This means that Loki is the first MCU Disney Plus show to officially get a season two announcement, after both WandaVision and Falcon and the Winter Soldier appear to have been a one-and-done deal.",
    "As for when Loki season 2 will release, we may have to wait a while. Marvel's schedule is absolutely packed with content until the end of 2022, with at least 14 more MCU TV series and films planned to release from now until 2023. Presumably, we'll see it some time after those – we'll just have to wait and see.",
    "Even though Loki is the first MCU show to officially get a season 2, that doesn't mean we might not hear about follow-ups to other series in the future. When speaking to IndieWire, The Falcon and the Winter Soldier executive producer Nate Moore claimed Marvel \"always wants the possibility” for there to be more seasons.",
    "He added, \"We’ve definitely kicked around ideas because we always like to keep thinking about where things can go, but we also, frankly, in the crush of the pandemic, we’re just trying to finish the show and make sure it got out in a timely matter.\"",
    "Since The Falcon and the Winter Soldier wrapped up, it has been reported that Anthony Mackie will appear as Sam Wilson in a planned Captain America 4 film, which will tidy up the loose threads from the end of The Falcon and the Winter Soldier. Still, Marvel has never confirmed that, so the future of those characters is unclear for the time being.",
    "Unfortunately for fans of WandaVision, no season 2 is planned. Lead actress Elizabeth Olsen said in a Variety interview that \"It's definitely a limited series.\" This statement has since been corroborated by WandaVision's nomination for a 2021 Emmy Award for \"Outstanding Limited or Anthology Series\".",
    "Wanda will return, though, playing a major role in the upcoming MCU film, Doctor Strange and the Multiverse of Madness."
  ],
  "headers": {},
  "links": {
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "spoiler-y explainer": "https://www.marvel.com/articles/tv-shows/loki-he-who-remains-jonathan-majors",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "IndieWire": "https://www.indiewire.com/2021/04/falcon-and-winter-soldier-emmys-drama-series-season-2-plans-interview-1234631267/",
    "Captain America 4": "https://www.techradar.com/news/captain-america-4-could-focus-on-sam-wilsons-lack-of-superpowers",
    "Variety interview": "https://variety.com/2021/tv/actors/actors-on-actors-elizabeth-olsen-kaley-cuoco-flight-attendant-wandavision-1234990561/",
    "Doctor Strange and the Multiverse of Madness": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more"
  }
}