{
  "source": "https://www.techradar.com/news/dashlane-is-eliminating-the-hassle-of-changing-your-account-passwords",
  "title": "Dashlane is eliminating the hassle of changing your account passwords",
  "category": "computing",
  "updated": "2021-03-11T17:16:24Z",
  "author": "anthony-spadafora",
  "summary": "Rebuilt Password Changer can update all your passwords in just one click",
  "article": [
    "Even with a password manager, changing all of the passwords to your online accounts can be a tedious process which is why Dashlane has announced the relaunch of its one-of-a-kind Password Changer as well as a new autofill engine powered by machine learning.",
    "It is essential for both consumers and businesses to have a different password for each of their online accounts because weak, stolen or reused passwords are the number one cause of data breaches and hacks. However, despite this, password reuse is still a very real problem and a recent Verizon study revealed that almost 70 percent of users still reuse passwords.",
    "Dashlane's Password Changer is a useful tool when it comes to fighting password reuse as it can log users into compatible websites, create strong and unique passwords and then change their passwords in just one-click.",
    "The company has rebuilt its Password Changer from the ground up to improve both its reliability and website coverage. As every website has its own flows to log in or reset a password which change quickly and without notice, Dashlane's new Password Changer follows these flows, autofills common blockers like captchas and two-factor authentication codes for a fast, simple and secure user experience.",
    "The power behind both Dashlane and its Password Changer has always been invisible to users as the company's proprietary semantic engine offers the most accurate page analysis on the market which enables it to autofill and login across every website universally.",
    "By bolstering its technology with machine learning, Dashlane has managed to achieve a weighted F-Score of 92 percent across English, French and German websites. The company's Password Changer is able to recognize online forms in 15 milliseconds on average and this is far faster than the 100ms threshold for an interaction to feel instantaneous.",
    "Chief product officer at Dashlane, Derek Snyder provided further insight on the company's decision to invest further in machine learning and rebuild its Password Changer in a press release, saying:",
    "\"We've always known that to meaningfully impact the security of our customers and enhance their experience online, our autofill experience needed to be faster, more reliable, and more convenient than typing memorized passwords or other insecure, convenience-based habits. Powering Dashlane with machine learning and completely refactoring Password Changer are significant steps toward our goal of helping all individuals and businesses avoid the pain of managing access. We look forward to hearing feedback on the beta as we continue to enhance the best-in-class autofill, category-leading capabilities, and great experience our users have come to expect.\"",
    "Dashlane's new Password Changer and machine learning engine are now available in beta across the company's iOS and Android Apps as well as its browser extensions."
  ],
  "headers": {
    "4": "Powered by machine learning"
  },
  "links": {
    "password manager": "https://www.techradar.com/best/password-manager",
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "data breaches": "https://www.techradar.com/news/what-is-a-data-breach",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "press release": "https://www.prnewswire.com/news-releases/dashlane-unveils-password-changer-2-0-and-new-autofill-engine-powered-by-machine-learning-301245552.html"
  }
}