{
  "source": "https://www.techradar.com/news/quick-the-samsung-galaxy-chromebook-has-a-dollar300-price-cut-at-amazon",
  "title": "Quick - the Samsung Galaxy Chromebook has a $300 price cut at Amazon",
  "category": "computing",
  "updated": "2021-08-11T13:45:29Z",
  "author": "georgia-silcox",
  "summary": "Getting ready for back to school? Get this Chromebook laptop for $699",
  "article": [
    "If you're heading back to school or are in the market for a thin and portable laptop, this Samsung Galaxy Chromebook is on sale now for $699 at Amazon. Available in a stunning Fiesta Red color or a more subdued Mercury Gray color, this one's a great choice if you want something that's both stylish and speedy.",
    "The Samsung Galaxy Chromebook is one of the pricier Chromebooks on the market, coming in at $999.99. However, this deal saves you $300.99, which slashes the original price by a huge 30%. Other than a slightly larger price cut a few months ago, which saw a record low price of $687, this is the lowest price we've seen for the Fiesta Red Chromebook. Even though this particular Chromebook has been on the market for around a year now, its discounts don't tend to hang around for long - so definitely don't wait if you're interested.",
    "The thin and light design of the Samsung Galaxy Chromebook is suited to working on the go, and the different color options make it stylish too. With this Chromebook you're also getting full 2-in-1 functionality. In short, the 13.3-inch, 4K AMOLED display can be used as a laptop or rotate up to 360 degrees for tablet use. Unfortunately, the impressive display does come with a caveat - it drains the battery in around 6 hours. If this puts you off find more cheap laptops and tablets in our round-up of the best back-to-school deals.",
    "Not in the US? Scroll down for more Chromebook deals in your region.",
    "We're rounding up all the best cheap laptop deals, including the best back-to-school laptop sales and MacBook deals."
  ],
  "headers": {
    "4": "More Chromebook deals"
  },
  "links": {
    "$699 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB088TDDNGT%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3322009196667984400-20",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Samsung Galaxy Chromebook": "https://www.techradar.com/reviews/samsung-galaxy-chromebook",
    "back-to-school deals": "https://www.techradar.com/news/best-back-to-school-sales-2020",
    "Chromebook deals": "https://www.techradar.com/news/cheap-chromebook-deals",
    "best cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "back-to-school laptop sales": "https://www.techradar.com/news/the-best-back-to-school-laptop-sales-top-deals-from-apple-best-buy-dell-and-more",
    "MacBook deals": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699"
  }
}