{
  "source": "https://www.techradar.com/news/why-the-no-time-to-die-ending-doesnt-really-work",
  "title": "Why the No Time To Die ending doesn't really work",
  "category": "entertainment",
  "updated": "2021-10-09T15:00:19Z",
  "author": "samuel-roberts",
  "summary": "Spoilers follow",
  "article": [
    "Big No Time To Die spoilers follow. Watch the film before reading this.",
    "James Bond is dead. Daniel Craig's version of 007 has been blown away by missile fire, preventing him from passing a virus on to his partner and daughter – while Rami Malek's Safin was left dead in a retractable pool of water, a suitable punishment for his long, meaningless monologues and lack of discernible motivation as a villain.",
    "I didn't love No Time To Die, though I was certainly grateful to have the opportunity to watch a new Bond film in a safe environment. It ranks third in the Daniel Craig canon for me, with a zippy and fun first hour, before it gets weightier and muddled in a somewhat boring third act.",
    "The fundamental problem at the heart of the Craig films for me – at least in their second half – is the Bond/Madeleine Swann relationship set up in 2015's Spectre. I have struggled to get invested in this, and No Time To Die asks you to buy into it as the main emotional hook for the movie. I don't think this works.",
    "It's not that James Bond only functions well when he's a single man, even if that's how the series has historically portrayed him. It's that this relationship at least needs to be interesting to watch. Daniel Craig and Léa Seydoux are both individually great actors, but together they don't have any chemistry, and you don't get to understand why this romance is exciting to either of them. There's a weirdly chilly undercurrent between the pair, like these two people have only got together because they're both attractive and went through some bad shit together.",
    "Basically: where's the love?",
    "I watched the start of No Time To Die while Bond enjoyed retirement life with Madeleine and wondered, 'do these two people actually have fun together?' The doomed Vesper Lynd romance from Casino Royale persists in the background of all these films – and Craig's chemistry with Eva Green was so memorable – that this newer relationship just doesn't measure up to it.",
    "Ultimately, the film hinges on your investment in the pair. This is heightened by the presence of Bond's daughter, which the film oddly struggles to say outright is his daughter until the very end, despite strongly hinting at it numerous times.",
    "A Bond ending where he makes the big sacrifice works, on paper. It's something James Bond the series hasn't done before. This film doesn't justify it, though – we see Bond die at the end of a messy third act, on a generic villain's preposterous seen-it-before island base (self-aware or derivative creative choice? Surely the former, but either way, the flat result is the same).",
    "An overstuffed cast of MI6 characters then raise a toast to him. The end.",
    "I wasn't moved, honestly, and there have definitely been times over the years where I've been certain the Daniel Craig era is Bond as I want to see it. I should be invested in Bond's demise, but the emotional core of this movie doesn't ring true. Though I am slightly sad that Bond's daughter's soft toy, Dou Dou, was presumably caked with British Navy missiles as he was.",
    "It didn't help that the movie's villain duties were divided by Rami Malek's Safin – whose lean presence in the film was oversold by the trailers – and the concept of a virus.",
    "I don't feel like Bond lost to his greatest enemy. Safin came into the film too late; perhaps if he'd pulled the trigger on Felix Leiter earlier in the movie, it would mean more for the pair to have a final showdown (side note: this film did not need Billy Magnussen's character, an undercover flunky of Safin's, at all).",
    "Here's my other big problem with No Time To Die – it gives you a taste of the film it could've been in its first hour, and then it becomes something else entirely. I liked the film it could've been.",
    "I'm talking about the movie's Cuba sequence, which features Bond going undercover with Ana de Armas' character, Paloma. In this scene, Craig and de Armas have more chemistry than the Bond actor ever does with Léa Seydoux – and the setting is visually spectacular. It's the pair sneaking into a party on behalf of the CIA, then getting into a massive firefight when things go wrong, with a rival agent in Nomi (Lashana Lynch) vying for the same target.",
    "It was the raw fantasy of James Bond captured in one conceptually perfect sequence. It was fun. The film would never be this entertaining again – and that's a shame. Can we not just have a movie that's Bond, Paloma and Felix Leiter on elaborate undercover missions for two hours?",
    "Instead, No Time To Die spends much of its running time creaking under the weight of the serialized elements set up in earlier movies – not just Madeleine, but also Blofeld, Spectre and Bond's baggage with Gareth Mallory (Ralph Fiennes), none of which adds up to much in this film.",
    "Theoretically, a Bond subseries with its own story arc is exciting, but the Craig movies have been wildly hit-and-miss in this respect. I wouldn't mind the next James Bond returning to single-movie stories instead, unless it has a better plan for how the films can slot together.",
    "No Time To Die, then, was an imperfect end to a flawed run of Bond movies. That's no reflection on the commitment and brilliance of Daniel Craig, who brought a very specific energy to the role and has elevated the series to unprecedented levels of popularity – he deserved his victory lap. This film just doesn't quite bring the best elements of his movies into focus.",
    "No Time To Die is now showing worldwide."
  ],
  "headers": {
    "13": "A flash of inspiration"
  },
  "links": {
    "No Time To Die": "https://www.techradar.com/news/no-time-to-die-is-a-fitting-end-for-daniel-craigs-bond-but-its-no-skyfall"
  }
}