{
  "source": "https://www.techradar.com/news/shang-chi-now-has-a-disney-plus-release-date-but-its-later-than-expected",
  "title": "Shang-Chi now has a Disney Plus release date – but it's later than expected",
  "category": "entertainment",
  "updated": "2021-09-22T09:23:26Z",
  "author": "samuel-roberts",
  "summary": "Better go see it at the cinema",
  "article": [
    "Shang-Chi and the Legend of the Ten Rings will be released on Disney Plus on November 12, it's been revealed – and it'll be available to all subscribers.",
    "The release will come as part of Disney Plus Day, an event designed to stoke interest in the future of the streaming service – just as it hits its two-year US anniversary, and as a load of yearly subscriptions are bound to roll over at that point. Clever, right?",
    "Shang-Chi is just one highlight of a packed day, with the current Premier Access title Jungle Cruise also releasing to all subscribers on that day. A new short film from Pixar will also debut, the Luca follow-up Ciao Alberto, along with a new series of Frozen shorts called Olaf Presents.",
    "More interesting is that two special looks are lined up for Marvel and Star Wars on the day – the Star Wars one will focus on The Book of Boba Fett, while the Marvel one will take a look ahead in the MCU. Since the Hawkeye TV show releases on November 24, we'd expect that to form a big part of this presentation, but a new look at Ms Marvel seems likely too.",
    "More is set to be revealed ahead of the event by Disney in the weeks leading up to it. Still, it's worth circling November 12 on your calendar to see what the deal is – we might learn some more specifics about new Disney Plus shows coming in 2022, like Obi-Wan Kenobi.",
    "For subscribers outside the US, it seems like Star content will feature in some capacity too – the Michael Keaton series Dopesick is a confirmed part of the Disney Plus Day lineup, which releases on Hulu in the US.",
    "Disney previously confirmed that Shang-Chi and the Legend of the Ten Rings would have a 45-day theatrical release window, meaning it could've feasibly arrived on Disney Plus by late October.",
    "That always seemed very soon, so making subscribers wait a little longer isn't a massive surprise. A wait of a little over two months is pretty reasonable, really, considering we used to live in an age of waiting months for a movie to land on DVD.",
    "It may also preserve the movie's value on the big screen. While Shang-Chi is one of the lower MCU performers at the box office, that's entirely expected in the midst of an ongoing pandemic – and besides, making $306 million means it's no slouch.",
    "If you want to be caught up on all things Marvel by the time Eternals releases on November 5, then, you'll have to go see Shang-Chi at a theater."
  ],
  "headers": {
    "6": "Analysis: Shang-Chi arrives later than expected"
  },
  "links": {
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Jungle Cruise": "https://www.techradar.com/news/jungle-cruise-is-a-familiar-and-overly-long-disney-adventure-but-its-still-fun",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "Disney Plus shows": "https://www.techradar.com/best/best-disney-plus-shows",
    "Obi-Wan Kenobi": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know"
  }
}