{
  "source": "https://www.techradar.com/news/the-book-of-boba-fett-may-not-end-after-one-season",
  "title": "Disney's next Star Wars show may not end after one season - here's why",
  "category": "entertainment",
  "updated": "2021-06-03T20:48:09Z",
  "author": "tom-power",
  "summary": "The Book of Boba Fett is rumored to be getting another season",
  "article": [
    "The Book of Boba Fett is set to be the next Star Wars TV show to land on Disney Plus.",
    "The spin-off series, which follows the titular character after his supporting role in The Mandalorian, is scheduled to arrive in December – but it might not be a limited series like we thought it'd be.",
    "A new rumor, which emerged online over the weekend, has suggested that The Book of Boba Fett could get a second season.",
    "The speculation comes by way of – yes, you're reading this right – a sticker. According to the Boba Fett Fan Club Twitter fan account, members of the series' crew were given stickers relating to the show's production, and two tease the prospect of future installments in Boba Fett's adventures.",
    "As per the tweet below, crew members were handed three stickers as part of their work on the series. It's the first and third stickers that are most intriguing of the trio, with both alluding to the fact that this is just 'season 1' of the Boba Fett series.",
    "It remains to be seen if these stickers are genuine, so take this latest rumor with a giant pinch of salt for now. Check out the tweet below if you want to make your own judgement on the stickers:",
    "Right now, there's been no word from Disney or Lucasfilm about the potential for a second instalment of The Book of Boba Fett. That's to be expected, though, given that work is continuing on season 1.",
    "For what it's worth, this isn't the first instance where parts of those stickers have appeared in another guise.",
    "Ahead of the series' announcement at the end of The Mandalorian season 2, there was speculation that The Book of Boba Fett was in development under the working title 'Buccaneer'. This is the same title we can see in the first sticker in the tweet above.",
    "This could simply be a mock-up fan-made sticker based on that working title, but there is more to this than meets the eye. According to another Boba Fett Fan Club tweet, Boba Fett actor Temeura Morrison – who also portrayed Jango Fett, Commander Cody and other Cloner Troopers in the Star Wars prequel trilogy – strengthened those 'Buccaneer' working title rumors in April 2021.",
    "During a fan signing event, Morrison was seen wearing a jacket with the word 'Buccaneer' on it. Not only does this seemingly confirm that The Book of Boba Fett's working title is 'Buccaneer', but its logo is eerily reminiscent of The Mandalorian's. If it's a jacket that was produced before The Book of Boba Fett's official title was revealed, it's possible that Disney and Lucasfilm linked the two series together by way of their similar logo designs.",
    "Check out the tweet below to see for yourself:",
    "Again, it's unclear if the stickers are real and aren't just mock-ups based on Morrison's jacket or other Mandalorian based artwork. The photograph of Morrison, though, suggests that the 'Buccaneer' working title is legitimate, but we're yet to be convinced that this is all connected to The Book of Boba Fett season 2.",
    "Whatever happens, we know that we'll be able to watch The Book of Boba Fett season 1 later this year. The series is set to launch exclusively on Disney Plus in December."
  ],
  "headers": {
    "6": "Analysis: Will we get The Book of Boba Fett season 2?"
  },
  "links": {
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far"
  }
}