{
  "source": "https://www.techradar.com/news/apple-releases-cool-ar-iphone-and-ipad-app-ahead-of-for-all-mankind-season-2",
  "title": "Apple releases cool AR iPhone and iPad app ahead of For All Mankind season 2",
  "category": "entertainment",
  "updated": "2021-02-13T08:33:33Z",
  "author": "samuel-roberts",
  "summary": "Play around with an Apple II computer in AR",
  "article": [
    "Next Friday, Apple TV Plus original For All Mankind returns for season 2 on the streaming service, and ahead of that, Apple has released a new AR app for iOS devices that tells a story set in the show's universe.",
    "For All Mankind: Time Capsule lets you rummage through a box of keepsakes that belong to a new young character in the show, Danny Stevens (played by Casey W Johnson), who's just experienced a break-up. The objects in the box collectively tell a story that explores the lives of other characters in the show, with appearances from multiple actors in the series. Time Capsule even features in-universe newscasts filmed specifically for the app.",
    "What it amounts to looks like a first-person story game, one that might remind you of something like Gone Home or Firewatch. You examine objects and have shards of story delivered to you by AR props and in-app media. The app can be downloaded in the US, UK, Australia and New Zealand now, with other territories getting it later this month – and iPhone 12 Pro, iPhone 12 Pro Max and iPad Pro users even get to enjoy two exclusive scenes of the story that use the LiDAR scanner to project images on to a wall.",
    "Take a look below:",
    "For All Mankind is about an alternate history where the space race never ended – this app fills in some of the blanks between seasons 1 and 2, which are set a decade apart. That's reflected in some of the '80s paraphernalia found in the app, like a VHS player, a mix tape featuring music from Earth, Wind and Fire and even an Apple II computer.",
    "The app was made in collaboration with the writers on the show – and really demonstrates how the intersection of Apple's technology and streaming content can provide mutual benefits.",
    "We asked producer Ben McGinnis and Ronald D Moore if the needs of this app required the writers to flesh out the show's alternate history in more detail than they otherwise might have.",
    "\"I think that's something we were excited about, because this story takes place in 1980, a specific moment in time in our world between seasons, and we wanted to get across lots of hints and Easter Eggs about what's going on in our world at large,\" McGinnis says. \"Just in terms of its alt history, but also specifically with the characters of the Stevens, since these are items from their home.\"",
    "A lot of the narrative information needed to make the app existed anyway, simply from the work that went into building the background of the show's setting. It also allowed the writers to tease plot points that will play a key role in season 2 – like the United States' escalating Cold War with the Soviets, and how that leads to extreme tensions on the moon.",
    "\"We also had a lot of this material in terms of the alternate history – like the political and timeline of it – we already had, but we didn't have ways of really fitting it in to the on-air television show,\" Moore tells us. \"So it was really a great opportunity, because we'd already done a lot of the thought, and a lot of the plotting internally about events that would've happened, things that would've changed, tech that would've gone differently.",
    "\"It's implied or in the background of the television series, but the AR ability gave the viewer a chance to really see it for the first time, and really play with it, and really look around, and see it in a richer format than what we could ever do in the series.\"",
    "The For All Mankind: Time Capsule app is available now, and For All Mankind returns for season 2 starting February 19 on Apple TV Plus."
  ],
  "headers": {
    "4": "Filling in the gaps"
  },
  "links": {
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review"
  }
}