{
  "source": "https://www.techradar.com/news/i-cooked-every-meal-in-an-air-fryer-for-a-year-and-now-theyre-in-the-prime-day-sale",
  "title": "I cooked every meal in an air fryer for a year, and now they're in the Prime Day sale",
  "category": "appliances",
  "updated": "2021-06-23T02:18:28Z",
  "author": "sophie-bird",
  "summary": "I didn't even miss my oven",
  "article": [
    "Prime Day deals on air fryers always get me excited and that's because these handy little appliances really will change your life. Well, your cooking life anyway. It's not until something breaks that you realize quite how much you depend on it, so when my oven broke last year, I turned to my trusty air fryer - and you know what? It was actually better than using an oven.",
    "The best air fryers are relatively new in the appliance world but as my job involves testing out all kinds of weird and wonderful cooking solutions, I'd got myself an air fryer thinking it would be my go-to when I just needed to make some fries. Little did I know, I'd need it for literally every meal soon after.",
    "So, when my oven gave up and we were in the middle of a pandemic when literally nobody left the house, out came the air fryer and it's never really gone away since. My initial thought was that eating fries for the foreseeable might seem nice but wouldn't really do me any favors but I quickly learned that an air fryer is actually way more versatile than I first thought. Yes, fries worked well in it, but I didn't anticipate a toasted sandwich, cuts of meat, seafood, and even cakes would fare just as well in the air fryer.",
    "Just how versatile these machines are isn't the only reason why I didn't hurry to replace my oven, there's actually a list of reasons. In fact, I'd go as far as to say that anyone could swap their oven for an air fryer, and here's why.",
    "Not in the US? Scroll down for deals in your region.",
    "The first discovery I was glad to make with my air fryer was just how quickly it cooks compared to a standard oven. Since I literally couldn't switch my oven on to preheat it, I saved myself a good 10 - 15 minutes every time I went to cook a meal because preheating the air fryer takes around two minutes instead.",
    "Aside from preheating quickly, the air fryer circulates hot air around the food which sits in a frying basket with holes in the sides. This is essentially a form of convection cooking but with really hot temperatures which in turn, make the whole cooking process much faster.",
    "Probably the most well-known benefit of an air fryer is that they, well...air fry. This means that the circulating hot air does all the hard word and you don't actually need hardly any oil at all. Some dishes I made didn't need any oil at all, and yet the results were still tasty and crisp.",
    "The lack of oil also means cleaning up isn't as arduous and cooking fats don't build up inside the machine.",
    "I won't lie, this was probably my favorite part of using an air fryer - cleaning up takes seconds. Most air fryers have dishwasher-safe frying baskets, so all you have to do is stick them in the dishwasher and forget about it. Job done.",
    "I reveled in the fact that I didn't have to scrub my oven (a job I loathe doing) while I was using my air fryer, nor did I have to worry about cleaning the smears out of the glass door. Instead, I simply put the air fryer basket in the dishwasher and gave the outside of the machine a wipe down with a damp cloth.",
    "Ovens aren't cheap, that's no secret but even now I do have a working oven, I'm always keen for extra cooking space when we have guests over. My air fryer is far from redundant now because I just use it as additional cooking space, as you would a second oven.",
    "My air fryer is large enough to cook a whole chicken so that leaves me with plenty of oven space to prepare side dishes. Essentially, if you need a second oven, consider an air fryer before you splash out on a huge appliance - it might just tick all of your boxes.",
    "If you haven't guessed by now, I like to make life easier in the kitchen and an air fryer definitely does that for you. These appliances have a selection of preset buttons for everything from cooking meat to making bread (yes, really), so you don't have to worry about choosing the right cooking temperature for every dish you make. Simply select the preset and press start.",
    "Of course, there was the odd occasion I made something that wasn't on the preset menu, and for this, I just selected the cooking duration and the temperature I wanted for that dish.",
    "So, now you see how I managed to swap my oven for an air fryer for a whole year and it actually turned out pretty well.",
    "No matter where you live, you'll find all the lowest prices for air fryers from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "1. They cook faster",
    "7": "2. They need hardly any oil",
    "9": "3. They're super easy to clean",
    "11": "4. They're cheaper than a new oven",
    "13": "5. There's no guesswork",
    "16": "More air fryer deals",
    "17": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best air fryers": "https://www.techradar.com/news/best-air-fryer"
  }
}