{
  "source": "https://www.techradar.com/news/new-xbox-series-x-controller-is-a-must-have-for-original-xbox-fans",
  "title": "New Xbox Series X controller is a must-have for original Xbox fans",
  "category": "gaming",
  "updated": "2021-10-07T15:16:28Z",
  "author": "adam-vjestica",
  "summary": "Inspired by the original Xbox debug kit",
  "article": [
    "Microsoft has announced that a brand-new Xbox Series X controller and wired Xbox stereo headset will be released on November 15 to mark the 20th anniversary of the original Xbox console.",
    "Both the 20th Anniversary Special Edition Xbox Wireless Controller and 20th Anniversary Special Edition Xbox Stereo Headset – to use the products’ official titles – take design cues from the original Xbox debug kit, which was a translucent green.",
    "The new Xbox Series X controller sports a striking translucent black finish, with silver internals, so you can ogle everything inside. The Xbox button features the same acid-like green color that was used on the first Xbox, and the iconic color can also be found on the back grips and around the controller’s hybrid D-pad.",
    "The new Xbox controller also comes with a nice birthday bonus, too. Connect the controller to your Xbox Series X or Xbox Series S console, and you can unlock an exclusive 20th Anniversary dynamic background.",
    "What’s nice, though, is that if you connect your controller to a friend’s console, they’ll also get to use it. However, if they grow bored of it and change it, it will disappear and only return once the controller is reconnected.",
    "The Xbox Stereo Headset also features the same black translucent body and green accents, like on the microphone. Oddly, the Xbox Wireless Headset hasn’t received the same anniversary treatment, only the wired version.",
    "If you really want to get into the birthday spirit, Microsoft is also selling a Razer Universal Quick Charging Stand for Xbox, which matches the controller, and some 20th anniversary Xbox gear.",
    "The 20th Anniversary Special Edition Xbox Wireless Controller and 20th Anniversary Special Edition Xbox Stereo Headset will be released on November 15, 2021, and are priced at $69.99 / £59.99.",
    "The original Xbox might have been a commercial flop compared to Sony’s PlayStation 2, but it helped cement Microsoft into the console space, something which many analysts thought wouldn’t be possible. It also helped fill the gap left behind by Sega, who pulled out of the console race after releasing the Dreamcast.",
    "Original Xbox games like Halo: Combat Evolved, Forza Motorsport, Jet Set Radio Future, and Jade Empire all helped the console attract a loyal fanbase, and many titles like Forza Motorsport soon became permanent fixtures in Microsoft’s games lineup.",
    "While the Xbox has always struggled to break ground in Japan, and Microsoft made one too many missteps with its Xbox One launch, things are certainly looking up for the green team. With the success of Xbox Game Pass and blockbuster titles on the way like Halo Infinite and Forza Horizon 5, it's a good time to be an Xbox gamer.",
    "Of course, if you’re feeling nostalgic, you can still play original Xbox games on the Xbox Series X/S, some of which now run at 4K resolution and support Auto HDR."
  ],
  "headers": {
    "8": "Analysis: Xbox has come a long way in 20 years"
  },
  "links": {
    "Xbox Series X controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "20th Anniversary Special Edition Xbox Wireless Controller": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1145614708556503000&murl=https%3A%2F%2Fwww.xbox.com%2Fen-GB%2Faccessories%2Fcontrollers%2F20th-anniversary",
    "20th Anniversary Special Edition Xbox Stereo Headset": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9009073523065502000&murl=https%3A%2F%2Fwww.xbox.com%2Fen-GB%2Faccessories%2Fheadsets%2F20th-anniversary-headset",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Wireless Headset": "https://www.techradar.com/reviews/xbox-wireless-headset-review",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "Xbox has always struggled to break ground in Japan": "https://www.techradar.com/news/xbox-series-x-is-seeing-phenomenal-growth-in-japan-no-seriously",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Auto HDR": "https://www.techradar.com/news/what-is-xbox-series-x-auto-hdr-microsofts-game-changing-feature-explained"
  }
}