{
  "source": "https://www.techradar.com/news/xbox-series-x-vr-hopes-dashed-by-microsoft",
  "title": "Xbox Series X VR hopes dashed by Microsoft",
  "category": "gaming",
  "updated": "2021-03-17T10:05:33Z",
  "author": "gerald-lynch",
  "summary": "Microsoft has been quick to debunk VR rumors for its consoles",
  "article": [
    "Hoping to see VR support come to Microsoft's Xbox Series X and Xbox Series S consoles? Keep hoping, as the company has moved to squash rumors of the feature hitting its latest and greatest machines.",
    "The move to debunk virtual reality support comes in the wake of messages appearing on the consoles of some Italian Xbox players. As spotted by IGN Italy, players were being greeted with with a pop-up translating to “An update for the VR headset is available” when plugging in Microsoft's new Xbox Wireless Headset to a console.",
    "The message only appeared on the \"Xbox Series X/S operating system,\" according to the report, and was followed up by an \"Update VR headset\" message, leading to speculation that the long-rumored VR support for this generation of machines was finally incoming.",
    "That, sadly, is now not the case, with Microsoft stating that translation errors are the reason for the confusion.",
    "“The copy in this error message is inaccurate due to a localization bug. VR for console is not a focus for us at this time,” said a Microsoft representative in a message to former Kotaku editor Stephen Totilo.",
    "Microsoft only has itself to blame for gamers hoping to have VR features coming to the consoles – after all, it was Microsoft that first suggested the idea.",
    "Before the Series X / S console's were fully unveiled, Microsoft had stated that \"high fidelity VR\" would be a key selling point of the Xbox Series hardware family. As late as February 2020 Xbox boss, Phil Spencer stated that VR support for the consoles would become a \"no brainer,\" provided that the popularity and availability of VR continued to grow.",
    "With the Oculus Quest 2 a smash hit, the Oculus Quest 3 in development and Xbox's big rival PlayStation planning a PS5 PSVR 2 headset, there's certainly plenty of interest in VR. But it seems, for now at least, it hasn't quite reached \"no brainer\" territory for Microsoft."
  ],
  "headers": {
    "5": "Will the Xbox ever get VR support?"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "IGN Italy": "https://it.ign.com/xbox-series-x/179732/news/microsoft-al-lavoro-su-un-headset-vr-per-xbox-gli-indizi-arrivano-dalle-nuove-cuffie-wireless",
    "Xbox Wireless Headset": "https://www.techradar.com/reviews/xbox-wireless-headset-review",
    "a message to former Kotaku editor Stephen Totilo": "https://twitter.com/stephentotilo/status/1371904309772845059",
    "\"no brainer,\"": "https://www.videogameschronicle.com/news/xbox-boss-hopes-it-will-eventually-be-a-no-brainer-to-support-vr/",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors"
  }
}