{
  "source": "https://www.techradar.com/news/did-battlenet-just-leak-world-of-warcraft-burning-crusade-classics-release-date",
  "title": "Did Battle.net just leak World Of Warcraft: Burning Crusade Classic's release date?",
  "category": "computing",
  "updated": "2021-05-05T17:04:22Z",
  "author": "john-loeffler",
  "summary": "The Dark Portal reopens in early June?",
  "article": [
    "The release date for World of Warcraft: Burning Crusade Classic might have just leaked by accident, pointing to an early June launch date for the new expansion to World of Warcraft Classic.",
    "According to some Reddit users, an ad showed up on their Battle.net launcher indicating that Burning Crusade Classic was set to launch on June 1, before it was quickly taken down. The users grabbed screenshots, though, and posted them on the site, which was quickly picked up by Wowhead.",
    "The Burning Crusade Classic Beta test is still ongoing and there hasn't been any word from Blizzard about a release date. While we don't doubt the veracity of the ad, especially since a number of users seemed to have screengrabbed it before it was taken down, June 1 is somewhat suspect as the actual release date for the expansion.",
    "Blizzard has only said that they anticipate a \"Summer\" release date, so June 1 would be the earliest possible date for a release in that window. What's more, there is the issue of the expansion's pre-patch phase, which is usually two weeks and prepares a server for the expanded content, which hasn't been announced either. These announcements usually happen a couple of weeks ahead of the patch rollout.",
    "Besides, not having made an official announcement yet, having less than a month between that announcement and a launch of something as complicated as the new Burning Crusade Classic servers - which essentially branch the Classic servers into an entirely separate and parallel game service - would be pretty daunting. After all, the Beta testing is only about five weeks old and previous beta tests have run for three or four months. Still, it's not an entirely new game, so not nearly as much testing might be required.",
    "While we don't believe that World of Warcraft: Burning Crusade Classic will release on June 1, that doesn't mean the ad is fake. We could certainly see an early June release date for Burning Crusade Classic, and the ad with the June 1 date might have been some preliminary marketing material that accidentally went live. That definitely isn't unheard of in the industry.",
    "Most likely, this was a very preliminary date set in the early stages of planning which got moved back internally, but the ad art and copy were still sitting on an internal server and accidentally got used by an ad generating algorithm.",
    "Without an official announcement though, any release date should be taken with a grain of salt. But now that the beta test is fully underway, there's every reason to believe that the official announcement will come sooner rather than later, so fans won't have long to wait to venture through the Dark Portal once again."
  ],
  "headers": {
    "5": "So is the ad a fake?"
  },
  "links": {
    "World of Warcraft: Burning Crusade Classic": "https://www.techradar.com/news/world-of-warcraft-classic-the-burning-crusade-release-date-beta-and-everything-we-know",
    "Reddit users": "https://www.reddit.com/r/classicwow/comments/n49wq5/june_1st/",
    "Wowhead": "https://tbc.wowhead.com/news/battle-net-launcher-leak-reveals-burning-crusade-classic-releasing-june-1st-322149"
  }
}