{
  "source": "https://www.techradar.com/news/buying-a-new-pc-watch-out-for-this-secret-hard-drive-tax",
  "title": "Buying a new PC? Watch out for this secret “hard drive” tax",
  "category": "computing",
  "updated": "2021-08-21T03:00:04Z",
  "author": "desire-athow",
  "summary": "We’ve got nothing against hard drives but Dell and others are pushing things a bit too far",
  "article": [
    "One of the largest personal computer vendors in the world sells a workstation PC that costs thousands and yet prominently features a component that - by all accounts - should not be present on the specification list. That’s right, Dell is selling a $3,000 PC - the Precision 7920 rack workstation - which comes with a venerable hard drive as the system drive.",
    "The operating system will run off the latter and since this is - by far - the weakest link in the component chain one can expect poor overall system performance. That’s akin to fitting bicycle wheels to a sports car and expecting it to run smoothly. Sadly, pairing hard disk drives with powerful computers is not the exception and is symptomatic of a bigger trend across the industry where desktop users don't get the best value for money",
    "Dell sells a staggering 35 desktop PCs and workstation SKUs (stock keeping units) across its range that run off SATA-based hard disk drives. Rival HP stocks 19 models that run on spinning disks while the world’s largest PC manufacturer, Lenovo, comes third with 18.",
    "From our research, what is obvious is that this disproportionately impacts business computers and workstations. Note that these numbers were valid at the time of writing and will fluctuate depending on stock availability. For Lenovo, the numbers had to be manually compiled.",
    "There’s three probable reasons why even the biggest companies are still flogging hard disk drives with desktop computers. Firstly, there’s price; the cheapest hard drives are still marginally cheaper than even the lowest-priced SSD, especially as the latest global chip shortage affected SSDs more than hard disk drives, therefore propping up the average selling price of solid state drives.",
    "Secondly, the cheapest hard disk drive has a much higher capacity than the cheapest SSD and for the guy on the street, this is a compelling argument (i.e bigger is better). 128GB is the smallest SSD size available while 500GB is the lowest capacity found in a 3.5-inch form factor hard disk drive.",
    "Last but not least is a more cynical reason. Many of these desktops offer SSD as an upgrade and very often at a shockingly high price. The Dell Optiplex 3080 offers a 256GB SSD as a $76.70 upgrade. On Amazon.com, the price difference is a mere $5.50 ($37.99 Silicon Power SSD vs $32.50 WD Blue).",
    "What this sales technique - which we call the hard drive tax - achieves is masking the true final price once you bring your PC up to speed , thereby preventing the customer from comparing apples to apples with rival offerings. Clever!",
    "In contrast, the same situation is not mirrored when it comes to laptops: HP sells a mere two laptops (out of more than 50) with hard disk drives probably because this 60 year old technology is too fragile, too voluminous and too power hungry for consumer or business laptops. You don’t want increasing laptop returns to eat into your already wafer-thin margins.",
    "As a conclusion, we urge PC vendors to move away from hard disk drives altogether, at least when it comes to system drives. That’s the right thing to do for buyers, B2C or B2B, whether or not that will happen will depend on the tech giants of this world."
  ],
  "headers": {
    "4": "Why hard disk drives?",
    "8": "The laptop advantage"
  },
  "links": {
    "Precision 7920 rack workstation": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1257627775872962300/https://www.dell.com/en-us/work/shop/desktops-all-in-one-pcs/precision-7920-rack-workstation/spd/precision-7920r-workstation/xctopr7920us_2",
    "hard drive": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "desktop PCs": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "business computers": "https://www.techradar.com/news/best-business-desktop-pcs",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "cheapest hard drives": "https://www.techradar.com/news/cheap-hard-drive-deals",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "Silicon Power SSD": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSilicon-Power-256GB-Gen3x4-SP256GBP34A60M28%2Fdp%2FB07ZGK3K4V%2Fref%3Dsr_1_4%3Fdchild%3D1%26keywords%3D256GB%2BPCIE%2BSSD%26qid%3D1629214871%26sr%3D8-4%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1336999288621637600-20",
    "WD Blue": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FWestern-Digital-WD5000AZLX-500GB-Internal%2Fdp%2FB00B1LW3W0%2Fref%3Dsr_1_5%3Fdchild%3D1%26keywords%3D500GB%2BHDD%2B3.5%26qid%3D1629214793%26refresh%3D1%26sr%3D8-5%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2799099522677506000-20",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "business laptops": "https://www.techradar.com/news/best-business-laptops"
  }
}