{
  "source": "https://www.techradar.com/news/many-companies-are-falling-when-behind-when-it-comes-to-site-search",
  "title": "Many companies are falling when behind when it comes to site search",
  "category": "computing",
  "updated": "2021-06-16T15:20:35Z",
  "author": "abigail-opiah",
  "summary": "Want to win customer loyalty and sales? Sort out search",
  "article": [
    "New research has revealed that many consumers will drop their original choice of retailer and buy a product or service from a different business because they couldn’t find the information they were looking for online.",
    "A report from AI search company Yext found that nearly three in ten consumers who used a site search tool ended up changing their minds, and over half (56%) believe that site search provides them with unrelated results.",
    "The report also found that for many consumers, site searches don't fulfil the aim of providing answers - with 46% saying it simply didn't seem to understand their questions.",
    "Industries such as retail (41%) and entertainment services (35%) were considered to have good site search, while industries such as energy and utilities (24%), government services (24%) and telecoms (19%) were considered to have poor site search.",
    "Yext suggested that the amount of consumers switching to competitors on the theory that site search is outdated - as out of the 2,098 adults surveyed (of which 1,703 use site search) 35% believed that site search provides them with out of date or inaccurate information.",
    "During the pandemic, digital services have been a key tool for connecting consumers with brands online, and nearly two-thirds (64%) of respondents who use site search said they would be more likely to buy from a business that provided direct answers to their questions, with 26% feeling site search infrequently provides them with the results they’re looking for first time.",
    "The survey also alluded to the idea that businesses are not proactive in finding solutions to the issues found in the report, with 40% of UK respondents mentioning that not enough is being done to improve their site search. For businesses, this has detrimental effects on customer loyalty and ultimately sales.",
    "Evaluating the data, Jon Buss, Managing Director, EMEA at Yext said: “The pandemic has proven that now more than ever, the availability of up to date and accurate information online is vital in not only making the public feel safe, but in being able to engage with new and existing customers, no matter where they are in their customer journey.",
    "“Yet site search has been taken for granted for far too long. Businesses need to wake up to the damage that outdated search tools are doing to their brand and bring it into the 21st century.”"
  ],
  "headers": {
    "4": "Site search fails"
  },
  "links": {}
}