{
  "source": "https://www.techradar.com/news/apple-vr-headset",
  "title": "Apple VR headset release date, news, price and what we want to see",
  "category": "vr",
  "updated": "2021-12-09T12:51:07Z",
  "author": "hamish-hector",
  "summary": "The Apple of our eye",
  "article": [
    "Apple’s virtual reality headset hasn’t been officially confirmed yet – but it may as well be with all the rumors, acquisitions and new hires in recent years.",
    "What we know so far is, unlike the company's upcoming Apple Glasses, the Apple VR headset will focus less on augmented reality – although latest reports suggest it will have an AR component – and is expected to arrive slightly sooner.",
    "Codenamed N301, Apple's VR headset is likely to be a less-widespread product than the solely AR device that we expect will come after it. Both products have allegedly been hit with multiple hurdles throughout their development, but the N301 will hopefully begin to recuperate costs while work on the company's AR glasses continues.",
    "More recent reports suggest that even though the VR headset hasn't been officially announced yet, Apple is making bold plans for the future. Regular Apple analyst and insider Ming-Chi Kuo has shared new details about the company’s mixed reality ambitions, detailing this first generation device, which will then set the bar for premium virtual reality and augmented reality hardware to come with a second-gen headset to follow shortly after.",
    "But it's still early days, for now here’s everything we know about the Apple VR headset, as well as all the features we hope to see when it launches.",
    "Apple’s first headset is rumored to be released in the first quarter of 2022, according to Bloomberg sources.",
    "Many of these same sources also claimed the VR device has faced multiple development challenges, so it’s possible this suspected date could be pushed back further if more issues arise.",
    "This release window has come up a few times since, like in a more recent update according to Ming-Chi Kuo (an analyst with a great track record for Apple leaks), in a research report seen by MacRumors.",
    "Mark Gurman (a leaker with a good track record for Apple information) has also said to expect this headset in 2022, and claimed that it'll be pricey – it's probably going to have some premium-level specs.",
    "Indeed, while a price hasn’t yet been confirmed, a report by The Information has the Apple VR headset priced at an eye-watering $3,000.",
    "This estimate is somewhat corroborated by Bloomberg, whose sources have said Apple expects the VR headset to sell roughly one unit per store per day. These figures match up with the approximate sales of the $5,999 Mac Pro Desktop.",
    "Extremely lightweight",
    "According to new rumors, the Apple VR headset could weigh just 150 grams. That's less than the combined weight of the Air Pod Max and its case, or the weight of an iPhone 12. This would also make Apple's headset lighter than the Oculus Quest 2.",
    "How Apple hopes to pull this off while also providing enough tech and power to provide a fulfilling experience remains to be seen. It's possible that this less heavy design won't include all the features listed below (like 8K screens) and could instead use the company's recently patented hologram tech.",
    "Big mixed reality ambitions",
    "Recent reports suggest that even though the VR headset hasn't been officially announced yet, Apple is making bold plans for the future.",
    "Regular Apple analyst and insider Ming-Chi Kuo has shared new details about the company’s mixed reality ambitions, detailing this first generation device, which will then set the bar for premium virtual reality and augmented reality hardware to come with a second-gen headset to follow shortly after.",
    "Dual 8K screens",
    "One feature that seems almost certain given the plethora of leaks is the VR headset’s dual 8K displays. At 7680 x 4320 resolution, that’s four times as many pixels as a 4K screen and significantly more pixels than any other commercially available device.",
    "For comparison, the Valve Index VR headset uses two 1440 x 1600 pixel displays. Take this information with a pinch of salt, though, as it's merely based on leaks, but a lot of the sources we've heard from suggest this is the case.",
    "Eye-tracking software",
    "For those who might be worried about those 8K screens eating up battery life and requiring huge processors, Apple apparently has a plan, based on rumors we've heard. Eye-tracking software in the headset is designed to follow where the user is looking and only activate that portion of the screen at the full 8K resolution.",
    "Other areas of the screen will allegedly become more blurred, to save on processing power, using a trick called foveated rendering.",
    "LiDAR scanning",
    "LiDAR scanning is a nifty new way for devices to detect the world around them, and we've seen Apple use it on products like the iPad Pro and the iPhone 12 Pro / iPhone 12 Pro Max.",
    "In a system that's similar to radar, LiDAR (Light Detection and Ranging) uses lasers to determine the distance and depth of objects.",
    "This tool is great for AR, allowing devices to more accurately map virtual constructs onto real-life objects, but could also be used with VR to map out a room and determine the safe space surrounding a user.",
    "Wearable controller",
    "One interesting feature that could be coming to the Apple VR headset is a wearable controller that can track finger movements. A new patent was filed for a \"Self-Mixing Interferometry-Based Gesture Input System\" that tracks a user's hand movements using rings attached to the thumb and index finger.",
    "The patent goes onto say this tracking would \"provide input to an AR, VR, or MR application.“ The talk of AR and MR could mean that this device is intended for Apple's AR headset, as well. Potentially, this controller would be an optional peripheral – like the Apple Pencil – that's released at a later date and could be used across Apple's different headsets.",
    "A second patent suggests you might also get a haptic sock, but it's yet to be seen if this would work as a controller, or indeed will even get made at all.",
    "This rumors feed into more recent reports, which suggest that Apple might be employing 3D sensors for hand tracking, potentially eliminating the need for traditional physical controllers.",
    "As reported by The Verge, reputable Apple analyst Ming-Chi Kuo's research notes on the Apple AR headset suggest that the rumored device could feature fully 3D hand tracking, and a user interface that detects and makes use of physical objects in your immediate surroundings.",
    "3D finger modeling and in-air gesture recognition",
    "Apple has also been granted a patent relating to the 3D modeling of fingers for in-air gesture recognition – suggesting a system capable of using virtual limbs to navigate virtual environments.",
    "The patent refers to both finger gestures and visual touch detection, with figure images outlining how the system might work.",
    "In the above image, for example, a diagram illustrates a potential system setup for generating a 3D model of a fingertip using a combination of cameras and depth sensors. Accompanying text also references contour alignment-based algorithms that could be used to enable hand tracking.",
    "While this approach to finger tracking may be new, the actual result sounds similar to the tracking software we’ve seen in existing VR headsets, like the Oculus Quest 2.",
    "Invisible markers on Apple devices",
    "We've also heard mutterings of invisible markers that would let a mixed reality headset better interact with a smartphone.",
    "A freshly-awarded patent describes how AR glasses may struggle to identify a smartphone in their field of view, and how it differs from other displays – say a laptop or TV display. This would make it difficult for the two devices to interact effectively, with AR information that should be triggered by and associated with a mobile device not appearing. The same principles, we'd assume, would apply to a VR headset.",
    "The solution, then, would potentially be to place on the phone (or Apple Watch, or any other accessory for that matter) visual markers that include \"spectral reflectance codes.\" These would make use of retroreflective materials, photoluminescent materials and thin-film interference filter layers, that could be identified by the headset, but would be near-invisible on the device to a user. These markers could then tell the headset information relating to shape, orientation, size and location in the real world.",
    "A blend of VR and AR",
    "It's challenging to separate a lot of the rumors about Apple's upcoming VR headset at the moment, as some apply to the Apple Glasses – expected later. But it looks like the VR headset could have elements of AR too. According to Kuo, the headset will be capable of both AR and VR, with the latter enabled by a pair of 4K Micro OLED displays from Sony. In the same update he also revealed it could be powered by a chipset similar to the M1 that we’ve seen in some Macs and the iPad Pro 2021.",
    "Kuo says that all this power will mean it can work independently of an iPhone or Mac, and that it will include a second lower-end processor that will power the sensors in the device. This secondary processor will apparently be necessary due to the large number of sensor-related aspects.",
    "Wireless headset",
    "Previous rumors about the VR headset had suggested that it would be wireless, though these came just three years ago. The Information’s alleged design in the image above does maintain this look, but with many more months ahead before release, the design of the headset is still subject to change.",
    "While wireless headsets like the Oculus Quest 2 might lose something in performance to the PC-powered alternatives such as the Valve Index, the freedom of movement and improved immersion of a wireless device are a massive benefit if they can be included.",
    "If Apple’s headset is indeed sporting two 8K screens, it may need quite a lot of power pumped into its shell, so our wireless dreams may not become reality.",
    "As light as a feather",
    "Apple’s VR headset will have some weight to it, but we’re hoping it isn’t too much of a strain on a user’s neck. Given how powerful the thing sounds, such as having those high-resolution screens, there’s reason to worry about the weight we’ll be carrying around on our heads.",
    "Those rumors of a lightweight device listed above are promising, but we're still hoping Apple’s design team is able to devise a way to keep the VR headset as light as possible, or at least distribute the weight to make wearing it comfortable.",
    "Haptic controllers",
    "Haptic feedback has become increasingly prevalent in recent years, and we hope Apple’s team takes note of the success of the Valve Index and the PS5’s DualSense controller in this department. While it is then on software designers to implement haptic feedback effectively, having the hardware there will allow them the option to create more lifelike experiences.",
    "While we've already detailed potentially-conflicting reports of both haptic fingertips and completely-virtual finger tracking on the headset, we're hoping that, whichever system Apple decides to pursue, this doesn't come at the expense of immersion."
  ],
  "headers": {
    "5": "Apple VR headset release date and price",
    "11": "Apple VR headset rumors and leaks",
    "45": "What we want to see"
  },
  "links": {
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses",
    "latest reports": "https://www.techradar.com/news/apples-ar-headset-could-land-next-year-and-be-more-powerful-than-the-iphone-14",
    "recent reports": "https://www.techradar.com/news/apple-vr-and-ar-headset-will-have-m1-level-performance-and-gen-2-is-already-on-the-way",
    "first quarter of 2022": "https://www.techradar.com/news/apple-glasses-could-land-in-early-2022-with-lidar-tracking",
    "Bloomberg sources": "https://www.bloomberg.com/news/articles/2021-01-21/apple-s-first-vr-headset-to-be-niche-precursor-to-eventual-ar-glasses?sref=HrWXCALa",
    "more recent update": "https://www.techradar.com/news/apples-ar-headset-could-land-next-year-and-be-more-powerful-than-the-iphone-14",
    "MacRumors": "https://www.macrumors.com/2021/11/25/kuo-apple-ar-headset-mac-level-computing/",
    "expect this headset in 2022": "https://www.techradar.com/news/new-ipad-pro-2021-might-be-as-powerful-as-the-latest-macs",
    "some premium-level specs": "https://www.techradar.com/news/apples-arvr-headset-rumored-to-be-a-premium-device-arriving-in-2022",
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2139770263911378000&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Fnew-apple-mixed-reality-headset-details-swappable-headbands-eye-tracking&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fapple-vr-headset",
    "Mac Pro Desktop": "https://www.techradar.com/news/mac-pro-2019-first-look",
    "new rumors": "https://www.techradar.com/news/apple-vr-headset-could-weigh-less-than-the-airpods-max",
    "Air Pod Max": "https://www.techradar.com/reviews/airpods-max",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "recently patented hologram tech": "https://www.techradar.com/news/apple-glass-ar-could-create-holograms-of-virtual-objects",
    "Recent reports": "https://www.techradar.com/news/apple-vr-and-ar-headset-will-have-m1-level-performance-and-gen-2-is-already-on-the-way",
    "Valve Index VR": "https://www.techradar.com/reviews/valve-index",
    "rumors we've heard": "https://www.techradar.com/news/new-apple-arvr-headset-leak-gives-more-details-on-incoming-eye-tracking-tech",
    "foveated rendering": "https://www.techradar.com/news/steam-vrs-latest-trick-boosts-quality-for-lower-power-windows-10-pcs",
    "LiDAR scanning": "https://www.techradar.com/news/apple-glasses-could-land-in-early-2022-with-lidar-tracking",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "LiDAR (Light Detection and Ranging)": "https://www.techradar.com/news/what-is-a-lidar-scanner-the-iphone-12-pros-rumored-camera-upgrade-anyway",
    "new patent": "https://www.techradar.com/news/apple-vr-headset-controller-might-be-a-pair-of-thimble-rings",
    "Apple's AR headset": "https://www.techradar.com/news/apple-glasses",
    "Apple Pencil": "https://www.techradar.com/deals/the-best-cheap-apple-pencil-prices-sales-and-deals",
    "haptic sock": "https://www.techradar.com/news/apple-ar-and-vr-might-use-haptic-socks",
    "employing 3D sensors for hand tracking": "https://www.techradar.com/news/apples-rumored-ar-headset-might-say-goodbye-to-physical-controllers",
    "The Verge": "https://www.theverge.com/2021/12/9/22825675/apple-ar-headset-hand-tracking-controllers-kuo-report",
    "research notes": "https://www.macrumors.com/2021/12/08/apple-ar-vr-hand-gesture-interface/",
    "3D modeling of fingers for in-air gesture recognition": "https://www.techradar.com/news/apple-vr-headset-could-turn-your-fingers-into-holographic-controllers",
    "invisible markers": "https://www.techradar.com/news/your-next-iphones-most-important-feature-may-be-one-you-cant-even-see",
    "patent": "http://patft.uspto.gov/netacgi/nph-Parser?patentnumber=10,969,600",
    "the same update": "https://www.techradar.com/news/apples-ar-headset-could-land-next-year-and-be-more-powerful-than-the-iphone-14",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "rumors": "https://www.techradar.com/news/apple-is-reportedly-making-a-vr-and-ar-headset-with-8k-displays-per-eye",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller"
  }
}