{
  "source": "https://www.techradar.com/news/ddos-assaults-against-voip-providers-continues",
  "title": "DDoS assaults against VoIP providers continue",
  "category": "computing",
  "updated": "2021-09-28T10:20:08Z",
  "author": "mayank-sharma",
  "summary": "DDoS threat actors have targeted VoIP providers earlier this month as well",
  "article": [
    "Bandwidth.com, one of the largest Voice over Internet Protocol (VoIP) providers in the US, has had its services allegedly disrupted by a Distributed Denial of Service (DDoS) attack.",
    "The attack, which the company officially refers to as “an incident” in its official service status page, has caused service outages across the US over the past few days.",
    "According to the company, the disruptions first propped up over the weekend on September 25, causing many users to experience unexpected failures with their voice and messaging services.",
    "Since then, Bandwidth.com has been providing frequent status updates detailing outages affecting voice, messaging, and even emergency 911 services.",
    "As one of the leading telephony providers for US voice over IP companies, the disruptions with Bandwidth.com has reportedly caused issues with several other downstream VoIP providers including Twilio, Accent, DialPad, Phone.com, and RingCentral.",
    "However as BleepingComputer reports, none of these services have actually pointed the fingers at Bandwidth.com service disruptions, instead blaming it on issues with their unnamed upstream provider.",
    "Before Bandwidth.com, VoIP.ms faced the brunt of a DDoS attack earlier in the month. According to reports, the threat actors behind the VoIP.ms attack impersonated the REvil ransomware gang and demanded a ransom of a hundred Bitcoins to cease the attacks.",
    "While Bandwidth.com hasn’t officially confirmed that it has been targeted by a DDoS attack, employees of the service provider are telling customers that they have indeed been on the receiving end of a DDoS campaign, reports BleepingComputer.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Wide-scale disruptions"
  },
  "links": {
    "VoIP": "https://www.techradar.com/news/best-voip-service",
    "DDoS": "https://www.techradar.com/news/best-ddos-protection",
    "status": "https://status.bandwidth.com/",
    "Twilio": "https://www.techradar.com/reviews/twilio-voice",
    "DialPad": "https://www.techradar.com/reviews/dialpad",
    "Phone.com": "https://www.techradar.com/reviews/phonecom",
    "RingCentral": "https://www.techradar.com/reviews/ringcentral-office",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Bitcoins": "https://www.techradar.com/news/best-bitcoin-wallets",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/bandwidthcom-is-latest-victim-of-ddos-attacks-against-voip-providers/"
  }
}