{
  "source": "https://www.techradar.com/news/realme-gt-2",
  "title": "Realme GT 2: what we want to see",
  "category": "phones",
  "updated": "2021-12-04T09:00:04Z",
  "author": "tom-bedford",
  "summary": "Including Realme's first premium phone",
  "article": [
    "One of the most intriguing product launches of 2022 will be from the Realme GT 2 family. Not only will it bring the follow-up to the Realme GT, one of our favorite smartphones of 2021, but it'll also showcase the first premium Realme phone.",
    "That's not speculation; Realme already teased the Realme GT 2 Pro and confirmed its top-end status, so we're greatly anticipating this fancy-sounding flagship phone.",
    "In fact, we haven't heard anything official about the standard Realme GT just yet, but we'd be surprised if it didn't come along since a 'Pro' version is confirmed.",
    "There's likely still a long way to go because we're expecting the Realme GT 2 family to be unveiled in the first few months of 2022, and the GT Neo 2 is fairly new as it is.",
    "But we've collected everything we've heard about the upcoming smartphone so far and you can find it all below. We've also written up a short wish list based on current premium phones and Relame's performance so far.",
    "With no official information regarding the Realme GT 2's launch window, we're going to have to look to the past to guess when it could show up... which isn't exactly dependable given this is only the second generation.",
    "The original Realme GT was unveiled in March 2021 but was released globally about five months afterward; the GT Master Edition and GT Neo 2 were unveiled in the last few months of the year but went on sale pretty quickly.",
    "If we had to guess, we'd say the Realme GT 2 could launch earlier in the year, so the Pro model could better compete against the likes of the Samsung Galaxy S21, Xiaomi 12 and OnePlus 10. Then, maybe we'll see some spin-offs later in the year.",
    "Pricing is also a mystery, especially because the GT 2 Pro is going to be the brand's first premium phone. The original GT cost €449 (about $550, £390 or AU$710) and we expect a successor to cost roughly the same, but the Pro model will likely cost a lot more – maybe even double.",
    "While Realme confirmed the GT 2, we don't have too much about the phone.",
    "We do know one thing: the Pro will use the Snapdragon 8 Gen 1 chipset. This is a new processor from Qualcomm which will run in loads of top-end phones in 2022 – and Realme confirmed the GT 2 Pro is one of them.",
    "We've also seen some renders of the Realme GT 2 Pro which make it seem quite a lot like the Google Pixel 6, as it has a horizontal camera bar featured prominently on the rear.",
    "In a curious twist, we've also heard rumors of a 'Realme GT 2 Fold' – this was before the Pro was confirmed, so at the time we understood the Fold to be the top-end model, but now it sounds like a third member of the family.",
    "One of our favorite aspects of the Realme GT was its price. Despite top-end specs, a faux-leather rear and super-fast charging, its price was incredibly competitive.",
    "We've seen plenty of champions of the mid-range market blow their advantage by selling their phones for too much though, and we don't want Realme to make the same mistakes.",
    "We'd like the Realme GT 2 to launch for the same amount as the GT did, so it can continue to undercut other brands. The GT 2 Pro can cost more, but we'd ideally like it to be cheaper than the Samsung Galaxy S22 or Xiaomi 12.",
    "The Realme GT was only available to buy on AliExpress in Europe – it didn't go on sale on Amazon, or from Realme's website, or from telecom companies, or anyone else.",
    "This made it rather hard to buy, especially because AliExpress can be confusing and intimidating for the uninitiated.",
    "If Realme wants to be a big player in the West, its smartphones need to be easier to purchase.",
    "Realme phones run RealmeUI, a fork of Android, but something we've noticed on quite a few models is their bloatware.",
    "Bloatware is the presence of loads of pre-installed apps, usually ones you don't want, whose companies have paid to have their apps on the software. Realme UI is bad for this kind of thing.",
    "Though you can delete these pre-installed apps, it takes some work, and it still results in a messy-looking phone when you first boot it up. Let's hope Realme loses some of the bloatware for the Realme GT 2 family."
  ],
  "headers": {
    "5": "Realme GT 2 release date and price",
    "9": "News and leaks",
    "13": "1. Stick with the affordable price",
    "16": "2. A better way of buying it",
    "19": "3. Improved software"
  },
  "links": {
    "Realme GT": "https://www.techradar.com/news/realme-gt-2-looks-weirdly-like-the-google-pixel-6-according-to-leaked-renders",
    "Realme phone": "https://www.techradar.com/best/best-realme-phones",
    "GT Neo 2": "https://www.techradar.com/reviews/realme-gt-neo-2-review",
    "GT Master Edition": "https://www.techradar.com/reviews/realme-gt-master-edition-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10",
    "confirmed the GT 2": "https://twitter.com/skyli_realme/status/1465244372576784387",
    "Snapdragon 8 Gen 1": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "Realme confirmed": "https://www.techradar.com/news/it-is-confirmed-the-realme-gt-2-pro-will-feature-snapdragon-8-gen1-soc",
    "renders of the Realme GT 2 Pro": "https://www.techradar.com/news/realme-gt-2-looks-weirdly-like-the-google-pixel-6-according-to-leaked-renders",
    "Realme GT 2 Fold": "https://www.techradar.com/news/realme-gt-successor-could-be-a-foldable-phone",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22"
  }
}