{
  "source": "https://www.techradar.com/news/google-pixel-6-charging-speed-might-be-faster-but-not-truly-fast",
  "title": "Google Pixel 6 charging speed might be faster, but not truly 'fast'",
  "category": "phones",
  "updated": "2021-09-20T09:05:46Z",
  "author": "tom-bedford",
  "summary": "Perhaps only 33W",
  "article": [
    "We've seen a lot of Google Pixel 6 teases that paint a picture of a particularly premium phone, especially the 'Pro' version, but the new handsets may have an Achilles' heel: the Pixel 6 charging speeds apparently won't be impressive.",
    "According to a source for XDA Developers, the Pixel 6 Pro will support 33W charging, something the site notes that a recent Taiwanese regulatory certificate also backs up, and something we've actually heard before.",
    "What about the standard Pixel 6? There's no word on its charging speed, but it almost certainly won't be higher than 33W, if the Pro model gets that speed. For context, previous Pixel phones have powered at a sluggish 18W.",
    "XDA Developers thinks the Pixel 6 Pro won't arrive with a 33W charger in the box, with Google apparently looking to sell these separately. It's not clear if that's because the company is doing the eco-friendly thing and not packaging a charger with the phone, or because it's providing a plug that doesn't support 33W charging.",
    "In the grand scheme of smartphone things, 33W is not a fast charging speed. While it does beat the iPhone 13 and Samsung Galaxy S21 (20W and 25W respectively), it doesn't hold a candle to several other phones from companies like OnePlus, Realme and Xiaomi. Even budget phones from those companies exceed 33W, with many reaching 65W and even 120W, like the recent Xiaomi 11T Pro.",
    "Charging speed is a feature that has a very palpable effect on the way you use your device. An 18W charger takes more than two hours to power an average handset from empty to full – Xiaomi's newest phone takes just 17 minutes.",
    "As you can imagine, that changes the way you use your phone – instead of plugging it in of placing it on a charging pad for long spells, causing it to be out-of-action or at least stuck in one spot, you can relegate powering to short windows when you'd be doing other things anyway. We've taken to plugging in our 11T Pro while we take our pre-work shower, after which it'll have charge enough for the whole day – that's not something we can say about most other devices we've tested.",
    "There used to be some issues with fast charging – chiefly that it could damage the battery and cause it to degrade at a rapid rate, but companies are now implementing solutions to these problems, and there are fewer reasons to avoid fast charging.",
    "So while the Google Pixel 6 and 6 Pro might improved on previous Pixel phones, with improved camera tech and other new features, it sounds like they'll be lagging behind lots of rivals when it comes to charging speed. And for many phone users, charging speed is at least as important a feature as the cameras, screen quality or even processing power, so it's something Google really needs to work on."
  ],
  "headers": {
    "4": "Analysis: not exactly a Pro speed"
  },
  "links": {
    "XDA Developers": "https://www.xda-developers.com/google-pixel-6-pro-33w-wired-charging/",
    "actually heard before": "https://www.techradar.com/news/google-pixel-6-flagship-phones-tipped-to-support-33w-fast-charging",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi 11T Pro": "https://www.techradar.com/reviews/xiaomi-11t-pro"
  }
}