{
  "source": "https://www.techradar.com/news/windows-10-free-upgrade-loophole-still-works-will-microsoft-ever-close-it",
  "title": "Windows 10 free upgrade loophole still works – will Microsoft ever close it?",
  "category": "computing",
  "updated": "2021-01-19T11:01:50Z",
  "author": "matt-hanson",
  "summary": "Get it while you can",
  "article": [
    "It looks like you can still upgrade to Windows 10 for free, despite Microsoft ending that offer several years ago. However, while the offer for Windows 7 and Windows 8.1 users to upgrade for free to Windows 10 is officially over, a loophole remains that allows you to get Windows 10 for nothing.",
    "As WinCentral reports, this loophole has been around for ages, so Microsoft must be aware of it. However, it seems that the loophole remains – allowing anyone with a valid Windows 7 or Windows 8.1 install to upgrade for free.",
    "This has led many people – including us – to wonder if Microsoft is tacitly allowing the loophole to remain. After all, it’s actually in the company’s interest to get as many people on Windows 10 as possible, and closing that loophole may hurt that.",
    "Also, with Windows 7 having reached its end of life last year, Microsoft is keen to get people to move from the unsupported, older, operating system to the new one. This loophole may help Windows 7 holdouts make the move.",
    "To upgrade to Windows 10 for free, you need to have an activated Windows 7 or Windows 8.1 license installed on your PC.",
    "Next, use the Windows 10 Media creation tool from Microsoft to create a bootable USB, then use it to upgrade to Windows 10.",
    "Once you’ve updated to Windows 10, log in using your Microsoft Account. Go to Settings > Update > Activation and you should see that Windows 10 is activated.",
    "If it’s not, click ‘Activate PC’, then enter in your original Windows 7 or Windows 8.1 activation key.",
    "As you can see, this is all done inside Windows 10, using official Microsoft tools, so there’s no shady or illegal methods. It also makes it more likely that Microsoft knows about this, but chooses not to do anything."
  ],
  "headers": {
    "4": "How to get Windows 10 for free"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "As WinCentral reports": "https://thewincentral.com/upgrade-to-windows-10-for-free-from-windows-7-8-1-still-working-as-microsoft-leaves-the-loophole-open/",
    "Windows 7": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-7-622923/review",
    "Windows 8.1": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-8-1-1161745/review",
    "Windows 7 having reached its end of life": "https://www.techradar.com/news/windows-7-end-of-life-everything-you-need-to-know-about-the-death-of-windows-7",
    "Windows 10 Media creation tool from Microsoft": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1341504669546781400&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fsoftware-download%2Fwindows10"
  }
}