{
  "source": "https://www.techradar.com/news/tripod-tv-stands-are-coming-to-samsung-the-frame-and-lg-oled-tvs-and-were-all-for-it",
  "title": "Tripod TV stands are coming to Samsung The Frame and LG OLED TVs – and we're all for it",
  "category": "televisions",
  "updated": "2021-05-07T13:41:54Z",
  "author": "henry-st-leger",
  "summary": "Opinion: Taking a stand",
  "article": [
    "Samsung and LG may be continual competitors, pushing vastly different OLED and QLED TV technologies as well as throwing shade on each other's 8K screens and propensity to burn-in, but in one thing they seem to be in agreement: that TVs deserve a good stand.",
    "Over the CES 2021 expo, we've now seen both TV makers unveil a tripod TV stand for their premium sets, in such a striking moment of unity that it can't be left undiscussed.",
    "We heard from Samsung first, with the announcement of a 2021 iteration The Frame, its fashion-forward QLED television designed to pass off as a glitzy picture frame when not in use. This year's model will come with a host of new customization options, most notably including the tripod TV stand seen in the photo above.",
    "LG, on the other hand, has announced a three-legged floor stand that will be compatible with its Gallery Series OLED (LG's own answer to The Frame), as well as its long-running C Series and budget A Series (new for 2021). It will only work with the 55-inch and 65-inch models, it seems – and not the new 83-inch or 42-inch OLED panel sizes announced this year – but it's clear that LG is keen to leverage its TV stand design for as many different screens as possible.",
    "The Samsung version is more of a true tripod, with three legs jutting from the base of the television; the LG version opts for a vertical bar that splits into three balancing legs quite near to the ground. If the former is bolder about its choices, the latter may appeal more to some with its more demure appearance. You can see LG's iteration below:",
    "A good TV stand can be a real boon for the right home, allowing easy placement of a television without needing to commit to drilling into a wall for installation, or needing a hefty piece of furniture to act as a media cabinet. For those simply wanting to bring their TV up to eye level when they're seated, without any of the above hassles – especially for anyone renting a property – a tripod TV stand is an overwhelmingly obvious choice.",
    "LG and Samsung aren't the only ones cottoning on to the temptations of a sleek stand, though. Bang & Olufsen have long created fashionable stands for their TVs – and its new 48-inch OLED, the Beovision Contour, will be available to buy with a swivelling aluminium floor stand, wall-mounting, or a tabletop stand for placing on higher surfaces.",
    "The choice here is key: if a television doesn't give you an option conducive to your living room or home, there's no way it's going in your shopping basket.",
    "But for Samsung The Frame and LG's Gallery Series OLED, though, there's another factor to consider: the aesthetics. A tie-in floor stand that you know is going to work with the shape and design of your new television, removes any hassle over choosing visually compatible furniture or accessories.",
    "For sets that profess to showcase art, frame a picture, or function as a 'gallery', this is pretty important. A good thing, then, that LG and Samsung are on the same gloriously-illustrated page."
  ],
  "headers": {
    "5": "Front and center"
  },
  "links": {
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "8K screens": "https://www.techradar.com/news/lg-says-its-8k-is-better-than-yours-as-its-8k-oled-and-led-tvs-come-to-market",
    "propensity to burn-in": "https://www.techradar.com/news/television/quantum-dots-can-t-burn-in-so-what-is-samsung-s-new-warranty-all-about-1325990",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "Gallery Series OLED": "https://www.techradar.com/reviews/lg-gallery-gx-oled-tv",
    "new 83-inch or 42-inch OLED panel sizes": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them",
    "48-inch OLED": "https://www.techradar.com/best/48-inch-oled-tv",
    "Beovision Contour": "https://www.techradar.com/news/bang-and-olufsen-unveils-first-ever-48-inch-oled-tv-and-its-beautiful"
  }
}