{
  "source": "https://www.techradar.com/news/oculus-quest-can-now-display-iphone-notifications-in-vr",
  "title": "Oculus Quest can now display iPhone notifications in VR",
  "category": "gaming",
  "updated": "2021-05-18T09:47:41Z",
  "author": "gerald-lynch",
  "summary": "There is no escape from your inbox, even in VR...",
  "article": [
    "Oculus Quest 2 and Oculus Quest users users will soon receive a new experimental update to their VR headsets that will allow them to view their iPhone notifications from within the virtual reality device. There truly is no escape from your WhatsApp chats…",
    "Push notifications can be re-routed to the Oculus Quest headsets by heading to the settings menu, clicking ‘Notifications’ and then toggling ‘Phone Notifications in VR’ to on. You’ll also need to enable notifications in the Oculus iOS app, and the feature requires you to be using an iPhone 7 handset or newer.",
    "You’ll also get the option to set notifications on or off from individual apps if, say, you only want to get email alerts, and you can choose whether notifications appear in games or apps or only while in the Oculus home area. Pointing and clicking on notifications, which appear at the top of the display, will let you interact with them in more detail.",
    "If you’re an Android phone user, Oculus has also said it’ll be offering similar functionality in an upcoming release. So sit tight.",
    "There are a few other features included in this latest update of note, too. Multi-user support and app sharing is coming to the original Quest headset, following a successful run on the Quest 2. And you’ll now be able to use the headsets’ built in microphone to record your voice when streaming and recording clips – a strange omission in the first place.",
    "Credit where it’s due – Oculus is doing a fantastic job of keeping its headset topped up with new features, from 120Hz support to multi-user log-ins and more. While it’s still been a blow to some VR fans that the headset requires linking to a Facebook account, it’s hard to argue against the level of post-launch support both the Oculus Quest and Oculus Quest 2 VR headsets have received."
  ],
  "headers": {
    "4": "Super support"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review",
    "120Hz support": "https://www.techradar.com/news/oculus-quest-2-120hz-option-may-only-be-limited-to-a-few-games"
  }
}