{
  "source": "https://www.techradar.com/news/final-fantasy-xivs-ps5-open-beta-is-coming-soon",
  "title": "Final Fantasy XIV's PS5 open beta is coming soon",
  "category": "gaming",
  "updated": "2021-02-09T17:36:51Z",
  "author": "emma-boyle",
  "summary": "With a free upgrade for PS4 players",
  "article": [
    "Square Enix and PlayStation have announced that the PlayStation 5 version of Final Fantasy XIV, the ever-improving MMORPG, will go into open beta on April 13 2021.",
    "At the moment, Final Fantasy XIV is playable on PS5 thanks to the console’s backwards compatibility. However, in an official PlayStation blog post, Sony has confirmed when the new version launches it will take full advantage of the PS5’s power, introducing support for 4K resolution, “significantly improved frame rates” and faster loading times.",
    "When the PS5 version launches, those who already have the PS4 version of Final Fantasy XIV will be able to download the next-gen upgrade for free, while new PS5 players will be able to access a free trial which includes the base game and its first expansion, Heavensward.",
    "The full PS5 version will be available for purchase after the open beta ends, though there’s not an exact date for this just yet. You can watch the trailer for it below:",
    "The news of the open beta came alongside the announcement of Final Fantasy XIV Online’s next expansion: Endwalker.",
    "Scheduled to launch on PS4 and PS5 in Fall 2021, Endwalker will take players to new areas, introduce new jobs and finally feature “the climax of the long-running Hydaelyn and Zodiark story arc” which started in A Realm Reborn.",
    "The trailer for this new expansion is available to watch below:",
    "We can expect more Final Fantasy XIV related news from Final Fantasy XIV Digital Fan Festival 2021, the first digital fan festival being held from May 14 to May 15 2021."
  ],
  "headers": {
    "4": "Plus a brand new expansion"
  },
  "links": {
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "official PlayStation blog post": "https://blog.playstation.com/2021/02/05/endwalker-final-fantasy-xiv-onlines-next-expansion-is-coming-fall-2021-to-ps5-and-ps4/"
  }
}