{
  "source": "https://www.techradar.com/news/should-i-buy-85-inch-tv",
  "title": "Should I buy an 85-inch TV?",
  "category": "televisions",
  "updated": "2021-06-01T14:41:32Z",
  "author": "henry-st-leger",
  "summary": "Are the biggest TV sizes worth it?",
  "article": [
    "Should you buy an 85-inch TV? As today’s best smart TVs get ever larger, and sales of 65-inch TVs start to grow past those of 55-inch TVs, many of you may be wondering how big your new TV could actually go – and if it’s worthwhile opting for a truly massive display.",
    "85-inch TVs are still very much in the minority in today’s market, appearing for a number of flagship models like the Samsung QN900A, and at times only in specific regions like the US. But there is a slow market penetration happening, and it’s well worth paying attention to.",
    "In this guide we’ll run you through which 85-inch TVs are on the market, how much they cost, and just how big they actually are. Keep in mind, too, that OLED TVs may be available in 83-inch or 88-inch sizes, but that 85-inch TVs are limited to LCD and QLED screens.",
    "First off, we need to discuss the size of an 85-inch TV. That ‘85 inch’ figure refers to the diagonal length of the display, say from the bottom left corner to the upper right.",
    "The exact height, width and depth of an 85-inch TV will vary depending on the set in question. A TV with a Mini LED backlight will be a bit thicker than a super-slim OLED screen (which won’t need a backlight at all). If a TV has a built-in soundbar, that could add some visible height and weight, while other screens may opt for more discreet placement around the TV’s casing.",
    "As an example, the Samsung Q60T QLED comes in a massive 85-inch size, and measures 108.3cm tall, 189.6cm wide, and 6cm deep – which are the measurements to consider if you’re going to wall-mount the screen. When placed on the included TV stand, the Q60T’s height jumps to 118.6cm, and the depth pads out to 39.2cm.",
    "The 2021 flagship QN900A QLED, is almost identical in sizing, measuring 107.2cm tall and 187.6cm wide. It is decently slimmer at 1.54cm, but adding in a TV stand means the depth actually caps out at 34.4cm, making for a similar profile overall.",
    "The price of your 85-inch TV will depend on a lot of factors aside from the size, though in most cases an 85-inch model will be the largest and therefore most expensive iteration of a specific television.",
    "A budget LCD TV at an 85-inch size will still cost well over $1,000 / £1,000 / AU$1,500 – unsurprisingly, given it’s bigger than four 40-inch TVs taped together. That’s a lot of materials! But high-end LCD models can see that figure stretch past the $10,000 / £10,000 / AU$15,000 mark too.",
    "OLED TVs use distinct sizing options compared to QLED, and generally if you’re looking for something around a 85-inch size, you’ll need to opt for a 88-inch OLED TV, like the B&O Beovision Harmony, or the LG Z1 – both of which are 8K models. OLED panels tend to up the price, of course, and an LG Z Series 8K OLED at 88 inches is going to set you back $29,999 / £24,999 (around AU$38,700). That B&O model takes things even further with a £44,100 / $49,000 (around AU$81,700) launch price.",
    "You can see pricing information for some key Samsung and Sony TVs releasing in 2021 below too.",
    "Samsung puts out more 85-inch TVs than most, utilizing the size for all of its QLED and Neo QLED screens in the 2021 new Samsung TV range.",
    "Sony packs in fewer 85-inch TVs than Samsung, but you’ll still find the size on its flagship OLED and LCD screens – the Sony Z9J 8K TV and Sony X95J 4K TV.",
    "It’s worth keeping in mind that 85-inch TVs will, on the whole, be very heavy. That means TV stand solutions need to be able to take the weight. While stands supplied in tandem with the television (i.e. come in the same box) will likely be sufficient, third-party solutions may not be as reliable.",
    "That said, we found that this year’s Samsung QN90A featured quite a wobbly pedestal stand, even at a 65-inch size, and it’s worth being cautious here if you’re putting the TV in a place with a lot of thoroughfare (or children).",
    "A wall-mounted screen may be safest, and also stop the sizeable screen from jutting out into the space of your living room. Larger screens tend to look quite odd on poky little feet, too."
  ],
  "headers": {
    "3": "85-inch TV dimensions: how big are they?",
    "7": "85-inch TV prices: how much do they cost?",
    "11": "Samsung 85-inch TVs: what you can buy",
    "12": "Sony 85-inch TV: what you can buy",
    "13": "85-inch TV stand or wall-mount: which is best?"
  },
  "links": {
    "best smart TVs": "https://www.techradar.com/news/best-tv",
    "65-inch TVs": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "55-inch TVs": "https://www.techradar.com/best/55-inch-4k-tv",
    "Samsung QN900A": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Samsung Q60T QLED": "https://www.techradar.com/reviews/samsung-q60t-qled-tv",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "40-inch TVs": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them/news/best-40-inch-tv",
    "B&O Beovision Harmony,": "https://www.techradar.com/reviews/bang-and-olufsen-beovision-harmony",
    "LG Z1": "https://www.techradar.com/news/lgs-88-inch-8k-oled-tv-is-expensive-but-its-still-cheaper-than-the-zx-was",
    "8K OLED": "https://www.techradar.com/best/best-8k-tv",
    "QLED and Neo QLED": "https://www.techradar.com/news/qled-vs-neo-qled",
    "Sony X95J 4K TV": "https://www.techradar.com/news/sony-x95j-4k-tv-price-release-date-specs-sizes",
    "Samsung QN90A": "https://www.techradar.com/reviews/samsung-qn90a-neo-qled-tv"
  }
}