{
  "source": "https://www.techradar.com/news/microsoft-aims-thinly-veiled-jab-at-apple-says-macbooks-arent-a-patch-on-surface-pro",
  "title": "Microsoft aims thinly veiled jab at Apple – says MacBooks aren’t a patch on Surface Pro",
  "category": "computing",
  "updated": "2021-04-13T00:48:15Z",
  "author": "darren-allan",
  "summary": "Versatility of the Surface wins the day, according to Microsoft’s dubious advert",
  "article": [
    "Microsoft has made a short advert to promote its Surface Pro 2-in-1s in which it compares the hybrid to a ‘BackBook’, which is clearly a MacBook Pro, of course.",
    "This rather odd bit of promotional activity was highlighted by Microsoft India on Twitter, as you can see below, and has quickly gained in excess of 600,000 views.",
    "The advert consists of the Surface Pro shown being detached and used as a tablet, and then reattached to the keyboard, as well as showing off the kickstand, and overall the versatility of Microsoft’s device.",
    "The ‘BackBook’ is challenged to do this, too, and of course it can’t, which is the message here.",
    "Although it’s a rather confusing message, seeing as a traditional clamshell laptop is simply a different category of device compared to a 2-in-1. It’s plainly obvious that a hybrid machine is more flexible – that’s what they’re expressly designed to be.",
    "This isn’t the first time that Microsoft has made this kind of comparison in an advert. Back in January, another ad compared the Surface Pro 7 to the MacBook Pro directly this time (with no unsubtle name changes), concluding that the former was superior due to its touchscreen, ability to run ‘all your apps’ and again its hybrid nature as a detachable.",
    "Not only are these kind of comparisons not apples-to-apples, so to speak, but calling Apple’s machine the ‘BackBook’ as if the device is somehow at the back of the pack in terms of innovation (presumably, or at least that seems to be what’s hinted at) also seems pretty unfair. Certainly when you consider that MacBooks just made a huge step forward with the M1 processor in some models, which works some considerable magic as we’ve seen.",
    "Of course, the world of marketing doesn’t often turn out to be a fair place…",
    "Via Windows Central"
  ],
  "headers": {
    "5": "Mac attacks"
  },
  "links": {
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Surface Pro": "https://www.techradar.com/deals/surface-pro-deals-bundles",
    "Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "M1 processor": "https://www.techradar.com/news/apple-m1-chip",
    "as we’ve seen": "https://www.techradar.com/news/is-the-apple-m1-really-the-best-mobile-processor-we-put-it-to-the-test",
    "Windows Central": "https://www.windowscentral.com/microsoft-ad-attacks-backbook-thats-definitely-not-macbook"
  }
}