{
  "source": "https://www.techradar.com/news/apples-2021-lineup-gets-even-stronger-thanks-to-these-mac-mini-leaks",
  "title": "Apple's 2021 Mac mini could be seriously exciting if these rumors are true",
  "category": "computing",
  "updated": "2021-08-23T09:47:19Z",
  "author": "hamish-hector",
  "summary": "The M1X chip is taking over",
  "article": [
    "Yet another Apple device could be launching later this year, with new leaks hinting that an updated Mac mini could arrive in just a few months. This means it might be revealed alongside several new devices like the iPhone 13, the Apple Watch Series 7, new Airpods, and more in a near-complete 2021 refresh of Apple’s entire product range.",
    "In the latest Power On newsletter update, Bloomberg’s Mark Gurman suggests that the M1X Mac mini could launch “in the next few months”. Many have taken that to mean that Apple could have a massive announcement event planned for September (when we expect the iPhone 13 to be unveiled) or could have another conference penciled in for later in 2021.",
    "What’s more, the Mac mini leaks indicate that it might be a much more powerful device than previous models of the compact computer have been. That’s because it will run on Apple’s new and improved M1X chip, which is also rumored to be powering updates to the MacBook Pro line.",
    "Hopefully, this performance upgrade won’t come at too much of a cost though, as the Mac mini is typically a more budget-friendly device compared to Apple’s other devices. Right now we don’t know anything for sure, but the leaks have us wondering how good the rumored Mac mini could be?",
    "Those who bought the 2020 revision of the Mac mini last year may be disappointed to learn an even better version is expected so soon, but for those that can afford to upgrade (or are still stuck with the 2018 and older models) will the rumored 2021 device be worth the price of admission?",
    "Right now it’s tough to say as we know so little about it, but we can make some guesses based on the rumors circulating online. Leaks have indicated that the 2021 Mac mini will come with a few upgrades; most notably the M1X chip but also the addition of two new Thunderbolt ports (to give it four in total).",
    "The chip is rumored to have double the performance cores of the M1 (rising from four to eight), which should give it a substantial processing power boost over its predecessor. We’ve also heard that the integrated graphics might even be able to go toe-to-toe with the Nvidia GeForce RTX 3070 mobile graphics card found in high-end gaming laptops. We’ll have to try it out for ourselves, but that could mean Apple’s PCs could become a much better option for gamers.",
    "Regardless of how great the performance boost of the M1X really is over the M1, we’re fairly confident we’ll see the Mac mini get a price increase because of it. The 2020 Mac mini sold for $699 / £699 / AU$1,099 (for the model with 8GB of RAM and 256GB of storage); we imagine an upgraded version could cost a fair bit more, probably around the $900 / £900 mark. If this is the case, the Mac mini could quickly lose its status as the budget-friendly Apple PC.",
    "We’ll be sure to keep our eyes out for any more Mac mini 2021 rumors, and if it’s launched later this year, we’ll be sure to let you know what we think of it in our review. Until then be sure to keep checking back to keep up to date with the latest info."
  ],
  "headers": {
    "4": "Analysis: Could the M1X Mac mini be a substantial upgrade?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple Watch Series 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "new Airpods": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "M1X chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "MacBook Pro line": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "2020 revision of the Mac mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "rumored": "https://twitter.com/LeaksApplePro/status/1330417977662054400",
    "integrated graphics": "https://www.youtube.com/watch?v=OY2jMXKVhIw",
    "Nvidia GeForce RTX 3070 mobile graphics card": "https://www.techradar.com/news/the-new-nvidia-rtx-mobile-gpus-are-here-and-we-put-them-to-the-test"
  }
}