{
  "source": "https://www.techradar.com/news/iphone-13-vs-iphone-13-pro",
  "title": "iPhone 13 vs iPhone 13 Pro: Is this the year to go Pro?",
  "category": "phones",
  "updated": "2021-12-04T01:36:32Z",
  "author": "jon-mundy",
  "summary": "Which is the right iPhone for you?",
  "article": [
    "It's been two months since Apple dropped the iPhone 13 lineup, including the iPhone 13 and the iPhone 13 Pro. And deals have never looked better than they do for Black Friday, Cyber Monday, and this holiday shopping season. But which iPhone should you buy?",
    "The 13 and 13 Pro are both brilliant flagship smartphones, but how do the two compare, and which is the better buy? Has Apple learned from its mistakes of last year and properly differentiated its Pro model this time around?",
    "We scored the iPhone 13 a little higher than the iPhone 13 Pro, but that doesn’t mean it’s the better phone. This one’s going to take some unpacking.",
    "Both the iPhone 13 and the iPhone 13 Pro hit shops on September 24, 2021.",
    "Pricing for the iPhone 13 starts at $799 / £799 / AU$1,349 for the entry 128GB model, moving up to $899 / £879 / AU$1,519 for 256GB and $1099 / £1079 / AU$1,869 for 512GB.",
    "The iPhone 13 Pro’s 128GB model will set you back $999 / £949 / AU$1,699, while the 256GB model will cost $1,099 / £1,049 / AU$1,869, and the 512GB model will cost $1,299 / £1,249 / AU$2,219. But there are plenty of iPhone 13 deals to be had on both models.",
    "Unsurprisingly, then, the iPhone 13 Pro is the more expensive phone of the two by some way. But it gains its own advantage with the introduction of an additional 1TB model for $1,499 / £1,449 / AU$2,569.",
    "The iPhone 13 and the iPhone 13 Pro sport very similar designs to one another, as we’ve come to expect from Apple. What’s more, they’re barely changed from the iPhone 12 and iPhone 12 Pro before them, with the same striking flat-edged look.",
    "These two phones are identically proportioned at 146.7 x 71.5 x 7.65mm as well. The iPhone 13 Pro is a fair bit heavier at 204g, however, compared to the 174g iPhone 13.",
    "One reason for that is in the use of materials. The iPhone 13 Pro features a shiny stainless steel rim, while the iPhone 13 uses a lighter and less resilient aluminum chassis.",
    "The iPhone 13 comes in Pink, Blue, Midnight, Starlight, and Product Red, while the iPhone 13 Pro comes in Graphite, Gold, Silver, and Sierra Blue. They’re all a little muted, to tell the truth, though the iPhone 13 Pro’s Sierra Blue and the iPhone 13’s pink are the stand-outs in their respective ranges.",
    "Both phones increase the size of their camera modules over their iPhone 12-series equivalents, though the iPhone 12 Pro module is the bigger of the two. It’s a beast in every respect, as we’ll go on to discuss.",
    "Both phones feature Apple’s nano-crystalline Ceramic Shield screen technology around front, which makes them super tough. You also get an IP68 rating with both, which means that they can be immersed in six meters of water for up to 30 minutes.",
    "Both phones have reduced the size of their notches by 20%, though it’s not the most consequential design advance we’ve seen, to say the least.",
    "Both of these phones pack 6.1-inch Super Retina XDR OLED screens, with the same 1170 x 2532 resolutions. But unlike their immediate predecessors, there’s a much bigger difference between them this time around.",
    "The iPhone 13 Pro can get brighter to the tune of 1,000 nits compared to the iPhone 13’s 800 nits in typical conditions, and both can hit 1,200 nits when viewing HDR content.",
    "But that’s not the big difference we were talking about: That would be the introduction of a 120Hz ProMotion refresh rate with the iPhone 13 Pro, while the iPhone 13 is stuck with the same old 60Hz refresh rate.",
    "The difference is most noticeable when you’re scrolling through menus or system apps, and it can feel a little jarring to go back to the iPhone 13 from the iPhone 13 Pro as a result. But the vast majority of people won’t be making that backwards transition, and will find the iPhone 13 display perfectly fluid.",
    "Those smaller notches give you a little more screen real estate than before, but it’s not a game changer in either case.",
    "Overall, the iPhone 13 Pro’s faster response rate and higher brightness makes it comfortably the better panel than its non-Pro brother. But as to whether that warrant’s the accompanying price bump, you’ll probably have to try both phones side by side in an Apple Store and decide for yourself.",
    "Both of these phones make considerable improvements in the camera department. The iPhone 13 borrows some key components from last year’s iPhone 12 Pro Max for its dual 12MP system, while the iPhone 13 Pro’s triple 12MP system takes a further step forward from that point.",
    "The iPhone 13’s mains sensor can pull in 47% more light than before, and produces large 1.7µm pixels rather than the iPhone 12’s 1.4µm. But the iPhone 13 Pro’s wide sensor goes even larger, producing 1.9µm pixels rather than the iPhone 12 Pro’s 1.4µm.",
    "Both camera systems pack in the sensor shift stabilization system that made last year’s iPhone 12 Pro Max so special in low lighting conditions. Night mode is a thing to behold with both phones, though again the iPhone 13 Pro is the prince of darkness here.",
    "Both ultra-wide sensors are improved, but the iPhone 13 Pro also has the benefit of a 12MP 3X telephoto lens for zoomed-in shots. That’s a big advantage over the iPhone 13, which has to crop in on the main sensor for such close-ups.",
    "Of course, any new iPhone camera is the beneficiary of Apple’s software advances as much as any hardware improvements. As such, both phones get the new Photographic Styles feature, which enables you to fundamentally change the tone of your snaps, whether you prefer them to be warmer, cooler, more vibrant, or more contrasty.",
    "Both phones also get the new rack focusing ‘Cinematic mode’, which essentially applies a similar effect to your videos as Portrait mode does to stills. It enables you to change the focus in a scene, even in post-productions, and it will anticipate when a subject is going to enter the frame and even follow a subject’s gaze.",
    "The feature worked well in our testing, and is likely to be of most use to budding vloggers and film makers, even if it’s not quite the pro tool Apple seems to be positioning it as.",
    "While we’re talking about video, one feature that’s unique to the iPhone 13 Pro - or will be once it rolls out - is ProRes. This is a professional video codec that packs in more detail for greater editing possibilities. We’ll have to update this piece once we’ve had a chance to test it, but one thing to note is that it’ll be limited to 1080p on the 128GB iPhone 13 Pro.",
    "Apple doesn’t traditionally differentiate much when it comes to performance, with its pro models tending to get the exact same A-series chip as the non-Pro series. That’s kind of true again this year, but with one interesting exception.",
    "Both phones get the 5nm A15 Bionic processor, which packs a six-core CPU that’s 50% faster than the leading Android competition. But the iPhone 13 Pro gets an extra GPU core (5 vs 4), making it the faster performer overall.",
    "In practical terms, we challenge you to tell the difference. Both phones are so fast as to render comparisons an academic exercise, and there are certainly no games on the App Store that get anywhere close to hitting the performance limits of either.",
    "But the iPhone 13 Pro undoubtedly has more headroom this year compared to previous iterations. It’s likely to stay feeling fast for a little longer, especially when it comes to more intensive tasks.",
    "In our Geekbench 5 multi-core tests, the iPhone 13 scored 4688 to the iPhone 13 Pro’s 4718. That’s a slight edge for the Pro, but the main point to take from this is that no other phone gets close to either on raw performance.",
    "Both phones support more 5G bands than before, so more countries will be able to use them to access 5G networks. Only the US models get mmWave support, however, and relatively few Americans will be able to take advantage of those speeds anyway.",
    "As we’ve mentioned already, both phones give you 128GB, 256GB, or 512GB of storage. But the iPhone 13 Pro goes one better in offering a 1TB option.",
    "The one major improvement that applies equally to both of these phones is battery life.",
    "Both cells are bigger than their immediate predecessors. Alongside the A15 Bionic’s efficiency improvements, this means that both last a fair bit longer than before.",
    "In the iPhone 13’s case you get a 3240mAh cell, while the iPhone 13 Pro gives you a 3095mAh battery. You might think that this sounds a little counter-intuitive, giving the Pro handset the smaller battery. But while it sounds like the Pro’s 120Hz display should be a more power-hungry component, that’s not necessarily the case.",
    "Apple has implemented smart variable refresh rate technology so that the iPhone 13 Pro’s display can scale right down to 10Hz when the use case dictates. It only goes full 120Hz in scenarios that warrant it, such as scrolling through home screens, menus, or web pages.",
    "The upshot of this is excellent battery life for both phones. Apple claims you’ll get 2.5 hours more out of the iPhone 13 on a single charge compared to the iPhone 12, while the iPhone 13 Pro will apparently get 1.5 hours more compared to the iPhone 12 Pro.",
    "In practice, both phones tended to leave us with around 20% left in the tank after a full day of usage. If anything, the iPhone 13 lasts a little longer though, as we were able to push it that little big further with the screen-on time.",
    "MagSafe returns for another year offering magnetised wireless charging at 15W. You’ll have to buy this separately though, as you will for the regular 20W wired charger that both phones support.",
    "30 minutes with one of these chargers will get both phones to just over half full. Not class-leading, but not bad either.",
    "Neither the iPhone 13 nor the iPhone 13 Pro are game changers. They have similar designs to last year’s models, and none of the new features they supply are massively transformative.",
    "Both phones bring better battery life, better processors and upgraded camera setups to the table.",
    "We scored the iPhone 13 a little higher than the iPhone 13 Pro simply because it offers much of the same experience for significantly cheaper. But unlike last year’s phones, the Pro does actually bring something new and worthwhile to the table in the shape of its 120Hz display.",
    "If you’re the kind of tech-savvy user who will actively notice and appreciate that smoother display, or you simply want the best smartphone camera that money can buy, then the Pro should be top of your list.",
    "Everyone else should probably just get the iPhone 13. It’s not cheap, but it’s still a lot of phone for the money.",
    "You might also want to check out the iPhone 12 Pro vs iPhone 11 Pro or iPhone 12 Pro vs iPhone 12 Pro Max comparison."
  ],
  "headers": {
    "3": "iPhone 13 vs iPhone 13 Pro: price and availability",
    "7": "iPhone 13 vs iPhone 13 Pro: design",
    "14": "iPhone 13 vs iPhone 13 Pro: display",
    "20": "iPhone 13 vs iPhone 13 Pro: cameras",
    "28": "iPhone 13 vs iPhone 12: specs and performance",
    "35": "iPhone 13 vs iPhone 13 Pro: battery",
    "43": "Takeaway"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "flagship smartphones": "https://www.techradar.com/news/best-phone",
    "iPhone 13 deals": "https://www.techradar.com/deals/apple-iphone-13-deals",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Cinematic mode": "https://www.techradar.com/news/what-is-cinematic-mode-the-iphone-13s-new-video-focusing-trick-explained",
    "ProRes": "https://www.techradar.com/news/what-is-apple-prores",
    "MagSafe": "https://www.techradar.com/best/best-magsafe-accessories",
    "iPhone 12 Pro vs iPhone 11 Pro": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-11-pro",
    "iPhone 12 Pro vs iPhone 12 Pro Max": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-12-pro-max"
  }
}