{
  "source": "https://www.techradar.com/news/vodafone-sees-profits-rise-despite-covid-revenue-hit",
  "title": "Vodafone sees profits rise despite Covid revenue hit",
  "category": "phones",
  "updated": "2021-05-18T09:41:04Z",
  "author": "steve-mccaskill",
  "summary": "Vodafone made a profit last year despite pandemic challenges",
  "article": [
    "Vodafone managed to record a profit last year despite ongoing challenges caused by the Coronavirus across its key European markets.",
    "Lockdown restrictions and reduced international travel hit purchases of new smartphones and roaming income and contributed to a 2.6% fall in Group revenues to €43.8 billion.",
    "However, Vodafone said it was pleased with stable service revenues and the contribution of the German and Central European businesses acquired from Liberty Global. The operator’s digital and efficiency efforts also saved €500 million across the business.",
    "The company now has 65.4 million mobile customers and 25.6 million broadband customers across the continent, while deepening engagement reduced churn, increases ARPU (Average Revenue Per User), and saw average data consumption increase from 5.7GB to 7.2GB.",
    "Meanwhile, the €2.3bn proceeds generated from the flotation of the were used to reduce debt.",
    "The €536 million profit compares favourably with the €455 million loss it reported last year (largely driven by a write down at Vodafone’s Indian joint-venture), and the firm is happy with what it considers to be a “resilient performance” given the wider economic climate.",
    "Group CEO Nick Read said its focus was on delivering the next phase of its strategy to become a next-generation connectivity and digital services provider across Europe and Africa with a medium-term ambition to drive returns through growth acceleration.",
    "“We have delivered on the first phase of our strategy to reshape Vodafone as a stronger connectivity provider – including the simplification of the group to Europe and Africa, the successful IPO of Vantage Towers, the fast roll out of our next generation mobile and fixed networks, share gain in broadband subscriptions and continued reduction in customer churn,” he said.",
    "“Our digital transformation initiatives have generated savings of €0.5 billion over the year and the integration of the assets acquired from Liberty Global is well ahead of plan. The world has changed. The pandemic has shown how critical connectivity and digital services are to society. Vodafone is strongly positioned and through increased investment, we are taking action now to ensure we play a leadership role and capture the opportunities that these changes create.",
    "“The increased demand for our services supports our ambition to grow revenues and cash flow over the medium-term. We remain fully focused on driving shareholder returns through deleveraging, improving our return on capital, and a firm commitment to our dividend.”",
    "In the UK, revenues fell by 5.1% to €6.2 billion due to the same factors affecting other markets. However, churn fell from 14.1% to 13%, and the company added 219,000 mobile contract subscribers and secured 192,000 net additions to its broadband service, aiding a 5.6% rise in revenue."
  ],
  "headers": {
    "3": "Vodafone revenues"
  },
  "links": {}
}