{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-plus-vs-iphone-12-pro",
  "title": "Samsung Galaxy S21 Plus vs iPhone 12 Pro: second in command flagship phones",
  "category": "phones",
  "updated": "2021-03-14T08:00:57Z",
  "author": "jon-mundy",
  "summary": "iPhone vs Android",
  "article": [
    "The Samsung Galaxy S21 Plus and the iPhone 12 Pro both sit right near the top of their respective ranges, just a notch below the pinnacle.",
    "If you’re looking to spend around $1,000 / £1,000 on a new smartphone, they probably represent the best and certainly the most popular options available to you in early 2021.",
    "While these two classy handsets are similarly priced, however, there are a number of key differences between them. Let’s take a look and see which phone is best for you.",
    "The Samsung Galaxy S21 Plus landed on January 29, 2021 in most regions. Prices start at $999 / £949 / AU$1,549 for the 128GB model. There’s also a 256GB iteration, which will cost you $1,049 / £999 / AU$1,649.",
    "The iPhone 12 Pro was released on October 23, 2020, with prices from $999 / £999 / AU$1,699 for the 128GB model. If you want to double your storage to 256GB, you’ll need to come up $1,099 / £1,099 / AU$1,899, while the top-of-the-range 512GB model costs $1,299 / £1,299 / AU$2,219.",
    "We’re looking at a tie for value here, with a slight edge given to the Galaxy S21 Pro for 256GB. Also, in our experience you’re more likely to find a hefty discount on Samsung’s phones than on Apple’s as time ticks along.",
    "Both phones represent design overhauls for their respective ranges, though they’ve taken refreshingly different approaches.",
    "The Galaxy S21 Plus is arguably less radical a change, though it’s no less impressive. We found the phone to be really quite striking in purple and rose gold tones, though you can also get it in black, white, gray, pink and red.",
    "Whichever color you opt for, your eye will be drawn to the distinctive new camera module Samsung has implemented. The way it swoops and flows into the chassis of the phone is something to behold, and certainly more interesting than the iPhone 12 Pro’s run of the mill ‘squared circle’ approach.",
    "Unlike the regular S21, the back of the phone is clad in glass. Together with a matte finish it has a sophisticated yet sober look and feel. At 161.5 x 75.6 x 7.8 mm and 200g, it’s quite a hefty beast, certainly compared to the 146.7 x 71.5 x 7.4 mm and 189g iPhone 12 Pro.",
    "That’s partly because the display on the Galaxy S21 Plus is significantly larger than the iPhone 12 Pro’s. It’s similarly flat though, which represents a change in Samsung’s approach. We prefer the practicality of a flatter display - there are fewer false presses and a cleaner picture - but it does take one prominent point of interest away from the phone.",
    "The iPhone 12 Pro arguably represents an even bigger shift in design, albeit one that owes a fair deal to a bygone era. Its sharp edges, dead-flat surfaces, and rounded corners hark back to the iPhone 4 and iPhone 5 before it. But it’s a massive departure from the rounded, slightly bland designs of the post-iPhone 6 years.",
    "You can pick up the iPhone 12 Pro in just four colors: Silver, Graphite, Gold, and Pacific Blue. Not as diverse or eye-catching as Samsung’s offering, perhaps, but we’re suckers for that deep Pacific Blue.",
    "These two phones take a very different approach to housing their front-mounted cameras. Apple’s intrusive notch is well known by now, taking a massive bite out of the top of the screen as it does. Samsung takes a mere nibble by comparison, with a perfectly round hole-punch notch in the centre of the screen.",
    "Apple’s phone is fronted by a ‘nano-crystalline’ Ceramic Shield, which supposedly provides four times the drop protection over regular display glass. It might just stand up to face-plants and scratches better than the Galaxy S21 Plus, though we’re still far too careful/scared to put that to the test.",
    "Interestingly, while both phones boast an IP68 dust/water resistance rating, the iPhone 12 Pro has been tested to a water depth of 6 metres next to the Samsung’s 1.5 metres.",
    "All in all, much of this particular part of the face-off comes to down to personal preference. While we probably prefer the look of the iPhone 12 Pro, its sharp angles make it less pleasant to hold.",
    "Both of these phones have beautiful AMOLED displays, capable of outputting rich yet accurate colors and deep blacks. However, the Samsung Galaxy S21 Plus has the edge in a couple of ways.",
    "For one thing, the Galaxy S21 Plus display is much bigger at 6.7-inches compared to the iPhone 12 Pro’s 6.1-inches. In this way, the Samsung is more like the iPhone 12 Pro Max, while the iPhone 12 Pro is closer to the regular Samsung Galaxy S21.",
    "More importantly, the Samsung Galaxy S21 Plus display is significantly smoother than its Apple counterpart. At 120Hz, content scrolls past up to twice as fluidly as on the 60Hz iPhone 12 Pro. This is arguably the most glaring omission from Apple’s current champ, and will be the first thing we look for on the iPhone 13 Pro spec list.",
    "In terms of sharpness, the iPhone 12 Pro wins back some of the initiative. Its 2532 x 1170 display packs in more pixels than the 2400 x 1080 Samsung, and in a smaller space too. The result is a pixel density of 460ppi for the iPhone 12 Pro and 394ppi for the Galaxy S21 Plus.",
    "You could argue that this is the most glaring omission for Samsung’s phone, as the Galaxy S20 Plus gave the option of a QHD+ resolution - albeit only at 60Hz. But as we generally recommend that you opt for Hertz over pixels in phones, it’s not really a biggie.",
    "The Samsung Galaxy S21 Plus can get slight brighter than its counterpart, with a 1300 nits peak brightness compared to 1200 nits in the iPhone. Both get plenty bright enough in general usage, though.",
    "While the Samsung Galaxy S21 Plus opts for an in-display fingerprint sensor for unlocking your phone and mobile payments, Touch ID is nowhere to be seen on the iPhone 12 Plus. Instead, Apple uses that prominent notch to house Face ID, which scans your face.",
    "This has become a lot less convenient now that we’re all wearing masks whilst out and about. But that’s (hopefully) a temporary snag, and Samsung’s ultrasonic fingerprint technology continues to feel a little laggy and unreliable, despite being 70% larger than before.",
    "Both phones have advanced triple camera set-ups capable of capturing brilliant pictures in a variety of lighting conditions. But we give Apple the edge this round.",
    "The camera setup on the Samsung Galaxy S21 Plus seems awfully similar to last year’s S20 Plus. Identical, in fact. You get 12MP main and 12MP ultra-wide cameras, accompanied by a 64MP telephoto snapper with a 3x hybrid zoom facility. It’s possible to extend that up to 30x digital zoom, but we wouldn’t recommend straying beyond 10x. Still, being able to get usable 10x snaps is impressive enough.",
    "Apple’s iPhone 12 Pro gives you a trio of 12-megapixel sensors covering the usual wide, ultrawide, and 2X telephoto angles. It also adds a LiDAR sensor to improve low light autofocus, as well as potentially bolstering AR applications.",
    "In terms of shot quality, the iPhone 12 Pro wins in most scenarios. Apple’s color science seems more natural, while smarter computational photography features like Smart HDR 3 and Deep Fusion generally gives you preferable results with better dynamic range.",
    "The new ProRAW feature combines the data-packed RAW format with JPEG’s ability to auto-adjust. Meanwhile Apple’s Night Mode is quite a bit better than Samsung’s equivalent, resulting in flat out superior low light shots, and is more seamlessly integrated to boot.",
    "We’d take Samsung’s excellent hybrid zoom system for those extreme 10x telephoto moments, however.",
    "Both phones take clean video, but again the iPhone 12 Pro is the winner. While the Samsung Galaxy S21 Plus can take 8K footage at 24 frames per second (the iPhone only goes up to 4K), it does so with an annoying amount of cropping.",
    "The quality of the iPhone’s 4K footage is superior, and it now comes with Dolby Vision enhancements at 60fps. It’s genuinely impressive stuff.",
    "In terms of those selfie cameras, the Samsung packs a 10MP while the iPhone features a 12MP. Both have their own compelling features.",
    "The iPhone 12 Pro can take Night Mode shots with its selfie cam, for example. On the other hand, the Galaxy S21 Plus sports Director’s View, which enables you to take pictures with the front and rear cameras at the same time. Edit them together, and you have yourself a one-device multi-camera vlogging setup.",
    "Single Take enables you to capture a variety of photos and video using all three cameras at the same time with a single shutter press, and it now comes with slow-mo.",
    "We can’t imagine that you’ll face any performance issues with either of these two phones. They’re both extremely fast, and no modern app, game, or task will force either handset to break a sweat.",
    "It would be inaccurate to call the Samsung Galaxy S21 Plus and the iPhone 12 Pro equal on performance, however. Apple’s phone is the more capable by a considerable margin.",
    "The Samsung Galaxy S21 Plus comes with a Qualcomm Snapdragon 888 in the US and China, and a Samsung Exynos 2100 everywhere else. We’ve covered this a lot over the years, but Samsung’s split hardware strategy really does feel like a poke in the eye for the majority on the Exynos side.",
    "That said, the gap between these two chip strands has narrowed compared to previous years. Early tests suggest a negligible difference between the Snapdragon 888 and the Exynos 2100 in processing power, but a larger gap in favor of the Qualcomm chip when it comes to the GPU and energy efficiency.",
    "Regardless of which chip your Galaxy S21 Plus comes packing, it’s going to lose out to the iPhone 12 Pro. Apple’s A14 Bionic chip beats the opposition quite convincingly across a whole range of CPU and GPU benchmarks. And this despite the fact that the iPhone 12 Pro comes with 6GB of RAM next to the Galaxy S21 Plus’s 8GB.",
    "In terms of storage, both phones offer 128GB and 256GB of storage, but only the iPhone 12 Pro also offers a 512GB model. You’ll have to pay quite a bit for it, though.",
    "Both phones also offer 5G connectivity as standard, should you be in a position to capitalize on it.",
    "The Samsung Galaxy S21 Plus has a sizeable 4,800 mAh battery. We were impressed by how much use we could get out of this phone from a full charge.",
    "With light to moderate use we could occasionally get through a full 48 hours. With more intensive use, you’ll still be able to get through a long day quite comfortably.",
    "By contrast the iPhone 12 Pro has a tiny 2,815mAh battery. It’s a step back from the previous iPhone model, with an accompanying drop to one hour less of video playback.",
    "However, in practical terms, our experience of using the iPhone 12 Pro wasn’t so dissimilar to the Samsung Galaxy S21 Plus. A day of light usage resulted in going to bed at midnight with more than 50-percent in the tank, stretching to a full 48 hours before we needed to recharge.",
    "The important factor here is usage. With the iPhone we hardly did any web browsing or gaming during that 48 hours. It’s a phone that loves to be on standby, where it will sip the juice more efficiently than its Android competitors.",
    "Stepping away from the safety of our home broadband, into the wild world of mixed 4G and 5G usage, and using the phone for intensive web browsing and playing games, that battery figure dropped way quicker. Expect to lose between 10–15% per hour.",
    "If we were to some it up in pithier fashion, the iPhone 12 Pro’s battery life is acceptable, while the Samsung Galaxy S21 Plus’s battery life is decent.",
    "Neither phone wows when it comes time to recharge. Samsung dropped support for 45W chargers from last year’s models, and the Galaxy S21 Plus can only hit 25W. Samsung does claim that it’s improved that 25W charging, but it still trails rival efforts from the likes of Oppo and OnePlus.",
    "Apple isn’t any better, with support for up to 20W fast charging. Both phones support 15W wireless charging, but only the Samsung Galaxy S21 Plus can also charge your AirPods. Which is somewhat ironic.",
    "Neither phone comes with a charger in the box, by the way. That’s 2021 for you.",
    "We can’t knock the experience of using either of these premium phones. Both offer slightly more affordable alternatives to the very best that Apple and Samsung has to offer, which should prove plenty enough for 99% of people.",
    "In terms of direct comparisons, it’s hard to pick a winner. For one thing, we scored these two phones an identical 4 out of 5 in our reviews, reflecting their shared status near the top of the pile.",
    "For another thing, they’re surprisingly different when you get past their shared price tag. The Samsung Galaxy S21 Plus has a bigger and more fluid display, which makes it better for heavy web surfing sessions and general media playback. Conversely, the iPhone 12 Pro Max has the better camera system and more performance on tap.",
    "Ultimately the choice could well come down to your own preferences in terms of aesthetics, as well as which side of the iOS/Android ecosystem divide you fall on. Either way, rest assured you’re going to be getting a beautiful, capable, and future-proof flagship phone."
  ],
  "headers": {
    "3": "Samsung S21 Plus vs iPhone 12 Pro price and availability",
    "6": "Design",
    "17": "Display",
    "25": "Camera",
    "36": "Specs and performance",
    "43": "Battery life",
    "53": "Takeaway"
  },
  "links": {
    "Samsung Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "LiDAR sensor": "https://www.techradar.com/news/what-is-a-lidar-scanner-the-iphone-12-pros-rumored-camera-upgrade-anyway",
    "ProRAW": "https://www.techradar.com/news/what-is-apple-proraw-the-new-photo-format-coming-to-iphone-12-pro-explained",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}