{
  "source": "https://www.techradar.com/news/the-most-gruesome-fatalities-in-mortal-kombat-history",
  "title": "The most gruesome fatalities in Mortal Kombat history",
  "category": "gaming",
  "updated": "2021-04-24T13:30:16Z",
  "author": "laura-francis",
  "summary": "These fatalities make for grisly flawless victories",
  "article": [
    "What's the first thing that springs to mind whenever you think of Mortal Kombat? Perhaps it's certain iconic characters like Scorpion, Sub-Zero or Johnny Cage. Maybe it's the fascinating lore, or even the hit-and-miss movie adaptations thus far. Or that theme tune. 'MORTAL KOMBAT!",
    "But throughout the almost three-decade history of this iconic video game franchise, those brutal finishing moves known as fatalities – which allow you to finish off your opponent in the most over-the-top, comedic, outlandishly violent ways possible – have always been the most defining and recognisable aspect by far.",
    "Fatalities have always been what sets Mortal Kombat apart from other fighting games. However, they have attracted a fair share of controversy from parents and politicians alike due to their graphic violence. It was even partly responsible for the introduction of the US's ESRB rating system.",
    "One of the most lamentable things about the 1995 Mortal Kombat movie was, despite how enjoyable and entertaining the movie is, the extremely safe approach to the series' overt violence, and the signature gory fatalities weren’t present.",
    "With the Mortal Kombat reboot movie now released, it is reassuring to know that there will be no holding back when it comes to the fatalities and they will be in their most brutal, bloodiest form – just as we like them.",
    "Fatalities have come in all shapes and forms and have had a history of their own. Most common are the traditional fatalities – where you defeat your opponent, and you must finish them off by performing a strict set of button presses to trigger them.",
    "There was also the presence of stage fatalities, in which you can use the arena as a death-trap to kill your opponent, such as spikes in the ground, an acid pit and even some very monstrous trees with an appetite for human flesh. There have even been friendships, brutalities, animalities and babalities. Yep, you can turn your opponents into babies, end the fight on a friendly note or even transform into an animal, although that set of finishers hasn’t been seen in a long time.",
    "As the years have gone by, the fatalities have always been kicked up a notch and have become more and more elaborate and unbelievably cinematic.",
    "Here are some of the most gruesome fatalities in the Mortal Kombat franchise, focussing down on the more recent (and as a result, more viscerally, mind-blowingly gory) Mortal Kombat X and Mortal Kombat 11. Trust us when we say there were so many to choose from.",
    "Undoubtedly one of the most standout, stomach-turning fatalities in MKX must go to this iconic Ermac finisher, in which the opponent is lifted into the air, with most of their internal organs pulled out via his telekinetic abilities and then dropped on the floor.",
    "Of all the fatalities in the most recent Mortal Kombat video game entry, this one is arguably the most bizarre and outlandish. It is most definitely one of those where it just needs to be seen to be believed. Watch at your own peril!",
    "Ever since the daughter of Sonya Blade and Johnny Cage first made her debut in MKX, along with a fresh wave of combatants, her fatalities have been nothing short of humorous. The choice for a Cassie fatality was between this and the infamous Selfie finisher. Both are just as comedically nasty, but I <3 U just about has the edge. She gives her opponent a literal broken heart and an air kiss thrown in for good measure.",
    "When first-look gameplay footage was revealed a couple of years ago for the latest entry in the franchise, it was obvious that there would be absolutely no holding back as we were treated to a glorious slice of having someone’s face literally ripped off and then their brains being eaten out, courtesy of series stalwart Baraka.",
    "Giving into her cannibalistic tendencies, the grotesque Kitana clone tucks into a weird-looking slice of a head kebab as she takes a good munch of her deceased opponent’s decapitated head before nonchalantly dropping it on the floor. Talk about a tasty treat!",
    "Takeda was a new character introduced in the tenth entry in the Mortal Kombat franchise and the son of fan-favourite character Kenshi, who was introduced in Mortal Kombat: Deadly Alliance. He easily had some of coolest weapons to ever be seen, metal whips and kunai, and uses them to impale the opponent through the mouth, hooking it to the spine before gruesomely dragging it out.",
    "Another extremely bizarre fatality comes from none other than Special Forces operative Jackson Briggs in Mortal Kombat X. In a feat of pure comedy and absurdity, Jax shoves both of his opponent’s arms into their body, you know, like a T-Rex. He then proceeds to rip their head apart and stubs out a cigar on their tongue."
  ],
  "headers": {
    "3": "Gore! Glorious gore",
    "9": "Mortal Kombat X - Ermac: Inner Workings",
    "10": "Mortal Kombat 11 - D'vorah: New Species",
    "11": "Mortal Kombat 11 - Cassie Cage: I <3 U!",
    "12": "Mortal Kombat 11 - Baraka: Food for Thought",
    "13": "Mortal Kombat X - Mileena: Face Feast",
    "14": "Mortal Kombat X - Takeda: Whip It Good",
    "15": "Mortal Kombat X - Jax: T-Wrecks"
  },
  "links": {
    "that theme tune. 'MORTAL KOMBAT!": "https://www.youtube.com/watch?v=EAwWPadFsOA&ab_channel=LuminousAmbition",
    "Mortal Kombat reboot movie": "https://www.techradar.com/news/how-to-watch-mortal-kombat-online-see-where-to-stream-new-movie",
    "friendships": "https://www.youtube.com/watch?v=HCMZf80HWxA&ab_channel=MKIceAndFire",
    "brutalities": "https://www.youtube.com/watch?v=Q6bNt9Bj3rg&ab_channel=SilentStorm",
    "animalities": "https://www.youtube.com/watch?v=YLsNSSaOWjE&ab_channel=AnonymousAffection",
    "babalities": "https://www.youtube.com/watch?v=iWYpRubkZ-I&ab_channel=RajmanGamingHD"
  }
}