{
  "source": "https://www.techradar.com/news/netflix-drops-first-trailer-for-tell-all-britney-spears-documentary",
  "title": "Netflix drops first trailer for tell-all Britney Spears documentary",
  "category": "entertainment",
  "updated": "2021-09-23T09:55:49Z",
  "author": "axel-metz",
  "summary": "“I just want my life back”",
  "article": [
    "A tell-all documentary on Britney Spears’ struggle against her oppressive conservatorship agreement is heading to Netflix – and we’ve got our first trailer.",
    "Britney vs Spears will chart the ongoing legal case to see the pop star freed from the court-ordered agreement that gave her father, Jamie, control over her estate and other aspects of her life back in 2008.",
    "Under the conservatorship – signed in light of her deteriorating mental health throughout the noughties – Spears is still unable to completely control her finances, with reports claiming the agreement also restricted many personal elements of her life, ranging from who she dated to the design of her home.",
    "You can check out the trailer below.",
    "The documentary, directed by Erin Lee Carr, will debut on the streaming service on September 28 – just one day before the 39-year-old heads to court for the most important hearing on the case yet.",
    "\"I just want my life back,\" Spears says in the trailer, adding that she “[doesn’t] owe these people anything,\" in reference to those, including her father, committed to maintaining the agreement.",
    "The star’s conservatorship has drawn controversy ever since being signed in 2008, but it wasn’t until a 2021 episode of The New York Times Presents on the subject that many fans – and human rights groups – increased their public condemnation of both the agreement itself and, in particular, Spears’ father.",
    "#FreeBritney has been a trending Twitter term throughout the year, while protesters – some of whom can be seen in the trailer – regularly speak out against the conservatorship.",
    "It’s no wonder that Netflix has decided to commission a documentary on the controversial subject given the success of its previous exposé features.",
    "The likes of Operation Varsity Blues, Fyre: The Greatest Party That Never Happened, and Icarus count among the best Netflix documentaries available to watch right now – the latter even bagged an Oscar – so it figures that the streamer is betting on Spears’ viral controversy as its next hit.",
    "But Britney vs Spears could prove beneficial to the titular star herself, too. Often, the increased public awareness of a subject brought about by in-depth documentary coverage can accelerate real-life action.",
    "In the aforementioned Fyre Festival documentary, for instance, it was revealed that the festival organizers never paid a Bahamian restaurant owner for her services during the failed event. In response, donors raised more than $177,000 to allow her to recoup her losses – a campaign that was unlikely to gain traction if Netflix’s documentary hadn't drawn attention to the injustice.",
    "The same sentiment is true of nature documentaries. It’s not hard to understand why the likes of Seaspiracy, Our Planet, and Virunga have all encouraged greater environmental awareness among their viewers.",
    "Britney vs Spears won’t automatically resolve Spears’ legal battle, but it will go some way to raising the profile of her struggle even further – which is the purpose of a documentary, after all."
  ],
  "headers": {
    "8": "Analysis: the Netflix exposé formula"
  },
  "links": {
    "best Netflix documentaries": "https://www.techradar.com/best/best-netflix-documentaries"
  }
}