{
  "source": "https://www.techradar.com/news/ps-plus-november-games-lineup-could-include-a-bonus-psvr-game",
  "title": "PS Plus November games lineup could include a bonus PSVR game",
  "category": "gaming",
  "updated": "2021-10-27T11:45:43Z",
  "author": "rhys-wood",
  "summary": "November could be stacked for PS Plus",
  "article": [
    "The PS Plus November 2021 lineup of games looks to have been leaked ahead of time, thanks to a Dealabs leaker by the name of Billbil-kun. The leaks suggest that four games are coming to the PlayStation Plus service in November, but there might be a few extra PSVR titles thrown in to celebrate the VR headset's fifth anniversary.",
    "As reported by VGC, November's PlayStation Plus roster of PS5 and PS4 games could include Knockout City, Kingdoms of Amalur: Re-Reckoning and First Class Trouble alongside PSVR title The Walking Dead: Saints and Sinners.",
    "Additionally, a PlayStation blog post from earlier in October announced that three PSVR titles were coming to PS Plus in November, so if the above leaks turn out to be true, then next month could be a bumper one for PlayStation Plus subscribers. These PSVR games haven't been announced yet, but Sony could do so at the upcoming State of Play happening on October 27.",
    "In case you seriously doubt the leaks, user Billbil-kun has proven to be a reliable source in the past. They were able to correctly leak October 2021's PS Plus games lineup, which included Hell Let Loose and Mortal Kombat X among others.",
    "As it's close to the end of the month, we'll know soon enough if Billbil-kun's claims are accurate. The leaker also states that certain territories (mainly Asia) will have Kingdoms of Amalur: Re-Reckoning replaced with indie hit The Sexy Brutale.",
    "The PS Plus November 2021 leaks aside, we at least have official confirmation from Sony that three PSVR titles are coming to PlayStation Plus next month. The official blog post making the announcement highlighted the five most played PSVR games in each major region, with a few big-name titles correlating across all of them.",
    "Those include Beat Saber, Rec Room and The Elder Scrolls 5: Skyrim VR. These three games featured in the top five most played VR games globally alongside PlayStation VR Worlds and Resident Evil 7. They're certainly among the best PSVR games you can play, and would be welcome additions to the PS Plus repertoire.",
    "While we think Beat Saber and Rec Room are top contenders for PS Plus's November 2021 lineup, we're not so sure about Skyrim VR. Given that Bethesda is now part of Microsoft Game Studios, the company might now be limited in what games it can host on Sony's subscription service. And with Skyrim Anniversary Edition launching on November 11 to celebrate the game's tenth (tenth!) anniversary, Bethesda might not want to cross wires with its older VR counterpart.",
    "Whatever the free PSVR games turn out to be, they'll hopefully tide fans of the headset over until we receive more details on the PSVR 2. Sony's succeeding VR headset will be compatible with PS5, and is tentatively due to launch over the Holiday 2022 period."
  ],
  "headers": {
    "5": "Analysis: What are PS Plus's mystery VR games?"
  },
  "links": {
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "Dealabs": "https://www.dealabs.com/bons-plans/ps-the-walking-dead-saints-sinners-kingdoms-of-amalur-re-reckoning-et-4-autres-jeux-offerts-sur-ps5ps4-dematerialises-2226670",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "VGC": "https://www.videogameschronicle.com/news/novembers-playstation-plus-games-have-been-revealed-early/",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "PlayStation blog post": "https://blog.playstation.com/2021/10/13/celebrating-five-years-of-playstation-vr/#sf250310085",
    "PSVR games": "https://www.techradar.com/best/best-playstation-vr-games",
    "State of Play": "https://www.techradar.com/news/sony-state-of-play-october-2021-10-game-trailers-you-have-to-watch",
    "Resident Evil 7": "https://www.techradar.com/news/resident-evil-7-review",
    "best PSVR games": "https://www.techradar.com/best/best-playstation-vr-games",
    "Skyrim Anniversary Edition": "https://www.techradar.com/news/skyrim-is-about-to-get-its-fourth-re-release-since-launching-10-years-ago",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors"
  }
}