{
  "source": "https://www.techradar.com/news/lg-has-revealed-that-it-might-stop-making-smartphones",
  "title": "LG has revealed that it might stop making smartphones",
  "category": "phones",
  "updated": "2021-01-20T11:58:15Z",
  "author": "james-rogerson",
  "summary": "But it's not out yet",
  "article": [
    "Despite making innovative and interesting phones like the LG Wing 5G and the upcoming LG Rollable, LG has struggled to compete in the smartphone market in recent years, and has now revealed that it’s considering giving up on phones.",
    "That’s according to the Korea Herald, which has seen a note sent to employees from the company’s CEO, Kwon Bong-seok. While the note didn’t go so far as to say that LG was definitely abandoning the smartphone business, it did apparently say that “the company is considering all possible measures, including sale, withdrawal and downsizing of the smartphone business.”",
    "This isn’t the first time we’ve heard talk that LG might quit the smartphone business, but just a few days earlier LG's global head of corporate communications, Ken Hong, called the rumors \"completely false and without merit” so this seems like quite a sudden turnaround.",
    "It would make sense for LG to mull its options though, as according to StatCounter, LG’s smartphone market share in December stood at just 1.7%.",
    "While the smartphone industry might be booming, it really only seems to be a few companies that are significantly benefiting, with Samsung and Apple being among the major premium players, while Chinese brands like Oppo and OnePlus sell phones at prices that LG can’t compete with.",
    "Still, it seems no decision has been made yet, so there’s some hope for LG’s smartphone business. Though it’s unlikely the LG Rollable will be its savior, as that’s sure to be a very expensive and probably very niche device.",
    "Via Engadget"
  ],
  "headers": {
    "3": "A tiny share of the market"
  },
  "links": {
    "LG Wing 5G": "https://www.techradar.com/reviews/lg-wing-5g-review",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "Korea Herald": "http://www.koreaherald.com/view.php?ud=20210120000992",
    "called the rumors": "https://www.techradar.com/news/lg-has-no-immediate-plans-of-quitting-the-smartphone-business-heres-why",
    "StatCounter": "https://gs.statcounter.com/vendor-market-share/mobile",
    "Engadget": "https://www.engadget.com/lg-ceo-kwon-bong-seok-mobile-division-exit-losses-094712722.html"
  }
}