{
  "source": "https://www.techradar.com/news/going-digital-helped-thousands-of-smbs-survive-the-pandemic",
  "title": "Going digital helped thousands of SMBs survive the pandemic",
  "category": "computing",
  "updated": "2021-10-07T09:38:57Z",
  "author": "sead-fadilpasic",
  "summary": "Changes made last year will most likely be permanent for many SMBs",
  "article": [
    "The pandemic may have been terrible for many small businesses in the short-term, but a new report has shown even though businesses were forced to make many changes to their day-to-day operations, these changes will bring benefits for years to come.",
    "A new paper from Salesforce based on a poll of 2,534 SMB owners and leaders in North America, South America, Europe, and Asia Pacific found businesses adopted a range of new technologies and new ways of thinking which are showing plenty of promise for the future.",
    "The majority (56%) said their business couldn’t have survived the pandemic just by using the technology from a decade ago, while an even bigger percentage (65%) said the operational shifts they made in the past year will benefit them long-term.",
    "Most businesses moved at least a part of their operations online in the past year. With that in mind, they shifted their attention towards customer experiences, with 42% now being more careful about how they interact with their customers, and a quarter of those saying they became more flexible.",
    "For some, the pandemic was an opportunity to experiment with contactless services and as a result - almost two-thirds (62%) will offer them permanently.",
    "Secure digital payments, digital customer services, mobile ordering and click-and-collect delivery aren’t as nearly as popular.",
    "The government also played an important factor in the survival of the pandemic, the report added, saying that a quarter (27%) of SMBs have gotten “vital” financial support from the community.",
    "“SMBs are the lifeblood of the UK economy, and while the last year has presented immense challenges and has impacted businesses of all sizes, small, medium and growing business leaders remain innovators as they adapt and pivot their businesses with speed and agility,” said Brigid Charmant, Head of UK Small and Medium Business at Salesforce."
  ],
  "headers": {
    "4": "Government's support"
  },
  "links": {}
}