{
  "source": "https://www.techradar.com/news/ipad-pro-redesign-and-more-ipad-updates-tipped-for-2022",
  "title": "iPad Pro redesign and more iPad updates tipped for 2022",
  "category": "tablets",
  "updated": "2021-12-06T10:20:06Z",
  "author": "david-nield",
  "summary": "Here's your tablet forecast",
  "article": [
    "Over the last year Apple has treated us to new models of the iPad Pro, the iPad mini, and the entry-level 10.2-inch iPad, but it doesn't appear to be slowing down – updated versions of several Apple slates are rumored to be in the pipeline for 2022.",
    "This comes via the usually reliable Mark Gurman and his Power On newsletter at Bloomberg: updates for the iPad Pro, the iPad Air and the 10.2-inch iPad are all mentioned, with the iPad Pro apparently in line for a significant redesign.",
    "A refresh of the iPad Air would make sense, as we last saw a new model in that particular line in 2020, but it seems that Apple isn't going to wait more than a year to update the other tablets – it's only the iPad mini that doesn't get a mention in the 2022 plans.",
    "Of the three iPad models Gurman is predicting we'll see an update for, we know most about the iPad Pro, which Apple currently sells in 11-inch and 12.9-inch sizes. This is in line for some kind of redesign, which apparently includes support for wireless charging (which is something that pro-level users now expect).",
    "We heard the same prediction from the same source a few months ago, and these revamped iPad Pros for 2022 are said to be coming with glass backs and support for the new MagSafe charging technology that's appeared on recent iPhone models.",
    "Back then, the word was that the redesign could be delayed or even canceled, but it now seems that Apple is going ahead – and updating two other iPad models at the same time. We'll have to see what else the product refreshes bring, though faster internal processors are almost certain to be on the agenda.",
    "The iPad in all its various guises is responsible for almost a third of all the tablets sold worldwide, which puts Apple way ahead of everyone else when it comes to these devices – Samsung makes some fine tablets too, but it accounts for only one in five tablets sold.",
    "Despite this market lead, Apple isn't resting on its laurels, and for the most part is following the annual refresh approach that it uses for the iPhone to keep its tablets fresh and relevant. While the year-on-year upgrades might not be huge, they mean that you're never going to come across an outdated iPad.",
    "That's not to say everything is perfect when it comes to the Apple iPad line. The popular iPad mini had to wait a while for its last update, while the use of USB-C on the iPad Pros and Lightning connectors on the other iPad models is a confusing annoyance that you don't normally get when it comes to Apple products.",
    "However, this latest rumor suggests that Apple's iPad strategy will remain an aggressive one – not only with the hardware, but also with the iPadOS software that Apple updates every year with new features and functionality."
  ],
  "headers": {
    "3": "Going Pro",
    "6": "Analysis: the evolution of the iPad isn't slowing down"
  },
  "links": {
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPad mini": "https://www.techradar.com/reviews/ipad-mini-2021",
    "10.2-inch iPad": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Power On newsletter": "https://www.bloomberg.com/news/newsletters/2021-12-05/apple-verizon-t-mobile-at-t-iphone-13-apple-watch-ipad-rebates-not-working-kwtm0hum",
    "iPad Air": "https://www.techradar.com/reviews/ipad-air-4-review",
    "a few months ago": "https://www.techradar.com/news/new-ipad-pro-for-2022-could-borrow-a-key-iphone-12-feature-but-ipad-mini-out-first",
    "almost a third": "https://9to5mac.com/2021/05/01/idc-apple-tablet-market-ipad/",
    "iPadOS software": "https://www.techradar.com/news/new-ipados-15"
  }
}