{
  "source": "https://www.techradar.com/news/amazon-primes-next-big-fantasy-show-reportedly-wraps-filming-heres-why-it-matters",
  "title": "Amazon Prime's next big fantasy show reportedly wraps filming – here's why it matters",
  "category": "entertainment",
  "updated": "2021-05-18T14:16:36Z",
  "author": "tom-power",
  "summary": "The Wheel of Time has ended its production cycle",
  "article": [
    "Amazon Prime Video is stepping up its fantasy TV game in the next 12 months. The company's streaming platform currently has two big fantasy series in the works, including its Lord of the Rings TV show, which is set in Middle-earth's Second Age.",
    "The other big production, whose launch date is yet to be revealed, is The Wheel of Time. Based on the high fantasy novels by Robert Jordan, Amazon has high hopes for this adaptation, which stars Gone Girl's Rosamund Pike - and it could finally be on its way to our TV screens in the not-too-distant future.",
    "Finally, almost two years after principal photography on The Wheel of Time's live-action series began, production has officially wrapped. According to fan site WOTSeries.com, key members of the TV show's crew have taken to social media to confirm that filming has ended.",
    "While it's a relief to learn that The Wheel of Time will arrive at some point, reshoots or additional scene pick ups are likely to take place. WOTSeries' sources have alleged that additional filming will be necessary as part of the editing process, but it's unclear what kind of reshoots could be required.",
    "It's hard to believe that production on The Wheel of Time began back in September 2019. Naturally, the Covid-19 pandemic put paid to much of its filming schedule in 2020, but it sounds as if principal photography is now done and dusted.",
    "It'll be a while before The Wheel of Time arrives on Amazon's streaming platform, though. As we said, there are bound to be reshoots and, given its a fantasy TV show, there'll be lots of CGI effects that need to be added in post-production to bring The Wheel of Time's fictional world to life.",
    "Even if The Wheel of Time season 1 doesn't arrive until December 2021 (depending on how long post-production takes), or early to mid-2022 for that matter, we think it'll be Amazon Prime's next major TV success.",
    "Why? Well, for starters, it's another fantasy epic for fans of the genre to lose themselves in. For those unfamiliar with the source material, The Wheel of Time is made up of 14 novels (written between 1990 and 2013) and follows Moiraine, a member of the Aes Sedai (an all-female organization of magic wielders) as she leads five young people in the fight against the Dark One, an evil entity who wants to end life as we know it.",
    "Moiraine believes that one of her five followers, who she found following an attack on their home village, is a reincarnation of the Dragon. This individual is an ancient, all-powerful hero who is prophesized to save or destroy the world, and it'll be up Moiraine to lead them down the right path in order to quash the Dark One once and for all.",
    "If you're a fan of other popular fantasy series, such as The Lord of the Rings, Harry Potter or Game of Thrones, The Wheel of Time will be right up your street. Jordan's novels have been praised for their detailed imaginary world, intricate and dense story, huge cast of characters and highly-developed magic system, so it'll be worth catching if similar series have been to your liking.",
    "Amazon has released two six-second long teasers on its Prime Video YouTube channel in recent months, and both videos have amassed over 170,000 views apiece. Sure, that doesn't sound like much, but The Wheel of Time has an extensive following, and we suspect that'll only grow once the TV show arrives.",
    "Amazon has high expectations for its Wheel of Time series, too. It's reportedly already renewed the show for a second season before its six-episode long first season has even been given a release date. Given how many books there are to get through, The Wheel of Time could also run for many years to come if audiences are receptive to it.",
    "Hopefully, it won't be much longer before we get official confirmation that season 1 has wrapped production. After that, it'll be a matter of waiting for its official trailer and, fingers crossed, a confirmed release date."
  ],
  "headers": {
    "4": "Analysis: The Wheel of Time could be Amazon Prime's next major hit"
  },
  "links": {
    "Lord of the Rings TV show": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "WOTSeries.com": "https://www.wotseries.com/2021/05/14/breaking-season-1-wrapped-plus-possible-season-2-filming-dates/",
    "Prime Video YouTube channel": "https://www.youtube.com/watch?v=SCQFyRGFfTU",
    "already renewed the show": "https://twitter.com/WotTVSeries/status/1392569875495890944"
  }
}