{
  "source": "https://www.techradar.com/news/firefox-is-killing-off-its-password-manager-app",
  "title": "Firefox is killing off its password manager app",
  "category": "computing",
  "updated": "2021-11-24T13:04:28Z",
  "author": "mike-moore",
  "summary": "Firefox Lockwise password manager app will reach end-of-life on December 13",
  "article": [
    "Mozilla has revealed it will be shuttering its Firefox Lockwise password manager app within the next few weeks.",
    "The app, currently available to iOS and Android users, will reach its end-of-life on December 13, Mozilla revealed in a support blog post announcing the news.",
    "Although the application may still work on your device or browser, users will no longer be able to download or reinstall after that date, and will no longer receive support or security updates, making it a much less attractive proposition.",
    "Mozilla launched Lockwise, or Lockbox as it was initially known, back in 2018, as it looked to provide an option for users to safeguard their passwords on mobile and desktop devices.",
    "The company notes that users can continue to access your saved passwords and your password management in the Firefox desktop and mobile browsers after the end-of-life date. Users can sync information across multiple devices by navigating to the Settings menu and selecting Sync.",
    "The final versions of Lockwise are iOS version 1.8.1 and Android version 4.0.3, with users of the former told to await further instructions on how to sync their saved passwords outside of Firefox if they want to keep using the mobile browser as a system-wide password manager.",
    "The news comes after the company recently launched a new service aiming to help consumers stay safe when shopping online by providing email aliases. Firefox Relay (formerly known as Firefox Private Relay) hides your real email address, giving users five email aliases they can use whenever signing up for an online account.",
    "Anyone wanting more email can sign up for Firefox Relay Premium, which provides users with one subdomain from which they can create unlimited email aliases, alongside other features such as a summary dashboard of a user's email aliases, the option to use their email aliases to reply to emails directly and customer support though a convenient contact form."
  ],
  "headers": {
    "3": "Locked out?"
  },
  "links": {
    "password manager": "https://www.techradar.com/best/password-manager",
    "blog post": "https://support.mozilla.org/en-US/kb/end-of-support-firefox-lockwise",
    "browser": "https://www.techradar.com/best/browser",
    "password management": "https://www.techradar.com/best/business-password-management-software",
    "Firefox Relay": "https://www.techradar.com/news/firefox-relay-wants-to-use-email-aliases-to-keep-your-details-safe-online"
  }
}