{
  "source": "https://www.techradar.com/news/pre-ordered-a-samsung-galaxy-z-fold-3-you-may-get-it-a-week-early",
  "title": "Pre-ordered a Samsung Galaxy Z Fold 3 or Z Flip 3? You may get it a whole week early",
  "category": "phones",
  "updated": "2021-08-20T15:18:18Z",
  "author": "james-peckham",
  "summary": "Some are finding that it's arriving a week early",
  "article": [
    "Update: Since publication, we've heard from 10 other customers in the UK who are receiving their Galaxy Z Fold 3 handsets earlier than originally expected. We've also heard from one reader who has got a Z Flip 3, but we've yet to hear from anyone in other markets.",
    "The Samsung Galaxy Z Fold 3 release date is set for August 27, but some lucky customers who pre-ordered are finding the handset is arriving a whole week early.",
    "One TechRadar reader in the UK has shown us their handset that has already arrived with them on August 20, and others on Samsung's official forum are also saying the smartphone is appearing on their doorsteps.",
    "A Community Manager on Samsung's forum has said, \"We know that people can't wait to get their hands on their Galaxy Z Fold 3 or Galaxy Z Flip 3, so we've started shipping them out early.\"",
    "TechRadar has asked Samsung for comment on why the release date has been moved forward for some and where this is relevant for, but we've yet to hear back from the company.",
    "There's no guarantee this will be the case for everyone, but it seems a number of those who pre-ordered are getting the benefit of receiving their phone early.",
    "Exactly where the phone is shipping early is also unclear. The TechRadar reader is based in the UK, and those on the forum haven't provided locations so it's difficult to tell if this is limited to certain markets.",
    "In our research for this story, we couldn't see any forum or social media posts of people receiving their Samsung Galaxy Z Flip 3 early. The forum's Community Manager post suggests you may get it early if you have pre-ordered that smartphone though.",
    "Have you received your Samsung Galaxy Z Fold 3 or Samsung Galaxy Z Flip 3 early? Please drop this article's author a line over email on james.peckham@futurenet.com or on Twitter.",
    "Pre-ordering a new smartphone may sometimes feel like a lot of money to drop in one moment, but if you're truly excited about a new handset it can come with some additional benefits.",
    "Samsung is particularly good at including extras when you pre-order - those who pre-ordered the Samsung Galaxy Z Fold 3 received extra kit including an S Pen, charger and a case - and you may also sometimes get the handset early.",
    "It's rare to see smartphones arrive a whole week before an official release date, but it's one of the added extra benefits that can make the experience of pre-ordering worthwhile if you're certain a new smartphone is made for you."
  ],
  "headers": {
    "9": "Analysis: pre-ordering does have its benefits"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung's official forum": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4589012609465805000&xs=1&url=https%3A%2F%2Feu.community.samsung.com%2Ft5%2Fgalaxy-z-fold-z-flip%2Fsamsung-z-fold-3-shipping-early%2Fm-p%2F3839585&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fpre-ordered-a-samsung-galaxy-z-fold-3-you-may-get-it-a-week-early",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Twitter": "https://twitter.com/jamesrwp?lang=en"
  }
}