{
  "source": "https://www.techradar.com/news/sony-x90j-vs-sony-a90j-oled",
  "title": "Sony A90J OLED vs Sony X90J: which 4K TV is best for you?",
  "category": "televisions",
  "updated": "2021-07-22T14:41:51.534Z",
  "author": "henry-st-leger",
  "summary": "How to choose your favorite 2021 Sony TV",
  "article": [
    "The Sony X90J and Sony A90J OLED are two high-spec 4K TVs for 2021 – but which one should you actually take home with you? Having had the pleasure of testing out both televisions, we can say confidently that either is a strong choice for a new TV upgrade, though there are some key differences worth keeping in mind.",
    "While both are impressive screens, only the A90J packs in an OLED panel, whereas the X90J makes do with an LCD solution. Overall, the former set will make for a more premium experience, though the compromises may be worth it to get the X90J at a far lower price.",
    "And since Sony TVs have finally started catching up with HDMI 2.1 specifications, and switching to a new Google TV smart platform, our usual complaints about Sony's screens simply aren't applicable to these two sets.",
    "For a detailed rundown of the pricing, sizing, panels, processing, and audio discrepancies between the Sony A90J and Sony X90J, read on below.",
    "First things first: Sony TVs aren't the cheapest out there.",
    "You're usually paying a 10-20% price premium over an equivalent LG OLED TV, for example – which isn't to say that Sony TVs are overpriced, but that the overall package of picture and sound quality they offer makes them pricier than some other models. The step-down Sony A80J OLED costs the same as LG's 2021 flagship, the G1 OLED, for instance.",
    "The Sony A90J OLED starts at $2,799 / £2,699, going up to $3,799 / £3,499 / AU$4,999 for a 65-inch size, and $7,999 / £6,999 for an 83-inch model. It skips out on a 77-inch model entirely, so anyone after something in that area will have to opt for the X90J.",
    "Speaking of which, the X90J, starts at a much more affordable $1,299 / £1,149 / AU$1,895 for its smallest 50-inch size. That rises to $1,499 / £1,249 / AU$2,195 at a 55-inch size, $1,799 / £1,499 / AU$2,695 for a 65-inch size, or $2,499 / £2,599 / AU$4,299 for its largest 75-inch size. You're paying about half the amount for the X90J at an equivalent size, then.",
    "That 83-inch OLED TV size is new for 2021, too, currently only applying to the A90J and the LG C1, though we expect to see it come to more screens down the line.",
    "The biggest disparity between the A90J and X90J is the OLED panel utilised by the former. Sony releases a mix of both OLED and LCD screens, with the former using an 'A' at the start of the product name (as in 'A90J'), while those with an LCD panel use 'X' (as in 'X90J').",
    "These are entirely different panel types. LCD-LED screens are more common, being a cheaper technology that mixes an LCD panel with an LED backlight illuminating it from behind. (Very cheap models might use 'edge lighting', where images are illuminated from the sides instead, but that's not a concern here.)",
    "OLED panels, meanwhile, are self-emissive, meaning they produce their own light. Each pixel can be individually controlled or turned off entirely, making for stark (or even 'infinite') contrast between light and dark areas of the screen, and generally more cinematic images. Without a need for a backlight, OLED TVs tend to be a lot slimmer, too – which is why the A90J measures in at just 41mm depth, while the X90J is a thicker 70mm.",
    "You will be getting a better picture with the A90J, there's no doubt about that. Though there are other things to keep in mind before jumping the gun on a high-end OLED TV purchase.",
    "So, what else is there to know? The X90J comes with quite standard TV feet, while the A90J features adjustable feet that can stand upright (to accommodate a soundbar) or flat against the counter.",
    "Both come with a new Google TV platform, rather than the usual Android TV support we saw on 2020 Sony TVs. Google TV is a bit flashier, with content recommendations pulled from across key streaming apps as well as a Watch List to flag content for later.",
    "You'll even get a Sony-exclusive movie app called Bravia Core, which packs in most of Sony Picture Entertainment’s catalogue, including Spider-Man: Into the Spider-Verse and Jumanji: The Next Level. It’s something no other TV has at this point and considering it’s essentially free to try, it’s absolutely worth checking out, even if it's a small perk amidst everything else the platform offers.",
    "Both screens also make use of the Cognitive Processor XR, a high-end chipset with exceptional upscaling and contrast control, whatever the panel it's running on. In both cases you're getting 4K resolution, a 120Hz panel, and two HDMI 2.1 inputs (with eARC, VRR, and ALLM) for maximising performance of next-gen gaming consoles.",
    "You'll only get Sony's Acoustic Surface Audio+ feature on the A90J, where sound is emitted through the panel itself. Our reviewer praised its \"robust sound [...] backed up by two rear-firing low-frequency drivers,\" and the ability to use the screen as the center channel of a surround-sound setup.",
    "The X90J makes do with more traditional TV audio, through its X-Balanced speaker, which we found offered \"solid sound with good mid-range but weak bass.\"",
    "Neither set outputs Dolby Atmos audio, or Dolby Vision HDR, and those after the latter format will likely want an OLED TV from LG or Panasonic.",
    "Choosing a new TV is always hard, but the stark differences in price and picture quality should make this a relatively easy one.",
    "If you have the budget for the Sony A90J OLED, it's a no-brainer, with an OLED panel and enhanced sound along with all the connectivity specification and processing smarts found on the X90J.",
    "That said, if you're mainly after a good gaming TV, or don't need a knockout OLED screen to keep yourself happy, the X90J costs about half the price – while coming in more flexible sizing options (50-inch, 75-inch) not found on its premium sibling."
  ],
  "headers": {
    "4": "Sony A90J vs Sony X90J: price and sizes",
    "9": "Sony A90J vs Sony X90J: OLED or LCD?",
    "13": "Sony A90J vs Sony X90J: design and specs",
    "20": "Sony A90J vs Sony X90J: conclusion"
  },
  "links": {
    "Sony X90J": "https://www.techradar.com/reviews/sony-x90j-xr-65x90j",
    "Sony A90J OLED": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Sony TVs": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Sony A80J OLED": "https://www.techradar.com/news/sony-a80j-oled-price-specs-release-date",
    "83-inch OLED TV": "https://www.techradar.com/news/should-i-buy-an-83-inch-oled-tv",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "Acoustic Surface Audio+": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format"
  }
}