{
  "source": "https://www.techradar.com/news/worlds-second-largest-cryptocurrency-sets-new-all-time-high-price",
  "title": "World's second-largest cryptocurrency sets new all-time high price",
  "category": "computing",
  "updated": "2021-01-20T12:16:46Z",
  "author": "barclay-ballard",
  "summary": "Things are looking good for Ethereum in 2021",
  "article": [
    "Ether, the world’s second-largest cryptocurrency by market capitalization has set a new all-time high price. The cryptocurrency, which is used by the Ethereum blockchain, is only surpassed by bitcoin in terms of overall value.",
    "The price of ether hit $1,439.33 on January 18, overtaking its previous high of $1,432.88 recorded a little over three years ago. Although there have been setbacks along the way, the overall trend is a positive one for ether. Since it was first made available for public sale in 2015, the digital asset has seen its value increase by more than 1000%.",
    "While bitcoin is by far the most high-profile cryptocurrency, ether, or Ethereum, can make a robust claim for second-place. In fact, ether has gained on its better-known rival of late, surging in value by 92% this year, compared to bitcoin’s 27%. Bitcoin remains the more valuable, however, and achieved its own record valuation of $41,900 earlier in January.",
    "Ethereum has gained plenty of advocates for the way that it enables decentralized applications, with ether being the currency that pays for the resources used by the Ethereum network. In particular, Ethereum has been popularized by decentralized finance (DeFi) apps, although these digital solutions may use their own tokens in place of ether.",
    "Back in December, the Ethereum network had major news to share with its followers, announcing that the next generation of the Ethereum blockchain, Ethereum 2.0, had gone live. Among the new improvements included within Ethereum 2.0, the blockchain network will be able to greatly increase the number of transactions it is able to process per second.",
    "With the Ethereum 2.0 upgrade progressing and a new record price for ether, things are looking good for the Ethereum network as we move further into 2021.",
    "Via CoinDesk"
  ],
  "headers": {
    "3": "Bright future"
  },
  "links": {
    "Ethereum": "https://www.techradar.com/news/bitcoins-largest-rival-is-on-even-hotter-form",
    "CoinDesk": "https://www.coindesk.com/ethereums-ether-cryptocurrency-sets-new-price-record-on-major-exchanges"
  }
}