{
  "source": "https://www.techradar.com/news/these-top-vpn-tools-have-been-banned-in-russia-heres-why",
  "title": "These top VPN tools have been banned in Russia - here's why",
  "category": "computing",
  "updated": "2021-06-17T20:46:35Z",
  "author": "anthony-spadafora",
  "summary": "VyprVPN and Opera VPN have been banned by the Russian government",
  "article": [
    "Russian VPN users may need to start looking for a new VPN provider as the country's telecommunications watchdog Roskomnadzor has banned two popular services.",
    "In a statement on its site, Roskomnadzor explained that VyprVPN and Opera VPN will be banned from use in Russia effective immediately, saying:",
    "“In accordance with the regulation on responding to threats to circumvent restrictions on access to child pornography, suicidal, narcotic and other prohibited content, restrictions on the use of VPN services VyprVPN and Opera VPN will be introduced from June 17, 2021. These VPN services are classified as threats in accordance with the Decree of the Government of the Russian Federation No. 127 dated February 12.”",
    "Roskomnadzor also said that these restrictions “will not affect Russian companies using VPN services in continuous technological processes”. This likely means that while VyprVPN and Opera VPN have been banned in the country, Russian organizations can continue using business VPN services from other providers in their day-to-day operations.",
    "In order to learn more about how this ban will affect both providers, TechRadar Pro reached out to VyprVPN and a company spokesperson explained that its VPN service and connections are still currently working in Russia.",
    "At the same time, the company spokesperson also revealed that it has not been contacted by any relevant authorities in Russia regarding the new ban on its VPN service. While this could change, it appears that at least for now, VpyrVPN can still be used in the country.",
    "Back in March after CyberNews reported that the user databases of three popular Android VPN services were hacked, Roskomnadzor said that it would begin an investigation regarding data breaches that have affected users of free VPN services.",
    "We'll likely hear more if the ban on VyprVPN and Opera VPN in Russia goes into effect but until then, Russian users should take a look at our best VPN guide to start shopping around for an alternative VPN provider.",
    "Via Reuters"
  ],
  "headers": {
    "4": "Banned but still working for now"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Roskomnadzor": "https://www.techradar.com/vpn/which-websites-and-services-are-banned-in-russia",
    "statement on its site": "https://rkn-gov-ru.translate.goog/news/rsoc/news73700.htm?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en-US&_x_tr_pto=ajax,se",
    "VyprVPN": "https://www.techradar.com/reviews/vyprvpn",
    "Opera VPN": "https://www.techradar.com/reviews/opera-vpn",
    "business VPN": "https://www.techradar.com/vpn/best-vpn-for-business",
    "user databases": "https://www.techradar.com/news/millions-of-vpn-users-have-personal-details-stolen",
    "Android VPN": "https://www.techradar.com/vpn/best-vpn-for-android-our-5-top-choices",
    "free VPN": "https://www.techradar.com/vpn/best-free-vpn",
    "best VPN guide": "https://www.techradar.com/vpn/best-vpn",
    "Reuters": "https://www.reuters.com/technology/russian-consumer-watchdog-bans-vyprvpn-opera-vpn-services-2021-06-17/"
  }
}