{
  "source": "https://www.techradar.com/news/disney-plus-day-how-to-watch-date-start-time-shang-chi-what-to-expect-and-more",
  "title": "Disney Plus Day recap: news from Marvel, Star Wars, Pixar and more at the streaming platform's birthday bash",
  "category": "entertainment",
  "updated": "2021-12-02T14:29:41Z",
  "author": "tom-power",
  "summary": "All the news, trailers and announcements from Disney Plus Day",
  "article": [
    "Disney Plus Day has landed and the streaming platform’s second anniversary celebrations on Friday, November 12 brought with them plenty of birthday treats for fans.",
    "With Marvel, Star Wars, Pixar and National Geographic – not to mention Disney’s own properties – falling under the Disney Plus Day banner, this was always going to be an event with plenty to talk about.",
    "Highlights included first looks at upcoming Marvel TV shows Moon Knight, She-Hulk and Ms Marvel, news of a follow-up to the hit X-Men TV cartoon from the ’90s, and a behind-the-scenes video from the Obi-Wan Kenobi TV show.",
    "We were also gifted a first-look image from the eagerly anticipated Hocus Pocus 2, trailers for Big Hero 6 spin-off Baymax, and news of a new live-action Spiderwick Chronicles adaptation. Beatles fans also got to see a new clip from Peter Jackson’s documentary, Get Back.",
    "With the streamer also making some high profile releases for Disney Plus Day – including Shang-Chi and the Ten Rings and a new Boba Fett documentary – this was also going to be a day long remembered. Here’s everything that happened…",
    "If Disney Plus Day has whetted your appetite for a piece of the streaming action, you’re in luck. From now until November 14, Disney is offering a one-month subscription for just $1.99/£1.99. Given that it usually costs $7.99/£7.99 per month, and with all of the content available on the platform, this is a major bargain that you won’t want to miss out on.",
    "Here’s all the the big trailers and reveals from Disney Plus Day, featuring Marvel, Pixar, Star Wars and more.",
    "The Marvel offering initially seemed pretty disappointing, as She-Hulk, Moon Knight, Ironheart, Secret Invasion and What If...? season 2 – shows that had already been confirmed – all got logos and \"Coming Soon” date stamps. Ms Marvel – which was given a new launch window just ahead of Disney Plus Day – did slightly better, with a more defined \"Summer 2022” slot.",
    "It was also good news to see Hawkeye spin-off Echo and WandaVision follow-up Agatha: House of Harkness getting official confirmation. (They're both “coming soon”, too – and yes, it was Agatha all along.)",
    "But there was an extra treat for Disney Plus subscribers in the form of the Marvel Studios Disney Plus Day Special. You have to work your way through old clips from WandaVision, The Falcon and the Winter Soldier, Loki and What If...?, but stick with it and you get an extended sequence from Hawkeye, plus first looks at Moon Knight, She-Hulk, Ms Marvel and Secret Wars.",
    "Marvel Studios is also getting stuck into animation, with new wallcrawler cartoon Spider-Man: Freshman Year, I am Groot (Baby Groot! What's not to like?) and Marvel Zombies (an undead reimagining of the MCU). And obviously they're all \"coming soon\" too.",
    "And if this is what we think it is, it could be very exciting indeed. The X-Men cartoon that ran from 1992-1997 was something of a classic, a serialised epic that arguably helped pave the for the explosion of Marvel movies in the 21st century. That certainly looks like the Wolverine from back in the day, and the X-Men ’97 title fits with the timeline... The mutants return in 2023, so while we wait for the X-Men to make their MCU debuts, this could fill the gap nicely.",
    "It's also worth noting that changes are afoot on the Disney Plus app, where the artwork has been updated to champion newer heroes rather than the old guard:",
    "Hold onto your lightsabers... There's now a preview for the Obi-Wan Kenobi TV show available on Disney Plus!",
    "We knew this one was coming but this teaser for Under the Helmet: The Legacy of Boba Fett should get you pretty excited for the new Disney Plus documentary.",
    "Cars is someway from being the best franchise in the impressive Pixar back catalogue, but it‘s always been ludicrously popular with a younger fanbase. So it's no real surprise that Owen Wilson and Larry the Cable Guy are returning to voice Lightning McQueen and Mater, respectively, in Cars on the Road, a new Disney Plus series. It's leaving the garage in 2022.",
    "We're much more excited bout Win of Lose, a new animated series coming in Fall 2023. The story of a middle school softball coach and his team – each episode follows a different character in the run up to a big championship game – it’ll be Pixar's first TV series based on original characters. Here's some first-look art:",
    "Pixar chief creative officer (and Inside Out/Soul director) Pete Docter also presents a Pixar Disney Plus Day special, featuring a tour of the animation studio and some chat about upcoming projects – including documentaries on 2022 movie releases Turning Red and Lightyear.",
    "It wasn't announced via Disney Plus Day channels, but Deadline has reported that a new Predator movie is coming in 2022. Titled Prey and directed by 10 Cloverfield Lane's Dan Trachtenberg, it's a prequel set in the world of the Comanche Nation 300 years ago. It's coming to Hulu in the US, so don't be surprised to see it on Disney Plus's Star in the UK.",
    "2003 Steve Martin vehicle Cheaper By The Dozen is getting a reboot, starring Gabrielle Union and Zach Braff. \"It's an update on the classic comedy centered around a multiracial blended family of 12, navigating a hectic homelife while managing their family business,” says Union. It's due on Disney Plus in March 2022.",
    "We knew Enchanted sequel Disenchanted was incoming in 2022 – Disney Plus Day confirms it's coming to Disney Plus in Fall 2022. Here's stars Amy Adams and Patrick Dempsey.",
    "Peter Jackson's hotly anticipated three-part documentary about the final days of the Beatles, Get Back, is coming to Disney Plus on November 25. See the Fab Four in action in this new clip.",
    "Aria Brooks, Michelle Federer, Rueby Wood, Lis Kudrow and Joshua Bassett star in new original musical movie Better Late Than Never, coming Spring 2022.",
    "And it's time for some bona fide Disney magic... Bette Midler, Sarah Jessica Parker and Kathy Najimy are back for some witchy business in the eagerly anticipated Hocus Pocus 2. It's now in production and coming Fall 2022.",
    "Not a word of a lie – a live-action version of Pinocchio, directed by Back to the Future's Robert Zemeckis and starring Tom Hanks, Cynthia Erivo and Luke Evans, is coming to Disney Plus in Fall 2022.",
    "Cinderella gets a modern retelling in Sneakerella – Disney claim it has \"heart and sole\". You can find out if the pun was worth the effort on February 18, and you can try out the trailer for size below:",
    "2016‘s Zootopia (titled Zootropolis in the UK) was great fun – and a hit at the box office – so it's no surprise that Disney is going back to its mammalian civilisation. Zootopia+ is a new TV series set in the same world, coming to Disney Plus in 2022. This promo art suggests the sloths are returning which is all we needed to know...",
    "Another incoming TV series from Disney Animation is Tiana, a follow-up to New Orleans-set 2009 movie The Princess and the Frog. This first look concept art hints at a rare return to traditional 2D animation for the studio.",
    "The first announcement of Disney Plus Day took us back in time to prehistoric times... The Ice Age movies came under the Disney umbrella after its multi-billion-dollar 20th Century Fox purchase. Now Disney Plus Day unveils new movie The Ice Age Adventures of Buck Wild (starring Simon Pegg) streaming from January 28.",
    "Baymax is back! The cutest robot ever created – and co-star of Big Hero 6 – is getting his own original TV series in summer 2022. Here's a first trailer.",
    "There's a new Diary of a Wimpy Kid streaming on Disney Plus from December 3! Not to be confused with the live-action 2010 movie, this animated take has got a poster – and it's also been confused there'll be a sequel called Rodrick Rules. Here's writer/producer Jeff Kinney to talk about the movie:",
    "Ch, ch, ch, Chip n Dale: Rescue Rangers. Disney's long-standing chipmunk heroes are back in an all-new TV movie on Disney Plus. John Mulaney and Andy Samberg are voicing the critters and they – or Disney's marketing people – say it's not a reboot, it's a comeback...",
    "Willow, a sequel TV series to the 1988 fantasy movie, is confirmed for a 2022 launch on Disney Plus. Returning star Warwick Davis introduces his co-stars in the video below – but how many of them are old enough to remember original movie?",
    "Holly Black and Tony DiTerlizzi’s literal fairy tales The Spiderwick Chronicles were turned into a movie back in 2008. Now Disney Plus is turning them into a live-action series. The books have a passionate fanbase, so this could be big.",
    "Sing it loud! High School Musical: The Musical: The Series: Season 3 (undoubtedly the biggest mouthful of a series on Disney Plus Day) has been confirmed for 2022.",
    "And a reboot of The Proud Family subtitled Louder and Prouder – and starring Lizzo, Tiffany Haddish, Gabrielle Union and Cedric the Entertainer – is coming to Disney Plus in February 2022.",
    "National Geographic is wheeling out the big names for its documentaries. Will Smith is teaming up with Black Swan director Doug Liman for Welcome To Earth, due December 8.",
    "You can also see Thor as you've never seen him before. Chris Hemsworth teams up with National Geographic for Limitless with Chris Hemsworth – looks like the god of thunder is pushing himself to the limit. We'll find out how far he goes in 2022.",
    "National Geographic is also celebrating America's wide open spaces in America the Beautiful, coming in 2022.",
    "And just in case you've missed anything coming to the platform in the near future, Disney Plus have assembled this handy reminder:",
    "Disney Plus Day took place on Friday, November 12.",
    "Unlike Netflix’s Tudum and Warner Bros’ DC Fandome events, Disney Plus Day wasn't live streamed. Instead, fans were invited to keep up with reveals via Disney's official social media channels. Any announcements will be made exclusively on Disney Plus US, Disney Plus UK, and Disney Plus Hotstar Twitter accounts, as well as the company's Disney Plus Facebook and Instagram pages. You can also follow the official Disney Plus TikTok channel to check out unique short-form content centered around Disney Plus Day.",
    "An event like Disney Plus Day wouldn’t be complete without new content to check out.",
    "After it was released exclusively in theaters in September, Shang-Chi and the Legend of the Ten Rings is now available to all Disney Plus subscribers at no extra cost.",
    "It’s also one of 13 Marvel films that are available to stream in IMAX Enhanced mode for the first time, too. This expanded 1:90:1 aspect ratio means you’ll be able to see 26% more of the supported films than ever before. Avengers: Endgame, Iron Man and Black Panther are among those set to benefit from the new feature.",
    "Other highlights include Dopesick, a drama series centered on the US opioid epidemic, Frozen spin-off series Olaf Presents, a Boba Fett documentary that focuses on the beloved Star Wars bounty hunter, who's getting his own TV show in December, and Jungle Cruise arriving on the platform as part of the standard DIsney Plus subscription package.",
    "Check out the full list of productions, as well as new launches including Home Sweet Home Alone, below:",
    "This Instagram teaser offers up a few hints:",
    "As for the MCU, we’d love to see teasers for productions due to land early next year.",
    "We haven’t seen anything of Doctor Strange 2 yet, which saw its release date recently put back to May 8, 2022. There’s no better opportunity for Marvel, though, to tease us with a first-look than during Disney Plus Day. Providing any of it is ready to show off, that is.",
    "Meanwhile, we may finally get our first look at Ms. Marvel – though it's looking increasingly unlikely We had hoped that an official launch date would be revealed, too, but a recent Disney earnings call revealed that the show won't be released until sometime between July and September 2022. Still, we're fairly confident we might see something, even if we don't get a concrete release date.",
    "Finally, we could be treated to news on The Bob’s Burgers movie, the live-action Peter Pan film, and Marvel’s She-Hulk and Moon Knight shows.",
    "We don’t expect to see all of the above during Disney Plus Day, but there’s plenty that the Walt Disney Company could show off. If the relevant studios only show half of what we’ve listed, it’ll make for a pleasing presentation.",
    "And as a bit of fun, Disney Plus has also introduced some new Text-to-Speech voices on TikTok, featuring classic characters including C-3PO and Rocket Raccoon."
  ],
  "headers": {
    "5": "Disney Plus Day: how to sign up for a Disney Plus subscription",
    "6": "Disney Plus Day announcements and trailers",
    "7": "Marvel",
    "13": "Star Wars",
    "15": "Pixar",
    "18": "Live-action movies",
    "26": "Animated movies",
    "32": "TV shows",
    "36": "Documentaries",
    "40": "Disney Plus Day date: when did it take place?",
    "42": "Disney Plus Day releases: what’s launching on the streamer?",
    "47": "'Making Of' documentaries and specials"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "first looks at upcoming Marvel TV shows Moon Knight, She-Hulk and Ms Marvel": "https://www.techradar.com/news/marvel-reveals-first-look-at-moon-knight-she-hulk-disney-plus-shows",
    "X-Men TV cartoon": "https://www.techradar.com/news/x-men-the-animated-series-is-being-revived-for-disney-plus",
    "Obi-Wan Kenobi": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "Shang-Chi and the Ten Rings": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame",
    "Disney Plus Day": "https://www.techradar.com/news/ms-marvel-has-a-new-disney-plus-launch-window-but-itll-be-a-long-wait",
    "Marvel Studios Disney Plus Day Special": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1413031341745908500&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fmovies%2Fmarvel-studios-2021-disney-day-special%2F6o3sloKePurL",
    "available on Disney Plus!": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-7597982805272502000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fmovies%2Fobi-wan-kenobi%2FwPJYvt0aoozZ",
    "Pixar Disney Plus Day special": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-3690179271629969400&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fmovies%2Fpixar-2021-disney-day-special%2F5MAyGVAVD1zG",
    "Deadline": "https://deadline.com/2021/11/predator-prequel-prey-dan-trachtenberg-skulls-title-release-date-1234872831/",
    "Simon Pegg": "https://twitter.com/disneyplus/status/1459159560132853761",
    "Rodrick Rules": "https://www.instagram.com/p/CWLdLW-NSZI/",
    "Welcome To Earth": "https://twitter.com/disneyplus/status/1459174445642240003",
    "Tudum": "https://www.techradar.com/news/how-to-watch-tudum-online-date-start-time-and-what-to-expect-from-the-netflix-event",
    "DC Fandome": "https://www.techradar.com/news/dc-fandome-2021-how-to-watch-date-time-star-guests-and-more",
    "Disney Plus US": "https://twitter.com/disneyplus",
    "Disney Plus UK": "https://twitter.com/disneyplusuk",
    "Disney Plus Hotstar": "https://twitter.com/DisneyPlusHS",
    "Facebook": "https://www.facebook.com/DisneyPlus/",
    "Instagram": "https://www.instagram.com/disneyplus/?hl=en",
    "Disney Plus TikTok channel": "https://www.tiktok.com/@disneyplus?",
    "his own TV show": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "won't be released": "https://www.techradar.com/news/ms-marvel-has-a-new-disney-plus-launch-window-but-itll-be-a-long-wait"
  }
}