{
  "source": "https://www.techradar.com/news/can-free-antivirus-really-help-protect-my-computer-and-phone",
  "title": "Can free antivirus really help protect my computer and phone?",
  "category": "computing",
  "updated": "2021-03-16T16:52:25Z",
  "author": "darren-allan",
  "summary": "There’s lots to like about an antivirus freebie, and not just the cost",
  "article": [
    "You wouldn’t be alone in being suspicious of free antivirus, or concerned that somehow it might not properly protect the device you’ve installed it on - whether that’s your PC or smartphone. After all, a commonly held belief is that anything free must come with a catch or maybe even multiple caveats.",
    "In some cases of course, cynicism around free antivirus apps may not be entirely misplaced. But not all freebies can be tarred with the same brush, as we’re about to see. We’ll also address concerns about antivirus software for phones being ineffectual in particular, and the truth behind this.",
    "So without further ado, let’s explore the capabilities of cost-free antivirus apps, and what they can realistically accomplish in terms of being a guard dog for your various devices.",
    "A clear point of concern for some folks is that a free antivirus may provide some defenses for any given system, but that it won’t be as good as a paid-for app – leading to the conclusion that surely free software won’t protect as well as a premium offering.",
    "The truth is that there are good and bad antivirus apps out there in both the free and premium categories. Whatever antivirus you’re looking at, whether forking out money or not, you should always choose an app from a reputable and well-reviewed software maker.",
    "The crucial point to remember here is that there is no difference in the core protection afforded by a free or premium app from the same software maker, or at least apps from a good firm like the ones listed in our best free antivirus roundup.",
    "So, for example, our current top-rated free antivirus, Avira Free, has the exact same antivirus engine as its premium counterpart, Avira Antivirus Pro. In other words, when it comes to this first-line of defense against malware, both products give your PC the same fundamental protection against viruses or other nastiness potentially wreaking havoc on your system.",
    "Your next question might be: why purchase a paid-for product, then? Mainly because premium offerings give you a lot more extras that can provide additional online security in different ways - maybe for the whole family, with parental controls for example.",
    "The best premium software will also give you more flexibility around scheduling scans and receiving real-time virus protection to ensure that you're system is watertight at all times.",
    "Just don’t forget that good free virus-protection still gives you the same antivirus engine as the premium product, and this can more than ably defend your device against being compromised. Further note that free antivirus apps can come with extras too, like anti-ransomware protection or even a (limited) integrated VPN.",
    "In short, a free antivirus app really can protect your computer – and your phone for that matter. On the latter point, you may have additional concerns, so let’s address those next.",
    "Antivirus for smartphones is a slightly thornier matter than software on the PC, mainly because the Android market has a lot of antivirus apps, some of which are poor quality. The advice we’ve just given remains true – indeed, even more pertinent here – and that’s to install an app from a well-known and reputable antivirus company. Unheard of third-party antivirus are likely to be of variable quality at best, or indeed verging on useless and perhaps even malicious in a worst-case scenario.",
    "It is true that if you follow good security practice with your smartphone, and stick to curated stores – namely Google Play for Android – to get your apps, then you’re at minimal risk of encountering any malware anyway (the mobile threat landscape isn’t as hazardous as with the PC, where malware is much more prevalent).",
    "A good free Android antivirus app, however, can still be useful to have on hand to defend against that admittedly small danger of a malware infection – and it can ably protect your system in this manner, just like a free PC antivirus app.",
    "There are additional protective measures that a mobile antivirus can provide, though, in terms of protecting your data if your phone is lost or stolen. In truth, that’s probably the biggest danger to your smartphone – more so than a potential malware infection – and you can get anti-theft features with a good free antivirus. The latter can include functionality such as remotely wiping the device, or tracking it to find the handset.",
    "These additional capabilities could prove vital in protecting the sensitive data on your smartphone if it’s stolen, or in retrieving the device.",
    "Note that we’ve focused on Android applications here, but there are also iPhone antivirus apps of sorts, though you’ll notice they’re not generally called antivirus products, but rather ‘security’ apps.",
    "That’s because they don’t offer traditional antivirus protection – which isn’t possible due to the way iOS works and sandboxes apps, giving the operating system its own inherent security – but they do provide protective countermeasures like anti-phishing or anti-theft features (or perhaps extras like an integrated VPN for additional security in a convenient form).",
    "While Apple’s ecosystem is even more locked down and secure than Android – assuming you haven’t gone rogue and jail-broken your device – you still shouldn’t take your phone’s security for granted, and these iOS security apps can provide useful defenses.",
    "The short answer is yes, no matter if we’re talking about a PC or smartphone, a free antivirus can be very helpful for defending against malware. While it can certainly be argued that antivirus software is less important on phones, there are (admittedly slim) malware dangers on Android, and you should never take your online safety for granted.",
    "Even on iOS devices, there are security apps (if not actual antivirus products as such) which are worth considering as extra layers of protection to underscore Apple’s already stringent policing of its mobile OS and ecosystem. While these aren’t necessary, they can be helpful – just remember to stick to reputable security software vendors in all cases, whatever the device in question."
  ],
  "headers": {
    "3": "Free doesn’t have to mean weak",
    "7": "Added app extras",
    "11": "Phony apps?",
    "19": "Can free antivirus really help protect my computer and phone?"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "best free antivirus": "https://www.techradar.com/best/best-antivirus#best-free-antivirus-downloads",
    "Avira Free": "https://www.techradar.com/reviews/avira-2020-antivirus-solutions#section-avira-free-antivirus",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Android antivirus app": "https://www.techradar.com/best/best-android-antivirus-app",
    "iPhone antivirus apps": "https://www.techradar.com/best/best-iphone-antivirus-app"
  }
}