{
  "source": "https://www.techradar.com/news/new-echo-show-will-turn-alexa-into-mickey-mouse",
  "title": "New Echo Show stand will turn Alexa into Mickey Mouse",
  "category": "smart-home",
  "updated": "2021-09-28T16:36:04Z",
  "author": "hamish-hector",
  "summary": "Oh boy a new Echo Show 5",
  "article": [
    "Amazon has just unveiled an Echo Show 5 case that is designed to look like the iconic Disney mascot Mickey Mouse at its Amazon 2021 event. This reskinned device has been released to promote 'Hey Disney!' a new collaboration between Disney and Amazon.",
    "Hey Disney! will add over 1,000 new interactions including trivia, jokes, and greetings inspired by the Disney characters we all know and love to Echo devices. It also sounds like you'll be able to interact with some characters too including Mickey Mouse, Olaf, and Dory.",
    "The new integration will be added to Echo devices in Disney Resort hotel rooms at Walt Disney World too. Hey Disney! should help you organize your stay, find answers to your questions, and will meet your hospitality needs.",
    "This huge Disney collaboration follows on from one with Billie Eilish which was announced earlier this week. The singer will have her face printed onto an exclusive Echo Studio that's available for preorder now. We expect we'll see even more of these kinds of collaborations going forward too.",
    "The new Mickey Mouse-inspired stand for the Echo Show 5 is available for pre-order today. It's currently only available in the US and will cost $24.99. Hey Disney! will only be available to purchase in the US when it launches on the Alexa Skills store in 2022. Currently, we don't have any details on pricing, though the service will be available for free on Echo devices in Disney Resort hotel rooms at Walt Disney World."
  ],
  "headers": {},
  "links": {
    "Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5",
    "Amazon 2021 event": "https://www.techradar.com/news/everything-from-the-amazon-2020-event-new-echo-speakers-flying-ring-security-cameras-and-amazon-luna",
    "Billie Eilish": "https://www.techradar.com/news/the-billie-eilish-echo-studio-is-cool-but-its-time-for-customizable-smart-speakers",
    "Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review"
  }
}