{
  "source": "https://www.techradar.com/news/james-bond-may-become-an-amazon-exclusive-soon-heres-why",
  "title": "James Bond may become an Amazon exclusive soon – here's why",
  "category": "entertainment",
  "updated": "2021-05-18T08:59:48Z",
  "author": "tom-power",
  "summary": "No time to come to theaters?",
  "article": [
    "No Time to Die, the next entry in the James Bond series, should finally be getting released later this year.",
    "The 25th instalment in the legendary spy movie franchise will arrive almost two years after its original release date – but it looks like No Time to Die might skip theaters entirely.",
    "Why? Well, according to reports from outlets including Collider, Amazon is in talks to buy James Bond's parent company MGM in a massive $9 billion deal.",
    "As well as Collider, Deadline and The Information have also reported on Amazon potentially acquiring MGM Holdings for a similar figure.",
    "Talks between the two companies have taken place over the past week, according to all three publications, but Amazon and MGM declined to comment on the speculation. MGM has reportedly been up for sale for some time now, too, with the Wall Street Journal, in December 2020, suggesting that a deal worth $10 billion would be needed to secure MGM Holdings and its sizeable back catalog of movies of TV shows.",
    "The news comes as AT&T's WarnerMedia and Discovery are on the cusp of an eye watering $43 billion merger. WarnerMedia and Discovery's fusion is seen as a way for both companies to make a significant mark on the streaming market, and try to tempt audiences away from the likes of Netflix and Disney Plus.",
    "With this surprise merger looking likely to be ratified, it's no coincidence that Amazon is reportedly attempting to finalize its own big deal in making the legendary James Bond series exclusive to its Prime Video streaming platform.",
    "It's unclear if No Time to Die will forego a theatrical release if Amazon acquires MGM, but the smart money says that it will.",
    "In October 2020, outlets including Variety reported that MGM had discussed selling the rights to No Time to Die to Netflix and other streaming services. If Amazon did acquire MGM, it would be a very strange move on its part if it didn't keep 007's next movie exclusively on Prime Video.",
    "Sure, Amazon would likely secure some box office income if No Time to Die was released in cinemas. However, unless there's a deal in Amazon's MGM acquisition, whereby both companies would share box office revenue, we suspect that MGM would retain most, if not all, of No Time to Die's theatrical takings.",
    "Should that be the case, it would be in Amazon's business interests to only release No Time to Die on Prime Video. If James Bond's next outing was exclusive to its streaming platform, anyone interested in watching Daniel Craig's final 007 outing would need to buy a Prime Video subscription to watch it. Amazon, then, would retain all of the money obtained from new subscriptions.",
    "Amazon has been in the market for movie exclusives to bring to Prime Video, and it's had big success in the past 12 months when it's done so. Sound of Metal, Borat 2 and Coming 2 America have all drawn in big audiences as Prime Video exclusives, and even gone on to secure gongs at big award ceremonies.",
    "With the likes of The Tomorrow War, the Chris Pratt-starring sci-fi film, set to arrive exclusively on Prime Video later this year, Amazon isn't slowing down in its attempts to snap up some of the biggest upcoming movies in exclusivity deals.",
    "If Amazon does acquire MGM, the entire James Bond series would be available on Prime Video only – and that would include No Time to Die.",
    "It would be a sad day if Bond is never seen on the big screen again and show, once again, that the movie distribution landscape is shifting from theaters and into our own homes. For now, though, we wait for official confirmation about whether this deal will go ahead or not.",
    "If the deal collapses, No Time to Die will arrive in theaters on September 30 in the UK and October 8 in the US."
  ],
  "headers": {
    "7": "Analysis: will No Time to Die be exclusive to Amazon Prime Video?"
  },
  "links": {
    "Collider": "https://collider.com/amazon-buying-mgm-james-bond-studio-9-billion-deal/",
    "Deadline": "https://deadline.com/2021/05/amazon-mgm-merger-in-talks-1234758795/",
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6566397940384415000&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Famazon-pondering-deal-to-buy-mgm&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fjames-bond-may-become-an-amazon-exclusive-soon-heres-why",
    "Wall Street Journal": "https://www.wsj.com/articles/mgm-holdings-studio-behind-james-bond-explores-a-sale-11608588732",
    "Variety": "https://variety.com/2020/film/news/no-time-to-die-james-bond-mgm-streaming-sale-1234819582/",
    "Sound of Metal": "https://www.techradar.com/news/how-to-watch-sound-of-metal-online-stream-the-award-winning-movie-from-anywhere",
    "Borat 2": "https://www.techradar.com/news/how-to-watch-borat-2-online-stream-borats-subsequent-moviefilm-anywhere",
    "Coming 2 America": "https://www.techradar.com/news/how-to-watch-coming-2-america-online-stream-eddie-murphy-sequel-anywhere",
    "The Tomorrow War": "https://www.techradar.com/news/heres-your-first-look-at-amazon-prime-videos-next-big-movie-starring-chris-pratt"
  }
}