{
  "source": "https://www.techradar.com/news/lg-could-reveal-a-flexible-monitor-at-ces-2021-with-movie-and-gaming-modes",
  "title": "LG could reveal a flexible monitor at CES 2021, with movie and gaming modes",
  "category": "computing",
  "updated": "2021-01-03T11:39:16Z",
  "author": "cat-ellis",
  "summary": "The future is flexible",
  "article": [
    "LG could debut a new bendable gaming monitor at CES 2021, with a screen that can change from flat to curved at the touch of a button.",
    "Foldable phones are gradually becoming more popular, and we've seen some exciting developments in the field of rollable and foldable TVs that can be tucked away when not in use, so it's no surprise to see the same tech employed in gaming monitors as well, providing a practical way to reduce the number of screens necessary in your home.",
    "Engadget reports that the \"Bendable CSO (Cinematic Sound OLED) display\" will be a 48in 4K monitor with a flat mode for watching TV and movies, and a curved option for gaming.",
    "It wouldn't be the company's first foray into shapeshifting screens - its first commercially available rollable TV is now on sale in South Korea, and at CES 2020 it debuted plans for a display that pulls down from the ceiling like projector screen. What's different here is the Cinematic Sound feature, which effectively turns the whole panel into a speaker.",
    "At this point LG's bendable monitor will only be a demo model, and if it sees mainstream release such a design will undoubtedly carry a hefty price tag. The LG rollable OLED launched at ₩100,000,000 in South Korea, and $87,000 in the US – which converts to around £67,000 / AU$123,000. However, the relatively limited range of movement compared to a folding phone or rollable TV should mean it's more durable – and if it can replace your TV, gaming monitor and soundbar, it's definitely one to watch.",
    "This year's CES will take place entirely online from January 11-14. Rather than pouring into the Las Vegas Convention Center, as in previous years, the world's biggest tech companies will be demonstrating their wares in virtual events. TechRadar will be bringing you all the hottest news as soon as it lands, so bookmark our show guide and stay tuned to make sure you don't miss anything."
  ],
  "headers": {
    "4": "Bend me, shape me"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "rollable and foldable TVs": "https://www.techradar.com/news/rollable-and-foldable-oled-tvs-are-the-future-heres-why",
    "Engadget": "https://www.engadget.com/lg-display-bendable-oled-gaming-monitor-ces-2021-020039012.html",
    "its first commercially available rollable TV": "https://www.techradar.com/news/lgs-rollable-oled-tv-gets-a-final-price-tag-but-would-you-buy-it",
    "a display that pulls down from the ceiling": "https://www.theverge.com/2020/1/2/21046294/lg-rollable-tv-ceiling-48-inch-oled-airplane-car-oled-displays",
    "bookmark our show guide": "https://www.techradar.com/news/ces-2021-highlights"
  }
}