{
  "source": "https://www.techradar.com/news/algae-mushrooms-and-liquid-immersion-microsofts-eccentric-plan-to-make-its-data-centers-green",
  "title": "Algae, mushrooms and liquid immersion: Microsoft’s eccentric plan to make its data centers green",
  "category": "computing",
  "updated": "2021-10-28T12:06:04Z",
  "author": "joel-khalili",
  "summary": "Microsoft is exploring innovative ways to cut carbon emissions and minimize water usage",
  "article": [
    "Microsoft has published new information about its efforts to make its cloud data centers more energy-efficient and less water-hungry.",
    "The company is embarking on various research projects, all with the goal of becoming carbon neutral by 2030 and offsetting all historic emissions by 2050. In addition, Microsoft has now committed to reducing data center water consumption by 95% by 2024.",
    "Detailed in a blog post, these projects each target different opportunities across the data center operation - from construction and performance optimization to cooling and energy usage - and are designed to help Microsoft juggle its sustainability responsibilities and the need to keep pace with the steep rise in demand.",
    "“Customers already benefit from the cloud’s ability to provide massive efficiency that reduces the collective carbon footprint required to support the world’s compute needs,” wrote Noelle Walsh, Corporate VP Cloud Operations & Infrastructure at Microsoft.",
    "“Even so, the increasing demand for cloud leads to increasing demand for data centers, which require land and water to operate. We - and the cloud industry - face an important challenge as a result: scaling our computing power to progress digital economies, research and inclusive economic opportunities - while also helping to preserve the only planet we have.”",
    "Although Microsoft has many different irons in the fire, the most eye-catching sustainability projects include a drive towards waterless cooling and an exploration of natural building materials that could pave the way to carbon-positive data center architecture.",
    "Earlier this year, the company revealed it was experimenting with a new method of cooling server racks, by submerging them in a special non-conductive liquid, thereby eliminating the need for traditional evaporative cooling.",
    "The results were promising and now the firm is testing whether this same technique could be used to boost the performance of server chips too. Early results suggest that some chipsets can be overclocked to more than 20% above their normal performance level using liquid immersion cooling.",
    "In addition to slashing the amount of water consumed by data centers, immersion also creates opportunities in rack design. By packing a greater number of servers into a smaller space, and boosting the performance of individual chipsets, Microsoft could improve the efficiency of its datacenters per square foot, or otherwise build smaller premises in more strategic locations.",
    "Separately, Microsoft also published research with the Carbon Leadership Forum, a sustainability non-profit, that assesses the efficacy of various low-carbon building materials, including algae-grown bricks/panels and structural tubes made from mycelium (mushroom).",
    "“The potential for meaningful climate impact through materials that serve as carbon sinks now gives such materials a clear advantage, with the potential to reverse the climate profile of buildings from a leading driver of carbon emissions to carbon reservoirs that can help reverse it,” the report states.",
    "The authors go on to assert that materials of this kind warrant significant investment to “accelerate their scaling, manufacturing and marketable use in the building industry supply chain.”",
    "It remains to be seen which of these schemes will be put into action at scale, but Microsoft cannot be accused of failing to explore its options.",
    "Here are our lists of the best bare-metal hosting, best dedicated server hosting and best CDN providers out there."
  ],
  "headers": {
    "3": "\"Massive efficiency\"",
    "5": "Microsoft datacenter innovation"
  },
  "links": {
    "cloud": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1285021960505699300&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fblog%2F2021%2F10%2F27%2Fsupporting-our-customers-on-the-path-to-net-zero-the-microsoft-cloud-and-decarbonization%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Falgae-mushrooms-and-liquid-immersion-microsofts-eccentric-plan-to-make-its-data-centers-green",
    "wrote": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7498597303089657000&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fblog%2F2021%2F10%2F27%2Fsupporting-our-customers-on-the-path-to-net-zero-the-microsoft-cloud-and-decarbonization%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Falgae-mushrooms-and-liquid-immersion-microsofts-eccentric-plan-to-make-its-data-centers-green",
    "the company revealed": "https://www.techradar.com/news/microsoft-is-drenching-its-azure-servers-to-boost-performance",
    "the report": "https://carbonleadershipforum.org/transformative-materials/",
    "best bare-metal hosting": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "best dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "best CDN providers": "https://www.techradar.com/news/best-cdn-providers"
  }
}