{
  "source": "https://www.techradar.com/news/nintendo-switch-deals-offer-rare-discounts-on-joy-con-controllers-this-weekend",
  "title": "Nintendo Switch deals offer rare discounts on Joy-Con controllers this weekend",
  "category": "gaming",
  "updated": "2021-02-20T19:15:54Z",
  "author": "tabitha-baker",
  "summary": "Save $10 on Joy-Cons at Amazon",
  "article": [
    "Nintendo Switch deals don't hit the Joy-Con controllers too often. For one, Nintendo is loathe to discount its more successful accessories and games and plus there's so much tech packed inside these controllers there's very little wiggle room on that MSRP anyway.",
    "However, Amazon has just doubled down on its Nintendo Switch deals this weekend and we're seeing prices on these Joy-Con pairs dropping all the way down to $69 right now (you'll need to add them to your cart to see the final reductions). That's from a starting price of $79.99, and an MSRP that rarely shifts - making this an excellent opportunity to grab two extra controllers for a fantastic price.",
    "Plus, we've only seen offers like this on Black Friday over the last few months so if you missed out during the sales frenzy last year you've got another chance to secure yourself a bargain in this weekend's Nintendo Switch deals.",
    "Not in the US? Scroll down for more Nintendo Switch Joy-Con deals in your region.",
    "We're also rounding up all the latest cheap Nintendo Switch game deals right here on TechRadar, and all the latest Pro Controller prices for a more traditional experience as well. If you're looking to go handheld, though, you'll find plenty of Nintendo Switch Lite bundles up for grabs as well."
  ],
  "headers": {
    "4": "More Nintendo Switch Joy-Con deals"
  },
  "links": {
    "dropping all the way down to $69 right now": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB01N6QJ58Y%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1381413145688276700-20",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Nintendo Switch deals": "https://www.techradar.com/news/nintendo-switch-deals",
    "Nintendo Switch Joy-Con deals": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "cheap Nintendo Switch game deals": "https://www.techradar.com/deals/cheap-nintendo-switch-game-deals-sales",
    "Pro Controller prices": "https://www.techradar.com/deals/nintendo-switch-pro-controller-price-sales-cheap",
    "Nintendo Switch Lite bundles": "https://www.techradar.com/deals/cheap-nintendo-switch-lite-prices-bundle-deals"
  }
}