{
  "source": "https://www.techradar.com/news/lg-debuts-a-sleek-new-lineup-of-ultra-light-gram-laptops-for-2021",
  "title": "LG debuts a sleek new lineup of ultra-light Gram laptops for 2021",
  "category": "news",
  "updated": "2021-01-07T04:31:17Z",
  "author": "harry-domanski",
  "summary": "New range boasts 16:10 displays and impressive battery life",
  "article": [
    "At this year's first ever all-virtual edition of the CES tech trade show, tech giant LG has shown off a refreshed lineup of its ultra-lightweight Gram laptops, featuring an array of five different models.",
    "The new LG Gram models all pack in 16:10 displays (an aspect ratio only previously found on the flagship 17-inch unit) and are promising solid performance and battery life in an ultra portable chassis. Here's what's set to be available, although we'd note that the actual model selection will vary by territory:",
    "As may be clear, the 2-in-1 version of the laptop is available with either a 14-inch or 16-inch chassis, while the regular laptop variant also adds the option of a 17-incher.",
    "All models are kitted out with 11th-gen Intel Core CPUs with integrated Iris Xe graphics, and the choice of either 8GB or 16GB of RAM. As is to be expected, the 2-in-1 models feature touch displays and 360-degree hinges for a truly convertible experience.",
    "The displays of the 17- and 16-inch models pack a resolution of 2,560 x 1,600, while the two 14-inch units pack in 1,920 x 1,200 displays, and all have a screen-to-body ratio of 90%.",
    "Similarly, the larger three models feature a 80Wh battery, while the smaller pair have a marginally slimmer 72Wh battery, although LG claims that all units are capable of being powered for 19.5 hours.",
    "Apart from the 16:10 displays, one of the key features of LG's new laptops are their immense portability. The flagship 17-inch Gram 17 comes in at just 1.35kg (2.98lbs) and is only 17.8mm (07 inches) thick, which is astoundingly light and thin for such a large display.",
    "The 16-inch and 14-inch models weigh in at 1.19kg (2.62lbs) and 999g (2.2lbs) respectively, the latter just slipping under the 1kg mark, and are both 16.8mm (0.66 inches) thick.",
    "As for the 2-in-1 models, these weigh 1.48kg (3.26lbs) for the 16-inch unit and 1.25kg (2.76lbs) for the 14-inch, and measure 16.95mm (0.67 inches) and 16.75mm (0.66 inches) thick respectively.",
    "LG hasn’t yet announced any pricing or release dates, but stay tuned to learn more."
  ],
  "headers": {
    "6": "Lightweight machines"
  },
  "links": {
    "all-virtual edition of the CES": "https://www.techradar.com/news/ces-2021-highlights"
  }
}