{
  "source": "https://www.techradar.com/news/should-i-buy-a-projector-screen",
  "title": "Should I buy a projector screen?",
  "category": "televisions",
  "updated": "2021-10-01T11:17:00Z",
  "author": "stephen-withers",
  "summary": "A projector screen will get the most out of your beamer’s large-scale images – but is there a catch?",
  "article": [
    "Why buy a projector screen? A white wall will certainly do the job for most 4K projectors, but if you want to get the most out of your beamer you should probably invest in a dedicated screen, whether for the indoors or an outdoor projector.",
    "Even a simple fixed white vinyl number will pay dividends, and won’t break the bank – and while electric screens can be kept out of sight, acoustically transparent models help to hide speakers too, while ambient light rejecting material can mitigate bright rooms.",
    "If you're new to the world of projectors, though, you may not know where to start with buying a projector screen, and how urgent a purchase it really is.",
    "A projector screen is simply a dedicated surface onto which you beam images. You can buy fixed, pull-down or electric screens, there are different shapes and sizes, and a multitude of materials, but ultimately the idea is to maximise your projector’s performance beyond what a basic wall can do.",
    "Well, you could just point your projector at the wall, and as long as it’s flat, smooth and matte white, this approach can be surprisingly effective. If you have a cheap projector that you occasionally get out for the big game or movie night, then a white wall is all you need.",
    "However if you’ve bought a more expensive projector, and you’ve installed it on a permanent basis, you really should be investing in a screen. This will immediately result in improved geometry, increased perceived detail and a better contrast performance.",
    "There are essentially three types of projector screen: manual, electric, and fixed frame.",
    "A manual screen is simply pulled up or down when needed. It’s easy to install on the floor or ceiling, is retracted when not in use, and is usually cheap. But unless it is tensioned (held taught) at the sides, any undulations on the screen’s surface will drive you nuts, especially with sports where the camera constantly moves from side-to-side.",
    "An electric screen is more expensive and trickier to install, but if the screen and your projector both support 12V triggers, it can automatically come up or down when you turn the beamer on. It also doesn’t take up much space but, as with manual screens, it needs to be tensioned at the sides for a flat and even surface area.",
    "A fixed frame screen will usually deliver the best results, and it doesn’t need to be massively expensive either. It’s also easy to install: you just assemble the frame, attach the screen material and hang it on the wall. It obviously takes up a lot more space, and might look out of place in a lounge, but if you’re putting together a dedicated room this is the obvious choice.",
    "Whether you go for a fixed frame, electric or pull-down projection screen, the most important component is the material it’s made from. The simplest and cheapest material is white vinyl, and in a room with good light control this should be fine.",
    "However, in a room where there are reflections from the walls or ceiling, an ambient light rejecting (ALR) screen is best. Reflected light will wash out the blacks and ruin the contrast ratio, so this type of material is designed to bounce the reflected light away from the viewer, thus drastically improving the perceived blacks and overall contrast.",
    "ALR screens often appear gray, and are sometimes referred to as ‘negative gain’ screens. The gain of a screen relates to how reflective it is, and a gain of one just means the screen reflects back the light that hits it with no changes. So a negative gain screen reflects less light directly back to the viewer, but also reflects ambient light away from the viewer.",
    "Conversely a high gain screen, which has a gain of more than one, uses tiny reflective beads on its surface to angle the light back towards the viewer, making the image appear brighter. It isn’t actually brighter, but this type of screen can be very useful with dimmer projectors. The only downside is when sat off-centre you can see brighter patches in the image called ‘hot spots’.",
    "If you want to replicate the cinema experience, you could consider an acoustically transparent material. This uses either perforations or a weave to allow the front speakers to be placed behind the screen without affecting the sound quality. These screens tend to have a low gain because of the tiny holes, and be careful they don’t adversely interact with the pixels of the projected image.",
    "There is one other factor to consider when deciding on a projector screen, and that’s the aspect ratio. For modern TV broadcasts the aspect ratio is 1.78:1, and if you’re planning on using your projector for catching up on your favourite show, watching the big match or playing games, then a 1.78:1 screen makes perfect sense.",
    "Things get a little more complicated with movies, which use either a 1.85:1 or 2.35:1 aspect ratio. So if movies are your primary interest, then you could consider a 2.35:1 ‘scope’ ratio screen, and zoom the image out on widescreen films to fill the screen. You can do this manually, but if your projector has a lens memory you can change the aspect ratio at the press of a button.",
    "If you decide to go the 2.35:1 route, you might also consider side masking for 1.85:1 movies or 1.78:1 TV and games – when you cover or include portions of a screen to temporarily adjust its aspect ratio. This side masking can take the form of magnetic panels you manually attach, or motorised masking that automatically moves into place when needed. One thing’s for sure, nothing says cinema like a big scope ratio screen.",
    "For what is a decidedly niche market, there are a surprisingly large number of projector screen manufacturers. The US companies tend to dominate, with Stewart and Da-Lite perhaps being the best known. Other popular manufacturers include Draper, Screen Excellence, Elite Screens, and Seymour.",
    "Over in Europe there’s also DNP of Denmark and Spitfire in the UK. All these manufacturers offer pull down, electric and fixed screens in various aspect ratios and using a multitude of screen materials, plus there are accessories for side masking and the like.",
    "The cost of a projector screen is obviously going to depend on the type of screen, the size, the aspect ratio, and the material used. The dominant players can be very expensive, but the smaller manufacturers like Seymour and Spitfire are often more affordable. As a general rule a simple vinyl screen can cost a few hundred dollars, but with more exotic materials you can quickly see the price jump into the thousands."
  ],
  "headers": {
    "3": "What are projector screens?",
    "4": "Why do I need a projector screen?",
    "6": "What are the different types of projector screens?",
    "10": "What are projector screens made of?",
    "15": "What is the best aspect ratio for a projector screen?",
    "18": "Who makes projector screens?",
    "20": "How much do projector screens cost?"
  },
  "links": {
    "4K projectors": "https://www.techradar.com/best/4k-projector",
    "outdoor projector": "https://www.techradar.com/best/outdoor-projector"
  }
}