{
  "source": "https://www.techradar.com/news/how-do-video-doorbells-work",
  "title": "How do video doorbells work?",
  "category": "smart-home",
  "updated": "2021-05-24T09:53:31Z",
  "author": "carrie-ann-skinner",
  "summary": "How you can answer the door with a video doorbell, even if you’re not at home",
  "article": [
    "Are you constantly missing deliveries because you’re out? Or maybe you’re fed up of being caught out by cold callers, and want a way of checking who’s at the door before you open it? You’ve probably heard that the best video doorbells are a handy solution, letting you converse with anyone on your doorstep from your smartphone.",
    "However, if you’re not entirely sure how these handy smart home gadgets actually work, we’ll explain exactly how video doorbells work, where they store the video they record and how they can be integrated with the best smart home devices to automate your home.",
    "Want to get your hands on a video doorbell now? Check out these great deals for some of the best on the market, although we might some big deals also appear whenever Prime Day 2021 rolls around:",
    "As well as letting you see and speak to whoever’s on your threshold if the doorbell is pressed (thanks to a built-in camera, microphone and speaker) smart doorbells will also act in the same way as the best home security cameras.",
    "They’ll alert you if motion is detected in its field of view, so you’ll know if there’s any unwanted visitors to your property. They’ll even store the footage so you can go back and review it at a later date, providing peace of mind that your home is safe if you’re away for a few days or weeks.",
    "Video doorbells have surged in popularity over the past four years, with one in four homes in the US owning one, according to research firm Strategy Analytics, and it’s not surprising as they really do make life a little easier.",
    "Some are battery powered and can be installed with very little DIY expertise, such as the Ring Video Doorbell 3 Plus, while others, like the Arlo Video Doorbell are designed to replace an existing wired doorbell, and may require professional installation.",
    "Some video doorbells even use artificial intelligence (AI )to identify whether it’s a person, animal or vehicle they’ve detected to prevent you getting notified every time a bush mildly wobbles in the wind.",
    "It’s worth keeping in mind though, that most video doorbells require a monthly subscription to get the most out of them. This enables you to review footage after it’s happened, as well as access the smart features and functions designed to reduce unwanted alerts such as setting activity zones so you’re only alerted about motion in these areas of the camera’s field of view.",
    "Video doorbells work in the same way as the best home security cameras; by using Wi-Fi to send a notification to your phone whenever motion is detected in the doorbell’s field of view, or the doorbell itself is pressed.",
    "If you receive a notification, or you just want to see what’s happening at your home, you can use the companion app on your smartphone or table (or get a dedicated smart display) to log in to the doorbell’s camera and see who’s on your doorstep.",
    "The doorbell’s built-in speaker and microphone allow you to converse with anyone in the camera’s field of view too.",
    "Video doorbells also store the footage recorded when motion is detected or the doorbell is pressed so it can be reviewed back at a later date. This is handy if you couldn’t answer the alert at the time it arrived, but want to see who the caller was.",
    "However, as we’ve already mentioned for many video doorbells, this does require a monthly subscription, which starts from $2.99 / £2.49 / AU$4.49 .",
    "The Eufy Video Doorbell 2K is one of the few smart doorbells that doesn’t need a subscription, instead up to 16GB of video - around two week’s worth - can be stored on the bundled base station, so there’s no on-going cost.",
    "Unwanted notifications about motion that turn about to be birds, the wind rustling through trees or pedestrians on the pavement can be frustrating, so many video doorbells also offer handy features to reduce these nuisance alerts; for example activity zones so you’re only alerted when motion is detected in these areas and AI that can identify whether an animal, vehicle or person caused the alert too.",
    "Most video doorbells also offer integration with Amazon Alexa, Google Assistant or HomeKit, so they can be set to work with your smart speakers and smart displays; making a sound when the doorbell is pressed and letting you converse with whoever is on your doorstep.",
    "In the case of smart displays, they can be used to view the doorbell’s feed too. Not all video doorbells work with all voice assistants, however, so make sure you check it will work with your current kit before you buy.",
    "The video doorbell market is a crowded one with big names in home security including Ring, and Arlo competing alongside the likes of Google and Eufy. Some brands even offer a choice of models to choose from. We’ve rounded up out pick from each of the big hitters to help you choose.",
    "Like any item on the exterior of your property, there is a small possibility it could be stolen. Most video doorbells require screwing to the exterior of your property, so it certainly won’t be an easy task for them to be removed, but it could happen.",
    "Ring video doorbells come with a security screw, which can only be removed by a unique type of screwdriver (included in the box) that can deter thieves. Ring also promises to replace any of its video doorbells that are stolen providing you contact them within 30 days of theft and provide the police report."
  ],
  "headers": {
    "9": "How do video doorbells work?",
    "18": "Which are the best video doorbells?",
    "19": "Do video doorbells get stolen?"
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Strategy Analytics": "https://news.strategyanalytics.com/press-releases/press-release-details/2020/Strategy-Analytics-One-in-Four-Smart-Homes-Have-a-Video-Doorbell/default.aspx",
    "Ring Video Doorbell 3 Plus": "https://www.techradar.com/reviews/ring-video-doorbell-3-plus-review",
    "Arlo Video Doorbell": "https://www.techradar.com/reviews/arlo-video-doorbell-review",
    "Eufy Video Doorbell 2K": "https://www.techradar.com/reviews/eufy-video-doorbell-2k-wireless",
    "replace any of its video doorbells that are stolen": "https://support.ring.com/hc/en-gb/articles/115003475783-What-to-do-if-Your-Ring-Device-is-Stolen"
  }
}