{
  "source": "https://www.techradar.com/news/save-dollar10-on-the-xbox-wireless-controller-this-weekend",
  "title": "Save $10 on the Xbox Wireless Controller this weekend",
  "category": "gaming",
  "updated": "2021-03-06T14:20:32Z",
  "author": "tabitha-baker",
  "summary": "Microsoft discounts its next-gen gamepad",
  "article": [
    "The Xbox Wireless Controller has only seen a couple of discounts since its release alongside the Xbox Series X and Series S. However, if you missed out on those offers around launch day you've got another chance to secure a cheap Xbox controller for a great price.",
    "This weekend Microsoft has discounted its white Xbox Wireless Controller by $10, leaving us with an excellent $49.99 final price. That's an excellent saving that offers up a return to the lowest price we've seen yet.",
    "While Microsoft didn't reinvent its controller too much, you'll find a more rounded bumper, a new D-Pad design that makes diagonal movement a lot more intuitive, device memory allowing you to switch between Bluetooth connections seamlessly, and lower latency as well. Plus, you'll be able to use the Xbox Wireless Controller across each Xbox console, including Xbox One and Xbox One X.",
    "Not in the US? Scroll down for more cheap Xbox controllers in your region.",
    "If you're yet to get your hands on a new console, we're tracking all the latest Xbox Series X restocks and showing you where to buy Xbox Series S. However, if you're all kitted out already you can also save on the Xbox Game Pass Ultimate price as well. We're also rounding up all the best Xbox Live Gold deals for some online multiplayer this weekend."
  ],
  "headers": {
    "4": "More Xbox controller deals"
  },
  "links": {
    "by $10, leaving us with an excellent $49.99 final price": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1412246697804014600&murl=https%3A%2F%2Fwww.xbox.com%2Fen-us%2Faccessories%2Fcontrollers%2Fxbox-wireless-controller%23",
    "cheap Xbox controllers": "https://www.techradar.com/news/xbox-one-controller-deals-cheap-xbox-wireless-gamepad-prices",
    "Xbox Series X restocks": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "where to buy Xbox Series S": "https://www.techradar.com/news/xbox-series-s-price-pre-order-specs-live-now",
    "Xbox Game Pass Ultimate price": "https://www.techradar.com/deals/cheapest-xbox-game-pass-deals-prices",
    "best Xbox Live Gold deals": "https://www.techradar.com/news/xbox-live-gold-deals"
  }
}