{
  "source": "https://www.techradar.com/news/rtx-3080-prices-might-start-dropping-following-bitcoin-bust-says-nvidia-partner",
  "title": "RTX 3080 prices might start dropping following Bitcoin bust, says Nvidia partner",
  "category": "computing",
  "updated": "2021-06-16T21:42:58Z",
  "author": "john-loeffler",
  "summary": "Is this the beginning of the end of our GPU stock woes?",
  "article": [
    "The cryptocurrency bust last month did more than just slash the price of Bitcoin by tens of thousands of dollars, it also led to the sinking of GPU demand in China, helping lower the prices of graphics cards for the rest of us.",
    "Nvidia board partner ASRock reports that it expects its graphics card sales to continue to grow rapidly this year, according to Digitimes, despite what it says is flagging demand in China for the latest Nvidia Ampere and AMD Big Navi graphics cards and a resulting decline in graphics card prices.",
    "China recently extended its ban on cryptomining in the country and has cracked down hard on cryptocurrencies in general, directing financial institutions and payment processors in the country to stop processing transactions involving cryptocurrencies.",
    "China accounts for about 65% of the entire planet's Bitcoin mining capacity, so China's aggressive moves on crypto is going to have an outsized impact on the demand for the high-end graphics cards needed to mine cryptocurrencies.",
    "That impact is sorely needed, as earlier this week, an analysis of global graphics card sales for Q1 2021 indicates that as many as 25% of all graphics card sold in that quarter were sold to cryptominers.",
    "ASRock, meanwhile, said this week that its Q1 net profit increased 167% year-over-year, driven in large part by graphics card sales. Tom's Hardware notes that this made Q1 2021 ASRock's most profitable quarter ever, despite underperformance in its motherboard division owing to the ongoing semiconductor shortage.",
    "Graphics card sales are expected to make up 20% of the company's sales in Q2 2021, with motherboard sales making up 50%. The company also reports that it expects AMD's graphics card shipments to pick up in the second half of the year after AMD made capacity adjustments and other supply chain improvements.",
    "While we sincerely wished that Elon Musk's Bitcoin antics last month would collapse cryptocurrency prices and free up graphics card stock for something other than making carbon emissions out of math, we honestly didn't dare to hope that it would actually happen – and especially not this soon.",
    "Obviously, China's recent announcements were much more consequential than anything Elon Musk could have said, but we can definitely see a potential sea change in Tesla's stance toward Bitcoin (at least as far as graphics card availability is concerned). If ASRock's numbers and projections pan out in the months ahead, we could really start to see some relief from the dearth of middle-to-high-end graphics card stock we've all been enduring for nearly a year now.",
    "And while AMD's adjusted capacity and supply chain boost are great news for those hoping to get a new graphics card sometime before the launch of the RTX 4000-series, we are much more excited to hear about the slumping demand from cryptominers.",
    "This week's report that cryptominers bought up 700,000 graphics cards in the first three months of this year alone, is absolutely shocking – and there is definitely some schadenfreude in knowing that those cards were bought at a major premium just before the price of major cryptocurrencies tanked. But that's pretty cold comfort if you've been desperately trying to get your hands on the latest graphics cards from Nvidia and AMD.",
    "More than anything, this report tells us that crypto seriously needs an extended time out, both for the broader consumer market and for the health of the climate. If ASRock is right, cryptominers are doing exactly that, and that's the best news we've heard in months."
  ],
  "headers": {
    "7": "Thanks Elon: is the end of the Great Graphics Card Crisis of 2021 in sight?"
  },
  "links": {
    "Digitimes": "https://www.digitimes.com/news/a20210616PD208.html",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "AMD Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "extended its ban on cryptomining": "https://www.cnbc.com/2021/05/26/major-china-bitcoin-mining-hub-lays-out-harsher-crackdown-measures.html",
    "stop processing transactions involving cryptocurrencies": "https://www.cnbc.com/2021/05/18/china-bans-financial-payment-institutions-from-cryptocurrency-business.html",
    "25% of all graphics card sold": "https://www.techradar.com/news/cant-buy-a-new-gpu-blame-cryptominers-who-bought-25-of-them",
    "Tom's Hardware": "https://www.tomshardware.com/news/asrock-says-china-crypto-demand-waning-gpu-prices-dropping-report",
    "collapse cryptocurrency prices and free up graphics card stock": "https://www.techradar.com/news/heres-hoping-elon-musk-tanks-crypto-so-miners-will-leave-our-rtx-3080s-alone",
    "desperately trying to get your hands on": "https://www.techradar.com/news/life-in-the-queue-meet-the-gamers-camping-out-for-an-rtx-3080-ti-across-the-us"
  }
}