{
  "source": "https://www.techradar.com/news/the-canon-eos-r3-is-the-f1-car-of-mirrorless-cameras-but-its-still-in-sonys-slipstream",
  "title": "The Canon EOS R3 is the F1 car of mirrorless cameras, but it’s still in Sony’s slipstream",
  "category": "cameras",
  "updated": "2021-09-14T14:50:57Z",
  "author": "mark-wilson",
  "summary": "The EOS R3 is the fastest of fast followers",
  "article": [
    "The Canon EOS R3 has finally been released from the garage where it’s been hiding for the last six months – and the specs confirm that it’s the powerful, speedy F1 car of mirrorless cameras.",
    "But this shiny showcase of Canon’s latest camera tech, as impressive as it is, also shows that Canon is still playing catch-up with its main rival in the manufacturer’s championship: Sony.",
    "Sony’s engineers have been tinkering away in the mirrorless game for far longer than Canon. And this experience, combined with its vast R&D power, mean that in the key professional areas – sensors, EVFs, video, even next-gen hot-shoes – its cameras have already pioneered much of the tech seen in the EOS R3.",
    "What Sony’s cameras haven’t yet done is pack all that goodness into a DSLR-style body that pro sports and wildlife shooters will take to like Lewis Hamilton on a Go Kart – and that’s where the Canon EOS R3 really shines.",
    "It doesn’t just sit in between the Canon EOS R5 and Canon 1D X Mark III – it melds the best of both cameras into what is unquestionably one of the best professional cameras around. But while features like a new stacked sensor make it a tech pioneer in Canon’s stable, it’s still a catch-up play rather than a spectacular overtaking maneuver.",
    "In many ways, the Canon EOS R3 is the most perfectly evolved camera for pro sports and wildlife photographers ever made.",
    "It’s supremely fast (as fast as the Sony A1, on paper, thanks to that 30fps raw burst shooting mode) and comes in a form factor that was forged in a time when Sony's E-mount still had its L-plates.",
    "But its advantages over cameras like the Sony A1 and the Sony A9 II stem more from its heritage than its trailblazing camera tech. The big tech story is that the EOS R3 is the first Canon camera to have a stacked full-frame sensor, which delivers the read-out speeds needed to pull off ludicrous feats like that 30fps raw burst mode.",
    "Yet it's Sony that has been the pioneer here and it's been honing its stacked full-frame sensors for well over two years. This is why it was able to come out of nowhere, with one of the best-kept secrets in the whole of consumer tech, with the Sony A1 in January this year.",
    "That camera is the kind of uncompromising all-rounder we’ve never seen before, even if that approach ironically leads to some compromises on the practicality front (like its price tag, for example). But it's undoubtedly a trump card that has stolen some of the Canon EOS R3's thunder.",
    "Sony hasn't just established a tech lead in sensors, either. An interesting feature of the Canon EOS R3 is that it has the same electronic viewfinder (EVF) specs as the all-rounder Canon EOS R5. No big deal, on the face of it, as the EOS R5's EVF is an excellent 5.76-million dot OLED affair with a 120fps refresh rate, which our review could \"barely distinguish from the true optical viewfinders found in traditional DSLRs\".",
    "Yet the Sony A1 already pushed professional EVFs to the next level back in January with an incredible 9.44-million pixel viewfinder with a 240fps refresh rate. That refresh rate is particularly important for shooting sports and wildlife shooting, because it affects how smooth motion appears in the viewfinder.",
    "Interestingly, a teardown of the Canon EOS R5 last year appeared to reveal that its viewfinder – the same as the one in the Canon EOS R3 – is a Sony-made module. Does that explain why Canon wasn't able to match the Sony A1's EVF on its pro mirrorless sports camera? Possibly, but either way the viewfinder is a crucial feature for sports photographers, particularly those switching from DSLRs. And like sensors, Sony is out in front here, on paper at least.",
    "As Canon told us back in January 2020, when it comes to viewfinders, mirrorless cameras \"can never be as fast as a DSLR\", because a DSLR's optical viewfinder works at the speed of light. Canon has added an 'OVF simulation' mode to the EOS R3, which lets you see outside of the frame to anticipate action, to help ease the transition for DSLR users. But there's no doubt Sony still has ownership of the high bar when it comes to mirrorless EVFs.",
    "Of course, being first with new technologies doesn't always result in better cameras, and the Canon certainly isn't playing catch-up in all areas with the EOS R3.",
    "No camera in history has given you more control over your autofocus. The EOS R3 combines a touchscreen, traditional knurled AF joysticks, the speedy Smart Controller from the 1D X Mark III (think an upside-down computer mouse), and Canon's new incarnation of its Eye Control AF system.",
    "The latter is unique to Canon and tracks the movement of your eye to move the autofocus point to wherever you're looking. It certainly brings practical advantages for acquiring focus, but there are also quite a few calibration hoops to jump through (both for your eye and the local lighting conditions) and it also might not work so well for those wearing glasses or contact lenses.",
    "Canon has also largely caught up with Sony when it comes to tracking autofocus tech too, with the EOS R3 refining the algorithms for its People and Animal AF and also adding a new one for Vehicles. While we have seen the latter before on the Olympus OM-D E-M1X, the EOS R3's mode is impressively advanced, even allowing you to choose whether to prioritize the driver's helmet (in open-top vehicles like F1 cars) or the vehicle itself for focus.",
    "The EOS R3 is also arguably now the mirrorless leader when it comes to weather-sealing. While the Sony A1 does claim to offer 'improved' weather-sealing from its other mirrorless cameras, the EOS R3 matches the sealing of the tough 1D X Mark III DSLR. Canon is also out in front when it comes to in-body image stabilization, which is handy for both preserving handheld image quality and video. With compatible lenses, you'll get up to eight stops of stabilization on the EOS R3, which is class-leading on paper.",
    "But despite the Canon EOS R3's impressive roll call of features, Sony is still arguably the tech leader in the really key areas. The EOS R3 does break free of Canon's traditional video recording limits (claiming to be able to keep shooting in standard frame-rates for six hours) and its ability to shoot 6K raw video internally is impressive.",
    "Yet with cameras like the Sony A1 and Sony A7S III (not to mention the Sony Airpeak drone), its rival continues to set the standard for pro video shooters – and further competition is en route from the 8K-shooting Nikon Z9. Given the EOS R5's early issues with overheating, we're also looking forward to seeing how the EOS R3 fares in this department.",
    "Sony's headstart in mirrorless cameras also continues to give it a slight edge on lenses, depending on what you like to shoot. The Canon RF system is now impressively mature, even if only half of them are currently available to buy – and today's announcement of the Canon RF 100-400mm f/5.6-8 IS USM and Canon RF 16mm f/2.8 STM has served up some affordable options for non-professionals.",
    "The five-year lead Sony had on making mirrorless camera lenses, though, along with its wide third-party support from the likes of Sigma, Tamron and Zeiss, has given its E-mount system an unrivaled amount of variety at all price points, along with compelling specialist options like the Sony FE 135mm f/1.8 G Master lens and other 'G Master' primes.",
    "None of this means that the Canon EOS R3 isn't an incredible camera – it offers a unique combination of retro, DSLR-style handling and staggering mirrorless power. And we may yet see a Canon EOS R1 take an unexpected leap forward in the same vein as the Sony A1.",
    "But the EOS R3 does also show that Sony continues to be a step ahead in the most important areas of full-frame tech, including stacked sensors, burst shooting, viewfinders, multi-function hot-shoes and (to a lesser extent) lens choice.",
    "The great thing for camera fans is that Canon has just shown that it's perfectly capable of staying with its main rival. Like an F1 car in camera form (and also one whose autofocus can track F1 cars) the Canon EOS R3 is the fastest of fast followers, and the ultimate winners will be photographers and filmmakers."
  ],
  "headers": {
    "5": "Action stacked",
    "10": "Panoramic view",
    "14": "Renewed focus",
    "19": "Grand master",
    "23": "Race to the prize"
  },
  "links": {
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Canon 1D X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "best professional cameras": "https://www.techradar.com/best/best-professional-camera",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Sony A9 II": "https://www.techradar.com/reviews/sony-alpha-a9-ii",
    "teardown of the Canon EOS R5": "https://www.sonyalpharumors.com/curiosity-canon-eos-r5-uses-a-sony-made-evf/",
    "Olympus OM-D E-M1X": "https://www.techradar.com/reviews/olympus-om-d-e-m1x",
    "Sony Airpeak": "https://www.techradar.com/news/sony-airpeak-drone-release-date-price-rumors-and-leaks",
    "Nikon Z9": "https://www.techradar.com/reviews/nikon-z9",
    "Canon EOS R1": "https://www.techradar.com/news/canon-eos-r1-release-date-price-rumors-and-leaks"
  }
}