{
  "source": "https://www.techradar.com/news/breath-of-the-wild-2-release-date-could-be-announced-in-just-a-few-days-time",
  "title": "Breath of the Wild 2 release date could be announced in just a few days time",
  "category": "gaming",
  "updated": "2021-11-29T14:33:01Z",
  "author": "darren-allan",
  "summary": "Are we about to find out the official name of the sequel?",
  "article": [
    "Are we about to get a big unveiling of Breath of The Wild 2, complete with a release date and title? It's possible – as The Game Awards for 2021 are imminent and it seems there will be some impressive announcements at the show, including the ‘world premiere’ of a major title.",
    "Organizer Geoff Keighley tweeted to say that the big reveal has been in the works for two and a half years – roughly the amount of time that's passed since the last BOTW 2 trailer – and that he’s truly honored to share it. Unsurprisingly, this has fanned flames of speculation around what this game might be.",
    "Cue quite a flurry of theories about how the most likely candidate here is Breath of the Wild 2), the hotly anticipated Nintendo Switch sequel which is due out next year.",
    "Now, there are arguments against this possibility, namely that it wouldn’t be a \"world premiere\" considering that Breath of the Wild 2 has been shown off a couple of times (though announcing its official name and release date could still qualify for this term). BOTW 2 was first teased at E3 2019, and then we were treated to another presentation of the game at E3 earlier this year.",
    "With that in mind, let’s dive into the details of why this could still be BOTW 2…",
    "For starters, as Nintendo Life, which spotted the above tweet, points out, there have been instances in the past where so-called premieres for The Game Awards have been aired for games that have already been glimpsed.",
    "Then there’s also the fact that we know Zelda series producer, Eiji Aonuma, has said that development is proceeding ‘smoothly’ on the sequel and that we will get more information this year. Aside from what was imparted at E3 2021, we could still get more info before 2021 is out – particularly considering that 2022 is a broad, and immediate release window, and we don't yet know the exact date to expect the game to launch.",
    "Remember, we don’t have an official name for the game either, so it'd make sense for that to be revealed (alongside further footage or a demo of some kind). Nintendo has said before that it is deliberately holding back on revealing the name of the sequel, as it will give some clear clues as to what the game will be about. So, giving us the official name would be an obvious move to make with the ‘premiere’ – but this is all conjecture of course.",
    "In short, the idea of BOTW 2 fits well enough here, but it could be something else, of course – maybe that Metroid Prime 4 game we've been hankering for, or a remake of Prime 1, after Metroid Dread stoked excitement for the franchise yet again?"
  ],
  "headers": {
    "5": "Analysis: What’s in a name? Quite a lot, really"
  },
  "links": {
    "Breath of The Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "The Game Awards for 2021": "https://www.techradar.com/news/game-awards-2021-the-nominees-and-what-we-expect-to-see",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "presentation of the game at E3 earlier this year": "https://www.techradar.com/news/nintendos-zelda-botw-2-reveal-was-an-utterly-genius-bait-and-switch-heres-why",
    "Nintendo Life": "https://www.nintendolife.com/news/2021/11/the-game-awards-has-a-world-premiere-its-been-working-on-with-a-dev-for-2-5-years-and-one-guess-is-zelda",
    "that we will get more information this year": "https://www.techradar.com/news/breath-of-the-wild-2#section-breath-of-the-wild-2-news-and-rumors",
    "Metroid Prime 4": "https://www.techradar.com/news/metroid-prime-4",
    "Metroid Dread": "https://www.techradar.com/reviews/metroid-dread"
  }
}