{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-note-22-might-not-be-canceled-after-all",
  "title": "The Samsung Galaxy Note 22 might not be canceled after all",
  "category": "phones",
  "updated": "2021-09-11T13:30:08Z",
  "author": "david-nield",
  "summary": "A new hope",
  "article": [
    "Are we or aren't we getting a Samsung Galaxy Note 22 in 2022? With the cancelation of the Galaxy Note 21, we're not sure if Samsung is bringing back its high-end, stylus-equipped flagship smartphone next year – but the latest evidence suggests that there's still hope.",
    "That evidence is a tweet from reliable tipster Ice Universe, who says that a supply chain source has seen \"evidence of the existence\" of the Galaxy Note 22. It's not conclusive as far as evidence goes, but at the moment we'll take it.",
    "At the moment we don't have much more to report on the Galaxy Note 22 – that's not surprising, considering we're only a month on from August, which is when the Note flagship phones typically see the light of day (so August 2022 is a potential launch window for the next one).",
    "Part of the reason that industry watchers think the Note series might be dead is that the S Pen stylus – once exclusive to the Galaxy Note phones – is now compatible with more of the Samsung range, including the Galaxy S21 Ultra.",
    "Significantly, the stylus now works with the recently unveiled Samsung Galaxy Z Fold 3, and there's a lot to suggest that Samsung sees this handset as the long-term successor to the Note, even if the company hasn't officially said so.",
    "With the Galaxy Z Fold 3 offering what the Note previously offered – a large screen, a premium build, and a stylus – it's going to be very interesting to see if the Note makes a return in 2022. This latest leak suggests: perhaps.",
    "While we're not privy to the discussions happening at Samsung right now, in a market as packed as the smartphone market is in 2021 (and will be in 2022), we think that there's room for what the Samsung Galaxy Note 22 can offer to consumers.",
    "It's fair to say the there is now some overlap with the Galaxy Z Fold 3 – the foldable phone gives you more screen space and yet can still (just about) fit in your pocket. The price remains on the very expensive end of the spectrum though, and while the S Pen is supported, there's no integrated slot for it.",
    "The Galaxy Note offers a phone that can fit a stylus inside it, and which should be available at a price point significantly below any foldable offering from Samsung. Down the years we've been big fans of the Note series, and the way it combines a larger-than-average screen with some top-notch components.",
    "Unfortunately, the Galaxy Note 20 was a little underwhelming. If Samsung can get the mix of features, specs and price right for the Galaxy Note 22, then it can still offer something that you don't quite get with anything else that Samsung makes."
  ],
  "headers": {
    "3": "Samsung's foldable future",
    "6": "Opinion: there's still a place for the Galaxy Note"
  },
  "links": {
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Ice Universe": "https://twitter.com/UniverseIce/status/1436541178565079040",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "if the Note makes a return": "https://www.techradar.com/news/samsung-didnt-renew-its-note-trademark-so-what-does-that-mean-for-note-22",
    "the discussions happening": "https://www.techradar.com/news/samsung-galaxy-note-21-cancelation-might-also-mean-the-note-22-is-gone",
    "Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}