{
  "source": "https://www.techradar.com/news/gta-3d-how-rockstar-games-took-liberty-city-into-the-open-world",
  "title": "GTA 3(D): how Rockstar Games took Liberty City into the open world",
  "category": "gaming",
  "updated": "2021-10-22T14:19:03Z",
  "author": "ben-gilbert",
  "summary": "Interview: ‘It was only three months before release that everything fell in place and the magic happened’",
  "article": [
    "Rockstar Games hasn’t always been untouchable. To identify the exact moment perhaps the world’s most celebrated video game company became ice cool, check out the trailer for Grand Theft Auto III. Although now inevitably somewhat dated, it endures as a trailblazing, widescreen moment in popular culture. The clip peaks in a slow-motion spectacle of operatic drama as an airborne white sports car arcs into view, outrunning the hapless perusing cops to a decadent soundtrack of the soprano aria O Mio Babbino Caro. \"I see nothing but good things for you, my boy,\" Don Salvatore Leone tells the game’s mute anti-hero Claude as he rampages his way up the Mafiosa crime ladder. Destined to become a “made man”, there are direct connections here to Rockstar and its go-to storytelling tropes, which include the lineage of iconic gangster films – The Godfather, Heat, Goodfellas – that permeated the GTA series from this point onwards.",
    "But the foundations of Rockstar, particularly its development antecedent DMA Design, don’t exactly speak of an era-defining and agenda-setting entertainment megacorp that would one day be worth $3.5 billion. Establishing its gaming reputation in the Scottish city of Dundee, DMA’s headline release before GTA was Lemmings, a much-loved but unabashedly daft platformer, where players sought to save gaggles of sleepwalking green-haired rodents from impending pixelated doom.",
    "There was little here to suggest the future of gaming or a title so controversial that it would prompt hand-wringing debate at the highest level of US politics. In 2021, there are many games that might be spuriously described as “murder simulators”, the incontinent phrase used to conceptualize this era’s defining moral panic to the masses of Middle America. But few will be remembered as delivering the infamy or innovation of GTA III.",
    "To celebrate the anniversary of GTA III, Rockstar Games has announced Grand Theft Auto: The Trilogy – The Definitive Edition, a remastered edition of Grand Theft Auto 3, Vice City and San Andreas, will release in November. Make sure to check out our GTA Trilogy remaster vs GTA 3, GTA Vice City and GTA San Andreas comparison to see the differences.",
    "Now marking its 20th anniversary, GTA III’s populist reputation is centered on a range of questionable themes that allowed the gaming industry to, literally, build a mature audience and bring them along for the spanked-out ride. Its influence is everywhere but, besides the most obvious factor that it encouraged players to debase themselves and those within striking distance in a riotous Molotov cocktail of high jinks, this is about much more than invisible boundaries of taste.",
    "To be found within the approximate 8km² of the game’s virtual expanse – said by Rockstar co-founder Dan Houser to be a \"hybrid of a generic American city\" and, in its three islands, resembling an industrial Brooklyn and Queens, Manhattan’s commercial district and the suburbs of New Jersey – are the keys to the open world. The boundless territory and endless horizons that GTA III promised led to a freedom of movement that is, now more than ever, near impossible to replicate in normal life.",
    "Central to this eye-popping achievement was the bravura technical ambition of DMA, which would become Rockstar North in 2001, and its decision to switch from the top-down perspective that had dominated Grand Theft Auto’s acclaimed but comparatively limited predecessors and into a hyper-real 3D vantage. As technical director, Obbe Vermeij played a key role here, working alongside Adam Fowler, producer Leslie Benzies and art director Aaron Garbut.",
    "Vermeij started at DMA in 1995, building Space Station Silicon Valley for the N64. Speaking to TechRadar, he explained how the development team established a transatlantic collaboration with Rockstar Games, the publishing company behind the GTA franchise, which was established in 1999 when Take-Two bought BMG Interactive.",
    "“Together we managed the ‘Edinburgh part’ of the game,” Vermeij tells us. “New York would handle the voice acting, story and various style decisions. Edinburgh did all the modeling (characters, city, vehicles), the level design (missions) and the code.",
    "“The team was relatively small at the time (around 25 people of which only seven were coders) so everybody was hands-on and every programmer had a large chunk of the game,” he continues. “I spent most of my time writing code. The design process was organic. The level designers (or in fact anyone in the team) would come up with an idea for a mission: ‘What if the player had to drive a van rigged with explosives? Let’s see if they can destroy a moving car’. Then the level designers would try the idea and if it was fun we would fit it in the story.”",
    "While the team certainly wasn’t short of creative ideas, realizing the 3D environment that would be central to the GTA III experience - and ultimately change the course of gaming history - came with plenty of challenges.",
    "“The main difficulty was the ‘streaming’,” Vermeij explains. “The PS2 only had enough memory for a couple of city blocks around the player. As they moved through the city, the new graphics had to be loaded from the DVD. Unfortunately, the DVD drive was very slow and this caused the city to not be loaded in time and buildings to be invisible until they popped in.",
    "“We actually had to slow the player down to minimize the issues. [The island of] Portland initially had a main drag all the way down it. This allowed the player to go too fast so the streaming would ‘lag’. We had to break it up with a building. This slowed the player down just enough. The limited memory is also the reason you would see so many of the same cars. There was only enough memory to load a few types at a time.”",
    "Alongside the practical challenges that came with modernizing the backend of the game, Rockstar was equally determined to tell a more involving story.",
    "\"We felt that not only was the content of video games becoming very staid, focused primarily on fantasy, children's characters or science fiction, but also the gameplay of those games was becoming very predictable,\" Rockstar Games co-founder Dan Houser told Design Museum.",
    "\"We felt that video games, interactive entertainment or whatever you wanted to call it could also appeal to a bigger, wider audience – older people who enjoyed playing games, but did not do so to the exclusion of everything else. People with an interest in film, music, books and a broader sense of popular culture.”",
    "While Vermeij, who remained technical director at Rockstar until 2009 and the release of GTA IV, agrees with Houser’s suggestion that there was a concerted attempt to bring more narrative weight, he says the central focus was on “the fun factor”.",
    "“You could say that for GTA III, the story was thin and written to accommodate the missions. In GTA IV the story was king and the missions were dictated by the story,” he explains.",
    "A matter of days before GTA III’s release, 9/11 happened. Coincidentally, just hours earlier, the fansite Gouranga.com published the transcript of a chat with Houser, which, according to David Kushner’s Rockstar Games book, Jacked, featured the following question: “Will we be able to hijack things besides cars?”, to which Houser responded: “Boats, tanks, ambulances, taxis, buses, ice cream vans. Just not the big stuff – choppers, jumbo jets and oil tankers, you are a criminal, not an airline pilot.”",
    "The shocking events in Manhattan prompted the team to make numerous notable stylistic changes – altering the colorway of the police cars, which had previously been identical to the NYPD, and removing a mission referencing terrorists – and push the game back into the following month.",
    "“9/11 was as shocking for us as it was for anyone else,” recounts Vermeij. “When it happened we had only six weeks before release and that is about the time it was going to take to burn the CDs and get the game in stores. The people in New York made a list of scenes that were too similar to the images of 9/11. We had planes flying around on rails rather low. We moved these flight paths away from buildings. I believe we removed collisions from the bigger planes so they couldn’t be hit by rockets fired by the player. I can't remember all of the changes but there were quite a few.”",
    "Finally released on October 23, 2001, GTA III, which would go on to sell approximately 15 million units globally, was met with a procession of objections. Wal-Mart imposed identity checks to prevent anyone under the age of 17 from picking up a copy, which was also initially banned in Australia. Labeled the “Most Offensive Game Of The Year” by GameSpy, who suggested it was \"absolutely reprehensible\", lawyer and American activist Jack Thompson began a high-profile campaign against Rockstar Games’ parent company Take-Two Interactive, which concluded with him being disbarred in 2008.",
    "Reflecting on these controversies, Vermeij, who now lives in Ottawa, Canada and has gone on to produce Learnia, an educational app for young children, suggests Rockstar’s legal problems would peak further down the line, during the Grand Theft Auto: San Andreas era and the discovery of the sex-based, disabled minigame Hot Coffee, which “hurt the company a lot more than Jack Thompson ever did”.",
    "Is Rockstar Games still untouchable? Two decades on and following the departure of Dan Houser in 2020, his brother Sam and Garbut are the only members of the management team from this era to remain. Meanwhile, allegations of creative inertia have accompanied the imminent release of revamped ports from the company’s back catalog. The facts are that Red Dead Redemption, L.A. Noire, Max Payne 3, Grand Theft Auto V and Red Dead Redemption II came out in the 2010s. Arguably, GTA III is where it all started.",
    "At what point did Vermeij realize what the team had built?",
    "“When you’re working on a game, it is really hard to judge its quality,” he tells us. “It crashes all the time so you’re lucky if you can complete a mission. The map is full of holes so you fall through all the time. You work with debug versions that run at five fps instead of the final 30fps. There is no music, animations are missing etc. It was only three months before release that everything fell in place and the magic happened. At that moment it was like playing the game for the first time. Only then did we realize GTA III was something special.”"
  ],
  "headers": {
    "4": "‘Wow, Liberty City! Just like I pictured it’",
    "10": "We’ll take your brain to another dimension",
    "18": "How did 9/11 impact the making of GTA III?",
    "21": "Hot Coffee ‘hurt Rockstar more than Jack Thompson’"
  },
  "links": {
    "trailer for Grand Theft Auto III": "https://www.youtube.com/watch?v=WUi3davvBmM%20",
    "murder simulators": "https://www.ign.com/articles/2005/08/10/the-adventures-of-jack-thompson",
    "Grand Theft Auto: The Trilogy – The Definitive Edition": "https://www.techradar.com/news/gta-trilogy-releases-in-november-will-launch-day-one-on-xbox-game-pass",
    "GTA Trilogy remaster vs GTA 3, GTA Vice City and GTA San Andreas": "https://www.techradar.com/news/gta-trilogy-remaster-vs-gta-3-gta-vice-city-and-gta-san-andreas-see-the-differences",
    "Design Museum": "https://web.archive.org/web/20111105233001/http://designmuseum.org/design/rockstar-games",
    "David Kushner’s Rockstar Games book, Jacked,": "https://www.eurogamer.net/articles/2012-03-27-jacked-review-the-unauthorised-gta-story",
    "Learnia": "https://www.learnia.lol/index.html",
    "revamped ports": "https://www.techradar.com/news/grand-theft-auto-the-trilogy-is-real-and-its-coming-to-nintendo-switch"
  }
}