{
  "source": "https://www.techradar.com/news/dropbox-snaps-up-docsend-for-safer-document-transfers",
  "title": "Dropbox snaps up DocSend for safer document transfers",
  "category": "computing",
  "updated": "2021-03-09T18:42:55Z",
  "author": "anthony-spadafora",
  "summary": "Greater visibility leads to more effective collaboration",
  "article": [
    "In an effort to make it easier for those working from home to collaborate, Dropbox has announced that it has entered into a definitive agreement to acquire the secure document sharing and analytics company DocSend.",
    "The cloud storage company will acquire DocSend for $165m in cash and the deal is expected to close during the first quarter of this year following regulatory approval and closing conditions.",
    "Co-founder and CEO of Dropbox, Drew Houston explained in a press release how DocSend will complement its current offerings, saying:",
    "“Given the dramatic rise in remote work, there’s increased demand for digital tools that help people organize their content and seamlessly collaborate with each other. DocSend is a perfect complement to our product roadmap and we’re thrilled to welcome them to our team. By bringing Dropbox, HelloSign, and DocSend together, we’ll be able to offer a full suite of secure, self-serve products to help them manage critical document workflows from start to finish.”",
    "Sending and receiving documents online has never been easier thanks to the wealth of online collaboration software now available. However, DocSend gives users additional visibility into what happens to their documents after they've been sent and this adds a new layer of intelligence to Dropbox's existing platform.",
    "For example, client services teams and creative professionals who already use Dropbox to organize and collaborate on presentations and projects can now use DocSend to deliver proposals and track engagement and HelloSign to manage contracts and invoices.",
    "As a result of the combination of Dropbox, HelloSign and DocSend, users across industries can now manage their end-to-end document workflows which will provide them with more control over their business results.",
    "We'll likely hear more about how Dropbox plans to integrate DocSend with its cloud storage platform once the deal closes later this quarter."
  ],
  "headers": {
    "4": "Effective collaboration"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Dropbox": "https://www.techradar.com/news/dropbox-spaces-looks-to-declutter-your-desktop/news/dropbox-launches-password-manager-and-super-secure-file-vault",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "press release": "https://www.businesswire.com/news/home/20210309005402/en/Dropbox-to-Acquire-DocSend",
    "online collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "HelloSign": "https://www.techradar.com/news/dropbox-snaps-up-hellosign-in-dollar200m-deal"
  }
}