{
  "source": "https://www.techradar.com/news/god-of-war-coming-to-pc-in-january-2022-with-dlss-support",
  "title": "God of War coming to PC in January 2022, with DLSS support",
  "category": "computing",
  "updated": "2021-10-20T17:51:00Z",
  "author": "john-loeffler",
  "summary": "Boy...this sure is exciting",
  "article": [
    "God of War is making its way to PC, Santa Monica Studios announced this week, making one of the best PS4 games accessible to PC gamers and marking the latest PlayStation title to get a PC port.",
    "The game is slated for a January 14, 2022, release, according to a post on the PlayStation Blog, and the game will feature DLSS and 21:9 screen ratio support, giving you another reason to get yourself one of the best ultrawide monitors out there.",
    "\"All of us at Santa Monica Studio have been humbled by the immense amount of support and passions fans of the God of War series have shown in the latest chapter of Kratos’ story since its release,\" Grace Orlady, senior community manager for Santa Monica Studio, said in the post. \"As of August 2021, 19.5MM copies for God of War on PlayStation 4 have been sold through and we can’t wait to share that experience with a whole new group of players on PC.\"",
    "In addition to DLSS and 21:9 support, the game will also feature true 4K resolution and unlocked framerates, so crank up your RTX 3090 and enjoy Kratos and Atreus's journey across the Nine Realms at the fastest framerates possible, making God of War on PC possibly the ultimate way to experience one of the greatest games ever made.",
    "In addition, anyone who purchases God of War on PC will also have access to additional digital content, including:",
    "Games are becoming more platform agnostic with cross-play and PC ports, a trend that has us excited with even more developments in recent months.",
    "Whether it was the formative years of the Xbox and PlayStation 2 for many or even further back to the Sega-Nintendo fight in the early 1990s, console exclusivity has always hurt gamers who got locked out of incredible experiences. Not every family was able to buy every console that came out in a generation, and it always sucked that many of us ultimately had to pick a side.",
    "Because Final Fantasy games were Nintendo and then PlayStation exclusive titles, that is where my family's money went growing up, which means I missed out on a lot of great Sega and Xbox titles. I'm sure there are plenty of old Sega Genesis/MegaDrive veterans out there who will never know the sublime beauty of Final Fantasy VI (released as Final Fantasy III in North America), and that's a tragedy.",
    "Fortunately, those old divisions seem to be breaking down. With several PlayStation exclusive titles making their way to PC like Death Stranding, Days Gone, and Horizon Zero Dawn, the best titles on Sony's flagship consoles are becoming some of the best PC games going. And with the Xbox Series X release of long-time Sony exclusive MLB: The Show, as well as its Day-One launch on Xbox Game Pass, we're even seeing an in-house, first-party Sony developer making a game for a rival console.",
    "What does this mean going forward? Honestly, the walls have been breached. After loosening up their grips on exclusivity and allowing cross-play servers between various platforms, it's unfathomable that Microsoft and Sony would suddenly retreat back into their walled gardens.",
    "With the move to digital downloads and streaming content, the physical production costs of developing an exclusive title are seriously reduced, so extending those exclusive titles to other platforms and expanding the market for your games just makes financial sense.",
    "Does that mean that we could very well see Kratos coming to the Xbox and Master Chief coming to the PlayStation anytime soon? Five years ago we'd have laughed that out of the room, but now? It might not happen in time for Halo Infinite, but it looks like its simply inevitable in the long run.",
    "Personally, I can't think of anything better. More of this please."
  ],
  "headers": {
    "5": "Opinion: more please (and bring us Bloodborne, you cowards!)"
  },
  "links": {
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "best PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "PlayStation Blog": "https://blog.playstation.com/2021/10/20/god-of-war-2018-is-coming-to-pc/",
    "best ultrawide monitors": "https://www.techradar.com/news/ultrawide-monitor",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Death Stranding": "https://www.techradar.com/reviews/death-stranding-directors-cut-review",
    "Days Gone": "https://www.techradar.com/news/days-gone-is-coming-to-pc-and-more-playstation-exclusives-are-on-the-way",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "MLB: The Show": "https://www.techradar.com/news/mlb-the-show-21-xbox-game-pass-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite"
  }
}