{
  "source": "https://www.techradar.com/news/microsoft-build-2021",
  "title": "Microsoft Build 2021: everything you need to know about the developer conference",
  "category": "computing",
  "updated": "2021-05-24T11:59:30.555Z",
  "author": "richard-devine",
  "summary": "Microsoft Build goes digital once again",
  "article": [
    "This week sees Microsoft's turn at holding another remote event, with their Build conference running from May 25 to May 27.",
    "Events such as Google I/O and soon WWDC have all had to adjust their plans to adapt to a remote event, but developers and users alike have been enjoying the change of pace, and this week looks to carry on these efforts.",
    "While the event is aimed more towards developers, it's unlikely that we will see any new hardware showcased. However, Microsoft has used the event in the past to talk about new features of Windows 10, Microsoft Office and plenty more, so we may at least see what's coming up to these respective products.",
    "Here’s what to expect from Microsoft Build 2021.",
    "Microsoft Build 2021 takes place from May 25 - May 27. Much like in 2020, this is a reduction of two full days from its traditional in-person schedule.",
    "Also, like in 2020, Microsoft Build 2021 will be an entirely digital conference delivered online. Microsoft had committed to digital-only events for at least a year during the first wave of the pandemic in 2020, and Build 2021 was already expected to be covered by this.",
    "Being digital-only will mean round-the-clock access to various streams of content to all those registered for the event and all will be available on-demand afterward.",
    "This is particularly useful for non-U.S. attendees since the ability to work in your own time zone instead of U.S. Pacific time is certainly a bonus.",
    "Registration for Microsoft Build 2021 is now open to all and as it's an online conference overall capacity isn't an issue.",
    "To register, head over to the official Build 2021 portal to begin. From there you simply have to sign in with a Microsoft account, be that personal, work or school, or with credentials from GitHub or LinkedIn.",
    "Once logged in, click the 'Register myself' button and fill out your details. Once confirmed you'll see your attendee page and you're all set. The agenda hasn't been confirmed in detail yet as it may out topics that will be announced during the keynote.",
    "What is really neat is that your Build 2021 schedule will automatically show in your time zone. There is content broadcast at different times throughout the course of the event to help those around the world have a more sociable conference.",
    "Everyone attending the Microsoft Build 2021 virtual conference has been waiting for the session catalog to go live and the wait is finally over. Beginning with a keynote delivered by Microsoft CEO, Satya Nadella, the entire conference is now packed with interesting sessions.",
    "If you’re registered for Microsoft Build 2021 then you can now log in and begin building your own event schedule and choosing sessions most of interest to you. Some may be limited by the number of attendees so be sure to act fast.",
    "There could still be some sessions not yet announced if Microsoft is planning to unveil new products during the keynote. But as content will be made available on-demand, don’t stress out too much if you can’t make everything you want to. It will always be available after the event.",
    "Ordinarily, Build is focused on computers and the developer community, with gaming being left for separate, dedicated events. While this is expected to be the case again in 2021, Microsoft is reportedly planning an Xbox event to tie in with the Build 2021 time frame.",
    "Microsoft already has Game Stack Live confirmed, but the reports claim this event is completely separate to this. ZDNet’s Mary Jo Foley claims Microsoft is going to announce a number of smaller “What’s Next” events to supplement its larger conferences.",
    "The first big Windows 10 update of 2021, the 21H1 update, has already been confirmed by Microsoft. While there is currently no release date for it, by the very nature of its name we can expect it in the first half of the year as is traditional.",
    "The second update of the year is the one that could be more interesting. Windows 10 21H2 is likely to arrive in the second half of the year, perhaps around October time, and reports suggest a number of significant changes to the operating system.",
    "Build 2021 would be an ideal platform for Microsoft to start to publicly discuss some of what’s coming to Windows 10 later this year. Parts are already beginning to appear in the Dev Channel of the Windows Insider Program, and as we head into the second half of the year a full 21H2 build will begin testing at some point.",
    "Nothing is confirmed at this point, but it wouldn’t be surprising to hear Microsoft use the keynote and break-out sessions at Build 2021 to detail the next evolution of Windows 10."
  ],
  "headers": {
    "4": "When is Microsoft Build 2021 and where will it take place?",
    "8": "How to register for Microsoft Build 2021",
    "12": "Microsoft Build 2021 session catalog now live",
    "15": "Microsoft might be planning a Build-timed Xbox event",
    "17": "More information on the Windows 10 21H2 update"
  },
  "links": {
    "takes place from May 25 - May 27": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1729160687639247600&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fevents",
    "committed to digital-only events": "https://www.techradar.com/news/microsoft-events-will-be-online-only-for-the-next-year",
    "Build 2021 portal": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7877836978298962000&xs=1&url=https%3A%2F%2Fmybuild.microsoft.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-build-2021",
    "session catalog": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8499577234379387000&xs=1&url=https%3A%2F%2Fmybuild.microsoft.com%2Fhome&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-build-2021",
    "reportedly planning an Xbox event": "https://www.techradar.com/news/microsofts-next-xbox-series-x-event-isnt-likely-to-be-what-you-think-it-is",
    "ZDNet’s Mary Jo Foley": "https://www.zdnet.com/article/its-official-microsoft-build-will-be-may-25-to-27/",
    "Windows 10 21H2": "https://www.techradar.com/news/windows-10-21h2-update"
  }
}