{
  "source": "https://www.techradar.com/news/5-things-i-wish-i-knew-before-starting-deathloop",
  "title": "5 things I wish I knew before starting Deathloop",
  "category": "gaming",
  "updated": "2021-09-16T09:27:38Z",
  "author": "jordan-oloman",
  "summary": "Kick butt from loop one",
  "article": [
    "Deathloop is a pithy game full of fascinating systems, so there are going to be plenty of eureka moments as you play through it and try to break the endless loop that Colt is faced with.",
    "This can be an exciting process, but if you’re really struggling and looking for some tips on how to make some progress when you’re stuck in a rut, this guide should provide some useful lesser-known tips to help expand the experience and put more arrows in your creative quiver.",
    "Here are 5 things I wish I knew before starting Deathloop.",
    "Deathloop takes a few hours to get going, and the game only really starts once you unlock Residuum Infusion, which occurs when you complete the ‘Ubiquity’ lead after hunting Wenjie in The Complex. You’ll know you’ve got it when the game prompts you to infuse items that can carry over into subsequent loops. Don’t dilly-dally in the hours prior to this, as this is when the game really opens up. You can take your time exploring the districts after this point once you have unlocked all of the game’s systems.",
    "Eventually, Deathloop becomes a game about one man’s endless search for working batteries, with many of Blackreef’s most important systems and secrets being locked behind a door that requires multiple battery inputs. You’ll often be able to find batteries in the areas surrounding these doors, in locked rooms and powering other electrical objects, but one key tip to know is that you can also steal batteries from turrets when they’re deployed. Most areas are flush with turrets so this is an easy way to bypass the battery hunt and unlock those secrets early. Be careful not to throw batteries when you’re holding them either, or they will explode. You can also charge dead batteries at special battery-charging stations dotted throughout the districts.",
    "When I first started playing Deathloop I would rush out of the tunnels and dispatch any goons I could see as soon as I noticed the threat. However, I’ve since realised that a softer approach is more beneficial to your overarching mission. If you hear a group of Eternalists strike up a conversation, let it play out and they may well divulge some important information on a nearby Visionary or even a secret code. It’s worth it just to hear the stellar dialogue that is peppered throughout the game!",
    "This one seems obvious, but I was worried about it and didn’t believe it until I confirmed it myself, so it’s worth mentioning here. Items that you infuse with Residuum such as weapons, slabs, upgrades and trinkets will stay in your inventory forever unless you choose to sacrifice them. This means that if you have infused a weapon at noon after a morning run, you don’t need to carry it with you to the end of the loop if you find something better - swap it out for something new before you leave. It will be an option the next morning once you’ve infused it, and the same tracks for slabs and upgrades. Take advantage of this by infusing the slabs you collect early in the loop before swapping them out later to infuse new slabs from Visionaries you kill in the later time periods. This means you can permanently unlock multiple powers in one run!",
    "It can be quite daunting to approach Visionaries, especially in the early game. They’re based in secure compounds and are very powerful. Without the right gear or a stealthy approach, they will turn Colt to mincemeat or overwhelm him with Eternalist cronies. However, you shouldn’t be afraid to kill Visionaries early on, as it is the main way to progress through the game and figure out how to break the loop. Crucially, Visionaries drop slabs that afford Colt with Dishonored-like supernatural powers, and you’re going to need at least two equipped to be operating at full creative/violent capacity. Even if you’ve done what you needed to do in an area, consider trying to kill the Visionaries there to get slab upgrades and upgrade your skills, especially if you have some reprise charges left."
  ],
  "headers": {
    "3": "Don’t waste too much time in the tutorial",
    "4": "You can steal batteries from turrets",
    "5": "Eavesdropping on enemies can lead to new information",
    "6": "Infused items don’t disappear between runs",
    "7": "Don’t be afraid to kill Visionaries early"
  },
  "links": {
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review"
  }
}