{
  "source": "https://www.techradar.com/news/realme-gt-revealed-in-first-official-photos-ahead-of-launch",
  "title": "Realme GT revealed in first official photos ahead of launch",
  "category": "phones",
  "updated": "2021-02-22T09:58:32Z",
  "author": "david-nield",
  "summary": "Some camera specs too",
  "article": [
    "We know the Realme GT is getting its grand unveiling on March 4, and now we have some photos of the handset from Realme ahead of time. It's our first official look at the phone, and the pictures we have certainly give the impression of a premium, flagship-level device.",
    "Previously known as the Realme Race, the phone was shown off on Chinese social network Weibo (via MyFixGuide) by Xu Qi Chase, Vice President of Realme Group. It was also revealed that the color you can see in these pictures is \"Galaxy Battleship\".",
    "The design visible in the images reveals a USB-C port, a 3.5mm headphone jack, and a triple-lens rear camera – and the lettering on the camera module around the back shows the primary camera sensor will be a 64MP one, as we'd previously heard.",
    "The Realme GT has already been confirmed as running the very latest Snapdragon 888 processor from Qualcomm, and it'll have 5G on board too. From what we've seen so far, Realme is ready to take on the likes of the Samsung Galaxy S21 directly this year.",
    "While the March 4 launch in the calendar is for a China-only release of the phone, previous Realme handsets have made their way to the UK, so we're hopeful that this one will too. To date, Realme hasn't launched any of its phones in the US or Australia, so we'll have to wait and see on availability in other markets.",
    "Realme previously confirmed to TechRadar that the phone (then known as the Realme Race) would have a 6.8-inch display, a 3200 x 1440 pixel resolution, and a staggering 160Hz refresh rate – though those specs could refer to a Pro version of the handset rather than the standard edition.",
    "Another high bar might be set by the charging speed: the Realme GT was reported to be the first phone on the market with a 125W charging speed for its 5,000mAh battery, but that technology might have been delayed, according to more recent rumors.",
    "Even without super-speedy battery charging, the Realme GT is likely to be one of the very best phones of 2021 when it makes its appearance in full next month, and we will of course bring you all the announcements and news from Realme as they come in."
  ],
  "headers": {},
  "links": {
    "Realme GT": "https://www.techradar.com/news/realme-gt-5g-is-a-new-android-phone-with-snapdragon-888-coming-next-month",
    "MyFixGuide": "https://www.myfixguide.com/first-photo-realme-gt/",
    "we'd previously heard": "https://www.techradar.com/news/realme-race-pro-specs-confirmed-and-it-beats-the-samsung-galaxy-s21-ultra",
    "already been confirmed": "https://www.techradar.com/news/realme-gt-launch-date-china",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "confirmed to TechRadar": "https://www.techradar.com/news/realme-race-pro-specs-confirmed-and-it-beats-the-samsung-galaxy-s21-ultra",
    "more recent rumors": "https://www.techradar.com/news/realme-gt-might-not-beat-oneplus-and-oppo-phones-in-charging-speed-after-all",
    "best phones": "https://www.t3.com/features/best-smartphone"
  }
}