{
  "source": "https://www.techradar.com/news/ios-145-gets-rid-of-siris-default-voice",
  "title": "iOS 14.5 gets rid of Siri's default voice",
  "category": "phones",
  "updated": "2021-04-01T09:20:53Z",
  "author": "james-rogerson",
  "summary": "And adds two new options",
  "article": [
    "When you think of Siri, there’s a good chance you think of a female voice. That’s the one featured in most adverts, and the one it defaults to, at least in many countries. Or it was anyway, but with iOS 14.5, Siri won’t default to any voice at all.",
    "Instead, TechCrunch reports that users will be prompted to choose whether they want a male of female voice when they set up their device, with neither option pre-selected. It’s worth noting that some countries actually defaulted to a male voice, but they too won’t have a default anymore.",
    "That’s not the only change to Siri either, as with iOS 14.5 two new voices have also been added, which will be available to English-speaking users worldwide. So you’ll have more options on top of not having the initial selection made for you.",
    "These updates are live now, but only in iOS 14.5, which is currently in beta. However, we’d expect it will be available for everyone soon.",
    "Whenever it does land on your device, it’s not just Siri that will be improved through it, as we already know that iOS 14.5 also gives you the ability to recalibrate your iPhone’s battery life, to give more accurate battery life estimates. Though oddly that feature only seems to be supported by the iPhone 11 range.",
    "iOS 14.5 also includes mask support for Face ID, a new privacy feature called App Tracking Transparency, PS5 and Xbox Series X controller support, and more. So it’s a fairly hefty update, and might be the biggest one we see before iOS 15."
  ],
  "headers": {
    "3": "All sorts of updates"
  },
  "links": {
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "TechCrunch": "https://techcrunch.com/2021/03/31/apple-adds-two-siri-voices/",
    "recalibrate your iPhone’s battery life": "https://www.techradar.com/news/ios-145-will-fix-your-iphone-11s-faulty-battery-estimates",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "mask support for Face ID": "https://www.techradar.com/news/ios-145-will-provide-a-great-excuse-to-buy-an-apple-watch-mask-support-for-face-id",
    "App Tracking Transparency": "https://www.techradar.com/news/ios-145-will-bring-a-big-privacy-feature-to-iphone",
    "iOS 15": "https://www.techradar.com/news/ios-15-update"
  }
}