{
  "source": "https://www.techradar.com/news/the-evolution-of-pos-point-of-sale-systems",
  "title": "An evolution of POS (Point of Sale) Systems",
  "category": "computing",
  "updated": "2021-07-15T13:15:57Z",
  "author": "desire-athow",
  "summary": "POS systems have come a long way since 1879. Let's look at how.",
  "article": [
    "POS systems have been around for quite a while. The first one was invented in 1879 by an American shopkeeper James Ritty. When he noticed that his employees were pocketing money his business was making.",
    "He called the system “Ritty’s Incorruptible Cashier”, which is perhaps a more catchy name unlike, today’s IT tool which would commonly become known as a “cash register”.",
    "The first computer-driven cash register, which resembles what we have today, was developed by IBM in 1973 – and it marked the first commercial use of a computer-based system used by the restaurant industry.",
    "Then in the 1980s, the first credit cards were introduced into society, and the evolution of POS terminals accelerated when they had to be updated accordingly to suit the business industry.",
    "McDonalds started rolling out POS terminals in its restaurants in 1984, Invented by William Brobeck. The model they used was one of the first microprocessor-controlled cash registers.",
    "The POS terminal system increasingly sped up the food ordering process by including a physical button for every item on the menu. It was also the first time a POS could be connected to a multitude of other devices, allowing the fast-food chain to easily manage reports and receipts for the first time.",
    "In more fine-dining establishments, the bulky POS systems would be hidden so that they were out of view of customers.",
    "POS systems changed drastically two years later, when touch screen technology and colorgraphic monitors became more affordable.",
    "ViewTouch, the first POS system solution on the Atari ST, was launched in 1986 by a New York-based restaurateur - Gene Mosher at Comdex in Las Vegas. whilst the inventor was on his honeymoon with his wife. Nowadays it is offered for free under the GNU license and can be run on the simplest computer hardware – such a Raspberry Pi.",
    "As computers became more sophisticated in the 1990s, so did POS systems, with the first e-POS (Electronic Point Of Sale) system, Nisyst, launched in 1992.",
    "That year saw Martin Goodwin and Bob Hendry together develop and release the IT Retail POS software system on Windows, leading to a variety of POS applications being developed for Microsoft’s increasingly popular OS, in addition to Unix-based operating systems.",
    "In 1993, Europay, MasterCard and Visa unveiled the EMV standard for the credit card industry in Europe, which is still used in integrated circuit cards, POS terminals and automated ATMs.",
    "Powerful computers and more advanced networks led to an evolution of the POS, which began to develop capabilities beyond sales transaction processing in the early 2000s.",
    "As internet connections became faster, ePOS systems took to the cloud and found popularity among businesses due to increased convenience and lowered cost.",
    "Cloud-based POS systems transformed the landscape as any device capable of connecting to the internet could suddenly be used as a potential POS terminal.",
    "That included smartphones equipped with barcode scanners and NFC tech that effectively turned them into payment terminals and mobile credit card readers.",
    "Shifting to the cloud, this also brought new security capabilities to the POS systems. The introduction of the SaaS (or software-as-a-service) model removed the need for businesses to manually update software and licenses, with it instead being automatically taken care of by POS software vendors.",
    "Since 2010, modern POS systems have become increasingly sophisticated, allowing business owners to manage both front-end and back-end operations with ease. Integrated systems enable everything from inventory management to marketing; staff time management; accounting process; and customer information to be accessed, analysed, and controlled through a single (often touchscreen) interface.",
    "Adoption of cloud-based POS systems accelerated during the decade. Through the utilization of technologies to store sales and customer data using cloud storage, companies found it quicker and easier to access (and act upon) their sales and customer data than ever before. This made cloud-based POS systems particularly attractive for companies that ran a franchise model with multiple stores.",
    "The rise of cloud-based POS has naturally coincided with new trends around mobile POS. Like the many business owners and workers began the POS systems on mobile devices from 2010, which became easier thanks to tablets and smart mobile phones with increasingly larger displays and better processing power.",
    "Many vendors offer their business applications for free and take a cut of each sale through payment processing fees. By using a mobile POS system, companies allow their employees to easily look up product information, search for answers to customers questions, and take payments whilst walking around the shop floor. Consumers are also able to benefit from the mobile, by buying goods and services on devices like their own smart phones with a tap, using technologies such as NFC and Bluetooth.",
    "The POS System has come a long way, with great leaps made particularly in the past two decades.",
    "Our current decade is likely to continue seeing a convergence in technologies, with POS systems becoming smarter and able to help businesses get even more value out of their data than they can today.",
    "We've featured the best business laptops.",
    "We work with industry-leading providers to match your requirements with their products. Just tell us what you need from your POS system, and our most suitable partners will contact you to see if you want to take things forward.",
    "1. Enter your details below. Simply tell us a bit about what you want from your system, and leave some contact details.",
    "2. We search our database. We’ll match your requirements with the services and prices that our partners offer.",
    "3. Partners will contact you. Only the suppliers who match your requirements will reach out to you."
  ],
  "headers": {
    "4": "In the 1980s",
    "9": "In the 1990s",
    "12": "In the 2000s",
    "17": "POS systems in the 2010s and today",
    "24": "Save time and money by getting a tailored quote"
  },
  "links": {
    "POS systems": "https://www.techradar.com/news/the-best-pos-system",
    "whilst the inventor was on his honeymoon": "https://www.reddit.com/r/IAmA/comments/5dtr5y/iama_gene_mosher_creator_of_the_first_graphical/",
    "Windows": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "the cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "mobile credit card readers": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "SaaS (or software-as-a-service)": "https://www.techradar.com/news/what-is-saas",
    "marketing": "https://www.techradar.com/best/best-online-marketing-services",
    "time management": "https://www.techradar.com/best/best-time-management-solution",
    "accounting": "https://www.techradar.com/best/accounting-software-small-business",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "tablets": "https://www.techradar.com/news/best-business-tablets",
    "business applications": "https://www.techradar.com/best/best-apps-for-small-business",
    "payment processing": "https://www.techradar.com/best/best-payment-gateways",
    "best business laptops": "https://www.techradar.com/news/best-business-laptops"
  }
}