{
  "source": "https://www.techradar.com/news/apple-silicon-could-be-coming-to-the-16-inch-macbook-pro-in-the-spring",
  "title": "Apple Silicon could be coming to the 16-inch MacBook Pro early this year",
  "category": "computing",
  "updated": "2021-01-07T23:13:03Z",
  "author": "john-loeffler",
  "summary": "New Year, New MacBook Pro",
  "article": [
    "Apple is reportedly gearing up to release new MacBook Pro models powered by their new M1 chip this year, likely as early as March/April, with a 14.1-inch and a 16-inch display. And, thanks to some highly-speculative concept renders, we can see what they might look like.",
    "Twitter user Zeroeth Element – who we must stress does not work for Apple and does not appear affiliated with them in any way – posted a number of renders online that speculate on what these new laptops might look like given what we know about them.",
    "Among the noticeable elements in the renders is the slimmer profile of the 16-inch MacBook Pro. Given the move to its own silicon, there's every reason to believe that we'll see a thinner chassis since Apple's new chip doesn't need the kind of cooling solution that an Intel chip requires.",
    "The renders, originally flagged by Wccftech, also anticipate the continued move to thinner bezels, but that's definitely one of the more speculative elements in the renders, and since there's no reason to believe that the renders are based on any design documents, like a patent application or similar, they're essentially just a guess based on existing trends.",
    "First off, we expect that the new MacBook Pro models will use the new Apple M1 chip and possibly even an improved MX chip with up to 12 cores. If Apple does use a 12-core chip, it could be configured with eight high-performance cores and four efficiency cores or six of each.",
    "We don't expect Apple to use a Butterfly keyboard, either, given the issues users have had with it.",
    "We do expect that the new MacBook Pro models will be announced sometime in the first half of 2021 and – given past experience with Apple launches – they would go on sale soon after. As we get deeper into the new year, we expect the rumor mill to gear up, so stay tuned for more Apple MacBook Pro news."
  ],
  "headers": {
    "4": "What we know about the new MacBook Pro models"
  },
  "links": {
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Zeroeth Element": "https://twitter.com/ZeroethCore/status/1346908746384084992",
    "16-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "Wccftech": "https://wccftech.com/new-mini-led-macbook-pro-concepts-slim-bezels-new-keyboard/"
  }
}