{
  "source": "https://www.techradar.com/news/garmin-announces-three-new-approach-golf-watches",
  "title": "Garmin announces three new Approach golf watches",
  "category": "wearables",
  "updated": "2021-03-16T13:13:51Z",
  "author": "rhys-wood",
  "summary": "Tee off in style with these new Garmin golf watches",
  "article": [
    "Garmin has announced three new golf watches in its Approach series: the Approach S42, Approach S12 and Approach G12. These wearable GPS devices are aimed at tech-savvy golfers looking to improve their game and analyze their shots.",
    "Each of the Approach devices are aimed at varying levels of golfing enthusiast, but all share common features such as details on over 42,000 golf courses worldwide, a Green View to help you get a better read on your putt, and compatibility with the Garmin Golf app for uploading scorecards and participating in leaderboards and tournaments.",
    "The new Garmin Approach golf watches are all available to view at Garmin's store, each at varying price points depending on your needs. Both the Approach S42 and Approach S12 devices are available to purchase now, with the Approach G12 coming in the next 3-5 weeks.",
    "The Garmin Approach S42 is aimed at serious golfing enthusiasts. This smartwatch features a 1.2-inch color display with touchscreen capabilities. The AutoShot feature allows golfers to track and automatically record shot distances across those 42,000-plus golf courses, and is even useful away from the course with a range of smartwatch functionalities like step, calories and sleep tracking.",
    "At full charge, you shouldn’t have to worry about draining the battery while you golf, as the Approach S42 lasts for 15 hours in GPS mode and up to 10 days when used as a traditional smartwatch.",
    "The Garmin Approach S42 is available to purchase now for the suggested retail price of $299.99 / £269.99 / AU$449.",
    "This cheaper Garmin Approach model might be a better pick for you if you’re a beginner golfer. The Approach S12 sports a 1.3-inch sunlight-readable high-resolution display. Paired with the new Big Numbers display mode, it should be easier than ever to analyze your shots and performance at a glance.",
    "Battery life is similarly impressive to its enthusiast Approach S42 counterpart, with up to 30 hours of charge while in GPS mode.",
    "The Garmin Approach S12 is available to buy now for $199.99 / £179.99 / AU$299, though keep in mind that the website’s estimated shipping time is currently 1-2 weeks.",
    "More of a GPS golfing handheld than a smartwatch like the other two devices featured here, the Approach G12 offers the same feature set as the Approach S12. It’s got that 1.3-inch high-resolution display, but adds a built-in clip and a lanyard loop for wearing on the belt or around the neck, or to be firmly attached to your golf bag.",
    "You can view the Garmin Approach G12 over on the store page for the device, but it’s as of yet unavailable to purchase, with an estimated availability of 3-5 weeks from now. When it does become available, it can be purchased for the suggested retail price of $149.99 / £129.99 / AU$299."
  ],
  "headers": {
    "3": "Garmin Approach S42",
    "6": "Garmin Approach S12",
    "9": "Garmin Approach G12"
  },
  "links": {
    "golf watches": "https://www.techradar.com/best/best-golf-watch",
    "Garmin's store": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1122040330124890900/https://buy.garmin.com/en-US/US/cGolfing-p1.html?series=BRAND480&sorter=featuredProducts-desc"
  }
}