{
  "source": "https://www.techradar.com/news/having-usb-problems-with-your-amd-ryzen-pc-team-red-is-on-the-case",
  "title": "Having USB problems with your AMD Ryzen PC? Team Red is on the case",
  "category": "computing",
  "updated": "2021-02-23T17:39:55Z",
  "author": "carly-page",
  "summary": "The firm is investigating the issue affecting a 'small number' of users",
  "article": [
    "AMD has confirmed it’s investigating USB connectivity issues plaguing users of Ryzen-powered PCs and laptops.",
    "A number of AMD Ryzen users have been taken to Reddit in recent weeks to vent about intermittent USB connectivity problems on their devices.",
    "The ongoing issue has lead to keyboard connection drops, issues with VR headsets such as the Oculus Rift and HTC Vive, and connection issues with external storage devices and USB-connected coolers, according to the complaints.",
    "The USB problems seem to be limited to Ryzen 3000 and 5000 series CPUs in 500-series motherboards, namely the AMD X570 and B550. However, a list of affected systems compiled by Redditors suggests that the issue is mostly occurring in systems with new Nvidia RTX GPUs.",
    "While the exact root of the problem remains unclear, AMD has acknowledge the USB connectivity issue in a statement posted to Reddit.",
    "\"AMD is aware of reports that a small number of users are experiencing intermittent USB connectivity issues reported on 500 Series chipsets,\" the company said.",
    "“We have been analyzing the root cause and at this time, we would like to request the community’s assistance with a small selection of additional hardware configurations. Over the next few days, some users may be contacted directly by an AMD representative via Reddit’s PM system with a request for more information.”",
    "According to the post, AMD could be in touch with those affected to request details including hardware configurations, specific logs, and steps to reproduce the issue.",
    "“We will provide an update when we have more details to share. Customers facing issues are always encouraged to raise an Online Service Request with AMD customer support; this enables us to find correlations and compare notes across support claims,\" the post continues.",
    "Until AMD gets to the bottom of the issue, a handful of Redditors have come up with some workarounds. One possible quick-fix being touted is to change the motherboards’ settings from PCIe 4.0 to PCI 3.0, which some users claim has reduced the frequency of dropouts - though hasn’t eliminated them completely.",
    "Some users are also reporting the issue to be primarily on USB 2.0 ports, and some have had success by switching devices to USB 3.1 ports."
  ],
  "headers": {},
  "links": {
    "AMD Ryzen": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Oculus Rift": "https://www.techradar.com/reviews/gaming/gaming-accessories/oculus-rift-1123963/review",
    "AMD X570 and B550": "https://www.techradar.com/news/you-can-officially-use-your-x570-or-b550-board-with-upcoming-amd-ryzen-4000-processors",
    "a list of affected systems": "https://docs.google.com/spreadsheets/d/10JB90Hy8IG_f7CTbs5o711kkS1Krzx21sjXrftjXqC0/edit#gid=0",
    "Reddit": "https://www.reddit.com/r/Amd/comments/lnmet0/an_update_on_usb_connectivity_with_500_series/"
  }
}