{
  "source": "https://www.techradar.com/news/microsoft-teams-update-will-prevent-you-getting-crushed-by-an-alert-storm",
  "title": "Microsoft Teams update will help save you from alert overload",
  "category": "computing",
  "updated": "2021-06-07T15:59:37Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams will soon give you tighter control over notifications",
  "article": [
    "Microsoft is developing a new feature for collaboration platform Teams that will give users greater control over the way they receive push notifications.",
    "As per a new entry to the company’s product roadmap, users will soon be given the option of receiving notifications via Teams itself or the native Windows notification center when a message comes in.",
    "“The latter brings a suite of benefits, like respecting focus assist mode which enables you to avoid distracting notifications when you need to focus, and integrating with Windows 10 action center to help you review your notifications in one place,” Microsoft explained.",
    "The new feature is currently under development, but looks set to roll out to all users by the end of the month.",
    "Since the start of the pandemic, plenty has been made of the effects of remote working on mental health. A large part of that conversation has to do with the always-on culture that has been cultivated at some businesses. With all forms of communication going digital, workers have also felt bombarded by a relentless stream of notifications.",
    "By introducing greater controls over how and when Teams notifications are received, Microsoft will hope to alleviate some of these problems and create greater separation between work and personal activities, even if both are taking place in the same setting (or on the same device).",
    "The focus assist feature referenced in the roadmap is built into the Windows 10 operating system, allowing users to control the types of notifications they receive. Notifications can be filtered by priority alerts or alarms only, or disabled entirely.",
    "Although the feature is clearly designed to help eliminate distractions when concentration is required, it can also be used to block out notifications received after hours.",
    "Meanwhile, the ability to view and manage Microsoft Teams notifications centrally via the Windows 10 notification center should help users better organize their workflows and avoid becoming overwhelmed by alerts."
  ],
  "headers": {
    "4": "Microsoft Teams notifications"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1405485316716316200&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D64138",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives"
  }
}