{
  "source": "https://www.techradar.com/news/dell-reveals-new-enterprise-backup-service",
  "title": "Dell reveals new enterprise backup service",
  "category": "computing",
  "updated": "2021-04-07T15:20:51Z",
  "author": "mayank-sharma",
  "summary": "PowerProtect Backup is designed to protect data across multi-cloud environments",
  "article": [
    "Dell Technologies has just announced the addition of a new backup-as-a-service offering to its portfolio of cloud backup services.",
    "The company says its new PowerProtect Backup service will help users protect their data on popular Software as a Service (SaaS) applications like Microsoft 365, Google Workspace, and Salesforce that, contrary to popular belief, don't provide native data protection services.",
    "“With Dell EMC PowerProtect Backup Service… companies now can enjoy the flexibility and choice to consume workloads across multi-cloud environments, without compromising their most valuable asset – data,” said Dell’s Vice President of Product Management, Laura DuBois.",
    "Dell is collaborating with Druva to leverage its cloud infrastructure for the PowerProtect Backup service.",
    "DuBois shares that the service can be deployed in minutes and can be managed through an intuitive web-based administration interface. The interface will give users a single-pane-of-glass view to all their SaaS apps and also enable them to scale the storage space as per their requirements.",
    "PowerProtect Backup Service can also protect data on endpoint devices, such as desktops, laptops, and mobile devices. The service will also provide automated disaster recovery for hybrid workloads such as virtualization and network attached storage (NAS).",
    "Dell points out that the new service is a subscription-based service although it hasn’t yet shared pricing details."
  ],
  "headers": {
    "3": "Cloud backup for cloud services"
  },
  "links": {
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "Software as a Service (SaaS)": "https://www.techradar.com/news/what-is-saas",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "data protection": "https://www.techradar.com/best/best-data-loss-prevention-service",
    "Druva": "https://www.techradar.com/reviews/druva-data-loss-prevention",
    "virtualization": "https://www.techradar.com/best/best-virtual-machine-software",
    "network attached storage (NAS)": "https://www.techradar.com/news/the-10-best-nas-devices-reviewed"
  }
}