{
  "source": "https://www.techradar.com/news/turbotax-maker-intuit-in-dollar10bn-takeover-talks-with-email-firm-mailchimp",
  "title": "TurboTax maker Intuit in $10bn takeover talks with email firm Mailchimp",
  "category": "computing",
  "updated": "2021-09-01T20:30:59Z",
  "author": "anthony-spadafora",
  "summary": "Acquisition would be Intuit's largest deal yet",
  "article": [
    "Intuit, the company behind both TurboTax and QuickBooks, is reportedly in talks to acquire the email marketing firm Mailchimp for $10bn.",
    "As reported by Bloomberg, talks between the two companies are ongoing according to people familiar with the matter. If Intuit does end up acquiring Mailchimp, it would be the company's largest deal ever.",
    "While no final decision has apparently been made yet, discussions could still fall through. The anonymous sources familiar with the potential deal who spoke with Bloomberg also said that another buyer could emerge as several parties are interested in Mailchimp.",
    "Intuit also recently released its Q4 financial results as well as its results for the full year, revealing in a press release that the company brought in $9.6bn in total revenue for the year as well as $2.6bn during the fourth quarter. Intuit attributes some of it success last quarter to the addition of Credit Karma to its portfolio.",
    "If the deal between Intuit and Mailchimp does come to be, it would unite two makers of small business software while giving Intuit a presence in the growing email marketing space.",
    "While Intuit has provided its QuickBooks accounting software to businesses for decades, the company supplemented this offering with its $7.1bn acquisition of Credit Karma last year. Mailchimp meanwhile delivers digital marketing services to small businesses including social advertising, shoppable links and automation products.",
    "Back in August, Bloomberg reported that Mailchimp was considering a sale though the company is also open to offering a minority stake according to those familiar with the matter. While Intuit has set its eyes on Mailchimp, so too have private equity firms and other large tech companies.",
    "We'll have to wait and see as to whether or not Intuit does end up acquiring Mailchimp or if the email marketing firm decides to court another buyer instead.",
    "Via Bloomberg"
  ],
  "headers": {
    "4": "Expanding its small business offerings"
  },
  "links": {
    "TurboTax": "https://www.techradar.com/reviews/intuit-turbotax",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks",
    "email marketing": "https://www.techradar.com/best/best-email-marketing-software",
    "reported": "https://www.bloomberg.com/news/articles/2021-08-11/mailchimp-is-said-to-explore-sale-at-10-billion-plus-valuation",
    "Mailchimp": "https://www.techradar.com/reviews/mailchimp",
    "Intuit": "https://www.techradar.com/news/turbotax-maker-intuit-says-it-is-dropping-out-of-irs-free-file-program",
    "press release": "https://www.intuit.com/company/press-room/press-releases/2021/intuit-reports-strong-full-year-results-and-sets-fiscal-2022-guidance/",
    "Credit Karma": "https://www.techradar.com/news/intuit-takeover-of-credit-karma-probed-by-justice-department",
    "small business software": "https://www.techradar.com/best/best-small-business-software",
    "accounting software": "https://www.techradar.com/best/accounting-software-small-business",
    "shoppable links": "https://www.techradar.com/news/twitter-will-let-businesses-add-a-shopping-section-to-their-profiles",
    "private equity firms": "https://www.techradar.com/news/dell-sells-rsa-cybersecurity-arm-in-billion-dollar-deal",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-09-01/intuit-said-in-talks-to-buy-mailchimp-for-more-than-10-billion"
  }
}