{
  "source": "https://www.techradar.com/news/quicksilver-in-wandavision-explained-what-we-know-about-pietro-maximoff",
  "title": "WandaVision episode 5's cool cameo explained",
  "category": "entertainment",
  "updated": "2021-02-06T18:40:09Z",
  "author": "richard-edwards",
  "summary": "Huge spoilers ahead",
  "article": [
    "Spoilers for WandaVision follow.",
    "Since the first Blade, X-Men and Spider-Man films started flying the flag for Marvel at the turn of the century, we’ve become used to our favorite comic book characters existing in entirely different movie continuities. The big finale of WandaVision’s fifth episode may have changed all that forever.",
    "The biggest news wasn’t that Wanda Maximoff’s twin brother, Pietro, turned up at the front door of her Westview home – even though we’d seen him die in Avengers: Age of Ultron. It was that he was played by Evan Peters, the actor who played the super-fast mutant in three X-Men films – the same superhero in an entirely different screen franchise.",
    "As we wait to see how this emotional Maximoff family reunion plays out in WandaVision, we'll explain who Pietro is, his MCU backstory, and why there are two movie versions of the same character.",
    "Pietro is the twin brother of Wanda Maximoff, the main protagonist/antagonist (we’re not yet sure which – she could even be both) of WandaVision.",
    "The siblings grew up in the Eastern European country of Sokovia. When they were 10 years old, their parents were killed in a bombing raid on their apartment building. Some of the artillery used was manufactured by Stark Industries, which seeded a burning hatred of Tony Stark (Iron Man).",
    "HYDRA commander Baron von Strucker took advantage of the twins’ anti-Stark feelings to enlist them as test subjects for top secret experiments involving the Mind Stone – the Infinity Stone housed in Loki’s Scepter, that would later be used to power Vision. While many of von Strucker’s ‘volunteers’ died, the Maximoff siblings ended up with superpowers: Wanda picked up various telekinetic and telepathic abilities (usually signified by a characteristic red glow), while Pietro gained the ability to run really, really fast.",
    "They initially fought for HYDRA in Avengers: Age of Ultron, defending von Strucker’s Sokovian research facility when it was stormed by the Avengers. After von Strucker was taken into custody, rogue AI Ultron capitalized on the twins’ hatred of their common enemy, Stark, and recruited them to his cause – reasoning that Wanda could tear the Avengers apart “from the inside”. Eventually they realized that Ultron’s real plan went way beyond bumping off Stark, Captain America, Black Widow and the rest – he wanted to wipe out all of humanity. They ended up fighting alongside the Avengers at the Battle of Sokovia, taking on Ultron’s army of mechanical Sentries. Pietro died in the fight, sacrificing himself to save Hawkeye and a child he was protecting.",
    "Despite her brother’s passing, Wanda became a full member of the Avengers. Her subsequent journey has been anything but plain sailing, however – even though she fell in love with the Avengers’ resident Synthezoid. An accident during a battle in Lagos, Nigeria (seen in Captain America: Civil War) led to the death of 26 civilians, and prompted the instigation of the Sokovia Accords – regulations restricting superhero activity. Wanda sided with Captain America and Black Widow in opposing the new rules, and was forced to go on the run when the Avengers split.",
    "Although she and Vision were on opposing sides in the Avengers’ dispute, they spent the following months meeting up on the sly. Their love story ended in tragedy when Thanos turned up with designs on the Mind Stone embedded in Vision’s forehead. Realizing that Vision was doomed whatever, Wanda attempted to use her powers to destroy the stone before Thanos could load it into his gauntlet.",
    "She nearly succeeded, but Thanos was able to use the Time Stone to travel back a few seconds, and grab the Stone for himself. Vision was killed and Wanda was one of the 50% dusted by Thanos’s infamous finger snap. She was brought back from ‘the Blip’ five years later, but Vision remained dead.",
    "Within days, she’d reclaimed his body from a top-secret SWORD facility, and taken him into the alternative sitcom reality she’d (seemingly) created in Westview, New Jersey.",
    "Now that Pietro Maximoff has turned up at Wanda and Vision’s front door, that’s the biggest (of many) questions in WandaVision. Monica Rambeau had already alluded to the fact Pietro was killed by Ultron, so we know it’s relevant in Wanda’s timeline. But five episodes in, we’ve learned that in WandaVision, little is as it seems.",
    "The Pietro Maximoff we saw in Age of Ultron was played by Aaron Taylor-Johnson, but in WandaVision, he’s played by Evan Peters. This isn’t just a random casting change, however – in fact, Peters has already played the character in three different movies, compared to Taylor-Johnson’s one.",
    "Peters’ version of Maximoff – nicknamed Quicksilver, for obvious reasons – made his first movie appearance in the 1970s-set X-Men: Days of Future Past, taking part in a memorable slo-mo prison break to free an incarcerated Magneto. He went on to appear in a couple more X-movies, the ’80s-set Apocalypse and the ’90s-set Dark Phoenix.",
    "This was a completely different version of the character, existing in an entirely separate continuity. He was even referred to as Peter rather than Pietro – unsurprising, perhaps, seeing as this incarnation had grown up in the US.",
    "Why have two different versions of the same character? It’s all a question of movie rights. When Twentieth Century Fox bought the rights to the X-Men in the ’1990s, they were buying a license to use any of Marvel Comics’ mutant characters. (In a similar way, Sony’s Spider-Man deal gives them the rights to characters associated with the Wallcrawler.)",
    "However, when Marvel decided to go it alone with Marvel Studios – creating the MCU in the process – they kept hold of the rights to the Avengers. This meant that any characters that were both mutants and Avengers fell into a gray area at the point where two circles of the Venn diagram intersect.",
    "For that reason, Pietro and Wanda Maximoff were both up for grabs in both the X-Men and MCU franchises – though only the MCU took up the option on Wanda (we do briefly meet Peter's unnamed sister in Days of Future Past, however).",
    "Since Disney bought Fox in 2019, the mutants and the Avengers have fallen under the same corporate umbrella, giving Marvel Studios the opportunity to start ‘crossing the streams’.",
    "While Dr Darcy Lewis is aware that Pietro has been ‘recast’, it’s not clear whether it’s the character we met in Age of Ultron, the version from the X-movies, or an entirely different construct. Whoever this Pietro turns out to be, it’s unlikely the X-franchise movies will slot directly into the meticulously constructed MCU continuity – not only do the 11 films (13 if you include Deadpool) directly contradict what happens in the MCU, they frequently contradict themselves.",
    "One explanation, however, could be the exploration of multiverses, parallel timelines within the wider MCU. We know, for example, that after WandaVision, Wanda’s going to pop up in Doctor Strange in the Multiverse of Madness, while it’s strongly rumored that heroes and villains from previous Spider-series are going to return in the Tom Holland-fronted follow-up to Spider-Man: Far From Home.",
    "Perhaps Wanda has literally opened the door on the MCU’s exploration of the multiverse? Maybe Evan Peters’ Pietro has wandered in from a parallel universe where all the events of the X-Men saga took place?",
    "Created by the legendary partnership of Stan Lee and Jack Kirby, Pietro and Wanda Maximoff go back to the early days of the X-Men, making their debuts in X-Men #4 in 1964.",
    "Their backstory gets even more intriguing in the comics, where they’re the children of Erik Lehnsherr, aka Magneto. We don’t even know if Magneto exists in the main MCU timeline, of course, so it’s debatable whether the twins have the same origins.",
    "The fact the parents of the MCU Maximoffs were killed in that fateful bombing in Sokovia could be a red herring, however. Even in the comics, the twins only discovered later on that their dad was that infamous manipulator of metal, Magneto, having instead been raised by Django and Marya Maximoff.",
    "It could be that the parents they lost in Sokovia were adoptive, and their real heritage is yet to be discovered. That could also raise further questions about the source of their powers. Could it be that their abilities were activated by – rather than created by – the Mind Stone?",
    "New episodes of WandaVision are available every Friday on Disney Plus."
  ],
  "headers": {
    "4": "Who is Pietro Maximoff in the MCU?",
    "12": "How has the late Pietro Maximoff turned up in WandaVision?",
    "13": "Why does Pietro Maximoff look different in WandaVision?",
    "20": "Are the X-Men movies now part of the MCU? Are multiverses involved?",
    "23": "Can we learn anything about the Maximoffs from the comics?"
  },
  "links": {}
}