{
  "source": "https://www.techradar.com/news/3-reasons-why-amazon-may-make-a-foldable-kindle",
  "title": "3 reasons why Amazon may make a foldable Kindle",
  "category": "tablets",
  "updated": "2021-07-25T07:00:59Z",
  "author": "james-rogerson",
  "summary": "And two reasons why it might not",
  "article": [
    "Foldable phones look set to become increasingly popular and now it seems companies are wondering what else they can fold, with the humble ereader apparently being considered.",
    "According to Goodereader, Amazon is having internal discussions about the possibility of a foldable Kindle. This is supposedly only in the conceptual stage so far, so there’s every chance it won’t happen, and if it does it might not for a long time.",
    "But should it? We can think of at least three reasons Amazon really should make a foldable Kindle, and two reasons why keeping it inflexible might be preferable. You’ll find all of these below.",
    "If Amazon really is thinking of making a foldable Kindle ereader, then the following three things are probably major factors.",
    "Kindles are great to read on, but as impressively paper-like as their screens can sometimes seem visually, they lack paper’s bendable nature.",
    "That’s not necessarily a problem, but it does mean the experience ultimately feels quite different to a book, where you fold it open or perhaps even bend the pages back. With a foldable Kindle though Amazon could come a lot closer to replicating this feeling.",
    "You’d still likely have the sensation of touching a screen, but you’d get some of the tactility of a physical book, and that could help convert those who prefer the physical nature of a paperback.",
    "The compact size of Amazon Kindles makes them ideal for reading books on, but they’re not such a natural fit for newspapers, magazines or comics, which tend to be printed on larger paper.",
    "With a foldable Kindle – depending on the design - this could be solved, allowing you to shift from a screen that’s roughly book sized to one that’s closer to the size of a magazine. That could make Kindles a lot more versatile.",
    "The Kindle hasn’t massively changed in years now. Sure, the screen often gets slightly better with new generations, the interface might get slightly smoother, and the design might be tweaked, but ultimately whether your Kindle is one of the latest models or several generations old, and whether it’s the premium Kindle Oasis or the entry-level Kindle, the experience is pretty similar.",
    "With a foldable Kindle though, you’d get something very different and new, and that could make Kindles exciting again, and push those who’ve been clinging on to their Kindle for years to upgrade.",
    "While there are lots of potential good points to a foldable Kindle, there are also some reasons Amazon might reject the idea.",
    "Foldable phones are very expensive, and a foldable Kindle almost certainly would be as well. We’re probably not talking Samsung Galaxy Z Fold 2 prices here – after all, much of the hardware would still be more basic in a Kindle, and it would presumably lack cameras and the like.",
    "But making the screen fold and having a bigger screen – as well as potentially a second screen, depending on the design - would inevitably push the price way up. That’s likely to mean this would be a niche device, since one of the appealing aspects of the Kindle range is how affordable they are, especially for basic models.",
    "We doubt many people want to drop many hundreds of dollars/pounds on a device that largely just replicates the experience of reading a book – something you can already do with no outlay other than buying the books themselves, which you’d still need to do here.",
    "Amazon has at times proudly advertised the Kindle as being lighter than a paperback, which is something it almost certainly wouldn’t be able to do with a foldable model.",
    "Making the screen bigger (which would be part of the point of a foldable) would inevitably add weight, and marketing aside that could be a real issue. Current Kindles are so light you can happily carry one with you anywhere, and hold them for extended periods. If they get heavier then both of those selling points would become compromised."
  ],
  "headers": {
    "3": "Why Amazon might make a foldable Kindle",
    "4": "1. It could better replicate the experience of reading a physical book",
    "7": "2. The size could be adjusted to suit both books and comics",
    "9": "3. It would give Kindles a new selling point",
    "11": "Why Amazon might not make a foldable Kindle",
    "12": "1. It would push the price up substantially",
    "15": "2. It would likely add weight"
  },
  "links": {
    "ereader": "https://www.techradar.com/best/best-ereader",
    "Goodereader": "https://goodereader.com/blog/electronic-readers/amazon-is-working-on-a-foldable-kindle",
    "Kindle": "https://www.techradar.com/reviews/amazon-kindle-review",
    "Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review"
  }
}