{
  "source": "https://www.techradar.com/news/windows-10-driver-loading-is-finally-getting-a-major-overhaul",
  "title": "Windows 10 driver loading is finally getting a major overhaul",
  "category": "computing",
  "updated": "2021-05-18T16:44:47Z",
  "author": "anthony-spadafora",
  "summary": "Windows users will soon be able to load new drivers using Device Manager",
  "article": [
    "Finding the right driver for devices connected to your Windows 10 PC could soon be a lot easier as Microsoft is currently testing a feature that will allow users to install new drivers without having to identify a device first.",
    "Drivers allow your devices to communicate with each other and your operating system and on Windows 10, a range of generic drivers for keyboards, monitors, Bluetooth and other hardware come included with the operating system.",
    "Drivers are usually downloaded and installed automatically via Windows Update but these are not always the latest version available. For this reason, users can also install drivers manually using Device Manager though identifying the correct device can sometimes be difficult.",
    "In preview builds of Windows 10, Microsoft is now testing out a new “Add driver” option that allows users to more easily install drivers. However, this feature only works for new devices and can't be used to update existing drivers.",
    "In a new blog post announcing Windows 10 Insider Preview Build 21382, Microsoft confirmed that Device Manager now has the ability to view drivers alongside devices after the feature was spotted by several Insiders.",
    "These new driver views allow users to see “Devices by drivers”, “Drivers by type” and “Drivers by devices” so that they can install and remove drivers more easily. Microsoft explained the reason for the change, saying:",
    "“Managing drivers directly is more intuitive in many situations than working with them by way of the devices they are installed on, so we hope that developers and power users alike will enjoy the added flexibility.”",
    "While Windows Insiders can test out these new driver-related features now, users that want to make sure they're using the latest drivers on their systems can check out our best driver update software guide to keep their drivers updated automatically.",
    "Via Windows Latest"
  ],
  "headers": {
    "4": "New driver views"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Windows Update": "https://www.techradar.com/how-to/how-to-get-the-windows-10-may-2021-21h1-update",
    "Device Manager": "https://www.techradar.com/news/windows-10-has-killed-off-driver-updates-via-device-manager",
    "blog post": "https://blogs.windows.com/windows-insider/2021/05/14/announcing-windows-10-insider-preview-build-21382/",
    "best driver update software": "https://www.techradar.com/best/best-driver-update-software",
    "Windows Latest": "https://www.windowslatest.com/2021/05/16/windows-10-you-can-soon-quickly-load-new-drivers-via-device-manager/"
  }
}