{
  "source": "https://www.techradar.com/news/mcafee-told-to-refund-customers-following-auto-renew-probe",
  "title": "McAfee told to refund customers following auto-renew probe",
  "category": "computing",
  "updated": "2021-05-26T12:01:22Z",
  "author": "sead-fadilpasic",
  "summary": "Users should not be tied into auto-renewing contracts for products they no longer want or need, CMA said.",
  "article": [
    "Popular antivirus company McAfee will be forced to refund a number of customers who were hit with unwanted subscriptions following a ruling from the UK’s Competition and Markets Authority (CMA).",
    "The ruling followed a super-complaint filed by the Citizens Advice watchodg following numerous consumer reports that their subscriptions auto-renewed without their approval.",
    "Customers will be able to unsubscribe and demand a refund for the remaining months, with McAfee needing to allow refunds for those who were previously denied following similar complaints in 2020.",
    "But the company will need to do a lot more than just refund those who demand their money back - it will also need to improve how it communicates services and prices going forward.",
    "The process of killing auto-renewals needs to be more visible, easier and more straightforward, with McAfee told it needs to be clearer on how much it charges for what, especially about the increase in pricing in the second year of the subscription.",
    "“People should not be tied into auto-renewing contracts for products they no longer want or need,\" said CMA chief executive Andrea Coscelli.",
    "“Subscriptions should be clearly described, easy to exit and customers should not be tied into ongoing auto-renewals without adequate refund rights.”",
    "McAfee has looked to spin the decision as an opportunity to improve its services, saying in a statement that:",
    "“McAfee is pleased to have reached an agreement with the CMA on our shared goal of improving the ease, fairness, and transparency of business-to-consumer practices and policies.”",
    "“Our work with the CMA aligned with our efforts to enable customers to maintain ongoing protection while retaining control over their McAfee subscription.”",
    "The CMA has pursued several other antivirus companies and shady renewal practices for some time, having recently also taken Norton to court for refusing to provide information on how it handles auto-renewals.",
    "Via: City AM"
  ],
  "headers": {
    "7": "Improving the customer experience"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "City AM": "https://www.cityam.com/mcafee-forced-to-refund-customers-following-auto-renew-probe/"
  }
}