{
  "source": "https://www.techradar.com/news/the-legal-battle-over-cryptocurrency-xrp-has-taken-another-turn",
  "title": "The legal battle over cryptocurrency XRP has taken another turn",
  "category": "computing",
  "updated": "2021-05-06T11:03:35Z",
  "author": "joel-khalili",
  "summary": "Ripple wants to stop the SEC asking foreign regulators for assistance with the XRP investigation",
  "article": [
    "There has been yet another development in the legal battle between the Securities and Exchange Commission (SEC) and Ripple over the sale and classification of cryptocurrency XRP.",
    "The SEC recently delivered a letter to the presiding judge objecting to a motion that would prevent the regulator from asking foreign authorities for data relating to the transfer of XRP to crypto exchanges based outside the US.",
    "Without this information, which Ripple claims it does not itself possess, the SEC cannot establish a timeline that may show Ripple deliberately executed a marketing strategy designed to lift the price of XRP.",
    "In December, the SEC launched a surprise lawsuit against Ripple and two of its executives, co-founder Chris Larsen and CEO Brad Garlinghouse. The regulator claims the ongoing sale of XRP to individual investors amounts to a violation of securities law.",
    "The SEC hopes to bolster its case by proving Ripple deliberately manipulated the price of the cryptocurrency with strategically timed announcements.",
    "So far, analysis of crypto wallets belonging to Larsen and Garlinghouse has revealed that massive quantities of XRP were delivered to exchanges headquartered on foreign soil. However, according to the SEC letter, Ripple has “not turned over a single document concerning a non-US domiciled digital asset account or otherwise explained the significance of these XRP transfers”.",
    "The regulator is now fighting to preserve its right to seek out intraday trade data for XRP by other means, via foreign trading platforms.",
    "“While the SEC also attempted to obtain this information directly from Ripple, Ripple recently told the SEC that Ripple does not have it either, leaving the only avenue for investigation offshore,” the letter explains.",
    "However, it doesn’t sound as if enquiries are off to a strong start, with requests to nine different foreign regulators leaving investigators all but empty handed. As per the letter, two regulators declined to offer assistance, and a further three would not allow the SEC to publish their communications. Just one regulator suggested the SEC may be able to use conversations between the two parties to assist in its case.",
    "If the judge were to grant Ripple’s motion, the SEC would have to cease and withdraw requests made to foreign regulatory authorities, effectively putting an end to this line of enquiry.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies."
  ],
  "headers": {
    "3": "XRP lawsuit"
  },
  "links": {
    "legal battle": "https://www.techradar.com/news/the-legal-battle-over-cryptocurrency-xrp-is-hotting-up",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "a letter": "https://www.courtlistener.com/recap/gov.uscourts.nysd.551082/gov.uscourts.nysd.551082.136.0.pdf",
    "crypto exchanges": "https://www.techradar.com/best/mining-rigs",
    "crypto wallets": "https://www.techradar.com/news/best-bitcoin-wallets"
  }
}