{
  "source": "https://www.techradar.com/news/verizon-claims-its-new-vpn-can-withstand-attacks-from-quantum-computers",
  "title": "Verizon claims its new VPN can withstand attacks from quantum computers",
  "category": "computing",
  "updated": "2021-08-27T14:17:38Z",
  "author": "mayank-sharma",
  "summary": "Verizon’s upcoming VPN tech relies on post-quantum cryptography ciphers",
  "article": [
    "Verizon is testing a new \"quantum-safe\" VPN, which it hopes is resilient enough to withstand the onslaught of quantum computers, which could neuter current cryptography with their immense computing prowess.",
    "As quantum computers inch ever closer towards reality, researchers around the world are designing post-quantum algorithms and hardware that they hope will be able to stand against the seemingly unlimited computing performance promised by the new technology.",
    "Verizon has now jumped on the bandwagon by trialing a tool it hopes one day can oppose quantum computer’s potential for breaking today’s public key encryption ciphers.",
    "“This technology uses session key exchange security mechanisms or cryptographic ciphers that can provide a higher level of protection. Essentially, it’s a solution that enhances encryption methodologies today in order to make them even more difficult to hack tomorrow,” explains Verizon.",
    "Verizon’s quantum-safe VPN relies on encryption keys that were generated thanks to post-quantum cryptography methods.",
    "In the trial, Verizon used its quantum-safe VPN between one of its labs in London, and a US-based center in Ashburn, Virginia.",
    "While VPNs have always been popular for their privacy enhancing features, they have off-late become an essential component in the IT stack of today’s increasingly remote workforce, which relies on it to securely access remote corporate resources.",
    "As Verizon explains, VPN is based on cryptography protocols that though are very secure, can be cracked with incredible amounts of compute. Although the process is currently infeasible, it won’t be much of a challenge for a quantum computer.",
    "\"A lot of secure communications rely on algorithms which have been very successful in offering secure cryptography keys for decades. But there is enough research out there saying that these can be broken when there is a quantum computer available at a certain capacity,\" Venkata Josyula, the director of technology at Verizon, tells ZDNet.",
    "Josyula adds that the company hopes that their quantum-safe VPN will eventually be able to ensure the integrity of the connection even in the post-quantum era.",
    "Via ZDNet"
  ],
  "headers": {
    "4": "Post-quantum computing"
  },
  "links": {
    "Verizon": "https://www.techradar.com/deals/the-best-verizon-deals-sales-discounts",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "post-quantum algorithms": "https://www.techradar.com/news/this-quantum-chip-has-been-infected-with-dangerous-malware-but-for-a-good-cause",
    "public key encryption": "https://www.techradar.com/best/best-encryption-software",
    "cryptographic ciphers": "https://www.techradar.com/news/what-is-cryptography",
    "explains Verizon": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1515476530653744000/https://www.verizon.com/about/news/verizon-quantum-safe-vpns-data",
    "remote workforce": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "securely access remote": "https://www.techradar.com/news/best-remote-desktop-software",
    "ZDNet": "https://www.zdnet.com/article/quantum-computers-could-read-all-our-encrypted-data-this-quantum-safe-vpn-is-trying-to-prevent-that/"
  }
}