{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-dummy-unit-shows-off-the-phones-new-design",
  "title": "Samsung Galaxy S22 Ultra dummy unit shows off the phone's new design",
  "category": "phones",
  "updated": "2021-10-10T09:30:51Z",
  "author": "david-nield",
  "summary": "Not your normal S series look",
  "article": [
    "With the Apple iPhone 13 now out and the Google Pixel 6 about to launch, it'll soon be all eyes on Samsung for the arrival of the Galaxy S22 series of phones – and a new leak gives us more evidence of the redesign that appears to be on the way for the Ultra model.",
    "A dummy unit of the Galaxy S22 Ultra revealed by Italian outlet CoverPigtou and tipster @xleaks7 shows the P-shaped rear camera module that we've seen in previous leaks, as well as the flat design for the top and bottom of the phone.",
    "As has been noted before when we saw some unofficial renders of this same device, it has a distinct Galaxy Note look about it. Remember that the Galaxy Note 21 never saw the light of day, and the S22 Ultra is now widely expected to be the Note replacement for 2022.",
    "According to the same source that revealed this dummy unit, the Galaxy S22 Ultra will indeed have an integrated slot to house the S Pen. While the Galaxy S21 Ultra supported the stylus, you needed a special case to actually carry it along with the phone.",
    "Nothing else that's new is revealed here: we've got the volume and power buttons down the right-hand edge of the handset as you look at it, as you would expect, with the left-hand side left free from any buttons or ports.",
    "We've also seen unofficial case renders from a reliable source that show the same design for the Galaxy S22 Ultra, adding more weight to the idea that this model is going to look substantially different to the standard Galaxy S22 and the Galaxy S22 Plus.",
    "We've seen a lot of speculation about Samsung's smartphone plans for 2022 – everything from when the devices will actually appear, to the question of whether or not the premium Galaxy Note series is going to make a dramatic return to the market.",
    "As more and more leaks start to show up, it looks more and more likely that the Galaxy Note 22 will be making an appearance in the form of the Galaxy S22 Ultra. Whether Samsung actually gives it the Note moniker to confirm the switch remains to be seen, but it seems to be on the cards.",
    "We've now seen this Note-style design with the P-shaped camera from several sources, which carries a lot more weight than a single rumor on its own. It's possible that Samsung has come round to the idea that three S series phones is one more than they need, especially as the effects of the pandemic continue to be felt.",
    "There's still plenty that we're not sure about, however. We had been expecting the Galaxy S22 phones to launch in January, but that's now in doubt – the rumor is that the long-awaited Samsung Galaxy S21 FE could be the phone to arrive in January instead."
  ],
  "headers": {
    "3": "Room for the S Pen",
    "6": "Analysis: Samsung's 2022 plans come into focus"
  },
  "links": {
    "Apple iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "CoverPigtou": "https://coverpigtou.it/",
    "@xleaks7": "https://twitter.com/xleaks7/status/1446452999660912643",
    "unofficial renders": "https://www.techradar.com/news/samsung-galaxy-s22-and-s22-renders-leak-out-hint-at-a-galaxy-note-22-ultra",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "case renders": "https://www.techradar.com/news/samsung-galaxy-s22-case-renders-show-big-changes-for-the-s22-ultra",
    "will actually appear": "https://www.techradar.com/news/best-phone",
    "return to the market": "https://www.techradar.com/news/samsung-galaxy-note-22",
    "will be making an appearance": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-basically-sounds-like-the-note-21-at-this-point",
    "several sources": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-shown-off-in-full-by-unofficial-renders",
    "now in doubt": "https://www.techradar.com/news/samsung-galaxy-s22-may-be-delayed-with-galaxy-s21-fe-taking-its-place-in-january",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition"
  }
}