{
  "source": "https://www.techradar.com/news/the-chip-shortage-is-far-from-over-according-to-samsung",
  "title": "The chip shortage is far from over according to Samsung",
  "category": "computing",
  "updated": "2021-12-07T11:37:30Z",
  "author": "jess-weatherbed",
  "summary": "Samsung chips in regarding the chip shortage",
  "article": [
    "Samsung estimates that the chip shortage will last until the second half of 2022, offering another possible timeline to when we can expect production levels of tech and gadgets to increase.",
    "As reported by TheElec, the shortage was discussed by TM Roh, the president of Samsung Mobile, in a meeting with senior executives from over 30 smartphone component suppliers regarding their business plans for 2022.",
    "The H2 2022 date isn't too dissimilar to what other large brands have predicted in the last few months, though Toshiba estimates that the shortage could endure into 2023, with Takeshi Kamebuchi, head of semiconductors at Toshiba, claiming that “the supply of chips will remain very tight until at least September next year. In some cases, we may find some customers not being fully served until 2023.”",
    "Given there are various predictions flying around, the safest bet is to simply not take any of it as gospel. It's a fairly grim thought to picture that we could be facing an even longer struggle as the production of popular tech fails to meet demand, but there is simply no accurate way of knowing when chip manufacturers will be able to increase supplies.",
    "There is some good news at least, with Samsung pushing for annual contracts with chip foundries to secure what little chip production is being squeezed out. The firm is also looking to stock up to four weeks' worth of chip supplies instead of the two weeks it currently does, which should ease things if the availability of chips drops again.",
    "Even with these predictions flying around, the shortage won't be alleviated overnight, so it's not like we're going to wake up in 18 months' time and find that PS5 consoles and graphics cards are suddenly plentiful.",
    "One of the major issues is that these chips are in everything, from the phones, games consoles and computing components you'd expect, to items that you wouldn't otherwise suspect, such as cameras, cars and even home appliances.",
    "AI-integrated appliances and other smart home tech are exciting developments, but alongside other new developments they're constantly pushing the demand for chips. Without additional manufacturing capabilities in the next few years, we could start to see demand increasing beyond our current means of production even if facilities can work back up to full capacity.",
    "Right now, don't expect any of that tech you've been eyeing up to hit the sales. In fact, used cars saw their first yearly price increase for the first time in 68 years of tracking, with prices rising almost 10% in 2021, so you could be paying more for used goods, let alone brand new hardware.",
    "And don't get us started with selling used graphics cards in the current market – with the current availability of the latest Nvidia and AMD hardware so poor, scalpers have been having a field day reselling coveted products like the GeForce RTX 3060 online for up to 3x the retail price. As a result, even dated, well-loved GPUs are selling for more than they should be on sites like eBay.",
    "Look after the gadgets you have right now, and be prepared to have a rough time acquiring new tech in the coming months. We're not out of the woods yet, and the treeline is looking a tad sketchy."
  ],
  "headers": {
    "5": "Analysis: We're in for a rough few years"
  },
  "links": {
    "TheElec": "http://www.thelec.net/news/articleView.html?idxno=3652",
    "shortage could endure into 2023": "https://www.techradar.com/news/global-chip-shortage-could-drag-on-until-2023",
    "PS5 consoles": "https://www.techradar.com/news/where-to-buy-ps5",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458"
  }
}