{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-november-26-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-11-26T15:00:08Z",
  "author": "axel-metz",
  "summary": "Here’s what’s new on Netflix and other streamers this weekend",
  "article": [
    "It’s not even December yet, but that hasn’t stopped the Christmas movies arriving on streamers thick and fast. Yes, Halloween has been and gone, so expect holly to replace horror for at least the next month.",
    "That sled-load of festive filmmaking begins now, with the likes of A Boy Called Christmas, 8-Bit Christmas and Robin Robin here to remind us that the holiday season is indeed just around the corner (sort of). Hell, even Hawkeye – Disney Plus’ latest MCU show – is holiday themed.",
    "Below, we’ve rounded up the seven biggest additions coming to streamers over the next few days, with Netflix, Prime Video and HBO Max all benefiting from new movies and TV series worth tuning into this November weekend.",
    "Following in the footsteps of WandaVision, The Falcon and the Winter Soldier, Loki, and What If...?, Hawkeye arrives on Disney Plus this week to continue Marvel’s ambitious Phase 4 plans.",
    "In this six-part, Christmas-set series, Clint Barton (aka Hawkeye) finds himself in teacher mode as he takes a new Hawkeye, Hailee Steinfeld’s Kate Bishop, under his wing. This one takes its cues from the Matt Fraction and David Aja run of comic books, and is expected to feature both Daredevil's Kingpin (Vincent D'Onofrio) and Black Widow’s Yelena Belova (Florence Pugh).",
    "We sat down with director Rhys Thomas and producer Trinh Tran to discuss the series in more detail, and the pair even teased the role of the multiverse in Marvel’s latest serialised adventure. You’ll find the first two episodes available to stream on Disney Plus right now.",
    "Episodes 1 and 2 are now available to stream on Disney Plus",
    "A collaboration with UK broadcaster Sky, Gil Kenan's A Boy Called Christmas follows the journey of Nikolas, a seemingly ordinary boy who sets out on an adventure in search of his father and the fabled village of the elves.",
    "Standard Christmas fare, then, but this one also boasts a stacked cast which includes Maggie Smith, Kristen Wiig, Jim Broadbent and Sally Hawkins – so expect fuzzy, festive feels for all the family.",
    "We're not going to suggest that A Boy Called Christmas is Godfather-level filmmaking, but we reckon it’ll still make for a heartwarming watch in the run-up to Christmas. As you’d expect, UK viewers will find this one on Sky, rather than Netflix.",
    "Now available to stream on Netflix in the US",
    "Much has been made of the runtime for The Beatles: Get Back and, well, fans are right to raise an eyebrow – Peter Jackson’s three-part music documentary is six hours long. Still, that’s an acceptable figure given the 60 hours of footage director Michael Lindsay-Hogg captured of the world’s most famous band in 1969.",
    "That year, the Beatles wrote and rehearsed 14 new songs that would eventually end up on their final albums, Abbey Road and Let It Be, and Jackson spent three years editing and restoring Lindsay-Hogg’s material to offer audiences an unprecedented look at how those seminal works came together.",
    "Come for the BTS footage, but stay for the band’s legendary final concert, performed from the rooftop of their London headquarters and shown here in its entirety for the first time in history.",
    "Now available to stream on Disney Plus",
    "In Halle Berry’s directorial debut, a disgraced MMA fighter (played by Berry herself) is forced to find redemption in the cage when the son she gave up as an infant unexpectedly re-enters her life.",
    "If that all sounds rather clichéd, that’s because it is, but Berry filmed parts of this one while suffering from a set of broken ribs (in fear of being shut down), so we’re inclined to support her efforts on that basis alone.",
    "Reviews have been mixed so far, but boxing and MMA fans will likely find lots to love here – including all the Rocky tropes one could hope to see in a movie.",
    "Now available to stream on Netflix",
    "This HBO Max-exclusive holiday movie is set in 1980s Chicago and centers on a 10-year-old boy who hopes to get the ultimate Christmas gift: a Nintendo. Here at TechRadar, that’s a wish we can get behind (and since it’s Black Friday, check out our Black Friday Nintendo Switch deals, won’t you?).",
    "Michael Dowse directs this adaptation of Kevin Jakubowski's book with a cast that includes Neil Patrick Harris, June Diane Raphael, Steve Zahn and newcomer Winslow Fegley. To be honest, it looks like dumb fun, but also worth watching if silly Chrismas films are your thing.",
    "8-Bit Christmas is only available to HBO Max subscribers in the US, though, so UK viewers will have to wait until this one lands on Sky (as it surely will do before the day itself).",
    "Now available to stream on HBO Max",
    "Ramping up the festive cheer even further is Robin Robin, a 30-minute short from Wallace and Gromit studio Aardman Animations which follows the identity crisis of a robin who thinks she’s a mouse – yes, really.",
    "This endearing adventure is directed by duo Michael Please and Dan Ojari, and features the voices of Gillian Anderson and Richard E. Grant. It also sees Aardman swapping clay for felt in its quest to tug at your heartstrings.",
    "Of all the Christmas-themed content we’ve listed so far, we reckon this’ll be the one to bring you the most joy. And, at just half an hour, there’s really no risk involved in giving it a try.",
    "Now available to stream on Netflix",
    "One for the sports fans, here. All or Nothing: Juventus continues Amazon’s popular behind-the-scenes series to this time take a look inside the inner temple of Italy’s most successful football club during the 2020/21 season.",
    "Incidentally, that season marked the first time Juventus failed to win the league since 2011, meaning Amazon chose the best moment in a decade to go behind the curtain of the European giants.",
    "If you’re not a football (sorry, soccer…) fan, it’s unlikely you’ll find much to interest you here, but sports fans in general will undoubtedly come away from All or Nothing: Juventus having enjoyed a good time.",
    "Now available to stream on Prime Video"
  ],
  "headers": {
    "3": "Hawkeye (Disney Plus)",
    "7": "A Boy Called Christmas (Netflix)",
    "11": "The Beatles: Get Back (Disney Plus)",
    "15": "Bruised (Netflix)",
    "19": "8-Bit Christmas (HBO Max)",
    "23": "Robin Robin (Netflix)",
    "27": "All or Nothing: Juventus (Amazon Prime Video)"
  },
  "links": {
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "Disney Plus": "https://www.techradar.com/best/best-disney-plus-shows",
    "Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Loki": "https://www.techradar.com/news/loki-season-2",
    "What If...?": "https://www.techradar.com/news/marvels-what-if-is-a-surreal-disney-plus-anthology-show-with-limitless-potential",
    "Marvel’s ambitious Phase 4": "https://www.techradar.com/news/marvel-phase-4",
    "sat down with director Rhys Thomas and producer Trinh Tran": "https://www.techradar.com/news/inside-hawkeye-marvels-holiday-themed-and-most-subversive-show-yet",
    "the role of the multiverse": "https://www.techradar.com/news/is-hawkeye-affected-by-the-multiverse-mcu-shows-director-and-producer-weigh-in",
    "Black Friday Nintendo Switch deals": "https://www.techradar.com/black-friday/nintendo-switch-black-friday-deals"
  }
}