{
  "source": "https://www.techradar.com/news/should-i-buy-a-48-inch-oled-tv",
  "title": "Should I buy a 48-inch OLED TV?",
  "category": "televisions",
  "updated": "2021-03-16T09:19:47Z",
  "author": "henry-st-leger",
  "summary": "A look at the new OLED TV panel size",
  "article": [
    "Should you buy a 48-inch OLED TV? After several years of 55 inches being the smallest you could find an OLED set, things are shaking up, and it means it's easier than ever to fit a highly-specified television into your home.",
    "One of the ongoing criticisms of OLED TVs has been the lack of variety in their panel sizes, with 55-inch, 65-inch, and 77-inch being the only options for a 4K OLED for some time.",
    "That's changing, though, and the 48-inch OLED TV size that launched last year is set to come to even more televisions throughout 2021.",
    "But what's the argument for a 48-inch OLED, will it be as good as a larger screen size, and will the price reduction really be worth it? You'll find answers to all this and more in the guide below, along with some information on other OLED panel sizes we're expecting to launch soon.",
    "Right now there are four OLED televisions that feature 48-inch panel sizes.",
    "There's the LG CX (our favorite 2020 OLED), the Sony A9/A9S (a revision of 2019's Sony A9G), the Philips OLED+935, and the Beovision Contour.",
    "Unusually, you can get a lot more 48-inch OLED TVs in the UK and Europe than in North America. This might have something to do with US shoppers tending to go for larger screen sizes, or having on-average larger homes to fit in a television into.",
    "For a more compact home – say, an apartment on the winding streets of a European city – a 48-inch OLED may be the largest size that can be accommodated. 48-inch OLEDs are scarce in Australia too, though we know the 48-inch LG CX is coming to the region soon.",
    "More 2021 OLED TVs are set to get the 48-inch panel size, including the LG C1 OLED and new entry-level A1 OLED, and we expect Sony and Philips will incorporate 48-inch OLEDs into their ranges yet again. Panasonic has yet to embrace the technology, though that could be set to change this year.",
    "How much does a 48-inch OLED TV cost? It all depends on which television the size is featured on.",
    "Generally, 48-inch OLED TV sizes are being introduced for flagship models, rather than cheaper sets lower down in a TV maker's range. That means a 48-inch OLED TV isn't going to be a bargain buy, but it will offer a way to get premium TV tech at a lower price in most cases.",
    "That hasn't been the case with LG, which has been selling both the 48-inch and 55-inch LG CX OLED versions for $1,499 / £1,299 – meaning the smaller size costs the same in the US and UK. At launch, though, the 48-inch size actually costed more.",
    "The Sony A9S/A9 retails for $1,799 / £1,499 (around AU$2,300, though Australian availability is yet to be confirmed).",
    "Philips' 48-inch OLED+935 is retailing for £1,799 in the UK, while the premium-build Beovision Contour will set you back $5,999 / £5,150 (around AU$8,250).",
    "There's no denying that a larger screen tends to offer a more impactful picture, one where you can see the benefits of modern TV technology more clearly. The advantages of 4K resolution, with all the added detail of those 8 million pixels, will be more apparent on a 55-inch or 65-inch screen than a 48-inch panel.",
    "4K TVs start at a 40-inch size, though, and even with a 48-inch screen you'll be able to get some benefit, especially if you're using it as a solo television you watch on your own, or in a smaller living room.",
    "Just as with a 49-inch LCD TV, the size means it isn't best suited to large spaces with a far-away couch and multiple viewers – though OLED sets are better for off-axis viewing angles, meaning you should be able to enjoy the picture even when watching from the side.",
    "There's a reason that LG's marketing around the 48-inch LG CX shows off a gamer with a controller and headset, too – the smaller size makes it ideal as beefed-up gaming TV, especially with the low input lag, high-contrast picture, and VRR / ALLM support found on LG's OLED TV range.",
    "While 48-inch OLEDs were new in 2020, they're set to be added to with another two panel sizes.",
    "The TV maker LG Electronics has confirmed that an 83-inch size is coming to select 2021 OLEDs, including the LG C1. We expect to see a similar strategy of introducing the new size on the C Series before it becomes more commonplace across the range.",
    "LG Display (which manufactures and supplies OLED panels) has also stated that 42-inch OLED TV panel sizes are in development, though no specific sets have been confirmed so far.",
    "It means that those of you after an even-smaller OLED TV may want to wait a bit longer, though if 48-inch is your sweet spot, the options are already there for you to enjoy."
  ],
  "headers": {
    "4": "What 48-inch OLED TVs are there?",
    "9": "How much does a 48-inch OLED TV cost?",
    "14": "Would a bigger OLED TV be better?",
    "18": "What other OLED TV sizes are coming?"
  },
  "links": {
    "48-inch OLED TV": "https://www.techradar.com/best/48-inch-oled-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "LG CX": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Sony A9G": "https://www.techradar.com/reviews/sony-bravia-a9g-ag9-oled",
    "Philips OLED+935": "https://www.techradar.com/reviews/philips-oled935-tv",
    "Beovision Contour": "https://www.techradar.com/news/bang-and-olufsen-unveils-first-ever-48-inch-oled-tv-and-its-beautiful",
    "coming to the region soon": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1220158302456480000&xs=1&url=https%3A%2F%2Fwww.lg.com%2Fau%2Flg-48-inch-oled-tv&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fshould-i-buy-a-48-inch-oled-tv",
    "LG C1 OLED": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "A1 OLED": "https://www.techradar.com/news/lg-a1-oled-price-release-date-specs-sizes",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "40-inch": "https://www.techradar.com/news/best-40-inch-tv",
    "gaming TV": "https://www.techradar.com/news/best-gaming-tv",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "42-inch OLED TV panel sizes": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them"
  }
}