{
  "source": "https://www.techradar.com/news/moto-g9-series",
  "title": "Moto G9: what phones are in the series and how do they compare?",
  "category": "phones",
  "updated": "2021-05-04T13:45:22Z",
  "author": "tom-bedford",
  "summary": "There are three key phones",
  "article": [
    "If you're considering buying the Moto G9, you might be surprised that there are actually three phones called that - and, at the same time, none at all.",
    "The Moto G9 series of smartphones, launched between late 2020 and early 2021, follows the company's tradition of having several phones in each generation, and there are three here - the Moto G9 Plus, Moto G9 Power, and Moto G9 Play.",
    "However, and unlike previous Moto G lines, there's no phone just called the 'Moto G9'. Instead you've got the three separate iterations. We should point out there's technically a Moto G9 in India, but that's a rebadged Moto G9 Play.",
    "That's far fewer phones than the Moto G8 series, a line so confusing we had to write an entire guide on how the phones were distinguished. The launch of the Moto G9 series was cut short by the Moto G10's appearance, which kicked off a new generation of the affordable line.",
    "So the G9 line only has three musketeers, and if you're in the market for a great budget phone, you might be considering one of them. To help you decide, we'll run you through the devices and compare all of their aspects.",
    "The Moto G9 phones are all available in the UK, and one of them is in Australia too, but none of them can be bought in the US. Motorola puts different Moto G phones out there (and sometimes the same ones under different names), and typically doesn't use the numerical indicator.",
    "We'll list all the prices below - if you see an asterisk, it means the price is a conversion done by us, to give you an idea as to how much it costs, as the phone isn't currently available in that region.",
    "Well, those are the launch prices at least, but these often go down over time and thanks to deals. If the phones are on sale in your region, you can see their current prices below:",
    "The Moto G9 series of phones all look somewhat similar - they're plastic-clad phones with USB-C ports, 3.5mm headphone jacks, and Google Assistant buttons. None of the phones have an IP rating, though they do have a water-repellent coating.",
    "The Moto G9 Play is a tiny bit different for the front-facing camera, which is in a notch instead of a punch-hole cut-out like its siblings. All three have slightly different-looking camera bumps too.",
    "A difference that may mean a lot to you is the placement of the fingerprint scanner, as the Moto G9 Plus has it on the right side of the phone, while its siblings have it on the back. Some people prefer different placements, depending on where it feels natural to put your finger to wake the phone up.",
    "As the price graph shows, there's a hierarchy in quality for the Moto G9 phones, and it's very apparent in the display category.",
    "The priciest phone, the G9 Plus, has a 6.8-inch screen with a 1080 x 2400 resolution, while the G9 Power has the same size screen, but with only a 720 x 1640 resolution. Then the G9 Play has a 720 x 1600 resolution on a display that's only 6.5 inches across.",
    "The screens are all LCD ones, and they all have a 60Hz refresh rate. The G9 Plus does have HDR10 support though.",
    "The Moto G9 Plus and Power have 64MP main cameras, while the Play sticks at 48MP. Each of the phones also has a 2MP macro and 2MP depth-sensing camera, and while the Power and Play stay there with three shooters each, the Plus also has an 8MP ultra-wide snapper.",
    "Each of the phones records video at up to 1080p, except the G9 Plus, which can hit 4K at 30fps.",
    "The front-facing camera on the Moto G9 Play is 8MP, but the G9 Plus and Power go up to 16MP for higher-resolution selfies.",
    "The battery department is one area in which the Moto G9 Plus does not reign supreme; no, the G9 Power is the champion here, which is why it has that name. Its 6,000mAh battery trumps the 5,000mAh used in the G9 Plus and G9 Play, though all are on the large side for smartphones.",
    "When it comes to charging though the G9 Plus steals the crown back - it powers up at 30W, over the 20W of its siblings.",
    "In our testing we found all three phones had superb battery lives, easily lasting a day, and sometimes reaching two days, especially in the case of the Moto G9 Power.",
    "In terms of software, the three Moto G9 phones are all equal, in that they come pre-loaded with Android 10 but will be upgradeable to new versions of Android in future.",
    "The Moto G9 Play and G9 Power use the Snapdragon 662 chipset, while the G9 Plus uses the Snapdragon 730G, which provides more processing power and is better optimized for gaming.",
    "Each phone has 4GB of RAM, though you can also opt for a 6GB version of the Moto G9 Plus if you prefer. And they all have 128GB of storage except the G9 Play, which has 64GB.",
    "The three Moto G9 phones sit in a rough hierarchy: the Moto G9 Play is the lowest-end one, and the G9 Plus is the top-end one, with the G9 Power between.",
    "So if you need pretty good specs and camera features, the Moto G9 Plus will be best for you, whereas if you just need something affordable and reliable, you can settle for the Moto G9 Play.",
    "The Moto G9 Power will be best for people who need a long-lasting phone, as it has a massive battery and a fairly low resolution screen, so will last you up to two days."
  ],
  "headers": {
    "5": "Moto G9 series price and availability",
    "8": "Design",
    "11": "Display",
    "14": "Cameras",
    "17": "Battery",
    "20": "Performance and software",
    "23": "Takeaway"
  },
  "links": {
    "Moto G9 Plus": "https://www.techradar.com/reviews/moto-g9-plus-review",
    "Moto G9 Power": "https://www.techradar.com/reviews/moto-g9-power-review",
    "Moto G9 Play": "https://www.techradar.com/reviews/moto-g9-play",
    "write an entire guide on how the phones were distinguished": "https://www.techradar.com/news/motorolas-moto-g8-line-is-confusing-heres-how-the-nine-phones-compare",
    "Moto G10": "https://www.techradar.com/reviews/moto-g10-review",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}