{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-range-camera-specs-leaked-in-full",
  "title": "Samsung Galaxy S21 range camera specs leaked in full",
  "category": "phones",
  "updated": "2021-01-07T14:54:32Z",
  "author": "james-rogerson",
  "summary": "For all models",
  "article": [
    "We’re now very close to the January 14 launch of the Samsung Galaxy S21 range, but the leaks keep coming, with the latest one being details of the cameras on all three expected models.",
    "Shared by Evan Blass (a leaker with a great track record), these specs come from a pair of Italian infographics. These look like they could be official marketing material but Blass isn’t clear on that. Still, the fact that he’s sharing them suggests he likely has faith in them.",
    "One shows camera specs for both the Samsung Galaxy S21 and Samsung Galaxy S21 Plus, both of which apparently have a 12MP f/1.8 main camera, a 12MP f/2.2 ultra-wide one, a 64MP f/2.0 telephoto one, and a 10MP f/2.2 front-facing one.",
    "The Samsung Galaxy S21 Ultra meanwhile is shown on a separate infographic with a 108MP f/1.8 main camera, a 12MP f/2.2 ultra-wide one, a 10MP f/2.4 telephoto one, and – in a rare move for a Samsung phone – a second telephoto lens, this time a 10MP f/4.9 one. There’s also a 40MP f/2.2 selfie camera listed.",
    "Some of these apertures are new details but the rest of these specs we’ve now heard a number of times, so it’s very likely that they’re accurate. If so then in terms of the camera at least the S21 Ultra could be very different – and likely better – than the other models, thanks to significantly different main and telephoto shooters.",
    "It’s worth noting also that all three phones here are referred to as 5G models. One thing we’re still not totally certain of is whether there will be 4G-only variants of any of them, but we doubt the cameras would differ on those anyway.",
    "We’ll have all the official details soon, and TechRadar will be covering the Samsung Galaxy S21 announcement in full, so make sure you check back on January 14 – or sooner, if you want to stay up to date with all the leaks and rumors."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Evan Blass": "https://www.voice.com/post/@evan/samsung-galaxy-s21-5g-camera-infographics-1609777211-1473703143",
    "heard a number of times": "https://www.techradar.com/news/huge-samsung-galaxy-s21-leak-covers-just-about-every-spec"
  }
}