{
  "source": "https://www.techradar.com/news/why-ps5-shortage",
  "title": "Why is there a PS5 shortage? Here's the reason – and how to buy it",
  "category": "gaming",
  "updated": "2021-07-15T13:09:10Z",
  "author": "matt-swider",
  "summary": "PS5 stock was low this past week, as Best Buy, Walmart and Sony Direct didn't sell the Sony console. Here's why.",
  "article": [
    "Why is there a PS5 shortage in 2021? There are five reasons why you can't buy the Sony console today, Sunday, April 4, and new PS5 stock seems to be at an all-time low at Best Buy, Walmart, Target and other stores worldwide.",
    "The outlook of claiming a PS5 restock this month is not very bright either. Next-gen console inventory is \"dire for April,\" according to an anonymous retail source who spoke to TechRadar this past week. First, here's how to find PS5 in stock.",
    "To get advance notice, follow Matt Swider as he tracks the PS5 console:",
    "Watch: TechRadar US Editor-in-Chief Matt Swider offers tips on how to buy PS5 through his Twitter tracker restock alerts.",
    "Here's an example of one of the notifications you'll see (Walmart restock alert illustrated):",
    "That's how to fix the PS5 stock issue for yourself. Now here's why it's happening in the first place.",
    "Sony didn't announce the PlayStation 5 for months during the first half of 2020 (if you recall, we first saw Xbox in December 2019), allegedly delaying the initial reveal several times due to the pandemic. Rumors of a February launch event gave way to a supposedly scheduled March unveiling, turned into a April reveal that never was. We didn't even see what it looked like until June.",
    "Manufacturing and shipping timelines were stretched, and demand has outstripped supply – it's been seven years since a major Sony console launch. So Covid-19 has a lot to do with why you can't find PS5 in stock today. Things didn't get off to a running start for a product everyone wanted so badly.",
    "But it's not the only reason.",
    "This is what people aren't thinking about when they think about fun and entertaining video games consoles: changes to your work life have impacted PS5 stock.",
    "The move from central offices to an almost universal Work From Home situation put incredible demand on computers and webcams, and therefore semiconductors and components – some of the same parts used by Sony for the PlayStation 5 console. We've seen laptops surge in sales, and that's something manufacturers prioritized.",
    "Resellers bear the brunt of the blame for why you can't find a PS5, and although they aren't the only reason (they often get all of the blame), they're a contributing factor. People buying from eBay and StockX don't help either.",
    "The most insidious resellers are able to ping retail websites every few seconds to see if there's a restock with bots, scoop up the inventory either through automation or a manually checkout, and take consoles away from everyday consumers. They are then able to resell the PS5 for around $1,000, doubling their money.",
    "Worse than resellers are scammers who target down-on-their-luck consumers via Twitter, Facebook Marketplace, OfferUp and completely fraudulent websites made to look real. Scammers promise to sell buyers the PS5 for around $550, a small, but believable markup (except when you think that they must have paid tax, but most people ignore this detail). Of course, scammers never actually deliver the console.",
    "Scammers often do have several consoles on hand – just enough inventory to take a photo of a piece of paper with the name of the buyer (the victim) written on it. Their console is usually surrounded by nine other PS5 boxes. This \"proves\" to the buyer that this is a legitimate seller. Money is sent through using one of four apps: Cash App, Venmo, Zelle or Apple Pay Cash. The seller then ghosts on their victim.",
    "It may be more profitable to buy Bitcoin during its dips than actually mine it at this point. However, this hasn't stopped people from buying up GPUs in an effort to one day profit from mining Bitcoin, Etherium, and other decentralized, open-source blockchain currienies – once their electricity bills are covered.",
    "There's such a strong demand for graphics cards that we can't find the Nvidia 3080 in stock for more than a few seconds at a time once a week. AMD GPUs are going through the same crisis. Good luck finding something like the AMD 6800 XT in stock.",
    "And guess what PS5 and Xbox use for their graphics? AMD GPUs.",
    "Finding PS5 stock may only be harder through April and May 2021, according to the retailers who spoke to TechRadar on the condition of anonymity (citing reliance on Sony shipments to their stores). They're not seeing the inventory that hoped for.",
    "Best Buy didn't have a restock this week, a rare miss after opening up orders every single Friday for the last six weeks. And last Friday at Best Buy was a tell: it only had PS5 Disc consoles in stock, no PS5 Digital Edition. Walmart and Sony Direct have also been silent this week. If it's becoming harder to find PS5 stock, we suggest grabbing the console when you can – for its retail price.",
    "While analysts predict that the semiconductor shortage will be solved by June or July (depending on who you ask), come Black Friday and Cyber Monday demand will be strong once again.",
    "Longer-term, the fix may come in the form of new spending outside of Taipei (TSMC) and South Korea (Samsung), and the United States government is pushing for $50 billion in new spending to boost chip production to do just that."
  ],
  "headers": {
    "6": "1. Sony PS5 setbacks began with the pandemic",
    "9": "2. PS5 is collateral damage of 'Work From Home'",
    "11": "3. Resellers are ruining things for everyone",
    "13": "4. Scammers are making things even worse",
    "15": "5. Cryptominers worldwide are to blame, too",
    "18": "PS5 restock looks 'dire' for April – with a long-term fix"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "buy Bitcoin": "https://www.techradar.com/how-to/how-to-buy-bitcoins",
    "Nvidia 3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "AMD 6800 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6800-find-stock-here/deals/where-to-buy-amd-radeon-rx-6800xt-find-stock-here",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}