{
  "source": "https://www.techradar.com/news/russell-t-davies-returning-from-doctor-whos-past-is-the-best-thing-for-its-future",
  "title": "Russell T Davies returning from Doctor Who’s past is the best thing for its future",
  "category": "entertainment",
  "updated": "2021-09-25T16:04:29Z",
  "author": "richard-edwards",
  "summary": "Opinion: Why the It’s a Sin writer’s second coming is just what the Doctor ordered",
  "article": [
    "They say you should never go back.",
    "Whether it’s sport, politics or popular culture, history is littered with people who’ve called it a day at the top of their trade – but struggled to recapture the old magic when they’ve been tempted to go back to what made their name.",
    "In most circumstances, then, the announcement that Russell T Davies is returning as Doctor Who’s showrunner in 2023 would set alarm bells ringing. But for a series that has, of late, felt like its best years were behind it, the prospect of Davies returning to the show he spectacularly regenerated 16 years ago feels like a match made in heaven.",
    "During his first, all-conquering stint on Doctor Who, Davies transformed a drama that had been unceremoniously dropped by the BBC in 1989 into appointment viewing. It was suddenly a mainstream series viewed by audiences of millions, a show that became a Christmas Day staple, whose appeal wasn’t just confined to sci-fi fans. Genre TV was having its moment in primetime, and Doctor Who – with Davies at the helm – was the driving force.",
    "As a lifelong fan of the show, Davies always respected the show’s decades-old mythology. At the same time, however, he realized that many of the audience wouldn’t know a Cyberman from a Sontaran. So throughout the four seasons of his run, he gradually dripfed the backstory of an alien with two hearts, who adventured through space and time in a blue phone box.",
    "But, crucially, the human drama was now just as important as the extra-terrestrial threats, as companions Martha Jones, Donna Noble and – particularly – Rose Tyler, and their lives outside the TARDIS, became integral to the story. Not every fan of classic Who loved the reinvention, but for many viewers his run was infectious, propulsive and unmissable.",
    "And that’s what characterizes Davies’s work – his scripts are packed with levels of energy and emotion that few other TV writers can match, with exposition, comedy and tragedy often combining seamlessly in the same scene. He’s also brilliant at the producer side of the showrunning gig, a master at pulling a disparate bunch of episodes together into a coherent whole, and making the most of the talent at his disposal. After all, it was on Davies’s watch that David Tennant and Billie Piper became big-name TV stars, and future showrunner Steven Moffat wrote some of the greatest episodes in the show’s illustrious history.",
    "Was everything Davies did on Who a success? Not at all, but he was never afraid to try new things – one episode even featured an alien designed for a competition on long-running kids’ show Blue Peter – and the show has arguably never hit the same heights so regularly since his departure.",
    "Recent years have seen Davies confirming his status as one of the best writers in the industry, with A Very English Scandal, Years and Years, and It’s a Sin, in particular, proving that Doctor Who is welcoming back a scripter at the very top of his game. He's also spent his decade away from the show at a safe, but respectful distance, not even being tempted to go back and write an episode.",
    "He’s taken the opportunity to go back to the status of a Who fan, as he pointed out in a statement accompanying the announcement of his return [via the BBC]: “I’m beyond excited to be back on my favorite show. But we’re time-travelling too fast, there’s a whole series of Jodie Whittaker’s brilliant Doctor for me to enjoy, with my friend and hero [lead writer] Chris Chibnall at the helm – I’m still a viewer for now.”",
    "That mixture of separation, fannish respect and knowledge of the show’s inner workings is what makes Davies the perfect candidate for the Doctor Who gig. Indeed, much as he did first time around, he finds himself taking the helm of a much-loved show with decades of history, that could do with an infusion of… well, magic, to make it feel essential in the TV landscape of its time.",
    "There couldn’t be a better jumping off point than 2023’s 60th anniversary – if Davies follows tradition and brings together multiple Doctors for a celebratory episode, it could be one of the television events of the year. It’ll also be intriguing to see how he deals with the new aspects of canon established by his successors, Moffat and Chibnall, and – most importantly of all – who he casts to replace Jodie Whittaker as the next Doctor Who.",
    "And why stop at one show in the Doctor Who universe? During the glory days of the late ’00s, spin-off shows Torchwood and The Sarah Jane Adventures meant that Who was doing shared universes while the MCU was still in its infancy. Davies certainly seems open to the prospect of expanding beyond the parent show. “I was in the middle of running an empire,” Davies recalled in January 2021 (via RadioTimes.com). “And my god, I did that 10 years too soon, didn’t I?",
    "“There should be a Doctor Who channel now. You look at all those new Star Wars and Marvel shows, you think, we should be sitting here announcing The Nyssa Adventures or The Return of Donna Noble, and you should have the Tenth and Eleventh Doctors together in a 10-part series. Genuinely.”",
    "So as Doctor Who approaches its seventh decade, a milestone so epic that even Star Trek is playing catch-up, it couldn’t be better hands – especially as the second Davies era will be a co-production with Bad Wolf, the company founded by Julie Gardner and Jane Tranter, key players during Who’s 2005 return.",
    "Now a show that felt like it needed a new Russell T Davies has got its hands on the Russell T Davies – and the future of a 58-year-old institution is looking very bright indeed.",
    "Doctor Who returns to BBC America and BBC One later this year. The show's second Russell T Davies run should begin in 2023."
  ],
  "headers": {
    "6": "A writer at the top of his game",
    "10": "Second coming"
  },
  "links": {
    "a series that has, of late, felt like its best years were behind it": "https://www.techradar.com/news/the-jodie-whittaker-era-of-doctor-who-has-been-far-from-vintage-but-the-shows-decline-started-years-ago",
    "It’s a Sin": "https://www.techradar.com/news/its-a-sin-is-the-must-watch-tv-show-for-our-times",
    "the BBC": "https://www.bbc.co.uk/news/entertainment-arts-58682472",
    "next Doctor Who": "https://www.techradar.com/news/who-should-play-the-next-doctor-who-10-candidates-to-replace-jodie-whittaker",
    "RadioTimes.com": "https://www.radiotimes.com/tv/sci-fi/doctor-who-marvel-shared-universe/"
  }
}