{
  "source": "https://www.techradar.com/news/hdmi-arc-vs-earc",
  "title": "HDMI ARC vs eARC: enhanced audio return channel explained",
  "category": "televisions",
  "updated": "2021-05-14T14:51:12Z",
  "author": "jamie-carter",
  "summary": "What do HDMI ARC and eARC actually do?",
  "article": [
    "HDMI ARC – and it's latest evolution, HDMI eARC – are both key audio technologies for today's best TVs, but you'd be forgiven for not knowing what those succession of letters actually mean.",
    "It's all to do with the audio output of your television and how it connects to external soundbars and sound systems. So if you're happy with your tinny 10W built-in speakers (or have one of the best TVs for sound) then you probably needn't read on any further. However, if you ever plan on connecting any external audio equipment, it's good to keep abreast of the inputs and technologies that allow you to do it well.",
    "Standard ARC has been around a while, connecting your TV and hi-fi equipment into one, seamless and less cable-heavy entertainment system. However, thanks to the capabilities of the new HDMI 2.1 standard, now comes eARC to take audio to the next level.",
    "Find out all about ARC and eARC, why you will one day demand the latter, and which of the best TVs and audio equipment on sale right now are set to feature eARC in our in-depth guide below.",
    "Audio Return Channel (ARC) is a type of audio transmission that links up your speaker output to your television controls, via an HDMI cable, meaning you don't need a separate remote or interface to manage the volume.",
    "Sure, HDMI cables already carry audio from Blu-ray players, games consoles and set-top boxes into a TV. But with ARC, they can also send audio in reverse, from a TV into an external speaker or soundbar, without having to attach a separate audio cable.",
    "Ready to remove one more remote from your already way-too-complicated home entertainment setup? Here's how to do it.",
    "ARC is an often ignored protocol sitting at the heart of almost all home entertainment products, and understanding ARC is all about knowing your ‘upstream’ from your ‘downstream’.",
    "The first thing to know is that, as a feature of the HDMI spec, ARC enables a TV to send audio signals upstream to a connected soundbar, a one-box home theater, or an AV receiver. It does this by first forming a 'handshake' between the TV and the audio device, creating a two-way street for information.",
    "By sending audio both ways, ARC does away with the need for optical audio cables (also called S/PDIF), cutting down on pointless clutter that likely already causes you a headache at home. Put simply, ARC is a cable-killer.",
    "Probably. Although you do have to have a TV with a special ARC-ready HDMI slot, almost all TVs have had such a thing for years.",
    "To find it, look at your TV’s string of HDMI slots, and you’ll see that at least one has a small reference to ARC next to it.",
    "A spokesperson for HDMI Licensing told TechRadar that, “An ARC-enabled TV can either send or receive audio via HDMI, upstream or downstream, depending on system set-up and user preferences.”",
    "Usually it’s automatic: use the ARC-ready HDMI slot on a TV and you will automatically be able to send audio to any soundbar with an HDMI input.",
    "There’s no delay, either. Lip-sync functionality was introduced in HDMI 1.3 to ensure that audio stays perfectly matched to video. All HDMI standards since have automatically compensated for any processor delays whether the audio is traveling upstream or downstream.",
    "What's the difference between ARC and eARC?",
    "The next version of ARC, Enhanced ARC (eARC) is about vastly increasing the bandwidth for an expected surge in audio data. eARC can handle more advanced audio formats and higher audio quality, being able to cope with 32 channels of audio, and even eight-channel 24-bit/192kHz uncompressed 38Mbps data streams. So eARC supports Dolby TrueHD, DTS-HD Master Audio, Dolby Atmos and DTS:X.",
    "That means the surround sound we listen to is being substantially upgraded.",
    "Whether you’re listening through a 5.1 system with separate speakers, a soundbar, or via headphones, more immersive and nuanced audio is coming. So ARC is evolving into eARC to handle it in the new HDMI 2.1 specification.",
    "HDMI Licensing also told us that “eARC simplifies connectivity, provides greater ease of use, and supports the most advanced audio formats and highest audio quality.”",
    "HDMI 2.1 is the latest update to HDMI, which is all about higher video resolutions and refresh rates. As well as being built to handle the next generation of video – 8K resolution at 120 frames per second (HDMI 2.0 only handles 8K at 30fps), HDMI 2.1-ready TVs, Blu-ray players and games consoles will be able to handle higher frame rates up to 120fps even for 4K video.",
    "HDMI 2.1 cables’ bandwidth will be upgraded from being able to handle just 18 Gbps to a whopping 48Gbps. Ancient HDMI cables may struggle with that kind of data rate, but any new HDMI cable is fine.",
    "eARC is an increasingly common sight in today's TV landscape, though you won't find it as commonly as its simpler ARC cousin.",
    "However, all HDMI 2.1 certified products do support eARC, meaning that, if you know your television sports the former, you know you're getting the latter too. Not every HDMI 2.1 port will support it though, as TV makers tend to simplify things by only including one eARC-enabled port, even if there are four HDMI 2.1 inputs.",
    "LG TVs have roundly supported HDMI 2.1 and eARC since 2020, with four HDMI 2.1 ports on all of its OLED TV ranges (except the new, entry-level LG A1 OLED, which makes do with HDMI 2.0). New Samsung TVs these days offer the same, while Sony is finally catching up with the HDMI 2.1 support it lagged behind in last year. Panasonic, too, is now embracing the technology on its 2021 TVs.",
    "You won't find HDMI 2.1 and eARC on every TV these brands put out, though they're now to be expected on mid-range and high-end models. In any case, we recommend you checking the specific model to make sure you're getting what you want.",
    "To confuse things a little, though, it seems that some features of HDMI 2.1 – including eARC, but also ALLM (Auto Low Latency Mode) and VRR (Variable Refresh Rate) – can be delivered as a workaround on HDMI 2.0-certified equipment. So some 2020 and even 2019 TVs, AV receivers and soundbars have had firmware updates to make those features live. However, do check what each manufacturer is or isn’t supporting before you buy.",
    "eARC-capable audio equipment – crucial if you want to indulge in eARC switching in a home cinema set-up – is more common, with firmware updates already available from the likes of Sony, Only, Pioneer and Integra for recent AV receivers and soundbars.",
    "The HDMI 2.1 specification also includes some exciting, but relatively unknown features that could quickly go mainstream. Variable Refresh Rates (VRR) enables a TV to show a dynamic refresh rate synced to the content, usually ranging from 30Hz through 144Hz.",
    "“I think this is going to be very important this year – there were a lot of demos at CES 2020,” says Paul Gray, Research Director (Consumer Devices) at independent analyst and consultancy firm Omdia. “A lot of internet content is in really weird frame rates like 73Hz, so it’s not just gaming that will benefit.” So expect more TVs to handle YouTube and web-sourced content much better.",
    "Another little-discussed part of HDMI 2.1 is Auto Low Latency Mode (ALLM), which is all about creating a new and much improved ‘game mode’ for TVs. It allows the TV to set the ideal latency (the delay when you refresh a web page – or stream a game) to create smooth, lag-free viewing and interactivity. It can degrade the image slightly, so ALLM is not designed for movies (even streamed movies), but it’s destined to bring a more fluid feel to gaming – especially with the launch of the next-gen PS5 and Xbox Series X consoles – and even video conferencing too.",
    "For now, eARC is an emerging standard, but very soon we’re sure to see it dominate home entertainment."
  ],
  "headers": {
    "4": "What is HDMI ARC?",
    "7": "Why do we need ARC?",
    "10": "Is my TV ARC-compatible?",
    "15": "What is eARC?",
    "20": "What is HDMI 2.1?",
    "22": "What TVs, AV receivers and soundbars include eARC?",
    "28": "What is Variable Refresh Rate (VRR)?",
    "30": "What is Auto Low Latency Mode (ALLM)?"
  },
  "links": {
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "best TVs": "https://www.techradar.com/news/best-tv",
    "Blu-ray players": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "games consoles": "https://www.techradar.com/news/best-consoles",
    "set-top boxes": "https://www.techradar.com/news/best-set-top-box",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "AV receiver": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "DTS:X": "https://www.techradar.com/news/dtsx-vs-dolby-atmos-vs-dts-play-fi",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Sony is finally catching up with the HDMI 2.1 support": "https://www.techradar.com/news/sony-tvs-are-finally-catching-up-with-the-ps5",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "Omdia": "https://www.omdia.com/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}