{
  "source": "https://www.techradar.com/news/how-to-watch-skateboarding-at-olympics-2020-free-live-stream",
  "title": "How to watch Skateboarding at Olympics 2020: key dates, free live stream and more",
  "category": "computing",
  "updated": "2021-07-26T13:26:49Z",
  "author": "chelsea-forsyth",
  "summary": "Which Olympic athletes will skate their way to gold?",
  "article": [
    "Skateboarding is one of five brand-new disciplines to debut at the 2020 Olympics, with skaters testing their shredding skills in one of two competitions in Tokyo - Street or Park. Here's how to watch skateboarding at Olympics 2021 with a live stream.",
    "Street sees skaters performing on a course reminiscent of your local skate park, with athletes enjoying free reign across handrails, benches, and curbs. Brazil’s Leticia Bufoni is women’s favorite for gold in Street, though younger skaters like Pamela Rosa, Rayssa Leal, and Aori Nishimura are hot on her wheels.",
    "Park offers a throwback to skateboarding’s Venice Beach roots, using hollowed-out swimming pools as its stage. With steep inclines and smooth surfaces, skaters can expect to fly high while enjoying the freedom to create a run as impressive as they like. History will be made by thirteen-year-old Team GB skater Sky Brown, as she makes her debut performance in Tokyo as Britain's youngest Olympian. Certainly, a performance to watch.",
    "Sound like something you don’t want to miss? If you’d like to watch skateboarding at Olympics 2020, we’ll explain below how to live stream Olympics events, plus some key dates to mark on your calendar.",
    "- Women's Street final and victory ceremony: Monday, July 26 from 12.25pm JST / 4.25am BST / 11.25pm ET (Sunday)",
    "- Men's Street final and victory ceremony: Sunday, July 25 from 12.25pm JST / 4.25am BST / 11.25pm ET (Saturday)",
    "- Women's Park final and victory ceremony: Wednesday, August 4 from 12.30pm JST / 4.30am BST / 11.30pm ET (Tuesday)",
    "- Men's Park final and victory ceremony: Thursday, August 5 from 12.30pm JST / 4.30am BST / 11.30pm ET (Friday)",
    "Australian and UK skateboarding fanatics can watch live coverage on Channel 7 and 7plus online or on the BBC and BBC iPlayer respectively for free. Australia is lucky with the most comprehensive Olympic live stream, while BBC will offering hundreds of hours from key events.",
    "Wherever you are in the world, you can also get highlights of the action online on the Olympics Channel for the Tokyo Games.",
    "No matter where you are around the world, there should be an Olympic Games stream to ensure you can watch Tokyo 2020 Olympic Games, whether paid-for or free. However, you may find your preferred domestic coverage is geo-restricted when abroad, or that your place of work, college, or school has prevented the ability to access your chosen service and watch online.",
    "Thankfully, there's any easy work-around. Simply download a VPN and you can spoof your device into appearing as if it's located somewhere else. Essentially, then, you can appear as if you're where your coverage is geo-locked to and watch as if you're right at home.",
    "Use a VPN to watch Tokyo 2020 Olympic Games from anywhere",
    "Three simple steps to using a VPN to bypass geo-restrictions:",
    "1. Download and install a VPN - our recommendation is ExpressVPN",
    "2. Connect to the relevant server location - launch the VPN app, click on 'choose location' and select the right location, i.e. UK for iPlayer, US for Sling TV",
    "3. Head to the chosen broadcaster's live stream - so if you're from the UK, just head to BBC iPlayer",
    "With many countries around the world taking part in the Olympic Games, you can find a broadcaster to watch Tokyo 2020 Olympic Games in most countries, whether free or platforms that charge.",
    "For those countries we haven't mentioned above, Wikipedia's dedicated page allows you to see a breakdown of Olympic Games TV channels to tune into."
  ],
  "headers": {
    "4": "Olympics 2020 skateboarding: key dates and times",
    "8": "Free Olympics skateboarding live stream",
    "10": "How to watch your Olympics live stream when abroad",
    "17": "Other 2020 Olympics broadcasters around the world"
  },
  "links": {
    "live stream Olympics": "https://www.techradar.com/news/olympics-live-stream-how-to-watch-tokyo-2020-olympic-games-free-2021-dates-schedule-events",
    "BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "head to BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "Wikipedia's": "https://en.wikipedia.org/wiki/List_of_2020_Summer_Olympics_broadcasters"
  }
}