{
  "source": "https://www.techradar.com/news/oneplus-9-may-get-wireless-charging-but-the-oneplus-9-pro-will-likely-be-faster",
  "title": "OnePlus 9 may get wireless charging, but the OnePlus 9 Pro will likely be faster",
  "category": "phones",
  "updated": "2021-01-05T09:27:06.311Z",
  "author": "jitendra-soni",
  "summary": "OnePlus is properly embracing wireless charging",
  "article": [
    "Wireless charging is set to get better on OnePlus phones, if a new leak is correct with one report claiming the OnePlus 9 Pro will come with impressive 45W wireless charging tech.",
    "According to a report by a popular leakster Max Jambor, who’s known to be fairly accurate with his information around the upcoming phones, the OnePlus 9 Pro may come with faster 45W wireless charging tech.",
    "This, compared to the 30W charging speed on the current OnePlus 8 Pro, seems a major boost. The leak doesn't suggest what charging speed to expect on the OnePlus 9, but the source does say he expects the cheaper handset to feature wireless charging tech.",
    "Also, according to reports that we came across earlier, OnePlus 9 Pro may come with 65W fast wired charging that we first saw in the OnePlus 8T. In real-world usage, this means that you will be able to get a day’s battery life within minutes of running out of juice, with the wired charger or the wireless one.",
    "The good news, according to Max, is that OnePlus is expected to introduce wireless charging to all OnePlus 9 series phones though Max doesn’t have the exact details about the wireless charging speeds on the other OnePlus 9 devices at the moment.",
    "In related news, we did get a scoop that the OnePlus 9 series phones may come with 30W wireless charging speeds. Hence, it could very well be a probability that the flagship variant may come with faster wireless charging while the vanilla variant may charge slightly slower.",
    "The OnePlus 9 Pro may also be able to charge your wearables like earbuds or your smartwatch. That's thanks to a reverse wireless charging feature that the device could be equipped with that we've seen on phones like the Huawei P40 Pro and Samsung Galaxy S20.",
    "We don't have any specifics on charging speed, but we wouldn't expect reverse wireless charging to be anywhere near as fast.",
    "Additionally, the battery on the OnePlus 9 could get a boost, from 4300mAh that was present on the OnePlus 8, to 4500mAh. While this may be a very marginal increase but coupled with fast charging tech, this could turn out to be very handy for users who’re always on the go.",
    "We're currently expecting to hear about the new OnePlus phone from March onwards, so stay tuned for the latest leaks and rumors as they appear for both expected handsets."
  ],
  "headers": {
    "6": "Surging into wireless"
  },
  "links": {
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-review",
    "report": "https://www.voice.com/post/@maxjmb/oneplus-9-pro-45w-wireless-charging-1609755049-1189681637",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "scoop": "https://www.techradar.com/news/oneplus-9-leak-reveals-wireless-charging-and-battery-upgrades",
    "Huawei P40 Pro": "https://www.techradar.com/reviews/huawei-p40-pro-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review"
  }
}