{
  "source": "https://www.techradar.com/news/canons-bizarre-donut-mirrorless-camera-design-is-strangely-compelling",
  "title": "Canon's bizarre 'donut' mirrorless camera design is strangely compelling",
  "category": "cameras",
  "updated": "2021-08-13T10:15:52Z",
  "author": "mark-wilson",
  "summary": "New patent is a refreshing bit of left-field thinking",
  "article": [
    "Canon has been making cameras for over 80 years, so you'd have thought it might have have tried every form factor under the sun by now. But a new patent for a 'donut'-style mirrorless camera design suggests not – and it's an oddly compelling idea.",
    "The patent, which was spotted by the Japanese site Asibonet, shows a Canon EOS R3-style camera with an L-shaped hole in the middle of it – with the main benefit being a superior grip for photographers and videographers, whether they're shooting in landscape or portrait.",
    "According to the patent, the integrated grip would also basically eliminate the chance of you dropping the camera and also reduce the need for accessories like wrist straps. The latter are generally used by creators who like to shoot run-and-gun photos and videos of subjects like action sports.",
    "But putting a hole in the middle of the camera could also have other knock-on benefits. It could allow Canon to completely rethink how the camera operates, with the traditional dials instead traded for a versatile touch bar.",
    "The patent includes mentions of \"touch sensors\", which run along both the side and lower edge of the screen. These would work in a similar way to the Canon EOS R's 'touch bar', which let you change different settings – for example, swipe left for viewfinder magnification or swipe right to bring up the histogram – with gestures.",
    "Canon's 'touch bar' didn't go down particularly well, which is why we haven't seen it on recent cameras like the Canon EOS R5. But its more fully-fledged implementation in this patent here makes more sense and would work much better ergonomically with the grip. It also reminds us of a charming touch-button system we saw back on the Samsung NV7 compact camera.",
    "Another potential benefit of this kind of design could be cooling. Many video cameras contain active cooling, including fans and vents, to keep their components from overheating and restricting video-recording times. While this isn't mentioned in the patent as a benefit, it's possible that the increased airflow of the 'donut' design could instead deliver some helpful passive cooling.",
    "Despite their increased dominance, mirrorless cameras haven't really delivered any radical rethinks of camera design – even though, unlike DSLRs, they don't need a bulky mirror or pentaprism for an optical viewfinder.",
    "So while there's no evidence that Canon is seriously entertaining the 'donut' design described in this patent, it is good to see something completely different that could also bring some very practical benefits.",
    "Similar ideas do exist in the form of third-party accessories like video camera grip handles, but we haven't really seen a big manufacturer attempt to integrate it into the camera body itself.",
    "There are likely good reasons for this. Firstly, the design certainly does bring an element of bulky awkwardness that you don't get with compact mirrorless cameras. We could see objects snagging or getting tied up in that L-shaped hole, for example. Also, this kind of design may well introduce too many points of weakness, compared to a traditional brick design, for it to survive testing professional shoots.",
    "But there's no doubt that handling a camera like a steering wheel, and easily turning it from landscape to portrait, does also look pretty appealing, particularly if you're a hybrid shooter. Who knows, maybe we'll see Canon test the waters with a crowd-funded campaign, like it did for other left-field ideas like the Canon Powershot Zoom."
  ],
  "headers": {
    "7": "Analysis: Steering in a refreshing direction"
  },
  "links": {
    "patent": "https://www.j-platpat.inpit.go.jp/p0200",
    "Asibonet": "https://asobinet.com/info-patent-canon-eos-r-grip/",
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Canon Powershot Zoom": "https://www.techradar.com/reviews/canon-powershot-zoom"
  }
}