{
  "source": "https://www.techradar.com/news/the-sony-zv-e10-is-an-affordable-vlogging-and-streaming-camera-for-youtubers",
  "title": "Sony ZV-E10 is an affordable vlogging and streaming camera for YouTubers",
  "category": "cameras",
  "updated": "2021-07-28T13:17:55Z",
  "author": "mark-wilson",
  "summary": "Old hardware, but with lots of new tricks",
  "article": [
    "The Sony ZV-E10 vlogging camera has finally arrived after its postponed launch a few weeks ago – and for YouTubers who need an affordable video workhorse, it's likely been worth the wait. (Want to skip to our in-depth thoughts? Head to our full Sony ZV-E10 review).",
    "The ZV-E10 sits in between the Sony ZV-1 (the best compact vlogging camera you can buy) and the more photography-focused Sony A6100. Like the ZV-1, it lacks a built-in viewfinder, instead offering a fully articulating screen for framing your shots. But otherwise, it's effectively a video-focused twist on the A6100, as it's built around the same 24.2MP APS-C sensor.",
    "The Sony A6100 came out in 2019, so you're not getting absolutely cutting-edge hardware – which explains the ZV-E10's comparatively affordable body-only price tag of $700 / £680 / AU$1,249). But Sony has stuffed some handy software features in there, including live-streaming skills to help it rival the Panasonic GH5 Mark II.",
    "The ZV-E10 shoots 4K video (oversampled from 6K) at up to 30fps, though it sadly doesn't offer a 4K/60p mode for those who like to slow down their footage for cut-scenes. Still, you do get some of Sony's latest autofocus smarts, including Real-time Tracking and Real-time Eye AF. These allow it to track a person around the frame and automatically keep them in focus.",
    "Unlike the Sony A6100, you also get a range of ports for boosting the audio quality of your videos, including a mic input and a headphone output for monitoring the sound. While the built-in three-capsule mic, which we also saw on the Sony ZV-1, is certainly decent as a backup audio option, you'll likely want to plug an external microphone into either that 3.5mm mic input or the ZV-E10's Multi-Interface hotshoe.",
    "Perhaps the most interesting feature of the Sony ZV-E10, particularly for those who like to do live broadcasts on YouTube or Twitch, is its live-streaming powers. Because it uses the UVC/UAC (USB Video Class) protocol, you don't need a video capture card for streaming – just plug it in via USB and it'll appear as a standard video source like a webcam. This means you can also use it as a high-quality camera for your Zoom or Google Meet video chats.",
    "In our Sony ZV-E10 review, we've praised the vlogging camera's all-round talents, while highlighting the limitations that its price tag and reliance on older hardware bring.",
    "The three main issues we found with the ZV-E10 are its lack of a touch-optimized menu system (which means using the four-way wheel to change some settings), the absence of a 4K/60p mode, and the significant rolling shutter while panning. Rolling shutter is mainly caused by slow sensor read-out, which can give your footage a 'jello' effect or distort straight lines when you quickly move the camera across a scene.",
    "This isn't an issue for those who mostly shoot in a studio or on a tripod. But anyone who wants to shoot fast-action scenes with lots of panning would likely be better off looking at an alternative like the Panasonic GH5 Mark II or, at the higher-end, the Sony A7S III.",
    "Otherwise, the Sony ZV-E10 is likely to be a popular new mid-range choice for video shooters, and deservedly so. It combines a lot of the features you'd look for in a vlogging camera – an articulating screen, good audio options, excellent autofocus and handy software features like its 'Product Showcase' mode for YouTubers – at a competitive price.",
    "Perhaps the only other feature we'd like to have seen is in-body image stabilization (IBIS), but that's unusual at this price point. Anyone who needs that extra bit of stability when taking hand-held photos or video should check out the Fujifilm X-S10.",
    "You can buy the Sony ZV-E10 from the end of August for a body-only price of $700 /£680 / AU$1,249, or $800 / £770 / AU$1,449 for the 16-50mm kit lens bundle."
  ],
  "headers": {
    "6": "Verdict: old dog with new video tricks"
  },
  "links": {
    "Sony ZV-E10 review": "https://www.techradar.com/reviews/sony-zv-e10",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "Sony A6100": "https://www.techradar.com/reviews/sony-a6100",
    "Panasonic GH5 Mark II": "https://www.techradar.com/reviews/panasonic-gh5-mark-ii",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Fujifilm X-S10": "https://www.techradar.com/reviews/fujifilm-x-s10"
  }
}