{
  "source": "https://www.techradar.com/news/these-resident-evil-village-deals-for-ps5-and-pc-are-scarily-good",
  "title": "These Resident Evil Village deals for PS5 and PC are scarily good",
  "category": "gaming",
  "updated": "2021-10-27T16:31:53Z",
  "author": "vic-hood",
  "summary": "Just in time for Halloween",
  "article": [
    "Black Friday deals may not officially kick off for some time yet, but that hasn't stopped a range of retailers offering big discounts on survival horror Resident Evil Village - and just in time for Halloween too.",
    "In both the UK and US we're seeing big savings on the latest Resident Evil Village on PS5 and PC (sorry Xbox players). In the US, both Amazon and Walmart have cut the price of Village on PS5 by nearly $20, while CD Keys is offering PC editions for the lowest prices we've seen yet. Those in the UK have plenty of choice too, with Amazon offering a range of editions and bundles at a discount. (Not in the UK or US? Scroll down for deals in your region).",
    "We're pleasantly surprised to see these discounts given that Resident Evil Village is still a fairly new game, having only been released in May. It's perfect timing as we approach Halloween weekend, with Resident Evil offering a suitably spooky gameplay experience for those who are looking for a scare. Check out the deals below.",
    "US",
    "UK",
    "Resident Evil Village easily earned its spot on our best PS5 games and best Xbox Series X games lists, though it isn't without its faults. In our review, we said:",
    "\"Resident Evil Village takes the series to new heights, balancing the action of Resident Evil 4 with the deeper narrative approach of Resident Evil 7. This, combined with a brilliant use of audio on PS5 and an array of memorable characters, makes it the best modern Resi entry. That said, anticlimactic boss fights and less of a focus on scares - plus a poorly paced ending - mean that while it starts strong, it struggles somewhat towards the end.\"",
    "If you're a horror fan that has had their eye on Resident Evil Village for some time then this is a great time to pick up a good deal on one of the best games of the year. Though we could see these prices drop even further during the Black Friday period. Make sure to check out our Nintendo Switch Black Friday deals, PS5 Black Friday deals and Xbox Series X Black Friday deals pages for our Black Friday gaming deal predictions and early deals.",
    "No matter where you live, you'll find all the lowest prices for Resident Evil Village from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Resident Evil Village deals",
    "8": "More Resident Evil Village deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "best PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "best Xbox Series X games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "Nintendo Switch Black Friday deals": "https://www.techradar.com/black-friday/nintendo-switch-black-friday-deals",
    "PS5 Black Friday deals": "https://www.techradar.com/black-friday/best-black-friday-ps5-deals-2021",
    "Xbox Series X Black Friday deals pages": "https://www.techradar.com/black-friday/xbox-series-x-black-friday-deals-2021"
  }
}