{
  "source": "https://www.techradar.com/news/apple-has-reportedly-stopped-making-iphone-12-mini",
  "title": "Apple has reportedly stopped making iPhone 12 Mini",
  "category": "phones",
  "updated": "2021-12-02T10:57:51Z",
  "author": "jitendra-soni",
  "summary": "But a successor could be on its way",
  "article": [
    "There had been rumours that Apple was unhappy with the dwindling sales numbers of the iPhone 12 Mini. The device didn’t sell as Apple expected it to, despite a vocal demand from users asking for a flagship device but smaller in size.",
    "It is now being reported that the Cupertino based smartphone maker has pulled a plug on the 12 Mini. The TrendForce report says that the phone “reached End-of-Life ahead of time in 2Q21”. Confirming the poor sales numbers, it mentions that the pint-sized flagship from Apple “suffered disappointing sales performances compared to other models in the iPhone 12 family.”",
    "With one lesser variant to worry about, Apple is now looking to put its entire focus on the remaining three variants in the iPhone 12 line-up till the new devices around the year-end are announced.",
    "While the phone is removed from Apple's India website already, it phone is still listed on major e-commerce sites including Amazon and Flipkart, however, this could be subject to stock availability. On Amazon India, the 64GB variant of the iPhone 12 Mini is currently available at Rs. 64,990 making it the cheapest 5G phone from Apple as of now.",
    "Even though the phone didn’t perform as per Apple’s expectations, the company is not looking to give up on the idea of a compact flagship yet. It has been reported that with this year's iteration of iPhones, Apple may bring a successor to the iPhone 12 Mini.",
    "This phone could be dubbed as iPhone 13 or even iPhone 12s with a price similar to the iPhone 12 lineup. This could give users an option to upgrade to a smaller 5G capable iPhone without burning a hole in the pocket.",
    "Some analysts suggest that despite the 12 Mini boasting flagship hardware specifications it was in direct competition with the second-generation iPhone SE (2020). The fact that the iPhone SE (2020) was available at a fraction of 12 Mini’s price gave a lot of buyers an option to skip the costlier compact iPhone.",
    "That being said, it seems the third iteration of the iPhone SE is expected to launch as well. The only probable reason behind bringing the iPhone SE 3 is the success that the second-gen iPhone SE saw. Hence, Apple may not want to cancel a device that is selling like hotcakes.",
    "While it needs to be seen how Apple solves this puzzle, competitive brands like Asus have followed suit and have already launched a compact flagship. The Zenfone 8 from the Taiwanese smartphone maker boasts the latest hardware specs in a smaller size than the bigger Zenfone 8 Flip.",
    "There have been reports that other Android phone makers were also looking to come up with their compact flagship, however, are holding back looking at the fate of the iPhone 12 Mini.",
    "Follow TechRadar India on Twitter, Facebook and Instagram for the latest updates."
  ],
  "headers": {
    "4": "Compact phones are here to stay"
  },
  "links": {
    "unhappy with the dwindling sales numbers": "https://www.techradar.com/news/apple-may-stop-production-of-the-iphone-12-mini-and-for-good-reason",
    "iPhone 12 Mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "TrendForce report": "https://www.trendforce.com/presscenter/news/20210621-10834.html",
    "new devices around the year-end": "year-end%20are%20announced",
    "price similar to the iPhone 12 lineup": "https://www.techradar.com/news/iphone-13-price-might-not-be-any-higher-than-the-iphone-12s",
    "third iteration of the iPhone SE": "https://www.techradar.com/news/iphone-se-3",
    "Zenfone 8": "https://www.techradar.com/reviews/asus-zenfone-8'",
    "Zenfone 8 Flip": "https://www.techradar.com/news/asus-unveils-the-flagship-zenfone-8-and-zenfone-8-flip",
    "Twitter": "https://twitter.com/TechRadarIndia",
    "Facebook": "https://www.facebook.com/TechRadarIndia",
    "": "https://www.facebook.com/TechRadarIndia",
    "Instagram": "https://www.instagram.com/techradarindia/"
  }
}