{
  "source": "https://www.techradar.com/news/microsoft-teams-update-could-make-meetings-a-lot-more-bearable",
  "title": "Microsoft Teams update could make meetings a lot more bearable",
  "category": "computing",
  "updated": "2021-04-30T10:13:36Z",
  "author": "mike-moore",
  "summary": "Live transciptions, better polls and more in Microsoft Teams",
  "article": [
    "Microsoft Teams has unveiled a host of new features aimed at making meetings \"more engaging, inclusive, and productive.\"",
    "The video conferencing platform has seen a huge rise in users over the past year as employees have been forced to work from home during pandemic lockdowns, and is now looking to offer even more advantages to those workers aiming to collaborate out of the office.",
    "The new additions include live transciptions for Microsoft Teams meetings, as well as a way to share quick recaps of a call, and improved poll management and access.",
    "The inclusion of live transciption is a huge upgrade for Microsoft Teams, allowing participants to \"follow and review conversations alongside the meeting video or audio in real time\", Microsoft said in a blog post.",
    "Although only available in US English for the time being, the feature looks to boost accessibility for call participants who may have hearing issues or other disabilities, as well as those who may not have full language proficiency.",
    "Microsoft says that anyone joining a meeting after it has started will now be able to quickly review what has been said before they joined, and can even search for specific speakers - although participants will be able to opt out of being identified in transcripts if they wish.",
    "After a call has finished, Microsoft Teams can now also provide a recap of everything that happened during the meeting, allowing those who missed the call or want to revisit a specific area to catch up.",
    "A report containing a recording of the meeting, as well as a transcript, chat message, and all attached files will be shared with participants in the meeting Chat tab and viewable in the Details tab.",
    "Microsoft says the meeting recap function for Microsoft Teams has already begun rolling out, with live transcriptions can also be toggled on by tenant admins now.",
    "Lastly, Microsoft Teams polls are getting an upgrade, particularly for mobile users. Going forward, meeting presenters and organizers will be able to set two new poll types — open text and multiple-choice quiz. The platform will also now offer intelligent suggestions, making it easier to create polls, and can also provide post-meeting insights to help users spot trends and take action.",
    "Microsoft says the new poll features will be available to Teams users within the next few weeks."
  ],
  "headers": {
    "3": "Teams transciption"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-5830582404488779000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Fblog%2F2021%2F04%2F29%2Fview-live-transcripts-in-microsoft-teams-meetings-track-excel-changes-and-increase-hybrid-work-security-heres-whats-new-to-microsoft-365%2F"
  }
}