{
  "source": "https://www.techradar.com/news/here-are-7-genuinely-good-laptop-deals-you-shouldnt-miss-this-black-friday",
  "title": "Here are 7 genuinely good laptop deals you shouldn't miss this Black Friday",
  "category": "computing",
  "updated": "2021-11-26T20:24:06Z",
  "author": "alex-whitelock",
  "summary": "These choices are actually worth your cash",
  "article": [
    "Black Friday is a day that brings a lot of great laptop deals... and a lot of terrible laptop deals too - trust us, we know. Every year we literally sort through thousands of listings to find the creme of the crop for our big Black Friday deals roundup.",
    "That page is great, but with over 300 recommendations it can be hard to find what you're looking for quickly. So, here are the very best Black Friday laptop deals we've found so far today - seven picks that are genuinely good bang for the buck should you be looking to save some hard-earned cash. We've tried to recommend a nice selection of budgets here, from super cheap to ultrabook, but we think each one is a decent choice in its own right.",
    "Which is the best one? Oof, hard to decide - it's kind of like picking your favorite child, but we'd probably say this Dell XPS 13 for $649.99 (was $949.99). It's not super highly specced, but considering it's an extremely premium laptop with quality built and top-notch screen, we'd definitely say it's a great buy. We also love this Acer Swift 3 for $699 (was $849) at Amazon - an incredibly good price considering this one's got a Core i7 processor.",
    "Too expensive? No worries, we got you. We've also included some super bang for the buck options just down below...",
    "Not what you're looking for? We've got way more options over at our main Black Friday laptop deals article. Here's also a quick run down of the best retailers to check in at, should you want to continue the search by yourself."
  ],
  "headers": {
    "4": "Where to find more Black Friday laptop deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "for $649.99 (was $949.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1516716145886665000/https://deals.dell.com/en-us/productdetail/bifj",
    "for $699 (was $849)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAcer-i7-1165G7-Graphics-Fingerprint-SF314-59-75QC%2Fdp%2FB08JQJ5RKK%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1007639344463011100-20",
    "Black Friday laptop deals": "https://www.techradar.com/black-friday/black-friday-laptop-deals"
  }
}