{
  "source": "https://www.techradar.com/news/fcc-revokes-china-telecoms-us-authorisiation",
  "title": "FCC revokes China Telecom's US authorisiation over national security concerns",
  "category": "computing",
  "updated": "2021-10-27T13:21:10Z",
  "author": "steve-mccaskill",
  "summary": "China Telecom Americas must withdraw services",
  "article": [
    "China Telecom must withdraw its communications services in the US within 60 days after the US Federal Communications Commission (FCC) revoked its authorisation to operate.",
    "An ‘order of revocation and termination’ was issued to China Telecom Americas after the FCC ruled that the division was a subsidiary of the Chinese government and that this was unacceptable on national security grounds.",
    "“Today’s Order finds that China Telecom Americas, a U.S. subsidiary of a Chinese state-owned enterprise, is subject to exploitation, influence, and control by the Chinese government and is highly likely to be forced to comply with Chinese government requests without sufficient legal procedures subject to independent judicial oversight,” it said.",
    "China Telecom Americas has operated communications services for government agencies, Chinese businesses, and Chinese Americans and tourists for 20 years. However, the FCC said the national security environment with regards to China had changed since authorisation was first granted and that the firm was now an unacceptable risk to the US’s communications infrastructure.",
    "“China Telecom Americas’ ownership and control by the Chinese government raise significant national security and law enforcement risks by providing opportunities for China Telecom Americas, its parent entities, and the Chinese government to access, store, disrupt, and/or misroute U.S. communications, which in turn allow them to engage in espionage and other harmful activities against the United States,” the FCC added.",
    "China Telecom denies any allegation, adding that it would explore its options. Its fate is the latest in a series of sanctions taken by the US government against Chinese telecommunications companies.",
    "Federal agencies have long been banned from using equipment from Huawei and ZTE while last November both were declared to be national security risks.",
    "Huawei has persistently denied any allegations of wrongdoing, while Washington has yet to provide any evidence to support its claims. The Chinese government considers the US’s actions to be politically motivated.",
    "Separately, Huawei is also banned from dealing with US suppliers without a licence, severely limiting its access to key technologies such as chips and the Android operating system. Recently, there were moves to make the licence system even more restrictive.",
    "Need a new tariff? Our best SIM Only deals can help!"
  ],
  "headers": {
    "3": "China Telecom Americas"
  },
  "links": {
    "declared to be national security risks.": "https://www.techradar.com/news/fcc-set-to-release-funding-for-huawei-ripouts-in-us",
    "SIM Only deals": "https://www.techradar.com/sim-only/sim-only-deals"
  }
}