{
  "source": "https://www.techradar.com/news/google-bursts-project-loons-balloon-based-rural-internet-ambitions",
  "title": "Google bursts Project Loon's balloon-based rural Internet ambitions",
  "category": "computing",
  "updated": "2021-01-22T13:33:52Z",
  "author": "steve-mccaskill",
  "summary": "Loon is to disband after nine years",
  "article": [
    "Google’s Project Loon is shutting down, ending the company’s ambition of using huge balloons to deliver Internet connectivity to some of the hardest to reach parts of the globe.",
    "The venture was first set up in 2013 and spun-off into a separate entity known as ‘Loon’ two and a half years ago.",
    "Since then, Project Loon has worked to develop technology, such as self-navigation, and improve the economics of the project by speeding up the manufacturing and deployment times of balloons.",
    "In 2017, the project gained attention for helping with efforts to restore mobile connectivity in Puerto Rico in the aftermath of Hurricane Maria, while only last year it secured a deal with the Kenyan government to launch a commercial service in the country.",
    "However, Loon CEO Alastair Westgarth confirmed the plug had been pulled in a medium post.",
    "“While we’ve found a number of willing partners along the way, we haven’t found a way to get the costs low enough to build a long-term, sustainable business,” he said. “Developing radical new technology is inherently risky, but that doesn’t make breaking this news any easier. Today, I’m sad to share that Loon will be winding down.”",
    "However he added that he was proud of the company’s achievements and the technical contributions it had made over the past nine years. Although these won’t be used by Loon itself, they could prove useful for other efforts to connect the entire world.",
    "“Just as Loon’s technology is built on pioneering work done by others in fields from aviation to meteorology to artificial intelligence, we hope that some of Loon’s technology will live on to support the next generation of innovators,” he said."
  ],
  "headers": {
    "3": "Deflating"
  },
  "links": {
    "Project Loon": "https://www.techradar.com/news/alphabets-project-loon-internet-balloon-effort-just-made-a-major-breakthrough"
  }
}