{
  "source": "https://www.techradar.com/news/hellblade-2-devs-project-mara-could-be-one-of-the-best-looking-next-gen-games",
  "title": "Hellblade 2 dev’s Project: Mara could be one of the best-looking next-gen games",
  "category": "gaming",
  "updated": "2021-01-19T12:04:25Z",
  "author": "adam-vjestica",
  "summary": "Seeing is believing",
  "article": [
    "Hellblade 2 developer Ninja Theory has released a new video diary that showcases the technology powering its upcoming experimental horror game, Project: Mara. And the results are simply stunning.",
    "Project: Mara takes place inside a real-world apartment that has been painstakingly recreated in astonishing detail. The team’s new tech focuses on capturing even the smallest details to enhance the game’s realism, such as including dust and lint that’s built up on the ground, and near-perfect color accuracy for each object.",
    "Ninja Theory created a home-made scanner that allowed them to take materials such as leather and place them in the game with unbelievable realism. It’s honestly hard to tell the difference between an in-game object and real-life object, as shown in the trailer below.",
    "While no gameplay of Project: Mara is shown, Ninja Theory has previously teased that the game will explore storytelling with a novel approach, much like Hellblade did with its use of binaural audio and how it tried to recreate the effects of psychosis. The UK-based studio said Project: Mara will focus on \"the horrors of the mind as accurately and realistically as possible.\"",
    "No formats have been revealed for Project: Mara yet, but we'd expect to see it on Xbox Series S/X and PC when it eventually releases.",
    "Ninja Theory were recently acquired by Microsoft, and a trailer for Hellblade 2 was shown during the Xbox Series X’s initial reveal at The Game Awards. Even though the fidelity of the trailer was called into question, Project: Mara shows that the studio certainly has some incredible technology at its disposal.",
    "It’s always exciting to see developers pushing the boundaries of technology in video games, particularly during the start of a new console generation. With higher frame rates, 4K resolution and ray tracing capabilities now possible on Xbox Series X, Project: Mara could end up being an impressive showcase of what the system’s capable of."
  ],
  "headers": {
    "5": "Power your dreams"
  },
  "links": {
    "Hellblade 2": "https://www.techradar.com/news/senuas-saga-hellblade-2-release-date-trailers-news-and-rumors",
    "Ninja Theory were recently acquired by Microsoft": "https://www.techradar.com/news/microsoft-plans-on-fixing-its-xbox-exclusive-problems-with-these-five-new-studios",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}