{
  "source": "https://www.techradar.com/news/shark-vs-dyson-which-should-you-buy",
  "title": "Shark vs Dyson: which vacuum cleaner brand is better?",
  "category": "appliances",
  "updated": "2021-10-13T14:05:10Z",
  "author": "carrie-ann-skinner",
  "summary": "Should you choose Shark or Dyson when it comes to cleaning your floors?",
  "article": [
    "Getting stuck into the household chores isn’t the way most of us want to spend our free time. Like us, we’re sure you’d rather put your feet-up, enjoying some fresh air or maybe even hitting the shops.",
    "In fact, a recent YouGov survey revealed that 7% of Americans detest vacuuming. While we can’t take the floor cleaning off your hands, investing in one of the best vacuums can certainly make the shore a little easier.",
    "Dyson and Shark are two of the biggest names dominating the vacuum market right now, and if you’re considering kitting your home out with a powerful vacuum that can collect dust and dander from your floors with ease, it makes sense to opt for one of these brands.",
    "Dyson is a stalwart of the vacuum cleaner market with its first model being made available in 1993. They may be expensive but they’re loaded with cutting-edge technology that ensures their vacuum cleaners are some of the most powerful and, where the cordless vacuums are concerned, the longest-running on the market. Dyson’s latest model, the V15 Detect, even comes with a laser built-in to highlight dust particles that are hidden to the naked eye.",
    "Shark, on the other hand, may not have the same legacy as Dyson, but the brand has made waves with its range of upright and cordless vacuums that offer similar suction power but with a more affordable price tag. So which one should you choose? It really depends on what you’re looking for in a vacuum cleaner. Do you want an appliance that can collect dust, dander, and even ground-in dirt from carpets and hard floors, with very little effort that’s lightweight and loaded with cutting-edge tech, no matter what the cost, or do you want a more affordable option that’s slightly heavier and not as sleek-looking but gets the job done?",
    "Read on to discover whether a Shark or Dyson vacuum is the right fit for your home (and wallet) – or, if you’ve already decided which of the two you wish to buy, check out the best prices right now:",
    "Since 2018, Dyson has been focussing on cordless vacuums, and while the brand does offer a handful of corded upright vacuums and in the US and Australia, canister-style floor cleaners (often referred to as cylinder vacuums or barrel vacuums), its biggest range of floor cleaners are wire-free.",
    "There are currently six different models of cordless vacuum that are available worldwide, ranging from the Dyson V8, which was first launched in 2016 and is the brand’s most affordable option, to the latest Dyson V15 Detect, which as we’ve already mentioned is loaded with high-tech features including a laser that shines a green light to highlight dust particles so small, they’re usually invisible to the naked eye. Each design is more powerful than its predecessor, has a long-lasting battery,",
    "Dyson also offers the Omni-glide - a cordless vacuum cleaner designed specifically for hard floors. It comes with a unique cleaning head that has two soft brush bars and four 360-degree castors on the bottom, along with an articulating neck that enables it to be steered in any direction.",
    "If you’re after a corded vacuum, there’s only one option that’s available worldwide, the Dyson Ball Animal 2, although Australia has a further four upright models to choose from. Similarly, in the US and Australia, the Dyson Big Ball is a canister vacuum, while the UK is the only territory where you can officially pick up the Dyson Heurist 360, its robot vacuum.",
    "Shark has a much larger offering, with five models of corded upright vacuum that are available worldwide, as well as two cordless stick vacuums and one corded stick vacuum. There are also some models that are specific to the UK and the US, and a range of robot vacuums that are only available in America too.",
    "The model names differ between territories too, with monikers such as Rotator, Vertex, and Apex given to models on sale in the US, and far less interesting number and letter combinations such as NV801 used to distinguish designs in the UK. In Australia, you’ll find a combination of both naming conventions.",
    "The entry-level vacuums are less powerful and with smaller dust canisters, while as you move through the range the suction improves, as does the capacity and you’ll see the addition of handy tech that ensures the vacuum cleaner can be converted in handheld mode or stops hair getting tangled around the brush bar.",
    "There's also a range of robot vacuums available in the US only - you can find out more about those in the iRobot Roomba vs Shark article.",
    "So just how much will you have to spend on a powerful vacuum cleaner? Dyson’s range is more expensive than Shark’s, but they are lighter, more compact and as we’ve mentioned loaded with smarts that ensure a thorough clean, which in our eyes makes them worth the extra investment.",
    "If you’re after a cordless stick vacuum, the Dyson V8 is the brand’s entry-level vacuum available worldwide, will set you back $399.99 / £299.99 / AU$649.99, while its newest launch, the Dyson V15 Detect, is priced at $699.99 / £599.99 / AU$1,399.",
    "For hard floors, the Dyson Omi-glide costs $399.99 / £349.99 / AU$599.99 while the corded upright vacuum, the Dyson Ball Animal 2 will set you back $499.99 / £299.99 / AU$599.",
    "In comparison, Shark’s vacuum are more wallet-friendly, with the entry-level corded upright vacuum, the Shark Lift-Away Upright Vacuum Cleaner NV612, which is known as the Shark Navigator Lift Away in the US costing $239.99 / £169.99 / AU$499.99. Its top of the range model, Shark Anti Hair Wrap Upright Vacuum Cleaner XL with Powered Lift-Away & TruePet, which is known as the Shark Vertex Upright with Powered Lift-Away & TruePet in the US is priced at $479 / £399 / AU$699.99.",
    "For a cordless vacuum, you can expect to pay $399.99 / £399.99 (around AU$750) for a stick vacuum such as the Shark Anti Hair Wrap Cordless Stick Vacuum Cleaner with PowerFins & Flexology IZ300UK, which is known as the Shark Vertex Pro Lightweight Cordless Vacuum with DuoClean PowerFins & Powered Lift-Away in the US, and not available in Australia.",
    "Cordless upright models such as the Shark Anti Hair Wrap Cordless Upright Vacuum Cleaner with PowerFins, Powered Lift-Away & TruePet ICZ300UKT or the Shark Vertex Pro Cordless Vacuum with DuoClean PowerFins & Powered Lift-Away as it's known in the US (also not available in Australia) are priced around $399.99 / £429.99.",
    "When it comes to suction power these vacuum cleaner brands are pretty evenly matched. They make light work of collecting dust and dander from hard floors and carpets, as well as larger debris such as cereal. However, during testing we did some of Shark’s models that have wheels at the back of the floors cleaning head, such as the Shark Anti Hair Wrap Cordless Stick Vacuum Cleaner with PowerFins & Flexology, flicked some of the oats around the floor, rather than collecting them. This meant we had to make several passes to ensure the mess was cleared.",
    "Some of Dyson’s latest vacuums, such as the V15 Detect and the V11, will also automatically adjust the suction power to suit the floor type they’re being used on too - something Shark’s model can’t offer.",
    "On the whole Dyson vacuums are lighter and more compact than those offered by Shark. And when it comes to runtime of cordless vacuums, Dyson’s models also last longer than Shark. If we compare the Dyson V15 Detect with the Shark Anti Hair Wrap we’ve already mentioned, the Shark model offers 40 minutes run time while the Dyson has a battery life of 60 minutes. Both of these run times are based on using the vacuums on the standard mode but if you use the boost modes, you can expect the battery to drain faster.",
    "Both Dyson and Shark’s cordless models can be converted into handheld cleaners, which means you can easily clean up high or upholstery, some of Shark’s corded vacuums also offer this feature too, which is known as Lift-Away on these models. This isn’t something Dyson’s corded vacuums can do. Similarly, most of Shark’s vacuums have anti-hair wrap technology that stops human and pet hair from getting tangled around the brush bar. Whereas Dyson only has a dedicated cleaning head designed to stop hair getting tangled on its latest model, the V15 Detect.",
    "Dyson cordless vacuums typically have a longer run time than Shark models, but even the Dyson V11 Outsize will only last around 15 minutes if you continuously use it on the Boost mode. The newest Dyson models claim to have a run time of 60 minutes, whereas the latest Shark cordless vacuums have a maximum battery life of 40 minutes.",
    "Emptying the dust cup on any vacuum isn’t exactly fun and that’s why it’s important to consider the size of the dust bin on a new vacuum cleaner. Dyson cordless vacuums take the trophy here with bigger dust cups (the Dyson Outsize Absolute has a capacity of 0.5 gallons, whereas the Shark Pet Plus holds up to 0.085 gallons of dust and dirt.",
    "You also won’t want a vacuum to be any heavier than necessary so that it’s easy to maneuver around your home. There isn’t much between Shark and Dyson stick vacuums in terms of weight but the Shark Pet Plus is slightly lighter than the Dyson Outsize but by less than a pound."
  ],
  "headers": {
    "5": "Best Dyson and Shark deals",
    "6": "Range",
    "14": "Price",
    "20": "Features",
    "24": "Verdict"
  },
  "links": {
    "YouGov survey": "https://today.yougov.com/topics/lifestyle/articles-reports/2021/03/18/americas-favorite-least-favorite-chores",
    "best vacuums": "https://www.techradar.com/news/best-vacuum-cleaners",
    "cordless vacuums": "https://www.techradar.com/news/best-cordless-vacuum-cleaner",
    "Dyson V8": "https://www.techradar.com/reviews/dyson-v8",
    "Dyson V15 Detect": "https://www.techradar.com/reviews/dyson-v15-detect-absolute",
    "Omni-glide": "https://www.techradar.com/reviews/dyson-omni-glide-review",
    "Dyson Heurist 360": "https://www.techradar.com/reviews/dyson-360-heurist-review",
    "robot vacuum": "https://www.techradar.com/news/best-robot-vacuums",
    "iRobot Roomba vs Shark": "https://www.techradar.com/news/irobot-roomba-vs-shark-which-robot-vacuum-is-right-for-you",
    "Shark Anti Hair Wrap Cordless Stick Vacuum Cleaner with PowerFins & Flexology IZ300UK": "https://www.techradar.com/reviews/shark-anti-hair-wrap-cordless-stick-vacuum-cleaner-with-powerfins-and-flexology"
  }
}