{
  "source": "https://www.techradar.com/news/amd-claims-its-not-scared-of-the-apple-m1-chip-but-should-it-be",
  "title": "AMD claims it’s not scared of the Apple M1 chip – but should it be?",
  "category": "computing",
  "updated": "2021-08-06T10:11:27Z",
  "author": "matt-hanson",
  "summary": "Don’t get complacent",
  "article": [
    "In a recent interview, AMD appears to dismiss the threat of Apple’s M1 chip, but underestimating Apple could be a costly mistake.",
    "As you may recall, back in 2020, Apple stopped using Intel processors in its new MacBooks and Macs, and instead created its own M1 chip, that combines processor and graphics, and which is based on ARM architecture.",
    "The move was – in our view – a big success. The new M1-toting MacBook Air, MacBook Pro 13-inch, Mac mini and iMac all impressed us with their performance – easily rivalling or outperforming previous devices running on Intel hardware. This was especially true when it came to battery life, with the MacBook Pro 13-inch (M1, 2020) offering the longest battery life ever seen in a MacBook.",
    "It also gave Apple almost complete control over the hardware in its devices, rather than having to rely on third parties like Intel. And, as everyone knows, Apple likes complete control.",
    "By losing such a big customer as Apple, this move also hit Intel hard – but what about other chip makers?",
    "In a chat with The Indian Express, AMD's CVP of Product Management and Marketing, David McAfee, insists that the company has “a very competitive roadmap against what Apple is doing.” Not only that, but that “I don’t think that what Apple has done changes AMD’s strategy dramatically.”",
    "This is a rather dismissive attitude regarding the threat that Apple’s M1 chip poses to AMD. While AMD didn’t make CPUs for Apple products, critically-acclaimed M1 MacBooks could tempt people away from buying an AMD-powered laptop, for example.",
    "Also, AMD and Apple do work closely together, with AMD providing high-end graphic cards for many of Apple’s Pro products, including new workstation AMD Radeon Pro GPUs for the Mac Pro.",
    "However, while the Apple M1 chip uses integrated graphics that can’t rival AMD Radeon Pro dedicated graphics, rumors abound that the successor to the M1 chip, or even a more powerful ‘M1X’ variant for Pro devices, could come with much more powerful graphical capabilities. If that’s the case, the AMD/Apple partnership could be at risk.",
    "So, Apple offers a threat to AMD that may not be immediately obvious, and AMD would be foolish to ignore this. To be fair, McAfee does hint at why AMD doesn’t feel too threatened at the moment, explaining that “what Apple has done is that they have taken a different approach to design a chip… [with a] strong, single-threaded CPU performance that is right there with the Zen 3 series processor.”",
    "And, while the M1 chip is aimed at Apple devices only, AMD’s partnerships with Microsoft and Google on laptops, PCs and Chromebooks offers the company “an enormous amount of opportunity.”",
    "McAfee also praised the M1 chip: “I would say the biggest innovation Apple has brought into the ecosystem is the battery life and power efficiency that comes from the heritage of the mobile handset space and kind of taking it into the PC space.”",
    "This refers to the fact that while the M1 is Apple’s first chip for desktop and laptop PCs, it’s been making its own chips for its iPhones and iPads for many years now, and that experience has certainly paid off.",
    "Even if AMD doesn’t view the M1 chip as a threat at the moment, we think the added competition is nothing but a good thing for consumers. For too long, Intel dominated the processor market, but now AMD is snapping at its heels, and that has forced Intel to become more innovative in response. If Apple’s M1 chip can challenge these two established titans of the CPU world, things could get even more interesting.",
    "Via Neowin"
  ],
  "headers": {
    "5": "AMD shrugs off the challenge"
  },
  "links": {
    "Apple’s M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Apple stopped using Intel processors": "https://www.techradar.com/news/apple-could-announce-plans-to-ditch-intel-processors-for-its-macs-at-wwdc-2020",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pro 13-inch": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Mac mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "The Indian Express": "https://indianexpress.com/article/technology/tech-news-technology/we-got-a-very-competitive-roadmap-against-apple-m1-does-not-change-amds-strategy-7437760/",
    "new workstation AMD Radeon Pro GPUs for the Mac Pro": "https://www.techradar.com/news/new-amd-radeon-pro-gpus-provide-the-ideal-platform-for-creatives",
    "M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Neowin": "https://www.neowin.net/news/amd-says-it-isnt-too-scared-of-the-apple-m1-at-least-not-yet/"
  }
}