{
  "source": "https://www.techradar.com/news/half-life-isnt-dead-says-valve-developer",
  "title": "Half-Life isn’t dead, says Valve developer",
  "category": "gaming",
  "updated": "2021-03-25T11:18:33Z",
  "author": "rhys-wood",
  "summary": "But should we believe them?",
  "article": [
    "It’s time for that age-old question: will Half-Life 3 ever see the light of day? We might be getting closer to an answer, as Valve has once again dangled the carrot it’s been holding onto for the past 14 years.",
    "In an interview with TheGamer, Valve developer Robin Walker has shared some tidbits that might prove an exciting read for Half-Life fans, with Walker revealing that the revered series could be far from finished.",
    "The interview largely covered the process of developing Half-Life: Alyx, and the development team’s feelings about finally being able to work on a new game in the landmark first-person shooter franchise. Walker touched on quite the salient point, stating: “All the skepticism about Valve working on Half-Life that’s out there was just as alive within the company itself, and you just resign yourself to thinking that we’re never going to do it.”",
    "Walker’s comments seem to indicate that even team members within Valve couldn’t quite believe that they were indeed making another Half-Life game in the form of 2020’s VR hit Half-Life: Alyx.",
    "Walker also highlighted that Valve wasn’t ignoring the ‘narrative limbo’ fans had been left in since 2007’s Half-Life 2 Episode Two: “We also knew that Half-Life fans have been stuck in a sort of narrative limbo for a long time now, and we wanted that to change.”",
    "Touching on a spoiler-free recounting of Half-Life: Alyx’s ending, Walker left a potentially uplifting note for fans of the series, stating: “We wanted to be excited about the possibility again [...] we gave [you] a red herring where you think you know how it’s going to end with a fully plausible ending and we then subverted that, which were all really important elements that took a lot of iteration and came together towards the end.\"",
    "From Walker’s interview, it’s easy to draw the conclusion that Valve’s days of leaving Half-Life fans in a permanent state of hope could be over. Looking at Half-Life: Alyx’s sales figures might support this further, with over two million copies sold to date. This is especially impressive for a Steam exclusive VR title, arguably still something of a niche target audience.",
    "Walker, of course, made no mention of a Half-Life 3. Not that we expect him to, but it makes us wonder what a future Half-Life project might turn out to be. Will Valve stick to the VR format, exploring the lives of other popular Half-Life characters (we’d love a Dr. Kleiner Science Experiment Simulator), or could we eventually see the return of the legendary Gordon Freeman himself?",
    "Whatever happens going forward, it’s something of a relief to see that Valve certainly hasn’t forgotten about Half-Life, and with a new lineup of cutting edge GPUs like the Nvidia RTX 3080 and a new console generation underway with the PS5 and Xbox Series X, has there ever been a better time to expand the Half-Life universe?",
    "We also spoke to Robin Walker in a recent interview, where we learned the fascinating story of how GLaDOS nearly wasn't in Portal at all."
  ],
  "headers": {
    "5": "A new lease of Half-Life"
  },
  "links": {
    "Half-Life 3": "https://www.techradar.com/news/gaming/half-life-3-release-date-news-and-rumours-1290663",
    "TheGamer": "https://www.thegamer.com/half-life-alyx-ending-robin-walker-narrative-limbo/",
    "Half-Life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "GLaDOS nearly wasn't in Portal": "https://www.techradar.com/news/glados-nearly-wasnt-in-portal"
  }
}