{
  "source": "https://www.techradar.com/news/heres-your-first-look-at-cate-blanchett-in-the-borderlands-movie-kind-of",
  "title": "First look at Cate Blanchett in the Borderlands movie – kind of",
  "category": "entertainment",
  "updated": "2021-06-01T15:27:51Z",
  "author": "axel-metz",
  "summary": "Attention, Vault Hunters!",
  "article": [
    "We’ve finally got our first look at Cate Blanchett as Lilith in the upcoming Borderlands movie… sort of.",
    "Co-star Jamie Lee Curtis shared an image on Twitter showing a silhouette of Blanchett in costume, describing her character as the “legendary heroine, psycho blasting, vault hunting vixen with a bad attitude.”",
    "The post was soon followed up by a similar tweet from the official Borderlands Twitter account, which quoted Lilith’s famous line: “with me around, you might actually get somewhere.\"",
    "Here's a picture of Lilith as she appears in game form, if that helps make a comparison with the silhouette:",
    "The image marks the first time we’ve seen an actor in costume behind the scenes of the upcoming adaptation of the popular video game series, following the release of several images teasing the movie’s production.",
    "Most of those existing teasers have come from 13-year-old Ariana Greenblatt, set to play Tiny Tina, who has been filling her Twitter timeline with images and videos from the set – including those featuring Kevin Hart and Olivier Richters, who have signed on to play Roland and Krom, respectively.",
    "Joining Greenblatt alongside Blanchett and co. is Curtis as Dr. Patricia Tannis, Edgar Ramirez as Atlas and the voice of Jack Black as Claptrap. Casting has also been confirmed for the likes of Moxxi, Sir Hammerlock and Marcus – so we’re anticipating faithful adaptations of the game’s most iconic characters.",
    "As per behind-the-scenes teasers, filming is underway in Budapest, with Hostel director Eli Roth at the helm. Craig Mazin, writer of HBO’s Chernobyl, has penned the script. Mazin is also working on The Last of Us TV show with Neil Druckmann, so he's no stranger to the challenges posed by adapting such revered source material.",
    "Given the inevitable roadblocks posed by Covid-19 restrictions, there’s been no word yet on the movie’s release – though a date in 2023 is the most likely scenario.",
    "As with its release date, we’re still not 100% sure on which games (if any) the Borderlands movie will draw from.",
    "Judging by the characters confirmed to appear, though, we’re anticipating some sort of re-telling of the first game in the series, published by 2K Games on PS3, Xbox 360 and PC back in 2009.",
    "That means we expect to see, in some form, the likes of Roland and Lilith battling the Atlas Corporation on the planet Pandora for possession of otherwordly (and probably shiny) treasures.",
    "Given the success of recent video game adaptations, too – we’re thinking Mortal Kombat and The Witcher – there’s every chance the Borderlands movie will successfully mimic the tone of the explosive looter-shooter series."
  ],
  "headers": {
    "9": "What will it be about?"
  },
  "links": {
    "Borderlands movie": "https://www.techradar.com/news/borderlands-movie-cast-likely-release-date-and-what-we-know-so-far",
    "Twitter": "https://twitter.com/jamieleecurtis/status/1399698175611576320?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1399698175611576320%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.gamespot.com%2Farticles%2Fsee-cate-blanchett-as-lilith-from-the-borderlands-movie-in-new-silhouette-image%2F1100-6492188%2F",
    "tweet": "https://twitter.com/BorderlandsFilm/status/1399712419144892416",
    "Twitter timeline": "https://twitter.com/ArianaG#",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix"
  }
}