{
  "source": "https://www.techradar.com/news/dont-buy-these-sketchy-webcams-during-prime-dayim-serious",
  "title": "Don't buy these sketchy webcams during Prime Day...I'm serious",
  "category": "computing",
  "updated": "2021-06-22T08:00:22Z",
  "author": "jess-weatherbed",
  "summary": "If it looks too good to be true, it is.",
  "article": [
    "Now that the Amazon Prime Day deals have appeared, you may have been waiting for this opportunity to get yourself a tidy saving on one of the best webcams, and a quick glance at what's on offer reveals there is a tonne of savings to be had... if you're willing to take a risk, that is. The webcam market can be very confusing when so many models have a similar appearance, and when almost everything is advertised with a 1080p resolution and 30fps recording, how do you know what's actually worth buying? Thankfully I have a few bits of advice to avoid pitfalls like grainy video and questionable light detection, and of course some links to a few deals that are actually worth picking up.",
    "(Not in the US or UK? Scroll down for the best webcam deals in your region.)",
    "It's important to note that if a product aligns with the red flags I'm about to give you then that doesn't mean it's going to be a terrible product, but many of the webcams that should be avoided do fall into the same marketing patterns. As you can see above, this webcam appears in several listings for different companies, which likely means this is a wholesale product that is being rebranded. This could mean you get a lackluster quality webcam, and it's highly unlikely you'll get any official software to help you make adjustments to things like contrast, zoom or brightness. Another distinction is that many of these webcams rarely have any mention of the brands in the listing, simply being advertised as '2021 webcam' or 'Streaming webcam'. This is another indication that the actual product being sold is brandless, and while I appreciate having a big-brand name product isn't a necessity for most things (looking at you Apple), you have more to worry about with a webcam than just the resolution and frame rate. When you buy a webcam from Logitech, Microsoft, Razer and other more recognizable names, you can rest a little easier knowing that the sensors and software that have gone into the device are reliable and guaranteed to work on almost every computer or laptop.",
    "Funnily enough, there are some great deals on trusted webcams that don't fall under the official Prime Day sale, but if you're saving some cash then who really cares? We've compiled a list below of some of the best bargains to save you hunting through all the riskier buys that Amazon has on sale.",
    "No matter where you live, you'll find all the lowest prices for the best webcams from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "So what webcams should I buy on Prime Day?"
  },
  "links": {
    "Amazon Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "Logitech": "https://www.techradar.com/news/best-logitech-webcams"
  }
}