{
  "source": "https://www.techradar.com/news/save-dollar200-on-samsung-galaxy-note-20-deals-in-amazons-latest-sale",
  "title": "Save $200 on Samsung Galaxy Note 20 deals in Amazon's latest sale",
  "category": "phones",
  "updated": "2021-02-09T16:59:03Z",
  "author": "alex-whitelock",
  "summary": "Nearly the cheapest prices we've seen so far",
  "article": [
    "Unlocked phone fans will be pleased to see the latest Samsung Galaxy Note 20 deals at Amazon this week, which bring hefty $200 price cuts to both devices.",
    "Currently, the Samsung Galaxy Note 20 is retailing for $799 (was $999), while the premium Samsung Galaxy Note 20 Ultra is going for just $1,099 (was $1,299).",
    "Both these discounts get perilously close to the cheapest prices we've ever seen on these devices, being just $50 more than those we saw over Black Friday last November. Subsequently, you're getting a pretty great deal here if you're not looking to wait for the next sales event or for those new Galaxy Note devices to be released (August, most likely).",
    "While both these Samsung Galaxy Note 20 deals are still pretty pricey, bear in mind you're getting a top-end device here - regardless of your choice. The Ultra specifically is an absolutely amazing device with a stunning display, full S-Pen support, and incredible power under the hood. It's quite simply one of the best phones you can buy right now, even with the latest Galaxy S21 Ultra deals offering plenty of competition recently.",
    "Not in the US? See the best Galaxy Note 20 deals in your region just below.",
    "For more options, including those on carrier devices, see our main Samsung Galaxy Note 20 deals page."
  ],
  "headers": {
    "5": "Samsung Galaxy Note 20 deals at Amazon"
  },
  "links": {
    "for $799 (was $999)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSamsung-Unlocked-Smartphone-Long-Lasting-Warranty%2Fdp%2FB08BX8BZ1P%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1235046732297743000-20",
    "for just $1,099 (was $1,299)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSamsung-Unlocked-Smartphone-Long-Lasting-Warranty%2Fdp%2FB08BX8BZ1P%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3448690103614293500-20",
    "best phones": "https://www.techradar.com/news/best-phone",
    "Galaxy S21 Ultra deals": "https://www.techradar.com/deals/the-best-samsung-galaxy-s21-ultra-deals",
    "Samsung Galaxy Note 20 deals": "https://www.techradar.com/deals/samsung-galaxy-note-20-deals"
  }
}