{
  "source": "https://www.techradar.com/news/euro-2020-gives-var-an-almighty-shot-at-redemption",
  "title": "Euro 2020 gives VAR an almighty shot at redemption",
  "category": "appliances",
  "updated": "2021-06-10T12:30:25Z",
  "author": "axel-metz",
  "summary": "Opinion: VAR can remind us of its value",
  "article": [
    "Few technological innovations have been quite as controversial as the introduction of the Video Assistant Referee (VAR) to the sideline of the football pitch.",
    "While it's true that the likes of big data and artificial intelligence (AI) undeniably pose more of an immediate existential threat to the consumers of the world, few single pieces of technology have quite fueled the furore of billions (four billion, to be exact) like the supposedly human error-erasing acronym.",
    "First introduced by the International Football Association Board (IFAB) in 2018, VAR was intended to lessen the frequency of \"clear and obvious errors\" which seemed to so often plague major matches all over the world.",
    "Operating under the philosophy of \"minimal interference, maximum benefit\", the technology meant to provide referees with a helpful tool to take a closer look at goals, fouls or off-the-ball incidents amid the chaos of play.",
    "But the appeal of VAR lasted about as long as Spurs' shot at the Premier League title. Those fans, pundits, players and managers who so passionately clamored for its arrival now even more loudly oppose its continued use as a method of adjudication.",
    "Rather like the much-bemoaned international friendly, the system has become an unwanted fixture of the modern game.",
    "The crux of the widespread opposition to VAR lies in its failure to deliver on that promise of \"minimal interference\". Decisions take minutes at a time, with referees either standing idle as they wait to hear a call in their ear or pottering back and forth between the dreaded 'monitor' which itself is more TV-on-a-stick than sophisticated judgement system.",
    "Celebrations are cut-short, the flow of play is disrupted and fans are often left unsure whether to laugh, cry or shout expletives at the whole confused enterprise.",
    "Nobody can argue against VAR's use as an arbiter – frustration often stems from the rulebook rather than the system itself – but it's clear that the technology is not the cure-all referee solution it was cracked up to be.",
    "The 2020 UEFA European Championship, then, marks something of a do or die moment for VAR. The competition – which is expected to be watched by billions around the world – represents a chance for the officials at the system's controls to prove its capacity for reason, nuance and accuracy.",
    "VAR will be on duty for all 51 fixtures for the first time in the competition's history, having made its international tournament debut at the 2018 FIFA World Cup.",
    "At a pre-tournament briefing last week, Roberto Rosetti, chairman of UEFA's Referees Committee, re-iterated the technology's value to the sport: \"UEFA believes very much in this project. The aim is to not only to help referees, but to help football. We are very satisfied with the results, and we are working hard to improve the system.\"",
    "Given the international nature of the Euros, it's easy to think of the stakes as being higher than ever for VAR – and that's true, to an extent. Entire nations will tune in to watch their teams win or lose, and every controversial decision will therefore be scrutinized by millions more than would otherwise be the case.",
    "But by the same token, the tournament poses an almighty shot at redemption for the virtual assistant – especially considering the international refereeing controversies of the past.",
    "England fans, for instance, have for years bemoaned Diego Maradona's 'hand of God' goal in 1986, or Frank Lampard's not-awarded wonder strike in 2010. When refereeing bodies get assistance technologies right, those incidents don't happen.",
    "The widespread introduction of a goal-line decision system in 2012 now prevents the confusion of ghost goals similar to Lampard's, while today's VAR officials would have almost definitely ruled out Maradona's limb-assisted good fortune.",
    "The system bore fruit in 2018, too, when it correctly awarded a disallowed goal to South Korea which, in turn, knocked Germany out of the competition. Both Spain and France similarly benefited from VAR interventions that led them to top their respective groups.",
    "The point being, the stage is set to bring entire nations on side for VAR. When the system is used to intervene in domestic fixtures, one half of the viewing audience is almost always dissatisfied with the outcome. Internationally, though, there's every chance the beer-throwing crowds in Europe's major cities will rejoice at the system's intervention.",
    "If, for example, England progress to the competition's final thanks to a correct VAR decision, criticisms thrown towards the virtual assistant's use in the Premier League will be reduced to its lack of swift resolution, rather than its inherent value to the game.",
    "Of course, those same decisions might conversely enrage national audiences on the wrong side of a penalty award, offside call or red card, but the competition presents an opportunity for referees to ensure those decisions are absolutely the right ones – even if not the most popular.",
    "Euro 2020 can reaffirm VAR's value to the game, then, but it won't fix its most glaring pitfalls, which still remain beyond the technology's control. Handball and offside laws need to be re-written, referees need speedier communication lines between pitch and control room and, above all, decisions simply need to be made far, far quicker.",
    "Once there exists a universally-accepted standard of VAR intervention, where nuance is not only permitted, but encouraged, the system may become to football what Hawk-Eye is to tennis; fast, accurate and seamless.",
    "If VAR doesn't take center stage this June, it will be a win for football – and for the immediate future of the technology."
  ],
  "headers": {
    "6": "Broken promises",
    "14": "Comeback story"
  },
  "links": {
    "managers": "https://www.youtube.com/watch?v=0MuFU3ZqI90"
  }
}