{
  "source": "https://www.techradar.com/news/huawei-plots-return-to-smartphone-throne",
  "title": "Huawei plots return to smartphone 'throne'",
  "category": "phones",
  "updated": "2021-08-18T12:25:18Z",
  "author": "steve-mccaskill",
  "summary": "Huawei chairman tells staff the company has smartphone hopes",
  "article": [
    "Huawei has told employees that it still hopes to lead the smartphone market again, despite the crippling short-term impact of US sanctions that have seen its sales plummet.",
    "The Chinese vendor briefly overtook Samsung as the world’s largest device manufacturer in 2020, achieving a long-held ambition.",
    "However, the US views Huawei as a threat to national security and has imposed measures that severely impact its access to key technologies.",
    "While Huawei has moved as much development and production in-house as possible, including the HarmonyOS operating system, there are some components that have proved difficult to replace.",
    "The recently-launched P50 smartphone range lacks 5G connectivity due the difficulty in obtaining the relevant chipsets. Meanwhile, there are concerns that the company could eventually run out of its custom processors too.",
    "This disruption has affected sales, as has the sale of the Honor brand which accounted for roughly a quarter of all shipments.",
    "In a transcript of a Q&A with staff, seen by Reuters, Chairman Guo Ping acknowledged the threats faced by the company but added that all of the challenges it faced can be solved.",
    "“Everyone knows that phone chips need advanced technology in a small size with low power consumption. Huawei can design it, but no one can help us make it: we're stuck,” he is quoted as saying.",
    "“Huawei will continue to exist in the field of mobile phones and with continuous advances in chip production, the smartphone throne will eventually return.”",
    "According to figures from Canalys, Huawei was the world’s seventh largest smartphone manufacturer in Q1 2021, with other Chinese vendors making significant strides.",
    "Via Reuters"
  ],
  "headers": {
    "3": "Huawei smartphones"
  },
  "links": {
    "P50 smartphone range": "https://www.techradar.com/news/huawei-p50-series",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Reuters": "https://www.reuters.com/business/huawei-will-return-smartphone-throne-despite-crippling-sanctions-chairman-says-2021-08-18/"
  }
}