{
  "source": "https://www.techradar.com/news/equifax-snaps-up-id-theft-protection-firm-kount",
  "title": "Equifax snaps up ID theft protection firm Kount",
  "category": "computing",
  "updated": "2021-01-12T14:25:10Z",
  "author": "barclay-ballard",
  "summary": "Deal has been valued at $640 million",
  "article": [
    "Credit reporting firm Equifax has acquired identity theft protection company Kount for $640 million. Kount has gained a sizable customer base by utilizing artificial intelligence to prevent fraud and enhance digital identity services.",
    "Kount offers users a variety of products, including Kount Command, its ecommerce fraud prevention platform, Kount Data on Demand, which offers advanced analytics tools, and Kount Control for account takeover prevention.",
    "All of these tools will now be integrated within Equifax’s own fraud prevention platform, Luminate.",
    "Kount is currently in use across 17 billion devices and has been used to analyze 32 billion transactions. By purchasing Kount, Equifax hopes to be able to further expand into new markets as the popularity of digital payments continues to increase.",
    "The solutions currently offered by Kount should also benefit from the Equifax takeover, gaining access to huge quantities of Equifax data. This will only help improve the levels of trust that businesses can achieve when onboarding new customers and managing the experiences of existing ones.",
    "As part of the acquisition, Kount employees will join Equifax’s USIS business unit when the transaction closes, which is likely to be in the first quarter of the year.",
    "\"As digital migration accelerates, managing authentication and online fraud while optimizing the consumer's experience has become one of our customers' top challenges. The acquisition of Kount will expand Equifax's differentiated data assets to bring global businesses the information and solutions they need to establish identity trust online,\" Mark W. Begor, CEO of Equifax, said.",
    "\"Equifax is taking advantage of our strong 2020 outperformance and cash generation to make this strategic acquisition. Our data and technology cloud investments allow us to quickly and aggressively integrate new data and analytics assets like Kount into our global capabilities and bring new market-leading products and solutions to our customers.\"",
    "Via Venture Beat"
  ],
  "headers": {
    "3": "New markets"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "Venture Beat": "https://venturebeat.com/2021/01/08/equifax-will-pay-640-million-for-kounts-ai-driven-identity-and-fraud-prevention-tools/"
  }
}