{
  "source": "https://www.techradar.com/news/google-meet-will-soon-let-it-teams-disable-everyones-favorite-backgrounds-feature",
  "title": "Google Meet will soon let IT teams disable everyone's favorite backgrounds feature",
  "category": "computing",
  "updated": "2021-01-28T23:25:08Z",
  "author": "anthony-spadafora",
  "summary": "Custom and preset backgrounds can now be turned off in meetings by an admin",
  "article": [
    "The rapid transition to working from home during the pandemic was made much easier thanks to Google Meet and other video conferencing software.",
    "For its part, Google has continually updated Meet with new features such as breakout rooms, hand raising, polls and more. However, one of the most requested features the search giant added to Meet last year was the ability to use a custom background.",
    "With a custom background enabled, meeting participants can not only hide their messy rooms but they can also express their personality or interests while in a video call. Google also gave Meet users the ability to blur their background so that other participants wouldn't be able to see what's behind them.",
    "However, while custom backgrounds can be fun and help alleviate meeting fatigue, they can also be distracting which is why Google has added a new admin setting to Meet to control background replacement in video calls.",
    "In a new Google Workspace update, the search giant has added the ability for admins to enable or disable the use of custom or preset Backgrounds in Google Meet. It's worth noting that this setting is only available in meetings organized by an organizational unit (OU) level.",
    "The new admin setting will determine whether participants can change their background when joining a meeting. This means that if a meeting organizer has turned this setting off, participants will not have the option to change their background regardless of their own personal settings.",
    "For admins this feature will be on by default but it can be disabled at the OU or group level. However, the option will be disabled by default for Education and Enterprise for Education domains."
  ],
  "headers": {
    "4": "Disabling custom and preset backgrounds"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "custom background": "https://www.techradar.com/news/google-meet-finally-catches-up-with-zoom-teams-with-custom-backgrounds",
    "blur their background": "https://www.techradar.com/news/google-meet-gets-the-background-blurring-feature-finally",
    "meeting fatigue": "https://www.techradar.com/news/satya-nadella-isnt-a-big-fan-of-remote-working",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace"
  }
}