{
  "source": "https://www.techradar.com/news/google-pixel-6-and-pixel-6-pro-case-photos-show-how-big-these-phones-might-be",
  "title": "Google Pixel 6 and Pixel 6 Pro case photos show how big these phones might be",
  "category": "phones",
  "updated": "2021-06-17T13:03:46Z",
  "author": "james-rogerson",
  "summary": "Big screens mean big cases",
  "article": [
    "Google’s latest flagship – the Pixel 5 – has just a 6-inch screen, but it’s looking likely that the Google Pixel 6 range will be a lot bigger, and leaked case photos back that idea up.",
    "A post on Weibo (a Chinese social network) includes images that supposedly show cases designed for the Google Pixel 6 and the Pixel 6 Pro, alongside one for the 6.3-inch Google Pixel 4 XL.",
    "The case for the Pixel 6 looks to be more or less exactly the same size as the Pixel 4 XL’s, which makes sense given its rumored 6.4-inch screen, while the Google Pixel 6 Pro case is significantly bigger, in order to house its rumored 6.67-inch display.",
    "These cases also give us another look at the possible camera layouts of the two upcoming phones, with the design more or less matching what we’ve seen in unofficial renders.",
    "Both cases have a camera block running horizontally across the back, and while there are all sorts of cut-outs, it’s thought based on earlier leaks that only two of those are for actual lenses in the case of the Pixel 6, with a third added (the large square one) for the Pixel 6 Pro.",
    "Given the shape, that extra snapper is almost certainly a periscope one, which based on previous leaks could be 8MP and offer 5x optical zoom. Interestingly, the cut-out for the middle lens on the Pixel 6 Pro looks to be smaller than the equivalent one on the Pixel 6's case, so perhaps they'll have quite different camera setups.",
    "Of course, none of this is confirmed yet and we’d take these cases with a pinch of salt, as it’s possible that they were created based on leaks and rumors rather than any official information. Still, it’s looking ever more likely that the radical redesign we keep seeing is accurate.",
    "Via Phone Arena"
  ],
  "headers": {},
  "links": {
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Weibo": "https://m.weibo.cn/detail/4648286281797683",
    "Google Pixel 4 XL": "https://www.techradar.com/reviews/google-pixel-4-xl-review",
    "unofficial renders": "https://www.techradar.com/news/who-needs-google-io-google-pixel-6-pro-renders-and-specs-revealed-by-leaker",
    "Phone Arena": "https://www.phonearena.com/news/google-pixel-6-pro-case-leak-zoom-camera_id132915"
  }
}