{
  "source": "https://www.techradar.com/news/balan-wonderworld-devs-got-carried-away-developing-for-ps5",
  "title": "Balan Wonderworld devs got ‘carried away’ developing for PS5",
  "category": "gaming",
  "updated": "2021-03-26T15:15:33Z",
  "author": "vic-hood",
  "summary": "Interview: ‘I don’t think that the demand for platformers will ever disappear’",
  "article": [
    "When you think of games that utilize the raw power of the new PS5 and Xbox Series X consoles, platformers aren’t necessarily the first genre that comes to mind. However, we’ve already seen the likes of Astro’s Playroom, Sackboy: A Big Adventure and Crash Bandicoot 4 prove that platformers can thrive on the latest hardware – and Balan Wonderworld is aiming to follow suit.",
    "Co-developed by Arzest and Square Enix subsidiary Balan Company, Balan Wonderworld is the product of a wealth of gaming experience. Led by the creator of the Sonic the Hedgehog game series, Yuji Naka, the development team includes veterans who, between them, have worked on classics that include the aforementioned Sonic series, Night into Dreams and the Dragon Quest series.",
    "We spoke to Balan Company producer Noriyoshi Fujimoto, himself an industry veteran, about why platformers are ageless, and how Balan Wonderworld utilizes the power of the PS5 while staying true to what made the genre a classic.",
    "Playing Balan Wonderworld, it’s easy to see where the team’s previous projects have influenced the vibrant platformer. From its puzzle elements to its madcap characters, it’s no surprise that similarities have been drawn between Balan Wonderworld and previous Yuji Naka works like Sonic and Night into Dreams – and this influence is something that Fujimoto doesn’t shy away from.",
    "“There’s indeed some influence, since development staff who worked on Sonic and Nights have reunited again,” Fujimoto tells us over email. “I imagine that people draw parallels with those games due to the gameplay where you solve puzzles and tricks in each stage to progress, elements that are typical in platformers like Sonic, and because of the unique characters and approach to storytelling, which Nights also had.”",
    "Despite the plethora of AAA games landing on PS5 and Xbox Series X, pushing the boundaries of both visual fidelity and performance, platformers still firmly hold a place in our hearts. We’ve seen that with the success of Little Nightmares 2 and the anticipation around Ratchet and Clank: Rift Apart, while the likes of Hollow Knight, Inside and Celeste remain some of the best-loved modern iterations of the genre. And, despite the constantly-shifting gaming landscape, Fujimoto firmly believes that platformers haven’t got a shelf life, and that innovation is the key to keeping the genre alive.",
    "“Platformers have been around since the early days of gaming,” he tells us. “That shows, I believe, that platformers are a very universal style of play. Universal styles of play will persist across different eras. Combining these kinds of universal playstyles with other elements creates lots of fresh ideas for games. For all these reasons, I don’t think that the demand for platformers will ever disappear.”",
    "Given that Balan Wonderworld is releasing in the early days of PS5 and Xbox Series X, the team had to develop its game for hardware that hadn’t yet been released – a task that came with challenges, but also opened the door for a range of new possibilities.",
    "“Whenever you’re developing on a pre-launch development console, the tricky thing that many may not realize is, if you encounter a bug, it takes more time to resolve whether it was a problem with the game or a problem with the hardware,” Fujimoto explains.",
    "“On the other hand, the overwhelming specs of the console meant that some technical limitations we faced previously were removed completely. This meant we got a bit carried away with the excitement, coming up with more and more things we wanted to add in during development.”",
    "And Balan Company definitely took advantage of the sheer amount of content that could be packed into the game, offering 80 vibrant outfits for players to collect on their adventure.",
    "“From the very beginning, one of our goals for development was to create a game with every kind of action – to put in over 80 different kinds of action,” Fujimoto says. “But even if you include a huge variety of actions in a game, it’s difficult to map all of those to the buttons, it’s difficult for the player to remember them all, and it’s difficult to create the opportunity",
    "to use them all.",
    "“When we were thinking about how to make it easy for the player to understand and use all the",
    "actions to their fullest, we came up with the idea of having one action per costume. This meant we could make the action controls intuitive, and the gameplay simple enough to be enjoyed by anyone.”",
    "However, while critics (including TechRadar) have lauded the game’s crisp and colorful visuals and classic collectathon gameplay, the game’s controls have been something of a sore point, resulting in Square Enix announcing that a day-one patch for Balan Wonderworld will be rolled out to help address camera and movement issues.",
    "Despite these issues, we were impressed with how Balan Wonderworld makes clever use of the DualSense PS5 controller’s adaptive triggers, with the resistance of the triggers being adjusted depending on the costume you’re wearing, which makes the costume variations feel more substantial. For example, if you’re dressed as the Tornado Wolf, there’s a satisfying amount of trigger resistance present when you perform a spin; the same can be said when flinging your fists when dressed as the Pumpkin Puncher. But this DualSense controller support wasn’t always something that was on the cards for Balan Company.",
    "“Towards the end of development, we wanted to add a feature that made use of the PS5’s unique capabilities, so we added the adaptive trigger feature to the game”, Fujimoto tells us. “The implementation itself wasn’t too difficult, and the development staff could make minute adjustments however we liked. Thanks to this, we managed to convey the unique character and variation between the 80 costumes even better than before.”",
    "While the DualSense controller certainly adds to the immersion of Balan Wonderworld, Fujimoto believes that the PS5 and the Xbox Series X are “probably the best consoles to play platform games on”, citing the “smooth action controls at 60fps” and higher-quality graphics.",
    "And despite ongoing stock shortages of both consoles, Fujimoto isn’t concerned about the impact on Balan Wonderworld’s launch.",
    "“Balan Wonderworld is a multi-platform game, available on PS5, PS4, Switch, Xbox Series X/S, Xbox One and Steam, so I don’t think there will be any impact, Fujimoto tells us. “Platformers tend to continue to sell over a longer period of time compared to other genres, so that’s another reason I don’t think it will be affected.”",
    "Balan Wonderworld is one of only a handful of new family-friendly games released for the PS5 and Xbox Series X consoles, and we asked Fujimoto why he thinks that’s the case. He told us that he believes it’s understandable that first-party developers would want to release “impressive games” that “use that power to its full extent”, and that often these “become games for adults”. In addition, he highlighted the fact that most early adopters of new consoles will be adults, so it makes “good business sense” to target that audience.",
    "“With this in mind, Balan Wonderworld was developed as a game for all ages, that both children and adults could play,” Fujimoto explains. “We anticipated that there may not be many other games pitched at Balan Wonderworld’s target audience around the new console launch, and undertook the challenge ourselves.”",
    "Balan Wonderworld releases on March 26 for PS5, PS4, Nintendo Switch, Xbox Series X/S, Xbox One and PC (via Steam)."
  ],
  "headers": {
    "3": "Persisting across eras",
    "7": "Developing for the next generation",
    "21": "For all ages"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Astro’s Playroom": "https://www.techradar.com/news/astros-playroom-will-make-you-fall-in-love-with-the-ps5-dualsense-controller",
    "Sackboy: A Big Adventure": "https://www.techradar.com/reviews/sackboy-a-big-adventure-review",
    "Crash Bandicoot 4": "https://www.techradar.com/reviews/crash-bandicoot-4-its-about-time-review",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Hollow Knight": "https://www.techradar.com/news/games-of-the-generation-hollow-knight-is-a-haunting-2d-platformer-you-need-to-master",
    "Inside": "https://www.techradar.com/news/games-of-the-generation-inside-is-one-of-the-best-platformers-of-the-modern-age-and-scary-as-hell"
  }
}