{
  "source": "https://www.techradar.com/news/its-three-years-since-the-dji-mavic-2-pro-drone-launched-so-where-is-its-successor",
  "title": "It's three years since the DJI Mavic 2 Pro drone launched, so where is its successor?",
  "category": "cameras",
  "updated": "2021-08-24T12:11:50Z",
  "author": "mark-wilson",
  "summary": "We piece together the puzzle of the rumored DJI Mavic 3 Pro",
  "article": [
    "Yesterday marked three years since the DJI Mavic 2 Pro and DJI Mavic 2 Zoom landed and changed the game for consumer drones. They're still great flying cameras, but where on earth are their successors?",
    "There's still no sign of any major leaks for a DJI Mavic 3 Pro. And now the DJI Mavic 2 Pro is out of stock in most regions (including the US, and Australia) unless you buy it with a Smart Controller. So what is happening and how long will drone fans have to wait for a Mavic 2 Pro successor?",
    "In fairness, DJI drones don't all follow precise life-cycles. The Mavic 2 series arrived two years after the original DJI Mavic Pro flew into town in September 2016, while others like the DJI Mavic Air range (now headed by the DJI Air 2S) are on more of an annual update cycle.",
    "But three years is a record wait for a refresh to one of DJI's flagship drones. So why the long wait for a Mavic 2 Pro successor? The rumors suggest that, while a Mavic 3 Pro is likely en route, a few big factors have produced a significant headwind that explain its slow arrival.",
    "The most obvious of these is the global chip shortage. We've seen launch delays and stock shortages across most of tech, from the PS5 to graphics cards and even cars. Cameras and drones are no different – recent rumors suggest the Sony A7 IV, a camera many have been waiting on for over three years, has seen its launch date pushed back to late October.",
    "According to a DroneDJ source, this is also a factor for the DJI Mavic 3 Pro. It claims the chip shortage is affecting the production of a new Smart Controller, which is a higher-end alternative to the DJI's bundled controllers and comes with a 5.5in built-in touchscreen. Unless this controller is bundled with the DJI Mavic 3 Pro, it's not clear why it would hold up the launch of the drone itself – but either way, the chip shortages appear to be having an understandable effect on DJI's next launch.",
    "But there are a couple of other contributing factors that may push the the DJI Mavic 3 Pro's launch back to early 2022. Firstly, the Mavic 3 Pro is, like the Mavic 2 series before it, likely to be a significant upgrade on its predecessor. The DJI Air 2S was able to land less than a year after the DJI Mavic Air 2 because it effectively repackaged existing DJI parts – the 20MP 1-inch sensor of the Mavic 2 Pro crammed inside the subtly modified body of the Mavic Air 2.",
    "By contrast, the Mavic 3 Pro is likely to need a complete redesign. For a start, the fact that the DJI Air 2S has managed to squeeze a 1-inch sensor into a compact, folding body – a combination that saw it rocket to the top spot in our guide to the best drones – means the Mavic 3 Pro will likely need a new sensor to justify that 'Pro' name.",
    "According to DroneDJ's source in China, the Mavic 3 Pro will have a Four Thirds chip and \"development has been problematic (on the Hasselblad side)\". DJI bought a majority stake in Hasselblad in early 2017, and the companies co-developed the L1D-20c camera on the Mavic 2 Pro, so it would make sense for them to do the same on the Mavic 3 Pro. But a Micro Four Thirds camera would be an extremely challenging thing to include on a relatively compact drone.",
    "DJI has previously developed Micro Four Thirds cameras like the Zenmuse X5S, but that was designed for huge drones like the DJI Inspire 2. DJI's Mavic range exists to offer professional imaging powers in compact, travel-friendly drones – so it remains to be seen whether a Micro Four Thirds camera is possible in a backpack-friendly model. Still, it'd certainly help the Mavic 3 Pro hit its apparent aim of offering 8K video for the first time on a DJI drone, and 8K Four Thirds sensors do now exist.",
    "The final factor that may have added friction to the development of the DJI Mavic 3 Pro is DJI's recent issues in the US. In December 2020, the company was added to the US' 'Entity List', a trade blacklist that restricts DJI's access to US technologies. It isn't clear whether or not this has had a direct effect on the development of new DJI drones, but the distraction and knock-on effect to its reputation, coupled with the overall slow-down of the pandemic, may have understandably had an impact.",
    "Combine all of these factors, and it's easy to see why we're still waiting for a successor to the Mavic 2 series. It may also explain why we're only likely to get a DJI Mavic 3 Pro (or DJI Pro 3, as it may be called), rather than an additional 'Zoom' model. DroneDJ's source claims there won't be a new Zoom drone, and so far we have seen zero speculation that one could be in the pipeline.",
    "This is a slight shame – we were fans of the DJI Mavic 2 Zoom, which was particularly good for photographers who wanted to get closer to the action, thanks to its 24-48mm optical zoom lens. But the DJI Mavic 2 Pro was the more popular all-rounder and DJI has recently been developing its 'digital zoom' functions instead. We saw the latter on the DJI Air 2S, and it performs pretty well as long as you don't go beyond the 2x zoom.",
    "Having functions like this in a Mavic 3 Pro with a larger sensor, refreshed design, new controller and more is certainly a tantalizing proposition for fans of aerial cameras. It looks like we'll have to wait a little longer to see it – but just like trains, the delay is a little easier to endure when you know what's causing it."
  ],
  "headers": {
    "6": "The bigger picture",
    "10": "Strong headwinds"
  },
  "links": {
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "DJI Mavic 2 Zoom": "https://www.techradar.com/reviews/dji-mavic-2-zoom",
    "DJI Mavic 3 Pro": "https://www.techradar.com/reviews/dji-mavic-3",
    "global chip shortage": "https://www.techradar.com/news/chip-shortage-nightmare-could-last-for-years-says-ibm",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Sony A7 IV": "https://www.techradar.com/reviews/sony-a7-iv",
    "DroneDJ": "https://dronedj.com/2021/08/10/djis-mavic-3-pro-release-planned-for-january-2022/",
    "best drones": "https://www.techradar.com/news/best-drones",
    "DroneDJ's source in China": "https://dronedj.com/2021/08/10/djis-mavic-3-pro-release-planned-for-january-2022/",
    "DJI Inspire 2": "https://www.techradar.com/reviews/dji-inspire-2-review",
    "DJI's recent issues in the US": "https://www.techradar.com/news/dji-ban-what-it-means-for-drone-fans-and-the-future-of-dji"
  }
}