{
  "source": "https://www.techradar.com/news/oled-tvs-are-much-better-for-the-environment-says-lg",
  "title": "OLED TVs are much better for the environment than QLED or LCD – here's why",
  "category": "televisions",
  "updated": "2021-05-18T15:39:35Z",
  "author": "henry-st-leger",
  "summary": "Say goodbye to plastic, and hello to OLED",
  "article": [
    "Choosing between an OLED TV and an LCD or QLED screen? For the environmentally conscious among you, an OLED model might be the best choice.",
    "LG has laid out some attractive figures for OLED TV recycling, showing that OLED panels for 65-inch TVs require a mere 0.43kg of plastic, compared to the 5.2kg of plastic utilized in a 65-inch LCD. That's 12 times as much plastic in an LCD screen – and it's not plastic that's easily recyclable, either, given the complexity of the material (via Business Korea).",
    "Of course, the overall environmental impact of a television purchase needs to take more than just plastic usage into account – but OLED TVs fare much better when it comes to power usage too. Due to the self-emissive nature of OLED panels, they don't require the backlight systems of LCD and QLED screens, and use a fraction of the amount of energy.",
    "LG Display has also been the recipient of multiple Eco-Product certifications from SGS, \"a Swiss-based global leader in inspection, verification, testing, and certification.\"",
    "In 2017, SGS praised LG's reduction of \"hazardous substances\" in OLED TV manufacturing compared to LCD, as well as the ability of a \"self-luminous display [...] that used less parts and attained greater resource efficiency and recycle rates.\"",
    "Samsung made some noise in 2020 around 'Eco-packaging' for select new Samsung TVs, made from \"eco-friendly corrugated cardboard\" – while its new battery-free, solar-powered Samsung remote does seem a step in the right direction too. But the aggregate wastage of plastic-heavy LCD TVs may be more than these green measures can counteract by themselves.",
    "LG is certainly flexing the advantages of its OLED TVs as of late, particularly the 20% brightness increase in the LG G1's OLED evo panel – even if it recommend an 83-inch screen to get a \"representative\" experience.",
    "OLED TVs are only getting bigger, too, with sales of 65-inch TVs in the OLED market finally inching past sales of 55-inch TV models last year.",
    "In a world of ever-larger televisions, it's never been more important to consider how all that material is being sourced, used, and thrown away – and the far higher recycling rates for OLED TV materials certainly aid its green credentials."
  ],
  "headers": {
    "6": "Big flex"
  },
  "links": {
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "65-inch TVs": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "Business Korea": "http://www.businesskorea.co.kr/news/articleView.html?idxno=67245",
    "SGS": "https://www.sgs.com/en/news/2017/10/sgs-awards-first-sgs-eco-product-certificate-to-lg-display-oled-display",
    "Eco-packaging": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5065635728756461000&xs=1&url=https%3A%2F%2Fnews.samsung.com%2Fglobal%2Fsamsung-to-introduce-eco-packaging-for-its-lifestyle-tv-lineup&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Foled-tvs-are-much-better-for-the-environment-says-lg",
    "LG G1": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "55-inch TV": "https://www.techradar.com/best/55-inch-4k-tv"
  }
}