{
  "source": "https://www.techradar.com/news/cruella-end-credits-scene-explained-how-disneys-prequel-ties-into-101-dalmatians",
  "title": "Cruella end credit scene explained: how Disney's prequel ties into 101 Dalmatians",
  "category": "entertainment",
  "updated": "2021-06-03T18:00:19Z",
  "author": "tom-power",
  "summary": "Cruella on Disney Plus has a trick up its sleeve",
  "article": [
    "Spoilers for Cruella on Disney Plus.",
    "Cruella has arrived on Disney Plus, and the 101 Dalmatians prequel has gone down relatively well with fans and critics alike.",
    "The comedy crime-drama flick, which stars Emma Stone as the titular Disney anti-hero turned villain, is pretty standard fare as far as Disney movies go. However, there are nods to the company's 101 Dalmatians animated and live-action movies dotted throughout – and there's one particular scene during the movie's end credits that sets up events yet to come.",
    "A word of warning before we begin: we're heading into spoiler territory for Cruella from this point on. If you haven't watched it all of the way through, you'll need to turn back now or have it ruined for you.",
    "The mid credits scene opens on Roger (Kayvan Novak) sitting at his piano. Having been fired by Emma Thompson's Baroness earlier in the movie, Roger is pursuing a full-time career as a pianist when he hears his doorbell ring.",
    "The footage cuts to Anita Darling (Kirby Howell-Baptiste), Cruella's childhood friend who also works as a gossip journalist and helped Cruella promote her fashionsta persona earlier in the movie, as she opens her front door. There's nobody there, but a white parcel with a blue trim is sitting on Anita's doorstep. We know it's Cruella who has left it, but Anita doesn't.",
    "What does she find when she lifts the lid? Yep, a Dalmatian puppy.",
    "A quick camera switch back to Roger now. Lifting the Dalmatian puppy, which he has also received, out of its box, he inspects a greeting card that came with it. \"Meet Pongo! Enjoy, Cruella.\"",
    "Meanwhile, Anita reads the card that accompanied her puppy's arrival: \"Meet Perdita! See you soon, Cruella\". Anita smiles and, carrying Perdita, heads back inside.",
    "Finally, Roger is seen composing his iconic musical number – Cruella de Vil – and the camera pulls back out of his apartment to look across the city of London. An ominous storm hangs overhead and the movie's end credits begin to roll.",
    "What does all of this mean? Well, fans of Disney's 101 Dalmatians animated and live-action movies will know exactly how events play out after this.",
    "For those who don't, or those of you who need a reminder: Pongo and Perdita are the same Dalmatian dogs that Roger and Anita own in the 1961 and 1996 film adaptations of Dodie Smith's 1956 novel.",
    "In both instances, Pongo ends up spotting Perdita and falling for her. By proxy, Roger and Anita meet – and the duo also fall in love, move in together and eventually marry.",
    "It's Pongo and Perdita, however, who are key to the story of 101 Dalmatians. The pair became father and mother to a litter of Dalmatian puppies who, unbeknownst to Roger, Anita and their dogs, Cruella is eyeing up. Why? So she can make a fashionable coat out of their (and other Dalmatian) skins. What a pleasant individual, eh?",
    "It seems, then, that it's Cruella who instigates Roger and Anita's marriage (as well as Pongo and Perdita's meeting) with the sole aim of buying the puppies back and creating her coat out of their hides.",
    "Of course, Cruella's plan doesn't come to fruition. In 101 Dalmatians, Roger stands up to her, refusing to sell Pongo and Perdita's litter. Furious, Cruella storms out and vows to get the puppies by any means necessary.",
    "We won't spoil the rest of 101 Dalmatians for you here, if you haven't seen it yet, but it's worth checking out the 1961 animated movie, 1996 live-action flick (which stars Glenn Close) or both if you enjoyed Cruella.",
    "It's possible. There's the potential to tell a story between the events of Cruella and 101 Dalmatians, so we wouldn't rule out the prospect of Disney greenlighting a Cruella sequel.",
    "For what it's worth, Emma Stone and Emma Thompson hinted that they would be happy to return for Cruella 2 if a suitable script was written. Speaking to Rotten Tomatoes, Stone and Thompson seemed open to the idea of producing Cruella 2 in the same vein as The Godfather Part II. Francis Ford Coppola's legendary crime-drama flick served as both a prequel and sequel to The Godfather, and it's something that Stone and Thompson joked that they'd like to see happen.",
    "If a sequel was greenlit, it would have to take place within two or three years following the events of Cruella. Pongo and Perdita will grow up quickly and, while there's no confirmation about how old each dog is in 101 Dalmatians, they look relatively young.",
    "Cruella also looks much older in 101 Dalmatians than she does in the Disney Plus movie. The time jump between Cruella and 101 Dalmatians, then, would be too great if Disney wanted Cruella to have aged enough by the latter's events. The only way this would work is if Disney retconned the events of both 101 Dalmatians adaptations, which we can't see happening.",
    "Whatever Disney decides (based on Cruella's popularity or potential box office success), Cruella's ending can be viewed in two ways. It not only sets up the events of 101 Dalmatians, but it gives itself enough wriggle room to squeeze a sequel in if there's the hunger for one.",
    "If we had to speculate, we'd say that there will be a Cruella 2. Whether it would be a Disney Plus exclusive or receive a simultaneous theatrical release, much like Cruella has, is unclear at this stage."
  ],
  "headers": {
    "4": "Cruella mid credits scene explained: how does the Disney Plus movie set up 101 Dalmatians?",
    "17": "Cruella after credits scene explained: will there be a sequel?"
  },
  "links": {
    "Cruella": "https://www.techradar.com/news/how-to-watch-cruella-online-and-stream-the-full-movie-on-disney-plus-anywhere",
    "Rotten Tomatoes": "https://editorial.rottentomatoes.com/article/emma-stone-and-emma-thompson-are-in-for-a-godfather-ii-style-cruella-sequel/"
  }
}