{
  "source": "https://www.techradar.com/news/oculus-confident-that-vr-is-just-getting-started-heres-why",
  "title": "Oculus confident that VR is just getting started - here's why",
  "category": "gaming",
  "updated": "2021-04-01T10:25:23Z",
  "author": "rhys-wood",
  "summary": "Games to become ‘bigger, more complex’",
  "article": [
    "Director of Production at Oculus Studios Mike Doran took to Reddit to speak on what the company’s plans are for its long-term future, and that includes expanding the scope and ambition of VR titles made under its banner.",
    "The most intriguing comment Doran made was as follows: “As far as content goes, we’re working on games now (and have been for a while) that are launching in several years. The average development cycle for Oculus Studios VR titles is getting longer and you’ll start to see bigger, more complex games as a result.”",
    "In response to a question about whether we’ll start seeing these more ambitious VR games in the near future – not just half a decade from now – Doran confirmed this with a simple one-word answer: “Yep!”",
    "Virtual reality as a medium has really come into its own over the past few years. Upon the initial wave of Oculus Rift and PlayStation VR devices, you’d be hard pressed to find anything resembling little more than a tech demo.",
    "There’s not necessarily anything wrong with that, though, as most of those titles were appropriately priced (many of them were free, even) and provided a glimpse at what VR could eventually blossom into. That said, an unfortunate side effect of such an abundance of shorter experiences releasing week after week definitely contributed to dulling the medium’s novelty.",
    "Now, though, it’s gotten to a point where we’re seeing fewer one-and-done experiences or afterthought VR ports of existing titles, and a greater focus on more ambitious projects like PSVR’s Astro Bot Rescue Mission, EA’s Medal of Honor: Above and Beyond and Valve’s excellent Half-Life: Alyx. Here’s hoping that Facebook Games and Oculus Studios’ renewed focus on quality over quantity can continue to build virtual reality as an essential gaming platform.",
    "There’s really no better time for Oculus Studios to expand its scope like this, either, when you look at the massive success of the Oculus Quest 2 VR headset, which has now sold more units than all other Oculus devices combined."
  ],
  "headers": {
    "3": "Virtual insanity"
  },
  "links": {
    "Reddit": "https://www.reddit.com/r/OculusQuest/comments/mfx3wk/mike_doran_director_of_production_oculus_studios/gsqpjcz/?utm_source=reddit&utm_medium=web2x&context=3",
    "Oculus Rift": "https://www.techradar.com/reviews/gaming/gaming-accessories/oculus-rift-1123963/review",
    "PlayStation VR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "Astro Bot Rescue Mission": "https://www.techradar.com/news/games-of-the-generation-astro-bot-rescue-mission-does-for-vr-what-mario-64-did-for-3d",
    "Half-Life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "all other Oculus devices combined": "https://www.techradar.com/news/oculus-quest-2-sales-figures-prove-vr-has-finally-gone-mainstream"
  }
}