{
  "source": "https://www.techradar.com/news/square-enix-showcase-will-premiere-new-life-is-strange",
  "title": "Square Enix showcase will premiere new Life is Strange",
  "category": "gaming",
  "updated": "2021-03-12T10:27:18Z",
  "author": "vic-hood",
  "summary": "Plus a bunch of new trailers and announcements",
  "article": [
    "Square Enix has announced it's hosting a showcase next week, which will reveal the world premiere of the next Life is Strange plus new trailers and announcements on a plethora of its upcoming games.",
    "The first digital-direct Square Enix event will feature a 40-minute lineup of new trailers and announcements on titles such as Outriders, Marvel's Avengers, Just Cause Mobile and Balan Wonderworld. As well as information around the Tomb Raider 25th Anniversary and new mobile games Square Enix Montreal.",
    "But arguably the biggest reveal is that of a new Life is Strange game, which could either be a new mainline entry in the series, Life is Strange 3, or a spin-off in the vein of Life is Strange: Before the Storm or a bridge game like The Awesome Adventures of Captain Spirit. According to Square Enix this new Life is Strange game features an \"all-new protagonist wielding an exciting new power.\" So we're hoping it's a new mainline entry.",
    "Square Enix Presents \"Spring 2021\" is taking place on March 18 at 10am PDT / 5pm GMT / 12pm EDT (or March 19 at 4am AEDT). You can watch the showcase live on Twitch and YouTube.",
    "According to the publisher, Square Enix Presents will be a series of shows that reveal \"new games, updates and news directly to the global gaming community throughout the year.\"",
    "It's not particularly surprising to see Square Enix moving to host digital showcases throughout the year. Given we're still in a pandemic and annual conferences such as E3 aren't taking place physically, it's a great way for publishers to make announcements on their terms. Digital showcases are becoming more commonplace, with the likes of Sony's State of Play, Inside Xbox and Nintendo Direct becoming semi-regular occurrences throughout the year.",
    "Hopefully Square Enix will take the opportunity to announce some brand new titles in addition to Life is Strange."
  ],
  "headers": {
    "3": "How to watch"
  },
  "links": {
    "Outriders": "https://www.techradar.com/how-to/how-to-play-the-free-outriders-demo",
    "Marvel's Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "Balan Wonderworld": "https://www.techradar.com/reviews/balan-wonderworld",
    "Twitch": "https://www.twitch.tv/squareenix",
    "YouTube": "https://www.youtube.com/c/squareenixna"
  }
}