{
  "source": "https://www.techradar.com/news/bitcoin-thieves-used-coinbase-hype-as-a-smokescreen-to-shift-stolen-crypto",
  "title": "Bitcoin thieves used Coinbase hype as a smokescreen to shift stolen crypto",
  "category": "computing",
  "updated": "2021-04-16T09:18:57Z",
  "author": "mayank-sharma",
  "summary": "The stolen Bitcoin are closely tracked and blacklisted by most exchanges",
  "article": [
    "Update: Stuart Hoegner, General Counsel at Bitfinex, told us, “We continue to monitor the situation closely, along with global law enforcement agents. As and when we recover these funds, they will be allocated pursuant to our contractual commitments.”",
    "Over $600 million worth of stolen Bitcoin was surreptitiously transferred as the cryptocurrency community reveled in the recent listing of Coinbase on the Nasdaq exchange.",
    "The transferred Bitcoin were a small percentage of the 119,756 BTC stolen from Hong Kong-based cryptocurrency exchange Bitfinex back in 2016.",
    "\"We believe that the BTC transfers started during the trading for Coinbase's direct listing,\" Nick Mancini, research analyst at real-time crypto data service Trade the Chain, told CoinDesk.",
    "“The 2016 Bitfinex hack BTC are some of the most tracked & blacklisted funds in the world. No exchange will process them. They can basically never be cashed out,” tweeted Adam Cochran, a partner with Cinneamhain Venture.",
    "However, Mancini believes the rise of decentralized exchanges offer the thieves an opportunity to obfuscate the addresses of the stolen Bitcoin through mechanisms such as initial DEX offering (IDO) enough to transfer small amounts.",
    "He thinks the thieves saw an opportunity in Coinbase’ listing to offload some of their loot, which wouldn’t attract the same kind of scrutiny with everyone focused on the listing.",
    "In all, Trade The Chain estimates that the thieves moved about 10% of their 119,756 stolen BTC.",
    "In a historic move of sorts, Coinbase Global Inc. became the first cryptocurrency exchange to debut on Wall Street via a direct listing. In the runup to yesterday’s listing saw popular cryptocurrencies including Bitcoin and Ether extend the bull run and touch historic all-time highs.",
    "Via: CoinDesk"
  ],
  "headers": {
    "4": "Impossible trade"
  },
  "links": {
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "Coinbase": "https://www.techradar.com/reviews/coinbase-cryptocurrency-exchange",
    "cryptocurrency exchange": "https://www.techradar.com/best/mining-rigs",
    "touch historic all-time highs": "https://www.techradar.com/news/bitcoin-ether-surge-to-new-all-time-highs-ahead-of-coinbase-float",
    "CoinDesk": "https://www.coindesk.com/623m-in-bitcoin-from-2016-bitfinex-hack-moved-under-cover-of-coin-hype"
  }
}