{
  "source": "https://www.techradar.com/news/the-ipad-air-just-dropped-to-lowest-price-ever-for-prime-day",
  "title": "Lowest-ever price for iPad Air leads unexpectedly great Prime Day iPad deals",
  "category": "phones",
  "updated": "2021-06-22T12:39:19Z",
  "author": "hamish-hector",
  "summary": "The 11-inch iPad Pro gets a new discount as well",
  "article": [
    "We typically see some decent Prime Day deals on Apple devices, but this year's Apple Prime Day deals are legitimately impressive, with several lowest-price-ever discounts on recent releases like iPads, Apple Watches, and MacBooks.",
    "Out of those, this amazing deal on an iPad Air (2020) on Amazon US should get your immediate attention. You'll save $79 on the 64GB iPad Air with Wi-Fi ($519.99) or 64GB Cellular ($649.99), depending on whether you're more of a homebody or world traveler. Some color options are already selling out though, so act fast.",
    "What's impressive is, even on day 2 of Prime Day, Amazon is taking more money off, so you can get the brand-new 11-inch iPad Pro 2021 for even less - now $100 off, rather than the $50 of yesterday.",
    "We've also seen a few (admittedly smaller) price drops int the UK as well, so be ready to get your hands on a top-end iPad if you've been waiting for some time to upgrade.",
    "(Not in the US or UK? Scroll down for region-specific deals below).",
    "The Apple iPad Air (2020) doesn’t bring anything revolutionary to Apple’s tablet range, but a lot of the features that were previously exclusive to the iPad Pro range have trickled down to this far more affordable, and therefore more attractive, device.",
    "From the screen to the audio, to the processing and the camera, everything about the iPad Air (2020) is a cut above what came before and even in 2021, it's a fantastic tablet option – and that's why it's number four on our best tablets list.",
    "If you want the best iPad today and don't mind paying a premium price for it, the iPad Pro 2021 is undoubtedly an amazing piece of machinery, and a slight discount makes the price easier to bear.",
    "With its ultra-fast M1 chipset, attractive 2048 x 2732 Mini LED screen, and useful accessories like the Apple Pencil (although you have to pay a pretty big amount for the privilege), this is a legitimate tool for productivity and a great way to relax and stream.",
    "No matter where you live, you'll find all the lowest prices for the iPad Air 2020 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best US Prime Day iPad Deals",
    "9": "More Apple iPad deals",
    "10": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Apple Prime Day deals": "https://www.techradar.com/news/the-best-apple-prime-day-deals-weve-found-so-far",
    "amazing deal on an iPad Air (2020)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J66ZMY7%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2142253836582123300-20",
    "brand-new 11-inch iPad Pro 2021": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2F2021-Apple-11-inch-Wi-Fi-256GB%2Fdp%2FB09328WZPR%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1253435076367830000-20",
    "Apple iPad Air (2020)": "https://www.techradar.com/reviews/ipad-air-4-review",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "best tablets": "https://www.techradar.com/news/best-tablet",
    "best iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review"
  }
}