{
  "source": "https://www.techradar.com/news/xiaomi-confirms-us-ban-is-lifted",
  "title": "Xiaomi confirms US ban is lifted",
  "category": "phones",
  "updated": "2021-05-26T09:27:42Z",
  "author": "steve-mccaskill",
  "summary": "US firms are no longer banned from investing",
  "article": [
    "Xiaomi says it has formally been removed from the US government blacklist that prevented American firms from investing in the Chinese smartphone manufacturer.",
    "The company was one of several Chinese firms to be blacklisted in the final days of the Trump administration due to perceived links with the nation's military.",
    "Xiaomi denied these allegations and responded with a lawsuit that argued the status was “unlawful and unconstitutional.” A judge then temporarily blocked the enforcement of the ruling, stating the government process for issuing the ban was flawed.",
    "It was reported last month that the US Department of Defense (DoD) was set to overturn the ruling, with the two firms settling any outstanding litigation. This has now been confirmed by Xiaomi in a statement to the Hong Kong Stock Exchange.",
    "“The company is pleased to announce that on May 25, 2021 … the U.S. District Court for the District of Columbia issued a final order vacating the U.S. Department of Defense’s designation of the company as a [Communist Chinese Military Company],” said Lei Jun, Chairman of Xiaomi.",
    "“In vacating the designation, the court formally lifted all restrictions on U.S. persons’ ability to purchase or hold securities of the company.",
    "“The company is grateful for the trust and support of all its global users, partners, employees and shareholders. The company reiterates that it is an open, transparent, publicly traded, independently operated and managed corporation.”",
    "Although Xiaomi has a limited presence in the US, it is now the world’s third biggest smartphone manufacturer, with its affordable, feature-packed phones driving significant sales in China and beyond.",
    "This includes Western Europe, which has proved to be a tricky region for Chinese vendors to crack, except Huawei. Coincidentally, Xiaomi has been one of the main beneficiaries of Huawei’s own struggles with the US."
  ],
  "headers": {
    "3": "Xiaomi US ban"
  },
  "links": {
    "several Chinese firms": "https://www.techradar.com/news/xiaomi-becomes-latest-chinese-firm-added-to-us-blacklist",
    "blocked the enforcement": "https://www.techradar.com/news/xiaomi-us-ban-blocked-in-court-could-huawei-be-next"
  }
}