{
  "source": "https://www.techradar.com/news/put-off-by-the-samsung-galaxy-s21-price-xiaomis-new-cheap-phones-are-here",
  "title": "Put off by the Samsung Galaxy S21 price? Xiaomi's new cheap phones are here",
  "category": "phones",
  "updated": "2021-01-08T15:50:32Z",
  "author": "tom-bedford",
  "summary": "The Redmi 9T and Redmi Note 9T",
  "article": [
    "The first big phone launch of the year is likely to be January 14's Samsung Galaxy S21 range unveiling, but those top-end expensive phones likely won't be for everyone, so if you're looking for a more affordable handset with some impressive specs and features, Xiaomi might have what you need.",
    "Xiaomi's first phone launch of the year has brought us two new low-cost phones as part of its Redmi series - these are the Redmi 9T, and Redmi Note 9T. These are new additions to the Redmi 9 series that bring useful features to the budget phone market.",
    "The real selling point to the Redmi 9T is its huge 6,000mAh battery, the same size as the Moto G9 Power, and the Redmi Note 9T's highlight is its 5G connectivity, so this could end up being the most affordable 5G phone yet (though exact prices for most regions haven't been unveiled yet).",
    "We'll run you through the specs of the phones so you can get an idea of what they're like, before we test the things and bring you full reviews.",
    "The Xiaomi Redmi 9T's big feature - big literally - is its 6,000mAh battery, matching its aforementioned Moto rival and beating loads of other smartphone batteries. We anticipate that could keep the phone running for two days between charges.",
    "The phone's screen is a 6.53-inch FHD+ display broken up by a teardrop notch for the front-facing camera, and the lack of a visible fingerprint sensor on the phone implies the thing has an in-display one, but we're not totally sure.",
    "The Redmi 9T has four rear cameras: a 48MP main, 8MP ultra-wide, 2MP depth-sensing and 2MP macro snapper, and they're joined by an 8MP selfie snapper.",
    "In terms of internals, there's a Snapdragon 662 chipset, which is a fairly low-end processor. The phone's specs seem to tick all the boxes of the sort of low-end phone Redmi tends to put out, great for people who just need a useful and durable phone, but we'll need to test it fully to be sure.",
    "The Redmi 9T is set to start at 159 euros (around $195 / £145 / AU$250) with 4GB of RAM and 64GB of storage, or it will cost 189 euros (roughly $230 / £170 / AU$300) with 4GB/128GB.",
    "The Redmi 9T NFC - which adds NFC - meanwhile starts at 169 euros (approximately $210 / £150 / AU$265) with 4GB/64GB, rising to 199 euros (around $245 / £180 / AU$315) with 4GB/128GB. The standard model goes on sale from January 9, while the 9T NFC hits stores from early February.",
    "We've conducted an early review of this phone, and you can read it at our Xiaomi Redmi Note 9T hands-on review here.",
    "The Xiaomi Redmi Note 9T is the brand's first 5G phone (though not Xiaomi's first), so if you're looking for next-gen connectivity for a low price, it could be a good choice.",
    "The phone has the same screen as the Redmi 9T, but its front-facing camera is nestled in a cut-out to the top left, not a notch.",
    "The rear camera situation is the same here too except there's no ultra-wide snapper, and the front-facing camera is a little more high-res at 13MP.",
    "In terms of chipset, there's a MediaTek Dimensity 800U, which we haven't seen in many phones, so it's hard to judge just yet. It brings 5G connectivity to affordable phones, and it's fairly new. Finally, the phone has a 5,000mAh battery.",
    "This one is set to cost 229 euros (roughly $280 / £205 / AU$360) with 64GB of storage, and 269 euros (around $330 / £240 / AU$425) with 128GB, in both cases coming with 4GB of RAM.",
    "However, there's an early bird price of just 199 euros (roughly $245 / £180 / AU$315) for the 64GB model and 249 euros (approximately $305 / £225 / AU$390) for the 128GB one. The Redmi Note 9T is hitting stores from January 11."
  ],
  "headers": {
    "4": "Xiaomi Redmi 9T",
    "10": "Xiaomi Redmi Note 9T"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Redmi Note 9T": "https://www.techradar.com/reviews/xiaomi-redmi-note-9t-review",
    "Moto G9 Power": "https://www.techradar.com/reviews/moto-g9-power-review",
    "Xiaomi Redmi Note 9T hands-on review here": "https://www.techradar.com/reviews/xiaomi-redmi-note-9t-review"
  }
}