{
  "source": "https://www.techradar.com/news/so-it-turns-out-the-macbook-pros-m1-max-isnt-a-gaming-chip-does-it-matter",
  "title": "So it turns out the MacBook Pro's M1 Max isn't a gaming chip, does it matter?",
  "category": "computing",
  "updated": "2021-10-25T20:29:09Z",
  "author": "jackie-thomas",
  "summary": "Opinion: Apple hasn't cared about PC gaming in years, nothing has changed",
  "article": [
    "The M1 Max was announced, along with the new MacBook Pro computers, about a week ago. I was pretty impressed by it on paper, but now performance information is starting to appear, and it doesn't look like it's going to be putting the fire to Nvidia and AMD's feet in the way some were maybe hoping it would.",
    "Now that there are benchmarks floating around out there, we can start to get an idea of what the new high-power processors are capable of. And while there are probably some people that were looking at the M1 Max as Apple getting ready to get back into gaming laptops, we have some sour news for you – the M1 Max probably isn't going to topple the RTX 3080 any time soon.",
    "In Dave 2D's review, he compares the M1 Max and the M1 Pro to laptops configured with the RTX 3060, configured at 70W and a 100W version of the Nvidia GeForce RTX 3080. In those tests, the M1 Max is just barely faster than the 70W version of the RTX 3060. I've already seen Wccftech pick this story up suggesting that this means that the M1 Max is slower than a gaming laptop with a 100W RTX 3080, which would go against what Apple itself suggested when it announced these new processors, but that's only if you're looking at these laptops as, well, gaming laptops.",
    "When Apple was revealing the 14-inch MacBook Pro and the 16-inch MacBook Pro, the company didn't even really talk about gaming, instead pitching the laptops as media creation tools. And, when you consider that these laptops are much thicker and have pro-friendly ports like an SD Card reader and an HDMI port for the first time in half a decade, it makes sense.",
    "But when you start to look at how the new SoC performs in the workloads it's actually designed for, it's clear that the Apple M1 Max isn't as slow as the gaming benchmark earlier suggests.",
    "We haven't had a chance to review the 16-inch MacBook Pro yet, and the 14-inch model we reviewed only has an M1 Pro, rather than the beefed-up M1 Max, but even that model absolutely aced all of our benchmarks.",
    "We couldn't get the Puget Premiere benchmark to run on the M1 Pro, as it kept freezing, but the M1 Pro 14-inch MacBook Pro was nearly twice as fast as the Dell XPS 17 in Handbrake, and fell just short of Dell's high-end workstation in Photoshop.",
    "But while we don't have a review of the 16-inch MacBook Pro, there are publications that did test it, namely PCMag. Looking at its review of the 16-inch MacBook Pro, the M1 Max absolutely beats out the Alienware X17, which is equipped with a 165W RTX 3080, in creative benchmarks.",
    "In PCMag's Blender tests, the only laptop that was faster was the M1 Pro-equipped 14-inch MacBook Pro, and it falls just short of beating the fastest Windows laptops in Photoshop.",
    "And even in GFXBench, the M1 Max is way faster than anything else in the running. That test isn't super reliable for actual gaming performance, as it's a synthetic benchmark, but it does show that Apple's chip has some serious GPU power behind it.",
    "When it comes to gaming performance, one important thing to keep in mind is that the best PC games are updated all the time in order to keep the game optimized for new hardware. And, even when the game itself stops being updated to better its performance, GPU manufacturers are always tweaking their drivers to keep gamers happy.",
    "It is very unlikely that Apple is doing the latter thing, and putting in specific enhancements to its GPU drivers or the Metal API to boost performance in specific games, especially a game like Shadow of the Tomb Raider, which favors Nvidia hardware even on Windows 11.",
    "For decades, PC gaming has taken a backseat on macOS, and even now that Apple seems to be paying attention to gaming, it's only really in relation to Apple Arcade, which has a bunch of games that run on a wide range of hardware, from the iPhone 13 to the iMac mini. It's a completely different animal.",
    "Looking at the benchmarks I can find around the internet right now, it seems like Apple has fulfilled what it's promised the M1 Max to be – a chip that seriously boosts graphics performance in professional workloads.",
    "The fact that it can even hold a candle to a gaming laptop as powerful as the Alienware X17 in these workloads is just a testament to what Apple was able to do with this chip. And especially for creative professionals whose workload revolves around Apple's own software like Final Cut Pro, these new MacBooks seem like they're going to be the laptops to beat this year.",
    "I still want to get my hands on it so I can do some more in-depth testing. And as soon as I do, I'll make sure to see exactly where Apple has succeeded and where it perhaps falls short. But I expect more of the former and less of the latter if the reviews are any indication."
  ],
  "headers": {
    "3": "They're not gaming laptops",
    "10": "So why does it fall behind?"
  },
  "links": {
    "M1 Max": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "Nvidia and AMD's": "v",
    "processors": "https://www.techradar.com/news/best-processors",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Wccftech": "https://wccftech.com/m1-max-slower-than-laptop-rtx-3080-in-gaming-benchmarks/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Wccftechcom+%28WCCFtech.com%29",
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "PCMag": "https://www.pcmag.com/reviews/apple-macbook-pro-16-inch-2021-m1-max",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro"
  }
}