{
  "source": "https://www.techradar.com/news/nvidia-will-be-at-computex-but-dont-expect-an-rtx-3080-ti",
  "title": "Nvidia will be at Computex, but don't expect an RTX 3080 Ti",
  "category": "computing",
  "updated": "2021-05-20T20:04:54Z",
  "author": "bill-thomas",
  "summary": "An RTX 3080 Ti or RTX 3070 Ti at Computex?",
  "article": [
    "Nvidia has announced its Computex keynote, which will be happening on June 1, but we wouldn't expect gamers hold their breaths for a shiny new RTX 3080 Ti.",
    "Team Green has announced a few details about the upcoming keynote over on its blog. Nvidia vice president Jeff Fisher will be talking about graphics, but we're expecting more of a focus on addressing the stock shortage, rather than launching new graphics cards, and that's mostly because of what else is there.",
    "Namely, it seems like the keynote will be focused more on AI and data center computing, specifically on how Nvidia can \"democratize AI to put more AI capabilities within reach of more enterprises\".",
    "It is still possible that Nvidia will announce an RTX 3080 Ti, and there have been plenty of rumors that suggest that graphics card is coming soon, but we just don't see it sharing the spotlight with AI products. If anything, the RTX 3080 Ti and RTX 3070 Ti will likely have its own dedicated announcement showcase – and remember that E3 2021 is right around the corner, starting June 12.",
    "Either way, we won't know what Nvidia has in store for Computex 2021 until the event kicks off on June 1. And, you can be sure we'll be reporting on whatever team green has up its sleeve.",
    "Rumors about Nvidia following the GeForce RTX 3080 up with an RTX 3080 Ti have been everywhere since the RTX 3080 itself came out back in September 2020. Now don't get us wrong, there will very likely be an RTX 3080 Ti at some point, but we don't think it'd be at Computex.",
    "For at least the last five years, Nvidia has used Computex as a way to promote its AI and enterprise solutions primarily. And, yeah, there's going to be a gaming component this year – but that happens every year. At Computex 2019, Nvidia debuted Quake II with RTX, with the main focus of the show being on its Studio program. And, in 2018, Team Green used the gaming segment of its keynote to focus on expanding the Max-Q lineup of gaming laptops – no new silicon.",
    "There's also the problem of GPU availability. Nvidia wouldn't look too good if it announced a brand new graphics cards when so many people are struggling to get their hands on one. Especially because recent rumors keep pointing to the RTX 3080 Ti being a cut-down version of the RTX 3090's GA102 core.",
    "In normal times, a graphics card using a cut-down version of the RTX 3090 would make sense. Nvidia would be able to increase yield, but the RTX 3080 is already using a cut-down version of the GA102, and Nvidia can't keep that on store shelves either.",
    "None of that means that Nvidia can't defy expectations to announce a brand new graphics card, we're just saying that it would be highly irregular if it did."
  ],
  "headers": {
    "5": "Ok but hold on"
  },
  "links": {
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "over on its blog.": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-7485352471827211000&murl=https%3A%2F%2Fblogs.nvidia.com%2Fblog%2F2021%2F05%2F18%2Fcomputex-executive-keynote%2F",
    "Quake II with RTX": "https://www.youtube.com/watch?v=unGtBbhaPeU",
    "2018": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-3975519817103744500&murl=https%3A%2F%2Fblogs.nvidia.com%2Fblog%2F2018%2F06%2F04%2Fcomputex-2018%2F",
    "being a cut-down version of the RTX 3090": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-leaks-reveals-high-price-and-how-it-will-combat-cryptominers"
  }
}