{
  "source": "https://www.techradar.com/news/has-dell-just-announced-the-worlds-best-webcam",
  "title": "Has Dell just announced the world's best webcam?",
  "category": "computing",
  "updated": "2021-06-30T08:10:15Z",
  "author": "jess-weatherbed",
  "summary": "Somebody should check on Logitech",
  "article": [
    "Dell has announced the UltraSharp Webcam, a new 4K product that could bring DLSR-like quality to your broadcasts and presentations. Things got a little bit crazy this past year when it came to trying to buy a webcam thanks to the Covid-19 pandemic. The sudden rise in remote working and office closures made the best webcams almost impossible to find, and any stock that did appear was suddenly more expensive than it had been previously. The entire situation was a mess, but one positive to emerge from it was that more brands have now recognized the importance of offering ways to stay connected. Dell doesn't just want to enter the webcam market though, it wants to dominate it.",
    "Described as the 'worlds most intelligent 4K webcam', Dell mentioned during its early reveal that it's so confident in how well the UltraSharp Webcam will perform that it hopes we would love it enough to replace our current product of choice, no easy feat when it's going up against established giants like the Razer Kiyo Pro and the Logitech Brio 4K Pro.",
    "There are three choices for field of view (or FOV as it's often abbreviated), with 65, 78 and 90 degrees to choose from. At 4K you'll be getting 30fps, but if you prefer a smoother video you can reduce the quality down to the standard 1080p FHD and get up to 60fps, which could also make the Dell UltraSharp Webcam a great choice for streamers on platforms like Twitch and YouTube. You're also getting some fun features like AI Auto Framing to keep you as the central focus even when you're moving around the screen and a innovative magnetic connection to attach the camera to either of the provided mounts, which includes the typical monitor claw-style mount or a desktop tripod. All this certainly sounds fantastic, but for $200 (£188 / AU$379) it's likely more than most would be happy to spend on a webcam.",
    "If it's as good as Dell is claiming then it could certainly make it worth the investment over other products in the same price band such as the AVerMedia PW513. We'll know for sure when we can pit it against the current heavy hitters on the market, but it looks like the webcam market could be starting to get interesting and a little more varied."
  ],
  "headers": {
    "1": "Fancy and feature-packed"
  },
  "links": {
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "Razer Kiyo Pro": "https://www.techradar.com/reviews/razer-kiyo-pro",
    "Logitech Brio 4K Pro": "https://www.techradar.com/reviews/logitech-brio-ultra-hd-pro-business-webcam",
    "streamers on platforms like Twitch": "https://www.techradar.com/how-to/how-to-stream-on-twitch",
    "YouTube": "https://www.techradar.com/how-to/how-to-stream-on-youtube-from-live-events-to-streaming-your-favorite-games",
    "£188": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8979444010815430000/https://www.dell.com/en-uk/shop/dell-ultrasharp-webcam/apd/722-bbbi/pc-accessories",
    "AU$379": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1426556188222204200/https://deals.dell.com/en-au/productdetail/9i7z"
  }
}