{
  "source": "https://www.techradar.com/news/why-flash-gordon-seems-a-more-exciting-project-for-taika-waititi-than-star-wars",
  "title": "Why Flash Gordon seems a more exciting project for Taika Waititi than Star Wars",
  "category": "entertainment",
  "updated": "2021-11-27T14:00:50Z",
  "author": "richard-edwards",
  "summary": "Opinion: Mongo feels like the perfect destination for the Thor: Ragnarok director.",
  "article": [
    "Taika Waititi is turning his attentions to the stars. Once he’s got the upcoming Thor: Love and Thunder and sports comedy Next Goal Wins out the way, the in-demand writer, director and actor is lining up two high-profile adventures on the final frontier.",
    "Both are based on decades-old space opera franchises, populated by bizarre aliens, noble heroes and iconic villains. And yet one feels a much better fit for Waititi’s wonderfully offbeat sensibilities than the other.",
    "Waititi’s as-yet untitled trip to a galaxy far, far away is one of numerous new Star Wars movies in development at Lucasfilm and Disney, and he’s working on a script with Oscar-nominated screenwriter Krysty Wilson-Cairns (1917, Last Night in Soho). But he’s also eyeing up a new take on Flash Gordon, which – according to reports in Collider earlier this year – has morphed from an animated offering to a live-action project.",
    "If Waititi ever has to make a choice between the two, then, he should prioritize Flash Gordon over Star Wars every single time.",
    "Superficially, the prospect of Marvel veteran Waititi taking a short walk across the Disney lot to mess around in the Star Wars sandbox feels like a dream made real. After all, this is the director who transformed the fortunes of an Avenger whose second solo outing in Thor: The Dark World was widely heralded as the weakest entry in the Marvel Cinematic Universe – until Eternals came along, that is. Waititi reinvented the god of thunder as a comedy hero and, even if Thor: Ragnarok isn’t the best movie to come out of the MCU, it’s undeniably the funniest.",
    "Waititi is a filmmaker who’s proved he can mix blockbuster action with ensemble casts, memorable gags, and mild-mannered, scene-stealing revolutionaries made of stone. It’s what makes the idea of him let loose in a universe built on lightsabers, TIE Fighters and bounty hunters so ludicrously appealing.",
    "But – and this is a Death Star-sized but – it seems unlikely that Lucasfilm would provide Waititi the sort of creative freedom he’s been given by Marvel Studios.",
    "While it’s undeniable that Marvel has been known to sacrifice an individual movie or TV show to the gods of the MCU's overall story arc – Iron Man 2, Avengers: Age of Ultron and WandaVision are just three examples – numerous filmmakers have also been given the opportunity to push the envelope creatively. The broadness of the Marvel church is the reason the more comedic likes of Guardians of the Galaxy and Thor: Ragnarok can sit happily alongside more serious properties like Avengers: Endgame and Captain America: The Winter Soldier.",
    "Star Wars, on the other hand, is much more uniform in tone. While the quality of the scripts and humor haven’t always been consistent (and some outings are darker than others), the nine episodes of the Skywalker Saga, Rogue One, Solo: A Star Wars Story, The Mandalorian, and even animated shows The Clone Wars and Rebels have rarely experimented with new genres in the quite the same way as the MCU. Indeed, Rian Johnson's efforts to play around with the Star Wars formula in The Last Jedi proved incredibly divisive among the fanbase.",
    "Since then – and the comparative disappointments of Solo: A Star Wars Story and The Rise of Skywalker – it feels like there's been a change of direction at Lucasfilm. These days, Disney Plus TV shows like The Mandalorian and upcoming spin-off The Book of Boba Fett appear to be the priority, with the creative team of showrunner Jon Favreau and Lucasfilm's executive creative officer Dave Filoni (a man who has Star Wars in his blood, after working on The Clone Wars and Rebels) making many of the big editorial decisions.",
    "There's no doubt they've done a brilliant job bringing balance to the Force, with The Mandalorian hitting on the perfect formula to appeal to long-term Star Wars fans and newcomers alike. But now Lucasfilm has identified an approach that works, how much freedom will there be for others to push the Star Wars envelope? With Alita: Battle Angel and Sin City director Robert Rodriguez joining the creative team for The Book of Boba Fett, it'll be intriguing to see how much of his trademark style is visible in the new show.",
    "Of course, Waititi has some experience negotiating the challenges and compromises of franchise filmmaking – he's even directed an episode of The Mandalorian. But how comfortable would he be comfortable singing from someone else’s hymn sheet? And what would be the benefit to Lucasfilm of bringing in Waititi as a gun for hire, only to stifle what makes him special?",
    "Even Waititi seems to acknowledge the potential for a mismatch, joking back in 2017 – before he was officially linked to Star Wars – that he’d be “fired within a week” if he ever got the gig. After his involvement was confirmed, he put a tongue-in-cheek post on Instagram that “as a long-time fan of Star Wars, I’m so angry about what I’m going to do to ruin it”.",
    "Flash Gordon is a very different proposition. While nearly twice as old as Star Wars – George Lucas made A New Hope as his take on ’30s adventure serials after failing to bag the rights to Flash – Alex Raymond’s comic-book characters carry significantly less baggage. Where Star Wars has a 44-year-old canon that must not be violated in the eyes of some, Flash Gordon’s is comparatively open to interpretation.",
    "Even the most famous adaptation of the comics, the 1980 movie, can’t be regarded as the definitive version because it’s a bizarre one-off, as memorable for its Queen soundtrack and larger-than-life performances as its storytelling. Sure, it’s got plenty of passionate fans, but the movie was never a blockbuster hit, meaning there are fewer people clinging on to what they think a Flash Gordon film should be.",
    "If Waititi blasts off for Mongo, he gets to put his own stamp on a galaxy of Hawkmen, rocket ships, and a sportsman turned savior of the universe, the way Ronald D Moore did with his brilliant Battlestar Galactica reboot. In fact, the further Waititi can get from the Mike Hodges movie, the better. And that's regardless of whether it’s by escaping the crude racial stereotyping of the Ming the Merciless character, or simply accepting that nobody playing Prince Vultan will ever shout “Gordon’s alive!” quite like Brian Blessed.",
    "Like fellow ’30s sci-fi survivor Buck Rogers – who also has a couple of movie projects in development – Flash Gordon should be a Hollywood studio’s dream come true: a recognisable property with a vast repository of characters and mythology, that modern viewers don't know all that much about. It’s a franchise that can be reinvented in a new filmmaker’s image – and with no continuity as such to worry about, connective tissue needn’t stretch beyond a few fan-pleasing cameos.",
    "There are few blockbuster directors who have more potential to do something special with Flash Gordon than Taika Waititi. So why constrain such a wonderful, unique talent to the known worlds of Star Wars when he could be building a universe of his own – even if he shoots for the stars and misses, it can’t possibly be as bad as the short-lived 2007-2008 Flash Gordon show on Syfy..."
  ],
  "headers": {
    "6": "A gun for hire?",
    "13": "Gordon's alive!"
  },
  "links": {
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "new Star Wars movies": "https://www.techradar.com/news/new-star-wars-movies-and-tv-shows",
    "Collider": "https://collider.com/taika-waititi-flash-gordon-movie-live-action-new-details/",
    "WandaVision": "https://www.techradar.com/news/wandavision-season-2-what-we-know-after-the-finale",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "fired within a week": "https://uk.style.yahoo.com/taika-waititi-once-said-hed-be-fired-from-a-star-wars-movie-in-a-week-104157332.html",
    "Instagram": "https://www.instagram.com/p/CIpljtuj5ae/"
  }
}