{
  "source": "https://www.techradar.com/news/facebook-really-really-wants-ios-145-users-to-enable-app-tracking",
  "title": "Facebook really, really wants iOS 14.5 users to enable app tracking",
  "category": "computing",
  "updated": "2021-05-03T03:02:15Z",
  "author": "jasmine-gearie",
  "summary": "Starts displaying 'keep Facebook free' warning message on apps",
  "article": [
    "If you’ve recently downloaded Apple’s iOS 14.5 update, you’ve probably already seen the prompts asking you to opt in or out of app tracking. In particular, you need to provide consent for whether information collected about you from one app or website can be shared with another.",
    "The update is called app tracking transparency, and Facebook isn’t too happy about it. In response to Apple’s update, the social media giant is now showing a prompt of its own – or what it calls an ‘educational screen’ in a blog post – before iOS 14.5 users make their decision about app tracking.",
    "Facebook shared an image of the prompt, and the notice reads that the benefits of sharing your activity from other apps and websites allows Facebook to: “Show you ads that are more personalized, help keep Facebook free of charge [and] support businesses that rely on ads to reach their customers.”",
    "The image also shows an almost identical prompt will appear on Instagram, which is owned by Facebook.",
    "Facebook’s second point about keeping its platform free of charge is in opposition to the company’s previous slogan of “It’s free and always will be” – a line that once appeared on its login page, but was removed in August 2019, as Business Insider has noted.",
    "Apple’s app tracking transparency is designed to make it easy for you to prevent apps from collecting and sharing your iPhone activity across every app you use. It requires app developers to get explicit permission from iPhone users before personal data can be collected and shared among apps.",
    "Other data collected directly in-app, however, can still be used to show you ads or sell on to advertisers, even if you've enabled app tracking transparency. If app makers (including Apple) try to find a way around the new privacy policy by offering users incentives to keep app tracking enabled, the apps will be banned.",
    "It could arguably affect the revenue app developers make, and it’s the core of Facebook’s argument with Apple. The social media giant argues that even though some ads will be displayed when app tracking transparency is turned on, they'll be less personalized, which would ultimately harm small businesses who advertise on Facebook.",
    "It’s not surprising that Facebook is taking such a strong stance – the company depends on user data it collects. But if you are privacy conscious, we have a full explainer on how to use the new features in iOS 14.5."
  ],
  "headers": {
    "5": "App tracking: what it means for you"
  },
  "links": {
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "app tracking transparency": "https://www.techradar.com/news/what-is-app-tracking-transparency-on-iphone-ios-145s-big-update-explained",
    "blog post": "https://about.fb.com/news/2020/12/speaking-up-for-small-businesses/",
    "Business Insider": "https://www.businessinsider.com/facebook-changes-free-and-always-will-be-slogan-on-homepage-2019-8?r=AU&IR=T",
    "apps will be banned": "https://www.techradar.com/news/apple-bans-apps-offering-you-rewards-for-switching-off-ios-145s-app-tracking",
    "how to use the new features in iOS 14.5": "https://www.techradar.com/how-to/iphone-app-tracking-transparency-how-to-use-the-new-features-in-ios-145"
  }
}