{
  "source": "https://www.techradar.com/news/google-chrome-will-soon-load-pages-faster-on-windows-linux-and-macos",
  "title": "Google Chrome will soon load pages faster on Windows, Linux and macOS",
  "category": "computing",
  "updated": "2021-05-15T10:01:48Z",
  "author": "sead-fadilpasic",
  "summary": "Plans to introduce 'back-forward cache' to Chrome desktop clients are under way",
  "article": [
    "Google is working on an update for its web browser Chrome that will improve the speeds of clients for Windows, Linux and macOS.",
    "As reported by Windows Latest, Google is planning to introduce support for “back-forward cache” on desktop platforms with Google Chrome 92. The feature, which has long be available on Android, enables instantaneous page loading when users click the “back” or “forward” buttons.",
    "According to the publication, Google has been testing the feature for almost two years now.",
    "“Back-forward cache is a browser feature which improves the user experience by keeping a page alive after the user navigates away from it and reuses it for session history navigation (browser back/forward buttons, history.back() etc.) to make the navigation instant. The pages in the cache are frozen and do not run any JavaScript,” Google explained.",
    "While a precise release date has not yet been determined, it's thought Google Chrome 92 should arrive within the next few months.",
    "As opposed to using the “Origin Trial” method to test the new service, Google will introduce it gradually. This means that some users will probably get the feature sooner than others. Those that can’t wait, however, can enable it manually through Chrome’s flags menu.",
    "“We already shipped this feature for Android. We want to start experimenting with back-forward cache on desktop environments,” Google said.",
    "Similar features have been supported in both Firefox and Safari for many years, across both desktop and mobile platforms, the company explained in its detailed breakdown.",
    "Via Windows Latest"
  ],
  "headers": {
    "4": "Gradual introduction"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "JavaScript": "https://www.techradar.com/best/best-online-courses-to-learn-javascript",
    "detailed breakdown": "https://web.dev/bfcache/",
    "Windows Latest": "https://www.windowslatest.com/2021/05/13/google-chrome-load-pages-faster-on-desktop-using-back-forward-cache/"
  }
}