{
  "source": "https://www.techradar.com/news/your-first-look-inside-the-mercedes-eqs-electric-car-with-mammoth-hyperscreen",
  "title": "First look inside Mercedes EQS with mammoth Hyperscreen",
  "category": "car-tech",
  "updated": "2021-04-16T06:44:28Z",
  "author": "john-mccann",
  "summary": "You can also choose the sounds this electric car makes",
  "article": [
    "More information on the premium Mercedes EQS electric car has been announced by the German manufacturer, and the latest reveal gives us a good look at the technology inside the car as well as doubling-down on its impressive range stats.",
    "The all-electric EQS saloon will be the first car from the brand to carry the option of having the mammoth, curved Mercedes Hyperscreen installed when it rolls off production lines latest this year (price TBC - but it'll likely be expensive).",
    "First announced at the start of the year during virtual CES 2021, the huge 56-inch Hyperscreen spans the entire width of the EQS and incorporates two turbine-inspired air vents as well as three separate displays.",
    "To quickly refresh your memory on what the Hyperscreen offers, there's a central 17.7-inch main display, 12.3-inch passenger display and a 12.3-inch instrument cluster display.",
    "The system runs Mercedes' MBUX interface and all this is powered by an eight-core CPU with 24GB of RAM. Mercedes says it's the most intelligent screen it's ever put in a car, and it also comes with support for Apple CarPlay and Android Auto.",
    "You can see what the Hyperscreen looks like inside the new Mercedes EQS in the images below.",
    "Mercedes has also developed a trio of different sound worlds for the EQS. With electric cars being far quieter than their combustion engine counterparts, manufacturers are looking at novel ways to offer audible feedback to drivers.",
    "The answer Mercedes has come up with are three different sound worlds; Silver Waves (which is plain, pure and simple, according to Merc), Vivid Flux (apparently targeted at techies) and Roaring Pulse (for those who have strong associations with powerful machines).",
    "These sounds are played through 15 speakers located throughout the cabin to create a 3D world and they respond to the driving mode your in and the current situation. If you're driving in Comfort mode at low speeds around the city the sounds will be minimal, however switch to Sport mode and put your foot down and things become much more audible.",
    "There's no toggle for the volume of these sounds worlds, so you'll have to make do with the dynamic volume the EQS decides on - but the good news for those who may be put off by all this is you can turn the sound worlds off completely if you prefer silence.",
    "The Mercedes EQS will gain more sound experiences in the future, with the firm confirming it'll be adding more in over-the-air updates down the line.",
    "Mercedes has also provided us with more information on the specs of the EQS. It said earlier in the year the EQS would be able to offer a 700km range (around 430 miles) from a single charge, but that has now been increased to 770km (around 480 miles) for particular configurations. This would give the EQS far greater than than most other electric cars currently available.",
    "Part of the reason the EQS can achieve such standout range is the fact it holds a world record for aerodynamics, as the first car production car in the world with a Cd value starting from 0.20.",
    "The EQS will be available as rear-wheel and all-wheel drive options, battery sizes will be 90 kWh and 107.8 kWh with support for 200kW fast charging (300km / 180 miles in 15 minutes) and its speed will be limited to 210km/h (130 mph).",
    "How well these sounds will fit with the driving experience remains to be seen. We'll be putting the Mercedes EQS through its paces later this year to bring you our official verdict on the sounds, Hyperscreen and everything else the electric car has to offer."
  ],
  "headers": {
    "6": "A sound selection",
    "11": "Record-breaking aerodynamics"
  },
  "links": {
    "Mercedes EQS": "https://www.techradar.com/news/mercedes-eqs",
    "First announced": "https://www.techradar.com/news/mercedes-giant-ai-enabled-hyperscreen-has-three-high-end-oled-displays",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights"
  }
}