{
  "source": "https://www.techradar.com/news/dells-labor-day-gaming-laptop-deals-feature-dollar380-off-this-rtx3050-machine",
  "title": "Dell's Labor Day gaming laptop deals feature $380 off this RTX3050 machine",
  "category": "computing",
  "updated": "2021-09-06T16:56:22Z",
  "author": "james-pickard",
  "summary": "Save almost a third on a gaming laptop with RTX 3050 graphics card",
  "article": [
    "Finding an affordable portable rig that's capable of running all the games you might want to play while on the move is not an easy task. Thankfully, we might've solved it. Check out Dell's headline Labor Day gaming laptop deal and you could save almost $400 on the perfect machine to hot drop away from the desktop.",
    "Right now, there's a limited-time deal on the Dell G15 Gaming Laptop for $799.99. That's almost one-third off the normal price and less than half you might need to pay to get a more powerful machine in the Dell Labor Day sales. If you aren't fussed about hitting those top-end graphics options, then this is a sensible buy. Especially with free delivery included.",
    "It's an excellent deal on a full HD machine with a recent RTX 3050 graphics card. Know, though, that this is definitely more towards the budget option in the world of gaming laptops. For games like Fortnite, Among Us and Minecraft this will do just fine but as you start to get to Call of Duty and beyond it may begin to struggle on the higher settings.",
    "If you think you're going to need a gaming laptop with a bit more heft behind it then do check out all the other Labor Day laptop deals you can buy today – and everything else that's reduced in the Labor Day sales.",
    "Dell has stated that this Labor Day gaming laptop deal will only be available for a limited time. Ensure you pick it up before stock runs out or in case the offer is pulled before the end of the day.",
    "If you do miss out, these are some of the other gaming laptop deals available to buy right now.",
    "Looking for more top tech? We're also tracking all the best Labor Day TV sales you can find today. Or all the Labor Day computer deals featuring desktops and laptops across a range of needs and prices."
  ],
  "headers": {
    "4": "Labor Day gaming laptop deal: Dell G15",
    "6": "More of today's best gaming laptop deals"
  },
  "links": {
    "Dell G15 Gaming Laptop for $799.99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8142322634801559000/https://deals.dell.com/en-us/member/productdetail/a7zx",
    "Dell Labor Day sales": "https://www.techradar.com/news/dell-labor-day-sale-is-live-laptop-deals-on-the-xps-13-inspiron-and-alienware",
    "Labor Day laptop deals": "https://www.techradar.com/news/the-10-best-labor-day-laptop-sales-2020",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020",
    "Labor Day TV sales": "https://www.techradar.com/news/labor-day-tv-sales-deals-wont-last-much-longer",
    "Labor Day computer deals": "https://www.techradar.com/news/the-very-best-labor-day-computer-deals-available-right-now"
  }
}