{
  "source": "https://www.techradar.com/news/teslas-new-in-car-gaming-system-is-basically-a-mini-ps5",
  "title": "Tesla’s new in-car gaming system is basically a mini PS5",
  "category": "car-tech",
  "updated": "2021-06-01T11:30:41Z",
  "author": "axel-metz",
  "summary": "Did Tesla just enter the console war?",
  "article": [
    "Elon Musk has always been one for bold claims, but maybe the ability to play AAA games in Tesla vehicles wasn’t merely a pipe dream, after all.",
    "At AMD’s Computex 2021 keynote, the chipmaker confirmed that the latest generation of Tesla’s infotainment system – arriving in both the new Tesla Model S and X – is powered by an AMD Ryzen processor and AMD RDNA 2 GPU.",
    "Those internals suggest Musk’s in-car gaming rig is capable of providing up to 10 teraflops of computing power – which isn’t far off the figure boasted by Sony’s PS5.",
    "AMD CEO Lisa Su confirmed the new Tesla models “will have an AMD Ryzen APU powering the infotainment system [...] as well as a discrete RDNA 2-based GPU that kicks in when running AAA games,” adding that the company “look[s] forward to giving gamers a great platform for AAA gaming.”",
    "We’ve previously reported on leaked documents (posted by leaker Patrick Shur) which suggested Tesla planned to use an AMD Navi 23 GPU to power its infotainment systems. That speculation now seems to have been corroborated by the appearance of the same GPU at AMD’s recent keynote, revealed to be powering the company’s newest 6600M laptop graphics cards.",
    "Now, we’re not suggesting Tesla’s in-car gaming system will match the PS5 for performance, but both use largely the same technology under the hood, save for a smaller number of cores in the Tesla system (28 to the PS5’s 36).",
    "The AMD Navi 23 GPU in the former also boasts 1792 shader units (processors within the graphics card responsible for processing different aspects of an image) to the PS5’s 2304 – so we’re talking small margins here. For comparison, the PS4 came equipped with 1152 equivalent units.",
    "We do, therefore, expect new Tesla owners to be able to play power-hungry games like Cyberpunk 2077 and Assassin’s Creed Valhalla from the comfort of their heated car seats.",
    "Could these games also be playable with ray tracing enabled? We know AMD’s latest GPUs are capable of the rendering method, and this would mark an immense graphical leap from the Intel-powered indie titles currently limited to the Tesla Arcade games library.",
    "The news isn’t all exciting for prospective Tesla owners-cum-car-gamers, though.",
    "A Tesla employee recently shared a job posting on Twitter suggesting the company is “looking for Linux game developers” to work on software for the company’s latest hardware, which is a pretty conclusive sign that Tesla’s new in-car gaming rig may run games built for Linux.",
    "So, while 10 teraflops of performance is a mightily impressive figure for what is essentially a games console for a car, less-than-impressive Linux ports on Google Stadia have ensured our expectations are tempered when it comes to the framerate and graphical fidelity we anticipate from AAA titles running in a Tesla vehicle.",
    "In any case, with the Tesla Model S Plaid set to start deliveries on June 10, we’ll have a better idea of what the system is capable of very soon.",
    "Via The Verge"
  ],
  "headers": {
    "9": "Temper expectations"
  },
  "links": {
    "Computex 2021": "https://www.techradar.com/news/computex-2021",
    "AMD RDNA 2": "https://www.techradar.com/news/amd-big-navi",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "leaked documents": "https://www.techradar.com/news/leaked-documents-tease-amd-big-navi-gpus-are-coming-to-tesla",
    "Patrick Shur": "https://twitter.com/patrickschur_/status/1354854817697566723?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1354854817697566723%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.theverge.com%2F2021%2F6%2F1%2F22462660%2Famd-tesla-model-x-s-plaid-ryzen-radeon-rdna-2",
    "Navi 23": "https://www.techradar.com/news/amd-navi-23-could-be-an-nvidia-killer-graphics-card-that-launches-in-2020",
    "6600M laptop graphics cards": "https://www.techradar.com/news/amd-radeon-rx-6000-mobile-gpus-are-here-to-take-on-nvidia",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Assassin’s Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "job posting": "https://twitter.com/ATTlKA/status/1397258716076937216?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1397258716076937216%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.theverge.com%2F2021%2F6%2F1%2F22462660%2Famd-tesla-model-x-s-plaid-ryzen-radeon-rdna-2",
    "The Verge": "https://www.theverge.com/2021/6/1/22462660/amd-tesla-model-x-s-plaid-ryzen-radeon-rdna-2"
  }
}