{
  "source": "https://www.techradar.com/news/new-ipad-pro-ipad-mini-design-leaked",
  "title": "New iPad Pro, iPad Mini design leaked",
  "category": "tablets",
  "updated": "2021-04-09T16:21:37Z",
  "author": "tom-bedford",
  "summary": "More like iPad No changes",
  "article": [
    "The next two tablets we expect Apple to put out are the new iPad Pro and the iPad Mini 6, its super-sized and super-mini slates respectively, and a leak has given us a possible look at the design of both devices.",
    "Apple fan and occasional leaker Sonny Dickson has shared photos of dummy units for the new tablets - including two Pro units of different sizes, suggesting there will once again be an 11-inch and 12.9-inch model - showing both the front and back of these slates.",
    "Dummy units aren't working versions of the tablets, just models which show how they look (which can be useful for lots of people including case makers and marketers), but if these truly are dummy versions of the slates (and not fakes), they give us a limited glimpse at the anticipated tablets.",
    "A list of changes for these new iPads would be pretty short, because there don't seem to be many changes from the iPad Pro 2020 and iPad Mini 2019.",
    "On the iPad Pros, it looks like the LIDAR scanner has been dropped, in favor of another camera lens, though we can't tell what. The smart connector pins are also a different color - and those are basically the only changes we see on either side of the tablet.",
    "The iPad Mini 6 seems to have a slightly bigger change - or should that be smaller? - as the bezel on the front looks a little smaller. Everything else - the front home button, the single rear camera, the front-facing selfie camera, looks identical.",
    "Hopefully with these new tablets there will at least be big changes internally, regarding things we can't see in these pictures. We're hoping to see both slates at WWDC 2021 in early June, if not before."
  ],
  "headers": {
    "3": "New iPad design changes"
  },
  "links": {
    "new iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPad Mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "Sonny Dickson": "https://twitter.com/SonnyDickson/status/1379998608288706572",
    "iPad Pro 2020": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "iPad Mini 2019": "https://www.techradar.com/reviews/ipad-mini-2019",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog"
  }
}