{
  "source": "https://www.techradar.com/news/apple-finally-patches-this-dangerous-macos-security-flaw",
  "title": "Apple finally patches this dangerous macOS security flaw",
  "category": "computing",
  "updated": "2021-02-10T15:30:55Z",
  "author": "barclay-ballard",
  "summary": "Mac users are safe once more",
  "article": [
    "Apple has patched the critical vulnerability affecting the Sudo application on macOS devices. Although an update had already been released for the other affected operating systems, the macOS version of the security bug remained exploitable until now.",
    "The sudo app is used by administrators to grant root access to other users. However, earlier this month, it was discovered that it was vulnerable to a privilege escalation attack that would allow a low-privilege user to gain root-level access either by injecting malware or carrying out a brute force attack.",
    "Initially, it was believed that this sudo vulnerability only affected Linux and BSD operating systems but researcher Matthew Hickey then discovered that the bug, tracked as CVE-2021-3156, could be exploited on mac devices as well with just a few minor tweaks.",
    "However, it hasn’t taken long for Apple to patch the Sudo macOS application. A security update for macOS Big Sur 11.2, macOS Catalina 10.15.7, and macOS Mojave 10.14.6 is now available and should be applied as a priority.",
    "Individuals with devices running the sudo app that want to check whether they are at risk from the CVE-2021-3156 vulnerability, whether they are running Linux, macOS, or BSD operating systems, can run the command “sudoedit -s /”. If the system remains vulnerable, it will respond with an error message starting with “sudoedit:” while a patched system will respond with an error that starts with “usage:”.",
    "In addition to patching the sudo vulnerability, fans of Apple antivirus news will be pleased to hear that the new security update also fixes two arbitrary code execution flaws affecting Intel graphics drivers.",
    "Via Bleeping Computer"
  ],
  "headers": {
    "3": "Priority patches"
  },
  "links": {
    "Sudo": "https://www.techradar.com/news/decade-old-vulnerability-discovered-to-still-affect-most-linux-distros",
    "macOS version": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "CVE-2021-3156": "https://www.techradar.com/news/sudo-bug-also-found-to-affect-macos",
    "macOS application": "https://www.techradar.com/how-to/the-best-mac-apps-for-working-from-home",
    "Apple antivirus": "https://www.techradar.com/best/best-mac-antivirus-software",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/apple/apple-fixes-sudo-root-privilege-escalation-flaw-in-macos/"
  }
}