{
  "source": "https://www.techradar.com/news/an-seo-audit-can-vastly-improve-your-websites-effectiveness-heres-how",
  "title": "An SEO audit can vastly improve your website’s effectiveness - here’s how",
  "category": "computing",
  "updated": "2021-07-09T13:59:07Z",
  "author": "eli-schwartz",
  "summary": "Do SEO audits the right way",
  "article": [
    "I was talking to an entrepreneur friend about accelerating the SEO performance on his site. I suggested what I felt was a basic piece of advice: Get an SEO site audit to understand what is presently working and where there might be upside.",
    "He immediately rejected that idea, saying, “We already have an SEO software tool, so we’re good.”",
    "I was taken aback. The fact that he didn’t get the distinction between a tool and an audit made me realize a lot of people probably are equally unaware.",
    "An audit can be the best thing to happen to your SEO strategy.",
    "Let’s take a look at the difference between a software tool and an audit, why humans are the best auditors, and what an audit looks for.",
    "An audit is a careful look at your entire SEO effort from an experienced practitioner. Software tools aren’t people. My point is that while tools like Moz, Ahrefs, SEMrush, Conductor, Clarity, and Searchmetrics, are all great for seeing progress, they don’t have the human intellect necessary to clarify the why or why not behind the metrics.",
    "A better way of understanding this is to use a health analogy. Basic wearable devices like Fitbits are great to help you keep on top of common health stats like activity, heart rate, and sleep. However, the numbers are no substitute for a full physical checkup by a medical professional. Your heart rate device will not find an artery blockage.",
    "Similarly, a daily SEO stat tracker like the tools above report well on activity metrics, but they will not catch an impending sitewide SEO “heart attack.” Creeping URL changes or misconfigured canonical links could blow up suddenly, and neither will be caught by software.",
    "When a website is experiencing an organic issue, it’s time to have an experienced professional have a look at the site and conduct an audit to find out what’s ailing it.",
    "Once you decide to implement a site audit, what can you expect to find? Each audit will ultimately diverge as the auditor follows the site’s architecture. However, every audit will include at least a look at these high-level areas.",
    "Penalty analysis: Are there any unexplained drop offs in metrics that align with either Google manual actions or known algorithmic updates?",
    "URL structure: Do URLs have a nice, clean structure to make it clear to both users and search engines what is contained on each page?",
    "Duplicate content and canonical usage: Duplicate-content issues cause Google to have to make a decision about which URL to index. This may not be the desired URL, so canonicals can help declare the preferred URL. Improper usage of canonicals can be detrimental to the site.",
    "Internal links: Are internal links in working order for proper crawling and indexation? (In many respects, internal links can be more important than external links, so this step is critical.)",
    "Backlinks: Which sites link to our site, and are they helping or hurting us? For a big site, understanding the mix of backlinks can be an audit unto itself.",
    "Indexation: Is the site properly indexed in search? What is holding it back? In my opinion, this is the most important part of any audit.",
    "Script usage: Which scripts are being used, and what are the implications? Despite Google’s proclamations to the contrary, using JavaScript is simply not as effective for SEO as HTML. Uncovering JavaScript that drives important parts of the site can lead to new opportunities for growth if re-coded in a more crawler-friendly fashion.",
    "Keyword usage: What keywords are being used, and what gaps exist? Keywords are the bulwark of any SEO campaign, and mapping them can often lead to opportunities.",
    "On-Page SEO: What title tags (titles, descriptions, H1, H2, etc.) are being used? Good title tags are the basis of any effort, and it is always surprising to me how many opportunities can be uncovered by spending time on their usage.",
    "Content quality: What content is being used, and of what quality? SEO is driven by content, but poor content can actually be harmful. An outsider’s view can assess the quality accurately.",
    "Robots.txt: How effective are the directions to search engines on what pages of the site can be crawled? Overdoing it will lead to important pages without traffic, while under-doing it will lead to useless pages being crawled.",
    "Sitemaps: How effective are the current XML and HTML sitemaps? They’re both helpful and necessary for page discovery, and this analysis will point out opportunities to improve the current setup.",
    "Site speed: How fast do pages and the site load? Page and site speeds are factored into the Google algorithm for very slow sites, but even if there’s no algorithmic issue, very slow loads lead to a poor user experience and poor conversions.",
    "Spam: Is there any? Even the most authoritative and secure websites have had issues with spam. While this likely will not lead to a search-performance issue, it is certainly not a good user experience.",
    "Schema markup: Where are the current markup and the available markup to help us find new opportunities for growth? In a world of voice assistants, schema markup is increasingly more important, as it helps search engines understand context.",
    "Mobile versus desktop: How will mobile search experiences interact with the site? Mobile devices often approach search in fundamentally different ways, so there should be no surprise that mobile SEO can be different too.",
    "International: How do all the areas above function in different countries?",
    "The most important takeaway from any SEO audit is the, “So what?”. I’ve seen audits run on for over 100 pages but are light on action items. Creating a useless book doesn’t do the creator or the recipient any good.",
    "To this end, the audit should be done by someone who can uncover the action items. The best scenario is an employee, as the audit will guide them in their understanding of the website as they do their job.",
    "It’s never fun to see where your SEO strategies are failing, but because digital marketing is by nature such a rapidly changing industry, audits by real people (not tools) are crucial as you labor towards more effective strategies."
  ],
  "headers": {
    "5": "Difference: tool vs audit",
    "9": "What will an audit look for?",
    "27": "An audit will be your BFF"
  },
  "links": {
    "Get an SEO site audit": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB091D572ZL%3Fgeniuslink%3Dtrue%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-5078738613357565000-21",
    "SEO software tool": "https://www.techradar.com/news/best-seo-tool"
  }
}