{
  "source": "https://www.techradar.com/news/mercedes-reveals-mightily-impressive-eqe-specs-ahead-of-global-launch",
  "title": "Mercedes reveals mightily impressive EQE specs ahead of the EV's global launch",
  "category": "car-tech",
  "updated": "2021-09-05T16:30:23Z",
  "author": "axel-metz",
  "summary": "Mercedes' EQE is as tech-heavy as you'd expect",
  "article": [
    "Ahead of the 2021 IAA Mobility conference on September 7, Mercedes has revealed some of the specs and tech drivers can expect from its upcoming EQE electric sedan.",
    "The fully electric car is the second model to be based on the automaker's new premium-class electric architecture, following the launch of the super-luxury Mercedes EQS back in April, and while it bears several similarities to its larger sibling, the EQE will arrive as a much different electric offering.",
    "For starters, its interior and exterior dimensions make the EQE a more athletic-looking car. It's more compact than the EQS, with a wheelbase that’s 90mm shorter and a body more comparable to the existing CLS line.",
    "Like the latter, the EQE has no tailgate but a fixed rear window and a boot lid, which Mercedes says allows it to boast interior space that exceeds even the current E-Class.",
    "The EQE will also sport a 90 kWh battery, giving the car up to 660km (around 410 miles) of range.",
    "That's shy of the EQS' equivalent 780km figure, though still a mightily impressive drivable range considering the lesser numbers offered by comparable EVs like the Audi e-tron GT (475km / 295 miles) or BMW i4 (590km / 365 miles).",
    "Like the EQS, the EQE will offer drivers the possibility of activating completely new vehicle functions via over-the-air updates (OTA) in many areas, too.",
    "At launch, the brand says features like the 'Roaring Pulse' sound experience, different digital light modes and mini-games will be available to download.",
    "Though not totally clear at this stage, we also presume this OTA compatibility may grant the EQE further range updates in the future, in a similar fashion to the new Volvo C40 Recharge.",
    "It's the EQE's interior bells and whistles, though, that bear the most similarity to the EQS – which is a great thing, given our experience driving the latter.",
    "Like its luxury sibling, the EQE sports the optional extra of the brand's market-leading MBUX Hyperscreen, which combines three curved displays under one, dashboard-encompassing glass cover.",
    "This means, as well as the driver, the front passenger gets their own display and control area, too, which (in Europe, at least) also allows them to watch dynamic content while on the move.",
    "What's more, Mercedes says the EQS uses an intelligent, camera-based blocking logic: if the camera detects that the driver is looking at the front passenger display, it's automatically dimmed for certain content – meaning drivers won't be able to snatch a sneaky glimpse of any entertainment content while mobile.",
    "The navigation system is pretty intelligent, too. It's able to plan the fastest and most convenient route based on numerous factors (like charging stops) and react dynamically to traffic jams or changes in driving style.",
    "This includes a visualization in the MBUX infotainment system as to whether the available battery capacity is sufficient to return to the starting point without charging.",
    "And finally, Mercedes has confirmed the EQE will boast best-in-class noise and vibration comfort, as well as the brand's Energizing Air Control system, which uses filters and sensors to trap and expel fine particles, micro-particles, pollen and other substances entering the cabin via outside air.",
    "There's no word yet on the EQE's price tag, though we expect it to sit slightly below the starting price of the EQS (roughly $120,000 / £90,000 / AU$170,000), reaching into the six-figure range when optional extras are added.",
    "The staggered global launch of the EQE will take place in mid-2022, with Germany expected to receive the first orders."
  ],
  "headers": {
    "9": "It's what's on the inside"
  },
  "links": {
    "Mercedes EQS": "https://www.techradar.com/news/mercedes-eqs",
    "Audi e-tron GT": "https://www.techradar.com/news/the-audi-e-tron-gt-is-the-most-powerful-audi-ev-to-date-and-its-a-beauty",
    "BMW i4": "https://www.techradar.com/news/bmw-i4-challenges-tesla-model-s-and-audi-e-tron-gt",
    "Volvo C40 Recharge": "https://www.techradar.com/news/the-new-volvo-c40-electric-car-has-a-260-mile-range-that-will-increase-with-updates",
    "our experience driving": "https://www.techradar.com/news/ive-driven-the-future-of-electric-cars-and-its-massively-exciting",
    "MBUX Hyperscreen": "https://www.techradar.com/news/mercedes-giant-ai-enabled-hyperscreen-has-three-high-end-oled-displays"
  }
}