{
  "source": "https://www.techradar.com/news/exploring-the-technology-behind-samsungs-stunning-oled-panels",
  "title": "Exploring the technology behind Samsung's stunning OLED panels",
  "category": "appliances",
  "updated": "2021-11-05T19:59:01Z",
  "author": "sponsored",
  "summary": "An industry first: how Samsung's new OLED panels revolutionize display technology",
  "article": [
    "Foldable display technology could have very easily been nothing more than a gimmick. When it was first announced several years ago, it certainly seemed as though that was the route it would take. Though there was talk of some interesting innovations — wrapping display technology into wallpaper and creating phones that could be folded or rolled up — it didn't seem like there was much to be excited about.",
    "Samsung has proved that assertion wrong and has completely reinvented display technology in the process.",
    "At the core of this evolution is Samsung Display's Diamond Pixel™ Structure. Unveiled with the Samsung Galaxy S4 in 2013, this industry-first technology arranged OLED pixels into a unique diamond shape, with two green subpixels. This achieved a few things:",
    "The above technology is at the core of Samsung's most recent display innovations. Known as Round diamond pixel™ Structure, it uses round pixels arranged in a diamond shape to significantly improve image quality while also increasing both efficiency and peak brightness through Samsung's new Eco2 OLEDTM technology.",
    "With Eco2 OLEDTM, Samsung has removed the polarized plastic film from its OLED panels and integrated the feature directly into the panels themselves. This results in a more battery-efficient panel with improved light efficiency and a peak brightness of up to 1200 nits. The Galaxy Z Fold 3 is one of the first smartphones to feature this technology, and as a result sports the brightest, most vivid flexible smartphone display on the market.",
    "Samsung has always been a frontrunner in display technology. It's always pushed the limits of what's possible. The latest upgrades to its Diamond Pixel™ Display keeps with this trend — and proves beyond any shadow of a doubt that flexible screens are anything but a gimmick."
  ],
  "headers": {},
  "links": {}
}