{
  "source": "https://www.techradar.com/news/zte-axon-30-ultra-5g-announced-with-an-unusual-camera",
  "title": "ZTE Axon 30 Ultra 5G announced with an unusual camera",
  "category": "phones",
  "updated": "2021-04-15T12:50:04Z",
  "author": "james-rogerson",
  "summary": "But not an in-screen one",
  "article": [
    "2021 seems to be the year for ‘Ultra’ handsets, and following on from the Samsung Galaxy S21 Ultra and Xiaomi Mi 11 Ultra, the ZTE Axon 30 Ultra 5G has been unveiled, and it looks to live up to its name.",
    "It has a top-end Snapdragon 888 chipset with 8GB or 12GB of RAM, up to 256GB of storage, and a 6.67-inch curved OLED screen with HDR10+ support and an adaptive refresh rate of up to 144Hz (which is even higher than its ‘Ultra’ rivals). The resolution is a less competitive 1080 x 2400, though.",
    "It also has a quad-lens rear camera, but you probably won’t guess all the lenses. There’s the expected ones including a primary 64MP f/1.6 snapper with optical image stabilization (OIS), a 64MP ultra-wide one (with a 120-degree field of view), and an 8MP telephoto one (with 5x optical zoom), but then there’s an extra 64MP f/1.9 camera.",
    "This last one doesn’t seem to fill any special role, rather it appears to serve as an alternative to the main camera with a slightly different aperture and a presumably slightly different focal length, though that aspect remains unclear.",
    "Another interesting note on the cameras is that while the ZTE Axon 20 5G has an in-screen selfie camera, for the ZTE Axon 30 Ultra 5G there’s a more conventional 16MP punch-hole one. The non-Ultra version of the handset uses in-screen tech, though.",
    "Other specs of the phone include video recording at up to 8K at 30fps, a 4,600mAh battery, 66W charging, an in-screen fingerprint scanner, a microSD card slot, a Gorilla Glass 5 back, and the use of the Android 11 operating system.",
    "The big remaining question is exactly when you’ll be able to buy it and how much it will cost, but the company has confirmed that the Axon 30 Ultra 5G will be coming to the US and Canada. We’d think it’s likely the phone will also come to the UK, but that hasn’t been confirmed, and Australian availability is also unclear.",
    "Whenever and wherever it does launch it’s sure to cost a lot, but perhaps less than other ‘Ultra’ phones.",
    "The ZTE Axon 30 Ultra 5G was also announced alongside the ZTE Axon 30 Pro, which is similar in a lot of ways but with a different camera setup and a 120Hz screen, and the ZTE Axon 30, which actually does have an in-screen selfie camera, but for now these models are only confirmed for China."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "ZTE Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}