{
  "source": "https://www.techradar.com/news/it-enterprise-and-amds-long-term-commitment",
  "title": "IT enterprise and AMD's long-term commitment",
  "category": "components",
  "updated": "2021-06-24T14:12:06Z",
  "author": "roger-benson",
  "summary": "Q&A with AMD's Roger Benson",
  "article": [
    "The priority is working with our partners to meet rising demand, driven by the dramatic increase in IT usage in the enterprise and public sectors. Now AMD has proven itself to enterprise IT decision makers, we will demonstrate our long-term commitment and roadmap execution. We are delivering this in 2021 through our “Zen 3” architecture, which has fed into our AMD EPYCTM server, and RyzenTM mobile and desktop product lines. Enterprise IT growth will continue to accelerate over the next 12 months, and we are working towards meeting that demand with our Ryzen and EPYC products. We are also working with our OEM and cloud partners to give them the products and technology they need to capitalize on the continued surge in demand.",
    "AMD works closely with our silicon foundry partners to take a leadership position in silicon manufacturing, which is not something the whole industry has managed to do over the past year. While some competitors have faced significant difficulties, AMD has led the industry with our 7nm chips in our server and client products.",
    "The server space demands core computing performance and a balanced system. Our products are designed to balance and optimize core performance, memory bandwidth and IO bandwidth performance to suit our customers’ workloads and application needs. Our focus is on how to help customers solve business problems, from the first conceptual design to the final product.",
    "I have seen and read about digital channels, rather than the physical channels businesses had relied on before the pandemic, becoming the fastest-growing revenue sources for many companies in this new normal.",
    "Businesses have had to adapt by enabling remote working across their entire operations, which often requires new IT infrastructure and solutions to ensure business continuity and employee productivity is maintained. The most relevant enabling technologies here are cloud computing and cybersecurity. AMD is extremely well prepared to address both areas, now and in the future. The market needs more computing power and we can help provide it for on-premise data centers and the cloud.",
    "Many of our customers have upgraded their networking lines to make sure that they have good enough infrastructure between the company and the employees’ homes. We have also seen a surge in client demand for new desktop and laptop PC products. We expect this demand and acceleration in the use of cloud computing will continue through 2021.",
    "It really hit home for people during all the disruption that the quality of their work and collaboration demands the latest and greatest technology. From the smoothness of the video you’re making to the productivity of the applications you're using, it all depends on performance. We have seen strong demand for mid-range and high-end products as a result.",
    "AMD has engaged with customers in all these areas and brought a new generation of processors to market that offer a suitable solution for everyone, from consumer and business clients to the latest data center and cloud applications.",
    "Our chips are embedded in several of the ventilators helping COVID-19 patients recover and we have made donations to high-performance computing institutions to support research into the virus. We have also donated technology and hardware to Cambridge University in the UK, Stuttgart High-Performance Computing Centre in Germany, University of Trento in Italy, and to the GENCI research institution in France.",
    "The AMD portfolio is broad enough and our technology robust enough to meet the needs of many different markets and categories. This gives us and OEMs the agility needed to respond to the widest possible range of customer needs.",
    "What surprised and encouraged me most is peoples’ adaptability and how capable the IT industry is at supporting them. It is human nature to resist change, but it has been inspiring to see how, when forced to adapt at speed, people and businesses have risen to the challenge.",
    "The extent to which IT departments have supported their organizations has also been extremely positive. It is as fascinating as it is encouraging to see digital transformation rocket up the corporate and social agenda over the past year.",
    "The way that we have all adapted to home working and learning and adjusted our infrastructure from an IT perspective has been remarkable. As I mentioned before, people everywhere have upgraded their networks, moved to cloud computing, and are making greater use of personal productivity apps than ever before.",
    "Ultimately, I am proud that AMD’s technology is being used to advance society. A key demonstration of this is in high-performance computing solutions. I mentioned before how you can use HPC to do everything from improve weather forecasting to accelerating new research into viruses like COVID-19. This input into combatting the virus is not just about understanding the disease, our supercomputing solutions are being used to better understand how we can manage society’s response to the virus too, for example by minimizing transmission while people are waiting for a vaccine.",
    "During the pandemic, AMD has contributed expertise and $15 million of high-performance computing systems to institutions including, MIT, NYU, Harvard Children’s Hospital, Leibniz Supercomputing Centre and the Stanford School of Medicine. This is what I am most proud of. As well as seeing our technology being used to drive economic prosperity, it is also being used to advance society and support human needs around the world.",
    "I am excited about AMD’s relentless execution against what must be the industry’s most inspiring roadmap. I worked with AMD’s principal competitor for just over 24 years, and I joined AMD because I saw the strength and the potential of that roadmap. We are uniquely positioned as the only company in the world to have key core strengths in both computing capabilities as well as graphics technology.",
    "AMD accelerates business. People now accept we have done a really good job in high performance computing and the cloud. Customers know they can buy a laptop based on our Ryzen series products and feel very confident it will perform well and do everything they want it to. We have also broken through the confidence threshold in the enterprise market which is continuing to accelerate. A key business objective now is to expand as fast as possible across the full spectrum of IT, in client computing, in the data center and in the cloud. What customers and partners are understanding more and more is that AMD accelerates enterprises around the world."
  ],
  "headers": {
    "0": "Now AMD has proven itself to enterprise IT decision makers, what is in store for their long-term commitment and roadmap execution?",
    "1": "What are the biggest differentiators between AMD and its main competitor in the commercial sector?",
    "3": "Has the pandemic changed the market for data centers, server computing hardware and associated technologies?",
    "8": "What has AMD been doing in the fight against COVID-19? Who is it partnering with?",
    "9": "How do the challenges differ across markets in 2021 and how difficult is it to get the right strategy for all markets in the age of COVID-19?",
    "10": "What surprised you the most or was the most interesting thing you have learned during the last year?",
    "13": "What are you most proud of, from you and your colleagues work over the last 6–12 months?",
    "15": "What are you most excited about, that lies ahead in the next 12 months?",
    "16": "If there is one thing that you want people to know or remember about AMD in 2020–21, what is it?"
  },
  "links": {
    "desktop": "https://www.techradar.com/news/best-business-desktop-pcs",
    "cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "application": "https://www.techradar.com/best/best-android-apps-2021",
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "IT infrastructure": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "productivity apps": "https://www.techradar.com/best/best-productivity-apps"
  }
}