{
  "source": "https://www.techradar.com/news/data-sharing-will-underpin-the-future-sustainability-of-our-cities",
  "title": "Data sharing will underpin the future sustainability of our cities",
  "category": "computing",
  "updated": "2021-02-18T11:21:17Z",
  "author": "thibaud-febvre",
  "summary": "Can cities adopt technological innovations?",
  "article": [
    "Effective data sharing will underpin the future sustainability of our cities. Are cities able to adopt technological innovations? Or is the best they can do about implementing bike lanes?",
    "The Covid-19 pandemic has generated a large number of challenges for cities, including changing transport behavior. This crisis has placed particular emphasis on the need to deploy and promote sustainable, multimodal and robust transport systems that support mobility at the local level.",
    "While shared micro-mobility has had a growing share in the transport offer of many cities for several years, 2020 has been marked by the integration of these new services into traditional transport offers, as in Paris and Madrid, as well as by large-scale deployments in the United Kingdom.",
    "For operators of shared micro-mobility services, 2020 has been a year of reacting to market challenges early in the pandemic period, to market survival during the spring, to renewed business models and market relevance. However, this has led governments to realize the importance of micro-mobility within transport ecosystems. Indeed, it has become clear for a growing number of cities that micro-mobility, and more particularly shared micro-mobility services, broaden the modal choice and offer an additional alternative to the private car. Especially as micro-mobility innovations are part of broader policy programs aimed at decarbonizing mobility and supporting a green recovery, as shown by the \"Green Transport Deal\" initiated by the European Union.",
    "The year 2021, a year of hope, also promises to be full of challenges for cities and their mobility managers. For if we want \"smart cities\", we need smarter collaboration: in particular, we need a wider adoption of technological innovations, which have the potential to ensure the future sustainability of our cities. By 2050, almost 70% of the world's population will live in dense urban areas: many cities are only too aware of the challenges posed by this growth, which puts their existing infrastructure under strain. These challenges are all the more amplified by climate change and the exponential pace of technological innovation.",
    "In recent years, new shared mobility services have reshaped the urban landscape, creating both opportunities and challenges: on the one hand, they are a sustainable complement to existing public transport offers, on the other hand, they create tension in an already saturated public space. Similarly, cities are struggling to cope with the current volumes of e-commerce (e.g. 1.5 million parcels are delivered to New York every day), a phenomenon that has increased tenfold during the Covid-19 pandemic. As with shared mobility services, cities and logistics companies need to find new ways of working together.",
    "For it is not so much the lack of innovation that is holding back the advent of \"smart cities\" as we imagine them, but above all the lack of collaboration between the various stakeholders, whether public or private. These synergies can be fostered in large part through data sharing and the development of more public-private partnerships, as highlighted in the report Smart cities: Digital solutions for a more deliverable future published by McKinsey. In particular, the increasing volume of mobility services and different types of vehicles that will eventually have to coexist in the same physical space make this public-private hybridization imperative to accompany the public transformation.",
    "The need for a data-driven approach is now recognized by most European cities, where the role of Chief Data Officer is becoming increasingly key to fairer, greener and more democratic municipal governance.",
    "For making our cities \"smarter\" is not just a matter of installing digital interfaces in traditional infrastructures. It is also about using available technology and data in a targeted way to make better decisions and provide a better quality of life for citizens. In order to achieve this goal, municipal teams must go beyond simply reacting to the changing landscape around them and meet today's challenges. It is essential that they continue to invest in their technological capabilities to anticipate future changes, adopt innovations more quickly, and proactively share good practices between cities in order to learn from each other."
  ],
  "headers": {
    "4": "Sustainability challenges",
    "6": "Smart cities"
  },
  "links": {
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform"
  }
}