{
  "source": "https://www.techradar.com/news/samsung-galaxy-a82-leak-reveals-the-design-and-specs-of-the-new-phone",
  "title": "Samsung Galaxy A82 leak reveals the design and specs of the new phone",
  "category": "phones",
  "updated": "2021-04-04T15:30:05Z",
  "author": "david-nield",
  "summary": "Though some questions remain",
  "article": [
    "With the Samsung Galaxy A52 and Galaxy A72 now out in the world, Samsung can move on to its next affordable mid-range device. It's likely to be the Galaxy A82, and a new leak of the phone offers a look at the handset as well as details of some key specs.",
    "Well-known tipster Mukul Sharma posted the picture and the info on Twitter, having obtained them from the Google Play Console developer tool. We get a good look at the front of the device, though it's not clear if this is a genuine render or a placeholder image.",
    "If the picture is genuine, then the handset is going to use a centered punch hole to hold the selfie camera. There has been talk that a rotating, pop-up selfie camera is likely – matching the 2019 Samsung Galaxy A80 – so we'll have to wait and see on that point.",
    "The leak doesn't offer a glimpse at the back of the Samsung Galaxy A82 unfortunately, perhaps backing up the idea that the included picture is just a generic shot, but we'd expect the aesthetics to follow the lead of the other handsets that Samsung has pushed out so far this year.",
    "On the specs side, it would appear that Samsung is going to fit the Galaxy A82 with a Qualcomm Snapdragon 860 chipset, which is a minor upgrade over the Snapdragon 855 Plus from 2019, with some added 5G connectivity.",
    "It's the same chip that's in the recently launched Poco X3 Pro from Xiaomi, so expect similar levels of performance. That chipset will apparently get paired with up to 6GB of RAM, making this a mid-ranger that can hold its own in terms of performance.",
    "Other bits of information that we can glean from this listing are that the phone will come running Android 11, as you would expect, and that the screen resolution will be 1080 x 2400 pixels – though there's no word yet on the dimensions of the display.",
    "We're also still waiting to hear when the phone might see the light of day, though considering the appearance of the Galaxy A82 on the Google Play Console, it shouldn't be too long before Samsung makes all of this official. You didn't miss the Galaxy A81 by the way, as it was reconfigured as the Samsung Galaxy Note 10 Lite.",
    "Via Pocketnow"
  ],
  "headers": {},
  "links": {
    "out in the world": "https://www.techradar.com/news/samsung-galaxy-a52-and-a72-are-here-and-bring-flagship-features-to-mid-range-phones",
    "Mukul Sharma": "https://twitter.com/stufflistings/status/1377475129324675078",
    "has been talk": "https://www.techradar.com/news/samsung-galaxy-a82-could-have-an-innovative-selfie-camera",
    "Samsung Galaxy A80": "https://www.techradar.com/reviews/samsung-galaxy-a80-review",
    "the other handsets": "https://www.techradar.com/news/samsung-galaxy-a52-and-a72-are-here-and-bring-flagship-features-to-mid-range-phones",
    "Poco X3 Pro": "https://www.techradar.com/news/gaming-centric-poco-x3-pro-with-snapdragon-860-launched-in-india",
    "Samsung Galaxy Note 10 Lite": "https://www.techradar.com/news/best-samsung-phones",
    "Pocketnow": "https://pocketnow.com/samsung-galaxy-a82-leak-shows-its-clean-design-and-a-rehashed-2-year-old-chip"
  }
}