{
  "source": "https://www.techradar.com/news/nvidia-rtx-3000-gpu-shortages-are-so-bad-that-the-geforce-gt-730-has-made-a-comeback",
  "title": "GPU shortages are so bad that the GeForce GT 730 has made a comeback",
  "category": "computing",
  "updated": "2021-06-10T13:28:17Z",
  "author": "jess-weatherbed",
  "summary": "A blast from the past",
  "article": [
    "Times are pretty bleak right now for anyone trying to get ahold of some of the best graphics cards on the market, such as the Nvidia GeForce RTX 3080 and the AMD Radeon 6800 XT. In fact, you'd be pretty pressed to find any halfway decent GPU for a fair price, which has led to MSI resurrecting a relic from 2014, the GeForce GT 730. If you've been trying to build a gaming PC or upgrade an existing rig over the last few months, chances are you've been unsuccessful due to the ongoing shortage of components like AMD Ryzen processors and the latest generation of AMD 'Big Navi' Radeon and Nvidia RTX 3000 series graphics cards.",
    "This is due to a combination of problems such as supply issues caused by the Covid-19 pandemic, scalpers buying up stock to resell for an insane markup, and cryptocurrencies increasing in value, resulting in more demand for crypto mining farms that use up what little hardware is available.",
    "Let's be real, the GT 730 is considerably past its heyday which doesn't make it the most attractive alternative for anyone hunting for even a budget card but it might work if you're desperate (or a fan of older, less demanding titles from the same era). This is the Keplar version of the GPU, which means it packs a whopping 384 CUDA cores and features a 902 MHz boost clock and 2GB of DDR3 VRAM at 1,600 MHz. It also only used 23W of power, but MSI suggests that you play it safe and use a 300W power supply. You won't be playing any new AAA games on this 'beast', but a few old benchmarks provided by Quora user Swapnil Gore reveal you could expect around 40 FPS in Grand Theft Auto 5 and 50 FPS on Tomb Raider 2013 on Medium/High settings. It's important to note that Nvidia has announced that all driver support for Keplar graphics cards will be terminated on the next GeForce driver update, so if you wanted to actually buy one then proceed at your own risk. It also isn't clear if this model will actually be sold outside of Japan as a price was provided as 4,565 yen (around $40 / £30 / AU$50). Regardless of how likely this is to sell, it paints a grim picture of the current GPU market. With the RTX 3070 Ti expected to hit the shelves later today, we anticipate it will sell out just as quickly as the previous Nvidia releases, only to be found available through resellers for a considerable sum. We can only hope that something will give eventually so PC gaming doesn't become even pricier than it already was.",
    "Via Tom's Hardware"
  ],
  "headers": {
    "2": "What year is it?"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "AMD Radeon 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "build a gaming PC": "https://www.techradar.com/how-to/how-to-build-your-first-gaming-pc",
    "AMD Ryzen processors": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "AMD 'Big Navi' Radeon": "https://www.techradar.com/news/amd-big-navi",
    "Nvidia RTX 3000 series": "https://www.techradar.com/news/nvidia-ampere",
    "resell for an insane markup": "https://www.techradar.com/news/current-nvidia-rtx-3000-gpu-prices-are-so-much-worse-than-we-thought",
    "cryptocurrencies": "https://www.techradar.com/how-to/how-to-mine-bitcoin-and-other-cryptocurrencies",
    "Quora user Swapnil Gore": "https://www.quora.com/What-games-can-I-run-on-NVIDIA-GT730-2GB-DDR5-Even-in-low-settings",
    "RTX 3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "Tom's Hardware": "https://www.tomshardware.com/uk/news/gpu-shortage-got-you-down-geforce-gt-730-makes-a-comeback"
  }
}