{
  "source": "https://www.techradar.com/news/amazon-ceo-jeff-bezos-to-step-down-after-26-years-heres-whats-next",
  "title": "Amazon CEO Jeff Bezos to step down after 26 years – here’s what’s next",
  "category": "news",
  "updated": "2021-02-03T09:44:37Z",
  "author": "john-loeffler",
  "summary": "Bezos will transition to executive chair of the company's board",
  "article": [
    "Jeff Bezos announced that he is stepping down as Amazon's CEO in the third quarter of this year, capping a 26-year run as the head of the online retailer that he founded in 1994. He'll become the executive chair of the company's board of directors.",
    "Andy Jassy will succeed Bezos as the new Amazon CEO when that transition happens later this year, according to an email sent to Amazon employees on February 2. Jassy, currently the head of Amazon Web Services (AWS), the company's cloud computing platform, has been with the Amazon since 1997.",
    "\"Andy is well known inside the company and has been at Amazon almost as long as I have,\" Bezos said in the email. \"He will be an outstanding leader, and he has my full confidence.\"",
    "Amazon Web Services has been a major driver of profit for the company in recent years, a fact highlighted by Amazon posting its first ever $100 billion quarter, raking in $125.6 billion in revenue in the latest quarterly earnings, reports CNBC. Roughly 52% of Amazon's operating income comes from its cloud computing division.",
    "Bezos said that as executive chair, \"I intend to focus my energies and attention on new products and early initiatives.\" Given the extent of Bezos' interests outside of Amazon, including The Washington Post, Blue Origin, and others, how much of his focus will be kept in-house remains to be seen.",
    "The choice of Andy Jassy to be Amazon's next CEO isn't all that surprising. Cloud computing is becoming the biggest driver of Amazon's revenue, as it is for many other companies like Microsoft and Oracle.",
    "Cloud computing is a term that gets thrown around a lot but few people outside of the technology industry ever knowingly engage with, despite pretty much every app on your phone that has any kind of online functionality likely running on a cloud computing platform of some kind, whether it's Amazon Web Services, Microsoft Azure, Oracle Cloud Infrastructure.",
    "Given its explosive growth in recent years and Bezos' selection of Jassy to succeed him as Amazon CEO, it's fair to say that Amazon very much sees its future dependent on its cloud computing division to support its many other ventures, rather than the other way around.",
    "TechRadar will continue reporting on what's next for Amazon as it begins its post-Bezos era later this year."
  ],
  "headers": {
    "5": "With new leadership, where is Amazon head- who are we kidding? It's Cloud Computing."
  },
  "links": {
    "email": "https://www.aboutamazon.com/news/company-news/email-from-jeff-bezos-to-employees?TheTime=2021-02-02T21%3A13%3A18&ServiceType=twitter&PostType=image&ftag=COS-05-10aaa0b&UniqueID=78A20F1A-659B-11EB-93EE-5B6D0EDC252D",
    "AWS": "https://www.techradar.com/news/aws",
    "CNBC": "https://www.cnbc.com/2021/02/02/amazon-amzn-earnings-q4-2020.html",
    "comes from its cloud computing division": "https://www.cnbc.com/2021/02/02/jeff-bezos-to-step-down-as-amazon-ceo-andy-jassy-to-take-over-in-q3.html",
    "Andy Jassy": "https://www.techradar.com/news/aws-ceo-cloud-can-be-the-key-for-your-business-reinvention-and-success",
    "Cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}