{
  "source": "https://www.techradar.com/news/garmin-vivoactive-3-vs-garmin-vivoactive-4",
  "title": "Garmin Vivoactive 3 vs Garmin Vivoactive 4: how to choose your next smartwatch",
  "category": "fitness",
  "updated": "2021-03-06T13:00:58Z",
  "author": "cat-ellis",
  "summary": "Pick the right Vivoactive for you",
  "article": [
    "The Garmin Vivoactive 3 and Vivoactive 4 are two excellent smartwatches, and if you're looking for a new fitness tracker you might find it hard to choose between the two. That's why we've put both devices head-to-head, comparing their design, price and features so you can pick the right one for you.",
    "The Vivoactive 3 was released in September 2017, and the Vivoactive 4 went on sale in March 2021. However, despite the four-year difference, the newer watch isn't necessarily the best choice for everyone – it depends on your budget, and whether you're likely to use enough of the Vivoactive 4's new features to justify its higher price.",
    "Still can't decide? Take a look at our complete guide to the best Garmin watches to see if another device suits you better.",
    "Often, recommending the newer of two watches is a no-brainer, but the Vivoactive 3 has stood the test of time well, and is still an excellent smartwatch. It has some significant limitations compared to the Vivoactive 4 (more on that shortly), but it's often available for around half the price, which might tip the balance in its favor if you're not likely to use those extra features.",
    "Both watches are solid choices for runners and cyclists, with accurate on-board GPS and ANT+ connectivity for devices like footpods and cadence sensors. However, if you enjoy swimming, you should opt for the Vivoactive 4, which is the only one of the pair that can measure your heart rate underwater.",
    "We'd also recommend the Vivoactive 4 if you want to listen to music without your phone. The standard Vivoactive 3 allows you to control music playback on your handset, but doesn't have storage for songs, and there's little difference between the prices of the Vivoactive 3 Music and Vivoactive 4, so you might as well opt for the more powerful, newer device.",
    "Another of the Vivoactive 4's best features is its blood oxygen sensor. This doesn't just measure SpO2 overnight to check for signs of sleep apnea; it can also track it throughout the day and allows you to perform spot-checks, making it a useful training tool.",
    "If those tools aren't essential though, the Vivoactive 3 could be your next watch, despite its age. Just remember that because it's older, repairs and replacements may be trickier if something goes wrong or it gets broken.",
    "The Vivoactive 3 has a 30.4mm display with a 240 x 240 pixel resolution. the standard Vivoactive 4 has the same size screen, but a higher resolution of 260 x 260 pixels for improved clarity.",
    "Both watches use color memory-in-pixel displays to show your workout stats. While these are designed to be clearly legible even in bright sunlight, they're less vivid than the Garmin Venu, which features an OLED screen.",
    "The case of the Garmin Vivoactive 3 measures 43.4 x 43.4 x 11.7mm. and can be made of either polymer or stainless steel (the latter version looks smart, but costs a little extra). Both models have a stainless steel bezel,",
    "The standard Garmin Vivoactive 4 is a little larger, measuring 45.1 x 45.1 x 12.8mm, and again, can be made from either polymer or stainless steel, with a stainless steel bezel.",
    "Both devices have quick-release silicone bands (with extra options sold separately if you fancy a change).",
    "If the 45mm Vivoactive 4 is too chunky, there's also a 40mm version available for around the same price.",
    "Both watches allow you to receive smartphone notifications, and send text responses or reject calls with a text if you're an Android user.",
    "You get weather and calendar apps installed by default, and tou can download additional watch faces and third-party apps for both watches through Garmin Connect IQ. Both watches also allow you to make contactless payments via NFC through Garmin Pay.",
    "While you can use either watch to control music playback on your phone, you can't store music on the standard Garmin Vivoactive 3. If that's something you're looking for, you'll need to opt for the more expensive Vivoactive 3 Music Edition, or the VIvoactive 4. Both of these watches have storage for up to 500 songs, which you can stream to Bluetooth headphones.",
    "The Vivoactive 4 has the edge when it comes to battery life, but it's not a huge difference. The Vivoactive 3 can last up to 13 hours with GPS enabled, and up to seven days in smartwatch mode. If you opt for the Vivoactive 3 Music, you can use GPS and music playback for five hours on a full charge.",
    "The Vivoactive 4 can keep going for up to six hours with both GPS and music enabled, and up to eight days in smartwatch mode.",
    "Both the Vivoactive 3 and Vivoactive 4 have on-board GPS (supplemented by Galileo and GONASS), so you can track runs, walks and bike rides accurately without connecting them to your phone. They also feature ANT+ connectivity, meaning you can connect them to additional sensors such as chest strap heart rate monitors and footpods for extra workout metrics.",
    "Only the Vivoactive 4 has an SpO2 sensor though – and it's a particularly versatile one at that. Many fitness trackers can only monitor blood oxygen saturation overnight, but the Vivoactive 4 also allows you to monitor it throughout the day and perform spot-checks whenever you like.",
    "Both watches have all-day heart rate monitoring and will alert you if your heart rate becomes raised unusually high, but only the Vivoactive 4 provides low heart rate alerts. If you swim regularly, it's worth noting that only the Vivoactive 4 can measure heart rate underwater.",
    "The Vivoactive 3 has activity tracking profiles for strength, cardio and elliptical training, plus stair stepping, floor climbing, indoor rowing and yoga. The Vivoactive 4 has all of those, plus options for pilates and breathwork.",
    "Both watches can track treadmill and outdoor running, indoor and outdoor cycling, and pool swimming. They also have dedicated modes for skiing, snowboarding, cross-country skiing, stand up paddle boarding, and outdoor rowing.",
    "Both are capable golf watches too, with features including a digital scorecard, automatic shot distance measuring, green view with manual pin positioning, and Garmin Autoshot. However, they don't come pre-loaded with the thousands of course maps you get with the Garmin Fenix 6.",
    "Prices vary a little depending on while color scheme you opt for, but the Vivoactive 3 is available to buy direct from Garmin starting at $249.99 / £199.99 / AU$249 for the standard edition or $249.99 / £249.99 for the music edition. The Vicoactive 3 Music is no longer available in Australia if you buy from Garmin, but can be found at third-party retailers for around AU$160.",
    "Meanwhile, the Vivoactive 4 starts at $349.99 / £259.99 / AU$579. The 55mm and 40mm models are the same price in the US and Australia, but the smaller version is slightly cheaper in the UK, starting at £239.99.",
    "Both the Vivoactive 3 and 4 are often available for less at retailers like Amazon (particularly around Black Friday), but because it's an older model, the Vivoactive 3 is often more heavily discounted."
  ],
  "headers": {
    "3": "Summary",
    "8": "Display",
    "10": "Design",
    "14": "Smartwatch features",
    "19": "Fitness tracking features",
    "25": "Price"
  },
  "links": {
    "Garmin Vivoactive 3": "https://www.techradar.com/reviews/garmin-vivoactive-3-review",
    "Vivoactive 4": "https://www.techradar.com/reviews/garmin-vivoactive-4",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "best Garmin watches": "https://www.techradar.com/best/garmin-watch",
    "Garmin Venu": "https://www.techradar.com/reviews/garmin-venu",
    "Garmin Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}