{
  "source": "https://www.techradar.com/news/garmins-new-smartwatch-has-a-huge-battery-top-features-and-an-eye-watering-price",
  "title": "Garmin's new endurance smartwatch has a huge battery and an eye-watering price",
  "category": "wearables",
  "updated": "2021-02-16T14:27:30Z",
  "author": "tom-bedford",
  "summary": "The Garmin Enduro is here",
  "article": [
    "While technology has increasingly found its way into the fitness and extreme sports spheres, with watches that help you ski, swim and surf, there are few smartwatches that are really suited to endurance activities – and that's seemingly something that Garmin is looking to change with its latest device.",
    "The Garmin Enduro is an adventure watch with a rugged design, a long-lasting battery, and plenty of useful features designed to aid with tasks like backcountry skiing, trail running, mountain biking and the like.",
    "This is a premium smartwatch, and you'll be paying $799 / £699 / AU$1,249 for the privilege of wearing it. And that's just for the steel version – if you want the titanium model that costs $899 / £799 / AU$1,399. Garmin is no stranger to expensive smartwatches, but even by its standards this a pricey device.",
    "One of the Garmin Enduro's headline features is its battery life, which is said to clock in at 70 hours of GPS tracking, 50 days of standard use, and up to 130 days in battery-saving mode – and if you active the solar powering feature, those times increase to 80 hours of GPS tracking, 65 days of general use and a whole year in battery saver mode.",
    "The watches endurance features include V02 tracking, 'ultrarun' run tracking which recommends when you should rest, altitude information, ascent planners so you can see if you're heading for a hill, various performance metrics, workout suggestions, recovery timers and quite a few more.",
    "There are also specific modes for mountain biking, skiing, surfing and run pacing, providing you in-depth tracking for a few different sports.",
    "Beyond those you'll find a few lifestyle features that you'd find in most smartwatches including NFC for contactless payment, phone notifications, and access to Garmin's app store.",
    "Overall it sounds like a seriously feature-laden smartwatch, which it would need to be to justify that price tag. Stay tuned for our full review to find out if it lives up to its billing"
  ],
  "headers": {
    "3": "Garmin Enduro features"
  },
  "links": {}
}