{
  "source": "https://www.techradar.com/news/whatsapp-is-planning-a-big-improvement-to-its-photo-sharing-skills",
  "title": "WhatsApp is planning a big improvement to its photo sharing skills",
  "category": "cameras",
  "updated": "2021-07-09T08:46:36Z",
  "author": "mark-wilson",
  "summary": "Time for a decompress",
  "article": [
    "WhatsApp is testing a new feature that could make it much easier to share high-quality photos and video in the messaging app.",
    "Right now, any snaps you share with friends or family over the messaging app are crunched down using lossy compression, which significantly reduces their quality.",
    "But as spotted by WABetaInfo, a new option being tested in the WhatsApp beta for Android (version 2.21.14.16) would give you the choice of sending photos or video in either 'Data saver' (compressed) or in a new 'Best quality' format.",
    "It's not yet clear whether 'Best quality' means completely uncompressed or, perhaps more likely, a lighter form of compression that preserves image quality. All the beta says right now is that \"best quality photos are larger and can take longer to send\".",
    "Google Photos already offers a similar dual option for its photos, but its alternative to compressed photos is 'Original quality', which preserves the same resolution and quality as the original file.",
    "Either way, it's likely to be a very handy option for anyone who regularly uses WhatsApp to share photos, but would prefer them to be kept intact rather than put through the messaging app's compression ringer.",
    "The same beta version of the app also contains an identical option for videos, too. Both options will likely be found in the 'storage and data' section of WhatsApp's settings on the Android app, though it's not yet clear if the same feature is being tested for iOS users.",
    "It's technically possible to send uncompressed photos using WhatsApp right now, but it requires an awkward workaround that involves converting the image into a PDF before sending it.",
    "Although it's not yet clear when WhatsApp's new 'Best quality' feature might be rolled out officially, it promises to be a much slicker, and long overdue, way to send photos that preserve the quality that's possible on the best phone cameras.",
    "While it's understandable that WhatApp's default mode is to compress images for speed and mobile data purposes, the messaging app's ubiquity makes it a great way to quickly share snaps with almost anyone. That goes for pro photographers too, who might use the app to send preview snaps to clients more if it didn't crunch all files down to around 2MP.",
    "The promise of an 'Auto' mode in the beta screenshot above also suggests that you might be able to leave WhatsApp to decide the level of compression, based on whether you're using mobile data or Wi-Fi. But we'll have to wait to see the full release, hopefully soon, before seeing exactly how that option will work."
  ],
  "headers": {
    "7": "Crunch time"
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-14-16-whats-new/",
    "best phone cameras": "https://www.techradar.com/news/best-cameraphone"
  }
}