{
  "source": "https://www.techradar.com/news/major-blow-for-intel-as-micron-pulls-3d-xpoint-memory",
  "title": "Major blow for Intel as Micron pulls 3D XPoint memory",
  "category": "computing",
  "updated": "2021-03-17T14:34:02Z",
  "author": "mayank-sharma",
  "summary": "Intel will need to make new arrangements for its 3D XPoint memory requirements",
  "article": [
    "Computer memory and data storage manufacturer Micron has decided to cease the production of the 3D XPoint memory, reportedly owing to poor sales.",
    "Micron developed the 3D XPoint jointly with Intel in 2015, with the non-volatile memory claiming to offer higher performance and endurance than the popular NAND flash rival. While Micron started selling 3D XPoint-based products in 2019 under the QuantX brand, Intel has been using the technology for a wide range of products it marketed under the Optane brand.",
    "The decision to stop the production of 3D XPoint memory-based products apparently stems from the lukewarm response it received from customers who weren’t willing to put in the effort to re-write their software to make full use of the memory, according to a Reuters interview with Micron's chief business officer, Sumit Sadana.",
    "Earlier this year Intel killed off its entire range of Optane solid state drives for the consumer market. Instead it's now focused entirely on the new Optane Memory H20, which uses small amounts of Optane memory.",
    "In addition to stopping production, Micron is also putting its under-utilized manufacturing unit that was producing 3D XPoint memory up for sale. The company is talking to several potential buyers and Intel, which doesn’t seem to be in a mood to give up on Optane anytime soon, is also said to be one of them.",
    "Notably however Intel and Micron ceased all collaborative efforts in 2019 after completing development on the second generation 3D XPoint. While Intel has moved its 3D XPoint R&D to New Mexico, it hasn’t yet built up any fabrication units for their 3D XPoint needs.",
    "Via: AnandTech"
  ],
  "headers": {
    "3": "Intel’s move"
  },
  "links": {
    "Micron": "https://www.techradar.com/reviews/micron-1tb-c200-microsd-uhs-i-card",
    "jointly with Intel in 2015": "https://www.techradar.com/news/computing-components/storage/intel-micron-debut-3d-xpoint-transistor-less-non-volatile-memory-for-faster-speeds-1300480",
    "QuantX brand": "https://www.techradar.com/news/microns-x100-ssd-is-its-first-3d-xpoint-product",
    "Optane brand": "https://www.techradar.com/news/intel-unleashes-first-optane-ssd-and-its-a-speed-demon",
    "Reuters": "https://www.reuters.com/article/idUSKBN2B82WO",
    "Intel killed off": "https://www.techradar.com/news/intel-has-killed-off-its-speedy-optane-ssds-so-if-you-want-one-buy-it-quickly",
    "solid state drives": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "Optane Memory H20": "https://www.techradar.com/news/intel-reinvents-the-ssd-and-unleashes-an-optane-monster",
    "AnandTech": "https://www.anandtech.com/show/16558/micron-abandons-3d-xpoint-memory-technology"
  }
}