{
  "source": "https://www.techradar.com/news/the-division-goes-free-to-play-with-new-standalone-title-heartland",
  "title": "The Division goes free-to-play with new standalone title, Heartland",
  "category": "gaming",
  "updated": "2021-05-07T04:26:04Z",
  "author": "stephen-lambrechts",
  "summary": "Expect a huge selection of backpacks for purchase",
  "article": [
    "Tom Clancy's The Division franchise has proven a huge success for Ubisoft in recent years, reaching roughly 40 million players since the first game's launch back in 2016.",
    "Impressive as that is, that number is set to explode with the announcement of Tom Clancy's The Division Heartland, an upcoming free-to-play title for PC, consoles and cloud-gaming platforms.",
    "Little is known about Heartland at present, though the game currently has a tentative release window of 2021-2022, suggesting it will launch either late this year or early next.",
    "The game will presumably be microtransaction-driven for cosmetics (and possibly weapons), so expect a wide selection of backpacks and assault rifles on offer at release.",
    "Heartland's development is being led by Red Storm Entertainment, a studio which worked on both The Division and The Division 2 and is described as having \"close ties to the Tom Clancy licenses\".",
    "In addition to Heartland, Ubisoft plans to continue its all-out transmedia assault with the announcement that The Division franchise will also be coming to mobile, though details for that game will be revealed at a later date.",
    "The Division 2 is also set to receive new DLC as part of an update set for release in late 2021. The new content is being developed by Ubisoft Massive, with support from Ubisoft Bucharest, and will offer \"an entirely new game mode and new methods for levelling agents up with an emphasis on increasing build variety and viability.\"",
    "Ubisoft also announced a new original novel set after the events of The Division 2, and is said to \"explore how the Outbreak affects different regions of the United States as agents fight to secure supply routes.\"",
    "The publisher would also like to remind you that a film adaptation of The Division starring Jessica Chastain and Jake Gyllenhaal is still in the works at Netflix."
  ],
  "headers": {
    "5": "The Division's latest outbreak: transmedia"
  },
  "links": {
    "still in the works": "https://www.techradar.com/news/netflixs-the-division-movie-is-still-happening-and-it-has-some-big-names"
  }
}