{
  "source": "https://www.techradar.com/news/google-photos-locked-folder-what-is-it-and-how-do-you-use-it",
  "title": "Google Photos Locked Folder: what is it and how do you use it?",
  "category": "cameras",
  "updated": "2021-05-19T12:52:35Z",
  "author": "mark-wilson",
  "summary": "The new Google Photos privacy feature, unlocked",
  "article": [
    "Google Photos has been given a new Locked Folder feature, which was very in keeping with the strong privacy theme of the Google IO 2021 developer conference.",
    "The Locked Folder idea is pretty simple: it's a passcode-protected place where you can save photos separately, so they don't show up in your Google Photos feed (or any other apps on your phone) as you're scrolling through them.",
    "But as Google didn't expand too much on the specifics of Locked Folder, we've put together this guide to explain how it works and how you can start using it. The first thing to note is that it's initially only available on Google Pixels, from the Google Pixel 3 onwards, and will be released for those phones 'in the coming weeks'.",
    "Google says that it'll be coming to 'more Android devices throughout the year', with no mention of iPhone users – for now, they'll have to use iOS 14's Hidden Album feature instead.",
    "So what exactly happens to photos that you stash away in the Locked Folder and how can you file photos in there? Here's everything you need to know about the new Google Photos feature.",
    "Most Google Photos users will have experienced that slight reticence of handing over their phone to let someone scroll through your Photos feed – after all, our smartphone camera rolls are 360-degree life feeds rather than just holiday albums.",
    "The new Google Photos Locked Folder feature is here to help solve that issue. It's a private space that's effectively protected by your phone's screen lock – whether that's a passcode or your fingerprint.",
    "But Google Photos already had an Archive feature, so what's the difference? The main one is that archived snaps or videos in Google Photos will still appear when you search in Google Photos, whereas the Locked Folder keeps them hidden beneath your phone's screen lock.",
    "Once you've saved something in the Locked Folder, it won't appear in the Google Photos grid, memories, search or albums. Crucially, it also won't be available to any other apps on your phone either.",
    "The slight downside of using the Google Photos Locked Folder is that you can't back up any of the images or videos that it contains.",
    "In its list of things you that can't do with files in the Locked Folder, Google includes \"back up items\", alongside editing them, sharing them, adding them to an album or photo book, and sharing them on social media to the likes of Facebook and Instagram.",
    "If you move existing photos or videos to the Locked Folder, Google says that \"cloud backups of these items will be deleted\". While this makes sense from a privacy perspective, it does mean you'll have to accept not having a backed up copy of the images or videos in Google Photos (unless you make one yourself elsewhere).",
    "Once you've moved a photo or video to the Locked Folder, they'll be automatically removed from your existing memories or photo print orders. Google says that they also won't be shown on Google smart displays like the Google Nest Hub, although it's not yet clear what the situation is with third-party displays.",
    "On Google Pixel phones there are two ways to use the Google Photos Locked Folder – you can either save snaps directly to the folder from the Pixel Camera, or you can move existing images or videos to the folder once it's set up. On other Android phones, which will get the feature later this year, you'll only be able to do the latter.",
    "To set up your Locked Folder, open the Google Photos app, then go to Library > Utilities > Locked Folder. Tap the 'Set up Locked Folder' option and follow the instructions. When you start, the folder will simply show a 'nothing is here yet' message.",
    "If you have a Pixel phone, you'll be able to save images or videos straight from your phone's camera, but you'll need to follow a few steps before taking your snap. To do this, open the Pixel Camera app, in the top right-hand corner tap Photo Gallery > Locked Folder. When you take a photo, it'll automatically be squirreled away in the Locked Folder.",
    "The most common way to use Locked Folders will be moving existing snaps or videos that are already in your Google Photos library, rather than sending them directly from a Pixel phone's camera.",
    "To do this, select the photos or videos you want to move in your Google Photos library by doing a long-press on one of them, then tapping all the ones you want stashed away.",
    "Once you've done this, tap the 'More' option in the top right corner, then 'Move to Locked Folder'. Lastly, hit 'Move' to get them hidden away in the password-protected space.",
    "It's important to note that once you move any photos or videos to the Locked Folder, Google will delete cloud backups of those items. So if you want to make sure you have more than one copy of file, you'll need to make sure there's a copy filed away in a secure place somewhere else.",
    "On the flip side, if you have previously made a copy of an image or video that you've moved to the Google Photos Locked Folder, that won't automatically be moved into the password-protected space. Only the specific file you've chosen will go into the Locked Folder, so it's worth checking to see if you've made copies or taken similar snaps elsewhere in your Google Photos library."
  ],
  "headers": {},
  "links": {
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog",
    "Google Nest Hub": "https://www.techradar.com/reviews/google-nest-hub-2nd-generation-review"
  }
}