{
  "source": "https://www.techradar.com/news/7-new-shows-and-movies-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-october-15-2021",
  "title": "7 new shows and movies on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-10-16T17:23:23Z",
  "author": "samuel-roberts",
  "summary": "Wondering what to watch this weekend?",
  "article": [
    "While Squid Game still rides high on the Netflix charts, and as No Time To Die and Venom 2 bring the theatrical box office back to life, you might assume that the world of streaming is cooling off a little bit. Not so: this weekend sees the return of two major series in You and Succession, which have each taken two years to reach our screens again as a result of pandemic production challenges.",
    "Fans will be pleased to have those back, but they're not the only big arrivals this weekend. Horror sequel Halloween Kills has landed on NBC's Peacock streaming service's premium tiers in the US – though UK viewers will need to catch that one on the big screen. We've thrown a few other possibilities in for you to check out below, too – and check out the DC FanDome 2021 event this weekend if you need to scratch a superhero itch.",
    "Here's what's new on Netflix and other streamers this weekend, and how you can watch them in the US and the UK.",
    "One of Netflix's most popular dramas is back. You follows Joe Goldberg (Penn Badgley), who has a terrible habit of becoming obsessed with the women in his life. This season, Joe and his equally toxic partner Love (Victoria Pedretti) move to the suburbs and have a child – which you think would set Joe straight.",
    "Unfortunately, based on the trailer above, it's not long before he develops yet another obsession with a woman, this time facing the wrath of his dangerous partner as a result of his wandering eye.",
    "You probably know by now if this show's shocking soap-y twists are to your taste or not, but if nothing else, it's a sign that most of Netflix's big productions are now back on track for a busy final few months of 2021.",
    "Now streaming on Netflix",
    "Finally, after more than two years, the much-hyped return of wealthy family drama Succession is here. Among TV lovers, this is an elite-tier show – a series comprised of backstabbing and sharp-tongued insults as the children of media mogul Logan Roy (Brian Cox) compete for ultimate control of the family empire.",
    "The third season will explore the fallout from last season's finale, when Kendall Roy (Jeremy Strong) turned on his father in spectacular, public-facing fashion. A war between the two – with Kendall still hiding a dark truth known by Logan – should give this season a lot of dramatic firepower.",
    "New episodes will roll out weekly. Please don't make us wait two years for another season, HBO.",
    "Streaming on HBO Max from Sunday and NOW/Sky in the UK from Monday",
    "Halloween Kills is the next canonical sequel in the horror series, following the 1978 Halloween and the 2018 modern follow-up starring Jamie Lee Curtis and Judy Greer. Michael Myers (implausibly) still lives after the events of the last movie, and this entry once again sees Laurie Strode and her daughter trying to fend off the masked murderer.",
    "Critics have been a little cooler on this one than the original, but those in the US can enjoy this one without leaving their homes – it's available on Peacock's Premium tier, as well as Premium Plus. You can also see it in theaters, which is the only way to watch it if you're reading this in the UK.",
    "As the year drags on and the theatrical box office starts to recover, it's hard not to wonder if day-and-date releases on streamers are taking the sting out of big movie launches – but the choice is still welcome for those who live in areas with poor vaccination uptake, high case loads or anyone who simply doesn't want to fork out for a cinema ticket.",
    "Now streaming on Peacock Premium and Premium Plus in the US, and available theatrically in the UK",
    "A premise that just about supported one okay '90s movie – several friends commit a crime, and that grim secret emerges a year later at the behest of a mysterious killer – is now the subject of an entire TV show on Amazon Prime Video, just in time for Halloween.",
    "We're not totally convinced by the trailer, honestly, but it looks firmly aimed at teenagers more than fans of the original. Funny how these crimes always happen during the summer and not, say, at a ski lodge. I Know What You Did Last Winter wouldn't be as catchy, we suppose.",
    "This one launches with four episodes, with the rest following in subsequent weeks.",
    "Now streaming on Amazon Prime Video",
    "This harrowing but well-reviewed miniseries explores the profound effect that prescribed narcotic OxyContin had in America, detailing its creation and sale by Purdue Pharma. Michael Keaton stars as Dr Samuel Finnix, a local doctor in a fictional mining town in Virginia, who starts prescribing the drug to help his patients treat pain – and eventually sees how it affects their lives. This big ensemble drama also stars Rosario Dawson, Michael Stuhlbarg and Will Poulter.",
    "Three episodes are available on Hulu now, with the rest rolling out weekly for a total of eight.",
    "UK viewers will be able to watch this one on Disney Plus – but you'll have to wait almost an entire month to see it, for whatever reason. Dopesick lands on Disney Plus UK on November 12.",
    "Now streaming on Hulu",
    "From that category of Disney Plus originals that don't have Marvel or Star Wars attached to them, Just Beyond is an eight-episode anthology show based on the works of RL Stine – who, you might remember, was also behind the source material that gave us the not-very-scary Fear Street movies on Netflix earlier this year.",
    "Disney Plus promises \"witches, aliens, ghosts and parallel universes\" are among the themes across this season, with a different cast of characters each week. All eight episodes are streaming now, and it's produced by The Lego Batman Movie screenwriter Seth Grahame-Smith. It should offer gentle Halloween content that's family-friendly.",
    "Now streaming on Disney Plus",
    "It's hard to get a grasp of exactly what this animated Aquaman offering on HBO Max is from the trailer, which describes it as a 'special event' (it's a three-part miniseries). It very much looks in the vein of recent Cartoon Network shows, and begins with Aquaman facing his first day as king.",
    "Other elements you might remember from the 2018 movie make the cut, too, including the appearance of characters like Vulco and Mera, along with half-brother Orm. The 2D animation looks nice, even if fans seem split on the tone of King of the Atlantis based on the 4,000+ YouTube downvotes on the trailer above. Director James Wan is among the show's executive producers.",
    "Now streaming on HBO Max"
  ],
  "headers": {
    "3": "You season 3 (Netflix)",
    "7": "Succession season 3 (HBO Max/NOW)",
    "11": "Halloween Kills (Peacock)",
    "15": "I Know What You Did Last Summer (Amazon Prime Video)",
    "19": "Dopesick (Hulu)",
    "23": "Just Beyond (Disney Plus)",
    "26": "Aquaman: King of Atlantis (HBO Max)"
  },
  "links": {
    "Squid Game": "https://www.techradar.com/news/squid-game-ending-explained-what-happens-next",
    "No Time To Die": "https://www.techradar.com/news/no-time-to-die-is-a-fitting-end-for-daniel-craigs-bond-but-its-no-skyfall",
    "DC FanDome 2021": "https://www.techradar.com/news/dc-fandome-2021-how-to-watch-date-time-star-guests-and-more",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}