{
  "source": "https://www.techradar.com/news/how-to-watch-the-suicide-squad-online-stream",
  "title": "How to watch The Suicide Squad: stream new DC movie online now",
  "category": "entertainment",
  "updated": "2021-08-09T16:16:28Z",
  "author": "daniel-pateman",
  "summary": "The Suicide Squad is back for a search-and-destroy mission",
  "article": [
    "While the first Suicide Squad movie may have gone down like a lead balloon with critiques, DC's band of dangerous supervillains are back to take another hack at it with Guardians of the Galaxy director James Gunn taking up the helm. Setting off on another mission, here's how to watch The Suicide Squad online as Harley Quinn, Bloodsport, Peacemaker, and King Shark return to the big screen.",
    "Not quite a sequel or a complete reboot, Gunn’s R-rated Suicide Squad features only a few characters from the first movie.",
    "These include Margot Robbie’s delightfully deranged Harley Quinn, Aussie thief Captain Boomerang, and his cooly manipulative superior Amanda Waller (multi-award-winner Viola Davis). Along with new recruit Bloodsport (Idris Elba), they’re tasked with locating a Nazi-era prison and destroying any trace of the enigmatically named Project Starfish.",
    "Taking inspiration from John Ostrander’s 1980s Suicide Squad comics and war movies like The Dirty Dozen, the film is a celebration of “loser, B-grade supervillains” who appal and amuse in equal measure here. There’s John Cena’s Peacemaker, a “douche-y, bro-y Captain America”; King Shark, a fish-human hybrid voiced by Sylvester Stallone; Polka-Dot Man, Ratcatcher 2…not to mention Starro, an intergalactic echinoderm and the film’s big-bad.",
    "Combining Gunn’s penchant for satirical splatter and Marvel-level spectacle, the 11th movie in the DCEU is #SquadGoals: outrageously funny, hugely entertaining, and wildly irreverent. Just read on and we’ll detail how to watch The Suicide Squad online with HBO Max and beyond now.",
    "The good news is that many theaters are open again, so The Suicide Squad is coming blazing to the big screen. It received a July 30 release in the UK, where lucky Brits are currently enjoying its R-rated superhero shenanigans, while Australians were able to see it in cinemas from August 5 and Canadians a day later on August 6.",
    "Right now there’s no confirmation whether The Suicide Squad has been procured by any of the major VOD platforms in these territories. However, many of the 2021 Warner Brothers films released on HBO Max – like The Conjuring: The Devil Made Me Do It – have been made available internationally to rent as PVOD (premium video on demand) titles, on services like Amazon Prime Video, Apple iTunes, and Google Play Store. While we don’t know for certain yet, it’ll be worth checking these websites to see if that holds true for The Suicide Squad.",
    "We've been waiting a long time to see a much-needed reboot of the 2016 version, and having James Gunn attached - after the magic he wove on the Marvel side of things with the Guardians of the Galaxy - really whetted the appetite of movies fans the world over.",
    "And our reviewer largely liked the \"refreshingly ridiculous\" new version:",
    "\"It’ll come as no surprise, then, to learn that Gunn’s The Suicide Squad is anything but boring, borrowing the best parts of its obvious inspirations to form an unashamedly ridiculous antihero adventure which is as unexpected as it is hilarious.\"",
    "But although you can clearly expect an enjoyable couple of hours - whether that be at a home cinema or theater - the verdict does come with its reservations: \"But The Suicide Squad also falters under the weight of its own personality, trading a relentless commitment to style and humor for the streamlined storytelling and emotional impact that have made its comic book contemporaries so popular.\"",
    "To read more of our thoughts, check out TechRadar's full review of The Suicide Squad.",
    "As well as instant access to new Warner Bros. blockbusters – dystopian sci-fi Reminiscence arrives on August 20 – you get over 10,000 hours of prime content, including choice picks from the Warner Bros archive and subsidiary companies like New Line Cinema, Studio Ghibli’s animated masterpieces. There's also other DC Entertainment blockbusters like Wonder Woman: 1984.",
    "Plus, and the clue's in the name, you'll be able to watch every iconic HBO series ever made. Watch The Sopranos, Euphoria, The Wire and Westworld, plus all 10 seasons of iconic sitcom Friends, HBO Max Originals and much more."
  ],
  "headers": {
    "5": "How to watch The Suicide Squad across the rest of the world",
    "7": "Is The Suicide Squad any good?",
    "12": "What else can I watch on HBO Max?"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "The Conjuring: The Devil Made Me Do It": "https://www.techradar.com/news/how-to-watch-the-conjuring-the-devil-made-me-do-it-online-stream-the-conjuring-3-where-you-are",
    "review of The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "Reminiscence arrives on August 20": "https://www.techradar.com/news/hbo-maxs-next-big-sci-fi-movie-from-the-westworld-creators-looks-pretty-cool",
    "Wonder Woman: 1984": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-6747750625893402000&url=https%3A%2F%2Fwww.hbomax.com%2Ffeature%2Furn%3Ahbo%3Afeature%3AGX9KHPw1OIMPCJgEAAAAD%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-watch-the-suicide-squad-online-stream",
    "Watch The Sopranos": "https://www.techradar.com/news/how-to-watch-the-sopranos-online-stream"
  }
}