{
  "source": "https://www.techradar.com/news/custom-nvidia-rtx-3080-ti-card-listings-suggest-official-launch-is-imminent",
  "title": "Custom Nvidia RTX 3080 Ti card listings suggest official launch is imminent",
  "category": "computing",
  "updated": "2021-05-03T16:24:25Z",
  "author": "carly-page",
  "summary": "Ampere GPU could arrive in just 10 days' time",
  "article": [
    "A number of custom Nvidia RTX 3080 Ti graphics cards have shown up online, suggesting the flagship Ampere GPU is on track for an imminent release.",
    "As reported by Videocardz, a handful of retailers based in Australia and New Zealand have listed a number of aftermarket RTX 3080 Ti GPUs, including the MSI Ventus and Gigabyte Gaming, Vision, and Eagle series graphics cards.",
    "According to the listings, which come courtesy of Aquilatechnology and ComputersPerth, custom RTX 3080 Ti cards look set to retail for between $1,338 and $2,257.",
    "The MSI RTX 3080 Ti Ventus, for example, has been listed at the former with a price of NZ$2,543 (around $1,820), while a Gigabyte Gaming OC model has a nice of NZ$3,153 NZD ($2,257).",
    "Similarly, the latter is listing two custom RTX 3080 Ti cards from Gigabyte - the Eagle and Vision - with a price of $1,733 AUD (around $1,338).",
    "Those are unlikely to be the only custom RTX 3080 Ti cards to launch, as VideoCardz got its hands on images of the so-called MSI GeForce RTX 3080 Ti Ventus 3X.",
    "All of the third-party RTX 3080 Ti listings suggest that an official launch could be imminent. Aquilatech suggests the first shipment of RTX 3080 Ti cards will take place on May 13th - just 10 days from now, while ComputersPerth's placeholder suggests the first stock will arrive in ‘late May’.",
    "According to previous rumors, the Nvidia RTX 3080 Ti may be launched on May 18, before it goes on sale just over a week after that on May 26. It remains to be seen whether pre-orders will begin ahead of the GPU's official debut.",
    "With a launch likely just weeks away, we'll finally get confirmation on the specs of the RTX 3080 Ti. Rumors seem pretty confident that the graphics card will have 10,240 CUDA cores, 12GB of GDDR6X VRAM and a 384-bit memory bus.",
    "Via: Wccftech"
  ],
  "headers": {},
  "links": {
    "Nvidia RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "Videocardz": "https://videocardz.com/newz/gigabyte-and-msi-geforce-rtx-3080-ti-custom-cards-listed-by-new-zeland-and-australian-retailers",
    "Aquilatechnology": "https://www.aquilatech.co.nz/productDetail.asp?idProduct=5199091",
    "ComputersPerth": "https://computersperth.com/product/nda-late-may-gigabyte-nvidia-geforce-rtx-3080-ti-eagle-12g-video-card-gv-n308teagle-12gd/",
    "VideoCardz": "https://videocardz.com/newz/msi-geforce-rtx-3080-ti-suprim-x-pictured?",
    "previous rumors": "https://www.notebookcheck.net/NVIDIA-may-unveil-the-GeForce-RTX-3080-Ti-over-a-week-before-its-May-26-release-date.535730.0.html",
    "Wccftech": "https://wccftech.com/nvidia-geforce-rtx-3080-ti-custom-models-from-gigabyte-msi-listed-online/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Wccftechcom+%28WCCFtech.com%29"
  }
}