{
  "source": "https://www.techradar.com/news/brooks-launches-astronaut-inspired-running-shoe-with-nitrogen-foam",
  "title": "Brooks launches astronaut-inspired running shoe with nitrogen foam",
  "category": "fitness",
  "updated": "2021-05-10T14:01:32Z",
  "author": "cat-ellis",
  "summary": "The Aurora-BL also has a decoupled sole for improved roll",
  "article": [
    "Brooks has launched a new limited-edition running shoe inspired by spacesuits, with a decoupled sole for improved roll, nitrogen-injected foam for lightweight cushioning, and a translucent upper just because it looks cool.",
    "The Brooks Aurora-BL was created in the company’s Blue Line Lab – an ‘innovation accelerator setup’ - essentially a part of the company that works on new materials and designs, and brings them to runners’ feet as soon as possible. It’s on sale now, in men’s and women’s sizes, but only 25,000 pairs will be produced.",
    "Decoupled soles aren’t unheard of in running shoes (the Reebok Sole Fury is another example), but they are unusual. The Aurora-BL is a neutral shoe designed for ‘low-deviation’ runners, and Brooks has paid particular attention to the roll of the Aurora-BL, and the decoupling allowed its designers to focus on each part individually.",
    "As senior manager at Brooks Blue Line Nikhail Jain explained to TechRadar, the Aurora-BL is the first shoe with this specific type of foam, and its first road shoe to use nitrogen-injection tech for soft, light cushioning. Some of the company’s other models have DNA Flash foam, which is also nitrogen-injected, but these are intended more for trail use while the BlueLine is strictly a road shoe",
    "Although the Aurora-BL is a limited edition, Jain says the company is learning how to manufacture similar designs at much larger scales, so keep an eye out for similar tech in its mainstream lines soon.",
    "The translucent monomesh and decoupled sole could prove polarizing, and they’ll definitely get you noticed. The shoe will cost $200 (about £140 / AU$250) through Brooks Running, and from a selected handful of third-party retailers.",
    "We’ll be testing the Aurora-BL soon, and will bring you a full review very soon. Stick with TechRadar to learn more."
  ],
  "headers": {
    "3": "Lift off"
  },
  "links": {
    "running shoe": "https://www.techradar.com/best/best-running-shoes",
    "Blue Line Lab": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1011926827224662700&xs=1&url=https%3A%2F%2Fwww.brooksrunning.com%2Fen_us%2Fblueline%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fbrooks-launches-astronaut-inspired-running-shoe-with-nitrogen-foam"
  }
}