{
  "source": "https://www.techradar.com/news/oculus-quest-will-work-with-steam-deck-for-vr-on-the-go",
  "title": "Oculus Quest will work with Steam Deck for VR on the go",
  "category": "gaming",
  "updated": "2021-07-29T11:55:06Z",
  "author": "axel-metz",
  "summary": "Strength in compatibility",
  "article": [
    "Valve CEO Gabe Newell has confirmed that the Steam Deck will be compatible with external gaming devices and software – meaning it’ll work with systems like the Oculus Quest.",
    "The Nintendo Switch-like portable PC, which is set to arrive in December, will allow players to pair hardware and download software from rival companies in an effort to preserve the “openness” of the PC ecosystem, Newell confirmed in an interview with IGN.",
    "That means that, as well as VR headsets like the Quest and Quest 2, Steam Deck owners will be at liberty to install software such as the Epic Games Store, too. “If there’s hardware I want to attach or software I want to install, I can just go and do it,” Newell reiterated.",
    "That doesn’t suggest mixing up the Steam Deck software is explicitly encouraged, mind, but it does mean the option is open to players wishing to experiment with different hardware and operating systems, as they might otherwise do with a conventional PC.",
    "For instance, connecting a Quest headset to the Steam Deck probably won’t yield great performance – high-end titles like Half-Life: Alyx may not be able to run at all – but Valve won’t stop you from trying out a portable PC VR experience via USB or AirLink.",
    "It’s worth noting that senior Valve developer Pierre-Loup Griffais already confirmed that the Steam Deck is an “open PC” that can “connect with any hardware” at the device's recent announcement, but this marks the first time explicit reference has been made to devices like the Oculus Quest.",
    "The Steam Deck’s flexibility is perhaps its biggest advantage over its most obvious competitors, the Nintendo Switch and Switch OLED.",
    "Not only is the Steam Store itself a larger and notoriously better-value marketplace for gaming discounts and deals than the Nintendo Switch eShop, but the ability to attach any number of peripherals to the Steam Deck gives far greater versatility to Valve’s handheld offering.",
    "Owners will be able to install a brand-new OS, browse the web, pair external devices and dock their Steam Deck to allow for TV or monitor gaming. The Switch only allows for the latter, and so while the Steam Deck might be the pricier console at the point of purchase (the entry-level model costs $100 / £70 more than the Switch), owners will have far greater options at their disposal – both now and in the future.",
    "We’ll have to wait until we get our hands on the Steam Deck to confirm just how much flexibility Valve’s portable PC boasts at launch, but we’re excited to see what owners are able to do with a device that looks set to shake up the PC gaming space for good.",
    "Via Upload VR"
  ],
  "headers": {
    "6": "Analysis: victory in versatility?"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "IGN": "https://www.ign.com/videos/gabe-newell-talks-steam-decks-origin-goals-and-future",
    "Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Half-Life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "already confirmed": "https://uploadvr.com/valve-steam-deck-vr/",
    "Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Upload VR": "https://uploadvr.com/gabe-newell-oculus-quest-steam-deck/"
  }
}