{
  "source": "https://www.techradar.com/news/apple-music-on-ps5-is-great-if-youre-bored-of-spotify-but-its-best-feature-is-missing",
  "title": "Apple Music on PS5 is great if you're bored of Spotify – but its best feature is missing",
  "category": "audio-visual",
  "updated": "2021-10-28T10:16:39Z",
  "author": "olivia-tambini",
  "summary": "Apple Music has landed on the PS5, but it's a bit of a disappointment",
  "article": [
    "Apple Music has arrived on the PS5, making it the first console to support the company's music streaming service. For the past six years, PlayStation users have been limited to Spotify if they wanted to choose their own music to soundtrack their gaming session.",
    "Before or during a game, you can now launch the Apple Music app by pressing the PS button on your controller to access the Control Center and selecting the Music Function card.",
    "You can then find recommended songs for the game you're currently playing, choose from your own personal playlists or one of Apple Music's curated playlists, tune in to Apple Music Radio, or browse the streaming service's catalogue of over 90 million songs.",
    "You'll also be able to watch music videos in 4K in the Apple Music app – and if you navigate outside of the app, the music will keep playing.",
    "However, while it's great to finally see an alternative to Spotify on the PlayStation 5, it doesn't look like there's any support for Apple Music's standout feature: Spatial Audio.",
    "Twitter users who are otherwise excited for the streaming service to come to the PS5 have expressed their disappointment at the omission:",
    "Apple’s Spatial Audio technology takes 5.1, 7.1 and Dolby Atmos content and applies directional audio filters, placing sound in a 3D sphere. This makes it feel more immersive, as if the audio is coming at you from every angle.",
    "We've reached out to Apple and Sony to ask why Spatial Audio isn't supported on the PS5 – but we can hazard a few guesses in the meantime.",
    "For starters, the PS5 doesn't actually support Dolby Atmos streaming – something that was thought to be a result of an exclusivity deal between Dolby and Microsoft for the Xbox Series X/S, though both parties refuted those claims.",
    "Instead, the PS5 relies on Sony's proprietary Tempest 3D Audio engine, which isn't compatible with Atmos or DTS:X – though the PS5 will output Atmos-encoded audio from Blu-ray discs.",
    "Another reason why Apple Music may not support Spatial Audio on the PS5 is the console's limited Bluetooth support.",
    "To enjoy Spatial Audio, you need a pair of AirPods 3, AirPods Pro, AirPods Max, or a pair of compatible Beats headphones like the Beats Studio Buds – these headphones and wireless earbuds contain gyroscopes and accelerometers that track the orientation of your head and ensure the different elements of a track are positioned appropriately.",
    "To use wireless headphones with the PS5, you need to hook up a Bluetooth adaptor – so, you'll need to fork out for one of those, as well as a pair of compatible Apple or Beats headphones.",
    "Perhaps Sony felt that these were too many hurdles for its users to jump through in order to use Spatial Audio in Apple Music. After all, its 3D Audio engine works with any headphones, as well as via your TV speakers, a 2.1, 5.1, or 7.1-channel speaker setup.",
    "Still, the lack of Spatial Audio support probably won't do Apple Music any favors if it's hoping to lure PS5 users that have typically used Spotify for music streaming – in our opinion, Spotify still has a superior search engine and better playlist curation than Apple.",
    "As for other consoles, it doesn't look like Apple Music is coming to the PS4. There's also no word yet on whether the Xbox Series X/S will get Apple Music support soon – but as the consoles support Apple TV Plus, we wouldn't be surprised if it arrives in the future, and with proper Spatial Audio support."
  ],
  "headers": {
    "4": "What happened to Spatial Audio?"
  },
  "links": {
    "Apple Music has arrived on the PS5": "https://www.techradar.com/news/playstation-5-is-the-first-console-to-integrate-apple-music",
    "music streaming service": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Apple Music Radio": "https://www.techradar.com/news/apple-music-tv-harks-back-to-mtv-with-24-hour-free-music-videos",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "exclusivity deal between Dolby and Microsoft": "https://www.techradar.com/news/ps5-might-get-dolby-atmos-and-dolby-vision-support-after-all-heres-why",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Tempest 3D Audio engine": "https://www.techradar.com/news/ps5-3d-audio-is-being-unleashed-on-gaming-tvs-but-will-it-matter",
    "Blu-ray": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Beats headphones": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753",
    "Beats Studio Buds": "https://www.techradar.com/reviews/beats-studio-buds-review",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus"
  }
}