{
  "source": "https://www.techradar.com/news/cheap-amd-gpus-could-finally-arrive-from-january-2022",
  "title": "Cheap AMD GPUs could finally arrive from January 2022",
  "category": "gaming",
  "updated": "2021-12-05T22:31:45Z",
  "author": "darren-allan",
  "summary": "RX 6500 XT to hit shelves mid-January, with the RX 6400 to follow in March",
  "article": [
    "AMD is rumored to have a pair of wallet-friendly graphics cards in the pipeline, and the latest speculation has floated release dates for the RX 6500 XT and RX 6400 GPUs, with the former purportedly arriving as soon as January.",
    "This comes from Chinese forum Bilibili – far from the most reliable source in general, but according to VideoCardz, which flagged the post, the leaker has a ‘good’ track record. They believe the RX 6500 XT will go on-sale in mid-January, with the cheaper RX 6400 to follow in March.",
    "The leaker further notes that the VRAM loadout for both of these AMD graphics cards will be 4GB, and the RX 6400 won’t need hooking up to your PSU.",
    "Earlier speculation holds that both products will use the Navi 24 GPU, with the RX 6500 XT bristling with the full 1,024 stream processors (SPs or cores), whereas the RX 6400 will be cut-down to 768 SPs.",
    "We’ve heard about these cards before, except the rumor mill had pinned them both with a vaguer Q1 release date. It’s good to hear much more specific timeframes now, but of course bear in mind that this is just what the grapevine is theorizing, and nothing more.",
    "Even with the limitation of only 4GB of memory, these budget cards should still be okay for 1080p gaming with moderate detail levels (though as ever, exact performance will very much depend on the specific game, and things like the current state of GPU drivers and other ways the wind might be blowing).",
    "More attractive budget options for GPUs will be most welcome, naturally, particularly given that this has been a missing piece of the puzzle on both AMD and Nvidia fronts for current-gen offerings. And speaking of Team Green, as we underlined yesterday, Nvidia also has an RTX 3050 desktop variant supposedly due for Q2, so possibly April 2022 (and it might run with a chunkier 8GB of VRAM).",
    "If correct, this would follow close on the heels of AMD’s cheap GPU launches, reshaping the affordable graphics card landscape to be considerably more attractive than it is right now.",
    "The other big question mark, though, is availability given the knowledge that Nvidia’s CEO has made it clear that stock problems are not going away throughout 2022. AMD has made some slightly more optimistic noises around the badly skewed supply and demand balance for GPUs, but still doesn’t expect any real recovery until later in 2022.",
    "Which leaves us with a vague picture of a decent stream of new affordably pitched graphics cards – at least with recommended pricing – arriving early-ish next year, and worries about how much those budget prices might be inflated by scarcity and scalping.",
    "You might also want to check out the best cheap graphics cards."
  ],
  "headers": {
    "4": "Analysis: Budget cards aplenty, maybe – but stock permitting"
  },
  "links": {
    "AMD": "https://www.techradar.com/news/amd-big-navi",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "VideoCardz": "https://videocardz.com/newz/amd-radeon-rx-6500xt-coming-mid-january-2022-rx-6400-in-march",
    "as we underlined yesterday": "https://www.techradar.com/news/were-finally-getting-some-cheap-graphics-cards-next-year",
    "RTX 3050 desktop variant": "https://www.techradar.com/news/nvidia-geforce-rtx-3050-release-date-price-and-mobile-version-what-do-we-know",
    "so possibly April 2022": "https://www.techradar.com/news/nvidia-rtx-3050-could-arrive-in-q2-2022-for-more-budget-gpu-options",
    "Nvidia’s CEO has made it clear": "https://www.techradar.com/news/nvidia-ceo-says-theres-no-magic-cure-for-gpu-shortage-thatll-last-until-2023",
    "doesn’t expect any real recovery until later in 2022": "https://www.techradar.com/news/amd-ceo-lisa-su-warns-the-chip-shortage-wont-end-any-time-soon",
    "best cheap graphics cards": "https://www.techradar.com/news/best-cheap-graphics-cards-2020-the-top-graphics-cards-on-a-budget"
  }
}