{
  "source": "https://www.techradar.com/news/what-will-nintendo-do-after-the-switch-oled-we-asked-a-magic-8-ball-to-find-out",
  "title": "What will Nintendo do after the Switch OLED? We asked a Magic 8-Ball to find out",
  "category": "gaming",
  "updated": "2021-07-19T07:37:29Z",
  "author": "adam-vjestica",
  "summary": "It’s best to expect the unexpected when it comes to Nintendo",
  "article": [
    "After Nintendo threw its latest curveball at the world with the surprise announcement of the Nintendo Switch OLED, sometimes it feels almost impossible to predict what the Kyoto-based company will do next. Multiple reports pointed towards the reveal of a Nintendo Switch Pro, one that would bring the console’s games into the world of 4K for the very first time, But as we should have expected by now, this wasn’t the case.",
    "Nintendo had its own ideas for the next Nintendo Switch model, and rather than address genuine problems like Joy-Con drift, improve the console’s graphical performance and increase battery life, we were instead presented with a modest upgrade of the original Switch.",
    "While it’s Nintendo’s sheer unpredictability that makes the company so special as a platform holder, it can also lead to untold frustration when the “Big N” stubbornly refuses to do what can often seem like the obvious thing. Sometimes its blue ocean strategy can lead to unprecedented success, like with the Wii. While at other times, we can’t help but wish Nintendo would take the easy option.",
    "So figuring out which direction Nintendo will go next isn’t easy. That’s why we put our most pressing questions to a Magic 8-Ball, a fountain of knowledge and someone who will always provide a “yes or no” answer. The outcomes are just as obscure (and hilarious) as you might expect.",
    "Magic 8-Ball says: Most Likely",
    "We couldn’t be happier with this answer. The recently announced Nintendo Switch OLED model was not the 4K Nintendo console we let ourselves believe was out there, but it sounds like the Nintendo Switch Pro might still be on its way.",
    "Unfortunately the wise Magic 8-Ball has kept us in the dark about what specs we could expect from the Nintendo Switch Pro. Many suspect the handheld will sport a full-HD OLED display, with the Switch Pro able to produce a 4K image while docked. It would likely have a more powerful processor too, and could even use Nvidia DLSS-like technology to boost its framerate. We’ll just have to wait and see.",
    "Magic 8-Ball says: Very doubtful",
    "Well, this has thrown us a bit. The Nintendo Switch has been widely successful because of its adaptability of being a home console and a portable system in one. But could Nintendo return to having a dedicated device that sits underneath your television? We’ve seen Nintendo release the Nintendo Switch Lite to address those who only play handheld, and the Nintendo Switch OLED doesn’t do anything to improve the experience when playing in TV mode – much to the annoyance of many – so maybe the idea of Nintendo creating a dedicated home console again isn’t as far fetched as it first seemed.",
    "Magic 8-Ball says: Don’t count on it",
    "This is probably one we could have answered on our own. While the Nintendo Switch has experienced incredible popularity since its launch, there are actually a couple of Nintendo consoles ahead of it in terms of sales right now. There’s the Wii at roughly 101 million units sold, the beloved home console that introduced us all to motion controls (and terrible plastic peripherals), and above that we have the Nintendo DS (and its family of handheld offspring) at 154 million units sold.",
    "If the Nintendo Switch wants to take the top spot it’ll need to roughly double its current sales figures (currently at 84.59 million units). The Magic 8-Ball doesn’t believe the hybrid console can do it, and we’d be inclined to agree.",
    "Magic 8-Ball says: As I see it, yes",
    "Honestly, we’re surprised this hasn’t happened already. As it stands, the only Switch that comes with a dedicated D-Pad is the Nintendo Switch Lite, and that really shouldn’t be the case. While we understand why Nintendo adopts face buttons for the directional pad on the left Joy-Con, there’s no excuse why consumers haven’t been offered a standalone controller that comes with a D-Pad. For a company that creates so many superb platformers, it would be nice to have this option on the regular Switch and Switch OLED.",
    "Magic 8-Ball says: Better not tell you now",
    "Playing coy with us, Magic 8-Ball? We understand - leaks always ruin the rush that comes with a surprise announcement, and for fans of F-Zero a new game reveal would be a moment they don’t want spoiled. F-Zero: Climax, a Japanese exclusive, was the last game in the series to be released (it came out in 2004). 17 years later and we haven’t yet had any sign that a new F-Zero will be released, with the series only making cameo appearances in the Mario Kart and Super Smash Bros. games.",
    "Magic 8-Ball says: Outlook good We really hope the Magic 8-Ball is right on this one. It’s been an exorbitant amount of time since we last had a new Mario Kart entry, and considering that Mario Kart 8 Deluxe was a spruced up version of the Wii U game, Mario Kart 9 feels long overdue. It’s not like we really need more powerful hardware, either, as Mario Kart 8 Deluxe still looks glorious running on the Switch, but new tracks, characters and a fresh new gimmick would be really appreciated.",
    "Magic 8-Ball says: Most likely",
    "Many of you out there love to hate the Wii U, but the Magic 8-Ball has spoken. We always knew the console was misunderstood, and it’s nice to finally have our feelings vindicated.",
    "The Wii U GamePad was an incredible controller, as the dual-screen experience was unlike anything a home console has ever offered before or since. And who can forget the games themselves? The Wii U’s games were all so brilliant that many of them have now been remastered for the Switch so that fans don’t miss out on their excellence. Writing this just makes us want to dig out that dusty console and give it another play.",
    "Magic 8-Ball says: Yes",
    "With the Magic 8-Ball delivering a clear and unwavering answer, we’re confident that Nintendo will announce Zelda as a playable in Breath of the Wild 2, something which fans have been asking for. It’s great to finally have confirmation after many months of speculation, and the decision makes sense. It is her legend after all, and being able to choose another character over the famously mute Link would only help make the game more appealing.",
    "Magic 8-Ball says: You may rely on it",
    "Interesting, Magic 8-Ball, very interesting. Wii Sports was able to plant itself in the top spot because it came packaged with nearly every Wii console ever sold. That means it had a staggeringly high adoption rate that Nintendo hasn’t been able to match since. We’re going to guess the Magic 8-Ball’s declaration means Nintendo will one day include a game with its consoles again. When that time comes, it also sounds like it’ll have created an incredibly popular console; let’s just hope the pack-in game is good.",
    "Magic 8-Ball says: Very doubtful",
    "Ok, maybe this was an easier prediction than we thought. Yes, it’s extremely unlikely that Nintendo will ever merge with either Microsoft or Sony – though during the dark days of the Wii U, many believed this would be in the best interests of Nintendo moving forward. And while the idea of having Nintendo’s often impeccable software on either the Xbox Series X or PS5 is certainly appealing, it’s important to remember that the reason Nintendo’s first-party output excels, is because they’re designed around the hardware the company creates.",
    "Magic 8-Ball says: Yes",
    "You heard it here first folks, the Magic 8-Ball has spoken and its words are clear. For many of us this is excellent news, though we will hold a moment of silence for all the dreams that have just been crushed by this proclamation.",
    "The game’s director, Masahiro Sakurai, has confirmed multiple times that the next DLC fighter will be Smash Ultimate’s last. If you were hoping for a character other than Waluigi, we’re sorry to say they won’t be joining the battle this time. But hey, at least the character won’t be another sword fighter.",
    "Magic 8-Ball says: My sources say no",
    "To be honest, we should have expected this... and we’re not sure what sort of compensation would even make up for the pain we felt all those years ago. The blow of losing a Mewtwo in a freak transfer cable accident still hurts, but at least we finally have some closure on this traumatic event. Thanks, Magic 8-Ball, we can now start to heal.",
    "Magic 8-Ball says: As I see it, yes",
    "Sorry Tingle, but looks like you’ve Kooloo’d your last Limpah. Get outta Zelda ya’ strange man; the Magic 8-Ball has spoken."
  ],
  "headers": {
    "4": "Magic 8-Ball… will Nintendo make a Nintendo Switch Pro?",
    "7": "Magnificent Magic 8-Ball... will the next Nintendo console be portable?",
    "9": "Oh wise, Magic 8-Ball... will the Nintendo Switch become Nintendo’s best selling console of all time?",
    "12": "Here’s an easy one, Magic 8-Ball… will we ever get a Joy-Con controller with a D-Pad?",
    "14": "Magic 8-Ball… F-Zero is coming back one day, right?",
    "16": "Let’s be real, Magic 8-Ball… will we ever get Mario Kart 9 on Nintendo Switch?",
    "17": "You know it, I know it…. was the Wii U just terribly misunderstood, Magic 8-Ball?",
    "20": "Yes or no, Magic 8-Ball… will Zelda be a playable character in The Legend of Zelda: Breath of the Wild 2?",
    "22": "In your opinion, Magic 8-Ball… will Nintendo ever make a game that sells more copies than Wii Sports?",
    "24": "Even you won’t be able to predict this one, Magic 8-Ball… but will Nintendo ever merge with Microsoft or Sony?",
    "26": "Merciful Magic 8-Ball... will Waluigi ever come to Super Smash Bros. Ultimate?",
    "29": "Tell us this, Magic 8-Ball. We lost our Mewtwo when transferring it to a friend’s Game Boy back in 1999… will Nintendo compensate us for this tragic loss?",
    "31": "Last one, Magic 8-Ball… do you hate Tingle from The Legend of Zelda: Majora’s Mask as much as we do?"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Joy-Con drift": "https://www.techradar.com/news/someone-might-have-finally-fixed-nintendo-switch-joy-con-drift-using-a-piece-of-paper",
    "Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Wii": "https://www.techradar.com/news/gaming/consoles/how-the-nintendo-wii-won-the-console-war-1197348",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nintendo DS": "https://www.techradar.com/best/best-nintendo-ds-games-all-the-ds-titles-worth-revisiting",
    "Super Smash Bros": "https://www.techradar.com/news/super-smash-bros-ultimate-review",
    "Mario Kart 8 Deluxe": "https://www.techradar.com/how-to/mario-kart-8-deluxe-tips-and-tricks",
    "Wii U": "https://www.techradar.com/news/best-wii-u-games",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Wii Sports": "https://www.techradar.com/news/gaming/wii-sports-is-biggest-selling-game-ever-498084",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}