{
  "source": "https://www.techradar.com/news/the-latest-chromecast-update-just-made-it-the-perfect-black-friday-streaming-stick",
  "title": "The latest Chromecast update just made it the perfect Black Friday streaming stick",
  "category": "televisions",
  "updated": "2021-11-18T20:35:02Z",
  "author": "rhys-wood",
  "summary": "Install Android TV apps easier than ever before",
  "article": [
    "Google's Chromecast device just got a major quality-of-life update that could make it the perfect Black Friday streaming stick purchase. The update allows you to install Android TV apps from your phone, saving you the need to visit the Google Play Store on your TV.",
    "As reported by Tom's Guide, the new Chromecast feature is currently rolling out to devices worldwide. You'll know you have the update if you head to the Google Play Store on your phone, tap on an app, and spot a little arrow next to the \"Install\" button. This presents a dropdown menu where you can choose to install the app to your Chromecast or Android TV device.",
    "You'll only see these extra options if the app you're viewing is actually compatible with a Chromecast streaming device, so the feature won't work for absolutely everything in the store. However, it should be applicable to most streaming apps, like Netflix, Disney Plus, Prime Video and more.",
    "It seems like such a simple update that we're surprised it's taken this long for Google to allow the installation of Android TV compatible apps via a mobile device. Users have been able to do so from the browser version of the Google Play Store on PC for some time now, but mobile always seemed like a better fit for the option.",
    "One slight drawback, as users on the Android TV subreddit have noted, is that it's currently not possible to push or send apps to other mobile devices with the update. For the time being, it seems like only Android TV compatible devices and Chromecast streaming sticks are supported.",
    "It sounds like such a simple, niche thing, but the ability to push apps to your Chromecast device from your phone is a genuinely brilliant quality-of-life update. Users will simply be able to access the Google Play Store instantaneously, providing they have an Android phone like the brilliant Samsung Galaxy S21 or Google Pixel 6.",
    "From there, downloading apps to Android TV is as simple as selecting your device on the installation dropdown. This will save users tons of time in that they'll no longer need to access the store on Android TV. And let's face it, navigating with your phone is objectively better than a clunky TV remote, even the one included with Chromecast with Google TV.",
    "It's already one of the best streaming devices you can buy, but this new Android TV feature gives Chromecast a solid advantage over competing sticks like the Amazon Fire TV Stick Lite, and it's certainly worth shopping for during the Black Friday and Cyber Monday deals as Chromecast is bound to see some big price drops now that it's been out for a while."
  ],
  "headers": {
    "5": "Opinion: Chromecast gets even better with this update"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "Tom's Guide": "https://www.tomsguide.com/news/chromecast-and-google-tv-just-got-a-big-upgrade-that-will-save-you-time",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Android TV subreddit": "https://www.reddit.com/r/AndroidTV/comments/qtouk3/now_install_play_store_apps_on_android_tv_from?utm_content=title&utm_medium=post_embed&utm_name=b0802798eae54ee8b9ae24ea49142236&utm_source=embedly&utm_term=qtouk3",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "best streaming devices": "https://www.techradar.com/best/streaming-device",
    "Amazon Fire TV Stick Lite": "https://www.techradar.com/reviews/amazon-fire-tv-stick-lite",
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}