{
  "source": "https://www.techradar.com/news/halo-infinite-campaign-spoilers-leak-from-technical-preview",
  "title": "Halo Infinite campaign spoilers have leaked via the technical preview",
  "category": "gaming",
  "updated": "2021-07-31T10:26:04Z",
  "author": "emma-boyle",
  "summary": "Be on your guard",
  "article": [
    "Don't worry, we've kept spoilers out of this article",
    "Spoilers for Halo Infinite’s main campaign are leaking online following the launch of the game’s first technical preview.",
    "343 Industries' Joseph Staten flagged the leak on Twitter, confirming that the team “unintentionally included a small number of Halo Infinite campaign files in the tech preview build” and that “unfortunately, these files contain spoilers.”",
    "Datamined details for the campaign are now popping up in various places online, some even spoiling plot details. This is a spoiler-free zone, so we’re not going to link to any of that here or go into any specifics.",
    "Staten went on to say that “leaks like this are painful for the dev team and can ruin the campaign experience for everyone. So please, keep your eyes peeled for spoilers and don’t spread them if you see them.”",
    "For those who want to keep Halo Infinite unspoiled ahead of its release for the sake of themselves and the game's development team, short of unplugging the internet and going to the Winchester, we’d definitely suggest muting some keywords on social media. We can point you towards our very own guide on how to mute on Twitter for some help with that.",
    "Halo Community Director, Brian Jarrard, replied to Staten to say, “Twitter mute words are your friend” and gave an additional warning through his own Twitter, advising members of the community not to post datamined content to their social media channels as they “run a very real risk of getting a takedown notice, which could result in a strike on certain platforms.”",
    "Halo Infinite’s Bot-focused initial technical preview kicked off on July 29 and will run until August 1. It’s the first of a series of planned tests that will allow the team at 343 Industries to stress test the technical side of the game while garnering some player feedback. Further down the line, 343 Industries has said that flights will “expand into more content including traditional PVP Arena and Big Team Battle.”",
    "At the moment, there aren’t any solid dates on when future tests will launch but anyone that wants to have a chance of taking part will need to be a Halo Insider. Signing up for this is a matter of registering for the program with your gamertag and opting in for communications and flighting. Halo community manager John Junyszek has previously posted a Twitter thread, breaking down the steps to register in detail.",
    "Being an Insider doesn’t guarantee that you’ll be invited to take part in future technical previews or flights but it’s the only way to have a chance. 343 Industries has previously said that its goal “is to eventually get every eligible Halo Insider a chance to go hands-on and help us achieve our goals on the road to launch. Remember, if you don’t get in this time, please don’t despair – more opportunities will come.”",
    "Halo Infinite doesn’t have an exact release date just yet, but it’s slated for the holiday period of 2021 and will launch exclusively on Xbox platforms and PC."
  ],
  "headers": {
    "7": "Stress testing"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "our very own guide on how to mute on Twitter": "https://www.techradar.com/how-to/how-to-mute-people-and-words-on-twitter",
    "replied": "https://twitter.com/ske7ch/status/1421244799600893953?s=20",
    "an additional warning through his own Twitter": "https://twitter.com/ske7ch/status/1421193320366149632?s=20",
    "kicked off on July 29": "https://www.techradar.com/news/halo-infinite-beta-is-finally-up-and-running-and-the-bots-are-hilarious",
    "Halo Insider": "https://www.halowaypoint.com/en-us/community/halo-insider",
    "has previously posted a Twitter thread": "https://twitter.com/Unyshek/status/1415315811233787906?s=20",
    "previously said": "https://www.techradar.com/news/halo-infinites-first-bot-focused-preview-could-happen-as-soon-as-next-weekend"
  }
}