{
  "source": "https://www.techradar.com/news/next-valve-index-vr-headset-may-be-wireless",
  "title": "Next Valve Index VR headset may be wireless",
  "category": "phones",
  "updated": "2021-03-19T15:32:48Z",
  "author": "hamish-hector",
  "summary": "It could even be standalone",
  "article": [
    "Wireless Valve Index VR headsets could be on the way, if a recently granted patent in the US is anything to go by. The document details both a standalone device — like the Oculus Quest 2 — as well as a wireless version that would connect to an external device such as a PC.",
    "There are three designs in total exploring the two ideas, showing that Valve is putting a lot of thought into comfort for future Index headsets. The models aren’t just wireless but include new methods for distributing heat and come with ergonomic features to make adjusting the device more simple.",
    "While the patent likely gives us an insight into what the next Valve Index could look like, we shouldn’t get ahead of ourselves. There’s never a guarantee that patents will be turned into actual products, and the three designs do not mean we’ll get three new Valve Index variants in the near future. But they point to interesting ideas being considered somewhere deep in the Valve labs right now.",
    "With that warning out of the way, let’s forget it for a second and get our hype trains fired up. What are we excited to see in an upcoming Valve VR headset based on these designs?",
    "At the top of our list is of course the wireless aspect. Wires have a habit of getting in the way in VR. There’s that fear you might trip over them and that tethered feeling can reduce your sense of immersion.",
    "The Oculus Quest and Quest 2 thrive as a standalone product so the next Valve Index could too, and a wireless headset could offer the best of both worlds. As evidenced by the Oculus Quest 2, a wireless headset with decent internal specs can not only deliver convincing and immersive mobile VR experiences, but optional high-speed USB-C connections to a PC can then potentially unlock all that a desktop-tethered PC VR experience can offer, too.",
    "Beyond that, while comfort is a big plus, the best detail in the whole document is that a Valve Index 2 could be on the way at all. Given that it was filed back in September 2020, over a year after the Valve Index first launched, the document shows that Valve has spent some time and effort considering its next device. Hopefully, this means one is coming, and with the news that an Oculus Quest 3 and PSVR 2 are both in development, it points to a healthy future for virtual reality fans.",
    "Via Road To VR"
  ],
  "headers": {
    "3": "What are we most excited about?"
  },
  "links": {
    "Valve Index VR headsets": "https://www.techradar.com/reviews/valve-index",
    "patent": "https://www.freepatentsonline.com/20210080996.pdf",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "Road To VR": "https://www.roadtovr.com/valve-index-wireless-standalone-patent-head-mounts/"
  }
}