{
  "source": "https://www.techradar.com/news/rumored-dji-air-2s-could-come-with-surprise-bonus-feature",
  "title": "Rumored DJI Air 2S could come with surprise bonus feature",
  "category": "cameras",
  "updated": "2021-03-31T09:05:46Z",
  "author": "mark-wilson",
  "summary": "Goggles at the ready?",
  "article": [
    "DJI Air 2S rumors have been growing steadily in the past few weeks, with evidence mounting that DJI is working on a successor to the mid-range DJI Mavic Air 2 – and now fresh speculation has suggested it could with an unexpected feature.",
    "We recently saw the arrival of the DJI FPV, which comes with DJI's FPV Goggles V2 – this headset receives a latency-free video feed from the drone, so you can get a bird's eye view from the sky for a pretty thrilling flying experience.",
    "According to a DroneDJ source, it now seems the rumored DJI Air 2S will benefit from the same trick and \"be capable of connecting with the V2 Goggles for First Person View flight\".",
    "This would be something of a surprise for a couple of reasons. Firstly, the move could potentially steal some of the DJI FPV's thunder, even if the DJI Air 2S is likely to be a very different drone that lacks its stablemate's flying speed or aerial acrobatics.",
    "Also, DroneDJ caveated the rumor by saying that a previous, China-based source had said that \"making the Air 2S FPV-capable was not a priority for DJI at the moment\". On balance, though, the site thinks it's more recent source is accurate, and there are a few good reasons to believe this.",
    "There is one simple reason why DJI might make its rumored DJI Air 2S compatible with its latest FPV Goggles – it'd be a simple way to differentiate it from the DJI Mavic Air 2, which remains our number one drone.",
    "Adding new feature to drones without negatively impacting their flight time is very difficult, as every gram counts when it comes to flying cameras. Bringing FPV compatibility to the Air 2S would mainly involve giving it Ocusync 3.0 – and considering the Mavic Air 2's design already includes Ocusync 2.0, that shouldn't be too much of a stretch.",
    "Also, as we found in our DJI FPV review, getting a thrill from the first-person flying experience doesn't rely on kicking it into the more extreme 'Manual' mode – we labelled it \"fun in capital letters\", even when flying it around at more sedate speeds ('Normal' mode is restricted a 33mph top speed) to capture our sample footage).",
    "Even if the DJI Air 2S inherits the Mavic Air 2's top speed of 42.5mph, having the option of an FPV experience would still be very welcome – and would give wider appeal to the DJI FPV Goggles V2, and potentially the new Motion Controller, if these accessories were compatible with the new mid-range drone.",
    "Unfortunately, right now we don't have any indication of exactly when the DJI Air 2S will launch, but we'll bring you all of the official news – including whether or not it is indeed going to have an FPV party trick – as soon as it lands."
  ],
  "headers": {
    "5": "I want my FPV"
  },
  "links": {
    "DJI Mavic Air 2": "https://www.techradar.com/reviews/dji-mavic-air-2-review",
    "DJI FPV": "https://www.techradar.com/reviews/dji-fpv-drone",
    "DroneDJ source": "https://dronedj.com/2021/03/28/djis-coming-air-2s-works-with-v2-goggles-in-fpv-source/",
    "DJI FPV review": "https://www.techradar.com/reviews/dji-fpv-drone"
  }
}