{
  "source": "https://www.techradar.com/news/rtx-3080-in-stock-at-best-buy-soon-track-it",
  "title": "RTX 3080 stock: Best Buy may have it in stock soon – here's how to track it",
  "category": "computing",
  "updated": "2021-07-09T08:27:36Z",
  "author": "matt-swider",
  "summary": "This week marks one month since the Nvidia RTX 3080 stock at Best Buy, and it has consistently offered GPUs on Thursday or Friday. Whether or not it is today, June 9, here's how to know the restock time.",
  "article": [
    "Update: The Nvidia RTX 3080 Founder's Edition was in stock at Best Buy one month ago this week. Here's how to know if it'll there will be RTX 3080 stock later today, July 9. So far this week, we've only seen the MSI RTX 3090 come back in stock briefly at Best Buy.",
    "If you're wondering when to find the RTX 3080 in stock at Best Buy and other retailer stores in the US, then follow our GPU restock Twitter tracker Matt Swider, who will send you an alert when there's an Nvidia graphics card restock – if you follow his account and turn on notifications (the little bell icon).",
    "► When? Where? Follow our GPU restock Twitter tracker Matt Swider for notifications and live updates. It's the fastest way to get real-time updates.",
    "Matt has been tracking GPU restock opportunities – specifically RTX 3080 stock – at Best Buy, Newegg and Antonline, as well as EVGA, Amazon and Walmart, although those have a queue or sell out immediately.",
    "Click on this example of a GPU restock alert that Matt will send on Twitter. Matt does the same with PS5 restock and Nintendo Switch OLED pre-order efforts.",
    "Best Buy has been far from consistent with its product restock efforts, but among its GPU stock, the RTX 3080 is in stock most consistently on a Thursday or occasionally on a Friday. So we'll update our RTX 3080 restock news if and when it happens today, Friday, July 9 since it didn't show up yesterday. Last month, it did restock at 4:15pm EDT, though the Friday GPU restocks have happened at noon EDT before.",
    "It's been exactly one month since the RTX 3080 was available to purchase at Best Buy. That's about the length of time we see right before there's new RTX GPU stock from Best Buy, which is the largest electronics retailer in the US. Microcenter has had the RTX 3080 recently in stores, so there's no good reason why Best Buy shouldn't be able to offer its inventory this week online. But nothing is confirmed.",
    "There's a problem: the Best Buy restock time is never consistent, which is why our GPU restock Twitter tracker has become so popular recently. Instead of you having to check Best Buy all day every Thursday and Friday, we're doing that for you. Of course, this all depends on Best Buy RTX 3080 stock; there's no guarantee it'll be this Friday.",
    "The Best Buy RTX 3080 restock is only one avenue we're checking. We also post daily stock updates for the Nvidia RTX graphics cards when other stores have them in stock.",
    "Newegg Shuffle: This popular PC components store has consistent RTX GPU stock, although it's been several days since it has offered the RTX 3080. Other GPU options have included the RTX 3070 and RTX 3090 for a little above MSRP and often with a bundle (like a monitor, PC case or motherboard). Even though this is a popular product lottery, entering enough times has proven successful for a handful of our followers.",
    "Antonline: Antonline often has RTX graphics cards in stock weekly and pairs them with other components (just like Newegg does). So you'll also be buying a motherboard, case, monitor or something else with it. The difference with Antonline is that it's first-come-first-serve (vs Newegg's lottery), so if you're fast enough, this is the one to watch. You just have to be okay with GPU bundles with tons of extras – everything tends to be at MSRP when you add it up, but the price is steep.",
    "Amazon: This one is at the bottom simply because it's harder to find a GPU restock at Amazon. Whether it's bot scooping up the console before everyone else or a lack of inventory, securing a GPU at Amazon feels next to impossible. That's why our GPU restock tweets tend to focus on Newegg, where it's done by chance, and Best Buy, where it often has two weeks of RTX stock built up and unleashes them all at once. Amazon GPU sales come in drops and drabs."
  ],
  "headers": {
    "5": "RTX 3080 news: Best Buy is overdue for a restock",
    "8": "RTX 3080 stock besides Best Buy for MSRP"
  },
  "links": {
    "GPU restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider.",
    "Follow our GPU restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "Nintendo Switch OLED pre-order": "https://www.techradar.com/deals/nintendo-switch-oled-stock-where-to-buy",
    "GPU restock Twitter tracker": "http://www.twitter.com/mattswider"
  }
}