{
  "source": "https://www.techradar.com/news/no-new-james-bond-casting-until-2022-says-no-time-to-die-producer",
  "title": "No new James Bond casting until 2022, says No Time to Die producer",
  "category": "entertainment",
  "updated": "2021-09-28T10:36:14Z",
  "author": "axel-metz",
  "summary": "'We’re not thinking about it at all'",
  "article": [
    "The search for a new James Bond actor won’t begin until at least 2022, long-time 007 producer Barbara Broccoli has confirmed.",
    "Speaking to BBC Radio 4 ahead of No Time to Die’s international release on September 30, Broccoli stressed that no decision had yet been made on the matter, and talks surrounding Daniel Craig’s successor wouldn’t take place any time before next year.",
    "“We’re not thinking about it at all,” she said. “We want Daniel to have his time of celebration. Next year we’ll start thinking about the future.” She added that Craig has “been such a great Bond. Those are big shoes to fill.”",
    "Broccoli’s comments pour cold water on rumors that a new James Bond casting might be announced ahead of, or just after, No Time to Die’s long-awaited release.",
    "Craig, who took over from Piers Brosnan for 2006’s Casino Royale, has been in the role for 15 years, making him the longest-serving Bond in the history of the franchise (by length of time served, rather than films starred in).",
    "On finding a replacement for Craig, Broccoli said: “I can’t even [think if it’s] possible,” adding that she and her studio, Eon Productions, were “very, very lucky” to persuade the actor to join the franchise.",
    "“We could see he was reluctant to do it, because he knew it would change his life, which it obviously has. It’s changed his life, but it hasn’t changed him,” Broccoli told BBC Radio 4.",
    "“What he’s enabled us to do with the franchise is really explore the emotional life of Bond and go into the person and complexity and conflicts that happen within the Bond character.”",
    "Speculation surrounding Daniel Craig’s replacement has been rife ever since the actor teased his departure from the role after 2015’s Spectre.",
    "In fact, in expectation of renewed furore ahead of No Time to Die’s release, we at TechRadar put together our own list of 10 stars who could take over as Bond, which includes a mix of long-touted names like Tom Hardy and Idris Elba alongside newcomers like Bridgerton’s Regé-Jean Page.",
    "Then there are the larger questions of Bond’s future identity to consider, chiefly whether we might see a 007 of different ethnicity, or even a female incarnation of the character.",
    "The latter doesn’t seem all that likely, though, given Craig’s own thoughts on a woman playing Bond. “There should simply be better parts for women and actors of color,” he said in a recent interview. “Why should a woman play James Bond when there should be a part just as good as James Bond, but for a woman?”",
    "Broccoli seems to share the same sentiment. Back in 2020, the producer said she believes “James Bond can be of any color, but he is male,” adding that “we should be creating new characters for women – strong female characters… I’m not particularly interested in taking a male character and having a woman play it. I think women are far more interesting than that”.",
    "It doesn’t look like we’ll see a female Bond any time soon, then, but there’s little doubt that the search for Craig’s replacement in 2022 will bring with it fresh controversy.",
    "Our guess? The smart money’s on Richard Madden."
  ],
  "headers": {
    "8": "Analysis: who could be the next Bond?"
  },
  "links": {
    "10 stars who could take over as Bond": "https://www.techradar.com/news/the-next-james-bond-10-stars-who-could-replace-daniel-craig",
    "Craig’s own thoughts on a woman playing Bond": "https://www.techradar.com/news/daniel-craig-has-thoughts-on-a-woman-playing-james-bond"
  }
}