{
  "source": "https://www.techradar.com/news/poly-crypto-hacker-pleads-innocence-as-loot-is-returned",
  "title": "Poly crypto hacker pleads innocence as loot is returned",
  "category": "computing",
  "updated": "2021-08-12T09:57:43Z",
  "author": "mayank-sharma",
  "summary": "I did it for fun, not money, hacker claims",
  "article": [
    "In a surprising turn of events, the hacker claiming to be behind the theft of several different cryptocurrencies worth a staggering $600 million has begun returning the loot.",
    "The attacker exploited a “vulnerability between contract calls” in the Poly Network, a decentralized cross-chain protocol and network that helps facilitate swapping tokens across multiple blockchains, to make away with $273 million of Ethereum tokens, $253 million in tokens on Binance Smart Chain and $85 million in USDC on the Polygon network.",
    "But within thirty hours of the heist coming to light, the thief began transferring his ill-gotten cryptos back to Poly Network, and according to the latest update, has returned over $342 million, with transfers still ongoing.",
    "To put the heat on the hacker, Poly Network had posted the thief’s wallet addresses, urging exchanges to blacklist the stolen tokens, even as other members in the decentralized finance (Defi) space offered their assistance.",
    "As he or she was returning the cryptos, the hacker decided to clear the air about his intentions, in the form of a detailed Q&A embedded in the ethereum transactions sent from the hacker’s account, according to Tom Robinson, CEO of blockchain analysis company Elliptic.",
    "The hacker claimed they had always intended to return the funds and took the cryptos in order to expose the vulnerability before it could be exploited by others with malicious intent.",
    "Explaining the reasons behind the slow return the hacker says it is because of the steps they have had to undertake to hide their identity. They say they've taken enough steps, such as using disposable email addresses and untraceable temporary IP addresses, to stay anonymous.",
    "“Whatever the motivation for the hack, these events have demonstrated how difficult it is [to] profit from theft or any other illicit activity using cryptoassets. The transparency of the blockchains allowed crowd-sourced, real-time collaboration between protocol developers, stablecoin issuers, blockchain analytics companies and the wider community, to ensure the hacker would not be able to disappear with the stolen assets,” wrote Robinson in a blog post."
  ],
  "headers": {
    "4": "A whitehat hacker?"
  },
  "links": {
    "worth a staggering $600 million": "https://www.techradar.com/news/crypto-exchange-hack-sees-dollar600m-stolen",
    "blockchains": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "Ethereum": "https://www.techradar.com/news/ethereum-price-steams-past-another-historic-milestone",
    "latest update": "https://twitter.com/PolyNetwork2/status/1425733950614360064",
    "posted": "https://twitter.com/PolyNetwork2/status/1425073987164381196",
    "according to Tom Robinson": "https://twitter.com/tomrobin/status/1425487745166753794",
    "wrote Robinson": "https://www.elliptic.co/blog/the-poly-network-hack-600-million-in-crypto-stolen-and-returned-in-24-hours"
  }
}