{
  "source": "https://www.techradar.com/news/microsoft-edge-is-celebrating-a-major-milestone",
  "title": "Microsoft Edge is celebrating a major milestone",
  "category": "computing",
  "updated": "2021-09-10T12:23:49Z",
  "author": "mike-moore",
  "summary": "1,000 builds have now passed through the Dev and Canary Insider channels",
  "article": [
    "The future of Microsoft Edge looks rosy after the software announced it had passed a landmark figure in terms of development.",
    "The company has revealed its web browser has now seen a thousand builds pass through its Dev and Canary Insider channels.",
    "Each of these builds represents new additions, upgrades or improvements to Microsoft Edge, hopefully making it a smart and more intuitive piece of software for users around the world.",
    "The news was revealed on the Microsoft Edge Dev Twitter account as part of the release of version 95.0.1000.0.",
    "The new edition brings a couple of useful additions for users, including better ways for developers to track the performance of their extensions, and the ability to sign into Partner Center using a personal GitHub account.",
    "Also included in the new build are the ability to sync custom IE mode site lists between devices, improved browser profile sign-in dialog, and a number of bug and error fixes. Users can download Microsoft Edge version 95.0.1000.0 now.",
    "Microsoft Edge has grown steadily in terms of user base and popularity since it was first released in 2015 as the company's replacement for the venerable Internet Explorer browser.",
    "Recent figures showed Edge engaged in a furious battle with rival Mozilla Firefox, with the latter clawing back market share on its main rival, as its 3.55% share is now just behind Edge on 3.57%. However Google Chrome still leads the way with 64.94% of the total market share, with Safari in second place on 18.75%.",
    "This battle could be set to rumble on for some time as Edge is set to play a central role in Windows 11, set for release in October 2021.",
    "Edge, which will ship as the pre-installed browser on the platform, could well see its user numbers rise to greater numbers than ever before, with a major makeover scheduled for the launch of Windows 11, with a redesigned interface bringing it into line with the new software's stripped-back design.",
    "Via OnMSFT"
  ],
  "headers": {
    "3": "Edge landmark"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/how-to/microsoft-edge",
    "web browser": "https://www.techradar.com/best/browser",
    "Microsoft Edge Dev Twitter account": "https://twitter.com/MSEdgeDev/status/1436029079900200985",
    "new edition": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1445049429639180500&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fdiscussions%2Fdev-channel-update-to-95-0-1000-0-is-live%2Fm-p%2F2737379&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-edge-is-celebrating-a-major-milestone",
    "Edge engaged in a furious battle with rival Mozilla Firefox": "https://www.techradar.com/news/has-microsoft-edge-slipped-up-in-the-browser-wars",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "a major makeover": "https://www.techradar.com/news/you-can-give-microsoft-edge-a-windows-11-makeover",
    "OnMSFT": "https://www.onmsft.com/news/microsoft-edge-dev-canary-1000-builds"
  }
}