{
  "source": "https://www.techradar.com/news/salesforce-why-were-truly-hybrid-working-now",
  "title": "Salesforce - why we’re truly hybrid working now",
  "category": "computing",
  "updated": "2021-07-07T14:58:56Z",
  "author": "mike-moore",
  "summary": "New Salesforce UK&I CEO details how the company has coped during the pandemic",
  "article": [
    "The new head of Salesforce in the UK and Ireland has laid out her view on how the company is well-placed to deal with the new world of hybrid working.",
    "Speaking at the company’s Salesforce Live UK & Ireland event, Zahra Bahrololoumi highlighted the work done by the software giant and its many customers across the region over the difficult past 18 months.",
    "“While businesses all over the UK and Ireland have focused on surviving, technology has been evolving,” she noted, “...if we continue to lead by rethinking the possible, we can find new ways to grow as a community.”",
    "Salesforce has been quick to adapt to the hybrid working world, with the company announcing it will allow most of its employees to work from home permanently, even after the pandemic has officially ended.",
    "“We really believe, and we've proven, that we can work and be successful from anywhere, Bahrololoumi noted. “we're working in a hybrid model (and) we're still navigating our way through this...we're going at a huge pace, we're adapting and we're still learning.”",
    "Salesforce has released several major expansions to some of its key products, including a significant recent update to Work.com that supports employee well-being, along with improving and accelerating learning and career growth.",
    "The company also recently launched its Salesforce Anywhere platform, allowing improved online collaboration between workforces looking to adapt to the new way of working. The Salesforce Anywhere app allows users to collaborate with teams, stay productive in their workflow and keep up to date on their customers from anywhere with chat, alerts, comments and video embedded directly into the Salesforce experience.",
    "Bahrololoumi also noted how Salesforce has issued millions in grants to help small businesses across the region, with 2020 seeing 770,000 new small businesses start in the UK and Ireland alone.",
    "She added how most customers Salesforce has spoken to had digital transformation as part of their plans before the pandemic, but these plans have now been accelerated as companies of all sizes aim to evolve and keep track with the competition.",
    "“We didn't anticipate we'd be moving at the pace we are, but here we are,” Bahrololoumi noted.",
    "“The values we lead by have allowed us to be successful,” she concluded, “that's allowed us to be adaptable and work with (our customers)...their success is our success.”"
  ],
  "headers": {
    "3": "Hybrid model"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "update to Work.com": "https://www.techradar.com/news/salesforce-announces-major-workcom-expansion",
    "Salesforce Anywhere": "https://www.techradar.com/news/salesforce-debuts-new-all-in-one-platform-for-the-post-pandemic-world"
  }
}