{
  "source": "https://www.techradar.com/news/spider-man-villain-movie-morbius-isnt-in-the-mcu-its-been-confirmed",
  "title": "Spider-Man villain movie Morbius isn't in the MCU, it's been confirmed",
  "category": "entertainment",
  "updated": "2021-06-16T10:09:34Z",
  "author": "samuel-roberts",
  "summary": "Refuting previous reports",
  "article": [
    "Despite recent news to the contrary, it's been reported that Morbius won't be part of the Marvel Cinematic Universe. Earlier this week, actor Tyrese Gibson told the website Comic Book that the movie is part of the MCU – saying yes twice when asked, including if it's specifically part of the \"Avengers world\".",
    "At the same time, the actor said the movie – which stars Jared Leto as Morbius, a Spider-Man villain – was also being pushed back to October.",
    "The website GameSpot, however, not citing a source, subsequently confirmed the film is still on-course to release on January 28, 2022. At the same time, the outlet said Morbius is not part of the MCU, but rather Sony's own universe – the unfortunately named SPUMC (Sony Pictures Universe of Marvel Characters), just like Venom starring Tom Hardy was.",
    "Why the ambiguity? Well, ever since Morbius' first trailer released, which featured Michael Keaton – who played the Vulture in Spider-Man: Homecoming – fans have been speculating if the two universes are somehow connected. It's never been confirmed who Keaton is playing in the movie, however, and the movie doesn't feature the involvement of Marvel Studios – therefore the possibility of a crossover seemed remote.",
    "Morbius will star Leto, Gibson, Matt Smith and Jared Harris, among others. Here's Gibson's original interview answer on the MCU question:",
    "While the anticipated alternate universe shenanigans of Spider-Man: No Way Home might open the door to the possibility of Morbius being part of a wider Marvel Cinematic Multiverse, we'd prefer they were kept separate. Marvel Studios is already making three or more movies per year, with a similar number of TV shows in the works on Disney Plus. Really, if it doesn't feature the MCU sting, it shouldn't be part of the story – not even tangentially.",
    "By featuring Keaton in the trailer, Morbius started asking questions about whether the status of these Spider-Man movies was different to what we'd previously assumed. It's easy to compartmentalize Tom Holland's Spidey films because he's just one character – we can see how they fit in to a larger plan.",
    "It starts getting shakier when Sony's villain solo pictures come into it. Our verdict? Having 23+ movies to follow and a range of TV shows is more than enough for most sensible viewers."
  ],
  "headers": {
    "5": "Analysis: Let's avoid any confusion"
  },
  "links": {
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Comic Book": "https://comicbook.com/marvel/news/morbius-mcu-marvel-cinematic-universe-avengers-spider-man-tyrese/",
    "GameSpot": "https://www.gamespot.com/articles/morbius-is-still-coming-out-in-january-2022-not-part-of-the-mcu/1100-6492955/",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know"
  }
}