{
  "source": "https://www.techradar.com/news/diablo-2-resurrected-devs-want-remaster-to-shine-with-new-accessibility-options",
  "title": "Diablo 2: Resurrected devs want remaster to ‘shine’ with new accessibility options",
  "category": "gaming",
  "updated": "2021-07-21T16:40:35Z",
  "author": "emma-boyle",
  "summary": "\"Our team has the most fun when everyone is having fun\"",
  "article": [
    "Blizzard has revealed some of the features it's introducing to Diablo 2: Resurrected to make it more accessible to a wider range of players, emphasizing that modernizing a game is about more than just visuals.",
    "In a new blog post on the Blizzard site, Design and UX Accessibility Lead, Drew McCrory, explains Blizzard’s philosophy on modernizing “all angles” of Diablo 2, saying, “Accessibility is one major area of opportunity for this remaster to shine, and our intention to bring games to more players has evolved and is more refined now than ever before.”",
    "McCrory touches on some of the quality of life improvements the team brought to the game which, in turn, improved accessibility. According to McCrory, auto-gold pick-up was initially introduced so that controller players wouldn’t need to click as much. However, the team found during the Technical Alpha that “mouse and keyboard players with limited mobility in their hands really enjoy this feature” as it could “alleviate physical stress without compromising the core gameplay experience.”",
    "“While we implemented this option with one type of player in mind,” McCrory says, “we ended up benefiting countless other players by giving them a quality of life (QoL) option they can choose to enable when they configure their personal Diablo II experience.”",
    "Another feature was introduced after the team found that players “weren't getting the right level of feedback for when they were missing enemies in melee.” As a result, when the game launches players will find an option to enable miss text for visual feedback.",
    "Then there’s controller accessibility, with Diablo 2: Resurrected allowing “heavy amounts of modification” for controllers and “a long list of bindable actions” for mouse and keyboard. There are twelve bindable keys and players can assign all actions/skills (even neutral skills like 'interact') any way they want.",
    "“Diablo II is primarily a game about picking up and holding items and persistently clicking,” McCrory explains, “We know that prolonged holds and repetitive actions can be a significant barrier for some players, so we’ve added quality of life features to help mitigate the fatigue caused by many of these actions.”",
    "There are also improvements to Diablo 2’s audio accessibility, with players having more manual control over their sound channels so that they can augment what they want and cut out what they don’t. In the Options menu, players will find sliders to adjust a wide range of things including voices, UI cues, footsteps, monster hit impacts, weapons noises, ambient objects, combat gore and more.",
    "These are only some of the accessibility options players can expect to see in Diablo 2: Resurrected, with McCrory promising that the team will “continue to remain focused on how to take a true classic and modernize its accessibility for all players” by seeking feedback from players.",
    "Diablo 2: Resurrected is scheduled to release on September 23 2021 on PC, Xbox Series X/S, Xbox One, PS5, PS4 and Nintendo Switch . Those who have pre-ordered the game on PlayStation, Xbox and PC will have a chance to play before release, with an early-access beta scheduled for sometime in August."
  ],
  "headers": {
    "7": "More control"
  },
  "links": {
    "Diablo 2: Resurrected": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "new blog post": "https://news.blizzard.com/en-us/diablo2/23700733/how-we-re-making-diablo-ii-resurrected-more-accessible-to-everyone",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}