{
  "source": "https://www.techradar.com/news/new-seagate-disk-tech-could-drive-down-the-cost-of-high-capacity-hdds",
  "title": "New Seagate disk tech could drive down the cost of high-capacity HDDs",
  "category": "computing",
  "updated": "2021-06-06T06:01:34Z",
  "author": "mayank-sharma",
  "summary": "Seagate reportedly secures a dozen customers for new drives",
  "article": [
    "Seagate has been working on a cleverly tweaked version of its conventional hard disk drives (HDD) that not just improves speeds, but might also be cheaper to produce.",
    "Dubbed Mach.2, the new tech gets its name from the fact that these drives use two actuators instead of one, which helps significantly improve both the sequential and random read/write speeds.",
    "Seagate recently announced its first dual-actuator disk, the Mach.2 Exos 2X14, which according to the official spec sheet offers a sustained transfer rate of 524MB/s making it the world’s fastest HDD.",
    "While the Mach.2 Exos 2X14 has just been announced, The Register chanced upon a transcript of a Seagate investor day talk from Seagate’s Senior VP Jeff Fochtman, which points out the drive has a dozen customers already and that Seagate is ramping up production.",
    "Fochtman reportedly acknowledged that when the Mach.2 drives offer storage capacities of 30TB, they’ll make for an irresistible proposition “in many large data center environments.”",
    "The Mach.2 Exos 2X14, which is also pitched at cloud and hyperscale data centers, currently offers 14TB of storage space.",
    "“A notable benefit to dual actuator technology standardization is that it drastically cuts down test time, and therefore, hard drive production time is greatly reduced. This is a benefit we're looking forward to recognizing on the cost side of the business,” Fochtman reportedly said at the investor day talk.",
    "Seagate hasn’t yet announced a price for the Mach.2 Exos 2X14, and it’ll be interesting to see if Seagate in fact passes down the cost benefits of the drives to its customers.",
    "Via The Register"
  ],
  "headers": {
    "4": "Cheaper to produce"
  },
  "links": {
    "Seagate": "https://www.techradar.com/news/seagate-launches-small-but-mighty-ssd-for-content-creators",
    "HDD": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "Mach.2 Exos 2X14": "https://www.techradar.com/news/seagate-may-have-just-unveiled-the-worlds-fastest-hdd",
    "The Register": "https://www.theregister.com/2021/06/04/seagate_mach_2_lproduction_costs/"
  }
}