{
  "source": "https://www.techradar.com/news/stripe-acquires-taxjar-to-help-online-businesses-with-tax-compliance",
  "title": "Stripe acquires TaxJar to help online businesses with tax compliance",
  "category": "computing",
  "updated": "2021-04-28T09:04:07Z",
  "author": "rob-clymo",
  "summary": "Payments platform looks to ramp up growth with further expansion",
  "article": [
    "Stripe has acquired TaxJar in a purchase aimed at boosting the power of its growing payments platform.",
    "TaxJar is a provider of cloud-based tax services, which includes tools for calculating, reporting and filing sales taxes with Stripe keen to exploit the company's ability to handle different tax arrangements across geographical boundaries.",
    "Although no price has been made public, TaxJar was valued at $179 million when going through a fund-raising round in 2019. Stripe has also been expanding rapidly, and the privately-held payments platform is now valued at $95 billion.",
    "Following the acquisition, TaxJar’s 200 employees will join the Stripe payroll, with the company's technology likely to be integrated into Stripe revenue platform alongside Stripe Billing and Radar. The former features a suite of subscription-based payment tools, while the latter provides fraud prevention technology.",
    "However, businesses will still be able to use TaxJar as is, although it’s likely that Stripe will combine its suite of tools into other AI-based products moving forwards.",
    "Stripe has previously looked to boost its tax-focused product portfolio with the purchase of Payable back in 2017, using its specialism in helping with 1099 reporting for customers who pay contractors.",
    "The company has also collaborated with Intuit to assist on-demand workers better manage their finances.",
    "However, the acquisition of TaxJar should see Stripe gain an advantage in the sales tax and remittance areas of its business, both of which are said to be the most requested features required by existing users.",
    "“There’s a reason TaxJar has been a top choice for businesses: their software tools make it incredibly easy to handle sales tax,” said Dhivya Suryadevara, Stripe CFO. “With TaxJar, we will help millions of internet businesses running on Stripe with their sales tax and make it easier for them to sell internationally. And as a CFO, I’m delighted to welcome so many new colleagues who care deeply about taxes!”"
  ],
  "headers": {
    "4": "Sales tax"
  },
  "links": {
    "payments platform": "https://www.techradar.com/best/best-payment-gateways",
    "tax services": "https://www.techradar.com/best/best-tax-software",
    "sales taxes": "https://www.techradar.com/best/best-expense-trackers",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "payroll": "https://www.techradar.com/best/best-payroll-software",
    "fraud prevention": "https://www.techradar.com/news/world-of-tech/roundup/the-small-business-guide-to-preventing-online-fraud-1101869",
    "Payable": "https://www.techradar.com/best/accounting-software-small-business",
    "Intuit": "https://www.techradar.com/news/quickbooks-beefs-up-accounting-software-to-help-small-businesses"
  }
}