{
  "source": "https://www.techradar.com/news/new-tomb-raider-movie-finally-has-a-script-and-a-working-title",
  "title": "New Tomb Raider movie finally has a script – and a working title",
  "category": "gaming",
  "updated": "2021-05-17T11:56:55Z",
  "author": "gerald-lynch",
  "summary": "Another Lara Croft movie is set to raid your wallets",
  "article": [
    "Lara Croft is set to return to the silver screen in a new Tomb Raider movie – and we now know what it is likely set to be called, with a working title of ‘Tomb Raider: Obsidian’.",
    "The film is to be directed and written by Misha Green (writer on the very good Lovecraft Country). It’ll be her first feature-length directorial role, taking the project over from UK director Ben Wheatley.",
    "\"Still a long journey to production,\" Green tweeted. \"Title's not even approved. But first draft finished!!!\"",
    "Other than that, there isn’t much else to go on regarding the new Tomb Raider film. Checking the cast list over on IMDB, it looks as if Alicia Vikander and Kristin Scott Thomas are reprising their respective roles of Lara Croft and Ana Miller, held in the 2016 reboot. But that’s pretty much all we know of note for now – and with just the first draft being completed, we’re still a way off from learning much more, it would seem.",
    "Despite only garnering middling reviews, the 2018 Tomb Raider movie reboot did reasonably well at the box office, making around $275 million on an estimated $95 million budget.",
    "It saw Vikander take the lead role once held by Angelina Jolie, in a story that more closely resembled the survival-focussed reboot games than the swashbuckling 32-bit originals.",
    "Though she’s yet to helm a big blockbuster behind the camera, Green is a good choice to bring the franchise forward, with a keen eye not only for adventure, but for the supernatural, as shown by Lovecraft Country. It’ll also be the first time a Tomb Raider film will be directed by a woman, which is as overdue as it is apt.",
    "Interestingly, it now seems as though the Tomb Raider movie sequel release will follow that of another closely-tied movie adaptation, with the long-gestating Uncharted movie due a February 2022 release date. The Uncharted game series took its cues from Tomb Raider, which in itself was a play on the Indiana Jones films – also getting a sequel that's expected to hit cinemas in 2022. That's not to mention Netflix's own Tomb Raider TV show currently in development. It’s set to be a busy few years for Hollywood's – and gaming’s – favorite adventuring archeologists then."
  ],
  "headers": {
    "4": "Re-raided"
  },
  "links": {
    "Lovecraft Country": "https://www.techradar.com/news/how-to-watch-lovecraft-country-online-stream-the-new-hbo-max-show-from-anywhere",
    "Uncharted movie": "https://www.techradar.com/news/new-uncharted-movie-images-tease-tom-hollands-first-adventure",
    "Indiana Jones films – also getting a sequel": "https://www.techradar.com/news/indiana-jones-5-gets-phoebe-waller-bridge-and-john-williams",
    "Tomb Raider TV show": "https://www.techradar.com/news/netflix-is-making-a-tomb-raider-animated-tv-show"
  }
}