{
  "source": "https://www.techradar.com/news/apple-could-launch-lots-of-new-macs-in-2022-including-new-cheaper-macbook-pro",
  "title": "Apple could launch lots of new Macs in 2022, including new cheaper MacBook Pro",
  "category": "computing",
  "updated": "2021-12-06T10:40:48Z",
  "author": "darren-allan",
  "summary": "Next year could witness a bumper crop of Apple Mac launches",
  "article": [
    "Apple is rumored to have a bunch of new Macs coming next year – five of them to be precise – and that might include a new cheaper MacBook Pro.",
    "Mark Gurman is one of the most trusted Apple leakers out there, and in his latest newsletter, he outlined the emergence of this fresh entry-level MacBook Pro, along with a revamped MacBook Air with a new design – which has been much rumored – built around the M2 chip.",
    "Gurman also believes that Apple will push out a new high-end iMac, and this will have one of its own chips and be positioned above the iMac 24-inch, plus we can expect an updated Mac mini (some folks thought the latter would come late this year, in fact, and again the rumor mill has been chattering about this for some time).",
    "Finally, to top that off, a new Mac Pro will be unleashed, and again this machine is set to be powered by Apple silicon.",
    "We’ve touched on some of the rumors that have already been floating around about these purported Macs, but there has been speculation about all these potential revamps, including the iMac and Mac Pro.",
    "A couple of things really stand out here, though, and the first is Apple’s continued transition to its own silicon at an impressive pace. Secondly, there’s that fresh entry-level MacBook Pro, and as MacRumors, which spotted this, makes clear, Gurman has previously floated the idea of a revamped lower-end MacBook Pro, and that it could run with the M2 chip set to be used in the MacBook Air.",
    "This purported laptop has fallen off the rumor radar for some time, but now it looks like it might be back on – although Gurman doesn’t mention that the theoretical new model might be built around the M2 chip (but if the Air is coming with that silicon on-board, it makes some sense).",
    "So, it’s not clear what chip this refreshed base model of the Pro could use, or indeed where such a portable might fit into the range compared to the incoming MacBook Air redesign. Obviously at this stage, we’re still working with relatively early speculation, so it’s really not clear how the puzzle might fit together with these two possible new offerings.",
    "What we do know, judging from this latest newsletter, is that Apple is planning a busy 2022 on the Mac front, which is no bad thing. Which of these machines might turn up first is another point of interest, but we expect that the updated Mac mini – which, as mentioned, has been rumored for some time – will be earlier in the timeline. The redesigned MacBook Air might arrive sooner than you think, too, with Gurman previously speculating that it could be here as soon as May 2022."
  ],
  "headers": {
    "4": "Analysis: Apple transition, and mulling the new MacBooks"
  },
  "links": {
    "Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "MacBook Pro": "https://www.techradar.com/news/macbook-pro-14-inch-2021-vs-macbook-pro-13-inch-2020",
    "iMac 24-inch": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "MacRumors": "https://www.macrumors.com/2021/12/05/apple-planning-five-new-macs-for-2022/",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "redesigned MacBook Air": "https://www.techradar.com/news/macbook-air-2022",
    "Gurman previously speculating": "https://www.techradar.com/news/macbook-air-2022-could-arrive-in-may-with-apples-biggest-redesign-in-a-decade"
  }
}