{
  "source": "https://www.techradar.com/news/switching-from-iphone-to-an-android-phone-could-soon-get-a-lot-easier",
  "title": "Switching from iPhone to an Android phone could soon get a lot easier",
  "category": "phones",
  "updated": "2021-07-28T08:29:37Z",
  "author": "tom-bedford",
  "summary": "Without using Google Drive",
  "article": [
    "Apple's iOS operating system and Google's popular Android equivalent both have die-hard fans, and in part they maintain this user base by making it hard to switch to the competition.",
    "Every once in a while each puts put out tools to make switching between platforms easier, which is something Google may be trying again.",
    "According to 9to5Google, and spotted in code for Android's Data Restore Tool, Google is apparently working on an app called Switch to Android, which would be available to iOS devices, and would make sending all the personal data on your phone or tablet much easier.",
    "Presumably, this app would send your contacts, app choices and login data, photos, settings and more from your iPhone to your Android handset.",
    "This could replace the current method Google has where it lets you back up your data via Google Drive, but this sounds like it could be more thorough in backing up your personal data and likely easier too.",
    "Apple has a similar tool too, called Move to iOS, so if it turns out to be real, Google's will likely do the same kind of thing. If this app ever materializes, we'll let you know.",
    "Currently, to send your data from an iOS device to an Android phone or tablet, you have to download the Google Drive app on the iPhone or iPad, use it to back up your device, then on your new Android gadget you need to sign into Google Drive and restore the backup.",
    "That's a fairly robust way of sending your data behind devices, but it misses some things: your apps aren't sent between devices, for example.",
    "Furthermore, your 'average' tech user - i.e., someone who doesn't read tech news on TechRadar - might not realize this option exists at all, due to the lack of a dedicated app for it.",
    "So by making a new Switch to Android app, which automates the transition process in just a few easy clicks or taps, Google will be providing a much easier way for people who aren't tech-savvy, to switch to a phone on its operating system."
  ],
  "headers": {
    "6": "Analysis: why Google Drive wasn't enough"
  },
  "links": {
    "9to5Google": "https://9to5google.com/2021/07/27/google-developing-switch-to-android-app-for-ios-to-copy-data-and-apps-from-your-iphone/"
  }
}