{
  "source": "https://www.techradar.com/news/android-12-is-here-but-it-shouldnt-be",
  "title": "Android 12 is here, but it shouldn’t be",
  "category": "phones",
  "updated": "2021-10-08T12:58:45Z",
  "author": "james-rogerson",
  "summary": "Opinion: patience is a virtue",
  "article": [
    "I think it’s fair to say that Android 12 hasn’t had the smoothest of launches. Not only is it late (relative to the last few versions anyway), but now that it’s finally here it, well, isn’t really.",
    "Google made the odd decision to launch Android 12 onto the Android Open Source Project (AOSP), an open source version of the platform used by developers. That in itself isn’t odd – Google always does this with new versions, but it also always launches them onto Pixel phones at the same time. Except this year.",
    "This year, if you’re a general user, there’s no easy or official way to actually get Android 12 onto your handset right now, even if you have a Google Pixel 5.",
    "It’s a strange situation which has led to confusion, with articles saying Android 12 is here when functionally for it isn’t. Early reviews have also appeared that won't be entirely representative, since the version that appears on even Pixel phones is likely to be at least a little bit different.",
    "This weird launch also means that when Android 12 does finally launch on phones, it will likely do so with less fanfare than normal, because it’s already out, sort of.",
    "This seems to be a theme for Google in 2021, with the company also semi-announcing the Pixel 6 range back in August, but leaving us waiting until October 19 for a full launch. But there at least it was building hype for the phones, whereas with Android 12 it’s just building confusion.",
    "So why did Google do this? Essentially because the AOSP version of Android was finished, while the version being shipped to Pixel phones wasn’t.",
    "In a comment to Android Central, a Google spokesperson said \"We're putting the finishing touches on a special release with Pixel-exclusive and Pixel-first experiences on Android 12. This will roll out to Pixel users in the next few weeks.\"",
    "The team working on Android itself is also different to the team working on the Pixel handsets, so while they presumably communicate and coordinate a lot, ultimately the former team got its project finished, while the latter still needs to add some finishing touches.",
    "But just because one team finished ahead of the other it doesn’t mean it needed to release Android 12 – in a form most people can’t make use of – before the Pixel version was done. It sounds like the wait is almost over for Android 12 on Pixel, so couldn’t Google just have waited an extra couple of weeks and launched both versions together like in any other year?",
    "Doing so would have avoided all this confusion and criticism, and allowed Android 12 to land with a bang rather than a whimper.",
    "Why Google didn’t do this isn’t entirely clear. We can’t imagine it was down to a lack of communication between the two teams – though if it was then that’s a sign of much bigger, more systemic problems.",
    "More likely the company simply decided that getting Android out on AOSP sooner rather than later would be beneficial to developers. And Google is probably right, but whether doing so was worth the confusion caused we’re less sure.",
    "It doesn’t help that some headlines added to the confusion by saying Android 12 had launched, with no caveats, but Google should have predicted that would happen.",
    "Compare this to the launch of iOS 15 and it’s night and day. iOS 15 was announced on September 14 and went live less than a week later on September 20 - with that date being confirmed on the day of the announcement.",
    "It launched on that date for all compatible devices as well, running right back to the iPhone 6S from 2015. There was no confusion, no uncertainty and no phased rollout.",
    "Compare that to Android 12, which is here, except it’s not. It will be coming to Pixel phones soon, but we’re not really sure when. When it does land on Pixel, we don’t even know for sure which models will be compatible. We’re expecting it for the Pixel 3 onwards, since that’s in the beta, but Google hasn’t confirmed.",
    "The Pixel 3 also came out in 2018, so if that is the cut-off then that means way less support than Apple is offering, though that’s nothing new for Android. Then of course it will be at least weeks and in many cases months before most handsets from other manufacturers get Android 12.",
    "So there are an assortment of problems here, with many causes, and many of which are difficult to solve. Some of these are issues Android has always faced too, but the last thing Google needs is to add to its problems. Android launches are always confusing, especially compared to iOS ones, but this year it’s utterly baffling.",
    "That’s a real shame, especially as Android 12 itself looks to be an exciting update, with a complete visual overhaul. Google’s botched launch has somewhat taken the shine off that, so hopefully Android 13’s launch is more considered."
  ],
  "headers": {
    "6": "Why this happened and what should have happened",
    "14": "A crushing contrast"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "launch Android 12 onto the Android Open Source Project": "https://www.techradar.com/news/android-12-is-sort-of-out-but-you-cant-get-it-yet",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Android Central": "https://www.androidcentral.com/android-12s-sloppy-rollout-explained-how-pixel-fell-behind",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review"
  }
}