{
  "source": "https://www.techradar.com/news/new-dji-mini-se-leaks-suggest-itll-be-djis-cheapest-drone-yet",
  "title": "New DJI Mini SE leaks suggest it'll be DJI's cheapest drone yet",
  "category": "cameras",
  "updated": "2021-06-15T09:01:40Z",
  "author": "mark-wilson",
  "summary": "Expect a repackaged DJI Mavic Mini to land soon",
  "article": [
    "A couple of weeks ago we saw an unannounced DJI Mini SE drone appear in a Walmart listing – and now further leaks appear to have confirmed its tempting price tag.",
    "Given the Mini SE appears to be a repackaged version of the DJI Mavic Mini, which is the predecessor to the current entry-level DJI Mini 2, we suspected its price tag would be on the low side. But some in-store snaps leaked on Twitter and Reddit suggest the Mini SE could launch for only $299 (around £212 / AU$388).",
    "That would significantly undercut the DJI Mini 2's price tag ($449 / £419 / AU$749), and make it cheaper than the Mavic Mini, which has remained on sale for $399 / £369 / AU$599. If DJI does indeed launch the Mini SE worldwide, it would be its cheapest drone yet.",
    "So how exactly might the DJI Mini SE differ from its two closest siblings in DJI's lineup? According to the leaks, it appears to be mishmash of the two, with a similar design to the DJI Mini 2 and a specs sheet that's closer to the Mavic Mini.",
    "A photo of the drone's packaging suggests that, like the latter, it'll shoot 2.7K video, have a 30-minute flight time, and come with a maximum range of 2.5 miles. What isn't clear is whether the Mini SE will come with the Mini 2's new controller or the smaller, folding design of its predecessor.",
    "Either way, that 2.5-mile range suggests the incoming drone won't have Ocusync connectivity, which is DJI's more modern and reliable transmission system. That isn't a deal-breaker for a drone at this price, though, and the DJI Mini SE's 249g weight would mean it wouldn't need registering in some regions.",
    "Unsurprisingly, DJI declined to comment when we asked it about the DJI Mini SE leaks. But the growing number of photos suggest it's likely to arrive soon, even if it's not clear whether or not it'll be a global launch. So far, it's only been spotted in Walmart and on the store's website.",
    "The launch would certainly make sense, given the growing competition in the budget drone space from the likes of the Hubsan Zino Mini Pro and FIMI X8 Mini. DJI has previously collaborated on an even cheaper drone called the Ryze Tello, but that is more of an educational model for kids.",
    "Despite sharing similar specs to the Mavic Mini, which arrived in 2019, the Mini SE would still be a very capable drone for the price and a potentially great option for those looking to shoot 2.7K aerial video and 12MP stills, without splashing out on the top pick in our best drones guide, the DJI Air 2S.",
    "While you do miss out on handy features like subject-tracking on DJI's entry-level models, and larger sensors, they do bring several automated flying modes that make it easy for beginners to get compelling sky-based shots with minimal flying skills. We'll bring you all of the official information on the DJI Mini SE as soon as it lands."
  ],
  "headers": {
    "6": "Pretty fly for a cheap drone"
  },
  "links": {
    "DJI Mavic Mini": "https://www.techradar.com/reviews/dji-mavic-mini",
    "DJI Mini 2": "https://www.techradar.com/reviews/dji-mini-2",
    "Twitter": "https://twitter.com/GAtamer/status/1403392256770445321",
    "Reddit": "https://www.reddit.com/r/dji/comments/ns235y/what_the_link_in_first_comment/",
    "store's website": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-1276181383603506700&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FDJI-Mini-SE%2F550297208%3Firgwc%3D1%26sourceid%3Dimp_w6zXeYQg5xyLWOVwUx0Mo3EOUkBw5f2RH0omWY0%26veh%3Daff%26wmlspartner%3Dimp_482924%26clickid%3Dw6zXeYQg5xyLWOVwUx0Mo3EOUkBw5f2RH0omWY0%26sharedid%3Dtheverge.com%26affiliates_ad_id%3D565706%26campaign_id%3D9383",
    "Ryze Tello": "https://www.techradar.com/reviews/ryze-tello",
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s"
  }
}