{
  "source": "https://www.techradar.com/news/6-things-to-consider-to-ensure-you-buy-the-right-tablet",
  "title": "6 things to consider to ensure you buy the right tablet",
  "category": "tablets",
  "updated": "",
  "author": "andrew-williams",
  "summary": "From display and price to software and accessories",
  "article": [
    "Want to buy a tablet? Choosing the right one can be tricky, particularly if friends just seem to tell you to get what they have.",
    "The choice gets a lot easier when you break the decision down, to get a grip on what you'll actually appreciate and need in this kind of device.",
    "We're going to run through the main talking points, from display size to budget and CPU power, so you can find the best tablet for your needs.",
    "The key to honing in on the right tablet for you is not to be swayed too much by flashy specs, and to focus instead on how you're likely to use the tablet day-to-day.",
    "You can break tablets down into three sizes: below 10 inches, around 10 inches and the whoppers that get closer to a laptop-size display.",
    "A smaller tablet is perfect if you want something inexpensive for the kids to play with, a casual web browser for the sofa or something for your work commute that is simply a bit bigger than your phone.",
    "The 10-inch tablet has become the default size for mid-range tablets, and we like it a lot. You get a screen much larger than that of any phone.",
    "They are big enough to transform the experience of games, and make using highly involved apps like painting programs and music sequencers much more enjoyable.",
    "And the tablet giants? 12-inch tablets like the iPad Pro 12.9 and Samsung Galaxy Tab S7 12.4 offer a huge canvas that initially may seem intimidating.",
    "However, all that space lets keyboard accessories offer a laptop-grade typing experience, complete with full-size keys. These tablets make great laptop-replacers.",
    "The three main kinds of tablet software you should consider are iPad OS, Android and Windows.",
    "All Apple tablets run iPad OS. Microsoft tablets use Windows, and most others run Android. How do you choose?",
    "If the budget is tight, buy an Android tablet. iPad OS offers the quintessential tablet experience, complete with some excellent free apps like music creation software Garageband, Pages and Keynote.",
    "You might want a Windows tablet if you plan to do a lot of work on your tablet. While Android and iPad OS have access to favorites like Microsoft Word, they are slightly different tablet optimized versions.",
    "A Windows tablet can use exactly the same apps you might run on a Windows laptop or desktop PC.",
    "Windows tablets are the most \"open\" in that specific sense, although many find Android and iPad OS tablets easier to control via the touchscreen. While Windows has touch control, Android and iPad OS were made from the ground up with touch in mind.",
    "The pricing of tablets varies as much as the cost of phones. You can spend as little as $50/£50 for a solid family tablet from Amazon's Fire HD range, or all the way up to $2,877/£2,600 for a top of the line iPad Pro 12.9 with an Apple Pencil and Magic Keyboard.",
    "How much should you actually spend? The goldilocks zone for the average tablet buyer starts at around $329/£329.",
    "At this price you can afford an iPad or more affordable mid-range Android tablets. The price floor for Windows models is slightly higher, at $400/£400, but we're talking about a similar ballpark.",
    "At this level you get high quality hardware, and you can start to delve into the more ambitious uses for a tablet. This includes using a tablet as a digital art tool or a laptop-replacer.",
    "You may not need to spend this much if you want a family tablet to keep the kids entertained, or to play around while your partner or housemates watch something on TV you're not keen on.",
    "You should consider spending a little more if you want a tablet to be the main household computer, if only to upgrade the storage offered in the base versions.",
    "You can get all sorts of accessories for a tablet, but two types should really affect which tablet you choose to buy. The first is a pressure-sensitive stylus. Samsung has one called the S-Pen, meanwhile Apple has the Pencil, for example.",
    "These things are fantastic if you want to use a tablet like a graphics tablet, and get into the world of digital art. All the top tablet platforms have access to apps that let you create pro-grade works, without the mess or drying time involved with oil painting. It's great for your head too, a fantastic way to de-stress.",
    "However you can't use one of these styluses with a tablet that doesn't support it. All of Apple's current-generation iPads support one of the two Pencils. Samsung's S7-series tablets support the S-Pen, as well as the lower-cost Galaxy Tab S6 Lite.",
    "Top accessory number two is a keyboard base. One of these and a larger tablet go together like peaches and cream.",
    "They let you use a tablet as a laptop, and this transformation is much more natural in practice than it may sound in your head right now.",
    "If this is what you are after, check out the Apple iPad Pro line, Samsung Galaxy Tab S7 tablets and the Microsoft Surface Go 2 and Surface Pro 7 lines.",
    "All can be partnered with keyboard bases made by their manufacturers, and they slot together beautifully.",
    "How much power does a tablet need? If you're going to mostly browse the web and stream video, you don't really have to worry about the power of its brains. Even the cheapest models from budget tablet whiz Amazon handle that stuff just fine.",
    "Gaming offers the best way to demonstrate why you might want to spend a bit more on a super-powered tablet. Take a title like Fortnite from Epic Games. Try to run this on a tablet without enough RAM, which is a bit like a computer's short-term memory, and it won't load at all.",
    "In entry-level tablets, higher graphics settings will be locked off, because top developers are all about getting you a smooth and satisfying experience without having to rummage about in a game's settings menu.",
    "However, this does mean the graphics will look softer and more pixelated, and during moments of intense action it may get juddery.",
    "Some games only shine with high-end hardware. Prefer casual and puzzle games? The power on tap is much less important.",
    "You see the same effect in storage, the memory used to hold your apps, games and photos. If money is no object, 128GB and above offers loads of wiggle room to stack a tablet full of content without having to worry about space for a long, long time.",
    "The situation will get a little tighter sooner on tablets with 64GB or below. But have a think about what you'll actually want to put on the thing.",
    "One game with console-grade production values, or a movie downloaded from Netflix, might eat up to 5GB of space. The operating system, the software at the core of a tablet, also takes up space.",
    "However, Minecraft, for example, only consumes a fraction of a gigabyte. If you want to save money by buying a tablet with less storage, go ahead. But a little pre-planning to check you won’t hit a storage roadblock in your first week is always a good idea.",
    "You can take a few connectivity types as a given when buying a mainstream tablet in 2021. It's going to have Wi-Fi. You will get Bluetooth, which lets you connect a portable speaker.",
    "Mobile internet is found in fewer tablets. In most cases it will be an optional upgrade, and might be described as 4G, 5G or Cellular.",
    "This works much as it does in your phone. You sign up to a data plan linked to a SIM card, and pop it in the tablet. And suddenly you don't have to load up your entertainment when at home or within reach of a Wi-Fi hotspot.",
    "The downside if you have to pay to keep the SIM card active. Still, there's no reason you have to do so every month of the year.",
    "Some data plans let you pay for just the one month, which might be indispensable if you’ll travel around with your tablet every now and then."
  ],
  "headers": {
    "4": "1. Screen size and resolution",
    "10": "2. Operating system",
    "16": "3. Price",
    "22": "4. Accessories",
    "29": "5. Storage and Power",
    "38": "6. Connectivity"
  },
  "links": {
    "best tablet": "https://www.techradar.com/news/best-tablet",
    "iPad Pro 12.9": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Samsung Galaxy Tab S7 12.4": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Galaxy Tab S6 Lite": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-lite-review",
    "Microsoft Surface Go 2": "https://www.techradar.com/reviews/microsoft-surface-go-2",
    "Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review"
  }
}