{
  "source": "https://www.techradar.com/news/these-new-corsair-liquid-cpu-coolers-may-everything-you-need-in-a-cooling-system",
  "title": "These new Corsair liquid CPU coolers may be everything you need in a cooling system",
  "category": "computing",
  "updated": "2021-06-21T20:12:59Z",
  "author": "michelle-rae-uy",
  "summary": "Keep cool and game on",
  "article": [
    "Corsair has just expanded its liquid CPU cooler portfolio with three new additions, according to Eteknix. The peripherals company, which is no stranger to impressive computer peripherals, just launched not one but three new all-in-one liquid CPU cooling systems for PC builders and those looking to upgrade their cooling system.",
    "The Corsair H55 RGB, H100 RGB, and H150 RGB look to offer an appealing proposition if you’re looking for a cooling solution that combines form and factor. They also come in radiator sizes of 120 mm, 240 mm, and 360 mm respectively, so there’s something for everyone, no matter the size of their build.",
    "With these all-in-one liquid coolers, Corsair promises “everything you need to keep your CPU running at peak performance, including fans, coolant, and radiator in a single closed loop that’s easy to install and maintain.”",
    "The Corsair H55 RGB, H100 RGB, and H150 RGB are fitted with Corsair’s SP120 RGB ELITE fans that can go up to 1,500 RPM with AirGuide technology, a thermally optimized copper cold plate, and a low-noise pump. Altogether, they deliver an efficient and effective cooling performance without all the distracting noise. On paper, at least.",
    "For aesthetics’ sake, they’re also equipped with 13 RGB LEDs on the pump head and 8 RGB lights on each fan, which are customizable via compatible motherboards (and their accompanying software) with flexible +5V ARGB support. Compatible motherboard software includes the ASUS Aura Sync, MSI Mystic Light, and Gigabyte RGB Fusion.",
    "Finally, Corsair has made these liquid CPU coolers easy to install. Each comes with a modular, tool-free mounting bracket that’s compatible with all modern CPU sockets, including LGA 1200,115X, 2066, and AM4.",
    "The Corsair H55 RGB, H100 RGB, and H150 RGB should already be available to purchase from authorized resellers, although they don’t seem to be on hand at the time of writing, even on Corsair’s own online store. We recommend checking back in a couple of days, although if you need one now, Amazon should have a few Prime Day deals on CPU coolers."
  ],
  "headers": {
    "3": "Sprucing up your rig without the hassle"
  },
  "links": {
    "Eteknix": "https://www.eteknix.com/corsair-h55-h100-h150-rgb-aio-cpu-coolers-revealed/",
    "computer peripherals": "https://www.techradar.com/news/computing-components/peripherals",
    "CPU cooling systems": "https://www.techradar.com/news/best-cpu-coolers",
    "online store": "https://go.corsair.com/c/221109/490888/8513?subId1=trd-us-9623191770581524000&sharedId=trd-us&u=https%3A%2F%2Fwww.corsair.com%2Fus%2Fen%2FCategories%2FProducts%2FLiquid-Cooling%2Fc%2FCor_Products_Cooling",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}