{
  "source": "https://www.techradar.com/news/square-follows-tesla-by-going-big-on-bitcoin",
  "title": "Square follows Tesla by going big on Bitcoin",
  "category": "computing",
  "updated": "2021-02-24T15:33:32Z",
  "author": "mayank-sharma",
  "summary": "Payment procesing firm has been making systematic investments for quite some time",
  "article": [
    "Financial services company Square has revealed it has purchased Bitcoin cryptocurrency worth $170 million.",
    "Square has been dabbling in the cryptocurrency for quite a while, and its recent purchase of 3,318 coins together with the previous purchase of $50 million, is about five percent of the company’s net worth.",
    "“The investment is part of Square’s ongoing commitment to bitcoin, and the company plans to assess its aggregate investment in bitcoin relative to its other investments on an ongoing basis,” noted the company in its fourth quarter and full year 2020 results announcement.",
    "Square is headed by Twitter CEO Jack Dorsey, who is a vocal advocate of the cryptocurrency - having recently together with rapper Jay-Z announced a Bitcoin Trust to fund development in Africa and India with an initial capital of 500 BTC.",
    "Square seems to agree with its CEO, and notes in its announcement that it “believes that cryptocurrency is an instrument of economic empowerment, providing a way for individuals to participate in a global monetary system and secure their own financial future.”",
    "There has been a notable increase in the interest in Bitcoin, following Tesla purchasing $1.5 billion worth of the cryptocurrency. According to estimates the automaker has already made a paper profit of over a billion dollars on its investment. Tesla CEO, Elon Musk, just like Twitter and Square’s Dorsey, is a vocal proponent of Bitcoin."
  ],
  "headers": {
    "3": "Bitcoin Square"
  },
  "links": {
    "Square": "https://www.techradar.com/news/square-register-is-a-new-fully-integrated-pos-solution-for-smes",
    "Bitcoin": "https://www.techradar.com/news/best-bitcoin-wallets",
    "dabbling in the cryptocurrency": "https://www.techradar.com/news/profits-rise-at-square-thanks-to-bitcoin-sales",
    "announcement": "https://squareecom.yaub.net/c/221109/619387/10061?subId1=trd-us-4118745861572697600&sharedId=trd-us&u=https%3A%2F%2Finvestors.squareup.com%2Fnews%2Fnews-details%2F2021%2FSquare-Inc.-Announces-Fourth-Quarter-and-Full-Year-2020-Results%2Fdefault.aspx",
    "Bitcoin Trust": "https://www.techradar.com/news/jack-dorsey-announces-bitcoin-trust-with-focus-on-africa",
    "Tesla purchasing $1.5 billion worth": "https://www.techradar.com/news/tesla-has-already-made-dollar1bn-profit-on-its-bitcoin-investment"
  }
}