{
  "source": "https://www.techradar.com/news/new-hitman-and-just-cause-mobile-games-are-coming-in-2021",
  "title": "New Hitman and Just Cause mobile games are coming in 2021",
  "category": "phones",
  "updated": "2021-03-18T19:37:27Z",
  "author": "david-lumb",
  "summary": "Square Enix’s mobile game gallery is expanding with Hitman and Just Cause",
  "article": [
    "In the slew of games announced during the Square Enix Presents Spring 2021 showcase, a few new mobile games in development were teased, including new Hitman and Just Cause titles.",
    "Sadly, we didn’t get any release date information, but the trailers did give us a look at what’s coming for the mobile entries in the major game franchises, which will be available on iOS and Android.",
    "Hitman Sniper Assassins is a follow-up to the Hitman: Sniper mobile game released in 2015, though it’s unclear how much the new game will follow the latter’s shooting gallery-like gameplay. Sniper Assassins will have a ‘wholly original Hitman story, with new playable assassins and brand-new gameplay features,’ according to the trailer’s description.",
    "Just Cause: Mobile will be a free-to-play third-person shooter with single-player and multiplayer components. While the cinematic trailer didn’t show off gameplay, the description did suggest you’ll run into series regulars Rico Rodriguez and Annika Svensson, who will provide missions and intel.",
    "Lastly, Square Enix brought an old favorite out with a new twist: a Space Invaders AR mobile game is coming to smartphones. While there’s no release date yet, anyone interested can sign up on the website to partake in playtests.",
    "As the trailer and ‘AR’ description suggest, this looks like a game you’ll head into the streets to play, though we haven’t the foggiest idea how it will work. Hopefully things will go smoother than the last time 8-bit Space Invader-esque art appeared in public and panicked the city of Boston.",
    "These look to be fun new titles in Square Enix’s forecast of mobile games. While the publisher has released plenty of smartphone games in the past, including the lauded Hitman Go, Lara Croft Go, and Deus Ex Go, among a legion of Final Fantasy games, its upcoming releases seem to have more advanced and new console-like graphics.",
    "Also coming this year is Final Fantasy VII First Soldier, a battle royale game set before the events of the classic game that pit player vs. player vs. iconic FF enemies (bombs and Ifrits and Shivas, oh my), all on mobile:",
    "And coming in 2022 is Final Fantasy VII Ever Crisis, a mobile ‘just the highlights’ version of the game much like the mobile version of Final Fantasy XV. Even though it’s abridged, it will still feature moments from the entire Final Fantasy VII gaming timeline, including Crisis Core, Dirge of Cerberus, and other spinoff media."
  ],
  "headers": {
    "6": "More Square Enix mobile games?"
  },
  "links": {
    "Square Enix Presents Spring 2021": "https://www.techradar.com/news/life-is-strange-3-is-a-big-change-from-past-games-heres-why",
    "website": "http://spaceinvadersar.square-enix-games.com/",
    "panicked the city of Boston": "https://www.bostonmagazine.com/news/2017/01/31/boston-mooninite-panic-2007/",
    "coming": "https://www.techradar.com/news/two-ff7-mobile-games-are-coming-include-a-battle-royale-set-in-midgar"
  }
}