{
  "source": "https://www.techradar.com/news/aws-reveals-adam-selipsky-as-new-ceo",
  "title": "AWS reveals Adam Selipsky as new CEO",
  "category": "computing",
  "updated": "2021-03-24T12:13:05Z",
  "author": "mayank-sharma",
  "summary": "Former Tableau chief Selipsky will take over in May",
  "article": [
    "Amazon Web Services (AWS) has revealed former executive Adam Selipsky will be its new CEO.",
    "With previous CEO Andy Jassy preparing to take over the reins of parent company Amazon, Selipsky will now head up one of the world's top cloud computing platform.",
    "Selipsky is currently the CEO of Salesforce-owned data-visualization software maker Tableau. A former decade-old Amazon veteran, Selipsky left the company in 2016 to head Tableau, which was acquired by Salesforce in 2019.",
    "Amazon's changes started when founder Jeff Bezos announced his retirement earlier this year after almost three decades at the helm. During Bezos tenure, Amazon rose from just another e-commerce player to one of the big tech companies in the world, riding on the success of some of its subsidiaries, particularly AWS.",
    "Selipsky had been tipped for big things at Salesforce in the past, having been one of the names mentioned by company CEO Marc Benioff when asked about the hidden assets in the company that aren’t fully appreciated by the investors, at a Goldman Sachs hosted event earlier this year.",
    "In his email announcing the new CEO, Jassy noted that Selipsky was one of the first AWS VPs, having run the company's sales, marketing, and support for just over a decade before exiting for Tableau.",
    "Despite sharing the cloud computing space with formidable players like Microsoft and Google, AWS remains the market leader, and as per Amazon’s Q4 2020 earnings, it continues to be the profit engine of the company.",
    "During Bezos tenure, Amazon had an unofficial S-team of executives that were part of his inner ring. As the CEO of AWS, Selipsky will always be one of the people that works closely with Jassy.",
    "Via: CNBC"
  ],
  "headers": {
    "4": "Going places"
  },
  "links": {
    "AWS": "https://www.techradar.com/news/aws",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data-visualization software": "https://www.techradar.com/best/best-data-visualization-tools",
    "announced his retirement": "https://www.techradar.com/news/amazon-ceo-jeff-bezos-to-step-down-after-26-years-heres-whats-next",
    "Q4 2020 earnings": "https://www.cnbc.com/2021/02/02/aws-earnings-q4-2020.html",
    "CNBC": "https://www.cnbc.com/2021/03/23/amazon-taps-former-executive-adam-selipsky-to-run-aws.html"
  }
}