{
  "source": "https://www.techradar.com/news/nvidia-rtx-3080-ti-spotted-as-rumors-about-imminent-gpu-pile-up",
  "title": "Nvidia RTX 3080 Ti spotted as rumors about imminent GPU pile up",
  "category": "computing",
  "updated": "2021-05-26T10:03:20Z",
  "author": "darren-allan",
  "summary": "It’s looking increasingly likely that Nvidia is about to unleash an RTX 3080 Ti, plus a 3070 Ti",
  "article": [
    "Nvidia’s RTX 3080 Ti has been the subject of a ton of rumors lately, and a couple more just popped up, reinforcing the idea that this graphics card is about to be launched – with one leak showing some official photos of the GPU.",
    "Assuming the press shots of the Leadtek WinFast RTX 3080 Ti Hurricane are genuine – and they certainly look the part, as highlighted by VideoCardz – they back up past images of pallets of MSI’s RTX 3080 Ti Ventus spotted being shipped.",
    "The box of the Leadtek 3080 Ti variant is shown and again makes it clear that the memory configuration is 12GB of VRAM (as also seen on the MSI Ventus packaging), and the design of the triple-fan card looks pretty much the same as the existing WinFast RTX 3080 in terms of both board and cooling system.",
    "So it seems that the 3080 Ti will be essentially the same as the vanilla flavor of the RTX 3080 – based on the same GPU, with the same power consumption – just with some tinkering under the hood to supercharge it. The 3080 Ti will purportedly up the CUDA core count to 10,240, a healthy step up from the RTX 3080 which has 8,704 cores.",
    "At the same time, VideoCardz also spotted that Asus has filed a whole bunch of new graphics cards with the EEC (Eurasian Economic Commission), and that includes a raft of 3080 Ti models.",
    "Those cards include ROG Strix RTX 3080 Ti models, with a water-cooled LC model, a ROG Strix White Edition and Gundam-themed offering too (in a bunch of different variants, with overclocked or OC versions, non-OC, and Advanced models).",
    "The RTX 3070 Ti, the sibling card expected to appear a week after the 3080 Ti – with on sale-dates rumored to be June 10 and June 3 respectively, or thereabouts – also shows up, but will only have ROG Strix models in black and silver (but will be available as TUF, Turbo and water-cooled models).",
    "In actual fact, Asus has filed over 100 entries (yes, 100!) with the EEC for new and updated models, and it appears the graphics card maker is essentially refreshing its entire range across the board with the EEC. That includes many new crypto-mining limited (LHR) versions of existing graphics cards, and CMP (crypto-specific) GPUs.",
    "Interestingly, VideoCardz observes that Asus V2 models are likely the LHR cards with artificial restrictions on the mining hash rate, and there is an RTX 3090 V2, which might suggest that this GPU could be getting the anti-mining treatment in the future (it isn’t currently). Take that with a huge dose of condiments, though, and remember that EEC filings can be (and indeed often are) speculative placeholders.",
    "One thing is clear, though: that the weight of 3080 Ti rumors (and indeed 3070 Ti ones) is becoming hefty indeed, and therefore increases the seeming likelihood of these refreshes popping up as the rumor mill contends in early June.",
    "We’ve recently also heard about the RTX 3080 Ti and RTX 3070 Ti being spotted in Razer PCs, and already on pre-order (sort of) at a Pakistan-based online retailer.",
    "These Nvidia graphics cards are expected to be first announced on May 31, at the start of next week."
  ],
  "headers": {
    "4": "Asus filings"
  },
  "links": {
    "Nvidia’s RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "ton of rumors lately": "https://www.techradar.com/news/custom-nvidia-rtx-3080-ti-card-listings-suggest-official-launch-is-imminent",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "VideoCardz": "https://videocardz.com/newz/asus-submits-100-new-geforce-rtx-3080ti-rtx-3070ti-lhr-and-cmp-models-to-eec",
    "past images of pallets of MSI’s RTX 3080 Ti Ventus": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-gpu-could-be-closer-to-launch-than-we-thought",
    "rumored to be June 10 and June 3 respectively": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-again-rumored-for-early-june-launch-with-rtx-3070-ti-to-follow",
    "RTX 3080 Ti and RTX 3070 Ti being spotted in Razer PCs": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-and-rtx-3070-ti-already-spotted-in-razer-pcs",
    "Pakistan-based online retailer": "https://www.techradar.com/news/nvidia-rtx-3080-ti-and-rtx-3070-ti-may-be-up-for-preorder-ahead-of-an-actual-announcement"
  }
}