{
  "source": "https://www.techradar.com/news/apple-didnt-embrace-the-touch-bar-so-why-would-it-consider-a-macbook-pro-touch-panel",
  "title": "Apple didn't embrace the Touch Bar, so why would it consider a MacBook Pro touch panel?",
  "category": "computing",
  "updated": "2021-04-02T10:00:04Z",
  "author": "bryan-m-wolfe",
  "summary": "A touch panel keyboard is a great idea, but not on MacBook",
  "article": [
    "Rumors say Apple's throwing in the towel on the often misunderstood MacBook Pro Touch Bar. First introduced on select MacBook Pro models in 2016, Touch Bar is that Retina-quality multi-touch display that always looks great in Apple's television ads, but apparently never caught on with most users.",
    "Now comes word that future MacBooks might replace the entire traditional keyboard with a customizable touch panel. This would be a bad move on Apple's part, although there's at least one scenario where the concept could work, assuming Apple would put in the time.",
    "As I explained just last month, Apple never embraced Touch Bar after its impressive debut almost five years ago. At the time, I assumed the beautiful digital strip would eventually make its way to an overpriced Magic Keyboard and then to the MacBook Air.",
    "Instead, Touch Bar languished on the MacBook Pro. Along the way, companies like Microsoft and Adobe added Touch Bar support to their products, but at no time did Apple celebrate or even mention it in public again. Even more troubling, Touch Bar never received a significant software update to make it better.",
    "I long considered Touch Bar more gimmicky than practical. However, when I finally purchased a MacBook Pro with a Touch Bar, my feelings changed, at least after some effort.",
    "At its core, Touch Bar offers a new way to perform existing, everyday tasks. That’s not at all sexy, especially when there’s a learning curve involved. In the end, it was up to Apple to promote the hell out of the feature, make it better through tweaks, and convince not just MacBook Pro users why it was beneficial. That didn’t happen and now we’re left to ponder Apple’s head-scratching newest patent.",
    "As 9to5Mac was the first to point out, Apple has been granted a patent on a MacBook with a solid-state keyboard (SSK). Essentially a flat glass surface, the keyboard sounds every bit like Touch Bar, but on a massive scale.",
    "Instead of replacing those seldom-used function keys as Touch Bar does, the patented touch panel would replace everything you see right now on your MacBook Pro keyboard. And in a futurist twist, as John Loeffler explained, \"That means if you're doing data entry into a spreadsheet, you can set up a Numpad into one of the SSK's regions or wipe away the keys to turn it into a drawing surface for graphics design tasks. \"",
    "If Apple's patent ever translates into an actual product, I'll be the first in line with my credit card. And yet, I'm dumbfounded by this news.",
    "First, let me say, I don’t expect near future MacBooks to have a solid-state keyboard. Apple, like other tech companies, files and receives countless patents each year for products that never materialize. And yet, there’s a scenario where I could see something similar get developed and make a splash on the market.",
    "A keyboard, just like its trackpad or mouse, is an essential part of any laptop. Screw it up, and individuals react accordingly, just as they did with Apple’s disastrous butterfly keyboard found on previous MacBooks.",
    "Rather than adding an unproven glass panel to future laptops, Apple should first develop a separate Bluetooth keyboard that uses the technology and supports iMac and Mac Pro. By going this route, consumers would choose whether to go all-in with something new — or not.",
    "Under this scenario, Apple should learn from its Touch Bar failures and commit to making the separate keyboard better each year by tweaking its software based on user input and technical advances. Only after millions of consumers excitingly embrace their all-digital (and separate) keyboard should Apple even consider bringing it permanently to the MacBook lineup.",
    "At the same time, I'm all in for Apple to eliminate Touch Bar on some MacBook Pro models. However, it would be a shame to remove it altogether. Keeping Touch Bar around and showing it some love would go a long way for Apple to convince users that digital keys are worth the effort. That renewed focus would be the perfect bridge to an eventual all-digital Bluetooth keyboard.",
    "At least some of Apple's plans will become clear soon. The company is expected to announce a 14-inch MacBook Pro alongside a second-generation MacBook Pro 16-inch model in the coming weeks or months. Stay tuned."
  ],
  "headers": {
    "2": "Apple's failure with Touch Bar",
    "6": "For a touch panel to work"
  },
  "links": {
    "throwing in the towel": "https://www.imore.com/new-2021-macbook-pro-leak-promises-huge-overhaul",
    "Apple's television ads": "https://youtu.be/eW68KSqyURY",
    "future MacBooks might replace the entire traditional keyboard with a customizable touch panel": "https://www.techradar.com/news/apple-wants-to-reinvent-the-keyboard-on-future-macbooks",
    "explained": "https://www.imore.com/defense-macbook-pro-touch-bar",
    "9to5Mac": "https://www.techradar.com/news/apple-wants-to-reinvent-the-keyboard-on-future-macbooks",
    "disastrous butterfly keyboard": "https://www.techradar.com/news/apple-apologizes-for-faulty-macbook-keyboards-yet-again",
    "MacBook Pro 16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021"
  }
}