{
  "source": "https://www.techradar.com/news/prime-day-lego-deals-made-me-do-what-black-friday-didnt-actually-buy-a-set",
  "title": "Prime Day Lego deals made me do what Black Friday didn't - actually buy a set",
  "category": "appliances",
  "updated": "2021-06-21T21:54:51Z",
  "author": "tom-bedford",
  "summary": "I finally caved",
  "article": [
    "I'm the person at TechRadar who covers Lego deals during things like Prime Day and Black Friday. This means I spend ten or more hours a day poring through bricky price-cuts, but despite seeing some great discounts, I've never actually bought a Lego set in the sales...",
    "...until now. You see, the Prime Day Lego deals are a step up from the ones we saw over Black Friday last year, in a big way. There are fewer sets discounted, that's for sure, but the price-cuts that are around, are so much better than we've seen before.",
    "Over Black Friday 2020, the average price cut on a set was about 20%, but I'd say during the current Prime Day sales, around 40% is closer to the mark. We're seeing plenty of sets hit their lowest-ever prices, including some sets that are typically discounted in this kind of sale, but also on some newer kits.",
    "My favorite Lego sets are the Lego Architecture range, and when I caved, I bought a set that I'd been eyeing for a while - that's the London Skyline set. I do live in London, and can see some of its landmarks from where I'm sitting right now, so the new low price of £28 (in my region) made it a must-buy. When doing my research for this article, though, I've just noticed it's hit an even lower price of £23. Oops.",
    "While this is a Prime Day deal in the UK (as the price, and my comments about seeing London landmarks, indicate), there are plenty of similar great ones in the US too, so I'd definitely recommend perusing the Prime Day US Lego deals or Prime Day UK Lego deals for some great temptation.",
    "Actually, you know what? I'm going to peruse Amazon and find some of the best 'oh, why not' deals that might tempt you. Maybe you'll find your own London Skyline - and it beats me having to find any good iPad deals to write about.",
    "(Not in the US or UK? Scroll down for deals in your region).",
    "No matter where you live, you'll find all the lowest prices for certain Lego sets from around the web right here, with offers available in your region."
  ],
  "headers": {
    "7": "More Lego deals",
    "8": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Prime Day US Lego deals": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fs%3Fk%3Dlego%26ref%3Dnb_sb_noss%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1205873032052064500-20",
    "Prime Day UK Lego deals": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fs%3Fk%3Dlego%26ref%3Dnb_sb_noss%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-2184818731675711700-21",
    "iPad deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-ipad-deals-sales-2020"
  }
}