{
  "source": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
  "title": "AMD Radeon RX 6900 XT: everything we know about the RTX 3090 killer",
  "category": "computing",
  "updated": "2021-03-03T14:33:37Z",
  "author": "matt-hanson",
  "summary": "Everything we know about the AMD Radeon RX 6900 XT",
  "article": [
    "The AMD Radeon RX 6900 XT marks Team Red's boldest move yet to steal the high-end GPU market from arch-rival Nvidia. Aimed squarely at enthusiasts who want the very best gaming experiences at ultra-high definitions, this powerful GPU has clearly been developed to go toe-to-toe with Nvidia's powerful RTX 3090.",
    "For the past few years, AMD has concentrated on budget and mid-range GPUs, even getting ready to launch a new Radeon RX 6000 GPU later today that could also be in the mid-range sphere. That makes the arrival of the AMD Radeon RX 6900 XT a welcome one, joining the likes of the AMD Radeon RX 6800 XT and the AMD Radeon RX 6800 to compete against Nvidia’s greatest hits.",
    "With the AMD Radeon RX 6900 XT now officially launched, here's everything we know so far about AMD's exciting new GPU.",
    "When AMD announced the Radeon RX 6900 XT, it also gave us a release date for when we could buy it: December 8, 2020.",
    "That's a few weeks after the November 18 launch of the AMD Radeon RX 6800 XT and AMD Radeon RX 6800 GPUs, which are aimed at more mainstream gamers.",
    "So, if you want AMD's most powerful gaming GPU, you need to hold tight for a little longer. Hopefully when December 8 does roll around, there will be enough stock for everyone who wants one to get one. What we don't want to see is a repeat of the RTX 3080 and RTX 3090 launches, where it was almost impossible to get your hands on one of those GPUs.",
    "AMD is pitching the RX 6900 XT against Nvidia's RTX 3090. That card is one of the most expensive GPUs you can buy, starting at $1,499 (£1,399, around AU$2,030) for Nvidia's Founders Edition.",
    "As we expected, the AMD Radeon RX 6900 XT is priced a bit below that at $999 (about £770, AU$1,400), maintaining AMD's habit of undercutting Nvidia.",
    "One thing to note is that while Nvidia's GPUs come in various variants from other manufacturers, at the moment there's just one model of RX 6900 XT from AMD itself, so there won't be different price points for the GPU.",
    "The AMD Radeon RX 6900 XT, like the other Big Navi GPUs AMD has unveiled, is based on AMD's RDNA 2 architecture, which AMD claims will offer up to 65% better performance per watt with the 6900 XT than the last gen RDNA (which itself offered a 50% increase over its predecessor).",
    "So, if you're upgrading from an older AMD GPU, you should see a big leap in performance.",
    "From AMD's own tests, it looks like the AMD Radeon RX 6900 XT does a good job of matching the RTX 3090 in most games, offering better framerates at 4K and at the highest graphical settings for Battlefield V, Borderlands 3, Call of Duty: Modern Warfare, Forza Horizon 4 and Gears of War 5, while being neck and neck with Doom Eternal, Wolfenstein: Young Blood and Shadow of the Tomb Raider.",
    "We'll be giving the AMD Radeon RX 6900 XT a proper workout to check its performance when we get it in for review.",
    "These are the AMD Radeon RX 6900 XT specs:",
    "Interestingly, the cache and memory are the same as the Radeon RX 6800. Instead, it's the compute units (80 vs 60) and clock speeds (2,015MHz vs 1,815MHz game and 2,250MHz vs 2,105MHz boost) which show the upgrade between the RX 6900 XT and the RX 6800.",
    "As with the Radeon RX 6800 XT, the graphics card comes equipped with 16GB of GDDR6 memory, rather than the GDDR6X memory found in the RTX 3080 and RTX 3090. AMD seems to be betting on the Infinity Cache technology over faster VRAM to radically cut down on memory latency.",
    "If the AMD Radeon RX 6900 XT really can go toe-to-toe with the RTX 3090, while being cheaper and less power-hungry, then Nvidia could be in for a big wakeup call.",
    "AMD Big Navi GPU leak debunks “misleading” power consumption rumor"
  ],
  "headers": {
    "3": "Radeon RX 6900 XT release date",
    "6": "Radeon RX 6900 XT price",
    "9": "Radeon RX 6900 XT specs and performance"
  },
  "links": {
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "launch a new Radeon RX 6000 GPU": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "AMD Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "AMD Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "where it was almost impossible to get your hands on one of those GPUs": "https://www.techradar.com/news/nvidia-admits-defeat-with-rtx-3080-and-3090-founders-edition-stock-passes-baton-to-best-buy",
    "AMD Big Navi GPU leak debunks “misleading” power consumption rumor": "https://www.techradar.com/news/amd-navi-21-gpu-leak-debunks-misleading-power-consumption-rumor"
  }
}