{
  "source": "https://www.techradar.com/news/ps-plus-free-games-for-april-include-days-gone-and-soulstorm",
  "title": "PS Plus free games for April include Days Gone and Soulstorm",
  "category": "gaming",
  "updated": "2021-03-31T16:40:27Z",
  "author": "vic-hood",
  "summary": "Grab them while you can",
  "article": [
    "Sony has officially announced its PS Plus free games lineup for April – and you don't want to miss it.",
    "Up for grabs this month, for PS Plus members, is the previously-confirmed Oddworld: Soulstorm (PS5), PlayStation exclusive Days Gone (PS4) and Zombie Army 4: Dead War (PS4).",
    "Confirmed during Sony's last State of Play, Oddworld: Soulstorm will be available for PS Plus members from the game's launch on April 6. That means PS5 owners can get their hands on the brand new game on day one – as long as you're an active PS Plus subscriber.",
    "In Soulstorm, Abe is back and, once again, this accidental hero turned revolution leader is trying to save his fellow Mudokons. This time there are more than 1000 Mudokons to save and teamwork is the name of the game – with your army of rebels using their collective energy to help Abe solve the various puzzles he encounters.",
    "Soulstorm serves as the second game in the Oddworld quintology – an expanded remake of the classic Oddworld: Abe's Exodus – but promises to look much better than ever before, with 2.9D environments and stunning visuals at a greater scale. What's more, SoulStorm on PS5 utilizes the DualSense controller's haptic feedback, allowing you to feel Abe's heartbeat during moments of suspense.",
    "Also up for grabs is PlayStation's first-party action-survival horror Days Gone which focuses on outlaw-turned-drifter Deacon St John as he battles to survive in a post-apocalyptic world and to be reunited with his wife.",
    "Finally, we have even more zombie fun with Zombie Army 4: Dead War, a third-person shooter from the makers of Sniper Elite, which sees you gunning down zombies in 1940s Europe, either alone or with friends.",
    "Remember, while two of these games are PS4 versions, you can also play any of these PS4 games on PS5 through backwards compatibility – though PS4 players won't be able to play Soulstorm, which is a native PS5 title.",
    "You need to be an active PlayStation Plus subscriber to pick up these free PS Plus games – and they're yours to play whenever you want as long as you remain a subscriber.",
    "Being a PS Plus subscriber means you can play online with friends, but also lets you take advantage of discounts and free games each month. It's a great way to try PlayStation games you might not otherwise have played, whether they're indie titles that slipped under your radar, or titles that were too expensive to buy at launch. Each month we see Sony offering a mix of PS4 and PS5 games, so it's worth getting even if you haven't upgraded yet."
  ],
  "headers": {
    "8": "Never miss PS Plus free games"
  },
  "links": {
    "State of Play": "https://www.techradar.com/news/sony-state-of-play-when-is-the-next-playstation-event-and-what-to-expect",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "backwards compatibility": "https://www.techradar.com/news/what-is-backwards-compatibility-the-key-ps5-and-xbox-series-x-feature-explained"
  }
}