{
  "source": "https://www.techradar.com/news/this-microsoft-teams-update-means-you-dont-have-an-excuse-for-missing-a-meeting-anymore",
  "title": "This Microsoft Teams update means you don't have an excuse for missing a meeting anymore",
  "category": "computing",
  "updated": "2021-10-07T10:45:07Z",
  "author": "mike-moore",
  "summary": "There's no escaping webinars on Microsoft Teams now",
  "article": [
    "Avoiding webinars held on Microsoft Teams may be trickier than ever thanks to a new update to the service.",
    "Microsoft has revealed a pair of upgrades to its video conferencing platform that it hopes will make Teams a more attractive proposition for hosting webinars.",
    "Going forward, attendees to a webinar will see their invite automatically added to their calendar - meaning there's no excuse now for forgetting to attend.",
    "\"When webinars are setup and scheduled, the webinar invite is now automatically added to the attendee's calendar,\" the update's entry on the Microsoft 365 roadmap reads.",
    "The entry adds that the feature is currently in development, and should begin rolling out in December 2021, with all Microsoft Teams users set to receive it.",
    "That isn't all that's coming to Microsoft Teams when it comes to webinars though, as a separate entry also reveals another update that will allow companies or individuals much greater customization when hosting webinars.",
    "Users will soon be able to customize the domain used for any webinar communications such as invitations or changes of date - meaning that when such emails are sent to attendees, both the sender name and email domain will now reflect the tenant name, making it easier for attendees to recognize.",
    "This update will also see general availability, and is set to launch in December 2021.",
    "The upgrades are the latest in a series of changes by Microsoft as it looks to make Teams a more appealing choice not just for webinars, but meetings everywhere.",
    "The platform already boasts a standalone Webinars setting which is able to support thousands of online attendees, including custom registration page and tighter permissioning. Teams is also able to let users host view-only broadcasts for up to 20,000 people.",
    "Microsoft Teams is also now playing a much more central role in Windows 11, showing that the company has big hopes for the software - check out our full Windows 11 review for more."
  ],
  "headers": {
    "3": "Webinars on Teams"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft 365 roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1110335218987584000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3DNew%2520Last%2520Week%252CMicrosoft%2520Teams",
    "standalone Webinars setting": "https://www.techradar.com/news/microsoft-teams-update-wants-to-say-goodbye-to-webinars-forever",
    "view-only broadcasts for up to 20,000 people": "https://www.techradar.com/news/microsoft-teams-takes-another-step-closer-to-becoming-the-only-work-app-you-need",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows 11 review": "https://www.techradar.com/reviews/windows-11"
  }
}