{
  "source": "https://www.techradar.com/news/cisco-is-inching-closer-towards-an-it-as-a-service-model",
  "title": "Cisco is inching closer towards an IT-as-a-service model",
  "category": "computing",
  "updated": "2021-04-12T20:40:45Z",
  "author": "anthony-spadafora",
  "summary": "Networking giant plans to offer more of its portfolio as-a-service going forward",
  "article": [
    "At its recent Cisco Live virtual event, Cisco revealed additional details about its new “Plus” offering that will move it closer towards an IT-as-a-service business model.",
    "As reported by The Register, the new offering will arrive later this quarter and it will allow businesses to buy SaaS and hardware bundles from the company while paying for them under a single subscription. While Cisco or a partner will own and manage the equipment, organizations will pay for an agreed amount of usage with the option to scale up during busy seasons or periods.",
    "At the same time though, the network giant will also offer Cisco Plus for both compute and network-as-a-service.",
    "The Plus compute service will cover UCS servers, storage suppliers (that will be revealed at a later date), Cisco networking equipment and the company's existing SaaS tools. The compute product will also offer different variants for bare metal, edge computing, desktop virtualization, data networking and vanilla server virtualization. The networking-as-a-service component of Cisco Plus will arrive in late 2021 and will focus on SD-WAN.",
    "In a press release announcing Cisco Plus, SVP and GM of the company's enterprise networking and cloud division, Todd Nightingale explained how the new offering will allow it to offer most of its portfolio as-a-service, saying:",
    "“I believe every organization would benefit from simplifying powerful technology. Network-as-a-service is a great option for businesses wanting to shift to a cloud operating model without a heavy lift. Cisco is leading the industry in its approach with Cisco Plus. Together with our partners, we intend to offer the majority of our technology portfolio in the simplest, most flexible way: cloud-driven, cloud-delivered, cloud-managed and as-a-service.”",
    "One somewhat confusing aspect of the new offering is that Cisco Capital already has an offering called EasyLease that allows customers to “bundle hardware, software, subscriptions, services and third-party products on one contract” in a similar way to how Cisco Plus will work. The big difference here though is that EasyLease is aimed at small businesses while Cisco Plus is more geared towards large enterprise organizations.",
    "We'll likely find out more regarding the exact details of how a Cisco Plus subscription will work when it comes closer to the new offering's release date.",
    "Via The Register"
  ],
  "headers": {
    "4": "Cisco Plus"
  },
  "links": {
    "virtual event": "https://www.techradar.com/best/best-virtual-event-platforms",
    "The Register": "https://www.theregister.com/2021/04/09/cisco_plus/",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "Cisco Plus": "https://www.techradar.com/news/cisco-is-now-offering-your-business-everything-as-a-service",
    "desktop virtualization": "https://www.techradar.com/best/best-virtual-machine-software",
    "SD-WAN": "https://www.techradar.com/news/oracle-wants-to-offer-an-alternative-to-traditional-vpn",
    "press release": "https://newsroom.cisco.com/press-release-content?type=webcontent&articleId=2150489#:~:text=%E2%80%94%20Cisco%20Live%20%E2%80%94March%2030%2C,and%20consumption%20models%20to%20customers.",
    "EasyLease": "https://www.cisco.com/c/en_au/buy/payment-solutions/easy-lease.html"
  }
}