{
  "source": "https://www.techradar.com/news/microsoft-says-now-is-the-time-for-all-firms-to-embrace-open-source",
  "title": "Microsoft says now is the time for all firms to embrace open source",
  "category": "computing",
  "updated": "2021-01-19T12:02:25Z",
  "author": "mayank-sharma",
  "summary": "Microsoft is looking forward “to learning, growing, and earning our place in open source.”",
  "article": [
    "Microsoft has once again thrown its weight behind backing the use of open source software in the modern tech world.",
    "A one-time detractor, Microsoft hasn’t just embraced open source, but is also now actively promoting the model, which is essentially the antithesis of the software giant’s proprietary business methodology.",
    "In a recent blog post, Sarah Novotny, Microsoft’s open source lead for the Azure Office of the CTO, shares four lessons the tech industry can learn from open source in this new era of remote-first work spaces.",
    "“2020 fundamentally changed how many companies and teams work…..However, for those of us who have been deeply engaged in open source, remote work has been our norm for many years because open source communities are large, globally distributed, and require effective collaboration from developers around the world,” Novotny wrote.",
    "In the post, Novotny builds upon Microsoft’s recent open source initiatives and how it helps the ecosystem prepare for this pandemic-forced new normal.",
    "She shared that Microsoft’s Open Source Programs Office (OSPO) helped drive the company’s open source effort as the software giant continued to open source more of its technologies. The company also joined the Open Source Security Foundation (OSSF) along with old-time rivals Google and IBM.",
    "Reflecting on Microsoft’s experience with open source Novotny writes “a few years ago if you wanted to get several large tech companies together to align on a software initiative, establish open standards, or agree on a policy, it would often require several months of negotiation, meetings, debate, back and forth with lawyers…” adding that “open source has completely changed this: it has become an industry-accepted model for cross-company collaboration.”"
  ],
  "headers": {
    "4": "Microsoft loves Open Source"
  },
  "links": {
    "open source software": "https://www.techradar.com/best/best-open-source-software",
    "one-time detractor": "https://www.techradar.com/news/microsoft-admits-it-was-wrong-about-linux-and-open-source",
    "Sarah Novotny": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7582599511233987000&xs=1&url=https%3A%2F%2Fcloudblogs.microsoft.com%2Fopensource%2F2021%2F01%2F14%2Ffour-open-source-lessons%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-says-now-is-the-time-for-all-firms-to-embrace-open-source",
    "Azure": "https://www.techradar.com/news/microsoft-promises-huge-improvements-in-azure-uptime",
    "Open Source Security Foundation (OSSF)": "https://www.techradar.com/news/open-source-software-should-soon-be-more-secure-than-ever"
  }
}