{
  "source": "https://www.techradar.com/news/microsoft-has-asked-amd-for-help-in-combating-xbox-series-x-stock-shortages",
  "title": "Microsoft has asked AMD for help in combating Xbox Series X stock shortages",
  "category": "gaming",
  "updated": "2021-01-06T10:02:39Z",
  "author": "vic-hood",
  "summary": "Microsoft is 'working as hard as we can' to increase Xbox Series X/S stock",
  "article": [
    "Nearly two months after the release of the Xbox Series X and Xbox Series S, Microsoft is still struggling to meet demand for its new consoles, with stock shortages expected to carry on until at least April 2021.",
    "But, during a recent appearance on Xbox Live director of programming Larry Hyrb's (AKA Major Nelson) video podcast (via VGC), Xbox boss Phil Spencer assured fans that the company is \"working as hard as we can\" to make more Xbox Series X stock available, with the executive revealing that he has even reached out to AMD to ask if the processor manufacturer could increase production to help with demand.",
    "\"I get some people [asking], ‘why didn’t you build more? Why didn’t you start earlier? Why didn’t you ship them earlier?’ All of those things,” Spencer told Hyrb. \"It’s really just down to physics and engineering. We’re not holding them back: we’re building them as fast as we can. We have all the assembly lines going. I was on the phone last week with Lisa Su at AMD [asking], ‘how do we get more?’ So it’s something that we’re constantly working on.\"",
    "AMD manufactures the GPU and CPU for both the Xbox Series X and Xbox Series S, with the console's custom designed processor made up of an 8 core AMD Zen 2 CPU and an RDNA 2-class GPU. By AMD increasing the production of these chips, more consoles (in theory) could be manufactured by Microsoft.",
    "But it's not just the Xbox consoles that utilize AMD chips. The PS5 also uses an AMD Radeon RDNA 2 GPU and AMD Zen 2-based CPU with 8 cores, and has similarly been plagued by stock shortages since its launch.",
    "“It’s not just us: gaming has really come into its own in 2020,\" Spencer told Hyrb. \"Obviously, PlayStation 5 is in very tight supply. When you look at the graphics cards from AMD and Nvidia… there’s just a lot of interest in gaming right now and console sales are just a sign of that, game sales are a sign of that and hardware is in short supply.",
    "“But we’re working as hard as we can. The teams are incredibly dedicated, and I appreciate people’s patience as we work to build more.”",
    "While Microsoft seems determined to build more consoles, it is inevitably tied by the components required to build them.",
    "Currently, we're seeing an AMD and Nvidia graphics card shortage, which could reportedly continue until February 2021.",
    "According to French publication Cowcotland, both AMD and Nvidia have been hit by GDDR6 supply constraints and will likely continue to face shortages until early next year. This GDDR6 RAM is used in both the PS5 and Xbox Series X consoles - and may be impacting the production of the new consoles.",
    "It’s also possible that component shipments could be further disrupted by global efforts to distribute the Covid-19 vaccine.",
    "But it's not just component shortages that could be affecting console stock shortages: we've also seen scalpers buying consoles as soon as they come into stock before selling them for extortionate prices online.",
    "Microsoft has already stated that it's unlikely to get a handle on Xbox stock issues until at least April this year. Speaking at the Jefferies Interactive Entertainment Virtual Conference in mid-November 2020, Xbox chief financial officer Tim Stuart stated that supply shortages would continue \"as we head into the post-holiday quarter, so Microsoft's Q3, calendar Q1.\" That suggests we won't be seeing a jump in console stock until we're well into 2021 – April at the earliest, but very possibly even later in the year.",
    "\"We'll have supply cranking up over the next, what, four, five, six months,\" Stuart added. \"And that's when I expect to see really that demand profile start to be met.\""
  ],
  "headers": {
    "7": "How long could shortages last?"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/news/xbox-series-s-price-pre-order-specs-live-now",
    "shortages expected to carry on until at least April 2021": "https://www.techradar.com/news/xbox-series-x-stock-issues-could-continue-for-months-says-microsoft-exec",
    "video podcast": "https://youtu.be/rsSwQ1-onzI",
    "VGC": "https://www.videogameschronicle.com/news/spencer-says-xbox-is-working-as-hard-as-we-can-to-make-more-series-x-s-stock/",
    "8 core AMD Zen 2 CPU": "https://www.techradar.com/news/amd-zen-2",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "AMD and Nvidia graphics card shortage": "https://www.techradar.com/news/the-amd-and-nvidia-graphics-card-shortage-could-continue-until-february-2021",
    "Cowcotland": "https://www.cowcotland.com/news/74449/absence-de-cartes-graphiques-amd-rx-5000-6000-nvidia-gtx-1000-rtx-2000-et-rtx-3060-ti-et-3070-la-penurie-globale-de-gddr6-en-cause.htmlhttps://www.notebookcheck.net/Global-GDDR6-shortage-may-prolong-NVIDIA-and-AMD-GPU-supply-woes-at-least-till-Feb-2021-GDDR6X-GPUs-are-less-impacted-but-foundry-space-still-a-concern-for-the-next-few-months.508476.0.html",
    "scalpers buying consoles": "https://www.techradar.com/news/ps5-scalpers-are-probably-the-reason-you-cant-find-sonys-console-in-stock"
  }
}