{
  "source": "https://www.techradar.com/news/slack-clips-wants-to-kill-off-scheduled-meetings-for-good",
  "title": "Slack Clips could kill off scheduled meetings for good",
  "category": "computing",
  "updated": "2021-09-21T12:03:01Z",
  "author": "mike-moore",
  "summary": "No need to wait for everyone to be free for a meeting",
  "article": [
    "The traditional group meeting could be a step closer to being killed off thanks to a new feature from Slack.",
    "The online collaboration platform has revealed Slack Clips - a new addition that it hopes can prove slightly more useful than just typed messages alone.",
    "Built directly into the desktop and mobile Slack platform, Clips does pretty much what you might expect, allowing users to share a brief video clip between contacts or chats.",
    "Announced at Dreamforce 2021, Slack Clips was described by the company as a new way to easily create and share audio, video and screen recordings within any channel or DM in Slack.",
    "The company is hoping that the extra addition of video and audio will give the messages the chance to convey more information, sentiment or even emotion - all helping drive better collaboration.",
    "Slack also hopes the feature will help ease the pain of back-to-back meetings, giving users a \"more flexible and asynchronous way of communicating\" by letting them reply or give feedback in their own time, rather than needing to wait for every member of a team to be available for a scheduled meeting.",
    "Clips can be sped up or slowed down by the recipient, and a transcript will be automatically provided, with archived recordings also available to search through.",
    "\"Building your digital HQ means thinking carefully about the digital infrastructure that connects everyone in your business, helping them find new ways to innovate, collaborate and stay connected,” said Stewart Butterfield, CEO and Co-founder of Slack.",
    "“This is a once in a generation opportunity for every company to reinvent themselves and make work more flexible, inclusive and productive. There could not be a more exciting time for Salesforce and Slack to come together to help every company find success in this new digital-first world.”",
    "Clips will begin rolling out to Slack users from today, with all paid teams seeing the feature within the next few weeks.",
    "The launch follows the release of Slack Huddles back in July 2021, which offered an quick and easy way to set up group audio calls that anyone could contribute to."
  ],
  "headers": {
    "3": "Slack Clips"
  },
  "links": {
    "Slack": "https://www.techradar.com/reviews/slack",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Slack Huddles": "https://www.techradar.com/news/slack-is-getting-a-major-overhaul-for-the-hybrid-working-future"
  }
}