{
  "source": "https://www.techradar.com/news/apple-receives-backlash-over-threat-to-remove-popular-amphetamine-app",
  "title": "Apple receives backlash over threat to remove popular Amphetamine app",
  "category": "computing",
  "updated": "2021-01-04T11:54:46Z",
  "author": "jess-weatherbed",
  "summary": "What a wake-up call",
  "article": [
    "Apple has backtracked on threats to remove the popular app Amphetamine from the Mac App Store, having previously cited that naming and imagery connected to the application broke community guidelines.",
    "The developer William Gustafson was asked to update the app icon and name, otherwise it would be removed from the App Store on January 12.",
    "Amphetamine is a free utility Mac app that allows users to set a time for their machine to remain awake, and is particularly useful for things like long downloads or keeping other apps running. It was launched back in 2014 and has proved extremely popular, currently sitting at over 430,000 downloads and a rating of 4.8 out of five.",
    "Gustafson reported on Github that an Apple representative had been in contact to inform him that the app was in violation of guideline 1.4.3 related to consumption of tobacco and vape products, illegal drugs, or excessive amounts of alcohol.",
    "Gustafson argues that Amphetamine doesn't actually promote the use of illegal drugs, with the medication being widely prescribed by doctors for a variety of conditions in adults and children. He also went on to state that the community guidelines had been unfairly and inconsistently applied, with apps that do promote inadvisable or illegal drug use being found readily available for download on the App store The full community guideline reads: \"Apps that encourage consumption of tobacco and vape products, illegal drugs, or excessive amounts of alcohol are not permitted on the App Store. Apps that encourage minors to consume any of these substances will be rejected. Facilitating the sale of marijuana, tobacco, or controlled substances (except for licensed pharmacies) isn’t allowed.\"",
    "Following the contact, Gustafson set up a Change.org petition to save the Amphetamine app from removal, receiving 555 signatures before the request was overturned.",
    "Confusion has been expressed over why the demands were made at all, with the app being previously spotlighted in an App Store feature and Gustafson confirming frequent interactions with Apple representatives that had not made light of issues previously. It's also unclear if any further action will be taken to improve the guideline application issues mentioned in his Github report, with several apps being named that outright glorify or promote irresponsible use of both legal and illegal substances.",
    "Via MacRumors"
  ],
  "headers": {
    "3": "Hard to swallow"
  },
  "links": {
    "Mac App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7849172830321480000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Famphetamine%2Fid937984704%3Fmt%3D12",
    "William Gustafson": "https://github.com/x74353/SaveAmphetamine",
    "Amphetamine": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2339389031368439000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Famphetamine%2Fid937984704",
    "Gustafson reported on Github": "https://github.com/x74353/SaveAmphetamine",
    "guideline 1.4.3": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2730458988384397000&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fapp-store%2Freview%2Fguidelines%2F",
    "Change.org": "https://www.change.org/p/apple-save-amphetamine-app",
    "App Store feature": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1385664271801989000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fstory%2Fid1470456860",
    "MacRumors": "https://www.macrumors.com/2021/01/02/amphetamine-app-store-removal-threat/"
  }
}