{
  "source": "https://www.techradar.com/news/oneplus-commits-to-three-years-of-android-updates-for-its-flagship-phones",
  "title": "OnePlus commits to three years of Android updates for its flagship phones",
  "category": "phones",
  "updated": "2021-07-03T10:00:29Z",
  "author": "david-nield",
  "summary": "OxygenOS, meet ColorOS",
  "article": [
    "OnePlus has posted an updated guide to Android updates for its flagship phones, including the OnePlus 9, promising that from hereon in it will provide three years of Android updates and four years of security updates for its premium handsets.",
    "The news comes via a forum blog post, in which a OnePlus team member outlines the new approach. The three years of updates will apply to the \"flagship product line\" (including the T and R variants), going back to last year's OnePlus 8 devices.",
    "Phones in the mid-range Nord series, starting with the original OnePlus Nord from last year, are going to get two years of Android updates together with three years of security patches. For the cheaper Nord N models, it's one year of Android updates and three years of security updates.",
    "It's worth noting that OnePlus refers to \"major Android updates\" rather than \"years\" but as Android gets a major refresh every 12 months it's more or less the same metric. Phones older than the OnePlus 8 will stick to two major Android updates and three years of security updates, as previously announced.",
    "The move is a direct result of the merger between OnePlus and Oppo – two phone brands that were already owned by the same parent company anyway. The OxygenOS software developed by OnePlus will be combined with the ColorOS software developed by Oppo on future OnePlus handsets.",
    "Both OxygenOS and ColorOS are based on Android, but as for which bits of each one will be kept, we'll have to wait and see. At this stage it's not fully clear what the merger will mean for phone buyers, but you can still expect both OnePlus and Oppo handsets to appear in the future.",
    "\"This is a change that you will likely not even notice since it’s happening behind the scenes,\" explains the blog post. \"We now have a larger and even more capable team of developers, more advanced R&D resources, and a more streamlined development process all coming together to improve the OxygenOS experience.\"",
    "OxygenOS is definitely one of the better Android skins out there at the moment, so we're hoping that there aren't too many drastic changes to it going forward. Knowing that three years of updates are guaranteed is definitely going to make phones like the OnePlus 9T more appealing to buyers.",
    "Via 9to5Google"
  ],
  "headers": {
    "4": "A software Oppo-rtunity"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "blog post": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-8908366539907103000&sharedId=trd-us&u=https%3A%2F%2Fforums.oneplus.com%2Fthreads%2Fupdate-to-the-oxygenos-codebase-and-software-maintenance-schedule.1462181%2F",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Nord N": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "the merger between OnePlus and Oppo": "https://www.techradar.com/news/oneplus-is-merging-with-oppo-heres-what-that-could-mean-for-android-phones",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "9to5Google": "https://9to5google.com/2021/07/02/oneplus-android-update-schedule-years-oxygenos-coloros/"
  }
}