{
  "source": "https://www.techradar.com/news/forspoken-devs-aiming-for-highest-quality-visuals-ever-seen-in-an-open-world-game",
  "title": "Forspoken devs aiming for ‘highest quality visuals ever seen in an open world game'",
  "category": "gaming",
  "updated": "2021-06-23T17:24:32Z",
  "author": "emma-boyle",
  "summary": "Using AMD technology",
  "article": [
    "Luminous Productions, the developer behind upcoming game Forspoken, has revealed that it has big ambitions for the game, particularly with regards to its visuals.",
    "Speaking in a recent video for AMD’s FidelityFX Super Resolution technology (via GamesRadar), Luminous Production’s studio head and general manager, Takeshi Aramaki says that when it comes to Forspoken, his studio is “aiming to achieve the highest quality visuals ever seen in an open world game.”",
    "According to Aramaki, “Implementing cutting edge AMD technology in the development of Forspoken is an embodiment” of his studio’s philosophy “‘to create games unlike anything experienced before, fusing the world’s latest technologies with art.’” As we’ve previously reported, AMD’s FidelityFX Super Resolution is essentially its answer to Nvidia’s DLSS technology and it has the potential to boost PS5 and Xbox Series X performance as well as PC.",
    "Aramaki goes on to explain that “high frame rates at 4K is important for providing the best possible experience when playing Forspoken” and that while “very precise optimization is required to achieve this”, using AMD’s upscaling tech provides “a significant performance boost when running Forspoken at 4K 60fps”. FSR is, he says, \"an ideal upscaling solution due to its compatibility with various platforms and its extremely fast processing speeds.\"",
    "The studio head rounds up the segment by saying that he \"can't wait for players to get their hands on Forspoken and experience the next-gen graphics that were made possible by FSR.\"",
    "In an effort to illustrate what Aramaki is saying, the video is peppered with Forspoken gameplay which, while technically new, shows off areas largely similar to those in the previous Forspoken trailer.",
    "Forspoken was one of several big games that were notably absent from E3 2021, as Square Enix’s showcase didn’t feature the game and Sony sat out the show entirely. Originally titled Project Athia, Forspoken is somewhat shrouded in mystery at the moment and the last we really saw of it was during a Square Enix Presents stream in March of this year.",
    "You can see the latest full-length trailer that we have for the game below:",
    "At the moment, Forspoken has a release window of 2022. When the game does launch, it’ll be available on PS5 and PC."
  ],
  "headers": {
    "6": "Unspoken"
  },
  "links": {
    "Forspoken": "https://www.techradar.com/news/forspoken-release-date-trailers-news-and-rumors",
    "AMD’s FidelityFX Super Resolution": "https://www.techradar.com/news/amd-unleashes-fsr-to-take-on-nvidia-dlss-but-launch-titles-may-disappoint",
    "GamesRadar": "https://www.gamesradar.com/forspoken-video-shows-off-new-graphics-tech-and-a-little-more-gameplay/",
    "previously reported": "https://www.techradar.com/news/amd-fidelityfx-super-resolution-could-boost-ps5-and-xbox-series-x-performance",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "notably absent from E3 2021": "https://www.techradar.com/news/the-big-games-missing-from-e3-2021",
    "last we really saw of it": "https://www.techradar.com/news/ps5-exclusive-project-athia-has-a-new-name",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}