{
  "source": "https://www.techradar.com/news/microsoft-offers-glimpse-of-new-non-subscription-office-products",
  "title": "Microsoft offers glimpse of new non-subscription Office products",
  "category": "computing",
  "updated": "2021-04-24T11:17:01Z",
  "author": "mayank-sharma",
  "summary": "But these Office packages are only for select users, suggests Microsoft",
  "article": [
    "Microsoft has put out the first preview releases of a couple of its new non-subscription Office products for business users.",
    "The two products are Microsoft Office Long Term Servicing Channel (LTSC) for Windows and Office 2021 for Mac.",
    "In a blog post announcing the previews, Microsoft explains the LTSC products are intended for large enterprises and public sector organizations only, not for general users.",
    "“The next perpetual version of Office for commercial customers is built specifically for organizations running regulated devices that cannot accept feature updates for years at a time, process control devices that are not connected to the internet in manufacturing facilities, and specialty systems that must stay locked in time and require a long-term servicing channel,” said Microsoft.",
    "Like other LTSC products from the Redmond-based software giant, Office LTSC will be supported for five years and will be governed by the Fixed Lifecycle Policy.",
    "Microsoft also added that, just like Office 2019, Office LTSC will be deployed only through its Click-to-Run deployment technology.",
    "On the other hand, Office 2021 for Mac will use the standard Apple pkg Package format, which the company has used for earlier perpetual Mac releases, namely Office 2019 and Office 2016 for Mac.",
    "As per the announcement, Office LTSC will include features from past Office releases and combine them with a subset of new features available in Microsoft 365 Apps for enterprise.",
    "Also, while Office LTSC will include Word, Excel, PowerPoint, Outlook, OneNote and other key apps, it won’t won't ship with the Skype for Business client. Instead the Teams app will be included with the offering, though users will have the option of downloading the Skype for Business client from the Microsoft Download Center."
  ],
  "headers": {
    "4": "Long term release"
  },
  "links": {
    "Office products": "https://www.techradar.com/news/buy-microsoft-office-prices",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1163610261075405800&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-365-blog%2Fcommercial-preview-of-microsoft-office-long-term-servicing%2Fba-p%2F2260013&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-offers-glimpse-of-new-non-subscription-office-products",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Word": "https://www.techradar.com/best/word-online-courses",
    "Excel": "https://www.techradar.com/best/excel-online-courses",
    "PowerPoint": "https://www.techradar.com/reviews/microsoft-powerpoint",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "OneNote": "https://www.techradar.com/reviews/microsoft-onenote",
    "Skype for Business": "https://www.techradar.com/reviews/microsoft-skype-for-business",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams"
  }
}