{
  "source": "https://www.techradar.com/news/huawei-p50-will-launch-worldwide-but-not-until-2022",
  "title": "Huawei's flagship P50 will launch worldwide (but not until 2022)",
  "category": "phones",
  "updated": "2021-10-21T22:51:20Z",
  "author": "james-peckham",
  "summary": "Huawei has confirmed it won't land until 2022",
  "article": [
    "The Huawei P50 and P50 Pro - the brand's top of the line, flagship phones - hit the Chinese market in July this year, and they're coming soon to a store near you. The company has confirmed to TechRadar that it plans to release them in other markets in 2022.",
    "During a briefing on the new Huawei Nova 9, the company confirmed it would bring its flagship series of phones for 2021 to other markets in 2022. It has yet to share which markets those will be.",
    "Huawei didn’t give a specific date on when we can expect the smartphones. A representative for the brand said, \"I can confirm that, early next year we will bring P50 series to consumers overseas.\"",
    "The wording of P50 series suggests that both the Huawei P50 and Huawei P50 Pro will be launching in other markets outside of China.",
    "Previously, the company has sold its flagship phones in the UK, but it doesn't often release its devices in the United States or Australia. We'd expect the P50 series to come to some European markets, but exact areas are yet to be confirmed.",
    "The Huawei P50 Pro has some great specs on paper, with a 6.6-inch display, a top-end Qualcomm Snapdragon 888 chipset and a 50MP main camera. That's paired with a 64MP telephoto camera that's capable of 3.5x optical zoom, a 13MP ultrawide shooter and a 40MP black and white camera.",
    "It's no secret that Huawei is in an odd situation where it's had to switch away from traditional Android software and embrace its own HarmonyOS platform after the Huawei ban.",
    "While this new software is growing rapidly, it's still a tough sell for many who are used to the benefits of the Android platform and, perhaps more importantly, the Google Play Store. HarmonyOS is growing, but is it good enough for those who want access to as many apps as possible?",
    "That's likely why Huawei hasn't been in a rush to sell its new flagship series outside of China. The brand is still thriving in its home market with its latest flagship smartphones, so Huawei has looked to other areas of its business such as computing, audio and wearables when pushing products in locations like Europe.",
    "But for anyone who is keen on Huawei phones, it's a shame that the P50 hasn't been made available sooner.",
    "Early 2022 will likely bring the next wave of top-end Android phones like the Samsung Galaxy S22, Xiaomi 12, Oppo Find X4 and OnePlus 10, so there will be a lot of tough competition when the Huawei P50 series does land."
  ],
  "headers": {
    "6": "Analysis: Why release six months late?"
  },
  "links": {
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "Huawei Nova 9": "https://www.techradar.com/news/huawei-nova-9-announced-as-a-pixel-6-rival-with-two-big-issues",
    "HarmonyOS": "https://www.techradar.com/news/harmonyos-2",
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Oppo Find X4": "https://www.techradar.com/news/oppo-find-x4",
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10"
  }
}