{
  "source": "https://www.techradar.com/news/the-google-pixel-watch-shows-up-again-in-newly-leaked-marketing-images",
  "title": "The Google Pixel Watch shows up again in newly leaked marketing images",
  "category": "wearables",
  "updated": "2021-12-05T19:30:37Z",
  "author": "david-nield",
  "summary": "Take a peek",
  "article": [
    "The rumor buzz is building, and it seems as though the Google Pixel Watch might finally become a real and released product in the near future. Now we've got some leaked marketing materials that give us another look at the purported design of the upcoming Wear OS smartwatch.",
    "The fuzzy images come courtesy of well-known tipster Jon Prosser and Front Page Tech, and are apparently official promotional renders made by Google – so we might see these pictures again when the wearable actually launches.",
    "These new pictures match up with unofficial renders we saw earlier this year from the same source, with the Pixel Watch sporting a very minimal design and barely anything in the way of bezels around the side of the screen.",
    "What we don't get here are any details of the smartwatch's specs or dimensions – it's just the visuals for now. We'll have to wait to find out what sort of colors the Pixel Watch is going to be offered in, how much you should expect to pay for it, and so on.",
    "What we do know is that the wearable is going to come running Wear OS: Google will be hoping that the Pixel Watch acts as a showcase for the capabilities of its software in the same way that the Pixel phones are standard bearers for the potential of Android.",
    "A few days ago we heard that the Pixel Watch might finally be seeing the light of day at some point during 2022, though it's been talked about for years at this point. It's possible that Google's acquisition of Fitbit is part of the reason that the device is finally being pushed from being developed to actually getting a launch.",
    "It seems as though it's a question of when rather than if the Pixel Watch launches at this point, and we're glad that it's on the way: Google has been neglecting Wear OS in recent years, until the major update this year, and the new wearable should hopefully mean that the smartwatch software gets more time and effort invested in it.",
    "The Pixel Watch is coming into a very strong market though. There are some excellent smartwatches out there at the moment – not least the Apple Watch, which through seven generations has been refined and improved to be a genuinely useful and stylish gadget.",
    "We also see top-tier smartwatches from Garmin appear every year as well, right across the spectrum in terms of features and pricing. Garmin wearables appeal to everyone from casual runners to serious outdoor enthusiasts, and are packed with functionality.",
    "Fitbit, which is now owned by Google, makes both the Sense and the Versa smartwatches as well as its many fitness trackers, and let's not forget the Wear OS-powered Galaxy Watch 4 and Galaxy Watch 4 Classic from Samsung. Add in other Wear OS timepieces like the Fossil range, and the Pixel Watch is going to have to work hard to stand out."
  ],
  "headers": {
    "3": "With added Fitbit",
    "6": "Analysis: the smartwatch market is more competitive than ever"
  },
  "links": {
    "Google Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "Jon Prosser": "https://www.youtube.com/watch?v=tT6Y-u1Q9_c",
    "at some point during 2022": "https://www.techradar.com/news/report-google-pixel-watch-coming-in-2022",
    "talked about for years": "https://www.techradar.com/news/google-pixel-watch-could-be-coming-alongside-the-pixel-4",
    "Google's acquisition of Fitbit": "https://www.techradar.com/news/5-likely-reasons-why-google-just-bought-fitbit",
    "the major update this year": "https://www.techradar.com/news/wear-os-3-name-announced",
    "Apple Watch": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Versa": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review",
    "Fossil": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch"
  }
}