{
  "source": "https://www.techradar.com/news/manfrottos-move-system-solves-a-frustrating-problem-with-camera-tripods",
  "title": "Manfrotto's Move system solves a frustrating problem with camera tripods",
  "category": "cameras",
  "updated": "2021-10-06T10:50:38Z",
  "author": "mark-wilson",
  "summary": "A versatile new system for hybrid shooters",
  "article": [
    "If you've been looking for a less frustrating way to switch your camera between tripods, gimbals and sliders, the new Manfrotto Move system is here to smooth the often bumpy process.",
    "Quick release tripod plates for stills photographers are already pretty common, and let you slide out the base plate if you want to do some handheld shots. But the issue for hybrid shooters, or videographers with lots of different stabilizers, is that tripod heads often vary between each piece of kit, making it a pain to switch between them.",
    "The Manfrotto Move system aims to solve this with its new 'Move Quick Release Catcher', which is effectively a universal head that you can attach to all kinds of equipment, including tripods and gimbals. Naturally, Manfrotto has released some of its own accessories for the system, too.",
    "The Move Quick Release Catcher connects to most camera equipment, as it has a universal 3/8-inch thread connector plus a 1/4-inch thread adapter. The idea is that you'll have multiple Quick Release Catchers attached to your stabilizing kit, meaning you can just quickly move your camera between them.",
    "This means you could, for example, take some static video on a tripod, before moving over to a camera slider, followed by a gimbal for some smooth tracking shots. To do this, you'd just twist the X-lock to release the top plate, then click that plate into another Move Catcher to lock it in. The latter weighs 220g, but can support payloads of up to 20kg.",
    "While you can use the Move Quick Release Catcher with existing kit, Manfrotto is also aiming to tempt you to upgrade with its first Move accessories. These include the Manfrotto Gimboom, which as the name suggests is a boom arm for cameras and lights, and the modular Manfrotto Gimbal 300XM.",
    "The latter's remote control handle can actually be attached to the base of the Gimboom, giving you a two-meter reach with all of the same gimbal functionality. The gimbal's head can also be mounted on tripods and sliders, while retaining a wireless connection to the handle, to make a pretty versatile run-and-gun shooting system.",
    "You can buy the Manfrotto Quick Release Catcher for $99.99/£91.95, while the Manfrotto Gimbal 300XM ($669.99/£611.95), Gimboom ($189.99/£99) and Gim-pod ($89.99/£71.95) are also all available right now.",
    "The idea of a universal quick-release system for camera grips isn't a brand new, but the Manfrotto Move system is the most fully-fledged example of it we've seen so far.",
    "Clearly, it isn't designed for beginners who are at the start of their video-shooting careers, or those who only ever rely on one type of tripod head. But it does look like a versatile setup for filmmakers who regularly move between kit like sliders and gimbals, and are frustrated by the friction involved in doing this.",
    "You'll likely need a few Quick Release Catchers ($99.99/£91.95) to start with and that alone won't be cheap – and this is before you look at Manfrotto's other accessories, like the Gimbal and Gimboom.",
    "But filmmakers might consider the extra speed and versatility that this setup brings to be worth the cost, particularly as the initial outlay could be a one-time cost that lasts for years if the Manfrotto Move system takes off.",
    "The Quick Release Catcher's 360-degree range of motion and ability to support 20kg payloads could also boost its appeal, and open it up to further additions to the system in the future."
  ],
  "headers": {
    "8": "Analysis: A promising, if pricey, new system for pros"
  },
  "links": {
    "Quick release": "https://www.techradar.com/news/the-a-to-z-of-photography-quick-release"
  }
}