{
  "source": "https://www.techradar.com/news/the-witcher-monster-slayer-hit-a-million-downloads-already-but-its-no-pokemon-go",
  "title": "The Witcher: Monster Slayer hit a million downloads already, but it's no Pokémon Go",
  "category": "phones",
  "updated": "2021-07-29T14:33:49.021Z",
  "author": "tom-bedford",
  "summary": "A million in a week",
  "article": [
    "On July 21, The Witcher: Monster Slayer launched as another mobile game to take on the huge Pokémon Go in the traveling-ARG genre. It suffered from server issues on launch day stopping fans from playing the game for hours or even the best part of the day - but that doesn't seem to have impacted downloads.",
    "App analyst firm Sensor Tower provided data to TechRadar on the app's downloads for its first week of existence.",
    "It says the game \"has generated more than 1 million downloads globally across the App Store and Google Play in its first week\". Judging by public data on Sensor Tower's website, these downloads were heavily skewed towards Android players.",
    "So that spells a bright forecast for The Witcher's mobile game - at least, brighter than the day-one reception did.",
    "It's worth pointing out, though, that downloads isn't the same as concurrent players, so just because people are downloading the game doesn't mean they're playing it.",
    "At the time of writing, on the Google Play Store UK Monster Slayer sits at position 90 on the Top Grossing games chart and 16 on the Top Free games. The game is lower on the Apple App Store in the UK, where it's ranked 183 in the top free games.",
    "The Witcher: Monster Slayer follows similar games tied to popular franchises like Minecraft, Harry Potter and Jurassic Park, in trying to take on Niantic's hugely successful Pokémon Go. That game was well publicized for hitting 10 million downloads in seven days, which is ten times The Witcher's stats.",
    "Of course, The Witcher isn't exactly as big a franchise as Pokémon, but Go's true strength was its stopping power, as the app has only become more popular over subsequent years (after a steep year-one drop-off). In 2020, the game had 166 million players and hit over 1 billion downloads in total, according to these stats.",
    "So will The Witcher: Monster Slayer grow? Hopefully, but there's reason to believe otherwise, as it seems interest has slowly waned since launch.",
    "For example on July 21, on the Play Store, the game received 429 reviews, consisting of 293 positive and 136 negative (that latter stat likely high because of download issue complaints).",
    "One week on, there were 180 fresh reviews, with 96 positive and 84 negative.",
    "This reduction of fan interaction is also notably in Google Trends, which shows a peak in search for 'The Witcher: Monster Slayer' on July 21. On July 26, it was only at 36% of that stat.",
    "Concurrent player numbers are hard to get for mobile games, and unfortunately, they're the key metric in judging popularity. Only time will tell if The Witcher's mobile game grows like Pokémon Go, or sinks like Minecraft Earth, Jurassic World Alive or Harry Potter: Wizards Unite."
  ],
  "headers": {
    "6": "Analysis: It's not yet Pokémon Go"
  },
  "links": {
    "Pokémon Go": "https://www.techradar.com/news/gaming/pokemon-go-updates-everything-you-need-to-know-about-what-s-coming-next-1330140",
    "Sensor Tower": "https://sensortower.com/",
    "hitting 10 million downloads in seven days": "https://sensortower.com/blog/pokemon-go-download-record",
    "according to these stats": "https://www.businessofapps.com/data/pokemon-go-statistics/"
  }
}