{
  "source": "https://www.techradar.com/news/jeff-kaplan-leaves-blizzard-entertainment-ahead-of-overwatch-2",
  "title": "Jeff Kaplan leaves Blizzard Entertainment ahead of Overwatch 2",
  "category": "gaming",
  "updated": "2021-04-20T18:57:42Z",
  "author": "samuel-tolbert",
  "summary": "From one adventure to the next",
  "article": [
    "Blizzard Entertainment vice president and game director of Overwatch 2 Jeff Kaplan is leaving the company. An announcement today from Blizzard Entertainment indicated that leadership will pass to Aaron Keller, another member of the team at Blizzard working on Overwatch.",
    "On Kaplan leaving, Keller stated that \"Jeff’s been a great leader, mentor, and friend, and he knows how much we’re going to miss him.\" Kaplan also added that work is continuing on Overwatch 2, with more \"frequent updates\" on the game's progress coming soon.",
    "Attached to the announcement was a comment from Kaplan, which you can read below.",
    "\"i am leaving Blizzard Entertainment after 19 amazing years.",
    "it was truly the honor of a lifetime to have the opportunity to create worlds and heroes for such a passionate audience. i want to express my deep appreciation to everyone at blizzard who supported our games, our game teams and our players. but i want to say a special thanks to the wonderful game developers that shared in the journey of creation with me.",
    "never accept the world as it appears to be. always dare to see it for what it could be. i hope you do the same.\"",
    "Overwatch 2 isn't launching in 2021, much like upcoming action-RPG Diablo 4. At the earliest, it seems like these games will be available in 2022, though the global pandemic has introduced numerous challenges to game development and it's really anyone's guess right now.",
    "Earlier this year at BlizzConline 2021, the team at Blizzard Entertainment showed off more concept art and new costumes for the various heroes, while giving a deep dive into the development process of the game.",
    "Whenever Overwatch 2 launches, it'll be available on PC, Xbox Series X, Xbox Series S, Xbox One, PS5, PS4 and PC."
  ],
  "headers": {
    "6": "What's next for Overwatch?"
  },
  "links": {
    "Overwatch 2": "https://www.techradar.com/news/overwatch-2-release-date-features-and-rumors",
    "announcement": "https://playoverwatch.com/en-us/news/23665015/",
    "isn't launching": "https://www.techradar.com/news/overwatch-2-and-diablo-4-release-dates-slip-beyond-2021",
    "development process": "https://www.techradar.com/news/overwatch-2-team-wants-the-game-to-be-a-worthy-successor-and-a-true-sequel",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}