{
  "source": "https://www.techradar.com/news/microsoft-is-making-hololens-2-available-for-more-industries",
  "title": "Microsoft is making HoloLens 2 available for more industries",
  "category": "computing",
  "updated": "2021-04-07T20:53:29Z",
  "author": "anthony-spadafora",
  "summary": "HoloLens 2 Industrial Edition can be used in restricted and regulated environments",
  "article": [
    "Businesses are devising even more potential use cases for the HoloLens 2 mixed reality headset which is why Microsoft has created a new edition capable of operating in restricted and regulated environments.",
    "The software giant decided to create the HoloLens 2 Industrial Edition based on feedback from customers in the semiconductor and pharmaceutical industries that require a device capable of meeting particle emissions standards to enter and operate in highly controlled clean room environments.",
    "For this reason, the company's new edition of its untethered mixed reality device is clean room compatible with an ISO 1464401 Class 5-8 rating as well intrinsic safety certified with a UL Class I, Division 2 rating.",
    "The HoloLens 2 Industrial Edition is also supported with a two year warranty and a Rapid Replacement Program which minimizes downtime with advance exchange and expedited shipping.",
    "With the HoloLens 2 Industrial Edition, organizations can now use Microsoft's mixed reality headset in restricted environments without having to modify their space, protocols or workflows. The headset is also supported with a robust ecosystem of both first and third party mixed reality applications that are backed by the reliability, security and scale of Azure.",
    "Workers in regulated environments will be able to use the HoloLens 2 Industrial Edition to access remote experts using video conferencing software, complete tasks faster with interactive 3D guides and onboard new employees faster using a “learning by doing” approach.",
    "HoloLens 2 Industrial Edition is now available for pre-order in markets where HoloLens 2 is already available and the device will begin shipping in the spring of this year."
  ],
  "headers": {
    "4": "HoloLens 2 Industrial Edition"
  },
  "links": {
    "HoloLens 2": "https://www.techradar.com/reviews/microsoft-hololens-2",
    "HoloLens 2 Industrial Edition": "https://www.techradar.com/news/microsoft-hololens-2-is-getting-an-industrial-edition-for-hardcore-environments",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "pre-order": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-5964298305009567000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fhololens%2Fbuy"
  }
}