{
  "source": "https://www.techradar.com/news/nintendo-switch-was-a-make-or-break-product-says-former-nintendo-president",
  "title": "Nintendo Switch was ‘a make or break product’, says former Nintendo president",
  "category": "gaming",
  "updated": "2021-02-01T17:03:28Z",
  "author": "adam-vjestica",
  "summary": "Now shipped 79.87 million consoles worldwide",
  "article": [
    "The Nintendo Switch continues to be a phenomenal success, but as Nintendo of America’s former president Reggie Fils-Aimé has revealed, it basically had to be.",
    "Speaking during an appearance on the New York Gaming Awards Twitch stream (thanks, Nintendo Life), Fils-Aimé admitted that the Nintendo Switch became “a make or break product” for Nintendo after the Wii U’s dire performance, and that helping the company transition to the hybrid console was his defining moment during his 23 years of service.",
    "\"People forget, when the Wii U launched, the performance over that life cycle was so poor, I mean it was the worst-selling platform, I think maybe Virtual Boy was a little bit worse, but Wii U underperformed pretty radically in the marketplace,\" Fils-Aimé said.",
    "The Virtual Boy sold 770,000 units before being discontinued, and was marketed as the first console capable of displaying stereoscopic 3D graphics. It’s notoriously Nintendo’s biggest failure in the console space to date.",
    "Speaking about his proudest moment, Fils-Aimé went on to add: \"...for the company to come up with the concept, to bring it to life, to bring it to the marketplace, to have not only great first-party content but great third-party and independent developer content - that is going to be something I will always be proud of,” Fils-Aimé said. \"Along with so many of the other things I was part of, but the Switch really was a make or break product for the company and luckily it was a hit.\"",
    "After the poor sales of the Wii U, which shifted a mere 13 million units, Nintendo was being written off by almost every industry expert and analyst before the Nintendo Switch’s big reveal. However, unlike the Wii U, which many consumers thought was just a quirky add-on to the Wii, the Switch’s selling point was immediately obvious from the outset.",
    "Along with an appealing concept, the Nintendo Switch has benefited from some exceptional first-party titles and strong third-party support. The console has also given new life to numerous Wii U titles that were initially overlooked. It’s helped spur the console onto 79.87 million units shipped (around 74 million sold) and 532.34 million software sales. It’s now surpassed sales of the Nintendo 3DS and become Nintendo’s fifth best-selling console of all time.",
    "If you're interested to see how the Nintendo Switch fares against previous systems from Nintendo, you can check out more sales data here."
  ],
  "headers": {
    "5": "Switch it up"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Life": "https://www.nintendolife.com/news/2021/01/reggie_admits_switch_was_a_make_or_break_product_for_nintendo_after_poor_performance_of_wii_u",
    "Wii U": "https://www.techradar.com/reviews/gaming/games-consoles/nintendo-wii-u-1084120/review",
    "here": "https://www.nintendo.co.jp/ir/en/finance/hard_soft/index.html"
  }
}