{
  "source": "https://www.techradar.com/news/iphone-14-pro-might-still-have-a-notch-after-all",
  "title": "iPhone 14 Pro might still have a notch after all",
  "category": "phones",
  "updated": "2021-10-07T15:15:44Z",
  "author": "james-rogerson",
  "summary": "The notch might be around for a while yet",
  "article": [
    "Several early leaks have suggested that the iPhone 14 Pro and iPhone 14 Pro Max would have a punch-hole camera instead of a notch, but now another leaker is suggesting that’s not quite right.",
    "MacRumors spotted a now-deleted post from leaker @PandaIsBald on Weibo (a Chinese social network). They apparently claimed that it’s “unlikely” that Apple will completely eliminate the notch with the iPhone 14 Pro range, instead possibly using some combination of a smaller notch and a punch-hole.",
    "No more detail than that is given, but we’d speculate that if this is true, then the camera would be in the punch-hole cut-out with the remaining Face ID tech living in a notch. The wording isn't totally clear though, so they might equally mean that there's no punch-hole and just a smaller notch.",
    "Beyond the notch, this same source also apparently said that the iPhone 14 range won’t include under-display Touch ID, meaning that Face ID would presumably be the only biometric security option available on the phones.",
    "That’s not surprising, as while under-display Touch ID has previously been rumored, other recent leaks also suggested it wouldn’t be happening.",
    "As for the notch claims, this leaker has been right before so they may well be right again, but there are several voices saying that the notch is going, and they also come from prominent leakers. It’s also very early for leaks, so really we’d take everything that we’ve heard about the iPhone 14 range so far with a pinch of salt.",
    "At this point it seems very unclear whether there will be a notch on the iPhone 14 Pro range or not, but more sources suggest there won’t be. On top of that, given that @PandaIsBald has deleted their post it’s possible that they don’t have faith in the information they’d received. So there’s still a very high chance that the iPhone 14 Pro won’t have a notch.",
    "What it will likely come down to is whether Apple can put the Face ID components under the display, as while the camera lens itself can fit in a punch-hole, the other sensors and related Face ID tech can’t.",
    "On that front, Ross Young (a leaker with a good track record) said in September that Apple was working on under-display Face ID, but that the tech wasn’t final yet, and that it was still up in the air as to whether Apple would get it sorted in time.",
    "Still, at the very least it sounds like the notch should be smaller, and if the iPhone 14 doesn’t ditch it completely then the iPhone 15 probably will, given that Apple appears to be working hard to achieve this."
  ],
  "headers": {
    "6": "Analysis: notch or no notch?"
  },
  "links": {
    "iPhone 14 Pro": "https://www.techradar.com/news/iphone-14",
    "MacRumors": "https://www.macrumors.com/2021/10/07/iphone-14-hole-punch-design-with-notch-rumor/",
    "has previously been rumored": "https://www.techradar.com/news/iphone-13-may-not-get-in-screen-touch-id-after-all-but-the-iphone-14-might",
    "suggested it wouldn’t be happening": "https://www.techradar.com/news/apple-tested-under-display-touch-id-for-iphone-13-but-dont-expect-it-to-happen",
    "said in September": "https://www.techradar.com/news/iphone-14-pro-looks-even-more-likely-to-have-under-display-face-id"
  }
}