{
  "source": "https://www.techradar.com/news/the-switch-oled-doesnt-need-4k-and-nintendo-did-well-to-ignore-it",
  "title": "The Switch OLED doesn’t need 4K, and Nintendo did well to ignore it",
  "category": "gaming",
  "updated": "2021-07-07T10:00:05Z",
  "author": "henry-st-leger",
  "summary": "Opinion: Nintendo scorns 4K while still bringing the Switch to new heights",
  "article": [
    "The Nintendo Switch OLED is here – or at least it will be relatively soon. Nintendo surprise dropped a reveal trailer on July 6 for the revamped Switch console, which features a 7-inch OLED display instead of the 6.2-inch screen found on the original Switch.",
    "We’d heard about a potential OLED display in a number of leaks and rumors, and seeing those whispers become reality is nothing short of seismic. While the LCD screen of the Nintendo Switch never held it back – having been a bestseller for the four years since its launch – this OLED upgrade is only going to elevate the kind of visual experience possible on the Switch handheld.",
    "But, most importantly, Nintendo opted for a Switch OLED instead of a 4K Switch, and that’s definitely worth paying attention to.",
    "4K resolution is one of the biggest buzz words in consumer technology today. That’s not to say that 4K isn’t an impressive technology – it most certainly is, offering four times the number of pixels of Full HD, and therefore four times the level of detail on a TV, monitor or display.",
    "But it’s also become a shorthand for next-gen, step-up hardware, despite the varying levels of quality across 4K TVs and displays.",
    "4K is, crucially, also a key feature for the latest Sony and Microsoft consoles, the PS5 and Xbox Series X, with even the Xbox Series S offering 4K upscaling – meaning it can process HD games into a semblance of 4K before outputting to a TV, even if the games themselves don't natively support 4K.",
    "Nintendo is something of an outlier in not chasing 4K gaming in the same way as its competitors, being content with HD and Full HD gaming even in a 2021 upgrade to a four-year-old console. It’s easy to connect this to the company’s ‘blue ocean’ strategy, which entails seeking uncharted waters where it isn’t directly competing with the likes of Sony and Microsoft – and that means not trying to offer 4K gaming until it can do so with relative ease, and with confidence in consumer interest in the resolution.",
    "The Switch is a very underpowered machine compared to the other home consoles on the market, not least because it needs to be portable enough to work in handheld. While plenty of AAA games can run on the existing Switch, they largely do so at a lower resolution and frame rate than their PS5 or Xbox Series X counterparts (Doom Eternal is not pretty in handheld mode, trust me).",
    "That doesn’t stop plenty of games looking great on the Switch, though. Breath of the Wild still had a gorgeous and massive open world when it launched back in 2017, and it’s clear that the Switch is able to hold its own in today’s console market, with the specs to play impressive and immersive games, whether that’s a flagship Zelda game or the dungeon crawler Hades.",
    "OLED is a much smarter and more Nintendo-like addition for an upgraded Switch. An OLED panel on the handheld console won’t change how games look when the Switch is docked – which anyway is so dependent on the quality of someone’s television display – but it means portable play is elevated to new heights.",
    "OLED panels are largely superior to LCD ones, with self-emissive pixels that – as the name suggests – can emit their own light without a backlight. This ensures deeper color vibrancy, as well as incredible brightness control. The ability to turn pixels off individually makes for incredibly deep blacks, with a stark contrast in comparison to bright whites and highlights on the screen.",
    "OLED is godsend for gaming, too, given high contrast levels only enhance the colors and outlines of gaming engine graphics – and given that the fast response time of OLED pixels ensures minimal lag and fast, responsive play. Whether you’re shooting arrows in Breath of the Wild 2 or spraying paint at other players in Splatoon 3, the Switch OLED should only feel better to play.",
    "There's a reason OLED is used in almost every premium television range, from LG and Sony to Panasonic and Vizio. OLED images are very hard to beat, at least without very impress backlighting setups that can recreate the brightness control and contrast of an OLED screen, none of which is really possible on a display as small as this.",
    "The handheld display is something that Sony and Microsoft simply don’t offer – outside of cloud gaming on mobile devices, of course, which is still dependent on the phones and tablets made by other manufacturers, or at least not in tandem with these companies’ gaming divisions.",
    "So it makes perfect sense for Nintendo to lean into this unique property of its console, making it even better, leaning into the Switch’s inherent strengths.",
    "Of course, an OLED panel won’t fix every problem, or even be for everyone. The underlying performance of the existing Switch likely won’t change much with this new iteration, and anyone with a 2017-era console may find little reason to upgrade. That’s absolutely fine.",
    "But for those wanting an uptick in visuals ahead of BOTW 2, or coming to the Switch console family for the first time, the Switch OLED takes a measured look at the future and chooses sensible improvements over high-resolution races it simply can’t win."
  ],
  "headers": {
    "3": "The temptation of 4K",
    "9": "The blessing of OLED",
    "13": "Nintendo takes success into its own hands"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "4K gaming": "https://www.techradar.com/news/at-ces-2021-4k-gaming-laptops-are-finally-starting-to-die-off/news/gaming/5-best-4k-games-the-best-looking-titles-to-play-in-4k-1296513",
    "PS5 or Xbox Series X": "https://www.techradar.com/news/ps5-vs-xbox-series-x-which-next-gen-console-should-you-buy",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Zelda game": "https://www.techradar.com/news/breath-of-the-wild-2/news/best-legend-of-zelda-games-you-can-play-on-switch-right-now",
    "Hades": "https://www.techradar.com/news/hades-on-nintendo-switch-is-the-most-addicted-ive-ever-been-to-a-video-game",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
    "cloud gaming": "https://www.techradar.com/news/choosing-the-right-cloud-gaming-service-for-you"
  }
}