{
  "source": "https://www.techradar.com/news/iphone-cant-sideload-apps-heres-why-according-to-tim-cook",
  "title": "iPhone can’t sideload apps – here’s why according to Tim Cook",
  "category": "phones",
  "updated": "2021-04-06T05:00:42Z",
  "author": "david-lumb",
  "summary": "Apple CEO Tim Cook explained by side loading isn’t in the cards for iPhones",
  "article": [
    "In an interview with Kara Swisher on her New York Times podcast Sway, Apple CEO Tim Cook spoke lightly on a range of topics, including iOS 14.5’s upcoming App Tracking Transparency feature, augmented reality, and user privacy in general.",
    "But when the discussion turned to Apple’s legal fight with Epic Games to keep the latter’s third-party store off iPhones, which is set to meetin court on May 3, 2021, Cook also said, very plainly, why you can only get apps through the App Store.",
    "“If you had side loading, you would break the privacy and security model,” Cook said. “You’d be opening up a huge vector on another store.”",
    "This has been Apple’s argument against allowing users to download software outside the App Store and beyond the company’s carefully-crafted iPhone and iPad experience – and Cook positioned Apple’s role as curatorially protective.",
    "“In any given week, 100,000 applications come into the app review. 40,000 of them are rejected. Most of them are rejected because they don’t work or don’t work like they say that they work,” Cook said. “You can imagine if curation went away, what would occur to the App Store in a very short amount of time.”",
    "Apple first launched the App Store in 2008, and has kept a tight grip on the user experience – and quality control – of the iPhone ever since by keeping strict and family-friendly standards for the apps it allows to be downloaded.",
    "“People trust Apple in a way that they didn't trust the small shareware payment processors of the 90s and early 2000s,” app creator James Thomson, whose app PCalc was one of the first 500 to launch on the App Store, told TechRadar back in July. “Apple made it feasible to sell digital downloads of apps to people who weren't technically savvy, and broadened the market considerably.”",
    "While iPhone apps enjoyed a greater reputation for reliability on iOS devices, developers still chafed at the strict requirements, occasionally arbitrary removal from the App Store for infractions of its policies, and the 30% cut Apple took years after competing stores – like the Epic Games Store – lowered their takes to single-digit percentages.",
    "Apple halved its App Store cut down to 15% for most developers (those making under $1 million in annual profits) back in November following Epic’s formal legal challenge, which did not seem like coincidence.",
    "Cook even referred to this shift in the interview, and what it means for policies going forward: “The App Store is not cast in concrete, you know? And so we’ve changed over time.”",
    "Of course, reducing Apple’s cut is very different than allowing another store – and company – to generate income on iPhones and iPads. We may have to wait for the outcome of the Apple vs. Epic lawsuit to see if the former’s position ever changes on this issue.",
    "Via MacRumors"
  ],
  "headers": {
    "5": "The App Store: the only app pathway on the iPhone"
  },
  "links": {
    "interview": "https://www.nytimes.com/2021/04/05/opinion/apples-ceo-is-making-very-different-choices-from-mark-zuckerberg.html?showTranscript=1",
    "legal fight": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "PCalc": "https://www.pcalc.com/ios/",
    "told": "https://www.techradar.com/news/the-app-store-at-12-whats-changed-and-whats-still-to-come",
    "halved": "https://www.techradar.com/news/apple-is-halving-its-app-store-cut-for-the-vast-majority-of-developers",
    "MacRumors": "https://www.macrumors.com/2021/04/05/tim-cook-sideloading-apps-would-break-the-iphone/"
  }
}