{
  "source": "https://www.techradar.com/news/the-best-free-antivirus-around-might-surprise-you",
  "title": "The best free antivirus around might surprise you",
  "category": "computing",
  "updated": "2021-11-29T14:20:28Z",
  "author": "sead-fadilpasic",
  "summary": "Hint: You probably already have it installed",
  "article": [
    "Microsoft Defender has been selected as the best antivirus solution by a new report from independent researchers.",
    "AV-TEST, a 15-year-old independent research institute for IT security from Germany, regularly puts all big-name antivirus solutions to the test, and has chosen Microsoft’s cybersecurity tool over all others.",
    "The institute found Microsoft Defender was successful at detecting and blocking all of the 0-day malware attacks originating from the Internet during the last 31 days, including malicious websites and email attacks. Based on a sample of 407 malware, it also managed to exceed the industry standard of 99.8% for the detection rate.",
    "AV-TEST also says Microsoft’s free antivirus solution was less impactful on website loading, compared to other antiviruses. In a sample of 50 websites visited, the industry average slowdown was 17%, while for Microsoft Defender (on a standard consumer-grade PC), it was 7%. On the other end of this spectrum was Avast, whose antivirus solution allegedly slows down website loading by as much as 39%.",
    "On the downside, it interfered more during application installation. Based on a sample of 20 installed applications, AV-TEST found that the industry standard for a slowdown when installing applications is 15%. With Microsoft Defender, app installation slows down by 33%.",
    "Finally, Microsoft Defender was said to be comparatively faster than the likes of Kaspersky, McAfee, or AVG, with no speed decrease during file copying.",
    "Having a strong antivirus solution is a must in today’s risky cyber environment. With the rising popularity of remote and hybrid working, in which employees often use personal endpoints, and unsecured networks, for work, making sure every device is free from malware and ransomware is paramount.",
    "You might also want to check out our list of the best firewalls around"
  ],
  "headers": {
    "3": "Faster browsing, slower installations"
  },
  "links": {
    "best antivirus solution": "https://www.techradar.com/best/best-antivirus",
    "endpoints": "https://www.techradar.com/news/best-endpoint-security-software",
    "best firewalls": "https://www.techradar.com/best/firewall"
  }
}