{
  "source": "https://www.techradar.com/news/vpn-vs-dpn-the-dawn-of-decentralized-web-privacy",
  "title": "VPN vs DPN: The dawn of decentralized web privacy",
  "category": "computing",
  "updated": "2021-04-13T13:50:31Z",
  "author": "constantin-kogan",
  "summary": "DPN services deliver a more democratic, private and secure internet of tomorrow",
  "article": [
    "The internet has undoubtedly revolutionized the way we live. It has changed how we work, access information, travel, communicate and interact with each other. Along with it comes a greater level of freedom that we enjoy because of the democratizing and decentralizing information. By doing so, the internet has opened up far greater debate, analysis, and scrutiny by the general public on matters that impact them and the world. Thanks to the internet the sphere of influence is shifting away from centralized authorities and the mainstream media.",
    "In our rush to grasp the freedoms offered by the internet, we have neglected or been made to neglect something just as important: our privacy. As billions of people flock to join the latest social media networks, they fail to realize that they themselves are the actual product behind these new free services.",
    "Incentivized by “free” platforms and peer pressure, parts of the internet became factories for data collection, with valuable user data and information passed on to the platforms’ real customers — the highest bidder. A few powerful corporations seized large sections of the internet, harvesting data property that does not belong to them, diluting privacy rights, and opening the doors to censorship.",
    "This centralizing factor, alongside other concerns surrounding accessibility, surveillance, and net neutrality, has led to increased privacy awareness. With this, there’s a rise in the use of VPN, and now DPN, services to deliver a more democratic, private, secure, censorship-resistant, and decentralized internet of tomorrow.",
    "The origins of virtual private networks, or VPNs, can be traced back to Microsoft in 1996 where Gurdeep Singh-Pall invented the Point-to-Point Tunneling Protocol, PPTP, for implementing virtual private networks. Fast forward to 2021, VPN services are on the rise and have reached an all-time high adoption level of 27.1%. The likes of NordVPN reported an increase in VPN usage during the Covid-19 pandemic due to an increase in work from home orders.",
    "The motivation behind VPN’s use varies from security requirements to avoiding surveillance, overcoming censorship, and improving streaming services. Regardless, VPNs allow users to send their web traffic through an encrypted tunnel to a server managed by the VPN service provider. Traffic then exits to the web and data continues to be encrypted provided users only connect to secure HTTPS websites, preserving privacy as a result.",
    "VPN services such as Nord, Proton, Surfshark and others use strong security protocols, minimal data logging, private DNS servers, and internet-friendly jurisdictions to deliver the benefits such as avoidance of censorship, enhanced security on public and private connections and data transfers, remote access and online anonymity.",
    "While it’s a step in the right direction, VPNs can significantly slow down the internet speed and result in poor connectivity. Sometimes, websites can even block traffic generated through a VPN with anti-VPN software or log data that can then be resold. Not to mention that VPNs are centralized services. As a result, they still leave users vulnerable to data leaks and potential censorship.",
    "The way forward is paved by decentralized alternatives called decentralized private networks or DPNs.",
    "Similar to VPNs, Decentralized Private Networks (DPNs), or decentralized VPNs, also use encrypted tunnels to route web traffic, but they do this over decentralized rather than centralized networks. DPNs are serverless and distributed, ensuring higher security levels such that user data is not logged, hacked, or subpoenaed.",
    "In a decentralized private network such as Deeper Network or Mysterium Network, user devices act as both the client (like individual internet users) and server (like Amazon Web Services or Google). And the IP addresses automatically change based on their routing rules, establishing tunnels to other nodes all over the world.",
    "Decentralized private networks offer the same basic benefits as VPNs, but with additional advantages that include the negation of a central point of control. This means, there are no central points to attack and the network cannot be taken down. Users also have control over their data as no centralized provider has access to the information they were trying to protect.",
    "With users now more aware of the privacy issues and the problems around centralization of data and information, DPNs are becoming increasingly popular. Innovators in the blockchain and crypto space are already leveraging this demand to offer better protection to the netizens.",
    "For example, a Polkadot-based DPN project Deeper Network combines network security, blockchain, and the sharing economy to create a global peer-to-peer network to offer the same resilience against data theft and censorship as traditional VPNs, only without the need for a central server. The same goes for DPNs like Mysterium Network and HOPR that allow applications, people, and organizations to share information in complete privacy.",
    "Apart from the software solutions of DPNs, there are also hardware devices such as the Deeper Connect that create a private network for users to browse the internet just like any VPN. However, these hardware decentralized VPNs offer a one-time purchase and no-subscription model. The users of hardware VPN can also share their idle bandwidth with other users and earn a profit for their contribution.",
    "This altogether creates a truly private, more secure, and rewarding network for users to browse the internet. There’s a great possibility that DPNs will lead the internet from where it stands today to a point of secure communication space where technology and ethics meet to preserve human dignity, freedom, and independence."
  ],
  "headers": {
    "4": "VPNs: The first step in securing user privacy",
    "9": "Decentralized private networks (DPNs)",
    "12": "DPNs are making it to the market"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Proton": "https://www.techradar.com/reviews/protonvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark"
  }
}