{
  "source": "https://www.techradar.com/news/gotham-knights-release-date-trailers-gameplay-news-and-rumors",
  "title": "Gotham Knights release date, trailers, gameplay, news and rumors",
  "category": "gaming",
  "updated": "2021-12-10T10:33:28Z",
  "author": "matthew-forde",
  "summary": "Gotham Knights is now expected in 2022",
  "article": [
    "Gotham Knights is a highly-anticipated game from WB Games Montreal, the developer behind Batman: Arkham Origins. After delays, the game is now expected to land in 2022 and as that date edges closer, we’re slowly finding out more about what Gotham Knights has to offer.",
    "What we know so far is that Gotham Knights will take players to a “dynamic and interactive” open world Gotham City where they'll be able to step into the shoes of Batgirl (Barbara Gordon), Robin (Tim Drake), Nightwing (Dick Grayson) and Red Hood (Jason Todd), all of whom must work together to stop the city descending into chaos following the apparent death of Batman.",
    "Gotham Knights is a game designed with co-op play in mind but it's completely up to you whether you play on your own or team up with a friend. Regardless of what you choose, you’ll be able to seamlessly switch between the four main characters and use their individual powers and abilities as you patrol Gotham's five district boroughs and stop criminals.",
    "Read on to find out everything else we know so far about the upcoming game, as we’ve collected together the latest news and rumors about Gotham Knights below to keep you busy until it lands.",
    "Gotham Knights was officially announced during DC FanDome on August 22, 2020. A release date was then slated for sometime in 2021, however, Warner Bros. announced in March 2021 that the game was being delayed until 2022.",
    "The delay was announced on the official Gotham Knights Twitter page, with Warner Bros. revealing that the upcoming action RPG will now launch worldwide in 2022 rather than in its initial 2021 release window.",
    "\"We are giving the game more time to deliver the best possible experience for players,\" the statement reads. \"Thank you to our amazing fans for your tremendous support of Gotham Knights. We look forward to showcasing more of the game in the coming months.\"",
    "The first action-packed Gotham Knights trailer shows our four vigilantes receiving a posthumous call from Bruce Wayne, declaring Gotham unsafe and the GCPD distrustful, while also leaving behind all his files and a base of operations (The Belfy) to help keep the city safe.",
    "We then receive a montage looking at the quartet's different fighting styles, before leading into the co-op element of the game and the introduction of the Batcycle. The trailer closes out introducing what is likely the game's main antagonist - the Court of Owls.",
    "Simultaneously, a child's voice can be heard saying: \"No one talks about them. Not a whisper word is said. For if you try to crush them, then the talon strikes you dead.\" This refers to the deadly assassins known as 'Talons', which were first introduced back in Batman #2 in 2011.",
    "At the same DC FanDome event, Warner Bros. then premiered the first pre-alpha gameplay of Gotham Knights, showing Batgirl and Robin joining forces to take on Mr. Freeze during one of several villain encounters. Creative director Patrick Redding narrates the footage, stating that the Mr. Freeze storyline takes place about \"a dozen or so hours\" into Batgirl's character progression.",
    "Renee Montoya is heard speaking via radio to Batgirl, seemingly confirming that the GCPD detective is working with the group in some capacity. Alfred Pennyworth - Bruce Wayne's butler and guardian - is featured over comms too.",
    "A new addition to the series is the introduction of an XP system for leveling up characters, meaning all thugs will possess a number above their head, giving players an idea of their difficulty. This grows as the player increases in power and ability, so that foes keep pace throughout.",
    "\"Confronting a villain like Mr. Freeze can be a very different proposition at level five or at level 15, and not just in terms of stats but in the kinds of attacks and defenses they bring to bear,\" explains Redding, before teasing more to come in future.",
    "Fast-forward to DC's FanDome event in October 2021 and a fresh new trailer has landed. It's tense, creepy and confirms that the big bad in this game is likely going to the The Court of Owls. This is a secret society meets crime organization made up of Gotham's elite.",
    "This would make sense given we already know the game features deadly assassins known as 'Talons'. According to DC canon, these assassins were trained by The Court of Owls.",
    "As mentioned above, Gotham Knights is an open-world action RPG that allows you to play as four characters: Batgirl, Robin, Nightwing and Red Hood. Each of these characters has their own playstyle and abilities. Batgirl is trained in a variety of fighting styles and is also well-versed in technology and coding; Nightwing is a master of acrobatics and carries his iconic dual escrima sticks; Robin is an expert fighter who carries a quarterstaff and is trained in stealth; while Red Hood is strong and proficient in a manner of weapons.",
    "As these Knights, players will patrol Gotham's five district boroughs, dropping in on criminal activity as they find it.",
    "While you can play Gotham Knights solo, there's also an option to play co-op multiplayer, allowing a second player to drop in and out of the game as one of your fellow Knights - without affecting you.",
    "Below, we've gathered up all the biggest news and rumors surrounding Gotham Knights:",
    "Studio working on another game?",
    "Warner Bros. Games Montreal, the studio behind Gotham Knights, might be working on a second, unannounced project alongside the game. The LinkedIn profile of one of the studio’s senior artists is the source for this latest rumor.",
    "As reported by PCGamesN, Megan Berry’s profile states that since 2019, she’s been working as a co-founder and art director on an unannounced game “in addition to our current responsibilities on Gotham Knights”. What the game could be is currently unknown and though there are rumors that it could involve Superman, we’ll have to wait for an official announcement from the studio to be sure.",
    "Spring 2022?",
    "We still don’t have an exact release date for Gotham Knights but recent reports around a possible leak suggest that it could be scheduled for spring. Jin Park, who worked on branding for the game, recently shared an image on his website which shows the game’s release window as “Spring 2022”.",
    "Park has since removed the image from his site but a Twitter user subsequently posted a screenshot they’d grabbed (via Wccftech). Without official confirmation, we can’t know whether or not this release window is accurate. Gotham Knights was originally supposed to release in 2021 but was then delayed into 2022. While a delay from 2021 into 2022 does make an early-in-the-year Spring release window seem more plausible, we’re still waiting for official confirmation.",
    "New Key Art",
    "Ahead of DC FanDome 2021 where we got a brand new trailer for the game, Warner Bros released some new key art for the game. It doesn’t give a whole lot away but it does give us a better look at the game’s four heroes as they stroll through Gotham City—oh, and that interesting reflection of Batman in the water under their feet.",
    "Studio could be working on another game",
    "There are reports that WB Montreal, the developer behind Gotham Knights, is preparing to start work on a new game. As spotted by PCGamesN on the WB Games Montreal website, the developer is hiring for a Senior Gameplay / Animation Programmer “to work with its game development team responsible for a new IP, AAA title.” Whoever gets the role’s job will involve optimizing “cross-platform gameplay systems” and “NPC behaviours” alongside other responsibilities. If gears are indeed actually turning on a new project, this bodes well for Gotham Knights meeting its 2022 release date.",
    "No E3 2021",
    "As expected, Gotham Knights didn’t make an appearance at E3 2021, despite Warner Bros. hosting its own conference. As previously revealed to TechRadar, Warner Bros’ conference was dedicated to Back 4 Blood and Gotham Knights wasn’t present in any other conferences across the show. At the moment, the next most likely place we’ll see an update on Gotham Knights is during DC Fan Dome in October 2021.",
    "Delayed until 2022 Originally slated for a 2021 release, Gotham Knights has been delayed until 2022 to give developer Warner Bros. Montréal extra time to polish the game before release.",
    "The news was announced in Tweet from the game’s official Twitter page, which stated “We are giving the game more time to deliver the best possible experience for players. Thank you to our amazing fans for your tremendous support of Gotham Knights. We look forward to showcasing more of the game in the coming months.”",
    "Combat with co-op in mind In a recent interview with GamesRadar, Gotham Knights’ executive producer Fleur Marty has revealed that the combat system for its upcoming Batman game, Gotham Knights, has been designed with two-player co-op in mind. According to Marty, players should expect something slightly different to WB Montreal’s previous Batman game Arkham: Origins, explaining that they “have entirely redesigned the combat system in order for it to work well in co-op.”",
    "While Marty noted that Gotham Knights is “still a brawler” and “some of the mechanics won’t feel totally alien for people who played and enjoyed the Arkham series”, he added that “it is in many ways very different.”",
    "Despite this focus on co-op, there will still be some flexibility in how Gotham Knights can be played. According to Marty, it'll still be possible to play Gotham Knights entirely solo and the co-op element is conveniently “drop-in drop-out”, so you’re not entirely dependent on another player.",
    "Further to that, story progression is shared between all the characters so you can switch between heroes as you please, provided you’re in The Belfry, and invite a friend to join you without the worry that they’ll pick that one underpowered character you haven't played as at all.",
    "Even with that flexibility, though, the idea and spirit of the “team-up” is important to the overall game as Creative Director Patrick Redding said, “The two-player dynamic fits the fantasy and the Gotham City setting. The ‘duo’ or team-up is such a central feature of the universe that there’s a literal shorthand for it in the comics, in animation, in the film and TV versions.”",
    "It's so important, in fact, that it's effected the design of Gotham City itself, with Redding adding that “Gotham is a city of alleyways and rooftops, so the footprint for gameplay needs to be compatible with that.”",
    "Is Batman really dead? The biggest rumor circling the web is that Batman is not actually dead, rather, the world's greatest detective has gone into hiding to infiltrate the Court of Owls before subsequently being revealed alive in the later portions of the story. This has some credibility, just going off the history and general popularity of the Dark Knight alone. WB Games Montréal has not stated that Bruce Wayne is dead either, just Batman.",
    "On top of this, various images surfaced in August 2019 reportedly revealing the studio's previously canceled project starring Damien Wayne; Batman's son and the fifth character to assume the role of Robin. As Batman was set to be non-playable, Warner Bros. apparently scrapped the idea altogether. With this in mind, would the studio then repeat themselves in Gotham Knights?",
    "Release date and location rumors Another rumor pertains to the release date. On Christmas Day, the official Gotham Knights' Twitter account posted a 'Happy Holidays' image from the team at WB Games Montréal, which includes presents, a gym setup, and most notably, a poster dedicated to the Flying Graysons.",
    "For those that are unaware, the Flying Graysons were a group of trapeze artists and Robin's family members that were ultimately killed, leading to the latter becoming a crime fighter. The poster in question has a touring date of Tuesday, July 16 to Sunday, July 2, with many believing one of these to be the release date for the game. This is purely speculation (and looks to be disproved) as neither of those dates land on a Tuesday or a Sunday in 2021 - plus the game has now been delayed until 2022.",
    "More interestingly, the bottom of the poster mentions that Haly's Circus will take place at Robinson Park, a location used by Poison Ivy during the No Man's Land comic book storyline. There's a much higher chance this one is real.",
    "Voice actors Early on, WB Games Montréal confirmed the voice cast of Gotham Knights (via Twitter) after the game's announcement, featuring a line-up of stars new to the Batman franchise, as well as some up-and-comers.",
    "What wasn't confirmed was the role of The Penguin, which early-eyed fans spotted on IMDB will be voiced by Elias Toufexis, who has had a number of TV and voice roles and sounds perfect for the part.",
    "The rest of the line-up consists of America Young as Batgirl, picking up the cowl after previously voicing Barbie in Barbie Dreamhouse Adventures and directing The Concessionaires Must Die, a low budget comedy flick executive produced by Stan Lee. Young also voiced Dagger in Marvel Ultimate Alliance 2.",
    "Relative newcomer Sloane Morgan Siegel will play the Boy Wonder. Set to star in a new comedy series from Aaron David Roberts called Chartered, Siegel has had small roles in Modern Family and The Goldbergs, with the casting of Robin being his biggest role to date.",
    "We then have Christopher Sean as Nightwing, who will be known to Star Wars Resistance fans as the voice of lead character Kazuda Xiono. Apart from this, Sean had a four-year stint as Paul Narita on Days of Our Lives, played Dr. Bernard in the Wastelanders DLC in Fallout 76, and popped up across Marvel's Avengers and Ghost of Tsushima as several additional voices.",
    "Red Hood voice actor Stephen Oyoung is arguably the most well-known in the video game space, previously appearing in Spider-Man (2018) as antagonist Martin Li/Mister Negative. Since then, he has turned up as Alex Weatherstone in Death Stranding and Grayson in Cyberpunk 2077.",
    "Bruce Wayne's long-suffering butler looks to have a major role in Gotham Knights, as Gildart Jackson steps into the limelight. Jackson previously portrayed Giles the butler in the ABC series Whodunnit?, Flyseyes in Netflix's Castlevania series, Gideon in Charmed, as well as additional voices across Star Wars: The Old Republic and its expansion packs. He's also married to Jan from The Office (Melora Hardin).",
    "While Roger Craig Smith voiced Batman in Arkham Origins and Kevin Conroy carried the part in Rocksteady's Arkham Trilogy, Michael Antonakos has been confirmed as the new voice this time around. Antonakos's most prominent role was as Alexios in Assassin's Creed: Odyssey.",
    "The choice to go without an already existing Batman voice actor further confirms WB's commitment that Gotham Knights is set in a different universe from past titles. So, we wouldn't expect the likes of Mark Hamill's Joker to manifest, that is even if the Clown Prince of Crime turns up at all."
  ],
  "headers": {
    "4": "Gotham Knights: cut to the chase"
  },
  "links": {
    "announced": "https://www.techradar.com/news/gotham-knights-has-been-delayed",
    "PCGamesN": "https://www.pcgamesn.com/gotham-knights/superman-game",
    "Wccftech": "https://wccftech.com/gotham-knights-release-spring-2022/",
    "previously revealed": "https://www.techradar.com/news/dont-expect-hogwarts-legacy-or-gotham-knights-at-e3-2021",
    "Tweet": "https://twitter.com/GothamKnights/status/1372940963270643712?s=20",
    "GamesRadar": "https://www.gamesradar.com/gotham-knights-wants-to-transform-you-and-a-friend-into-a-truly-dynamic-duo/",
    "images": "https://imgur.com/a/ZFZUh3a",
    "Twitter": "https://twitter.com/GothamKnights/status/1301211625211469824"
  }
}