{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22s-camera-could-get-unveiled-very-soon",
  "title": "Samsung Galaxy S22's camera could get unveiled very soon",
  "category": "phones",
  "updated": "2021-08-02T08:15:52Z",
  "author": "tom-bedford",
  "summary": "50MP, apparently",
  "article": [
    "While the Samsung Galaxy S22 launch will likely be in January, or maybe February, one of its most important features could get shown off ahead of time, as a popular leaker thinks the cameras will get unveiled in September.",
    "This leaker is called Ice Universe, and posting on Twitter they said \"Sept. 200MP、50MP RGBW, coming soon\". What this probably means is that a 200MP and 50MP camera will be launched in September by Samsung, and used soon afterward in a smartphone.",
    "For context, Samsung often reveals its homemade smartphone camera sensors independently of the phone they're actually used in – which is how we first knew of the 108MP cameras now used in its Ultra phones, as well as another 50MP sensor launched recently that's really small.",
    "Mostly, this ISOCELL tech (as Samsung's sensors are called) is used by other companies first, but it's very possible we'll see the 50MP RGBW sensor, and perhaps even the 200MP one too, used in the Galaxy S22 series of phones eventually.",
    "There's no absolute guarantee of that though, especially with the 200MP – perhaps the Ultra will get that super-high-spec sensor, but it's incredibly unlikely the standard S22 will - so take this all with a pinch of salt.",
    "Samsung's Unpacked launch events, where it shows off its new products, are generally pretty consumer-friendly. There's no \"GPU this\" or \"CPU that\" which means average phone fans can watch without getting drowned in way-too-technical specs.",
    "That's likely why Samsung unveils its ISOCELL cameras, as well as its Exynos chipsets, at separate events. These are more technical, and average viewers might get lost – plenty of phone companies don't realize this, leading to pretty dry tech reveal events.",
    "However, the cameras probably won't be totally glossed over at Samsung Unpacked in early 2022 – we'll just hopefully hear about changes that you'll actually be able to notice and make use of. Namely, new camera modes.",
    "Samsung phones are great for their easy-to-use camera modes, like Single Take which basically takes loads of photos for you to choose between. However, by the S22's launch, it will have been two years since a new big mode like this was unveiled, and it's about time we saw a new one.",
    "If Samsung is keeping all its technical analysis of the cameras to a September launch, then there's going to be plenty of time in the schedule for new software modes and tools. And if Samsung needs inspiration, it can just look to Xiaomi, which is lapping it with modes that change the sky color in photos or freeze some, but not all, sections of videos to create cool effects."
  ],
  "headers": {
    "5": "Analysis: hardware now, software later"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Ice Universe": "https://twitter.com/UniverseIce/status/1421791874088583171",
    "another 50MP sensor": "https://www.techradar.com/news/samsung-isocell-jn1-camera-50mp"
  }
}