{
  "source": "https://www.techradar.com/news/dram-prices-are-set-for-major-drop-off",
  "title": "DRAM prices are set for major drop off",
  "category": "computing",
  "updated": "2021-10-11T14:37:13Z",
  "author": "mayank-sharma",
  "summary": "Fall should be short-term, and minor, believes Nanya’s CEO",
  "article": [
    "Taiwan's Nanya Technology Corporation, the world's fourth-largest memory maker, has predicted a drop in DRAM prices in late 2021, according to reports.",
    "Reporting on Nanya’s briefing to announce the company’s Q3 results, The Register says Nanya’s president Dr. Pei-Ing Lee pointed out that while sales of consumer electronics, servers, and smartphone sectors remain healthy, there was a fall in demand.",
    "Reportedly, component shortages, and strikes, aggravated by COVID-related disruptions across South East Asia have helped contribute to a fall in demand.",
    "\"We are expecting the DRAM market [to] enter short-term, minor correction in Q4, 21,\" Lee pointed out during the briefing.",
    "The Register says that Lee's statement reflects the views from the likes of DRAMeXchange and Gartner, who predict a similar decline in DRAM prices in the near future.",
    "A Gartner memo reportedly went as far as to claim that there will be \"a significant price reduction\" in memory due to oversupply. It asked hardware manufacturers to make the most of the situation by designing and shipping products with more memory units in order to prevent product prices from tumbling.",
    "A fall in the DRAM prices is expected to translate into more affordable and capable servers, and could also have a similar impact on the prices of smartphones, unless the manufacturers stuff them with more memory so as to not impact its sticker price adversely.",
    "On the other hand, a drop in the DRAM price will leave its mark on the bottomline of the DRAM manufacturers, such as Samsung which had recorded unprecedented revenues this year riding particularly to the increase in memory prices, and greater demand, both of which are now forecasted to tumble.",
    "Via The Register"
  ],
  "headers": {
    "4": "Good news, bad news"
  },
  "links": {
    "DRAM": "https://www.techradar.com/news/best-ram",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "component shortages": "https://www.techradar.com/news/global-chip-shortage-could-drag-on-until-2023",
    "DRAMeXchange": "https://www.dramexchange.com/WeeklyResearch/Post/2/11077.html",
    "Gartner": "https://www.theregister.com/2021/09/23/memory_price_fall_prediction_h2_2022/",
    "recorded unprecedented revenues": "https://www.techradar.com/news/samsung-q2-profits-set-to-rise-as-chip-demand-grows",
    "The Register": "https://www.theregister.com/2021/10/11/nanya_technology_q3_2021/"
  }
}