{
  "source": "https://www.techradar.com/news/mastercard-and-verizon-join-forces-to-offer-5g-contactless-payments",
  "title": "Mastercard and Verizon join forces to offer 5G contactless payments",
  "category": "computing",
  "updated": "2021-07-13T15:39:42Z",
  "author": "rob-clymo",
  "summary": "New alliance promises to deliver more efficient payment options",
  "article": [
    "Mastercard is collaborating with Verizon in a move that will see 5G contactless payments become more widely available for both consumers and small and medium-sized businesses.",
    "The plan is to harness Verizon’s 5G connectivity with the power of the Mastercard payments network to give consumers more freedom, and business owners the opportunity to boost their point-of-sale experience.",
    "By tapping into the potential of Internet of Things (IoT) sensor connectivity the arrangement could, in time, deliver a much more potent payments infrastructure. Mastercard aims to use Verizon’s 5G service to turn connected devices into e-commerce-enabled units – cash registers in other words. The development could produce better options for consumers who want to pay in other way - using smartwatches for example and enjoy touchless retail environments, like those already seen at Amazon Go stores.",
    "Businesses could stand to benefit considerably, with the likes of Mastercard’s Tap on Phone service that lets companies deliver contactless consumer payment options.",
    "The announcement will see Verizon’s 5G and Mobile Edge Computing technology integrated with Mastercard’s already powerful retail technology. Along with offering consumers easier ways to spend their cash, business look set to reap dividends from the services, including a beefed up edition of Mastercard’s Digital Doors, allowing them to build a more rounded e-commerce experience.",
    "However, the announcement today underlines that this is very much a work in progress, with future innovations not expected to see the light of day until 2023.",
    "In the meantime, Verizon plans to tap into Mastercard’s Bill Pay Exchange, the real-time messaging network that offers instant communication between consumers and billers.",
    "Bill Pay Exchange could eventually allow Verizon to offer a mobile-friendly means of combining conventional paper billing into an all-digital experience, thereby saving money and improving overall efficiency.",
    "“Emerging technology such as 5G and Mobile Edge Computing will undoubtedly reshape how we interact with each other, making it all the more critical for these exchanges – particularly payments – to be trusted and anticipate further changes,” said Linda Kirkpatrick, president, North America at Mastercard.",
    "“Through this collaboration, Mastercard and Verizon’s platforms, which connect billions of consumers, businesses, banks and governments around the world, will be a force in driving transformational change.”"
  ],
  "headers": {
    "5": "Contactless payments"
  },
  "links": {
    "contactless payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "point-of-sale": "https://www.techradar.com/news/the-best-pos-system",
    "payments infrastructure": "https://www.techradar.com/news/why-real-time-payments-can-solve-your-payments-woes",
    "e-commerce-enabled": "https://www.techradar.com/news/best-ecommerce-hosting",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "touchless retail": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "Amazon Go": "https://www.techradar.com/news/amazon-go-platform-will-be-sold-to-other-stores",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "messaging network": "https://www.techradar.com/best/best-encrypted-messaging-app-android"
  }
}