{
  "source": "https://www.techradar.com/news/ipod-15-years-later-the-pros-cons-and-memories-of-apples-massively-popular-mp3-player",
  "title": "iPod 15 years later: the pros, cons and memories of Apple's massively popular MP3 player",
  "category": "phones",
  "updated": "2021-02-21T20:01:23Z",
  "author": "david-lumb",
  "summary": "I resurrected my iPod Classic and pitted it against my iPhone 12 Pro",
  "article": [
    "There’s a bittersweet notion that makes the rounds on the internet every so often, which muses that at some point your parent picked you up and put you down for the last time. Well, that applies to tech, too: at some point, I turned off my iPod Classic for the last time and shoved it in a drawer, likely because I’d uploaded my music to my new iPhone 4 and have listened to music on my smartphone ever since.",
    "Truth be told, I haven’t thought of my iPod since, especially after Apple loaned me a new iPhone 12 Pro – but now I’ve been forced to reckon with a question: what does the iPhone 12 vs iPod Classic matchup look like?",
    "In moving home, I rediscovered my old iPod – my audio companion that blasted my tunes and podcasts on a thousand car rides and strolls between classes. I dusted off an old 30-pin rectangular charging cable, plugged it in to the wall, and in just over an hour, it was back. I tapped the click wheel and it turned on, giving me access to all the 2000s and early 2010s music I stuffed in the 80GB model.",
    "In the obvious sense, my iPod Classic is a time capsule, filled with albums from Weezer, The Postal Service, Modest Mouse, Mountain Goats, Passion Pit, Yeah Yeah Yeahs, Muse, and other luminaries that dominated that era of Indie Rock. It also held the more experimental (read: less white) corners of my taste I added piecemeal – Black Star, Ratatat, tUnE-yArDs, OutKast, ODB, Kid Cudi, Gipsy Kings, Gil Scott-Heron. It’s a comprehensive map of my musical exposure, and an unflinching look at the limits of my culturing.",
    "But more than just a cringey look at my musical taste, zipping through the iPod Classic is a reminder of how we used to consume music. It was Apple at the top of the music world, and the iPod was the perfect vehicle to deliver the streamlined iTunes experience on the go. It was also evidence of Apple believing so completely in content silos and its own permanent-purchase model that it slept on streaming services and had to fight to catch up.",
    "And yet, the iPod is so singularly good at what it does that I can still plug it in after nearly a decade and use it as if I’d put it down yesterday. Here’s what’s still incredible about taking an iPod Classic given to me in 2005 and firing it up today.",
    "In a world where smartphones have followed the iPhone’s lead into edge-to-edge displays and interaction possibilities are exponentially magnified through app software, the humble iPod Classic stands out for its simple interface. Use the scroll wheel to go up or down a list; click the center button to make selections to go deeper into nested menus, and click the top of the wheel to go back. Simple.",
    "The display itself is also small, and while this iPod has a color screen, it still doesn’t drain a lot of power. With today’s iPhones lasting just over a day at best, the iPod Classic goes and goes.",
    "That’s clearly an unfair comparison given how much more iPhones can do, but that simplicity is an advantage, too: while I’m scrolling through music, I won’t get distracted with an app notification and forget to pick the next song. And perhaps better for my easily-straying attention, I can’t flip over to check Twitter or any other distracting apps. There’s intentionality in the iPod Classic musical experience: I pick it up to listen.",
    "There’s no denying the iPod’s longevity, either: not only does it clearly still work, it works without needing WiFi connectivity and a software update. This is telling of Apple’s mid-aughts build quality, and I’m curious if the iPhone 12 Pro I’m currently using would still be useful after the same near-decade gap in use.",
    "Here’s a way the iPod Classic was useful today: I popped an aux cord into my new Sony WH-1000XM4 wireless headphones and plugged them into the 3.5mm headphone jack of my trusty Apple MP3 player, which played tunes without a hitch. Will I have a Lightning port adapter handy if I resurrect the iPhone 12 Pro in a decade – or will I trust that it’s compatible with whatever Bluetooth standard wireless headphones run on then?",
    "The iPod Classic might have worked perfectly, as if I’d just set it down yesterday – but it’s also stuck in time, and would take a ton of effort to update and add more music.",
    "Every song on my little portable Apple hard drive was meticulously curated and added to my iTunes library, because I had done what most iPod users had done: syncing my entire library to the device through iTunes itself. This meant that if I wanted to add even a single new song to my iPod Classic, I had to hook it up to whatever computer had my music library and wait while it essentially compared the catalogue on the computer and the device - and if the former had new music, add it to the latter.",
    "It was an incredibly cumbersome system, even at the time - but one meant to lock users into the iTunes platform and its idiosyncratic way of verifying where content belonged. It only allowed a one-way syncing process: I can’t, say, plug my iPod Classic into my new computer (even one logged in with the same Apple ID I’ve used for over a decade now) and download the music on to it, like one would expect from a handheld hard drive. I’d have to resurrect my library from elsewhere, manually transfer it to my current machine, and have it wipe the iPod and refill it.",
    "Obviously, technology moved on, leaving Apple and my iPod Classic behind. I can simply stream music from a service or YouTube through my smartphone. Don’t have it in my collection? Haven’t bought it for $0.99 on iTunes? No matter, I’ll just spend a fraction of my monthly data plan to stream it on demand.",
    "That’s not just a miracle of access: I can tap around my iPhone 12 Pro’s edge-to-edge display to engage with the music in a far more natural way than the iPod’s linear nested-menu interface. I can add songs to a playlist or ask the service’s algorithm to find me more music like the track I’m listening to. I can send a link to that song or playlist to friends via text message or tweet it out.",
    "Put simply, the possibilities afforded me by my music service define my listening experience, which can be infinitely more communal by drastically easing how I share music with others (and how I find new songs through recommendations on social media or sent from friends with links). Sure, there’s a bit of sport lost when you don’t just have a name to go by, but the future is about convenience and reducing the obstacles to expanding our musical horizons.",
    "Clearly, unearthing my iPod has inspired some serious reflection about how much we’ve changed how we listen to audio. As the Sony Walkman liberated music from lounge-bound hefty HiFi systems and into the streets, the iPod elevated the portable music experience from albums at a time to putting entire libraries at your disposal - and reasonably cheaply, too.",
    "Smartphones took that a step further, expanding everyone’s library to anything within the internet - provided they’ve paid for access, anyway. And the latest devices have been compatible with the latest audio solutions, allowing us to listen on wireless earbuds and headphones.",
    "Since I’ve moved on from my iPod Classic, I’ve found new audio experiences that are better than they’d been with a mobile MP3 player - for instance, I can take my iPhone 12 Pro on workouts with my sweat-proof wireless workout headphones, which don’t catch have cords that catch on gym equipment or flop wildly when I run. I won’t miss calls, either, since they’ll come through the same headphones - and since my music is centralized on a device that has all my communication apps, I won’t miss an important work email or personal message, either.",
    "Still, that’s kind of the point when having a musical experience - to focus on, well, the music. I’ll always treasure my iPod Classic as a pure gateway to audio, and it remains useful (and functional!) to this day. But maybe I’ll save it for the moments where I’m not on call for publishing content and can safely sink back into the musical world of my high school and college heydays."
  ],
  "headers": {
    "6": "iPods: still the best no-frills way to mainline your library",
    "11": "iPhones: streaming, unrestricted musical experience",
    "17": "In summary: iPhones make music easier to access, but iPod listening is pure"
  },
  "links": {}
}