{
  "source": "https://www.techradar.com/news/this-much-loved-windows-10-app-is-set-to-get-a-significant-upgrade",
  "title": "The Windows 10 Notepad app is about to get a major boost",
  "category": "computing",
  "updated": "2021-03-22T17:11:30Z",
  "author": "mike-moore",
  "summary": "Notepad is staking its claim the Windows Store",
  "article": [
    "One of the most-loved apps on Windows 10 is set for a significant upgrade in the next major update to the software.",
    "Notepad, the word processor app bundled with Windows, will soon become a separate Store-updateable application, with its own section and page on the Microsoft Store.",
    "This means that Notepad users will now be able to receive new features and upgrades automatically via the Microsoft Store as soon as they are available, rather than needing to wait for new additions to be bundled with a wider Windows 10 OS update.",
    "Some reports have also claimed that Notepad has been moved out of its traditional place in the Windows Accessories folder, moving over to have its own place in the Start menu, showing that the app is getting a lot more attention from Microsoft all of a sudden.",
    "Notepad has come automatically installed in Windows since version 1.0 of the operating system was released back in 1985, with sister program WordPad was automatically installed beginning in 1995 as part of the Windows 95 operating system.",
    "The update comes as part of the newly-announced Windows 10 21H2 “Sun Valley Update” test build, which Microsoft is rolling out to testers in its Dev Channel now. Version Build 21337 or newer of this release will see Notepad updates automatically pushed via the Microsoft Store.",
    "Sun Valley is set to bring a number of upgrades and changes to Windows 10, including a whole new look for many of the platform's most popular apps and services.",
    "Reports earlier this year claimed this includes pop-up alert boxes being changed by adding rounded corners – which is becoming something of a theme for the desktop OS. Microsoft is also apparently looking at updating the background colors to common colors, and to make it so that when the box isn’t being actively highlighted by the cursor, the close button border is removed.",
    "This move to rounded corners looks to be coming to a number of Windows 10’s core apps, the Settings panel, and other major elements of the desktop UI including the Start menu and Action Center.",
    "Sun Valley is expected to get a wider launch in Microsoft's second feature update of 2021 (the 21H2 update).",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Notepad upgrade"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Windows 10 21H2 “Sun Valley Update”": "https://www.techradar.com/news/windows-10s-new-look-hinted-at-in-fresh-screenshots",
    "Windows Latest": "https://www.windowslatest.com/2021/03/22/windows-10-feature-update-makes-notepad-a-separate-store-app/"
  }
}