{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-leak-reveals-new-plus-and-ultra-battery-capacities",
  "title": "Samsung Galaxy S22 leak reveals new Plus and Ultra battery capacities",
  "category": "phones",
  "updated": "2021-09-01T08:53:58Z",
  "author": "david-nield",
  "summary": "It's not great news",
  "article": [
    "The Samsung Galaxy S22 might still be four months or so away, if the rumors are to be believed – but we're starting to see a steady trickle of leaks drip in around Samsung's next flagship devices, and the latest concerns battery capacities.",
    "As per MyFixGuide (via SamMobile), two new batteries corresponding to two new Samsung phones just passed through the certification process in China, and it looks as though the Galaxy S22 Plus will come fitted with a 4,500mAh battery, while the Galaxy S22 Ultra will carry a 5,000mAh battery.",
    "Of course, you want to know how that compares with the equivalent phones that Samsung launched earlier this year, so we'll tell you: the Galaxy S21 Plus has a 4,800mAh-capacity battery and the Galaxy S21 Ultra has a 5,000mAh-capacity battery.",
    "The capacities mentioned in the new leak match up nearly with what we've heard previously: that we're going to see a drop from 4,800mAh to 4,500mAh as far as the Plus model is concerned.",
    "When it comes to the standard Galaxy S22 model, the word is that it's going to have a capacity of 3,800mAh, which again is lower than the 4,000mAh battery capacity offered by the standard Galaxy S21 handset.",
    "These rumors are going to raise concerns about battery life, but we'll have to see on that. What's more encouraging for potential buyers is charging speed, which is rumored to be getting a significant boost with the 2022 Galaxy S series models.",
    "While it's disappointing to see battery capacities staying the same or dropping when comparing the Galaxy S21 series with the rumors around the Galaxy S22 series, it's worth remembering that these changes don't necessarily translate into dips in battery life.",
    "The capacity of a smartphone's battery plays a big role in how long the device can last between charges, but it's by no means the only factor at play. There's screen size, for example, and how much power gets drawn by the display technology that's in use.",
    "Perhaps even more important is the efficiency of the silicon fitted inside the phone – how well the internal components can manage power while doing all the tasks that they need to do to keep your handset and its apps running.",
    "Whatever chipset is fitted inside the Galaxy S22, it should be more power efficient than the Snapdragon 888 and Exynos 2100 processors running the S21 models, so it's possible that Samsung will be able to squeeze more battery life out of its flagships next year after all."
  ],
  "headers": {
    "3": "Power to the people",
    "6": "Analysis: wait and see on battery life"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "the rumors": "https://www.techradar.com/news/the-samsung-galaxy-s22-could-arrive-in-january-2022-according-to-a-new-leak",
    "MyFixGuide": "https://www.myfixguide.com/galaxy-s22-battery-3c-certification/",
    "SamMobile": "https://www.sammobile.com/news/galaxy-s22-ultra-battery-capacity-revealed-new-leak/",
    "Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "going to see a drop": "https://www.techradar.com/news/samsung-galaxy-s22-plus-might-be-a-downgrade-in-terms-of-battery",
    "the word is": "https://www.techradar.com/news/samsung-galaxy-s22-specs-leak-is-bad-for-samsung-but-good-for-buyers",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "getting a significant boost": "https://www.techradar.com/news/samsung-galaxy-s22-could-improve-one-of-the-galaxy-s21s-surprisingly-weak-specs",
    "how much power gets drawn": "https://www.techradar.com/news/samsung-display-unveils-new-oled-tech-its-already-part-of-galaxy-z-fold-3"
  }
}