{
  "source": "https://www.techradar.com/news/phones-at-ces-2021",
  "title": "Phones at CES 2021: Rollable phones, Moto G series and more ahead of Samsung S21",
  "category": "phones",
  "updated": "2021-01-13T20:00:53Z",
  "author": "david-lumb",
  "summary": "CES 2021 phones include new cheap 5G and rollable phones",
  "article": [
    "While CES 2021 is certainly different than usual, plenty of phones have been revealed that are headed for retail shelves this year – and a few futuristic concepts have been teased, too. Here’s all the phones at CES 2021, from today’s best to tomorrow’s most promising ideas.",
    "Let’s limit your expectations up front: plenty of phonemakers have effectively sat out CES 2021, so don’t expect to see lineups or teases from LG, Xiaomi, Huawei, or others. But other brands have gone on undeterred, with Motorola and TCL revealing new budget and mid-range handsets – including the cheapest 5G phones we’ve seen in the US so far.",
    "And, of course, Samsung has jumped ahead of its typical release schedule to unveil its new lineup of flagship phones. While these may not strictly by CES 2021 announcements, rumors suggest we're about to see the Samsung Galaxy S21, S21 Plus, and S21 Ultra on January 14. These will be the first top-tier devices of the year, and set the tone for 2021’s best phones.",
    "But there are some neat phone concepts at CES 2021, too – mostly in the form of rollables, which extend the display sideways to get the kind of screen real estate we’ve only seen in foldables. Several phonemakers are showing off their rollables at CES, and unsurprisingly, they’re the same brands that unveiled rollable full-size TVs in years prior.",
    "So here they are: the biggest phones at CES 2021, and despite this year’s all-digital show, we’ve actually gotten our hands on some of them.",
    "Motorola showed off this year’s G-series phones, some of which had already been released in some form as the G9 line in other regions. But we’re seeing the others for the first time, like the Moto G Stylus 2021 and the Motorola One 5G Ace.",
    "The latter is a refinement of the Motorola One 5G, but with a few trimmed features, the Motorola One 5G Ace comes in as one of the most affordable 5G phones we’ve seen thus far with a starting price of $399 (around £294 / AU$514). With a Qualcomm Snapdragon 750G chipset, 6GB of RAM (in the US version), a triple rear camera (48MP main/8MP ultra-wide/2MP macro), and 5,000mAh battery, it’s the mid-range 5G phone to beat.",
    "The Moto G Stylus has some slight refinements on the 2019 model (which was Motorola’s first G-series stylus phone): a larger 6.8-inch Full HD Plus display (presumably LCD like its predecessor), Snapdragon 678 chipset, the same-size 4,000mAh battery, and a similar triple rear camera array (48MP main, 8MP ultra-wide, 2MP macro). The software has been improved, however, with more features (like splitting the screen to draw on half with an app open in the other half).",
    "The other two models are different versions of phones released in late 2020 in other regions: the Moto G Power, for instance, costs $199 (around £146 / AU$), which is somewhat cheaper than the higher-specced Moto G9 Power’s £179 price. Likewise, the Moto G Play costs $169 (around £124 / AU$217), which is less powerful but cheaper than the G9 Play’s £159 (roughly $210, AU$290) price.",
    "TCL introduced its first line of branded phones at CES 2020 last year, and it’s following up with its new TCL 20 line of handsets – but only two out of five it’s planning to announce in the near future. These two are its leading affordable model as well as its new cheap 5G phone, which will likely go against the Motorola One 5G Ace and other phones in an increasingly competitive mid-range 5G phone niche.",
    "The TCL 20 5G has a 6.67-inch LCD Full HD display, Snapdragon 695G chipset, 6GB of RAM, 128GB of storage, a 4,500mAh battery, and a triple rear camera (48MP main, ultra-wide, and depth sensor). And, obviously, 5G connectivity.",
    "The TCL 20 SE, also introduced, is a budget phone with a Snapdragon 460, 4GB of RAM, and 64GB of storage, but its huge 6.8-inch display, triple rear camera (48MP main, 5MP wide-angle with 117-degree FoV, and 2MP macro) with a 2MP depth sensor, and 5,000mAh battery make it a great affordable option.",
    "Sadly, we don’t know how much the TCL 20 5G or 20 SE will cost nor their release dates, and have no idea when we’ll see the other phones in the TCL 20 lineup.",
    "Foldables are so passe; the new hotness that TCL and Oppo have teased in concepts through 2020 are rollable phones, which roll out to expand a phone’s display in a way that supposedly won’t leave creases. At CES 2021, we didn’t just hear about new rollables – we heard about one that could be coming out this year.",
    "That’s the LG Rollable, which was featured in the brand’s CES video, and which sources told CNET is coming out sometime in 2021. LG itself wouldn’t confirm or deny the news, only giving anofficial statement: “LG Rollable was previewed at CES 2021. Stay tuned for more details on LG Mobile's exciting 2021 portfolio.”",
    "During a preview for its TCL 20 series of phones, TCL affirmed that its rollable phone is still in development – and during its CES 2021 presentation, the brand showed off two new rollable concepts: one that rolls upward to make the phone taller and a wide scroll-like display that unfurled to a 17-inch display, which would reach laptop-size screen dimensions.",
    "TCL showed off working tech demos of the vertical rollable and the scrolling display in tweets, demonstrating that, while they aren’t implemented in market-ready phones yet, they’re certainly on the way.",
    "CES 2021 will be the last big tech show for months now that we know MWC 2021 – which we’d expect to occur at the end of February in a normal year – won’t be held until the end of June. That means we won’t have another big event for phonemakers to plan their device announcements around for half a year.",
    "In lieu of the usual release window, brands will just have to release phones on their own schedule. We’ve already seen that with the Moto G phones, which have previously been unveiled during or after MWC, but which were shown off at CES 2021 – and this could be a boon for smaller phone makers who typically fight for attention during Mobile World Congress, the year’s biggest phone event.",
    "Conversely, it could pressure brands to speed up their announcements and snag all the press instead of waiting until the usual February launch window. Which seems to be what Samsung is doing this year, as it’s slated to reveal its Galaxy S21 phones on January 14 as CES 2021 wraps up. Which leads us to…",
    "Yes, the Samsung Galaxy S21 phones are being revealed during CES. While it’s not at CES, or not specifically affiliated, it’s no coincidence that one of the biggest phone companies is releasing its new lineup of flagship handsets on the last day of the tech show... which is over a month earlier than we’d expect.",
    "We’re expecting three phones to come out of the January 14 launch event: the standard Samsung Galaxy S21, the larger Samsung Galaxy S21 Plus, and the top-specced Samsung Galaxy S21 Ultra. Samsung’s own teases point to a new design that ditches a camera block for a whole glossy-finished corner to house the rear cameras – in a vertical line for the S21 and S21 Plus, and a double column for the S21 Ultra.",
    "All the phones are rumored to cost less than last year’s Samsung S20 line, but might compromise on some features, too – notably, the S21 and S21 Plus may have displays that max out at Full HD, with only the S21 Ultra packing a WQHD resolution screen. Conversely, the premium S21 Ultra may have even more features justifying its price, like running WQHD resolution and 120Hz refresh rate at the same time and packing an S Pen stylus.",
    "We’ll know for sure what the S21 line will bring when it launches on January 14, which will make Samsung’s new phones the first flagships to arrive in 2021, setting the standard (and expected prices) for the year’s handsets."
  ],
  "headers": {
    "5": "Motorola’s full budget phone lineup",
    "9": "TCL brings the first of its 2021 phones",
    "13": "CES 2021: the year of the rollable",
    "17": "And...no more tech shows for months",
    "20": "Samsung Galaxy S21: the year’s first flagship phones"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "best phones": "https://www.techradar.com/news/best-phone",
    "Moto G Stylus": "https://www.techradar.com/reviews/moto-g-stylus-2021",
    "Motorola One 5G Ace": "https://www.techradar.com/reviews/motorola-one-5g-ace-review",
    "Motorola One 5G": "https://www.techradar.com/reviews/motorola-one-5g-ace/news/motorola-one-5g-packs-four-rear-cameras-and-5g-connectivity-for-under-dollar500",
    "2019 model": "https://www.techradar.com/reviews/moto-g-pro-review",
    "Moto G9 Power": "https://www.techradar.com/reviews/moto-g9-power-review",
    "TCL": "https://www.techradar.com/news/this-is-the-best-foldable-phone-concept-weve-seen-so-far",
    "Oppo": "https://www.techradar.com/news/oppos-next-foldable-phone-will-have-a-rollable-oled-display-but-you-cant-buy-it",
    "rollable phones": "https://www.techradar.com/news/concept-foldable-phones-check-out-these-folding-and-rolling-smartphones",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable-teased-as-the-first-phone-with-a-rollable-screen",
    "CNET": "https://www.cnet.com/news/whoa-the-lg-rollable-phone-we-saw-at-ces-is-actually-real-coming-out-in-2021/",
    "vertical rollable": "https://twitter.com/phonewisdom/status/1348719333069922304",
    "scrolling display": "https://twitter.com/phonewisdom/status/1348727020461596672",
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "teases": "https://www.techradar.com/news/official-samsung-galaxy-s21-teasers-have-leaked-confirming-minimal-camera-bump",
    "less": "https://www.techradar.com/news/samsung-galaxy-s21-price",
    "Samsung S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "S Pen": "https://www.techradar.com/news/new-leak-hints-s21-ultra-could-pack-an-s-pen-in-an-unusual-spot",
    "prices": "https://www.techradar.com/news/why-the-samsung-galaxy-s21-may-set-the-price-for-2021s-flagship-phones"
  }
}