{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-specs-and-release-date-leaked",
  "title": "Samsung Galaxy Z Fold 3 and Z Flip 3 specs and release date leaked",
  "category": "phones",
  "updated": "2021-02-09T09:51:47Z",
  "author": "james-rogerson",
  "summary": "We could be waiting a while",
  "article": [
    "We haven’t heard a huge amount about the Samsung Galaxy Z Fold 3 and the Samsung Galaxy Z Flip 3 yet, but a new leak has revealed a few more possible details about them, and in the process given us an idea at when they might launch.",
    "According to SamMobile, the Samsung Galaxy Z Fold 3 will come with at least 256GB of storage, which isn’t surprising given that the Samsung Galaxy Z Fold 2 came with that much storage too. Additionally, the Z Fold 3 is said to run Android 11 overlaid with Samsung’s One UI 3.5, and to have the model number SM-F926.",
    "The Samsung Galaxy Z Flip 3 meanwhile will apparently come in both 128GB and 256GB capacities. The smaller of those is actually down from its predecessors, which only came with 256GB of storage, so perhaps that means the Z Flip 3 will have a lower starting price. In any case, it’s also said to run Android 11 with One UI 3.5, and to have the model number SM-F711.",
    "That’s it for this leak, other than a note that they’ve seen no evidence that there’s a ‘Lite’ model of the Samsung Galaxy Z Fold in the works, which had at one time been rumored. That’s not to say it isn’t coming, just that this source doesn’t know one way or the other.",
    "So this leak might not look like much, but the mention of One UI 3.5 strongly suggests that both of these phones will land in the second half of the year (assuming these details are accurate).",
    "That’s because Samsung has only just launched One UI 3.1 alongside the Samsung Galaxy S21 range, and based on past form the next major One UI update is unlikely to land until the second half of the year.",
    "Typically it would be launched with a new Samsung Galaxy Note model in August, and while there’s some question over whether there will even be a Samsung Galaxy Note 20, we might still be looking at that sort of time frame for the software, and therefore for these two foldables.",
    "That’s in line with most leaks, which suggest that the Galaxy Z Fold 3 and Galaxy Z Flip 3 will both land in the second half of the year, possibly around July. So this latest leak just makes that look ever more likely."
  ],
  "headers": {
    "3": "Waiting for One UI"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "SamMobile": "https://www.sammobile.com/news/exclusive-first-details-new-galaxy-z-fold-galaxy-z-flip/",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Android 11": "https://www.techradar.com/news/android-11",
    "at one time been rumored": "https://www.techradar.com/news/is-a-cheaper-samsung-galaxy-z-fold-lite-heading-to-india",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "possibly around July": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-could-be-many-months-away"
  }
}