{
  "source": "https://www.techradar.com/news/dune-part-2-is-officially-happening-so-when-will-it-arrive",
  "title": "Dune Part 2 is officially happening – so when will it arrive?",
  "category": "entertainment",
  "updated": "2021-10-27T09:11:27Z",
  "author": "tom-power",
  "summary": "The spice will flow once again",
  "article": [
    "It's official: Dune Part 2 is in the works.",
    "Posting the announcement on its official social media channels on Tuesday, October 26, Legendary Pictures – the film's production company – revealed that a sequel had finally been given the greenlight.",
    "Check out the official reveal in the tweet below:",
    "The announcement comes just two days after we speculated whether Dune's box office takings meant that a sequel would be forthcoming. Thankfully, it seems that its global ticket sales helped to persuade Warner Bros. and Legendary that a follow-up movie was worth the investment.",
    "Despite fans' delight that a Dune sequel will be forthcoming, though, we shouldn't expect the second part of Denis Villeneuve's movie duology to arrive anytime soon.",
    "Per Variety, Dune Part 2 has been given a tentative release date of October 23, 2023. That means that film fans have got a two-year wait before they can find out how Paul Atreides' journey ends. That is, unless you've read Frank Herbert's seminal sci-fi novel, which has been adapted as accurately as possible by Villeneuve and company.",
    "Ahead of Dune's release, Villeneuve confirmed that he would love to make a follow-up so he could complete Dune's story. The Blade Runner 2049 and Arrival director had also stated (via SlashFilm) that he'd be \"ready to go\" as soon as a potential sequel was given the go-ahead – although, we imagine that principal photography won't begin until early next year now.",
    "Warner Bros. had heavily hinted that Dune Part 2 would be confirmed sooner rather than later, too. Speaking after Dune opened in the US and Canada, WarnerMedia CEO Ann Sarnoff teased that a sequel would be greenlit regardless of its box office performance.",
    "Dune Part 2's confirmation aside, the other notable aspect of this announcement is that the sequel won't be coming to HBO Max.",
    "As reported by Deadline, Dune Part 2 will receive an exclusive theatrical release when it arrives in October 2023. That means that Dune Part 2 won't get a simultaneous day-and-date launch in two years' time.",
    "That's not unexpected, though. Earlier this year, Warner Bros. confirmed that its current day-and-date release strategy model would end once 2021 was over. Any new movie releases from January 2022 onwards, then, will arrive exclusively in theaters.",
    "For Villeneuve in particular, that will be seen as a huge victory. The visionary director was one of AT&T and Warner Bros' fiercest critics when the studio announced that its 2021 movie slate would launch simultaneously in theaters and on HBO Max. In December 2020, Villeneuve said (via Variety) that Warner \"might just have killed the Dune franchise\" – such was his anger at the studio's newly announced day-and-date strategy.",
    "Dune, Villeneuve explained, is supposed to be seen on the biggest screen possible. And, given the film's solid box office haul since its initial release in international markets, it seems that film fans agree. At the time of writing, Dune has made $232.2 million at the global box office, which is no small feat for a movie in the pandemic era.",
    "It's unclear how many people have watched Dune on HBO Max, or if there was an uptick in new subscriptions so film aficionados could view it in the comfort of their own home.",
    "Regardless, Dune Part 2 will only arrive in theaters in October 2023. As we said in our spoiler-free Dune review, Villeneuve's visually striking and ambitious movie is a must-watch in theaters. The announcement that it'll only receive a cinematic release, then, is something to celebrate."
  ],
  "headers": {
    "8": "No Dune Part 2 for you, HBO Max"
  },
  "links": {
    "Dune": "https://www.techradar.com/features/adapting-dune-denis-villeneuve-on-bringing-frank-herberts-sci-fi-epic-to-life",
    "we speculated": "https://www.techradar.com/news/will-dune-part-2-happen-based-on-the-first-films-box-office",
    "Variety": "https://variety.com/2020/film/news/dune-denis-villeneuve-blasts-warner-bros-1234851270/",
    "SlashFilm": "https://www.slashfilm.com/595048/dune-sequel-ready-to-go-for-2022-if-greenlit-says-director-denis-villeneuve/",
    "would be greenlit": "https://www.techradar.com/news/will-dune-part-2-happen-based-on-the-first-films-box-office",
    "Deadline": "https://deadline.com/2021/10/dune-sequel-greenlit-by-legendary-warner-bros-theatrical-release-1234862383/",
    "our spoiler-free Dune review": "https://www.techradar.com/news/dune-is-an-absorbing-and-visually-striking-sci-fi-epic-with-one-major-problem"
  }
}