{
  "source": "https://www.techradar.com/news/coinbase-lets-customers-use-its-coinbase-card-with-apple-pay-and-google-pay",
  "title": "Coinbase Card users will soon get Apple Pay and Google Pay access",
  "category": "computing",
  "updated": "2021-06-01T15:24:53.330Z",
  "author": "rob-clymo",
  "summary": "Coinbase Card will let customers spend digital currencies",
  "article": [
    "Coinbase, the biggest US cryptocurrency exchange, has announced on its official blog that it will now be possible to use your Coinbase Card with both Apple Pay and Google Pay.",
    "The decision means that it will be easier to make crypto payments using popular devices like the iPhone 12, and selected customers will be invited to try the option starting this week. It’ll also allow Coinbase customers to earn up to 4% back in crypto rewards.",
    "The Coinbase blog post outlines that it will automatically convert all cryptocurrency to US Dollars and funds are automatically transferred to your card after having conversion fees deducted. The money can then be used for purchases and ATM withdrawals. However, before anything else you’ll need to be enrolled on the waiting list for Coinbase Card in order to be considered.",
    "According to Coinbase, the move is in response to rising numbers of mobile phone payments, which were up 29% in 2020 alone. More people are also using Apple Pay or Google Pay too, so the incentive for earning crypto rewards on corresponding spends seems like a logical development.",
    "Anyone wanting to take advantage of the Coinbase Card incentive scheme will first need to enroll on the waitlist, which should subsequently be followed by an email invitation and the need to complete a brief application. An obvious benefit of the Coinbase Cars is that because it’s a debit card there’s no impact on your credit score, while there are no application fees either. However, Coinbase does state that other standard fees may apply.",
    "Following your approval for the Coinbase Card you’ll be able to spend using Apple Pay and Google Pay. Apple Pay users can add the card from the Apple Wallet app or select it from inside the Coinbase app. Google Pay users can add the card through their Google Pay app. In the meantime, new customers will also be sent a physical card.",
    "Apple is already busy trying to hire a new business manager for its expanding alternative payments department, as we reported last week. The Coinbase news is another indicator that the US computing giant is increasing its interest in the likes of crypto and other non-Dollar based payment systems.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies."
  ],
  "headers": {
    "4": "Coinbase Card"
  },
  "links": {
    "cryptocurrency exchange": "https://www.techradar.com/best/mining-rigs",
    "Apple Pay": "https://www.techradar.com/how-to/how-to-use-apple-pay",
    "Google Pay": "https://www.techradar.com/how-to/how-to-use-google-pay",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "blog post": "https://coinbase-consumer.sjv.io/c/221109/552039/9251?subId1=trd-us-9463441484549018000&sharedId=trd-us&u=https%3A%2F%2Fblog.coinbase.com%2Fnow-use-your-coinbase-card-with-apple-pay-and-google-pay-df951ad52c89",
    "mobile phone payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "Apple Wallet": "https://www.techradar.com/how-to/phone-and-communications/how-to-use-apple-wallet-from-the-lock-screen-1307225",
    "new business manager": "https://www.techradar.com/news/apple-could-be-about-to-delve-into-alternative-currencies"
  }
}