{
  "source": "https://www.techradar.com/news/hitman-3-looks-best-on-xbox-series-x-as-microsofts-console-finally-trumps-ps5",
  "title": "Hitman 3 looks best on Xbox Series X, as Microsoft’s console finally trumps PS5",
  "category": "gaming",
  "updated": "2021-01-21T15:01:17Z",
  "author": "adam-vjestica",
  "summary": "The game runs great on all consoles, though",
  "article": [
    "Xbox Series X owners will be pleased to hear that Hitman 3 looks best on Microsoft’s console. The game has a slight advantage over PS5 when it comes to the game’s resolution and shadow quality, meaning it’s a rare win for Microsoft’s console in what’s likely to be a long list of inevitable head-to-head comparisons between the two systems over the next few years.",
    "Graphic experts Digital Foundry revealed that Hitman 3 runs at a native 4K resolution on Xbox Series X, with ultra texture quality and an almost rock solid 60fps throughout. The PS5, meanwhile, tops out at 1800p, and features lower quality shadows compared to Xbox Series X, but does not exhibit any frame rate dips.",
    "This might seem insignificant to some – and unless you have both versions up side-by-side, it arguably is – but if you care about having the very best version of Hitman 3 on consoles, Xbox Series X just pips the PS5 this time around.",
    "But what about Microsoft’s more affordable Xbox? Well, the Xbox Series S runs at 1080p, with high texture quality and lower quality shadows. You’ll still enjoy an almost flawless 60fps experience, though, so it’s a decent result for the lower-specced machine.",
    "As mentioned above, the Xbox Series X hasn't fared too well in previous comparisons with the PS5 in multiplatform titles.",
    "Even though the Xbox Series X trumps the PS5 when it comes to raw technical specs (the PS5 does have a faster SSD), it’s generally underperformed when it’s come to multiplatform releases. Launch games like Assassin’s Creed Valhalla and Dirt 5 were much more stable on Sony’s platform, while the Xbox Series X versions were susceptible to screen tearing, weird graphical bugs and sudden frame-rate drops.",
    "According to The Verge, Microsoft only let developers submit games for Xbox Series X certification in June, after delivering an update to its Game Developers Kit (GDK). This led to many developers having access to PS5 dev kits before they got their hands on Xbox versions, which might explain why the Xbox Series X hasn't hit the heights many expected. Sony’s development tools have also been praised in the past for being easier to work on.",
    "But that's not all. Microsoft also revealed that it was late to manufacturing its console as it waited for full RDNA 2 support from AMD in the Xbox Series X. Xbox head Phil Spencer told The Verge Decoder podcast: “We were a little bit later than the competition, because we were waiting for some specific AMD technology in our chip.”",
    "Despite the Xbox Series X's slow start, the console has enjoyed more flexibility when it comes to developers adding 120fps support to older titles. Rocket League developer Psyonix pointed out that the process is seemingly much easier on Xbox due to the way backwards compatibility works, but a lot trickier on PS5.",
    "Psyonix told Eurogamer last year: “Enabling 120Hz on Xbox Series X|S is a minor patch, but enabling it on PS5 requires a fully native port due to how backwards compatibility is implemented on the console, and unfortunately wasn’t possible due to our focus elsewhere.\"",
    "Call of Duty: Warzone is another example of a game that runs at 120fps on Xbox Series X but not on PS5, though the latest Call of Duty: Black Ops Cold War does have this option available."
  ],
  "headers": {
    "4": "Playing catch up",
    "8": "Rocket fuel"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Hitman 3": "https://www.techradar.com/reviews/hitman-3",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Digital Foundry": "https://www.eurogamer.net/articles/digitalfoundry-2021-hitman-3-has-a-4k-resolution-advantage-on-xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Assassin’s Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "The Verge": "https://www.theverge.com/21611412/microsoft-phil-spencer-interview-xbox-series-x-launch-decoder-podcast",
    "120fps support": "https://www.techradar.com/news/ps5-might-not-get-as-many-120fps-games-as-xbox-series-x-heres-why",
    "Eurogamer": "https://www.eurogamer.net/articles/2020-11-20-the-balls-in-sonys-court-for-ps4-games-running-at-120fps-on-ps5",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Call of Duty: Black Ops Cold War": "https://www.techradar.com/reviews/call-of-duty-black-ops-cold-war"
  }
}