{
  "source": "https://www.techradar.com/news/steam-may-steal-a-favorite-console-feature-that-youll-instantly-love",
  "title": "Steam may steal a favorite console feature that you’ll ‘instantly’ love",
  "category": "computing",
  "updated": "2021-09-22T07:49:12Z",
  "author": "allisa-james",
  "summary": "New ‘instant play’ mechanic could be coming soon, suggests patent",
  "article": [
    "Valve’s Steam service is currently the most popular gaming platform on PC, and it may be able to extend its lead care of consoles (of all sources). A newly registered patent suggests that you could be gaming sooner in the near future, outlining a mechanic called “instant play.” Players would be able to boot up their newly purchased game before it fully downloads from the client.",
    "The mechanic allows for “track read operations,” according to the patent document first spotted by SteamDB creator Pavel Djundik. This would enable game data to be read and accessed before it finishes downloading on a PC.",
    "Other features include freeing up space by discarding unused blocks of data, and “local prefetching of game data for reducing latency during gameplay.”",
    "Prefetching is a method for speeding up fetch operations by beginning one whose result is expected to be needed soon, meaning that Steam games will run faster. Both of these secondary features could be especially useful for gamers, and make for a far more enjoyable gameplay experience.",
    "The concept of playing a game before it downloads is something consoles have already started, with both the PlayStation 4 and Xbox One systems debuting the idea and PS5 and Xbox Series X continuing the tradition.",
    "Normally, there’s the caveat of that game only being partially playable until the download completes. But the patent mentions an interesting phrase: “without limitation.”",
    "Though it hadn’t been extrapolated on within the patent, this could be an indication that “instant play” will allow for a game to be fully playable before a complete download. However, this is all mere conjecture, as Valve's announcement of its plans hasn’t been, let’s say, instant."
  ],
  "headers": {
    "4": "We've seen this before, but there may be a twist"
  },
  "links": {
    "newly registered patent": "https://www.freepatentsonline.com/11123634.html",
    "Pavel Djundik": "https://twitter.com/thexpaw/status/1440242974483369985",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}