{
  "source": "https://www.techradar.com/news/alexa-vs-google-assistant-which-voice-assistant-is-best-for-your-smart-home",
  "title": "Alexa vs Google Assistant: which voice assistant is best for your smart home?",
  "category": "smart-home",
  "updated": "2021-04-17T15:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Should you choose Alexa or Google Assistant to power your smart home?",
  "article": [
    "A few years ago, hollering orders at a speaker in your home for it to respond with the answers to a question, or by controlling your lights, plugs or heating seemed like a future prediction from an old sci-fi movie.",
    "However, voice assistants have grown in popularity over the past few years (according to market research firm Statistica, by 2024 8.4 billion devices with digital assistants built-in will be in use) so they’re clearly here to stay",
    "Found in everything from smartphones to the best smart speakers and the best smart displays, it can be hard to decide whether you should opt for Amazon Alexa or Google Assistant as the digital helper for your smart home, so we’ve gone through the key things you should know if you’re trying to make your mind up.",
    "Read on to discover how these two voice assistant compare – or, if you’ve already decided which of the two you wish to buy, check out the best prices right now for smart speakers from both brands below:",
    "We found Amazon Alexa and Google Assistant are both reliable at recognising and responding to your voice. In our tests with an Amazon Echo Dot (2020) and a Google Nest Mini 2, the voice assistants flawlessly sprang to life within milliseconds of us uttering the wake word.",
    "Speaking of the wake word, Alexa does let you change this phrase in the Alexa app. If you prefer, you can use Amazon, Echo or Computer instead, but you’ll need to activate the change on every Alexa-enabled device in your home.",
    "There’s no option to deviate from ‘Ok, Google’ or ‘Hey, Google’ which are the wake words used with Google Nest smart speakers smart displays, but stability can be a real help when talking to a little piece of tech..",
    "Both Alexa and Google Assistant can have continued conversations too, so there’s no need to repeat the wake word if you follow up your initial command or request with another one after a few seconds. Amazon also says that in the future, Alexa will be able to converse with more than one person at a time, however this feature is still not available at time of writing.",
    "On top of this, both Alexa and Google Assistant can recognise different voices in the household to provide personalised results; for example when it comes to calendar entries or contacts to call. Called Voice Match (Google Assistant) and Voice Profiles (Alexa), both voice assistants can recognise up to six different people without a hitch so you can access more personal services..",
    "Both Amazon and Google offer a number of different smart speakers and smart displays that come with access to their relevant voice assistant, across several different price ranges. The cheapest way to get Alexa or Google Assistant is to opt for the smallest smart speaker from both brands; the Amazon Echo Dot or Google Nest Mini, which cost from as little as $20 / £20 / AU$34.",
    "These smart speakers are often discounted during the year too, for example on Black Friday and Amazon Prime Day - we’ve seen them drop as low as $9.99 / £9.99 / AU$17.99.",
    "When it comes to the number of the best smart home devices supported, Alexa trumps Google Assistant here. From LIFX, Philips Hue and TP-Link smart lights to Honeywell and Tado smart heating thermostats, a plethora of the best home security cameras and smart plugs, alongside Amazon-owned devices like Ring, which offers some of the best video doorbells on the market, there are plenty of smart home devices Alexa can control.",
    "While Google Assistant may be lagging behind on quantity, support for new devices is being added regularly and Google’s voice assistant does work with big-names such as LIFX, Philips Hue, and Arlo, along with its own smart home devices such as the Google Nest Hello Video doorbell, and the Google Nest Learning thermostat.",
    "Both voice assistants let you create automations (where several different smart home devices work at the same time in a preset pattern), either at a specific time or when something happens. For example smart lights that switch on if your home security camera detects motion outside your home.",
    "Routines, as they’re known by Alexa and Google Assistant, can be set up in the Alexa or Google Home app, however Alexa offers more customization that Google Assistant when creating a routines; for example being able to link to services such as Audible and IFTTT (If This Then That), which expands the scope of the automations you can create.",
    "Alexa can also proactively control your smart home gadgets based on your previous requests and behavior, through a feature called Alexa Hunches, although this is currently only available in the US at present.",
    "As both voice assistants are built-into smart speakers and smart displays, it’ll come as no surprise that Alexa and Google Assistant can play music from streaming services for you.",
    "Alexa can play Amazon Music (shockingly), along with Apple Music, Deezer, Spotify, Pandora, Tidal and Vevo, while Google Assistant supports all of these except Tidal and Amazon Music, and adds support for YouTube Music.",
    "In our eyes they’re evenly matched here, as during testing using Spotify, both Alexa and Google Assistant offered up relevant radio stations when we asked for ‘00’s RnB’ and ‘Michael Buble’ as well being able to play the album Rumours by Fleetwood Mac, and Rob Beckett’s Lockdown Parenting Hell podcast when we asked for it.",
    "If you have more than one compatible smart speaker or smart display in your home, both Alexa and Google Assistant can create multi room audio systems that can play music at the same time on all of the speakers. Google Assistant can even transfer music between the different smart speakers and displays for you as you move about the house, where Alexa doesn’t have this availability yet.",
    "On top of that, both voice assistants can also control playback of streaming services such as Prime Video and Google Play when being watched on a compatible TV streaming device; that’s an Amazon Fire TV for Alexa and a Google Chromecast (or a TV with Chromecast built-in) for Google Assistant.",
    "As well as controlling your smart home, and playing music and video for you, Alexa and Google Assistant can also make hands-free calls, so you can save on your phone bill.",
    "Alexa can make free audio calls to cell numbers and landlines from any Amazon Echo smart speaker or smart display. On top of this, Amazon’s voice assistant can also make free audio calls to other Amazon Echo speakers and free video calls between Amazon Echo smart displays, even if they’re not in your home - you can even make group calls on Amazon’s smart displays.",
    "In the US, Alexa can also make Zoom video calls as well on the Amazon Echo Show 8 and Amazon Echo Show 10 smart displays.",
    "Google Assistant also offers a hands-free calling function - in the US this is called Google Home Calling and can be used to call mobiles and landlines (but not 911 or 1-900 numbers) at no extra charge from any Google Nest smart speaker or display.",
    "In the UK and Australia, you can use a Google Nest speaker or smart display to call phone numbers free of charge using Google Duo. However, there’s no way of calling other Google Nest speakers and smart displays.",
    "When it comes to video calls, if you have a Google Nest Hub Max you can use Google Duo or Zoom to make two-way video calls, while using the Google Nest Hub (2nd generation) or Google Home Hub means you’ll be able to see the recipient on the video call but they can’t see you as these smart displays don’t have cameras built in.",
    "We asked both Alexa and Google some basic general knowledge questions including ‘what’s the tallest mountain in the world’, ‘when was Back to the Future released’ and ‘why is the Earth round’.",
    "Both voice assistants were able to respond with the correct answers in just a few seconds, although Alexa trumped Google Assistant here by providing some context. For example; when asked about the tallest mountain Alexa gave details about Mount Everest, which is the highest mountain in the world, but also told us about Mauna Kea, which is technically the tallest mountain however much of it is under water. Google Assistant just listed some of the highest mountains across Earth.",
    "We also asked both assistants to convert inches into cm and complete some hard mathematics (272 x 596), which they managed with ease.",
    "Alexa and Google Assistant can also offer a helping hand in the kitchen. During testing both voice assistants were able to successfully find recipes, and read them aloud, while displaying them on-screen if you’re using a smart display. Both Alexa and Google Assistant can also repeat steps, or ingredients list, if you need a quick reminder during cooking.",
    "When you’re cooking, a voice assistant can set timers for you, so you don’t have to get your smartphone or kitchen timer (if you still use one) dirty. Alexa excels here as, while like Google Assistant, Amazon’s voice assistant can set multiple timers and name them for you, it lets you check and stop these timers from other smart speakers or smart displays in the house, which isn’t something Google Assistant can do.",
    "If you don’t fancy cooking, it’s also possible to get Alexa and Google Assistant to order dinner in the US, UK and Australia, although Google’s food ordering is restricted to the US at present.",
    "Want to know how long it’ll take you to get to work? Your voice assistant can help with that too. We found Google Assistant excelled here, offering a direct route to local shops and restaurants, along with traffic information as well as public transport information.",
    "Alexa, however, struggled to provide public transport information, so Google is the clear favorite here if you want your smart device to help you move around.",
    "As voice assistants are always listening for their wake word or phrase, and they record your request once you’ve used that word or phrase so it can be processed and correctly responded to, it will inevitably lead would-be users to some privacy concerns.",
    "For some, these could be the reasons not to use a voice assistant at all. However, Amazon and Google state they take privacy seriously by allowing you to delete these recordings, both from their companion app or by asking the voice assistant.",
    "If you’re using them on a smart speaker or smart display, you can also mute them simply by asking or by pressing a button on the device itself.",
    "Google Assistant is available in Danish, Dutch, English, French, German, Italian, Japanese, Norwegian, Polish, Portugese, Spanish and Swedish on smart speakers. Not all languages are available in all territories, and some are only available when using Google Assistant through a smart speaker, but not a smart display.",
    "Google Assistant can also understand two languages at a time, although you can’t switch between the two in a single query. On top of that, Google Assistant also has an interpreter mode that can effectively translate phrases into different languages.",
    "Alexa is available in English, French, German, Italian, Japanese, Potugese, Spanish and does offer a dual language mode in some territories, for example in the US you can choose to use the voice assistant in English and Spanish. It can translate for you as well, although it wasn’t as smooth or as well-versed as Google Assistant in our tests.",
    "Alexa and Google Assistant are both very good voice assistants, but they excel in different areas. If you’re looking for a digital assistant to control your smart home devices and automate your home, Alexa offers a wider variety of functions over Google’s voice offering..",
    "However, it’s also worth considering the devices you already own and the music and video services you subscribe to, as well as how you plan to use the voice assistant, as Google Assistant may be a better fit - especially if you’re regularly using an Android smartphone."
  ],
  "headers": {
    "3": "Best Amazon Echo and Google Nest deals",
    "4": "Voice recognition",
    "9": "Price",
    "11": "Smart home devices",
    "16": "Music and video",
    "21": "Staying in touch",
    "27": "General knowledge",
    "30": "Cooking and food",
    "33": "Directions",
    "35": "Privacy",
    "38": "Languages",
    "41": "Verdict"
  },
  "links": {
    "Statistica": "https://www.statista.com/statistics/1133875/global-voice-recognition-market-size/",
    "best smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "best smart displays": "https://www.techradar.com/best/best-smart-displays",
    "Amazon Echo Dot (2020)": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Google Nest Mini 2": "https://www.techradar.com/reviews/google-nest-mini",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "Honeywell": "https://www.techradar.com/reviews/honeywell-evohome",
    "Tado": "https://www.techradar.com/reviews/tado-smart-thermostat",
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "Google Nest Hello Video doorbell": "https://www.techradar.com/reviews/nest-hello",
    "Google Nest Learning thermostat": "https://www.techradar.com/reviews/gadgets/appliances/nest-learning-thermostat-1256380/review",
    "IFTTT": "https://www.techradar.com/how-to/world-of-tech/how-to-control-your-smart-home-with-ifttt-1326142",
    "Alexa Hunches": "https://www.techradar.com/news/alexa-can-now-control-your-smart-home-gadgets-without-voice-commands",
    "Amazon Fire TV": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Google Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Alexa can make free audio calls": "https://www.techradar.com/how-to/how-to-make-phone-calls-with-alexa",
    "group calls on Amazon’s smart displays": "https://www.techradar.com/how-to/how-to-make-group-calls-with-alexa-on-an-amazon-echo",
    "Amazon Echo Show 8": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "Amazon Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review"
  }
}