{
  "source": "https://www.techradar.com/news/far-cry-6-is-profoundly-serious-and-silly-at-the-same-time-and-its-all-the-better-for-it",
  "title": "Far Cry 6 is profoundly serious and silly at the same time – and it’s all the better for it",
  "category": "gaming",
  "updated": "2021-09-01T09:30:58Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Yara going to have a good time",
  "article": [
    "Far Cry 6 is a game of extremes. On the one hand, you’re part of a fearless guerrilla movement known as Libertad – a band of rebels who are hell-bent on overthrowing the island of Yara’s ruthless dictator, Anton Castillo.",
    "On the other, you’ll be issuing commands to a T-shirt-wearing pet crocodile, singing along to the latest hits on the radio, and firing pirated CDs of Los del Rio’s Macarena at unwitting enemies as you liberate Yara from Castilo’s vice-like grip, one overthrown outpost at a time.",
    "Far Cry 6 is like dipping bacon in peanut butter, then: it shouldn’t work, but the combination of two contrasting flavors complements each other surprisingly well. It’s gravely serious yet delightfully silly at the same time, and it’s the kooky and comical side of Far Cry 6 that resonated with me most during my hands-on time with the game.",
    "Fundamentally, the sixth entry in Ubisoft’s long-running open-world series doesn’t reinvent the wheel or offer the type of revolution you’re desperately fighting for in Far Cry 6. Instead, it sticks closely to the tried-and-test formula that epitomizes almost every Far Cry game, which will either delight or prove a turn-off depending on your stance on the franchise.",
    "You’ll still be taking down checkpoints, wrestling key points of interest from the enemy, embarking on countless side-quests, commandeering heavily-armed vehicles, and blowing things to kingdom come in delightfully inventive ways. You can also expect to see a frankly frightening amount of icons on your mini-map, all vying for your attention.",
    "But one thing that stood out after playing Far Cry 6 for more than a few hours is that the game doesn’t hold you back by needlessly restricting the things that you need. In fact, they’re more accessible than ever.",
    "Need a ride? Call one in, and enjoy the complementary machine-gun turret that’s attached to the back. See that checkpoint in the distance? Well, you can jump off a cliff and use a combination of your parachute and wingsuit to get to your objective lickety-split. Want to take out an outpost using stealth or go in wielding a flamethrower? The choice is yours.",
    "Far Cry 6 delivers the type of instant gratification the majority of open-world games have been missing in recent years, and it’s super refreshing as a result. Red Dead Redemption 2 may have the most realistic horses in a video game to date, but Far Cry 6’s unruly stallions are genuinely more exhilarating to ride because they aren’t constrained by the same meticulous standards.",
    "So, even though much of Far Cry 6’s signature brand of entertainment is familiar – and likely won’t convert those who already aren’t a fan of Ubisoft’s title – there are some distinct changes to the game’s formula that offer more of an impact than I initially thought.",
    "The first of which is the fact that your protagonist, Dani Rojas, has a face. Yes, as daft as it may sound, I found that being able to see my character in the flesh during the game’s many cutscenes and interactions with the cast of zany characters really helped ground me in Far Cry 6’s tropical world, something that I haven’t felt was the case in previous titles.",
    "This feeling of being connected to your character is strengthened by certain gameplay scenes, too. Whenever you enter specific guerrilla camps or fire off your backpack super (a devastating special move that can wipe out tens of enemies), you’ll see Dani in all their glory.",
    "Far Cry 6 also has a heavy emphasis on customization this time around. Dani can wield, wear and craft countless crude-looking items in Far Cry 6, and you’ll need to use the right tool for the job if you want to really rip Castillo’s forces a new one. From bullet-piercing rounds to providing protection against poisonous gases, or simply equipping a make-do silencer out of an old plastic bottle, tinkering at your worktable to create your next weapon or gear is of paramount importance if you’re to beat the overwhelming odds that stand in your way.",
    "The series’ usual tropes are still alive and well in Far Cry 6, then, but my time in Yara generated more than a few smiles and genuine giggles. Whether it was jumping out of a helicopter to land on a boat teeming with hostiles or simply running away from a frightfully aggressive wild boar that wanted nothing more than to spill my blood, there’s definitely fun to be found in Yara’s twisted paradise.",
    "Far Cry 6 will be released on October 7 for PS4, PS5, Xbox One, Xbox Series X|S, Stadia, and PC."
  ],
  "headers": {
    "3": "Not a far cry from the past",
    "8": "Look who it is",
    "12": "Welcome to the jungle"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "Anton Castillo": "https://www.techradar.com/news/far-cry-6-villain-is-a-hero-says-giancarlo-esposito",
    "Far Cry game": "https://www.techradar.com/news/far-cry-vr-is-a-fun-and-sweaty-dive-into-insanity-before-far-cry-6-but-its-not-really-a-far-cry-game",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-pc-release-date-news-tips",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Stadia": "https://www.techradar.com/reviews/google-stadia"
  }
}