{
  "source": "https://www.techradar.com/news/olive-union-reimagines-the-hearing-aid-with-the-olive-pro-smart-hearing-aid",
  "title": "Olive Union Reimagines the Hearing Aid with the Olive Pro Smart Hearing Aid",
  "category": "wearables",
  "updated": "2021-01-12T22:33:40Z",
  "author": "sponsored",
  "summary": "The Olive Pro combines wireless earbuds with hearing aids",
  "article": [
    "With hearing aids ranging from $1,000 to over $6,000, many simply cannot afford to hear. Moreover, hearing aids come with stigma and a wealth of additional problems. Because of this, only one in five of the approximately 466 million people around the world suffering from hearing loss seek medical treatment. Owen Song, the engineer behind Olive Union, sought to remedy that with the Olive Smart Ear - a wireless earbud that makes hearing easier. Now, Olive Union has taken the next step with Olive Pro - a true FDA registered hearing aid.",
    "If you want to be first in line for a pair of Olive Pro smart hearing aids, Olive Union’s Indiegogo is already underway with less than two weeks to go. You can save up to 48% off the MSRP and will be one of the first to own this incredible new device. Olive Pro will begin shipping out in March 2021.",
    "Founded by Owen Song, Olive Union made waves with its Olive Smart Ear, even earning the CES Innovation award for Best Wearable in 2020. After watching his uncle struggle with expensive, traditional hearing aids, only to give up, Song was personally invested in finding a solution to the problem so many hard of hearing adults face. Traditional hearing aids are incredibly expensive, require their wearers to constantly replace their batteries, are easily damaged or lost, and, quite frankly, are ugly. These barriers keep too many people, like Song’s uncle, from purchasing hearing aids or continuing to use them.",
    "As an engineer, Song knew this didn’t have to be the case. Determination on his side, Song dismantled his uncle’s hearing aids only to find the technology inside didn’t come close to matching the outlandish price. After extensive research, Song found that the average hearing aid costs about $100 to produce, only to be marked up to thousands of dollars for no good reason.",
    "Meanwhile, countless people wear fashionable and sleek earbuds, like Apple’s AirPods, every day. Even the top of the line AirPods Pro only cost a fraction of what traditional hearing aids cost and they often work better too!",
    "The Olive Smart Ear, as remarkable a product as it is, is not a hearing aid, but rather a personal sound amplifying product. While it has helped many, many people hear better, to make a true hearing aid, Olive Union needed a product that could earn FDA approval. This is where the Olive Pro began.",
    "The Olive Pro is both a sleek and stylish pair of wireless earbuds and an FDA-registered hearing aid and, even at the MSRP of $299, it’s less than a third the price of the cheapest hearing aids on the market. However, the Olive Pro isn’t just about saving money or looking fashionable. Those are certainly selling points, but far more impressive are the ways in which Olive Pro hearing aids work better than traditional hearing aids.",
    "The Olive Pro smart hearing aids have a wide range from 20Hz all the way up to 20,000Hz with a maximum sound pressure of 120 dB. Beyond that range, these incredible hearing aids also employ state of the art voice recognition and noise cancellation powered by machine learning. Even for those who don’t have traditional hearing loss, Olive Pro smart hearing aids can literally filter out the background noise, making it easier to hear.",
    "The Olive Pro smart hearing aids will also save your wallet and the environment by doing away with the need for tiny batteries. Like any modern wireless earbuds, the Olive Pro are rechargeable. They support both fast charging and wireless charging, with a single charge lasting seven hours with an additional 14 hours of charge in the case. They’re also both comfortable and water resistant.",
    "What stands out most about the Olive Pro smart hearing aids, however, is just how easy they are to use. With apps for both Android and iOS, setting up your new smart hearing aids can be done in as little as five minutes. Recalibrating them is just as quick and easy too. The app also allows for manual adjustment to really fine tune your hearing experience."
  ],
  "headers": {
    "1": "Early Access through Indiegogo",
    "2": "Olive Union",
    "5": "Olive Pro: Blurring the line between earbuds and hearing aids"
  },
  "links": {
    "Olive Union’s Indiegogo": "https://www.indiegogo.com/projects/olive-pro-smart-hearing-aids-affordable-hearing/reft/17684970/TechRadar"
  }
}