{
  "source": "https://www.techradar.com/news/prime-gaming-is-giving-away-free-fifa-21-ultimate-team-rewards",
  "title": "Prime Gaming is giving away free FIFA 21 Ultimate Team rewards",
  "category": "gaming",
  "updated": "2021-01-26T10:31:11Z",
  "author": "axel-metz",
  "summary": "Grab your free FIFA 21 content",
  "article": [
    "Amazon Prime members can get their hands on free FIFA 21 rewards for the game’s Ultimate Team mode right now - with plenty more to come.",
    "The content drop comes as part of Prime Gaming, Amazon’s rebranded Twitch Prime service, and gives Prime subscribers complimentary access to the following FIFA 21 in-game rewards by visiting the Prime Gaming website:",
    "The offer marks the first of nine collaborative drops between FIFA 21 and Prime Gaming, with one new reward pack expected every month until August 2021. In 2020, similar free packs were made available to Prime-subscribing members of the FIFA community. These rewards help players accumulate rare cards to be used on the pitch or to complete challenges in the game’s squad battles mode (SBCs).",
    "EA recently announced this year’s annual Team of the Year (TOTY) squad in FIFA Ultimate Team (FUT), so now marks a great time to jump into the game and claim your free rewards as a Prime member.",
    "Prime Gaming is included with all Amazon Prime memberships and gives players access to exclusive in-game rewards for various titles.",
    "Along with the latest FIFA rewards, members currently have access to the newest Fall Guys bundle, as well as exclusive in-game content for Apex Legends, Roblox, Grand Theft Auto Online, League of Legends and many others.",
    "The service also offers over 30 free games to Prime subscribers, and non-members can access these exclusive benefits by launching a 30-day free trial of the service by following the link below:"
  ],
  "headers": {
    "4": "Prime position"
  },
  "links": {
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "Prime Gaming": "https://www.techradar.com/news/twitch-prime-is-now-prime-gaming-will-keep-serving-up-free-gaming-goodies",
    "Prime Gaming website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1247345115329448400&xs=1&url=https%3A%2F%2Fgaming.amazon.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fprime-gaming-is-giving-away-free-fifa-21-ultimate-team-rewards"
  }
}