{
  "source": "https://www.techradar.com/news/new-logitech-wireless-and-wired-earbuds-want-to-make-work-calls-more-stylish",
  "title": "New Logitech wireless & wired earbuds want to make work calls more stylish",
  "category": "audio-visual",
  "updated": "2021-08-03T16:20:51Z",
  "author": "mike-moore",
  "summary": "Logitech knows you want something more stylish to wear during work calls",
  "article": [
    "Making video conferencing calls could soon be a lot more stylish thanks to a new set of releases from Logitech.",
    "The company has launched new wireless & wired earbuds for professionals that it says offer a much more reliable and customizable way of taking part in online meetings.",
    "The new Zone Wired earbuds & Zone True Wireless products both come with advanced noise cancellation (ANC) capabilities that the company says make either product ideal for those who are now looking to split their work life between their home and office environment.",
    "Logitech says the launch was motivated by a real desire from consumers to upgrade the equipment they needed for video calls.",
    "Many found wearing a headset for conference calls with a band across the top a little confining, as well as making it look like they worked in a call centre - not to mention how it would mess up a person’s hair if worn for a long time.",
    "In order to solve this, the new earbuds look to offer a more discreet, but still stylish alternative for hybrid workers everywhere.",
    "Available for £299/$299/€329, the Zone True Wireless earbuds are available in Graphite and Rose colour options. The earbuds are able to connect to both your laptop or PC and your smartphone at the same time using Bluetooth connectivity plus a USB receiver, meaning you can switch between devices quickly and easily.",
    "Logitech says that once paired, you’ll never need to re-pair the Zone True Wireless earbuds again, with the device offering a 30m/100ft connectivity range.",
    "The Zone True Wireless earbuds also packs three mics - two that listen out, and one that listens in - to make sure the right audio gets sent through, with specially-designed Active Noise Cancellation to cut out wind, traffic and other outside noises.",
    "Alongside the wireless offering, Logitech also revealed the Zone Wired Earbuds for those looking for a firmer connection.",
    "Available with connectors for 3.5mm audio jack, USB-A and USB-C, the earbuds are able to sync with Android or iOS, Windows, Mac and Chrome OS, and come with a 1.45m cable to ensure maximum flexibility.",
    "Costing £99/$99/€99, Logitech says the Zone Wired Earbuds comes with a beamforming mic in the left earbud, meaning your audio won’t be affected by the cable swishing around.",
    "Both the wired and wireless products are certified to work with all the leading video conferencing services around today, with the likes of Zoom, Microsoft Teams, Google Meet and WebEx all supported.",
    "Both devices will be available from Autumn 2021."
  ],
  "headers": {
    "3": "Wired or wireless?"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Logitech": "https://www.techradar.com/news/best-logitech-webcams",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "headset for conference calls": "https://www.techradar.com/news/best-business-headphones-and-earphones"
  }
}