{
  "source": "https://www.techradar.com/news/qualcomm-appoints-cristiano-amon-as-ceo",
  "title": "Qualcomm appoints Cristiano Amon as CEO",
  "category": "phones",
  "updated": "2021-01-06T11:05:38.715Z",
  "author": "steve-mccaskill",
  "summary": "5G chief will replace retiring Steve Mollenkopf",
  "article": [
    "Qualcomm has chosen Cristiano Amon to replace the retiring Steve Mollenkopf in an appointment that reflects the growing importance of 5G.",
    "Mollenkopf will step down in June after 26 years with the company, first as an engineer and latterly as CEO since March 2014.",
    "He is credited with steering the company through a series of “extraordinary” challenges, maintaining its position in the 4G market, and establishing the foundation for leadership in 5G, IoT, and automotive technologies.",
    "“I am immensely proud of all that we have accomplished at Qualcomm and the position the Company currently enjoys as the world’s leader in wireless technologies,” Mollenkopf said. “With our business model clearly validated and our leadership in 5G, this is the right time for Cristiano to assume leadership of the Company and preside over what I see as the single largest opportunity in the Company’s history.”",
    "Amon, who will formally assume the reins in June, is also a Qualcomm veteran, having joined as an engineer back in 1995. As president, the 50-year old is responsible for Qualcomm’s semiconductor business and has been instrumental in the development of its 5G technical roadmap and strategy.",
    "5G networks will power a wide variety of devices beyond smartphones and support new business, industrial and Internet of Things (IoT) applications. This increased scope is a huge opportunity for Qualcomm.",
    "“I am honored to be named the next CEO of Qualcomm and appreciate the confidence that Steve and the Board have in me,\" said Amon.",
    "“Qualcomm is an incredible Company. We have been at the forefront of innovation for decades and I look forward to maintaining this position going forward. In addition to driving the expansion of 5G into mainstream devices and beyond mobile, Qualcomm is set to play a key role in the digital transformation of numerous industries as our technologies become essential to connecting everything to the cloud.”"
  ],
  "headers": {
    "3": "Qualcomm CEO"
  },
  "links": {}
}