{
  "source": "https://www.techradar.com/news/microsoft-edge-is-finally-becoming-more-like-chrome",
  "title": "Microsoft Edge is finally becoming more like Chrome",
  "category": "computing",
  "updated": "2021-03-15T13:38:04Z",
  "author": "sead-fadilpasic",
  "summary": "Microsoft's browser will mimic Chrome's four-week update cycle.",
  "article": [
    "Microsoft is introducing another new feature to its Chromium-based Edge browser that should bring it up to speed with its great rival, Google Chrome.",
    "Announcing the news in a blog post, the Redmond software giant said Edge will follow Chrome's example of issuing updates every four weeks.",
    "Google recently confirmed that in Q3 2021, and starting with Chrome 94, it will release major browser milestones every four weeks, instead of the current six weeks. After another Brave, another Chromium-based browser, announced it would follow it Google's footsteps, Microsoft has now followed suit, adding that it will also offer a different cycle for its enterprise customers.",
    "“For many, innovation can’t come fast enough! But that is not the case for all customers,” Microsoft explains. “Particularly our enterprise customers, who manage complex environments and must balance delivering new innovations against rigorous planning and testing.”",
    "Going forward, enterprise users of Microsoft Edge will have an Extended Stable option that will bring new updates every eight weeks - but the four-week cycle will remain the default. Users that opt for the Extended Stable option will get security updates every two weeks, which will handle the most important fixes. Everything else will be delivered on the extended schedule.",
    "The change should be introduced with Edge 94, scheduled to be released in late September 2021.",
    "Even though Microsoft is seemingly behind in the browser wars, it’s still dedicating plenty of effort to Edge. It recently announced that version 89 will support natural language search on the address bar, history search page, and the history hub. Microsoft hopes these new features will help deliver smarter and more accurate search results.",
    "It also said it would be removing the legacy version of the browser, which still comes preinstalled with Windows 10, from the operating system. EdgeHTML engine, however, still has some time on its hands, as the company expects to offer continued support until late August this year."
  ],
  "headers": {
    "4": "Stable Edge"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "a blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9246300546577277000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fdeployedge%2Fmicrosoft-edge-release-schedule",
    "starting with Chrome 94": "https://www.techradar.com/news/you-might-get-google-chrome-updates-a-lot-faster-in-future",
    "security updates": "https://www.techradar.com/best/best-patch-management-tools",
    "support natural language search": "https://www.techradar.com/news/microsoft-edge-is-making-it-easier-than-ever-to-find-the-webpage-youre-looking-for",
    "removing the legacy version": "https://www.techradar.com/news/microsoft-edge-may-be-about-to-bite-the-dust-on-some-windows-10-systems"
  }
}