{
  "source": "https://www.techradar.com/news/arm-unveils-most-powerful-cpus-gpus-to-date",
  "title": "Arm unveils most powerful CPUs, GPUs to date",
  "category": "computing",
  "updated": "2021-05-26T12:57:57Z",
  "author": "joel-khalili",
  "summary": "Next-generation Arm processors sit under new ‘Total Compute’ range",
  "article": [
    "Arm has launched a new range of products, called Total Compute, built on top of its recently released Armv9 architecture.",
    "The product suite, which includes powerful new Cortex CPUs, Mali GPUs and CoreLink interconnect technologies, is designed to drive a broad range of devices, from simple smart tech to the most demanding workstations.",
    "According to Arm, the new SKUs are built to deliver on the “three pillars” of the company’s Total Compute Strategy: compute performance, developer access and security.",
    "“By addressing these three pillars together, Arm can deliver uncompromised performance, security, scalability and efficiency, accessible to millions of developers worldwide,” said the firm.",
    "“These flexible solutions will empower our partners to unlock a new generation of immersive and interactive experiences across the broadest range of applications.”",
    "Headlining the announcement is Arm’s new Cortex-X2 processor, which is said to be the company’s most powerful CPU yet. The Cortex X2 is scalable across top-end laptops and smartphones, and reportedly delivers a 30% performance improvement on the current generation of premium Android devices.",
    "Arm has also launched the Cortex-A710, the first “big” CPU based on Armv9, and the Cortex-A510, the company’s first “LITTLE” core in four years. As is to be expected, both offer significant performance increases over the previous generation, in the region of 30%.",
    "To help customers bolster graphical performance, Arm has introduced a trio of new Mali GPUs, the most powerful of which is the Mali-G710. Built for premium smartphones, laptops and Chromebooks, the G710 delivers a 20% performance uplift that will benefit gamers in particular.",
    "As with the Cortex range, Arm has released two accompanying “sub-premium” GPUs: the Mali-G610 and Mali-G510. The pair offer lower performance but at a more affordable price point, ideal for mid-range devices and premium smart TVs.",
    "Finally, Arm shared new details about its latest interconnect technologies, which link the various different components in a system and are crucial to delivering the best possible performance. The company says its new CoreLink CI-700 and NI-700 interconnects work seamlessly with Arm IP, delivering increased security, bandwidth and latency.",
    "The Total Compute range has been met with approval from manufacturers and software developers alike, from Samsung and Zoom to semiconductor company MediaTek.",
    "“Mobile devices, from smartphones, tablets, to Chromebooks, have transformed the ways we interact, work, and learn,” said Dr. Kevin Jou, MediaTek CEO.",
    "“Arm’s Total Compute solutions bring exciting new advances to the mobile landscape with more compute performance, increased system efficiency, and stronger security for future devices. We look forward to continuing working with Arm to enhance next-generation user experience in entertainment, education, and productivity.”"
  ],
  "headers": {
    "5": "Arm Total Compute"
  },
  "links": {
    "Armv9 architecture": "https://www.techradar.com/news/heres-what-arms-next-generation-of-chips-will-look-like",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "smartphones": "https://www.techradar.com/news/best-phone",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives"
  }
}