{
  "source": "https://www.techradar.com/news/this-bizarre-cpu-vending-machine-in-japan-is-a-real-silicon-lottery",
  "title": "This bizarre CPU vending machine in Japan is a real silicon lottery",
  "category": "computing",
  "updated": "2021-08-31T10:17:19Z",
  "author": "darren-allan",
  "summary": "Buy a Ryzen 5000 – a Ryzen 5000 box at least",
  "article": [
    "Japan is famous for its massed ranks of vending machines, with a ton of different models crammed in everywhere in Tokyo, selling all manner of things – from umbrellas to beer – and now there’s a new model in town that vends processors.",
    "As Wccftech reports, dedicated vending machines dispensing CPUs are now a thing in Japanese arcades, which on the face of it contain AMD Ryzen 5000 processors. Though priced at 1000 Yen – about $9.10 / £6.60 / AU$12.40 – you’re not going to get a cutting-edge chip as you might anticipate.",
    "If you take the plunge with one of these machines, what you do get is a Ryzen 5000 box which contains a few CPUs that might be AMD or Intel models, and could be anything.",
    "The temptation to play is driven by the (very slim sounding) possibility of picking up a contemporary(ish) Ryzen CPU, perhaps a first-gen or second-gen model as Wccftech makes clear – something you could actually build a budget PC around, in other words, or maybe use to upgrade a very outdated machine.",
    "We talk about the silicon lottery in terms of how good any given CPU is at overclocking, but this is a literal processor lottery, and we’re betting the odds of getting something good are very shaky.",
    "Given that you’re handing over the equivalent of a handful of dollars or pounds for a handful of CPUs in some cases, those bits of silicon are likely to be ancient: the 486DX processor, a 33MHz beast that powered our first PC, was brought to mind here (though probably not that old, seeing as that’s now venturing into collectible territory).",
    "Despite the doubtless age-old silicon mostly involved, the temptation of getting some kind of decent Ryzen chip (like maybe a 2700X which is still a perfectly serviceable 8-core CPU in the main), or an Intel equivalent, will doubtless keep folks paying. An image of one of the machines posted on Twitter shows it’s almost empty, so that would appear to tell a story in itself.",
    "Of course, the idea of tech vending machines which are a huge gamble isn’t a new one. ‘Treasure Box’ vending machines are already a thing as this Timeout article highlights, offering the enticing possibility of winning a Nintendo handheld for a small fee, but the likelihood of getting a tiny plastic torch that breaks after three days of ownership."
  ],
  "headers": {
    "4": "Analysis: Treasure or trash, that’s the (doubtless heavily weighted) gamble"
  },
  "links": {
    "processors": "https://www.techradar.com/news/best-processors",
    "Wccftech": "https://wccftech.com/you-can-literally-buy-amd-ryzen-5000-desktop-cpus-through-a-vending-machine-in-japan/",
    "AMD Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Intel": "https://www.techradar.com/news/amd-vs-intel",
    "Timeout": "https://www.timeout.com/tokyo/things-to-do/weird-but-wonderful-vending-machines-in-tokyo"
  }
}