{
  "source": "https://www.techradar.com/news/new-matrix-resurrections-trailer-revives-the-past-to-deliver-a-new-puzzling-future",
  "title": "New Matrix Resurrections trailer revives the past to deliver a new puzzling future",
  "category": "entertainment",
  "updated": "2021-12-06T17:02:52Z",
  "author": "tom-power",
  "summary": "Happy Matrix Monday, everyone!",
  "article": [
    "The Matrix Resurrections has received a new trailer ahead of its release later this month – and it looks absolutely stunning, even though it leaves us with more questions than answers.",
    "In celebration of 'Matrix Monday', the day that theater tickers officially go on sale – although the fourth film in the franchise will also come to HBO Max – Warner Bros. released a brand new look at its final film release of 2021.",
    "Suffice to say, The Matrix Resurrections looks like it'll be the nostalgia-inducing, ground breaking film that its cast and crew, as well as diehard fans, are hoping that it'll be. Consider us intrigued, Mr. Anderson and company.",
    "Check out The Matrix Resurrections' newest trailer below:",
    "So what does the film's latest trailer show? We get a better look at the gravity-defying, superhero-esque action that the movie series is renowned for, plenty of quick cuts between various sequences, and a bit more explanation about what the sci-fi film's plot will actually entail.",
    "And when we say 'a bit', we only mean 'a bit'. There's plenty that is teased – for one, it looks like Jonathan Groff's character is the reincarnated form of Agent Smith, who was portrayed by Hugo Weaving in the original trilogy.",
    "There are also numerous shots that showcase the meta nature of The Matrix Resurrections, too, with plenty of call-backs to the other three films. Reimagined and like-for-like shots, such as Trinity leaving Neo in a coffee shop, Groff's character giving a carbon copy speech that Agent Smith previously gave, and Neo deciding whether to take the red or blue pill, reveal how The Matrix Resurrections will revisit its past.",
    "But there's a lot here that looks new, too. We see more of the film's new cast members in action, such as Yahya Abdul-Mateen II's Morpheus and Priyanka Chopra Jonas's Sati, a new aesthetic to the world of the Matrix (which we glimpsed in the movie's first trailer), and potentially new powers for Neo and Trinity.",
    "As Jessica Henwick's Bugs puts it: \"Maybe this isn't the story that we think it is\". Here's hoping she's right – i.e. that The Matrix Resurrections' trailers are simply a bait-and-switch, and that its true revelations will come to light when the film lands very soon.",
    "Directed by Lana Wachowski and starring Keanu Reeves, Carrie-Anne Moss, Jessica Henwick, Yahya Abdul-Mateen II, Jonathan Groff, Jada Pinkett Smith and Neil Patrick Harris, The Matrix Resurrections will simultaneously launch in theaters and on HBO Max on Wednesday, December 22."
  ],
  "headers": {},
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained"
  }
}