{
  "source": "https://www.techradar.com/news/outriders-inventory-wipe-bug-gets-worse-after-patch-but-theres-a-way-to-maybe-prevent-it",
  "title": "Outriders inventory wipe bug gets worse after patch – but there’s a way to (maybe) prevent it",
  "category": "gaming",
  "updated": "2021-04-12T10:37:12Z",
  "author": "darren-allan",
  "summary": "Wipeout woes worsen, but there is a “potential prevention method”",
  "article": [
    "Outriders seems to be in further hot water after the first big patch was unleashed at the weekend, as while this fixed some issues, it has apparently made the seriously nasty inventory wipe bug more prevalent.",
    "The official known issues thread from Square Enix was updated to note: “Since the recent patch we have seen an increase in reports of this issue – resolving the inventory wipe is our top priority and will remain so until fixed.”",
    "The Outriders Twitter account added that “the moment we make a breakthrough we will immediately update you all”, and also shared something more interesting – a possible way of avoiding the bug, or at least having a chance of doing so.",
    "The devs advise: “A potential prevention method to safeguard yourself if you run into this issue: The moment you notice that your gear has disappeared, immediately force close the game, then reboot it.”",
    "While this is only a ‘potential’ method of dodging the loss of your stuff, it’s obviously something well worth trying to avoid that painful situation. The phrasing of that tweet clearly emphasizes that you should act quickly and, well, immediately, if you happen upon the dreaded inventory wipe glitch.",
    "Anecdotal reports seem to suggest that this workaround has been successful for some, but not for others, which sounds about right for a potential solution. At least it does appear to work in some cases.",
    "While the restoration of wiped inventories is obviously much awaited by those affected, there’s only so much it will do – the stats of lost items may differ when they are reintroduced, and the fix is “unlikely to restore an inventory full of blue gear”, so lesser items could be gone for good.",
    "Currently the bug is leading to a situation where some people are now afraid to play Outriders, and are just steering clear until the looming possibility of gear loss is no longer a specter haunting the game.",
    "It’s a rocky start for Outriders, that much is for sure, and we’ve also witnessed some reports and complaints that some of the fixes supposedly applied in the first patch aren’t working. Not to mention a freshly discovered issue where masses of crash report data is eating up ridiculous amounts of drive space (there’s a fix for that, though)."
  ],
  "headers": {
    "6": "Restoration limits"
  },
  "links": {
    "Outriders": "https://www.techradar.com/how-to/outriders-class-guide",
    "first big patch was unleashed at the weekend": "https://www.techradar.com/news/outriders-patch-is-here-early-at-least-on-pc-and-playstation",
    "note": "https://www.reddit.com/r/outriders/comments/mmrf7d/outriders_post_launch_dev_news_updates/gtt2fr2/",
    "advise": "https://twitter.com/Outriders/status/1381263711344672772",
    "we’ve also witnessed some reports and complaints that some of the fixes": "https://www.techradar.com/news/outriders-patch-is-here-early-at-least-on-pc-and-playstation",
    "there’s a fix for that, though": "https://www.techradar.com/news/outriders-crash-data-file-size-is-taking-over-peoples-hard-drives-heres-how-to-fix-it"
  }
}