{
  "source": "https://www.techradar.com/news/samsung-q2-profits-set-to-rise-as-chip-demand-grows",
  "title": "Samsung Q2 profits set to rise as chip demand grows",
  "category": "phones",
  "updated": "2021-07-06T09:18:42Z",
  "author": "steve-mccaskill",
  "summary": "Analysts predict good things as consumer and enterprise markets rebound",
  "article": [
    "Profits at Samsung look to have surged by 38% during the second quarter of 2021 as strong demand for consumer electronics and data centre equipment led to a boom in the market for chips.",
    "According to estimates from Refinitiv, which aggregates and weights forecasts from multiple analysts, operating profit for the period between April and June reached 11.3 trillion won (£7.2bn). This represents its best Q2 since 2018 and is a 20% rise from Q1.",
    "Meanwhile, it is thought overall revenues rose by 15.4%.",
    "These gains came despite a slump in sales of Samsung’s own smartphones from 76 million in Q1 to 59 million. Analysts attributed this decline to falling demand for its flagship handsets, slowing sales in pandemic-hit India, and a shortage of components for some handsets caused by the pandemic.",
    "The smartphone sector has been hit by Covid-19 due to economic and production challenges that had caused supply issues and lowered demand. However, the easing of lockdown measures around the world has laid the foundations for a recovery in 2021.",
    "Although this has caused a global chip shortage, Samsung has benefited from both rising prices and greater demand. The Korean giant is the world’s leading smartphone manufacturer but is also a major supplier of components for the industry.",
    "Ironically, prior to the pandemic, Samsung was suffering from a price crash in the memory chip market. Now demand for DRAM chips in servers, mobile phones and other devices has increased by 27% while NAND chip sales rose by 8.6%.",
    "This allowed Samsung’s chip business, which has traditionally contributed as much as two thirds of the company’s profits, to report profits of 6.6 trillion won (£4.2bn). Meanwhile, the mobile business generated profits of 2.9 trillion won (£1.8bn)."
  ],
  "headers": {
    "3": "5G speed record"
  },
  "links": {
    "Samsung": "https://www.techradar.com/deals/samsung-mobile-phone-deals"
  }
}