{
  "source": "https://www.techradar.com/news/garmin-fenix-7-what-we-want-to-see",
  "title": "Garmin Fenix 7: release date rumors, news, and what we want to see",
  "category": "wearables",
  "updated": "2021-12-06T11:45:18Z",
  "author": "james-rogerson",
  "summary": "Rising from the ashes in 2022?",
  "article": [
    "The Garmin Fenix 7, the next instalment in Garmin's line of flagship running watches, is expected to land some time in 2022, and although the company itself has yet to release any information, the rumor mill has begun turning in earnest over recent weeks.",
    "Below you’ll find information on the likely release date and price, plus speculation on the features and improvements that will be offered, and below that a list of the things we really want to see from it.",
    "And make sure to check back regularly, as we’ll be updating this article with all the news, leaks and rumors until the Garmin Fenix 7 range is released.",
    "It's now December 2021, and based on past experience we're not expecting any new Garmin devices to appear before the new year. Garmin typically releases most of its devices between June and September (the Fenix 6 series landed in August 2019), so we'll likely need to wait a while longer for the Fenix 7. That also goes for any other devices in the line, which could include a Fenix S, Fenix X, and Fenix X Pro.",
    "If you want a solar version of any of those watches, you'll probably have to hold on even longer; there's typically a gap between the launch of a new Garmin device and its solar counterpart.",
    "As for what the watch will cost, at launch the Garmin Fenix 6 started at £529.99 / $599.99 / AU$949. That’s for the standard Fenix 6, but there are a number of other models in the range, such as the Fenix 6S, Fenix 6X Pro, and Fenix 6X Pro Solar, topping out at £999 / $1,149.99 / AU$1,549.",
    "While there aren’t any pricing rumors for the Garmin Fenix 7 range yet, it’s likely to cost a similar amount.",
    "That said, Garmin does tweak the prices for new models and it has been known to go up as well as down, so the Fenix 7 might be a little more or a little less. However, as we're expecting this to be a 'stable' launch, we'd expect parity - the older models tend to be the cheaper options for those that don't want the newest models.",
    "There aren’t really any Garmin Fenix 7 rumors yet, but we can guess at some possible features and changes. For example, it’s possible that the solar charging tech used on top-end models of the Garmin Fenix 6 will be made available across the range. It’s also likely that Garmin will do what it can to reduce the size and weight of the watch, without compromising its outdoor credentials.",
    "General improvements to the specs and screen are likely too, and we’ll probably see some new features. Exactly what isn’t clear yet, but we’ve listed some ideas of what we’d like to see below (along with some things we don't want to change)",
    "No one would accuse the Garmin Fenix 6 of being stylish. That’s mostly OK, after all, it’s an outdoor watch and is appropriately rugged, but it’s also expensive, and having an expensive watch that isn’t smart or sleek enough for all situations isn’t ideal.",
    "Plus, that bulky build also impacts its fitness credentials, as in our review we found it was too chunky to comfortably wear for yoga, for instance.",
    "As such we’d like to see the Fenix 7 slimmed down, and ideally given a stylish makeover too. How viable that would be we’re not sure, given that we don’t want it to compromise on its core features and durability, but we’d like Garmin to try.",
    "There’s no escaping that the Garmin Fenix 6 range is very expensive, even costing more than the Apple Watch 7. Now, this is a top-end range so it’s always going to be expensive, but if Garmin could shave a little off the price it should make the Fenix 7 a lot more appealing to a wider range of people.",
    "That said, past experience suggests that a price drop is unlikely; Garmin devices usually launch at the same price as their predecessors.",
    "We've heard suggestions that the Garmin Fenix 7 may have an AMOLED display, as featured on the recently released Garmin Venu 2, but we think that might be a turn for the worse. An AMOLED display would look great, but would have a significant effect on battery life – a major issue for multi-day events. It may not be as slick, but memory-in-pixel seems like a more practical choice,",
    "Garmin added solar charging to its range with the Garmin Fenix 6X Pro Solar, but the bulk of the Fenix 6 models don’t include it, so we’d like to see this become a standard feature for the Fenix 7 range.",
    "That said, if it does we’d also like to see it improved, as in our review we didn’t find that it did much to improve the battery life. With its recently launched Quatix 6X Solar, Garmin proved solar can make a real difference, enabling the watch to last up to 24 days between charges, so we're cautiously optimistic.",
    "While the Garmin Fenix range is more focused on fitness than general health, there’s no reason it can’t do both, and the addition of an ECG (electrocardiogram) would help with that.",
    "This is one feature that's almost certainly coming to Garmin watches in the near future. Earlier this year, Garmin began recruiting for an electrocardiogram clinical valuation study, which was due to begin in March and aimed \"to confirm the Garmin ECG (electrocardiogram) software algorithm can detect and classify atrial fibrillation and normal sinus rhythm on single lead ECG data derived from a Garmin wrist-worn, consumer device.\"",
    "Garmin would still need to obtain approval from the FDA and other health administrations around the world, but it could always release the Fenix 7 with its ECG sensor disabled, and activate it later via a firmware update once it receives the green light.",
    "The Polar Grit X (and the new Polar Grit X Pro) is designed for serious endurance athletes, and one of its standout features is something we'd love to see in the next Garmin Fenix 7: fuelling advice. This helps ensure you stay hydrated and avoid hitting the wall by prompting you to take water and carbs on board at regular intervals, based on your physiology and planned activity. You often don't realise you're getting dehydrated or running low on glycogen until it's too late, so it could save you a lot of pain on long runs and rides."
  ],
  "headers": {
    "3": "Garmin Fenix 7 release date and price",
    "8": "Garmin Fenix 7 leaks and news",
    "10": "1. A new look",
    "13": "2. A more affordable price",
    "15": "3. No AMOLED",
    "16": "4. Solar charging across the range",
    "18": "5. An ECG sensor",
    "21": "6. Fuelling guidance"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/reviews/apple-watch-7",
    "We've heard suggestions": "https://the5krunner.com/2021/10/26/garmin-fenix-amoled-soon/",
    "Garmin Venu 2": "https://www.techradar.com/reviews/garmin-venu-2",
    "Quatix 6X": "https://www.techradar.com/news/garmin-launches-solar-smartwatch-that-lasts-up-to-24-days-between-charges",
    "an electrocardiogram clinical valuation study": "https://clinicaltrials.gov/ct2/show/NCT04842123",
    "Polar Grit X": "https://www.techradar.com/reviews/polar-grit-x",
    "Polar Grit X Pro": "https://www.techradar.com/reviews/polar-grit-x-pro"
  }
}