{
  "source": "https://www.techradar.com/news/is-apple-backing-down-on-safaris-tab-redesign-in-macos-12",
  "title": "Is Apple backing down on Safari’s tab redesign in macOS 12?",
  "category": "computing",
  "updated": "2021-10-19T13:18:28Z",
  "author": "daryl-baxter",
  "summary": "Tabs are now tabs again",
  "article": [
    "In the run up to the launches of macOS 12 Monterey and iOS 15.1, a blogger has spotted another update in the design of Safari 15, where tabs are now reverting back to how they originally looked.",
    "Apple’s web browser has seen some huge changes since a redesign was announced back at WWDC earlier this year, such as adding Tab Groups, an updated look, and support for extensions.",
    "But in the following months, feedback from users has apparently made the company change course on some of the more radical changes Safari 15 was going to introduce.",
    "The new tabs looked more like floating panels below the address bar, which took up more space, while not being clear in which window was active, which confused users.",
    "With tabs now back to how they were, the new update is a mix of old and new, with a compromise that should have been there from the start.",
    "With macOS 12 Monterey launching on October 25, alongside new Macbooks, and iOS 15.1 arriving soon after, Safari and its old tab design will also be arriving alongside those new operating systems.",
    "Safari 15 brings extensions to both macOS and iOS, so you can install features from third-party developers, such as translators, password managers, and more. Alongside this, you can have Tab Groups which lets you organize your tabs across devices.",
    "However, if you don’t like the new-look tabs, you can revert back to how tabs used to look by going to Settings > Safari and selecting ‘Compact Tab Bar’.",
    "Safari 15’s redesign has already been changed a few times due to the negative feedback between WWDC and the upcoming release of macOS 12 Monterey.",
    "The version that first arrived in an early version of iOS 15 in June was confusing and almost unusable for some people, as it was difficult to discover menu options and even select links in a web page, due to the address bar being a floating object.",
    "While the version that shipped with the final release of iOS 15 in September was a massive improvement, some issues still remained on macOS and iPadOS. Thankfully, this upcoming version seems to fix most of these remaining problems, but all of this could have been avoided.",
    "In previous years, Apple has released some features with a beta tag, making users aware that it could change or be removed. Siri had this, Portrait Mode had this, and perhaps Safari 15 should have had this. It may also be better for Safari to be made available as a separate download, rather than being bundled with the macOS or iOS updates.",
    "However, we’re at a point where Safari 15 is still being refined while the major software updates and hardware are being released. The next time another major app from Apple sees a redesign, perhaps it may be better for it to be labelled as beta, so Apple can gauge user feedback, and not annoy anyone, first.",
    "Via Daring Fireball"
  ],
  "headers": {
    "5": "When will the new update arrive?",
    "8": "Analysis: Safari 15 should have been a separate release"
  },
  "links": {
    "macOS 12 Monterey": "https://www.techradar.com/news/macos-12",
    "iOS 15.1": "https://www.techradar.com/news/ios-151-news",
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "tabs now back to how they were": "https://daringfireball.net/linked/2021/10/18/safari-15-tabs",
    "Macbooks": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "Daring Fireball": "https://daringfireball.net/linked/2021/10/18/safari-15-tabs"
  }
}