{
  "source": "https://www.techradar.com/news/this-rtx-3070-truly-is-a-monster-gpu-but-you-may-never-be-able-to-buy-it",
  "title": "This RTX 3070 truly is a monster GPU – but you may never be able to buy it",
  "category": "computing",
  "updated": "2021-07-05T13:13:28Z",
  "author": "darren-allan",
  "summary": "MSI’s Godzilla-themed graphics card might only go on sale over in Asia",
  "article": [
    "MSI is preparing to unleash a smart-looking new graphics card which will go down a storm with Godzilla fans, seeing as this Nvidia RTX 3070 is themed around the iconic monster.",
    "MSI’s GeForce RTX 3070 Suprim SE x Godzilla is, unsurprisingly, a special edition of the 3070 Suprim, but the only differences are in the appearance. This card bears a bold red paint job, complete with some leaping flames, and Godzilla itself pictured on the backplate.",
    "Otherwise, the spec is based on the existing MSI RTX 3070 Suprim SE GPU with LHR (Lite Hash Rate – in other words, artificially limited mining performance). You get a base clock of 1770MHz, boost to 1785MHz, with the card having a TDP of 240W.",
    "Note that the graphics card hasn’t officially been announced yet, but the refreshed model was spotted by VideoCardz. According to the tech site, the likelihood is that the RTX 3070 Suprim SE x Godzilla will be pitched directly at the Japanese market, and may not be available in other regions.",
    "That said, you never know, MSI might see fit to release this model elsewhere, and at any rate, really keen Godzilla fans who want to build a PC around this RTX 3070 may be able to snap one up via importing.",
    "Of course, getting hold of any graphics card full-stop remains seriously challenging in the current climate, sadly, even though there’s now a fresh Nvidia option on the table in terms of the RTX 3070 Ti which recently went on sale. That’s proved something of a divisive GPU, as it came in for some serious criticism in our review, but on the other hand, there are reasons why you perhaps shouldn’t fixate on what the reviews say and the hard numbers."
  ],
  "headers": {
    "4": "Time will tell"
  },
  "links": {
    "Nvidia RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "artificially limited mining performance": "https://www.techradar.com/news/the-light-hash-rate-nvidia-rtx-3080-is-real-heres-what-you-need-to-know",
    "VideoCardz": "https://videocardz.com/newz/msi-geforce-rtx-3070-suprim-se-x-godzilla-pictured",
    "for some serious criticism in our review": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "you perhaps shouldn’t fixate on what the reviews say and the hard numbers": "https://www.techradar.com/news/i-dont-care-what-the-reviews-say-my-rtx-3070-ti-has-changed-my-life"
  }
}