{
  "source": "https://www.techradar.com/news/ubuntu-pro-goes-live-on-google-cloud",
  "title": "Ubuntu Pro goes live on Google Cloud",
  "category": "computing",
  "updated": "2021-06-15T09:08:11Z",
  "author": "mayank-sharma",
  "summary": "Offers ten years of support and other enterprise-specific features",
  "article": [
    "Canonical, the company behind the popular Ubuntu distro, has launched its Ubuntu Pro platform on Google Cloud.",
    "Ubuntu is no stranger to Google’s cloud computing platform, having been available to users since 2014. However Ubuntu Pro is the self-styled premium version of the environment that comes with a feature set that’ll appeal to developers and administrators at enterprises.",
    "“The availability of Ubuntu Pro on Google Cloud will offer our enterprise customers the additional security and compliance services needed for their mission-critical workloads,” said June Yang, VP and GM, Compute, Google Cloud.",
    "Canonical claims that using Ubuntu Pro, cloud users get a security-hardened and cost-effective environment to power their business-critical and customer-facing applications.",
    "Beyond providing the standard Ubuntu features, Ubuntu Pro on Google Cloud offers several additional services that’ll appeal to enterprise customers. These include a ten-year commitment with long-term support for maintenance and security patches.",
    "During this time, customers will be able to live patch their Linux kernels to enhance security without any downtime.",
    "The platform is also certified to support operating environments under compliance regulations such as FedRAMP, HIPAA, PCI, GDPR and ISO.",
    "With the release, Ubuntu Pro now supports all three major cloud platforms. The environment has been available on Amazon’s AWS and Microsoft’s Azure for some time now."
  ],
  "headers": {
    "3": "Security and compliance"
  },
  "links": {
    "Ubuntu": "https://www.techradar.com/reviews/ubuntu",
    "Ubuntu Pro platform": "https://ubuntu.com/blog/introducing-ubuntu-pro-for-google-cloud",
    "Google Cloud": "https://www.techradar.com/news/google-cloud-and-spacex-sign-major-computing-deal",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Ubuntu Pro on Google Cloud": "https://cloud.google.com/blog/products/compute/ubuntu-pro-available-on-google-cloud",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "supports all three": "https://www.techradar.com/news/ubuntu-pro-arrives-on-aws-marketplace-with-added-security-benefits",
    "AWS": "https://www.techradar.com/news/aws",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure"
  }
}