{
  "source": "https://www.techradar.com/news/ios-1502-just-landed-on-your-iphone-heres-what-the-upgrade-brings",
  "title": "iOS 15.0.2 just landed on your iPhone - here's what the upgrade brings",
  "category": "phones",
  "updated": "2021-10-12T08:55:24Z",
  "author": "james-peckham",
  "summary": "This software is full of bug fixes",
  "article": [
    "iOS 15 is only a few weeks old, but the new upgrade has already been tweaked for a second time with a new update rolling out to iPhones around the world from today.",
    "It's called iOS 15.0.2, and as the update's name suggests you shouldn't expect it to bring any big changes for your iPhone.",
    "That said, it may fix some annoyances you've had since you installed iOS 15, with this update designed to bring a variety of bug fixes to the software. Your Apple Watch may also receive similar, with watchOS 8.0.1 landing on your smartwatch.",
    "For iPhone, you'll find the below issues are being fixed in the software for iOS 15.0.2.",
    "There's also an important security patch within iOS 15.0.2, and while Apple has yet to share any details around the issues it patches, the company recommends upgrading to it as soon as possible.",
    "If you own an Apple Watch 3, you'll find watchOS 8.0.1 brings in the below bug fixes for your device, but there aren't any specific upgrades for those with newer watches than that.",
    "It's the same old story with iOS vs Android in 2021. Every iPhone since the iPhone 6S is able to upgrade to the latest software, while Android phones aren't able to currently upgrade to Android 12 even though it is officially out.",
    "This new bug fix is helpful for those who own an iPhone, and it further embarrasses Google's rollout of its latest software. Often the new Android software immediately lands on its Pixel devices, but that's not the case with Android 12.",
    "We'll likely be near to iOS 15.1 before we start to see Android phones receive the new upgrade. Hopefully we can see Google make up some ground, especially when Apple is fixing the issues with its software so swiftly and simply showing up the Android 12 rollout.",
    "Via GSMArena"
  ],
  "headers": {
    "3": "What the update brings",
    "6": "Analysis: an update that embarrasses Android 12"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "GSMArena": "https://www.gsmarena.com/apple_releases_ios_1502_and_watchos_801-news-51371.php"
  }
}