{
  "source": "https://www.techradar.com/news/i-spent-a-day-with-the-dji-ronin-4d-and-it-took-my-filmmaking-to-the-next-level",
  "title": "I spent a day with the DJI Ronin 4D – and it took my filmmaking to the next level",
  "category": "cameras",
  "updated": "2021-10-24T12:00:00Z",
  "author": "tim-bunn",
  "summary": "Meet the Hollywood Steadicam for (nearly) everyone",
  "article": [
    "Over the past 15 years, DJI has become rather good at helping filmmakers shoot beautifully steady video. It's the world's biggest drone brand, and also makes useful little cameras like the DJI Pocket 2. But what it hasn't yet done is take on the likes of Canon or Sony in ground-based professional cameras. You saw it coming though, didn’t you? The Ronin 4D is where this changes.",
    "The Ronin 4D is mid-range professional cinema camera, with an interchangeable lens system and 4-axis stabilization, that has the oft-used 'game-changer' label written all over it. Given that it’s been co-developed with some of the world’s leading cinematographers, it looks and sounds like something that filmmakers should be excited about. As a writer and director, that includes me.",
    "Luckily, I was recently given the chance to take the 6K version of DJI's new full-frame toy for a spin. And after a day's filming, I'm convinced it's going to be big deal for filmmakers and low-budget productions. Here's why it's the Hollywood Steadicam for (nearly) everyone.",
    "It’s important to say this upfront; out of the box, there is nothing like the DJI Ronin 4D. Nothing. It’s squarish body is somewhat comparable to cameras like a RED or an Arri Alexa, but it’s the floating arm that holds the sensor and bounces up and down in front that gives it a unique, black swan-like appearance. It really is something to behold.",
    "As a writer, director and only part-time camera-op, I instantly knew that to get the most out of this thing, I was going to have to enlist the help of DOP (Director of Photography) extraordinaire, Ciaran O’Brien (look him up, he’s a genius). Like any cinematographer, Ciaran is always keen to get his hands on new tech and jumped at the chance. A man of few (but very considered words), he “ooh-ed” and “ahh-ed” the first time he saw the Ronin 4D, which goes some way to tell you just how different this thing is.",
    "Now, don’t get me wrong, part of me thinks the design of the 4D is going to split opinion. Some are going to love its new take on camera design and the implementation of the stabilization tech. Others are simply not going to entertain it. They’ll see it as a gimmick and will be happy to stick with their Canons, REDs and Arris.",
    "The ergonomics are initially unusual, but once you use the thing for more than five minutes, they make total sense. This is a camera that’s primarily designed to be held. You can bolt two multi-functional 'grips' onto either side of the body and position it in front of you. You operate it at chest or midriff height, as opposed to on the shoulder, like almost every other camera in this category. For operators that spend their days using heavy, cumbersome stabilizing equipment, this seems like a total no-brainer; it could potentially save a lot of back pain in the film industry.",
    "The grips that attach to the body are well designed and feel good in the hand. There are various buttons and controls that allow you to operate the key settings at your fingertips. One grip comes with a wheel that you operate with your thumb. It’s beautifully designed and weighted and is great for manually controlling focus, but can also be customized.",
    "The headline feature of the Ronin 4D is exactly what the '4D' refers to, and that's the stabilization of the Z-axis. Or more specifically, what DJI refers to as “the industry’s first active-vertical 4-axis stabilization system”.",
    "What does that mean? On a typical handheld DJI stabilizer (other brands are available), the system counter-balances the camera's pan, tilt and roll movements with electronically-controlled motors. But something that isn’t properly accounted for in this set-up is the up-and-down motion that’s created by the operator when they walk, jog or run.",
    "While three-axis stabilizers give you footage that is far smoother than simply holding a camera in your hands, the up-down motion of the operator still has an effect. By stabilizing this motion with some downward-facing sensors that modulate the floating arm holding the camera, the DJI Ronin 4D gives you an extra level of stabilization that is somewhat incredible. You end up with something that is on a par with a fully-fledged Steadicam system – the Hollywood professional’s go-to choice of camera stabilizing equipment.",
    "When I watched Ciaran O’Brien use it for the first time, I was astounded at the footage that we watched back. But he’s being doing stuff like this for a long time and knows how to move with a stabilized camera; and this is an important point.",
    "The Ronin 4D isn’t something that anyone can pick up and use to create a Michael Bay-esque action sequence (you should always focus on story and character in the first place, anyway). There’s still an element of know-how and skill to get the most out of it. Take focusing, for example; focusing with a camera that’s moving at pace is an art form in itself, and it’s something that, on any professional shoot, would be taken to a dedicated person in the camera department.",
    "In my hands, the footage wasn’t nearly as good – and I’ve been using cameras for nearly 15 years now. Ciaran was very polite, but I knew that inside, he’s never going to ask me to film anything for him. What I will say, though, is that the 4D still upped my game in terms of the footage I was able to get, and I throughly enjoyed the operating experience.",
    "Another big Ronin 4D feature is the LiDAR autofocus, which is essentially a laser-guided focus tracking system. Our tests found it to be good, but not perfect.",
    "It did seem like a step forward in terms of the various autofocusing systems that are out there, and it’s almost certainly something that you’re going to rely on if you’re operating without a dedicated focus-puller. Especially if your manual focusing skills are as average as mine. But we’re still not in a world where professional DOP’s are going to trust an electronic system for focus. The reason being, any drop in focus on a big production could cost you a lot of money and annoy a lot of the cast and crew.",
    "The final thing worth mentioning is the Ronin 4D's wireless monitoring system, which will come at an additional cost. It’s brilliant. It’s simple to set up and it just works. A similar wireless setup on a camera system like this usually requires third-party accessories and they can be a little temperamental and stubborn at times. The DJI system was flawless – and brilliantly, you can control the camera remotely with the monitor.",
    "The aforementioned grips can be attached to the side of the monitor, giving another member of the camera team control over basically all of the major camera settings. This is where your focus puller will thank you, as they sit down (up to 20,000 feet away, if needed) and effortlessly pull focus without having to run around next to you.",
    "Other points to highlight are all to be expected at this level. The Dual ISO, 14 stops of dynamic range, and built-in ND filters are always welcome – some comparable systems have this, some don’t. There’s no meaningful sound inputs on the camera body itself (it has a built-in mic, but this will only ever be useful for reference audio). However, you can add XLR connections with an expansion plate. Something that self-shooters will have to do.",
    "So the DJI Ronin 4D is a unique camera, but how good is its image quality? This is where DJI has taken another big leap forward.",
    "Over the years I’ve owned a few bits of DJI kit that I’ve always enjoyed using, but have always questioned the image quality of the ones with a built-in camera or lens. You’ve typically been hamstrung by small sensors and video codecs that leave you with footage that is found wanting.",
    "Here, things are different. There’s the option of a 6K or 8K full-frame sensor. My preference is the 6K one for a few reasons; better low light performance, smaller, more manageable file sizes, and cost.",
    "The mount lets you attach some of your preferred lenses of choice (it's compatible with ones for DJI's DL Mount, Leica's M Mount and Sony's E-Mount), and there's the ability to record in Apple’s ProRes codec internally, including ProRes RAW. This gives filmmakers far more scope for image manipulation in post-production than other DJI cameras.",
    "Combine all of these elements and you’ve got a recipe for some potentially exceptional video quality, albeit at the cost of massive amounts of disk space and the need for a fair amount of processing power. There aren’t many editing machines out there that can handle multiple streams of 8K ProRes. On the storage front, to give you an idea, a minute of ProRes HQ video in 8K is going to require about 25GB-30GB of disk space.",
    "There's no doubt about it – the DJI Ronin 4D is an exciting entry into the world of cinema cameras. It’s bold, different and produces imagery that no other camera in this category can, or certainly not without additional third-party equipment.",
    "Like the camera, the cost is also a welcome surprise. The 6K version is very aggressively priced at $7,199 / £5,999 / AU$10,699. When we first got our hands on the Ronin 4D, I mentioned that I'd be surprised if it was much under £10k – so the idea of paying nearly half that makes it a very, very tempting proposition.",
    "The 8K version is naturally a bit pricier at $11,499 / £9,499 / AU$16,399 – it might not sound like a bargain, but this still represents good value for money in my eyes. Though I’d be happy to bin the extra resolution and use the money saved to buy some add-ons like the XLR expansion plate, a few more batteries and some memory cards.",
    "DJI has produced something that will make grab attention and challenge the likes of Sony and Canon, who currently own the entry-level cinema camera marketplace. What was once only available to productions with five, six or seven-figure budgets, is now accessible to budding filmmakers and low-budget productions.",
    "The 4D’s implementation of Z-axis stabilization technology, as well as the imagery, ergonomics and user experience is genuinely brilliant. It makes you rethink what’s possible in terms of the shots that you can achieve, and I can’t wait to see what young, hungry and more creative people than me do with it."
  ],
  "headers": {
    "3": "Swanning around",
    "8": "Four-dimensional fun",
    "19": "A leap forward",
    "24": "Expensive bargain"
  },
  "links": {
    "DJI Pocket 2": "https://www.techradar.com/reviews/dji-pocket-2",
    "compatible with": "https://terra-1-g.djicdn.com/851d20f7b9f64838a34cd02351370894/330-%20new/DJI%20Ronin%204D%20Lens%20Compatibility%20List%20211020.pdf"
  }
}