{
  "source": "https://www.techradar.com/news/tamrons-debut-x-series-lens-is-a-big-deal-for-fujifilm-camera-fans",
  "title": "Tamron's debut X-series lens is a big deal for Fujifilm camera fans",
  "category": "cameras",
  "updated": "2021-07-21T13:22:32Z",
  "author": "mark-wilson",
  "summary": "Superzoom lens could be just the start",
  "article": [
    "The Japanese lens maker Tamron has revealed its first lens for Fujifilm X-series cameras, a superzoom that'll be ideal for photographers who want an all-rounder that covers virtually any shooting situation.",
    "The Tamron 18-300mm F/3.5-6.3 Di III-A VC VXD, which will also be available for Sony E-mount cameras with APS-C sensors, has a huge equivalent zoom range of 37-450mm in full-frame terms. For photographers, that means it can cover pretty much any angle without the need to change lenses, and makes it ideal for everything from wildlife and sports snapping to holiday snaps.",
    "The bigger deal, though, is that it's Tamron's first lens for Fujifilm X-series cameras like the Fujifilm X-T4. And that means we could potentially see more third-party lenses from Tamron, and other manufacturers, for X-series cameras in the near future.",
    "While the Tamron 18-300mm F/3.5-6.3 Di III-A VC VXD isn't the first third-party lens for Fujifilm cameras – we've also recently seen autofocus-equipped ones from the likes of Viltrox and Tokina – it does fill a gap in Fujifilm's lineup. It could also mean we see Fujifilm's lens collection bolstered by even more third-party options.",
    "The new lens is the first all-in-one zoom for APS-C mirrorless cameras to have 16.6x zoom range and uses an linear motor autofocus system, which means it should be relatively fast and quiet. It also has weather-sealing and built-in Vibration Compensation stabilization, which should help keep it a little steadier at the longer end of the focal range.",
    "Further boosting the lens' versatility is the fact that its minimum focus distance is 15cm, which means it should be able to handle close-up shooting pretty well. Most superzooms have some trade-off in terms of image quality, but Tamron naturally claims that the 18-300mm F/3.5-6.3 Di III-A VC VXD will offer image quality that is \"among the best of all all-in-one zoom lenses\".",
    "We're looking forward to seeing whether or not it'll be able to live up to that claim, but there's unfortunately going to be a slight wait for that. So far, the lens is only a 'development announcement', but Tamron says that it'll be available \"sometime at the end of 2021\", with pricing to follow then.",
    "Tamron has a long history of producing compelling third-party lenses for Canon and Nikon DSLRs, particularly at in the superzoom space. We've often found that its lenses give similar, or occasionally better, performance than those two manufacturers' own-brand lenses, at lower prices.",
    "A superzoom like Tamron's 18-300mm F/3.5-6.3 Di III-A VC VXD might not seem like the perfect fit for Fujifilm X-series cameras, given they tend to be smaller bodies that are more at home shooting the likes of street photography. But like Fujifilm's new XF70-300 f/4-5.6 R LM OIS WR lens, Tamron's new alternative looks pretty compact and will hopefully come in at an even lower price.",
    "Perhaps more exciting for Fujifilm fans is the precedent it sets for future lenses. Fujifilm X-Series cameras aren't exactly short of lens options, but they do lack affordable options in some areas. If Tamron starts porting some of its other popular lenses that it's made for the Sony E-mount – for example, the recent Tamron 17-70mm f/2.8 Di III-A VC RXD – that could considerably boost the amount of choice on offer.",
    "Of course, Tamron may just be testing X-series waters with this lens and there's no guarantee the floodgates will now open for others. But earlier this year, another big lens manufacturer – Sigma – also hinted that it was planning to release some X-series lenses in 2021.",
    "This kind of lens news is also good for APS-C cameras in general. The recent focus of the camera industry has been heavily weighted towards pricier full-frame mirrorless cameras, but APS-C cameras like the Sony A6600, Fujifilm X-S10 and incoming Nikon Zfc are great options for hobbyist shooters, so it's great to see those cameras supported with a healthy smattering of new lenses."
  ],
  "headers": {
    "7": "Analysis: Good news for Fuji fans (and APS-C cameras)"
  },
  "links": {
    "Fujifilm X-T4": "https://www.techradar.com/reviews/fujifilm-x-t4",
    "release some X-series lenses in 2021": "https://www.fujirumors.com/sigma-we-may-see-some-sigma-lenses-for-fujifilm-x-mount-in-2021/",
    "Sony A6600": "https://www.techradar.com/reviews/sony-a6600",
    "Fujifilm X-S10": "https://www.techradar.com/reviews/fujifilm-x-s10",
    "Nikon Zfc": "https://www.techradar.com/news/nikon-zfc-release-date-price-specs-and-features"
  }
}