{
  "source": "https://www.techradar.com/news/get-up-to-dollar1500-off-a-galaxy-z-flip-3-with-walmarts-black-friday-deals-today",
  "title": "Get up to $1,500 off a Galaxy Z Flip 3 with Walmart's Black Friday deals today",
  "category": "phones",
  "updated": "2021-11-23T14:08:33Z",
  "author": "alex-whitelock",
  "summary": "That's for both AT&T and Verizon devices too",
  "article": [
    "Walmart's Black Friday Samsung Galaxy Z Flip 3 deals have landed today with a whopping $500 gift card up for grabs to those who pick up either a device on the AT&T or Verizon network.",
    "And yes, before you ask - you can indeed stack this on top of a trade-in rebate, which currently stands at a maximum saving of up to $1,000. That means, potentially, you're looking at a free device here plus plenty of pocket money on the side to spend Walmart this holiday season.",
    "In terms of sheer savings, this is easily one of the best Black Friday Samsung Galaxy Z Flip 3 deals we've seen so far, alongside Samsung's $100 discount and free pair of Galaxy Buds 2. For carrier value, the Walmart deal is definitely better, but Samsung's offer is also a good choice if you're looking for an unlocked device especially. Walmart will of course unlock your device eventually but you'll have to sign up to a pricey unlimited data plan at either Verizon or AT&T first to be eligible for the above gift card promotion.",
    "Either way, you'll have a fantastic device being delivered to your door with either of these deals. The Galaxy Z Flip 3 is definitely a great choice if you're looking for something compact and powerful, but also fairly reasonably priced. It's much cheaper than the bigger Fold 3 but still rocking that Snapdragon 888 chip inside as well as a very refined design for a foldable. It's not for everyone, but it's definitely worth considering if you like the idea of a clamshell form factor.",
    "Outside the US? See more of today's best Samsung Galaxy deals in your region below.",
    "And, if you're looking for the latest early-bird promotions on other devices, we've got plenty more to check out on our main Black Friday phone deals page. Over there you'll find great prices on Google Pixels, iPhones, and even Galaxy Z foldable."
  ],
  "headers": {
    "5": "More great Galaxy Z Flip 3 deals today"
  },
  "links": {
    "whopping $500 gift card": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-8358846294066472000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FAT-T-Samsung-Galaxy-Z-Flip-3-5G-Black-128-GB%2F208015415",
    "$100 discount and free pair of Galaxy Buds 2": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1380392851847047400&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fsmartphones%2Fgalaxy-z-flip3-5g%2Fbuy%2Fgalaxy-z-flip3-5g-128gb-unlocked-sm-f711uzkbxaa%2F%3FofferCID%3DearlyAccess&article_name=Get%20up%20to%20%241%2C500%20off%20a%20Galaxy%20Z%20Flip%203%20with%20Walmart's%20Black%20Friday%20deals%20today&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fget-up-to-dollar1500-off-a-galaxy-z-flip-3-with-walmarts-black-friday-deals-today",
    "Black Friday phone deals": "https://www.techradar.com/black-friday/black-friday-iphone-deals-2021"
  }
}