{
  "source": "https://www.techradar.com/news/ios-145-emoji",
  "title": "iOS 14.5 adds 200 new emoji to iPhone, including vaccine and AirPods Pro Max",
  "category": "phones",
  "updated": "2021-02-17T08:18:24Z",
  "author": "matt-swider",
  "summary": "You can't get it yet, but Apple's iOS 14.5 is coming soon",
  "article": [
    "Apple's latest iOS 14.5 beta update is now available for developers, and while the big time-saving feature allows an Apple Watch to unlock your iPhone, there are over 200 more colorful additions you may be interested in: lots of new emoji.",
    "Among the 217 new and changed emoji are heart on fire, exhaling face and a fresh syringe, details Emojipedia. Now bloodless in design, the iOS 14.5 syringe could easily pass as a vaccine, which makes it very timely for conversations in 2021.",
    "Not all emoji are brand new. Apple's forthcoming update is making emoji even more inclusive with gender and couple consistency.",
    "Emojipedia notes this update finally adds couples with a mix of skin tones and now has woman with a beard, joining the man with a beard, which was added in 2020. Before that we only had access man with a mustache for expressing facial hair.",
    "Buried among other new emoji – spiral eyes, face in clouds or mending heart – is a new Apple-made product that should be familiar: AirPods Pro Max. Those traditional headphones in black have been tweaked to resemble Apple's on-the-ear in white.",
    "Now, the burning heart emoji question: when will a consumer-facing iOS 14.5 update launch to everyone? Well, developers only got access to to these new emoji in iOS 14.5 beta 2 on Tuesday.",
    "There's no telling when a final iOS 14.5 version will launch, but a public beta usually trails the developer beta by a few days. So you may be able to get access to it this week. Fingers crossed emoji."
  ],
  "headers": {
    "4": "iOS 14.5 adds AirPods Pro Max, but when does it launch?"
  },
  "links": {
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "Emojipedia": "https://blog.emojipedia.org/first-look-217-new-emojis-in-ios-14-5/"
  }
}