{
  "source": "https://www.techradar.com/news/the-suicide-squad-first-reactions-heres-what-the-critics-thought",
  "title": "The Suicide Squad first reactions: here's what the critics thought",
  "category": "entertainment",
  "updated": "2021-07-15T08:43:08Z",
  "author": "tom-power",
  "summary": "Critics are raving about The Suicide Squad",
  "article": [
    "The Suicide Squad's release date is fast approaching, and fans are eager to find out if James Gunn's R-rated superhero (or should that be supervillain?) movie has been worth the wait.",
    "Warner Bros' latest DCEU film lands in theaters and HBO Max on August 5 (July 30 for UK audiences) so there isn't much time left for film aficionados to view the flick themselves.",
    "While we wait for The Suicide Squad to finally arrive, some lucky journalists and influencers were invited to watch the movie ahead of its official launch.",
    "With the social media embargo now lifting, those individuals have been giving their first impression of Gunn's latest film – and it seems that the Guardians of the Galaxy and Slither director has hit another home run.",
    "We've rounded up the best initial reactions to The Suicide Squad below, so take a look at what critics thought before the film arrives in the next few weeks.",
    "First up, Rotten Tomatoes' Brandon Davis hailed The Suicide Squad's \"relentless\" plot, and said it was delightful to see James Gunn \"fully unleashed\" in this R-rated film:",
    "Fandango's Erik Davis called it \"big, bold and visually stunning\" before going on to laud how Gunn made a movie with contrasting elements through its humor, heart, action and emotional moments:",
    "Digital Spy's Ian Sandwell reserved special praise for the movie's cast, saying that individual viewers \"will have their own favourite from a terrific cast\":",
    "People Magazine's Kara Warner admitted she was sceptical about how good The Suicide Squad would be, but revealed that she \"loved\" how \"balls to the wall bonkers\" it ended up being:",
    "The Wrap's Umberto Gonzalez claimed that \"James Gunn has easily made DC's most enjoyable movie to date\", which is high praise indeed for the director and the studio:",
    "Finally, Insider's Kristen Acuna stated that The Suicide Squad is the \"wildest, wackiest, bloodiest comic book movie I've ever seen\", though we suspect Deadpool won't be too happy about that claim:",
    "We'll have our own review of The Suicide Squad ahead of its UK release, too, so make sure you check back with TechRadar to find out whether we agree with the above sentiments.",
    "The Suicide Squad will simultaneously release in theaters and on HBO Max in the US on August 5, while UK audiences can check it out on July 30."
  ],
  "headers": {},
  "links": {
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-release-date-plot-cast-trailer-and-more"
  }
}