{
  "source": "https://www.techradar.com/news/namecheap-launches-new-website-builder",
  "title": "Namecheap launches new website builder",
  "category": "computing",
  "updated": "2021-02-03T15:17:33Z",
  "author": "anthony-spadafora",
  "summary": "Visual also comes with a free logo maker available",
  "article": [
    "Web hosting firm Namecheap has launched its own website builder, offering a suite of easy-to-use creative design tools. The new solution will be known by the name, Visual, although the branding, “powered by Namecheap,” does appear frequently across the new platform.",
    "“Today [at] Namecheap, we launched Visual.com,” Namecheap’s head of product, Teddy Worcester, tweeted. “It's not only our first real stab at an easy-to-use website builder but the beginning of an entire suite of products to help individuals and SMBs establish their online presence.”",
    "At the moment, the tools packaged with Visual include a free logo builder, a business card maker, and, of course, a website builder. The Site Maker has been designed to be as intuitive as possible and should be easy to use even if individuals have no experience building a website before or no coding skills. Easy-to-use blocks should make the site-building process as straightforward as possible.",
    "With so many website builders to choose from, pricing can be a huge competitive differentiator. Visual has a range of different options available, with its Site Maker available from $38.88 a year. Its logo maker, meanwhile is free of charge, while business cards cost $19.99 for 100 cards. As a nice touch, every Site Maker signup is accompanied by a free .contact or .design domain.",
    "Given the competitive nature of the website builder space, Namecheap has certainly managed to get a good name for their new brand. However, it looks as though they may have had to pay a six-figure sum to acquire the “Visual” name.",
    "Given that Visual has only just launched it is likely that additional features will be added in the coming months. In the meantime, the Site Maker service comes with a free trial, so website builders can explore what Visual has to offer before committing any of their hard-earned cash."
  ],
  "headers": {
    "3": "Free trial available"
  },
  "links": {
    "Namecheap": "https://www.techradar.com/reviews/namecheap",
    "Visual.com": "https://visual.com/",
    "tweeted": "https://twitter.com/teddy/status/1354812916579463169",
    "six-figure sum": "https://domaininvesting.com/namecheap-launches-visual-com-website-builder/"
  }
}