{
  "source": "https://www.techradar.com/news/iphone-13-could-feature-next-gen-vapor-chamber-cooling-technology",
  "title": "iPhone 13 could feature next-gen vapor chamber cooling technology",
  "category": "phones",
  "updated": "2021-01-17T12:00:59Z",
  "author": "david-nield",
  "summary": "Running faster for longer",
  "article": [
    "We've already heard a few rumors about what could be in store for the iPhone 13 later this year, and there's now a new piece of next-gen tech that we can add to the list of potential upgrades: vapor chamber cooling.",
    "As per well-known Apple analyst Ming-Chi Kuo, via AppleInsider, Apple is \"aggressively testing\" the technology to include it in future iPhones – though as yet it's not clear whether or not it'll be ready in time for the 2021 handsets.",
    "The cooling system is essentially a miniaturized version of those seen on high-end gaming rigs. Water or another kind of liquid is evaporated by the heat coming from key internal components, with the thermal energy then spread out through the whole of the casing.",
    "The improved cooling means less risk of overheating, and potentially faster speeds for driving apps and graphics on screen. According to Kuo, Apple has been working on the tech for some time, though it hasn't yet been deemed to be of a high enough standard to include in the company's smartphones.",
    "Vapor chambers on smartphones aren't actually new – Huawei included one in the Mate 20 X, for example, and we know that Microsoft has been exploring the concept as a potential option for keeping its mobile devices running cooler.",
    "Especially under extended periods of high stress – so in games and other demanding apps – CPUs and GPUs will sometimes have to throttle themselves in order to keep the components from overheating and causing a system crash.",
    "More advanced cooling would help solve that problem, keeping the iPhone cool to the touch no matter how it was being used. With no official word from Apple though, we may have to wait until September to see if it gets included in the iPhone 13.",
    "Other changes being tipped to arrive with the iPhone 13 include the introduction of an in-screen fingerprint sensor, which would presumably mean Touch ID is coming back too. The same source suggests the Lightning port could be ditched as well."
  ],
  "headers": {
    "4": "Keeping cool"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "AppleInsider": "https://appleinsider.com/articles/21/01/15/apple-testing-vapor-chamber-thermal-tech-for-next-gen-iphone-kuo-says",
    "in the Mate 20 X": "https://www.techradar.com/news/extend-your-gaming-sessions-to-record-levels-with-the-mate-20-xs-revolutionary-cooling-system",
    "exploring the concept": "https://www.techradar.com/news/microsoft-may-have-a-clever-way-to-keep-surface-neo-and-other-laptops-from-overheating",
    "wait until September": "https://www.techradar.com/news/iphone-13-tipped-to-be-launching-in-september-2021-as-normal",
    "an in-screen fingerprint sensor": "https://www.techradar.com/news/apple-reportedly-developing-a-foldable-iphone-flip-though-it-could-be-years-away"
  }
}