{
  "source": "https://www.techradar.com/news/verizon-says-its-version-of-apples-spatial-audio-doesnt-require-fancy-headphones",
  "title": "Verizon says its version of Apple's Spatial Audio doesn't require fancy headphones",
  "category": "audio-visual",
  "updated": "2021-07-09T10:49:00Z",
  "author": "olivia-tambini",
  "summary": "It will apparently work with any content, too",
  "article": [
    "Verizon has created its own version of Apple's Spatial Audio technology – and according to the company, it will work with any content, and you won't need to buy a pair of fancy headphones to use it.",
    "In a press release, the company revealed that the first device to come with Verizon Adaptive Sound is the Motorola One 5G UW Ace. This is a slightly different model to the Motorola One 5G Ace (which we gave four out of five stars in our review), as it's exclusive to US carrier Verizon.",
    "Verizon says that the new mobile audio technology allows you to hear \"brilliant spatial surround experience regardless of what headphone, soundbar or earbud brand you use or what application you're watching or listening to, including Dolby Atmos-enabled content\".",
    "All you have to do is play your music, watch a video, or play a game, and the technology will automatically optimize the content for the device you're listening on. You also be able to adjust different audio settings, including treble, bass, spatial, and voice.",
    "Apple's Spatial Audio is a type of immersive sound format – like Dolby Atmos – which allows you to experience sound in three dimensions. In other words, it makes you feel as though the sound of your music, movies, or games, is coming at you from every angle.",
    "While surround sound gives our music a sense of horizontal direction, these formats takes this one step further by adding height cues to film soundtracks and music. Imagine the difference between hearing a helicopter flying a few hundred yards away versus directly over your head, and you’re nearly there.",
    "Spatial Audio is Apple's version of this technology, and it's optimized for the AirPods Pro and AirPods Max, using the built-in accelerometers and gyroscopes inside Apple’s earbuds and over-ear headphones to track the position of your head, as well as the position of your iPhone or iPad.",
    "As you may have guessed, you’ll need an Apple device with iOS 14 or iPadOS 14 or later, as well a streaming service that supports 5.1, 7.1, or Atmos. Stereo content can also be converted to Spatial Audio as long as the streaming service has enabled a special plugin for stereo spatialization.",
    "By contrast, Verizon claims that its own immersive sound technology doesn't require any specific headphones or content – so presumably, you could watch any regular stereo content using a pair of budget earbuds and still experience it for yourself.",
    "How successfully this will replicate a true 3D sound system isn't clear. While virtual versions of technologies like Dolby Atmos are pretty convincing, they aren't a patch on the real thing, which uses overhead speakers to create that sense of sonic height.",
    "It's also worth noting that, for now, Verizon Adaptive Sound will only be available in the US on the Motorola One 5G UW Ace. However, Verizon says that Adaptive Sound will be made available on \"a broader portfolio of new devices in the future, as well as some existing devices via an over-the-air software update\", so it may come to more regions in the future."
  ],
  "headers": {
    "4": "What is spatial audio?"
  },
  "links": {
    "Apple's Spatial Audio": "https://www.techradar.com/how-to/apple-music-spatial-audio-and-lossless-guide-heres-how-to-turn-them-on",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "press release": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1452179524372563500/https://www.verizon.com/about/news/motorola-one-5g-uw-verizon-adaptive-sound",
    "Motorola One 5G Ace": "https://www.techradar.com/reviews/motorola-one-5g-ace-review",
    "our review": "https://www.techradar.com/reviews/motorola-one-5g-ace-review",
    "immersive sound format": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "budget earbuds": "https://www.techradar.com/best/the-best-budget-wireless-earbuds",
    "overhead speakers": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide"
  }
}