{
  "source": "https://www.techradar.com/news/free-epic-games-store-games-this-weeks-giveaways-revealed",
  "title": "Epic Games Store free games: this week's giveaways revealed",
  "category": "gaming",
  "updated": "2021-12-02T16:07:23Z",
  "author": "gerald-lynch",
  "summary": "Free until December 9",
  "article": [
    "Want to know about this week's free Epic Games Store games? You've come to the right place. With many of our daily lives still in a state of flux thanks to the Covid-19 pandemic, a lot of us are still looking for ways to fill out our free time at home. Thankfully, the Epic Games Store offers ways to do just that for free.",
    "Whether you're looking for the next big adventure for your backlog or something to keep you and your friends busy co-operatively, video games are the cure-all we need right now during such uncertain times. We love that Epic Games and participating developers are giving away free games each week, then, and we're rounding up all the freebies below so you don't miss out.",
    "This week, the Epic Games Store is giving away Dead by Daylight and While True: Learn, which you can download for free to keep, so long as you do so by December 9.",
    "To download the latest free titles, simply head to the free games page on the Epic Games Store while signed in to your account. And while you wait for your games to download, why not check out a trailer for Dead by Deadlight and While True: Learn () below?",
    "Epic Games Store is continuing to offer free games every week for the foreseeable future as part of its commitment to winning over gamers. It's aiming to establish itself as a serious game distribution force, duking it out against the long-standing king of PC gaming, Valve's Steam platform.",
    "While Epic has courted some controversy through its aggressive approach to securing PC gaming exclusives for its platform, it's hard to argue against its continued distribution of top-notch free games.",
    "Can't wait to get your hands on some more games without spending anything? Epic's run of free games will continue next week with Godfall Challenger Edition and Prison Architect, which will be free to download from December 9 for a whole week.",
    "Want to see what you've missed so far? Check below for the historic list of freebies that the Epic Games Store has offered up to its customers so far:"
  ],
  "headers": {
    "4": "More free games",
    "6": "Next week's games",
    "7": "Previous free games"
  },
  "links": {
    "free games": "https://www.techradar.com/news/gaming/top-40-best-free-games-you-should-play-today-695473",
    "free games page": "https://www.epicgames.com/store/en-US/free-games"
  }
}