{
  "source": "https://www.techradar.com/news/an-email-migration-mess-up-appears-to-be-wreaking-havoc-at-ibm",
  "title": "An email migration mess-up appears to be wreaking havoc at IBM",
  "category": "computing",
  "updated": "2021-07-02T16:51:50Z",
  "author": "mayank-sharma",
  "summary": "IBMs official statement plays down the issue",
  "article": [
    "A botched and drawn-out email migration at IBM has left many employees without access to their inboxes, according to reports.",
    "IBM has acknowledged the issue in a statement delivered to The Register over the phone, rather than email, noting that some “employees are experiencing email service delays\".",
    "However, The Register has now learnt from new anonymous sources that the problem is a lot more severe, and might have also disrupted the company’s business processes, adversely affecting sales.",
    "Unnamed IBM employees told The Register that the email migration plan, which has been underway on for well over a year, started soon after the company decided to offload various software products to India’s HCL Technologies in 2018.",
    "The botched migration has denied access to email to a section of its employees, who haven’t been able to schedule events and meetings. Reportedly, even IBM’s webmail has been affected, along with other collaborative software such as Notes.",
    "Perhaps more worryingly for the company, however, a couple of insiders have shared an internal note with The Register that lays out instructions for its sales people to complete purchases amidst the ongoing email crisis.",
    "IBM did not respond immediately to our request for clarification about the severity of the issue."
  ],
  "headers": {
    "3": "Botched migration?"
  },
  "links": {
    "email": "https://www.techradar.com/news/best-email-provider",
    "IBM": "https://www.techradar.com/news/ibm-becomes-first-to-demonstrate-advantage-of-quantum-computers-in-real-life-scenario",
    "The Register": "https://www.theregister.com/2021/06/30/ibm_email_outage/",
    "now learnt": "https://www.theregister.com/2021/07/01/ibm_email_disruption_sales/",
    "collaborative software": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}