{
  "source": "https://www.techradar.com/news/the-mazda-mx-30-is-an-electric-car-you-can-afford-but-range-may-be-an-issue",
  "title": "The Mazda MX-30 is an electric car you can afford, but range may be an issue",
  "category": "car-tech",
  "updated": "2021-08-24T14:49:30Z",
  "author": "chris-teague",
  "summary": "Price may be right, but range is more important",
  "article": [
    "Mazda has been slow to make a move to offering electric vehicles, or even a hybrids, for that matter, in North America.",
    "That's all about to change later this year when the all-electric Mazda MX-30 crossover hits the market. The automaker just released pricing details for the new vehicle, but the bigger story for potential buyers is the MX-30's range numbers.",
    "Pricing for the city-running MX-30 will start at $33,470 when it lands this fall, with the car going on sale first in California.",
    "However, given its range numbers, the vehicle might be a tough sell, even in the pro-EV Golden State. According to Mazda, the MX-30's EPA-estimated range of 100 miles on a charge and is designed to \"meet the needs of most urban residents.\"",
    "That range number will likely relegate the MX-30 to urban runabout duty, but that's precisely what Mazda claims it to be. There will be times, however, that people need to travel beyond the vehicle's 100-mile range.",
    "To help ease what will surely be severe range anxiety, Mazda is offering two options for new MX-30 owners. The automaker has partnered with ChargePoint to provide a $500 credit that can be used toward charging at a public station or toward the installation of a home charger.",
    "If owners need a vehicle that can take on longer trips, Mazda offers what it calls the MX-30 Elite Access Loaner Program, which allows owners to \"experience other vehicles in the Mazda Family for up to 10 days per year for the first three years of ownership.\"",
    "The MX-30's price point will likely be attractive to many hopeful EV owners, but its range will severely limit its target audience.",
    "As more automakers make the leap from a mostly fossil fuel-powered lineup to one powered by electricity, other options in the same price range as the MX-30 will offer a better range.",
    "That makes it hard to imagine a scenario where the Mazda is a compelling alternative to another, longer-range EV.",
    "However, if Mazda uses the MX-30 as a platform to launch its more extensive line of EVs as it claims it will, the vehicle could indicate good things to come.",
    "The MX-30 offers an attractive design and plenty of tech, and Mazda's driving dynamics are among the best in the business."
  ],
  "headers": {
    "4": "Analysis: a limited audience, but good things may be coming"
  },
  "links": {}
}