{
  "source": "https://www.techradar.com/news/microsoft-edge-is-starting-to-claw-back-on-firefox",
  "title": "Microsoft Edge is starting to claw back on Firefox",
  "category": "computing",
  "updated": "2021-04-05T12:01:45Z",
  "author": "sead-fadilpasic",
  "summary": "Edge user base is growing, while Firefox appears to be shrinking.",
  "article": [
    "Mozilla’s Firefox internet browser is bleeding users, and it appears many are switching over to Microsoft Edge. According to a report from market analysts StatCounter, Edge has a global market share of just above 8% for the desktop platform, and holds the number three position, behind Google Chrome (67%) and Safari (10%).",
    "While StatCounter’s report doesn’t necessarily show that Edge’s success came at the expense of Firefox, a separate report from Windows Latest suggests just that.",
    "Analyzing the data on browser usage for the past year, the publication said that Edge has been steadily growing in size, while Firefox kept losing users.",
    "If Microsoft Edge continues adding new users at this pace, it could even overtake Safari this year and become the world’s second-biggest browser - albeit only for the desktop platform.",
    "When adding mobile and tablet markets to the mix, Firefox is still doing better than Edge and the rise could take a bit longer. However the report suugests that Firefox has been steadily bleeding users on those platforms as well.",
    "Microsoft Edge, together with the fabled Internet Explorer, have generally been perceived as failures in modern browser wars, with the latter inspiring countless internet memes. As a result, they were never considered strong contesters in the war, until late 2018, when Microsoft announced it would adopt the open-sourced Chromium, to further develop Edge on that platform.",
    "The original goal was, Microsoft explained back then, was “to create better web compatibility for our customers and less fragmentation of the web for all web developers.” It also pledged to become a “major contributor” to the Chromium project so that Microsoft Edge — “but other browsers as well” — perform better on both PCs and other devices.",
    "It is also worth highlighting that legacy Internet Explorer has quite a stubborn userbase, as these 1.7% of users have been switching to Edge “at a slow pace”.",
    "Via: Windows Latest"
  ],
  "headers": {
    "5": "Adopting Chromium"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "StatCounter": "https://gs.statcounter.com/browser-market-share/desktop/worldwide",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "Windows Latest": "https://www.windowslatest.com/2021/04/05/microsoft-edge-reaches-new-heights-as-firefox-numbers-plummet/"
  }
}