{
  "source": "https://www.techradar.com/news/dont-forget-about-mitsubishi-new-outlander-phev-finally-teased",
  "title": "Don't forget about Mitsubishi - new Outlander PHEV finally teased",
  "category": "car-tech",
  "updated": "2021-07-29T15:47:16Z",
  "author": "chris-teague",
  "summary": "Mitsubishi is teasing an upgrade to its aging plug-in hybrid",
  "article": [
    "Mitsubishi has begun teasing its next-generation Outlander PHEV, an SUV that made waves when it debuted in 2012, but whose star has faded over the years.",
    "A slow update cycle and increasingly intense competition have impacted the crossover's popularity and sales.",
    "The current Outlander PHEV received a powertrain update for 2021, but almost every other part of the vehicle dates back to the previous-generation SUV's introduction in 2012.",
    "A new fourth-generation, non-PHEV Outlander debuted earlier this year and has helped drive sales for the automaker.",
    "The new Outlander's exterior styling is sharper and more aggressive than its predecessor, and the shift to a shared (with the Nissan Rogue / X-Trail) platform has made the vehicle two inches wider with a 1.5-inch longer wheelbase, which in turn has increased interior space and cargo capabilities.",
    "The automaker says the new model will have improved motor output and higher battery capacity over the current Outlander PHEV and notes that the vehicle will have a twin-motor four-wheel drive PHEV system.",
    "Other details are scarce at the moment, but from what we can see in the two teaser images, the Outlander PHEV appears to look just like its more traditional counterpart – at least from the rear.",
    "Mitsubishi is in the midst of a sort of renaissance these days. Earlier this week, the automaker announced that it had achieved its aggressive restructuring goals and financial targets in half the time it initially expected.",
    "Along with the new non-PHEV Outlander, which helped drive interest in all of the automaker's models, Mitsubishi realized cost savings and revenue improvements by cutting vehicle incentives and reducing its advertising spend.",
    "Surprisingly, Mitsubishi also capably weathered the ongoing microchip shortage that has brought much of the automotive world to its knees.",
    "Whether on not its latest move to reinvigorate its plug-in hybrid SUV will work remains to be seen however, as it's now some way behind many of its competitors."
  ],
  "headers": {
    "7": "Analysis: a Mitsubishi renaissance"
  },
  "links": {}
}