{
  "source": "https://www.techradar.com/news/pokemon-go-developer-teases-what-the-future-holds-for-the-popular-mobile-game",
  "title": "Pokémon Go developer teases what the future holds for the popular mobile game",
  "category": "wearables",
  "updated": "2021-05-11T16:31:35Z",
  "author": "axel-metz",
  "summary": "Gotta catch 'em all… again?",
  "article": [
    "Pokémon Go developer Niantic has hinted at the future of the mega-popular mobile game, suggesting that \"exciting things are in the works.\"",
    "In an exclusive interview with TechRadar, lead product manager for augmented reality (AR) at Niantic, Kjell Bronder, described the company’s ambition to reach the multiplayer potential of the mobile game first established by its launch trailer back in 2016.",
    "“If you look at that original Pokémon Go trailer,” Bronder said, “you'll see that there's a lot of stuff in there we still want to do.” This coincides with the launch of Niantic’s new developer platform, Niantic Lightship, which aims to bring a host of new AR capabilities to market – suggesting Pokémon Go could be set for a major update very soon.",
    "In the interview, Bronder described the new functionalities made possible by the company’s latest technology, among them real-time mapping, semantic segmentation and a more robust multiplayer experience.",
    "The former aims to more accurately superimpose virtual objects onto the real world using smartphone cameras, essentially adding physics to virtual objects. “To better augment reality, objects have to act naturally or behave as you would expect, so real-time mapping allows software to better understand your environment,” said Bronder.",
    "In the same vein, semantic segmentation allows virtual objects to look, feel and move in realistic ways. Niantic says Lightship can automatically segment different natural outdoor objects in a scene, enabling AR content to interact with specific surfaces. It’s not hard to imagine the above concept video being applied to virtual Pokéballs bouncing around real-life urban spaces, and it’s a feature we could see introduced into the game in the near future.",
    "A second Niantic source added that the goal is to keep the Pokémon Go universe “alive and vibrant” – which somewhat douses the flames on rumors of an outright sequel – but that the developer intends to add the “amazing multiplayer battles” debuted in the game’s original concept video.",
    "That focus on multiplayer is perhaps the most exciting addition we expect to see added to Pokémon Go in future updates.",
    "With Niantic’s new Lightship technology, the game may soon be capable of allowing eight players to share the same AR experience, with peer-to-peer messaging features introduced to better cultivate a sense of community among users.",
    "“There's nothing that's going to bring a virtual object to life more than if multiple people are seeing the same thing at the same time,” Bronder said in the interview. “But you have to actually understand the pose of all the different devices that are looking at that same scene. You're overlaying on top of the real world, so it's more important than ever that you have real-time communication to keep all of the different objects in sync.”",
    "In the above concept video, Niantic demonstrates software which allows individual users to throw and catch virtual objects with one another – again, a feature that seems primed to work well with the real-time visual exchange of Pokéballs.",
    "Could we potentially see the explosive Pokémon duels fictionalized in the game’s early trailers become a reality, then? It certainly seems a possibility, especially if these concept clips represent ready-to-go technology.",
    "In any case, with the launch of its new developer platform – now in the private beta stage – it’s safe to expect some major Pokémon Go updates are on the way soon. “There’s so much more to do,” Bronder added, \"and we're working on more than a dozen games.”",
    "Let’s hope a new version of Pokémon Go is among them."
  ],
  "headers": {
    "7": "Multiplayer madness"
  },
  "links": {
    "Pokémon Go": "https://www.techradar.com/news/gaming/pokemon-go-updates-everything-you-need-to-know-about-what-s-coming-next-1330140",
    "exclusive interview with TechRadar": "https://www.techradar.com/news/pokemon-go-creators-are-raising-the-bar-for-ar-again",
    "private beta": "https://niantic.dev/"
  }
}