{
  "source": "https://www.techradar.com/news/microsoft-drops-yet-another-windows-11-teaser-despite-essentially-confirming-os",
  "title": "Microsoft drops yet another Windows 11 teaser, despite essentially confirming OS",
  "category": "computing",
  "updated": "2021-06-21T17:52:20Z",
  "author": "michelle-rae-uy",
  "summary": "The new Windows OS could still have a few surprises in store",
  "article": [
    "Windows 11 has fully leaked online, but that hasn’t stopped Microsoft from moving forward with its teaser trailers. In a new tweet to remind Windows fans of its upcoming Microsoft Event, it just dropped another teaser trailer for Windows 11.",
    "The new teaser is a short, 10-second video, but there’s enough to unpack here. The model’s face is bathed in blue lighting, the very same shade of blue featured on the leaked Windows 11 background image. There’s also a close-up shot of the model’s ear, which seems to reinforce a previous teaser video, which alludes to a new startup sound for Windows 11.",
    "Although a version of Windows 11 has already been leaked, featuring a total rework of the Windows UI so that it looks slightly reminiscent of the macOS, it’s entirely possible that many elements of the upcoming OS have been since been changed. That means that Microsoft could still have a few surprises in store.",
    "Our sister site Windows Central was able to take Windows 11 for a quick spin, and we’re seeing a total rework of the Windows user interface. There’s an appealingly minimalist background image and a new taskbar whose icons seem to be centred at default while the Microsoft Store seems to be sporting a slightly cleaner, less crowded look. And, they all seem to point at Microsoft getting a few inspirations from Apple’s macOS.",
    "Still, this leaked version is likely to be an earlier one, which could mean that Microsoft has made a lot of changes since then. We could be looking at something audio-related that’s much bigger than new sounds judging from this new trailer, or possibly more updates to improve user experience on touchscreens and multi-monitor setups.",
    "Whatever these new updates will be, we’ll definitely be getting much more than what we’ve seen so far – at least, if Microsoft were to justify a new numbered moniker to its OS, instead of simply rolling out another Windows 10 update.",
    "Whatever they are, we won’t have to wait too long as the Microsoft Event is only a few days away on June 24. In the meantime, we’ll keep you updated on any fresh Windows 11 leaks and rumors to come out before then."
  ],
  "headers": {
    "3": "What we know about Windows 11 so far"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "leaked": "https://www.techradar.com/news/windows-11-name-confirmed-in-fresh-leak-from-microsoft",
    "short, 10-second video": "https://twitter.com/Windows/status/1406990360325373956",
    "previous teaser video": "https://www.youtube.com/watch?v=fMr4Qm5ZWrI&t=660s",
    "new startup sound for Windows 11": "https://www.youtube.com/watch?v=fMr4Qm5ZWrI&t=660s",
    "Windows 11 has already been leaked": "https://www.techradar.com/news/windows-11-is-real-and-microsoft-hasnt-even-announced-it-yet",
    "take Windows 11 for a quick spin": "https://www.youtube.com/watch?v=VMHgM_hTzlw&feature=emb_title",
    "improve user experience on touchscreens and multi-monitor setups": "https://www.techradar.com/news/windows-11-could-have-some-love-for-touchscreens-and-multi-monitor-setups",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}