{
  "source": "https://www.techradar.com/news/citizen-kane-is-now-beaten-by-paddington-2-on-rotten-tomatoes-heres-why",
  "title": "How an 80 year-old review stole Citizen Kane's 100% Rotten Tomatoes rating",
  "category": "entertainment",
  "updated": "2021-04-29T09:22:58Z",
  "author": "samuel-roberts",
  "summary": "Here's how Paddington 2 tops Citizen Kane now",
  "article": [
    "Paddington 2 now tops Citizen Kane, largely considered the greatest movie ever made, on review aggregation site Rotten Tomatoes thanks to a newly-added grouchy review from 1941. Citizen Kane now sits at 99% positive on the site, while Paddington 2 has 100% positive reviews.",
    "To be fair, Paddington 2 is far from the only movie on Rotten Tomatoes to achieve a higher percentage score than Citizen Kane – it's just the most humorous example to explain what's happened on social media (plus, Paddington 2 is extremely good). Other movies to achieve 100% positive on the site include The Maltese Falcon and, er, 2013 DC animated movie The Flashpoint Paradox. So it's not that useful an indicator of cultural importance.",
    "This negative review, originally published by the Chicago Tribune, seemed to be added to Citizen Kane's Rotten Tomatoes page at some point between March and April. Rotten Tomatoes actually dug up a clipping of the review itself, according to this Newspaper.com page.",
    "If you've never seen Citizen Kane – which is possible, despite being widely discussed and parodied in the 80 years since its release – the review is an interesting read. It feels like the 1941 version of a YouTube video explaining why something you like is bad, only more articulate, and without a badly-Photoshopped thumbnail.",
    "\"You've heard a lot about this picture and I see by the ads that that some experts think it 'the greatest movie ever made.' I don't.\"",
    "Citizen Kane tells the life story of Charles Foster Kane, a fictional media mogul who runs a newspaper called the Daily Enquirer, and later attempts to run for government office. Orson Welles is its star and director. Netflix's David Fincher 2020 movie Mank is about the fraught process behind the writing of the film.",
    "\"It's interesting,\" continues the review. \"It's different. In fact, it's bizarre enough to become a museum piece. But its sacrifice of simplicity to eccentricity robs it of distinction and general entertainment value.\" The critic – writing under the obvious pseudonym 'Mae Tinee' – doesn't seem too impressed, then.",
    "Wonder what they would've made of Paddington 2?",
    "Rotten Tomatoes is an entertaining indicator of whether a film is good or bad, but it's only one arbitrary metric of a movie's value. The critical response to a film does not always stand the test of time – for example, Thor: The Dark World has 66% positive reviews on the service, and it's widely considered one of the weakest MCU films.",
    "Basically, it's not worth taking that seriously, even if it creates some interesting discussions.",
    "Paddington 2 director Paul King jokingly told The Hollywood Reporter that Orson Welles would've come up with something 'nearly as good' as his film if he had the technology. \"But he had to make do. He had muster his meagre talent into merely knocking out Citizen Kane.\"",
    "Who knows: maybe in eight decades, someone will uncover a long-lost local newspaper review of a joyless person dunking on Paddington 2, and it'll lose its own perfect score."
  ],
  "headers": {
    "8": "Citizen Kane: still a good movie"
  },
  "links": {
    "Citizen Kane now sits at 99% positive": "https://www.rottentomatoes.com/m/citizen_kane",
    "Newspaper.com page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1257181900275736800&xs=1&url=https%3A%2F%2Fwww.newspapers.com%2Fclip%2F72431782%2Fcitizen-kane%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fcitizen-kane-is-now-beaten-by-paddington-2-on-rotten-tomatoes-heres-why",
    "David Fincher 2020 movie Mank": "https://www.techradar.com/news/netflix-drops-a-trailer-for-david-finchers-mank-which-could-be-2020s-best-movie",
    "Thor: The Dark World": "https://www.techradar.com/news/is-thor-the-dark-world-really-the-worst-mcu-movie",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/news/paddington-2-director-paul-king-on-toppling-citizen-kane-i-wont-build-my-xanadu"
  }
}