{
  "source": "https://www.techradar.com/news/apple-watch-7-price-leaks-just-hours-ahead-of-pre-orders",
  "title": "Apple Watch 7 price leaks just hours ahead of pre-orders",
  "category": "wearables",
  "updated": "2021-10-08T12:03:44Z",
  "author": "james-peckham",
  "summary": "Weirdly, we didn't know every price until now",
  "article": [
    "Update: Apple Watch 7 pre-orders deals are now live, so you can grab the watch for yourself. If you do pre-order, you'll receive your watch on Friday, October 15.",
    "Original story: The Apple Watch 7 is set to go up for pre-order at 5am PT / 8am ET / 1pm BST / 11pm AEDT today, and a new leak has given us a clear look at the new smartwatch's price for every model you can purchase in the US.",
    "We've known the cheapest variant would cost $399 / £369 / AU$599 ahead of pre-orders, but unlike with most other Apple launches the company hasn't revealed the prices for its larger and more high-end models.",
    "Tech leaker Jon Prosser has shared some prices that he says come from \"sources familiar with the matter\" that give us our best sense yet of how much the more expensive variants will cost.",
    "According to Prosser, the below information is correct for the US. We've yet to hear anything for the UK or Australia, so you'll likely have to wait until Apple's pre-orders go live to work out which model you can afford to buy.",
    "Take Prosser's information with a pinch of salt, though. Previously, Jon Prosser predicted a big design change for the Apple Watch 7 with more square edges, but that didn't come to fruition.",
    "That said, this information seems to match previous generations of the Apple Watch, and we have seen Prosser get leaks like this correct in the past. We will know more when the Apple website returns for pre-orders at 5am PT / 8am ET / 1pm BST / 11pm AEDT.",
    "It's odd that Apple hasn't revealed pricing information ahead of the Apple Watch 7 pre-orders.",
    "The company hasn't commented on the lack of detail, and it was only on Monday October 4 that we heard the starting price for those in Australia and the UK.",
    "Often Apple will release full pricing information for its upcoming devices as soon as possible, so it's a bit of a surprise we haven't seen it do similar for this launch.",
    "The Apple Watch 7 launch itself is a bit of an oddity, with rumors suggesting Apple intended for the smartwatch to land in September but it pushed back the release due to \"production snags\".",
    "One analyst has told TechRadar that they recommend pre-ordering the Apple Watch 7 as soon as possible, if you want one in the near future. Demand is expected to be high, and it's thought Apple's supply will be limited."
  ],
  "headers": {
    "7": "Analysis: why hasn't Apple released this information?"
  },
  "links": {
    "Apple Watch 7 pre-orders": "https://www.techradar.com/deals/apple-watch-7-deals-sales",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "leaker Jon Prosser": "https://www.frontpagetech.com/2021/10/07/exclusive-apple-watch-series-7-pricing/"
  }
}