{
  "source": "https://www.techradar.com/news/ransomware-actors-target-voip-service-with-another-wave-of-ddos-attacks",
  "title": "Ransomware actors target VoIP service with another wave of DDoS attacks",
  "category": "computing",
  "updated": "2021-10-11T17:50:51Z",
  "author": "mayank-sharma",
  "summary": "Ransomware operators are increasingly adding DDoS attacks to their repertoire of extortion mechanisms",
  "article": [
    "A series of sustained Distributed Denial of Service (DDoS) reportedly knocked UK Voice over Internet Protocol (VoIP) provider VoIP Unlimited offline, weeks after it was targeted in a REvil-orchestrated ransomware campaign.",
    "According to The Register, last week’s downtime was the result of \"an alarmingly large and sophisticated DDoS attack attached to a colossal ransom demand\" which VoIP Unlimited has pinned to the REvil ransomware gang.",
    "The attack is also blamed for disrupting the operations of other UK VoIP providers at the same time as well.",
    "As of 11 December however, VoIP Unlimited has restored a majority of its services, while a couple continue to report “Degraded Performance.”",
    "The Register notes that while REvil is notorious for its ransomware operations, it seems to have joined the list of ransomware operatives who have begun switching to conducting extortion-based DDoS campaigns.",
    "In fact, it appears before attacking VoIP Unlimited, the gang honed their skills by going after a Canadian firm in mid-September, and demanding one bitcoin (around $45,000 at the time) to cease the attacks.",
    "Commenting on the change in tactics of ransomware operators, cybersecurity analysts at TrendMicro observed that multilevel extortion schemes were beginning to emerge as the latest trend in the ransomware underworld.",
    "“Triple extortion follows a straightforward formula: adding DDoS attacks to the aforementioned encryption and data exposure threats. These attacks could overwhelm a server or a network with traffic, which in turn could halt and further disrupt operations,” observed TrendMicro.",
    "The new modus operandi was first performed by SunCrypt and RagnarLocker operators in the latter half of 2020, adding that the REvil operators were also looking to adopt this new ransomware strategy.",
    "The emergence of ransomware DDoS (RDDoS) attacks was also recently highlighted in a report by US telecoms company Lumen Technologies, as it urged businesses to prepare for this incoming onslaught.",
    "Via The Register"
  ],
  "headers": {
    "4": "From ransomware to DDoS"
  },
  "links": {
    "DDoS": "https://www.techradar.com/news/best-ddos-protection",
    "VoIP": "https://www.techradar.com/news/best-voip-service",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "REvil ransomware gang": "https://www.techradar.com/news/revil-is-back-and-wants-to-rebuild-its-reputation",
    "disrupting the operations": "https://www.techradar.com/news/ddos-assaults-against-voip-providers-continues",
    "report": "https://status.voip-unlimited.net/",
    "a Canadian firm": "https://www.insurancebusinessmag.com/ca/news/breaking-news/canadian-comms-company-suffers-ddos-attack-310819.aspx",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "TrendMicro": "https://www.techradar.com/reviews/trend-micro-2020-antivirus-solutions",
    "observed TrendMicro": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1139622551206878000/https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-double-extortion-and-beyond-revil-clop-and-conti",
    "recently highlighted": "https://www.techradar.com/news/ransom-ddos-could-be-the-next-big-threat",
    "The Register": "https://www.theregister.com/2021/10/08/voip_unlimited_limited_by_outage/"
  }
}