{
  "source": "https://www.techradar.com/news/amazon-sale-knocks-the-fire-tv-stick-to-just-dollar1999-in-epic-deal",
  "title": "Amazon sale knocks the Fire TV Stick to just $19.99 in epic deal",
  "category": "televisions",
  "updated": "2021-06-30T03:36:01Z",
  "author": "mackenzie-frazier",
  "summary": "Prime members can get the Fire TV Stick Lite on sale for $19.99",
  "article": [
    "Pick up a cheap streaming device with this exclusive deal from Amazon. For a limited time, Prime members can get the Fire TV Stick Lite on sale for just $19.99 (was $29.99). That's the best deal we've found for the streaming device and only $2 more than the record-low Black Friday price.",
    "The Fire TV Stick Lite is the newest addition to the Amazon Fire TV family, and it's the cheapest device that Amazon has put out yet. The budget streaming stick allows you to stream your favorite content from apps like Hulu, Amazon Video, Netflix, and more. You'll get access to tens of thousands of channels, Alexa skills, and apps, and the Alexa voice remote allows you to browse shows, launch movies, adjust the volume, and more completely hands-free. As we've mentioned above, this fantastic deal is for Prime members only, and if you don't have a membership, you can sign up for a free 30-day trial here. We don't know how long Amazon will have the Fire TV Stick Lite on sale, so we recommend snagging this bargain now before it's too late.",
    "If you're after the standard or 4K versions, you'll find plenty more Fire TV Stick deals available right now. Or, expand your Alexa ecosystem with all the latest Amazon Echo sales and Fire Tablet prices."
  ],
  "headers": {
    "1": "Fire TV Stick deal",
    "2": "More Fire TV Stick deals"
  },
  "links": {
    "on sale for just $19.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07YNLBS7R%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1260183687993450500-20",
    "Fire TV Stick Lite": "https://www.techradar.com/reviews/amazon-fire-tv-stick-lite",
    "here": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Famazonprime%3F_encoding%3DUTF8%26%252AVersion%252A%3D1%26%252Aentries%252A%3D0%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1002512365488109700-20",
    "Fire TV Stick deals": "https://www.techradar.com/news/best-amazon-fire-tv-deals",
    "Amazon Echo sales": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals",
    "Fire Tablet prices": "https://www.techradar.com/deals/the-best-cheap-amazon-fire-tablet-deals"
  }
}