{
  "source": "https://www.techradar.com/news/intel-core-i9-11900k-hits-a-huge-73ghz-overclock-but-past-cpus-have-done-better",
  "title": "Intel Core i9-11900K hits a huge 7.3GHz overclock – but past CPUs have done better",
  "category": "computing",
  "updated": "2021-04-01T09:39:25Z",
  "author": "darren-allan",
  "summary": "Its Comet Lake predecessor, the 10900K, reached 7.7GHz",
  "article": [
    "How fast can Intel’s new Core i9-11900K processor go? We saw it hit 7GHz already in some early attempts, but now, a professional overclocker has pushed the Rocket Lake flagship to 7.31GHz, a new record for the chip.",
    "This was achieved by veteran Taiwanese overclocker Hicookie (who is backed by Gigabyte), and naturally, it involved using fancy cooling (liquid nitrogen) and a suitably premium Gigabyte Aorus Tachyon Z590 motherboard (which costs in excess of $500).",
    "However, do note that Hicookie made some extra room to push the CPU as hard as possible by deactivating the majority of the cores, so only 3 of the 8-cores were actually running. That meant, along with the exotic cooling, that he could juice up those cores even further using CPU multiplier and BCLK (base clock) overclocking to exceed 7.3GHz, as per the record now posted on HWBot as Tom’s Hardware spotted.",
    "The Rocket Lake flagship’s 7.3GHz speed, while undoubtedly impressive given the tweaking and fine-tuning it took to happen, is still some way short of the overclocking we’ve seen with Intel’s previous flagship processors.",
    "Its predecessor, the Core i9-10900K, was ramped up to a staggering 7.7GHz using liquid helium cooling not long after the Comet Lake flagship was launched, and the 9900K before that manged 7.6GHz when overlocked by Der8auer, another big name from the overclocking world. So the 11900K is still some way shy of those kind of speeds.",
    "This isn’t a big surprise, though, as Intel has been having to push harder and harder to eke more gains out of its 14nm process, which Rocket Lake remains on (it’s a backport of 10nm Cypress Cove tech to 14nm). Hence the 11900K running hot and power-hungry, as we observed in our review – the new flagship seems like a stopgap chip Intel felt it had to bring in before Alder Lake (12th-gen), but one which doesn’t make much sense on some levels (even if it’s still a top-notch single-core performer)."
  ],
  "headers": {
    "4": "Comet champ"
  },
  "links": {
    "Intel’s new Core i9-11900K processor": "https://www.techradar.com/news/the-intel-core-i9-11900k-isnt-good-but-at-least-it-means-well-finally-get-faster-ssds",
    "hit 7GHz already in some early attempts": "https://www.techradar.com/news/intel-core-i9-11900k-cpu-spotted-overclocked-to-a-massive-7ghz",
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/core-i9-11900k-overclocked-7-3-ghz",
    "processors": "https://www.techradar.com/news/best-processors",
    "Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "review": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september"
  }
}