{
  "source": "https://www.techradar.com/news/netflix-just-dropped-a-trailer-for-one-of-its-biggest-new-movies-ever",
  "title": "Netflix just dropped a trailer for one of its biggest new movies ever",
  "category": "entertainment",
  "updated": "2021-09-08T16:08:44Z",
  "author": "hamish-hector",
  "summary": "Leonardo DiCaprio and Jennifer Lawrence star in Don't Look Up",
  "article": [
    "Netflix has just dropped the trailer for Don’t Look Up, a new dark comedy about scientists trying to save Earth from its imminent destruction.",
    "The story of two low-level astronomers attempting to warn mankind of an incoming meteor strike is set to feature the streaming service’s most star-studded cast ever, with Jennifer Lawrence and Leonardo DiCaprio as its lead actors. It's the first time DiCaprio has starred in a Netflix original movie.",
    "In the brief minute-long trailer we also get a taste of Meryl Streep as the President of the United States and Jonah Hill as her top aide - both playing government officials who are bored of being in yet another “the world is ending meeting”. We also get quick flashes of other cast members that include Tyler Perry, Timothee Chalamet, Ariana Grande, and Cate Blanchett among others.",
    "This comedic spin on the disaster movie is headed up by writer and director Adam McKay (The Big Short and Anchorman: The Legend of Ron Burgandy) who has multiple major award nominations and wins as a prestige filmmaker at this point.",
    "Don’t Look Up will come to select theaters on December 10 later this year, and will launch on Netflix two weeks later on December 24.",
    "Disaster movies often conjure up images of protagonists who spit in the face of fear, and governments that are willing to do whatever it takes to fight back an impending doomsday threat. From the trailer, it looks like Don’t Look Up is not that kind of disaster movie – at all.",
    "Leonardo DiCaprio opens the trailer as a scientist in the middle of a panic attack - a much more realistic reaction to discovering that the world is ending. Rather than the world’s forces uniting after the discovery of impending disaster, though, our two astronomers are forced to create a media buzz to encourage governments to act.",
    "The film isn't out yet, so we don't know how well it will handle this interesting take on the disaster movie, but we can't wait for December 24 to come around."
  ],
  "headers": {
    "5": "A different kind of disaster movie"
  },
  "links": {}
}