{
  "source": "https://www.techradar.com/news/netflix-nails-resident-evil-series-casting-with-some-help-from-the-games",
  "title": "Netflix nails Resident Evil series casting, with some help from the games",
  "category": "entertainment",
  "updated": "2021-03-12T13:46:25Z",
  "author": "rhys-wood",
  "summary": "A lovely bit of consistency",
  "article": [
    "Netflix has revealed in a tweet who will be playing the roles of Leon S. Kennedy and Claire Redfield in Resident Evil: Infinite Darkness, the animated series coming to the streaming platform in 2021, and the casting is sure to make fans of the Resident Evil 2 remake happy.",
    "Nick Apostolides and Stephanie Panisello will be reprising the roles of Leon and Claire respectively, after voicing the characters in 2019’s Resident Evil 2 remake. The announcement was accompanied by a new promotional image, in which it looks like a horde of zombies are attacking the White House.",
    "Fans aren’t the only ones excited about the Resident Evil: Infinite Darkness casting, though, as Stephanie Panisello herself tweeted out her excitement at reprising the role of Claire Redfield.",
    "It’s definitely nice to see Resident Evil: Infinite Darkness employ this bit of continuity with its new voice actors for Claire and Leon. Over the course of the Resident Evil series, numerous characters have seen their voices cast and recast with very little consistency between entries, so sticking with familiar voices for the Netflix series is a definite plus in our book.",
    "There’s still no word on when Resident Evil: Infinite Darkness will come to Netflix, but we do know that it’s due sometime in 2021. Hopefully sooner rather than later, as we’re intrigued in seeing how Infinite Darkness will add to the series’ canon.",
    "With multiple Resident Evil projects currently in the works, from Infinite Darkness to Resident Evil Village and the upcoming feature film, it certainly looks like Resident Evil fans are going to have a busy 2021 ahead of them."
  ],
  "headers": {
    "3": "Familiar voices"
  },
  "links": {
    "in a tweet": "https://twitter.com/NXOnNetflix/status/1370179302336000007",
    "Resident Evil 2 remake": "https://www.techradar.com/reviews/resident-evil-2-remake-review",
    "tweeted": "https://twitter.com/Steph_Panisello/status/1370187083030044674",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "upcoming feature film": "https://www.techradar.com/news/resident-evil-movie-reboot-finally-gets-a-release-date"
  }
}