{
  "source": "https://www.techradar.com/news/lowes-memorial-day-sale-2021-best-deals-appliances-patio-furniture-tech",
  "title": "Lowe's Memorial Day sale 2021: see the best deals on appliances, furniture, smart tech, and more",
  "category": "smart-home",
  "updated": "2021-05-31T15:54:30Z",
  "author": "alex-whitelock",
  "summary": "The Lowe's Memorial Day sale has plenty to check out",
  "article": [
    "It's the big day itself, and, if you're looking for bargains then the Lowe's Memorial Day sale definitely doesn't disappoint - there are literally thousands of discounts available on a huge range of appliances, furniture pieces, tools, and much more.",
    "Because of the sheer density of the Lowe's Memorial Day sale, it could take you quite a while to sift through all the prime offerings. That's why we've gone to the effort to help our readers out with a quick summary of the best deals available today. We've particularly got our eye on smart home tech and gadgets, but, as you'd expect the real stars of the show here are the big discounts on appliances, grills, and things like patio furniture. These are big items - so it's lucky the Lowe's Memorial Day sale features a ton of excellent home delivery options.",
    "As with most years, the Lowe's Memorial Day sale actually launched quite a few days early, but that doesn't mean you haven't missed out. All the top deals that were available over the weekend are still about today from what we can see, so the chances of you having missed a prime sale are very narrow.",
    "If you're in a rush, at the top of the page you'll find a summarized list of today's highlights along with links to the relevant content. Just below that there's an overview of the main categories on sale today, including things like up to $500 off large appliances and a ton of great discounts on patio furniture. And, finally, below that you'll find a couple of recommendations we've picked out from the best-selling products in today's Lowe's Memorial Day sale.",
    "If you'd like to see what other retailers are offering already, then head on over to our main Memorial Day sales page. Home Depot and Best Buy in particular also have some early-bird sales to check out so definitely don't miss them.",
    "Looking for something specific? Here's a couple of best-sellers we've picked out as recommendations for today's Lowe's Memorial Day sales.",
    "Bundle together appliances for big savings",
    "The Lowe's Memorial Day sales feature upfront discounts on individual appliances, but the biggest savings are reserved for when you spend over $2,499. That's a lot, but if you're bundling together a few appliances for a full refit not only can you save upwards of $500, but you can also most likely secure free delivery and installation too.",
    "Financing and bonus savings via the Lowe's Advantage Card",
    "Signing up for the Lowe's Advantage Card can give you access to a further 5% discount on all items and a 6-month financing option for all purchases over $299. While another hoop to jump through, this is a great little bonus to have if you're a loyal Lowe's customer who's looking to save a few bucks or make that big purchase a little more easy on the wallet."
  ],
  "headers": {
    "5": "Lowe's Memorial Day Sales A-Z quick links:",
    "6": "Lowe's Memorial Day Sales: top tips",
    "10": "More Memorial Day sales to check out today"
  },
  "links": {
    "up to $500 off": "https://lowes.sjv.io/c/221109/897039/12374?subId1=trd-us-7147520279800931000&sharedId=trd-us&u=https%3A%2F%2Fwww.lowes.com%2Fpl%2FAppliance-Special-Values%2F4294695738%3Fcatalog%3D4294937007%26int_cmp%3DSavings%253AA%253AAppliances%253APromo%253ASave_On_Select_Appliance_Special_Values_FW16_21",
    "ton of great discounts": "https://lowes.sjv.io/c/221109/897039/12374?subId1=trd-us-8463574836720003000&sharedId=trd-us&u=https%3A%2F%2Fwww.lowes.com%2Fpl%2FSave-On-Select-Patio-Furniture%2F4294482010",
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "Lowe's Advantage Card": "https://lowes.sjv.io/c/221109/897039/12374?subId1=trd-us-3859265311676812000&sharedId=trd-us&u=https%3A%2F%2Fwww.lowes.com%2Fl%2FCredit%2Fconsumer-credit-center"
  }
}