{
  "source": "https://www.techradar.com/news/amazon-echo-show-15-is-an-echo-show-you-hang-on-your-wall-like-a-picture-frame",
  "title": "Amazon Echo Show 15 is an Echo Show you hang on your wall like a picture frame",
  "category": "smart-home",
  "updated": "2021-09-28T17:41:21Z",
  "author": "gerald-lynch",
  "summary": "Mirror mirror on Jeff Bezos's wall",
  "article": [
    "Running out of shelves to store all your Amazon Echo speakers on? The tech giant has just revealed an all-new kind of Echo device during its annual hardware refresh – the Echo Show 15, a wall-hung smart screen that’s as much a picture frame as it is a connected gadget.",
    "With a 15.6-inch touchscreen, the device can also be table mounted with a sold-separately stand. Powered by the AZ2 Neural Edge processor, Amazon sees it not just as a smart screen, but a family hub too, collating calendars, notes, shopping lists and picture-in-picture security cam features.",
    "A built in camera will allow for an optional “Visual ID” profile feature, which sees the Amazon Echo Show 15 recognise a user standing in front of it, and tailor the information on screen to that user.",
    "As with all Alexa devices, you’ll be able to use the “Alexa” wake up word to spring the screen to life, and ask the digital helper general knowledge questions, jukebox requests, smart home device controls and more.",
    "It'll also act a video streamer – the screen has a 1080p resolution, accessing movies and TV shows from Prime Video, Netflix and Hulu. All Echo Show devices, including the Echo Show 15, will soon have access to Sling TV, too.",
    "Those using the cloud-based Amazon Photos service will also be able to set up the device to act as a slideshow picture frame, putting your best pics on a wall automatically, or pre-loaded art.",
    "The Echo Show 15 launches later this year, priced at $249.99 in the US, and at £239.99 in the UK."
  ],
  "headers": {
    "3": "The smartest frame on your wall?"
  },
  "links": {
    "Amazon Echo": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals"
  }
}