{
  "source": "https://www.techradar.com/news/huaweis-harmonyos-alternative-to-android-is-tipped-to-launch-on-june-2",
  "title": "Huawei's HarmonyOS alternative to Android will launch next week",
  "category": "phones",
  "updated": "2021-05-25T08:27:04Z",
  "author": "david-nield",
  "summary": "Matching previous rumors",
  "article": [
    "Update: Since we posted this story, Huawei has confirmed it will be hosting an event on June 2 at 5am PT / 8am ET / 12pm BST / 4pm AEST. It's currently unclear if this event is global, or if it's a China-only launch for now.",
    "Original story:",
    "We've heard plenty of official news and unofficial tidbits about the Huawei HarmonyOS in recent weeks, and it looks as though the new software is going to be unveiled at a launch event scheduled for June 2.",
    "That's according to sources speaking to HuaweiCentral, which also has a leaked promo poster associated with the event. It's scheduled to start at 8pm China time (6am PT / 9am ET / 1pm BST / 3pm AEST) – with that timing hinting that this might be a global event.",
    "Two brand new devices – the Huawei MatePad Pro 2 and the Huawei Watch 3 – will apparently be coming along to the party to help launch the updated version of the operating system, which is technically HarmonyOS 2.0.",
    "This all matches up very neatly with previous rumors we've heard, both about the date of the launch and the devices that will be first in line for the software. Older hardware, including the Huawei Mate 40 phones, will reportedly join a HarmonyOS 2.0 beta program.",
    "As we've mentioned, HarmonyOS is actually already out in the wild and in use on some IoT devices and TVs. This new launch, HarmonyOS 2.0, is the big one though: it'll see the software arrive on consumer-facing devices like phones and tablets as a true rival to the Android OS that Google develops.",
    "Since the start of the US government ban prohibiting Huawei from doing business with US companies such as Google, devices such as the Huawei P40 have arrived running a stripped-down version of Android, without any Google apps or the Google Play Store.",
    "Those software flaws have been holding back what is otherwise excellent hardware, but HuaweiOS 2.0 should mark a new chapter in the Huawei story – even if app availability is still going to be a problem until Huawei convinces all the big developers to port their apps over to the new OS.",
    "When June 2 rolls around we should learn a lot more about HarmonyOS 2.0 and how it might work on phones such as the Huawei P50. As soon as the event or the software is made official by Huawei, we'll let you know.",
    "Via NotebookCheck"
  ],
  "headers": {},
  "links": {
    "Huawei HarmonyOS": "https://www.techradar.com/news/harmonyos-2",
    "HuaweiCentral": "https://www.huaweicentral.com/breaking-harmonyos-launching-on-june-2-alongside-huawei-watch-3-and-matepad-pro-2/",
    "Huawei MatePad Pro 2": "https://www.techradar.com/news/huawei-matepad-pro-2-5g-looks-likely-soon-and-it-may-have-40w-charging",
    "Huawei Watch 3": "https://www.techradar.com/reviews/huawei-watch-3",
    "Huawei Mate 40": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "Huawei P40": "https://www.techradar.com/reviews/huawei-p40-review",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "NotebookCheck": "https://www.notebookcheck.net/Huawei-confirms-a-June-2-2021-launch-for-HarmonyOS.540566.0.html"
  }
}