{
  "source": "https://www.techradar.com/news/turns-out-a-lot-of-us-are-really-bad-at-behaving-on-zoom-calls",
  "title": "Turns out a lot of us are really bad at behaving on Zoom calls",
  "category": "computing",
  "updated": "2021-12-09T15:35:11Z",
  "author": "mike-moore",
  "summary": "So many of us are on mute, Zoom finds",
  "article": [
    "After another bumper year for video calls across the world, Zoom has released a series of somewhat surprising facts about some of the oddest facts it has gathered about users in 2021.",
    "The video conferencing platform carried out a global survey and combined the results with its own internal insights to show how we really used Zoom - with some particularly odd findings.",
    "This includes over half (53%) of Zoom users saying it was OK to eat during meetings, 42% saying they have made a call from their beds, and over a quarter (26%) saying they almost never showered before going on a call.",
    "Covering the period of November 15 2020 to November 15 2021, the company's survey discovered that Wednesday was the most popular day of the week for Zoom calls, followed by Tuesday and Thursday.",
    "The average length of a Zoom call was a whopping 54 minutes, with the average meeting size found to be 10 participants.",
    "Zoom, which was used in nearly 200 countries and territories around the world, also found that January 21 2021 was the busiest day of the year for virtual meetings, with February 25 the most popular day for webinars.",
    "Elsewhere, nearly three-quarters (71%) of Zoom users have had to say the phrase \"you're on mute\" at some point in the last 12 months, with 57% needing to ask if everyone on a call could see their screen.",
    "75% of users said they waved goodbye at the end of their meetings, with outdoor landscapes (26%) proving slightly more popular than blurred backgrounds (25%) or company logos (20%).",
    "Just under half (43%) confessed to only cleaning the part of the room visible on camera, with the same number (43%) of parents having a child show up during a meeting, and 36% saying they have had a pet show up during a meeting."
  ],
  "headers": {
    "3": "Zoom in 2021"
  },
  "links": {
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "survey": "https://blog.zoom.us/how-you-zoomed-over-the-past-year-2021/"
  }
}