{
  "source": "https://www.techradar.com/news/lego-star-wars-the-skywalker-saga-has-a-new-release-date-and-an-excellent-trailer",
  "title": "Lego Star Wars: The Skywalker Saga has a new release date (and an excellent trailer)",
  "category": "gaming",
  "updated": "2021-08-25T19:16:48Z",
  "author": "gerald-lynch",
  "summary": "Yoda in a backpack!",
  "article": [
    "Gamescom 2021’s Opening Night Live show delivered the goods for Star Wars fans, who finally got a long-awaited fresh glimpse at Lego Star Wars: The Skywalker Saga – as well as a revised release window for the twice-delayed game.",
    "Now coming to Xbox Series X / S, PS5, PS4, Xbox One and PC in Spring 2022, the game lets players explore all nine episodes of the core Star Wars saga in brickified form.",
    "From starship battles to Wookie grooming, take a look at the new Lego Star Wars: The Skywalker Saga trailer below:",
    "We'd started to think Lego Star Wars: The Skywalker Saga was as dead as Greedo, but its Gamescom Opening Night Live showing was impressive and full of fun.",
    "Again taking a humorous take on George Lucas's universe, it was great to see scenes like Anakin and Obi-Wan's final battle on Mustafar and Luke's training on Degobah rendered in brick.",
    "What's most exciting though was a glimpse at the open-world mechanics for the game. Though some set pieces (such as star fighter and arena battles) seem more scripted, there appear to be some wide-open hub areas to explore, too. A glimpse at Luke Skywalker opening up a star map to jump to another part of the galaxy suggests that this may be a far bigger game than any Lego adaptation we've seen before – and one that will have been well worth the wait."
  ],
  "headers": {
    "3": "A long awaited trip to the far side of the galaxy"
  },
  "links": {
    "Gamescom 2021": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show",
    "Lego Star Wars: The Skywalker Saga": "https://www.techradar.com/news/lego-star-wars-the-skywalker-saga-release-date-trailers-news-and-gameplay",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x"
  }
}