{
  "source": "https://www.techradar.com/news/heres-why-whatsapp-users-are-fleeing-for-other-platforms",
  "title": "WhatsApp users are increasingly moving to other platforms",
  "category": "phones",
  "updated": "2021-01-18T09:50:46Z",
  "author": "mike-moore",
  "summary": "Signal, Telegram and more all reporting rise in user numbers",
  "article": [
    "Usesrs of popular messaging service WhatsApp are apparently looking to move to other platforms following a change in the app's terms and conditions.",
    "WhatsApp, which has over two billion users worldwide, began informing users of the changes earlier this week, alarming many with mentions of sharing data from the app with parent company Facebook, despite previously having pledged never to do so.",
    "This has led users to flee to the likes of Signal and Telegram, which claim to offer full end-to-end encryption to keep user data safe.",
    "The update does not change WhatsApp’s data sharing practices with Facebook, but instead includes changes related to messaging a business on WhatsApp, which is optional, and provides further transparency about how we collect and use data.",
    "Although this data does not include messages sent or calls made using WhatsApp, or a user's location, it does include personal details used to set up an account, such as name and phone number, as well as information on what exact model of device they are using, as well as the IP address.",
    "\"We want to be clear that the policy update does not affect the privacy of your messages with friends or family in any way,\" WhatsApp wrote in a company blog explaining the changes.",
    "\"Instead, this update includes changes related to messaging a business on WhatsApp, which is optional, and provides further transparency about how we collect and use data.\"",
    "Users were originally told they must accept the new terms by February 8, or not be able to access WhatsApp at all. However, after unrest from users on Twitter, WhatsApp has confirmed that this will be extended until May 15 so users have time to 'review' the changes more fully:",
    "The warning does not apply to users in the UK and Europe, but has still been sent to devices in these regions. WhatsApp added that its practice of sharing data with Facebook was not new.",
    "Users have now flocked to alternative services such as Telegram, which has seen its user base nearly double in the space of a few weeks. The app promises to offer full end-to-end encryption for its users, keeping their conversations private.",
    "Elsewhere, Signal, which has received support from the world's richest man Elon Musk, recently tweeted that its user base had increased from around 10 million to over 50 million users in a matter of days. The platform has added more capacity to deal with the surge, and introduced wider group chats and better image sharing to support its new users.",
    "Via BBC"
  ],
  "headers": {
    "3": "WhatsApp alternatives"
  },
  "links": {
    "WhatsApp": "https://www.techradar.com/how-to/use-whatsapp",
    "sharing data from the app with parent company Facebook": "https://www.techradar.com/news/whatsapps-new-privacy-policy-requires-you-to-share-data-with-facebook",
    "a company blog": "https://faq.whatsapp.com/general/security-and-privacy/answering-your-questions-about-whatsapps-privacy-policy",
    "BBC": "https://www.bbc.co.uk/news/technology-55634139"
  }
}