{
  "source": "https://www.techradar.com/news/ces-2021-these-microled-smart-glasses-might-be-the-coolest-weve-seen",
  "title": "CES 2021: These microLED smart glasses might be the coolest we’ve seen",
  "category": "wearables",
  "updated": "2021-01-12T17:05:41Z",
  "author": "axel-metz",
  "summary": "Finally, fashionable smart glasses",
  "article": [
    "Augmented reality and wearable tech developer Vuzix has announced its newest pair of smart glasses at CES 2021, and they look set to finally solve one of the biggest issues with smart glasses in general: their appearance.",
    "Powered by microLED technology, Vuzix has utilised ultra small display projectors fitted neatly into both sides of the glasses to make the product look as wearable as possible – and it may have paid off. Unlike other smart glasses we’ve seen, the American company seems to have developed a genuinely fashionable piece of wearable technology (as reported by The Verge).",
    "Seriously, apart from some overly-thick temples, the Vuzix smart glasses could pretty much pass for regular eyewear. That’s all thanks to those microLED displays, which replace the internal projectors one would usually expect to find in glasses of this type, and come as a result of the company’s partnership with Chinese screen developer Jade Bird Display. On show at CES were the first of a variety of wearable displays and glasses, according to the two companies.",
    "So, what can they do? Well, similar to Google Glass, Vuzix’s smart glasses are more of a heads-up display than true augmented reality, and are designed to mirror information from a paired smartphone. That means the glasses project a stereoscopic image onto the interior glass of both lenses to present the illusion of a 3D object in front of the user. Compatible smartphone software will send signals to the glasses to create virtual images of maps, data sets, call information, and so on.",
    "The smart glasses will come with stereo speakers and noise-cancelling microphones to make your voice sound crisper and block out the bustle of your surroundings, while Wi-Fi support will come built-in, alongside optional 4G LTE. There’ll also be iOS and Android-supported gesture controls to navigate companion mobile apps by simply using the sides of the glasses.",
    "The capabilities of the glasses themselves are nothing new, but Vuzix should be praised for squeezing it all into such a neat – dare we say stylish – package. It’s also worth noting that the company isn’t targeting the product at the mass consumer market in the same way that other smart glasses have been in the past.",
    "Instead, Vuzix’s smart glasses are intended for the workplace, meaning many of its features have been geared towards effectively improving corporate, medical, retail and materials management environments.",
    "The redirection for the company comes as the interest in AR and VR technology dissipates with consumers. Much in the same way 3D TVs enjoyed a brief period of hysteria upon their initial launch, companies have been slow to adopt – and consumers slow to embrace – genuinely worthwhile VR technologies outside of gaming.",
    "That’s the reason the lines are quiet on products like the Microsoft HoloLens, Magic Leap One AR goggles and, of course, a new generation of Google Glass – it’s just not a technology that people see as having practical, real-world applications beyond the vocational benefits it can provide (to a doctor, for example).",
    "Still, the major players in tech are still hoping to solve the consumer smart glasses puzzle. Amazon has thrown its hat in the ring with its Echo Frames, Facebook is working on a glasses project with Ray-Ban, and Apple – of course – remains the subject of AR headset rumours.",
    "In any case, Vuzix’s latest efforts seem primed to successfully function as practical, stylish workplace companions in the near future. The smart glasses don’t yet have a name, price or release date – bear in mind its previous Blade model cost $1,000, which converts to around £730 / AU$1,300 – but rumours are swirling that they’re bound for a mid-2021 arrival."
  ],
  "headers": {
    "7": "A waning novelty"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "The Verge": "https://www.theverge.com/2021/1/11/22225605/vuzix-microled-smart-glasses-next-gen-ar-heads-up-display-ces-2021",
    "3D TVs": "https://www.techradar.com/news/television/3d-tv-all-your-questions-answered-987535",
    "Microsoft HoloLens": "https://www.techradar.com/reviews/wearables/microsoft-hololens-1281834/review",
    "Magic Leap One AR goggles": "https://www.techradar.com/news/magic-leap-one",
    "Echo Frames": "https://www.techradar.com/reviews/amazon-echo-frames",
    "glasses project with Ray-Ban": "https://www.techradar.com/news/facebook-working-on-protect-aria-augmented-reality-glasses-with-smart-glasses-launching-in-2021"
  }
}