{
  "source": "https://www.techradar.com/news/today-only-oculus-quest-2-reaches-lowest-price-ever-at-verizon",
  "title": "Oculus Quest 2 deals on sale in first-ever price cut at Verizon - today only",
  "category": "gaming",
  "updated": "2021-04-22T11:33:44Z",
  "author": "alex-whitelock",
  "summary": "The first big price cut on the amazing Oculus Quest 2",
  "article": [
    "Oculus Quest deals are super rare on the Oculus Quest 2 - it's the most popular VR headset around right now after all. So, don't miss Verizon's one-off Earth Day sale, which is offering the device for just $269.99 right now - the first big discount and the lowest price ever on this headset... so far.",
    "Use the code EARTHDAY at checkout to redeem your neat $30 discount on this VR headset deal but hurry - this promotion is available for today only. The Oculus Quest 2 is easily one of the best value VR headsets out there so we'd recommend acting quickly - both because this sale is sure to be popular, and because it could be a while before Oculus Quest deals come back round again.",
    "Launched back in October of last year, the Oculus Quest 2 is the second standalone VR headset from the industry-leading brand and a fantastic great entry-point into the world of VR gaming if you're looking to cut those cables. Being a fully a fully-fledged all-inclusive VR experience means you don't even have to hook this thing up to an expensive gaming PC or console to get your game on.",
    "The Oculus Quest 2 comes with two controllers, plus an array of free apps and games to ease you into the experience. Of course, if you do happen to have a powerful PC then there are also literally thousands of VR games out there, including triple-A titles (especially on Steam).",
    "Note, you will need a linked Facebook account to log in with the Oculus Quest 2 - a small price to pay for such a fantastic VR experience in our books. Like most VR headsets, you'll also benefit from having plus plenty of space in your environment to utilize - you'll definitely want to mind the chandelier or TV while you're flailing about.",
    "Outside the US? See the best Oculus Quest 2 VR headset deals in your region just below.",
    "To see what other great headsets are going for cheap this week, head on over to our main best VR headset deals for more. Also see our Oculus Quest prices and Oculus Rift sales page for other devices in the range."
  ],
  "headers": {
    "3": "Oculus Quest 2 deals on sale at Verizon"
  },
  "links": {
    "for just $269.99 right now": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5130546395874269000/https://www.verizon.com/products/oculus-quest-2-all-in-one-gaming-headset-64gb-vr/",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "especially on Steam": "https://store.steampowered.com/vr/",
    "best VR headset deals": "https://www.techradar.com/deals/best-cheap-vr-headset-deals-prices-sales",
    "Oculus Quest prices and Oculus Rift sales": "https://www.techradar.com/news/gaming/oculus-rift-deals-1329262"
  }
}