{
  "source": "https://www.techradar.com/news/youre-gonna-want-to-try-the-new-google-meet-app-says-google",
  "title": "You're gonna want to try the new Google Meet app, says Google",
  "category": "computing",
  "updated": "2021-08-02T19:45:12Z",
  "author": "anthony-spadafora",
  "summary": "New Progressive Web App is easier to find and use",
  "article": [
    "Google wants to make it even easier for users to get started with its video conferencing software which is why the company has launched a new Progressive Web App (PWA) for Google Meet.",
    "The search giant's new PWA includes all of the same features as Google Meet on the web but since it's a standalone app, it's easier to find and use. It also helps streamline your workflow by eliminating the need to switch between tabs.",
    "Google Meet's PWA runs on any device with version 73 or higher of Chrome installed and is compatible with a wide range of operating systems including Windows, macOS, Chrome OS and Linux.",
    "Users in a corporate or education environment will have to wait for their admins to install the new Google Meet PWA though they can install it themselves if they have the ability to add browser extensions to Chrome.",
    "Admins can also use Google's Help Center to automatically install the PWA for their users or to manage PWA access.",
    "In an effort to encourage Meet users to try out its new PWA, the company will also show a new offer in the upper right-hand corner of the main Google Meet opening page which reads: “Try the Google Meet web app. The Meet web app makes it easier to join your meetings and start your own video calls on your computer.”",
    "The Google Meet PWA is available to all Google Workspace customers as well as G Suite Basic and Business customers and users with personal Google Accounts.",
    "If you're looking for a streamlined video conferencing experience that's easy to find on your computer and launches quickly, then Google's new PWA for Meet is certainly worth checking out."
  ],
  "headers": {
    "3": "Google Meet PWA"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "PWA": "https://www.techradar.com/news/google-starts-ditching-android-apps-in-favor-of-web-apps-on-chrome-os",
    "switch between tabs": "https://www.techradar.com/news/microsoft-edges-latest-feature-could-make-you-ditch-chrome",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "browser extensions": "https://www.techradar.com/news/the-best-google-chrome-extensions",
    "Help Center": "https://support.google.com/chrome/a/answer/9367354#?admin&zippy=%2Cadmin-console",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace"
  }
}