{
  "source": "https://www.techradar.com/news/cheap-airpods-deals-can-save-you-even-more-cash-this-weekend",
  "title": "Cheap AirPods deals can save you even more cash this week",
  "category": "audio-visual",
  "updated": "2021-02-09T15:32:53Z",
  "author": "tabitha-baker",
  "summary": "Cheap AirPods just got cheaper",
  "article": [
    "Cheap AirPods are the dream, and with a new round of discounts in both the US and UK, it's now more of a reality than ever before. Overall, you can save around $30 / £30 on the full price of these second generation AirPods, with the 2019 release offering up some excellent price lows right now. Those discounts run even steeper than usual this week, after several months of the previous sales price.",
    "In the US, that usual $125 sales price has been dropped down to $119.99 at Amazon - a full $40 off the MSRP with an extra little discount over the cost we've been seeing over the past few months.",
    "If you're in the UK you'll be heading to Laptops Direct to scoop up your savings. The second generation AirPods are available there for just £119 - a similar discount of around £5 off the usual sales price and £40 off the RRP.",
    "That's excellent news if you're in the market for some cheap AirPods, as this is the first time we've seen further discounts in 2021 making for some particularly compelling offers. We're rounding up these and more AirPods deals in full just below.",
    "If you're looking for more powerful sound, as well as active noise cancellation, AirPods Pro deals are also looking particularly strong this week with big discounts in both the US and UK.",
    "We're rounding up all the best true wireless earbuds right here on TechRadar, but if you're after more Apple ANC action you can also take a look at the latest AirPods Pro deals as well. Beats headphone deals also pair extremely well with iOS products, so there are plenty of options for over-ear cans as well."
  ],
  "headers": {
    "4": "More AirPods deals"
  },
  "links": {
    "dropped down to $119.99 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07PXGQC1Q%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1070214183019852000-20",
    "available there for just £119": "https://track.webgains.com/click.html?wgcampaignid=138485&wgprogramid=272145&clickref=trd-us-2812522788729857000&wgtarget=https%3A%2F%2Fwww.laptopsdirect.co.uk%2Fapple-airpods-with-charging-case-2nd-generation-mv7n2zm-a%2Fversion.asp",
    "AirPods deals": "https://www.techradar.com/news/cheapest-airpods-prices",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "AirPods Pro deals": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "Beats headphone deals": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753"
  }
}