{
  "source": "https://www.techradar.com/news/facebooks-smart-glasses-arent-as-innovative-as-we-hoped-yet",
  "title": "Facebook’s smart glasses aren’t as innovative as we hoped – yet",
  "category": "wearables",
  "updated": "2021-10-01T15:53:28Z",
  "author": "henry-st-leger",
  "summary": "The way to AR is paved with borrowed ideas",
  "article": [
    "After many months of teases and speculation, Facebook’s range of smart glasses is finally here – and as a Ray-Ban collaboration that packs a built-in camera and portable battery into the lifestyle brand’s classic silhouettes, it has a level of style and prestige far beyond the clunky Google Glass models of years past.",
    "Retailing for $299 / £299 / AU$449, and launching today (September 9), these smart glasses mark Facebook’s latest foray into consumer hardware, and come amid a wave of successes in that area, with the Facebook-owned Oculus becoming the de facto VR headset manufacturer for our times.",
    "It’s notable, firstly, that these smart glasses are called ‘Ray-Ban Stories’ – also a nod to Instagram’s Stories feature, we assume – immediately positioning them as lifestyle products first and wearables second. It’s no surprise, though, that Facebook might want to piggyback the credibility of Ray-Ban rather than rely solely on its own controversial reputation as a data-hungry social media and advertising giant.",
    "There are plenty of us who have been waiting for smart glasses to catch on in the technology world, but there have always been obstacles in the way – ostensibly the indifference of everyday consumers, who largely don’t see the fuss of expensive and awkward peripherals in order to enhance their digital habits.",
    "Smart glasses have long occupied a ‘geeksumer’ position – even if they’re affordable to those with disposable income, they clearly mark their users out as niche technology enthusiasts rather than everyday buyers, and manufacturers generally struggle to make them feel like cool lifestyle products.",
    "But Ray-Ban Stories is well placed to change people’s minds about this. A high asking price aside, these smart glasses are relatively flexible in their usage, being able to push photos and videos easily to various Facebook-owned apps (or be downloaded onto your phone for use elsewhere).",
    "A comfortable fit, intuitive inputs and decent call quality, too, will go a long way towards making the Stories feel like everyday devices rather than oddball gadgets made purely for tech obsessives.",
    "They also benefit from the design stylings of Ray-Ban, and may be able to piggyback into the mainstream through the solid reputation of the beloved and long-running sunglasses brand – especially when taking the variety of styles and even prescription lenses options into account.",
    "We go into more detail in our full Ray-Ban Stories review – but there’s a big problem that needs to be addressed here, and it’s that Snap has pretty much done this already.",
    "In 2016, Snap Inc released its first-ever pair of Spectacles – smart glasses with a pair of built-in cameras and a cutesy, rounded shape that you could buy in vending machines that appeared across the US, before sales kicked off online. The flurry of consumer interest around the Spectacles has all but trickled out since that high point, though, despite three successive releases in 2018 and 2019, and a firm repositioning of Snap as a ‘camera company’ rather than simply a purveyor of social media.",
    "There are some key differences between Ray-Ban Stories and the Spectacles – mostly in the latter’s circular footage and VR recording capability. (As one Snap press release puts it, “The images from both cameras combine to build a geometric map of the world around you. With this new sense of depth perception, you can experience – and reimagine – your memories like never before.”)",
    "But the underlying idea is the same, as a hardware peripheral that turns tinted glasses into a social-ready camera for sharing quick videos – with the ‘Rounded’ Stories design looking almost identical to the original 2016 Spectacles. Battery life is similar, offering around four hours of charge through the USB-C charging case.",
    "When pushed on this point in a briefing, Monisha Perkash – Director of Product Management at Facebook Reality Labs – asserts that “We think Ray-Ban Stories is quite differentiated… We think these will be the first smart glasses that people will want to buy.” And both points may well be true.",
    "We spoke to Snap about the incoming competition from Facebook, and while the company wouldn’t be drawn to comment on the matter directly, it did give some useful insight into who Spectacles are really for these days.",
    "“Specs 1 and 2 were very much seen as consumer devices. Specs 3, while available for sale, was a fashion forward, creator focused product, and Specs 4 is not a consumer product,” we’re told.",
    "There’s been a clear trajectory, from the consumer market Facebook is still targeting, to the influencer and business-oriented gadget that Spectacles has now become. As a Snap blog post back in May states, “Spectacles aren’t for sale — they’re for augmented reality creators to reimagine the way we communicate, live and explore the world together through AR experiences built-in Lens Studio.”",
    "Facebook’s smart glasses, with their mainstream design and basic in-app image/video editing capability, appear to be chasing the market Snap has already given up on.",
    "This isn’t the first time Facebook has… paid close attention to Snapchat’s releases. It’s widely accepted that Facebook mimicked the Snapchat app’s disappearing stories feature for both the Facebook platform itself and Instagram (whose CEO admitted as such).",
    "By all accounts, good ideas get copied all the time – especially in social media – and that stories mechanic has been so popular that even Twitter recently tried (and failed) to introduce its own ‘Fleets’ spin on it.",
    "But it also doesn’t have to be this way. The Facebook-owned Oculus has been a huge innovator in the mixed reality space, leaving competitors like HTC, HP and Vive trailing behind. So it’s a shame that, in the world of smart glasses, Facebook’s new challenger largely redoes the first Spectacles iteration instead of bringing many new ideas to the table.",
    "Zuckerberg previously teased a lot of “neat things” the Ray-Ban Stories would do, but it’s clear that the real potential for these devices is in the long term.",
    "Ray-Ban Stories is just the start for Facebook, especially when it comes to AR, or augmented reality, which would – in a future iteration of these smart glasses – no doubt be able to blend the digital and physical world in a more sci-fi fashion than simply recording camera footage for sharing on your social media feeds.",
    "Giaia Rener, Ray-Ban’s Global Brand Director, says that “we have a multi year partnership with Facebook,” so it’s clear that – as fleshed-out as this launch is – there’s only more to come.",
    "Facebook also tells us that “It’s no secret that we want to build always-available AR glasses – but the technology to deliver true consumer-ready AR glasses is still years-off. Today’s launch is about taking great glasses and style you already know and love and making them *more* useful. We really think people have a lot to gain through a device that offers hands-free capture and listening, and they’ll only get better from here. We hope these are an important step toward normalizing smart glasses and addressing important questions from consumers.”",
    "True AR experiences baked into smart glasses aren’t here yet, then, but we can look to the Oculus Quest 2, which recently gained a firmware update to enable AR developers to start making content for the device – via the ‘passthrough’ camera tech that lets VR users look outside of the headset and see their surroundings.",
    "AR games aren’t flooding the Oculus platform yet, but Facebook is preparing its vast Oculus install base for a time when they are – and it will almost certainly be the same with the Ray-Ban Stories. If these smart glasses gain any traction, Facebook will have an audience used to such devices that it can start pushing AR experiences to.",
    "It’s just a shame that, after having the wherewithal and resources to launch not one, but four iterations of the Spectacles before anyone else, Snap’s innovative ideas could be overwritten by its heavyweight competitor."
  ],
  "headers": {
    "9": "This town ain’t big enough for the both of us",
    "17": "The greatest form of flattery"
  },
  "links": {
    "Google Glass": "https://www.techradar.com/reviews/gadgets/google-glass-1152283/review",
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Ray-Ban Stories review": "https://www.techradar.com/reviews/ray-ban-stories-facebook-smart-glasses",
    "blog post": "https://newsroom.snap.com/en-GB/introducing-the-next-generation-of-spectacles",
    "whose CEO admitted as such": "https://www.businessinsider.com/how-developer-mark-zuckerberg-invented-instagram-stories-copied-snapchat-2020-4?r=US&IR=T",
    "neat things": "https://www.techradar.com/news/facebook-ray-ban-smart-glasses-next"
  }
}