{
  "source": "https://www.techradar.com/news/forget-floc-the-way-forward-is-to-ask-the-customer",
  "title": "Forget FLoC - the way forward is to ask the customer",
  "category": "computing",
  "updated": "2021-09-01T11:14:48Z",
  "author": "tom-bianchi",
  "summary": "The future of customer data",
  "article": [
    "Google’s unveiling of its plans to introduce Federated Learning of Cohorts (FLoC) to replace third-party cookies was received with almost universal aversion. This reaction has – probably in part – led to the decision to defer the introduction until Q3 2022. Cookies are pretty unpopular too, with the constant prompts to opt in or opt out – unless you’re a marketer. For decades, third-party cookies have been the go-to for providing ‘customer insights’, tracking behaviors and actions and delivering user profiles for the marketing world to exploit.",
    "The reticence around FLoC is based on the unknowns in terms of privacy, concerns around the types of behavioral groups that could emerge and the unintended consequences – not to mention the fact that Google will continue to have the information on individual users to leverage for its own advertising purposes.",
    "The debate will rumble on, no doubt something will eventually replace FLoC in turn, and there will be howls of outrage from marketers and advertisers about whatever that is too. But what of the individuals, those billions of people who are having their preferences vacuumed up by cookies and who will soon, if FLoC comes to fruition, be assigned to cohorts based on those preferences. Doesn’t this all seem a bit impersonal – dare we say exploitative?",
    "Customer data is the currency that makes today’s marketing and advertising worlds work. Individuals – us – give away information about ourselves on a daily basis, information that is sucked into the marketing and advertising industry to emerge – ostensibly – as advantageous to us in terms of being served up information that suits our profiles.",
    "In addition to third-party cookies and the forthcoming FLoC, there are also platforms such as Amazon that have huge amounts of information on their users. We’re not entirely sure what happens to that data. Can we opt out of giving away any information? Can we delete the information that is held about us? How accurate is it? With FLoC, will we be able to absent ourselves from cohorts with which we don’t want to be associated?",
    "However cookies or FLoC gather the data, it’s not a transparent process, and the individual in reality has little control. Data obtained from online activities is also only data from a single source, such as a website or mobile app. It doesn’t take into account all the other touchpoints that individuals can have with a brand or a business, such as in-store purchases or calls into customer support centers. But the most conspicuous shortcoming in the way that customer data is gathered is that there is no engagement with the individual. If we are talking about customers as individuals, shouldn’t they be treated as such?",
    "Marketers and advertisers are going to have to change their approach to gathering data, if they want to move away from dependence on cookies, FLoC or whatever the future holds for third-party data. It’s a pretty simple shift in mindset – it requires actually asking the individuals for their information to market and advertise by consent. This is acquiring first-party data, information that is given willingly and transparently by the customer, collected directly from interactions not only from a website but from across all channels where there is contact with a brand or a business.",
    "The point of gaining consent is a critical one. The increase in data theft, or cyber-attacks and security breaches has made people far more wary of who they give their data to, and more interested in how it is used. There needs to be trust established, for people to believe that they are being treated as individuals, and that their data will be carefully and considerately used.",
    "Organizations are learning that there needs to be a direct correlation between their security and privacy strategies and their customer interactions, to give their customers the confidence to hand over their data when asked. Brands need to demonstrate that they can maintain trust while utilizing that data to deliver personalized interactions.",
    "Acquiring customer data should also be a two-way transaction – individuals’ data is hugely valuable, and there needs to be a quid pro quo for the customer. We asked some of our team what they would consider a fair exchange – here are a couple of examples:",
    "“I love when clothing stores know my sizes and they are able to proactively recommend sizing for me if they have clothing items that run large or small. Also, when they keep a record of my past purchases, so that I know what I bought and when it is super helpful!”",
    "“When signing up for a class or training session I’d share information about my background to help establish my own personal starting point for training. I would give up data in the interest of that data serving to save me time and energy in consuming training materials.”",
    "These are just two instances that demonstrate the power of actually interacting with customers as individuals. In both those scenarios, the data could have been gathered via channels other than online – in-store for example in the first case perhaps, on the phone in the second case. Unifying and analyzing all this data on a powerful platform that is owned by the business both engenders trust and gives a 360-degree whole-person view of the individual. This is data gold – it shows who the customers are and what they want, and this can guide a FLoC-free perfectly positioned personalized marketing strategy."
  ],
  "headers": {
    "3": "Customer data and the lack of transparency",
    "7": "Providing value through customer trust"
  },
  "links": {
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools",
    "privacy": "https://www.techradar.com/best/anonymous-browsing",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "marketing": "https://www.techradar.com/best/best-online-marketing-services",
    "website": "https://www.techradar.com/news/the-best-website-builder",
    "mobile app": "https://www.techradar.com/best/best-mobile-app-development-software",
    "security": "https://www.techradar.com/news/best-internet-security-suites"
  }
}