{
  "source": "https://www.techradar.com/news/metroid-prime-4",
  "title": "Metroid Prime 4: everything we know so far",
  "category": "gaming",
  "updated": "2021-07-22T11:49:50Z",
  "author": "emma-boyle",
  "summary": "Samus is coming to Switch...eventually",
  "article": [
    "Nintendo has officially confirmed that the new Metroid Prime 4 game is in development. But it looks like we’ll be waiting a while before it’s released.",
    "Metroid Prime 4 was first announced way back in 2017 for the Nintendo Switch. But the only detail we got about the game was a logo – that was it. There was no developer information, a release date or gameplay footage.",
    "Fast-forward to January 2019, and it was announced that more Metroid Prime 4 news would be a long way off, as Nintendo scrapped the original project and started over with Retro Studios.",
    "Two years after this restart and we were expecting Nintendo’s showcase at E3 2021 to shed some light on Metroid Prime 4, but it didn’t happen. Nintendo did reveal Metroid Dread, the first 2D Metroid entry in the franchise in nearly 20 years, but nothing on Prime 4.",
    "Although we don’t know much about when Metroid Prime 4 will arrive and what to expect, we are excited to see it on the Nintendo Switch. With that in mind, here’s what we know about Metroid Prime 4 on the Switch so far.",
    "We weren't quite sure when Metroid Prime 4 would release but now we know it definitely won't be for a while as Nintendo announced in January 2019 that it had scrapped the project and started again with help from Retro Studios.",
    "We expect the earliest we will see Metroid Prime 4 is 2022, thanks to the studio change and likely delays caused by the Covid-19 pandemic.",
    "It's been four years since Metroid Prime 4 was announced by Nintendo at E3 2017, and we haven't heard anything on the game since a reboot was announced in 2019, so we expect it'll be a few years yet before we get our hands on the new Metroid Prime.",
    "Back at E3 2017, Nintendo released a first-look trailer for Metroid Prime 4.",
    "Check it out below:",
    "E3 2021 Metroid Prime 4 didn't make an appearance at Nintendo's E3 2021 showcase, however, there was some Metroid news. Nintendo announced its first new 2D Metroid entry in the franchise in close to 20 years called Metroid Dread.",
    "The game will be available on Nintendo Switch on October 8, 2021 and looks similar to Metroid: Samus Returns on the Nintendo 3DS that came out in 2017.",
    "High-profile developers jump onboard With Retro Studios now running development, Metroid Prime 4 has got some fresh, big-name talent behind it, with the studio signing on some fresh talent. Jhony Ljungstedt, the former art director at studio DICE is joining the team, having previously worked on Battlefield 5, Medal of Honor (the 2010 reboot), and Mirror's Edge: Catalyst. He's being joined by Kyle Helfey (Halo character designer) and Stephen Dupree, who returns to Retro Studios having previously been the lead designer on Donkey Kong Country: Tropical Freeze.",
    "Retro Studios is hiring for Metroid Prime 4 It was something of a shock when Nintendo announced that it would be starting from scratch on the development of Metroid Prime 4 with Retro Studios. The latest news from this new phase in the game's development is that Retro Studios is now hiring and looking to increase numbers on its development team. The roles are wide-ranging and all are based at the studio in Austin, Texas.",
    "These advertisements suggest that the game is still in the early stages of development so it could be some time before we get any more solid updates on its progress. If you're a world-class developer and a fan of Metroid, though, this could be your big break!",
    "Nintendo scrap Metroid Prime 4 and start again In a shock announcement back in January 2019, Nintendo revealed in a development update video that it scrapped the current project as it wasn't happy with the current progress. However, Nintendo still plans to reboot the project with help from original creators Retro Studios.",
    "“This change will essentially mean restarting development from the beginning, so completion of the game will be delayed from our initial internal plan,” Nintendo's senior managing executive officer Shinya Takahashi explains in the update video. “We strongly recognise that this delay will come as a dissapointment to the many fans who have been looking forward to the launch of Metroid Prime 4.”",
    "You can watch the development update from Nintendo below:",
    "The story There’s so little Metroid Prime 4 information out there that piecing together the story is nigh impossible. What we will say is that Metroid Prime 3’s ending didn’t strike us as open enough for any kind of direct continuation. Though Samus’ went into hyperspace, giving the opportunity for a sequel to enter a new world or galaxy, we’d say the core story of the original trilogy is now closed.",
    "Back in 2015, Eurogamer interviewed series producer, Kensuke Tanabe, who stated that “the stories of Dark Samus and Phazon are done” adding that any new games in the series would focus on other Prime-series elements.",
    "Gameplay One thing we can be fairly confident in is that, like other Prime games, Metroid Prime 4 is likely to be a first person shooter. Other than that we can’t say what kind of gameplay changes will arise from either the new developer, or the new Switch platform.",
    "Coming in as a fresh start, there’s actually plenty of room for Metroid Prime 4 to innovate. Given The Legend of Zelda and Super Mario franchises have embraced more open worlds, we wonder if this is something that Nintendo will want to bring into the Prime series, too.",
    "It’s like that, like other Switch games, there will be optional motion controls with the Joy-Cons - we’re imagining aiming, firing, an environment scanning, for example.",
    "A more open world As we said above, this is a new start for Metroid Prime which means room for changes. Though we’re worried it could be a case of ‘be careful what you wish for’ we’d be interested to see the Metroid Prime games follow in the footsteps of Zelda and Mario to embrace a more open-world format.",
    "The first three titles were already pretty big, but the Switch offers more scope. We think the Super Mario Odyssey approach of large interconnected worlds could translate well. The Metroid series is replete with interesting environments we’d love the chance to see more of and the Switch is the console that has enough power to make that possible.",
    "Be accessible Just as a new start is a chance for innovation, it's also a chance to welcome a new generation of Metroid fans. It's the same with any series that goes on for a long time - there's a certain amount of assumed knowledge and lore that makes coming in as a new player feel more like a chore than a joy.",
    "We'd love to see Metroid Prime 4 take a Monster Hunter: World approach by retaining what makes it great while giving new players a way in.",
    "New weapons and abilities The Metroid series has some seriously cool weapons and abilities for Samus’s armor and we’d like to see more of them. By all means, bring back the classics but bringing a couple of exciting new upgrades to the table will make us feel like we’re truly progressing in the game as well as the franchise as a whole.",
    "Make it feel like a true Switch game With its motion controls and HD Rumble, the Switch has more than its portability to help its games stand out. We'd love to see Metroid Prime 4 make the most of them, though perhaps more of the HD Rumble and less of the motion control.",
    "Motion control could create some fun and interesting shooting and environment scanning opportunities, but integrating HD Rumble into puzzle solving or integrating it into combat situations to act as an enemy alert would be interesting.",
    "Bring in Sylux Back in 2015, producer Kensuke Tanabe said that the ship at the end of Metroid Prime 3 actually contained Sylux, a Hunter from Metroid Prime: Hunters.",
    "Tanabe said that he'd like to create a Metroid game which featured both Sylux and Samus and explored their dynamic, something which we'd also like to see happen; the characters have an unexplored and potentially interesting history. It's known that Sylux isn't the biggest fan for Samus or the Federation, yet he uses a Federation weapon. That alone has us thinking he'd make an engaging villain for a new title.",
    "(Image credits: Nintendo)"
  ],
  "headers": {
    "5": "Metroid Prime 4: cut to the chase"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Metroid Dread": "https://www.techradar.com/news/its-not-metroid-prime-4-but-metroid-dread-is-the-first-new-2d-entry-in-20-years",
    "Eurogamer": "http://www.eurogamer.net/articles/2015-06-17-next-proper-metroid-prime-would-likely-now-be-on-nx",
    "said": "http://www.eurogamer.net/articles/2015-06-17-next-proper-metroid-prime-would-likely-now-be-on-nx"
  }
}