{
  "source": "https://www.techradar.com/news/nra-refuses-to-confirm-reports-of-ransomware-hack",
  "title": "NRA refuses to confirm reports of ransomware hack",
  "category": "computing",
  "updated": "2021-10-28T15:03:45Z",
  "author": "mayank-sharma",
  "summary": "Group behind NRA ransomware attack had already been sanctioned by US",
  "article": [
    "The National Rifle Association (NRA) has released a statement saying that it is against its policy to discuss matters of security, a day after a ransomware gang claimed to have attacked the organization.",
    "Brett Callow, threat analyst with Emisoft, makers of a popular anti-malware solution that can thwart such attacks, was one of the first to have caught that the Grief ransomware had listed the NRA as its victim. Grief reportedly has ties to the notorious Evil Corp cybercrime syndicate.",
    "“NRA does not discuss matters relating to its physical or electronic security. However, the NRA takes extraordinary measures to protect information regarding its members, donors, and operations – and is vigilant in doing so,” Andrew Arulanandam, MD, NRA Public Affairs said via a statement shared on Twitter.",
    "According to cybersecurity researchers, Grief, like many ransomware operators posted a handful of files that it had exfiltrated from the NRA, as part of its double-extortion shenanigans, in order to back their claim that they had indeed penetrated the organization.",
    "ZDNet claims that an analysis of these documents reveal some to be minutes from a recent NRA board meeting, while others are related to grants, including a list of recent grant recipients.",
    "Grief has threatened to leak more files if the NRA did not pay the undisclosed ransom.",
    "Although paying a ransomware operator is a tricky prospect, it’s even trickier in the case of Grief. If the NRA does indeed decide to pony up, it will have to jump through a few more hoops since Evil Corp has been sanctioned by the US Treasury Department since 2019, meaning that any engagement and payments will have to seek the department’s nod.",
    "Paul Bischoff, privacy advocate at Comparitech, told ZDNet, that it is up to the individual NRA members to protect themselves from any repercussions that might arise as a result of this breach with the help of services such as identity theft protection.",
    "\"A gun won't help. Even if the NRA pays the ransom, there is no guarantee that Grief will destroy the stolen data,\" warned Bischoff."
  ],
  "headers": {
    "4": "Keyboard to a gunfight"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Emisoft": "https://www.techradar.com/reviews/emsisoft-anti-malware",
    "anti-malware solution": "https://www.techradar.com/best/best-malware-removal",
    "caught": "https://twitter.com/BrettCallow/status/1453391567163559941",
    "Evil Corp": "https://www.techradar.com/news/russian-ransomware-group-reportedly-behind-olympus-attack",
    "statement": "https://twitter.com/NRA/status/1453453542170284042",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "ZDNet claims": "https://www.zdnet.com/article/nra-responds-to-reports-of-grief-ransomware-attack/",
    "Evil Corp has been sanctioned": "https://home.treasury.gov/news/press-releases/sm845",
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}