{
  "source": "https://www.techradar.com/news/tweet-in-4k-twitter-update-adds-high-res-photos-for-ios-android",
  "title": "Tweet in 4K: Twitter update adds high-res photos for iOS, Android",
  "category": "phones",
  "updated": "2021-04-21T21:53:21Z",
  "author": "david-lumb",
  "summary": "Twitter photo size limit finally increases in 2021",
  "article": [
    "After a short testing period, Twitter's iOS and Android app now allows users to upload and view 4K images, according to an official company statement. This lets everyone tweet images in the higher resolutions that their phones’ fancy cameras are capable of shooting.",
    "Twitter initially allowed select users to try this out in March, but now it’s open to all users of its Android and iOS apps as of today. You’ll have to change your preferences to upload photos in 4K – head to Settings and Privacy > Data Usage > High-Quality Image Uploads and select whether to allow photos up to 4K to be uploaded using your mobile data or just over Wi-Fi.",
    "Not every phone camera can take 4K photos, but most can: broadly speaking, cameras above 10MP take photos in 4K or greater resolution, and even the iPhone 12 line’s suite of main, ultra-wide, and telephoto cameras are all 12MP. Users will have to make sure their phone cameras are taking the highest-quality 4K-and-higher-resolution photos, though, which can be toggled either in the camera app’s settings or nested in the phone’s settings app, as in iOS (Settings > Camera > Formats > High Efficiency).",
    "The other side of the update now allows Twitter mobile app users to view 4K photos on their phones – but given how few smartphones actually have displays with resolutions reaching 4K, you probably won’t be able to see the photos at that sharpness on your device.",
    "Most phones released today have Full HD displays (1920 x 1080, though that first number might be greater if the phone is taller), which are a quarter of the resolution of 4K (3840 x 2160) screens. Even flagship phones like the Samsung Galaxy S21 Ultra 5G have taller versions of Quad HD (2560 x 1440) resolution screens, while Apple’s phones have their own oddball resolutions somewhere between Full HD and QHD (iPhone 12: 2532 x 1170) – but all are below the 4K threshold, and won’t be able to see 4K photos in their full glory.",
    "Only a few phones sold today have 4K displays, and include the Sony Xperia 1 II. That doesn’t make Twitter’s new mobile app feature useless, of course – you’ll still be able to upload 4K photos for all your fans on computers at home, but they’ll need to have their own 4K-and-fancier displays to see them in full resolution."
  ],
  "headers": {
    "3": "You can tweet 4K, but on mobile, you can’t see 4K"
  },
  "links": {
    "company statement": "https://twitter.com/TwitterSupport/status/1384945690304995330",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review"
  }
}