{
  "source": "https://www.techradar.com/news/new-the-sims-4-content-sounds-great-but-i-just-want-the-sims-5-already",
  "title": "New The Sims 4 content sounds great, but I just want The Sims 5 already",
  "category": "gaming",
  "updated": "2021-08-11T12:12:26Z",
  "author": "vic-hood",
  "summary": "Opinion: It's about time for a change",
  "article": [
    "With the recent release of The Sims 4: Cottage Living expansion pack, Sims fans are understandably wondering what's next on the cards for the world's most popular life sim series.",
    "And while EA Maxis hasn't revealed exactly what The Sims 4 roadmap will look like, the developer stated in a recent blog post that it continues to focus on \"improving content that is in the game\".",
    "It's welcome news for Simmers, with EA Maxis being coy about whether we'll see vampires, faeries and werewolves (which we have seen in previous series entries) making their way to The Sims 4 in the future. But I can't help but be somewhat disappointed by the news, because I just want to get my hands on The Sims 5.",
    "I am under no illusion that The Sims 5 will release anytime soon. After all, while EA has teased that the \"next generation\" of the Sims franchise is in the works, the developer hasn't actually confirmed that this next-gen Sims will be 'The Sims 5'.",
    "Speaking during an earnings call last year, when asked about whether the company has plans to relaunch an online version of The Sims (similar to The Sims Online), EA CEO Andrew Wilson said the following (via Sims Community):",
    "\"As Maxis continues to think about The Sims for a new generation – cross-platforms and a cloud of a neighborhood world, you should imagine while we will always stay true to our inspiration, escape, creation, self-improvement, motivations – that this notion of social interactions and competition like the kind of things that were actually present in The Sims Online many many years ago – that they will start to become a part of The Sims experience in the years to come.\"",
    "It's enough to get excited about, even if it doesn't reveal a whole lot. It sounds like this next The Sims entry will have a focus on social and online experiences, potentially even working in some elements from The Sims Online (RIP). But, since then, EA has remained tight-lipped about this next-gen Sims and it seems that - at the time when Wilson revealed this - The Sims 5 was still pretty much in the conceptual phase.",
    "Unfortunately, it means it's still early days for The Sims 5 and we would be lucky to get our hands on it before 2023 - after all, The Sims 4 was in development for over three years (though when development started exactly isn't clear). So, it makes sense then that EA Maxis is continuing to maintain The Sims 4 in the meantime and wants to continue to improve the game for those who have already spent their hard-earned cash on the base game, kits, game packs and expansions - especially given how important The Sims community is to the game.",
    "While I appreciate EA Maxis' continued effort to keep The Sims 4 thriving, I still just want to get my grubby mitts on The Sims 5. Released seven years ago, The Sims 4 is currently the longest-running game in The Sims series and, as the years have gone on, I've grown increasingly bored of it, despite the release of new content.",
    "I want a new The Sims game that takes advantage of the latest gaming hardware (while still being a game that pretty much everyone can run), pushes the series to its limits and has me awestruck. I remember the day when the Sims 4 was released, I dragged my mother's computer up to my bedroom and set it up on my vanity table, where I was ultimately glued for days on end.",
    "But it's not even the boredom of The Sims 4 that has me clamoring for The Sims 5: it's the sheer possibilities. Imagine more realistic-looking Sims, with more defined details, faster loading times as you travel between lots, a larger and more limitless world to enjoy - maybe even an entire open-world to explore? How about the ability to actually drive yourself to locations? Or to create your own recipes? Or to follow your Sim children to school? All without mods.",
    "Sure, a lot of this wouldn't necessarily be in The Sims 5 but it's the possibility that makes a next-gen The Sims so exciting for Simmers like me.",
    "What it does sound like The Sims 5 will focus on, though, is social interaction and competition. It's something EA Maxis may have initially planned for The Sims 4. According to a report by SimsVIP, The Sims 4 reportedly began as an online, multiplayer game (codenamed 'The Sims Olympus'), before development shifted to make the title a single-player game.",
    "If this is the case, it's no surprise. EA Maxis hasn't had a great history with Sims online. Online-only SimCity suffered major issues and backlash following its launch in 2013, while the infamous The Sims Online was shut down in 2008 (just six years after release) following poor sales and criticism.",
    "It sounds like EA Maxis may be considering giving online another shot, but the form this would take remains to be seen. We could see a standalone online mode developed to sit alongside The Sims 4 (a bit like GTA Online) or a game almost akin to Second Life (without the depravity) - though the latter may be too much of a shakeup for the community. The outcome I hope for is the ability to finally visit real-life friends within The Sims world.",
    "Regardless of how EA Maxis chooses to approach The Sims 5, it's likely its previous failures will be looming large. So, while I would like to get my hands on the next generation of The Sims sometime soon, if waiting a few years means I'll get a well-polished game with online elements that actually work, then I'll happily kick my feet up and pass the time in Lani St. Taz."
  ],
  "headers": {
    "3": "Next-gen Sims",
    "8": "A lot of potential",
    "12": "Resurrecting The Sims Online"
  },
  "links": {
    "blog post": "https://www.ea.com/games/the-sims/the-sims-4/news/sims-411-recap-aug-03-2021",
    "The Sims 5": "https://www.techradar.com/news/the-sims-5-news-multiplayer-rumors-and-everything-we-know",
    "Sims Community": "https://simscommunity.info/2020/01/31/eas-ceo-confirms-a-next-generation-sims-game-might-have-both-single-player-and-multiplayer/",
    "SimsVIP": "https://simsvip.com/2021/01/30/the-blue-plumbob-inside-the-troubled-development-of-the-sims-4/#:~:text=In%202013%2C%20just%20over%20a,More%20on%20that%20below."
  }
}