{
  "source": "https://www.techradar.com/news/fujifilm-gfx100s-could-be-getting-an-even-more-affordable-sibling",
  "title": "Fujifilm GFX100S could be getting an even more affordable sibling",
  "category": "cameras",
  "updated": "2021-03-17T12:09:27Z",
  "author": "mark-wilson",
  "summary": "Surprise rumors point to another GFX medium format camera",
  "article": [
    "The Fujifilm GFX100S won't be the only GFX medium format camera that Fuji releases this year, according to the latest rumors – with an even more \"affordable\" sibling apparently in the works.",
    "The GFX series, which has been around since 2017, is Fujifilm's range of cameras with medium format sensors – these are even larger than the full-frame chips seen in the likes of the Sony A1 and offer unrivalled dynamic range and low light performance for professionals.",
    "The series' most recent addition is the impressively small and (relatively) low-priced Fujifilm GFX100S, which was announced in January. But according to the \"trusted sources\" of the reliable Fuji Rumors, \"Fujifilm will launch another GFX camera in 2021\" and, impressively, \"it will be more affordable than the recently launched Fujifilm GFX100S\".",
    "Of course, the GFX100S is by no means a cheap camera – it costs $5,999 / £5,499 / AU$9,499, which is a lot of money even for professionals. But it is also the first time that a 102MP medium format camera has been anywhere near that ballpark.",
    "And it seems that Fujifilm is looking to push the price of its series further downwards in order to help it appeal to buyers who might be considering the best full-frame cameras instead.",
    "So how exactly might Fujifilm manage to do this so soon after the Fujifilm GFX100S? The rumors so far don't contain any details, but the most likely scenario is a successor to the Fujifilm GFX 50R, which remains the cheapest GFX camera you can buy. (Update 17/3: It looks like our hunches about a Fujifilm GFX 50R were off the mark – with rumors now pointing towards a Fujifilm GFX50S MK II.)",
    "We were big fans of the Fujifilm GFX 50R when it launched in 2019, stating in our review that it \"combines so much of what we love about Fujifilm's more established X-series with a sensor that's capable of superb image quality\".",
    "But the trend in Fujifilm's GFX series appears to be a move towards the higher 102MP sensor seen in the GFX100S – that camera replaced the Fujifilm GFX 50S, which had the same 50.4MP sensor and processor as the GFX 50R.",
    "While this is just speculation right now, the new rumors point towards the launch of a Fujifilm GFX100R, which could combine the 102MP sensor with the 'rangefinder' design that many photographers loved on the GFX 50R.",
    "This includes a viewfinder mounted in the top-left corner of the camera, rather than in the center, and a body that's light enough for one-handed operation with a small prime lens like the GF 63mm f/2.8 R WR or GF 45mm f/2.8 R WR.",
    "The big question is whether or not Fujifilm would be able to squeeze in the in-body image stabilization (IBIS) system seen on the GFX100S in a smaller body, while making the price even more \"affordable\".",
    "It sounds like we might find out relatively soon, with Fuji Rumors saying we should expect updates \"very soon\" – although the site has dismissed rumors that a new teaser from Fuji India is for the rumored new member of the GFX family."
  ],
  "headers": {
    "6": "Hitting the range"
  },
  "links": {
    "Fujifilm GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Fuji Rumors": "https://www.fujirumors.com/breaking-one-more-fujifilm-gfx-camera-coming-2021-more-affordable-than-gfx100s/",
    "best full-frame cameras": "https://www.techradar.com/news/best-full-frame-camera",
    "Fujifilm GFX 50R": "https://www.techradar.com/reviews/fujifilm-gfx-50r-review",
    "Fujifilm GFX50S MK II": "https://www.techradar.com/news/fujifilm-gfx50s-mk-ii-tipped-to-be-its-new-affordable-medium-format-camera"
  }
}