{
  "source": "https://www.techradar.com/news/linus-torvalds-slams-intel-policies-on-this-key-piece-of-tech",
  "title": "Linus Torvalds slams Intel policies on this key piece of tech",
  "category": "computing",
  "updated": "2021-01-04T11:28:17Z",
  "author": "mayank-sharma",
  "summary": "Criticizes Intel for misleading users",
  "article": [
    "Linus Torvalds, the principal developer of the Linux kernel, has blasted Intel for undermining error-correcting code (ECC) memory.",
    "In a forum discussion concerning AMD's Ryzen 9 5000 series processor, Torvalds spoke up after another poster dismissed the importance of ECC.",
    "“ECC absolutely matters. ECC availability matters a lot - exactly because Intel has been instrumental in killing the whole ECC industry with it's horribly bad market segmentation,\" Torvalds said, going on to call the semiconductor giant’s policies with respect to ECC as “bad and misguided”, which he believes have been “detrimental to the whole industry.”",
    "Torvalds admits that this isn’t the first time he’s called out Intel’s role in stifling ECC. He believes the arguments put forth against the use of ECC “were always complete and utter garbage.” In typical Torvalds style, he blamed Intel for “killing” the ECC DRAM market and instead sold unreliable hardware to unsuspecting consumers.",
    "“The \"modern DRAM is so reliable that it doesn't need ECC\" was always a bedtime story for children that had been dropped on their heads a bit too many times,” he continues, blaming Intel's ECC policies for decades of odd random kernel errors that he believes were likely caused due to bad memory.",
    "At the same time, Torvalds lauded AMD for their continued support for ECC. In fact, according to reports, Torvalds recently switched to an AMD Ryzen Threadripper-based desktop after over 15 years of using Intel.",
    "Via: Phoronix"
  ],
  "headers": {
    "3": "Spinning tales"
  },
  "links": {
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Phoronix": "https://www.phoronix.com/scan.php?page=news_item&px=Linus-Torvalds-ECC"
  }
}