{
  "source": "https://www.techradar.com/news/the-crash-bandicoot-mobile-game-isnt-just-a-temple-run-clone",
  "title": "The Crash Bandicoot mobile game isn't just a Temple Run clone",
  "category": "phones",
  "updated": "2021-03-23T14:00:39Z",
  "author": "tom-bedford",
  "summary": "Could it be a crash hit?",
  "article": [
    "One of the most anticipated mobile games of 2021 is almost here: Crash Bandicoot: On The Run launches on March 25.",
    "The new mobile Crash Bandicoot game, based on the popular series of console games, is an endless runner, like the classic Temple Run and many similar titles; when first announced we didn't know much more than that, but many details have since emerged.",
    "It's now clear that Crash Bandicoot: On The Run has a few key upgrades on its genre stalwart, and they should make the game a new experience, one that might appeal to fans of the genre and the franchise. We'll run you through some of the main features now.",
    "When you're not running, you're building, as Crash Bandicoot: On The Run has a meta-game that involves building a base on an island.",
    "To do this, you use resources and currencies collected while playing the main game, and there are various different buildings you can construct.",
    "It's not totally clear right now what the point of base building is, but it'll likely provide in-game benefits that help you do better on your runs.",
    "A popular gaming trend Crash Bandicoot: On The Run makes use of is seasons - no, we're not talking about winter, spring, summer and autumn, but different 'content waves' so to speak, where different items are available.",
    "Lots of different cosmetics are available for the in-game characters, so you can pick from different skins inspired by the franchise, and with each season more will become available.",
    "Each skin provides in-game bonuses too, so you might find yourself making use of a big variety of them.",
    "Despite being called 'On The Run', in the Crash Bandicoot mobile game, running isn't the only thing you'll be doing - there are also boss fights.",
    "Bosses are inspired by villains from the Crash Bandicoot franchise - not just the main-series games, but the spin-offs too, so fans of the smaller titles should see characters from them as well.",
    "It's not exactly clear how you'll be fighting the bosses just yet, and that's something we still need to find out. Maybe running plays a part.",
    "As well as standard levels, Crash Bandicoot: On The Run is set to have various challenge modes. These include time trials and daily challenge runs.",
    "One of the most intriguing-sounding is survival runs, where you race through randomly-generated levels with other players - this seems like one of the big uses of the game's multiplayer aspects.",
    "Survival runs sound like the mode you boot up when you've mastered the game's other offerings, as a way to truly test yourself against all the other top-tier players, and show off all the skins you've earned.",
    "Another multiplayer component of the game is teams, as you can set up groups with your real-life friends to work together to earn rewards.",
    "There's even an in-app chat, so you can communicate with other people you're playing with, though it seems this will only work for your friends, and not other random players online.",
    "This game chat function should elevate the game from a fun title you boot up when you're bored or on your commute, to something you consciously jump into for various reasons."
  ],
  "headers": {
    "3": "Base building",
    "6": "Different seasons",
    "9": "There are bosses",
    "12": "Challenge modes",
    "15": "In-game teams and chatting"
  },
  "links": {}
}