{
  "source": "https://www.techradar.com/news/oneplus-nord-se",
  "title": "OnePlus Nord SE release date, price, news and leaks",
  "category": "phones",
  "updated": "2021-05-04T14:53:42Z",
  "author": "tom-bedford",
  "summary": "The next OnePlus Nord phone",
  "article": [
    "There was a brief run of months in 2020 where the OnePlus Nord SE seemed like the next affordable smartphone coming from the Chinese tech company. Evidently, that didn't happen.",
    "Instead we got the OnePlus Nord N10 5G and Nord N100, which are both affordable takes on 2020's original OnePlus Nord. Rumors are mounting the OnePlus Nord 2 is on its way, especially in the wake of the premium OnePlus 9, so it seems a bad time for a low-budget version of the older phone.",
    "So it's starting to look likely that reports of the OnePlus Nord SE were all just hot air. The last we heard of the OnePlus Nord SE was in December 2020 though, and that was a rumor suggesting it wasn't actually coming at all, making the existence of the phone dubious. Maybe it will Nord come out after all.",
    "OnePlus has spent the last few years giving us more top-end offerings, so the new Nord line is an intriguing change of pace for the company, and we're still holding out hope we see a OnePlus Nord SE in 2021. Maybe the OnePlus 9 Pro won't end up being the best OnePlus phone of next year.",
    "We've collected all the leaks and rumors of the phone below, as well as a brief wish-list.",
    "The main OnePlus Nord SE leak we've heard points to the phone coming out in the 'first quarter' of 2021, so January to March, though it also says the phone will come alongside the OnePlus 9. That's a little earlier than we were expecting OnePlus' flagship to come.",
    "Still, this is a pretty broad leak for now, so we'll have to wait until next year to get a better picture of when the phone will cost.",
    "So what about price? The OnePlus Nord cost £379 / €399 (around $480, AU$680), so we'd expect the SE to be cheaper, probably more so than the Nord N10 5G too, which cost £329 (around $430 / AU$595). It's worth pointing out the Nord didn't come to the US, and the N10 5G is said to at some point but hasn't been launched there yet. So a US release isn't guaranteed.",
    "The Nord N100 costs £179 in the UK (which converts to about $230, AU$330), again with a US release mooted but not confirmed, but we'd expect the Nord SE to cost a little more than that.",
    "We heard loads of OnePlus Nord Lite rumors, but they all turned out to be about the N10 5G and N100 - it doesn't seem the OnePlus Nord SE was mentioned by any of them. That leaves just one leak that's explicitly about the upcoming phone.",
    "The big leak details a few points of the OnePlus Nord SE. Apparently, it will have 65W fast charging, a 4,500mAh battery and an AMOLED screen. Does that make the phone sound suspiciously like the Realme 7 Pro, which has all those specs, and comes from Realme which is owned by the same company as OnePlus? Yes, it does.",
    "Here's what we want to see from the OnePlus Nord SE, which was originally our OnePlus Nord Lite wish-list until we found that wasn't the name of the phone.",
    "With a starting price of £379 (around $480, AU$680) the OnePlus Nord is already fairly affordable, but that's undoubtedly a mid-range price. For the OnePlus Nord SE we want the price to be significantly lower still, so it can compete with the likes of the Moto G range.",
    "OnePlus has always been about the experience as much as raw specifications. So to keep up the feeling of smoothness that the brand's phones are known for, we hope that the OnePlus Nord SE has a 90Hz display, even if that means switching to an LCD panel.",
    "When it comes to cameras, the Nord has a whole lot of competition. From the simplicity of the Google Pixel 4a's capable single-lens snapper to the high-resolution quad-camera setups from brands like Redmi and Realme, there are a lot of affordable options for photography fans.",
    "So for the OnePlus Nord SE, we hope the camera experience isn't diluted too much from the full fat Nord. If OnePlus can deliver lots of cameras at a low price on the Nord Lite, then it could have a seriously tempting phone on its hands.",
    "All currently available OnePlus phones charge fast and we don't want that to change for the OnePlus Nord SE.",
    "There's evidence the SE could have 65W charging which would be absolutely great, but let's wait to see first.",
    "The OnePlus Nord is only available in select parts of the world, and notably isn't available in the US or Australia. For the OnePlus Nord SE we'd like to see wider availability, with those regions covered as well as the UK - so buyers there have a choice of which Nord to opt for."
  ],
  "headers": {
    "5": "OnePlus Nord SE release date and price",
    "9": "Leaks and rumors",
    "11": "OnePlus Nord SE: what we want to see",
    "12": "1. A super low starting price",
    "13": "2. A high refresh rate display",
    "14": "3. Versatile cameras",
    "16": "4. Fast charging",
    "18": "5. Wide availability"
  },
  "links": {
    "OnePlus Nord N10 5G": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "that was a rumor suggesting it wasn't actually coming at all": "https://www.techradar.com/news/oneplus-nord-se-apparently-isnt-a-new-cheap-phone-after-all",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "best OnePlus phone": "https://www.techradar.com/news/best-oneplus-phones",
    "OnePlus Nord SE leak": "https://www.techradar.com/news/oneplus-nord-se-with-65w-charging",
    "details a few points of the OnePlus Nord SE": "https://www.techradar.com/news/oneplus-nord-se-with-65w-charging",
    "Realme 7 Pro": "https://www.techradar.com/reviews/realme-7-pro-review",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a"
  }
}