{
  "source": "https://www.techradar.com/news/whats-the-release-date-for-windows-11",
  "title": "What’s the release date for Windows 11?",
  "category": "computing",
  "updated": "2021-06-25T11:55:37Z",
  "author": "darren-allan",
  "summary": "Windows 11 is coming this holiday season – but not to everyone straightaway",
  "article": [
    "Windows 11 has just been revealed with a whole load of changes, and of course a fresh new look – although we’d already seen it courtesy of that leaked build – so if you’re excited about all this, you’ll doubtless be keen to know when you might get hold of the revamped operating system.",
    "At the big launch, Microsoft let us know that Windows 11 will emerge later this year as a free upgrade for Windows 10 users, and it will be out for the holiday season, which would seem to indicate a December (or possibly late November) launch.",
    "However, it’s not quite as simple as December arriving and Windows 11 being available to download. The new operating system will only begin its rollout late in 2021, and this will be a phased process where Microsoft offers Windows 11 to only a relatively small number of PCs to begin with, then revs up the deployment of the OS gradually.",
    "The rollout will continue into 2022 as Microsoft monitors how Windows 11 is received by various different hardware configurations to make sure no major problems are encountered (and to fix these, or smooth over any minor gremlins, as the upgrade process continues).",
    "As Microsoft explains: “Upgrades to Windows 11 will begin to roll out late in 2021 and continue into 2022. During this time, we will be doing some behind-the-scenes testing and validating for your specific PC. Windows Update will provide an indication if and when your PC is eligible. You can check by going to Settings/Windows Update.”",
    "Note the ‘if’ there: remember that your machine has to meet the minimum requirements for Windows 11, and as we’ve seen, there are some potentially thorny implications therein.",
    "At any rate, the long and short of it is that you may need to be one of the luckier folks to get Windows 11 off the bat in November or likely December 2021, with the majority of Windows 10 users getting the nod to upgrade as the rollout continues into early 2022 and onwards.",
    "This is the exact same approach that Microsoft uses with its big feature updates for Windows 10 which happen twice yearly (incidentally, we now know that Windows 11 will be different in that it’ll adopt a once-per-year cadence for feature updates, just as Apple does with macOS).",
    "Typically, it can take a good three or four months for a Windows 10 update to really hit its stride in terms of being adopted widely, so we can tentatively anticipate a similar situation with Windows 11. Although hopefully Microsoft will be aiming for something swifter given that this is a new version of Windows that many folks will be keen to get. It’ll all likely depend on how well the rollout goes to begin with, naturally…",
    "If you’re wondering if your PC will be eligible for the free upgrade to Windows 11, Microsoft has a tool to check your system and inform you – but note there are issues around it being potentially buggy as we discuss at length here.",
    "Further remember that if you can’t wait until Windows 11 is finally released, you could always enroll as a tester and give early builds a spin – official ones, rather than the leaked build which is already out there – as Microsoft has said it will release the first preview version of the OS next week. Obviously bear in mind that early versions of Windows 11 will have bugs and stuff that doesn’t work, as the whole point is you provide feedback on such issues so they can be fixed."
  ],
  "headers": {
    "7": "Once is enough"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "free upgrade for Windows 10 users": "https://www.techradar.com/news/windows-11-is-a-free-upgrade-but-could-prove-a-pain-in-the-neck-rather-than-wallet",
    "minimum requirements for Windows 11": "https://www.techradar.com/news/windows-11-system-requirements-are-bad-news-for-old-laptops-and-pcs",
    "some potentially thorny implications therein": "https://www.techradar.com/news/windows-11-is-a-free-upgrade-but-could-prove-a-pain-in-the-neck-rather-than-wallet",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "potentially buggy as we discuss at length here": "https://www.techradar.com/news/tpm-20-windows-11-pc-health-check-and-the-potential-messy-upgrade",
    "give early builds a spin": "https://www.techradar.com/news/how-to-download-windows-11"
  }
}