{
  "source": "https://www.techradar.com/news/ces-2021-asus-reveals-the-perfect-ps5-and-xbox-series-x-monitor-and-its-out-soon",
  "title": "CES 2021: Asus reveals the perfect PS5 and Xbox Series X monitor, and it's out soon",
  "category": "gaming",
  "updated": "2021-01-13T12:01:43Z",
  "author": "adam-vjestica",
  "summary": "No price was revealed, though",
  "article": [
    "Asus has announced an impressive HDMI 2.1 monitor at CES 2021 that sounds perfect for PS5, Xbox Series X and Xbox Series S, but the company has yet to reveal how much it will cost.",
    "The Asus ROG Swift PG32UG, which is due to release by the end of March, is equipped with two HDMI 2.1 ports, so you can play PS5 and Xbox Series X games at 4K at 120hz, if they support it. It also features a 32-inch IPS panel, which hopefully means it’ll have great viewing angles, impressive color accuracy and a pleasing contrast ratio.",
    "The Asus ROG Swift also supports G-Sync compatibility via FreeSync. While PS5 can't take advantage of variable refresh rates just yet, the Xbox Series X and Xbox Series S do support it, which helps to eliminate screen tearing and judder.",
    "Slightly less impressive is the monitor's HDR support. It's only DisplayHDR 600 which, while welcome, won't give you the impressive specular highlights that today's best HDR TVs can offer.",
    "Of course, being a gaming monitor, the Asus ROG Swift PG32UG is also primed for PC gaming. It's armed with a DisplayPort 1.4, and is capable of 144Hz refresh rate if your graphics card can handle it.",
    "Both the PS5 and Xbox Series X support 4K resolution at 120hz, but you can only access these capabilities if you have a device that supports HDMI 2.1. As it stands, you'll need to invest in a TV like the LG CX if you want to get 4K at 120hz, and that doesn’t come cheap.",
    "Monitors can often provide a cheaper entry-point for gamers, and are also more suitable for those where space is at a premium. The lack of HDMI 2.1 monitors should hopefully become a thing of the past in 2021, as more capable displays come to market that support all of the new consoles next-gen features."
  ],
  "headers": {
    "5": "Why does HDMI 2.1 matter?"
  },
  "links": {
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Asus ROG Swift PG32UG": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5375634693314579000&xs=1&url=https%3A%2F%2Frog.asus.com%2Farticles%2Fgaming-monitors%2Frog-swift-pg32uq-gaming-monitor-ces-2021%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fces-2021-asus-reveals-the-perfect-ps5-and-xbox-series-x-monitor-and-its-out-soon",
    "G-Sync": "https://www.techradar.com/news/computing-components/graphics-cards/nvidia-g-sync-vs-amd-freesync-1289637",
    "variable refresh rates": "https://www.techradar.com/news/ps5-will-get-a-key-visual-feature-in-a-future-system-software-update-confirms-sony",
    "HDR TV": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "LG CX": "https://www.techradar.com/reviews/lg-cx-oled-tv"
  }
}