{
  "source": "https://www.techradar.com/news/new-captain-america-in-the-falcon-and-the-winter-soldier-explained",
  "title": "The Falcon and the Winter Soldier's new Captain America explained",
  "category": "entertainment",
  "updated": "2021-03-19T20:48:15Z",
  "author": "tom-power",
  "summary": "Who holds the iconic shield now?",
  "article": [
    "Spoilers follow for The Falcon and the Winter Soldier.",
    "The Falcon and the Winter Soldier has landed on Disney Plus, and if you've finished the first episode, you might've noticed that it ended with a big surprise. A new Captain America was introduced in the episode's final scene, and you might have questions about who this character is and why he has Cap's iconic shield.",
    "In the closing moments of episode 1, Wyatt Russell's John Walker was shown off to the world – carrying the shield that Sam Wilson had given up to the government for museum display purposes earlier on.",
    "We're here to bring you all of the information you need on this new Captain America, including his comic book history and how he'll tie into the series' plot. There are spoilers for The Falcon and the Winter Soldier from here on out, so proceed at your own risk.",
    "Final spoiler warning for The Falcon and the Winter Soldier episode 1. Turn back if you haven't watched it yet.",
    "This new Captain America isn't an original character for the MCU TV series. Far from it, in fact, as he has an extensive Marvel comic book history. The person in question is a man named John Walker, and he's gone by a couple of superhero pseudonyms in the past.",
    "Walker first appeared in Marvel Comics' Captain America #323 in November 1986. He started out as Super-Patriot, but adopted a new superhero mantle in June 1989. Since then, Walker has been known as US Agent, which is a title he still holds to this day.",
    "Originally, Walker was created by writer Mark Gruenwald and artist Paul Neary as the antithesis of Captain America. As Super-Patriot, he was seen as a counter to the message and values that Cap upheld but, as the years went by, US Agent became more heroic and now doles out punishment to enemies of the US instead.",
    "US Agent's superpowers are eerily similar to those of Captain America's, which he obtained from a genetic augmentation experiment conducted by Dr. Karl Malus. He possesses superhuman strength, agility, reflexes, durability, speed, and balance, and his army training means that he's a fierce hand-to-hand combatant with plenty of military experience. US Agent also has a vibranium shield that he can utilize for offensive and defensive maneuvers.",
    "His origin, of course, is yet to be revealed in the MCU, but we suspect we'll find out more soon enough.",
    "As for how he'll will factor into the story of The Falcon and the Winter Soldier, it'll be interesting to see how Sam and Bucky react to his appearance. Despite being given his iconic shield by old man Cap in Avengers: Endgame, Sam hands the shield back to the US government as he clearly doesn't feel comfortable with taking Cap's place.",
    "Instead of retaining the shield as part of Captain America's museum-based exhibition, however, the government decides to pass the mantle onto John Walker, who is portrayed by Wyatt Russell in the show. Sam clearly looks upset as the announcement is made at the end of episode 1, and we suspect that Bucky will have something to say about the matter. He seemed content with Steve passing the shield to Sam during Endgame's final moments, so he won't be happy to learn that Sam isn't taking the role on.",
    "It's unclear what role US Agent will have in the plot, but we do know that he won't be a carbon copy of his comic book character. In an Entertainment Weekly interview, showrunner Malcolm Spellman revealed that the new hero will have \"different dimensions\" to him, which suggests we'll see someone who doesn't exactly see eye-to-eye with Sam and Bucky. Additionally, Spellman has revealed (via IGN) that the MCU's John Walker will be a more \"humanized\" version of the character rather than the cocky iteration readers will know about.",
    "We may find out why he agreed to take up the Captain America mantle, what drives him and whether he has any weaknesses. For now, though, we'll have to wait and see if Walker can live up the Cap's legacy, or if Sam or Bucky will eventually adopt the title instead.",
    "While Walker appears to be a government-controlled knock-off in The Falcon and the Winter Soldiers, he actually has previous form of taking over Cap's iconic mantle. In the comics, Walker replaces Steve Rogers as Captain America for a spell, so Marvel and Disney haven't thrown us a total curve ball with Walker's installation as the MCU's new Captain America.",
    "Additionally, Walker's comic creators were also the duo behind Flag Smasher, who the show's group is based upon. As Captain America, Walker has gone toe-to-toe with the solitary Flag Smasher in the comics, so it stands to reason why he's present in The Falcon and the Winter Soldier. Sam Wilson and James 'Bucky' Barnes will need all of the help they can get in tackling this group and Baron Zemo, and Walker could be the one to aid them in that quest.",
    "But he could also be the villain of the story. Or he could be both the hero and the villain. That's the big unknown about The Falcon and the Winter Soldier - and we can't wait to find out what happens next."
  ],
  "headers": {
    "4": "The Falcon and the Winter Soldier: US Agent's comic history explained",
    "10": "Why is there a new Captain America in Falcon and the Winter Soldier?",
    "14": "John Walker has assumed the Captain America role before in the comics"
  },
  "links": {
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1377046228726834700&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fwelcome%3F%26cid%3DDSS-Search-Google-71700000070665426-%26s_kwcid%3DAL%218468%213%21500174328676%21e%21%21g%21%21disney%2520plus%26gclid%3DCj0KCQjwl9GCBhDvARIsAFunhsmVu7f1f-inW7e19mC8X0EcH5sc0hG4LX_cLzTYEh-qkfIGOlHx5EIaArPqEALw_wcB%26gclsrc%3Daw.ds",
    "Entertainment Weekly interview": "https://ew.com/tv/falcon-and-the-winter-soldier-digital-cover/",
    "IGN": "https://www.ign.com/articles/falcon-and-winter-soldier-the-mcus-us-agent-has-been-humanised-compared-to-the-comics",
    "show's group": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-the-flag-smashers-explained"
  }
}