{
  "source": "https://www.techradar.com/news/paypal-launches-super-app-to-cover-all-your-payment-needs",
  "title": "PayPal launches \"super app\" to cover all your payment needs",
  "category": "phones",
  "updated": "2021-09-21T20:05:52Z",
  "author": "anthony-spadafora",
  "summary": "An intelligent digital wallet to manage all of your finances",
  "article": [
    "After teasing its new “super app” back in July, PayPal has officially announced its new all-in-one, personalized app that provides users with all of the tools they need to manage their financial lives.",
    "The new PayPal app also introduces new features to its money transfer app including a new high yield savings account provided by Synchrony Bank called PayPal Savings as well as new in-app shopping tools that enable users to earn rewards redeemable for cash back or PayPal shopping credit.",
    "At the same time, the new app provides a single place for PayPal customers to manage their bill payments, get paid up to two days earlier with a new Direct Deposit feature, earn rewards and manage gift cards, send and receive money to friends, family and businesses, pay with QR codes, access and manage credit, buy, hold and sell cryptocurrency and take advantage of Buy Now, Pay Later services.",
    "President and CEO of PayPal, Dan Schulman provided further insight on the company's new app in a press release, saying:",
    "\"We're excited to introduce the first version of the new PayPal app, a one-stop destination for our customers to take charge of their everyday financial lives, with new features like access to high yield savings, in-app shopping tools for customers to find deals and earn cash back rewards, early access Direct Deposit, and bill pay. Our new app offers customers a simplified, secure and personalized experience that builds on our platform of trust and security and removes the complexity of having to manage multiple financial or shopping apps, remember different passwords and track loyalty rewards.\"",
    "PayPal's new app is an intelligent digital wallet that includes a personalized dashboard of a customer's account.",
    "The app's wallet tab allows users to manage payments instruments and Direct Deposit, the finance tab includes access to high yield savings and crypto capabilities and the payments hub includes send and receive money features, international remittances, charitable and non-profit giving and bill pay. However, PayPal has also added a two-way messaging feature so that users can send notes of acknowledgment after peer-to-peer transactions.",
    "As the number of consumers using digital wallets is expected to double to 4.4bn globally by 2025 according to a report from Juniper Research, the new PayPal app aims to address this by giving the company's users an all-in-one app that can serve as their primary destination for managing their day-to-day financial lives.",
    "Later this year, PayPal plans to add additional features and enhancements to its app including investment capabilities and more ways to pay with the app both online and in-store.",
    "The new PayPal app is rolling out now and PayPal Savings and the company's new shopping tools and rewards are set to roll out to US customers in the coming months."
  ],
  "headers": {
    "5": "Intelligent digital wallet"
  },
  "links": {
    "super app": "https://www.techradar.com/news/new-paypal-super-app-includes-messaging-at-last",
    "PayPal": "https://www.techradar.com/reviews/paypal-commerce-platform",
    "money transfer app": "https://www.techradar.com/best/best-money-transfer-apps",
    "pay with QR codes": "https://www.techradar.com/news/paypal-rolls-out-qr-code-payments-for-a-touch-free-way-to-buy-and-sell-in-person",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "Buy Now, Pay Later": "https://www.techradar.com/news/paypal-snaps-up-japanese-buy-now-pay-later-firm-paidy",
    "press release": "https://newsroom.paypal-corp.com/2021-09-21-PayPal-Introduces-Customers-to-the-Next-Digital-Payments-Era-with-the-New-PayPal-App",
    "digital wallet": "https://www.techradar.com/news/half-the-worlds-population-could-be-using-digital-wallets-by-2025",
    "Juniper Research": "https://www.juniperresearch.com/researchstore/fintech-payments/digital-wallet-research-report"
  }
}