{
  "source": "https://www.techradar.com/news/intel-core-i5-12600k-could-be-a-midrange-cpu-that-provides-flagship-performance",
  "title": "Intel Core i5-12600K could be a midrange CPU that provides flagship performance",
  "category": "computing",
  "updated": "2021-10-27T09:42:52Z",
  "author": "darren-allan",
  "summary": "Alder Lake processor beats out the Core i9-11900K in leaked benchmark",
  "article": [
    "Intel’s Core i5-12600K could be a midrange champ of a CPU, at least if a new leaked benchmark is anything to go by.",
    "The new Alder Lake processor is expected to be revealed later today, according to the rumor mill – ahead of a November 4 on-sale date in theory – and Twitter-based hardware leaker Tum_Apisak highlighted this benchmark which is from CPU-Z.",
    "The single-core score of 773 points and the multi-core result of 7,220 are seriously good for a midrange processor, and indeed, the Core i5-12600K outperforms the current Rocket Lake flagship in this test.",
    "That Core i9-11900K CPU hits 682 and 6,458, so given that, the 12600K is actually 13% faster in single-core, and almost 12% quicker in multi-core. Remember, this is a middling Alder Lake chip compared to the existing Intel flagship, so that’s quite an eye-opener.",
    "For a comparison on the AMD side, the 12600K can square up to the midrange Ryzen 5 5600X, which hits 624 and 4,811 for single and multi-core respectively, meaning Intel’s CPU is 24% faster in single-core, and a whopping 50% better for multi. The 5600X is a 6-core part offering 12-threads, and admittedly the 12600K (purportedly) delivers more with 16-threads in total.",
    "The Core i5-12600K spec with this leak is as previously rumored, meaning it has 6 performance cores and 4 power-efficient cores, for a total of 16-threads as mentioned (the efficiency cores don’t have hyper-threading).",
    "The performance cores are shown here running at a base clock of 3.7GHz with maximum boost to 4.9GHz, but the Turbo speeds shown vary between 4.5GHz and 4.7GHz (4.9GHz will be the fastest possible single-core frequency, most likely).",
    "This is interesting spillage, make no mistake, ahead of what should be the CPU’s big launch later on, as mentioned at the outset. While a lot of eyes will be on the flagship Core i9-12900K, which has witnessed quite a number of promising leaks, the midrange sector of the processor world could be where Intel hits AMD hardest.",
    "Certainly if this leak is on the money, as it shows the 12600K as a really impressive performer. Furthermore, this isn’t the only midrange spillage we’ve seen, as there was also a promising leak around the Core i5-12400 in recent times.",
    "We must remember not to get too carried away with any pre-release rumors, though, and CPU-Z – which was also one of the benchmarks provided in the 12400 leak – is hardly the best metric to gauge the power of a processor, either.",
    "Still, with all the speculation flying around about Alder Lake offering something special – it’s really mounting up of late – it’s difficult to not get at least a bit excited about the prospects ahead. And more than a bit worried if you’re AMD, no doubt, although Team Red does have a reply on the horizon in the form of refreshed Ryzen processors using 3D V-Cache tech which are set to arrive early in 2022 (with some big performance boosts of their own, AMD claims).",
    "The other possible sticking point for Intel’s midrange potential might be issues around getting enough supply of Alder Lake chips to market, and prioritizing away from the middling-priced processors to get premium CPUs like the 12900K out there (as they make more profit) – but AMD is likely to be subject to similar supply headwinds going forward.",
    "Via VideoCardz"
  ],
  "headers": {
    "7": "Analysis: Alder Lake to deliver serious blows to AMD in the midrange?"
  },
  "links": {
    "CPU": "https://www.techradar.com/news/intel-finally-reveals-a-real-image-of-an-alder-lake-cpu-leaving-renders-behind",
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "expected to be revealed later today": "https://www.techradar.com/news/new-intel-alder-lake-rumor-suggests-cpu-launch-is-imminent",
    "Ryzen 5 5600X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-5-5600x-find-stock-here",
    "witnessed quite a number of promising leaks": "https://www.techradar.com/news/intel-core-i9-12900k-leak-shows-an-overclocked-cpu-that-could-seriously-worry-amd",
    "promising leak around the Core i5-12400 in recent times": "https://www.techradar.com/news/intel-core-i5-12400-leak-could-be-amds-worst-nightmare",
    "3D V-Cache tech": "https://www.techradar.com/news/amd-3d-chiplet-technology-meet-the-future-of-processors",
    "set to arrive early in 2022": "https://www.techradar.com/news/amd-could-launch-ryzen-6000-cpus-in-early-2022-to-fight-back-against-intel",
    "getting enough supply of Alder Lake chips to market": "https://www.techradar.com/news/intel-ceo-believes-the-cpu-and-gpu-shortage-crisis-will-last-into-2023",
    "VideoCardz": "https://videocardz.com/newz/intel-core-i5-12600k-cpu-z-validations-confirm-50-higher-performance-than-i5-11600k-in-multi-thread-test"
  }
}