{
  "source": "https://www.techradar.com/news/how-to-watch-the-mauritanian-online-stream-jodie-foster-movie-anywhere",
  "title": "How to watch The Mauritanian online: stream award-winning Jodie Foster movie anywhere",
  "category": "computing",
  "updated": "2021-03-02T12:02:20Z",
  "author": "aatif-sulleyman",
  "summary": "Unflinching look at one of modern America's darkest episodes",
  "article": [
    "On August 4, 2002, the US government imprisoned Mohamedou Ould Slahi, a Muslim man, at its notorious Guantanamo Bay detention camp on baseless allegations that he was the head recruiter behind the 9/11 attacks. The Mauritanian, which is based on memoirs that Slahi secretly wrote while imprisoned, chronicles his extraordinary struggle for freedom against all odds. Read on as we explain how to watch The Mauritanian online, wherever you are in the world right now.",
    "Slahi would be detained there for 14 years, without trial, charge or evidence, all the while being abused and subjected to a sickening array of inhumane torture methods.",
    "The Mauritanian shines a light on some of the seldom discussed recent horrors of the US government's war on terror, as the authorities threw out the basic rule of law in their pursuit of revenge.",
    "Golden Globe nominee Tahar Rahim stars as Mohamedou Ould Slahi, opposite Golden Globe winner Jodie Foster as defense attorney Nancy Hollander. Hollander and her associate Teri Duncan (Shailene Woodley) advocated for Slahi in his fight for justice against the might of the US government, which used torture to build a case against him.",
    "The formidable Lt. Colonel Stuart Couch (Benedict Cumberbatch) was assigned to prosecute Slahi but - after learning what he was being put through in order to extract a confession, including sexual abuse, exposure to extreme temperatures, beatings, sleep deprivation and threats of death - the disturbing realities of one of the darkest episodes of American history is revealed to the world.",
    "Read on as we explain how to watch The Mauritanian online and stream the award-winning film today. It's widely available on streaming platforms including Amazon Prime Video, which offers a free 30-day trial - though as a brand new movie, The Mauritanian is a PVOD release for now.",
    "Unfortunately, if you’re out of your country of residence for whatever reason, then geo-blocks will prevent you from connecting to your streaming services and content back home.",
    "Luckily, there’s a simple fix. Downloading a VPN will let you to change your IP address to that of any country in the world: meaning you can access your preferred VOD platform online from anywhere – just like you would in your own living room.",
    "Use a VPN to watch The Mauritanian online from anywhere"
  ],
  "headers": {
    "6": "How to watch The Mauritanian from outside your country",
    "9": "How to watch The Mauritanian online in Australia: release date and streaming details"
  },
  "links": {
    "free 30-day trial": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Famazonprime%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9130624241717020000-20",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}