{
  "source": "https://www.techradar.com/news/gina-carano-will-no-longer-appear-in-star-wars-projects",
  "title": "Gina Carano will no longer appear in Star Wars projects",
  "category": "entertainment",
  "updated": "2021-02-11T10:19:13Z",
  "author": "samuel-roberts",
  "summary": "Lucasfilm has parted ways with Carano after a widely-condemned social media post",
  "article": [
    "Gina Carano won't appear in future Star Wars TV shows, it's been confirmed, after the actress reportedly shared an offensive message on Instagram from another account that asked how the Holocaust is \"any different to hating someone for their political views\" (we won't reproduce the post here). The post has been deleted, but was screengrabbed and widely shared.",
    "Carano, then, won't appear in The Mandalorian season 3, nor another Star Wars project she was apparently slated to lead until late last year.",
    "\"Gina Carano is not currently employed by Lucasfilm and there are no plans for her to be in the future,\" said Lucasfilm in a statement captured by THR. \"Nevertheless, her social media posts denigrating people based on their cultural and religious identities are abhorrent and unacceptable.\"",
    "Carano has also been dropped by her agents at UTA.",
    "The Star Wars show likely to feature Carano was Rangers of the New Republic – a Mandalorian spin-off coming from Jon Favreau to Disney Plus. The Mandalorian season 3 films later this year.",
    "At the start of season 2, we'd have said yes – Carano was an essential part of a small ensemble, and it might've seemed egregious if she hadn't turned up in further episodes of the show. Now, The Mandalorian has an absolutely sprawling cast of supporting characters, as the very busy season 2 finale underlined.",
    "The show can easily carry on without her, in our opinion.",
    "Lucasfilm could always recast Cara Dune, if it wanted to – but it's unclear how this situation will be resolved as it stands. By the end of season 2, Dune was the Marshal of the planet Nevarro, and affiliated with the New Republic."
  ],
  "headers": {
    "5": "Will this hurt The Mandalorian?"
  },
  "links": {
    "Star Wars TV shows": "https://www.techradar.com/news/new-star-wars-movies-and-tv-shows",
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "THR": "https://www.hollywoodreporter.com/news/the-mandalorian-star-gina-carano-fired-amid-social-media-controversy",
    "Rangers of the New Republic": "https://www.techradar.com/news/the-mandalorian-spin-offs-ahsoka-and-rangers-of-the-new-republic-explained",
    "season 2 finale": "https://www.techradar.com/news/the-mandalorian-season-2-episode-8-recap-review"
  }
}