{
  "source": "https://www.techradar.com/news/want-to-upgrade-to-windows-11-for-free-youll-have-to-wait-until-2022",
  "title": "Want to upgrade to Windows 11 for free? You’ll have to wait until 2022",
  "category": "computing",
  "updated": "2021-06-28T11:21:14Z",
  "author": "matt-hanson",
  "summary": "Free upgrades won’t be here for a while",
  "article": [
    "If you were hoping to upgrade to Windows 11 for free any time soon we have some bad news for you, with Microsoft revealing that Windows 10 users will have to wait until 2022 to upgrade.",
    "While Windows 11 will start appearing on new PCs and laptops “later in 2021”, according to a tweet from the official Windows Twitter account (which you can see below), the “rollout of the upgrade to Windows 10 devices already in use today will begin in 2022”.",
    "Going by that tweet, then, it looks like the only way to get Windows 11 in 2021 will be to buy a new device on which it's preinstalled.",
    "Based on what Microsoft has told us, we know that Windows 11 will be offered as a free upgrade to Windows 10 users, as long as they have a compatible PC.",
    "You can see if your PC is able to run Windows 11 by using the PC Health Check tool (and following our how to check if your PC will get Windows 11 update guide). The tool isn’t perfect, as it’s been labelling PCs that should easily be able to run Windows 11 as being incompatible, but it should give you an idea of whether or not you’ll be able to upgrade.",
    "Even if you have a compatible PC, it looks like you’ll have to wait until at least early 2022 to upgrade to Windows 11. The mention of a ‘rollout’ suggests that Microsoft will make the upgrade available to Windows 10 gradually, and while that could mean more of a wait it’s a wise move in our opinion, as it will allow Microsoft to keep an eye on any issues that emerge.",
    "As yet we've heard nothing from Microsoft as to whether Windows 11 will be available to buy as a standalone purchase, and if so how much it will cost – if it is made available, this could be a way of getting Windows 11 earlier, if you’re willing to pay.",
    "A Windows 11 beta will also be made available soon for people to try, but unless you’re really desperate to get the new operating system we’d recommend not installing it – especially on any device that you rely on every day – as betas are early versions of software that often come with bugs and incomplete features.",
    "Via Notebook Check"
  ],
  "headers": {
    "3": "Waiting game"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 11 will be offered as a free upgrade": "https://www.techradar.com/news/windows-11-is-a-free-upgrade-but-could-prove-a-pain-in-the-neck-rather-than-wallet",
    "PC Health Check tool": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46194&u1=trd-us-9281817045270847000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fwindows%2Fwindows-11",
    "how to check if your PC will get Windows 11 update guide": "https://www.techradar.com/how-to/how-to-check-if-your-pc-will-get-windows-11-update",
    "Notebook Check": "https://www.notebookcheck.net/Microsoft-Windows-10-devices-will-get-Windows-11-for-free-but-not-until-2022.548043.0.html"
  }
}