{
  "source": "https://www.techradar.com/news/who-cares-about-the-ps5-or-xbox-modded-witcher-3-looks-stunning-at-4k-with-nvidia-rtx-3090",
  "title": "Forget the PS5 – Witcher 3 looks stunning at 4K with an Nvidia RTX 3090 (and loads of mods)",
  "category": "gaming",
  "updated": "2021-04-30T13:51:34Z",
  "author": "darren-allan",
  "summary": "Visual upgrades come courtesy of some 50+ mods",
  "article": [
    "How good can The Witcher 3 look these days? Pretty exceptional if you mod the game extensively and run it at 4K resolution driven by Nvidia’s flagship Ampere graphics card, as it happens.",
    "As Wccftech spotted, the Digital Dreams channel on YouTube – which specializes in showing all sorts of games fully modded and with the graphics details totally cranked – showed off The Witcher 3 with a ton of mods running on an Nvidia GeForce RTX 3090 GPU.",
    "And the results look very smart indeed, as you can see for yourself in the video below.",
    "Mind you, over 50 mods were used to enhance the visuals here, including ‘realistic’ ReShade, the Vanilla Lighting and Weather 2.0 mod, plus The Witcher 3 HD Reworked Project 12.0 mod (from Halk Hogan). The latter improves models and textures, seriously upping their quality while aiming to maintain the original style of the game, and also increases the draw distance for some objects.",
    "If you’re interested in the full list of mods used, Digital Dreams provides a link to the mod list in the notes on the video.",
    "Should all this visual finery get you suitably excited, don’t forget that the next-gen update is coming in the second half of 2021 for the PC (and PS5, PS4, Xbox Series X/S and Xbox One), promising graphical improvements, ray tracing, and faster loading (with more besides).",
    "Still, even before the graphics upgrades inbound with this next-gen revamp of the game, The Witcher 3 can already look seriously impressive on a top-end graphics card, as we’ve seen here.",
    "You may also recall that we have highlighted The Witcher 3 running in 8K before, again courtesy of the RTX 3090, although at this resolution, even Nvidia’s mighty flagship struggles to achieve much more than 35 frames per second."
  ],
  "headers": {
    "5": "Next-gen now (sort of)"
  },
  "links": {
    "Wccftech": "https://wccftech.com/stunning-modded-the-witcher-3-rtx-3090/",
    "Nvidia GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "link": "https://www.nexusmods.com/witcher3/mods/3316?tab=files",
    "next-gen update": "https://www.techradar.com/news/the-witcher-3-is-headed-to-ps5-and-xbox-series-x-and-you-could-even-get-it-for-free",
    "second half of 2021": "https://www.techradar.com/news/the-witcher-3-on-ps5-and-xbox-series-x-coming-later-this-year",
    "Nvidia’s mighty flagship struggles to achieve much more than 35 frames per second": "https://www.techradar.com/news/nvidia-geforce-rtx-3090-is-such-a-beast-it-can-run-witcher-3-horizon-zero-dawn-and-more-at-8k"
  }
}