{
  "source": "https://www.techradar.com/news/wix-wants-to-make-it-easier-and-cheaper-than-ever-to-build-your-own-app",
  "title": "Wix wants to make it easier and cheaper than ever to build your own app",
  "category": "the-best-website-builder",
  "updated": "2021-08-10T18:30:59Z",
  "author": "anthony-spadafora",
  "summary": "Branded App by Wix allows users to easily create their own native mobile apps",
  "article": [
    "In addition to offering a website builder, Wix has announced that it will launch a native mobile app builder that will allow small businesses and entrepreneurs to create and customize their own tailor-made apps without having to write a single line of code.",
    "With the launch of Branded App by Wix, the company's customers will be able to create a holistic brand experience for their business with a customized website, a domain and now their own native mobile app.",
    "According to data from Wix, store owners with their own native mobile apps see an average increase of 162 percent in transactions per site while fitness businesses see an average increase of 510 percent in services booked per site on mobile.",
    "Native mobile apps are increasingly becoming a key business driver for brands to gain and connect with customers, build brand loyalty and create an additional revenue which is why Wix's decision to create a native mobile app builder makes so much sense.",
    "Wix users that sign up for the company's Branded App by Wix service will have the creative freedom to make and design their own native mobile apps.",
    "Using the service, business owners will be able to customize their app icon as well as the the layout and content of their app including product pages, booking services, forums and groups, chat functions, blogs, push notifications and more. Branded App by Wix also supports any type of business from fitness to restaurants to stores, blogs, forums and even virtual events.",
    "Existing Wix users will benefit from the fact that the tools and features from their site are automatically integrated and activity from both the app and their site will be synced to the Wix dashboard.",
    "SVP of mobile, app market and strategic products at Wix Ronny Elkayam provided further insight on the company's new native mobile app offering in a press release, saying:",
    "\"This release is another step in our native mobile app strategy making sure users can create custom iOS and Android apps as easily as they create custom websites. The Branded App is a major addition to the Wix offering, enabling business owners to have another medium to activate their brand. We are happy to equip any type of business owner or service provider with the native mobile experience they need to enhance their customers' experience, grow their businesses and ultimately compete with today's biggest brands.\"",
    "Branded App by Wix will cost $200 per month when it launches but Wix is currently running a pre-sale promotion until September 20 where new customers can get 50 percent off for life and only pay $100 per month for the service."
  ],
  "headers": {
    "4": "Branded App by Wix"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Wix": "https://www.techradar.com/reviews/wix",
    "a domain": "https://www.techradar.com/news/best-domain-registrars",
    "Native mobile apps": "https://www.techradar.com/best/best-mobile-app-development-software",
    "virtual events": "https://www.techradar.com/best/best-virtual-event-platforms",
    "press release": "https://www.prnewswire.com/news-releases/wix-launches-app-builder-branded-app-by-wix-for-users-to-create-their-own-native-mobile-app-301351995.html",
    "pre-sale promotion": "https://www.wix.com/app-builder"
  }
}