{
  "source": "https://www.techradar.com/news/samsung-s-pen",
  "title": "Samsung's S Pen: a guide to the stylus of the Galaxy S21 Ultra and Note series",
  "category": "phones",
  "updated": "2021-02-11T15:05:44.340Z",
  "author": "david-nield",
  "summary": "Everything S Pen you need to know",
  "article": [
    "When it comes to superstar-level styluses, the Samsung S Pen stands among the very best company – perhaps only the Apple Pencil can claim to have the same sort of brand recognition as the pointing device made by Samsung for its premium smartphones.",
    "This is your one-stop guide to everything S Pen: find out the devices that support the Samsung S Pen, check what to do if you lose your S Pen and need to replace it, learn the key features of the S Pen, get the latest on the future of the S Pen, and more besides.",
    "The history of the S Pen (or \"smart pen\") is inextricably linked with the history of the Samsung Galaxy Note series – the stylus made its debut with the very first Note back in 2011. That original Note was designed to fuse together the phone and tablet form factors, though it had a screen size just 5.3 inches from corner to corner, which is very small by today's standards.",
    "Since 2011, the S Pen has tagged along with the Galaxy Note like a constant companion, all the way up to the Galaxy Note 20 that launched in 2020. It's more than an optional extra for the Note, it's an integral feature, slotting away in the casing when not in use. If you've ever bought a Galaxy Note, then you'll have got a Samsung S Pen with it as well.",
    "Down the years the S Pen has become more precise and gained more in the way of functionality, and in 2021 it extended its reach to the Galaxy S21 Ultra as well. The stylus for this phone has a slightly different design though, and isn't quite as versatile – it's an optional extra for the S21 phone, and needs a specific case to be slotted in and carried alongside the handset.",
    "The S Pen has always been marketed as a more precise way of interacting with your phone, something a little more elegant than stabbing at the screen with your fingers. The original 2011 version of the S Pen came with 256 levels of pressure sensitivity, a figure that has since been boosted all the way up to 4,096 levels – surely enough for even the most careful of digital artists.",
    "In 2018, the S Pen gained Bluetooth connectivity, which means you can operate it from a distance as well as tapping on the screen with it. If you hover the stylus above the screen, it can bring up actions and responses without an actual touch, particular in Samsung's own apps. These actions and responses can be customized too.",
    "There's digital handwriting of course, and Samsung's software can either save your scribbles as they are or convert your writing into digital text that it can understand. The S Pen can be used to fill out standard text fields as well as to jot down notes on a more flexible canvas (including the lock screen, if needed).",
    "You can use the S Pen to take screenshots (selecting just a part of the screen if required), and then annotate them. It'll translate words for you too, through the magic of Google Translate, and it can also be used as a remote shutter button for the camera – handy if you need to take a well-framed selfie.",
    "Then there's everything you can do with a finger, just more precisely: tapping on menus and buttons, drawing on screen, selecting text and images and so on. It's a comprehensive package, and if you've grown used to operating your phone with the S Pen then you might find it awkward to do without it.",
    "The design and appearance of the S Pen has changed down the years as well, with the introduction of a pen-like top to the stylus to make it easier to pull it out of its housing, and the addition of waterproofing along the way as well. You can even use recent versions of the S Pen to unlock your phone.",
    "As we've mentioned, the S Pen is the default companion to the Galaxy Note series. If you buy a Note, it'll come with its own S Pen included, with all the functionality automatically set up and ready to go. You can actually use multiple S Pens with Note devices, if you have more than one lying around ready to go (or you've just bought a spare).",
    "The Tab S tablet ranges from Samsung also come with an S Pen stylus included in the bundle – like the Galaxy Tab S7 Plus, for example – though it's not the same model as you'll get if you buy the Note series. Stylus support isn't available on the cheaper Tab A range, including the recently launched Galaxy Tab A7. S Pen support should be mentioned on the product listing if it's included.",
    "In 2021, the S Pen finally came to the S series of Galaxy phones: specifically the Galaxy S21 Ultra, though you don't get the S Pen bundled with the handset and you have to buy it separately. A separate case is required to carry the S Pen, it's thicker and longer than the one supplied with the Note series, and it doesn't offer quite as many functions (the Bluetooth shortcuts are missing, for example).",
    "If you don't get an S Pen with your device – or you lose it and need a new one – you can buy a stylus that will work with your device direct from Samsung as well as third-party retailers such as Amazon. Prices can fluctuate but at the time of writing an S Pen that's compatible with the Note 20 will set you back $40/£34 (and you've got a choice of five different colors to pick from too).",
    "Should the tip of your S Pen run out, you don't need to buy a whole new stylus: the tips of the S Pen are replaceable (you may even have got spare tips with your device or your case). Spare or replacement tips will also come with an extractor tool to help you prise out the old tip. This is the case with all models of the S Pen.",
    "There's yet more to come from Samsung's famous stylus as well: the company has teased an even bigger and perhaps even more capable S Pen Pro model that's launching later in the year, though for now details are thin on the ground about what exactly it will do and how it will be different from the S Pens that we already have. Watch this space."
  ],
  "headers": {
    "2": "A brief history of the S Pen",
    "5": "S Pen key features",
    "11": "Which devices work with the S Pen?",
    "14": "Buying and replacing your S Pen"
  },
  "links": {
    "Apple Pencil": "https://www.techradar.com/how-to/apple-pencil-on-ipad-our-full-guide-on-how-to-use-it",
    "the very first Note": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-note-1039199/review",
    "Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Samsung": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1266859507493536500&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fmobile%2Fmobile-accessories%2Fphones%2Fgalaxy-note20-5g-s-pen-copper-ej-pn980baegus%2F%23benefits&article_name=Samsung's%20S%20Pen%3A%20a%20guide%20to%20the%20stylus%20of%20the%20Galaxy%20S21%20Ultra%20and%20Note%20series&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-s-pen",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSamsung-Official-Galaxy-Ultra-Bluetooth%2Fdp%2FB08FBP422Y%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3414390915829990000-20",
    "S Pen Pro model": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-works-with-an-s-pen-pro-but-what-does-it-do-differently"
  }
}