{
  "source": "https://www.techradar.com/news/dragon-professional-vs-home-choosing-the-right-speech-to-text-app-for-you",
  "title": "Dragon Professional vs. Home: choosing the right speech to text app for you",
  "category": "computing",
  "updated": "2021-11-03T11:40:31Z",
  "author": "richard-sutherland",
  "summary": "Is Dragon Professional worth double the price of Dragon Home?",
  "article": [
    "Dragon Home and Dragon Professional are two versions of the popular speech-to-text voice software from Nuance. You can use them to control your computer and write documents with your voice. While Windows 10 has a built-in Speech Recognition system, many people prefer Dragon because it more accurately transcribes spoken words. Nuance has been a leading name in speech recognition software since 1994 and has come close to perfecting speech-to-text for Windows users.",
    "The latest iteration of Dragon is 15, which has been available since 2016. At $150, Dragon Home is the cheapest version. Dragon Professional costs $300. There are also a few niche versions of Dragon that aren’t covered in this article, such as Dragon Legal, Dragon Medical Practice Edition, and Dragon Group.",
    "In our Dragon Professional vs. Home comparison, we outline the differences in the two products so you can decide which is the best speech to text software for your needs.",
    "Dragon Home and Dragon Professional are similar products built on the same voice recognition engine. Their user interfaces are almost identical. Basic speech recognition and document editing are performed in the same way in both versions of the software. You can create, edit, and format documents just by speaking. After you’ve dictated a document, you can have it read back to you.",
    "With Dragon Professional, you can make multiple speech profiles. This is often used to transcribe recordings from other people without interfering with your own personal speech profile. You may also want to use a different profile for each room that you use Dragon in, as the acoustics can vary.",
    "Dragon Home does not allow you to create multiple profiles nor does it have the facility to import or export a user profile. If you upgrade to a new version of the software in the future, you’ll need to create a new profile from scratch.",
    "One of the most visible differences between the two versions of the software is the lack of transcriptions from recordings in Dragon Home. A transcription from a .wav or .mp3 file can be useful, whether for getting a written record of notes that you’ve taken on a Dictaphone or for transcribing a lecture.",
    "With Dragon Professional, you can transcribe your own recorded words or the words of other people. You can even set up individual profiles for people you transcribe often, making it easier to fix any particular errors made when their voices are transcribed.",
    "Nuance has a mobile speech-to-text app for iOS and Android for $14.99/month. You can use it to dictate documents by voice while on the move. You can also sync your desktop customizations with the app if you use Dragon Professional. This isn’t supported in Dragon Home.",
    "The more that you use Dragon Professional, the more accurate it becomes. This is because it has a Vocabulary Editor. You can add, remove, and train specific words and phrases. We all have words we say that trip up speech-to-text programs, and editing the vocabulary is an easy way to train Dragon on verbal idiosyncrasies.",
    "Do note that the Home version of Dragon doesn’t have this feature. You can’t teach it any words you use that have complicated pronunciation, nor can you remove misspellings of your name. You can add words, but you can’t edit the vocabulary or export it for use in the future. Also, you can’t import your entire list of words from another computer or another version of Dragon.",
    "Similarly, you can only set up your microphone one time with Dragon Home. You get one chance to do a microphone check, and one only. If you later move to another room, switch microphones, or adjust your microphone position, you may need to create a new user profile.",
    "Another feature missing from Dragon Home that some users can’t do without is custom voice commands. Dragon Professional has a fantastic custom command editor that you can use to automate much of your daily routine. For example, if you’re using speech-to-text software to reduce repetitive strain, custom voice commands can be a lifesaver.",
    "For example, you can create a custom command to open up a favorite website, enter your password, and click on several links, all just by saying one word. If you plan to use speech recognition for anything besides dictation, the lack of custom commands in Dragon Home will be a big burden.",
    "Dragon Professional has commands specifically for working with Microsoft Excel. You can, for example, move around a spreadsheet with commands like Line Up, Next Row, and Previous Column. This is missing from Dragon Home, something important to note if you plan to use Microsoft Excel with your speech recognition software.",
    "In terms of speech recognition accuracy, there appears to be no difference between Dragon Home and Dragon Professional. The Home edition uses the same speech engine as Professional. We played the same audio to both versions of the software through a microphone, and they could transcribe to the same level of accuracy.",
    "That said, because Dragon Professional has a Vocabulary Editor, its accuracy will improve. The software makes fewer mistakes, as you’re able to train it to understand you better. With Custom Commands, you can do more with the program too, speeding up your daily work.",
    "Though support for both Dragon Home and Dragon Professional is available over the phone Monday through Friday, 9 AM to 8 PM EST, there are more online resources for Dragon Professional than for Home.",
    "The Nuance website has links to a Dragon Home Install Guide and Quick Start Guide. At time of writing, the Install Guide is missing and the Quick Start Guide is a mere six pages long.",
    "Compare this to the documentation for Dragon Professional. There’s a 20-page Install Guide, a two-page Command Cheat Sheet, and a 98-page Workbook that doubles as a manual. While some information in the documents could be applied to Dragon Home, it’s clear that the company’s focus is on the Professional edition.",
    "Dragon Home costs $150 and Dragon Professional costs $300. Be aware that it’s not possible to upgrade from Dragon Home to Professional, so it pays to make the right choice the first time.",
    "On both versions of the software, your license is on a per-user basis. You can install Dragon on multiple computers, but you should only have one person using the software. This is interesting in Dragon Professional’s case because you can set up multiple speech profiles. Secondary profiles are meant to be used for transcribing recordings of other people, but Dragon Professional does allow you to switch between them without limitation. As outlined above, Dragon Home doesn’t have this facility, so you’re stuck using a single speech profile.",
    "The difference between paying $150 and $300 for a product is significant for most people, so budget-conscious users may gravitate toward Dragon Home when they first look for a speech-to-text program. It uses the same praiseworthy recognition engine as the Professional version, so it’s one of the most accurate speech recognition software applications ever made. But we find it difficult to recommend the Home version of Dragon because it’s a hamstrung product that lacks several fundamental features of a commercial speech recognition program.",
    "A purchase of Dragon Home will most likely lead to frustration. The lack of a robust vocabulary editor is the most egregious problem because you’re unable to remove a word from Dragon’s dictionary that it constantly gets wrong. User profile management is another feature that’s difficult to do without. Even if you don’t plan on using Dragon with multiple people’s voices, being unable to later export your user profile with all your customizations is annoying.",
    "You would also want to choose Dragon Professional if you need to transcribe from recordings, create custom commands, adjust your microphone more than once, or work with Microsoft Excel.",
    "Nuance seems to have created Dragon Home as a speech-to-text taster for those new to speech recognition, but there’s no way to upgrade to the Professional version in the future without shelling out full price and starting your speech profile again from scratch.",
    "In summary, Dragon Home lacks too many important features, so we recommend Dragon Professional for all users. If you find the $300 price of Dragon Professional too steep, we suggest using the free Windows Speech Recognition tool built into Windows 10 instead. It’s not as accurate as Dragon and can sometimes confuse dictated words for commands, but it has a feature set similar to Dragon Home. Otherwise, Dragon Professional is an excellent speech-to-text tool."
  ],
  "headers": {
    "3": "Features",
    "15": "Performance",
    "17": "Support",
    "20": "Pricing and plans",
    "22": "Verdict"
  },
  "links": {
    "Dragon Professional": "https://www.techradar.com/reviews/dragon-professional-v15-speech-to-text-software",
    "best speech to text software": "https://www.techradar.com/news/best-speech-to-text-app"
  }
}