{
  "source": "https://www.techradar.com/news/apple-watch-7-full-specs-revealed-in-a-leaked-document",
  "title": "Apple Watch 7 full specs revealed in a leaked document",
  "category": "wearables",
  "updated": "2021-09-17T09:50:02Z",
  "author": "james-rogerson",
  "summary": "A new chipset and a weightier build",
  "article": [
    "The Apple Watch 7 has been announced, but Apple didn’t announce a number of specs and details about the watch. Now though, we have a good idea of all the missing information, as a seemingly official specs list has leaked.",
    "Shared by @alixrezax on Twitter, the sheet handily compares the Apple Watch 7 to other recent Apple Watch models as well. The key bit of information here though is that the Apple Watch 7 has a new S7 chipset, confirming a recent leak.",
    "The sheet sneakily mentions that this is up to 20% faster than the chipset in the Apple Watch SE, in a seeming attempt to hide the fact that it’s no faster than the S6 chipset in the Apple Watch 6 (which is also up to 20% faster than the one in the Apple Watch SE).",
    "This sheet also lists 32GB of storage, as expected, and details the weight of the Apple Watch 7. Apparently the aluminum model is 32g in the 41mm size and 38.8g in the 45mm size, while the stainless steel version is 42.3g/51.5g for the 41mm and 45mm sizes respectively, and the titanium model comes in at either 37g or 45.1g.",
    "That makes the Apple Watch 7 slightly heavier than the Apple Watch 6, which makes sense given its larger screen.",
    "Most of the other details here had already been revealed, but with these gaps filled we now have a clear idea of what to expect from the Apple Watch 7 – assuming this specs list is right. As ever though with leaks we’d take this with a pinch of salt.",
    "We were expecting this to be a big year for the Apple Watch, with a whole new design rumored. That didn’t happen, and instead the main change was simply a larger screen with smaller bezels.",
    "That in itself is a significant upgrade, but as this specs list shows it’s about the only significant upgrade. The chipset is very similar, battery life is the same, the design – other than the size and weight – is unchanged, the speaker is no louder, the health and fitness features are as they were before, and so is the storage.",
    "The Apple Watch 7 charges a bit faster and has an IP6X dust resistance rating for the first time, but they’re hardly watch-selling features. So as with the iPhone 13 this isn’t a year of big changes for Apple’s wearable. Here’s hoping bigger things are planned for 2022.",
    "Via GSMArena"
  ],
  "headers": {
    "6": "Analysis: the Apple Watch 7 is all about the screen"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "@alixrezax": "https://twitter.com/alixrezax/status/1438187923535450121",
    "confirming a recent leak": "https://www.techradar.com/news/apple-watch-7-reportedly-has-a-new-chip-but-its-not-worth-getting-excited-about",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "GSMArena": "https://www.gsmarena.com/apple_watch_series_7_detailed_specs_appear_in_internal_datasheet-news-50985.php"
  }
}