{
  "source": "https://www.techradar.com/news/this-unreleased-microsoft-windows-operating-system-just-leaked-online",
  "title": "This unreleased Microsoft Windows operating system just leaked online",
  "category": "computing",
  "updated": "2021-01-05T00:22:32Z",
  "author": "anthony-spadafora",
  "summary": "You can download Windows Core Polaris now but good luck getting it running",
  "article": [
    "Developing a lightweight version of Windows 10 for low-performance devices is something Microsoft has been working on for some time now as shown by a leaked development build of Windows Core Polaris that recently appeared online.",
    "The software giant has been developing a modular version of Windows codenamed “Windows Core OS” since at least 2017. Microsoft planned to offer different versions of Windows to suit a number of form factors including phones, 2-in-1s, dual-screen PCs and even collaboration devices.",
    "The company initially created two versions of Windows using Windows Core OS: Andromeda for mobile devices and Polaris for laptops and desktops. However, Polaris was intended to replace Windows 10 S Mode as it was built with low-end devices in mind. For this reason, Microsoft wanted to remove legacy elements such as the Control Panel from Polaris.",
    "Polaris build 16299 for Arm devices was recently shared online without a Windows shell or apps by a leaker known as Scamdisk. In the build's read me, Scamdisk provided additional details and explained what it would take to get it running, saying:",
    "“This is PolarisOS. It's a cancelled edition of Windows Core OS that was designed for Desktops and Laptops. This image is early enough to not include much more than the OS itself. It comes with no shell, and won't load any. You need an ARM device to boot this, and you need to sideload drivers before first boot.”",
    "The build itself is from 2018 when Microsoft shifted its focus away from Windows Core OS to Windows Lite/Santorini which is now known as Windows 10X. In the end, the software giant ended up canceling both Polaris and Andromeda with Polaris being replaced by Windows 10X while Andromeda was replaced with Android on the Surface Duo.",
    "Windows users will finally get a chance to take Windows 10X for a spin later this spring and laptops and other devices running the new operating system should arrive by summer of 2021.",
    "Via BleepingComputer"
  ],
  "headers": {
    "3": "Polaris leak"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Windows Core OS": "https://www.techradar.com/news/windows-core-os-could-be-partially-open-source",
    "Windows 10 S Mode": "https://www.techradar.com/news/windows-10-cloud-release-date-news-and-rumors",
    "Polaris": "https://www.techradar.com/news/microsoft-is-building-a-lightweight-version-of-windows-10-called-polaris",
    "read me": "https://archive.org/details/16299.241.rs-3-release-svc-sec.-180102-2128#dl",
    "Windows 10X": "https://www.techradar.com/news/windows-10x",
    "Surface Duo": "https://www.techradar.com/reviews/microsoft-surface-duo",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/microsoft/microsofts-unreleased-windows-core-polaris-os-leaks-online/"
  }
}