{
  "source": "https://www.techradar.com/news/i-might-give-call-of-duty-warzone-another-chance-if-its-new-anti-cheat-system-works",
  "title": "I might give Call of Duty Warzone another chance if its new anti-cheat system works",
  "category": "gaming",
  "updated": "2021-11-25T20:27:15Z",
  "author": "gerald-lynch",
  "summary": "I can no longer blame my poor performance on aimbots",
  "article": [
    "I’m not very good at Call of Duty games. Put me in the campaign mode and I’ll shoot the AI soldier drones like fish in a barrel – I’ll watch the flashy set-pieces, giggle at the preposterous stakes and question the overall morality of it all (War? Huh? Yeah, what is it good for?). But then I’ll pass onto something else.",
    "I’m just not cut out for Call of Duty multiplayer. Which is a shame as, for pretty much everyone else, Call of Duty multiplayer is Call of Duty. But getting your arse handed to you time and time again just isn’t that fun.",
    "Which left me hopeful at new efforts coming out of the Call of Duty publisher Activision / Blizzard. It’s introducing Ricochet, a \"multi-faceted\" software mechanism designed to combat cheating, including \"new server-side tools which monitor analytics to identify cheating, enhanced investigation processes to stamp out cheaters, updates to strengthen account security, and more.\"",
    "It made me feel a bit like Principal Skinner from The Simpsons, if justified in his “No, it is the children who are wrong” monologue. Perhaps I could be good at Call of Duty, if these damn kids stopped cheating! Perhaps it’s not my ageing, slowing motor skills, but a load of jumped-up ne’er do-wells artificially inflating their frag counts with aimbots and add-ons! Perhaps, finally, the playing field will be levelled for the casual player like me.",
    "The key component of Ricochet is a kernel-level driver for PC, meaning that it gets high privileges to monitor what happens on your computer. It’ll sit in the background while you play a Call of Duty game on computers, and keep an eye out for dodgy applications that attempt to interact and manipulate Call of Duty\" to give players an unfair advantage. With crossplay now supported in Call of Duty titles, it’s something that will benefit console players too.",
    "There will be no getting around the feature either. “Once the kernel-level driver is deployed; it will be required to play Warzone,” reads the announcement post. Machine learning will also play a part in Ricochet – over time the system will be able to spot new emerging patterns that identify cheating behaviors, and stamp it out.",
    "In addition, Ricochet will encourage players to enable two-factor authentication security on their accounts, as hacked accounts tend to be those where cheaters run rampant, without fear of facing a ban on their own legitimate logins. Activision Blizzard is also encouraging players to continue to report cheaters, further bolstering its efforts to crack down on bad-faith players.",
    "With such high-level access to your computer, you may rightfully be wary of Activision Blizzard being able to monitor other elements of your computer activities. The developers believe kernel-level access has become important, though, as cheats use ever advancing techniques to bend the rules of the game.",
    "“Cheating software has become more sophisticated, allowing cheaters to circumvent traditional approaches to security,” reads Activision Blizzard’s FAQ.",
    "“A kernel-level driver allows for the monitoring of applications that may attempt to manipulate Call of Duty: Warzone game code, while it is running.",
    "“User-mode applications have limitations on access and monitoring, making it more likely for unauthorized software to manipulate game code or to circumvent security features.”",
    "Those looking for reassurance though will find comfort in the fact that the monitoring tool is only active while the associated Call of Duty games are running. They’ll power down when the game is closed, and monitoring will cease. It’s not “always-on”, and the data collected is only in relation to the Call of Duty experience. But it’s a like-it-or-lump it launch – there’s no separating Ricochet from Call of Duty, going forwards.",
    "Still, if it gives me a fighting chance, it’ll be worth it. I may never return to my FPS multiplayer glory days of Facility on Goldeneye, but perhaps I won’t be laboring over the respawn screen every five seconds, either.",
    "Ricochet Anti-Cheat will be coming to both Call of Duty: Vanguard and Call of Duty: Warzone when it launches later this year alongside the Pacific update for Warzone. The PC kernel-level driver will hit Warzone first before rolling out to Call of Duty: Vanguard “at a later date.”"
  ],
  "headers": {
    "4": "How Ricochet works",
    "7": "Privacy concerns"
  },
  "links": {
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review"
  }
}