{
  "source": "https://www.techradar.com/news/robinhood-raises-dollar1bn-from-investors-in-emergency-cover",
  "title": "Robinhood raises $1bn from investors in emergency cover",
  "category": "computing",
  "updated": "2021-01-29T12:00:40Z",
  "author": "mayank-sharma",
  "summary": "Meanwhile, several U.S. legislators have vowed to investigate the trading platform",
  "article": [
    "Popular online trading and investing app Robinhood has turned to its investors to infuse additional capital to the tune of $1 billion amidst the ongoing turmoil on its platform.",
    "Earlier on Thursday, the platform restricted the purchase of several stocks including GameStop, which had been driven to unusually high prices, mostly due to the r/WallStreetBets subreddit.",
    "As per reports, strained by this coordinated effort, Robinhood has turned to its investors to raise money in order to pay its customers as well as to shield its trading partners from losses.",
    "As it grappled to fulfill the orders of GameStop and other heavily traded stocks, Robinhood was forced to borrow a line of credit from six banks, reportedly to the tune of $600 million. Even that wasn’t enough according to reports that got the information from anonymous sources who were privy to the internal briefings at Robinhood.",
    "The platform then turned to its investors, including the venture capital firms Sequoia Capital and Ribbit Capital, who have reportedly agreed to pool together $1 billion for the platform in exchange for additional equity in the company at a discounted valuation.",
    "“This is a strong sign of confidence from investors that will help us continue to further serve our customers,” wrote Robinhood’s spokesperson Josh Drobnyk in an email to The New York Times.",
    "Meanwhile, Robinhood’s decision to restrict purchases was met with significant backlash, and there are reports of several U.S. lawmakers expressing displeasure and pledging to investigate the actions of the platform.",
    "Via: The New York Times"
  ],
  "headers": {
    "3": "Damage control"
  },
  "links": {
    "Robinhood": "https://www.techradar.com/reviews/robinhood",
    "The New York Times": "https://www.nytimes.com/2021/01/29/technology/robinhood-fundraising.html"
  }
}