{
  "source": "https://www.techradar.com/news/calling-all-brands-the-techradar-work-from-home-awards-process-has-begun",
  "title": "Calling all brands: the TechRadar Work From Home Awards process has begun",
  "category": "computing",
  "updated": "2021-05-14T15:08:03Z",
  "author": "carrie-ann-skinner",
  "summary": "We’re celebrating the best home-working tech in the market",
  "article": [
    "Over the last year we’ve spent more time at home than ever and for many of us that means our house now doubles as our office too. While the end of the pandemic is in sight, working from home looks set to become a regular fixture in our lives.",
    "So, having the best work from home tech is essential - not only so you’re as productive and as efficient as possible, but also to ensure your comfort and well-being is covered off too.",
    "With so much choice, we want to highlight the gadgets that move seamlessly between your home and work life, so we’re launching the TechRadar Work From Home Awards - and if you’ve made something you think is award-worthy, we want to hear from you.",
    "With categories such as workstation essentials, smart home gadgets, life organizing apps and wearables, communication devices, and fitness and wellbeing must-haves, the awards are here to give our readers the ultimate guide to the must-have devices integral to home working.",
    "The TechRadar editorial team will judge each award on a number of factors including innovation, efficiency, ease-of-use, suitability, aesthetics and overall value.",
    "We’re looking for the products that rise above the rest of their market sector and elevate your home working experience.",
    "The awards are open to anyone that’s created technology for home working; from well-known brands to boutique firms and even start-ups. Products can be nominated in a number of categories too, however, they must be available to purchase now, and have been released to market in the last 18 months (from 1st January 2020).",
    "The TechRadar editorial team will be testing shortlisted products too; so samples must be available to send to our offices in July for judging. The deadline for entries is Friday, 9 July but if you enter before May 28, you can take advantage of our early-bird savings.",
    "Find full details on how to enter can now be found over at our dedicated Work from Home Awards site - you can enter your product or products into as many categories as you like.",
    "We're looking for innovation, efficiency, ease-of-use, performance, suitability, aesthetics, and overall value across everything from workstation essentials, to life organizing apps, to fitness equipment, so get nominating if you think you’ve been a key help over the last year."
  ],
  "headers": {
    "4": "The judges",
    "6": "Who can enter?"
  },
  "links": {
    "Work from Home Awards site": "https://www.futureevents.uk/techradarwfhawards/1179869"
  }
}