{
  "source": "https://www.techradar.com/news/huawei-revenues-slump-as-consumer-business-struggles",
  "title": "Huawei revenues slump as consumer business struggles",
  "category": "computing",
  "updated": "2021-04-28T11:21:29Z",
  "author": "steve-mccaskill",
  "summary": "Huawei touts business resiliency but sales fall",
  "article": [
    "Huawei revenues fell by 16.5% to 152.2 billion Yuan (£16.9bn) during the first quarter of 2021 as the Chinese vendor’s ongoing challenges in the smartphone market continue to impact its balance sheet.",
    "The company’s network division continues to benefit from demand for 5G equipment in countries where it is not excluded from participating, especially in its homeland where all three operators are pursuing aggressive deployments.",
    "Domestic demand allowed Huawei to increase revenues and profits in 2020, but there is an understanding that this is not a long-term solution.",
    "Consumer business revenue declined in Q1, mainly due to US sanctions that limited the company's access to key technologies and components. Huawei also sold its Honor subsidiary to a group of Chinese investors, a move which has further reduced sales volumes.",
    "Despite this, profit margins increased by 3.8 percentage points to 11.1%. Huawei says this is thanks to efforts to improve efficiency as well as an increase in patent income. Earlier this year, the company said it would start demanding royalties on every 5G smartphone sold as it seeks to maximise the value of its patent portfolio.",
    "Additionally, Huawei plans to double down on its 5G investments and diversify its offering to compensate for any loss in revenue in the networking and mobile markets. Software development and electric vehicles are two examples of areas it believes it can make an impact.",
    "\"2021 will be another challenging year for us, but it's also the year that our future development strategy will begin to take shape,\" said Eric Xu, Huawei's Rotating Chairman. \"We thank our customers and partners for their ongoing trust. No matter what challenges come our way, we will continue to maintain our business resilience. Not just to survive, but do so sustainably. As always, we will remain focused on the needs of our customers and keep delivering practical business value.",
    "“As always, we remain committed to technological innovation and investing heavily in R&D as we work to address supply continuity challenges caused by restrictions in the market\", stressed Xu. \"We will continue making breakthroughs in basic science and pushing the frontiers of technology.\""
  ],
  "headers": {
    "3": "Huawei patents"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "sold its Honor subsidiary": "https://www.techradar.com/news/huawei-to-sell-the-honor-brand-heres-what-that-could-mean-for-your-next-phone"
  }
}