{
  "source": "https://www.techradar.com/news/xero-wants-to-help-your-employees-run-all-their-own-processes",
  "title": "Xero wants to help your employees run all their own processes",
  "category": "computing",
  "updated": "2021-10-18T22:00:42Z",
  "author": "anthony-spadafora",
  "summary": "Xero Me is quickly becoming an all-in-one employee self-service app",
  "article": [
    "Xero has announced a reimagined version of its employee self-service app Xero Me which now comes with integrated expenses technology to make it easier for both organizations and their employees to track their expenses.",
    "By integrating the company's Xero Expenses technology into Xero Me, small business employees using Xero Payroll in Australia, New Zealand and the UK will now be able to submit expense claims in the same place they access payslips, submit timesheets and manage leave requests.",
    "Executive general manager of business products at Xero, Simona Turin explained how the company's reimagined Xero Me app can benefit both small business owners and their employees in a press release, saying:",
    "“Processes like onboarding, leave and expense management are time-consuming but critical to the optimal performance of any small business. The Xero platform is designed to make life easier for small business owners — so we wanted to give them and their staff an even easier way to manage those fundamental employee processes.”",
    "The Xero Me app is quickly becoming the central place for employees to manage critical people processes themselves and Xero plans to add even more functionality into the app going forward.",
    "The reimagined app removes the need for employees to switch between multiple apps, systems and workflows for critical employee processes while creating a more seamless employee experience. Additionally, employers can ensure data is easily entered and stored in a single place.",
    "The new Xero Me experience is rolling out in stages to all of Xero's global customers. In countries outside of Australia, New Zealand and the UK, this will be with Expenses-only functionality. This will still allow global employees to use the app to quickly submit expense claims though Xero Me will soon offer the ability to complete self-service setup for expense management.",
    "Beginning this month, existing Xero Expenses app uses globally with a “Submitter” role will be able to download and transition to the reimagined Xero Me app to submit their expense claims. However, global Xero Expenses approvers and admins will still need to use the standalone Xero Expenses app to check and approve any claims."
  ],
  "headers": {
    "4": "Xero Me"
  },
  "links": {
    "Xero": "https://www.techradar.com/reviews/xero",
    "track their expenses": "https://www.techradar.com/best/best-expense-trackers",
    "timesheets": "https://www.techradar.com/best/best-time-and-attendance-systems",
    "press release": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1168130820346133000/https://www.xero.com/content/dam/xero/pdf/media-release/xero-me-expenses.pdf",
    "expense claims": "https://www.techradar.com/how-to/how-your-employees-can-claim-back-expenses-when-working-remotely"
  }
}