{
  "source": "https://www.techradar.com/news/nvidia-geforce-rtx-3050-release-date-price-and-mobile-version-what-do-we-know",
  "title": "Nvidia GeForce RTX 3050 release date, price and mobile version: what do we know?",
  "category": "computing",
  "updated": "2021-05-07T21:13:09Z",
  "author": "bill-thomas",
  "summary": "Could the RTX 3050 be on the way?",
  "article": [
    "The rumors pointing towards an Nvidia GeForce RTX 3050 hitting the market soon are starting to stack up. With Nvidia Ampere being around for a while now, this isn’t a surprise. Now that Nvidia has rolled out its high-end and mid-range offerings, it’s just about time to start expecting their budget counterparts.",
    "Currently, the RTX 2060 is the lowest-end graphics card to bear the RTX branding. Meanwhile, more affordable graphics cards like the GeForce GTX 1660 Ti had retained the GTX name from previous generations. So, it’s about time the Nvidia GeForce RTX 3050, along with the rest of the graphics card in its tier, shows up. And, hopefully, they’ll finally reveal Nvidia's strategy for the low-end market.",
    "The Nvidia GeForce RTX 3050 could be the perfect fit for esports gamers at 1080p that don't have the cash or need for something beefier like the RTX 3060 – not that you can really buy one right now anyway. In fact, full specifications for the rumored RTX 3050 Ti mobile graphics card have allegedly shown up in the GPU-Z database, corroborating this.",
    "With the graphics cards hitting the streets soon, we thought it would be best to gather the rumors in one place, and maybe do a little speculation, as a treat.",
    "The RTX 3050's predecessor, the GTX 1650, launched on April 23, 2019, about three months after the RTX 2060's January 15, 2019 release date. This year, the Nvidia GeForce RTX 3060 launched on February 25, so if the RTX 3050 is going to follow the same release schedule, that would put the new graphics card sometime in May.",
    "However, when the GTX 1650 launched in 2019, we weren't going through the same kind of graphics card shortage we're going through right now. It's entirely possible that Nvidia will push back the release of the RTX 3050 a month or two, just to build up enough supply for the increased demand that all graphics cards are facing right now.",
    "Nvidia did do that with the RTX 3060, after all, even though it wasn't enough to stop the RTX 3060 from immediately selling out. We doubt that Nvidia will wait too long to launch the graphics card, but right now we would put our money on a June 2021 RTX 3050 release date.",
    "One of the best things about Nvidia Ampere so far has to be that Nvidia hasn't really increased prices for the new graphics cards over their Turing equivalents. And, we doubt it's going to start with the RTX 3050.",
    "The Nvidia GeForce GTX 1650 launched for $149 (£149, AU$279) and basically stayed there over its lifespan. However, Team Green did refresh it with the GeForce GTX 1650 Super for a bit more at $159 (£159, AU$399). Because those two graphics cards were so close in price, we doubt Nvidia would go with the cheaper option – unless it was also planning to launch an RTX 3050 Ti – which rumors have suggested.",
    "Either way, it's probably safe to assume that the Nvidia GeForce RTX 3050 will fall somewhere around $150-$160, and if the performance is right, that would make it a great choice for budget gaming PCs and laptops.",
    "Right now, a lot of the rumors around the Nvidia GeForce RTX 3050 are pointing to a mobile version of the GPU, rather than the desktop graphics card that would typically launch first. In fact, we've heard next to nothing about the desktop version of the card at all.",
    "The most promising of these leaks comes from none other than Lenovo, which has leaked upcoming GPUs multiple times in the past. That rumor suggests that we're getting both an RTX 3050 Ti and a regular RTX 3050, both with 4GB of GDDR6, with the Ti version having slightly higher specs.",
    "We also saw a leaked Geekbench result show up back in March 2021, also pointing to a mobile version of an RTX 3050 Ti. Right now we wouldn't be surprised if the RTX 3050 mobile launches before the desktop graphics card version, even though that is exceedingly rare. At least that means you'll actually be able to buy the thing.",
    "Because all of the rumors we've seen about the RTX 3050 are about the mobile version of the GPU, that's what we have to base our speculation on for now.",
    "The Geekbench result we mentioned earlier talks about a GPU with 4GB of VRAM and 20 compute units. We're just going to assume that Nvidia didn't change the core layout that all other Ampere GPUs have, and assume that those 20 compute units contain a total of 2,560 CUDA cores. But that's for the Ti version.",
    "Another rumor suggests what we can expect from the regular RTX 3050, and that suggests that we're going to get 2,048 CUDA cores, which would be 16 Compute Units, but also with 4GB of VRAM.",
    "That rumor does include an actual game, though: Shadow of the Tomb Raider. In that game, the leaked results suggest that the RTX 3050 can score a solid 60 fps at 1080p with Ultra settings, where the RTX 3050 Ti scores 69 fps. If these results are accurate – and they're probably not – it means that the RTX 3050 Ti is about 15% faster. That's pretty massive.",
    "It's probably too soon to speculate too much on the desktop graphics card version of the RTX 3050, but it probably won't have exactly the same specs. You can just look to the RTX 3060 for an example. The desktop version of the RTX 3060 has 12GB of VRAM and 28 Compute Units, while the mobile version has less memory at 6GB but more CUs at 30.",
    "The desktop version makes up for the difference in Compute Units with a higher power budget, though.",
    "At the end of the day, we won't know the final specs for the Nvidia GeForce RTX 3050, or even how the desktop version will vary from the mobile version, until Nvidia actually unveils the graphics card. Until then, we can only speculate and keep an eye on rumors – and you can bet we'll do just that."
  ],
  "headers": {
    "4": "Nvidia GeForce RTX 3050 release date",
    "7": "Nvidia GeForce RTX 3050 price",
    "10": "Nvidia GeForce RTX 3050 mobile",
    "13": "Nvidia GeForce RTX 3050 specs"
  },
  "links": {
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "GeForce GTX 1660 Ti": "https://www.techradar.com/news/best-nvidia-geforce-gtx-1660-ti",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "specifications for the rumored RTX 3050 Ti": "https://www.techradar.com/news/nvidia-rtx-3050-ti-laptop-gpu-specifications-leak-in-full",
    "none other than Lenovo": "https://www.techradar.com/news/nvidia-geforce-rtx-3050-and-3050-ti-laptop-gpu-specifications-revealed-by-lenovo",
    "leaked Geekbench result": "https://www.techradar.com/news/nvidia-rtx-3050-ti-gpu-spotted-in-leak",
    "Another rumor suggests": "https://www.techradar.com/news/nvidia-rtx-3050-and-3050-ti-laptop-gpus-look-promising-in-leaked-benchmarks"
  }
}