{
  "source": "https://www.techradar.com/news/best-smart-plugs-and-switches",
  "title": "Best smart plugs and switches 2021: the top models we've tested",
  "category": "smart-home",
  "updated": "2021-12-02T12:21:15Z",
  "author": "carrie-ann-skinner",
  "summary": "These top smart plugs and switches will boost your smart home",
  "article": [
    "The best smart plug or switch is one of the easiest and most affordable ways to make your home start. They connect to the internet, and ensure any appliance connected to the plug, or controlled by the switch, can be switched on or off, even if you’re not close by.",
    "The best smart plugs are extremely easy to install - just connect one to an existing power outlet, however, the best smart switches are more fiddly and if you’re not qualified for home electrics, will require professional installation. Whichever of the two options you plump for, they’re both compact and won’t look out of place in your home.",
    "For those that are forgetful and often leave the house without switching off lights or appliances such as coffee makers and hair straighteners, smart plugs and switches are a great way to save energy (and money) as you can turn them off from your smartphone rather than leaving them running all day, or making yourself late by returning home to switch them off.",
    "Some models even monitor how much energy the appliance is using so you can see in real-time just how much it’s costing you to run the appliance. Read our article, do smart plugs save energy for more information.",
    "The best smart plugs and switches can not only be controlled by your smartphone - if you have one of the best smart speakers or smart displays, you can also use your voice to switch them on or off. They can also be set to work with some of the best smart home devices to create a cozy atmosphere in your home.",
    "Using just one command or tap on your smartphone, you can set your smart thermostat to raise the temperature a few degrees, the smart lights to dim and the kettle connected to a smart plug to start boiling ready for your pre-bed hot drink.",
    "There’s a wide range of smart plugs and smart switches on the market, which may leave you feeling confused about which is best for you, so we’ve put an array of models from brands including Eve, TP-Link, Amazon, and Ikea to the test to discover just which is the best smart plug and switch for you.",
    "To identify the best smart plugs and switches you can buy right now, we evaluate how easy they are to install and control. We assess how responsive they are to being controlled from a smartphone, both when we’re away from home and close by. We also check which voice assistants each model integrates with and whether they integrate with Alexa, Google Assistant or Siri, and how effectively Alexa, Google Assistant and Siri respond to commands related to the smart plug.",
    "We also evaluate each design on how durable it is, and any extra features such as energy monitoring and Away modes that control the plug at random times in a bid to simulate occupancy. We also assess any extra kit such as hubs that’s also available for the smart plugs and consider whether it requires reading a thick instruction manual before use.",
    "Smart plugs allow you to power an electrical socket on or off from your smartphone, even when you’re not at home. Some use Bluetooth to allow you to use an app on your smartphone to control them, while others connect to Wi-Fi and use internet access to relay the command.",
    "Smart plugs come in two styles; the simplest and most common versions plug into an existing power outlet, with the likes of Amazon, Philips Hue, We-Mo, and even IKEA producing this design of smart plug.",
    "Alternatively, opt for a smart outlet that replaces your existing power outlet. However, you won’t have as many models of this type of smart plug to choose from, and you’ll need to access your home’s wiring to replace these, which will mean calling in a professional. Find out more in our article What is a smart plug, and how it can stop your fear of leaving the coffee maker on?",
    "Smart plugs can save you money, but only if you’re the sort of person that forgets to turn off electrical devices. For example, if you leave your laptop constantly on charge, even when the battery is full it will continue to use energy, or perhaps you regularly forget to turn side lamps, or the radio off when you leave the room? If so, then using a smart plug could be the answer.",
    "Many smart plugs snd smart switches will work with Amazon Alexa, as well as Google Assistant and Siri so you can use your voice to control the gadgets, either by asking a smart speaker, or smart display, or by using the voice assistant on your smartphone or tablet.",
    "You can also create automations controlling several smart home devices at once with one command, or when a certain situation happens. For example, if your home security camera detects motion, a DAB radio connected to a smart plug could switch on or a smart switch will automatically illuminate the lights, to give the impression there’s someone at home.",
    "It’s worth noting that not all smart plugs and smart switches work with all voice assistants, so if your smart home is well established, make sure you opt for a model that integrates with your current setup."
  ],
  "headers": {
    "7": "How we test smart plugs",
    "9": "What are smart plugs and how do they work?",
    "12": "Do smart plugs save energy?",
    "13": "Do smart plugs and smart switches work with Alexa (and other voice assistants)"
  },
  "links": {
    "coffee makers": "https://www.techradar.com/best/best-coffee-machines",
    "do smart plugs save energy": "https://www.techradar.com/news/do-smart-plugs-save-energy-and-why-they-can-stop-you-wasting-money",
    "best smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "smart displays": "https://www.techradar.com/best/best-smart-displays",
    "best smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "smart thermostat": "https://www.techradar.com/news/best-smart-thermostat",
    "smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "What is a smart plug, and how it can stop your fear of leaving the coffee maker on?": "https://www.techradar.com/news/what-is-a-smart-plug-and-how-it-can-stop-your-fear-of-leaving-the-coffee-maker-on",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "smart display": "https://www.techradar.com/best/best-smart-displays"
  }
}