{
  "source": "https://www.techradar.com/news/nvidia-rtx-3000-founders-edition-gpus-might-be-getting-discontinued-in-europe",
  "title": "Nvidia RTX 3000 Founders Edition GPUs might be getting discontinued in Europe",
  "category": "computing",
  "updated": "2021-01-30T14:33:09Z",
  "author": "jess-weatherbed",
  "summary": "Floundering Founders Edition",
  "article": [
    "Update: Nvidia has since reached out to us to confirm that the removal of the GPUs was down to a caching error. You can still purchase the Founders Edition RTX 3000 series on the Nvidia website throughout Europe. Getting your hands on the latest Nvidia RTX 3000 graphics cards is proving to be almost impossible for many folks, as low stock and high demand have resulted in some sites relying on lottery systems to fairly distribute the GPUs. Things aren't looking good for European PC gamers either, with the Founder Edition GeForce RTX 30 series cards being silently removed from online stores.",
    "No announcement was made to explain the Ampered-powered GPUs being delisted from the Nvidia website, though the current speculation is that the removal is due to the extremely limited supply, and that they could return when stock quantity has increased. Nvidia doesn't sell the GPUs directly via its website in all EU countries, with some regions directing the sales to trusted third-party vendors. The Founders Edition cards are no longer listed on any other European website, with external links instead being provided in its place. Currently, only the Polish Nvidia site still lists an RTX 3090 Founders Edition, but this is marked as 'sold out'. A large selling point of the Founders Edition RTX graphics cards is the lower MSRP (or manufacturers recommended selling price), with Nvidia listing the GPUs for sale on its own site at the prices announced at launch.",
    "Many third-party retailers can increase the price as they see fit (which during stock shortages can get pretty eye-watering), and manufacturers creating their own reference cards based on the ampere hardware can set their own prices.",
    "With the Founders Edition cards no longer being available directly through Nvidia, European customers will have to pay more to experience the latest ray tracing hardware. We're keeping our fingers crossed that this isn't the start of discontinuation and the GPUs will return to the Nvidia website.",
    "In the meantime, if you’re on the hunt for an Nvidia graphics card, we’ve got some handy where to buy guides for the RTX 3060 Ti, RTX 3070 and RTX 3080, articles that are worth keeping an eye on as we regularly update them to flag up when stock arrives. Similarly, on the AMD front, keep tabs on our guides for buying the RX 6800, RX 6800 XT, and RX 6900 XT.",
    "Via Videocardz"
  ],
  "headers": {
    "1": "Pay more to play more"
  },
  "links": {
    "Nvidia RTX 3000": "https://www.techradar.com/news/nvidia-ampere",
    "lottery systems": "https://www.techradar.com/news/newegg-introduces-new-lottery-system-for-scarce-ps5s-rtx-3080s-and-more",
    "RTX 3060 Ti": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-ti-find-stock-here",
    "RTX 3070": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3070-find-stock-here",
    "RTX 3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "RX 6800": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6800-find-stock-here",
    "RX 6800 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6800xt-find-stock-here",
    "RX 6900 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6900-xt-find-stock-here",
    "Videocardz": "https://videocardz.com/newz/nvidia-no-longer-lists-geforce-rtx-30-founders-edition-in-europe"
  }
}