{
  "source": "https://www.techradar.com/news/samsungs-new-wear-os-smartwatch-software-will-debut-at-mwc-next-week",
  "title": "Samsung’s new Wear OS smartwatch software will debut at MWC next week",
  "category": "phones",
  "updated": "2021-06-23T00:16:19Z",
  "author": "axel-metz",
  "summary": "Get ready for a new ‘Galaxy Experience’",
  "article": [
    "Samsung will show off its new Wear OS experience for the first time at this year's Mobile World Congress (MWC) event, set to take place on Monday, 28 June.",
    "In a tweet, the tech giant confirmed its plans to virtually debut the new ‘Galaxy Experience’ – alongside an image suggesting the Galaxy Watch 4 may be used to showcase the new interface.",
    "The reveal will mark the first time consumers get to see Samsung’s unified Wear platform in action, following the company’s merging of its Tizen OS with Google’s Wear OS into a single smartwatch offering.",
    "So, what are we expecting from the new platform? In short, we’re hoping the software will provide faster chipset speeds, longer battery life and better overall performance. Plus, merging Tizen and Wear OS should mean a broader range of apps for compatible devices.",
    "As well as showcasing how it plans to \"re-imagine smartwatches,\" though, Samsung will also detail big security enhancements for the Galaxy ecosystem.",
    "But given that this isn’t an Unpacked event, there’s no telling whether the company will unveil any new devices. It did specify plans to showcase \"how the Galaxy ecosystem of connected devices is set to provide people with even greater possibilities for enriching their lifestyles,\" mind – which could mean anything.",
    "We’re quietly hopeful, too, thanks to the devices teased in the PR photo associated with the MWC Virtual event. In the image, we can see what looks like the Galaxy Z Fold 3, a smartphone which could be the Galaxy S21 FE, as well as the new Galaxy Tab S8.",
    "Of course, these new products may not get launched at MWC 2021, but there’s a chance that one or all of them could be. Most are rumored for later in 2021, though, so maybe don’t hold your breath for any of these gadgets.",
    "The Samsung Galaxy livestream is scheduled to take place at 13:15 ET (10:15 PT / 18:15 BST) on Monday, June 28 (which is 03:15 AEST June 29 in Australia), and you’ll be able to tune in via the company’s YouTube channel.",
    "Samsung followed the likes of Sony, Ericsson, Nokia and several other companies in dropping out of the physical MWC 2021 event amid ongoing Covid-19 concerns, though many brands will maintain a digital presence.",
    "The event typically attracts around 100,000 attendees, but this year the GSMA (the show’s organizers) are only aiming for around 50,000, with many companies and countries facing travel restrictions.",
    "Elsewhere, IFA 2021, the world's leading trade show for consumer and home electronics, has been cancelled due to ‘global health concerns’. It was due to take place in September as a full-scale live event in Berlin.",
    "It was thought IFA’s cancellation might trigger a domino effect for the remaining large-scale trade shows like MWC, but at the time of writing, the mobile showcase event remains scheduled to go ahead."
  ],
  "headers": {
    "9": "Let's get digital"
  },
  "links": {
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "MWC": "https://www.techradar.com/news/mwc-2021-news",
    "tweet": "https://twitter.com/SamsungMobile/status/1406945000349388808",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "showcasing": "https://www.mwcbarcelona.com/agenda/session/galaxy-ecosystem-new-watch-experience-mobile-security",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "YouTube": "https://www.youtube.com/Samsung",
    "cancelled due to ‘global health concerns’": "https://www.techradar.com/news/ifa-2021-cancelled-due-to-global-health-uncertainties"
  }
}