{
  "source": "https://www.techradar.com/news/the-notepad-app-is-getting-an-overdue-update-for-windows-11",
  "title": "The Notepad app is getting a much-needed Windows 11 update",
  "category": "computing",
  "updated": "2021-10-11T10:45:39Z",
  "author": "mike-moore",
  "summary": "Microsoft employee leaks screenshots of Notepad for Windows 11",
  "article": [
    "One of the most-loved Microsoft apps is getting an upgrade for the release of Windows 11 after details of the new Notepad tool were leaked online.",
    "Images of the new Notepad app for Windows 11 appear to have been posted online (and then swiftly deleted) by a Microsoft employee, showing a significant upgrade for an app used by millions across the world every day.",
    "The updates include a new command bar and a significant visual makeover that brings Notepad up to scratch alongside the stylish upgrade given to other Windows 11 apps.",
    "Notepad was already set to see a major refresh for Windows 11, not least in terms of becoming an optional app for Microsoft's latest release.",
    "According to the screenshots, the new Windows 11 app will be getting a similar design change to mirror many of the new platform's tools, with rounded corners on the app window, menus, and pop-up notifications.",
    "The leak also appeared to show that Notepad will be getting new icons, animations and a dedicated settings page, rather than the latter being hidden in the Help menu. The Settings page will allow users to choose and change the theme for the app (including dark mode), as well as the font setting (style, family and size) and certain parts of the file editing experience - allowing more file types to be accessible.",
    "The app is also set to become a separate Store-updateable application, with its own section and page on the Microsoft Store, meaning users can download and update Notepad whenever they choose, and also that Notepad users will be able to receive new features and upgrades automatically via the Microsoft Store as soon as they are available, rather than needing to wait for new additions to be bundled with a wider Windows OS update.",
    "Notepad has come automatically installed in Windows since version 1.0 of the operating system was released back in 1985, with sister program WordPad was automatically installed beginning in 1995 as part of the Windows 95 operating system.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Windows 11 Notepad"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Notepad": "https://www.techradar.com/news/notepad-will-soon-tell-you-if-theres-an-windows-10-update-available",
    "an optional app for Microsoft's latest release": "https://www.techradar.com/news/this-much-loved-windows-10-app-is-set-to-get-a-significant-upgrade",
    "Windows Latest": "https://www.windowslatest.com/2021/10/10/microsoft-accidentally-shows-off-new-notepad-for-windows-11/"
  }
}