{
  "source": "https://www.techradar.com/news/how-to-watch-earwig-and-the-witch-online-stream-new-studio-ghibli-movie-on-hbo-max",
  "title": "How to watch Earwig and the Witch: stream full new Studio Ghibli movie online today",
  "category": "computing",
  "updated": "2021-03-10T12:20:45Z",
  "author": "aatif-sulleyman",
  "summary": "Iconic Japanese studio's latest film is out now on HBO Max",
  "article": [
    "10-year-old Earwig was left at St Morwald's orphanage as a baby... and she loves it there. The very last thing Earwig wants is to be adopted, but one day an odd couple comes knocking, and she's taken away to be a workhorse for Bella Yaga, a selfish witch who's struggling with her spells, and the demonic Mandrake, who must never be disturbed. Read on as we explain how you can watch Earwig and the Witch online and stream the new Studio Ghibli film on HBO Max today.",
    "How is she supposed to escape such powerful clutches? Earwig is smarter than her captors realize, and she has some hidden talents up her sleeve - talents she may have inherited from her mysterious mother.",
    "\"A hole left by a witch can only be filled by a witch,\" warns The Mandrake, as Earwig, with a little help from Thomas the talking cat, begins to plot her revenge and piece together the events that led to her winding up at the orphanage.",
    "Based on the children's book by Diana Wynne Jones, who also wrote the materials that the brilliant, bonkers Howl's Moving Castle was based on, Earwig and the Witch is Studio Ghibli's first ever 3D CG animated release, something that's generated a surprising amount of controversy.",
    "But though it may look a little different, Earwig is a true Studio Ghibli hero, a pocket-sized bundle of mischief with an inspirational spirit of determination. Here's how to watch Earwig and the Witch online and stream the latest from the iconic Japanese outfit wherever you are right now,"
  ],
  "headers": {
    "5": "How to watch Earwig and the Witch: release date in Australia"
  },
  "links": {}
}