{
  "source": "https://www.techradar.com/news/the-five-most-watched-super-bowls-ever",
  "title": "The five most watched Super Bowls ever",
  "category": "entertainment",
  "updated": "2021-01-29T20:05:32Z",
  "author": "tabitha-baker",
  "summary": "The biggest of the big games",
  "article": [
    "If you're reading this, you're likely going to be watching a Super Bowl live stream on Sunday, February 7... and you likely know plenty of others who will be too. The NFL championship game is one of the biggest sporting events of the year, and with fierce fan loyalties and even fiercer team rivalries booked in for one night every year, there have been some monumental broadcasts in the league's history and some eye-watering Super Bowl ratings.",
    "Of course, not all Super Bowls are made equal. Some only see the Rams score three points in the whole game, and some see the Patriots whistling in a final overtime touchdown to finish off a 25-point comeback. However, it's often the stories and histories around each matchup that make for the best broadcasts, and the battles with the most grit behind them often yield the highest viewer counts and Super Bowl ratings.",
    "So, which Super Bowls were the most watched of all time? These championships occupy the vast majority of American TV's most watched broadcasts, and we're counting down the top five most watched matchups by average viewer count of them all. According to Nielsen Media Research data, these figures represent the average number of viewers to watch each big game, with the numbers reflecting an assumption of at least two viewers per household.",
    "With 114.44 million viewers, 2015's Super Bowl XLIX is the most watched NFL championship in history. The Seattle Seahawks, defending champions, were back on the field after taking the victory in 2014, but running against them the Patriots would ultimately steal the win with an incredible final piece of defence. It was a game that held all those viewers on the edge of their seats, with a halftime tie at 14-14 before the Patriots edged a lead, hitting 28-24 moving into the final two minutes of the game.",
    "26 seconds to go and the win is within reach for Seattle. Lined up at the 1-yard line and poised to bring the Lombardi home once again, Russell Wilson makes a contentious and heart wrenching pass, only for it to be picked by Patriots rookie Malcolm Butler. The interception won the Patriots their first Super Bowl in 10 years.",
    "It was a good job, then, that Super Bowl XLIX wasn't only the most watched Super Bowl in history, but is also the most watched single-network broadcast in US TV history. Even if you weren't grinding your teeth at the white knuckle finale, you'll have definitely noticed a charming left shark claiming its NFL debut in Katy Perry's halftime performance.",
    "A year before Seattle endured that final second loss, they were celebrating at the MetLife Stadium in New Jersey. They had just secured the first Super Bowl victory that saw a winner taking home more than 40 points while holding their opponents under 10. It simply wasn't to be for the Denver Broncos, even though they matched the Seahawks as first seed in their division and offered an even greater spectacle by bringing the league's top offense to play against the reigning defense.",
    "With such a close matchup on the cards, it was little wonder 112.19 million viewers tuned into the championship on Fox, though the catastrophic result for the Broncos was a little more surprising on the night.",
    "The Broncos were back in the saddle for 2016's Super Bowl 50, however, and 111.86 million viewers watched them claim their victory over the Carolina Panthers. It was a historic year, with the NFL marking its 50th championship and Beyonce gracing the halftime stage.",
    "The Panthers had come off the back of their best season in franchise history - winning 15 out of their 16 matchups. Nevertheless, the Broncos were still running hot after stealing the Super Bowl slot from the Steelers, scoring an incredible 11 points in the final minutes of the precursory divisional. Taking an early lead from the start, Denver was labelled the underdog for all of the first quarter.",
    "2012's Super Bowl saw a grinding battle between the New York Giants and the New England Patriots - a battle that would end with an 88-yard drive in the final minutes of the game to ultimately secure the Giants another Super Bowl win against New England.",
    "The game recorded not only 111.35 million viewers when broadcast on NBC, but also yielded the most tweets per second for any sporting event so far. With such a historic rivalry, not only in football but in the heated grounds of baseball, the Boston and New York teams were well equipped to draw a crowd for the 46th Super Bowl - especially seeing as the ultimate victors were entering the championship with just a 9-7 record under their belts.",
    "2017 was the year the Patriots set the record for Super Bowl appearances, taking to the field for the ninth time and facing off against the Atlanta Falcons. It would make for a historic night, with an outcome few would have guessed at the time Lady Gaga took to the halftime stage. In fact, many of those 111.32 million viewers may have switched over early, with Atlanta's explosive 21-3 lead only getting stronger in the first minutes of the third quarter.",
    "What followed was the largest comeback in Super Bowl history, with Tom Brady leading the patriots to score after score, eventually evening out with a 28-28 stalemate - introducing the Super Bowl's first ever overtime.",
    "The Patriots ultimately scooped the win in their first drive out of regulation and the legend of Atlanta's blown Super Bowl win was born."
  ],
  "headers": {
    "3": "1. Super Bowl XLIX: 114.44 million viewers on NBC",
    "6": "2. Super Bowl XLVIII: 112.19 million viewers on Fox",
    "8": "3. Super Bowl 50: 111.86 million viewers on CBS",
    "10": "4. Super Bowl XLVI: 111.35 million viewers on NBC",
    "12": "5. Super Bowl LI: 111.32 million viewers on Fox"
  },
  "links": {
    "Super Bowl live stream": "https://www.techradar.com/news/watch-super-bowl-live-stream-2021-free-online",
    "Nielsen Media Research": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1493793863183904000&xs=1&url=https%3A%2F%2Fwww.nielsen.com%2Fus%2Fen%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-five-most-watched-super-bowls-ever"
  }
}