{
  "source": "https://www.techradar.com/news/wix-will-offer-gift-cards-and-store-create-solutions-after-riseai-acquisition",
  "title": "Wix will offer gift cards and store create solutions after Rise.ai acquisition",
  "category": "computing",
  "updated": "2021-05-05T13:30:31Z",
  "author": "abigail-opiah",
  "summary": "Wix grabs reigns on eCommerce offering",
  "article": [
    "Leading website builder Wix is taking a stab at customer re-engagement solutions for its online brands after acquiring gift card and store credit solution provider Rise.ai for an undisclosed sum.",
    "Wix is now hoping to extend its eCommerce platform to offer a full solution of merchants to manage customer re-engagement activities.",
    "Specifically, the new offering, which will be available in all Wix's supported countries and currencies, will be aimed as increasing customer spending and repurchasing in areas including gift cards, loyalty programs, rewards and referrals.",
    "Speaking on the acquisition and what it will mean for the Wix platform going forward, David Schwartz, VP of Product at Wix told TechRadar Pro that the company had looked at many products offering similar services but felt that Rise.ai was the best on the market right now.",
    "\"Our goal behind this was to create the best customer retention eCommerce platform that is out there,\" Schwartz added.",
    "\"We have been working with Rise.ai so closely, which will enable us to integrate their solution seamlessly into our system. It will eventually not be a plugin but will be part of our eCommerce product.\"",
    "The Wix eCommerce platform provides merchants with a full solution to create and manage their eCommerce business to sell online and in person.",
    "This means merchants have the ability to sell through multiple sales channels including web and mobile storefronts, social media, online marketplaces and physical retail locations.",
    "Arik Perez, Head of Wix eCommerce said: “We are excited to expand our offering and services as part of the Wix eCommerce strategy.",
    "“By providing merchants with more native tools, we can help them grow long-term customer value and revenues to build their businesses and keep optimizing and increasing profitability.",
    "\"Rise.ai is considered to be the best solution of its kind in the market, and the integration will enable merchants to easily manage and maintain customer engagement tools, ultimately leading to increased loyalty and revenue.”"
  ],
  "headers": {
    "6": "eCommerce via Wix"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Wix": "https://www.techradar.com/reviews/wix",
    "eCommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform"
  }
}