{
  "source": "https://www.techradar.com/news/ipad-pro-2021-could-land-in-march-with-a-mini-led-screen",
  "title": "iPad Pro 2021 could land in March with a Mini LED screen",
  "category": "tablets",
  "updated": "2021-02-19T12:28:09Z",
  "author": "james-rogerson",
  "summary": "But only on one model",
  "article": [
    "Following recent reports that Apple could soon launch an iPad Pro with a Mini LED screen, we’re now hearing the same again, but this time the source gets more specific, saying that the tablet will land in March.",
    "That’s according to Macotakara (an Apple-focused Japanese site), which claims that based on information from Chinese suppliers we’ll see both 11-inch and 12.9-inch models of the iPad Pro 2021, but only the larger 12.9-inch one is likely to have a mini LED display.",
    "The site seems to have come to this conclusion based on the 12.9-inch model apparently being 0.5mm thicker than its predecessor (which would make it 6.4mm thick), but it doesn’t outright say that the slate will have a Mini LED screen, only (via Google Translate) that “it may be an option.”",
    "Mini LED is a type of backlighting that can improve the contrast ratio and color reproduction of an LCD screen, so the move to using it should make for a noticeable visual upgrade.",
    "The site additionally claims that the speaker hole positions on these upcoming slates are different to on their predecessors and that the number of speaker holes has been reduced by two thirds. Presumably that will affect the audio in some way.",
    "Finally, the site adds that the overall design will be similar to the iPad Pro 2020, but that while the protrusion of the camera unit won’t change, the actual lens glass will now be flush with it.",
    "It sounds then like Apple is simply making a few slight refinements to the look of its slates, but along with the possibility of a Mini LED screen on one of them we’d also expect power upgrades, and potentially other under-the-hood improvements.",
    "If the iPad Pro 2021 range really is launching in March (which would make sense, as it would be a year after the iPad Pro 2020), we should know exactly what it will offer soon.",
    "Via 9to5Mac"
  ],
  "headers": {
    "3": "A mini upgrade"
  },
  "links": {
    "recent reports": "https://www.techradar.com/news/new-ipad-pro-could-land-soon-with-a-mini-led-screen",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "Macotakara": "http://www.macotakara.jp/blog/rumor/entry-40808.html",
    "iPad Pro 2020": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "9to5Mac": "https://9to5mac.com/2021/01/07/rumor-new-ipad-pro-coming-in-march-thicker-12-9-inch-model-with-mini-led-display/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+9To5Mac-MacAllDay+%289+to+5+Mac+-+Apple+Intelligence%29"
  }
}