{
  "source": "https://www.techradar.com/news/prime-gaming-may-2021-brings-more-free-loot-for-fall-guys-madden-and-more",
  "title": "Prime Gaming May 2021 brings more free loot for Fall Guys, Madden 21 and more",
  "category": "gaming",
  "updated": "2021-04-29T13:00:00Z",
  "author": "rhys-wood",
  "summary": "Another month, another round of Prime Gaming loot",
  "article": [
    "May’s just around the corner, which means Prime Gaming has prepped another month full of free games and loot for existing titles in your library. Prime Gaming’s May offerings include exclusive loot for Madden NFL 21, Rainbow Six Siege and more, alongside five more free games to add to your Prime Gaming backlog. GTA Online players can still claim $1 million of in-game cash across May, too.",
    "The ever-popular multiplayer online battle arena, League of Legends, continues to get mystery skin shards throughout May. Superb multiplayer shooter Rainbow Six Siege is also getting more Renown Boosters, with one pack available now until May 20, and more drops for the game coming afterward.",
    "If you prefer stadiums to shooters, though, FIFA 21 players can now receive a FIFA Ultimate Team card pack, while later in May, Madden NFL 21 players can grab an 89-95 OVR NAT Past draft player.",
    "Wacky competitive platformer Fall Guys has more Prime Gaming loot through the month of May, where players can snag the Fitness Fiesta costume and three Crowns to spend in the game’s store, which might be ideal if you struggle to win often. Grab this Fall Guys pack as soon as you can, though, as this loot expires on May 20.",
    "If you’re after a list of everything available in May, Prime Gaming’s official website has a rundown of everything currently on offer, as well as the free games you’ll be able to download to your Prime Gaming account at no extra cost.",
    "Speaking of those games, from May 3, Prime subscribers can check out Yoku’s Island Express, Beholder, The Blind Prophet, Healer’s Quest and A Blind Legend, a game notable for relying entirely on audio to progress through it. All these and more can be found in the Prime Gaming library to play for free.",
    "Previously known as Twitch Prime, Prime Gaming is a service that’s a part of your Amazon Prime account, meaning you can try it out at no extra cost to your monthly subscription fee. Prime Gaming offers one monthly Twitch subscription to a streamer of your choice, as well as a monthly roundup of free games and exclusive in-game loot.",
    "If you’re not on PC, console gamers can check out some of Prime Gaming’s loot offerings, too. Multiplayer titles like Fall Guys, Apex Legends and Rainbow Six Siege regularly make use of this feature, meaning you won’t be left out if you game on PS5 or Xbox Series X/S.",
    "Prime Gaming is definitely worth checking out if you’re already an Amazon Prime subscriber. But if you’re not one already, and you’re keen to try it out, look to the links below to access a 30-day free trial of Amazon Prime alongside monthly and yearly subscription costs."
  ],
  "headers": {
    "6": "Prime yourself for the action"
  },
  "links": {
    "Madden NFL 21": "https://www.techradar.com/reviews/madden-21",
    "League of Legends": "https://www.techradar.com/how-to/league-of-legends-a-beginners-guide",
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "Fall Guys": "https://www.techradar.com/how-to/fall-guys-tips-guide",
    "Prime Gaming’s official website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8799874236360975000&xs=1&url=https%3A%2F%2Fgaming.amazon.com%2Fhome&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fprime-gaming-may-2021-brings-more-free-loot-for-fall-guys-madden-and-more",
    "Twitch Prime": "https://www.techradar.com/news/twitch-prime-is-now-prime-gaming-will-keep-serving-up-free-gaming-goodies",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}