{
  "source": "https://www.techradar.com/news/halo-infinite-player-feedback-is-already-starting-to-shape-the-game-in-a-positive-way",
  "title": "Halo Infinite player feedback is already starting to shape the game in a positive way",
  "category": "gaming",
  "updated": "2021-09-07T09:32:57Z",
  "author": "adam-vjestica",
  "summary": "Threat detected",
  "article": [
    "Halo Infinite’s technical preview wasn’t just a great exercise for developer 343 Industries to test server loads and address critical bugs. It’s also proving to be an invaluable source of early player feedback – and it’s already impacting the game’s development in a positive way.",
    "In the technical preview, Halo Infinite’s radar would only highlight enemies who were sprinting or shooting, and operates more like a ‘Threat Tracker’ than a motion tracker in this regard. Traditionally, the radar in Halo has only detected motion, and players could go undetected if they were either standing still or crouch-walking.",
    "It turns out that many players missed the classic motion tracker of old, and it’s something that 343 Industries plans to change for social playlists in particular.",
    "\"The Combat Sensor, or radar, that sits in the bottom left of your HUD followed a different set of rules than previous Halo titles,\" the Halo Infinite multiplayer team explained. \"It only displayed enemies when they were sprinting or shooting, which was more in line with Halo 5's 'Threat Tracker.' We knew that this implementation was going to feel different, maybe even a little contentious, and that's why we wanted to get feedback on it as soon as possible in the Tech Preview.\"",
    "Of course, not everyone disliked the new radar. 343 said “most players” preferred the old motion tracker. However, the team added: “We’ve updated the Combat Sensor to feel more like the ‘Motion Tracker’ of old, which shows all movement besides crouch-walking, and should have that ready for folks in the next flight.”",
    "Changes to how the radar works aren’t the only player feedback that is being implemented. A whole host of other requested features has been logged by the team at 343 Industries, such as including adding an auto-sprint option and improvements to the Drop Wall pickup. You can check out the full list of feedback in this detailed blog post on Halo Waypoint.",
    "With Halo Infinite set to be released on December 8, 2021 the opportunity to get the game in players’ hands early is a fantastic way of squashing any pre-launch bugs and improving the experience ahead of launch.",
    "The technical preview will have already proved invaluable for 343 Industries, and it’s clear that some features have been extremely well received like the Grappleshot, while others need a bit of refinement.",
    "With Halo Infinite’s multiplayer going free-to-play for the first time in the series, as well as support for cross-play and cross-progression across Xbox consoles and PC, collating real-world feedback will be vitally important to 343 if they want to ensure a smooth and successful launch. It’s likely that Halo Infinite will attract a huge audience due to being free-to-play, so the more work that can be done to improve the game, the better.",
    "Halo Infinite will be available on Xbox One, Xbox Series X|S, and PC. It’ll also be free to Xbox Game Pass and Xbox Game Pass Ultimate subscribers on day one."
  ],
  "headers": {
    "6": "Analysis: there’s nothing better than feedback from fans"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "blog post": "https://www.halowaypoint.com/en-us/news/technical-preview-outcomes",
    "free-to-play": "https://www.techradar.com/news/gaming/top-40-best-free-games-you-should-play-today-695473",
    "cross-play and cross-progression": "https://www.techradar.com/news/halo-infinite-will-let-you-jump-seamlessly-between-xbox-series-x-and-pc",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate"
  }
}