{
  "source": "https://www.techradar.com/news/chrome-incognito-mode-just-became-even-more-private-but-only-for-some-users",
  "title": "Chrome Incognito mode just became even more private, but only for some users",
  "category": "computing",
  "updated": "2021-06-22T21:16:31Z",
  "author": "anthony-spadafora",
  "summary": "iOS users can now lock Incognito tabs using Face ID",
  "article": [
    "Google's Incognito mode in Chrome is now even more private on iOS thanks to the inclusion of a new experimental privacy feature that can prevent others from looking at your Incognito tabs.",
    "Users of the search giant's browser will often switch to Incognito mode when visiting sensitive sites that they don't want to save cookies from or have show up in their browsing history.",
    "Back when this feature was first introduced in 2008, it was much easier to keep prying eyes away from the screen of your desktop or business laptop. However, now if a user leaves their smartphone unlocked while browsing in Incognito mode, another person could easily see what tabs they have open.",
    "In order to prevent others from snooping on your Incognito tabs, Google has added a new experimental feature to Chrome for iOS that allows users to lock Incognito mode using Apple's Face ID authentication feature. Once enabled, the browser will now prompt a user to authenticate using Face ID when trying to open Incognito tabs in Chrome.",
    "After unlocking Incognito mode with Face ID in Chrome, iOS users won't have to unlock it again until they close and reopen their browser.",
    "Since this is an experimental feature that is still being tested by Google, users interested in protecting their privacy further when using Incognito mode on iOS will first need to enable it from the chrome://flags page.",
    "To get started, you'll first have to open Chrome and enter chrome://flags in the address bar and press go. Once the Chrome 'Experiments' page opens, search for 'Device Authentication for Incognito' and enable it. Next you'll need to close and reopen your browser before going to Settings > Privacy and enabling the 'Lock Incognito Tabs when you close Chrome' setting.",
    "While this feature will help further protect the privacy of iOS users running Chrome in Incognito mode, we still don't know whether or not Google plans to bring it to Android smartphones as well.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Locked behind Face ID"
  },
  "links": {
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "browser": "https://www.techradar.com/best/browser",
    "business laptop": "https://www.techradar.com/news/best-business-laptops",
    "Chrome for iOS": "https://www.techradar.com/news/new-google-chrome-update-for-iphone-and-ipad-includes-widgets-heres-how-to-use-them",
    "Face ID": "https://www.techradar.com/news/ios-145-will-provide-a-great-excuse-to-buy-an-apple-watch-mask-support-for-face-id",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/google/google-chrome-on-ios-is-getting-an-enhanced-privacy-feature/"
  }
}