{
  "source": "https://www.techradar.com/news/iphone-14-pro-looks-more-likely-to-lose-the-notch-but-theres-one-problem",
  "title": "iPhone 14 Pro looks more likely to lose the notch",
  "category": "phones",
  "updated": "2021-12-09T10:05:59Z",
  "author": "james-rogerson",
  "summary": "Losing a notch and gaining a punch-hole",
  "article": [
    "Some of us here at TechRadar have been railing against the notch for years, and it seems that Apple might finally be getting on board, as there’s growing evidence that at least some of the iPhone 14 range will have a punch-hole camera instead.",
    "The latest leak in that direction comes from The Elec, which claims to have learned that both the iPhone 14 Pro and the iPhone 14 Pro Max will have a punch-hole selfie camera.",
    "The site adds that the standard iPhone 14 and the iPhone 14 Max will be stuck with a notch still, and that the two Pro models will – like their predecessors – have 120Hz refresh rate screens.",
    "LG Display is reportedly in the running to provide some of those screens – taking orders away from Samsung Display – but it sounds like that’s yet to be confirmed.",
    "In fact, none of this is confirmed yet, but 120Hz refresh rates on the Pro models seems all but guaranteed given that the iPhone 13 Pro and iPhone 13 Pro Max have 120Hz screens. The bigger question is whether the iPhone 14 Max will as well or not.",
    "As for punch-hole cameras, that would be a big shift for Apple so we’re less sure of that, but a number of leaks have now pointed in that direction, so there’s a good chance that’s accurate too.",
    "One reason that Apple has stuck with a notch for so long is the company’s Face ID tech. This is housed in the notch, and there’s more to it than just a single camera lens, with various sensors and other tech also involved.",
    "So Apple presumably won’t be able to house all of that in a punch-hole (unless it’s a very big punch-hole), meaning that it needs to find another home for these things if it’s to get rid of the notch.",
    "The Elec’s story doesn’t shed any light on what that home would be, but previous leaks have suggested Apple might move the Face ID tech under the display.",
    "That though could prove quite challenging. We’ve started seeing under-display cameras on the likes of the Samsung Galaxy Z Fold 3, and their performance isn’t great. Face ID isn’t quite the same as a normal camera and may not be as hard to get right, but it’s probably not easy either.",
    "So hopefully Apple has achieved this, but if we don’t end up getting a punch-hole camera on any iPhone 14 models, then Face ID is probably to blame.",
    "Via MacRumors"
  ],
  "headers": {
    "6": "Analysis: The Face ID problem"
  },
  "links": {
    "iPhone 14": "https://www.techradar.com/news/iphone-14",
    "The Elec": "http://www.thelec.net/news/articleView.html?idxno=3665",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "whether the iPhone 14 Max will": "https://www.techradar.com/news/iphone-14-max-could-have-a-surprisingly-good-screen",
    "now pointed in that direction": "https://www.techradar.com/news/iphone-14-pro-could-finally-ditch-the-notch",
    "move the Face ID tech under the display": "https://www.techradar.com/news/iphone-14-pro-looks-even-more-likely-to-have-under-display-face-id",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "MacRumors": "https://www.macrumors.com/2021/12/08/iphone-14-hole-punch-display/"
  }
}