{
  "source": "https://www.techradar.com/news/wireless-headphones-are-set-to-sound-even-better-with-qualcomms-snapdragon-sound",
  "title": "Wireless headphones are set to sound even better with Qualcomm's Snapdragon Sound",
  "category": "audio-visual",
  "updated": "2021-03-04T16:01:03Z",
  "author": "olivia-tambini",
  "summary": "The gap between wired and wireless audio is closing",
  "article": [
    "Wireless headphones, Bluetooth earbuds, portable speakers, and phones are set to sound even better as Qualcomm unveils its Snapdragon Sound technology, which it says will achieve its vision of “delivering high-resolution wired quality audio, wirelessly”.",
    "It will work with Qualcomm’s mobile platforms including Snapdragon 888, headphone chips like the QCC3065x SoC (system on a chip), and the company’s audio codecs, which include Qualcomm Active Noise Cancelling and aptX adaptive.",
    "With the technology set to work across a huge range of devices from different manufacturers, the bridge between wired and wireless audio is set to narrow, with the latter traditionally being seen as inferior by audiophiles due to file compression, latency issues, and limitations with Hi-Res Audio.",
    "James Chapman, Qualcomm’s vice president and general manager of Voice, Music, and Wearables, explained that, by following the audio all the way from the phone to the earbud, the company has been able to rectify some of those “pain points”, ensuring that the sound signal is crystal clear at every stage from the source to your ears.",
    "Chapman believes demand is high too, saying that the increased popularity of true wireless earbuds, and a strong rise in HD music streaming (with Spotify recently becoming the latest platform to introduce a higher quality streaming tier), making refined audio more important than ever to consumers.",
    "And, as Chapman says, we’re no longer restricted to “horribly compressed streams” thanks to innovations in 5G and Wi-Fi 6.",
    "The first mobile manufacturer set to support the technology is Xiaomi, while respected headphone and turntable brand Audio-Technica is the first audio company to commit to Snapdragon Sound.",
    "Amazon Music HD is also on board, with the music streaming service releasing a dedicated playlist designed to showcase “the superior sound quality Snapdragon Sound can achieve”.",
    "You won’t be able to experience it straight away though – Qualcomm says that devices supporting Snapdragon Sound are expected to be available later this year. The company also says that, as well as headphones, wireless earbuds, and smartphones, other devices like PCs, smartwatches, and XR glasses could support the technology in the future, too.",
    "Happily, it looks like even cheap wireless earbuds and headphones will support Snapdragon sound, as the company’s QCC3065x Soc (system on a chip), a true wireless earbud chip that comes with support for Bluetooth LE Audio, is listed as a key component of the technology.",
    "First announced at CES 2020, Bluetooth LE Audio is a wireless transmission standard that uses a new codec called LC3 to improve sound quality and battery life, as well as connect hundreds of devices to a single source.",
    "The magic behind Bluetooth LE – or Bluetooth Low Energy – is the LC3 codec. It’s capable of compressing and decompressing data more efficiently than SBC, which means that Bluetooth wireless chips can do their jobs without drawing as much power. In other words, your true wireless earbuds are about to sound better, and last longer, too.",
    "As well as support for Bluetooth LE, the QCC3065x earbud chip allows for audio sharing (so you can listen to music with a friend using one source device), hands-free voice assistant support, and Qualcomm's Adaptive Active Noise Cancellation.",
    "The chip also brings support for aptX Adaptive at up to 96kHz audio resolution and low-latency streaming for when you're watching videos or playing games, and cVc Noise Suppression to make your voice sound clear during phone calls.",
    "These are the kind of features you'd expect to find with relatively expensive true wireless earbuds like the Apple AirPods Pro or the Sony WF-1000XM3 – but this chip is designed with mid-tier earbuds in mind, meaning you'll soon be able to get these premium features without breaking the bank.",
    "And, with support for Snapdragon Sound on the way, even cheap earbuds will be one step closer to wired-quality wireless audio, making audiophile sound accessible on any budget."
  ],
  "headers": {
    "6": "Where can I get Snapdragon Sound?",
    "9": "How much will Snapdragon Sound devices cost?"
  },
  "links": {
    "Wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Bluetooth earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "portable speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "the latest platform to introduce a higher quality streaming tier": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "turntable": "https://www.techradar.com/news/best-turntables",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "cheap wireless earbuds": "https://www.techradar.com/best/the-best-budget-wireless-earbuds",
    "that comes with support for Bluetooth LE Audio": "https://www.techradar.com/news/cheap-wireless-earbuds-are-about-to-get-even-better-without-a-steep-price-hike",
    "First announced at CES 2020": "https://www.techradar.com/news/bluetooth-le-could-be-the-biggest-news-out-of-ces-2020",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}