{
  "source": "https://www.techradar.com/news/what-is-app-tracking-transparency-on-iphone-ios-145s-big-update-explained",
  "title": "What is app tracking transparency on iPhone? iOS 14.5's privacy update explained",
  "category": "phones",
  "updated": "2021-04-28T09:18:59Z",
  "author": "hamish-hector",
  "summary": "What is Apple’s app tracking transparency, anyway?",
  "article": [
    "Apple iOS 14.5 has dropped and introduced us to app tracking transparency. If you’ve updated to the latest version of iOS you might have already started seeing a new notification pop up when you open your favorite apps.",
    "But what is app tracking transparency, and is it something you want? The system hasn’t been the most clearly explained feature and it’s left a few people confused.",
    "We’re here to explain all the questions you might have about Apple’s latest data privacy feature so you can decide what’s best for you. Plus, we’ll talk you through how to toggle the features if you want to use them.",
    "App tracking transparency is almost what you’d expect from the name; it’s a feature that requires apps to be more transparent about how they track you. However, at least for now, it’s only being more open about how they track you outside of their own apps and websites.",
    "For example, Twitter can track how you use its own app and website, but couldn’t then track your usage of other company’s apps without now getting permission first.",
    "It already has arrived. If you update to the most recent iOS 14 you’ll start seeing pop ups for the apps you use asking if they have permission to track you or not. Not every app will ask for the permission, as it may not track you outside of its program, but you might be surprised by the number that do.",
    "So why would you want an app to track you? Well, while we won’t advise you either way, the main benefit for allowing tracking is ad and content relevance.",
    "If apps can track your activity they can build a better picture of your interests. Rather than presenting you with generic ads or suggested content, a company can tailor what it shows you to what it thinks you might actually want to see.",
    "However, if the idea of being followed everywhere while using your iPad or iPhone freaks you out, then turning off tracking might be the best step for you.",
    "Apps can learn a surprising amount of information about who you are as a person by following what you do. This information is also incredibly valuable to third parties, who might want to hyper-target adverts and content towards you.",
    "If you are concerned about tracking online, especially on non-Apple devices, using a VPN can also help you keep data private. Here’s our guide for the best VPNs currently available.",
    "As far as we can tell this feature is only coming to iPhones that update to iOS 14.5 (and iPads updating to iPad OS 14.5). The eligible iPhones are:",
    "And if you aren’t on iPhone:",
    "There are two options for opting out of app tracking. When you open up an app for the first time since updating to iOS 14.5, you’ll be given the option to allow or block tracking.",
    "Alternatively, if you want to allow or block apps all at once you can head to your iPhone Settings > Privacy > Tracking. From here you can toggle allowing apps to request tracking, and you can also choose and change the permissions you’ve given to each app.",
    "Unfortunately not. As the system currently stands you can only allow an app to track your outside activity completely or not at all. There may someday be an update where you can pick and choose where apps can follow you or what data they can collect, but for now it’s all or nothing.",
    "However, you can allow some apps to track you and some to not, so there’s choice there.",
    "The simple answer is to assume everything, though apps aren’t currently divulging the data they are specifically collecting from outside their own apps. If there comes a day where we can pick and choose how we are tracked we may start to learn more."
  ],
  "headers": {
    "3": "What is app tracking transparency?",
    "5": "When does the change arrive?",
    "6": "Why should I opt in to app tracking?",
    "8": "Why should I opt out of app tracking?",
    "11": "Will app tracking transparency come to every iPhone?",
    "13": "How do I opt out of app tracking?",
    "15": "Can I pick and choose what data is tracked?",
    "17": "Can I find out what data apps are tracking?"
  },
  "links": {
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "App tracking transparency": "https://www.techradar.com/news/ios-145-will-bring-a-big-privacy-feature-to-iphone",
    "our guide for the best VPNs": "https://www.techradar.com/vpn/best-vpn"
  }
}