{
  "source": "https://www.techradar.com/news/realmes-first-cheap-android-tablet-could-be-here-very-soon",
  "title": "Realme's first cheap Android tablet could be here very soon",
  "category": "tablets",
  "updated": "2021-06-11T08:50:42Z",
  "author": "tom-bedford",
  "summary": "As well as a laptop and... a robot vacuum?",
  "article": [
    "Chinese tech company Realme is hosting a launch event on June 15 at 5am PT / 8am ET / 1pm BST / 8pm ACT, and while it's mainly for the Realme GT mid-range Android smartphone, we could end up seeing a lot more at the event.",
    "That's because tech website GSMArena is claiming the brand will unveil its first tablet, which judging by the company's output will likely be a cheap Android tablet with a high-end processor. According to the site, the brand will also launch its first laptop, which it has already been teasing.",
    "Realme's CEO Madhav Sheth teased some new products via Twitter, talking about 'exciting new product categories' with an image that states 'another GT is coming', but there's no indication that this refers to a tablet and laptop instead of, say, a GT-branded smartwatch.",
    "Realme UK posted on Twitter saying 'the GT squad grows', which seems to suggest the new product could also be a phone, though it doesn't explicitly rule out another type of product with the GT name. The brand also teased a robot vacuum for the launch event.",
    "If you're looking to buy a new tablet, and don't want a relatively-high-priced iPad, there's usually very little choice on the market. You could buy a Samsung Galaxy Tab, an Amazon Fire HD tablet, or perhaps a Lenovo slate, but there's generally not much else.",
    "It sounds like lots of Chinese tech companies have noticed this hole in the market though, with Realme just one of the bunch. Xiaomi's Mi Pad 5 is also expected and Huawei just launched its new MatePad 11, which will likely come with a low price.",
    "We'll have to see if any of these new slates are as good as the stalwarts on the market, but competition is always good news, and we might be about to witness a renaissance in Android slates."
  ],
  "headers": {
    "4": "A new cheap Android tablet"
  },
  "links": {
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "GSMArena": "https://www.gsmarena.com/realme_new_tablet_and_laptop_to_be_unveiled_on_june_15-news-49546.php",
    "cheap Android tablet": "https://www.techradar.com/deals/the-best-cheap-android-tablet-deals",
    "already been teasing": "https://twitter.com/MadhavSheth1/status/1402513402547736579",
    "Twitter": "https://twitter.com/realmeUK/status/1402943688247066633",
    "robot vacuum": "https://twitter.com/realmeUK/status/1403004479566352385",
    "Xiaomi's Mi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "MatePad 11": "https://www.techradar.com/news/huawei-matepad-pro-and-matepad-11-tablets-unveiled-with-harmonyos-on-board"
  }
}