{
  "source": "https://www.techradar.com/news/youll-soon-be-able-to-share-outlook-emails-on-microsoft-teams-should-you-want-to",
  "title": "You'll soon be able to share Outlook emails on Microsoft Teams, should you want to",
  "category": "computing",
  "updated": "2021-10-04T18:37:52Z",
  "author": "anthony-spadafora",
  "summary": "Start a new Teams chat based on the contents of an email or email thread",
  "article": [
    "Microsoft is making it easier for users of its email service to share emails and email threads with Microsoft Teams in an effort to foster collaboration.",
    "As reported by MSPoweruser, the software giant has been working on this new feature, which allows Outlook users to share emails to Teams, for quite some time now. While it was initially scheduled to be released back in March, the feature was delayed for unknown reasons.",
    "Now though accord to a new post on the Microsoft 365 Roadmap, it's set to be available this month but how useful it will be for Outlook users remains to be seen.",
    "Once this feature launches, users of Outlook on the web will be able to send a copy of an email or email thread complete with attachments to a chat or channel in Microsoft Teams.",
    "According to Microsoft's post, when sharing to Teams from Outlook on the web, a pop up window will appear that will allow users to confirm which channel or person they want to share an email or email thread with. They'll even be able to select whether or not they want to include any attachments with an email.",
    "From here, users will be able to start a conversation about an email or email thread with their colleagues right inside Teams chat. This could help Outlook and Teams users save time as discussing the contents of an email in Microsoft's online collaboration tool will likely be faster than doing so in a large email thread with multiple recipients.",
    "While this is an interesting feature, it will only be useful to those whose organizations use both Teams and Outlook. Regardless, we'll likely hear more about its reception once it rolls out later this month.",
    "Via MSPoweruser"
  ],
  "headers": {
    "3": "Share to Microsoft Teams"
  },
  "links": {
    "email service": "https://www.techradar.com/news/best-email-provider",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "reported": "https://mspoweruser.com/share-outlook-emails-to-microsoft-teams/",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "new post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-2936419133175995000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3DIn%2520development%26searchterms%3D68909",
    "Microsoft 365 Roadmap": "https://www.techradar.com/news/microsoft-teams-can-now-be-used-for-work-and-play-simultaneously",
    "Outlook on the web": "https://www.techradar.com/news/microsoft-wants-to-unite-all-its-email-programs-into-one-outlook",
    "attachments": "https://www.techradar.com/news/microsoft-defender-for-office-365-is-taking-no-chances-with-dodgy-attachments",
    "Teams chat": "https://www.techradar.com/news/microsoft-teams-will-soon-basically-write-your-chat-replies-for-you",
    "online collaboration tool": "https://www.techradar.com/best/best-online-collaboration-tools",
    "MSPoweruser": "https://mspoweruser.com/share-outlook-emails-to-microsoft-teams/"
  }
}