{
  "source": "https://www.techradar.com/news/this-dollar699-dell-g5-with-a-gtx-1660-ti-is-this-weeks-best-cheap-gaming-laptop-deal",
  "title": "This $699 Dell G5 with a GTX 1660 Ti is this week's best cheap gaming laptop deal",
  "category": "computing",
  "updated": "2021-06-10T10:21:57Z",
  "author": "alex-whitelock",
  "summary": "That's a really powerful GPU for not a lot of cash",
  "article": [
    "Dell always has fantastic gaming laptop deals but this week we've spotted one that's particularly good if you're on a budget - this Dell G5 15 for $699.99 (was $1,039.99).",
    "That's a $340 saving on a mid-range machine that's featuring a GTX 1660 Ti graphics card, Intel Core i5-10300H processor, 8GB of RAM, and a 256GB SSD - very respectable specs indeed for affordable 1080p gaming.",
    "We're always on the hunt for the best gaming laptop deals here at TechRadar, and we think this is probably the cheapest machine to feature the GTX 1660 Ti we've seen yet. After all, that's a graphics card that's normally featured on more expensive, mid-range machines.",
    "The GTX 1660 Ti is definitely a slightly older GPU now, and one that doesn't support the latest features like Ray Tracing, but it's definitely a lot more powerful than the usual GTX 1650's you see in the sub-$700 market. It's also speedier than the latest RTX 3050 Ti card too, although that one does of course support Ray Tracing. Subsequently, you're getting a lot of 1080p performance here for the price, even though this spec's a little older.",
    "Of course, you could wait to see how this year's upcoming Prime Day deals play out before you commit, although we wouldn't hang around - this gaming laptop deal is very nearly sold out at Dell. If do happen to miss it, or are visiting from outside the US, we've rounded up the best sales in your region just down below.",
    "Stock up on your library with this week's best cheap game deals."
  ],
  "headers": {
    "5": "Gaming laptop deals at Dell"
  },
  "links": {
    "for $699.99 (was $1,039.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1282653360905338000/https://deals.dell.com/en-us/productdetail/8z4c",
    "gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best cheap game deals": "https://www.techradar.com/news/cheap-game-deals-sales-xbox-one-ps4-pc"
  }
}