{
  "source": "https://www.techradar.com/news/europe-is-cutting-down-on-tracking-ads-from-tech-giants",
  "title": "Europe is cutting down on tracking ads from tech giants",
  "category": "computing",
  "updated": "2021-11-24T11:52:22Z",
  "author": "sead-fadilpasic",
  "summary": "EU votes for tougher restrictions on ads",
  "article": [
    "The European Parliament has voted for tougher restrictions on how data can be used for ad targeting in a move aimed directly at social media and advertising giants such as Facebook or Google.",
    "The Internal Market and Consumer Protection Committee (IMCO) said gatekeepers will no longer be allowed to combine personal data “for the purpose of delivering targeted or micro-targeted advertising,” unless given “clear, explicit, renewed, informed” consent. Furthermore, personal data belonging to minors cannot be processed for commercial purposes (think marketing, profiling, behavioral targeting, etc.).",
    "Explaining what a “gatekeeper” is, IMCO described it as a major company that provides “core platform services” most prone to unfair practices. That includes online intermediation services, social networks, search engines, operating systems, online advertising services, cloud computing, and video sharing services.",
    "Even though companies need to provide core platform services in at least three EU countries, and have at least 45 million monthly end-users and 10,000 business users, to be deemed gatekeepers, the Commission can designate other firms into this category “when they meet certain conditions,” the press release reads.",
    "These restrictions are still far from being word of law, though, as the IMCO committee vote now needs to be followed up by a plenary vote in the European Parliament, due next month. After that, it heads over to the EU Council for negotiations with member states, which means it will still take months before the final text is approved.",
    "Organizations that fail to comply, the new restrictions propose, would be fined by the Commission “not less than 4% and not exceeding 20%” of the total global turnover in the preceding financial year.",
    "That means today’s tech giants could end up paying up to $36 billion for being non-compliant."
  ],
  "headers": {
    "3": "Protecting EU consumers"
  },
  "links": {
    "personal data": "https://www.techradar.com/vpn/best-vpn",
    "cloud computing": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}