{
  "source": "https://www.techradar.com/news/microsoft-surface-go-deals-prices",
  "title": "The best Microsoft Surface Go deals and prices in December 2021",
  "category": "computing",
  "updated": "2021-12-03T15:11:21Z",
  "author": "james-pickard",
  "summary": "Want something cheaper than a Surface Pro? Say hello to the Surface Go",
  "article": [
    "We've rounded up the latest Microsoft Surface Go deals so you can score a discount on Microsoft's cheaper tablet device. Now that the Surface Go has been out a little longer, we're starting to see retailers bring the prices down more often, which is great news for you bargain fans.",
    "If you've been eyeing up the line of Surface Pro tablet/laptop convertibles but thought they were a bit expensive, or too big to carry around a lot, the Surface Go is the cut-price diminutive alternative that'll allow you to save some serious cash while getting that super cool form-factor.",
    "The original Surface Go tablet is aging now, which means you'll have difficulty finding stock of the smaller 64GB model. However, there are some excellent Surface Go deals to be found on the larger 128GB device. The Surface Go 2 continues these storage configurations, but you'll be able to find both the 64 and 128GB models on the shelves easily.",
    "For both versions of the tablet you're looking at a $399.99 MSRP on the 64GB model and $549.99 MSRP on the 128GB model, though you'll find all the cheapest prices up for grabs right now below.",
    "The Surface Go 2 is the newest version of the Surface Go tablet, improving on the previous version's power and kitting out the larger 10.5-inch display with a better battery life, dual studio mics, and thinner bezels. You're getting all of that at the same MSRP as the older model, however it's worth noting that price drops have been far steeper on the original tablet so you'll likely find a lower price there.",
    "That said, you'll only find those discounts on the larger 128GB model - the original 64GB device is rarely on the shelves these days, so if you're looking to spend under $400 the Surface Go 2 is for you. However, when it comes to the 128GB device, it might be worth springing for the extra processing power and quality of life features in the Go 2, considering there's usually between $100 and $50 in the price difference between the two models.",
    "The original Surface Go is still available, though you'll struggle to find stock of the cheaper 64GB model. If you're after 8GB RAM and a 128GB SSD, however, you'll find a lower price here than on the newer Surface Go 2. The screen is downgraded a little and you're not picking up as much processing power here, but if you're after an everyday tablet for streaming, browsing the web, catching up on emails and some light Windows work, the original Surface Go is one of the most cost-effective ways to do so.",
    "Even if you've found the cheapest of Surface Pro deals, you'll still be a way off from the Surface Go price. That's why many who can't quiet justify the Pro's prices can easily get the job done with a cheaper Surface Go tablet.",
    "You are dropping down in performance here, but the lowest price you'll find on a Surface Pro is $749 (around $699 on sale). Considering you're still getting that premium form factor, a large 10-inch display, and a processor that will see you through everyday activities with ease it's worth it to scale down if you don't think you'll need all those Pro features.",
    "By itself the Surface Go is a tablet (albeit a tablet running full Windows 10 like a laptop), which is the tricky business of buying into Microsoft's Surface range. You have to pick up the Type Cover keyboard separately to fully transform your device into a laptop replacement. The costs do start to add up here, but if you can find Surface Go deals that offer a keyboard bundled into the final price you've hit a great offer. Otherwise you'll find the lowest prices on these accessories just below.",
    "If you're after something a little more conventional, you can check out all the best laptop deals and sales available right now.",
    "The Surface Go 2 improved on a few aspects of the Surface Go experience, and comes in at the same price as the original model. You're getting a boosted processor, a larger 10.5-inch display, dual studio mics, a longer battery life, and thinner bezels here. Aside from those additional features, however, the Surface Go and Surface Go 2 are the same in function and form.",
    "If you don't need to run the full Windows operating system on your tablet, there are plenty of cheap Android tablet deals up for grabs. Or, take a look at the latest iPad deals to compare Apple's offerings."
  ],
  "headers": {
    "7": "Is the Surface Go price worth it?",
    "9": "Is the Surface Go a laptop?",
    "11": "What's the difference between the Surface Go and Surface Go 2?"
  },
  "links": {
    "Surface Pro deals": "https://www.techradar.com/deals/surface-pro-deals-bundles",
    "best laptop deals and sales": "https://www.techradar.com/news/the-best-laptop-deals",
    "cheap Android tablet deals": "https://www.techradar.com/deals/the-best-cheap-android-tablet-deals",
    "iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices"
  }
}