{
  "source": "https://www.techradar.com/news/xiaomi-12-design-leak-points-to-a-boring-downgrade-from-mi-11",
  "title": "Xiaomi 12 design leak points to a boring downgrade from Mi 11",
  "category": "phones",
  "updated": "2021-11-22T09:28:39Z",
  "author": "tom-bedford",
  "summary": "Camera bump redesign",
  "article": [
    "The Xiaomi 12 is one of the next big phones coming out, but compared to something like the Samsung Galaxy S22 we've been hearing relatively few leaks about it. Maybe that's a good thing, because some of the rumors, like a new design one, aren't exactly exciting.",
    "Popular leaker Digital Chat Station shared an image on Chinese social media platform Weibo showing the camera bump of the Xiaomi Redmi K30S (a China-only phone) with a caption that suggests this is the direction the company's phones are heading towards in the future, at least in terms of camera bump design.",
    "The Redmi K30S camera bump will be very familiar to people who know Xiaomi phones, as it consists of one giant lens with an array of smaller ones besides it.",
    "We've seen this in the Xiaomi Mi 10T Pro (an international version of the K30S, pictured above) as well as a good few devices from the company.",
    "The implication here is that the Xiaomi 12 will use the same design, something commenters under the post (and other news websites) have picked up on. This is quite vague, so take it with a pinch of salt, but Digital Chat Station is a big enough leaker that it's worth paying attention to what they say.",
    "A phone's camera bump says a lot about it, and not just when you're examining the phone in your hand, but especially when you're looking down the lens at the subject of a photograph.",
    "If you're staring down the barrel of the Xiaomi Mi 11 Ultra's giant trio of cameras, you'd rightly assume that pictures of you are going to look great. But if you see the Mi 10T Pro, you're going to see those tiny little lenses under the main one, and be unsure if they're actually seeing you at all.",
    "A phone's camera bump denotes its power, and the Redmi K30S' bump just doesn't look great, with all those cluttered lenses. It's why many budget phones with thrown-in auxiliary lenses simply look cheap; because they use extra small sensors to improve the camera count.",
    "Moreover, we've seen this design before. If Apple started using a several-year-old iPhone design, fans would scratch their heads - so what's different here? We like seeing tech advancements, not steps backwards.",
    "So hopefully the Xiaomi 12 won't use this cyclops-eye-style rear camera design, but we'll have to wait for more leaks to know more."
  ],
  "headers": {
    "5": "Analysis: why Xiaomi shouldn't use this camera bump"
  },
  "links": {
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Weibo": "https://weibo.com/6048569942/L2DEI0JeZ",
    "Xiaomi Mi 10T Pro": "https://www.techradar.com/reviews/xiaomi-mi-10t-pro-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review"
  }
}