{
  "source": "https://www.techradar.com/news/these-cheap-gaming-headset-deals-are-returning-to-record-low-prices-at-amazon",
  "title": "These cheap gaming headset deals are returning to record low prices at Amazon",
  "category": "gaming",
  "updated": "2021-03-17T15:28:26Z",
  "author": "tabitha-baker",
  "summary": "Save on budget and premium models",
  "article": [
    "Amazon is regularly offering discounts on a range of cheap gaming headset deals, but this week three models have caught our eye. Not only are these headsets offering excellent specs and audio quality, even in the more budget-friendly ranges, but they're also returning to record low prices right now. That's perfect if you're looking to grab a new set of cups without breaking the bank.",
    "The cheapest gaming headset in our top picks is this Astro A10. The Xbox edition is now down to just $39.99 (was $60) - a price we've only seen once before. Sure, it's a basic set of cups but there's still a fantastic audio quality here considering you're spending less than the price of most games.",
    "However, if you are looking for something with a bit more power under the hood - or compatibility across PlayStation, Xbox, PC and Switch - the Alienware 510H is also sitting at its lowest price yet. You'll find it for just $73.99 right now, down from $99.99. That's a discount that's only appeared a few times since launch, so we'd move fast if you're looking for 7.1 surround sound at a great price.",
    "At the top end of our list is the Razer BlackShark V2 Pro. The wireless PC-first headset specializes in pinpoint positional audio and ultra low latency, making it a must-see for competitive players. This record low $159.99 price tag (was $179.99) is the biggest discount we've seen on this 2020 release so far.",
    "Not in the US? Scroll down for more cheap gaming headset deals in your region.",
    "You'll need something to play as well, which is why we're rounding up all the best cheap game deals right here on TechRadar. However, if you're after more hardware you can check out the best gaming monitor deals, gaming mouse sales, and cheap gaming keyboard deals as well."
  ],
  "headers": {
    "5": "More gaming headset deals"
  },
  "links": {
    "down to just $39.99 (was $60)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB071S9R9YB%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6272427754024735000-20",
    "for just $73.99 right now, down from $99.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07V5DJY4D%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2511884371310587400-20",
    "record low $159.99 price tag (was $179.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08FQG96RP%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1102734841447653600-20",
    "cheap gaming headset deals": "https://www.techradar.com/deals/the-best-cheap-gaming-headset-deals",
    "cheap game deals": "https://www.techradar.com/news/cheap-game-deals-sales-xbox-one-ps4-pc",
    "best gaming monitor deals": "https://www.techradar.com/deals/cheap-gaming-monitors-deals-sales",
    "gaming mouse sales": "https://www.techradar.com/news/best-gaming-mouse-deals",
    "cheap gaming keyboard deals": "https://www.techradar.com/deals/cheap-gaming-keyboard-deals-and-sales"
  }
}