{
  "source": "https://www.techradar.com/news/microsoft-edge-is-getting-a-windows-11-flavored-visual-refresh",
  "title": "Here's what Microsoft Edge will look like on Windows 11",
  "category": "computing",
  "updated": "2021-09-23T16:51:08Z",
  "author": "joel-khalili",
  "summary": "Latest Microsoft Edge preview offers glimpse of what the browser may look like on Windows 11",
  "article": [
    "The developers behind Microsoft Edge have revealed more details on the visual overhaul that will bring the browser in line with the company’s new Windows 11 operating system.",
    "The first glimpse of what Edge may look like on Windows 11 is provided by the latest preview build, available to members of the Dev channel.",
    "The changes are admittedly minimal for now, limited to a few alterations to the minimize, maximize and close buttons, but Microsoft has implied that more significant changes to the browser are on the way.",
    "Setting aside performance-related improvements, one of the most stark differences between Windows 10 and 11 is the new curvaceous, frosted glass aesthetic.",
    "This new look is informed by something Microsoft is calling Fluent Design, a framework applied in-house and used by developers to create apps that feel as if they were designed natively for Windows.",
    "The framework is comprised of various elements and “materials”. For example, the Mica material aligns the background color of applications with the desktop, and creates a “color hierarchy” that helps distinguish between multiple open instances of the same app.",
    "The suite of tools is currently being used to redesign many of Microsoft’s apps (including Photos, Calendar, Mail, Snipping Tool and Edge), which should make Windows 11 feel like more of a complete and coherent ecosystem.",
    "The various Windows 11 preview builds have already offered a sense of what Fluent Design can offer, but it won’t be until launch day (and beyond) that users get to experience the fruit of Microsoft’s new approach.",
    "Via OnMSFT"
  ],
  "headers": {
    "3": "Edge on Windows 11"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "latest preview build": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6667037658219606000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fdiscussions%2Fdev-channel-update-to-95-0-1020-0%2Fm-p%2F2771428&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-edge-is-getting-a-windows-11-flavored-visual-refresh",
    "browser": "https://www.techradar.com/best/browser",
    "Mica material": "https://www.techradar.com/news/microsoft-windows-11-design-will-not-hamper-performance",
    "OnMSFT": "https://www.onmsft.com/news/microsoft-edge-dev-channel-gets-pdf-improvements-and-windows-11-inspired-changes"
  }
}