{
  "source": "https://www.techradar.com/news/ring-privacy-ruling-could-increase-the-cost-of-owning-a-video-doorbell",
  "title": "Ring privacy ruling could increase the cost of owning a video doorbell",
  "category": "smart-home",
  "updated": "2021-10-15T14:59:16Z",
  "author": "carrie-ann-skinner",
  "summary": "Opinion: Homeowners will feel they have to pay for subscription services to protect themselves",
  "article": [
    "Compared to traditional CCTV, smart security devices offer a more affordable way for consumers to keep an eye on their homes, even when they’re not around. They’re often simple to install and set up, and so don’t require professional installation, which helps to keep costs down.",
    "Another of the big draws of the best video doorbells and the best smart home security cameras has also been that, unlike CCTV systems, they can be used without an on-going cost – while the subscription services offered by the likes of Ring, Google, and Arlo give you access to additional features including cloud-based storage, you can use the basic features of a device without having to sign up for these.",
    "However, that could be about to change, following a court case in the UK. A judge ruled that a video doorbell and home security system installed by a homeowner infringed data laws, and could constitute harassment, because it captured images of a neighbor’s home and the surrounding area, as well as recording audio automatically.",
    "Unsurprisingly the ruling will cause concern to many homeowners who have video doorbells and other devices installed. According to moving and insurance comparison site Porch, 44% of US homes have at least one home security camera installed, and the figure is similar in the UK. A 2019 survey by blind manufacturer Thomas Sanderson revealed that 40% of British homeowners have some form of security camera, including video doorbells, installed on their property.",
    "The homeowner at the center of the court case, Jon Woodward claimed that he’d installed the devices as a bid to deter burglars – the same reason given by more than nine in 10 UK homeowners, according to the Thomas Sanderson survey. And security cameras certainly seem to be effective – TechRadar spoke to a former burglar who confirmed that cameras and video doorbells do indeed deter would-be criminals.",
    "But following this court ruling, this could leave some homeowners at risk of having to pay heavy fines if legal action is brought against them, although this will depend upon the data protection and harassment laws in your territory. Some people who have been thinking about investing in smart security devices may be re-considering the decision, while those who already have cameras may be wondering if they should keep them, or change how they use them.",
    "A Ring spokesperson told us that the company “put features in place across all our devices to ensure privacy, security, and user control remain front and centre – including customizable Privacy Zones to block out ‘off-limit’ areas, Motion Zones to control the areas customers want their Ring device to detect motion and Audio Toggle to turn audio on and off\".",
    "However, it’s worth noting that while these features are free to access on Ring video doorbells, there are some brands such as Arlo, where such features can only be accessed if you subscribe to the brand’s monthly cloud storage services, which tends to cost from around $3 / £2.50 / AU$4 per month, which could result in your doorbell costing you more than you anticipated.",
    "For homeowners that might be concerned, it’s important to note that this ruling covers a group of home security cameras along with a Ring video doorbell. When it comes to the Ring video doorbell, it wasn’t the placement of the device itself, and the items that fell into its field of vision, that caused the issue, but the fact that the doorbell was automatically recording audio, which at the time couldn’t be disabled - a software update in 2020 has since changed this.",
    "However, what the case does highlight is that if you’re installing home security cameras and video doorbells and your neighbors’ property or passers-by are within its field of vision, you should be adhering to local laws regarding this. This is preferably using features in the software to ensure the camera or doorbell isn’t recording footage of these areas.",
    "If these features require a subscription that you’d rather not pay for, you should make your neighbors aware that you have a security system, and whether any of your cameras or video doorbells cover their property – and crucially check that they’re okay with this. It would be wise to get consent in writing or via email too. We’d also recommend using stickers that come bundled with home security cameras and video doorbells, which state that cameras on the property are recording footage.",
    "So is this likely to have a knock-on effect on when it comes to one biggest differentiators in CCTV vs home security cameras – the cost? The option to install and use devices without having to fork out for an ongoing subscription was one of the big draws for choosing home security cameras over CCTV, and the need to pay for a subscription service chips away at that.",
    "With many of us tightening our belts in response to the ongoing economic effects from the global pandemic, will protecting your property with a security camera once again become a luxury that’s only available to more affluent homeowners? Hopefully that won’t be the case, and if you don’t want an on-going cost of a subscription you can follow the advice above to ensure that you don’t fall foul of the law."
  ],
  "headers": {
    "3": "No longer an affordable option?"
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "best smart home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "court case in the UK": "https://www.techradar.com/news/court-rules-that-ring-video-doorbell-invaded-neighbors-privacy",
    "Porch": "https://porch.com/resource/home-security-sentiments",
    "Thomas Sanderson": "https://www.thomas-sanderson.co.uk/",
    "survey": "https://www.realhomes.com/news/nearly-half-of-british-homes-have-a-security-camera-but-theyre-not-just-being-used-for-home-protection",
    "spoke to a former burglar": "https://www.techradar.com/news/we-ask-a-former-burglar-do-smart-security-cameras-really-deter-crime",
    "CCTV vs home security cameras": "https://www.techradar.com/news/cctv-vs-smart-home-security-cameras-whats-the-difference-and-which-is-best"
  }
}