{
  "source": "https://www.techradar.com/news/cp-2021-what-new-cameras-can-we-expect-to-see-from-canon-sony-and-nikon",
  "title": "CP+ 2021: what new cameras can we expect to see from Canon, Sony and Nikon?",
  "category": "cameras",
  "updated": "2021-02-17T13:40:47Z",
  "author": "mark-wilson",
  "summary": "The online-only camera show could have some treats in store",
  "article": [
    "CP+ is now arguably the world's biggest trade show for cameras and photography – and after its cancellation last year, CP+ 2021 will soon arrive in online-only form.",
    "With the demise of Photokina, which was suspended for 2021 and perhaps indefinitely, CP+ has now taken the trade show mantle for new camera and lens announcements. So what can we expect to see from the virtual CP+ 2021 incarnation, which kicks off on February 25?",
    "The show, which is run by the Camera & Imaging Products Association (CIPA) and is usually held in Japan, has signed up most of the big names in the photographic world including Canon, Sony, Nikon, Fujifilm, Panasonic and the new owners of Olympus cameras, OM Digital Solutions.",
    "While the rumors suggest this year's show will be a little quieter than previous ones for new camera launches, there are still plenty of whispers about possible new bodies and lenses, along with the chance of some development announcements that will help give us a taste of future arrivals.",
    "We've rounded up all of the latest CP+ 2021 rumors for all of the big manufacturers, along with some possible arrivals from the likes of Sigma, Panasonic and Sharp, to give you a peak into what photographic treats might arrive next week.",
    "The CP+ 2021 show is scheduled to take place between February 25-28 – and you can register now for free admission to the show.",
    "Because the show will be entirely virtual this year, there are no worries about the cancellation that affected the 2020 version of the CP+. This seems a more sensible approach than the likes of MWC 2021, which has pushed its dates back in the hope that it may still go ahead with in-person elements.",
    "CP+ 2021 says it will have its own official online channel streaming keynote speeches, along with the various seminars and events it has planned, so it's worth registering before February 25 if you want to see any of the announcements live. All of the show's content will also apparently be able to view until March 31.",
    "It sounds like CP+ 2021 could be a quiet show for Canon launches, even if that wasn't the original plan.",
    "According to a recent post from the pretty reliable Canon Rumors, Canon had planned to \"make some sort of splash ahead of CP+\" with a \"new body scheduled to be announced along with a couple of lenses\". Sadly, it now appears that this \"isn't going to happen\".",
    "The reason is apparently \"manufacturing challenges\", which are no doubt related to the pandemic, but also potentially the knock-on effects of a factory fire in Japan in November 2020 that left many camera companies, including Sony, with a shortage of key parts.",
    "We are expecting a few new camera bodies from Canon this year – these include a new Canon EOS R1 flagship, two new entry-level full-frame cameras to replace the Canon EOS RP and EOS R, and even an APS-C RF body that might be called the Canon EOS R7.",
    "But it seems the best we can hope for at CP+ camera show is a development announcement for one of these launches, or perhaps a new lens. Canon Rumors says that the Canon RF 18-45mm f/4-5.6 IS STM, Canon RF 24mm f/1.8 IS STM Macro and Canon RF 100-400mm f/5.6-7.1 IS USM have all been \"significantly delayed due to manufacturing challenges\", so perhaps the only real news will be an update to the Canon RF lens roadmap.",
    "Unless, of course, Canon has managed to conceal a surprise launch in a similar way to the Sony A1.",
    "Sony definitely has some new cameras en route, with a total of five being registered with authorities in Asia in early 2021. But whether any of them will be announced at CP+ 2021 is another matter.",
    "One of those cameras is the Sony FX3, which will be announced at a special online event on February 23. That camera will likely be shown off at CP+, but will it be joined by any other announcements?",
    "A couple of weeks ago, Sony Alpha Rumors sounded confident about some new arrivals at the show. In a post about the opening of Sony's CP+ virtual booth, the site said \"there is a very high chance we get new cameras/lenses\", but didn't elaborate on what those might be.",
    "Of course, that was before the announcement of a launch event of the Sony FX3 –and on the subject of the long-awaited Sony A7 IV, the site added that it was \"not sure this one is going to be announced at the CP+ show\".",
    "Given the rumored manufacturing issues affecting the likes of Canon (above), it's possible that Sony's announcements (beyond the Sony FX3) have been pushed back till after the show.",
    "The lack of rumors about the Sony A7 IV, for example, suggest there's only a very slim chance of it arriving at CP+ 2021 – even though the show will mark the three-year anniversary of the Sony A7 III's introduction at CP+ 2018.",
    "Nikon is in a similar boat to Canon and Sony when it comes to the supply chain and manufacturing issues caused by the pandemic and factory fire last year – but there are still some rumored announcements for CP+ 2021.",
    "While Nikon Rumors says it's \"still not 100% sure what will be announced\", it did add in a post about the show that it expects \"we will see one or more new Nikkor Z lenses\" and \"maybe even the rumored Nikon Z APS-C mirrorless camera.\"",
    "Nikon is expected to announce seven new Z-mount lenses throughout 2021, so it's not yet clear which might arrive at CP+ 2021 – but the roadmap includes zooms like a 24-105mm, 100-400mm and 200-600mm lenses, plus compact primes like the 28mm and 40mm.",
    "But what about that APS-C mirrorless camera? The Nikon Z30, which would sit below the current Nikon Z50, has been rumored since June 2020, and is expected to have a 24.2MP sensor and 4K recording at up to 30fps. It won't be a powerhouse, then, but it should come with a temptingly low price tag.",
    "Hopefully, the Nikon Z30 will debut on February 26 (the date of Nikon's CP+ 2021 presentation), but we'll likely have to wait a while longer for the higher-end Nikon Z8 or Z9. That Sony A1 rival, which is rumored to have a 60MP sensor and 8K video recording powers, is \"expected in the second half of the year\", according to Nikon Rumors.",
    "While CP+ 2021 is shaping up to be a relatively quiet one for new camera bodies, there's likely to be an interesting supporting cast of announcements from some of the smaller camera brands.",
    "One of the most interesting could be the Sigma FP L, which is expected to be a new take on the Sigma FP. When it launched, the Sigma FP was the world's smallest and lightest full-frame mirrorless camera, which was mainly thanks to its ditching of the mechanical shutter (it only has an electronic shutter) and the absence of a built-in viewfinder. It's possible the Sigma FP L will simply be a bundle that includes an external EVF, but we hope it'll bring some additional features too.",
    "If DSLRs are more your bag, then we will likely see the full announcement of the Pentax K-3 Mark III, which has had one of the most drawn-out launches in recent memory.",
    "Pentax first announced that it was developing a successor to the Pentax KP in late 2019, but we were finally given the K-3 Mark III's name and specs in October 2020.",
    "Pentax has promised that the camera will be the \"best APS-C format SLR model ever produced by Pentax\", thanks to features like an optical viewfinder with an impressive 1.05x magnification and a max ISO that goes up to a ISO 1.6 million. It will, though, likely be a niche launch for fans of the K-mount.",
    "Almost as long in the making has been the Sharp 8K camera (above), which was similarly first announced back in 2019. Will we finally see the compact video camera fully arrive at CP+ 2021? Speculation from Photo Rumors suggests it could happen, with the delay apparently down to Sharp upgrading the camera's video powers to 8K/60p.",
    "But while its compact 8K camera concept is certainly a compelling one, we've now seen several 8K video cameras arrive – including the Sony A1 and Canon EOS R5 – so Sharp's long-awaited Micro Four Thirds camera will certainly have some competition.",
    "Perhaps more interesting are the new lenses we'll likely see arrive at CP+ 2021. The Panasonic Lumix S 70-300mm f/4.5-5.6 OIS lens, the long-awaited zoom lens for cameras like the Panasonic Lumix S5, will likely be announced if recent leaks are correct.",
    "According to Photo Rumors, Voigtlander will also soon be treating fans of Sony E-mount and Leica M-mount cameras to two new lenses. It's preparing to announce a Voigtlander Apo-Lanthar 35mm f/2 Aspherical prime lens, along with an Ultron Vintage Line 35mm f/2 Aspherical Type II, with the latter for Leica M-mount cameras only. While both are expected to be fully released in March 2021, it's possible we'll see the lenses shown off at CP+ 2021 for the first time."
  ],
  "headers": {
    "5": "When is CP+ 2021?",
    "8": "CP+ 2021: what Canon launches can we expect?",
    "14": "CP+ 2021: will there be any new Sony launches?",
    "20": "CP+ 2021: will Nikon release anything at the show?",
    "25": "CP+ 2021: will Panasonic, Sigma, Pentax or Sharp launch new products at the show?"
  },
  "links": {
    "register now": "https://www.cpplus.jp/en/",
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "Canon Rumors": "https://www.canonrumors.com/delays-seem-to-be-the-name-of-the-game-for-2021/",
    "shortage of key parts": "https://www.techradar.com/news/sony-acknowledges-severe-shortage-of-key-parts-for-its-compacts-and-video-cameras",
    "Canon EOS R7": "https://www.techradar.com/news/canon-eos-r7-prototype-rumored-to-be-in-the-wild-ahead-of-2021-launch",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Sony FX3": "https://www.techradar.com/news/sony-fx3-is-officially-its-smallest-cheapest-cinema-camera-for-pro-filmmakers",
    "Sony Alpha Rumors": "https://www.sonyalpharumors.com/the-sony-cp-virtual-booth-is-now-online/#disqus_thread",
    "CP+ virtual booth": "https://www.sony.jp/ichigan/a-universe/specialevent/cpplus2021/",
    "factory fire": "https://www.techradar.com/news/sony-acknowledges-severe-shortage-of-key-parts-for-its-compacts-and-video-cameras",
    "Nikon Rumors": "https://nikonrumors.com/2021/02/05/whats-coming-next-from-nikon-2.aspx/#ixzz6mj9NlSvh",
    "Nikon Z50": "https://www.techradar.com/reviews/nikon-z50",
    "Sigma FP": "https://www.techradar.com/reviews/sigma-fp",
    "Pentax K-3 Mark III": "https://www.techradar.com/news/pentax-k-3-mark-iii-finally-announced-and-flagship-dslr-could-be-a-low-light-king",
    "Photo Rumors": "https://photorumors.com/2021/02/10/voigtlander-is-rumored-to-announce-two-new-lenses-for-leica-m-and-sony-e-mounts/",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Panasonic Lumix S5": "https://www.techradar.com/reviews/panasonic-lumix-s5"
  }
}