{
  "source": "https://www.techradar.com/news/the-google-pixel-6-could-be-a-lot-easier-to-buy-than-the-pixel-5a",
  "title": "The Google Pixel 6 could be a lot easier to buy than the Pixel 5a",
  "category": "phones",
  "updated": "2021-09-02T09:11:18Z",
  "author": "david-nield",
  "summary": "Google wants production ramped up",
  "article": [
    "The latest information from the smartphone rumor mill suggests that Google has put in a bumper order of Pixel 6 and Pixel 6 Pro units – indicating that the flagship handsets might be much more widely available than the Pixel 5a.",
    "Nikkei Asia (via 9to5Google) has the scoop, saying that Google has asked its suppliers to boost production capacity for the Pixel phones by 50% – and that's compared to pre-pandemic levels as well, not the cut-down production volumes of the last year or so.",
    "Google reportedly shifted some 7 million handsets in 2019, and would appear to be aiming for at least that number with the Pixel 6 and Pixel 6 Pro. It's a sharp contrast to the Pixel 5a, which is only on sale in the US and Japan due to the restrictions put on manufacturers with the global chip shortage.",
    "At the start of August, Google took the somewhat unusual step of making the Pixel phones official before their full launch (although there has been a precedent). At the time of writing, we're still not sure when these handsets will go on sale.",
    "Various industry tipsters have plenty of ideas though: one source says September 13 is going to be the day of a full unveiling, with Google getting in before Apple and all the buzz that goes along with the announcement of the iPhone 13.",
    "An arguably slightly more reliable source – though one that's by no means infallible – suggests that the phones will go on sale on October 28, with a launch announcement a week or so earlier.",
    "The Pixel 6 and Pixel 6 Pro phones are different for Google for a lot of reasons – not least the rather large rear camera module that sticks out of the back of the handsets, which is a design choice we haven't seen much of in recent years.",
    "These phones come carrying Google's first custom-made chipset, the Tensor processor, enabling Google to integrate hardware and software like never before. It's an approach that Google is now said to be exploring for its Chromebooks too.",
    "They're also aimed at the top end of the market – Google execs have gone on record to say that the Pixel 6 and the Pixel 6 Pro will have premium pricing attached, which wasn't the case with last year's Pixel 5 release.",
    "Add in the rumor that production is being significantly boosted, and it looks very much like Google is putting everything it's got behind the Pixel 6 and Pixel 6 Pro to take on Apple and Samsung. In the next few months, we'll find out how successful it's been."
  ],
  "headers": {
    "3": "When will we see it?",
    "6": "Analysis: the Pixel 6 is Google's biggest launch in years"
  },
  "links": {
    "Pixel 6 and Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Nikkei Asia": "https://asia.nikkei.com/Business/Tech/Semiconductors/Google-developing-own-CPUs-for-Chromebook-laptops",
    "9to5Google": "https://9to5google.com/2021/09/01/pixel-6-production-report/",
    "making the Pixel phones official": "https://www.techradar.com/news/google-pixel-6-and-pixel-6-pro-officially-revealed-by-google",
    "says September 13": "https://www.techradar.com/news/google-pixel-6-could-get-its-grand-unveiling-on-september-13",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "on October 28": "https://www.techradar.com/reviews/google-pixel-6",
    "the Tensor processor": "https://www.techradar.com/news/google-pixel-6s-new-tensor-chipset-3-ways-it-may-top-apple-and-samsung-silicon",
    "for its Chromebooks too": "https://www.techradar.com/news/looks-like-google-wants-its-own-apple-m1-success-story",
    "gone on record": "https://www.techradar.com/news/google-pixel-6-pro-price-might-rival-the-iphone-13-and-samsung-galaxy-s21-plus",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5"
  }
}