{
  "source": "https://www.techradar.com/news/these-noise-cancelling-headphones-could-be-the-perfect-travel-companions",
  "title": "These noise-cancelling headphones could be the perfect travel companions",
  "category": "audio-visual",
  "updated": "2021-01-07T14:02:26Z",
  "author": "olivia-tambini",
  "summary": "JBL's new headphones are made with professionals in mind",
  "article": [
    "Although traveling may be out of the question for many of us at the moment, a great pair of noise-cancelling headphones are an essential piece of tech for anyone who frequently commutes or takes long haul flights – and the latest headphones from JBL could be a great choice if the specs are anything to go by.",
    "The new line up includes the JBL Tour ONE over-ear noise-cancelling headphones and the JBL Tour Pro+ true wireless earbuds. Both models come with adaptive noise cancellation, an Adaptive Ambient Aware mode for when you want to tune into your surroundings, and TalkThru, which allows you to hear the voices of people around you without turning off your music.",
    "Best of all, JBL's latest headphones come with a 'SilentNow' feature, which means you can activate noise cancellation without having to turn Bluetooth on – perfect if your device is in airplane mode during a flight.",
    "Another useful feature for traveling is the inclusion of Harman's new Smart Audio Mode. This allows you to optimize the Bluetooth connection for regular listening, increase the audio fidelity for music, or watch videos with low latency – so your movies should sync up with the audio perfectly.",
    "Both the JBL Tour ONE and the JBL Tour Pro+ come with hands-free support for Google Assistant and Alexa, so you can summon your device's assistant with your voice alone.",
    "If audio quality is your main concern, you'd probably be better off opting for the over-ear JBL Tour ONE. With support for Hi-Res Audio and 40mm dynamic drivers, they should provide a powerful, detailed sound, while the over-ear form factor usually makes for a more immersive listen than in-ear headphones.",
    "They also come with a 50-hour battery life, though that drops to 25 hours with active noise cancellation turned on.",
    "However, if you're looking for something more compact, the true wireless JBL Tour Pro+ could be your best bet.",
    "They feature 6.8mm dynamic drivers, and offer a total battery life of 30 hours – eight hours are contained within the buds themselves, though that number drops to six hours if you have noise cancellation turned on.",
    "An IPX4 water-resistance rating means they should be able to withstand a little rain or sweat if you want to use them for working out, while the accompanying JBL Headphones App allows you to make sure the earbuds fit your ears correctly, just like the Apple AirPods Pro.",
    "Both the JBL Tour ONE and the JBL Tour Pro+ will be available to buy in May, and they'll set you back £279.99 and £179.99, respectively. Global availability is still TBC, but that works out at around $380 / AU$490 for the JBL Tour ONE and $240 / AU$310 for the JBL Tour Pro+.",
    "So, if you're on a strict budget, the JBL Tour Pro+ could be a convincing cheaper alternative to the likes of the AirPods Pro and the Sony WF-1000XM3."
  ],
  "headers": {
    "5": "Over-ear or in-ear?"
  },
  "links": {
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}