{
  "source": "https://www.techradar.com/news/ps5-beta-firmware-m2-ssd-support-3d-audio-tv-updates-heres-whats-new",
  "title": "Everything new in the PS5 firmware update",
  "category": "gaming",
  "updated": "2021-08-30T02:01:20Z",
  "author": "henry-st-leger",
  "summary": "From M.2 SSDs to UI enhancements",
  "article": [
    "Some of the PS5's major pain points have finally been addressed in the console's latest firmware update, with Sony announcing a host of changes designed to make gaming on PlayStation even easier – and more immersive.",
    "It's only in beta for now, meaning you need to be part of PlayStation’s Beta testing program to enjoy these new features, but they're likely to be incoming to all PS5 players relatively soon too.",
    "The primary announcement, of course, is the addition of expandable storage. With the PS5's finite 667.2GB storage, and limitations on playing PS5 games through non-internal means, the increasing number of next-gen games are only getting harder to store. There are a few caveats, though, which we'll run you through below.",
    "That's not all, though – the PS5's fabled 3D audio feature, which was previously only available to use through headphones like the PS5 Pulse 3D, is now compatible with TV speakers, allowing those who like to play loud through their gaming TV a chance to benefit from the next-gen audio format.",
    "For all the detail on the latest PS5 update, read on.",
    "This is the main event, and likely the reason you're reading right now. As outlined on the PlayStation Blog, Sony has explained the method for increasing the amount of space for games on the console.",
    "At present, the upgrade option is only open to those on PlayStation’s Beta testing program, but the methodology is likely to stay the same for the imminent general release.",
    "If you are a beta user, you'll also need to source an M.2 SSD, a kind of high-speed solid state drive also used in high-spec PCs, and which is renowned for its fast loading times – and which could see internal SSD storage rise to 1TB or 2TB if you splash out on a good model.",
    "You'll also need a little DIY know-how, with some unscrewing of the PS5's outer plates needed to insert the SSD inside the console – so there's no easy plug-and-play option just yet.",
    "Sony also takes no responsibility for whether your M.2 SSD will actually work, saying that \"SIE cannot guarantee that all M.2 SSD devices meeting the described specifications will work with your console and assumes no responsibility for the selection, performance or use of third-party products.\"",
    "You can read more about the full specifications needed for a M.2 SSD on PS5 below – though we're also told that \"Because this is a beta, features and specifications may change before the full release of the feature in the future.\"",
    "Not content to rest on its laurels, Sony has also brought a number of updates to bear on the user interface, or UI. The Verge reports that there are now \"more personalization options for rearranging or choosing controls, and PS5 users will be able to view and write messages to friends and parties from the Game Base in the Control Center.\"",
    "Improved trophy tracking is said to be in place, alongside a clearer layout for the Friends Tab – including an easy way to see how many of your friends are online at any one time – and separate icons for the PS4 and PS5 versions of each game in your library.",
    "Tempest 3D Audio has been a key, touted feature of the PS5 for almost as long as the PS5 has been officially announced. Similar to the Dolby Atmos audio standard supported by the Xbox Series X and Xbox Series S, it gives an impressive 3D surround sound audio detail, even when played over stereo speakers (if in a more limited way than a proper surround sound speaker setup).",
    "The DualSense controller itself plays a key part in this, measuring the acoustics of the room around you to help calibrate the scale of the sound.",
    "Previously, though, this 3D Audio format could only be accessed on headphones, with Sony specifically pushing players towards its PS5 Pulse 3D Wireless Headset. However, the update also adds support for 3D Audio on TV speakers, meaning that the average gaming TV should be able to get something to that effect.",
    "As ever, the quality of your TV's speakers will determine to what extent you can take advantage of the format, as well as how well the feature is utilised by the PS5 game you're playing, but it's a great step in the right direction.",
    "This isn't quite as exciting as we'd hope, given how much Sony's PS Now service – the game streaming service that's failed to get anywhere near the traction of Xbox Game Pass – probably needs to improve its offering.",
    "However, you can now pick between 720p and 1080p streaming for PS Now games, which is a useful feature for those wanting to manage their streaming resolution more carefully – say, to reduce the amount of internet bandwidth they're using up.",
    "Ever got a great high score in a PlayStation game, and wished you could savor the moment forever? A little odd, maybe, but Sony is happy to indulge you, creating an automatic video clip of your victory when reaching new heights in in-game challenges. It's like a Kill-Cam, only happier."
  ],
  "headers": {
    "5": "1. M.2 SSD storage",
    "11": "2. An improved interface",
    "13": "3. Widespread 3D audio support",
    "17": "3. PS Now enhancements",
    "19": "5. Victory clips!"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PlayStation’s Beta testing program": "https://www.techradar.com/news/this-ps5-beta-program-will-let-you-test-new-console-features-before-anyone-else",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "PS5 Pulse 3D": "https://www.techradar.com/reviews/ps5-pulse-3d-wireless-headset",
    "gaming TV": "https://www.techradar.com/news/best-gaming-tv",
    "PlayStation Blog": "https://www.playstation.com/en-us/support/hardware/ps5-install-m2-ssd/#min",
    "M.2 SSD": "https://www.techradar.com/best/best-m2-ssd",
    "The Verge": "https://www.theverge.com/2021/7/29/22599593/sony-ps5-m2-ssd-support-beta-features"
  }
}