{
  "source": "https://www.techradar.com/news/toughbook-g2-panasonic-launches-new-rugged-2-in-1-for-ultimate-versatility",
  "title": "ToughBook G2: Panasonic launches new rugged 2-in-1 for ultimate versatility",
  "category": "computing",
  "updated": "2021-06-30T21:30:47Z",
  "author": "anthony-spadafora",
  "summary": "Power of a rugged laptop with the versatility of a rugged tablet",
  "article": [
    "Panasonic has unveiled the Toughbook G2 and the new 2-in-1 combines the power and performance of a rugged laptop with the portability and versatility of a rugged tablet.",
    "The device has been designed with usability and security in mind while still providing mobile workforces with access to important legacy systems. It's also more secure as it is a Microsoft Secured-Core PC that runs Windows 10 but will be upgradable to Windows 11.",
    "New additions to the Toughbook G2 include eSIM and 4G connectivity for field workers and the next generation 2-in-1 also features double the RAM and storage of its predecessor. Improved screen brightness makes the Toughbook G2 easier to use in direct sunlight while three customizable buttons on the front frame of its display offer quick access to frequently used applications and settings.",
    "The Toughbook G2 features a 10th Gen Intel Core Processor (Quad Core) with Intel vPro technology and 16GB of RAM though it can be outfitted with a total of 32GB of RAM. The new 2-in-1 will be available in both a Standard and a Quick Release SSD model and the latter is ideal for data sensitive sectors such as emergency services, police forces and defense.",
    "Just like the Toughbook G1 and Toughbook 20 that came before it, the Toughbook G2 is compatible with a rich ecosystem of dedicated accessories including vehicle docks that can be used with and without a keyboard, hand straps, shoulder straps and cases with sanitizable options. It's also worth noting that the G2 will be backwards-compatible with accessories from both of its predecessors including vehicle docks.",
    "Thanks to the inclusion of a user-exchangeable expansion bay area, customers will be able to add contact smart card and contactless smart card readers to the G2 for additional functionality. The Toughbook G2 can also be equipped with an optional emissive backlit keyboard that adds an extra USB-A and USB-C port. When mobile workers return from the field, the Toughbook G2 can be plugged into an optional laptop docking station from Panasonic that allows the device to output in 4K to two external monitors.",
    "Senior product marketing manager at Panasonic's mobile solutions business, Dirk Weigelt provided further insight on how the new Toughbook G2 outshines its predecessors in a press release, saying:",
    "“Mobile workers loved the TOUGHBOOK G1 and 20 but the G2 will steal their hearts. It truly is the next generation rugged device for mobile workforces. It offers all the benefits of the latest technology, while maintaining important access to legacy systems, all wrapped up in a more flexible, secure and ultimately even more useable device.”",
    "The Toughbook G2 will be available at the end of the July and prices will start at €2,450 / £2,218 + VAT in the EU and UK though US pricing has not yet been released."
  ],
  "headers": {
    "4": "Accessories galore"
  },
  "links": {
    "Toughbook G2": "https://business.panasonic.co.uk/mobile-solutions/products-and-accessories/tablets/TOUGHBOOK-G2",
    "rugged laptop": "https://www.techradar.com/news/best-rugged-laptops",
    "rugged tablet": "https://www.techradar.com/news/the-best-rugged-tablets",
    "Microsoft Secured-Core PC": "https://www.techradar.com/news/microsofts-secured-core-pcs-will-defend-against-firmware-level-threats",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Intel vPro": "https://www.techradar.com/news/intel-unveils-new-vpro-platform-to-go-head-to-head-against-new-ryzen-pro",
    "Toughbook 20": "https://www.techradar.com/news/mobile-computing/laptops/the-ruggedized-panasonic-toughbook-20-can-survive-6-foot-drops-and-scorching-hot-temperatures-1308524",
    "laptop docking station": "https://www.techradar.com/news/the-best-laptop-docking-stations",
    "external monitors": "https://www.techradar.com/news/best-business-monitor",
    "press release": "https://www.realwire.com/releases/New-TOUGHBOOK-G2-tablet-set-to-steal-the-hearts-of-mobile-workers"
  }
}