{
  "source": "https://www.techradar.com/news/pc-players-are-fixing-the-broken-gta-trilogy-remake-but-they-shouldnt-have-to",
  "title": "PC players are fixing the broken GTA Trilogy remake – but they shouldn't have to",
  "category": "gaming",
  "updated": "2021-11-15T12:44:52Z",
  "author": "hamish-hector",
  "summary": "Modders to the rescue",
  "article": [
    "PC players have had enough of GTA: The Trilogy - Definitive Edition’s problems and are already fixing the game with their own mods.",
    "The recent GTA remaster has been widely criticised as one of the worst game remakes ever released. Slapdash texture updates, an incomplete radio soundtrack, and vision-obscuring rain are just a handful of the issues plaguing the title – meaning that players are taking it on themselves to fix the Rockstar games.",
    "Mods for the PC edition of GTA: The Trilogy have been released that take aim at the most egregious faults, and members of the modding community have vowed that more fixes will come as time goes on. One of the main targets is the rain which falls in these thick white lines that blanket the game’s screen and make it nearly unplayable – with mods so far making the streaks more transparent and looking to fix issues where rain won’t fall over water.",
    "Other mods have already started to expand the trilogy’s radio station’s music collection after it was discovered that many tracks from the original games were in the game’s files but aren’t playable thanks to certain lines of code.",
    "What makes the current efforts especially impressive is that the modding community has achieved these early fixes in very little time. While the game was officially released on Friday, November 12 the Rockstar PC launcher was broken for around two days and the game was actually taken off sale for a time too – meaning that those on PC had spent less than 24 hours actually playing the game before fixes began coming out.",
    "Unfortunately, console players are forced to wait a while longer, with the head of Grove Street Studios Thomas Williamson explaining in a Tweet that the team is working on updates; however, we don’t yet have a timeline for when these changes will arrive.",
    "One of the main draws of PC gaming is mod support that allows players to add their own wild creations to games they love and update titles that are the best part of a decade old.",
    "To that end, the texture upgrades and fixes that we’re seeing with GTA: The Trilogy - Definitive Edition is exactly what we’d expect from the modding community. The difference here is that they’re not normally created for games that were released days ago.",
    "Over the past few years, we’ve seen plenty of remakes and remasters, and while we can’t expect every game to receive the Resident Evil 2 Remake treatment, we should at least expect the remaster to be worthy of release on current-gen hardware.",
    "Take the Crash Bandicoot N. Sane Trilogy: while the levels are laid out exactly as players remember, the game has been made to look brand new – the same simply cannot be said of the GTA Trilogy remake.",
    "While we love to see that mods are helping to fix a busted game for PC players, it shouldn’t be on the community to provide these fixes – especially as many mods are created and released for free. This kind of work should have been done by the developers – isn't that why we've been asked to pay $60 / £55 / AU$80?",
    "Hopefully, the Grove Street Studios team will be thick and fast with its patches so that console players won't be stuck with the busted version of the GTA Trilogy for much longer. In the meantime, we can once again take this as a lesson to think twice about buying a game before we've seen it action."
  ],
  "headers": {
    "6": "Mods shouldn't have to fix new games"
  },
  "links": {
    "GTA: The Trilogy - Definitive Edition": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "one of the worst game remakes ever released": "https://www.techradar.com/news/gta-3-deserved-better-than-this-messy-definitive-trilogy-remastering",
    "Mods for the PC edition of GTA: The Trilogy": "https://www.pcgamer.com/modders-are-fixing-gta-trilogys-rain-already/",
    "rain won’t fall over water": "https://twitter.com/JankyNedelko/status/1458945407397081098",
    "Rockstar PC launcher was broken for around two days": "https://www.techradar.com/news/remastered-gta-trilogy-is-available-again-on-pc-via-rockstar-games-launcher",
    "taken off sale for a time": "https://www.techradar.com/news/rockstar-has-removed-gta-the-trilogy-the-definitive-edition-from-sale-on-pc",
    "explaining in a Tweet that the team is working on updates": "https://twitter.com/TSWilliamson/status/1458796005185531906",
    "Resident Evil 2 Remake": "https://www.techradar.com/reviews/resident-evil-2-remake-review",
    "Crash Bandicoot N. Sane Trilogy": "https://www.techradar.com/news/crash-bandicoot-shows-us-how-classic-games-should-be-resurrected"
  }
}