{
  "source": "https://www.techradar.com/news/pocketbooks-new-78-inch-inkpad-color-is-the-color-ereader-youve-been-waiting-for",
  "title": "PocketBook's new 7.8-inch InkPad Color is the color ereader you've been waiting for",
  "category": "tablets",
  "updated": "2021-02-17T02:56:03Z",
  "author": "sharmishta-sarkar",
  "summary": "New E Ink Kaleido technology displays 4,096 colors",
  "article": [
    "Swiss ereader maker PocketBook has announced a new addition to its line up, a 7.8-inch device called InkPad Color. As the name suggests, this ereader boasts an E Ink screen capable of displaying colors – 4,096 colors to be precise.",
    "That might not seem as impressive as the color gamut of modern smartphone screens, but there aren't too many ereaders on the market capable of handling graphic novels or book illustrations in full color.",
    "This larger device takes over from the PocketBook Color, a 6-inch ereader that launched last year and was one of the first commercially-available options with the new E Ink Kaleido technology for colored pages.",
    "Other than being able to display 4,000+ colors, the new iteration of the Kaleido tech found in the InkPad uses an upgraded color filter that enhances contrast and saturation, while also improving on the screen's refresh rate. That means not only will text and images appear crisp and clear, page turns and scrolls also promise to be smoother.",
    "Given its ability to bring pictures to life, the new PocketBook InkPad Color should be perfectly suited for reading comics and children's books, or even more work-oriented imagery like graphs and pie charts.",
    "While it's not the first color ereader, the InkPad Color is the first with a large-screen display. It's almost as big as the 8-inch Kobo Forma and beats Amazon's Kindle Oasis by a bit. That's a very comfortable size – hitting the sweet spot between portability and display real estate.",
    "That said, the limitations of the new E Ink Kaleido technology mean color output is limited to just 100ppi, which is significantly lower than its black/grey resolution of 300ppi.",
    "Running on a custom version of Linux, the InkPad Color is 8mm thick and weighs 225g, making it one of the heavier ereaders currently available, but still very portable. There's 16GB of internal storage available, plus an SD card slot with support for an additional 32GB.",
    "A 2,900mAh battery should give you plenty of time with the device between charges, while Bluetooth 5.1 support means you'll be able to pair wireless headphones and listen to audiobooks. PocketBook promises that 19 ebook formats are supported, along with six audio formats and four graphic.",
    "It's available to buy now in the US and UK from Amazon for $329 / £336 (about AU$425). Unfortunately PocketBooks are currently only sold in few select markets, but we're hoping that might change in the near future.",
    "[Via The Verge]"
  ],
  "headers": {},
  "links": {
    "Kobo Forma": "https://www.techradar.com/reviews/kobo-forma-review",
    "Amazon's Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review",
    "US": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08VJK1Y1Q%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7434700379238815000-20",
    "UK": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FPocketBook-InkPad-Color-moon-silver%2Fdp%2FB08VJK1Y1Q%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-7951295175315631000-21",
    "The Verge": "https://www.theverge.com/2021/2/15/22284923/pocketbook-inkpad-color-kaleido-e-reader-available-now-price"
  }
}