{
  "source": "https://www.techradar.com/news/microsoft-edge-will-soon-make-it-easier-to-switch-between-profiles",
  "title": "Microsoft Edge will soon make it easier to switch between profiles",
  "category": "computing",
  "updated": "2021-01-26T14:28:57.129Z",
  "author": "barclay-ballard",
  "summary": "New Microsoft Edge feature is available now through Dev and Canary channels",
  "article": [
    "Microsoft Edge is working on a new feature that will make it easier for users to switch between multiple profiles. The profile switcher option may mean that individuals have less need to use anonymous browsers.",
    "The new feature has only been made available through the Canary and Dev channels but Edge users that have access to these channels only need to be running Windows 10 version 2004 or newer. There’s been no word on when Microsoft will bring the feature to its Edge Beta and Stable channels.",
    "Although Edge initially unveiled profile support back in 2019, users have had to stick with one profile until now. With profile switcher, individuals can quickly change between profiles when using progressive web apps, such as if they have different work and personal accounts.",
    "“If you install the same site or PWA on more than one Edge profile, we’ve introduced a profile switcher on the application title bar to switch between profiles from within your app,” Josh Bodner, a Microsoft community manager, explained. “With this experiment, you’ll only see one application tile in Windows for that application. Also, when the application starts, it uses the last profile used by the application.”",
    "In order to switch profiles when using a particular application, users first need to locate the profile icon on the title bar of the application, select the alternative profile, and then confirm that a second application window has opened up with the new profile.",
    "Microsoft has been working on its profile options for a while now, incorporating user feedback into any new features it launches. This is continuing with the new profile switcher, with the Redmond-based firm already asking users if they would prefer to choose their default profile each time they install a new app, as well as several other questions.",
    "Via OnMSFT"
  ],
  "headers": {
    "3": "Switching it up"
  },
  "links": {
    "anonymous browsers": "https://www.techradar.com/best/anonymous-browsing",
    "explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1845812675870187000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Farticles%2Fswitch-profiles-in-web-apps%2Fm-p%2F2088732%23M4399&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-edge-will-soon-make-it-easier-to-switch-between-profiles",
    "OnMSFT": "https://www.onmsft.com/news/microsoft-edge-canary-and-dev-make-it-easier-to-switch-between-profiles-in-pwas"
  }
}