{
  "source": "https://www.techradar.com/news/qualcomm-may-be-cooking-up-a-nintendo-switch-like-game-console",
  "title": "Qualcomm may be cooking up a Nintendo Switch-like game console",
  "category": "gaming",
  "updated": "2021-03-23T22:10:58Z",
  "author": "david-lumb",
  "summary": "Qualcomm console: top phone specs at a Nintendo Switch pricetag",
  "article": [
    "Qualcomm is reportedly developing its own gaming console powered by one of the company’s Snapdragon chipsets, running the upcoming Android 12, and have detachable controllers much like the Nintendo Switch.",
    "And, according to the report by Android Police, this \"Qualcomm console\" as they call it could launch as soon as Q1 2022.",
    "The supposed console would conceivably play any Android-compatible game, making it a sort of middleground between the Switch’s on-the-go appeal and phones with features especially for mobile gaming, like the Asus ROG 5 with its Joy Con-like Kunai gamepad.",
    "But unlike the Asus ROG, Qualcomm’s console would be a console first, with controllers natively attaching to its sides and a thicker, bulkier body than a typical thin smartphone to deliver better thermal performance and faster processor speed.",
    "In addition to the Qualcomm processor, it will reportedly have a microSD slot for expandable storage and a 6,000mAh battery with Qualcomm’s Quick Charge tech, sources told Android Police, as well as a display-out functionality to play on a TV or monitor much like the Switch, though it’s unclear what kind of ports it’ll have.",
    "The Qualcomm console will supposedly play nice with the Google Play store and Android apps, but will also reportedly support the Epic Games Store app, which has its own interesting implications:",
    "It’s unclear if the Qualcomm console will support streaming gaming services like Google Stadia and Nvidia GeForce Now, however on paper it should support both.",
    "Given the Q1 2022 launch target, Qualcomm will reportedly use whichever Snapdragon chipset follows the Snapdragon 888, the current top-tier silicon powering the best Android phones of 2021. And with a supposed pricetag of $300 (around £218 / AU$393), about the same as the Nintendo Switch, the Qualcomm console could make a real play for consumers who want a discrete mobile gaming device.",
    "If you’re thinking we’ve seen this before, we have – notably in the Nvidia handheld devices, the Shield Portable and Shield Tablet. Both were Android-based devices that supported current console game controllers to ease adoption, but were quietly discontinued once the Nintendo Switch – which packed similar hardware – launched in 2017.",
    "Equipment manufacturers have cut a careful swath around the Switch, and for good reason: it’s absolutely dominated the mobile console market, recently outpacing the venerable Nintendo Entertainment System in terms of sales with over 68 million Switch units sold as of September 2020.",
    "But it seems like Qualcomm believes it’s time for a competitor.",
    "The specs seem like a gaming phone: whatever leading Snapdragon processor, 5G connectivity, typical phone sensors like GPS and an accelerometer, Bluetooth connectivity, a 6,000mAh battery, clip-on controllers, and a 6.66-inch display with a fan according to XDA Developers’ Mishaal Rahman.",
    "Rahman’s source believed this device wouldn’t be a commercial product, serving instead as a reference design considering how popular gaming smartphones have become in China. But the Android Police report claims Qualcomm is planning to sell its console directly to consumers as well as use its US carrier connections to be sold in stores. Nevertheless, Nintendo casts a long shadow, and Qualcomm is supposedly tempering any sales expectations, hoping instead that the console would inspire its partners to experiment with new form factors between ‘mobile’ and ‘console.’"
  ],
  "headers": {
    "8": "A gaming phone in all but calling capability"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Android Police": "https://www.androidpolice.com/2021/03/23/exclusive-qualcomm-is-planning-an-android-powered-nintendo-switch-knockoff/",
    "Asus ROG 5": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Nvidia GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "best Android phones": "https://www.techradar.com/best/best-android-phones",
    "outpacing": "https://www.techradar.com/news/the-nintendo-switch-has-now-sold-more-units-than-the-nes",
    "Mishaal Rahman": "https://twitter.com/MishaalRahman/status/1374447532756004879"
  }
}