{
  "source": "https://www.techradar.com/news/wandavision-episode-7s-mid-credits-scene-explained",
  "title": "WandaVision episode 7's mid-credits scene explained",
  "category": "entertainment",
  "updated": "2021-02-19T18:00:56Z",
  "author": "samuel-roberts",
  "summary": "Spoilers follow",
  "article": [
    "Spoilers follow for the mid-credits scene of WandaVision episode 7 in the second half of this article.",
    "Consider this a friendly warning: WandaVision episode 7 has a post-credits sequence. Well, more accurately, it has a mid-credits sequence – and it's the first one we've seen in the Marvel Cinematic Universe TV show so far.",
    "These kinds of scenes are famous parts of the MCU movies, and now it seems like Marvel is experimenting with them on the small screen, too.",
    "Without spoiling episode 7's mid-credits scene here (scroll down this page if you want to know what happens in the relatively short sequence), it's certainly not in the realm of the Earth-shattering cameos we're used to from the Marvel movies, but it definitely sheds light on what'll happen in next week's episode. You won't want to miss it if you're enjoying the show.",
    "One of TechRadar's own writers actually missed the scene when watching this morning, so it's good to go in prepared.",
    "We'll be going into spoilers below if you'd like to know what happens in the WandaVision episode 7 mid-credits scene – so this is a last warning before we jump into the details of what goes down.",
    "WandaVision episode 7 ends with Wanda discovering who's been behind her misfortune in Westview: her neighbor Agnes (Kathryn Hahn), also known as Agatha Harkness, a well-known figure in the Marvel canon.",
    "We see from a musical sequence that pretty much all the major events that have occurred in Westview's sitcom reality are down to her, including the appearance of Pietro Maximoff (Evan Peters) in episodes 6 and 7.",
    "Earlier in the episode, Monica Rambeau (Teyonah Parris) found a way back into Westview – a struggle that seemed to have left her with superpowers of her own. After confronting Wanda on her lawn, Agnes intervened and took Wanda away to her house, which led to the events of this week's ending.",
    "The mid-credits sequence is very short, but it sees Rambeau investigating the outside of Agnes' home following her spat with Wanda. After trying to look through the windows, she opens the door to the basement, and sees the tree roots beneath Agnes' house glowing.",
    "Moments later, Pietro (Evan Peters) appears behind Monica, and says \"snoopers gonna snoop\" in a way that can definitely be described as threatening. The cuts before we find out what happens next.",
    "The exact nature of Pietro's existence in WandaVision is still something of a mystery. Clearly, he's an agent of Agatha's – but whether he's the original Pietro reanimated, puppet-style, or some kind of apparition within Westview, remains to be seen.",
    "Still, the super speedster seems like bad news for Monica – but at least Captain Rambeau hasn't given up on helping Wanda.",
    "WandaVision episode 8 will land on February 26."
  ],
  "headers": {
    "6": "WandaVision episode 7 mid-credits scene explained"
  },
  "links": {
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Agatha Harkness": "https://www.techradar.com/news/wandavision-episode-7-ending-explained",
    "Pietro Maximoff": "https://www.techradar.com/news/quicksilver-in-wandavision-explained-what-we-know-about-pietro-maximoff",
    "Monica Rambeau": "https://www.techradar.com/news/wandavision-who-is-monica-rambeau"
  }
}