{
  "source": "https://www.techradar.com/news/nintendo-has-acquired-a-new-developer-heres-what-it-means-for-switch-owners",
  "title": "Nintendo has acquired a new developer – here’s what it means for Switch owners",
  "category": "gaming",
  "updated": "2021-01-05T11:29:16Z",
  "author": "adam-vjestica",
  "summary": "Taking things to the Next Level",
  "article": [
    "It’s not often Nintendo splashes the cash to purchase a new developer or studio – big acquisitions are usually left to the likes of Microsoft, who recently purchased Bethesda in a deal costing $7.5 billion. However, the Kyoto-based company has decided to expand its portfolio with the acquisition of Next Level Games.",
    "Nintendo Switch owners might recognize Next Level Games as the developer behind Luigi’s Mansion 3, but the Canadian company has also worked on previous Nintendo systems over the years, such as on the Nintendo GameCube with Super Mario Strikers, Punch Out!! on the Wii, and Luigi’s Mansion: Dark Moon on Nintendo 3DS.",
    "Next Level Games also developed Metroid Prime: Federation Force for the 3DS, but the less said about that title, the better.",
    "The buyout is ultimately good news for Nintendo fans, as it means Nintendo now has another trusted and proven studio to handle its precious IPs.",
    "The company has lent more on licensing its franchises to third-party developers in recent years, such as Koei Tecmo for the Hyrule Warriors and Fire Emblem Warriors games, as well as collaborating with Bandai Namco for support when developing Super Smash Bros. Ultimate.",
    "The acquisition means Nintendo will obtain 100% of Next Level Games shares, and the deal will officially close on March 1, 2021. Nintendo made the following statement below regarding the buyout.",
    "“Next Level Games has worked exclusively with Nintendo in developing software titles for the Nintendo 3DS and Nintendo Switch systems, including titles in the critically acclaimed Luigi’s Mansion series of video games,” Nintendo’s statement reads.",
    "The statement also suggests that Nintendo will use Next Level Games in a greater capacity going forward, which is particularly exciting when you consider there are plenty of IPs worthy of a revival such as F-Zero, a series that fans are clamoring to see return.",
    "“Completion of the Acquisition will serve to secure the availability of Next Level Games development resources for Nintendo, including development expertise, as well as facilitate an anticipated improvement in development speed and quality by enabling closer communication and exchange of staff with the Nintendo development team.”",
    "We'll be keeping a close eye on any future assignment Next Level Games gets from Nintendo with interest, then, and hope that the studio is a lot more active than some of Nintendo's other subsidiaries like Retro Studios, who developed Metroid Prime and Donkey Kong Country: Tropical Freeze.",
    "Via Gematsu"
  ],
  "headers": {
    "7": "Sleeping giant"
  },
  "links": {
    "purchased Bethesda in a deal costing $7.5 billion": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo GameCube": "https://www.techradar.com/best/best-gamecube-games",
    "Nintendo 3DS": "https://www.techradar.com/news/5-reasons-you-should-buy-a-nintendo-3ds-over-the-nintendo-switch",
    "Hyrule Warriors": "https://www.techradar.com/news/revisit-breath-of-the-wilds-world-in-hyrule-warriors-age-of-calamity",
    "Super Smash Bros. Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review",
    "following statement": "https://www.nintendo.co.jp/ir/pdf/2021/210105e.pdf",
    "Metroid Prime": "https://www.techradar.com/news/metroid-prime-4",
    "Gematsu": "https://www.gematsu.com/2021/01/nintendo-acquires-next-level-games"
  }
}