{
  "source": "https://www.techradar.com/news/the-sony-xperia-pro-i-is-an-alpha-camera-phone-but-that-isnt-what-most-people-want",
  "title": "The Sony Xperia Pro-I is an Alpha camera phone, but that isn't what most people want",
  "category": "cameras",
  "updated": "2021-10-26T11:00:00Z",
  "author": "mark-wilson",
  "summary": "Opinion: A manual-drive car in a world of amazing automatics",
  "article": [
    "It's finally happened – Sony's Xperia, Cyber-shot and Alpha teams have teamed up to make a phone that, for the first time, Sony considers a worthy member of its camera lineup. That phone is the Sony Xperia Pro-I, and it's a symbolic moment that's been a long time coming. But it's also a phone that feels out feels out-of-step with its computational point-and-shoot rivals.",
    "There's nothing wrong with being out-of-step, but the Xperia Pro-I feels less Nintendo Switch and more retro camera emulator. It's certainly unique, combining a 1-Inch sensor, variable aperture and Alpha-style tracking autofocus, which makes it the phone equivalent of the Sony RX100 VII. Yet those features are designed to appeal to traditional photographers and Sony fans, rather than the average person.",
    "I'm glad Sony has made the Sony Xperia Pro-I. It brings new ideas to camera phones, and ones that come from its excellent Cyber-shot and Alpha cameras. But computational photography, like the new tricks seen on the Google Pixel 6, has changed the game for pocket cameras. And that, plus the limitations of physics, means the Xperia Pro-I is destined to be a niche curiosity, rather than an Alpha-style disruptor.",
    "The timing of the Xperia Pro-I's arrival, exactly a week after the Google Pixel 6, makes its old-school approach feel particularly stark.",
    "The Pixel 6 leans heavily into Google's machine learning to deliver some original point-and-shoot tricks like 'Magic Eraser' and 'Action Pan'. These automate traditional tools and techniques, like panning and Photoshop's 'Heal brush', for people who don't want to learn photography.",
    "The Xperia Pro-I (the 'I' is for Imaging) takes the opposite approach. It's built on Sony's hardware power, like large sensors, Bionz X processors and glass aspherical lenses, to create an experience that's a cross between its Cyber-shot and Alpha cameras. It even has the same shutter module as Sony's RX100 series cameras, which means you half-press the button to autofocus – an addition that'll have camera fans coo-ing.",
    "What this adds up to, though, is a phone that'll likely need to be used like a traditional camera, rather than a point-and-shoot. How many people want to mount their phone on a tripod for long exposures? Or use a camera interface that's covered in strange numbers and symbols? Probably only existing photographers, and they may well already own a powerful travel camera.",
    "There's an additional drawback to this approach, too. Phones like the iPhone 13 Pro and Google Pixel 6 have drawn on silicon and incredible multi-frame processing to evolve beyond the laws of physics.",
    "Features like Night Modes and Apple's Cinematic Mode are making, for most people, traditional image quality factors like sensor size and even autofocus irrelevant. Almost every camera setting and photographic effect is now simulated and adjustable after you've hit the shutter.",
    "For photographers, many of these modes are still too artificial and error-prone to rely on. That's why the Xperia Pro-I could hold some unique appeal. But the Xperia Pro-I's reliance on traditional hardware power means that squashing an RX100 VII into phone form brings some bottlenecks.",
    "For example, it's only able to use a 12MP area of its 1-Inch 20MP sensor for stills. Combine that with a small, f/2.0 lens, and you can still expect cameras like the RX100 VII (and even other phones) to produce superior raw quality, particularly at longer focal lengths.",
    "These physical constraints also mean the Xperia Pro-I lacks a macro mode or a telephoto lens, with its three lenses offering equivalent focal lengths of 16mm, 24mm and 50mm. So while it has impressive camera chops and a pro-friendly interface, it also isn't as versatile as rivals like the iPhone 13 Pro or Google Pixel 6 Pro. Still, it does have one additional trick up its sleeve – and that's video.",
    "Given its video skills, I'm surprised that Sony hasn't marketed the Xperia Pro-I as the phone equivalent of its Sony ZV-1 vlogging camera rather than the RX100 series (perhaps that's coming next). After all, it's the first phone with a 4K/120p slow-mo video mode, and also the first to include Eye AF tracking in video.",
    "The fact that the Xperia Pro-I's lenses are all relatively wide also makes it perhaps more suited to vlogging than traditional photography – and this feeling is strengthened by Sony's release of an optional Vlog Monitor accessory ($199 / £169, or around AU$265) to go with the phone.",
    "That 3.5in screen attaches magnetically to the back of the Xperia Pro-I, and solves a genuine problem for YouTubers who want to use their phone for videos – having to use the front-facing camera if they also want to see their screen. Combine the Vlog Monitor with Sony's GP-VPT2BT Bluetooth shooting grip, and you have a compelling (albeit expensive) all-in-one vlogging setup.",
    "It's here where the Xperia Pro-I starts to make more sense – Sony is one of the most (if not, the most) popular camera brands among YouTubers, so a phone that slots neatly into their setup offering a similar interface and color science could prove tempting. But that'd also likely mean giving up many of the computational tricks of today's best camera phones, which are ideal for posting on social media.",
    "The Sony Xperia Pro-I certainly carries the swagger of its impressive cameras, but it has the more niche appeal of an Xperia phone in Alpha fancy dress. The limitations of physics mean it doesn't eclipse the Sony RX100 VII, but nor is it likely to have the computational power needed to match the iPhone 13 Pro or Google Pixel 6.",
    "That doesn't make it irrelevant – some photographers will definitely enjoy its more traditional experience and unwillingness to cake their photos in too much processing. Vloggers, too, could well see it as the ideal, pocketable complement to their Sony A6400 or Sony A7 IV.",
    "But in this sense, the Xperia Pro-I is more like an Apple Watch for existing Sony camera fans, rather than an attempt to steal market share from the likes of Apple, Google and Samsung in the camera phone wars.",
    "That's okay, but the more exciting launch for photographers would likely be bringing phone-style computational photography to a camera like the RX100 VII, rather than the other way around."
  ],
  "headers": {
    "3": "High contrast",
    "7": "Pesky physics",
    "12": "Vlog star",
    "16": "On the fringes"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Sony RX100 VII": "https://www.techradar.com/reviews/sony-cyber-shot-rx100-vii",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Cinematic Mode": "https://www.techradar.com/news/what-is-cinematic-mode-the-iphone-13s-new-video-focusing-trick-explained",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone"
  }
}