{
  "source": "https://www.techradar.com/news/oled-vs-lcd-led",
  "title": "OLED vs LED vs LCD: which TV technology should earn a place in your living room?",
  "category": "televisions",
  "updated": "2021-03-03T15:46:44Z",
  "author": "jamie-carter",
  "summary": "How to choose between the competing TV technologies",
  "article": [
    "When it comes to OLED, LED, and LCD, are you confident in picking the TV panel technology that's right for you? Can you tell them apart? We wouldn't blame you for feeling unsure: the TV market is packed with seemingly impenetrable acronyms and bizarre naming conventions. For example, did you know QLED counts as LED, while OLED most certainly does not? Knowing your LCD from your elbow isn't as straightforward as any of us would like.",
    "But if you're buying a new TV and want to know the important distinctions between OLED and LCD-LED sets – each with their own trade-off between price and picture quality – we have the guide for you, which lays out what each technology is and why it matters.",
    "Many aspects of televisions are common across different panel technologies: both LED and OLED LG TVs will use the same webOS smart TV platform, for example, and you can find a mix of TV sizes whatever kind of TV you end up choosing. But the difference in panels and processors can have huge consequences for the picture quality which, at the end of the day, is the most important aspect of a television.",
    "All of these screen technologies support the increasingly essential 4K resolution, as well as accompanying 4K color-boosting tech like HDR, HDR10+ and Dolby Vision.",
    "There are hosts of other terms that can distinguish between sets – like 4K HDR Processor X1, Dynamic Range PRO and Triluminos Display (Sony), NanoCell and IPS 4K Quantum Display (LG) and 4K SUHD and Ultra HD Premium HDR 1500/2000 (Samsung). These technologies certainly make a difference, but they're hardly the be-all and end-all.",
    "When buying a TV, we'd recommend keeping your mind less on all the marketing buzzwords and more on the important picture quality differences between OLED and LCD-LED – as well as the latter's premium QLED iterations. We'll explain everything you need to know below.",
    "Watching an OLED TV for the first time is genuinely a pure ‘whoah!’ moment. So smooth, fluid, colourful and contrasty are the images that it's really hard to go back to your old LCD or plasma TV. Does that mean OLED is the flat TV tech we’ve been waiting for?",
    "Almost as flat as wallpaper, organic light-emitting diode (OLED) is a breakthrough moment for TVs. Critically, it emits its own light, so the huge backlight used by most TVs isn’t there. As well as being slim, in an OLED display each pixel self-illuminates, so you can control images at an individual pixel level.",
    "In an OLED panel, organic films are placed between semiconductors, then supplied with an electrical current, which effectively means that each and every pixel can be switched on and off individually. This process simultaneously uses less power to create more brightness, and makes total black possible.",
    "So any video that features both darkness and extreme brightness, such as a star-filled night sky, looks realistic. With unlimited contrast, it means the whitest whites and the darkest blacks – and everything in between. Expect eye-popping color, and, crucially, lightning-fast response times. There are downsides to OLED too though: it’s very expensive, and no one is quite sure how long panels will last.",
    "OLED panel manufacturing is also more environmentally friendly than traditional panels. While LCD panels require the greenhouse gas Nitrogen Trifluoride in their production, OLEDs don’t. So, if you want to save the planet and have a better picture quality, you may want an OLED set.",
    "If you can’t justify spending big on an OLED or QLED TV, the good news is that all major TV brands are still selling plenty of LCD-LED TVs. LCD (liquid crystal display) and LED (light-emitting diode) TVs are often thought of as competing concepts, but they actually refer to identical display technology. In an LCD TV, liquid crystals rotate polarized light, effectively acting as a light valve that illuminates all pixels simultaneously. Instead of the pixel-by-pixel lighting of OLED TVs, in a standard LCD TV all light comes from a big energy-guzzling backlight. The result is a uniform brightness, and relatively low contrast images.",
    "LCD is an outmoded technology, so much so that you can’t easily buy basic LCD TVs of any size anymore, at least not in the original configuration. That's where LED-backlighting comes in – instead of having a one-piece backlight that limits contrast, LED TVs are illuminated by (you guessed it) LEDs. They’re ranged in either clusters behind the panel (so-called full-array local dimming) or on the sides (called ‘edge’ or ‘edge-lit’ LED TVs). The latter is more common, largely because the resulting TV is flatter.",
    "There are a few drawbacks, namely that both techniques still get their light from an external source that increases the components and size of the finished TV. If you watch in a completely black environment, you’ll notice blotches and uneven brightness on the panel too, and a lack of shadow detail in dark areas of the screen. That said, images are usually very bright, and very colorful, and you can buy an LED TV in virtually any size you want. They're great value.",
    "Brands are always trying to shout about new innovations (such as LG’s chatter about Nano Cell technology), but they're often just tweaking old technology. LED-backlit LCD TVs provide the current sweet-spot for TV technology, and that's not going to change anytime soon.",
    "Another premium TV technology, QLED (quantum-dot light emitting diode) is very different to OLED.",
    "QLED panels are not self-emissive, instead lit by LEDs along the edge (just like an Edge LED-backlit LCD). The advantages of QLED TVs are that they use a quantum dot color filter and are capable of significantly higher brightness than OLED TVs. Cue eye-popping color, but slower response times than an OLED TV. However, the contrast and blacks aren’t as good as OLED TVs.",
    "So far, QLED has had only modest success, but that could change. At CES 2018, Samsung announced that its QLED TVs for 2018 would use direct, local-dimming backlighting, and boast even higher brightness. If the black level performance and motion blur issues can be improved, Samsung could be on to something. But only if they’re cheaper than OLED, which for now remains the benchmark.",
    "Most TV brands sell whatever TV technology is popular. However, there is a schism in the market; as noone really sells both OLED and QLED (excluding Hisense, who are flirting with both quantum dot LED displays and their first OLED set).",
    "OLED panels are manufactured only by LG, and QLED panels only by Samsung. Other brands use them on license and try and add their own secret sauce to give their particular models the edge.",
    "What you decide to buy largely comes down to price. Future innovations could turn that advice on its head, but for now, if you have money to burn and want the best, go for an OLED – no question. Want a brighter panel? Go for a QLED. If price is more of a concern and you don't need the blackest blacks around, then an LED-backlit LCD TV could well be the one you want – they might not have quite the same level of contrast, but depending on the manufacturer's technology they could come very close.",
    "It may all seem confusing at first, but when armed with a little knowledge about the differences between OLED, QLED, LED and LCD, buying a TV isn't quite as tricky as you might think."
  ],
  "headers": {
    "6": "OLED vs LCD-LED",
    "11": "What is LCD & LED?",
    "15": "LCD-LED vs QLED",
    "18": "Should I buy an OLED, QLED, or LCD-LED TV?"
  },
  "links": {
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "LG TVs": "https://www.techradar.com/best/best-lg-tv",
    "webOS smart TV": "https://www.techradar.com/news/best-tv",
    "TV sizes": "https://www.techradar.com/how-to/what-size-tv-do-i-need",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Nano Cell technology": "https://www.techradar.com/news/lgs-super-uhd-tvs-will-rock-nano-cell-technology-and-four-types-of-hdr"
  }
}