{
  "source": "https://www.techradar.com/news/intel-is-investing-billions-in-eu-semiconductor-foundries",
  "title": "Intel is investing billions in EU semiconductor foundries",
  "category": "computing",
  "updated": "2021-09-08T16:04:08Z",
  "author": "mayank-sharma",
  "summary": "Cars are becoming computers with tires, believes Intel’s CEO",
  "article": [
    "Intel has revealed plans to build new chip-making facilities in Europe with an $95 billion funding plan over the next decade to boost the region's chip capacity",
    "The commitment was revealed by company CEO Pat Gelsinger at Munich's IAA auto show, and is a major step up from the previously announced $20 billion-worth investments to build new fabrication units in the EU.",
    "The previous commitment was announced in July 2021 after Gelsinger met with French president Emmanuel Macron and Italian prime minister Mario Draghi to discuss the global chip shortage.",
    "According to reports, at the IAA auto show Gelsinger reaffirmed that the company was planning two new chip factories in the EU and could potentially expand its plans, ballooning its investment over a decade to about €80 billion (about $94.77 billion).",
    "Gelsinger added that the upcoming facilities would cater to ever-rising demand for semiconductors and “would be a catalyst for the semiconductor industry... a catalyst for the entire technology industry.\"",
    "“This new era of sustained demand for semiconductors needs bold, big thinking,” he said at the auto-industry event, reports the Wall Street Journal.",
    "Earlier this year, Gelsinger announced the launch of a new Intel Foundry Services (IFS) division, which will drive Intel’s efforts to manufacture chips for other commercial customers.",
    "As part of the company’s European moves, Gelsinger said the company will open up its semiconductor plant in Ireland for automakers, which he reportedly considers as a “key strategic priority.”",
    "Referring to cars as “computers with tires,” Gelsinger said that Intel believes chips will make up 20% of the cost of vehicles by 2030, which is a five-fold increase from 4% of the cost in 2019.",
    "“You need us and we need you... The aim is to create a centre of innovation in Europe, for Europe,\" remarked Gelsinger.",
    "Via Reuters"
  ],
  "headers": {
    "4": "European center of innovation"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "$20 billion-worth investments": "https://www.techradar.com/news/intel-unveils-multi-billion-dollar-european-tech-expansion",
    "global chip shortage": "https://www.techradar.com/news/even-intel-thinks-the-global-chip-shortage-could-last-years",
    "Wall Street Journal": "https://www.wsj.com/articles/intel-plans-investment-of-up-to-95-billion-in-european-chip-making-amid-u-s-expansion-11631027400",
    "Intel Foundry Services": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
    "Reuters": "https://www.reuters.com/business/autos-transportation/intel-says-it-will-reserve-ireland-chip-factory-capacity-automakers-2021-09-07/"
  }
}