{
  "source": "https://www.techradar.com/news/linktree-partners-with-paypal-to-allow-direct-payments",
  "title": "Linktree partners with PayPal to allow direct payments",
  "category": "computing",
  "updated": "2021-08-25T22:26:22Z",
  "author": "anthony-spadafora",
  "summary": "Creators can now engage in frictionless transactions in more than 200 countries",
  "article": [
    "The popular link-in-bio service Linktree has announced a new partnership with PayPal that will allow creators to accept payments in all of the countries where the ecommerce platform is currently available.",
    "Through this new collaboration, creators will be able to engage in transactions such as selling products and services, accepting tips and donations and taking requests in the over 200 countries where PayPal operates.",
    "Co-founder and CEO of Linktree, Alex Zaccaria provided further insight on this new partnership and how it will benefit creators around the world in a press release, saying:",
    "\"As the creator economy grows, creators want new ways to collect payments and support from their audience with as little friction as possible. We are excited to be collaborating with PayPal to further expand our solutions to our users globally and enable them to further manage and monetize their digital presence.\"",
    "Back in March of this year, Linktree launched a new suite of tools called Commerce Links that allow its users to easily and conveniently take payments directly on their profiles without having to open a new browser window or tab.",
    "Commerce Links provide a quicker way to purchase goods and services for both followers and customers as well as more opportunities for monetization. At the same time, they also allow Linktree users to connect their online ecosystem to their products and services.",
    "Through this new integration, Linktree users will be able to connect their PayPal accounts and easily get paid by visitors to their profiles through PayPal as well as through debit and credit cards.",
    "In addition to payments, the company's users will also gain access to valuable data related to their transactions and payment conversion rates so that they can more easily manage their online presence."
  ],
  "headers": {
    "4": "Commerce Links"
  },
  "links": {
    "Linktree": "https://www.techradar.com/news/linktree-raises-millions-for-link-in-bio-social-commerce",
    "ecommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "PayPal": "https://www.techradar.com/news/new-paypal-super-app-includes-messaging-at-last",
    "press release": "https://www.prnewswire.com/news-releases/linktree-offers-global-commerce-links-with-paypal-collaboration-301361825.html",
    "Commerce Links": "https://help.linktr.ee/en/support/solutions/articles/48001172633-what-are-commerce-links-",
    "browser": "https://www.techradar.com/best/browser",
    "online presence": "https://www.techradar.com/news/ionos-why-the-pandemic-has-put-digitalization-firmly-in-the-spotlight"
  }
}