{
  "source": "https://www.techradar.com/news/a-new-pokemon-presents-is-comingheres-where-and-when-you-can-watch-it",
  "title": "A new Pokémon Presents is coming – here’s where and when you can watch it",
  "category": "gaming",
  "updated": "2021-08-14T16:00:59Z",
  "author": "emma-boyle",
  "summary": "Plenty to see here",
  "article": [
    "The Pokémon Company has revealed that a brand new Pokémon Presents will air next week, bringing updates on the upcoming games in the series.",
    "The news was announced on the official Pokémon Twitter page, confirming that the stream will take place on August 18 at 6am PT / 9am ET / 2pm BST and you'll be able to tune in on the official Pokémon YouTube channel.",
    "The tweet also confirmed that fans should expect to see updates on the upcoming DS remakes Pokémon Brilliant Diamond and Shining Pearl as well as the highly-anticipated prequel Pokémon Legends: Arceus.",
    "This comes hot on the heels of the The Pokémon Company’s tease that more on Pokémon Legends: Arceus would be revealed “soon” so it seems they really meant it. All three titles were announced together during a February 2021 Pokémon Presents which celebrated the series’ 25th anniversary so it stands to reason that we’d see updates on them together as well.",
    "The release dates for all of the games are fast approaching. Brilliant Diamond and Shining Pearl are making their way onto Nintendo Switch as soon as November 19, seemingly promising a faithful recreation of the beloved Generation 4 Diamond and Pearl games which originally released on the DS back in 2006.",
    "Pokémon Legends: Arceus is coming a little later on January 28 2022 and while Brilliant Diamond and Shining Pearl will be treading familiar ground, Legends: Arceus is set to do something a little different, taking players into a historical Sinnoh region where Pokémon roam freely and the world is a little more open.",
    "While the tweet confirmed that Pokémon Brilliant Diamond and Shining Pearl as well as Pokémon Legends: Arceus will make an appearance during the presentation, it didn’t give away any details on what exactly we can expect to see from any of the titles.",
    "With release dates for all three games already confirmed, we’re not anticipating any big announcements in that area (unless a delay is imminent but that seems unlikely). Given all of the games are scheduled for release within the next six months, we’d imagine The Pokémon Company will want to dive a little deeper than it has done previously – we've only seen reveal trailers released on announcement so far.",
    "With no running time provided it’s kind of hard to glean just how much detail there might be but it seems likely that there’ll be some new in-game footage and more specific details on what players should expect from their returns to the Sinnoh region both past and present. Fortunately, we don't have long to wait to find out for sure."
  ],
  "headers": {
    "6": "Analysis: what should we expect to see?"
  },
  "links": {
    "official Pokémon YouTube channel": "https://www.youtube.com/user/pokemon/videos",
    "Pokémon Brilliant Diamond and Shining Pearl": "https://www.techradar.com/news/pokemon-diamond-and-pearl-remakes",
    "Pokémon Legends: Arceus": "https://www.techradar.com/news/pokemon-legends-arceus-trailer-release-date-news",
    "revealed “soon”": "https://www.techradar.com/news/well-learn-more-about-pokemon-legends-arceus-soon-says-pokemon-company",
    "announced together": "https://www.techradar.com/news/nintendo-reveals-pokemon-legends-arceus-a-new-approach-for-the-game-series"
  }
}