{
  "source": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-gpu-might-not-be-as-impressive-as-we-hoped",
  "title": "Nvidia GeForce RTX 3080 Ti GPU might not be as impressive as we hoped",
  "category": "computing",
  "updated": "2021-03-31T10:34:11Z",
  "author": "jess-weatherbed",
  "summary": "12GB of VRAM rather than the previously rumored 20GB",
  "article": [
    "Nvidia’s GeForce RTX 3080 Ti has had rumors floating around since late 2020, with claims that the latest high-end graphics card could have up to 20GB of video memory (VRAM). According to a new Eurasian Economic Commission (EEC) filing from Gigabyte – a trusted Nvidia board partner that manufactures third-party GPUs – we might actually be getting 12GB in place of the expected 20GB. This is completely in contradiction to another filing made by Gigabyte last year that initially mentioned the 20GB VRAM.",
    "The listing was published to Twitter by established leaker @KOMACHI_ENSAKA, which also seemingly confirms the cards will use GDDR6X memory.",
    "As usual, take speculated information with a seriously healthy amount of skepticism. Rumors have been floating around about the RTX 3080 Ti for months with no official announcement from Nvidia, so until we hear confirmation from the official source we shouldn't get our hopes up. In fact, there is still suspicion that the RTX 3080 Ti has been scrapped entirely – hardly the biggest conclusion to leap to, given GeForce RTX 3090s have been spotted with scratched out RTX 3080 Ti SKUs.",
    "If 12GB sounds disappointing then it may be worth remembering that the RTX 3080 Ti is likely going to be marketed as a gaming GPU rather than something for productivity. After all, 20GB is a lot of VRAM, much more than what's required for even the most demanding AAA games right now. The RTX 3090 is something of a replacement (or at least an additional choice) for the Nvidia Titan range of graphics cards aimed at creative professionals, so matching the Nvidia Titan RTX's 24GB of VRAM makes sense. It would seem the upcoming RTX 3080 Ti isn't intended as a hybrid gaming/professional GPU now that the memory is being dropped, but hopefully, this will at least keep the price affordable.",
    "Anyway, 12GB is still better than the 10GB of VRAM on the original GeForce RTX 3080, but pricing will be what makes or breaks this launch – if the product is even going to be released. Let's keep our fingers crossed that the ongoing shortage is somewhat alleviated by then so we actually have a chance to get our hands on one.",
    "Via Tom's Guide"
  ],
  "headers": {
    "3": "Will 12GB be enough?"
  },
  "links": {
    "GeForce RTX 3080 Ti": "https://www.techradar.com/news/nvidia-doesnt-seem-spooked-by-amd-big-navi-so-could-delay-rumored-rtx-3080-ti",
    "rumors floating around": "https://www.techradar.com/news/leak-reveals-next-nvidia-gpus-that-could-arrive-including-rtx-3080-ti-and-rtx-3050",
    "20GB of video memory (VRAM)": "https://www.techradar.com/news/nvidia-rtx-3080-ti-leak-suggests-a-powerful-gpu-with-20gb-of-vram-to-take-on-amd-big-navi",
    "Eurasian Economic Commission (EEC) filing": "https://portal.eaeunion.org/sites/odata/_layouts/15/Portal.EEC.Registry.UI/DisplayForm.aspx?ItemId=75191&ListId=d84d16d7-2cc9-4cff-a13b-530f96889dbc",
    "@KOMACHI_ENSAKA": "https://twitter.com/KOMACHI_ENSAKA/status/1376475623544119304",
    "GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "scratched out RTX 3080 Ti SKUs": "https://www.techradar.com/news/your-nvidia-geforce-rtx-3090-might-secretly-be-an-old-rtx-3080-ti",
    "Nvidia Titan RTX's 24GB of VRAM": "https://www.techradar.com/news/nvidia-titan-rtx-release-date-news-and-features",
    "ongoing shortage": "https://www.techradar.com/news/nvidia-rtx-3080-shortage-could-continue-until-q3",
    "Tom's Guide": "https://www.tomsguide.com/news/nvidia-geforce-rtx-3080-ti-leak-suggests-the-gpu-isnt-dead-but-is-getting-a-downgrade"
  }
}