{
  "source": "https://www.techradar.com/news/how-to-watch-back-season-2-online-stream-the-new-mitchell-and-webb-series-anywhere",
  "title": "How to watch Back season 2 online: stream the new Mitchell and Webb series anywhere",
  "category": "computing",
  "updated": "2021-01-21T19:58:36Z",
  "author": "aatif-sulleyman",
  "summary": "Stephen is out of psychiatric care, determined to unmask the true Andrew",
  "article": [
    "Fans of Peep Show, That Mitchell and Webb Look and increasingly frequent and spectacular meltdowns rejoice - David Mitchell and Robert Webb's new sitcom is back on our screens for a second series. Read on as we explain how to watch Back season 2 online and stream the comedy today. It's 100% free to watch in the UK thanks to Channel 4 and its All4 platform - and can also be enjoyed wherever you are in the world right now.",
    "The comedy duo reprise their roles as socially awkward and insecure Stephen (Mitchell), and charismatic and successful Andrew (Webb) - estranged and radically different foster brothers who have been reunited by the death of their father, much to Stephen's bewilderment and irritation.",
    "In classic Mark Corrigan fashion, Stephen is utterly convinced that Andrew isn't who he claims to be, and is in fact trying to steal his fairly miserable little life, something that makes running the pub they've inherited together rather more tricky than it really should be.",
    "Andrew, it seems, can do no wrong in the eyes of everybody around them, including sister Cass (Louise Brealey), mum Ellen (Penny Downie) and uncle Geoff (Geoff McGivern), but Stephen's hell-bent on uncovering his newest family member's true identity and his clearly shady agenda.",
    "However, every time he seemingly makes a breakthrough, Andrew has a habit of bouncing back up smelling of roses, while another piece of Stephen's identity crumbles.",
    "The second series picks up with Stephen being discharged from the local psychiatric institution, but if you thought he'd be willing to concede defeat and finally accept Andrew, you'd be very much mistaken.",
    "Back season 2 has been a long time in the making, with production having been delayed by both the pandemic and a serious heart condition that Webb required surgery for, which has made us all the gladder to see its return. Follow our guide below for details of how to watch Back season 2 online and stream the Mitchell and Webb series FREE in the UK with All4 - or watch it from anywhere in the world.",
    "If you're not in the UK right now but don't want to miss the new season of Back, your best bet is a VPN. Once you get the right VPN you can enjoy a secure and speedy connection, even on open Wi-Fi networks at places like hotels when you're abroad, enabling you to tune in and watch Back season 2 online for free just like you would at home.",
    "Even if you're not that tech-savvy, don't worry - getting a VPN is super simple and we've outlined how to do it in three easy steps below.",
    "Use a VPN to watch TV's best shows from anywhere"
  ],
  "headers": {
    "7": "How to watch Back season 2 online from outside the country"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}