{
  "source": "https://www.techradar.com/news/italy-vs-northern-ireland-live-stream-how-to-watch-world-cup-2022-qualifier-from-anywhere",
  "title": "Italy vs Northern Ireland live stream: how to watch World Cup 2022 qualifier online",
  "category": "entertainment",
  "updated": "2021-03-25T17:59:52Z",
  "author": "kevin-lynch",
  "summary": "Baraclough's men face tough opening match against the Azzurri",
  "article": [
    "The Green and White Army kick off their campaign to reach Qatar with a tough Group C away fixture against Roberto Mancini's in-form Italy in Parma. Read on for your full guide to getting an Italy vs Northern Ireland live stream and watch this World Cup 2022 qualifier where it's being shown exclusively in the US on ESPN Plus.",
    "Having tasted the heartbreak of missing out on making Euro 2022 in agonising style - losing at the final hurdle with a 2-1 extra-time defeat to Slovakia in the play-off final Northern Ireland will be keen to get this qualifying campaign going on the right foot. Boss Ian Baraclough however has a major task on his hands, with his side coming into this crucial game off the back of a five-game winless run and a poor showing in the UEFA Nations League which saw them finish bottom of Group B2.",
    "The Italians have meanwhile look back to their world-beating best, having won each of their 10 UEFA Euro 2020 qualifying fixtures while also booking their place in the UEFA Nations League finals, after winning Group A1.",
    "Keen to right the wrong of missing out on qualification for the 2018 FIFA World Cup – the first time Italy had not appeared on football's greatest stage since 1958 - Mancini will be looking for his side to put on a strong showing in this opening group fixture.",
    "Follow our guide below for all the ways to watch Italy vs Northern Ireland online and get a World Cup 2022 qualifier."
  ],
  "headers": {
    "5": "Italy vs Northern Ireland live stream: how to watch World Cup qualifier soccer online in the US"
  },
  "links": {
    "where it's being shown exclusively in the US on ESPN Plus": "https://go.web.plus.espn.com/c/221109/718846/9070?subId1=trd-us-8976334376353886000&sharedId=trd-us&u=https%3A%2F%2Fplus.espn.com%2F"
  }
}