{
  "source": "https://www.techradar.com/news/chromes-next-big-update-could-keep-your-browsing-private-without-incognito-mode",
  "title": "Chrome's next big update could keep your browsing private without Incognito Mode",
  "category": "computing",
  "updated": "2021-01-04T10:39:55Z",
  "author": "cat-ellis",
  "summary": "Ever get the feeling you're being followed?",
  "article": [
    "Chrome is developing a Privacy Sandbox feature that will prevent tracking cookies from following you between websites – and it's coming soon.",
    "You'll know how it feels to be tracked this way: you spend a few moments browsing products in an online store and for the rest of the day, all the ads you see online are attempting to sell you those very same items.",
    "That's because the store has placed a cookie on your browser that follows you around the web, allowing other sites to present you with targeted advertising.",
    "These third-party cookies are bad news for online privacy, and last year Google announced plans to make them obsolete, pushing developers to use less invasive methods of targeting advertising that don't identify you as an individual.",
    "We're now seeing the first fruits of those efforts, with signs of a new Privacy Sandbox feature in Chrome Canary (an unstable early release intended for developers and anyone who wants to get a peek at features in progress).",
    "As Techdows reports, the Privacy Sandbox is now visible as a Chrome Flag (a switch that allows you to activate experimental features), but it's not yet functional and is currently just a placeholder.",
    "Sandboxing isn't a totally novel feature for web browsers (it's already used in Chrome's Incognito mode, and in Firefox's Private mode and Containers) but Google enabling it as standard could make third-party tracking cookies nearly useless overnight.",
    "It sounds good on the surface, but there's a possibility that this could lead to advertisers employing even more invasive ways to follow you around the web, such as fingerprinting – a technique that builds up a profile of your hardware and software, including installed fonts, apps, choice of browser, preferences and plugins, which makes you uniquely identifiable and is much more difficult to stop.",
    "We'll let you know when the Privacy Sandbox becomes available for testing in Chrome, and if Google announces any plans for how it intends to tackle fingerprinting."
  ],
  "headers": {
    "6": "The way the cookie crumbles"
  },
  "links": {
    "Google announced plans to make them obsolete": "https://www.techradar.com/news/google-is-phasing-out-third-party-cookies-in-chrome-to-protect-your-privacy",
    "Chrome Canary": "https://www.google.com/intl/en_uk/chrome/canary/",
    "Techdows": "https://techdows.com/2020/12/chrome-privacy-sandbox-makes-its-first-appearance.html",
    "Chrome Flag": "https://www.techradar.com/how-to/chrome-flags-what-they-are-and-how-to-use-them-for-better-web-browsing",
    "Containers": "https://support.mozilla.org/en-US/kb/containers",
    "fingerprinting": "https://www.techradar.com/news/firefox-set-to-ban-fingerprinters"
  }
}