{
  "source": "https://www.techradar.com/news/leaked-nikon-z9-specs-confirm-itll-be-nikons-answer-to-the-sony-a1",
  "title": "Leaked Nikon Z9 specs confirm it'll be Nikon's answer to the Sony A1",
  "category": "cameras",
  "updated": "2021-08-13T11:52:05Z",
  "author": "mark-wilson",
  "summary": "Nikon is going all-out on the Z9, it seems",
  "article": [
    "We've long hoped to see Nikon fully release the handbrake on its mirrorless camera tech and produce a true flagship – and some leaked Nikon Z9 specs confirm that it will indeed be the camera giant's answer to the unrivaled Sony A1.",
    "The Nikon Z9's announcement back in March confirmed that the pro full-frame camera would be a Nikon D6-beating beast. But what hasn't been clear is whether or not the Z9 would be a more sports-focused model, like the Canon EOS R3, or an all-out flagship like the Sony A1.",
    "The latest leak from Nikon Rumors, though, shows that Nikon is intent on making a generational leap with the Z9 that will see it claw back, and perhaps even surpass, some of the huge breakthroughs seen on the Sony A1, which arrived in January.",
    "Nikon Rumors claims the Nikon Z9 will definitely have a 45MP stacked sensor – this would put it in a similar resolution ballpark to the Sony A1 and Canon EOS R5, but not the Canon EOS R3. According to images taken at the Olympics, the EOS R3 will have a 24MP sensor, which is a more traditional megapixel for a sports camera.",
    "The Nikon D6, for example, has a 20.8MP sensor, so why the big leap on the Nikon Z9? Firstly, the Nikon Z9 sensor's stacked design can produce much faster read-out speeds than on any of its previous cameras. So despite the beefy 45MP resolution, the Z9 will be able to hit 30fps in burst mode – with Nikon Rumors now claiming that it'll be able to reach an incredible 120fps with a lower-resolution 6MB file size.",
    "But the other reason for that 45MP resolution is so the Z9 can shoot 8K video – and this is one of the key features that show its gunning for the Sony A1, rather than just the Canon EOS R3. The ability to shoot 8K/30p video is not currently an essential spec for sports photographers, but the Sony A1 has made it a benchmark for a hybrid flagship.",
    "The Nikon Z9 is clearly going for this title and the recently leaked specs only back this up. It'll apparently be the first Nikon camera with GNSS (Global Navigation Satellite System), a superior version of GPS that brings improved reliability and accuracy. Nikon Rumors also claims that it'll have \"car autofocus\", which is presumably its answer to the Canon EOS R3's AF tracking for racing cars and motorbikes, and \"improved 3D tracking\".",
    "Of course, the Nikon Z9 hype machine has been cranked up to eleven and it doesn't tell us anything about how the camera's autofocus, video and burst shooting will perform in reality. But we do now have a pretty clear sense of what kind of launch the Z9 will be – and that's one whose main aim will be to keep professional photographers and creators within the Nikon system.",
    "The Sony A1 brought game-changing specs, but it's not yet clear how well it's actually sold – and many professionals, particularly those reared on Canon and Nikon DSLRs, still have reservations about Sony's handling and usability. Enter the Nikon Z9, which marries a pretty conservative external design that may struggle to lure in new shooters, with some hugely impressive specs that should see Nikon match the fast technological pace set by Sony.",
    "Of course, not many people will be able to justify the Nikon Z9's expected price tag of between $6,000–$7,000, which will likely convert to around £6,000 / AU$10,700. But the latest rumored specs show that the Nikon Z9 is about more than shifting units – it's a big, reassuring statement that Nikon is still on the bleeding edge of camera tech and is still a reliable horse to back with your mirrorless chips.",
    "As we've seen from recent market share stats, Nikon has seen its share of the global camera pie shrink in the past couple of years. But in the first few months of this year it became profitable again, and the Nikon Z9 is just the kind of camera it needs to continue that trend.",
    "How and when Canon will respond with the rumored Canon EOS R1 isn't yet clear, but for now, the Nikon Z9 should fit neatly into a camera in the high-end space – a Sony A1 with Nikon D6 handling. And for non-professionals, the development of features like car-tracking autofocus can only be a good thing for more affordable cameras like the Nikon Zfc and its successors."
  ],
  "headers": {
    "7": "Flagship waving"
  },
  "links": {
    "Nikon Z9": "https://www.techradar.com/reviews/nikon-z9",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Nikon D6": "https://www.techradar.com/reviews/nikon-d6",
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "Nikon Rumors": "https://nikonrumors.com/2021/08/10/new-nikon-z9-monster-specs-leaked-announcement-expected-in-the-next-two-months-nikon-basically-combined-the-d6-and-d850-and-made-it-mirrorless.aspx/",
    "market share stats": "https://www.techradar.com/news/why-canon-sony-and-fujifilm-are-driving-recovering-camera-sales-for-now",
    "Canon EOS R1": "https://www.techradar.com/news/canon-eos-r1-release-date-price-rumors-and-leaks",
    "Nikon Zfc": "https://www.techradar.com/news/nikon-zfc-release-date-price-specs-and-features"
  }
}