{
  "source": "https://www.techradar.com/news/apples-new-m1x-macbook-pros-could-be-on-shelves-in-just-a-few-weeks",
  "title": "Apple’s new M1X MacBook Pros could be on shelves in just a few weeks",
  "category": "computing",
  "updated": "2021-09-13T09:13:38Z",
  "author": "darren-allan",
  "summary": "MacBook Pro 14-inch and 16-inch launch could be really close",
  "article": [
    "New M1X-powered MacBook Pro 14-inch and 16-inch laptops could be launched imminently, and indeed might “hit shelves in the next several weeks” according to one prominent Apple leaker.",
    "Mark Gurman believes that Apple has two events in the near future, the first of which is (of course) the big iPhone 13 and Apple Watch 7 launch tomorrow (September 14), which he expects to be followed by a Mac and iPad launch.",
    "As 9 to 5 Mac reports, in the latest instalment of his newsletter, Gurman asserts: “M1X MacBook Pro: 14-inch and 16-inch MacBook Pros with high-end M1 chips, MagSafe magnetic charging, miniLED screens, and no Touch Bars are in the offing. After delays, look out for these to hit shelves in the next several weeks.”",
    "The features mentioned, or indeed being ditched in the case of the Touch Bar, are all in line with previous rumors – as you might expect, this late in the game, nothing is changing in terms of the speculation of what these revamped MacBook Pro models will bring to the table.",
    "The prediction of the ‘next several weeks’ seems to point to a launch perhaps in early October, followed pretty much by immediate on-sale availability. It could even hint at a late September launch, in theory – remembering that it’s ‘several’ weeks until availability, so a reveal could come before that – but on Twitter, Gurman wouldn’t be drawn to clarify whether October is the date to pencil in the calendar.",
    "September just seems too early, though, given that we have the big iPhone launch tomorrow, and the rumor mill has consistently pegged October or November as the launch date for the new M1X MacBook Pros.",
    "In short, this seems to be Gurman indicating that he is pretty confident of an October launch, and it won’t be as late as November, but as ever with chatter from the grapevine, no matter how reliable the source, things can change. In other words, even if Apple is intending an October launch, that might slip yet.",
    "That said, invitations will need to go out pretty soon – certainly if it’s an earlier in October rather than later event – so plans will have to be finalized imminently, and we really shouldn’t be waiting much longer before we find out when the purported MacBook Pro 14-inch plus 16-inch refresh are to arrive."
  ],
  "headers": {
    "4": "Analysis: Early October launch, then straight on-sale?"
  },
  "links": {
    "MacBook Pro 14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "iPhone 13 and Apple Watch 7 launch tomorrow": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "9 to 5 Mac": "https://9to5mac.com/2021/09/12/report-m1x-macbook-pros-to-hit-shelves-in-the-next-several-weeks/",
    "16-inch MacBook Pros": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "being ditched in the case of the Touch Bar": "https://www.techradar.com/news/new-macbook-pro-could-kill-off-touch-bar-rumors-suggest",
    "Twitter": "https://twitter.com/markgurman/status/1437140403803672581",
    "rumor mill": "https://www.techradar.com/news/apple-m1x-macbook-pro-might-drop-as-early-as-october",
    "October or November": "https://www.techradar.com/news/new-macbook-pro-14-inch-and-16-inch-could-arrive-disappointingly-late-in-2021"
  }
}