{
  "source": "https://www.techradar.com/news/runescape-mobile-how-it-was-made-and-why-it-has-some-differences-from-desktop",
  "title": "Runescape Mobile: how it was made, why it changed from desktop and what's next",
  "category": "phones",
  "updated": "2021-06-17T14:59:02Z",
  "author": "tom-bedford",
  "summary": "We spoke to developer Jagex",
  "article": [
    "After many years in development, Runescape Mobile is here. Despite technical issues caused by a huge influx of players, it's zoomed to the top of the App store in various countries.",
    "This is a total conversion of the legendary 20-year-old MMORPG, bringing its point-and-click adventures, quests and skills to Android and iOS devices. Since it's an MMO, you're playing alongside PC and Mac gamers.",
    "If you're thinking 'wasn't Runescape already on mobile', you might be thinking of Old-School Runescape. OSRS, as it's commonly referred to, is a spin-off of Runescape based on its classic 2007 build - it was launched in 2013, and in 2017 a mobile version of that was launched.",
    "People jumping into Runescape Mobile - of which there are a lot, as developers Jagex reported nearly two million pre-registrations - might find a few key differences from the browser or Steam versions of the game though.",
    "Although it's a cross-play MMO, so players on Android and iPhone will be playing alongside gamers on their computers, Jagex had to re-think some core parts of the game to fit mobiles and tablets.",
    "To understand Runescape Mobile better, including differences from the standard Runescape, how the port was built and what could be coming next, we spoke to the game's Executive Producer, Ryan Ward, and Product Director, Matt Casey.",
    "Editor's note: This interview took place before the game's launch, so it doesn't discuss the issues many have had accessing the game when it was made available.",
    "Back when Runescape Mobile was just a twinkle in Jagex's eye, clever gamers were apparently already playing the game on tablets. Casey said, \"The program TeamViewer, which you can put on your iPad or your phone, lets you show your desktop - so we actually found players were using this on things like tablets to play the game.\"",
    "Development on the mobile port started around 2016, and a year later the team had a prototype ready that players started testing, showing it off publicly for the first time at the annual Runescape convention Runefest towards the end of the year.",
    "Players got to test it, and Ward explained how useful this was: \"we looked at pain points, we looked at stability, and getting the one-to-one representation of our game engine running on the devices [...] but our first objective was that we want Runescape's deep experience to exist on mobile.\"",
    "Jagex's strategy was a mix of new hires, bringing on board veterans from developers like King, and also helping the team adapt to the alternative play style of mobile. Ward explained, \"all of our content developers - they all now have mobile devices, so when they're thinking about the designs of their content, they're not just thinking about it from a point-and-click perspective.",
    "\"They're thinking about elements like how does somebody interact a little bit differently, what is the responsiveness and how do we cater to some of these experiences.\"",
    "Over four years later Jagex launched a few closed betas on Android, and one very limited one on iOS, in order to stress-test the servers and optimize mobile performance.",
    "While some mobile games launch exclusive to iOS or Android, and then get launched on the other afterwards, Runescape Mobile launched on both at once (though Android had wider beta availability). For the application process, \"the Old-School launch taught us quite a bit there,\" Casey explains, but the process was still a difficult one, \"as a predominantly desktop developer it was a learning experience for us, to make sure the game is fully compliant with all the developer guidelines from both Apple and Google.\"",
    "\"It's a lot to balance, but what we're finding with both partners is we're getting really good support - they've been incredibly helpful guiding us through the process. We've had to prove a lot to both Apple and Google along the way - one that we can respond to feedback really well, and that we can commit or deliver to our commitments.",
    "\"And even getting all of the publishing assets: icons, the trailers - these are all the things that our partners look at our ability, and our consistency, on delivering.\"",
    "With all that effort in developing a mobile game, you'd imagine that Jagex would have to slow down in other areas - particular in content regularity. But according to Ward, the team growth offset that: \"it actually helped us grow and scale our teams in a very positive way.\"",
    "It's natural to assume that Runescape Mobile would build on lots of the learnings of Old-School Runescape Mobile, first launched four years prior (though it sees regular updates, just like the browser version).",
    "Ward told us there's no cross-over \"in development teams, but where the commonality actually exists is that we have a team that we call 'Runescape Tech' [and they] are the guardians of the NXT engine. There is some overlap into both games from that point of view, but we have more of an informal transfer of information.\"",
    "Speaking on the process of adapting Runescape to mobile, both Ward and Casey regularly referred to learnings taken from OSRS, both when it comes to adapting the browser experience \"we look at the key areas that we believe we can affect the most\" and the interplay between browser and mobile play \"a lot of the R&D was done as part of the Old-School project.\"",
    "But the shadow of OSRS isn't just in the 'learnings' department, but the 'aspirations' one. Using website Misplaced Items, which tracks concurrent players on both Runescape and Old-School Runescape, you can see a giant leap when OSRS Mobile launched (note: at time of writing, Misplaced Items is down, likely due to the huge influx in players for Runescape Mobile's launch). Could this pattern repeat?",
    "\"We're seeing similar patterns, to go from what we've done with the pre-registration and with the early access, so we're pretty confident,\" Casey explained.",
    "Ward added, \"Over the last couple of years, Runescape's had its highest point and has continued to grow upwards - not flatten, not go down, but it's continuing to climb. I don't think that anyone really expects that out of a 20-year-old game.\"",
    "Steam data backs that up - the aforementioned Misplaced Items website shows a big surge in Runescape's popularity when it was launched on Steam in late 2020.",
    "Since Runescape is a cross-play game, there aren't any huge differences between the mobile and desktop versions - players need to be able to play together, after all. That doesn't mean it's an identical experience though.",
    "The first change, and arguably the biggest one, is that the tutorial is completely new. Older Runescape fans might remember Tutorial Island, which was introduced early on in the game's history (then removed in 2008, brought back via a quest in 2015, and completely re-added in 2018) - this took quite a while to get through, taking upwards of an hour if you were slow and methodical.",
    "Mobile gamers are getting a whole new tutorial, though, called the Davendale Tutorial, and the key point is that it's much quicker than the pre-existing entry-ways to the game. So, why the change?",
    "According to Ward, this was done to reduce the time it took players to get into the core game. \"We needed to look at session length right out of the game - how quick can we get you into the game. And that first-time user experience is a sub-10-minute experience now.",
    "\"I'd say one of the several experiences when exploring that area [in terms of development, not as a player] was 'what does Runescape mean' and 'how much of that essence did we want' - did we want it to be a very linear experience? How much choice and deviation did we want? So on mobile it's a little bit different than we have on desktop, but we believe that it was more of the right thing to do.\"",
    "With so many games available on mobile phones, Jagex clearly needed to develop an engaging first-time experience to keep people wanting more.",
    "Another big early-game change is character customization, as Ward explains \"this was part of the decisions we made in the first-time user experience. Typically games will get you in a character creation, you're trying to figure out the name, and kind of holding this pattern. That has been really, really streamlined. We actually delayed it later in the step, because it was most important to get you playing right away.\"",
    "This sounds like a fact of the mobile medium, as Ward explained that as a developer \"You've got sometimes seconds, maybe minutes at most, to try and grab some of that interest.\"",
    "But these two first-time experiences could actually come to mobile: \"there's no way that we shouldn't think about desktop in the same way, so that's likely to come over.\"",
    "Play the game past the tutorial, and you'll notice some other key changes between mobile and desktop, and most of them are graphical.",
    "\"There's a vast new set of screen resolutions that we need to support alongside supporting 4K and 1440p monitors,\" Ward explained, referencing the myriad Android phones with their varying specs.",
    "\"This kind of led to UI scaling technology [...] looking at where all the paint points that the users are talking to us about, led to just flat-out redesigning the readability of icons.",
    "\"Because of the smaller screen beyond the interaction controls, [we wondered] how can we handle camera movement. On desktop you can zoom out really easily. This led to some technology enhancements - we had to consider things like removing roofs off of buildings, or having this x-ray view going through other obscured objects.\"",
    "OSRS Mobile has this same feature, to enable you to easily see your character when indoors, without worrying about the pinch- or swipe-style camera movements.",
    "Casey added some details on the UI font: \"We've discovered unlocking clearer screen fonts using high-res vector fonts, that are much smoother to read for players on PCs and Macs as well, so there's learning we'll take the other way as well [from the mobile port to desktop Runescape].\"",
    "So the UI has seen some overhauls, but what about controls? Well, apparently not so much, as Casey explained \"Runescape actually lends itself really well to mobile, because point and click-style controls actually translate really well over to mobile. It's very intuitive to just tap where you want to go.",
    "\"The other side of it is, the PC version is very customizable, so like with their desktop, players can organize how they want the game UI to be presented. This is something we didn't feel worked well on mobile, and we took some of the learnings with Old-School where you've got more of a fixed kind of layout. And that actually works much better on mobile, because naturally your hands sit in a certain position.\"",
    "Runescape has survived on a subscription model - there are the free-to-play (F2P) players, which get access to a small chunk of the map and a generous swathe of content, but for a monthly subscription fee, you can become a member or pay-to-play player (P2P) and explore new lands, try out different quests, and train in many more skills.",
    "Runescape also has microtransactions for items like cosmetics, though Old-School doesn't.",
    "Typically, membership has been on a rolling monthly or fortnightly basis, but with Runescape Mobile, Jagex is offering more versatility in that. \"There are some options we're exploring like shorter-term subscription, for example. Mobile players will be able to get the benefits of membership from a single-day to three days and seven days\", Casey explained.",
    "Runescape Mobile could be the start of a big expansion for the game, and though there are no certain plans for the game to come to consoles (at least, that we know of), both Ward and Casey spoke passionately about what the future could hold.",
    "\"A natural step for us, would be to look at the [Nintendo] Switch, riffing off of the mobile device touchscreen elements. The thing that we have to conquer next is Joy Cons, it feels a little bit of a natural way to play,\" said Ward, \"But the goal, or the message, is that I'd like Runescape everywhere!\"",
    "Runescape has created itself a natural cycle, where players can stop being regular players, but will often return at a later date.",
    "\"A lot of our players stop playing, for whatever reason, for things that are happening or other games. But they tend to come back to see what they're missing because there's always so much going on. Mobile definitely opens up more doors but it's a continual evolution of the game\", Casey told us. And when we asked about seasonal content, this seemed to make sense.",
    "When we talk about 'seasons', we're not referring to the traditional Runescape events - limited-time quests and missions will pop up for holidays like Halloween and Christmas, offering players new content and festive rewards.",
    "But in the multiplayer, and especially mobile, games industry, many online games are adopting seasonal runs that refresh every fortnight or month, which offer unique purchaseable aesthetics and modes - Call of Duty: Mobile and PUBG: Mobile both use this format. So will Runescape follow suit?",
    "\"It's something we're talking about\", Casey admitted, \"How do we tell the story of Runescape in more digestible chunks? We've just launched the beginning of the Elder Gods story arc in-game, and that forms like a kind of seasonal narrative, and it's going to run on with episodes chunks of content that come out over a longer period of time, and we want the game to fall into that type of rhythm. [...] I think you probably will see more of that in the future.\"",
    "For now, though, it sounds like Jagex is simply planning to keep up its regular routine of weekly content drops, and any future plans sounded hypothetical. With Runescape Mobile suffering from some aforementioned teething issues - an expected occurrence for any online-game launch - Jagex likely had its hands full developing and enhancing Runescape Mobile.",
    "But in the future, perhaps Runescape Mobile, and the desktop game, could expand further."
  ],
  "headers": {
    "7": "From the ground up",
    "17": "No school like the Old-School",
    "24": "So what's new in Runescape Mobile?",
    "44": "The future of Runescape"
  },
  "links": {
    "Misplaced Items": "https://www.misplaceditems.com/rs_tools/graph/",
    "Nintendo] Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}