{
  "source": "https://www.techradar.com/news/twitter-on-ios-is-getting-a-convenient-youtube-upgrade",
  "title": "Twitter on iOS is getting a convenient YouTube upgrade",
  "category": "phones",
  "updated": "2021-03-19T11:55:30Z",
  "author": "rhys-wood",
  "summary": "Another Twitter test that could improve the platform",
  "article": [
    "Twitter is testing a new feature that will allow users to view YouTube videos in the Twitter app instead of being taken directly to YouTube. There’s a caveat, though, in that the feature is only available to some iOS users.",
    "Currently, the only way to view a video within Twitter itself is if a user has uploaded it directly from their device to the social media platform. On mobile devices, though, links to YouTube videos are purely external, meaning Twitter users are taken from the app to YouTube, leading to a rather disjointed social media experience.",
    "This has never been a problem on the browser versions of Twitter, where linked videos are properly embedded in a tweet, available to watch without being booted over to YouTube. We hope the feature eventually rolls out to all iOS and Android users, but there’s been no say on if and when that will happen.",
    "Twitter has been on something of a testing spree recently – the social media giant recently tested something akin to an Edit Tweet button, giving users a few seconds to undo the sending of a tweet in case they want to change anything or look for typos and/or inaccuracies.",
    "Twitter has also attempted to make its platform more convenient for users who upload a lot of pictures by testing the removal of the cropping of images, that stray outside of a 16:9 resolution, allowing images with a portrait orientation to be displayed in full view without a user needing to tap on the preview first. This could be especially useful for artists and photographers (and people who love sharing memes).",
    "We hope Twitter garners some much-needed positive feedback from these tests, especially for the new YouTube video option on iOS.",
    "Our only complaint here is that the test feels strangely limited. A sampling of iOS users only – with no parallel test on Android – makes the test ultimately feel like a bit of a throwaway. Still, we hope iOS users respond positively to it, and that the feature will have full iOS and Android integration eventually."
  ],
  "headers": {
    "3": "Twitter is evolving"
  },
  "links": {
    "Edit Tweet button": "https://www.techradar.com/news/twitters-latest-test-isnt-the-edit-feature-youve-been-waiting-for-but-its-close",
    "cropping of images": "https://www.techradar.com/news/twitter-artists-will-love-this-new-image-option"
  }
}