{
  "source": "https://www.techradar.com/news/asus-finally-announces-support-for-framerate-boosting-feature-with-older-intel-motherboards",
  "title": "Asus finally announces support for framerate-boosting feature with older Intel motherboards",
  "category": "computing",
  "updated": "2021-04-09T11:02:00Z",
  "author": "darren-allan",
  "summary": "Intel Z390 and Z370 boards will soon support Resizable BAR, Asus rep asserts",
  "article": [
    "It seems that Asus has finally made the decision to support Resizable BAR with its older Intel Z390 and Z370 motherboards, following an outpouring of complaints online.",
    "If you’re not familiar with the tech, Resizable BAR is a feature that boosts frame rates by a decent chunk in some games, providing you have compatible hardware – Nvidia just introduced support for its RTX 3000 GPUs, and AMD originally came up with its own take for Big Navi graphics cards.",
    "Broadly speaking, work has been underway with GPUs and CPUs to further extend support since AMD got the ball rolling, as well as with motherboard vendors who have been busy providing support by updating older hardware like the aforementioned Intel Z390 and Z370 chipsets.",
    "However, the problem with Asus motherboards has been that while other board makers have already introduced support (albeit in beta form), Asus Z390 and Z370 owners have remained out in the cold – and more and more complaints were spilling out online because of this, as Neowin highlighted.",
    "Indeed, there have been some pretty frustrated folks out there, many of whom have found it difficult to understand why Asus has kept silent on the matter, saying nothing about support – beta or otherwise.",
    "The good news is that Asus has apparently been listening – and indeed likely feeling the effects of some of the sharper complaints out there – because an Asus ROG rep has now confirmed that the company plans to roll out support for these motherboards.",
    "Silent Scone@ROG posted: “Local holiday here and in TW, so took a bit of time to get back. I’ve heard the timeline for Z370 and Z390 is late April to early May.”",
    "After confusion from other commenters who have heard different things elsewhere regarding Resizable BAR support, the Asus rep clarified that this info comes direct from headquarters, and is correct – but it would still be nice to see a full and official announcement from Asus, not just a forum post.",
    "Other Asus community representatives are now posting the same thing, though, for example in this thread on a Swedish forum, which states that the BIOS will be rolling out at the end of April. So it seems that late April is definitely the target date, but that could slip to early next month."
  ],
  "headers": {
    "5": "Not-so-silent Scone"
  },
  "links": {
    "Nvidia just introduced support for its RTX 3000 GPUs": "https://www.techradar.com/news/all-nvidia-rtx-3000-founders-edition-gpus-will-get-game-boosting-technology",
    "AMD originally": "https://www.techradar.com/news/amds-new-big-navi-gpu-benchmarks-suggest-nvidia-could-be-in-more-trouble-than-we-thought",
    "Big Navi graphics cards": "https://www.techradar.com/news/amd-big-navi",
    "CPUs to further extend support": "https://www.techradar.com/news/intel-cpus-could-see-up-to-20-performance-gains-from-amds-smart-memory-tech",
    "motherboard": "https://www.techradar.com/news/computing-components/motherboards/best-motherboard-14-reviewed-and-rated-904229",
    "Neowin": "https://www.neowin.net/news/asus-z370z390-board-owners-are-furious-over-the-lack-of-resizable-bar-support/",
    "posted": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1867062844646177800&xs=1&url=https%3A%2F%2Frog.asus.com%2Fforum%2Fshowthread.php%3F121866-RESIZE-BAR-for-Z370-Z390-chipset%2Fpage34%23post831178&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fasus-finally-announces-support-for-framerate-boosting-feature-with-older-intel-motherboards",
    "thread": "https://www.sweclockers.com/forum/post/19022340"
  }
}