{
  "source": "https://www.techradar.com/news/lenovo-may-have-finally-cracked-smart-glasses-for-the-workplace",
  "title": "Lenovo may have finally cracked smart glasses for the workplace",
  "category": "computing",
  "updated": "2021-01-11T11:30:20Z",
  "author": "joel-khalili",
  "summary": "Meet the Lenovo ThinkReality A3 smart glasses",
  "article": [
    "Hardware company Lenovo has unveiled a new pair of augmented reality (AR) smart glasses, designed specifically for enterprise use cases.",
    "At CES 2021, which is taking place online this year, the firm offered a first look at the ThinkReality A3 glasses, which hook up to PCs and certain Motorola smartphones (also owned by Lenovo) via USB-C.",
    "The glasses are powered by the Qualcomm Snapdragon XR1 Platform and can serve up to 5 virtual displays at once, each at 1080p resolution. An 8MP camera of the front, meanwhile, can be used to create a video feed for remote consultation applications.",
    "The headwear is said to “fit like sunglasses” for a lightweight feel (although images suggest the frame is slightly heftier than suggested), and a more “industrial” model is available for use cases that demand greater durability.",
    "There are a number of different applications for the new ThinkReality A3 smart glasses, according to Lenovo, including 3D visualization, virtual desktop and AR-assisted workflows. They can also be used to help create more immersive training experiences.",
    "“The A3 is a next generation augmented reality solution - light, powerful and versatile,” said Jon Pershke, a Lenovo executive with a focus on intelligent devices.",
    "“Whether working in virtual spaces or supporting remote assistance, the ThinkReality A3 enhances workers’ abilities to do more wherever they are.”",
    "The Industrial Edition, meanwhile, is geared towards optimizing processes in more complex and challenging working environments.",
    "“For use in scenarios from factory floors and laboratories to busy retail and hospitality spaces, certified turnkey applications on the ThinkReality platform powers remote assistance, guided workflows and 3D visualization,” said Lenovo.",
    "“Now, industrial workers have a light, flexible and scalable set of smart glasses to increase productivity and safety while decreasing error rates in daily tasks.”",
    "It is not yet known how much the ThinkReality A3 smart glasses will cost, but Lenovo expects the range to launch in mid-2021.",
    "Check out all of TechRadar's CES 2021 coverage. We're remotely covering the online-only show to bring you all the breaking tech news and launches, plus a smattering of hands-on reviews."
  ],
  "headers": {
    "4": "Lenovo ThinkReality A3 smart glasses"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights"
  }
}