{
  "source": "https://www.techradar.com/news/asus-reveals-two-striking-new-gundam-themed-routers-designed-for-gamers",
  "title": "Asus reveals two striking new Gundam-themed routers designed for gamers",
  "category": "gaming",
  "updated": "2021-01-22T15:14:37Z",
  "author": "darren-allan",
  "summary": "Both have a prioritized gaming port on-board",
  "article": [
    "Asus is introducing two fresh versions of existing gaming routers which are themed around ‘Mobile Suit Gundam’, the anime TV series (although if you don’t know what it is, you’re unlikely to be interested in these products of course). Both the RT-AX86U and RT-AX82U have got the Gundam treatment.",
    "The RT-AX86U has been given a makeover as the ‘Zaku II Edition’, and offers Wi-Fi 6 support, with 861Mbps of bandwidth in the 2.4GHz band and 4804Mbps for 5GHz.",
    "As well as four standard Gigabit Ethernet ports, and a single WAN port, you get a 2.5Gigabit connector allowing for higher throughput (it can support internet connections which are faster than 1Gbps, should you be lucky enough to have one). One of the Ethernet ports is marked as a dedicated ‘gaming port’, and any device plugged into this will have its traffic prioritized, a neat touch.",
    "The CPU inside is a quad-core Broadcom model running at 1.8GHz, backed with 1GB of RAM, and this router has three antennas. There’s also a ‘Mobile Game Mode’ which promises to deliver a “low-latency mobile gaming experience”.",
    "These nifty gaming-focused features helped the vanilla model of the RT-AX86U score full-marks in our review.",
    "As for the RT-AX82U spin, this is the ‘Gundam Edition’ and again is a Wi-Fi 6 router, this time offering 574Mbps and 4,804 Mbps in the 2.4GHz and 5GHz bands respectively.",
    "It’s equipped with four antennas, but lacks the 2.5G port offered with the RT-AX86U, and has a lesser spec processor (3-core Broadcom running at 1.5GHz, backed with 512MB of RAM). Again, it offers that tailored ‘Mobile Game Mode’ and dedicated gaming port.",
    "The Gundam-themed routers will be released on February 5 in Japan, although it isn’t clear if they will be seen elsewhere – fans can only keep their fingers crossed that Asus will make the hardware available in other regions.",
    "Asus has released a bunch of other PC hardware with a Gundam motif, including a mouse and keyboard, plus a PSU, motherboards and graphics cards, such as in the latter case a Zaku II Edition of the Asus TUF Gaming X3 GTX 1660 Super.",
    "Via Silicon Era, Guru of 3D"
  ],
  "headers": {
    "5": "Gundam Edition"
  },
  "links": {
    "gaming routers": "https://www.techradar.com/news/the-best-gaming-routers",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "score full-marks in our review": "https://www.techradar.com/reviews/asus-rt-ax86u",
    "RT-AX82U spin": "https://www.techradar.com/reviews/asus-rt-ax82u",
    "Silicon Era": "https://www.siliconera.com/asus-gundam-routers-will-boost-your-gaming-connection/",
    "Guru of 3D": "https://www.guru3d.com/news-story/asus-releases-zaku-ii-edition-and-gundam-edition-routers.html"
  }
}