{
  "source": "https://www.techradar.com/news/positive-technologies-denies-involvement-in-solarwinds-attack",
  "title": "Positive Technologies denies involvement in SolarWinds attack",
  "category": "computing",
  "updated": "2021-04-19T11:50:14Z",
  "author": "mayank-sharma",
  "summary": "Positive Technologies calls the accusations 'groundless'",
  "article": [
    "Responding to sanctions imposed by the US government, Russia-headquartered cybersecurity company Positive Technologies (PT) has denied any wrongdoing, and dismissed the claims as “groundless accusation”.",
    "Last week, the US Department of the Treasury imposed sanctions on several Russian technology firms, including PT, accusing them of helping Russian state actors to conduct cyberattacks against the West.",
    "Specifically, the Treasury accused Russian Intelligence Services - the FSB, GRU and SVR - of having collaborated to execute the now infamous SolarWinds hack.",
    "“As a company, we deny the groundless accusations made by the US Department of the Treasury….Our global mission is to create products and technologies to improve cybersecurity around the world and to ensure conditions for the most efficient prevention of cyberattacks for the benefit of society, business, and government agencies,” said Positive Technologies in a statement.",
    "The US government further alleged that the FSB “cultivates and co-opts criminal hackers” with the help of the now-sanctioned companies, including PT.",
    "While PT assures that it is only involved in white-hat ethical security research, in a report based on \"previously unreported US intelligence assessments\" MIT Technology Review alleges that PT \"develops and sells weaponized software exploits to the Russian government.\"",
    "While neither the Treasury Department nor MIT report cite any proof, there is plenty of evidence of PT’s ethical hacking initiatives.",
    "In fact, in the same week the US imposed its sanctions, PT uncovered a vulnerability in the VMware endpoint protection platform, which was responsibly disclosed to the virtualization giant and consequently patched.",
    "It isn’t immediately clear how the sanctions will impact ongoing security research at PT, with sanctions putting a stop to such collaborations going forward.",
    "PT didn’t immediately respond to TechRadar Pro’s request for clarification on its future work involving US-based companies and software.",
    "Via The Register"
  ],
  "headers": {
    "4": "Collaborating with FSB"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "dismissed the claims": "https://www.ptsecurity.com/ww-en/about/news/positive-technologies-official-statement-following-u-s-sanctions/",
    "imposed sanctions": "https://home.treasury.gov/news/press-releases/jy0127",
    "SolarWinds": "https://www.techradar.com/reviews/solarwinds-service-desk",
    "in a report": "https://www.technologyreview.com/2021/04/15/1022895/us-sanctions-russia-positive-hacking/",
    "The Register": "https://www.theregister.com/2021/04/16/positive_technologies_us_sanctions_groundless/"
  }
}