{
  "source": "https://www.techradar.com/news/nintendo-switch-pro-announcement-could-take-place-this-week",
  "title": "Nintendo Switch Pro announcement could take place this week",
  "category": "gaming",
  "updated": "2021-06-01T12:39:03Z",
  "author": "adam-vjestica",
  "summary": "But will it be called Nintendo Switch Pro?",
  "article": [
    "Will we get a Nintendo Switch Pro announcement this week? Potentially – and it could take place on Thursday, June 3.",
    "According to a report from Bloomberg, the successor to the popular Nintendo Switch has been tipped to be revealed before E3, which takes place on June 12 to June 15, and could be released as early as September 2021.",
    "However, we now have a slightly more concrete date of when the console might be announced, if the host of the Xbox Era podcast is to be believed.",
    "Nick Baker, claims that the Nintendo Switch Pro could be announced on Thursday, but caveated his prediction by saying that the date could be pushed back – as it has been in the past.",
    "We know that the likelihood of the Nintendo Switch Pro being revealed soon is high, and a listing for the rumored console was reportedly spotted on Amazon Mexico before being pulled.",
    "As is usually the case, a screenshot was grabbed of the ‘New Nintendo Switch Pro’ listing before it was removed (though people are suggesting the screenshot has been doctored in some way). While this isn’t confirmation of the console’s existence by any means, Amazon Mexico has leaked legitimate games in the past, so it’s not entirely out of the question that this could be the case here.",
    "The Nintendo Switch Pro will serve as a mid-gen refresh of the existing Switch hardware, and will supposedly have a 720p OLED screen. It will be capable of outputting at 4K resolution when connected to a TV and could even use Nvidia’s DLSS tech to help it reach its new resolution target.",
    "It’s rumored that the Nintendo Switch Pro will come with a higher price point than the original Switch, which cost $299 / £279 / AU$469.95, and will replace the current model which will be phased out over time. The Nintendo Switch Lite will then serve as more of an entry-level system, or for those who strictly want a handheld device.",
    "Hopefully we'll find out more about Nintendo's long-rumored Switch upgrade soon, and can finally stop speculating about what the new console will actually be called."
  ],
  "headers": {
    "6": "Going Pro"
  },
  "links": {
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-27/nintendo-plans-upgraded-switch-replacement-as-soon-as-september",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "E3": "https://www.techradar.com/news/e3-2021",
    "720p OLED screen": "https://www.techradar.com/news/nintendo-switch-2-launch-news-and-features",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Nvidia’s DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review"
  }
}