{
  "source": "https://www.techradar.com/news/samsung-one-connect-box",
  "title": "Samsung One Connect box: what TVs actually get it?",
  "category": "televisions",
  "updated": "2021-09-09T14:01:47.430Z",
  "author": "henry-st-leger",
  "summary": "Everything you need to know about the Samsung One Connect Box",
  "article": [
    "The Samsung One Connect Box has an almost mythical status among TV owners – as a brilliantly useful TV accessory that is nonetheless nowhere near as widespread as you’d expect it to be.",
    "The function of the One Connect Box is to funnel cables and wires away from the television itself, outsourcing HDMI inputs, power connections, and the like, and ensuring the mess isn’t anywhere near the screen itself.",
    "Whether you place the One Connect Box underneath a wall-mounted screen, beside it on a counter, or hide it in a savvy manner within a media cabinet, it offers far more flexibility around your personal AV setup and home theater system.",
    "So far, so good. But you can’t simply pick up a One Connect Box with any new Samsung TV – and it’s this restriction that makes getting one for your home a bit of a headache.",
    "That’s where we come in. In this guide, you’ll find a full explanation of the One Connect Box’s capabilities, how things are changing for 2021’s Slim One Connect Box model, and what Samsung TVs will come with the useful accessory.",
    "The first thing you need to know is that there’s a new 2021 model called the Slim One Connect Box. It’s a slimmer, more compact version of the One Connect Box we’ve seen over the past few years, with updated connections and a new form factor – along with the ability to attach it to the back of a TV stand.",
    "A blog post from Samsung on its 2021 TV range gives a small nod to the “Slim One Connect box”, calling it “an all-new cable management system that can be attached to the TV’s back – allows for an easier install and cleaner aesthetic.”",
    "Elsewhere, Samsung calls it \"A minimalist's dream for reducing clutter,\" saying that \"the Slim One Connect keeps cables from gaming consoles and satellite receivers out of sight with a discreet box that you can tuck behind the TV or place to the side.\"",
    "The specific connections on the One Connect Box will depend on how new or old your Samsung TV is. A 2021 model that comes with the box will have HDMI 2.1 ports, given they now come as standard on QLED TVs, as well as eARC (enhanced audio return channel, for passthrough to a soundbar). There's also 3x USB 2.0 ports, 1x ethernet port, 1x optical output and an RF antenna input.",
    "Older screens, though, won’t be so lucky.",
    "The One Connect box usually comes with ports for connecting an IR extender (IR Out) and external speakers (Audio OUT). There are also ports for antenna (ANT IN), component (AV IN), HDMI (with ARC), Ethernet (LAN), optical, and USB.",
    "The 2019/2020 model came with the below inputs:",
    "There have been a few One Connect Box iterations since its inception in 2014, sometimes even coming in an even smaller ‘Mini’ model for those wanting to make do with fewer inputs.",
    "The 2019/2020 model measures at 390 x 130 x 70mm for 4K TVs, with slightly larger 394 x 177 x 80mm dimensions for 8K TVs.",
    "The 2021 ‘Slim’ model is smaller than either of these, though. Samsung tells us that the new model measures in at just 41.2 x 330 x 295 mm – with 330mm being the longest edge, along which the ports and inputs are housed.",
    "From what imagery we’ve seen, the new model is definitely slimmer and shorter, with the curved body and smooth sheen of a polished pebble – quite different from the rectangular shape and pointed corners of the previous iteration.",
    "This is a difficult question, given that you can’t buy the One Connect box as a standalone accessory. It comes packed in with certain Samsung TV models, upping the RRP for those respective sets.",
    "2020’s Q95T, for example, first retailed at $2,999 for a 65-inch size – which is $500 (around £350 / AU$650) more than the Q90T, which comes without the box. That’s a big uptick in price, and speaks to the premium nature of the box.",
    "It’s a confusing way of doing things, and not overly consumer friendly, but we can run you through which Samsung TVs come with the box below. You can tell from a brief glance that the amount of support across Samsung's range varies wildly from year to year.",
    "2021 Samsung TVs (Slim One Connect Box)",
    "2020 Samsung TVs (One Connect Box)",
    "2019 Samsung TVs (One Connect Box)",
    "Samsung clearly sees something of a future in the One Connect box, even if availability continues to be limited to select sets.",
    "2021 has seen an evolution of the form factor, with a slimmer profile and updated HDMI 2.1 connections, though the accessory’s full potential won’t be reached until it’s as easy to pack in with a flatscreen as a compatible soundbar, or additional bezel for Samsung The Frame.",
    "That said, none of the other major TV brands are doing anything quite like the One Connect box; for now, even Samsung’s staggered progress puts it in the lead."
  ],
  "headers": {
    "5": "Slim One Connect box: what is it?",
    "8": "Samsung One Connect Box connections",
    "12": "Samsung One Connect Box dimensions",
    "16": "Samsung One Connect Box price: how much does it cost?",
    "22": "Samsung One Connect Box: the future of cabling"
  },
  "links": {
    "TV accessory": "https://www.techradar.com/best/tv-accessories",
    "home theater system": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "blog post": "https://www.awin1.com/awclick.php?awinmid=17946&awinaffid=103504&clickref=trd-us-2203624905567745500&p=https%3A%2F%2Fnews.samsung.com%2Fuk%2Fsamsung-electronics-debuts-2021-neo-qled-microled-and-lifestyle-tv-lines-highlighting-commitment-to-sustainable-and-accessible-future",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "4K TVs": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "Q95T": "https://www.techradar.com/reviews/samsung-q95t-4k-qled-tv",
    "Q90T": "https://www.techradar.com/reviews/samsung-q90t-qled-tv",
    "Samsung The Frame": "https://www.techradar.com/news/should-i-buy-samsung-the-frame-tv",
    "TV brands": "https://www.techradar.com/best/best-tv-brands"
  }
}