{
  "source": "https://www.techradar.com/news/some-top-cheap-phones-from-tcl-are-finally-coming-to-the-us",
  "title": "Some top cheap phones from TCL are finally coming to the US",
  "category": "phones",
  "updated": "2021-06-29T11:00:40Z",
  "author": "tom-bedford",
  "summary": "The TCL 20 series is here",
  "article": [
    "If you're on the market for a new cheap phone, or a good-value Android phone, your list of options has just grown a little, because the TCL 20 series of smartphones has finally gone on sale in the US.",
    "First launched in April in Europe and elsewhere, the TCL 20 series of phones has three different devices, which we'll run you through below. Each is available for a pretty low price, making them good competition for the Moto G or Samsung Galaxy A series of devices.",
    "These devices replace the TCL 10 phones, though they're still on sale on TCL's website and via third-party sellers, and may see a further reduction over time.",
    "TCL's top new phone, selling for $499.99 on Amazon, is the 20 Pro 5G - and you can read our full TCL 20 Pro 5G review here.",
    "It's a really good-looking phone, with a sleek design and curved-edge display - you can see an image of it at the top of this article. In our review we commended its good-looking screen and impressive selfie camera - though weren't as impressed by its battery life or charging speed.",
    "Next is the TCL 20S, which is the only one of this series we haven't actually reviewed. It's on sale for $249.99, also at Amazon.",
    "The TCL 20S has a huge 5,000mAh battery, so it should last you a long time between charges. It has a high-res main camera at 64MP, and a big 6.67-inch screen which uses lots of the same tec as the TCL 20 Pro 5G.",
    "Finally we come to the TCL 20 SE, a giant budget phone which is going for $189.99 at Amazon (of course). Here's our full TCL 20 SE review for an in-depth look at the phone.",
    "We found the phone cheap and cheery, with an impressive display for its price and some powerful speakers. Its processing power, camera and charging speeds didn't wow us though, so it's not the perfect cheap phone by any means.",
    "All three of these devices are on sale right now, so you can pick them up from Amazon immediately - it doesn't seem like any other shops are selling them. Just note - the Amazon listing of each phone says they're not certified for use on Verizon."
  ],
  "headers": {
    "3": "What are the new TCL phones?"
  },
  "links": {
    "cheap phone": "https://www.techradar.com/best/best-cheap-phones",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "TCL 10": "https://www.techradar.com/reviews/tcl-10-5g-review",
    "$499.99 on Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB09729J91J%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1448586964572169000-20",
    "TCL 20 Pro 5G review here": "https://www.techradar.com/reviews/tcl-20-pro-5g",
    "$249.99, also at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB095PGG2NB%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8348088567216270000-20",
    "$189.99 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB09495Q1H7%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1457676680475321600-20",
    "TCL 20 SE review": "https://www.techradar.com/reviews/tcl-20-se"
  }
}