{
  "source": "https://www.techradar.com/news/f1-2021-pc-system-requirements-wont-punish-your-pc-unless-you-turn-on-ray-tracing",
  "title": "F1 2021 PC system requirements won’t punish your PC – unless you turn on ray tracing",
  "category": "computing",
  "updated": "2021-04-20T13:50:11Z",
  "author": "darren-allan",
  "summary": "Ray tracing support is in, but it’s (unsurprisingly) a good deal more demanding",
  "article": [
    "F1 2021 was recently revealed by EA with a launch date of mid-July, and now we’ve been provided with the full PC spec requirements which indicate that the game will support ray tracing lighting effects.",
    "As ever, both minimum and recommended system requirements have been detailed, with additional notes on what’s needed for ray tracing on top – which is obviously a clear enough indication that F1 2021 will indeed come with ray-traced graphics, even if nothing has been officially announced yet. F1 fans will doubtless recall that the 2020 version added DLSS – so it’s safe to assume that’ll be in the mix too.",
    "Here are the requirements for F1 2021 in full (as found on the game’s Steam page):",
    "Minimum requirements",
    "Minimum with Ray Tracing requirements",
    "Recommended requirements",
    "Recommended with Ray Tracing requirements",
    "They aren’t a big ask, then, and the spec is actually pretty much identical to F1 2020, with only slight changes here and there. The only big differences are the new ray tracing requirements which are predictably a major step up, calling for an RTX 3070 or RX 6800 on the recommended front.",
    "With DLSS support presumably being maintained, as mentioned, hopefully it won’t be too much trouble to maintain smooth frame rates – but obviously we won’t know until we see the game in action.",
    "Given the speed you’re whizzing round the track in normal gameplay, F1 is a title which puts a premium on smoothness rather than finer visual details, of course."
  ],
  "headers": {
    "7": "On track"
  },
  "links": {
    "F1 2021 was recently revealed by EA": "https://www.techradar.com/news/ea-reveals-f1-2021-for-ps5-and-xbox-series-x-and-its-coming-in-july",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "DLSS": "https://www.techradar.com/news/dlss-games-top-titles-that-support-nvidias-exciting-tech",
    "Steam": "https://store.steampowered.com/app/1134570/F1_2021/"
  }
}