{
  "source": "https://www.techradar.com/news/twitch-wont-air-the-nintendo-direct-heres-why",
  "title": "Twitch won’t air the Nintendo Direct – here’s why",
  "category": "gaming",
  "updated": "2021-06-15T15:59:34Z",
  "author": "adam-vjestica",
  "summary": "Mamma mia",
  "article": [
    "You won’t be able to watch Nintendo’s E3 showcase on Twitch this year after the streaming giant confirmed it won’t be hosting the event.",
    "The decision was made after Nintendo announced that creators wouldn’t be able to co-stream the Nintendo Direct, which takes place today at 5pm BST / 9am PT / 12pm ET (or June 16 at 2am AEST).",
    "In response, Twitch said that even though it had received permission to stream Nintendo’s show, it won’t be airing the event because of the company’s decision.",
    "In a tweet from Twitch’s official account, it said: “Nintendo tweeted from their official account that co-streaming today’s event is not allowed, differing from years past. While /twitchgaming has permission to air the show, we won’t be airing the event because all creators can’t co-stream.”",
    "If you want to tune in for Nintendo’s E3 showcase, then, you’ll have to go to YouTube to watch the event in full (we've also added the video above). The show will focus on new and previously announced Nintendo Switch games, so we’re not expecting Nintendo to reveal the widely-rumored Switch Pro."
  ],
  "headers": {
    "4": "How to watch"
  },
  "links": {
    "Nintendo’s E3 showcase": "https://www.techradar.com/news/breath-of-the-wild-2-release-date-is-in-2022-watch-the-zelda-teaser-trailer-now",
    "E3": "https://www.techradar.com/news/e3-2021",
    "YouTube": "https://www.youtube.com/watch?v=IQz_ECTGGyA",
    "Nintendo Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Switch Pro": "https://www.techradar.com/news/nintendo-switch-pro-may-have-accidentally-been-confirmed/news/nintendo-switch-2"
  }
}