{
  "source": "https://www.techradar.com/news/one-in-four-people-use-work-passwords-for-consumer-websites",
  "title": "Many of us are still using work passwords for personal use",
  "category": "computing",
  "updated": "2021-02-24T13:01:19Z",
  "author": "mayank-sharma",
  "summary": "One-third of the companies don’t even suggest using a VPN to log into work remotely.",
  "article": [
    "Many employees admit to using their work passwords for signing into consumer websites, new research has claimed.",
    "The 2021 Secure Consumer Cyber Report by automation platform Ivanti found that one in four admitted using an official work email or password to log in to websites and applications such as food delivery apps, online shopping sites and even dating apps.",
    "A sizeable propotion were also found not to have any password update policy, nor do they ask their employees to have specific security software while working remotely.",
    "The survey follows Ivanti’s observation that the use of insecure, unmanaged, and unsanctioned IoT devices has emerged as a popular attack vector last year.",
    "“The FBI issued a warning about an increase in credential stuffing attacks in September 2020 and yet consumers are still using work emails and passwords to log in to consumer apps and websites, putting the enterprise at significant risk of a credential stuffing attack,” noted Ivanti’s Chief Security Office, Phil Richards.",
    "As an increasing number of employers work from home on their company-provided laptops, Richards believes that given the increase in data breaches of consumer-based websites and apps, chances are that several enterprise email and passwords have already made their way into the hands of unscrupulous elements.",
    "“Companies across all industries must implement a Zero Trust model to ensure that entities accessing corporate information, applications, or networks are valid and not using stolen credentials,” Richards suggests.",
    "When it comes to remote working, the survey also discovers that enterprises have been unable to secure several key areas. It notes that 30% of the respondents said their organization doesn’t require remote workers to use a secure access tool, such as a VPN."
  ],
  "headers": {
    "3": "Zero trust model"
  },
  "links": {
    "passwords": "https://www.techradar.com/best/password-manager",
    "email": "https://www.techradar.com/news/best-email-provider",
    "security software": "https://www.techradar.com/best/best-antivirus",
    "company-provided laptops": "https://www.techradar.com/news/best-endpoint-security-software",
    "VPN": "https://www.techradar.com/vpn/best-vpn-for-business"
  }
}