{
  "source": "https://www.techradar.com/news/google-meet-is-getting-a-mouth-watering-visual-upgrade",
  "title": "Google Meet is getting a mouth-watering visual upgrade",
  "category": "computing",
  "updated": "2021-04-21T16:01:16Z",
  "author": "joel-khalili",
  "summary": "Google Meet will soon be the cleanest looking video conferencing service around",
  "article": [
    "Google has announced a series of changes to its Meet video conferencing platform designed to optimize and deepen the meeting experience for all participants, across all hardware types.",
    "Most notably, from next month onwards, Meet users will be greeted with a new-look desktop interface that offers easier access to features and greater configurability during meetings. All meeting controls have also been brought under a single menu, opening up more space for video content.",
    "In addition to letting users position their own video feed within the usual grid, the new Meet will allow users to break out their “self-feed” into a floating window that can be repositioned and resized as necessary. This could be particularly useful on mobile devices, which demand tight optimization of screen real estate.",
    "The grid view itself will also receive a major overhaul, with a new option to pin multiple video feeds at once. Images shared by Google suggest pinned feeds will automatically align themselves in the neatest possible orientation, whether the pinned users are running portrait or landscape mode.",
    "Although some might expect the prominence of video conferencing services to fade in the coming months with the return to the office, Google believes these platforms will play an equally significant (if slightly altered) role.",
    "“Virtual meetings have been at the center of work’s global transformation this past year. Long before the pandemic, they played a crucial role for distributed teams, but now they’ve become the glue that holds the work day together,” said Dave Citron, Director of Product Management, Google Meet.",
    "“In a world of hybrid work, meetings aren’t just virtual or physical. They’re often a combination of the two as people connect from remote and in-person locations. So the concept of collaboration equity - the ability for everyone to contribute regardless of location, role, experience, language and device preference - is especially important.”",
    "With this philosophy in mind, Google has been rolling out a variety of tools to improve meeting engagement, such as polling and Q&A functionality. And it hopes the new video configuration options will encourage more open discussion between participants.",
    "Behind the scenes, Google will also deploy changes that allow Meet to detect under- and overexposure and adjust brightness automatically, ensuring attendees can always be seen. A new Autozoom feature, meanwhile, harnesses AI to optimize framing and position the user directly in front of the camera.",
    "Finally, for those all-important “water cooler meetings”, Google will introduce a new video backgrounds feature which, although silly, will probably spice up a dull session.",
    "The new Google Meet features will be rolled out piecemeal over the course of the coming months, starting in May."
  ],
  "headers": {
    "4": "Google Meet update"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "mobile": "https://www.techradar.com/news/best-business-smartphone"
  }
}