{
  "source": "https://www.techradar.com/news/disney-plus-has-reached-100-million-subscribers-in-just-a-year-and-a-half",
  "title": "Disney Plus has reached 100 million subscribers in just a year and a half",
  "category": "entertainment",
  "updated": "2021-03-10T02:12:28.226Z",
  "author": "stephen-lambrechts",
  "summary": "Result far exceeds company's initial projections",
  "article": [
    "It appears that Disney Plus' momentum will not be slowing down any time soon, with the streaming service reaching 100 million subscribers worldwide, as revealed by Disney CEO Bob Chapek during the company's annual shareholders meeting yesterday.",
    "Last month, Disney reported a subscriber-base of 94.9 million, and it's likely that the recent launch of Disney Plus in Singapore, along with the addition of its new Star brand in several non-US territories, were contributing factors to the boost in new members.",
    "Most impressively, the enormous milestone was arrived at less than a year and a half after the service's launch, far exceeding Disney executives' original projections of 60-90 million subscribers by 2024.",
    "According to Chapek, the company has \"set a target of 100-plus new titles per year, and this includes Disney Animation, Disney Live Action, Marvel, Star Wars, and National Geographic.\"",
    "The CEO went on to explain that \"The enormous success of Disney Plus has inspired us to be even more ambitious, and to significantly increase our investment in the development of high-quality content.\"",
    "\"Our direct-to-consumer business is the company’s top priority, and our robust pipeline of content will continue to fuel its growth,\" noted Chapek, and it's not hard to see why – as reported by Variety, the growth of Disney Plus has driven the company's stock price to record highs, closing out at $201.91 on Monday, which is a significant leap from its $79 price back in March 2020.",
    "Not subscribed to Disney Plus yet? You can sign up now with one of the options below."
  ],
  "headers": {
    "3": "Full steam ahead"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "94.9 million": "https://www.techradar.com/news/disney-plus-is-already-close-to-hitting-100-million-subscribers",
    "recent launch of Disney Plus in Singapore": "https://www.techradar.com/news/disney-plus-singapore-launch-price-date-and-everything-thats-included",
    "Star brand": "https://www.techradar.com/news/star-on-disney-plus-has-launched-and-it-feels-like-a-massive-upgrade",
    "Variety": "https://variety.com/2021/tv/news/disney-plus-100-million-subscribers-worldwide-1234925654/"
  }
}