{
  "source": "https://www.techradar.com/news/xbox-cloud-gaming-update-gives-us-a-great-reason-to-use-microsoft-edge",
  "title": "Xbox Cloud Gaming update gives us a great reason to use Microsoft Edge",
  "category": "gaming",
  "updated": "2021-11-30T10:36:25Z",
  "author": "hamish-hector",
  "summary": "Microsoft's browser now has an edge for gamers",
  "article": [
    "If you’re someone who only uses Microsoft Edge to download another browser, you might want to rethink your habits, as it's about to become the best tool for enjoying Xbox’s Cloud Gaming service.",
    "Microsoft has just announced that a new Cloud Gaming feature called Clarity Boost is coming exclusively to its first-party browser - and you can try it out today if you’re an Xbox Game Pass Ultimate subscriber by downloading Microsoft Edge Canary.",
    "Clarity Boost does what it says on the tin: it makes the stream’s image clearer and more detailed for the player. You can see what this means practically from the picture below. The character model is overall less blurry with clarity boost switched on; their facial hair and scars look more defined, and their skin glistens in a way that makes it appear more realistic.",
    "We aren’t quite sure how Microsoft is managing to pull this off, specifically - all it's said publicly is that the feature uses \"client-side scaling improvements\" - however, we suspect this tool is similar to one you might find on most modern TVs.",
    "From premium brands like Samsung to more budget-friendly options like Toshiba, you’ll find they come equipped with AI that can instinctively improve an image with fairly minimal processing power to varying degrees of success. We imagine Clarity Boost will start out on the lower end performance-wise and will likely improve over time, until it's launched in the full release of Microsoft Edge next year.",
    "On that note, if you download Edge Canary to try this new Cloud Gaming feature out, we’d recommend keeping your old browser installed as Canary is the company’s more experimental browser. In it, you’ll find all the latest features and updates, but at the cost that they may not yet be fully optimized.",
    "Long-time techies may be rubbing their eyes and pinching themselves a little to see us recommending a Microsoft first-party browser, but Edge has come a long way from Internet Explorer - an app that built up a reputation for being pretty atrocious.",
    "Many users felt that the Explorer browser was slow and not as update-rich as its rivals, Google Chrome and Mozilla Firefox - an issue they believed was caused by Microsoft’s effective monopoly of the space, disincentivizing it from releasing updates. Explorer was automatically installed as part of its Windows Operating system, so it became the default - and by extension, most popular - choice for most users.",
    "Web developers also weren’t a fan of the platform, as Internet Explorer wasn’t always the best at sticking to web standards - a site that looked perfect on all other services could look janky on Explorer. Later versions of the Explorer platform were much better on this front, though the damage to the browser's reputation was done.",
    "Even today, Microsoft's reputation still suffers, even if many of these woes aren’t fair to translate to Microsoft Edge, a service that is, in our opinion, the second-best internet browser available today. Edge runs very well - faster than many of its rivals - thanks to multiple optimizations that help to keep its CPU consumption to a minimum. You’ll also find it comes with a bevy of customization options and easy-to-understand yet comprehensive privacy tools.",
    "This Clarity Boost feature for Xbox Cloud Gaming will hopefully pull some gamers back to the service, and show them that it’s nowhere near as bad as Explorer once was - members of our team are already downloading Microsoft Edge Canary to give it a try."
  ],
  "headers": {
    "6": "Analysis: Microsoft Edge is better than you realize"
  },
  "links": {
    "Xbox’s Cloud Gaming service": "https://www.techradar.com/news/heres-how-xbox-cloud-gaming-looks-on-pc",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "downloading Microsoft Edge Canary": "https://www.microsoftedgeinsider.com/en-us/download/canary",
    "\"client-side scaling improvements\"": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-7809311928594371000&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F11%2F29%2Fclarity-boost-with-xbox-cloud-gaming-on-edge-browser%2F",
    "Internet Explorer": "https://www.techradar.com/news/internet-explorer-is-still-causing-trouble-even-from-the-grave",
    "second-best internet browser": "https://www.techradar.com/best/browser",
    "Microsoft Edge Canary": "https://www.microsoftedgeinsider.com/en-us/download/canary"
  }
}