{
  "source": "https://www.techradar.com/news/japanese-researchers-achieve-319tbps-fibre-record",
  "title": "Japanese researchers achieve 319Tbps fibre record",
  "category": "phones",
  "updated": "2021-07-19T13:33:21Z",
  "author": "steve-mccaskill",
  "summary": "Multi-core fibre could eventually improve global communications",
  "article": [
    "Researchers in Japan have set a new fibre speed record of 319Tbps using experimental technology that could provide a significant speed and capacity boost to global communications networks.",
    "Whereas conventional fibre cables use a single core to transmit data, the National Institute of Information and Communications Technology (NICT) achieved the record transmission using a four-core fibre cable.",
    "The researchers tested the four-core fibre with C-band and L-band frequencies, but it was the S-band that yielded the best results.",
    "S-band has previously been unable to facilitate long-distance transmission, but amplifiers “doped” with rare minerals allowed data to be sent round a loop that simulates a distance of 3,001 kilometres.",
    "The lab tests provide a further theoretical maximum for fibre technologies and could provide a solution for long-distance backbone such as undersea cables.",
    "However, the researchers consider the four-core fibre cable to have more immediate benefit – especially since they are the same size as a standard fibre cable. This means network operators can easily install them in place of existing infrastructure.",
    "“The standard cladding diameter, 4-core optical fibre can be cabled with existing equipment, and it is hoped that such fibres can enable practical high data-rate transmission in the near-term, contributing to the realization of the backbone communications system, necessary for the spread of new communication services Beyond 5G,” said the researchers.",
    "“The 4-core MCF [Multi-Core Fibre] with standard cladding diameter is attractive for early adoption of SDM [Space Division Multiplexing] fibres in high-throughput, long-distance links, since it is compatible with conventional cable infrastructure and expected to have mechanical reliability comparable to single-mode fibres.",
    "“Beyond 5G, an explosive increase from new data services is expected and it is therefore crucial to demonstrate how new fibres can meet this demand. Hence, it is hoped that this result will help the realization of new communication systems that can support new bandwidth hungry services.”"
  ],
  "headers": {
    "3": "5G speed record"
  },
  "links": {}
}