{
  "source": "https://www.techradar.com/news/how-to-watch-crawford-vs-porter-time-card-live-stream-online",
  "title": "How to watch Crawford vs Porter: time, card and live stream online from anywhere",
  "category": "entertainment",
  "updated": "2021-11-19T17:32:39Z",
  "author": "aatif-sulleyman",
  "summary": "Three-weight champ faces two-time welterweight supremo",
  "article": [
    "Undefeated three-weight world champion Terence \"Bud\" Crawford (37-0) faces the biggest test of his welterweight reign, as former belt holder Shawn \"Showtime\" Porter (31-3-1) eyes his return to the top. Read on to discover how to find a Crawford vs Porter live stream and watch the welterweight title fight, plus the rest of the card online with ESPN+ having exclusive coverage in the US.",
    "Crawford may be one of the world's best pound-for-pound fighters, but it's he who arguably has the most to prove, having yet to face a genuine threat for the belt he first landed in June 2018. Porter is the contender he's been waiting for.",
    "The two-time welterweight world champion has proven that his number isn't up yet, by beating Yordenis Ugás and narrowly losing to Errol Spence Jr. in two of his three most recent bouts. His ultra-aggressive, ultra-physical fighting style should push the methodical, lightning-fast Crawford to his limit.",
    "Porter may not currently have a belt to his name, but such is his reputation that many believe that will change come Sunday, even at the expense of one of the top figures in the sport.",
    "Follow our guide below as we explain how to get a Crawford vs Porter live stream and watch the welterweight showdown online - plus key details like the expected time and what else to expect from the card.",
    "The event starts at 6pm local time in Las Vegas, so that's 9pm ET, 2am GMT, 1pm AEDT.",
    "Depending on how the undercard plays out, Terence Crawford and Shawn Porter are expected to make their ring walks at around 11pm ET / 8pm PT on Saturday night in the US, which is 4am GMT on Sunday morning in the UK, 3pm AEDT Down Under, and 5pm NZDT in New Zealand.",
    "Terence Crawford is one of the best pound-for-pound boxers in the world. Consistently listed just below global megastar Canelo Alvarez in the rankings over recent years, the 34-year-old future Hall of Famer is a three-weight world champion.",
    "He held the WBO and The Ring lightweight belts, before unifying the light welterweight division, and stepping up to welterweight.",
    "He took the WBO welterweight title off Jeff Horn in his first fight at welterweight and has successfully defended it four times, beating José Benavidez Jr., Amir Khan, Egidijus Kavaliauskas and Kell Brook, all by TKO.",
    "Shawn Porter is a two-time former welterweight world champion, who held the IBF belt from December 2013 to August 2014 and the WBC belt from September 2018 to September 2019.",
    "Also aged 34, Porter has been ever-present in the upper reaches of the welterweight class since stripping Devon Alexander of his title in 2013, and remains one of the top fighters in the division.",
    "He went the distance with IBF world champion Errol Spence Jr. in 2019 but ultimately lost the fight by split decision, losing his WBC belt in the process, shortly after successfully defending it against Cuban star Yordenis Ugás."
  ],
  "headers": {
    "5": "Terence Crawford vs Shawn Porter time",
    "7": "Who is Terence Crawford?",
    "10": "Who is Shawn Porter?",
    "13": "Crawford vs Porter card for Saturday's fight"
  },
  "links": {
    "ESPN+ having exclusive coverage in the US": "https://go.web.plus.espn.com/c/221109/718846/9070?subId1=trd-us-2214312300939205000&sharedId=trd-us&u=https%3A%2F%2Fplus.espn.com%2Fcrawford-porter"
  }
}