{
  "source": "https://www.techradar.com/news/the-newest-dell-xps-13-is-dollar700-off-right-now-in-a-limited-time-deal",
  "title": "The newest Dell XPS 13 is $750 off right now in a limited-time deal",
  "category": "computing",
  "updated": "2021-04-29T13:54:51Z",
  "author": "alex-whitelock",
  "summary": "One of the best Dell XPS 13 deals we've seen on the latest model",
  "article": [
    "If you're shopping for a premium ultrabook, you won't want to miss the latest Dell XPS 13 deals over at the official Dell store this week. Currently, we're seeing one of the lowest prices ever on the latest model with a Core i7 configuration - just $949.99 (was $1,699).",
    "While we often see discounts of $300 to $400 for Dell XPS 13 deals, discounts on the latest model tend to be a lot rarer - and less generous. Subsequently, this huge $750 discount really made us pay attention, especially when we glanced a the specs sheet.",
    "With an Intel Core i7-1065G7 processor, 8GB of RAM, 256GB SSD, and 4K touch-screen display, this one's really giving even the most powerful MacBook Pro a run for its money. Altogether, it's a very slick machine and should have no problem with any number of intensive work, production, or casual applications, and all your favorite content will look great on that 4K screen.",
    "If the above is a little too pricey for you, however, there are also some great Dell XPS 13 deals on older models this week that you could consider. This 4K touchscreen model for $849.99 (was $1,449.99) is especially worth checking out as it's still packing in a Core i7-10510U, 8GB of RAM, and 256GB SSD. While it's not quite as good looking as the newer models, it's still a great option if you want something that's a bit higher class than the usual cheap Windows laptops.",
    "Outside the US? See the best Dell XPS deals in your region just below.",
    "Want to do a bit more research? Our main page on the best Dell XPS 13 deals and Dell XPS 15 deals is a great page to start. If you're looking for something cheaper we also recommend our page on the best cheap laptop deals."
  ],
  "headers": {
    "5": "Dell XPS 13 deals"
  },
  "links": {
    "just $949.99 (was $1,699).": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1911227127635025700/https://deals.dell.com/en-us/productdetail/8k8a",
    "for $849.99 (was $1,449.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5187338648256378000/https://deals.dell.com/en-us/productdetail/8fky",
    "best Dell XPS 13 deals and Dell XPS 15 deals": "https://www.techradar.com/news/dell-xps-13-deals",
    "best cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals"
  }
}