{
  "source": "https://www.techradar.com/news/apple-vr-headset-could-turn-your-fingers-into-holographic-controllers",
  "title": "Apple VR headset could turn your fingers into holographic controllers",
  "category": "appliances",
  "updated": "2021-04-07T10:17:51.326Z",
  "author": "axel-metz",
  "summary": "Giving Apple the finger",
  "article": [
    "Apple has been granted a patent relating to the 3D modeling of fingers for in-air gesture recognition – suggesting this could be a feature of the upcoming Apple VR headset.",
    "The patent, published by the US Patent & Trademark Office, details a system capable of generating a 3D model of fingers to be used to navigate virtual environments.",
    "It’s worth noting that this technology relates to Apple’s rumored VR headset project, rather than its in-development Apple Glasses, and therefore substantiates claims made by various sources that the headset could arrive as early as 2022.",
    "The patent refers to both finger gestures and visual touch detection, with figure images outlining how the system might work.",
    "In the above image, for example, a diagram illustrates a potential system setup for generating a 3D model of a fingertip using a combination of cameras and depth sensors. Accompanying text also references contour alignment-based algorithms that could be used to enable hand tracking.",
    "While this approach to finger tracking may be new, the actual result sounds similar to the tracking software we’ve seen in existing VR headsets, like the Oculus Quest 2.",
    "Of course, these Apple-patented systems are likely in the early stages of development, but they nonetheless offer an exciting glimpse at what to expect from the company’s inaugural VR headset – whenever it arrives.",
    "As for further details on Apple’s flagship VR project, it’s a mixture of conjecture and well-advised rumors at this point.",
    "We’ve heard mutterings regarding possible dual 8K displays, eye-tracking software and LiDAR scanning sensors on the headset, as well as wearable haptic controllers that might serve to complement the 3D modeling software detailed above.",
    "In addition to features, though, we’ve also heard some less-than-exciting rumors regarding the price of Apple’s VR headset. While an official figure has, of course, not yet been confirmed, a report by The Information has the device priced at an eye-watering $3,000.",
    "That’s a number that’s been corroborated by Bloomberg sources, who claim Apple is expecting the VR headset to sell roughly one unit per store per day.",
    "So, the bottom line: Apple’s VR headset is almost certainly on its way – you just might need to start saving now to get your hands on one.",
    "Stay tuned to TechRadar for our coverage of WWDC 2021 (Apple’s annual Worldwide Developers Conference) in June, where we might get some more official information regarding the company’s coveted VR project.",
    "Via Patently Apple"
  ],
  "headers": {
    "7": "What else do we know?"
  },
  "links": {
    "Apple VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "patent": "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&r=1&f=G&l=50&s1=10970922.PN.&OS=PN/10970922&RS=PN/10970922",
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses",
    "sources": "https://www.techradar.com/news/new-ipad-pro-2021-might-be-as-powerful-as-the-latest-macs",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "wearable haptic controllers": "https://www.techradar.com/news/apple-vr-headset-controller-might-be-a-pair-of-thimble-rings",
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5646436355500939000&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Fnew-apple-mixed-reality-headset-details-swappable-headbands-eye-tracking&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fapple-vr-headset-could-turn-your-fingers-into-holographic-controllers",
    "Bloomberg sources": "https://www.bloomberg.com/news/articles/2021-01-21/apple-s-first-vr-headset-to-be-niche-precursor-to-eventual-ar-glasses",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "Patently Apple": "https://www.patentlyapple.com/patently-apple/2021/04/apple-wins-a-patent-for-modeling-3d-images-of-fingers-to-be-used-in-a-mixed-reality-headset-for-in-air-gesture-recognition.html"
  }
}