{
  "source": "https://www.techradar.com/news/electric-ford-mustang-mach-e-gt-packs-the-horsepower-to-rival-audi",
  "title": "Electric Ford Mustang Mach-E GT packs the horsepower to rival Audi",
  "category": "car-tech",
  "updated": "2021-04-27T11:58:54Z",
  "author": "axel-metz",
  "summary": "The first electric hot-rod?",
  "article": [
    "Ford has announced some impressive performance specs for its upcoming GT range of electric Ford Mustang models – including power figures to rival the Audi e-tron GT.",
    "Both the Ford Mustang Mach-E GT and GT Performance Edition are expected to arrive around Autumn of 2021, and represent the American manufacturer's continued willingness to embrace the automotive industry’s electric future – which includes that of its iconic muscle car.",
    "Under the hood of these SUVs, both models boast the same horsepower figures as their petrol-powered V8 coupe equivalents, though Ford says they will offer much more torque.",
    "That improved power will allow both Mustang electric cars to outsprint the upcoming Audi e-tron GT quattro, courtesy of 480bhp (versus the Audi’s 476) and a 0-62mph (0-100kph) time of just 3.5 seconds – trumping their German competitor by over half a second.",
    "What the Mustang Mach-E GT gains in speed it loses in range, though. Both models will sport a 250 and 235-mile longevity, respectively, losing out to the Audi’s impressive 295-mile figure.",
    "The same is true of comparisons to Tesla’s Model Y Performance. Both Mustang EVs can match it for speed, no doubt, but will lag behind in a race of endurance thanks to the Model Y’s 315-mile range on a single charge.",
    "These figures shouldn’t worry prospective electric Mustang owners, though. Ford’s most famous model has never been a car with a particular penchant for efficiency, instead focusing on its capacity for raw, unmitigated power.",
    "It will come as no surprise, then, to learn that the company’s newest variant of the iconic Mustang – and the first electric GT version, no less – is no slouch when it comes to speed.",
    "Ford’s latest round of announcements also included pricing for its upcoming range of Mustang Mach-E GT models.",
    "The Mustang Mach-E GT – which accounts for 30% of Mach-E reservations, incidentally – will start at $59,900 (around £44,000 / AU$77,000), while the Performance Edition is priced at upwards of $64,900 (around £47,000 / AU$84,000).",
    "Considering the Ford Mustang Mach-E electric SUV started at £40,350 (around $55,000 / AU$70,000) upon its launch in 2019, these don’t seem like particularly extravagant figures for the improved power offered by these latest GT models.",
    "The Performance Edition is, of course, the more expensive of the two given its improved range of features. It will arrive with an ‘Unbridled Extend’ mode, for example, which is a racetrack version of the regular model’s ‘Unbridled’ mode. Because who doesn’t want to go that little bit faster?",
    "The pricier variant also gets its own special badging along with 20-inch wheels, Ford Performance seats, Pirelli tires and an aluminum instrument panel, though both will benefit from a light-up pony logo on the front grille, red brake calipers and a ‘cyber orange’ paint option to keep things looking, well, Mustang.",
    "Via Engadget"
  ],
  "headers": {
    "8": "A more expensive sibling"
  },
  "links": {
    "announced": "https://media.ford.com/content/fordmedia/fna/us/en/news/2021/04/26/mustang-mach-e-gt-gt-performance-edition.html",
    "Audi e-tron GT": "https://www.techradar.com/news/the-audi-e-tron-gt-is-the-most-powerful-audi-ev-to-date-and-its-a-beauty",
    "Ford Mustang Mach-E": "https://www.techradar.com/news/ford-mustang-mach-e",
    "Engadget": "https://www.engadget.com/ford-reveals-pricing-for-its-hot-rod-mach-e-gt-and-performance-edition-e-vs-084203759.html"
  }
}