{
  "source": "https://www.techradar.com/news/the-fujifilm-x-e4-is-a-retro-travel-camera-with-an-attractive-price-tag",
  "title": "Fujifilm X-E4 release date, price, specs and features",
  "category": "cameras",
  "updated": "2021-01-28T18:11:54Z",
  "author": "mark-wilson",
  "summary": "It's small, powerful and charming – but is the X-E4 for you?",
  "article": [
    "The Fujifilm X-E4 has officially arrived to become the company's smallest and lightest mirrorless camera with a built-in viewfinder. But it also brings some interesting changes from the Fujifilm X-E3 that turn it into a slightly different beast.",
    "If you're not familiar with the X-series, this is Fujifilm's range of retro-styled mirrorless cameras that are aimed at both hobbyists and pros. All X-series cameras combine large APS-C sensors with bodies that are smaller than their full-frame rivals – and the mid-range Fujifilm X-E4 is the most portable camera in the range with a built-in EVF (electronic viewfinder).",
    "But not all of the changes from the Fujifilm X-E3, which arrived in 2017, will necessarily go down well with current X-series fans. The X-E4 has Fujifilm's latest 26.1MP X-Trans CMOS 4 sensor and X-Processor 4, giving it the same photographic engine as high-end models like the Fujifilm X-T4, but its styling is more basic and minimalist than the X-E3.",
    "So will these changes make the X-E4 the right camera for you, or push you towards alternatives like the Sony A6100 or Fujifilm X-T30? Our in-depth breakdown has the answers.",
    "The Fujifilm X-E4 will be available to buy from March 4 in either black or silver. Both versions start at a body-only price of $850 / £799 / AU$1,399, but will also be available in a couple of bundles.",
    "If you're looking to buy the X-E4 with Fujifilm's new XF27mm f/2.8 WR lens, that bundle will cost $1,050 / £949 (around AU$1,799). Considering that lens costs $399.95 / £419 / AU$699 on its own and is now weather-resistant, that's a pretty good deal for those who don't already own an XF prime lens.",
    "The other bundle is the Fujifilm X-E4 body with Accessory Kit, which includes a thumb rest and hand grip. This option seems to be aimed at existing X-series fans who preferred the physical design of the Fujifilm X-E3, which had a built-in grip. It'll set you back £899 (around $1,230 / AU$1,599).",
    "Overall, this pricing is in the ballpark of what we expected for the Fujifilm X-E4. When it arrived in 2017, the X-E3 had a body-only price of $899.95 / £849, while in Australia it cost AU$1,799 with the 23mm f/2 kit lens. The X-E4's more minimalist, beginner-friendly design means it's actually cheaper than that camera at launch, but if you add the Accessory Kit's grip and thumb rest, it's slightly pricier and closer to our earlier estimates.",
    "Before we explore the design changes on the Fujifilm X-E4, let's look at its internal upgrades compared to the X-E3.",
    "The biggest improvement on the X-E4 is its combination of the Fujifilm's latest sensor and processor. This pairing of a 26MP X-Trans CMOS 4 sensor and X-Processor 4 effectively give you the shooting engine of the top-range Fujifilm X-T4 in a compact body that weighs only 340g.",
    "For hobbyists and pro shooters looking for a small, powerful camera, that's a pretty great combo. Neither the sensor or processor are new, but they are tried-and-tested performers – and only the Fujifilm X100V, which has a fixed 23mm lens, puts that shooting power in a smaller body.",
    "The other benefit of the X-E4 getting that new processor is that it gets Fujifilm's latest autofocus system, seen recently in the Fujifilm X-S10. We've found Fujifilm's AF to lag slightly behind the Sony Real-time tracking AF found in cameras like the Sony A6600, when it comes to following and sticking to subjects. But it's still very good in most situations and you get Face/Eye AF to help with shooting people and portraits.",
    "Video has also been given a decent upgrade from the Fujifilm X-E3. While its predecessor's 4K/30p video only shot in a maximum 100Mbps bit-rate, the X-E4 doubles that to 200Mbps and can also shoot for longer in single takes (up to 30 minutes at a time, rather than 10 minutes on the X-E3).",
    "You also now get a few more Film Simulation modes for both video and stills on Fujifilm X-E4, which has 18 of these vintage looks (including the new Eterna Bleach Bypass), which are inspired by Fuji's old film stock.",
    "Otherwise, battery life is pretty similar to the X-E3, as both cameras user the same NP-W126S battery. On the X-E4, Fujifilm claims this will give you around 380 shots per charge, though you can also charge it up while shooting, thanks to its USB-C port.",
    "One final bonus on the Fujifilm X-E4 is that it will be compatible with the Fujifilm X Webcam software (for both Mac and Windows), which lets you use it with the likes of Zoom, Google Meet and Microsoft Teams when you're not out on a shoot. That's pretty handy, as until now X Webcam compatibility has mainly been reserved for Fujifilm's higher-end models.",
    "The Fujifilm X-E4 continues with the rangefinder-style design of the X-E3, but has a more minimalist look that might polarize opinion.",
    "One new addition that most photographers will appreciate is the new 3-inch tilting touchscreen, which we enjoyed on the Fujifilm X100V. This folds away flush with the camera, so gives you the added flexibility of shooting from low or high angles, without adding too much bulk.",
    "But elsewhere, the Fujifilm X-E4 has seen some features removed in the name of minimalism – and, perhaps, a desire to appeal to a new audience rather than hardcore Fuji fans.",
    "There's now no built-in grip, no d-pad on the back, no autofocus switch on the front, and no thumbgrip. You do still get an AF lever for choosing autofocus points, but overall the design has moved closer to the stripped down approach we saw on the Fujifilm X100V.",
    "That's a matter of taste and we did still very much enjoy the X100V's overall design. But Fujifilm's Accessory Kit bundle for the Fujifilm X-E4 shows that it's also not necessarily designed for the enthusiast crowd – this lets you add a thumb rest and hand grip to the camera, and brings it price closer to that of the Fujifilm X-E3's launch price.",
    "Another slight disappoint is that the Fujifilm X-E4 doesn't have weather-sealing, which is a shame considering this was brought to the X100V (albeit via an extra adaptor ring and protection filter for the lens). The electronic viewfinder (EVF) is also very similar to the X-E3's, with a 2.36-million dot resolution and 0.62x magnification, although you do now get an improved 100fps refresh rate.",
    "Overall, we'd like to have seen the Fujifilm X-E4's design upgraded a bit more (even if in-body image stabilization would have been too much of an ask), but it remains an attractive-looking travel camera with strong stills and video skills. Look out for our full review very soon."
  ],
  "headers": {
    "4": "Fujifilm X-E4 release date and price",
    "8": "Fujifilm X-E4 specs",
    "16": "Fujifilm X-E4 design"
  },
  "links": {
    "Fujifilm X-E3": "https://www.techradar.com/reviews/fujifilm-x-e3-review",
    "Fujifilm X-T4": "https://www.techradar.com/reviews/fujifilm-x-t4",
    "Sony A6100": "https://www.techradar.com/reviews/sony-a6100",
    "Fujifilm X-T30": "https://www.techradar.com/reviews/fujifilm-x-t30-review",
    "Fujifilm X100V": "https://www.techradar.com/reviews/fujifilm-x100v",
    "Fujifilm X-S10": "https://www.techradar.com/reviews/fujifilm-x-s10",
    "Sony A6600": "https://www.techradar.com/reviews/sony-a6600"
  }
}