{
  "source": "https://www.techradar.com/news/three-interesting-tech-features-revealed-for-the-all-electric-kia-ev6",
  "title": "Three interesting tech features revealed for the all-electric Kia EV6",
  "category": "car-tech",
  "updated": "2021-10-13T13:53:00Z",
  "author": "chris-teague",
  "summary": "Driving safer, driving smarter",
  "article": [
    "The Kia EV6 will make its way into driveways across the country starting in early 2022, and will feature an all-electric drivetrain, clean design, and plenty of tech.",
    "To keep building excitement for the new EV, Kia has released an overview of the car's tech features, some of which could use a bit more of an explanation.",
    "Here's an overview of three key Kia EV6 tech features.",
    "Highway Driving Assist 2 is an advanced cruise control function that allows the driver to set and maintain a distance from the vehicle ahead while driving on the highway.",
    "The system offers lane centering, even while driving through a curve, and adjusts the vehicle's path to help reduce the risk of a collision.",
    "The system offers similar functionality to other advanced driver assistance packages, but it's important to note that hands-free cruise control functions are not intended to replace an attentive driver with eyes on the road ahead.",
    "Safe exit assist (SEA) works to prevent passengers from opening the vehicle's doors into oncoming traffic.",
    "Using the EV6's onboard sensors, the SEA system warns of an approaching vehicle. The rear doors can automatically lock themselves using the electronic child locks to physically prevent the doors from being opened.",
    "Remote smart parking assist, or RSPA, allows the EV6 to park itself or extract itself from a parking spot while the driver is outside the vehicle.",
    "The technology controls the vehicle's accelerator, brakes, and steering, and relies on ultrasonic sensors to form a picture of what's happening outside the vehicle.",
    "The EV6 rides on Kia and Hyundai's shared E-GMP platform, which also underpins the upcoming Genesis GV60 EV.",
    "Two main powertrain configurations will be offered: single-motor rear-wheel drive or dual-motor all-wheel drive. The vehicle also features charging tech that allows it to recover up to 68 miles in just five minutes of charging, or charge from 10% to 80% in under 20 minutes.",
    "The Kia EV6 price starts at £40,895 (roughly $55,000 / AU$75,000) and it's expected to go arrive with customers from October 2021 in European, with those in North America receiving the first shipment in January 2022.",
    "Meanwhile, the high-performance EV6 GT (with 576bhp and a 0-60mph time of 3.5 seconds) will hit dealers' lots later in 2022.",
    "Via InsideEVs"
  ],
  "headers": {
    "3": "1. Highway Driving Assist 2",
    "6": "2. Safe Exit Assist",
    "8": "3. Remote Smart Parking Assist",
    "10": "About the Kia EV6"
  },
  "links": {
    "Kia EV6": "https://www.techradar.com/news/kia-ev6-first-drive",
    "the upcoming Genesis GV60 EV": "https://www.techradar.com/news/genesis-unveils-the-gv60-a-practical-ev-with-a-bentley-style-interior",
    "InsideEVs": "https://insideevs.com/news/527607/kia-ev6-adas-lineup-detailed/"
  }
}