{
  "source": "https://www.techradar.com/news/how-to-store-bitcoin-safely-everything-you-need-to-know-to-keep-your-crypto-secure",
  "title": "How to store Bitcoin safely: Everything you need to know to keep your crypto secure",
  "category": "computing",
  "updated": "2021-08-09T13:17:53.307Z",
  "author": "ryan-mcgonagill",
  "summary": "A breakdown of all the different ways of storing Bitcoin",
  "article": [
    "At this point, even if you don’t completely understand how cryptocurrency works, it’s nearly impossible not to know about Bitcoin, the world’s largest and most popular form of crypto.",
    "If you’re thinking about getting in on the Bitcoin action, you need to understand how digital wallets work. Unlike a conventional bi-fold or even a stock portfolio, Bitcoin and other cryptocurrencies are stored in different types of digital or offline storage systems, each offering a variety of features and functionalities.",
    "And if you think it doesn’t matter which wallet you decide to house your cryptocurrency in, consider the man who lost upwards of $220 million in Bitcoin because he forgot the password to his digital wallet.",
    "Based on a recent report from Security.org, this breakdown on Bitcoin storage should help clear the air.",
    "Bitcoin storage isn’t a one-size-fits-all solution, and how and where you decide to store your cryptocurrencies may depend on how you think about saving, spending, and investing in them.",
    "The Bitcoin organization actually recommends that buyers split their storage between two primary forms of “digital wallets”: hot spending wallets and cold savings wallets.",
    "Hot wallet: Typically, the hot spending wallet should only contain a small percentage of your overall Bitcoin investment. This is the money that you might spend or transfer on any given day, not unlike walking-around money.",
    "Cold wallet: Unlike a hot spending wallet, the majority of your cryptocurrency should live inside a cold savings wallet. This should be stored entirely offline, and often in a fireproof and lockable safe in your home. The cold savings wallet can be used to refill the hot spending wallet.",
    "Despite being a digital currency, there are four different forms of storage for your Bitcoin to choose from: mobile wallets, desktop wallets, web-based wallets, and physical hardware that acts as a wallet. For all of these wallet types, users will need a set of private keys to gain access to their Bitcoin. If these keys are ever lost or forgotten, the money stored inside your digital Bitcoin wallet could be lost forever.",
    "The most popular solution for Bitcoin and other cryptocurrency storage is in a digital wallet, but that isn’t always the only solution. Here’s a quick breakdown of how the digital wallet storage method works and how it stacks up against four other potential solutions, including offline wallets, hardware wallets, paper wallets, and physical coins.",
    "Digital wallets should be viewed as a hot spending wallet; a place where a small percentage of your overall Bitcoin is stored, typically used for individual transactions rather than long-term storage. Even though your digital wallet should be encrypted, it may not be the most secure solution for Bitcoin storage.",
    "Advantages of Digital Wallets: Because of their digital nature (digital wallets can be accessed from a computer or smartphone), they provide instant access to your Bitcoin banking from virtually anywhere in the world where you’re connected.",
    "Disadvantages of Digital Wallets: Also because of their digital nature, digital wallets for Bitcoin aren’t immune to hacking and can be compromised by nefarious actors.",
    "Unlike digital wallets, offline wallets should be seen as a form of cold savings wallet, a place where the majority of your Bitcoin is stored and not often accessed for small transactions or spending. Just because offline wallets are “offline” doesn’t mean they take a physical form, though. Instead, think about a computer or phone that simply wasn’t connected to the internet. With offline wallets, the keys to your storage are kept on the physical machine rather than online.",
    "Advantages of offline wallets: Offline wallets are typically safer than digital wallets because they’re far less likely to be exposed to the internet and are thus safe from hacking. Offline wallets offer the highest level of security for Bitcoin.",
    "Disadvantages of offline wallets: If your offline wallet is stored on a computer, you may still need antivirus software to protect against Bitcoin-targeting malware.",
    "Like an external hard drive or a USB stick, hardware wallets take cryptocurrencies like Bitcoin and store them on physical pieces of hardware. Hardware wallets are less common than digital wallets or offline wallets for Bitcoin and can be more difficult to locate.",
    "Advantages of hardware wallets: Hardware wallets offer completely anonymous transactions, and keep none of the user’s personal data on the hardware. In contrast to offline wallets, hardware wallets can’t be exposed to malware and offer a more secure environment for maintaining cryptocurrency.",
    "Disadvantages of hardware wallets: The advantages of the hardware wallet are essentially that it has none of the challenges found in digital wallets, but the disadvantages also go back to the fact that hardware wallets aren’t digital. If you lose the physical wallet, the money stored in your hardware wallet would be lost forever.",
    "A paper wallet may sound like the most familiar solution for Bitcoin storage, these solutions require more in-depth knowledge and understanding of cryptocurrencies and Bitcoin in order to operate. You can use services like Bitcoin Paper Wallet or Wallet Generator to print paper wallets for Bitcoin, but it’s important to fully understand the pros and cons before you do.",
    "Advantages of paper wallets: Like hardware wallets, paper wallets offer an element of anonymity for the user. In a relatively small amount of space, Bitcoin paper wallets use a seed phrase in order to transfer funds.",
    "Disadvantages of paper wallets: In addition to the things like printer network security, paper wallets have similar disadvantages as hardware wallets. If the paper is lost, damaged, or if the ink fades, you may not be able to use your paper currency.",
    "Not unlike paper wallets, physical coins offer a similarly tangible way to store and transact Bitcoin. They include tamper-proof stickers that cover a certain amount of Bitcoin.",
    "Advantages of physical coins: Physical coins don’t require internet connectivity, making them more secure and minimizing the risk of online theft or hacking. Physical coins can also be stored anywhere, increasing the buyer’s options and flexibility for storage.",
    "Disadvantages of physical coins: Physical Bitcoin can be lost or stolen, and having physical coins printed costs additional money on top of the cost of the investment.",
    "There’s no one best option for everyone, and finding the best storage solution for your Bitcoin means understanding the different options and making the right choice for your spending and saving habits.",
    "Now that you have a basic understanding how Bitcoin storage works, you can more accurately compare the features offered by different wallets and pick the one that works best for you."
  ],
  "headers": {
    "4": "The safest place to store Bitcoin",
    "9": "Digital wallets vs. other alternatives",
    "10": "Digital wallets for Bitcoin",
    "13": "Offline wallets",
    "16": "Hardware wallets",
    "19": "Paper wallets",
    "22": "Physical coins",
    "25": "Finding the best bitcoin wallets in 2021"
  },
  "links": {
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "wallets": "https://www.techradar.com/news/best-bitcoin-wallets",
    "other cryptocurrencies": "https://www.techradar.com/news/what-are-altcoins-everything-you-need-to-know",
    "recent report": "https://www.security.org/digital-safety/storing-bitcoin-securely/",
    "Hot wallet": "https://www.techradar.com/news/what-is-a-hot-wallet-for-cryptocurrency-everything-you-need-to-know",
    "Cold wallet": "https://www.techradar.com/news/what-is-a-cold-wallet-for-cryptocurrency-everything-you-need-to-know",
    "antivirus software": "https://www.techradar.com/best/best-antivirus"
  }
}