{
  "source": "https://www.techradar.com/news/you-will-soon-be-able-to-buy-amds-most-powerful-processor",
  "title": "You will soon be able to buy AMD's most powerful processor",
  "category": "computing",
  "updated": "2021-01-14T01:38:27Z",
  "author": "anthony-spadafora",
  "summary": "Your next workstation may come equipped with a Threadripper Pro processor",
  "article": [
    "AMD's most powerful processor the Threadripper Pro will soon be available to purchase as the chipmaker's exclusivity deal with Lenovo has come to an end.",
    "The new CPU first appeared in Lenovo's ThinkStation P620 workstation but now motherboard vendors have begun showing off some of their latest models that support AMD's WRX80 chipset at CES 2021.",
    "Threadripper Pro offers a number of benefits compared to the non-Pro variant of AMD's CPU including support for eight-channel memory, 2TB DRAM and up to 128 x PCIe 4.0 lanes.",
    "The AMD WRX80 chipset offers increased bandwidth as it supports eight-channel memory and all of the new motherboards designed for it can be outfitted with 2TB of DDR4 LRDIMM memory as well as both ECC and non-ECC memory at DDR4-3200.",
    "So far Supermicro, Asus and Gigabyte are the first device makers to unveil their new WRX80 motherboards designed for Threadripper Pro.",
    "The Supermicro M12SWA-TF E-ATX motherboard features an all-black PCB and includes eight horizontal memory slots that can be filled with up to 1TB of DDR4-3200 ram. The motherboard supports AMD Ryzen Threadripper Pro processors up to 64 cores and even the entry-level variant of the chip that comes with 16 cores. Due to this motherboard's large size, it features six full-length PCIe 4.0 x16 slots with support for two triple-slot or three dual-slot GPUs.",
    "The Asus WRX80 Pro Sage SE WiFi is another motherboard model that has been specifically designed for Threadripper Pro. While Asus has yet to release additional details on the board itself, based on a picture from VideoCardz it uses seven full-length PCIe 4.0 x16 slots with eight memory slots. It also features an all black PCB and WiFi 6.",
    "Another leaked motherboard set to be released with the launch of Threadripper Pro is Gigabyte's WRX80 SU8. This motherboard includes eight memory slots for eight-channel memory as well as seven full-length PCIe 4.0 x16 slots.",
    "As Threadripper Pro is AMD's most powerful processor yet, expect these motherboards to end up in workstations built and designed for professionals who can utilize the additional memory and PCIe slots.",
    "Via AnandTech"
  ],
  "headers": {
    "4": "WRX80 motherboards"
  },
  "links": {
    "Threadripper Pro": "https://www.techradar.com/news/amd-piles-pressure-on-xeon-with-ryzen-threadripper-pro-cpus-higher-clocks-more-memory",
    "ThinkStation P620": "https://www.techradar.com/news/lenovo-launches-extensive-new-range-of-linux-ready-laptops-and-pcs",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "WRX80 chipset": "https://www.techradar.com/news/insanely-powerful-amd-ryzen-threadripper-3000-processors-rumored-to-launch-in-2019",
    "VideoCardz": "https://videocardz.com/newz/asus-wrx80-pro-ws-sage-se-motherboard-for-ryzen-threadripper-pro-leaked",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "AnandTech": "https://www.anandtech.com/show/16396/the-amd-wrx80-chipset-a-few-boards-for-3rd-gen-threadripper-pro"
  }
}