{
  "source": "https://www.techradar.com/news/sony-xperia-1-iii-camera-samples-show-impressive-low-light-skills",
  "title": "Sony Xperia 1 III camera samples show impressive low light skills",
  "category": "phones",
  "updated": "2021-05-10T09:00:19Z",
  "author": "james-rogerson",
  "summary": "A promising start",
  "article": [
    "While the Sony Xperia 1 III has been announced, you might not be able to buy it for a while yet, with the release window currently listed as just “early summer”. That means details about how well it performs remain largely a mystery, but we now have at least some indication of the camera’s potential.",
    "ZackBuks (a leaker with a reasonable track record) shared some photos on Chinese social network Weibo that were apparently taken with the Sony Xperia 1 III, and they point to decent low light performance.",
    "Below you can see three shots of the same scene, taken at three different zoom levels. The first is apparently shot using the main 12MP f/1.7 snapper, while the second comes from the 12MP f/2.3 telephoto snapper at around 3x optical zoom (70mm), and the third boosts the optical zoom to around 4.4x (105mm) with an f/2.8 aperture.",
    "That variable telephoto lens that can shoot at two different focal lengths is one of the main highlights of the Sony Xperia 1 III on paper, so this is a handy early indication of how good it is. Based on these shots it looks promising, as low light scenes tend to be challenging for phones, particularly with telephoto shots.",
    "The source shared a number of other sample images too, but they were all taken either at night or indoors, so we can’t get a sense for how well the Sony Xperia 1 III’s camera would perform in optimal conditions.",
    "For that though, you can always take a look at Sony Mobile’s Instagram account, which has also shared some photos taken with the phone. These impress a lot, but they were taken by professional photographers so your mileage may vary.",
    "We’ll let you know how well the Sony Xperia 1 III’s cameras actually perform just as soon as we’ve put it through a full review.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "ZackBuks": "https://weibo.com/529466118?is_all=1",
    "Sony Mobile’s Instagram account": "https://www.instagram.com/sonyxperia/?hl=en",
    "shared some photos": "https://www.instagram.com/p/COk8HKMIJkS/",
    "GSMArena": "https://www.gsmarena.com/see_the_sony_xperia_1_iiis_cameras_in_action_in_these_alleged_leaked_photos-news-49016.php"
  }
}