{
  "source": "https://www.techradar.com/news/spider-man-no-way-homes-latest-rumor-suggests-tobey-maguire-will-return-after-all",
  "title": "Spider-Man: No Way Home's latest rumor suggests Tobey Maguire could return after all",
  "category": "entertainment",
  "updated": "2021-04-08T14:43:55Z",
  "author": "tom-power",
  "summary": "Swinging back into action",
  "article": [
    "Spider-Man: No Way Home is one of four MCU movies set to land by the end of the year. It's part of a quartet that also comprises the delayed release of Black Widow. Still, out of every upcoming MCU film on the calendar, it's the third Tom Holland-led Spidey flick that's churning out more speculation than normal.",
    "The threequel's rumor mill has gone into overdrive in recent months, with former Spider-Man actors Andrew Garfield and Tobey Maguire reported to be reprising their iterations of Peter Parker – something that Tom Holland went as far as denying outright. Still, this hasn't stopped Reddit digging for clues around the subject.",
    "Now, we've been given our biggest hint yet that at least one of Garfield and Maguire will be part of No Way Home's cast, according to a Spanish voice dub actor.",
    "In an appearance on El Sótano del Planet, a Spanish podcast about superheroes and comic adaptations, Spanish dub actor Roger Pera was asked if he was currently conducting any voice work for forthcoming Spider-Man productions.",
    "While he didn't bring up Maguire or No Way Home specifically, Pera explained that he had recently spoken to Sony, saying: \"There was a moment when I thought: this is fake, but yes, this is going to happen, I don't know when, but we are going to work on it.\"",
    "You can view Pera's translated answer in the tweet below (h/t Twitter user Sebastien Puerta), as well as the original Instagram video source where Pera was asked about upcoming projects, below:",
    "It's hard to draw a firm conclusion from Pera's comments. According to a Reddit thread discussing this rumor, Pera was the Spanish voice actor for Maguire in Raimi's films. Some fans, then, have taken the dub actor's words to mean that Maguire will be reprising his role as Peter Parker from Sam Raimi's Spider-Man trilogy if Pera is also involved.",
    "It's not impossible, though, that Maguire - and Pera by association - could be working on a different Spider-Man film. Spider-Man: Into the Spider-Verse 2 is another webslinger property that's in development at Sony Pictures. Without any specifics about what Pera is working on, we're really in the dark as to what the original answer was actually alluding to.",
    "As of February 2021, Phil Lord and Chris Miller, alongside David Callaham and Peter Ramsey, are working on the animated movie's screenplay. While any voice work on this flick will be some time away yet, it's not impossible that Sony could hit up Maguire to feature in this movie in some capacity. If Maguire were to hypothetically feature in this movie, Pera's talents might be needed to dub Maguire's work into Spanish for relevant audiences.",
    "For what it's worth, El Sótano del Planet have covered its tracks and stated that Pera hasn't confirmed his involvement in any Spider-Man project.",
    "\"In our last direct, Roger Pera could not confirm anything related to an upcoming Spider-Man movie due to the lack of any information,\" a translation of the tweet below reads. \"Any claim in that sense has no basis.\"",
    "This isn't the first time that Maguire has been rumored to feature in Spider-Man: No Way Home. Collider alleged that Maguire would be among a number of returning characters from previous Spider-Man movies to appear in the upcoming sequel. The speculation has been born out of the arrival of the Marvel Cinematic Multiverse, which we'll see in the Loki Disney Plus TV series and Doctor Strange in the Multiverse of Madness film.",
    "As mentioned, Holland played down the rumors of Maguire's and Garfield's returns in a March 2021 GQ interview. It's unclear if Holland was trying to throw fans off the scent or if he was simply telling the truth.",
    "In any event, we'll find out for certain when Spider-Man: No Way Home arrives in theaters on December 17."
  ],
  "headers": {
    "6": "Spider-Man: No Way Home: will Maguire really appear?"
  },
  "links": {
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "MCU movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "reported": "https://www.techradar.com/news/spider-man-3-wont-feature-tobey-maguire-or-andrew-garfield-says-tom-holland",
    "Tom Holland went as far as denying outright": "https://www.techradar.com/news/spider-man-3-wont-feature-tobey-maguire-or-andrew-garfield-says-tom-holland",
    "Reddit thread": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/mk75at/roger_pera_spanish_voice_actor_for_tobey_maguire/",
    "Collider": "https://collider.com/spider-man-3-cast-doc-ock-alfred-molina-andrew-garfield/",
    "Loki Disney Plus TV series": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "GQ interview": "https://www.gq-magazine.co.uk/culture/article/tom-holland-cherry-interview"
  }
}