{
  "source": "https://www.techradar.com/news/ssd-prices-could-rise-thanks-to-new-cryptocurrency-chia",
  "title": "SSD prices could rise thanks to new cryptocurrency Chia",
  "category": "computing",
  "updated": "2021-05-12T11:19:14Z",
  "author": "darren-allan",
  "summary": "If you’re mulling an SSD purchase, it might be wise to buy soon",
  "article": [
    "SSD prices heading upwards is a prediction that you might be familiar with in recent times, and we’re hearing it again, this time from a manufacturer.",
    "Phison, which makes controllers for SSDs (and solid-state drives, plus other storage devices like USB sticks), estimates that SSD prices will go up by 10% or so in the coming months, as Tom’s Hardware reports.",
    "Whether or not that comes true, we’ll just have to wait and see, but the chairman of Phison, KS Pua, has reportedly indicated that NAND flash manufacturers are going to hike memory prices by 10% in the third quarter of 2021.",
    "The reasons are bound up with booming PC sales, along with supply difficulties and the pandemic-related component shortages which are affecting the tech industry as a whole. It’s also due to the new Chia cryptocurrency which has just launched, spiking demand for drives as it relies on storage rather than the power-hungry GPUs (or ASICs) crypto-mining traditionally requires (the idea being it’s a much more green-friendly digital currency).",
    "We’ve heard talk of drive panic buying (pertaining to both SSDs and hard drives) thanks to Chia over in Asia last month, and this latest nugget from Phison just reinforces this prospect.",
    "That said, with Chia now actually launched, the cryptocurrency has taken a swift dive, so that could cast some question marks over how much of an impact it might have in reality. Still, this could simply be an early wobble, and Chia could be about to seriously take off in short order – given the current enthusiasm for all things crypto, that would hardly be a surprise.",
    "If that’s the case, then, the extra demand and pressure on drive makers will indeed be felt as Phison and others are predicting.",
    "Phison also revealed that its SSD controllers are expected to be in short supply not just for this year, but also through 2022 and 2023, which is a worryingly long way out – something which in itself will likely have an impact on the solid-state drive market.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies."
  ],
  "headers": {
    "4": "Drive panic?"
  },
  "links": {
    "SSD": "https://www.techradar.com/news/ssd-vs-hdd-which-is-best-for-your-needs",
    "in recent times": "https://www.techradar.com/news/ssd-price-increase-could-affect-your-next-pc-build",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/phison-expects-ssd-prices-to-rise",
    "component shortages": "https://www.techradar.com/news/ssd-price-increase-could-affect-your-next-pc-build",
    "ASICs": "https://www.techradar.com/best/asic-devices",
    "heard talk of drive panic buying": "https://www.techradar.com/news/this-new-cryptocurrency-could-potentially-cause-an-ssd-or-hard-drive-shortage",
    "Chia now actually launched": "https://www.techradar.com/news/chia-cryptocurrency-eco-friendly-bitcoin-rival-flops-on-launch"
  }
}