{
  "source": "https://www.techradar.com/news/disco-elysium-the-final-cuts-voice-acting-is-a-much-needed-accessibility-feature",
  "title": "Disco Elysium: The Final Cut’s voice acting is a much needed accessibility feature",
  "category": "gaming",
  "updated": "2021-04-21T16:37:58Z",
  "author": "hamish-hector",
  "summary": "Opinion: gaming that everyone can enjoy",
  "article": [
    "Disco Elysium is one of the all-time gaming greats. The story perfectly balances mystery and political intrigue with whacky, sarcastic humor, and the RPG mechanics mimic the best that tabletop games have to offer. With the art and music giving Revachol a fittingly cartoonish ruggedness, you’re onto a winner.",
    "However, as much as I enjoyed Disco Elysium I still found it a slog to get through. Thanks to my dyslexia, the overwhelming amount of reading meant it was an experience I had to chip away at in short bursts because I couldn’t handle longer play sessions.",
    "Now that Disco Elysium: The Final Cut has voice acting – with actors reading out dialogue for all NPCs and your inner thoughts – I’ve given it another go. I’ve been blown away by how much better the game is, and it goes to show why voice acting is a crucial accessibility feature that more games should include.",
    "Like many other dyslexics out there, I struggle with visual stress – if I’m presented with long paragraphs of unending text my eyes and brain can start to feel strained. The only cure is for me to look away and rest for a bit.",
    "Thankfully, in my day to day, my pair of colored glasses can lend a hand. Rather than facing the harsh contrast of black text on a white page, my vision is given a red hue, and words are made easier to read.",
    "But, while this works great for reading a book or a website, the glasses aren’t a full fix. When it comes to video games they easily break the immersion – as my entire playthrough is tinted red and with Disco Elysium specifically – which uses white text on a black background – they aren’t as useful.",
    "It doesn’t help that I’m also very self-conscious of the glasses – even in my own home – and I often can’t wait to take them off as soon as I can. When I want to relax with a game, the last thing I want to do is slip them on.",
    "At the news that Disco Elysium would be getting full voice acting, I was overjoyed. Finally, this could be a chance to get the proper Disco Elysium experience I knew was out there. And so far, my expectations have been met and exceeded.",
    "Before the Final Cut update I found myself having to skim read dialogue to stave off headaches, only pulling out the occasional bits of key information here and there but still missing several story beats – not to mention most of the writing’s charm. Now I’m getting the true feel of the game.",
    "The personalities of your thoughts and characters seem fuller, I understand Disco Elysium’s world and objectives more clearly and I’m able to immerse myself for hours rather than minutes at a time. Even though it’s a game I’ve finished, Disco Elysium feels brand new.",
    "The game has me so engaged that I’m already planning my next run and the different approaches I want to take, instead of longing for the game to be wrapped up. I actually enjoy playing Disco Elysium: The Final Cut, and it’s all thanks to the voice acting.",
    "The overwhelming text has turned me, and likely many others, away from some fantastic games. Final Fantasy 7 is one I’m disappointed to say I’ve abandoned a fair few times because of it. Because of this, voice acting is absolutely a feature I’m desperate to see included more frequently, especially in games that want to bombard me with novel levels of reading.",
    "While I know that hiring voice actors is sure to increase development costs, studios are otherwise running low on reasons to not include this and other accessibility features in their projects – especially AAA developers who have already been put to shame by the amazing work Naughty Dog put into The Last of Us Part 2.",
    "With Disco Elysium: The Final Cut, ZA/UM has shown what steps indie studios can take too. Having these accessibility features included from the get-go would be preferable, but it’s understandable if they have to be added post-launch – smaller developers might not have the resources to ship the game with them at first but could return later once they’ve seen some success.",
    "In 2021 it’s past time for studios to be taking proper steps forward with accessibility for all games, as this stuff matters. Around 5–17% of all people globally are believed to have dyslexia, that’s a large proportion of people to shut out of a game.",
    "It’s a shame any gamer has to feel like they’re blocked from playing something, and Disco Elysium: The Final Cut has shown me how much better gaming can be if these barriers are torn down."
  ],
  "headers": {
    "3": "Why the reading needs to go",
    "7": "Is the voice acting worth it?",
    "11": "What can the rest of gaming learn?"
  },
  "links": {
    "Disco Elysium": "https://www.techradar.com/news/disco-elysiums-choices-capture-the-full-spectrum-of-lifes-disasters",
    "Last of Us Part 2": "https://www.techradar.com/reviews/the-last-of-us-2-review"
  }
}