{
  "source": "https://www.techradar.com/news/microsoft-looks-to-boost-your-business-security-with-reported-riskiq-bid",
  "title": "Microsoft looks to boost your business security with RiskIQ takeover",
  "category": "computing",
  "updated": "2021-07-13T08:54:11Z",
  "author": "mayank-sharma",
  "summary": "Microsoft wants to help secure businesses from the chip to the cloud",
  "article": [
    "Microsoft has confirmed it is set to acquire cybersecurity vendor RiskIQ as the software giant continues to shore up its enterprise security offerings.",
    "RiskIQ’s software as a service (SaaS) product offers businesses protection against online security threats such as phishing, and malware. The company counts the likes of Facebook, BMW, American Express, the US Postal Service, and more among its clients.",
    "Bloomberg says it learned about the acquisition, reportedly worth over $500m, from anonymous sources.",
    "“The vision and mission of RiskIQ is to provide unmatched internet visibility and insights to better protect and inform our customers and partners’ security programs,\" said RiskIQ Cofounder and CEO Elias Manousos.",
    "\"We’re thrilled to add RiskIQ’s Attack Surface and Threat Intelligence solutions to the Microsoft Security portfolio, extending and accelerating our impact. Our combined capabilities will enable best-in-class protection, investigations, and response against today’s threats.”",
    "\"Microsoft has long been a leader in delivering end-to-end cloud-native security with Microsoft 365 Defender, Microsoft Azure Defender, and Microsoft Azure Sentinel that help protect, detect, and respond to threats in multi-cloud and hybrid cloud environments,\" Eric Doerr, Microsoft Vice President, Cloud Security wrote in a blog post announcing the news.",
    "\"With the acquisition of RiskIQ, we will continue our mission to help customers defend their growing digital estate against increasing cyber threats.\"",
    "Online security has taken center stage of late thanks to a recent spate of high-profile ransomware attacks orchestrated by exploiting poor endpoint security.",
    "Bloomberg reports that the RiskIQ acquisition adds to Microsoft’s growing portfolio of security products. Last month it acquired ReFirm Labs, which helps secure Internet of Things (IoT) devices.",
    "Notably, while announcing the ReFirm acquisition, Microsoft shared that it has over 3500 people working on security issues, processing over eight trillion security signals every day, as the company continues on its journey to help protect customers “from the chip to the cloud.”",
    "The RiskIQ acquisition could be announced over the next few days, according to the anonymous sources, though both companies remained tight-lipped about the deal when approached by Bloomberg.",
    "Via Bloomberg"
  ],
  "headers": {
    "5": "Sign of the times"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "RiskIQ": "https://www.techradar.com/news/solarwinds-analysis-uncovers-extensive-attack-infrastructure",
    "SaaS": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3834889828489231000&xs=1&url=https%3A%2F%2Fwww.microsoft.com%2Fsecurity%2Fblog%2F2021%2F07%2F12%2Fmicrosoft-to-acquire-riskiq-to-strengthen-cybersecurity-of-digital-transformation-and-hybrid-work%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-looks-to-boost-your-business-security-with-reported-riskiq-bid",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "endpoint security": "https://www.techradar.com/news/best-endpoint-security-software",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "Microsoft shared": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7378092680777238000&xs=1&url=https%3A%2F%2Fwww.microsoft.com%2Fsecurity%2Fblog%2F2021%2F06%2F02%2Fmicrosoft-acquires-refirm-labs-to-enhance-iot-security%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-looks-to-boost-your-business-security-with-reported-riskiq-bid",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-07-11/microsoft-is-said-to-be-buying-cybersecurity-company-riskiq"
  }
}