{
  "source": "https://www.techradar.com/news/breaking-apple-homepod-mini-is-finally-getting-attractive-colors-and-a-new-way-to-use-it",
  "title": "Apple HomePod mini is finally getting attractive colors - and a new way to use it",
  "category": "audio-visual",
  "updated": "2021-10-19T12:23:52Z",
  "author": "gareth-beavis",
  "summary": "Orange you glad Apple's HomePod mini has new colors?",
  "article": [
    "At the Apple Unleashed event, we finally saw new colors for the HomePod mini, a year after the smaller speaker emerged in just two, muted colors.",
    "Now, you can pick up a smaller HomePod in yellow, blue and orange, and Apple didn't give them any weird names either.",
    "There's no change to what's actually possible to do with these speakers, but the change to the color set is something that will appeal to a new and more youthful market.",
    "The cable will also be colored the same way as the bulbous speaker, in a neat touch that will calm those of us who love visual unity.",
    "The new colors will be available in November 2021 - just in time for Black Friday and Cyber Monday - and will still cost just $99.",
    "To allow people to get the most out of the new colors for the HomePod Mini, Apple is launching a new 'voice-only' plan for $4.99 per month - removing some of the main features but allowing you to ask Siri to play things on any Apple device.",
    "There's a little confusion about what 'voice-only' means for this plan - it sounds like you can't interact with the Apple Music app on your phone to create your own playlists, but we'll need to learn more about this from Apple.",
    "It'll also be of interest to those picking up the new Apple AirPods 3 (2021) - with enhanced sound... although it won't come with the new Spatial Audio settings, as you can see in the comparison above.",
    "The demonstration talked about using Siri to play curated playlists - such as 'Hey Siri, play dinner party music' or 'Hey Siri, play me music for hiking'. Note there's no 'play my music for hiking'.",
    "It reminds us of the rumored Spotify Plus, which was mooted to be $1 per month for an ad-supported experience.",
    "We'll update the story as we get more information - but this is the kind of plan that users can get behind if they only use a HomePod and want to listen to new or dedicated music."
  ],
  "headers": {
    "5": "Apple Music gets an... upgrade?"
  },
  "links": {
    "Apple Unleashed": "https://www.techradar.com/news/apple-unleashed-october-2021-event-what-we-expect-to-see",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Apple AirPods 3 (2021)": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "rumored Spotify Plus": "https://www.techradar.com/news/spotify-is-testing-a-cheaper-premium-tier-called-spotify-plus"
  }
}