{
  "source": "https://www.techradar.com/news/train-your-body-to-take-stress-in-stride-with-apollo-neuro",
  "title": "Train your body to take stress in stride with Apollo Neuro",
  "category": "wearables",
  "updated": "2021-06-30T15:39:40Z",
  "author": "sponsored",
  "summary": "Discover a wearable that can help your nervous system deal with everything the world might throw at you.",
  "article": [
    "Much as we'd all love to avoid it, stress is a fact of life – particularly at the moment. Pressures of work, money, relationships, global pandemics and more can all take their toll on our mental health. And if stress is allowed to build up and become chronic stress, then that can seriously affect your wellbeing.",
    "However, it's possible to train your body to cope better with stress over time. The Apollo Neuro is a wearable that improves your body’s resilience to stress so you can calm down, focus, relax, sleep, and feel better, rather than lie awake all night fretting and making things worse for yourself.",
    "The trouble with stress is that it can develop into a vicious circle. When your fight-or-flight response is constantly triggered, you might find it harder to focus, relax or sleep. This can leave you feeling tired, anxious and irritable, making you even less capable of coping with stress. Chronic stress can send your heart rate up and your HRV (Heart Rate Variability) down, which makes it harder for your body to adapt and recover from stress.",
    "And this is where the Apollo Neuro comes in. Developed by neuroscientists and physicians, it's not your average wearable. While most wearables simply track your health, Apollo is clinically proven to improve HRV. It’s an effective, non-invasive stress relief tool for both adults and children, without drugs or side effects. Used regularly, it can help you sleep better, recover faster, be more productive and feel more grounded and calm in general.",
    "The Apollo uses the full potential of your sense of touch to strengthen and rebalance the nervous system. The Apollo team discovered that certain frequencies of vibration can increase or decrease sympathetic “fight or flight” and parasympathetic “rest and digest” nervous system activity. Through painstaking research, testing and clinical trials, they've created a set of vibration frequencies that'll affect you in different ways, whether it's helping you to fall asleep at night or to be more clear and focused when you need to be.",
    "The Apollo fits around your wrist or ankle and delivers silent, soothing vibrations that are like a warm hug for your nervous system, signaling safety to your brain and helping you feel in control. Apollo comes equipped with seven different modes, each with its own specific goal to help you get through the day.",
    "Energy and Wake Up will help you get going in the morning, while Social and Open will get you ready to face the world. Clear and Focused helps you concentrate and get things done, while Rebuild and Recover will get you back on track after a heavy workout or emotional experience. Meditation and Mindfulness enables you to take a breath and find your flow, while Relax and Unwind lets you de-stress and de-clutter your mind at the end of the day. Finally, with Sleep and Renew, you'll be better equipped to fall asleep quickly and wake up fully rested.",
    "With the Apollo app for iOS or Android you can easily select the model you want and customize its duration and intensity to suit you. Apollo recommends starting short and gentle and building things up over time as it strengthens your nervous system and improves your heart rate variability so that you're more able to recover from stress quickly.",
    "This isn't an instant fix for stress; think of it more as a gym membership for your nervous system. The more you use the Apollo, the better your body will become at responding to and recovering from stress. For best results, use the Apollo Neuro for two or more hours a day, five days a week. You'll gradually build up your body's resilience to stress, just like you'd build up muscles at the gym, and you'll become able to recover from stress more quickly, enabling you to sleep better, relax more effectively and get the focus you need, whenever and wherever you need it.",
    "The Apollo Neuro is available now; if you want to change how you deal with stress, find more information and order today at the Apollo site."
  ],
  "headers": {
    "4": "The power of vibration",
    "7": "Build your resilience to stress"
  },
  "links": {
    "Apollo Neuro": "https://apolloneuro.com/product/apollo/?utm_source=techradar&utm_medium=review0621&utm_campaign=partners",
    "at the Apollo site": "https://apolloneuro.com/product/apollo/?utm_source=techradar&utm_medium=review0621&utm_campaign=partners"
  }
}