{
  "source": "https://www.techradar.com/news/samsung-galaxy-note-20-fan-edition",
  "title": "Samsung Galaxy Note 20 FE: what we want to see",
  "category": "phones",
  "updated": "2021-07-15T12:42:18Z",
  "author": "james-rogerson",
  "summary": "Will it be a fan pleaser?",
  "article": [
    "What's happening with the Samsung Galaxy Note 20 FE? While we heard rumors about a Fan Edition (or mid-range) version of the Galaxy Note 20 in late 2020, bringing that phone's stylus features to a Galaxy S20 FE-priced phone, news has totally disappeared for the phone.",
    "Since then, we've heard little about the low-cost smartphone, making rumors of the Galaxy Note 20 FE seem dubious. The Galaxy Note 21 is expected soon (unless it's been canceled, which rumors suggest it has) which could make a Note 20 spin-off redundant.",
    "The company did accidentally mentioned the phone on one of its websites, though, which makes it seem like the phone was, at least, being worked on at some point. So we're not quite keen to rule it out just yet, despite it being super late.",
    "Below you’ll find everything that we’ve heard so far about the Samsung Galaxy Note 20 Fan Edition (or Galaxy Note 20 FE as it might be called), along with our hopes for what it will offer.",
    "It’s worth noting that we don’t know for sure that the Samsung Galaxy Note 20 FE will launch at all. While Samsung name-checked the phone on one of its websites, it was in the small print of a page about the Galaxy S20 Fan Edition, so it could simply be a typo.",
    "If it is coming though, then it might do so soon. It would essentially be the successor to the Samsung Galaxy Note 10 Lite, and that phone landed in January 2020, so the Note 20 Fan Edition might land in January of 2021, but that’s just speculation for now.",
    "We have even less idea of what it will cost, but presumably it will undercut the $999 / £849 / AU$1,199 starting price of the Samsung Galaxy Note 20.",
    "The Galaxy Note 10 Lite costs significantly less than that, with a launch price of £529 (roughly $675/AU$935), so it’s possible that the Galaxy Note 20 Fan Edition will be in line with that.",
    "The only leak so far comes from Samsung itself, and it’s a mention of the Galaxy Note 20 FE on the company’s Brazilian website.",
    "The mention was in the fine print of a page about the Galaxy S20 Fan Edition, raising the distinct possibility that it was just a typo – especially as the offending text (which you can see below) now mentions the S20 FE instead, but it appeared twice on the page, so it’s certainly possible that it’s a real phone that was mistakenly mentioned.",
    "Beyond the possible existence of the handset, the mention claimed that it has a 6.5-inch screen as an entire rectangle, but a 6.3-inch one when accounting for the rounded corners.",
    "That’s basically the same as the S20 FE (adding more support to this being a typo – especially as the listed sizes have remained even now the phone name on the site has been changed to the S20 FE), but it’s notably at odds with Samsung’s US page for the Galaxy S20 FE, which lists the rounded corner screen size as being 6.4 inches.",
    "The page also mentioned the Samsung Galaxy Note 20 FE in relation to Night Mode photography, which is a feature we’d expect to be present.",
    "While we don’t know much about the Samsung Galaxy Note 20 Fan Edition yet, we do have some wishes for it.",
    "The Samsung Galaxy Note 10 Lite doesn’t support 5G, but with a growing number of fairly affordable 5G handsets arriving – such as the OnePlus Nord and Pixel 4a 5G – there’s no excuse for the Samsung Galaxy Note 20 Fan Edition not to support it.",
    "So we hope Samsung packs this latest connectivity tech in, and it likely will, especially as the standard Note 20 (at least some versions of it) and even some Galaxy A-series phones include 5G.",
    "This might be a long shot as the standard Samsung Galaxy Note 20 only has a 60Hz refresh rate. But most Samsung flagships are at 120Hz and a lot of other phones also have refresh rates of 90Hz or higher, including a number of mid-range ones.",
    "So we’d like to see Samsung start making this a standard feature at mid-range and above, and with the Note 20 Fan Edition being a newer phone than the Note 20, it’s not out of the question that it could have some improved tech, but we’ll have to wait and see.",
    "One of our main criticisms of the Samsung Galaxy Note 10 Lite was that it had a slightly dated chipset. Sure, it was also cheaper than its siblings, but companies like Apple and OnePlus have shown that a phone doesn’t need to be top of the range to have a top of the range chipset.",
    "So if Samsung can match the Galaxy Note 20 with an Exynos 990 or Snapdragon 865 Plus chipset here, that would certainly prove impressive. We’d even settle for a standard Snapdragon 865.",
    "One of the key selling points of the Galaxy Note range is a big screen to make the most of its included S Pen stylus, so we want Samsung to really go all out here with the Note 20 FE.",
    "The standard Note 20 has a 6.64-inch screen, which is a reasonable size, but the Samsung Galaxy Note 20 Ultra ups that to 6.9 inches, so we’d like to see the company split the difference here and offer a 6.7 or 6.8-inch screen. We’ve seen plenty of big screens on affordable phones, so that needn’t push the price up.",
    "Despite all the specs and features we’re asking for, we also want the Samsung Galaxy Note 20 FE to be a relatively affordable prospect.",
    "With its plastic back and FHD+ screen the standard Samsung Galaxy Note 20 could almost be seen as a ‘lite’ or FE model itself – except it’s entirely too expensive for that. If Samsung can bring the price of the Galaxy Note 20 Fan Edition closer to 500 dollars/pounds than 1000 dollars/pounds then it’s sure to be a real fan pleaser."
  ],
  "headers": {
    "4": "Samsung Galaxy Note 20 Fan Edition release date and price",
    "8": "Leaks and rumors",
    "13": "What we want to see",
    "14": "1. 5G support",
    "16": "2. A 90Hz or 120Hz refresh rate",
    "18": "3. A high-end chipset",
    "20": "4. A bigger screen than the Note 20",
    "22": "5. A mid-range price"
  },
  "links": {
    "Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "it's been canceled": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
    "comes from Samsung itself": "https://www.techradar.com/news/the-galaxy-note-20-fe-appears-in-the-fine-print-of-samsungs-own-site",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review"
  }
}