{
  "source": "https://www.techradar.com/news/ipad-pro-2021-massively-limits-how-much-ram-apps-can-use-apparently",
  "title": "iPad Pro 2021 massively limits how much RAM apps can use, apparently",
  "category": "tablets",
  "updated": "2021-05-28T13:37:41Z",
  "author": "james-rogerson",
  "summary": "5GB per app",
  "article": [
    "If you were wondering whether it’s worth shelling out on a 1TB or 2TB iPad Pro 2021 in order to get the extra RAM (16GB rather than 8GB) the answer right now is probably no, as you reportedly won’t be able to make much use of it.",
    "According to Procreate (a digital art app), all of the iPad Pro 2021 models make the same amount of RAM available to individual apps, regardless of how much RAM they actually have built in.",
    "Procreate doesn’t say how much RAM that is, but in the replies to the company’s tweet other users have claimed that there’s 5GB available.",
    "So what’s the point of opting for a model with 16GB? Well, beyond the fact that these ones also come with more storage, that extra RAM can be used to keep apps in memory, so you can swap between them quickly if you’re multi-tasking. But for single app use you seemingly won’t experience any more power from a 16GB iPad Pro 2021 than from an 8GB one.",
    "However, that could change in the future, as this limitation is a software one, so Apple could theoretically update iPadOS to allow you to make use of more RAM.",
    "The company is never likely to allow a single app to use all the RAM (after all, it needs some for the operating system), but there’s plenty to spare on the 16GB iPad Pro 2021 models, so we wouldn’t be surprised if they get a boost at some point.",
    "Of course, most users probably wouldn’t be able to tell the difference anyway. Currently access to that extra RAM would probably only real help with things like heavy duty video editing, or using hundreds of layers in art apps like Procreate. For general use and even high-end gaming, the iPad Pro 2021 already has all the power you need.",
    "Via 9to5Mac"
  ],
  "headers": {},
  "links": {
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Procreate": "https://twitter.com/Procreate/status/1398097115499220992",
    "9to5Mac": "https://9to5mac.com/2021/05/28/ipad-pro-ram-limits/"
  }
}