{
  "source": "https://www.techradar.com/news/fifa-22-may-be-the-last-fifa-game",
  "title": "FIFA 22 may be the last 'FIFA' game",
  "category": "gaming",
  "updated": "2021-10-08T10:36:23Z",
  "author": "vic-hood",
  "summary": "'FIFA 23' could be called something entirely different",
  "article": [
    "EA Sports is \"exploring\" the possibility of renaming its FIFA game series, raising the possibility that the recently released FIFA 22 will be the last game in the series with the 'FIFA' moniker.",
    "That's according to a blog post by the developer, which both celebrated the launch of FIFA 22 and touched on EA Sports' plans for the future of the FIFA game series.",
    "\"As we look ahead, we’re also exploring the idea of renaming our global EA Sports football games,\" the blog post says. \"This means we’re reviewing our naming rights agreement with FIFA, which is separate from all our other official partnerships and licenses across the football world.\" At the same time, EA made clear that it's fully aware of how important branded competitions and national leagues, as well as globally-popular clubs, stadiums and players are to the \"authenticity\" of the FIFA game series. \"Through years of building our global franchise, we also know that authenticity is essential to the experience,\" the blog post adds. \"That’s why we focus so much energy on the collective strength of over 300 individual licensed partners that give us access to 17,000+ athletes across 700+ teams, in 100 stadiums and over 30 leagues around the world.",
    "\"We continually invest in the partnerships and licenses that are most meaningful to players, and because of that, our game is the only place you can authentically play in the iconic UEFA Champions League, UEFA Europa League, CONMEBOL Libertadores, Premier League, Bundesliga, and LaLiga Santander, among many others.\"",
    "It's odd to imagine EA's soccer simulation series without the FIFA branding, but it looks like that's exactly what the developer is looking into right now.",
    "But what does it mean for the game content itself? The blog post specifies that the naming rights for the FIFA series are separate from its other official partnerships and licenses, meaning that, apart from a name change and the absence of heavy FIFA branding, we shouldn't see a big change to content within the game.",
    "It's reassuring to hear that dropping the FIFA name shouldn't impact the majority of in-game content, but it seems like a somewhat odd move – and one for which EA hasn't given a reason. After all, EA's soccer sim is conflated with the FIFA brand – but maybe that's the point. EA likely pays a lot to license the FIFA name, and that license may come with some constraints as to what EA can and can't do, so dropping the name altogether would likely save EA money and give it more freedom.",
    "Given that FIFA is such a long-running series, it's arguably outgrown its name, building a fanbase that will likely follow it whatever it's called. It's not set in stone that the FIFA name will change, but, with EA Sports being so open about it, we would speculate that it's probably going to happen, although what the new name might be remains unclear. Regardless, it looks like FIFA 22 could be the last 'FIFA' game."
  ],
  "headers": {
    "4": "Analysis: what does this mean for the beautiful game?"
  },
  "links": {
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "blog post": "https://www.ea.com/news/fifa-22-and-the-future-of-football"
  }
}