{
  "source": "https://www.techradar.com/news/n64-games-on-the-nintendo-switch-are-confirmed-but-could-dreamcast-be-next",
  "title": "N64 games on the Nintendo Switch are confirmed, but could Dreamcast be next?",
  "category": "computing",
  "updated": "2021-09-24T11:56:27Z",
  "author": "daryl-baxter",
  "summary": "Opinion: Shenmue on Switch?",
  "article": [
    "After much speculation and rumors, Nintendo announced that N64 games are coming to the Switch Online service as an Expansion Pack from October.",
    "Since the Nintendo Switch Online service was released in 2018 with NES games, followed by SNES games in 2019, it was hoped that either Game Boy or N64 games would arrive in 2020, but nothing came of it.",
    "Some put it down to the power of the Switch itself, that it would struggle to run certain games such as Zelda: Majoras Mask and Star Wars: Rogue Squadron.",
    "But those fears were quickly dismissed with confirmation that nine games were coming in October, with more coming. However, with SEGA Genesis games also coming to the service, it may mean that other systems may be arriving soon.",
    "Nintendo confirmed that N64 and SEGA Genesis games would be coming at a higher tier of the Switch Online membership, of which would be detailed and priced at a later date.",
    "Having wanted to play Zelda: Majoras Mask on my Switch for years, to see it on its way was the highlight of the Nintendo Direct for me. It's the 3D Zelda game that I find the best, second only to Breath of the Wild. There was also mention of F-Zero X arriving to the service, and while this is also a game I was hoping to see appear, having its expansion pack for the 64DD, an add-on that was quickly discontinued for the N64, would be a welcome addition.",
    "However, seeing Banjo Kazooie as another game appearing at a later date was a shock. Reading between the lines, it looks to be another agreement between Nintendo and Microsoft, who own Rare, the maker of Banjo Kazooie.",
    "This now means that other games from Rare's library could appear, from Banjo-Tooie, to Blast Corps. But if you think there's a better chance for GoldenEye to appear, I'd stop.",
    "However, this wasn't the only addition, with SEGA Genesis / Mega Drive games also appearing on the service soon. While you can buy a collection of these, the emulation wasn't great, with odd sounds when collecting rings in Sonic 2 for instance.",
    "But with this now coming to the service, it opens up potential for other consoles to arrive someday.",
    "I'm a big lover of the SEGA Dreamcast, released back in 1999 where it introduced Sonic Adventure, Shenmue and Jet Set Radio to an audience that still fondly remembers the era.",
    "Shenmue is a series that still holds a flame to many, with the first two games redefining how an RPG could work in a 3D environment. But with no mention of games from this era appearing on the Switch, seeing it on the Online service could be the next best thing.",
    "While the space of one Dreamcast game is almost ten times the space of one Nintendo 64 game, which usually is around 30MB, having a library of these games could make the Online service even more alluring. The following could just be the start:",
    "The next avenue for the service could be the Game Boy. There's a huge library to pick from here, ranging from the original handheld to the Game Boy Advance. It could fall into the higher tier where the N64 and SEGA Genesis will be, and could bring some forgotten classics to the Switch:",
    "However, we're only in the early stages of seeing new systems arrive for the Switch Online service. But with the Nintendo Switch OLED arriving soon, being able to play Zelda: Ocarina of Time on the OLED display could be a temptation that few could resist once that and the rest of the library are available."
  ],
  "headers": {
    "4": "The Kazooie in the room",
    "10": "The Nintendo Dreamcast",
    "13": "What could Nintendo release next?"
  },
  "links": {
    "announced": "https://www.techradar.com/news/nintendo-switch-online-to-offer-n64-and-genesis-games-with-new-subscription-plan",
    "a flame to many": "https://www.techradar.com/news/how-shenmue-helped-me-cope-with-childhood-trauma"
  }
}