{
  "source": "https://www.techradar.com/news/this-frustrating-windows-10-upgrade-issue-has-finally-been-resolved-by-microsoft",
  "title": "This frustrating Windows 10 upgrade issue has finally been resolved by Microsoft",
  "category": "computing",
  "updated": "2021-05-10T10:01:30Z",
  "author": "jess-weatherbed",
  "summary": "Devices affected by Conexant issues can now upgrade",
  "article": [
    "Some Windows 10 users have experienced problems since May 2020 when trying to upgrade to versions 2004 or 20H2 due to Conexant issues should now find that all blocks have been rectified, with Microsoft stating that any users who experienced this are now safe to attempt the update again. A small number of computers saw complications with Conexant or Synaptic audio drivers that resulted in Windows 10 users receiving a stop error that caused the device to blue screen, which would then automatically trigger the system to roll back to an older version of Windows 10.",
    "\"If updated drivers are not available for your device and you are offered Windows 10, version 2004 or Windows 10, version 20H2, a small number of devices might roll back to the previous version of Windows 10 when attempting to update,\" Microsoft explains. \"If this occurs, you should attempt to update to Windows 10, version 2004 or Windows 10, version 20H2 again.\" Bleeping Computer reports that it could take up to 48 hours before an update to a newer Windows version is offered if you've been affected by the dreaded 'Blue Screen of Death', but If you're wanting to speed up the process then you can use the Media Creation Tool to jump ahead.",
    "Via MSPowerUser"
  ],
  "headers": {},
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Conexant or Synaptic audio drivers": "https://www.techradar.com/news/microsoft-has-delivered-a-partial-fix-for-this-nagging-windows-10-bug",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/microsoft/microsoft-removes-last-remaining-windows-10-upgrade-blocks/",
    "Media Creation Tool": "https://www.techradar.com/how-to/how-to-use-the-windows-10-media-creation-tool",
    "MSPowerUser": "https://mspoweruser.com/microsoft-removes-last-windows-10-upgrade-blocks/"
  }
}