{
  "source": "https://www.techradar.com/news/forza-horizon-4-is-coming-to-steam-heres-when-you-can-play-it",
  "title": "Forza Horizon 4 is coming to Steam – here’s when you can play it",
  "category": "gaming",
  "updated": "2021-02-10T10:55:17Z",
  "author": "adam-vjestica",
  "summary": "Start your engines",
  "article": [
    "Forza Horizon 4, arguably one of the best Xbox Series X games, is coming to Steam on March 9, 2021 – a first for the franchise.",
    "The game was initially released on Xbox One and Windows 10 PCs on September 28, 2018, and though it’s been out for quite some time, Forza Horizon 4 has received a number of notable post-launch updates.",
    "Various car packs and standalone downloadable expansions have been added to the game, such as Fortune Island and LEGO Speed Champions, as well as brand-new modes like the battle royale inspired online event, The Eliminator. A new Hot Wheels Legends car pack is also on the way, though release date has been revealed.",
    "Forza Horizon 4 sees you speeding around the beautiful location of Blighty, otherwise known as Britain. The game wonderfully encapsulates the UK thanks to its dynamic weather system, which covers the four seasons of winter, summer, spring and autumn. Each season dramatically transforms the game’s world map, and provides new challenges and events.",
    "Forza Horizon 4 coming to Steam isn’t too surprising, though it is great news for PC gamers. Microsoft has slowly begun moving its key franchises that were exclusive to the Microsoft Store to Valve’s digital distribution service in recent months, with Halo: The Master Chief Collection and Sea of Thieves two recent examples. Both games saw a big uptick in players due to being available on Steam.",
    "It’s clear that Forza Horizon 4 will only benefit from being accessible by more players, and with cross-play support, Steam players will be able to drive around with their friends who are playing the game on Xbox, Windows 10 PCs or via cloud gaming on Android for Xbox Game Pass Ultimate subscribers."
  ],
  "headers": {
    "3": "Shifting gears"
  },
  "links": {
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review",
    "best Xbox Series X games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "Steam": "https://store.steampowered.com/app/1293830/Forza_Horizon_4/",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "battle royale": "https://www.techradar.com/best/best-battle-royale-games",
    "Halo: The Master Chief Collection": "https://www.techradar.com/news/halo-mcc-is-now-the-best-selling-game-on-steam",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-review",
    "cloud gaming": "https://www.techradar.com/news/choosing-the-right-cloud-gaming-service-for-you",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate"
  }
}