{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-smarttag-bluetooth-tracker-launch",
  "title": "Samsung Galaxy S21 may have this 'SmartTag' Bluetooth tracker tag along at launch",
  "category": "phones",
  "updated": "2021-01-02T05:00:00Z",
  "author": "matt-swider",
  "summary": "The Samsung Galaxy SmartTag is shaping up to be a Tile-like Bluetooth tracker that beats Apple to the punch",
  "article": [
    "The Samsung Galaxy S21 launch, rumored to be Thursday, January 14, may not be limited to three new smartphone. A Bluetooth tracker is expected to tag along, too.",
    "This is exciting news for anyone who constantly loses their keys, or fears leaving a purse, backpack or luggage behind. Dubbed 'Samsung Galaxy SmartTag', this small Tile-like Bluetooth tracker appears to be ready to keep tabs of your most important belongings, according to a leaked photo from 91Mobiles.",
    "Samsung appears to be taking on Tile – specifically the newer Tile Pro and the Tile Mate, which have user-replaceable batteries (unlike older Tile trackers). Samsung's tracker is said to fit a replaceable 3V CR2032 battery, according to the South Korean certification authority, as seen by GSMArena.",
    "It's more than Tile that Samsung may be looking to displace if it enters the Bluetooth tracking market. Apple was due to launch the Apple Tags tracker for some time – it was speculated at every single Apple 2020 launch event, yet it never materialized.",
    "Samsung's SmartTag tracker appears to be certified for Bluetooth 5.1 for extended range, and contains and a small button to find your phone (the reverse of its primary selling points). There's no indication of UWB, LTE, and/or GPS for wider tracking capabilities, so you may need to be in Bluetooth range for the tracker to beep.",
    "We'll likely to get answers about Samsung's Bluetooth tracker on January 14. Beyond that date, we're eager to see if Apple Tags includes those extras like UWB and LTE, the only reason Apple's version might be worth the extra wait."
  ],
  "headers": {
    "3": "Samsung to beat Apple to a Bluetooth tracker?"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "rumored to be Thursday, January 14": "https://www.techradar.com/news/samsung-galaxy-s21-release-date-and-details-confirmed-by-official-store",
    "91Mobiles": "https://www.91mobiles.com/hub/samsung-galaxy-smart-tag-live-images-ncc/",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_smart_tag_bluetooth_tracker_details_surface-news-46721.php",
    "Apple Tags": "https://www.techradar.com/reviews/apple-airtag-review"
  }
}