{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-2-and-other-older-foldables-now-have-loads-of-new-features",
  "title": "Samsung Galaxy Z Fold 2 and other older foldables now have loads of new features",
  "category": "phones",
  "updated": "2021-09-01T09:47:03Z",
  "author": "james-rogerson",
  "summary": "Get more out of your foldable phone",
  "article": [
    "Samsung recently launched the Galaxy Z Fold 3 and the Samsung Galaxy Z Flip 3, but the company hasn’t forgotten about its older foldable phones, as it’s rolling out an update that adds a bunch of software features from the newer handsets.",
    "Dubbed One UI 3.1.1, this update is coming to the Samsung Galaxy Z Fold 2, Samsung Galaxy Z Flip 5G, original Samsung Galaxy Z Flip, and original Samsung Galaxy Fold – so in other words all of Samsung’s older foldable phones, while the new models have this software already.",
    "One UI 3.1.1 includes a wealth of features, including Drag and Split, which lets you drag a link to open it on the same screen as the current window you’re viewing. That will be available for all of Samsung’s foldable phones.",
    "Then there’s Multi-Active Window, which lets you view three apps simultaneously on the screen. This feature is headed to all of the Samsung Galaxy Z Fold models. Those phones will also get a Rotate All Apps mode, which forces apps to rotate to match the phone’s orientation, even if they’re designed to be locked in a specific orientation.",
    "Other features being added to the Galaxy Z Fold range include the ability to customize the aspect ratio of any app, and the ability to view your message list on the left and a selected conversation on the right in the Messages app, rather than only seeing one of the screens at a time.",
    "Every Samsung foldable except the original Galaxy Fold will also get the ability to force Flex Mode to work, even for apps that aren’t officially compatible with it. This means that video will be shown on one half of the screen, and playback controls will be on the other.",
    "The One UI 3.1.1 update should be rolling out from now (September 1) for all models except the original Samsung Galaxy Fold, which should get it around a week later, so keep an eye out.",
    "Samsung has achieved a lot with foldable phones in the last few years. With the Samsung Galaxy Z Fold 3 it’s arguably close to perfecting the form, but that’s only half the battle – as this update shows, serious software changes need to happen in order to make the most out of them as well.",
    "A foldable phone with normal Android software will act much like an oversized phone, making little use of all that extra screen space, and the flexible orientations you can have the display in.",
    "So with these updates, Samsung should be close to delivering on the potential of foldable phones, and should breathe new life into its older models.",
    "Via The Verge"
  ],
  "headers": {
    "7": "Analysis: foldable phones are coming into their own"
  },
  "links": {
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "One UI 3.1.1": "https://www.samsungmobilepress.com/featurestories/samsungs-one-ui-3.1.1-bring-next-level-foldable-experiences-to-galaxy-z-series-users",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy Z Flip 5G": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Samsung Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "The Verge": "https://www.theverge.com/2021/8/31/22650344/samsung-foldable-z-fold-flip-phones-features-one-ui-3-1-1"
  }
}