{
  "source": "https://www.techradar.com/news/google-docs-sticks-it-to-microsoft-word-with-latest-update",
  "title": "Google Docs sticks it to Microsoft Word with latest update",
  "category": "computing",
  "updated": "2021-10-20T21:00:17Z",
  "author": "anthony-spadafora",
  "summary": "New universal @ menu lets you easily add tables, images and more to Google Docs",
  "article": [
    "With the launch of smart canvas earlier this year, Google made collaborating while working online even simpler in Google Workspace as the feature allows users to bring together all of its various tools including Docs, Meet, Sheets and Slides in any document they're working on.",
    "As part of its mission to build the future of work, the search giant also introduced smart chips which enable users to add interactive building blocks to connect people, content and events into one seamless experience.",
    "Now though, with its new universal @ menu, Google is making it easier to add things like tables and images in addition to smart chips directly into Google Docs. By typing “@” while in a document, users will see a list of recommended files, people, meetings, content elements and formats to insert into their work.",
    "The addition of the company's @ menu ties together all of its online collaboration tools in a way that will likely help boost productivity as users won't have to switch tabs, apps or even leave the document they're working on to add rich elements to their content.",
    "In a separate post on the Google Workspace blog, Google revealed that Docs users can now mark a paragraph to always begin on a new page with its new “Add page break before” option.",
    "This new feature is particularly useful for journalists and other writers that want certain paragraph styles to always create a new page such as titles, subtitles or headings.",
    "At the same time though, “Add page break before” will also allow users to import and export Microsoft Word and other third-party documents that have this option applied to paragraphs and Google Docs will retain that formatting.",
    "To get started using this formatting style, users can go to Format > Line & paragraph spacing in the Docs menu bar and click “add page break before” after highlighting a title, subtitle or heading."
  ],
  "headers": {
    "4": "Page break before in Docs"
  },
  "links": {
    "smart canvas": "https://www.techradar.com/news/google-workspace-update-wants-to-bring-all-your-work-tools-together",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "universal @ menu": "https://workspaceupdates.googleblog.com/2021/10/easily-add-to-google-docs-with-new.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "post": "https://workspaceupdates.googleblog.com/2021/10/add-page-break-before-paragraphs-in.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "Microsoft Word": "https://www.techradar.com/reviews/microsoft-word-review"
  }
}