{
  "source": "https://www.techradar.com/news/dune-director-reveals-why-the-sci-fi-movie-was-so-challenging-to-make",
  "title": "Dune director reveals why the sci-fi movie was so challenging to make",
  "category": "entertainment",
  "updated": "2021-09-03T15:31:19Z",
  "author": "tom-power",
  "summary": "\"Dune is so rich... we had to find an equilibrium\"",
  "article": [
    "Dune director Denis Villeneuve has explained why the source material's complex story and world building was the biggest challenge to overcome.",
    "Speaking during a Venice Film festival press conference for Dune, Villeneuve revealed that the movie needed to appeal to diehard fans and newcomers alike if it's to be successful.",
    "Ensuring that the sci-fi epic was accessible to general audiences, then, was just as important as retaining the core essence of Frank Herbert's novel, Villeneuve explained.",
    "\"The book is so rich,\" Villeneuve said. \"So it was about trying to find an equilibrium between the information that audiences, who haven't read the book, doesn't know and not pressuring them with too much exposition. Of course, we also tried to be a cinematic as possible, but the biggest challenge was finding the right amount of information so the audience could follow the story properly.\"",
    "Villeneuve also reiterated his stance that film fans would get the best Dune experience if they watched it on the big screen.",
    "The Arrival and Blade Runner 2049 director hasn't been shy about Warner Bros' decision to simultaneously release Dune on HBO Max and in theaters. While his stance has softened somewhat since criticising the move in December 2020, though, Villeneuve says that moviegoers should watch Dune in the cinema as that's how it was intended to be seen.",
    "\"These are difficult times for everyone,\" he said, alluding to the Covid-19 pandemic. \"And we all agree on safety first. But if the audience feels comfortable, and there's a safe environment that encourages them to see it on the big screen, because that's how it was designed, it's what you want to see [as a filmmaker].\"",
    "With Covid-19 cases rising worldwide due to the Delta variant, film studios are starting to get cold feet about releasing their tentpole movies this year.",
    "Recently, Top Gun: Maverick and Mission Impossible 7 saw their launch dates pushed back into 2022. Fearing that audiences won't head to theaters in their droves – an issue that would mean smaller box office hauls than usual – Paramount Pictures opted to delay both films' releases until case numbers fall.",
    "Disney and Sony are, for the moment, pushing ahead with their upcoming 2021 releases. Marvel's Eternals, Ghostbusters: Afterlife and Spider-Man: No Way Home are all still slated to land before the year ends.",
    "Meanwhile, MGM and Universal have finally decided to take the leap and release No Time to Die, Daniel Craig's final outing as James Bond, 18 months after it was supposed to arrive.",
    "While it's unlikely that Disney and Sony will push their 2021 movies into 2022, all eyes should be on No Time to Die's box office performance. If it fails to entice film fans to return to theaters (and makes a loss as a result), more studios may fear similar outcomes. That may force their hands and lead to more movie delays.",
    "No Time to Die, though, isn't the only blockbuster movie that could save the 2021 movie schedule.",
    "Dune is one of the most anticipated films of the year – and there's good reason for that. With an award-winning director in Villeneuve, a stacked cast of A-list actors, rich cinematography work, and a score crafted by legendary composer Hans Zimmer, Dune has the makings of the best film of 2021.",
    "So there's more than one potential savior of this year's box office.",
    "No Time to Die should do well enough to justify its belated theatrical arrival, despite Covid concerns. Even if it doesn't, though, Dune has the capacity to carry the proverbial baton and give this year's theatrical experience a much needed shot in the arm.",
    "Of course, Dune's simultaneous release on HBO Max might dent its ticket sales. Some viewers may decide to watch it in the safety of their own home. Given that HBO Max isn't available worldwide, however, cinemas are the only place that most film fans can watch it.",
    "That should ensure it performs well at the global box office and, whether it does so alongside No Time to Die or not, Dune could be the movie that changes the film industry's fortunes before the year is over."
  ],
  "headers": {
    "7": "Analysis: can Dune save the 2021 moviegoing experience?"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "in December 2020": "https://www.techradar.com/news/hbo-max-could-kill-the-dune-franchise-says-director",
    "pushed back": "https://www.techradar.com/news/top-gun-maverick-release-date-nosedives-into-2022-amid-ongoing-covid-19-concerns",
    "Marvel's Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know"
  }
}