{
  "source": "https://www.techradar.com/news/back-to-school-deal-the-macbook-pro-m1-hits-lowest-sale-price-ever-at-amazon",
  "title": "Back to school deal: the MacBook Pro M1 hits lowest sale price ever at Amazon",
  "category": "computing",
  "updated": "2021-07-19T17:42:03Z",
  "author": "mackenzie-frazier",
  "summary": "Score a $200 price cut on Apple's powerful MacBook Pro",
  "article": [
    "We're rounding up this week's best back to school deals, and we've just spotted a fantastic discount on the powerful Apple MacBook Pro. Right now, Amazon has the MacBook Pro M1 on sale and back down to a record-low price of $1,099.99 (was $1,299.99). That's a $200 discount and the best deal you'll find for the 13-inch laptop.",
    "The 2020 MacBook Pro features a 13.3-inch Retina display and packs Apple's powerful M1 chip with an 8-core CPU and 8-core GPU. Thanks to the new M1 Chip, you're getting exceptional speed and power as well an impressive 20-hours of battery life that Apple claims is the longest ever in a Mac. You're also getting 8GB of RAM, 256GB of storage, and macOS Big Sur, which provides advanced security and privacy as well as access to the latest apps. As we've mentioned above, this is not only a fantastic deal but also the lowest price we've found for this particular model. We don't know how long Amazon will have the MacBook Pro at this price, so we recommend snagging this bargain now before it's too late.",
    "See more laptop offers with our roundup of the best cheap laptop deals and you can see more of the best MacBook deals that are happening now. You can also shop for more bargains with our roundup of the best back to school sales and can learn more about the upcoming Labor Day sales event."
  ],
  "headers": {
    "1": "MacBook Pro deal",
    "2": "More MacBook deals"
  },
  "links": {
    "record-low price of $1,099.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08N5LLDSG%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7934917448394086000-20",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "best cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "MacBook deals": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699",
    "back to school sales": "https://www.techradar.com/news/best-back-to-school-sales-2020",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020"
  }
}