{
  "source": "https://www.techradar.com/news/the-next-sonos-smart-speaker-could-be-its-most-affordable-and-compact-yet",
  "title": "The next Sonos smart speaker could be its most affordable and compact yet",
  "category": "audio-visual",
  "updated": "2021-02-08T01:26:54Z",
  "author": "harry-domanski",
  "summary": "FCC filing hints at upcoming Sonos Move Mini launch",
  "article": [
    "Sonos is getting ready to launch a companion to its portable Sonos Move smart speaker – currently the only product in the company's lineup that sports a Bluetooth connection and built-in battery.",
    "An FCC filing spotted by The Verge describes a device that uses a wireless charging base but requires less power than the company's Move speaker, suggesting a similar portable smart speaker that's even more compact.",
    "Other details within the filing are thin on the ground, but the 'Move Mini' (as it may be named) features a circular label \"laser etched around the perimeter of the bottom surface of the device\", which suggests that the unit will by cylindrical, akin to the popular UE Megaboom 3.",
    "It is possible, however, that just the base of the unit is circular (or the label alone) and that the rest of the unit conforms more to the existing shape of the Move, which is a rounded oblong.",
    "Regardless, we're not likely to have to wait long. Details of the original Sonos Move leaked shortly after its FCC filing was discovered (model number S17), so the new 'Move Mini' (S27) may well follow a similar path.",
    "The Sonos Move currently costs $399 (£399, AU$649) – a price that puts it firmly at the top end of the Bluetooth speaker market – but it earns this price tag with its array of Sonos smarts and its powerful audio.",
    "As such, there's certainly room in the market for a more compact version of this speaker that still offers the same smarts but packs them into a smaller, more affordable, and more lightweight package (the Move weighs about 3kg).",
    "Naturally, this will likely come at the expense of some audio output, but given the finetuning that Sonos is known for, we'll likely see a device that still sounds great at lower and moderate volumes but isn't capable of reaching the volume levels of its bigger siblings."
  ],
  "headers": {
    "5": "Portable, affordable Sonos"
  },
  "links": {
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "FCC filing": "https://fccid.io/SBVRM027",
    "The Verge": "https://www.theverge.com/2021/2/5/22269050/sonos-fcc-filing-mini-move-portable-bluetooth-speaker",
    "UE Megaboom 3": "https://www.techradar.com/reviews/ue-megaboom-3",
    "Details of the original Sonos Move leaked": "https://www.techradar.com/news/details-of-sonos-first-portable-bluetooth-speaker-leaked-in-marketing-images",
    "FCC filing was discovered (model number S17)": "https://www.techradar.com/news/sonos-looks-to-be-adding-bluetooth-to-its-next-speaker"
  }
}