{
  "source": "https://www.techradar.com/news/twitter-finally-launches-communities-five-years-after-cancelling-the-project",
  "title": "Twitter finally launches Communities – five years after cancelling the project",
  "category": "computing",
  "updated": "2021-09-09T11:43:27Z",
  "author": "daryl-baxter",
  "summary": "Lord of the Flies, but on Twitter",
  "article": [
    "Twitter is launching yet another feature called Communities, the company revealed on Thursday morning, which is a new way of chatting to a certain group of followers about certain topics. The feature is available to testers on iOS and the web for now.",
    "After attempting its own take on Snapchat’s Stories, and then Spaces to let users chat in an audio room like rival Clubhouse, Communities is Twitter’s version of forums that were prevalent on many websites in the early 00s.",
    "Back before social media sites were popular, people who were interested in certain topics would go to a forum site to further discuss them. But with platforms such as Reddit and Facebook Groups rendering these irrelevant, Twitter has decided that there’s another way for forums to live again.",
    "Twitter has rolled out many new features to attract new users and keep existing ones interested in staying on the platform. The character limit doubled from 140 characters to 280 back in 2019, and that caused a bit of an uproar from its users, but now it’s something that’s widely accepted as a success.",
    "Insider sources tell TechRadar that Communities was in the works as far back as five years ago, but executives at the company lost faith in it and it was ultimately shelved until now.",
    "You can sign up your account to register your interest, where you’re asked to explain the type of community that you would like to create. There's also a page that lays out how to moderate one to help give you some guidance.",
    "In a blogpost, Staff Product Manager David Regan explained that it would be a place for a focused discussion on specific topics. “Some conversations aren’t for everyone, just the people who want to talk about the thing you want to talk about. When you join a Community, you can Tweet directly to that group instead of to all your followers. Only members in the same Community are able to reply and join the conversation so it stays intimate and relevant.”",
    "While it’s a feature that may be useful to some, especially if some topics come into prominence, such as the rumored iPhone 13 or the new season of Star Trek: Discovery, it could get easily overlooked amongst the spate of new features the site has recently rolled out.",
    "Twitter has been throwing a lot at the wall to see what sticks for its users, and while Fleets wasn’t the success the company hoped, there’s plenty of other features that it clearly hopes that can be. The following has either been announced or been in testing for a certain pool of users:",
    "It’s already a list that’s bursting at the seams for Twitter, with other users simply wanting to tweet their interests while hoping for an edit button. But it also shows a company that clearly doesn't want to depend solely on ad revenue to keep the lights on.",
    "While we may see some of these features roll out to everyone on the social platform soon, Communities is one that could either stay or go, as it’s a rethink of forums which was prevalent across many sites in the early 00’s. But while Twitter’s Lists feature already solves this issue for curated topics, it may confuse other users to what the appeal of what Communities could bring to the platform.",
    "It’s telling that the feature launched just as new devices are rumored to launch soon, such as the iPhone 13 and Windows 11, but it depends whether it can be accepted by the wider community of Twitter, rather than it being a test subject for a few months."
  ],
  "headers": {
    "3": "A community feature in limbo",
    "8": "Seeing what sticks"
  },
  "links": {
    "revealed on Thursday morning": "https://blog.twitter.com/en_us/topics/product/2021/testing-communities",
    "Spaces": "https://www.techradar.com/news/could-twitter-spaces-take-on-livestreams-yes-but-theres-work-to-be-done",
    "Clubhouse": "https://www.techradar.com/how-to/what-is-clubhouse",
    "sign up": "https://help.twitter.com/en/forms/communities-interest",
    "how to moderate one": "https://help.twitter.com/en/using-twitter/communities",
    "iPhone 13": "https://www.techradar.com/news/iphone-13-launch-date-confirmed-for-september-14-heres-all-we-know",
    "Star Trek: Discovery": "https://www.techradar.com/news/star-trek-discovery-season-4-gets-a-release-date-and-more-big-news-from-star-trek-day",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro"
  }
}