{
  "source": "https://www.techradar.com/news/halide-for-ipad",
  "title": "The best iPhone camera app has just landed on iPad",
  "category": "cameras",
  "updated": "2021-05-18T15:26:01.950Z",
  "author": "mark-wilson",
  "summary": "A proper version of Halide for your iPad",
  "article": [
    "Halide recently became our top pick for the title of best camera app on smartphones – and now the pro-grade app has been given some special tablet treatment with a new iPad version, which you can download today.",
    "The app has previously been able to run on iPad, but the new Halide Pro Camera for iPad is custom-designed and optimized for Apple's tablet. This means you get all of the usual manual tools, for adjusting things like shutter speed and ISO, plus the ability to shoot raw and Instant Raw snaps, with the latter being a handy shortcut for getting nicely developed raw photos.",
    "But Lux, the company that makes Halide and other apps like the long-exposure Spectre, has also made some big interface tweaks to help its camera app work nicely on Apple's awkwardly-shaped iPads, which aren't exactly an ergonomic delight for taking photos.",
    "One of these iPad-only features is an optional 'Pro View', which you can toggle using a button in the bottom-left. This shrinks the viewfinder down into a smaller box (one you can see comfortably without holding the iPad too far away from you) and then surrounds it with useful tools like a waveform and other manual controls. You can see 'Pro View' in the image below.",
    "Lux has also created a custom iPad UI for the app, with larger text and an expandable 'honeycomb' of features that can be expanded when you need them, or minimized when you want to see the whole viewfinder.",
    "While you can use the app with both hands, there is also the option of switching the whole UI to the left-hand side too, if that suits your style.",
    "For those who want to really get under the bonnet of their iPad's camera, there's also a Depth mode, which lets you see depth maps for Portrait shots, and a Tech Readout for getting the exact specs of your iPad's camera, including the limits of its shutter speeds and ISO sensitivity.",
    "It's not clear how big the demand is for manual photography controls on iPads, which tend to be used more for photo editing apps rather than taking snaps. But Lux has clearly seen enough desire for a fully-fledged iPad version of Halide, and it certainly looks a good prospect for those who like to shoot raw photos or tinker with manual controls.",
    "Apple's default Camera app is likely more than enough for most people and includes features like exposure control and depth control in Portrait mode (on recent iPad Pro models).",
    "But the iPad's Camera app is also a more stripped-down affair than its iPhone equivalent, so this new version of Halide is perhaps looking to fill that hole for people who are looking to go beyond point-and-shoot photography.",
    "The latest iPad Pro 2021 also has a pretty respectable camera array for Halide to work with, including a 12MP f/1.8 main camera and 10MP f/2.4 ultra-wide camera on the back, plus a LiDAR sensor for creating AR-friendly depth maps.",
    "If you already own Halide for iOS, the new iPad app will be a free download that's available from today. But if not, you'll have the usual choice of making a monthly ($1.99 / £1.99 / AU$3.49), annual ($11.99 / £11.99 / AU$19.49) or one-time purchase ($39.99 / £38.99 / AU$62.99)."
  ],
  "headers": {
    "7": "Tablet-ography"
  },
  "links": {
    "best camera app": "https://www.techradar.com/best/best-camera-apps",
    "Halide Pro Camera for iPad": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1191590270423135700&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fhalide%2Fid885697368",
    "photo editing apps": "https://www.techradar.com/best/best-photo-editing-apps",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review"
  }
}