{
  "source": "https://www.techradar.com/news/no-elon-musk-isnt-emailing-you-about-cryptocurrency-its-a-scam",
  "title": "No, Elon Musk isn't emailing you about cryptocurrency - it's a scam",
  "category": "computing",
  "updated": "2021-05-18T11:04:50Z",
  "author": "sead-fadilpasic",
  "summary": "Crypto scams spoofing public figures are growing",
  "article": [
    "Consumers have been scammed out of more than $80 million in various cryptocurrencies over the course of the last year, a new report from the Federal Trade Commission (FTC) has revealed.",
    "On average, people lose $1,900 - a tenfold year on year increase - on a crypto scam that, most of the time, works on the same principle.",
    "Criminals would create a Twitter account impersonating a celebrity, or a popular business owner, such as Elon Musk. Aside from an inconspicuous typo in the Twitter handle, and the missing checkmark that confirms the authenticity of the account, it will look identical to the real thing - avatar and all.",
    "The scammers would then reach out to unsuspecting victims, striking up a conversation through which they would discuss a new cryptocurrency or blockchain project. In many cases, the fake profile would say that the project is guaranteed to make multiple returns, but the currency itself isn’t public and cannot be withdrawn until a certain point in time in the future.",
    "Believing that the funds would be available at a later date, and would be worth a lot more, the victims would send their hard-earned money to their wallet address, never to be seen or heard from again.",
    "“Promises of guaranteed huge returns or claims that your cryptocurrency will be multiplied are always scams,” the FTC said - meaning that in other words, if it sounds too good to be true - it probably is.",
    "Victims are mostly people aged 20-49 according to the FTC, with this age group more than five times more likely than other groups to report being defrauded this way.",
    "Other notable examples include creating fake accounts on dating sites in order to sweet-talk unsuspecting victims into giving away their cryptocurrencies, or organizing fake giveaways that require victims to share the private keys to their wallets.",
    "Via: The Verge"
  ],
  "headers": {
    "5": "Targeting love-seekers"
  },
  "links": {
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "wallet address": "https://www.techradar.com/news/best-bitcoin-wallets",
    "The Verge": "https://www.theverge.com/2021/5/17/22440425/elon-musk-impersonator-cryptocurrency-bitcoin-twitter-scam-report-ftc?scrolla=5eb6d68b7fedc32c19ef33b4"
  }
}