{
  "source": "https://www.techradar.com/news/steam-big-picture-mode-is-getting-an-overhaul-thanks-to-steam-deck",
  "title": "Steam Big Picture mode is getting an overhaul thanks to Steam Deck",
  "category": "gaming",
  "updated": "2021-07-21T08:43:30Z",
  "author": "gerald-lynch",
  "summary": "A long-overdue update for Big Picture mode is on the way",
  "article": [
    "Steam Big Picture mode, the alternative desktop UI to Valve's PC gaming platform designed for a more console-like full-screen experience, is getting reworked, and it's all thanks to the newly-revealed Steam Deck.",
    "The Steam Deck, Valve's entry into the handheld gaming space, comes with a new interface for the Steam platform that's designed for on-the-go and living-room play, and will be easily navigated without the need for a keyboard and mouse. And that's the interface that will soon replace Steam's existing console-aping Big Picture mode.",
    "\"Yes, we are replacing Big Picture with the new UI from Deck,\" stated Valve moderator austinp_valve in response to a question regarding the future of Big Picture mode. \"We don't have an ETA to share yet though.\"",
    "Big Picture Mode landed alongside another hardware effort by Valve – it's ill-fated Steam Machines. And while it's still gamers' best way to lean back with a controller and enjoy PC gaming on Valve's Steam platform, the fact it hasn't had an update since 2015 means the interface is showing its age.",
    "With Steam Deck's launch later this year, a unified UI between both PC and handheld can only be a good thing, ensuring both audiences get the latest features and optimisations fit for gaming in the modern era. It also means that those that were unable to pre-order the Steam Deck (or at least bag one before the waiting list became obscenely long) will get a taste of what the handheld has to offer.",
    "Set to land this December, and with an entry level model starting at $399 / £349, the Steam Deck gives you on-the-go access to your library of Steam PC games, and makes use of a 7-inch touchscreen, AMD chipset and the ability to dock with a TV in a manner incredibly similar to the Nintendo Switch. We'll have plenty more on the Steam Deck in the run up to its launch later this year, so keep checking back for all the latest info on the intriguing new handheld."
  ],
  "headers": {
    "3": "Long overdue"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "in response to a question": "https://steamcommunity.com/groups/bigpicture/discussions/1/5167301764850695635/",
    "Steam Machines": "https://www.techradar.com/news/valve-hammers-final-nail-into-coffin-of-steam-machines",
    "pre-order the Steam Deck": "https://www.techradar.com/news/steam-deck-pre-orders-flood-in-and-512gb-model-now-isnt-shipping-for-a-year",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}