{
  "source": "https://www.techradar.com/news/stunning-black-friday-headphones-deal-drops-the-aftershokz-aeropex-to-their-lowest-price-ever",
  "title": "Quick - this brilliant Black Friday headphones deal is perfect for runners",
  "category": "audio-visual",
  "updated": "2021-12-04T14:48:29Z",
  "author": "olivia-tambini",
  "summary": "Get the bone conduction headphones for less with this Black Friday deal",
  "article": [
    "Finding a pair of running headphones that allow you to stay in tune with your surroundings can be tricky, but this brilliant Black Friday deal on the Aftershokz Aeropex bone conduction headphones makes it easier than ever.",
    "Usually $159.95, Amazon has slashed the price of the Aeropex to just $99.95 – that's the lowest price we've ever seen, and a simply stunning Black Friday headphones deal. (Not in the US? Scroll down for the best deals in your region.)",
    "They're among the best running headphones you can buy in 2021, thanks to an ingenious design that uses vibrations on your cheekbones to direct sound to your auditory nerves, leaving your ear canals open so that you can still hear the world around you – handy if you run in busy areas and need to be aware of traffic.",
    "Need something a bit cheaper? Amazon has also reduced the AfterShokz Openmove headphones from $79.95 to $54.95. Again, this is the lowest price we've seen for these bone conduction headphones, and another excellent Black Friday headphones deal to snap up.",
    "The Aftershokz Aeropex are the best bone conduction headphones you can buy today, and they're an excellent choice for runners that want to keep their ears free to hear the world around them.",
    "Rather than playing music directly into your ear canal, the Aeropex use transducers to send vibrations through your cheekbones and jaw up towards your inner ear. Your brain then does the processing work, turning those sound vibrations into the content that streams through the headphones.",
    "Despite their slender frame, they include two physical buttons to control volume, and the move to a proprietary charging setup helps them to offer an improved water-resistance rating. Dual noise-cancelling mics are available for those times you need to take calls, too.",
    "We've never seen the price of the Aeropex drop so low, so this Black Friday headphones deal is worth snapping up right away.",
    "If you need something cheaper, the Aftershokz Openmove are a good budget option – and they only launched earlier this month, so we weren't expecting to see any deals on these headphones.",
    "The OpenMove have a slightly chunkier design than the company's more expensive headsets, but they're still very light at 29g. While we didn't find them as comfortable to wear for long periods as the Aeropex, the Openmove are a good option for those looking to dip their toes into the world of bone conduction headphones this Black Friday.",
    "No matter where you live, you'll find all the lowest prices for Aftershokz headphones from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Black Friday headphones deals for runners",
    "10": "More Aftershokz deals",
    "11": "More Black Friday deals"
  },
  "links": {
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Amazon has slashed the price of the Aeropex to just $99.95": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAfterShokz-Open-Ear-Wireless-Conduction-Headphones%2Fdp%2FB07RQLRV7Q%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2567630451121449000-20",
    "Black Friday headphones deal": "https://www.techradar.com/black-friday/best-headphones-deals",
    "AfterShokz Openmove headphones from $79.95 to $54.95": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAfterShokz-OpenMove-Conduction-Bluetooth-Headphones%2Fdp%2FB08BZF5W7N%2Fref%3Dsr_1_1_sspa%3Fcrid%3D3Z6742YNGX4Z%26keywords%3Daftershokz%2Bopenmove%26qid%3D1637880881%26sprefix%3Daftershokz%2Bopenmo%252Caps%252C233%26sr%3D8-1-spons%26psc%3D1%26spLa%3DZW5jcnlwdGVkUXVhbGlmaWVyPUEzOTlCRUFZQVhZQUU5JmVuY3J5cHRlZElkPUEwMzIxNTgwSUVHRU9BUEFIWjFEJmVuY3J5cHRlZEFkSWQ9QTAxMzA1MDgyVVE0OFlHUzdFWlVJJndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ%253D%253D%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3991462292598772700-20",
    "bone conduction headphones": "https://www.techradar.com/news/best-bone-conduction-headphones",
    "Aftershokz Aeropex": "https://www.techradar.com/reviews/aftershokz-aeropex",
    "best bone conduction headphones": "https://www.techradar.com/news/best-bone-conduction-headphones",
    "Aftershokz Openmove": "https://www.techradar.com/reviews/aftershokz-openmove"
  }
}