{
  "source": "https://www.techradar.com/news/bmw-i4-challenges-tesla-model-s-and-audi-e-tron-gt",
  "title": "BMW i4 challenges Tesla Model S and Audi e-tron GT",
  "category": "car-tech",
  "updated": "2021-09-01T10:31:36Z",
  "author": "john-mccann",
  "summary": "530hp and 0-60mph in ~4 seconds",
  "article": [
    "We've been given our first look at the BMW i4, another new electric car from the German manufacturer which follows on from the reveal of the BMW iX in the same week.",
    "Along with a handful of images of the fully electric 4-door Gran Coupé, BMW also revealed a few key specs of the upcoming i4 - and it's clear the Tesla Model S and newly announced Audi e-tron GT will have some new competition.",
    "The BMW i4 will have a lofty power output of 530hp and will be able to accelerate from 0-60mph in around 4 seconds.",
    "BMW has said that the i4 will be available in a number of versions, so the power output and acceleration time quoted above may be for the top-of-the-line model.",
    "It's also been confirmed the i4 will also have a M Performance variant too, which may see it gain even more impressive performance stats.",
    "Another enticing tidbit from this initial announcement is the BMW i4's range, with it apparently offering up to 366 miles / 590km of driving from a single charge - although real-word usage tends to see electric cars come in under the official figures.",
    "We already know the the BMW i4 will feature the firm's latest generation of in-car tech in the form of the eighth-gen iDrive system, bringing with it AI smarts, voice control and large displays.",
    "The BMW i4 will be available later in 2021, and more details on the car will be announced \"in the coming weeks\" - where we expect to learn more about its performance, technology and price."
  ],
  "headers": {
    "5": "How far will it go?"
  },
  "links": {
    "the reveal of the BMW iX": "https://www.techradar.com/news/all-electric-bmw-ix-has-the-range-to-worry-audi",
    "newly announced Audi e-tron GT": "https://www.techradar.com/news/the-audi-e-tron-gt-is-the-most-powerful-audi-ev-to-date-and-its-a-beauty",
    "eighth-gen iDrive system": "https://www.techradar.com/news/bmws-new-in-car-ai-has-a-face-that-can-express-emotions-in-a-human-like-manner"
  }
}