{
  "source": "https://www.techradar.com/news/assassins-creed-discovery-tours-could-come-to-vr-if-they-sell-well-enough",
  "title": "Assassin’s Creed Discovery Tours could come to VR – if they sell well enough",
  "category": "gaming",
  "updated": "2021-10-19T16:56:48Z",
  "author": "hamish-hector",
  "summary": "This would be the best museum experience ever",
  "article": [
    "The latest entry in the Assassin’s Creed spin-off series – Ubisoft’s Discovery Tours – has just dropped, and it’s the studio’s most immersive historical experience yet. But comments from the game’s design director indicate that a future installment has the potential to be even more immersive, possibly bringing Assassin’s Creed into VR",
    "Speaking to us about the Discovery Tour: Viking Age – which is based on the era explored by Assassin’s Creed Valhalla – Maxime Durand (Discovery Tour: Viking Age’s world design director) told us that a VR experience is certainly possible for the team: “Creating the Discovery Tours is already quite a big challenge, and this would create a lot of very different challenges, but creatively we definitely could [create a VR experience]”",
    "Durand was careful to not make any promises though, but did add that “If everyone plays the Discovery Tours and it reaches a point that makes sense for us, who knows what we will see?”",
    "While these comments leave us without anything concrete on the series coming to VR, they certainly show that Ubisoft has considered the possibility of bringing the series to virtual reality – and is likely to do so if it makes sense economically.",
    "We hope Ubisoft decides to bite the bullet soon though, as virtual reality would make a perfect home for the Discovery Tours. Ubisoft's interactive museums allow players to immerse themselves in a representation of what life was like in the past – offering them a chance to learn in-depth details about a wide range of aspects from the time period.",
    "Having previously visited Ancient Egypt and Ancient Greece in Discovery Tours, the Viking Age experience improves upon the formula once more by providing users with more agency over the experiences than they had previously.",
    "Rather than watching scenes play out, tourists can take on various roles of figures from the past in new quests. These quests will see players have to gather resources and make decisions that will have an impact on what plays out for their character.",
    "The educational value hasn’t been removed to make way for quests, though,, with players still given plenty of information through these quests and historical markers that provide facts about the era as they explore. Paired with VR, this kind of experience could put even the world’s best museums to shame.",
    "For now we’ll have to contend with the games on PC and traditional consoles, but who knows what we’ll see down the line?",
    "The Discovery Tour: Viking Age is available now. On consoles it is available to all owners of Assassin’s Creed Valhalla for free, and on PC it will be free to Valhalla owners or can be purchased as a standalone game for $19.99 / £16.99 / AU$29.95."
  ],
  "headers": {
    "5": "Opinion: Quests can be educational too"
  },
  "links": {
    "Assassin’s Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review"
  }
}