{
  "source": "https://www.techradar.com/news/atari-is-making-a-comeback-but-not-in-the-way-you-might-imagine",
  "title": "Atari is making a rather strange comeback",
  "category": "computing",
  "updated": "2021-03-08T18:28:42Z",
  "author": "joel-khalili",
  "summary": "Atari is the company behind the 2600, Pong and Asteroids...and now a crypto casino",
  "article": [
    "Atari, the fallen giant of console gaming, has revealed plans to build a crypto casino on the Ethereum blockchain.",
    "The project is part of an ongoing effort, spearheaded by CEO Frederic Chesnais, to breathe life back into Atari, which has faded into obscurity since the infamous video game crash of 1983.",
    "Built in partnership with Decentral Games, the cryptocurrency casino will offer Atari-branded games and non-fungible tokens (NFTs). Users will be able to place bets using MANA and DAI cryptocurrencies, as well as the brand new Atari token (ATRI).",
    "As with any other casino, some games will be based on luck and others on a mixture of luck and skill. However, Atari’s crypto casino will also feature an entirely skill-based game, which will presumably involve some sort of crypto reward.",
    "According to a joint statement, Atari and Decentral Games expect the casino to take in bets worth $400 million over the next two years.",
    "Crypto casinos differ from traditional online equivalents in that customers place bets and withdraw winnings in cryptocurrency, as opposed to regular fiat money (e.g. dollars or pounds). Hundreds have emerged over the past few years, but with limited success.",
    "The thinking is that using cryptocurrency allows punters to preserve their financial privacy, while storing the gambling logic on a blockchain means players can be sure the games are not rigged.",
    "However, this new variety of casino also shares a number of problems with the wider crypto ecosystem: they are experimental, highly risky and loosely regulated.",
    "Comments made by Chesnais, however, suggest Atari is more excited about the benefits of bringing its “gaming experience” to a blockchain than it is concerned about the challenges.",
    "Decentral Games, meanwhile, will look to capitalize on Atari’s brand recognition to encourage a wider pool of players into the space.",
    "“By combining our expertise in building crypto casinos with Atari’s decades of experience in developing video games, we are excited for our community to immerse themselves in an innovative and new gaming experience,” wrote Decentral Games in a blog post.",
    "A specific launch date for the Atari casino is set to be announced next month.",
    "Via Bloomberg"
  ],
  "headers": {
    "5": "Atari's crypto casino"
  },
  "links": {
    "crypto casino": "https://www.techradar.com/news/the-weird-and-rarely-wonderful-world-of-crypto-casinos",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "NFTs": "https://www.techradar.com/news/nft-frenzy-more-cash-spent-on-digital-collectibles-in-a-month-than-in-the-whole-of-last-year",
    "blog post": "https://decentral.games/blog/decentral-games-partners-with-video-game-pioneer-atari",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-03-08/atari-partners-with-crypto-gaming-operation-to-launch-casino"
  }
}