{
  "source": "https://www.techradar.com/news/asus-zenfone-8-vs-samsung-galaxy-s21",
  "title": "Asus Zenfone 8 vs Samsung Galaxy S21",
  "category": "phones",
  "updated": "2021-05-15T19:00:20Z",
  "author": "mark-knapp",
  "summary": "Battle of the one-handers",
  "article": [
    "Asus might not be the first brand you think of when you’re considering Android smartphone brands that can go toe-to-toe with Samsung’s flagship devices. But, Asus has regularly been releasing phones with competitive specs, especially within its ROG line of gaming smartphones.",
    "In the case of the Asus Zenfone 8, it’s slotting a phone into the $600-$800 market segment that’s occupied by many more affordable flagship phones, like the Samsung Galaxy S21, which feature powerful internals but make a few trade-offs to keep the price lower than the top-of-the-line models. They won't outpace the Samsung Galaxy S21 Ultra or the Asus ROG Phone 5, but they’re high-performing phones for consumers who don’t have the budget for the absolute best.",
    "With the new Asus Zenfone 8, Asus may have a contender to compete with the leading Samsung Galaxy S21. So, let’s see just how the two phones compare.",
    "The Asus Zenfone 8 and Samsung Galaxy S21 trade some blows in the design department. While the Samsung Galaxy S21 design makes a much louder statement with its colorful options and the metal trim around its camera bump, the Zenfone 8 manages a more premium design. Both phones use Gorilla Glass Victus on the front and feature aluminum frames, but where Samsung has opted for a plastic back, Asus has gone with 3D curved glass on the rear of the Zenfone 8. Despite their slightly different materials, both phones offer an IP68 rating against water and dust ingress.",
    "One of the key design aspects of the Zenfone 8 is its size. The phone is aimed at one-handed use, and toward that end has a trimmed down design. That sees it come in at 148mm tall and 68.5mm wide while weighing just 169 grams. That focus on being small doesn’t make a huge difference for it though, as the Galaxy S21 is only a hair larger at 151.7mm tall and 71.2mm wide — though a few millimeters could make a difference in some hands, as we’ve seen between the Galaxy S21 Ultra and the iPhone 12 Pro Max.",
    "The trimmed down size in the X and Y dimensions come with a tradeoff in the Z dimension. The Asus Zenfone 8 is 8.9mm thick, which is the same as the Galaxy S21 Ultra. The Galaxy S21, by contrast, is only 7.9mm thick. That said, both phones offer the same, light 169-gram weight.",
    "On the fronts of the phones, you’ll find similar, modern touches. Each has a punch-hole selfie camera (centered on the Galaxy S21, in the corner on the Zenfone 8). Both offer under-display fingerprint scanners. And, both have similar speaker arrangements for stereo audio.",
    "The Asus Zenfone 8 does manage to include a 3.5mm headphone jack, really calling into question manufacturers’ argument that they ditched the port because of space constraints. But, the Zenfone 8’s USB-C port is only up to the USB 2.0 spec whereas Samsung uses a far more capable USB 3.1 Type-C port that can transfer data faster and enable Samsung’s desktop computing-simulating DeX mode.",
    "The display difference between the Asus Zenfone 8 and Samsung Galaxy S21 are minor, but likely to tilt things in Samsung’s favor. Going small, the Zenfone 8 offers a 5.9-inch display while Samsung has a 6.2-inch display. Some people may prefer that smaller option, which has become particularly rare among high-end devices, but Samsung’s bigger screen doesn’t come with an increase in weight over the Zenfone 8.",
    "And, beyond that size difference, there’s not much the Zenfone 8 can do to pull ahead in this display contest. Both phones offer the same 2,400 x 1,080 resolution. Both offer HDR10+ support and the same 120Hz max refresh rate, but Samsung’s phone uses a variable refresh rate from 48-120Hz, giving it a bit more flexibility. And, though the Zenfone 8 has a respectable 1,100-nit peak brightness and an 800-nit level for outdoor use, the Galaxy S21 can top out at maximum 1,300 nits.",
    "Even if the Asus Zenfone 8 cedes ground in other areas, it doesn’t do so under the hood. The Asus Zenfone 8 comes powered by the same Qualcomm Snapdragon 888 chipset you’ll find in the Samsung Galaxy S21 (in the US anyway, as you may find the Exynos 2100 in other markets). Beyond that, it also packs the same 8GB or 16GB of LPDDR5 memory and either 128GB or 256GB of UFS 3.1 storage, once again matching Samsung (except the 16GB option). Both phones have all the horsepower they need to zoom through the most demanding mobile workloads.",
    "Asus also gets a slight edge here, as the Zenfone 8 features tri-band Wi-Fi 6E support, letting it connect to 6GHz networks for faster internet. The Galaxy S21 meanwhile sticks with just Wi-Fi 6. It’s a small difference at present, but could widen the gap between the two phones a couple years on when Wi-Fi 6E gains more prevalence. Both phones are 5G-capable, though the Zenfone 8 only connects to sub-6 5G, while the Samsung Galaxy S21 supports sub-6 and mmWave.",
    "The two phones trade blows in the power department. Each offers a 4,000mAh battery, but Samsung allows for wireless and reverse wireless charging, while Asus sticks to wired charging but can offer a faster 30W charging speed that steps out ahead of Samsung’s 25W.",
    "Asus makes a strong showing in the camera department, but it’s not quite a match for Samsung. The Asus Zenfone has a pair of cameras on the rear and one selfie shooter while the Galaxy S21 offers triple cameras on the rear and a single selfie cam.",
    "In daylight, photography on the primary sensors is good between both phones with OIS aiding both for clear shots, and there’s ultra-wide photography on offer from both devices, though Samsung goes wider at 120 degrees than Asus at 113 degrees.",
    "Samsung readily pulls ahead in low-light situations, which isn’t too surprising given how much better Samsung flagship night photography has gotten. Plus, having a dedicated 64MP sensor for zoom photography helps Samsung offer a more versatile shooting experience than the Asus Zenfone 8 musters, even if its 64MP main sensor can do a little digital zoom work.",
    "Samsung also steps ahead in video recording. While both devices can record at up to 8K at 24fps or 4K at 60fps, Samsung offers some strong extras. Its slow-mo video is faster, hitting up to 960fps at 720p (double the Zenfone 8’s speed). And, Samsung offers HDR10+ recording.",
    "This is a tricky one. The Samsung Galaxy S21 costs $799 (£769 / AU$1,249) or at least that’s what it started out at, but there are frequently huge discounts on Samsung’s phones only a few months after launch. So, don’t be surprised to see if going for less.",
    "Asus, meanwhile, doesn’t have firm pricing to compare to, as it hasn’t announced availability and local pricing for its new phone. The Asus Zenfone 8 will cost €599 in Euro regions, but we only have tentative pricing of an expected $599 (around £425 / AU$769) for the baseline 128GB storage and 8GB RAM model. That price would naturally be higher, potentially $799 (around £565 / AU$1,025), for the 256GB model with 16GB of RAM.",
    "The Asus Zenfone 8 could be a strong competitor to the Samsung Galaxy S21, particularly if it hits the lower price point Asus has estimated. The Galaxy S21 has a lot more versatility, and the tradeoff of the versatility for the minor reduction in size offered by the Zenfone 8 won’t be worth it for many. But making the same tradeoff for a considerable reduction in price seems absolutely justified, especially for those who won’t make much use of zoom photography or DeX mode."
  ],
  "headers": {
    "3": "Design",
    "8": "Display",
    "10": "OS and power",
    "13": "Camera",
    "17": "Price",
    "19": "Takeaway"
  },
  "links": {
    "Asus Zenfone 8": "https://www.techradar.com/reviews/asus-zenfone-8",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review"
  }
}