{
  "source": "https://www.techradar.com/news/battlefield-2042-devs-are-fixing-open-beta-issues-for-launch-and-unveil-new-specialists",
  "title": "Battlefield 2042 devs are fixing open beta issues for launch and unveil new specialists",
  "category": "gaming",
  "updated": "2021-10-21T15:26:09Z",
  "author": "hamish-hector",
  "summary": "Battlefield 2042's 10 specialists have now been revealed",
  "article": [
    "Battlefield 2042 is right around the corner, though even with the November 19 launch date looming Dice isn't done tweaking the game based on feedback from the open beta.",
    "We loved the overwhelmingly chaotic nature of the beta, but other fans faced problems with performance, were loaded into the wrong servers, had matches filled with too many bots, and found the UI lacking.",
    "In a lengthy update Dice has explained how - thanks to the open beta - it can hopefully help solve these issues and plenty of others so that players' experiences are as good as possible. While it hopes to have some problems fixed in time for the game's early access launch on November 12, Dice has said more changes should be made for the game's November 19 launch.",
    "While it doesn't promise you'll always load into your local region's servers you shouldn't be sent elsewhere anywhere near as frequently, and improvements to the game's lobby backfilling should mean you won't get dropped into a match filled with AI-controlled bots.",
    "As for performance and UI, Dice hopes players understand that the open beta build wasn't identical to what players will experience at launch. Because the build is based on an older version of Battlefield 2042 the game wasn't quite as polished in areas as the team might have liked and this led to some performance hiccups as a result.",
    "Additionally, certain UI features - such as 'Big Map' which show you where battles are taking place and squad mates are holed up and 'Commorose' which allows players to quickly notify teammates where they are and what they need - were missing from the build. These tools and others will be present when Battlefield 2042 launches and should help to keep the experience as smooth as possible.",
    "The HUD has been tweaked too to make it more useful - changing the layout slight so that the game's critical information is relayed to players in a more streamlined fashion.",
    "For now we have to take Dice's word on these changes being a major improvement to Battlefield 2042. Thankfully we don't have to wait much longer to find out if the game really is better than the open beta.",
    "One player concern that won't be going away though is the inclusion of specialists. Players have had mixed thoughts on Battlefield 2042's \"next evolution\" of the series' class system but Dice hopes that these five new roles will help to address those issues.",
    "The five new specialists are:",
    "These five plus the five specialist Dice had already revealed bring the game's total number up to 10, which is the total number that will appear in the game at launch.",
    "Dice hopes these new specialists and their abilities will help to address balancing concerns players had during the Battlefield 2042 open beta. The studio added that they hope the reveal of these new specialists will help address players' concerns over the game's balancing.",
    "The new specialists look awesome from the trailer above, and we can't wait to try them out when Battlefield 2042 launches in a few weeks."
  ],
  "headers": {
    "8": "The last five specialists revealed"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "We loved the overwhelmingly chaotic nature of the beta": "https://www.techradar.com/news/battlefield-2042-open-beta-is-overwhelming-chaos-in-the-best-possible-way",
    "lengthy update": "https://www.ea.com/games/battlefield/battlefield-2042/news/battlefield-briefing-what-we-learned-from-open-beta"
  }
}