{
  "source": "https://www.techradar.com/news/epic-games-is-considering-plans-for-a-fortnite-movie-says-report",
  "title": "Epic Games is considering plans for a Fortnite movie, says report",
  "category": "entertainment",
  "updated": "2021-10-11T16:43:25Z",
  "author": "axel-metz",
  "summary": "The sound of inevitability",
  "article": [
    "Fortnite developer Epic Games is mulling over an expansion into the entertainment industry – and is considering plans for a movie based on the popular battle royale game.",
    "The news comes by way of The Information, who claim that Epic is looking to diversify its properties in light of legal battles with both Apple and Google that have hamstrung its ability to make gains in the mobile market.",
    "If indeed the developer proceeds with said plans, a Fornite movie appears to be high up on the agenda. What’s more, a feature-length Fortnite film “has already been discussed,” according to the above report.",
    "Although an entertainment division doesn’t yet form an official part of Epic Games, a recent hiring spree corroborates claims that the developer is planning to enter the movie-making business.",
    "Earlier in 2021, for instance, Epic hired several executives from Lucasfilm. The most notable was Jason McGatlin, formerly vice president of Physical Production at Lucasfilm and now president of Special Projects at the Fortnite developer.",
    "McGatlin served as executive producer on all of the Star Wars movies released under the Disney umbrella since 2015. Could McGatlin prove the mastermind behind a feature film Fortnite adaptation? It’s not a hard reality to imagine, but we'll have to wait and see whether Epic officially moves ahead with anything in this vein.",
    "There are countless ways Epic could decide to adapt Fortnite into a movie, not least because countless movies have already been adapted into Fortnite themselves.",
    "Instead of opting for a conventional narrative approach to storytelling, then, a Fortnite movie might prove more successful (commercially-speaking, at least) as a Space Jam-esque mash-up of all the intellectual property Epic has already hoovered up in its pursuit of mainstream popularity.",
    "The game already plays host to on-screen superheroes like Batman, Superman, Black Widow and Spider-Man, beloved action heroes like John Wick and Master Chief and iconic villains like Venom and Predator. Then there are the myriad of celebrity appearances – LeBron James, Neymar Jr and Ariana Grande among them – which provide further potential for industry cross-over.",
    "Or, a Fortnite movie could play like a more traditional video game adaptation. The game itself has its own season-spanning storyline, after all, which has only grown more detailed thanks to cutscenes and campaign missions.",
    "That approach might not be seen as the taboo it once would have been, either. Recent history has seen the tide change on live-action takes on beloved digital IP. Take 2019’s Pokémon Detective Pikachu and this year’s Mortal Kombat, for instance, which were both surprisingly enjoyable feature-length adventures.",
    "Then there’s the popularity of Netflix’s The Witcher series – which itself spawned an anime spin-off and upcoming prequel series – and the in-development Borderlands movie and Twisted Metal and The Last of Us TV shows.",
    "The point being, in today’s creative climate, it’s no wonder that Epic Games might look to cash in on the big screen potential of its most successful property.",
    "Does that mean Fortnite: The Movie will be any good? We won’t hold our breath."
  ],
  "headers": {
    "6": "Analysis: What might a Fortnite movie look like?"
  },
  "links": {
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1244937461844502300&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Fepic-games-may-make-fortnite-movie-as-part-of-entertainment-expansion%3Firclickid%3DTMlTwaSgwxyLRwNxiAS6PRWLUkBXJLzNnUQuyI0%26irgwc%3D1%26utm_source%3Daffiliate%26utm_medium%3Dcpa%26utm_campaign%3D10078-Skimbit%2BLtd.%26utm_term%3Deurogamer.net&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fepic-games-is-considering-plans-for-a-fortnite-movie-says-report",
    "legal battles": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "Star Wars movies": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Mortal Kombat": "https://www.techradar.com/news/mortal-kombat-ending-explained-who-is-cole-young",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "upcoming prequel series": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect",
    "Borderlands movie": "https://www.techradar.com/news/borderlands-movie-cast-likely-release-date-and-what-we-know-so-far",
    "Twisted Metal": "https://www.techradar.com/news/anthony-mackie-to-star-in-tv-adaptation-of-classic-playstation-game",
    "The Last of Us TV shows": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show"
  }
}