{
  "source": "https://www.techradar.com/news/should-i-get-a-gopro-subscription-during-black-friday",
  "title": "Should I get a GoPro Subscription during Black Friday?",
  "category": "cameras",
  "updated": "2021-10-30T11:00:00Z",
  "author": "chris-rowlands",
  "summary": "It looks like the no-brainer way to get a GoPro, but is it?",
  "article": [
    "Thinking about buying a GoPro during the Black Friday deals? It's traditionally one of the best times to buy one of its action cams, but this year the decision comes with an additional conundrum – should you buy one with a GoPro Subscription?",
    "On the face of it, the decision seems obvious. Buying any current GoPro with a GoPro subscription nets you a big discount on the camera's standard price – for example, the GoPro Hero 10 Black is $100 / £100 / AU$150 cheaper when bought with a Subscription. And it could be even cheaper during the GoPro Black Friday sales.",
    "But what exactly are you signing up for with a GoPro Subscription and are there any downsides? With unlimited cloud backups, optional camera replacements and significant discounts on the latest GoPro accessories, it certainly seems a tempting offer – and may be something you've been considering buying separately.",
    "We’ve crunched the numbers to explain exactly what discounts you’ll get with a GoPro Subscription and whether you should sign up for one during the Black Friday sales. In the guide below, you’ll also find everything you need to know about taking out a membership, including the benefits and drawbacks – and whether you can expect extra savings during the GoPro Black Friday deals in 2021.",
    "GoPro launched its paid membership service as ‘Plus’ a few years ago, but only now is the action cam stalwart pushing hard for Subscription sign-ups.",
    "So what does a Subscription get you? The concept is simple: like Fitbit Premium or iCloud Plus, paying extra for a GoPro Subscription unlocks additional services, support and savings for your GoPro action camera.",
    "These premium features are meant to enhance your user experience and make it easier to focus on filming the fun stuff.",
    "A standalone GoPro Subscription costs $49.99 / £49.99 / AU$69.99 per year. There’s no option to pay in monthly installments, so you’ll need to stump up for the entire annual fee when you sign up.",
    "Alternatively, you can buy a camera like the latest GoPro Hero 10 Black and choose to ‘save with a 1-year GoPro Subscription’. Tick this box at checkout and GoPro will bundle an annual membership in with your purchase, automatically applying the discount and giving you access to all the benefits of a GoPro Subscription. Easy.",
    "What’s the catch? There isn’t one, really. Membership will automatically renew every 12 months. If you’re only in it for a one-off discount, you’ll just need to remember to cancel the subscription before it renews after a year, otherwise you’ll be charged the full annual fee. But the good news is that you can cancel at any time without a penalty.",
    "GoPro promises savings on GoPro gear of up to 50% with a Subscription. That’s a tempting proposition, but it’s worth noting the ‘up to’ part of that promise: the half-price discount doesn’t apply to everything on the GoPro store. So which GoPro products can you save money on with a Subscription?",
    "The biggest savings can be found on GoPro’s countless cases and mounts. Subscribers can claim a 50% discount on GoPro’s Floaty case for the GoPro Hero 10 Black (and 9/8 Black before it), for example. Similarly, members can pick up GoPro’s Protective Housing or Super Suit dive shell for half-price.",
    "A smaller but still significant discount of 30% is available on older mounts like the Chesty strap, the Fetch Dog Harness and the Jaws Flex Clamp, as well as various accessories – from the Adventure, Sports and Travel Kits to GoPro’s range of backpacks and sling bags. The 30% discount also applies to all of GoPro’s Mods. So if you’re looking to expand the skill set of your GoPro Hero 8, 9 or 10 Black, a Subscription will save you some useful cash.",
    "But what about the action cams themselves? For most people, the big appeal of a GoPro Subscription will be the chance to save on a GoPro camera – and there are certainly savings to be had. GoPro offers fixed-price discounts on the Hero 10 Black, the Hero 9 Black and the Max.",
    "For the Hero 10 Black, the discount technically offered to subscribers is $150 / £150 / AU$220. However, when you account for the cost of the annual Subscription required to claim the saving, the real reduction on the standard price is actually $100 / £100 / AU$150. Which is still a decent saving, especially as you get all the perks of a GoPro Subscription on top.",
    "You can also opt for the Hero 10 Black Accessories Bundle. That gets you the GoPro Hero 10 Black, plus a camera case, spare battery, Magnetic Swivel Clip, Shorty tripod and 32GB microSD card. The bundle is good value at full price, but Subscribers can save a further $100 / £100 / AU$130.",
    "As for the Hero 9 Black, the real-world saving for Subscribers is a less generous $50 / £50 / AU$70. But that still makes it worth ticking the box to sign up: not only are you saving money outright, but you’re also getting all those membership benefits for a year.",
    "Finally, a Subscription saves you $100 / £100 / AU$140 on a GoPro Max in real terms when you factor in the annual fee. GoPro was also offering discounts on the GoPro Hero 8 Black before, but these appear to have been disabled – either because GoPro would prefer you to purchase its latest models, or because the Hero 8 Black will soon be officially discontinued.",
    "Subscribers can purchase up to three discounted GoPro cameras per year. The savings are identical whether you’re signed in as an existing GoPro subscriber or you take out a membership at checkout.",
    "One of the key features of a GoPro Subscription is unlimited cloud backup. Members can save all footage shot with a compatible GoPro camera to the cloud, in full original quality. Subscribers can do this ether via the Quik app on their smartphone, through the GoPro web interface, or by configuring Auto Upload.",
    "Auto Upload will automatically save your latest clips to the cloud whenever your camera is within range of your home Wi-Fi and plugged in to a wall charger. It works with every GoPro model back to the Hero 5 and it means you no longer need to worry about manually offloading footage.",
    "Given the potential size of 4K video files, the offer of unlimited storage alone is enough to consider a GoPro Subscription – especially if you regularly record high-quality clips and don’t fancy filling your hard drive.",
    "A GoPro Subscription comes with the promise of ‘no-questions-asked camera replacement’. This sounds like a very good deal, especially if you’re planning to use your GoPro camera in particularly tough filming situations. But there are a few caveats to this offer.",
    "If you read the small print, you’ll see that subscribers in certain countries (including the USA, UK and Australia) are permitted to \"exchange up to two cameras per year for the same model\". The offer covers the GoPro Hero 5 and every GoPro released after that, including the Fusion and Max. It also cryptically states that \"fees apply\".",
    "Dig a little deeper and you’ll find that a \"trade-in fee\" is required to claim a replacement camera. For the Hero 10 Black and Hero 9 Black, the fee is quoted as $99. So you won’t be getting a fresh camera for free – you can find all of the fees listed on GoPro's camera replacement page.",
    "The camera replacement offer also doesn’t cover lost GoPro cameras, only damaged ones. You need to return your old, broken GoPro as part of the exchange – which you won’t be able to do if your action cam is somewhere in the sea.",
    "It’s also worth remembering that every GoPro camera is built to be tough. That, after all, is part of the appeal. If you’ve seen the YouTube video of a GoPro falling from an aeroplane, landing in a pig pen and surviving to tell the tale, then you’ll know that damaging GoPro’s action cameras is no easy feat. So you may never even need to use this optional replacement offer.",
    "As part of a GoPro Subscription, all of the premium editing tools, filters and royalty-free backing tracks are made available in the Quik app. Unlocking these normally requires a separate subscription, which would otherwise set you back $9.99 / £9.49 / AU$14.99 per year – or $1.99 / £1.79 / AU$2.49 per month.",
    "Whether this represents added value will depend on how much you use the Quik app to edit and compile clips. It’s certainly an easy way to tweak videos for social media and the premium tools give you greater options for accessible creativity. We've put together some more in-depth thoughts on GoPro Quik, if you want to know more about the app's premium tools.",
    "If you’re using a GoPro Hero 7 Black or later, you don’t need a membership to live stream to YouTube, Facebook or Twitch in 1080p. But your streams will be visible to anyone who follows you on those platforms.",
    "A GoPro Subscription changes that, allowing you to broadcast directly from the GoPro website. You can then share a unique link to your private stream with friends, family and your favorite fans. This makes streams easier to share and access directly, while keeping the audience limited to those with the link.",
    "With the annual Black Friday bonanza right around the corner, is it worth waiting for the sales before buying a GoPro with a Subscription? While it's too early to be definitive, the answer is most likely yes.",
    "If previous years are anything to go by, we’d expect to see significant discounts on all of GoPro's current range, including the GoPro Hero 10 Black, Hero 9 Black, Hero 8 Black and Max.",
    "For example, last year the best deal was on the GoPro Hero 9 Black accessory bundle – when bought with a subscription, its price came down to $349.98 / £329.98 (a saving of $200 / £200). Back then, its usual price was the same as the Hero 10 Black's is today. So it's possible we'll see GoPro's latest model come down to a similar price during this year's Black Friday.",
    "That said, we don't necessarily expect to see the cost of a standalone Subscription reduced. While this could happen, the more likely scenario is that members find themselves treated to greater savings on GoPro equipment, standalone cameras and bundles in its current range.",
    "Any savings offered to subscribers in addition to the discounts outlined above only makes a GoPro Subscription more worthwhile. We wouldn’t expect the deals to be reserved for new subscribers either, given that GoPro wants existing subscribers to continue claiming their allocation of three discounted cameras per year.",
    "So for the best GoPro Black Friday deals in 2021, there’s a good chance you’ll need a Subscription. If you don’t already own a GoPro camera, we recommend waiting a few weeks to see what savings GoPro has in store. You can then sign up for a Subscription at checkout to claim any discounts on offer. That also means your membership will only start when you order a new camera, so you’ll be able to make the most of it before it renewing or cancelling after a year.",
    "For those who already own a GoPro camera, you can make a case either way: wait and see what offers GoPro’s got planned, or sign up now to start enjoying the perks of a Subscription. You'll still be able to benefit from exclusive deals down the line either way.",
    "There’s really no question: a GoPro subscription is worth it if you’re planning to buy a new GoPro action camera. Besides all the added benefits of a membership, the outright savings make it a no-brainer. With discounts of up to $100 / £100 / AU$150 available on GoPro’s latest action cameras (after you’ve factored in the cost of a Subscription), there’s significant money to be saved by signing up.",
    "What’s more, you can cancel the annual Subscription at any time before it automatically renews after a year, so you won’t be locked into a long-term contract. Of course, GoPro is hoping you won’t do that – and there are several reasons why you wouldn’t.",
    "A Subscription isn’t cheap at $49.99 / £49.99 / AU$69.99 per year, but for unlimited cloud storage and automatic backup of full-quality videos, plus private live streams, access to the Quik app’s premium features and up to two damaged camera replacements per year (for a fee), it’s not a bad deal. Especially when you factor in the rolling offers, including the ability to buy three discounted GoPro cameras per year."
  ],
  "headers": {
    "4": "What is a GoPro Subscription?",
    "7": "How much is a GoPro Subscription?",
    "10": "1. Discounts on GoPros and accessories",
    "19": "2. Unlimited cloud storage",
    "22": "3. Damaged camera replacements",
    "27": "4. Quick app premium editing",
    "29": "5. Private live-streams",
    "38": "Is a GoPro subscription worth it?"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "GoPro Black Friday": "https://www.techradar.com/news/black-friday-gopro-deals-all-the-best-live-deals-including-25-off-the-hero-8-black",
    "GoPro's camera replacement page": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7352278847556826000/https://community.gopro.com/t5/en/GoPro-Subscription-Camera-Replacement-FAQ/ta-p/394296",
    "in-depth thoughts on GoPro Quik": "https://www.techradar.com/news/gopros-new-app-wants-to-be-your-one-stop-video-editor-for-a-price"
  }
}