{
  "source": "https://www.techradar.com/news/hidden-galaxies-a-doomed-mars-and-plenty-of-supernovae-drive-the-week-in-science",
  "title": "Hidden galaxies, a doomed Mars, and plenty of supernovae drive the week in science",
  "category": "appliances",
  "updated": "2021-09-25T01:00:00Z",
  "author": "john-loeffler",
  "summary": "Another space heavy week in the news",
  "article": [
    "In another week of space-filled science coverage, we got plenty of supernovae, one in the form of a long-standing science mystery and the other an unexpected discovery.",
    "We learned more about the institutional shake-up over at NASA as it reorganizes itself in preparation of a major push toward the Artemis moon mission – thanks in very large part to the success of SpaceX.",
    "This week also revealed two of the oldest galaxies in the universe, shrouded behind an nearly impenetrable wall of cosmic dust, and their discovery is upending what we know about the earliest moments of the universe's existence.",
    "Finally, we also learned in a new study of Martian meteorites that the Red Planet was condemned to become a barren desert planet before it even really finished forming, with implications for our search for life elsewhere in the galaxy.",
    "Let's get the bad news out of the way first: Mars was destined from the start to become a dusty, bone-dry desert of a planet, on account of its size.",
    "In a new study that examined potassium deposits in Martian meteorites, as well as other meteorites sourced to asteroids and the moon, a team from Washington University in St. Louis (WUSL) found a strong correlation between a space object's size and the speed at which water and other volatiles were lost over time.",
    "\"Mars’ fate was decided from the beginning,” said assistant professor of earth and planetary sciences at WUSL, Kun Wang. “There is likely a threshold on the size requirements of rocky planets to retain enough water to enable habitability and plate tectonics, with mass exceeding that of Mars.\"",
    "Wang and his fellow researchers believe that measuring an exoplanet's size should be an important factor when looking for life on other planets, since the presence of liquid water (we assume) is an essential ingredient to life on other worlds.",
    "NASA made news this week when it announced that it was giving the green light to private space companies to start establishing their own space stations in Low Earth Orbit, a plan that is expected to save NASA at least $1 billion a year.",
    "The International Space Station is scheduled to end its mission by the end of the decade at the latest, and with the success of SpaceX, NASA believes commercial efforts can take over the problem of managing stations orbiting the Earth. This will hopefully allow NASA to focus on bigger challenges, like sending the next crewed mission to the moon, establishing a permanent base there, and beyond.",
    "To that effect, NASA is splitting up the responsibility of crewed space operations into two new directorates to better manage its increasing responsibilities.",
    "In 1181 CE, Chinese and Japanese astronomers recorded the sudden appearance of a new star in the night sky that remained for sixth months before fading away. Known as the \"Chinese Guest Star\", astronomers have long believed it was a supernova that shined as bright as Saturn over the medieval astronomers, but unlike all other known supernova in the past millennium, the location of that supernova has eluded until this week.",
    "A new study now puts that supernova in the Pa 30 molecular cloud, and using the expanding wave of material in the cloud – travelling at 1,100 kilometers a second, or about 2,500,000 mph – as a guide, they worked backward to its origin. Dating it to about 1,000 years ago, this put the supernova in the right place at the right time to be the one observed by astronomers nearly a millennium ago.",
    "\"It is the only such event where we can study both the remnant nebula and the merged star [that triggered the supernova], and also have a description of the explosion itself,\" said University of Manchester Professor Albert Zijlstra, who led the team of astronomical detectives who solved the mystery.",
    "Astronomers looking for the earliest galaxies in the universe thought they had a good idea of how many there were and where they could find them, but if a newly discovered pair of galaxies are any indication, they are badly mistaken.",
    "The two galaxies are some of the most distant – and thus, oldest – galaxies ever identified, but more surprising was that they were almost entirely invisible owing to the amount of cosmic dust that was obscuring our view of them.",
    "\"These new galaxies were missed not because they are extremely rare, but only because they are completely dust-obscured,\" said Yoshinobu Fudamoto, an astronomer at Waseda University and the National Astronomical Observatory of Japan who discovered the galaxies in what appeared to be entirely empty space. \"It is possible that we have been missing up to one out of every five galaxies in the early universe so far.\"",
    "If true, then the earliest days of the universe were far more energetic and lively than we originally believed, which could have implications for our development of astronomical models of our universe today.",
    "Finally, a new paper published this week says that researchers trying to develop 3D maps of the Perseus and Taurus molecular clouds, located near their respectively named constellations, discovered a gaping, 500-light-year-wide cavity seemingly blown out of the Milky Way.",
    "\"Hundreds of stars are forming or exist already at the surface of this giant bubble,\" said lead author Shmuel Bialy, a postdoctoral researcher at the Institute for Theory and Computation at Harvard's Center for Astrophysics. \"We have two theories — either one supernova went off at the core of this bubble and pushed gas outward, forming what we now call the 'Perseus-Taurus Supershell,' or a series of supernovae occurring over millions of years created it over time.\"",
    "The spherical hole is perfectly located between the two molecular clouds, indicating that the two colossal, star-forming structures were once a single cloud that was essentially torn in two.",
    "\"We've been able to see these clouds for decades,\" said Catherine Zucker, a postdoctoral researcher at Harvard's Center for Astrophysics who led a separate, related study on the 3D mapping process the researchers used, \"but we never knew their true shape, depth or thickness. We also were unsure how far away the clouds were. Now we know where they lie with only 1 percent uncertainty, allowing us to discern this void between them.\""
  ],
  "headers": {
    "4": "Mars was doomed from the start",
    "8": "NASA reorganizes its space mission directorate and gives green light to private space stations",
    "11": "The 900-year-old mystery of the Chinese Guest Star finally solved",
    "14": "Two newly discovered galaxies show early universe was likely full of galaxies from the start",
    "18": "A massive supernova might have cut a 500 light-year-wide hole in the Milky Way"
  },
  "links": {
    "Mars was destined from the start": "https://www.techradar.com/news/mars-never-had-a-chance-new-study-says-red-planet-just-too-small-to-hold-onto-water",
    "announced that it was giving the green light": "https://www.techradar.com/news/nasa-reviewing-a-dozen-private-space-station-bids-that-could-save-the-agency-dollar1-billion-a-year",
    "Known as the \"Chinese Guest Star\"": "https://www.techradar.com/news/astronomers-finally-solve-the-mystery-of-a-famous-900-year-old-chinese-supernova",
    "a newly discovered pair of galaxies": "https://www.techradar.com/news/dawn-of-the-universe-might-have-been-bursting-with-galaxies-now-hidden-by-dust",
    "500-light-year-wide cavity seemingly blown out": "https://www.techradar.com/news/scientists-discover-500-light-year-wide-hole-in-the-milky-way-torn-open-by-a-supernova"
  }
}