{
  "source": "https://www.techradar.com/news/this-is-the-best-prime-day-deal-for-dog-lovers",
  "title": "This is the best Prime Day deal for dog lovers",
  "category": "smart-home",
  "updated": "2021-06-22T20:37:01Z",
  "author": "olivia-tambini",
  "summary": "Keep your pup happy with this Prime Day deal",
  "article": [
    "We're a team of dog lovers here at TechRadar, and we've been keeping our eyes peeled for Prime Day deals for our furry companions – and we've just found the best discount of the sales event so far.",
    "Amazon has slashed the price of the Furbo Dog Camera, bringing it down to its lowest price in the US, and within £3 of its lowest price in the UK. (Not in the US or UK? Scroll down for the best Furbo Dog Camera deals in your region.)",
    "Usually $169, you can now get the treat-tossing smart camera for just $118 in the US, saving you $51. Meanwhile, UK buyers can get the Furbo camera for £126, a reduction of £116 compared to its £245 RRP.",
    "For those not familiar, the Furbo Dog Camera allows you to keep an eye on your pooch when you're away from home, and even fling treats remotely, thanks to a handy app. Peace of mind for you, and a little company for your four-legged friend.",
    "If we didn't already have the Furbo Dog Camera at home, this is the Prime Day deal we'd be snapping up today.",
    "With a stylish design that can blend into any home, this pet camera is perfect if your dog is a little anxious about being left at home – and it lets you check in on them if you feel nervous about leaving them, too.",
    "The Furbo Dog Camera boasts HD video and gives you a 160-degree view of your room; the camera feed does have a slight lag, but it’s only a matter of seconds behind real-time. It also has night-vision, allowing you to see your pet in the dark – handy if you’re leaving your pet at home for a night out.",
    "A built-in treat dispenser allowing you to fling treats towards your pet by swiping your finger in the Furbo app.",
    "You can even use it to communicate with your pup. Two-way audio lets you speak to your pets while out and about, while real-time barking alerts send notification to your smartphone or tablet any time the camera detects the sound of barking.",
    "Even without the discount, the Furbo Dog Camera is a great purchase, especially if your dog has become accustomed to you being at home during the pandemic and you want to make sure they're settled when you're away.",
    "No matter where you live, you'll find all the lowest prices for the Furbo Dog Camera from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Furbo Dog Camera deals on Prime Day",
    "10": "More Furbo Dog Camera deals",
    "11": "More Amazon Prime Day deals in the UK"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "for just $118": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFurbo-Dog-Camera-Designed-Compatible%2Fdp%2FB01FXC7JWQ%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3814139407915811300-20",
    "for £126": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB01FXC7JWQ%3Fref_%3DOct_DLandingS_D_48422089_NA%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8984227443834708000-21"
  }
}