{
  "source": "https://www.techradar.com/news/ios-145-release-date-april-26-week-airtags",
  "title": "Your iPhone will get iOS 14.5 before you can buy a new iPad Pro",
  "category": "phones",
  "updated": "2021-04-20T18:46:28Z",
  "author": "david-lumb",
  "summary": "AirTags require devices running iOS 14.5 or iPadOS 14.5",
  "article": [
    "The iOS 14.5 release date has finally been revealed...sort of. After the Spring Loaded Apple Event on April 20, press releases confirmed the new iOS 14.5 as well as iPadOS 14.5 will launch in the last week of April.",
    "That's to get the updates out before the newly-announced Apple AirTags release on April 30, which require devices to run the latest iOS 14.5 and/or iPadOS 14.5 to use and set up.",
    "The purple iPhone 12 and iPhone 12 Mini, also revealed during the Spring Loaded event, will come with iOS 14.5 pre-installed.",
    "iOS 14.5 is the biggest update to the operating system since iOS 14 launched in late 2020, bringing new functionality and usability that will be especially useful in our mask-wearing present circumstances.",
    "The big upgrade allows users to unlock their iPhones using their Apple Watch – so long as the latter is unlocked, your iPhone will be, too, which is a helpful Face ID workaround when wearing a mask. It won't work for any other use of Face ID – you'll still need to show your face to authenticate bank apps and other security purposes.",
    "iOS 14.5 adds App Tracking Transparency, which requires App Store listings to disclose what kinds of data is tracked through each app. iPhones also get PS5 and Xbox Series X controller support, and Apple Maps get Apple Maps gets crowdsourced alerts, too.",
    "There are a couple Siri updates, too, like picking a new default voice and music player for the voice assistant. iPhone 11 models getting iOS 14.5 will be able to recalibrate their battery for more accurate readings, though it's unclear if other iPhones will get the feature later on (or if this is a problem affecting only one model).",
    "Via Engadget"
  ],
  "headers": {
    "3": "iOS 14.5: why get excited?"
  },
  "links": {
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "Apple Event": "https://www.techradar.com/news/apple-april-20-spring-event/news/apple-event-april-2021-live-blog",
    "purple iPhone 12": "https://www.techradar.com/news/apples-iphone-12-just-got-a-new-color-option",
    "Engadget": "https://www.engadget.com/ios-14-5-rolls-out-181112539.html"
  }
}