{
  "source": "https://www.techradar.com/news/amd-has-finally-toppled-intel-in-this-key-battleground",
  "title": "AMD has finally toppled Intel in this key battleground",
  "category": "computing",
  "updated": "2021-07-28T01:00:26Z",
  "author": "anthony-spadafora",
  "summary": "AMD appears to have taken the lead in workstation CPU sales",
  "article": [
    "If you're looking to buy or build a new workstation anytime soon, there's a high possibility that you may end up choosing a processor from AMD as opposed to Intel according to new sales data from Puget Systems.",
    "As reported by Wccftech, the US-based custom PC building company from Auburn, Washington recently released its sales and distribution reports for both its AMD and Intel workstations to reveal that AMD processors were present in six out of ten of the custom systems it sold in June of this year.",
    "July also looks to be a big month for AMD processors at Puget Systems according to a new blog post from the company's head product developer William George though the month isn't over quite yet.",
    "George provided further insight on his views regarding the ongoing battle between AMD and Intel in his blog post, saying:",
    "“AMD has done a fantastic job of competing with Intel on both performance and price in the last few years, which I hope to see continue for a long time. Intel has been fighting back, and their latest desktop chips give comparable or sometimes even slightly better per-core performance, but they still lag behind with regard to the number of cores available on both desktop and workstation-class processors.”",
    "While Puget Systems has been selling more processors from AMD than from Intel, other online retailers show a similar trend including Amazon. The ecommerce giant's list of the Best Sellers in Computer CPU Processors currently contains nine AMD processors and just one Intel processor in the eighth spot.",
    "The question remains as to whether or not AMD will continue to dominate the workstation processor market or if Intel's new chips will give the company's Threadripper Pro a run for its money but only time will tell.",
    "Via Wccftech"
  ],
  "headers": {
    "3": "Per-core performance vs number of cores"
  },
  "links": {
    "workstation": "https://www.techradar.com/best/best-workstations",
    "processor": "https://www.techradar.com/news/best-processors",
    "reported": "https://wccftech.com/amd-leads-workstation-cpu-sales-june-2021-intel-unable-to-keep-up/",
    "AMD processors": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "blog post": "https://www.pugetsystems.com/blog/2021/07/21/State-of-the-CPU-2191/",
    "ongoing battle between AMD and Intel": "https://www.techradar.com/news/amd-vs-intel",
    "Best Sellers in Computer CPU Processors": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBest-Sellers-Computers-Accessories-Computer-CPU-Processors%2Fzgbs%2Fpc%2F229189%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2819813454769887700-20",
    "Intel processor": "https://www.techradar.com/news/computing-components/processors/intel-processors-everything-you-need-to-know-1282987",
    "Threadripper Pro": "https://www.techradar.com/news/you-will-soon-be-able-to-buy-amds-most-powerful-processor",
    "Wccftech": "https://wccftech.com/amd-leads-workstation-cpu-sales-june-2021-intel-unable-to-keep-up/"
  }
}