{
  "source": "https://www.techradar.com/news/microsoft-edge-might-finally-be-adding-this-super-useful-feature",
  "title": "Microsoft Edge might finally be adding this super useful feature",
  "category": "computing",
  "updated": "2021-02-16T19:08:22Z",
  "author": "anthony-spadafora",
  "summary": "Widget support is coming to Edge",
  "article": [
    "Microsoft plans to add a number of new features including web widgets, tab search and an extension menu to its Edge browser in its next big update.",
    "While Google has long offered support for widgets in its Android mobile operating system, it appears that widget support will also be coming to Windows 10 via Microsoft Edge. At the moment, the software giant is currently testing out a news + weather widget that will include headlines directly from Bing’s MSN news feed.",
    "This new widget for Microsoft Edge will follow the same approach used by Microsoft in Windows 10’s upcoming taskbar news and weather feed which can show users a personalized briefing with popular stories based on their interests such as sports and finance as well as their location. Even with Edge closed, users will still be able to access the widget by clicking on the icon floating over their desktop and other Windows apps.",
    "As of now, Microsoft is only working on its news feed widget but the company is expected to introduce additional widgets later this year.",
    "Microsoft is also working on adding tab search to Chromium Edge as this feature is already available in Google Chrome.",
    "The company added support for vertical tabs to Edge last year and a new update to the browser will add the option for users to search for open tabs. Once rolled out, users will be able to access this feature by navigating to the browser’s top bar or by using the keyboard shortcut Ctrl + Shift + A.",
    "An extensions menu is also finally coming to Microsoft Edge and it is marked by an icon that looks like a puzzle piece. From here, you’ll be able to access all of your installed extensions or alternatively, you can pin them to the address bar for even faster access.",
    "Since making the switch to Chromium, Microsoft has continually updated Edge with new features and this latest batch will surely be welcomed by users looking to increase their productivity when using the company's browser.",
    "Via Windows Latest"
  ],
  "headers": {
    "4": "Tab search and extension menu"
  },
  "links": {
    "Edge browser": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "taskbar news and weather feed": "https://www.techradar.com/news/windows-10-taskbar-to-get-a-brand-new-feature-we-tell-you-what-its",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "vertical tabs": "https://www.techradar.com/news/you-can-now-access-vertical-tabs-in-microsoft-edge-heres-how",
    "Chromium": "https://www.techradar.com/news/microsoft-officially-launches-chromium-based-edge-browser-for-all-platforms",
    "Windows Latest": "https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/"
  }
}