{
  "source": "https://www.techradar.com/news/why-now-is-the-time-to-buy-godfall",
  "title": "Why now is the time to buy Godfall",
  "category": "gaming",
  "updated": "2021-02-16T11:52:28Z",
  "author": "tabitha-baker",
  "summary": "Finally a fair price",
  "article": [
    "I'll admit it, I was a sucker. I managed to scoop up a PS5 pre-order back in September and quickly turned my attention to the game that started it all. I bought Godfall on day one.",
    "That was $70/£70 I wouldn't see again, and while I didn't exactly experience buyer's remorse - it was still a visually stunning game to herald in a new generation at launch - I wouldn't recommend that anyone repeats my mistake.",
    "When the PS5 launched, I told anyone who asked not to buy Godfall now, at full price. It's not the blockbuster launch title everyone wanted it to be: it looks incredible and it's perfect for jumping into quick, exciting sessions for an hour or so at a time, but I found the main campaign a little short and felt it could do more to push the boat out in the direction of something new.",
    "It's perfectly good fun, but Godfall isn't a massive open world rich with narrative, and complex combat encounters. That's why I advised my friends not to buy Godfall at launch - but told them to definitely buy it when it, inevitably, drops its price. And that day is today.",
    "Amazon has cut the hack and slash looter down to just $39.99 in the US and £29.99 in the UK. That's the lowest price we've seen yet and one that makes a lot more sense for this title than the full $69.99 / £69.99 MSRP.",
    "In all likelihood, yes - Godfall may ultimately end up with a $29.99 price tag in the US in due course (though dropping below £29.99 in the UK might prove difficult). However, we don't know when that will happen, and if you've been waiting to get your hands on the title since those early PS5 announcement days but been put off by less-than-glowing reviews, it's not worth potentially waiting years for the sake of $10.",
    "$39.99 / £29.99 feels like a fair price for this game. There are so many hours packed in here, it'll have you settling in for a no-fuss hack and slash session well beyond the admittedly short campaign. Plus, if your friends have already taken the plunge, there's plenty of multiplayer content to keep you hooked as well.",
    "If you're still after the console itself, take a look at the latest PS5 restock updates for more chances to grab one. Or, if you're looking for more kit, take a look at the latest PS5 controller prices and Pulse 3D headset stock as well."
  ],
  "headers": {
    "5": "Will Godfall drop in price again?",
    "7": "More Godfall deals"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "$39.99 in the US": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FGodfall-PS5-Playstation-5%2Fdp%2FB08JF5HQF1%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1212563401195237400-20",
    "£29.99 in the UK": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FGearbox-Publishing-5060760881603-Godfall-PS5%2Fdp%2FB08JRD17BL%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1926167731318238000-21",
    "PS5 restock": "https://www.techradar.com/news/where-to-buy-ps5",
    "PS5 controller prices": "https://www.techradar.com/news/dualsense-ps5-controller-deals-price-sales",
    "Pulse 3D headset stock": "https://www.techradar.com/news/ps5-pulse-3d-headset-pre-orders"
  }
}