{
  "source": "https://www.techradar.com/news/apple-fitness-plus-vs-nike-training-club",
  "title": "Apple Fitness Plus vs Nike Training Club: choose the best workout service for you",
  "category": "appliances",
  "updated": "2021-06-30T08:22:15Z",
  "author": "rob-clymo",
  "summary": "Paid-for and free workout services go head-to-head",
  "article": [
    "Looking to get fit and don’t fancy the idea of a gym membership? There are a growing number of options that allow you to skip that route entirely, which makes a lot of sense given that gyms are often expensive and require an ongoing commitment to justify paying for a membership. What’s more, opening times at gyms have become increasingly sporadic as the coronavirus pandemic continues.",
    "Fitness services offer a refreshing variation on the workout theme, with the recently released Apple Fitness Plus subscription service taking on the mighty Peloton. There’s another major player in this fitness arena though, in the shape of Nike Training Club. Like the others, this is a subscription-based service that offers lots of workouts online, but now it’s completely free.",
    "We’ve already taken a look at how Apple Fitness Plus stacks up against Peloton, with an overview that took in the best of both options. How then does Nike Training Club Premium stand up when it’s put alongside Apple’s quite similar new service?",
    "There’s a lot to like about Apple Fitness Plus, especially if you’re an aficionado of the brand. You’ll need an Apple Watch to make the most of it, plus an iPhone, iPad or Apple TV so you can view the workout coaching online.",
    "If you’ve recently got yourself an Apple Watch then the subscription-based service looks to be pretty good value. It costs $9.99 / £9.99 / AU$14.99 a month or $79.99 / £79.99 / AU$119.99 annually. Better still, if you’ve already got the Apple One Premier bundle then it’s possible to make use of the service with Family Sharing for $29.95 a month.",
    "What’s more, purchases of the Apple Watch Series 3 or later since September 15 mean you can enjoy the service free for three months, while existing owners get the benefit of one month free.",
    "Nike’s expertise in producing fitness footwear and workout apparel makes Training Club an interesting option too, even more so if you’re a fan of the brand. Crucially, all Nike Training Club workouts, including those that used to be only available to Premium members, are now free for Nike members, after the company decided to waive subscription fees a few months ago due in part to Covid-19. It used to be a little more expensive than the Apple Fitness Plus package, but being able to use the Nike app for nothing means you’ve got nothing to lose.",
    "While early adopters have been heard to moan about how this move to free has resulted in a less exclusive array of workout content to choose from the decision has certainly opened up Nike’s offering to the masses. And, with gyms being out of bounds for many because they’re closed or too expensive the free route is a welcome one.",
    "In terms of workout options there are plenty to choose from with Nike Master Trainers tempting you with everything from HIIT classes, bodyweight sessions, yoga and cardio through to bodyweight and full gym workouts. The activity aspect is supplemented quite nicely with a selection of supporting features, such as tips on nutrition and wellness guides.",
    "The Nike app, available for iOS or Android, is the beating heart of this service, with its capacity for tracking progress during your workouts and keeping tabs on your fitness goals. There’s a touch of competitive fun on offer too as milestones you reach are marked with digital badges and trophies. Meanwhile, the range of workouts delivered range from short 15-minute burst sessions through to comprehensive hour-long workouts.",
    "Those online workouts lie at the core of both subscription services, with Apple Fitness Plus offering a constantly updated series of streamed videos. You can choose from strength, HIIT, yoga, cycling and treadmill sessions led by a professional trainer. The big bonus is if you’re already into Apple Music as there’s seamless integration and access to a mountain of tunes.",
    "Stats-wise you’ll be able to monitor key areas, such as heart rate and calories burned. Meanwhile, the rings system that’s also incorporated into your workouts adds an extra touch of dynamism to proceedings, highlighting achievements when you’re pushing yourself more than normal. The only thing is that the workouts are streamed, rather than live, which might take the edge off the appeal for some.",
    "You could perhaps level the same criticism at Nike Training Club. This features around 100 workouts, which are delivered in a streaming format like the Apple model. You’ll need to download the app and follow that by completing a primer quiz that aims to match you to videos that are best suited to your current level of fitness.",
    "What’s good about this is the way it sets you up with a plan of action and shapes your workouts as you progress. Work your way through an entire program and you’ll be fitter at the end of four to six weeks that’s for sure. Progress is measured as you sweat your way through the various stages and the practical thing about all this is you can request push notifications in order to ensure that you stick to the program.",
    "Nike’s concept also allows you to pick random workouts from its collection if you don't want to get tangled up in an ongoing plan. These are handy if you want to dip in and try something a little different, or concentrate on specific muscle groups. Nike’s all powerful brand appeal means there are options inspired by sporting heroes too such as Cristiano Ronaldo for example.",
    "Both of these workout options are worth a try, and with the Nike Training Club's premium workouts now being free it might be an idea to start with that one. It doesn't seem quite as slick as its Apple counterpart, with a few downsides. You’ll need to fiddle around a bit to watch it on a TV, for example, although Nike does have plenty of help to get you through any technical stuff.",
    "The Nike package doesn't have the same appeal for people who crave audio when they're working out. You can play music, but it’s not the seamless experience that you get with Apple, which has the added benefit of its Music service to boost the appeal. On another practical note, some of the Nike workouts expect you to have full-on home gym kit at your disposal. Great if you’ve got it, not so hot if you don’t.",
    "Conversely, there are still plenty of workouts that require little in the way of hardware, save for an exercise mat. Investing in some free weights will be a real boon though. Ultimately, both Apple Fitness Plus and Nike Training Club are appealing. But, the latter and its simple format, which doesn’t need you to part with any money makes it the one to start with.",
    "For something free it’s easy to forgive the Nike package any shortcomings it might have. Either way though it has to be said the Apple and Nike packages deliver a bit of a solitary experience. And that’s very different to something like Peloton where you’re effectively able to work out in a ‘live’ environment. That might prove to be a dealbreaker for some fitness fans who only really thrive when they’re working up a sweat in a competitive arena."
  ],
  "headers": {
    "3": "Apple Fitness Plus overview",
    "6": "Nike Training Club overview",
    "10": "Apple vs Nike features",
    "15": "Apple vs Nike verdict"
  },
  "links": {
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Nike Training Club": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1050003707613920400/https://www.nike.com/gb/ntc-app",
    "how Apple Fitness Plus stacks up against Peloton": "https://www.techradar.com/news/apple-fitness-plus-vs-peloton",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple Watch Series 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "The Nike app": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9496901122259933000/https://www.nike.com/gb/nike-app",
    "Apple Music": "https://www.techradar.com/reviews/apple-music"
  }
}