{
  "source": "https://www.techradar.com/news/brave-has-launched-its-own-search-engine-to-topple-google",
  "title": "Brave has launched its own search engine to topple Google",
  "category": "computing",
  "updated": "2021-10-19T21:00:12Z",
  "author": "anthony-spadafora",
  "summary": "Brave Search has exited beta and is now the default search engine in Brave browser",
  "article": [
    "Following a public beta for its new search engine back in June, Brave Software has announced that Brave Search is now officially available.",
    "Beginning today, the company's search engine will be the default for new Brave Browser users in the US, Canada and the United Kingdom. The company's search engine also replaces Qwant in France and DuckDuckGo in Germany as the default search engine for users of its browser in those countries.",
    "While existing Brave users will keep their chosen search engine as the default, they can also set Brave Search as the default search engine if they prefer. To do so, users will need to manage their search engine settings on Brave for Desktop, Android and iOS.",
    "CEO and co-founder of Brave, Brendan Eich explained in a press release how Brave Search provides a more privacy-focused alternative to other search engines, saying:",
    "“Brave Search has grown significantly since its release last June, with nearly 80 million queries per month. Our users are pleased with the comprehensive privacy solution that Brave Search provides against Big Tech by being integrated into our browser. As we know from experience in many browsers, the default setting is crucial for adoption, and Brave Search has reached the quality and critical mass needed to become our default search option, and to offer our users a seamless privacy-by-default online experience.”",
    "In addition to making Brave Search the default in its browser, Brave Software is also launching a privacy-preserving system for users to anonymously contribute data to help improve its search index called the Web Discovery Project (WDP).",
    "Users will need to opt-in to the WDP and the new project protects user privacy and anonymity by design so that contributed data cannot be linked to them or their devices as well as to a set of users to prevent deanonymization.",
    "At the same time, the WDP represents a fundamental shift in how a search index is built to serve relevant results to Brave Search users. Unlike with other search providers, the WDP is designed in such a way that all of the data it receives is unlinkable which makes it impossible to build profiles or sessions of project contributors.",
    "In order for a URL to be sent to the project it needs to visited independently by a large number of people and this is achieved by using the STAR cryptographic protocol. The WDP also runs automatically while a user is browsing the web so it requires no effort on the part of contributors.",
    "Interested users can test out Brave Search for themselves and contribute to the Web Discovery Project by upgrading Brave Browser to the latest version or heading to search.brave.com in the browser of their choice."
  ],
  "headers": {
    "5": "Web Discovery Project"
  },
  "links": {
    "search engine": "https://www.techradar.com/news/internet/20-search-engines-that-do-something-different-912541",
    "Brave Search": "https://www.techradar.com/reviews/brave-search-search-engine",
    "Brave Browser": "https://www.techradar.com/reviews/brave-web-browser",
    "Qwant": "https://www.techradar.com/reviews/qwant-search-engine",
    "DuckDuckGo": "https://www.techradar.com/reviews/duckduckgo-search-engine",
    "press release": "https://brave.com/search-and-web-discovery/",
    "search index": "https://www.techradar.com/news/google-reveals-more-on-how-it-helps-deliver-speedy-search-results",
    "build profiles": "https://www.techradar.com/news/google-chrome-wont-get-cookie-blocking-for-another-two-years",
    "browser": "https://www.techradar.com/best/browser"
  }
}