{
  "source": "https://www.techradar.com/news/how-to-watch-them-online-stream-the-new-amazon-prime-video-series",
  "title": "How to watch Them online: stream every episode of new Amazon Prime Video show now",
  "category": "computing",
  "updated": "2021-04-09T09:34:17.650Z",
  "author": "daniel-pateman",
  "summary": "Every episode of new anthology series is ready to stream today",
  "article": [
    "You, Us, IT, and now Them – proof that there’s something terrifying about pronouns. Amazon Prime Video’s new horror anthology series will deliver a different setup each season, with Them: Covenant providing the opening salvo of episodes about a Black family in 1950s America defending their home from apple-pie loving racists AND malevolent spirits. It looks like nail-biting stuff, and we detail below how to watch Them online.",
    "This 10-part instalment evokes modern horror classics like Get Out and Us, although it's more akin to Lovecraft Country in directly confronting America’s prejudiced past.",
    "Deborah Ayorinde plays Livia Emory, a young mother in search of a better life, who's recently moved from North Carolina to California with her husband Henry and their two children. But they get a hostile reception from their Caucasian neighbors, whose lily-white figurehead Betty (Alison Pill) tries to drive them from her suburban idyll.",
    "Henry Emory (Top Boy’s Ashley Thomas) is a WWII veteran oppressed by the double-standard of the all-white workplace, while daughter Ruby is cruelly taunted at school. Yet at home something equally troubling is unfolding: a supernatural force which only their youngest Gracie can perceive - like a creepy performer in blackface with bloodshot eyes.",
    "Also featuring True Blood’s Ryan Kwanten, Them: Covenant delivers edge-of-your-seat thrills, sterling performances, and an unvarnished depiction of mid-20th century race relations in America. So, read on as we detail how to watch Them online, and for FREE if you’re a new or returning Amazon Prime Video customer.",
    "If you're a Prime Video subscriber and find yourself stuck in a country where the service isn't available, or you can’t access the same content provided back home, then that's probably down to geo-blocking restrictions.",
    "Luckily, there’s a simple solution. Downloading a VPN will let you to watch Them online no matter where you are, simply by changing your IP address to one that's back in your country of residence. Now, here's how to get started with this essential bit of streaming software.",
    "More from Amazon Prime:"
  ],
  "headers": {
    "5": "How to watch Them from abroad"
  },
  "links": {
    "Amazon Prime Video": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FTHEM-Season-1%2Fdp%2FB08XXDRJKH%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2904985929344219600-20",
    "Lovecraft Country": "https://www.techradar.com/news/how-to-watch-lovecraft-country-online-stream-the-new-hbo-max-show-from-anywhere",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}