{
  "source": "https://www.techradar.com/news/in-major-reversal-russia-says-cosmonauts-cleared-for-spacex-crew-dragon-flights",
  "title": "In major reversal, Russia says cosmonauts cleared for SpaceX Crew Dragon flights",
  "category": "appliances",
  "updated": "2021-11-11T16:08:16Z",
  "author": "john-loeffler",
  "summary": "Roscosmos head concedes that SpaceX is safe for its cosmonauts",
  "article": [
    "The head of Russia's Roscosmos space agency conceded this week that SpaceX's Crew Dragon is safe for Russian cosmonauts to fly to the International Space Station.",
    "Dmitry Rogozin, Roscosmos' director general, made the announcement during a joint-press conference at the 72nd International Astronautical Congress in Dubai on October 25, and marks a major shift for Russian space officials.",
    "Roscosmos's position had long been that it didn't have enough confidence in SpaceX to put its cosmonauts on a SpaceX craft to ferry them to the International Space Station (ISS), but after two successful long-term crewed ISS missions – as well as the successful private commercial Inspiration4 flight in September – Roscosmos has come around on private space company.",
    "\"In our view, SpaceX has already acquired enough experience for us to be able to put our cosmonauts on Crew Dragon,” Rogozin said through a translator.",
    "The announcement clears the biggest obstacle to mixed crewed flights aboard SpaceX's Crew Dragon, something that Rogozin said he would discuss with NASA Deputy Administrator Pam Melroy during the Dubai conference, according to SpaceNews.",
    "\"I believe we will be in a position to discuss candidates who may be flying to the space station on board the Crew Dragon—Russian cosmonauts, and American astronauts who will be flying to the space station on Russian spacecraft,\" Rogozin said.",
    "Melroy said that the announcement was welcomed by NASA, who has been looking to exchange seats on the two nations' space craft to created \"mixed\" crews for the ISS.",
    "\"I believe we will be in a position to discuss candidates who may be flying to the space station on board the Crew Dragon—Russian cosmonauts, and American astronauts who will be flying to the space station on Russian spacecraft,\" Melroy said during the press conference.",
    "The announcement is big news for SpaceX, as it grows its client base beyond just NASA, with huge implications for its future development.",
    "While SpaceX is a private company separate from NASA, it is quickly becoming the de facto space flight arm of the US agency. This is especially true when it comes to crewed missions, as it is currently the only company certified to fly American astronauts into space after Boeing's ongoing issues with its Starliner CST-100 capsule.",
    "Adding Roscosmos to its roster of potential clients is a major coup for Elon Musk's space company, and with the announcement last month that NASA was clearing the way for private space station development in Low Earth Orbit, SpaceX's experience in this area is going to position it very well for future contracts with these other ventures.",
    "It's a lot for any one company to take on itself, so no doubt Boeing and United Launch Alliance will be major players here as well, but they will be playing catch up for some time while SpaceX will be at the helm for the foreseeable future."
  ],
  "headers": {
    "9": "Analysis: SpaceX continues to pull ahead as America's de facto space flight contractor"
  },
  "links": {
    "Inspiration4": "https://www.techradar.com/news/first-images-of-spacex-inspiration4-crew-in-orbit-reveal-their-window-onto-the-world",
    "SpaceNews": "https://spacenews.com/rogozin-says-crew-dragon-safe-for-russian-cosmonauts/",
    "Starliner CST-100 capsule": "https://www.techradar.com/news/nasa-boeing-scrub-starliners-iss-launch-at-last-minute"
  }
}