{
  "source": "https://www.techradar.com/news/pos-hardware-how-to-find-the-best-retail-equipment-for-your-business",
  "title": "POS hardware: how to find the best retail equipment for your business",
  "category": "pro",
  "updated": "2021-07-21T15:53:45Z",
  "author": "francesca-nicasio",
  "summary": "Wise up on the questions you should ask and factors to consider when buying POS hardware.",
  "article": [
    "Transactions that take place at the point of sale are powered by two key components: software and hardware.",
    "The software is the program that facilitates the point of sale process. It allows cashiers to ring up sales, and it records transactions and stock levels in the system. POS software is undoubtedly essential in any point of sale transaction, but it won’t function without the hardware.",
    "Think of it this way: software represents the brains of the POS process, while hardware serves as the body. You need both components to initiate retail transactions.",
    "We’ve previously discussed the ins and outs of POS software, so in this article, we’ll shed light on how to select the right point of sale hardware solutions for your business. You’ll learn about the factors you should consider plus some tips on finding the right equipment for your situation.",
    "Are you looking to upgrade your point of sale to a modern POS system and benefit from its modern features?",
    "Our retail experts and certified partners can help you find the best POS solution for your business, be it a restaurant, small business, or in general retail.",
    "To request a quote, just fill in the form below to start the process. It takes less than a minute.",
    "Here's how it works:",
    "When it comes to point of sale hardware, it helps to know your options. Here are the types of equipment usually involved in a POS hardware setup:",
    "POS display. The primary piece of equipment required to ring up sales is the point of sale display. This is the device on which cashiers will enter the information (e.g., product, pricing) to complete the transaction.",
    "POS displays can come in various forms, from a computer or laptop with a large screen to a handheld mobile device, like a smartphone.",
    "Barcode scanner. A barcode scanner is a device that can scan products into the POS system, so cashiers don't have to do it manually. Most barcode scanners these days are lightweight and can work with devices that have USB ports.",
    "Receipt printer. If you need to print out paper receipts, then your hardware setup should include a receipt printer. Most standalone receipt printers require a power source to be plugged into.",
    "Cash drawer. This device stores cash and is connected to the receipt printer. The cash drawer is triggered by the receipt printer towards the end of the transaction.",
    "Payment terminal. The payment terminal is the device you use to process debit and credit card payments. Customers tap, swipe, or insert their card into the device, then use the keypad and signature panel to move forward with the transaction.",
    "All-in-one devices. POS equipment comes in all shapes and sizes. And while each of the devices above can be obtained and set up on their own, there are also “all in one” POS equipment that can combine these hardware pieces into one device. For instance, there are a number of POS tablets in the market that have built-in payment terminals, scanners, and printers.",
    "Looking for more information on POS systems? Try these articles:",
    "How to choose a POS system",
    "How does a POS system work?",
    "5 ways POS systems help you manage staff",
    "As with shopping around for any business solution, you first need to figure out your specific needs. There are plenty of hardware options in the market, so evaluating your business requirements before shopping around for a solution will help you narrow down your search and make the process easier.",
    "Here are the top considerations to think about when buying POS hardware:",
    "POS equipment takes up physical space, so you want to ensure that your store has enough room to house your hardware. Have a look around your location and consider:",
    "Looking at the above will allow you to determine if you can have a full hardware setup or go with something that’s more compact.",
    "Let’s say you have a large fashion boutique with a dedicated checkout counter that’s roomy enough to have five people behind it. In this case, then you can opt to have a full hardware setup with a large monitor, complete with standalone devices and bells whistles.",
    "On the other hand, if you’re selling in a small booth at a farmer’s market, then you likely don’t have enough room for bulky equipment. In this case, you may be better off with a mobile device. You could use your smartphone and a small card reader that connects to the device, rather than a tabletop payment terminal.",
    "Next up, consider the size of your catalog. If you’re selling a few handmade pieces and generally deal with small basket sizes, then you likely don’t need to equip your store with a large monitor and barcode scanner, because you can easily search for products using your device.",
    "On the other hand, if you have a massive catalog and your products come in multiple sizes or colors, then you need hardware that makes it for you to add products to the sale. In this case, having a device that lets you scan barcodes is ideal, so you won’t have to manually search for items.",
    "You should also think about the environment where your sales take place. Are you inside a store that has a stable internet connection and power source? If so, having a workstation and plugged in devices will do the trick.",
    "On the other hand, if you’re always ringing up sales on the go, then you can do without standalone devices like receipt printers and cash drawers, and stick to a handheld device (i.e., phone or table) that can connect to a cellular network.",
    "Next up, consider your budget. POS hardware packages can range from $300 to $1,800 depending on the devices you select.",
    "When it comes to investing in hardware, the right amount largely depends on where your business is at. Industry data shows that small companies usually spend 6.9% of their revenue on IT (which includes software, hardware, and other technology products and services), so take this into consideration when setting your hardware budget.",
    "The state of your business is also an important factor. If you’re a new business that’s just starting out, then it may be prudent to use basic POS hardware first, then add bells and whistles as you grow. In doing so, you can free up money for more revenue-driving initiatives.",
    "On the other hand, if you’re highly profitable and have money to spend, then you can look into more sophisticated hardware solutions.",
    "Factor in the checkout experience that you want to offer your customers. This typically depends on your brand image as well as the types of customers you cater to.",
    "Brands that serve older shoppers, for example, may want to offer a traditional point of sale experience, which usually involves a cashier standing behind the counter, taking cash, and handing out receipts to customers.",
    "In these cases, tabletop point of sale devices — e.g., computers, cash drawers, and receipt printers — are recommended.",
    "On the other hand, if your customers appreciate modern experiences like mobile payments and wireless transactions, then you’ll gravitate more towards sleek tablets or credit card machines that accept mobile payments.",
    "Purchasing POS hardware for your existing needs is important, but don’t forget to consider the roadmap that you have for your business. Are you planning to expand your catalog? Do you want a bigger store going forward?",
    "If so, set your sights on equipment that can meet your needs in the future and help you keep up with the times.",
    "While there is a case for saving money and not buying unnecessary hardware, you should balance this out by being forward-thinking and considering what you’ll need down the line.",
    "For example, while you may be able to save money by buying an older model of a payment terminal, that decision may cost you even more if you need to update your equipment in the future.",
    "Already know the types of devices you need in your business? Let’s move on to the action steps you can take to find the right hardware solutions — and potentially save money in the process.",
    "Your POS software provider and payment processor can be reliable sources of information and referrals for point of sale hardware. Most of these companies have preferred partnerships with hardware vendors, so they can recommend solutions that not only fit your needs, but also work well with their solutions.",
    "It’s important to note that purchasing POS hardware ties in closely with choosing your point of sale software and payment processor. These entities work hand-in-hand and function better when tightly integrated.",
    "Much like when shopping around for a new personal gadget, doing your research on other people’s experiences can help you determine which products are right for you. So, read up on ratings and reviews of other merchants who are using the devices that you’re considering.",
    "If you’re curious to see how a piece of technology works, find ways to see it in action. Go to a local technology store so you can touch and feel the products yourself. If you know of merchants in your area who are using certain POS equipment, pay them a visit so you can see how the hardware works. You can also check out YouTube for video reviews and demos of the products.",
    "If you’re on a budget, you may be able to use devices that you already have. There are several POS solutions, card readers, and barcode scanners that can work with tablets and smartphones.",
    "If you’re switching payment processors and don’t want to purchase a new payment terminal, see if you can reprogram your existing credit card machines to work with your new processor. (This isn’t always possible, but it never hurts to give it a shot.)",
    "Point of sale hardware is an essential investment, so it’s important to determine your needs and do research on what’s out in the market. Hopefully, the pointers above help you figure out the right devices and hardware setup for your business.",
    "Good luck!"
  ],
  "headers": {
    "8": "POS hardware: what’s included?",
    "13": "The top factors to consider when buying POS hardware",
    "16": "Discover more about the benefits of POS systems",
    "42": "Tips to implement when shopping around for POS hardware",
    "49": "Ready for new POS hardware?"
  },
  "links": {
    "We’ve previously discussed the ins and outs of POS software": "https://www.techradar.com/news/how-to-choose-the-right-pos-system-for-your-business",
    "request a quote": "#section-request-free-quotes",
    "How to choose a POS system": "https://www.techradar.com/news/how-to-choose-a-pos-point-of-sale-system-for-a-restaurant-and-bar",
    "How does a POS system work?": "https://www.techradar.com/news/how-does-a-pos-system-work",
    "5 ways POS systems help you manage staff": "https://www.techradar.com/news/5-ways-pos-systems-help-you-manage-staff",
    "Industry data shows": "https://blog.techvera.com/company-it-spend"
  }
}