{
  "source": "https://www.techradar.com/news/microsoft-confirms-next-xbox-live-stream-but-dont-get-your-hopes-up",
  "title": "Microsoft confirms next Xbox live stream – but don't get your hopes up",
  "category": "gaming",
  "updated": "2021-09-15T11:17:00Z",
  "author": "vic-hood",
  "summary": "Xbox returns to Tokyo Game Show",
  "article": [
    "Microsoft has confirmed it will be hosting a live stream at Tokyo Game Show, but don't expect any big announcements or exclusives.",
    "In a post on Xbox Wire, Head of Xbox Asia Jeremy Hinton, confirmed that Xbox will return to TGS this year, with a \"virtual stream curated for players in Japan and across Asia\" taking place on September 30 at 6pm JST/ 10am BST / 5am ET / 7pm AEST/ 2am PT.",
    "However, Hinton emphasized that this stream will be a community event rather than an announcement showcase, largely providing regional updates on games.",
    "\"Expect a celebration with our Asia community and locally relevant updates, though no new global debuts should be expected,\" Hinton wrote. \"Tune in to see the latest regionally relevant updates on previously announced games coming later this year.\"",
    "While news that Xbox's Tokyo Game Show stream won't feature any big updates or announcements so somewhat disappointing, it's also not a huge surprise. Microsoft returned to Tokyo Game Show last year and ran a similar stream, focusing on Xbox community in Japan. It's nice to see from the company, showing that it still values its communities across the globe.",
    "It's good to see Microsoft focusing on Japan in particular, where Xbox previously hasn't been as successful as it has in other regions - due to a lack of sales and support from developers. However, it seems that bad luck is starting to change, as Hinton told IGN Japan that the company has \"seen phenomenal growth” in the last year, with a high percentage of sales coming from Japanese consumers – though it's unclear if that growth is linked with Microsoft's return to TGS in 2020. Microsoft needs to nurture that growth, then.",
    "While Tokyo Game Show may not see any big announcements or updates on upcoming Xbox titles, we expect that Microsoft will host another showcase in the coming months – ahead of the release of Halo Infinite in November."
  ],
  "headers": {
    "4": "Analysis: there will be more up Microsoft's sleeve"
  },
  "links": {
    "Xbox Wire": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-2143431644615167500&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F09%2F14%2Fxbox-returns-to-tokyo-game-show-2021%2Famp%2F",
    "IGN Japan": "https://jp.ign.com/xbox-series-x/52649/interview/xbox",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite"
  }
}