{
  "source": "https://www.techradar.com/news/google-chrome-brings-a-little-windows-11-sparkle-to-windows-10",
  "title": "Google Chrome brings a little Windows 11 sparkle to Windows 10",
  "category": "computing",
  "updated": "2021-11-18T12:51:54Z",
  "author": "darren-allan",
  "summary": "Rounded corners are now available in the browser, even for Windows 10 users",
  "article": [
    "Google’s latest version of its Chrome browser comes with an interesting change that lets you experience a bit of Microsoft’s Windows 11 redesign in Windows 10 – namely rounded corners.",
    "As Windows Latest spotted, Google has just pushed out Chrome 96 which comes with an experimental flag that any user can switch on if they wish. This gives Chrome menu boxes rounded corners rather than straight edges – and also adds a subtle drop-shadow effect to the boxes – as seen with Windows 11’s interface revamp.",
    "Even Windows 10 users can benefit from the new effects simply by turning on the flag for Chrome, which is done as follows:",
    "While this is still a change in testing – hence it being hidden within the flags section of the browser – it’s likely that we’ll see this fully introduced for the web browser in the not-too-distant future. Possibly with further embellishments in other parts of Google Chrome, to boot. As far as we’re concerned, this is a good thing, as we much prefer the modern rounded corner look, rather than straight edges.",
    "Chrome 96 also ushered in a bunch of other changes, and as ever there’s a healthy dollop of security fixes (25 of them in this case). Google has also made back and forward navigation quicker with recently visited sites, using the browser cache to boost performance, so everything will feel a little snappier in this respect (following hot on the heels of recent optimization work for Chrome on Android)."
  ],
  "headers": {
    "3": "Analysis: The (rounded) shape of things to come for Chrome?"
  },
  "links": {
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "Windows Latest": "https://www.windowslatest.com/2021/11/17/you-can-now-enable-windows-11-design-in-google-chrome-96/",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "web browser": "https://www.techradar.com/best/browser",
    "recent optimization work for Chrome on Android": "https://www.techradar.com/news/google-reveals-cunning-plan-to-give-chrome-a-speed-boost"
  }
}