{
  "source": "https://www.techradar.com/news/microsoft-is-making-its-software-greener-than-ever",
  "title": "Microsoft is making its software greener than ever",
  "category": "computing",
  "updated": "2021-05-26T00:20:51Z",
  "author": "anthony-spadafora",
  "summary": "Putting sustainability at the core of software engineering",
  "article": [
    "Microsoft is joining forces with Accenture, GitHub and ThoughtWorks to create a new foundation dedicated to putting sustainability and green initiatives at the core of software engineering.",
    "Software development has been front and center at the company's Build 2021 developer conference. However, Microsoft and other companies have begun to wonder how the future of the software industry will affect the environment especially with global data centers accounting for one percent of the world's electricity demand today and between three to eight percent in the next decade.",
    "To address the impact the software industry has on the global environment, Microsoft, Acenture, GitHub and ThoughtWorks have established a new nonprofit called the Green Software Foundation with the Linux Foundation and the Joint Development Foundation Projects LLC.",
    "The goal of the Green Software Foundation is to build a trusted ecosystem of people, standards, tooling and leading practices for building green software.",
    "The foundation itself was born out of a mutual desire and need to collaborate across the software industry when it comes to sustainability to contribute to the information and communication technology sector's broader targets for reducing greenhouse gas emissions by 45 percent by 2030 which is in line with the Paris Climate Agreement.",
    "President of Microsoft, Brad Smith explained why the software giant decided to become one of the founding members of the Green Software Foundation in a blog post, saying:",
    "“The scientific consensus is clear: the world confronts an urgent carbon problem. It will take all of us working together to create innovative solutions to drastically reduce emissions. Today, Microsoft is joining with organizations who are serious about an environmentally sustainable future to drive adoption of green software development to help our customers and partners around the world reduce their carbon footprint.”",
    "The Green Software Foundation is open to any organization with a shared commitment to sustainability and an interest in green software development principles which means we'll likely see other companies join the foundation soon."
  ],
  "headers": {
    "3": "Green Software Foundation"
  },
  "links": {
    "green initiatives": "https://www.techradar.com/news/microsoft-reveals-more-green-initiatives-including-new-planetary-computer",
    "Build 2021": "https://www.techradar.com/news/satya-nadella-how-microsoft-can-be-every-developers-best-friend",
    "Linux Foundation": "https://www.techradar.com/news/linux-foundation-launches-randd-division-to-investigate-open-source-opportunities",
    "Green Software Foundation": "https://greensoftware.foundation/",
    "Paris Climate Agreement": "https://www.techradar.com/news/apple-ceo-urges-world-to-adopt-stronger-climate-targets",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3468945432986108400&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fblog%2F2021%2F05%2F25%2Faccenture-github-microsoft-and-thoughtworks-launch-the-green-software-foundation-with-the-linux-foundation-to-put-sustainability-at-the-core-of-software-engineering%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-making-its-software-greener-than-ever"
  }
}