{
  "source": "https://www.techradar.com/news/android-12-will-make-it-easier-to-use-google-play-store-alternatives",
  "title": "Android 12 will make it easier to use Google Play Store alternatives",
  "category": "phones",
  "updated": "2021-05-20T09:46:53Z",
  "author": "rhys-wood",
  "summary": "Android 12 opens the floodgates",
  "article": [
    "Google has announced Android 12 will be more accommodating of third party installers and app stores. The update, currently being tested in the Android 12 beta, allows third party app stores to install apps and updates without requiring permission from the user.",
    "Reported by XDA-Developers, it appears that Google is aiming to make Android 12 a friendlier operating system for third party Google Play alternatives, allowing them to manage apps and updates without direct intervention from the user, much like the Play Store itself is able to perform with automatic updates.",
    "The official blog post detailing the Android 12 beta states that: “We’re also delivering on our promise to make third-party app stores easier to use on Android 12. You can find many of these features today in Android 12 Beta, available on Pixel and other devices.”",
    "On the surface, it might be easy to read this as a bit of a security concern for Android 12, especially when it comes to the thought of third party app stores installing updates without the user’s knowledge or permission. However, Google has stressed that third party alternatives will have to follow strict guidelines to allow for this functionality.",
    "For starters, third party app stores will have to first opt in to allow the feature to be used, and will only be available for devices operating Android 10 onwards.",
    "A specific “update packages without user action” permission will also need to be held by the store, indicating that some vetting on Google’s part will likely take place initially.",
    "This could be good news for Android users who frequently make use of third party installers and app stores already, particularly the Amazon App Store, QooApp and Samsung Galaxy Apps to name a few. It might also allow apps like APKUpdater to more easily install and update apps not officially available in the user’s home region."
  ],
  "headers": {
    "3": "A better Android experience?"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "XDA-Developers": "https://www.xda-developers.com/android-12-alternative-app-stores-update-apps-background/",
    "Google Play": "https://www.techradar.com/news/phone-and-communications/mobile-phones/what-is-google-play-1073348",
    "official blog post": "https://blog.google/products/android/android-12-beta/",
    "Android 12 Beta": "https://www.techradar.com/how-to/how-to-get-the-android-12-beta-on-your-smartphone"
  }
}