{
  "source": "https://www.techradar.com/news/the-best-dragon-quest-music-as-composed-by-the-late-koichi-sugiyama",
  "title": "The best Dragon Quest music, as composed by the late Koichi Sugiyama",
  "category": "gaming",
  "updated": "2021-10-07T17:00:25Z",
  "author": "rhys-wood",
  "summary": "A controversial industry legend has passed away",
  "article": [
    "Koichi Sugiyama, composer of the long-running and immensely popular Dragon Quest franchise, has passed away at the age of 90. Confirmed in a tribute post on the official Dragon Quest website, Sugiyama died of septic shock on September 30, 2021.",
    "While Dragon Quest has only enjoyed roughly a decade and a half of success in the west, thanks to the breakout hit that was Dragon Quest 8 on the PS2, the series has remained one of Japan's most popular for 35 years, and Sugiyama composed the score for all eleven games in the mainline Dragon Quest series.",
    "Sugiyama's musical contributions to the Dragon Quest series are recognizably whimsical. The series' main theme in particular is so iconic that it was played during the Tokyo Olympics 2020 opening ceremony among several other famous gaming themes.",
    "Several loveable songs composed by Sugiyama have appeared all across the series, including the charming menu theme and the sweeping orchestra that is Dragon Quest 8's overworld theme: Marching Through the Fields.",
    "Koichi Sugiyama's final contribution to the Dragon Quest series will be in the upcoming Dragon Quest 12: The Flames of Fate, which is due to release on Nintendo Switch, PS5, PS4 and PC at an as of yet unannounced date.",
    "And while the idyllic, carefree melodies that fill the Dragon Quest worlds are certainly among the series' most iconic tracks, it's hard not to bob your head to the series' numerous battle themes. Dragon Quest 8's general battle theme, War Cry, is perhaps one of the more well-known pieces in Sugiyama's repertoire, thanks in no small part to its energetic salvo of trumpets and marching percussion.",
    "However, even some of the series' earliest tracks sound like they were written for a big orchestra to perform, as demonstrated by Dragon Quest 3's phenomenal Fighting Spirit, performed here by the London Philharmonic Orchestra.",
    "Unfortunately, Sugiyama's work has been tarnished by some of the man's own views on political and societal issues. While he was undoubtedly musically gifted, his opinions often landed him in hot water.",
    "Sugiyama infamously denied the 1937 Nanjing Massacre, in which Japanese soldiers murdered hundreds of thousands of Chinese soldiers and civilians.",
    "The man drew ire in 2018 when he co-hosted a program with anti-LGBT politician Mio Sugita, whose views include axing the education of LGBT issues in schools across Japan.",
    "Such views are difficult to stomach for most, and they definitely take something away from Sugiyama's catalog of undeniably incredible work. But it's hard to imagine what the Dragon Quest series would sound like without Sugiyama's work, as it lends the series a distinctly whimsical flair that perfectly matches its cartoonish aesthetic and larger-than-life characters."
  ],
  "headers": {
    "7": "A talented man with controversial views"
  },
  "links": {
    "Dragon Quest website": "https://www.dragonquest.jp/news/detail/3546/",
    "Tokyo Olympics 2020 opening ceremony": "https://www.techradar.com/news/every-video-game-music-track-in-the-tokyo-olympics-2020-opening-ceremony",
    "charming menu theme": "https://www.youtube.com/watch?v=ZRLWgITdQtY",
    "Marching Through the Fields": "https://www.youtube.com/watch?v=KWh7Qg8JRvY",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "War Cry": "https://www.youtube.com/watch?v=kkZu8xj3lvs",
    "infamously denied": "https://kotaku.com/the-sad-story-of-a-japanese-gaming-legend-who-pretends-5901590",
    "Nanjing Massacre": "https://en.wikipedia.org/wiki/Nanjing_Massacre",
    "co-hosted a program": "https://kotaku.com/politician-made-anti-lgbtq-comments-on-dragon-quest-com-1827885043"
  }
}