{
  "source": "https://www.techradar.com/news/google-pixel-6a-camera-leak-reveals-it-may-have-a-tensor-chipset-like-the-pixel-6",
  "title": "Google Pixel 6a may have a Tensor chipset, just like the Pixel 6",
  "category": "phones",
  "updated": "2021-11-24T13:46:59Z",
  "author": "david-lumb",
  "summary": "The Google Pixel 6a’s cameras may not impress, but its Tensor chipset might.",
  "article": [
    "The first big Pixel 6a leak suggests exactly what we all hoped for: The next mid-range Google phone will have a Tensor chipset like those in the Google Pixel 6 and 6 Pro – potentially even the same one.",
    "The details of the leak come from 9to5Google’s investigations into the Google Camera app, which contains reference to a device internally codenamed Bluejay, supposedly a reference to the Google Pixel 6a. The good news, of course, is evidence that the phone will have the same Google Tensor GS101 chipset as the Pixel 6 (and not a variant – more on that below).",
    "That could mean the Pixel 6a would inherit all the features available only to the Tensor-powered Pixel 6 and 6 Pro, including Live Translation performed on the device, Google Assistant voice typing, and more. By extension, it should also get any other Tensor phone-only advancements coming down the line in future Android updates.",
    "Less exciting are the Pixel 6a camera details 9to5Google says it extracted – namely that the 6a will miss out on the Pixel 6’s 50MP 1/1.31-inch main sensor and instead have the same 12.2MP 1/2.55-inch Sony IMX363 primary sensor that helmed the company’s phones from the Pixel 3 to the Pixel 5a. The smaller sensor will capture less light and may have more noise and take poorer night photos than that in the Pixel 6.",
    "And fitting the recently released Pixel 6a render leaks, the phone will retain the visor-like camera block of the Pixel 6 and likewise have only two rear cameras, the main and ultrawide. The new leak claims the latter will have the same IMX386 sensor as the ultrawide camera on the Pixel 6, and the same 8MP IMX355 front-facing camera.",
    "In short, ultrawide and selfie shots taken by the Pixel 6a could look similar to images taken by the Pixel 6.",
    "Google’s investment in improving software and machine learning over hardware has allowed its new features and perks to trickle down easily to older Pixel phones ... until the Tensor chipset, which has on-device processing capabilities that enable the features we mentioned above, like Live Translation.",
    "But evidence emerged earlier in November that Google was experimenting with installing Tensor chipsets (potentially earlier versions) on 2020’s Google Pixel 5, according to XDA Developers. A developer known as Freak07 tweeted findings from diving into the Pixel 6 source and found kernel files for variants of the Tensor chipset, referred to internally as GS101.",
    "The variants were referred to as GS101-b0, which purportedly refers to the Pixel 6’s eventual Tensor chipset, and GS101-a0, which was linked to a device with an internal codename Whitefin. That codename had come up before: XDA’s Mishaal Rahman tweeted in late October that the name could be a cute mash-up of Redfin (codename for Pixel 5) and Whitechapel (codename for Tensor SoC).",
    "This could mean the Pixel 5 was originally meant to have Google’s in-house silicon, or that the company’s developers simply used the current flagship phone to refine Tensor’s integration to the Pixel platform while they were finishing the flagship Pixel 6.",
    "What does this have to do with the Pixel 6a? Thus far, we’ve only heard about one Tensor chipset, but news of the variants could suggest Google has experimented with multiple versions. That means the silicon that ends up in the next mid-range Pixel could have the same chipset as its flagship sibling and compete with it, much like the Pixel 4a 5G and Pixel 5 had such similar specs that we had a hard time recommending the pricier flagship. We’ll know more as further leaks give us a better idea of what’s coming with the Pixel 6a.",
    "Via Droid Life"
  ],
  "headers": {
    "6": "Analysis: too Tensor, or not Tensor enough?"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "9to5Google": "https://9to5google.com/2021/11/23/google-pixel-6a-specs-tensor-camera-downgrade/",
    "Tensor": "https://www.techradar.com/news/what-is-the-google-tensor-chipset",
    "render leaks": "https://www.techradar.com/news/the-first-google-pixel-6a-leaks-are-these-unofficial-renders-and-specs",
    "XDA Developers": "https://www.xda-developers.com/pixel-5-tensor-chip-google-testing/",
    "tweeted": "https://twitter.com/MishaalRahman/status/1453810037764280331",
    "Droid Life": "https://www.droid-life.com/2021/11/23/google-pixel-6a-specs-tensor-cameras/"
  }
}