{
  "source": "https://www.techradar.com/news/htc-vive-cosmos-elite-and-aurous-15g-bundle-let-me-put-high-end-vr-in-a-backpack",
  "title": "HTC Vive Cosmos Elite and Aorus 15G bundle let me put high-end VR in a backpack",
  "category": "gaming",
  "updated": "2021-01-07T12:07:01Z",
  "author": "gerald-lynch",
  "summary": "But don’t ditch your Quest 2 just yet...",
  "article": [
    "Virtual reality really has come a long way in recent years. From cumbersome headsets with lacklustre tracking that required monster processing power to run – and that’s before casting our minds back further to the gigantic VR arcade machines of the 1990s – we’re now at a point where even high-end virtual reality gear is compact enough to fit in a backpack – along with the computer to run it.",
    "Enter HTC, and its partnership with gaming laptop manufacturer Gigabyte. It’s bundling together a Vive Cosmos Elite VR headset with one of Gigabyte’s powerful Aorus 15G laptops, letting you go from naught-to-VR-immersion with one purchase.",
    "We had a lot of fun with the HTC Vive Cosmos Elite when we first tried it out last year. It’s one of the most advanced virtual reality headsets money can buy at the moment, and for good reason. Its 3.4-inch 2880 x 1700 resolution LCD display has a refresh rate of 90Hz, and offers a 1440 x 1700 image per eye – that’s an improvement over even the optics of the class-leading Valve Index (2880 x 1600), our current top-pick for high-end VR gaming overall.",
    "Comfortable to wear, and with a 110-degree field of view, the Cosmos Elite is no slouch, with HTC’s Viveport VR software library subscription (bundled here with two month’s free access) offering a ton of cool VR games and experiences to play with. And while built-in, inside-out tracking is convenient in its simplicity, requiring fewer cables or positioning of base stations which track your movements in VR, the Elite’s use of tracking stations is still the most responsive option, especially when moving your hands behind your field of vision.",
    "The Gigabyte part of the equation is equally impressive. Packing the mobile version of Nvidia’s RTX 2070 chipset, the laptop comes equipped with a 15.6-inch 240Hz display, 10th Gen 2.3GHz Intel Core i7 (with 5.1GHz boost clock) and 16GB of DDR4 memory. Its keyboard was the world’s first to be equipped with OMRON mechanical switches in a laptop, while the laptop features a mode optimised specifically for Vive VR gaming. At the laptop’s native Full HD resolution, those specs will make sure everything’s running buttery smooth, including in VR.",
    "Paired together, they make quite the combination. Whether you’re taking VR to a pal’s house (after the pandemic ends folks, yes), or simply taking it to a quiet corner of your home, a powerful laptop makes high-end VR far more viable. While I have a powerful desktop gaming PC at home, it’s an absolute monster in size and, being set up in a bedroom, there’s little room for ambitious VR play in terms of space. The Aorus 15G let me easily bring high end VR experiences to my living room (while still getting a few cheeky rounds of Civilization done in bed).",
    "It’s a great pairing then, and the performance was solid. Though Half-Life: Alyx isn’t available through Viveport, it’s easy enough to link the headset up through Steam VR, and the game ran without issue. To be able to walk around City 17, rendered all around you, just from a laptop, was astounding. The Gigabyte’s fans did start to kick up a few decibels, but it’s not noticeable when in the thick of a VR gunfight.",
    "But this bundle is pricey. You’re looking at a £2,749 price tag for the laptop and Elite headset (the bundle is only available in the UK and Germany at present, but that converts directly to around $3,736). That’s a lot of money – a little easier to stomach, perhaps, if you’re looking for both a capable PC gaming set up on top of the VR experience, and are coming in at a standing start without an existing PC gaming rig to hand. An option for the headset variant with inside-out tracking is available, but the whole point here, in our eyes, is getting that premium experience offered by the Elite package and its superior tracking.",
    "Mobile, untethered VR, on the other hand, is at a turning point – the Oculus Quest 2 was one of our 2020 gadgets of the year, offering a superb VR gaming experience without the need for a PC, while the Oculus Link feature lets you tap into PC gaming experiences with a simple USB-C connection. It too fits in a rucksack, and costs just £299 for the base 64GB model. Its wireless games challenge the quality of tethered VR, while you’ve still got the option to hook it up to a powerful rig for those superlative experiences. As an introduction to VR, and being one that can scale to accommodate PC play if your interest in virtual reality increases, it’s still our most recommended entry point.",
    "But if you’re ready to go all-in with PC VR, and have neither a headset nor gaming rig to build upon, the HTC Vive Cosmos Elite and Gigabyte Aorus 15G bundle is all you’ll need, and likely all you’ll want, to kickstart a premium VR addiction."
  ],
  "headers": {
    "2": "Virtual reality universality",
    "7": "Virtual fun, but a real bank balance blow"
  },
  "links": {
    "Vive Cosmos Elite": "https://www.techradar.com/reviews/htc-vive-cosmos-and-cosmos-elite",
    "Aorus 15G": "https://www.techradar.com/reviews/gigabyte-aorus-17g",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "Viveport": "https://www.techradar.com/news/viveport-infinity-unlimited-vr-for-the-price-of-a-netflix-subscription",
    "RTX 2070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070",
    "Half-Life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}