{
  "source": "https://www.techradar.com/news/apples-next-iphone-and-apple-watch-app-could-be-for-mental-health-but-what-will-it-do",
  "title": "Here's how the new Mind tool for Apple Watch and iPhone could work",
  "category": "fitness",
  "updated": "2021-06-07T10:18:50Z",
  "author": "cat-ellis",
  "summary": "Take a deep breath...",
  "article": [
    "We're expecting some big announcements at Apple's WWDC 2021 conference, and a new mental health app for iOS and watchOS could be on the cards. It appears to be called Mind, and although it could simply be a reworked version of the existing Breathe app, it might be something much bigger that lets you take control of your mental health, and offers professional guidance based on biometric data.",
    "We've seen a new emphasis on mental wellbeing as the pandemic takes a toll on mental health, and right now Apple is behind the curve. The Breathe app is about as basic as stress management gets; open it on your Apple Watch and select how long you'd like your session to last, then inhale and exhale in time with the animation presented on your device's screen.",
    "Once the session is complete, you can check how many times you've used the app during the week. It's very simple, and lags well behind the mindfulness tools offered by Apple's rivals. You can download third-party mental health apps from the App Store, but until now, the company's own tool is very limited.",
    "Many smartwatches and fitness trackers detect changes in heart rate throughout the day, and use this data as an indication of stress levels. This can be paired with other mindfulness tools to help make you aware of how you're feeling, and take action to calm yourself.",
    "For example, Mobvoi (the company behind the TicWatch series) has two mental health tools: TicZen, which measures stress using changes in heart rate, and TicBreathe, which leads you through a breathing exercise to help bring your heart rate back to normal.",
    "Fitbit devices have offered similar breathing tools for several years, and in 2020 the company went a step further with the Fitbit Sense – a smartwatch that uses electrodermal activity to monitor stress levels.",
    "The watch transmits a small electrical current through your skin, and detects changes in conductivity caused by adrenal activity. Essentially, the more stressed you are (physically or mentally), the more you sweat and the more conductive your skin becomes.",
    "After taking a stress measurement test, you'll be able to record any events or thoughts that may have affected your emotional state, and take suitable action.",
    "The Fitbit app also offers a range of mental health tools, and earlier this year the company also released a new series of guided mindfulness classes for Fitbit Premium subscribers, led by meditation expert Deepak Chopra.",
    "The Apple Watch 6 doesn't have an EDA sensor, so the new Mind app won't work on the same principle as the Fitbit Sense, but it could use data from the watch's ECG sensor. Clinical studies show that psychological stress can lead to arrhythmia (an unusual or irregular heartbeat rhythm), and it's possible that the new app may be able to detect and interpret these.",
    "Apple might also set itself apart with a more robust set of mindfulness tools than its rivals. Back in January, the company launched Time to Walk, which is an unusual twist on workout tracking. Rather than pushing you to exert yourself, it encourages you to take a casual stroll while a celebrity tells you a story about their life, and the importance of walking in their lives.",
    "It's possible that the new Mind app could use Apple's clout in a similar way, enlisting qualified mental health experts to provide expert advice to help you manage daily stresses and strains. It would be a huge step up from simple breathing exercises, and input from professionals would give Apple more authority than its competitors.",
    "Of course, this is all speculation for now, but the possibilities are very interesting, and there's never been a better time to explore them. We'll be keeping you abreast of all the latest news, including new mobile apps, with our WWDC live blog, so stay tuned for more."
  ],
  "headers": {
    "3": "What Apple's rivals are doing",
    "9": "What Apple could do differently"
  },
  "links": {
    "WWDC 2021": "https://www.techradar.com/news/apple-wwdc-2018-live-blog",
    "It appears to be called Mind": "https://www.techradar.com/news/new-privacy-controls-multitasking-features-and-a-mind-app-tipped-for-wwdc-2021",
    "TicWatch": "https://www.techradar.com/reviews/ticwatch-pro-3",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "guided mindfulness classes": "https://www.techradar.com/news/fitbit-launches-new-stress-busting-meditation-tools",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "psychological stress can lead to arrhythmia": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4624516/",
    "Time to Walk": "https://www.techradar.com/news/apple-time-to-walk-lets-you-take-a-stroll-with-a-new-celebrity-guest-every-week",
    "WWDC live blog": "https://www.techradar.com/news/apple-wwdc-2018-live-blog"
  }
}