{
  "source": "https://www.techradar.com/news/learning-the-piano-during-lockdown-how-tech-is-helping-me-cope",
  "title": "Learning the piano during lockdown: how tech is helping me cope",
  "category": "tablets",
  "updated": "2021-02-08T15:33:04Z",
  "author": "matt-hanson",
  "summary": "Got to do something constructive",
  "article": [
    "Annoyingly, when the clocks struck midnight on New Year’s Day, and 2020 thankfully made way for 2021, all the problems of the past year didn’t magically disappear as I’d hoped. The Covid-19 pandemic is still rampaging across the globe, and in the UK, we’re back in lockdown.",
    "That means I’m mainly confined to the same four walls that seem to get a little closer every day. It’s dispiriting and isolating, to be honest, and I need something to take my mind of the end of the world. So, I’ve decided to look into how tech can help me finally learn to play the piano.",
    "When the world first shut down last year, there was a lot of talk about people using lockdown as an excuse to learn new things, take up hobbies or get fit. I took the alternative route of getting dumber and fatter. While I don’t feel terribly bad at that choice – we all have different coping mechanisms – I did look on enviously as people better themselves.",
    "So, I want 2021’s apocalypse to be healthier and more positive than 2020’s apocalypse. Well, as healthy and as positive as an apocalypse can be. That means ditching the cookie-heavy diet and learn a new skill!",
    "So, why the piano? To be honest, I’ve always wanted to play it well, and as I type all day, I kind of think getting the hang of the piano may be a bit easier. I dabble a little bit – I know a few chords and have learned a few basic nursery rhymes to impress my 18-month daughter (didn’t work). Plus, I inherited an upright electric piano a few years ago, which I’m reasonably confident isn’t haunted.",
    "You may also be thinking, why use technology to help? After all, the greats, like Beethoven, Chopin and Elton John didn’t need to rely on tech and gadgets to learn their craft – so why should I?",
    "First, I’m not aiming for greatness. Mediocrity would be a good result. Also, I never really got on with the idea of music lessons, and with the current restrictions, I wouldn’t be able to go to them, anyway.",
    "But, there are some great tools now available that bring lessons into your own home, and let you learn at your own pace. Crucially, many apps and gadgets out there ‘gamify’ learning, helping to keep tech-obsessed people like me focused and interested.",
    "Some people may find that patronizing. Not me, though. I’m pretty stupid and have the attention span of a sugar-infused puppy.",
    "So, eager to get on with learning the piano before the world really does end, I’ve gathered together some cool tech to help.",
    "First up is the Lumi Keys, a stylish Midi keyboard that connects to the Lumi app, and teaches you how to play via videos and a Guitar Hero-like interface. The keys light up as the app teaches you basic piano skills and songs, and it’s one of the most beginner-friendly ways of starting out on a piano that I’ve seen.",
    "The app can be used on both Android and iOS devices, and while I had a quick dabble with Lumi connected to my smartphone, I’ve ended up using an iPad instead.",
    "So far, this has worked out much better. First of all, the larger screen of the iPad makes the app easier to use, and it also means the keys of the Lumi Keys correspond reasonably well to the keys shown on the app, which makes playing without looking at the physical keyboard a lot easier.",
    "Secondly, the iPad comes with the excellent Garage Band app, and this works really well with the Lumi Keys. This is because, at the moment, there isn’t a way to just mess around and try out your new skills in the Lumi Keys. By switching to Garage Band, I can play the Lumi Keys without any helping lights, which I’ve found can help cement the lessons I’ve learnt.",
    "My goal is to learn how to play the piano, and learn some new songs, using the Lumi Keys, then practise on them when I have spare time. Then, I’ll use my upright piano to apply what I’ve learnt.",
    "The Lumi Keys are handy as they are compact and easily portable (and can come with a protective case, which also doubles as a stand for your tablet or smartphone), which means I can quickly have a tinkle when the mood takes me, rather than trudging upstairs into the abandoned room where the definitely not haunted piano sits.",
    "One thing to note, though, is that the Lumi Keys doesn’t have built-in speakers – it needs to be connected via Bluetooth to a device running the app, or a Midi app like Garage Band.",
    "So far, I’ve been using the Lumi Keys and its app on and off for a week, and I’ve been enjoying it – though it is early days for both me and the Lumi service.",
    "What I mean by this is that while the app looks great, there are a few features that have yet to be included.",
    "I'm also eager to try out the new ways to display songs and lessons, including color-coordinated and traditional sheet music, as it would be good to learn how to read music as well. At the moment, it’s a bit too easy to rely heavily on the light-up keys of the Lumi, which means it’s easy to play a nice sounding song, but hard to remember.",
    "Some songs already support the 'ColorNote View' and 'Classic View' ways of playing songs using sheet music, so I'll definitely be trying those next.",
    "As I mentioned, there’s currently no way to practice songs you’ve learned in the app, which is why I switch to Garage Band straight after to practice the song without any help from the app. I find this makes it easier to remember the notes I need to play, but it would be good if there was a way to do that in the app.",
    "Lessons in the app, which mix videos of your instructors, with the Lumi Keys lighting up as they play, are really good, but I found in the early lessons they teach you an idea or part of a song, ask you to repeat it, then move on to something else, which doesn’t really help. Again, it would be good to have an option to replay a section of a song until you’re comfortable enough to move in. Instead, you need to replay the whole lesson, including the introductory video.",
    "But, these are all things I’m confident will get ironed out as the app matures – and it really is a very professional looking package, and the Lumi Keys themselves are fantastically built. You can also easily connect up more units to make for a longer piano, which snap together using magnets. It looks cool and would make learning to play using both hands a lot easier, but as each Lumi Keys is £299 (around $400, AU$540), it is also a very expensive way of learning to play.",
    "I’m also using a free Lumi Essential account at the moment, which includes over 60 lessons and 40 classic songs, and is great for beginners. I’m sure as I progress I’ll make the jump to Lumi Complete, which includes over 400 (and growing) contemporary and classical songs, and over 130 lessons, and which costs $79 a year (around £60, AU$105), or $6.67 a month (around £5, AU$10).",
    "I definitely feel like even after a week it’s having a positive effect. I’m practicing almost every night, and while I’m working my way through the early lessons, which I feel are aimed at beginners even newer to piano playing than me), I’m also taking time to use the app to learn Pachelbel's Canon, one of my favorite pieces of music. Ambitious, certainly, but the Lumi app features a simplified, and easy to follow, version that’s a great place to start."
  ],
  "headers": {
    "4": "Why?",
    "9": "The plan",
    "17": "Early days"
  },
  "links": {
    "Lumi Keys": "https://playlumi.com/?gclid=Cj0KCQiA0-6ABhDMARIsAFVdQv_6hFJSGxOOYnN_mBJAAL9EIUkI7vsX_tUAejvFFj-DXkefqfg3D0gaAs3yEALw_wcB",
    "Garage Band app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9727216254574584000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fgarageband%2Fid408709785"
  }
}