{
  "source": "https://www.techradar.com/news/google-pixel-6-gets-properly-advertised-and-extensively-leaked",
  "title": "Google Pixel 6 gets properly advertised and extensively leaked",
  "category": "phones",
  "updated": "2021-10-04T08:57:50Z",
  "author": "james-rogerson",
  "summary": "It's presumably coming very soon",
  "article": [
    "We’re expecting the Google Pixel 6 and Pixel 6 Pro to be fully unveiled soon, with October 19 looking likely, and Google is clearly ramping up for the launch, as it’s now started properly advertising the phones on YouTube and TV.",
    "Google Japan posted the video that you can see below, showing off the Pixel 6 and saying it’s “coming soon.” The advert doesn’t really show us anything new, but the fact that Google is advertising the phone at all suggests that it will land very soon.",
    "The Google Pixel 6 range isn’t just being advertised in Japan either, as we spotted a similar TV advert in the UK, though this one got a bit more specific in saying that the Pixel 6 is “coming this autumn” (which means anytime from now until the end of November). This is a time frame that we’ve heard before from Google, so again, it’s not new.",
    "As well as official Pixel 6 information, there’s also some leaked information, coming from ‘Panda is bald’ on Weibo (a Chinese social network).",
    "They claim that the Google Pixel 6 has a flat 6.4-inch FHD+ AMOLED screen with a 90Hz refresh rate, a 50MP main camera, a 12MP ultra-wide one, an 8MP front-facing one, a 4,616mAh battery, up to 8GB of RAM, and up to 256GB of storage.",
    "The Pixel 6 Pro meanwhile apparently has a curved 6.71-inch QHD+ AMOLED screen with a 120Hz refresh rate, the same rear cameras as the standard model, but with the addition of a 48MP telephoto snapper with 4x optical zoom, a 5,000mAh battery, up to 12GB of RAM, and up to 512GB of storage.",
    "Additionally, the Tensor chipset that we know powers both phones is said to have two high-power cores clocked at 2.8GHz, two cores running at 2.25GHz, and four power-saving cores clocked at 1.8GHz, with performance apparently being similar to the Snapdragon 870. That’s a high-end chipset, but not quite the best one available for Android phones.",
    "None of the details in this leak are new as this has all been leaked previously, and for the most part there are no dissenting voices on any of this, so there’s a good chance these details are accurate. But we’d still take them with a pinch of salt until the phones are official.",
    "While the Pixel 6 range hasn’t yet been fully announced, Google took the odd decision to reveal many aspects of the phones well in advance of the full announcement – hence why the advert above has full imagery of the Pixel 6.",
    "Leaks meanwhile have filled in most of the gaps, and while it’s not unusual for high-profile phones to leak before launch, at least with a normal announcement you can’t be certain that what you’ve heard in advance is right. Here though, many of the details came from Google itself, so we’re not expecting many surprises on October 19 (or whenever the Pixel 6 range lands).",
    "Perhaps the biggest remaining question is how much these phones will cost, as while there have been some price leaks, they haven’t referred to prices in the US, UK or Australia. Hopefully Google will be able to resist revealing that for a little longer, so that there’ll still be something worth tuning into at the unveiling.",
    "Via SlashGear and NotebookCheck"
  ],
  "headers": {
    "8": "Analysis: an announcement with nothing to announce"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "October 19 looking likely": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Japan": "https://www.youtube.com/watch?v=bXB5SN7euiQ",
    "Weibo": "https://share.api.weibo.cn/share/253863147.html?weibo_id=4687935692080048",
    "Tensor chipset": "https://www.techradar.com/news/google-pixel-6s-new-tensor-chipset-3-ways-it-may-top-apple-and-samsung-silicon",
    "SlashGear": "https://www.slashgear.com/pixel-6-video-ad-hypes-how-the-phone-makes-things-personal-03693707/",
    "NotebookCheck": "https://www.notebookcheck.net/Google-Pixel-6-Pixel-6-Pro-and-Tensor-details-fully-revealed-ahead-of-October-19-debut.568654.0.html"
  }
}