{
  "source": "https://www.techradar.com/news/internet-apocalypse-sure-but-inspiration4-is-also-go-for-launch-in-this-weeks-science-news",
  "title": "'Internet Apocalypse'? Sure but Inspiration4 is also go for launch in this week's science news",
  "category": "appliances",
  "updated": "2021-09-11T07:00:00Z",
  "author": "john-loeffler",
  "summary": "Climate change is, as ever, looming in behind all of it though",
  "article": [
    "Leading off the post-Labor Day science news this week were a couple of newly-announced launch dates for some historic space flights, as well as a new study that examines how a severe solar storm could trigger a months-long internet apocalypse.",
    "Inspiration4 set a tentative launch window for next week while the much-delayed James Webb Space Telescope is finally getting its own launch date for the end of the year.",
    "Speaking of space, a new study explored how an uncommon, but inevitable phenomenon caused by the sun could knock large regions or even entire continents off the internet entirely for weeks or even months, and how we need to prepare for the worst now.",
    "In the background though was climate change, and specifically how climate change is impacting our world faster than expected and in some surprising ways. A new study found evidence that some animals are growing bigger body parts in response to rising temperatures far faster than scientists realized – but still not fast enough to adapt to a changing climate.",
    "Then, there was the disturbing news that California's Dixie Fire is threatening the Allen Telescope Array and forcing an evacuation of its scientists and staff, disrupting the facility's important work in the search for extraterrestrial intelligence.",
    "All in all, a pretty full week, so let's dig in.",
    "Scientists and engineers have been worrying about a major solar storm for a long while now, but a new study by an assistant professor at the University of California, Irvine, spells out some of the very specific risks to our internet infrastructure.",
    "A solar storm – a fairly regular eruption of highly magnetized particles from the sun – isn't dangerous to humans (at least not directly), but it can wreak total havoc on electronics, knocking out entire power grids, and frying electronic devices in areas hit by these particles.",
    "What Sangeetha Abdu Jyothi found in the paper she presented to the SIGCOMM 2021 conference last month was that undersea telecommunications cables, the kind we use to connect the world to a single common internet, are especially vulnerable to a severe solar storm, and should we get hit by one, it could knock entire continents like North America and Europe offline for months.",
    "There are things we can do to mitigate the threat, though, but we have to act now because once we see a solar storm coming, it's far too late to do anything about it.",
    "The much delayed James Webb Space Telescope is finally getting a launch date for later this year, bringing the next generation observatory that much closer to unlocking the mysteries of the early universe.",
    "The telescope, now scheduled to launch from a European Space Agency spaceport in French Guiana on December 18, 2021.",
    "The space telescope, originally scheduled for an August 2020 launch, will fly into orbit aboard an Adriane 5 rocket, where it will then begin its complex deployment to the second Lagrange point far beyond the moon's orbit and unfurl its mirrors to the universe.",
    "Capable of seeing farther than any observatory ever created, the James Webb Space Telescope is expected to find the oldest galaxies ever formed during the early days of the universe. What else will it be able to see? That's what we're about to find out, starting on December 18, 2021.",
    "Inspiration4, the first ever all-civilian space flight mission ever attempted, received a preliminary launch window this week and will take off aboard a SpaceX Falcon 9 rocket no earlier than 8PM EDT on September 15.",
    "Being a preliminary launch window, it is obviously subject to change as conditions evolve, but the historic launch is nearly here. Make sure to bookmark our Inspiration4 page for updates on the launch and for a live stream of the event once it becomes available.",
    "In sadder news, a new study has found evidence that animals are responding to the fast-changing climate by changing the shape and size of their bodies – though this doesn't mean they are adapting to a warmer world.",
    "The study looked at warm-blooded animals and found larger beaks on birds and larger ears on mammals than samples taken from the same species decades ago, a product of something known as the Allen rule. According to this rule, animals that evolve in colder climates have shorter limbs and appendages than those that evolved in warmer climates to help regulate body heat.",
    "The researchers found that the most pronounced change was in Australian parrots, which saw an increase in beak size between 4% and 10% just since 1871.",
    "While 150 might seem like a long time, this is nothing in the usual geological timescales under which evolution operates. Unfortunately, scientists don't believe that these changes are happening fast enough to matter, or that these changes are even helpful for the species survival.",
    "There's even more climate change news this week, this time in the form of California's Dixie Fire, the second-largest wildfire on record in the state, which is now threatening to overrun the Allen Telescope Array (ATA).",
    "ATA is unique in that its primary function is to listen to the stars for the faint radio signals of alien civilizations, using 42 large radio antennas. These antennas are now under direct threat from the Dixie Fire, which as of the time of this writing is just 12 miles away from the facility and heading towards it.",
    "\"Anticipating the possibility that [the Dixie Fire] might reach the antennas, the observatory staff contacted the U.S. Forest Service’s Fire Department to prepare the site against eventual damage,\" the SETI Institute said in a statement. \"Two teams from the Forest Service, about a dozen people in total, removed brush from near the antennas. Trees in the area were pruned of any branches lower than ten feet above the ground.\"",
    "Here's hoping that disaster is averted for now, but unless we address the climate crisis, anything we do will just delay an even worse reckoning later."
  ],
  "headers": {
    "6": "The sun could knock the internet offline for months with a major solar storm",
    "10": "The James Webb Space Telescope finally gets a launch date this year",
    "14": "Inspiration4 is go for launch!",
    "16": "Climate change is forcing animals to 'shape-shift' to try to stay ahead of warming temperatures",
    "20": "Dixie Fire in California threatens SETI's Allen Telescope Array"
  },
  "links": {
    "very specific risks to our internet infrastructure": "https://www.techradar.com/news/the-internet-could-go-down-for-months-the-next-time-our-sun-has-a-tantrum",
    "James Webb Space Telescope is finally getting a launch date": "https://www.techradar.com/news/james-webb-space-telescope-finally-gets-a-launch-date",
    "received a preliminary launch window": "https://www.techradar.com/news/spacexs-inspiration4-launch-window-pushed-back-24-hours",
    "Inspiration4 page": "https://www.techradar.com/how-to/how-to-watch-inspiration4-launch-into-history-aboard-a-spacex-rocket",
    "changing the shape and size of their bodies": "https://www.techradar.com/news/animals-likely-shape-shifting-in-response-to-climate-change",
    "SETI Institute said in a statement": "https://www.techradar.com/news/million-acre-california-wildfire-threatens-allen-telescope-arrays-search-for-alien-life"
  }
}