{
  "source": "https://www.techradar.com/news/smartwatches-in-2021-might-be-designed-around-your-home-working-woes",
  "title": "Smartwatches in 2021 might be designed around your home-working woes",
  "category": "wearables",
  "updated": "2021-01-30T17:00:52Z",
  "author": "tom-bedford",
  "summary": "New features could be coming",
  "article": [
    "Since early 2020, the world has seen a number of changes. Some, we hope, are temporary – Covid-19 won’t last forever – but others may be permanent, such as a push towards remote working for many professionals. Technology follows people, so it’s no surprise that future smartwatches could be geared towards home working.",
    "Recently, we’ve heard some intriguing rumors regarding new features that could be coming to several top wearables in 2021. None are yet confirmed, but they paint a picture of what the market for smartwatches and fitness trackers could look like this year.",
    "In particular, some of these features appear to address some gripes we’ve experienced with working from home. Of course, they don’t offer a solution to isolation, the obliteration of circadian rhythms, stress, decimation of the barrier between work and personal life, or the financial concerns of remote working – but they can bring about small ‘quality-of-life’ improvements, so to speak.",
    "We’ll detail some of the modes below and the reasons they may prove useful, but note that these could just spell the beginning, with smartwatches and fitness trackers released through the year offering even more useful modes in a similar vein.",
    "Those who have been working from home for the past few months might have found it a struggle to concentrate to the same degree that they would in an office. Multiple studies have shown that an individual’s home-working proficiency is greatly dependent on the type of job they have and their own disposition. A 2018 study suggested that someone’s ability to succeed while working from home is dictated by their level of autonomy and emotional stability, while research conducted in 2012 suggested that home-working productivity depends on whether you’re doing ‘dull’ or ‘creative’ tasks.",
    "If your job or disposition means that you’ve found remote work a challenge, then you may also have been easily distracted by your smartphone, games consoles, other websites, desk decorations, snacks and drinks, or just the thoughts floating through your head. Concentration and focus are hard to maintain in such circumstances.",
    "It was for these reasons that the Pomodoro Technique was devised in 1985, although similar exercises existed before it. You begin by setting a timer for 25 minutes, for which time you focus and work hard. Once that time comes to an end, you enjoy a short break. You repeat this schedule a few times, with the break time extending after four iterations; then, the whole cycle resets.",
    "This simple method is said to help you complete tasks, keeping you focused but offering rewards in the form of regular breaks. It’s like interval training, but for mental activities.",
    "If the hindrance to concentration is your smartphone or other gadgets, however, then you might see the problem here. After all, you’ll be having to interact with your device regularly, setting and stopping timers, and you may find yourself ‘accidentally’ falling into a long Twitter thread or Reddit rabbit hole as a result.",
    "A recent leak suggests the upcoming Xiaomi Mi Band 6, an anticipated fitness tracker, could include a ‘Pomodoro Timer’, which is likely a digital way of enacting the Pomodoro Technique. Presumably, the band will notify you of each work period and break, and perhaps also mute notifications and hide the watch face for the duration of work.",
    "Including a productivity mode such as this on a ‘low-tech’ gadget such as a fitness tracker could be handy for people who struggle to concentrate at work. It would enable you to follow the Pomodoro Technique without becoming distracted, or confused by all the timers you need to set.",
    "Some smartwatches and smartphones offer similar concentration modes, such as the Zen mode on the OnePlus, and a few smartwatches that aren’t widely available like the Amazfit Bip U. But since the Pomodoro Technique is a proven method that rewards users with regular breaks, its appearance in a low-cost fitness tracker would be great news for those requiring a simple productivity tool.",
    "Another leak concerning the Apple Watch 5 and Samsung Galaxy Watch 4 suggests that both devices could get glucometers, used for measuring the blood sugar levels of wearers.",
    "This would be significant for diabetics, who need to constantly monitor blood sugar levels. The current method of measuring blood glucose is pretty invasive – it requires drawing blood – and alternatives are few and far between.",
    "But this article isn’t about diabetes. It’s about working from home, and it’s been suggested that the great shift to remote working has had a huge impact on diet.",
    "There’s little scientific study surrounding the Covid-19 lockdowns, working from home and diet, as a result of it being so recent. “It is currently unknown how a worker’s place of work may affect time devoted to food-related activities,” according to one scientific review – so, admittedly, much of our evidence for this is anecdotal.",
    "However, the link between stress and eating junk food has been documented. This 2017 study also noted that good sleeping habits can positively impact stress-eating behaviour – which would be less of an issue if, for many, our beds weren’t also our home-working desks.",
    "There’s likely a large number of people reading this article right now who may have found that the lockdowns and changes to daily structure have affected their eating habits.",
    "As such, your blood sugar could be in flux – maybe a result of excessive snacking, or even missing meals due to stress and anxiety, which could be quite harmful.",
    "Having high or low blood sugar is linked to a range of conditions (for example, low blood sugar could trigger a migraine) and each could result in symptoms that can range from uncomfortable to scary. This is the reason a portable, easy-to-use glucometer would prove a useful tool for people, reminding you to eat a snack, or lay off the sugary drinks, if your body doesn’t.",
    "There are currently a few bespoke health-focused wearables available on the market that supposedly work as glucometers, but none are also fully functioning smartwatches, so the implementation in a Samsung Galaxy or Apple Watch would get such a tool into far more peoples’ hands (or on their wrists)."
  ],
  "headers": {
    "4": "Pomodoro Technique",
    "12": "Blood sugar tracking"
  },
  "links": {
    "2018 study": "https://www.sciencedaily.com/releases/2018/09/180920102155.htm",
    "research conducted in 2012": "https://www.sciencedirect.com/science/article/abs/pii/S0167268112000893",
    "recent leak suggests the upcoming Xiaomi Mi Band 6": "https://www.techradar.com/news/xiaomi-mi-band-6-leak-suggests-gps-smart-home-controls-and-concentration-modes",
    "Amazfit Bip U": "https://www.techradar.com/reviews/amazfit-bip-u",
    "both devices could get glucometers": "https://www.techradar.com/news/apple-watch-7-and-samsung-galaxy-watch-4-both-could-get-potentially-life-saving-new-feature",
    "according to one scientific review": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1378845021677917400&xs=1&url=https%3A%2F%2Flink.springer.com%2Farticle%2F10.1007%2Fs11150-020-09497-9&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsmartwatches-in-2021-might-be-designed-around-your-home-working-woes",
    "2017 study": "https://www.sciencedaily.com/releases/2017/06/170622103827.htm"
  }
}