{
  "source": "https://www.techradar.com/news/taboola-spends-dollar800m-to-bring-ecommerce-to-the-open-web",
  "title": "Taboola spends $800m to bring ecommerce to the open web",
  "category": "computing",
  "updated": "2021-07-23T18:30:44Z",
  "author": "anthony-spadafora",
  "summary": "Connecting editorial content with product recommendations",
  "article": [
    "The content discovery and online advertising company Taboola has announced that it has entered into a definitive agreement to acquire Connexity from the Symphony Technology Group for $800m.",
    "While Taboola allows websites and apps to monetize their content through its AI-driven recommendations that show related stories at the bottom of news articles, Connexity powers customer acquisition for some of the world's top brands including Walmart, Wayfair, Skeechers, Macy's, eBay and Otto.",
    "Through its relationships with premium publishers including Condé Nast, DotDash, Hearst, Vox Media, Meredith, and News Corp Australia, Connexity is able to reach over 100m unique shoppers each month without having to rely on third-party cookies. At the same time, the company's technology allows publishers to seamlessly integrate more than 750m product offers on their websites to provide a significant revenue stream.",
    "CEO and founder of Taboola, Adam Singolda explained how the acquisition will enable the company to help merchants break free from walled gardens in a press release, saying:",
    "“The rise of social commerce proves the value of commerce alongside content, and with Connexity, Taboola is primed to bring this value to the open web. e-Commerce is the future of the open web, consumers will be buying outside of Amazon, on publishers’ sites next to trusted editorial content a lot more than they are today. Amazon has millions of merchants, but merchants mainly have Amazon. That changes today. Combining Taboola and Connexity’s technologies is one step forward in creating an alternative to walled gardens.”",
    "Taboola and Connexity share a lot in common and the acquisition aligns with Taboola's “Recommend Anything” growth strategy centered around introducing new types of recommendations while entering new segments.",
    "The acquisition will also empower a new type of advertiser to connect with Taboola's global audience across the open web while providing publishers with an additional way to drive revenue growth by tapping into the $35bn US ecommerce market as well as the larger global market.",
    "By leveraging its technology and Connexity's retail expertise and index, Taboola will be able to introduce a new type of recommendation that connects editorial content with product recommendations so that readers can easily purchase products related to the stories they're reading.",
    "This will be Taboola's fifth acquisition and once complete, it will add more than 200 people to the team including Connexity CEO Bill Glass who will lead the newly formed business unit at the company alongside his former management team."
  ],
  "headers": {
    "5": "Personalized ecommerce recommendations"
  },
  "links": {
    "Taboola": "https://www.techradar.com/news/taboola-announces-multi-billion-merger-and-plans-ipo",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "third-party cookies": "https://www.techradar.com/news/adobe-wants-to-help-businesses-survive-the-death-of-third-party-cookies",
    "press release": "https://www.taboola.com/press-release/taboola-acquires-connexity",
    "ecommerce market": "https://www.techradar.com/news/us-ecommerce-could-be-a-trillion-dollar-market-by-2022",
    "product recommendations": "https://www.techradar.com/news/google-cloud-is-launching-an-ai-recommendation-engine-for-online-retailers"
  }
}