{
  "source": "https://www.techradar.com/news/microsoft-teams-is-doubling-down-on-this-seriously-underrated-feature",
  "title": "Microsoft Teams is doubling down on this seriously underrated feature",
  "category": "computing",
  "updated": "2021-02-25T11:01:00Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams update will deliver a range of upgrades for the meeting polls feature",
  "article": [
    "Microsoft is planning a significant overhaul to an underrated Teams feature that allows meeting hosts to poll attendees in real-time.",
    "Over the last two days, Microsoft has published multiple entries to its product roadmap that set out a variety of tweaks to the Teams polling service.",
    "For starters, Teams will soon begin to offer up suggested polls, based on both the meeting purpose and polls the user has created in the past. In a similar vein, the service will suggest specific options for different questions, where applicable.",
    "Microsoft will also introduce a new question type, called “open text”, which will allow meeting hosts to collect open-ended information from attendees.",
    "The final changes relate to the analysis of poll data, after a call has ended. According to the roadmap, Teams will collect the most common text phrases used in open responses, to give hosts snapshot insight. And if a poll of any kind has been activated during a meeting, Teams will automatically deliver a summary report to organizers and presenters.",
    "These new features are all still under development, but should roll out to Teams users over the course of the next couple of months.",
    "First launched in November last year, the meeting polls feature built upon an existing survey option for chats and channels. The intention was to give hosts a means of bringing all meeting attendees into the conversation, counteracting the tendency for a loud minority to dominate video calls.",
    "“We are pleased to announce new poll integrations with Microsoft Teams that will enhance the remote collaboration experience before, during and after meetings,” said the firm when the feature was first announced.",
    "“Polls have been a convenient way to quickly gather feedback in the Teams chat pane. Now, we are bringing the power of polls to meetings, helping you conduct more engaging, informative and productive meetings.”",
    "The integration allows hosts to create polls prior to a meeting, from within a dedicated tab, or in an ad hoc manner once a meeting has already kicked off.",
    "These polls can be launched from any of the various Teams clients (for desktop, smartphone or web browser) and the results are published in real-time both on-screen and in the meeting chat log.",
    "Many people struggle to make themselves heard during calls and others find it difficult to stay engaged, in part because of video conferencing fatigue brought about by the pandemic, but Microsoft says the poll feature can provide a way to “turn passive listeners into active participants”.",
    "As the range of new polling options demonstrate, the firm has confidence in the long-term potential of the feature to breathe life back into remote meetings, which for many people became stale months ago."
  ],
  "headers": {
    "6": "Microsoft Teams polls"
  },
  "links": {
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "poll": "https://www.techradar.com/best/best-qanda-and-polling-platforms",
    "multiple entries": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-6760107117263456000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3DMicrosoft%2520Teams%26searchterms%3Dpoll",
    "video calls": "https://www.techradar.com/best/best-video-conferencing-software",
    "desktop": "https://www.techradar.com/news/best-business-desktop-pcs",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "web browser": "https://www.techradar.com/best/browser"
  }
}