{
  "source": "https://www.techradar.com/news/netflix-has-tons-more-new-comic-book-movies-and-tv-shows-in-the-works",
  "title": "Netflix has tons more new comic book movies and TV shows in the works",
  "category": "entertainment",
  "updated": "2021-05-07T09:44:15Z",
  "author": "samuel-roberts",
  "summary": "Netflix doubles down on comic book adaptations",
  "article": [
    "Netflix has finally released Jupiter's Legacy today, the first adaptation of a comic book by Kick-Ass co-creator Mark Millar since it bought his media empire Millarworld back in 2017. But that's not all the streaming service has in the works from Millarworld – a total of four TV shows are at various stages of production, including a brand-new spy series that Millar says is vastly different from his existing Kingsman comic.",
    "This spy series will be a six-episode show, written by a person who Millar describes as \"someone I’ve been a massive fan of for two decades, and he was the only person I approached\". Millar hypes that it could be one of the \"biggest franchises\" he's ever created.",
    "Netflix is also moving ahead with an adaptation of his fantasy series The Magic Order, which was originally put on hold amid the pandemic last year. Millar's American Jesus is also in development, while the anime adaptation of his crime caper Supercrooks is releasing later this year – the animation for that comes from My Hero Academia studio Bones.inc.",
    "In addition, five movies are in different stages of development at Netflix, based on his comics– and they all sound relatively early on. Afterlife fantasy drama Reborn is currently being written, with director Chris McKay set to make the film – he's also the director of Amazon's upcoming The Tomorrow War. Movies based on his books Empress, Huck, Sharkey the Bounty Hunter and Prodigy are all in the works, too.",
    "Millarworld was an intriguing acquisition for Netflix – it sounds like the streamer is finally making the most of owning all those comic books.",
    "While Jupiter's Legacy is a superhero series, many of Millar's other books cross into different genres, leaning into the talents of the superstar artists who co-created the comics with the writer.",
    "That means that when these adaptations finally surface on Netflix, they'll all look and feel so vastly different from one another that it won't be like another Marvel or DC – rather they'll be enhanced by having the source material to draw from.",
    "Having Millar in-house at the streamer, meanwhile, should keep the quality of each one in check."
  ],
  "headers": {
    "5": "Beyond superheroes"
  },
  "links": {
    "Amazon's upcoming The Tomorrow War": "https://www.techradar.com/news/amazon-prime-video-just-landed-another-big-new-movie"
  }
}