{
  "source": "https://www.techradar.com/news/rhel-is-now-free-for-small-production-workloads",
  "title": "RHEL is now free for small production workloads",
  "category": "computing",
  "updated": "2021-01-22T10:13:39Z",
  "author": "mayank-sharma",
  "summary": "The move comes in response to the shuttering of CentOS",
  "article": [
    "In another interesting development in the ongoing CentOS saga, Red Hat has changed the licensing terms for its Red Hat Enterprise Linux (RHEL) product to allow it to be used for free in up to 16 production servers.",
    "A no-cost RHEL was earlier available through a special program for developers, but limited to a single workstation. The popular open source vendor has now expanded the terms of the scheme to cover over a dozen production systems.",
    "“This isn’t a sales program and no sales representative will follow up. An option will exist within the subscription to easily upgrade to full support, but that’s up to you,” the company announced.",
    "Red Hat acknowledged that this announcement is the result of the feedback it received from the community after they decided to axe CentOS and instead focus on CentOS Stream.",
    "There are several high-profile forks of CentOS in the works and Red Hat couldn’t have missed the amount of support they’ve received, both from the community and in terms of investment.",
    "Additionally, Red Hat also announced that it is now allowing subscribing RHEL customers to add their entire development teams to the program at no additional cost. It argues this will make “RHEL more accessible as a development platform for the entire organization.”",
    "The updated licensing terms come into effect from February 1, 2021. Just sign up for the free Red Hat account and download your copy of RHEL.",
    "And there’s more to come: “We know that these programs don’t address every CentOS Linux use case, so we aren’t done delivering more ways to get RHEL easily. We’re working on a variety of additional programs for other use cases, and plan to provide another update in mid-February.”"
  ],
  "headers": {
    "3": "Ear to the ground"
  },
  "links": {
    "CentOS saga": "https://www.techradar.com/news/this-centos-alternative-will-be-available-by-spring-2021",
    "servers": "https://www.techradar.com/news/best-linux-distro-small-business",
    "feedback": "https://www.techradar.com/news/red-hat-defends-centos-decision-following-push-back",
    "axe CentOS": "https://www.techradar.com/news/red-hat-makes-drastic-changes-to-centos-leaves-users-fuming",
    "high-profile forks": "https://www.techradar.com/news/heres-another-centos-clone-and-this-one-is-backed-by-a-million-dollars-a-year"
  }
}