{
  "source": "https://www.techradar.com/news/cant-find-an-rtx-3080-check-out-these-gaming-pc-black-friday-deals-instead",
  "title": "Can't find an RTX 3080? Check out these gaming PC Black Friday deals instead",
  "category": "news",
  "updated": "2021-11-19T22:32:10Z",
  "author": "john-loeffler",
  "summary": "Save on these RTX 3080 and RTX 3080 Ti builds for Black Friday",
  "article": [
    "It's no secret that finding the best graphics cards has been a challenge this year, with everything from the flagship RTX 3080 to the (relatively) more budget-minded RTX 3060 being all but impossible to find. Pretty much the only way to get these graphics cards right now is by picking up a pre-built system from companies like iBuyPower, Maingear, and ABS, which can be an expensive proposition.",
    "But if you're looking to upgrade more than just your graphics card, buying a pre-built system might be the way to go, especially with Black Friday deals rolling out across major computer retailers and from the manufacturers themselves. This iBuyPower RTX 3080 Ti system is $600 off at Best Buy right now, while this ABS Gladiator RTX 3080 build is just $2,699 at Newegg, a $300 savings.",
    "(Not in the US? Scroll down for deals in your region).",
    "RTX 3080 graphics cards are pretty scarce right now, making pre-built systems some of your best options to get next-gen gaming performance out of your PC.",
    "This isn't an ideal solution to the graphics card shortage by any means, but in most cases, you might need to upgrade several components along with a graphics card if you're looking to really update your PC for the best PC games out there right now.",
    "There are a lot of great Black Friday PC gaming deals going on right now, so if you're looking for an RTX 3080 gaming PC, you have plenty of options to choose from. Many of the offers here can also be configured differently to suit your needs, though the discounts on different configurations will vary.",
    "No matter where you live, you'll find all the lowest prices for RTX 3080 gaming PCs from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best RTX 3080 gaming PC Black Friday deals",
    "6": "More RTX 3080 gaming PC deals",
    "7": "More Black Friday deals"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "iBuyPower RTX 3080 Ti system is $600 off at Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1392481116289014500&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fibuypower-trace-mr-gaming-desktop-intel-i7-11700kf-16gb-memory-nvidia-geforce-rtx-3080ti-12gb-1tb-nvme-ssd%2F6472354.p%3FskuId%3D6472354&article_name=Can't%20find%20an%20RTX%203080%3F%20Check%20out%20these%20gaming%20PC%20Black%20Friday%20deals%20instead&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fcant-find-an-rtx-3080-check-out-these-gaming-pc-black-friday-deals-instead",
    "ABS Gladiator RTX 3080 build is just $2,699 at Newegg": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-8683447159006006000&murl=https%3A%2F%2Fwww.newegg.com%2Fabs-ali566%2Fp%2FN82E16883360196",
    "best PC games": "https://www.techradar.com/news/best-pc-games"
  }
}