{
  "source": "https://www.techradar.com/news/how-to-watch-line-of-duty-online-stream-season-6s-final-episode-from-anywhere",
  "title": "How to watch Line of Duty online: stream season 6's final episode from anywhere",
  "category": "computing",
  "updated": "2021-05-02T18:01:25Z",
  "author": "alice-marshall",
  "summary": "Who is H? All questions answered in the final episode",
  "article": [
    "It feels like the sixth season of Line of Duty only just returned to our screens, bringing back Hastings, Fleming, and Arnott on their investigations to uncover coppers gone bent. However, the final episode is airing tonight, wrapping another season of the AC-12 department and its gripping storylines. Make sure you know how to watch Line of Duty season 6, episode 7 - the final episode - where you are.",
    "*SPOILER ALERT: plot details and other information related to Line of Duty season 6 mentioned below. If you're not fully up-to-speed with the show, you can scroll down for a spoiler-free guide covering how to watch Line of Duty online and stream every new episode in season 6*",
    "With season 6 centring around the unresolved high-profile murder of investigative journalist, Gail Vella, DCI Jo Davidson has been raising suspicions among the anti-corruption unit as she leads the already-year-long case. More interestingly still, former AC-12 officer, Kate Flemming, is a part of her team.",
    "As we arrive at the final episode, we've been promised we'll get all the answers - which we hope means the identity of the still unknown 'H'. With two bullet holes in Pilkington, the plot thickens as Fleming and Davidson flee, only to be surrounded by police at Boyle's flat.",
    "Both taken into custody, Davidson's parentage is revealed to her, though we're left unsure of whether or not she was aware of this connection to a organised crime overlord. Davidson is charged, meanwhile Fleming is released.",
    "Once again ending on a cliffhanger - the BBC knows how to do us dirty - Davidson is taken to her cell, when approached by two OCG prison guards, who seem to clock the two CCTV cameras. The plot thickens...",
    "Follow our guide below to learn where to watch Line of Duty season 6 online and stream episode 7 - the final episode - from anywhere on earth today.",
    "For anyone abroad right now wanting to watch Line of Duty, you’ll likely be unable to watch series 6, episode 7 due to annoying regional restrictions.",
    "Fortunately, there’s a simple solution. Downloading a VPN will allow you to stream Line of Duty online no matter where you are. The simple bit of software changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home."
  ],
  "headers": {
    "7": "How to watch Line of Duty online from outside your country",
    "9": "How to watch Line of Duty online in Canada"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}