{
  "source": "https://www.techradar.com/news/army-of-the-dead-fan-theory-totally-changes-the-story-of-netflixs-hit-movie",
  "title": "Army of the Dead fan theory totally rewrites the story of Netflix's hit movie",
  "category": "entertainment",
  "updated": "2021-05-25T14:34:55Z",
  "author": "tom-power",
  "summary": "Zack Snyder's Army of the Dead might not be what you think it is",
  "article": [
    "Army of the Dead has been a big success for Netflix. Zack Snyder's zombie-heist movie has rocketed to the top of the streamer's most popular lists in the US and UK, which shows it's largely resonated with viewers. Even critics generally seemed to like it.",
    "One of the biggest talking points surrounding the movie in the immediate aftermath of its release was its ambiguous ending, and whether it sets up a potential Army of the Dead sequel.",
    "Now, though, that's resulted in a bigger and stranger theory, which is generating a lot of attention: Army of the Dead is secretly a movie where Scott Ward's group is stuck in an infinite time loop.",
    "Confused? Allow us to explain. Be warned there are major spoilers from this point on, though (and credit to GamesRadar for spotlighting this one).",
    "If you've watched Army of the Dead, you'll know that Scott's gang of mercenaries eventually reach the vault in the casino owned by Bly Tanaka.",
    "As the group look to bypass the vault's security systems, safecracker Ludwig Dieter notices that another group had earlier tried (and failed) to break into Tanaka's vault.",
    "Scott alludes to this point earlier in the film, too, when his party find another set of blueprints for the casino. When they find another group's plans for Bly's Casino, Scott suggests that they aren't the first to try and earn themselves a big payday.",
    "Back to the vault. After Dieter makes his observation, Vanderohe suddenly gets very meta on the audience by suggesting that the previous group is, in fact, Scott's gang.",
    "\"Is it another team, or is it us, Dieter? Think about it. Look at them - it's us\", Vanderohe says. Some quick-fire camera work jumps back and forth between the dead crew and various members of Scott's party, which teases that possibility.",
    "\"It could be us in another timeline,\" Vanderohe continues. \"And we're caught in some infinite loop of fighting and dying, and fighting and dying. Tanaka? He's the puppet master, the devil or God. Me, you, Guzman and the rest of the team are simply pawns in some perverse play where we're destined to repeat our failures.\"",
    "On the surface, it seems that Vanderohe is messing with Dieter - but what if his theory is legitimate? That's what a bunch of Snyder fans have suggested in the wake of Army of the Dead's launch.",
    "Since its release, multiple Army of the Dead viewers have taken to social media to assemble various clues that hint at the prospect of Vanderohe's throwaway comments actually being true.",
    "Take this tweet from @SamParkerMetal, for instance. One of the corpses has a key necklace that is eerily similar to one worn by Maria Cruz. Parker's tweet also alludes to a quote that Dieter makes as they enter the vault, too. He says that he shoots the zombie bride three times before correcting himself and saying it was actually four:",
    "That's not the only tweet where Parker posits that Vanderohe's theory is a highly plausible one. His whole thread is full of intriguing references to the fan theory, including how Vanderohe wasn't actually bitten by Zeus during their confrontation in the vault. Why, then, does he have a bite by the movie's end?",
    "Other Twitter users have found references that hint at this theory, too. Twitter user @RenBonaparte noticed three AK-47s lining the vault wall after its door is opened, and suggested that these were owned by Guzman. If they are, this is the fourth incarnation of Guzman to try and break into Tanaka's vault - itself a callback to Dieter's 'four times' line:",
    "Leon Phyo grabbed a screenshot of what appears to be a deceased Scott near the vault's entrance as well:",
    "Finally, in a separate thread, Twitter user @HailMother proposes that the movie's montage sequence, which occurs when Tanaka is telling Scott's group what the plan is, is from another of the gang's attempts to break into the vault. HailMother argues that Guzman's friend is present during this run but, after he backs out of the heist that we witness, it alters the entire mission and results in everyone (apart from Kate) dying:",
    "For Snyder's part, he hasn't completely dismissed the time loop theory either. Speaking to The Film Junkee, the director said: “I will also say that… there's a chance – and I'm not saying this is 100% true, and in some ways it's not – but the group at the table, I mean, it's pretty subtle, but that's them also at the table as well as... they get farther every time. Is this the time they made it all the way to the money?”",
    "The fan theory could also align with quotes that Snyder made regarding the potentially \"insane\" idea (per Polygon) he has for Army of the Dead 2 (if Netflix gives it the go-ahead).",
    "If the streaming giant greenlights a sequel, could we see another attempt by Scott's gang to break into the vault, grab the money and escape with their lives? It would be fascinating to see, especially if this 'new' group makes reference to the group that failed in Army of the Dead. It would even allow Snyder to bring back the same cast and, potentially, enable some of them to survive this time around.",
    "Regardless, it's a very interesting fan theory and one that will certainly make you view Army of the Dead in a different light on subsequent viewings."
  ],
  "headers": {
    "11": "Analysis: Vanderohe's Army of the Dead timeloop theory could be true"
  },
  "links": {
    "Army of the Dead": "https://www.techradar.com/news/army-of-the-dead-ending-explained-will-there-be-a-sequel",
    "potential Army of the Dead sequel": "https://www.techradar.com/news/army-of-the-dead-2",
    "GamesRadar": "https://www.gamesradar.com/army-of-the-dead-time-loop-zack-snyder-netflix-explained/",
    "The Film Junkee": "https://www.youtube.com/watch?v=EIBfOebFbG0&t=4959s",
    "Polygon": "https://www.polygon.com/movies/22435499/army-of-the-dead-2-ending-sequel-scene-zack-synder-interview"
  }
}