{
  "source": "https://www.techradar.com/news/xbox-nintendo-switch-and-playstation-games-are-3-for-2-at-amazon-right-now",
  "title": "Xbox, Nintendo Switch and PlayStation games are 3 for 2 at Amazon right now",
  "category": "gaming",
  "updated": "2021-02-10T13:15:49Z",
  "author": "tabitha-baker",
  "summary": "Grab free games this week",
  "article": [
    "Amazon is kicking off a massive round of game deals this week, with a range of Nintendo Switch, Xbox, PS4 and PS5 games included in a massive 3 for 2 sale. From Forza to The Outer Worlds, Call of Duty to Minecraft, you'll find a wide range of titles up for grabs right now - and one of them will be free.",
    "Simply add three of the following games to your cart and the cheapest will be cut from the final price at checkout. Unfortunately there's no heavy hitters in here - the likes of Spider-Man: Miles Morales, The Medium, and Hitman 3 are all absent from the cheaper offers. However, if you've missed out on some must-have classic in the past now's the time to buff up your collection.",
    "You'll find all the games included in Amazon's latest game deals just below, but you'll find plenty more cheap Nintendo Switch games, PS5 game deals and Xbox game deals right here on TechRadar.",
    "You'll find plenty more games on sale right now, with Assassin's Creed: Valhalla and Watch Dogs Legion offering up some excellent discounts in particular.",
    "Find out where to buy PS5 and all the latest Xbox Series X restock updates right here on TechRadar, or check out all the best Nintendo Switch deals and cheap Nintendo Switch Lite bundles."
  ],
  "headers": {
    "3": "More cheap game deals"
  },
  "links": {
    "game deals": "https://www.techradar.com/news/cheap-game-deals-sales-xbox-one-ps4-pc",
    "cheap Nintendo Switch games": "https://www.techradar.com/deals/cheap-nintendo-switch-game-deals-sales",
    "PS5 game deals": "https://www.techradar.com/deals/best-cheap-ps5-game-deals-and-prices",
    "Xbox game deals": "https://www.techradar.com/deals/cheap-xbox-game-deals-sales",
    "where to buy PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X restock": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Nintendo Switch deals": "https://www.techradar.com/news/nintendo-switch-deals",
    "cheap Nintendo Switch Lite bundles": "https://www.techradar.com/deals/cheap-nintendo-switch-lite-prices-bundle-deals"
  }
}