{
  "source": "https://www.techradar.com/news/windows-10s-new-taskbar-could-be-bad-news",
  "title": "Upcoming Windows 10 update will transform the taskbar - but at a cost",
  "category": "computing",
  "updated": "2021-03-09T16:15:39Z",
  "author": "matt-hanson",
  "summary": "Bit of a resource hog",
  "article": [
    "The Windows 10 taskbar, which runs along the bottom of the desktop, is set to get a big change soon, with a new 'News and Interests' section that pops up news headlines, weather forecasts and more when you click on it.",
    "While Microsoft wants this new feature to enable users to access information more quickly, as Windows Latest points out, it could end up slowing down your PC.",
    "This is based on an early version of the News and Interests tool that has appeared in an Insider build of Windows 10. This is a version of Windows 10 sent out to testers (known as Windows Insiders) to try out features that could be coming in the future.",
    "According to Windows Latest, the new feature checks news feeds in the background to give you the latest information. This means that a process is working away in the background, and when looking for news, it can take up to 150MB of RAM.",
    "That’s a decent chunk of memory, especially on older PCs or devices with limited amounts of RAM. If your PC is really struggling for memory, it could result in a degradation in performance.",
    "This won’t be welcomed by people who want their Windows 10 installs to be as clean as possible, and the idea of sacrificing memory to a feature they rarely use won’t be too popular.",
    "However, Microsoft has said that News and Interests is optional, so if you don’t find it useful, you can disable it. Also, as we mentioned, this is an early version of the feature, and it’s likely that Microsoft will refine it before it’s official release, and that will hopefully mean it eats less memory.",
    "What may be more concerning is if this new feature hints at Microsoft’s future plans for Windows 10, where once again flashy additions that bloat performance are added to the operating system, and which appear to be more about getting people to use Microsoft’s own services (by default News and Interests will use Bing) than actually improving the user experience."
  ],
  "headers": {
    "3": "Memory hog"
  },
  "links": {
    "as Windows Latest points out": "https://www.windowslatest.com/2021/03/09/new-details-of-windows-10s-upcoming-taskbar-feed-feature-revealed/"
  }
}