{
  "source": "https://www.techradar.com/news/lucid-reveals-its-making-more-of-its-limited-edition-tesla-range-beating-ev",
  "title": "Lucid reveals it's making more of its limited edition, Tesla range-beating EV",
  "category": "car-tech",
  "updated": "2021-10-26T09:30:24Z",
  "author": "chris-teague",
  "summary": "20 more Lucid Air Dream Edition electric cars in the works",
  "article": [
    "After a long wait, we're finally starting to see compelling new cars from small EV makers. The Lucid Air is one of them, and the electric super sedan is already making waves with its projected range numbers.",
    "One version of the Air Dream Edition received an EPA-estimated range of 520 miles – a true achievement – and to build excitement, the company is releasing additional units of the car to hopeful buyers.",
    "Lucid will build an additional 20 cars to bring the total Dream Edition production run to 520 units to celebrate the occasion.",
    "The automaker is also adding a new Zenith Red paint color to the Dream Edition line, bringing the color choices to four: Zenith Red, Infinite Black, Stellar White, and Eureka Gold.",
    "Lucid is offering two versions of the Dream Edition, only one of which hits the 520-mile mark.",
    "The Dream Edition Performance model features dual motors and all-wheel drive that combine to produce an astonishing 1,111 horsepower and around 737 pound-feet of torque. Its range extends to 471 miles on 19-inch wheels and 451 miles on 21-inch wheels. The car’s 0-60 mph time is just 2.5 seconds.",
    "The Dream Edition Range is where things get interesting. It also features dual motors and all-wheel drive, but the car only sees 933 horsepower from its powertrain – still more than almost anyone needs.",
    "The Range can travel 520 miles on 19-inch wheels and 481 miles on 21-inch wheels. If that's not good enough, the car will still do 0-60 in just 2.7 seconds.",
    "Since the Air's production and release date are right around the corner, Lucid is hosting preview events starting next week to give customers and media a preview of the car.",
    "Lucid joins another electric car upstart, Rivian, in releasing unique new vehicles in the second half of 2021. It's an excellent time to be in the market for a new EV.",
    "Via Inside EVs"
  ],
  "headers": {
    "4": "Plenty of power, plenty of range"
  },
  "links": {
    "Lucid Air": "https://www.techradar.com/news/lucid-air-first-drive",
    "Inside EVs": "https://insideevs.com/news/534985/lucid-air-dream-edition-520/"
  }
}