{
  "source": "https://www.techradar.com/news/ps5-exclusive-game-returnal-has-been-delayed",
  "title": "PS5 exclusive game Returnal has been delayed",
  "category": "gaming",
  "updated": "2021-02-01T17:15:58.520Z",
  "author": "vic-hood",
  "summary": "Returnal will now release in April",
  "article": [
    "Sony has announced that its upcoming PS5 exclusive game Returnal has been delayed, with the science fiction shooter now set to release on April 30.",
    "Returnal was initially due to release on March 19, however Sony revealed in a tweet from the official PlayStation Twitter account that the game has been delayed to give developer Housemarque extra time \"to polish the game\".",
    "\"Returnal has a new release date of April 30, 2021,\" the post reads. \"SIE and Housemarque have made the decision to move the release date in order to give the team extra time to continue to polish the game to the level of quality players expect from Housemarque.\"",
    "Returnal's delay is just one of a myriad of game delays we've been seeing from game publishers in recent months. So far we've seen the likes of Far Cry 6, Halo Infinite, Outriders and more delayed from their initial release dates in late 2020 or early 2021.",
    "It's likely these delays are partly due to the logistical difficulties caused by the ongoing Covid-19 pandemic, but it's also possible that following the contentious launch of Cyberpunk 2077, some developers are wary of releasing a game before they feel it is truly ready.",
    "While we may be waiting an extra month to get our hands on it, Returnal certainly looks like a promising PS5 exclusive.",
    "Announced at Sony's Future of Gaming event in June 2020, Returnal is a third-person science-fiction shooter with a mix of psychological horror and roguelike elements. Players take on the role of Selene, a space pilot, who is stranded on an alien planet with an unfortunate time loop.",
    "Each time Selene dies, she is resurrected, but the world around her has changed and the extraterrestrials of the planet become increasingly hostile - imagine a more macabre version of Groundhog Day. Selene needs to survive long enough to get off the planet, escaping the time loop.",
    "Returnal will land exclusively for PS5 on April 30, 2021."
  ],
  "headers": {
    "5": "What is Returnal?"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}