{
  "source": "https://www.techradar.com/news/asus-could-be-making-a-crypto-mining-graphics-cardwith-rgb-lighting",
  "title": "Asus could be making a crypto mining graphics card...with RGB lighting?",
  "category": "computing",
  "updated": "2021-04-19T13:00:48Z",
  "author": "rhys-wood",
  "summary": "Now that’s just showing off",
  "article": [
    "Asus is set to release a new cryptomining graphics card, the Asus CMP 30HX in May 2021, and it appears to be a modified version of the Nvidia GeForce GTX 1660 Super GPU. This closely follows Gigabyte’s announcement of its own cryptomining GPU, which was also based on the same Nvidia hardwares.",
    "While this mining GPU typically can’t be used for gaming purposes - given that it lacks a display output - it does boast one feature that other mining cards don’t: RGB lighting. Perhaps Asus is looking to tap into the more aesthetically-minded miners out there who want to show off their mining rigs?",
    "The Asus CMP 30HX is rumored to launch at $799 (approximately £599 / AU$1,099). That’s more expensive than the RTX 3080 launched at, and has worse specs to boot. So that begs the question, then: who is Asus’s cryptomining card for?",
    "The obvious response there is that Nvidia’s RTX 30 series of GPUs are still extremely difficult to buy, especially at their recommended retail price. If you’re looking to get an RTX 3080, you might end up spending well over a grand on an aftermarket card – not the most exciting proposition for gamers and miners alike.",
    "That $799 price point for the Asus CMP 30HX might seem affordable in comparison, then. By injecting the market with dedicated cryptomining GPUs, companies like Nvidia are looking to free up the availability of gaming GPUs like the RTX 3080. However, when less powerful mining GPUs are being sold at such high prices, is anyone really going to bite?",
    "In the Asus CMP 30HX’s case, the price doesn’t necessarily get you a powerful mining GPU, either. The card’s hash rate is 26MH/s, which actually falls short of much cheaper and more available cards like the GTX 1070 Ti and AMD’s Radeon RX 480.",
    "Still, we won’t underestimate the interest a card like the Asus CMP 30HX could have. As mentioned above, the card features RGB lighting, which might seem like a throwaway feature, but there does exist a community of users within the cryptomining space that pride themselves on aesthetically pleasing mining rigs, so maybe that’s where the high price point comes in?",
    "For most cryptominers, though, maximising profits comes above all else, and buying a more expensive GPU would eat into those profits. The allure of RGB lighting might not be enough to tempt them to pay more, then.",
    "This might mean that Asus could release a graphics card that doesn’t appeal to anyone - quite an achievement in 2021.",
    "Via VideoCardz.com"
  ],
  "headers": {
    "3": "Deep in the mines"
  },
  "links": {
    "Nvidia GeForce GTX 1660 Super": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1660-super",
    "Gigabyte’s announcement": "https://www.techradar.com/news/gigabyte-cmp-30hx-officially-announced-but-price-and-release-date-still-a-mystery",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "GTX 1070 Ti": "https://www.techradar.com/reviews/nvidia-gtx-1070-ti",
    "Radeon RX 480": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/amd-radeon-rx-480-review-1324113/review",
    "VideoCardz.com": "https://videocardz.com/newz/asus-cmp-30hx-mining-card-features-argb-lighting"
  }
}