{
  "source": "https://www.techradar.com/news/ethereum-developers-are-at-loggerheads-with-miners-over-imminent-changes",
  "title": "Ethereum developers are at loggerheads with miners over imminent changes",
  "category": "computing",
  "updated": "2021-03-15T21:42:56Z",
  "author": "anthony-spadafora",
  "summary": "Ethereum community is split over changes to the network's fee market",
  "article": [
    "A new Ethereum Improvement Proposal (EIP) has arrived at a time when Ethereum miners and developers are already at odds at one another over a previous EIP that is slated to be integrated in July.",
    "Tensions between miners and developers of the popular cryptocurrency have escalated in recent weeks due to EIP-1559 which is expected to alter Ethereum's volatile fee market while also significantly impacting miner revenues.",
    "Under the new proposal, EIP-3368, block rewards will immediately be increased to three Ether (ETH) and then later reduced to one Ether over two years once EIP 1559 is implemented to help ease the impact on miners of Ethereum's transition to proof-of-stake.",
    "In a recent tweet, Ethereum developer Tim Beiko introduced EIP-3368 and encouraged the Ethereum community to debate over the latest improvement proposal. However, Beiko stressed that EIP-3368 has not been accepted or scheduled for a release yet, saying:",
    "“To be clear, this EIP is not accepted/scheduled for a fork/etc. yet. It's only been proposed and seems like the most tangible thing to come out of miner conversations in the past few weeks. If you want a high leverage way to engage, now is the time.”",
    "Although many mining pools are in opposition to EIP-1559, news that the upgrade will be deployed in July saw many prominent miners threaten to organize a “show of force” by diverting their hashing power to a single pool for 51 hours.",
    "Once EIP-3368 was proposed though, the popular crypto mining outfit Red Panda Mining pledged its support for the proposal and said that it would no longer be participating in the show of force.",
    "While it now seems that miners and developers may be preparing to compromise, discussions on the Ethereum Magicians forum suggest that EIP-3368 is still a very dividing subject for many. At the same time, many miners have replied to Red Panda Mining's Twitter account to say that still want to go forward with the show of force over EIP-1559.",
    "We'll likely find out more once EIP-1559 comes closer to being implemented in July but until then, the Ethereum community will likely remain divided over it as well as the newly proposed EIP-3368.",
    "Via Cointelegraph"
  ],
  "headers": {
    "5": "Show of force"
  },
  "links": {
    "Ethereum": "https://www.techradar.com/news/against-all-odds-ethereum-20-is-finally-here",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "recent tweet": "https://twitter.com/TimBeiko/status/1370515621012664322",
    "mining pools": "https://www.techradar.com/best/mining-pools",
    "Cointelegraph": "https://cointelegraph.com/news/new-eip-hopes-to-quell-tensions-between-ethereum-s-miners-and-developers"
  }
}