{
  "source": "https://www.techradar.com/news/want-an-alexa-tv-these-webos-smart-tvs-are-getting-support-overnight",
  "title": "Want an Alexa TV? These webOS smart TVs are getting support overnight",
  "category": "televisions",
  "updated": "2021-07-14T10:14:11Z",
  "author": "rhys-wood",
  "summary": "Amazon’s assistant could be coming to a TV you own",
  "article": [
    "Amazon’s Alexa AI voice assistant will soon be added to a wide range of third-party TVs powered by LG Electronics’ webOS smart TV platform. Users will be able to speak into their LG Magic Remote to issue voice commands to Alexa for general help as well as opening apps or accessing channels.",
    "An LG press release for the announcement stated that the Alexa functionality will come to North America first via an update in Q3 2021, followed by European and Asian territories soon after. The supported TV brands include Blaupunkt, Polaroid, Seiki and Skytech.",
    "LG Home Entertainment head of content services, Jung Sung-hyun, said this of the announcement: “The addition of Amazon Alexa to the long list of webOS features will enhance the user experience and boost the value of our growing smart TV ecosystem. Bringing together the capabilities of Alexa with the convenience of webOS to third-party TVs is a win-win-win for TV brands, customers and developers.”",
    "Over the past few months, LG has been making a serious push to get webOS out there, expanding its availability to several third-party TV brands including Ayonz, RCA and Konka, all of which will also be benefiting from the Alexa functionality being added later in the year.",
    "But how will it work? As mentioned earlier, users will need the LG Magic Remote. By long-pressing the Amazon Prime Video button, they’ll be able to speak to Alexa and access the features that the voice assistant provides such as opening an app, changing channels, learning the day’s news or just having it tell a joke for fun.",
    "We see Alexa’s integration into webOS to be a win for accessibility, too. Being able to access most – if not all – of your smart TV’s features by using just one button and your voice can save less tech-savvy folk from wrestling with the Magic Remote’s litany of buttons. Not only that, users also won’t need to worry about buying a separate Alexa-compatible device like an Amazon Echo smart speaker."
  ],
  "headers": {
    "3": "Alexa's playing at my house"
  },
  "links": {
    "Alexa": "https://www.techradar.com/news/the-best-alexa-speakers",
    "webOS": "https://www.techradar.com/news/software/operating-systems/webos-finds-new-home-with-lg-and-its-smart-tvs-phone-a-possibility-1133703",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Magic Remote": "https://www.techradar.com/news/the-best-thing-about-this-years-lg-oled-tvs-the-new-magic-remote",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "third-party TV brands": "https://www.techradar.com/news/the-best-smart-tv-platform-is-coming-to-a-whole-new-range-of-tvs",
    "Amazon Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review"
  }
}