{
  "source": "https://www.techradar.com/news/framing-britney-spears-is-an-unmissable-documentary-about-the-cost-of-celebrity-culture",
  "title": "Framing Britney Spears is an unmissable documentary about the cost of celebrity culture",
  "category": "entertainment",
  "updated": "2021-02-16T17:48:21Z",
  "author": "samuel-roberts",
  "summary": "UK viewers can finally check it out on Sky tonight too",
  "article": [
    "What do you remember about Britney Spears? Watching the much-talked about documentary Framing Britney Spears, which debuts tonight on Sky and Now TV a week after landing in the US, makes you realize you've been fed a narrative about Britney Spears' life – even if you're only vaguely aware of her two-plus decades in the spotlight.",
    "Part of The New York Times Presents series, this sympathetic documentary explores the ways in which the gross celebrity tabloid culture of the '00s tried its hardest to damage Britney Spears: by following her around and obsessively photographing her most vulnerable moments for profit, and by controlling how events in her personal life were perceived by the public. You'll be hard-pressed not to feel angry after watching it.",
    "Since 2008, Britney Spears has been in a conservatorship operated by Jamie Spears, her father – allowing him to control her finances and other key parts of her life. It's something the documentary navigates by examining Britney's recent professional career, looking at court filings and talking to the passionate fans that make up the #FreeBritney movement who oppose the conservatorship.",
    "It does this after running through a timeline of events that led to the conservatorship in the first place, including her personal struggles towards the end of the '00s.",
    "The power of Framing Britney Spears is in how it recontextualizes Spears' history in the spotlight – including her relationship and break-up with Justin Timberlake, how she was sexualized by the media even when was a teenager, and how unfunny late night hosts made her the subject of jokes.",
    "It's a powerful reminder of how toxic and omnipresent celebrity tabloid culture around young women was in the '00s, and how figures like Paris Hilton and Lindsay Lohan entered your cultural orbit even if you were trying your best to shut them out.",
    "By simply presenting footage from the time, the documentary successfully manages to make you question how Spears was actually treated by media. A famous Diane Sawyer interview from 2003 – rife with cynical moralistic nonsense about setting an example for young people – has aged like fine milk.",
    "The documentary depicts Spears' story as one crafted by tabloids, opportunists and even her ex-boyfriend – who all had something to gain at her expense. It's an all-encompassing piece of work, and satisfies in just how much of her career it blitzes through in an hour and 20 minutes.",
    "It also benefits from having sympathetic, perceptive insight from NYT's own talking heads, like critic Wesley Morris – even if it lacks the participation of Spears or her family. While the documentary clearly has good intentions, it's again a version of Spears' narrative that she doesn't get to deliver herself.",
    "Framing Britney Spears makes fame seem like it's too heavy a price to pay, at least if you're a young woman. You'd hope that celebrity culture doesn't leave the same impact as this clearly did all these years later – but who knows how we'll feel about this period of influencers, celebrities and instant access in two decades?",
    "Much of what you're shown in this documentary will feel like recent history, depending on your age, and yet our modern attitudes to how Spears was treated feel like they've progressed significantly since then.",
    "Ultimately, you'll just end Framing Britney Spears wishing that Spears could fully take control of her own story again. But whether you're a fan of her music or not, it's a fascinating glimpse at the human price of celebrity culture – and the fact that those who stand to benefit pay no price at all. Don't miss it.",
    "Framing Britney Spears is available on Sky Documentaries or with a NOW TV Entertainment Pass from 9pm on Tuesday, February 16. In the US, it's now streaming on Hulu."
  ],
  "headers": {},
  "links": {
    "Framing Britney Spears": "https://www.techradar.com/news/how-to-watch-britney-spears-documentary-stream-framing-britney-spears-online",
    "Diane Sawyer interview from 2003": "https://www.youtube.com/watch?v=O4CvSRCA9Ro&ab_channel=LeandroJacobini",
    "NOW TV Entertainment Pass": "https://eu-west-1.protection.sophos.com/?d=outlook.com&u=aHR0cHM6Ly9ldXIwMS5zYWZlbGlua3MucHJvdGVjdGlvbi5vdXRsb29rLmNvbS8_dXJsPWh0dHBzJTNBJTJGJTJGZXUtd2VzdC0xLnByb3RlY3Rpb24uc29waG9zLmNvbSUyRiUzRmQlM0RvdXRsb29rLmNvbSUyNnUlM0RhSFIwY0hNNkx5OWxkWEl3TVM1ellXWmxiR2x1YTNNdWNISnZkR1ZqZEdsdmJpNXZkWFJzYjI5ckxtTnZiUzhfZFhKc1BXaDBkSEJ6SlROQkpUSkdKVEpHZDNkM0xtNXZkM1IyTG1OdmJTVXlSbmRoZEdOb0xYUjJMWE5vYjNkekxXOXViR2x1WlNaa1lYUmhQVEEwSlRkRE1ERWxOME5oYm01aFltVnNMbU52YldKbEpUUXdjMnQ1TG5WckpUZERaV0kxWlRWbE1EY3dNemhqTkROaU5qaGxPR013T0dRNFpERTVObVJtWVdRbE4wTTJPR0k0TmpWa05XTm1NVGcwWWpKaU9ESmhOR0UwWldSa1lqbGpOVEl6TnlVM1F6QWxOME13SlRkRE5qTTNORGc1Tnprek1qRTRPRFE0TnpBNUpUZERWVzVyYm05M2JpVTNRMVJYUm5CaVIxcHpZak5rT0dWNVNsZEphbTlwVFVNMGQweHFRWGROUkVGcFRFTktVVWxxYjJsV01teDFUWHBKYVV4RFNrSlVhVWsyU1dzeGFHRlhkMmxNUTBwWVZrTkpOazF1TUNVelJDVTNRekV3TURBbWMyUmhkR0U5ZFdkVE1VcEJSMHM0WXpsMFUweElWRFZ5VW5aU1oxWlFhbGc0TTNGVVRsQTBOa1ZwYkNVeVJteFROM2xySlRORUpuSmxjMlZ5ZG1Wa1BUQSUzRCUyNmklM0ROV1ppWlRWaVpEWmxNemczWWpFd1pHWm1OemxtTW1SaiUyNnQlM0ROamh4ZW5KTVdrdHZhVTFVYVZZMlYwZFZNelJOZURVM1RHMTRjMFZpVEhaNk5UVnRXVlJwWkV4VlNUMCUzRCUyNmglM0RhYWRjM2RiZTljYTE0N2U5ODI0NjU4ZmY4YzdlOTg3MyZkYXRhPTA0JTdDMDElN0NqZXNzaWNhLmdyYXklNDBza3kudWslN0NkMWIyNWQwYzYzYzY0OGQ2NmIxODA4ZDhkMTk4NDdmYyU3QzY4Yjg2NWQ1Y2YxODRiMmI4MmE0YTRlZGRiOWM1MjM3JTdDMCU3QzAlN0M2Mzc0ODk3OTkyODIyMDY3ODMlN0NVbmtub3duJTdDVFdGcGJHWnNiM2Q4ZXlKV0lqb2lNQzR3TGpBd01EQWlMQ0pRSWpvaVYybHVNeklpTENKQlRpSTZJazFoYVd3aUxDSlhWQ0k2TW4wJTNEJTdDMTAwMCZzZGF0YT1QS3FCMWJGenZHcjdTNFJoYklERjZsZzlRS25vYTZXSjluMmE2eHNCeEMwJTNEJnJlc2VydmVkPTA=&i=NWZiZTViZDZlMzg3YjEwZGZmNzlmMmRj&t=MW53S0dQbEcwamx5UFliOHNHNnhkUlFOaklTUjVMOE5Eb3hiL3BwQmhzVT0=&h=39278a5c86d24463b18a9ec3d21ca7a4",
    "Hulu": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8915735798745472000&xs=1&url=https%3A%2F%2Fwww.hulu.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fframing-britney-spears-is-an-unmissable-documentary-about-the-cost-of-celebrity-culture"
  }
}