{
  "source": "https://www.techradar.com/news/photography-video-capture/camcorders/cheap-gopro-deals-1296815",
  "title": "The best cheap GoPro deals and sales for December 2021",
  "category": "cameras",
  "updated": "2021-12-03T11:47:59Z",
  "author": "tabitha-baker",
  "summary": "Bag a bargain GoPro with these discounted deals",
  "article": [
    "We're bringing you all the best GoPro deals hitting the web today, with significant savings on everything from the brand new GoPro Hero 9 Black to the cheapest of starter cameras. That means you'll find the lowest GoPro prices from all the best retailers right here, so you know you're always getting the best discount available.",
    "While you'll find previously pricey models like the GoPro Hero 8 Black are now dropping their costs, you can also pick up some seriously discounted GoPro sales on older models as you get further down the page. GoPro themselves reduced the MSRP/RRP on a number of cameras recently to head off some pretty aggressive competition from rivals.",
    "If you're just after the newest release, however, you're shopping at the right time. Top of our best GoPro deals list is the latest GoPro Hero 9 Black, offering up new 5K footage and a 20MP camera for stills. With a front-facing display, boosted software, and extended battery life, it's the best GoPro on the market right now, but it's also the most expensive.",
    "We'll run through the spec of each model, making it easy for you to compare them all. So whether you're after the smoothest 4K scene shooting or a reliable budget price 1080p option, we've got you covered.",
    "The new GoPro is here, and with it comes a range of new software features, an extended battery life, brand new 5K shooting capabilities, and a front facing display. That's a good list of upgrades that adds more to the value than the Hero 8 Black offered, but you'll find little improvement in 4K shooting here.",
    "That 5K option, however, makes up for the stasis of shooting 4K at 60fps. You'll get better clarity and more vivid details with the new shooting mode, and pair that with HyperSmooth Boost (GoPro's latest and most powerful stabilization tech) and it's possible to achieve some amazing footage with the GoPro Hero 9 Black.",
    "With all that new tech does come a shift in the GoPro price, with the new model launching for £100 / $200 more than the previous version now sits at. However, if you're shopping in the UK you can save that £100 by picking up GoPro's own launch bundle which offers up a year of the GoPro subscription (unlimited cloud storage, savings on accessories, and warranty replacement) with the new camera for far less than the action cam by itself.",
    "The second newest member of the GoPro family is more about internal improvements over radical redesigns. But make no mistake, the GoPro Hero 8 Black is still one of the best action cameras GoPro has ever made.",
    "Image Stabilization 2.0 combats the most chaotic of scenes you can throw at it and there's a better microphone on the device now too. The water resistance is a solid 10m and the shock resistance rating of the Gorilla Glass lens cover has been doubled - especially handy if you're likely to make a mess of a landing or take a bit of a beating from the great outdoors.",
    "So, it's still a fantastic action camera for 2020, and now with the latest GoPro Hero 8 taking its top spot, it's ever so slightly cheaper. You can currently pick it up for around $100 / £100 cheaper than the Hero 9 Black. A very tempting pick if you're not too bothered about the latest features.",
    "If you want to film your latest adventures in full 360-degree vision then the new GoPro Max is the action camera you've been looking for. Its launch price is much cheaper than the older GoPro Fusion was on day one too.",
    "We're glad to see a proper display screen on the GoPro Max as that was a feature we sorely missed on the older Fusion 360 degree camera. If filming in 360 isn't that high on your priorities, then the GoPro Hero 8 Black is the better camera for you, although the mic quality on the Max is better.",
    "The GoPro Max only requires one memory card now and stitches the footage together in-camera, making editing much simpler and the Max HyperSmooth technology does a much better job at leveling the horizon out - as long as you keep up your end of the deal by not flying over the handlebars and into a tree that is.",
    "For even cheaper still (sometimes), you can sometimes pick up the Hero 7 Black - an older device, but one that still shoots 4K 60fps video, and was the first to feature GoPro's 'HyperSmooth' image stabilization.",
    "The resolution and frame-rates may be similar to the older 6 series (we were bound to hit a wall sooner or later), but GoPro HyperSmooth dramatically increases image stabilization with the Hero 7 Black. This motion smoothing technology can be used in numerous shooting modes to record the smoothest possible video running at 60fps. The voice-activated commands are more responsive than older models too. SuperPhoto tech performs automatic improvements on lighting colour and noise-reduction across multiple frames. ProTune options allow you to take the safety wheels off and tweak setting to your own particular style too.",
    "Right now, depending on stock levels, the Hero 7 Black can sometimes be picked up for around $50 / £50 cheaper than the Hero 8, and about $130 / £130 cheaper than the Hero 9.",
    "Even cheaper still is the GoPro Hero7 Silver - a fantastic budget action camera that still manages to shoot in 4K, albeit at a reduced 30fps.",
    "That's the main difference here between the Silver and Hero7 Black, which will of course shoot in 4K and 60fps. So, you're still getting 4K here and this is generally the most widely available cheap 4K GoPro in 2020 but the picture isn't quite as smooth as on the later or more premium models. The 1080p fps capabilities are slightly lower too and you also don't get the new HyperSmooth, SuperSmooth or Live Streaming features either.",
    "For the $150 / £150 odd price though, this is still an extremely capable, durable, and waterproof action camera. There are cheaper models available on this page though if some of the features seem like overkill or it's still a bit pricey.",
    "The GoPro Hero7 White is perhaps the cheapest widely available GoPro device that's still around in 2020, going for as cheap as $149 / £149 at the retailers which still have stock. That's seriously cheap for a new GoPro camera, though as you can imagine this is definitely more of a stripped-down basic affair than the newer, more premium entries.",
    "This more entry-level GoPro has the main omission of 4K video shooting. You do get a touchscreen though, and plenty of fps for 1080p standard HD resolution. If you'd be happier with 4K shooting instead of a touchscreen though you might be able to get a similar price via one of our highlighted GoPro Hero5 Session deals further down this page.",
    "If you can find it in stock, and for a decent price (we recommend around $200 / £200), the Hero 6 Black is a flagship of yesteryear that still manages to pack in a ton of quality.",
    "This is still an excellent GoPro camera with 4K recording at a super smooth 60 fps (frame per second). Image stabilization is super important given the active lifestyles most GoPros record, so it's great to see this model improve even further on older ones. Even the 1080p recording has been improved with a boost to 240fps - excellent for maximizing those slow-motion shots. We expect the price to drop on this one over time with the new Hero7 Black now on the scene. If the prices are still close though, you may as well opt for the new one.",
    "The Hero5 Black wass the GoPro we wanted for years. It was the first GoPro to have a waterproof design out-of-the-box, making it more resilient and the camera has enough to make it a convincing update on the older models. The picture quality is better, it has video stabilization and the touchscreen makes it easier to use than any other GoPro before it. Sale items aside, it's often cheaper than the older GoPro Hero 4 Black now too.",
    "An oldie, but a goodie, the Hero 5 Black is unfortunately showing its age now but is still a worthwhile pickup if you can score a deal. We definitely wouldn't recommend spending more than $150 / £150 though since there are better, newer options now which are sometimes actually cheaper, depending on stock.",
    "Update: We'd imagine this model is going to be phased out soon despite still being quite new. This is because it's pretty much identical to the ever newer GoPro Hero7 White in terms of capabilities. Actually, it's looking like the Hero7 White is currently cheaper! Always worth keeping an eye on this one though as clearance sales should mean potential discounts.",
    "The simply-named GoPro Hero is cheaper than most other Hero models. You're not getting 4K capture options, but you are getting a display and a touchscreen, features many of you might miss from the other budget GoPro option, the GoPro Hero Session. There was an older GoPro Hero released years ago and if you want to avoid getting that one by mistake, avoid models with a big, round, red light on the front as they can pop up in search results. They're not much cheaper, sometimes even more expensive and aren't as good as this 2018 version.",
    "The GoPro Hero5 Session is a capable 4K action camera with a minimalist design that pushes the specs to the max within its cube-shaped confines. The Hero5 Session is also a major specs boost for GoPro's tiniest action camera. It now shoots stabilized 4K video and has a variety of new field of view modes. It's more expensive than its predecessor, but it's well worth the upgrade.",
    "The model, simply called the GoPro Hero Session, has replaced the very similar GoPro Hero4 Session. They're the same price and considerably cheaper than the most recent GoPro Hero5 Session. Actually, looking around at the various GoPro models, this looks like the cheapest of the lot seeing as the older GoPro Hero is proving hard to get a hold of nowadays. So if you want an entry level GoPro, this could be the one to go for.",
    "Looking to take to the skies with your GoPro camera? There are certainly cheaper camera drones available, but this is one of the best premium setups out there. You can buy the drone on its own (often listed as 'GoPro Karma Light' or 'GoPro Karma with harness'), or get it bundled with the excellent GoPro Hero5 Black camera (some retailers may start to replace these bundles with the more modern Hero6 or Hero7 models instead).",
    "We've also included price comparison charts for both below, but you may be able to save a bit of cash by buying the drone and camera separately (check out the various GoPro Hero Black deals near the top of this page). You'll find the best GoPro Karma prices below though.",
    "You might also want to check out the best cheap dash cam deals and sales."
  ],
  "headers": {
    "4": "The best GoPro prices right now",
    "29": "12: GoPro Karma Drone prices"
  },
  "links": {
    "cheap dash cam": "https://www.techradar.com/deals/cheap-dash-cam-deals-sales-prices"
  }
}