{
  "source": "https://www.techradar.com/news/sorry-nintendo-oled-tv-owners-are-passing-on-the-new-switch-console",
  "title": "Sorry Nintendo – OLED TV owners are passing on the new Switch console",
  "category": "televisions",
  "updated": "2021-07-12T10:44:44Z",
  "author": "henry-st-leger",
  "summary": "We laugh at your tiny OLED",
  "article": [
    "The Nintendo Switch OLED looks to offer a notable picture upgrade when using the Nintendo console in handheld – but is there really a point to it for those already playing Switch games on an OLED TV?",
    "That's the question being asked by OLED TV owners, who have taken to the internet to express their bemusement and dismay at the Switch OLED.",
    "OLED is, of course, the darling of TV manufacturers these days, with self-emissive pixels that allow for vivid colors, deep black, and incredible levels of contrast – which are all things appreciated by cinephiles and gamers alike.",
    "But a recurring refrain is that, those with 48-inch, 55-inch or 65-inch OLED TVs simply can't get excited about a 7-inch display on the new Nintendo Switch – after all, why would you settle for an OLED screen, as good as it is, if it's a fraction of the size of your television?",
    "Playing habits definitely play a role here too. If you've invested in a top-notch TV screen, it's likely you tend towards console gaming docked to a TV, rather than scorning an expensive home theater system to play largely in handheld.",
    "It's a curious opposition in some ways: OLED TV owners clearly have an appreciation for the premium display tech, and you would think those with the disposable income for a high-end OLED screen wouldn't have too much of an issue with buying a Switch OLED that costs a third or quarter of their TV's price tag.",
    "But the great tragedy of the new Switch console is that, despite countless rumors around 4K upscaling capability and upgraded processors, we instead got largely the same internals as the 2017 iteration – just with a new panel.",
    "While the Switch OLED offers an improved experience in handheld (or tabletop mode, given the wider and more stable kickstand), you're going to have an identical experience when the console is docked and connected to a TV.",
    "Back in 2017, Nintendo asserted that, according to data from the first few months of the console's lifespan, players tended slightly towards handheld mode (30% of players) rather than docked (20%). A follow-up poll by NintendoLife in 2020 (with almost 20,000 votes) showed a pretty even split between those who played entirely in docked mode and those who played entirely in handheld (in both cases, 8% of respondees).",
    "It's the former camp that seem largely dismissive of the new console, and why wouldn't they be? One reddit user in r/Nintendo Switch writes that \"As someone who has their switched docked 98% of the time… this is kind of useless. I am baffled there isn’t an increase in power.\"",
    "For those keener on a premium handheld experience, the new Switch OLED may be the ideal upgrade or entry-point into the Switch line of systems. But for anyone with a decent TV setup, or even just a tendency towards playing on a TV screen, the Switch OLED really doesn't offer anything more."
  ],
  "headers": {
    "8": "Handheld vs docked"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "home theater system": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "NintendoLife": "https://www.nintendolife.com/news/2020/10/poll_do_you_play_your_switch_more_in_docked_or_handheld_mode",
    "r/Nintendo Switch": "https://www.reddit.com/r/NintendoSwitch/comments/oex66o/nintendo_has_confirmed_to_the_verge_that_the_new/",
    "keener on a premium handheld experience": "https://www.techradar.com/news/i-dont-need-a-4k-nintendo-switch-but-i-do-want-a-better-handheld"
  }
}