{
  "source": "https://www.techradar.com/news/moto-g20-specs-leak-suggests-the-cheap-phone-is-coming-soon",
  "title": "Moto G20 specs leak suggests the cheap phone is coming soon",
  "category": "phones",
  "updated": "2021-04-22T10:43:51Z",
  "author": "hamish-hector",
  "summary": "But you may just want to get a Moto G30",
  "article": [
    "Motorola could have its next entry-level smartphone the Moto G20 ready for release soon according to the latest reports. The same leak also gave us a full breakdown of the handset’s supposed specs and what it might look like.",
    "According to leaker Nils Ahrensmeier on Twitter, the Moto G20 will come with a 6.5-inch HD+ display, a 5000mAh battery, and a Unisoc T700 processor (which based on current reports is nothing to write home about).",
    "The Moto G20 could be packed with five cameras too, with four on the back (48MP wide, 8MP ultrawide, 2MP macro, and 2MP depth) and a 13MP front shooter.",
    "We also get some new renders for the device, showing off a noticeable bezel around the screen, the camera placements, and the back panel’s fingerprint scanner. And if you thought Apple’s purple iPhone wasn’t bold enough, the Rosa Flamingo Moto G20 could be the option for you.",
    "We won’t know how good the Moto G20 really is until we hold it in our hands, but based on this leaked information we already have a decent idea of what we should expect from Motorola’s next budget handset. Unless we’re blown away in some unexpected way, it doesn’t look like the Moto G20 is a smartphone you’ll need.",
    "We say that because Motorola already has a fine budget phone with the Moto G30. The Moto G20 has specs that sandwich it between the Moto G30 and Moto G10, so we also expect the price to fall between these phones too. But, given that there was only £30 ($40 / AU$55) between the G30 and G10 to begin with, we expect the cost between the G20 and G30 to be far outweighed by the performance improvements.",
    "It’s just a matter of time before the Moto G20 is officially unveiled, but it’s probably not going to be one worth holding out for if you’re looking for a new budget handset."
  ],
  "headers": {
    "4": "How does the Moto G20 stack up?"
  },
  "links": {
    "Nils Ahrensmeier": "https://twitter.com/NilsAhrDE/status/1384819430270586880?s=20",
    "Apple’s purple iPhone": "https://www.techradar.com/news/apples-iphone-12-just-got-a-new-color-option",
    "Moto G30": "https://www.techradar.com/reviews/moto-g30",
    "Moto G10": "https://www.techradar.com/reviews/moto-g10-review"
  }
}