{
  "source": "https://www.techradar.com/news/e-commerce-spending-continues-to-surge-in-the-wake-of-pandemic",
  "title": "E-commerce spending continues to surge in the wake of pandemic",
  "category": "computing",
  "updated": "2021-07-08T09:31:21Z",
  "author": "rob-clymo",
  "summary": "Amazon still leads the way with consumers",
  "article": [
    "New research has revealed that over half of future global e-commerce spend is expected to be online in the wake of the coronavirus pandemic, accounting for 51% of retail sales around the world.",
    "The report from consultancy firm Wunderman Thompson Commerce, surveying 28000 consumers, found that over a quarter, or 27% of consumer spending in the UK is also solely through e-commerce giant Amazon.",
    "At the same time, the research highlighted how consumers around the globe would like Amazon and other online outlets to pay more taxes, with 56% wanting the company to make a larger contribution.",
    "Despite public unease about the amount of tax large e-commerce organisations pay consumers have developed an insatiable desire to shop online. The survey found that 72% of global shoppers reckoned that online shopping was vital during 2020, particularly during lockdown periods. The appeal continues to grow too, with 73% stating that e-commerce would be more important to them for the rest of 2021.",
    "However, somewhat surprisingly, two thirds of shoppers around the world reported that they would still favour shopping with brands that have both an online presence and physical, bricks and mortar stores. The study also highlights the growing need for businesses to digitize their operations faster in order to evolve with the demand for e-commerce features.",
    "A good example is the success of marketplaces operated by the likes of Amazon, Alibaba, JD.com, Mercado Libre and eBay, which now account for 42% of all online spend globally. And, far from making consumers nervous about the potential limitations of sticking with one retailer for buying goods, 64% of people questioned felt enthusiastic about spending their money via the marketplace options of a single retailer.",
    "The presence of Covid-19 remains a strong reason for putting many consumers off shopping in physical stores, with 41% reporting they’re concerned about the prospect of setting foot in a shop. However, the percentage has dropped from the 48% who said the same thing last year. Along with coronavirus fears, consumers also want a more joined-up shopping experience, and expect a seamless journey across both digital and physical channels.",
    "Retailers clearly have work to do, with 73% stating that business owners need to get better at delivering the products, service and overall experience that they’re after. Outlets are therefore faced with beefing up all of their sales channels, including social commerce, which is increasingly becoming a vital part of the e-commerce landscape. The research itself reveals that 44% of global consumers have already bought something via a social platform, while 56% plan to do more of it in the future.",
    "“2021 and beyond will usher in an era of more diverse online offerings, with marketplaces, direct-to-consumer brand sites and social commerce all having a key role to play,” said Hugh Fletcher, Global Head of Consultancy and Innovation at Wunderman Thompson Commerce.",
    "“Businesses must ensure that this more complex online landscape complements their overall retail offering which needs to span digital and physical.”"
  ],
  "headers": {
    "4": "Online shopping"
  },
  "links": {
    "global e-commerce": "https://www.techradar.com/best/best-payment-gateways",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "online outlets": "https://www.techradar.com/best/best-shopping-cart-software",
    "amount of tax": "https://www.techradar.com/best/best-tax-software",
    "online shopping": "https://www.techradar.com/best/best-shopping-cart-software",
    "e-commerce features": "https://www.techradar.com/news/best-ecommerce-hosting",
    "social commerce": "https://www.techradar.com/news/internet/the-reasons-why-instagram-will-be-the-next-big-platform-1306343/2",
    "social platform": "https://www.techradar.com/best/best-social-media-management-tools"
  }
}