{
  "source": "https://www.techradar.com/news/nvidia-to-splash-dollar100m-on-uk-supercomputer-near-arm-hq",
  "title": "Nvidia to splash $100m on UK supercomputer near Arm HQ",
  "category": "computing",
  "updated": "2021-06-18T18:30:41Z",
  "author": "anthony-spadafora",
  "summary": "$100m investment in Cambridge-1 supercomputer is just “a starting point” says Nvidia CEO",
  "article": [
    "Nvidia plans to spend at least $100m on a new supercomputer in the UK that will be located near Arm's headquarters in Cambridge.",
    "The announcement came directly from Nvidia CEO Jensen Huang who let it slip during The Six Five Summit virtual event while speaking alongside Arm CEO Simon Segars with industry analyst Pat Moorhead.",
    "The Cambridge-1 supercomputer will be the UK's fastest supercomputing center yet and while Nvidia said back in October that it would spend £40m (around $55.6m) on the project, it appears that this figure has almost doubled in the time since. However, Huang made the point that the new $100m figure should be considered “as a starting point” so the company could possibly invest even more into the project.",
    "Cambridge-1 won't be the only new supercomputer in the UK though as earlier this year, Huang also revealed plans for Cambridge-2 which will be built by Nvidia and based on Arm's CPU architecture.",
    "As Nvidia is still in the process of trying to acquire Arm for $40bn from Softbank, the company is showing its commitment to Arm's UK operations by investing in the Cambridge-1 supercomputer which will be used to solve AI and healthcare problems.",
    "In addition to speaking at The Six Five Summit, Huang also recently spoke at the CogX conference hosted by Cognition X in King's Cross, London. During the virtual fireside chat with CogX co-founder Tabitha Goldstaub, Huang praised Arm's work while explaining in a blog post how the two companies can help drive future innovation, saying:",
    "“The U.K. is vibrant, with great researchers and scientists. We’re at the beginning of a new revolution, made possible by AI breakthroughs; we just need to lean into it really hard because we can make great strides, great contributions. The U.K. has every reason to be proud of Arm and its achievements and contributions to the world. We would like to combine the CPU capabilities of Arm with the artificial intelligence capability of NVIDIA to create new ideas, new innovations.”",
    "The UK government is currently investing heavily in AI and by showing its commitment to Arm's work in the country, Nvidia may be able to help persuade regulators to approve its $40bn deal.",
    "Via Reuters"
  ],
  "headers": {
    "4": "UK AI investment"
  },
  "links": {
    "supercomputer": "https://www.techradar.com/news/nvidia-is-making-a-3d-map-of-the-universe-with-the-worlds-most-powerful-ai-supercomputer",
    "virtual event": "https://www.techradar.com/best/best-virtual-event-platforms",
    "Cambridge-1 supercomputer": "https://www.techradar.com/news/nvidia-pledges-to-build-britains-largest-supercomputer-following-arm-deal",
    "Arm's CPU architecture": "https://www.techradar.com/news/arm-unveils-most-powerful-cpus-gpus-to-date",
    "acquire Arm": "https://www.techradar.com/news/nvidias-dollar40-billion-arm-acquisition-has-hit-a-speedbump/news/nvidia-ceo-confident-dollar40-billion-arm-deal-will-go-ahead/uk/news/nvidia-buys-arm-in-dollar40-billion-deal",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-1921781402620630000&murl=https%3A%2F%2Fblogs.nvidia.com%2Fblog%2F2021%2F06%2F17%2Fcogx-nvidia-ceo%2F",
    "persuade regulators": "https://www.techradar.com/news/nvidia-ceo-confident-dollar40-billion-arm-deal-will-go-ahead",
    "Reuters": "https://www.reuters.com/technology/nvidia-invest-least-100-million-uk-supercomputer-ceo-says-2021-06-17/"
  }
}