{
  "source": "https://www.techradar.com/news/how-the-apple-watch-7-could-get-thinner-while-extending-battery-life",
  "title": "How the Apple Watch 7 could get thinner while extending battery life",
  "category": "wearables",
  "updated": "2021-01-30T12:00:27Z",
  "author": "david-nield",
  "summary": "Apple has plans",
  "article": [
    "The Apple Watch 7 could well show up later in 2021, and a newly published patent suggests one way that Apple is exploring rearranging the internals – so that the wearable would be both thinner and longer-lasting in terms of battery life.",
    "As spotted by AppleInsider and others, the patent explains how the Apple Watch battery could double up as a vibrating haptic engine – the bit that provides a little bit when you tap the screen – which means the actual haptic engine wouldn't have to be there.",
    "That would mean more space inside the Apple Watch, space which could be filled by a bigger battery (for a longer time between charges) or something else, according to the patent. It leaves plenty of possibilities open for future research.",
    "\"The described embodiments relate generally to electronic devices having a haptic device,\" states the patent. \"More particularly, the embodiments described herein relate to haptic devices that move a battery element to provide a haptic output.\"",
    "As ever with patents, this is no guarantee that anything like this will make it into an actual product from Apple – patents are a good way of finding out what manufacturers are thinking about doing, but it doesn't necessarily mean they'll end up doing it.",
    "And while we've mentioned the Apple Watch 7 as we're expecting to see it around September time, this switch to a haptic-engine-plus-battery might take longer to implement. The benefits might not show up until the Apple Watch 8 or later.",
    "Still, it's an interesting look at how Apple might improve what is already quite a classic and refined design. There aren't too many ways that the Apple Watch aesthetic could be modified, but a watch that's thinner and lighter would definitely be welcome.",
    "Apple certainly seems keen to continue to push the health and fitness features of the Apple Watch in future generations of the product, and is likely to pack it with even more sensors and smart software to keep track of your wellbeing."
  ],
  "headers": {
    "4": "Watch this space"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "AppleInsider": "https://appleinsider.com/articles/21/01/28/future-apple-watch-may-move-its-battery-to-give-haptic-feedback",
    "patent": "http://appft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.html&r=29&p=1&f=G&l=50&d=PG01&S1=(apple.AANM.+AND+20210128.PD.)&OS=aanm/apple+and+pd/1/28/2021&RS=(AANM/apple+AND+PD/20210128)",
    "seems keen": "https://www.techradar.com/news/apple-watch-7-will-double-down-on-fitness-features-judging-by-tim-cooks-comments"
  }
}