{
  "source": "https://www.techradar.com/news/microsoft-could-fix-one-of-windows-11s-biggest-problems",
  "title": "Microsoft could fix one of Windows 11’s biggest problems",
  "category": "computing",
  "updated": "2021-09-20T10:28:30Z",
  "author": "matt-hanson",
  "summary": "Taskbar gets better",
  "article": [
    "Windows 11 comes with some pretty impressive changes that set it apart from Windows 10, but there are some changes, especially to the Taskbar, which have not gone down well with people – and thankfully it seems Microsoft is listening.",
    "The Taskbar, which runs along the bottom of the screen, has seen some of the biggest – and most controversial – changes in Windows 11, including the fact that users can no longer drag and drop files onto icons of apps pinned to the Taskbar.",
    "In Windows 10, and other previous versions of Windows, this was a handy way of quickly opening up files in the app of your choice, so Microsoft’s decision to drop that feature from Windows 11 was rather perplexing.",
    "However, it looks like Microsoft is planning to reverse this decision, and allow the dragging and dropping of files onto the Taskbar.",
    "As WinCentral reports, the NTAuthority twitter account, claims that the Taskbar is planned to support drag and drop at some stage.",
    "The NTAuthority account appears to be run by a developer with knowledge of Windows 11 and other Microsoft products, though we can’t be too sure how dependable they are (though WinCentral appears to trust them).",
    "The account did share a video showing that under some circumstances dragging and dropping files onto apps on the Taskbar is already supported in Windows 11.",
    "Considering the functionality appears to be in Windows 11 in some form already, and the vocal backlash Microsoft has endured over removing the feature in the first place, we think regardless of NTAuthority’s… authority… it’s likely that the ability to drag and drop to the Taskbar will come to Windows 11 at some point – though it may not arrive before the official launch on October 5.",
    "If Microsoft is indeed fixing dragging and dropping on the Taskbar, the lack of which we feel is currently one of the biggest problems with Windows 11, then it shows that the company is taking into account feedback from early users of the operating system.",
    "This would be welcome news, and is one of the reasons why Microsoft made Windows 11 relatively easy to try out early. Not only do these early ‘Insider’ builds of Windows 11 help Microsoft identify bugs and problems with the OS before its official launch (with users giving feedback on any issues they encounter), but it’s also an opportunity for Microsoft to hear about features or elements of Windows 11 that is customers like or dislike.",
    "So, if Microsoft is changing a feature based on negative feedback, it shows that the system works, and Windows 11 should hopefully be a better operating system as a result."
  ],
  "headers": {
    "4": "Change of plans",
    "8": "Analysis: The system works (hopefully)"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "WinCentral reports": "https://thewincentral.com/microsoft-to-bring-a-major-windows-11-taskbar-missing-feature-back/"
  }
}