{
  "source": "https://www.techradar.com/news/how-to-watch-coming-2-america-online-stream-eddie-murphy-sequel-anywhere",
  "title": "Coming 2 America out now on Amazon Prime Video - here's how to watch it for free",
  "category": "entertainment",
  "updated": "2021-03-05T11:08:15Z",
  "author": "james-laird",
  "summary": "Sequel to classic 80s Eddie Murphy movie an Amazon Original",
  "article": [
    "Amazon has released the sequel to classic 1988 Eddie Murphy comedy Coming to America on its Prime Video streaming service all over the world. That means you can watch Coming 2 America online today on the platform.",
    "Prime Video is also where you'll find the original movie available to stream, so it's great news whether you're completely new to Murphy's 80s exploits, or get a bit giddy (and feel old) when we tell you Arsenio Hall is also back and on the plane from Zamunda to New York.",
    "Best of all, you can watch both movies online right now without paying a penny - all you need to do is sign up for a FREE 30-day Prime Video trial and they're yours. You can cancel at any time during the offer, too, so free really does mean free in this instance.",
    "Coming 2 America see Murphy reprise his role as the Akeem Joffer - or rather, newly crowned King Akeem Joffer, as he becomes leader of fictional African nation Zamunda after his father Jaffe - played again by the legendary James Earl Jones - vacates the throne.",
    "Knowing he needs an heir of his own, Akeem decides to travel back to where it all began for him - Queens, New York - and find his long lost son. As in the original, his best friend and confidant Semmi (Arsenio Hall) comes along for the hilarious journey.",
    "There's some notable new blood in the Coming 2 America cast, too, as Wesley Snipes plays General Izzi, the leader of neighboring Nextdoria, who's keen to see Akeem overthrown and plots his downfall in his absence.",
    "So whether you've been eagerly anticipating this sequel since it was first announced, or simply need a new lighthearted comedy to help ease you into the weekend, Coming 2 America fits the bill - as does the original, if you haven't seen it.",
    "It's something of a no-brainer if you do want to check either of them out, given Amazon's free 30-day Prime trial means you can watch them for free. Just follow the appropriate link below, hit the bright orange 'Watch with Prime' button, and sign up with confidence knowing you can cancel the offer at any time.",
    "Should you decide to keep the service (and it's a great one to have, between the riches of Prime Video and Amazon's famous free one-day Prime delivery), it costs just $12.99 a month or save by getting a yearly Prime subscription for $119. And just to reiterate, you get full access to the core Prime Video library included in that fee - there's no hidden extras.",
    "If you think that being able to watch both all-new Coming 2 America and the classic 1988 original free with a 30-day Prime Video trial sounds good, Amazon has even more treats in store for you on its streaming platform.",
    "The service also exclusively hosts some of the most recent critically-acclaimed movies around, including being the place to watch One Night In Miami and watch Sound of Metal - both recent award winners and among the favorites for the Oscars this year.",
    "There's even more riches in Steve McQueen's Small Axe miniseries; comedy gold like Borat 2; can't-miss TV shows including Billions, The Affair, The Boys, Mr Robot, and Downtown Abbey; and plenty more classics too, from The Truman Show to Dazed and Confused.",
    "If you're a US resident outside of the country for whatever reason right now, then geo-blocking restrictions will stop you from watching one of Hollywood's greatest trilogies online via Amazon Prime Video.",
    "Fortunately, there’s a simple solution in the form of a VPN. It's a piece of software that, once downloaded and installed, lets you temporarily relocate your device's IP address to a country of your choosing.",
    "ExpressVPN is our no. 1 rated VPN and the ideal solution for UK residents wanting to watch British streaming services like iPlayer from abroad. It's fast, easy to get up and running (it only takes a couple of minutes), and is compatible with nearly all modern devices including Amazon Fire TV Sticks, Apple TVs, Xbox and PlayStation consoles, Windows and Mac computers, and iOS and Android hardware."
  ],
  "headers": {
    "3": "Good morning, my neighbors!",
    "8": "What else does Amazon Prime offer?",
    "9": "More movies to watch with a FREE 30-day Prime Video trial",
    "12": "How to watch Prime Video online from outside the country"
  },
  "links": {
    "FREE 30-day Prime Video trial": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FComing-2-America-Eddie-Murphy%2Fdp%2FB08R114191%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1293095034132804900-20",
    "30-day Prime Video trial": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBack-Future-Michael-J-Fox%2Fdp%2FB00498XR9U%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6462137054215785000-20",
    "watch One Night In Miami": "https://www.techradar.com/news/how-to-watch-one-night-in-miami-online-stream-free-anywhere",
    "Sound of Metal": "https://www.techradar.com/news/how-to-watch-sound-of-metal-online-stream-the-award-winning-movie-from-anywhere",
    "Small Axe": "https://www.techradar.com/news/how-to-watch-small-axe-online-stream-new-steve-mcqueen-bbc-series-free-and-anywhere",
    "Borat 2": "https://www.techradar.com/news/how-to-watch-borat-2-online-stream-borats-subsequent-moviefilm-anywhere",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn"
  }
}