{
  "source": "https://www.techradar.com/news/microsoft-teams-update-will-make-remote-learning-a-little-less-tricky",
  "title": "Microsoft Teams update will make remote learning a little less tricky",
  "category": "computing",
  "updated": "2021-10-06T18:16:19Z",
  "author": "anthony-spadafora",
  "summary": "Microsoft has added a new Class Insights tab to Teams",
  "article": [
    "At this year's BettFest conference, Microsoft announced that it's rolling out a new update to Teams that will make easier for educators to manage their remote classes using the company's collaboration software.",
    "With the new Class Insights tab in Teams, educators will be able to gain insights into how their students are performing in their classes. By adding the Class Insights tab to their class team, they can see average grades, on-time assignments, average return time and conversation activity for their class over time.",
    "Educators using Teams will now have a single view to observe both individual student and class performance. Using data from the Class Insights tab, teachers will be able to make more informed decisions about their curriculum, pacing and student engagement.",
    "Microsoft also recently added breakout rooms to Teams to allow teachers to easily divide students into separate groups to facilitate discussions, encourage participation and foster collaboration.",
    "Teachers will also soon be able to protect their students and ensure their well-being in Teams thanks to Gaggle Safety Management which uses machine learning to analyze and block potentially harmful content, determine the severity and escalate urgent cases to school authorities and law enforcement.",
    "In fact, Gaggle currently protects 4.5m US students and last year the service was used to deescalate over 80,000 cases of self-harm and school violence. While Gaggle products are currently available in Word, Excel, PowerPoint, OneDrive and Outlook, Safety Management will be coming to Teams in early access next month.",
    "In order to help teachers begin using Teams while teaching remotely, Microsoft has also created a new Learning Path for educators called Master Microsoft Teams for Remote Learning. The online course consists of five one-hour training courses each with their own resources, teacher training packs and a quiz.",
    "Although Teams made its debut as a communications platform for the enterprise, Microsoft has made a number of additions to the platform so that it can also be used by teachers in their distance learning programs."
  ],
  "headers": {
    "4": "Safety management and training"
  },
  "links": {
    "BettFest conference": "https://www.techradar.com/news/top-tech-conferences-the-ultimate-tech-events-and-show-guide",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "breakout rooms": "https://www.techradar.com/news/your-next-big-company-conference-could-now-be-held-entirely-on-google-meet/news/microsoft-teams-calls-are-getting-bigger-than-ever",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "Master Microsoft Teams for Remote Learning": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9310959721268204000&murl=https%3A%2F%2Feducation.microsoft.com%2Fen-us%2FlearningPath%2Fcbc4f6de",
    "online course": "https://www.techradar.com/best/online-class-sites-do-these-online-courses-from-the-comfort-of-home"
  }
}