{
  "source": "https://www.techradar.com/news/samsung-didnt-renew-its-note-trademark-so-what-does-that-mean-for-note-22",
  "title": "Samsung didn't renew its Note trademark, so what does that mean for Note 22?",
  "category": "phones",
  "updated": "2021-09-07T09:12:11Z",
  "author": "james-peckham",
  "summary": "The clearest sign yet?",
  "article": [
    "The Samsung Galaxy Note 21 isn't coming this year, and new trademark listings in the company's home country of South Korea suggest we may not see any new Galaxy Note devices in the future either.",
    "Spotted by GalaxyClub, Samsung has recently renewed its trademarks for a variety of names including the Galaxy S, Galaxy Z, Galaxy M and Galaxy A series.",
    "The notable exception there is the Galaxy Note series. It being missing from this list seems like a clear indicator that the company doesn't intend to introduce a Galaxy Note 22 in 2022.",
    "In 2021, the company decided to focus on the foldable Galaxy Z Fold 3 and Galaxy Z Flip 3 rather than releasing a new Galaxy Note handset.",
    "It's thought Samsung is pushing its foldable phones more, so it may be we see a Galaxy Z Fold 4 and Galaxy Z Flip 4 arrive in the second half of 2022 following the Galaxy S22 earlier in the year.",
    "Samsung has also introduced S Pen support - the Galaxy Note's defining feature - to the Galaxy S21 Ultra and Galaxy Z Fold 3, so those who want a stylus are able to choose either of these handsets.",
    "The short answer is... we're not certain. This information is a big hint that we won't see a Galaxy Note 22 or Galaxy Note 23 in future years, but it's far from confirmation, as trademarks are such a complicated business.",
    "This trademark information only relates to South Korea for now, and there may be other reasons why the Galaxy Note name isn't included.",
    "Samsung often trademarks names it won't use - this is common practice for consumer technology brands - as well as the names it does grab. Just because a company hasn't taken a name this far ahead of time doesn't mean it won't use that in future.",
    "For example, Samsung trademarked the name UPC - that stands for Under Panel Camera - in January 2021. That was a feature it then introduced on the Galaxy Z Fold 3 in August of the same year.",
    "As we wouldn't expect a Galaxy Note phone until August 2022, it may be that the company decides to trademark the name further along the line.",
    "Other leaks and rumors have suggested that Samsung won't be making a Galaxy Note 22 though, so it's not looking like positive news if you were hoping for one in the next year."
  ],
  "headers": {
    "6": "Analysis: Is the Note series definitely dead?"
  },
  "links": {
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "GalaxyClub": "https://www.galaxyclub.nl/nieuws/samsung-ververst-merkrechten-bestaande-telefoonseries-op-een-na/",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "rumors have suggested": "https://www.techradar.com/news/samsung-galaxy-note-21-cancelation-might-also-mean-the-note-22-is-gone"
  }
}