{
  "source": "https://www.techradar.com/news/google-pixel-watch",
  "title": "Google Pixel Watch release date rumors, price, news and leaks",
  "category": "wearables",
  "updated": "2021-12-05T21:41:25Z",
  "author": "james-peckham",
  "summary": "Waiting for news of a flagship Google watch",
  "article": [
    "The Google Pixel 6 and Pixel 6 Pro have now been unveiled and while it was rumored that the Pixel Watch might arrive at the same time, it wasn't to be. Given all we've heard about a Google Watch, we can surmise that it's been in development, but the big question then is when it will arrive.",
    "The latest report says it'll arrive at some point in 2022, so you can likely expect to be able to buy the new smartwatch next year.",
    "Just like how Pixel phones are a showcase for Android, the Google Pixel Watch is expected to be an example of the full potential of Wear OS – and given the wearable operating system's big update was shown off at Google IO, we figured the watch wasn't far behind.",
    "Below we're going to break down everything we know so far about the upcoming watch. Then, further down, we've put together a list of the features we'd like from the first flagship Google Watch.",
    "An exact release date for the rumored Google Pixel Watch isn't clear – just predictions based on leaks. The latest report from Insider claims to have spoken to people familiar with the matter who suggest it's coming in 2022.",
    "That matches what we've heard from other sources in recent months, but the Pixel Watch has been rumored to be in development for a good number of years now.",
    "A tweet from noted leaker Evleaks claiming a \"reliable source\" said it would be announced alongside the Google Pixel 3 and Pixel 3 XL back in 2018, then a rumor claimed the Google Watch would land on October 15 2019 at the Pixel 4 launch – but of course, neither happened, and we're still waiting.",
    "We're fairly confident that such a watch is in the works though, and it's possible that the Pixel Watch could benefit from Google's acquisition of Fitbit, which could see the latter company's wearable skills put towards Google smartwatch hardware, but that deal was only finalized in January 2021.",
    "A smartwatch based on Fitbit's tech is probably unlikely to land in the near future – though Google has announced that a premium Fitbit running Wear OS is in the works.",
    "Better still, at Google IO 2021 the company announced that Wear OS is integrating features from Samsung's Tizen OS, which could suggest what's coming in the Google Watch.",
    "We've also heard that Google has reportedly ordered processors from Samsung (according to ETNews) which would be capable of detecting body movements. There's no guarantee that these are for a smartwatch (they could be for a Pixel phone) but a wearable would be an obvious fit. That, then, is strong evidence that some form of Pixel Watch is in the works.",
    "As for price, we don't currently have any idea how much this watch will cost. Considering the Pixel range is usually high-end products with generally flagship level prices, we'd expect that but we don't currently have any evidence supporting it.",
    "In terms of spec, there isn't much known about the Google Pixel Watch, though one source suggests it will use a 5nm chipset - likely the same one as the Samsung Galaxy Watch Active 4 is rumored to have. You can expect a 5nm chipset to be much more powerful than the ones we've seen in current Wear OS watches.",
    "We've also seen a Google patent, which details a gesture control system that would allow a smartwatch to detect movements you make with your arm, wrist or fingers.",
    "For example, you could make a fist to launch Google Assistant and open the fist to dismiss it. These gestures would be done on the arm or hand that the watch is worn on. However, patents aren't always used, so there's no guarantee we'll see this.",
    "There could also be a big focus on fitness, both because Google is buying Fitbit, and because Google sent out a survey asking people about features they'd like to see in Wear OS, and those features included things like SPO2 (oxygenation) tracking, sleep apnea detection, sleep analysis, heartbeat alerts, recovery time monitoring, stress tracking, pairing for medical devices and gym equipment, rep detection, and calorie tracking.",
    "Of course, it's unlikely they would all be added, but some may well be, and it shows that Google is thinking about health and fitness.",
    "As for specs, the Pixel Watch is likely to run Qualcomm's latest Snapdragon Wear 4100 Plus chipset that will mean lots of power for running your favorite apps on your wrist.",
    "One rumored feature was something codenamed 'Blackghost'. It was thought to be be a power management integrated circuit built into the chipset itself that will allow the watch to listen out for voice commands at all times without draining the battery.",
    "That isn't a feature on the Snapdragon Wear 4100 Plus, but it may be Google has found a way to make it an exclusive feature for the Pixel Watch when it launches - or that the watch will use a newer chipset.",
    "If so, expect to be able to ask Google Assistant questions without either draining your smartwatch after a few hours or having to press a button beforehand.",
    "Another report - this time from WinFuture - has suggested there may actually be three versions of the Pixel Watch in development. The website has heard word of devices with code names Ling, Triton and Sardine all in development at Google HQ.",
    "Exactly what the differences for the devices would be are currently unclear. It may mean we'll see three variants of the Pixel Watch. That same report also suggested at least one version of the watch will come with 1GB of RAM.",
    "This report could mean there will be one watch in the range with LTE or another that's designed to be more focused on fitness, but so far we've yet to hear any rumors of what those different versions will be. This report is also quite old now, so it may no longer be relevant.",
    "Rumors died down for over a year until April 2020, when a leak suggested the Pixel Watch could have a feature typically reserved for analog timepieces: a physical crown, according to an image from leaker Jon Prosser.",
    "Prosser followed up with a batch of rendered images based on info provided by a source which show potentially the first full looks at the Pixel Watch's supposed design. Here's the full video of Prosser's reveal.",
    "Per the renders, the Pixel Watch looks like a circular smartwatch with a bezel-less display, no buttons, and a single physical crown on the right side. The renders also recreate the suggested interface, including a watch face with radial time markers, giving it an analog timepiece look. The apps look very simple, suggesting Google could be going for a more elegant minimalist design.",
    "We've since seen what is supposedly a leaked image from Google's marketing department, showing off what the Pixel Watch is going to look like. You can check it out below – the lack of bezel and the minimal design matches up with the unofficial renders we've also seen.",
    "Below we've put together a list of the things we want to see from the Google Pixel Watch.",
    "Before the switch to Wear OS, Android Wear 2.0 put a big focus on how the design had been reworked to play well with rotating bezels and crowns, but then we haven't seen many watches embrace that.",
    "Why not use it for the Google Pixel Watch? Those features may be far in Google's rear view mirror as the Wear OS updates take precedent, but we'd love to see an innovative way of interacting with the watch such as a rotating crown or bezel.",
    "If Google really wants to put the Pixel Watch on the map, adding an in-display fingerprint scanner would go a long way to doing that. Currently Wear OS watches (and the Apple Watch) allow you to secure them with a PIN code – but that’s not the most secure form of protection available.",
    "With an in-display fingerprint scanner, the secure biometric technology would fit seamlessly into the wearable without disrupting the visual appeal of the watch. It would also allow you to approve purchases over the current contactless limit (assuming the Pixel Watch comes with NFC).",
    "There are a couple of potential negatives here though. Firstly, the addition of this fledgling technology could increase the thickness of the watch – and no one wants an overly chunky wearable – but secondly it’ll also likely push the price tag way up.",
    "If Google can overcome these two things though, you can sign us up for a Pixel Watch right now.",
    "We’re used to smartwatches coming with a level of dust and water resistance, but few carry an IP certification high enough to ensure their survival when we cannonball into the local pool.",
    "A fully swim-proof Google Pixel Watch would not only allow you to keep the wearable on in the bath, but also allow you to track workouts in the pool without fear of malfunction.",
    "This is a simple one, but we want the Google Pixel Watch to last as long as it can. Imagine a fully fledged smartwatch that doesn't need charging after two days of intensive usage.",
    "Wear OS is integrating a useful enhanced battery saver mode that should give you a lot more time with your smartwatch, but it'll limit the amount of features you can use when it's on.",
    "Clearly Google wants to improve how long your watch will last from one charge, but we'd love to see a big battery inside the watch and well optimized software that offers the best battery for a smartwatch on the market right now.",
    "Another simple one here, but quite a few Wear OS watches don't come with NFC built in so you aren't able to use Google Pay features on your wrist. That's a frustration for a lot of people, so we're hoping Google will include an NFC chip inside the watch.",
    "That'll especially be useful when you're out for a run and you need to buy a bottle of water, but you've left your wallet at home.",
    "While we're on the topic of running, we want the Pixel Watch to compete with the fitness prowess of the Apple Watch 3 as well as top-end specialist watches like the Garmin Forerunner 935.",
    "Imagine if Google can include all of the latest tracking tech including accurate GPS, LTE so we can listen to music on the go as well as a top of the range heart rate tracker.",
    "We want to be able to strap the Google Pixel Watch to our wrist and head out for any type of exercise and know we'll be tracked accurately and get as much fitness stats as we possibly can.",
    "This one is a given, but we want to see a watch that you're not embarrassed to wear on your wrist. Not every Wear OS watch is a gorgeous creation, so we wish Google will be able to offer a slimmer option than most other manufacturers that uses high-end materials and feels like a proper timepiece you're excited to wear.",
    "If you're going to be spending a fair amount of money on a new watch, you'll want it to look great on your wrist so this is one of the most important things we want to see on the new wearable."
  ],
  "headers": {
    "4": "Google Pixel Watch release date and price",
    "12": "Google Pixel Watch news and rumors",
    "28": "What we want to see",
    "29": "1. Rotating crown or bezel",
    "31": "2. In-display fingerprint scanner",
    "35": "3. Swimproof",
    "37": "4. Three day battery life",
    "40": "5. NFC payments",
    "42": "6. Best in class fitness",
    "45": "7. High-end watch design"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "latest report": "https://www.techradar.com/news/report-google-pixel-watch-coming-in-2022",
    "Pixel phones": "https://www.techradar.com/news/best-pixel-phones",
    "Android": "https://www.techradar.com/news/android-12-news",
    "big update": "https://www.techradar.com/news/wearos-is-finally-getting-an-update-that-might-make-its-smartwatches-good-again",
    "Insider": "https://www.businessinsider.com/google-pixel-watch-rohan-android-smartwatch-development-fitbit-launch-2021-12",
    "Evleaks": "https://twitter.com/evleaks/status/994585799235600384",
    "claimed": "https://www.techradar.com/news/google-pixel-watch-could-be-coming-alongside-the-pixel-4",
    "Google's acquisition of Fitbit": "https://www.techradar.com/news/google-is-buying-fitbit-so-could-we-finally-get-a-pixel-watch",
    "only finalized in January 2021": "https://www.techradar.com/news/google-finalizes-fitbit-acquisition-despite-continuing-antitrust-investigations",
    "premium Fitbit running Wear OS": "https://www.techradar.com/news/google-is-building-a-premium-fitbit-smartwatch-running-wear-os",
    "announced": "https://www.techradar.com/news/wearos-is-finally-getting-an-update-that-might-make-its-smartwatches-good-again",
    "ETNews": "http://english.etnews.com/20200804200001",
    "it will use a 5nm chipset": "https://www.techradar.com/news/google-pixel-6-might-have-a-disappointing-chipset-and-an-upgraded-camera",
    "Samsung Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "a Google patent": "https://www.techradar.com/news/google-pixel-smartwatch-could-launch-with-an-innovative-gesture-feature",
    "sent out a survey": "https://www.techradar.com/news/googles-next-wear-os-update-could-go-all-in-on-health-features",
    "WinFuture": "http://winfuture.de/news,103172.html",
    "three versions of the Pixel Watch": "https://www.techradar.com/news/google-may-have-three-new-wear-os-smartwatches-instead-of-one-pixel-watch",
    "image": "https://www.techradar.com/news/google-pixel-watch-leak-hints-at-the-most-stunning-smartwatch-yet",
    "looks": "https://www.techradar.com/news/google-pixel-watch-leak-hints-at-the-most-stunning-smartwatch-yet",
    "full video of Prosser's": "https://youtu.be/xioX3XTRomM?t=152",
    "since seen": "https://www.techradar.com/news/the-google-pixel-watch-shows-up-again-in-newly-leaked-marketing-images",
    "Apple Watch": "https://www.techradar.com/reviews/wearables/apple-watch-1264567/review",
    "enhanced battery saver mode": "https://www.techradar.com/news/wear-os-watches-could-soon-last-longer-thanks-to-an-enhanced-battery-saver-mode",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "Garmin Forerunner 935": "https://www.techradar.com/reviews/garmin-forerunner-935-review"
  }
}