{
  "source": "https://www.techradar.com/news/ifa-2021-cancelled-due-to-global-health-uncertainties",
  "title": "IFA 2021 cancelled due to ‘global health uncertainties’",
  "category": "computing",
  "updated": "2021-05-19T11:11:37Z",
  "author": "axel-metz",
  "summary": "Another one bites the dust",
  "article": [
    "IFA 2021 has been cancelled due to “global health uncertainties” brought about by the continued impact of the Covid-19 pandemic.",
    "The world's leading trade show for consumer and home electronics was due to take place September 3 to September 7 as a full-scale live event in Berlin, but emerging virus variants and concerns over vaccine rollout in Germany have forced its cancellation.",
    "It’s unclear whether IFA 2021 will be replaced by an online equivalent, though IFA organizers have confirmed they’re now working with their partners from industry, trade and media to ensure next year’s event – scheduled to begin on September 2, 2022 – can be hosted as a physical exhibition.",
    "The decision was made following detailed conversations with public health experts and multiple stakeholders, with a press statement citing “the rapid emergence of new COVID-19 variants” and “continued uncertainties about the speed of the rollout of vaccination programmes around the world” as the reason for IFA 2021’s cancellation.",
    "“The latest public health developments introduced too much risk into everybody's planning for the event,\" said Kai Hillebrandt, Chairman of the Supervisory Board of gfu Consumer & Home Electronics GmbH. \"Innovation needs a platform; it needs the focus of global attention. That's why brands and manufacturers across the tech industry were very keen to come to IFA Berlin 2021.”",
    "\"There are simply now too many uncertainties. Therefore, it has become near impossible for anyone to responsibly plan their participation in any trade show,” he added.",
    "As well as concerns over emerging Covid-19 variants, Messe Berlin – the show’s intended host – hinted at issues posed by converting parts of its exhibition area into a vaccination centre and emergency hospital facility. Both are now likely to be required for longer than originally anticipated, with infection rates still high in Germany.",
    "\"We did not take this decision lightly,” Martin Ecknig, CEO of Messe Berlin, said in a statement. “IFA Berlin is arguably the most important event of the year for brands and retailers alike. [It] connects our industry with trade visitors, media and real consumers like no other event. However, the health and safety of everybody has to be absolutely paramount.”",
    "Preparations for Berlin Photo Week at ARENA Berlin and SHIFT Mobility are continuing as planned.",
    "With other major exhibition events scheduled to take place in 2021, it will be interesting to see if the cancellation of IFA 2021 plays a part in influencing more organizers to follow suit.",
    "Mobile World Congress (MWC) 2021, for example – the world’s largest mobile developer showcase – is set to go ahead as planned in Barcelona, at the time of writing, between June 28 and July 1.",
    "The event typically attracts around 100,000 attendees, but this year the GSMA (the show’s organizers) are aiming for only around 50,000 attendees, with many companies and countries facing travel restrictions.",
    "Several major names have already pulled out, mind. On March 8, Ericsson, one of the largest companies set to attend the event, announced they would be withdrawing due to virus concerns. More recently, Samsung – biggest phone company in the world – also confirmed it won't have a physical presence at the big tech conference.",
    "Will the cancellation of IFA 2021 spell doom for events like MWC 2021, then? The pandemic situation varies from country to country, of course, but with large exhibition showcases like these reliant on the attendance of companies from across the globe, things aren’t looking so promising.",
    "In any case, we’ll keep you updated."
  ],
  "headers": {
    "9": "The first domino?"
  },
  "links": {
    "Mobile World Congress (MWC) 2021": "https://www.techradar.com/news/mwc-2021-news",
    "confirmed it won't have a physical presence": "https://www.techradar.com/news/no-galaxy-s21-fe-or-z-flip-3-samsung-puts-another-nail-in-mwc-2021s-coffin"
  }
}