{
  "source": "https://www.techradar.com/news/inmotion-hosting-snaps-up-ramnode",
  "title": "InMotion Hosting snaps up RamNode",
  "category": "computing",
  "updated": "2021-03-08T10:48:11Z",
  "author": "mayank-sharma",
  "summary": "CEO confirms deal, with official notice arriving soon",
  "article": [
    "California-based web hosting company InMotion Hosting has acquired cheap but popular VPS hosting provider RamNode.",
    "The news started out as a rumor, but was later confirmed by InMotion Hosting’s co-founder Sunil Saxena.",
    "“I understand that there has been some speculation about the acquisition of RamNode by InMotion Hosting. We were planning on sending out the official press releases next week, but I wanted to give you a brief update here,” wrote Saxena in a forum post confirming the news.",
    "RamNode has been around since 2012 and made its name in the VPS hosting domain for offering useful features at an affordable price. Its infrastructure is based on OpenStack, with the company offering its hosting solutions from data center locations throughout the US as well as in Europe via a colocation facility in the Netherlands.",
    "While details of the acquisition will only be known when InMotion puts out a press release, Saxena did confirm that RamNode will continue to run as is without any rebranding, adding that the company isn’t planning to make any changes to RamNode’s offerings at the moment.",
    "Saxena also shared that all of RamNode’s staff will move over to InMotion Hosting, except for its founding CEO, Nick Adams.",
    "“Nick is a great guy. He and I have spent quite a bit of time on the phone getting to know each other personally and professionally. Nick and I really felt that InMotion Hosting was the best move for his customers and employees,” shared Saxena.",
    "The acquisition will allow InMotion to tap into some of the more technically inclined strata of RamNode customers, who in-turn might welcome the backing of a reputable brand like InMotion, assuming of course the new owners don’t rework the pricing on RamNode’s offerings."
  ],
  "headers": {
    "3": "No rebranding"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "InMotion Hosting": "https://www.techradar.com/reviews/inmotion-hosting",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "a forum post": "https://www.lowendtalk.com/discussion/170229/re-ramnode-and-inmotion-hosting",
    "OpenStack": "https://www.techradar.com/news/software/what-on-earth-is-openstack-1112804",
    "colocation facility": "https://www.techradar.com/news/best-colocation-hosting"
  }
}