{
  "source": "https://www.techradar.com/news/far-cry-vr-is-a-fun-and-sweaty-dive-into-insanity-before-far-cry-6-but-its-not-really-a-far-cry-game",
  "title": "Far Cry VR is a fun and sweaty ‘dive into insanity’ before Far Cry 6 – but it’s not really a Far Cry game",
  "category": "gaming",
  "updated": "2021-08-16T15:13:40Z",
  "author": "gerald-lynch",
  "summary": "Less sneaky-sneaky, more shooty-shooty",
  "article": [
    "Gaming baddies don’t come much more unhinged than Far Cry 3’s Vaas Montenegro, coming at you like Batman’s Joker if he’d got a tropical paradise suntan instead of applying factor 100 sunscreen in some dingy Gotham alleyway. It’s set to be a big year for Vaas – he’s definitely returning for Far Cry 6’s upcoming DLC packs – and may even feature in the campaign in some as-yet-uncertain way. And now he’s starring in the Far Cry franchise’s first foray into virtual reality.",
    "But there’s a catch – yes, Far Cry VR: Dive Into Insanity does see the Far Cry character exist in a VR space. And yet, it’s a Far Cry game in name alone.",
    "As the TechRadar team found out during a recent playthrough, however, that’s not necessarily a bad thing.",
    "Far Cry VR: Dive Into Insanity is a free-roaming VR experience that’s being hosted at Zero Latency virtual reality locations around the globe (52 in total, with 3 in the UK and 11 in the United States). Returning to Far Cry 3’s Rook Island, you (and a gang of up to seven pals) find yourself captured by the villainous Vaas, and must work together to blast your way out of the pirate’s clutches.",
    "Though you may be familiar with PC VR, the Oculus Quest or PlayStation VR, Zero Latency works a little bit differently. For starters, you’re out of your bedroom or living room, and out in a warehouse-sized play space, hosted by a game master that will help get the experience set up. Each player is given an OSVR HD2K headset to wear, attached to a gaming laptop housed in a backpack and networked up wirelessly with your fellow players. You’re then handed a pump-action gun peripheral (complete with motion trackers) and, after a short set up screen to confirm your height and name tag, thrust into the virtual reality world.",
    "From there you’re free to run around with relatively few restrictions – a really freeing experience for anyone sick of the confines of “room scale” play in a pokey flat or house. At Zero Latency you’ve got roughly the space of a tennis court to run around in, with the headset UI smartly warning when you’re approaching a real-world wall or another player. In terms of full motion and immersive movement, it’s about as good as VR gets.",
    "Far Cry VR: Dive Into Insanity itself is very straightforward however. The interlocking emergent systems of the Far Cry series are gone – there are no stealthy kills, no animal taming, no crafting and no open world. Dive Into Insanity is very much a points-based, on-rails shooter. There’s more in common here with arcade staples like Time Crisis or House of the Dead than the free-roaming we’ve come to expect from Far Cry.",
    "And yet in the context of a multiplayer shooter, that’s fine. Chasing the highest score is far more of a novelty when side-by-side physically (read: virtually) with your pals. Dive Into Insanity does a good job of recreating the visual feel of Far Cry’s third instalment – all lush tropical jungles, bandana-wearing pirates, rusty container sheds and exploding barrels. There’s even a hallucinogenic shootout in a mysterious cavern through which sea creatures float and pirates take potshots at you from the ceiling – a high point of the experience. Zero Latency VR’s weapon peripheral is responsive and accurate too (provided you’ve correctly entered your height, that is), letting you switch on the fly between a bullet-spewing, Rambo-aping machine gun and a more refined and accurate one-hit-kill crossbow.",
    "Where the six TechRadar players would have liked to have seen it be a little more ambitious however was in its environmental level design – for the most part, you’re funnelled from one arena-like shooting zone to another, with distant enemies to be picked off from afar, while you’re stood shooting from a cave ledge or moving cable car. It’d have been great to have been able to take the inherent three-dimensionality of virtual reality to have been able to have sprung some pincer-style surprise team attacks. Also, the final battle against Vaas and his cronies was a bit drawn out too, overly reliant on waves of enemies rather than the show stopping spectacle a VR game’s scale could be capable of.",
    "Despite these grumbles, we had a lot of fun – and, despite the relative lack of interesting level layouts to navigate, quite the workout too. Without going into too much gory detail, we were dripping with sweat by the end of the game’s 30-ish minute run time. Though the game can accommodate up to eight players, six is probably the sweet spot – you’d run the risk of running into your mates too often otherwise.",
    "Prices vary from city to city, but a session on Far Cry VR: Dive Into Insanity starts at £19.95 / $40 / AU$49 per person at off-peak times. You can add roughly an extra ten pounds or bucks to that price for a peak time playthrough.",
    "It’s a far cry from a true Far Cry game then, but it’s an excellent showcase for social VR gaming, and a succulent entree for this year’s main event – Far Cry 6."
  ],
  "headers": {
    "3": "A pirate’s strife",
    "6": "A far cry from Far Cry"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "PlayStation VR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review"
  }
}