{
  "source": "https://www.techradar.com/news/google-meet-may-have-fixed-one-of-the-worst-things-about-video-conferencing",
  "title": "One of the worst parts of video calls could finally be over",
  "category": "computing",
  "updated": "2021-10-22T17:05:09Z",
  "author": "mike-moore",
  "summary": "Google Meet hosts can now turn off video or mics of individual users",
  "article": [
    "A new update to Google Meet will finally end one of the worst things about workplace video calls.",
    "The video conferencing platform has announced it will soon allow hosts to turn off or mute the video feed and microphones of individual users on a group call.",
    "Affected users will be unable to turn their cameras or microphones back on manually, whether in a main room or a breakout call.",
    "In a blog post announcing the update, Google said that the change would allow for \"smoother, more productive meetings\".",
    "\"This feature gives meeting hosts more control over their meetings by letting them decide when they want to allow different levels of participation from attendees, for example to address disruptive participants,\" it said.",
    "Back in February 2021, the company added a feature that allowed Google Meet hosts to mute all members of a call at once, for example if someone was presenting - but the new update blocks call participants from turning their audio or video feeds back on.",
    "Participants using versions of the Android and iOS apps that do not support audio and video locks will be removed from the meeting if the host or co-host turns on either of the locks. If they attempt to join a meeting that has either of these locks enabled they will be prompted to update their app or use another device to join the meeting. Turning off audio or video locks will allow these participants to rejoin the meeting.",
    "The feature will be off by default, so hosts will need to activate it during meetings, but there are no extra admin settings for the feature, which is rolling out now to all Google Workspace customers, as well as G Suite Basic and Business customers.",
    "Google Meet also recently upgraded its web platform with improved visibility, automatically detecting when a user appears underexposed on a call and enhancing the brightness of their feed in order to make them more visible.",
    "The service also recently added a new settings panel allowing users to quickly access effects such as background blur, background images and styles before and during a video call.",
    "You can also check out our pick of the best hybrid working tech - everything you need for the return to the office."
  ],
  "headers": {
    "3": "Mute all"
  },
  "links": {
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "cameras": "https://www.techradar.com/best/best-business-webcams",
    "blog post": "https://workspaceupdates.googleblog.com/2021/10/google-meet-meeting-hosts-now-have-more.html",
    "mute all members of a call at once": "https://workspaceupdates.googleblog.com/2021/02/mute-all-google-meet-participants-at-once.html",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "improved visibility": "https://www.techradar.com/news/google-meet-is-fixing-one-of-the-worst-things-about-video-meetings",
    "best hybrid working tech": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}