{
  "source": "https://www.techradar.com/news/the-search-for-the-elusive-queer-parent-in-gaming",
  "title": "The search for the elusive queer parent in gaming",
  "category": "gaming",
  "updated": "2021-01-18T09:00:37Z",
  "author": "mike-mcclelland",
  "summary": "Opinion: from dream daddies to chosen families",
  "article": [
    "Last year, my husband and older son flew to England to spend a long weekend with my husband’s parents. We were waiting for the judge to put the final stamp of approval on the adoption of our second son, and he naturally couldn’t get a passport until that happened, so I stayed back at home in the States with him.",
    "I was eager to eat garlicky food without worrying about anyone smelling my breath, to watch all the horror movies that my husband was too chicken to watch… and, of course, to stay up all night playing video games.",
    "As a new parent, my backlog of ‘to be played’ games had grown embarrassingly large. But my son wasn’t sleeping well, and I needed to find a game that required minimal dexterity, so I went onto Nintendo’s eShop to have a look around. And that’s where I found Dream Daddy.",
    "I was originally interested in Dream Daddy because it was cheap, and the art for the game featured seven hunky men all staring lustily out at me. But once I started playing, I was transfixed. Though I'd never been much of a dating-sim player, preferring to shoot zombies or obsessively level-up my Materia, I was immediately drawn into Dream Daddy because it’s secretly revolutionary.",
    "It dawned on me that in 30-plus years of gaming – through all of my adventures in the Mushroom Kingdom and Liberty City and Silent Hill and beyond – I had never encountered a gay parent.",
    "So Dream Daddy did mean something. And it got me thinking. When we adopted my sons, my husband and I had to fill out a ton of paperwork: adoption forms, hospital forms, legal forms, passport applications, and eventually daycare information. On many of those forms, we would have to cross out ‘Mother’ and write ‘Parent 2’ in its place. It wasn’t that painful, but after a while, it got a little irritating to have to consistently remind others of my existence; or worse, to have to prove my right to be somewhere that many didn’t think I belonged.",
    "Gaming has always been my escape, offering fantasy worlds that I could leap into, where I could build a new narrative for myself. But once my sons were born, I wasn’t finding myself in my fantasy worlds, either. Parenting is plentiful in gaming narratives – some hero is always searching for her secret lineage, or setting off in search of a missing parent – but that parenting is almost always straight. And even in places where it does exist, usually in simulations like The Sims, the queerness can feel like an add-on rather than an authentically queer story.",
    "I remember playing The Witcher 3 and wanting my Geralt to be gay. There was no reason he couldn’t have been; the Continent was overflowing with eligible bachelors. But I was forced to romance Triss and Yennefer. It would have been so cool, so meaningful, to be a big gay Witcher taking on monsters alongside my adopted daughter Ciri.",
    "Queer gamers are often lured in with queer side-stories and supporting characters, but it feels well past time for fully formed queer stories. And when it comes to queer parents, the foundation is already there.",
    "The consistently buff Impa is Zelda’s surrogate mother in a number of entries in the series, and – not to lean into cliche too hard – her prowess as a warrior, and fierce independence, give her a wonderfully queer vibe. And while we’re on the subject of Zelda, who can forget Link’s uncle, who kept such a fabulously appointed country cottage and who died talking about swords?",
    "These stoic guardians – who could be joined by Aloy’s fashionable adoptive father Rost from Horizon Zero Dawn, Tidus’s well-coifed mentor Auron from Final Fantasy X, and many others – have been vehicles through which queer parenting has snuck into mainstream gaming; or at least, characters like these have allowed queer players who are parents (or who hope to be someday) to see parts of themselves in the story.",
    "One of the unique joys of RPG gaming is the chosen-family aspect that so many of them bring to the table. So many queer people have had to choose their families. While this is sometimes a choice that comes from extreme pain and trauma, it’s also one of the most beautiful things about the queer community. My children have family with official titles like grandma and grandpa, but they also have fairy godmothers and uncles and aunts whose connection is a bone-deep bond, not a blood one.",
    "I didn’t realize until I reflected on Dream Daddy and Geralt and Impa and Rost that my template for a chosen family had been with me since I played The Secret of Mana for the first time in grade school. In that game, my three misfit characters from wildly different backgrounds became family by the end of the game. They had each other’s backs, loved each other in spite of their unique traumas, and then banded together to save the world. My parties in Chrono Trigger and Chrono Cross, in Final Fantasy V through XV, in Skies of Arcadia, in Persona V, and in Child of Light were all queer families, because I had assembled them.",
    "As an older millennial, mine is one of the first generations to have had gaming with us throughout their lives in the way that previous generations had films and books. We don’t talk enough about how games shape our parenting lives, but I know for a fact that gaming has shaped mine, because games have shaped every part of me.",
    "It’s time for queer stories of every kind to be told in gaming. I want to see myself and people like me do all the wonderful things I’ve watched straight characters do over the years. But more importantly than that, I want my sons to be able to pick up a game and see a family like theirs kicking butt."
  ],
  "headers": {
    "3": "Dream daddies",
    "7": "Stoic guardians",
    "11": "The chosen family"
  },
  "links": {
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review"
  }
}