{
  "source": "https://www.techradar.com/news/this-worrying-new-ransomware-trend-is-hitting-businesses-where-it-hurts",
  "title": "This worrying new ransomware trend is hitting businesses where it hurts",
  "category": "computing",
  "updated": "2021-01-11T11:09:20Z",
  "author": "barclay-ballard",
  "summary": "Cyberattackers are targetting individual workstations",
  "article": [
    "New evidence suggests that senior employees are those most likely to need ransomware protection, with cyberattackers deliberately targeting c-suite members and other high-ranking individuals.",
    "In addition, attackers are increasingly focusing on individual workstations to see if they can acquire information that might be used to threaten or embarrass senior members of staff.",
    "In a standard ransomware attack, threat actors steal sensitive data pertaining to a company before sending a ransom demand and threatening to leak the information if it is not met. However, ZDNet reports that ransomware gangs have begun targeting information that, while not necessarily important for a compromised company, could prove damaging for top-level employees.",
    "Often, senior members of staff are those most likely to be in a position to authorize ransomware payments, making them valuable targets. As a result, some attacks have focused on individual workstations rather than company-wide IT infrastructure.",
    "So far, the sort of ransomware attacks that specially target individuals has been employed by groups that use the so-called “Clop” ransomware, a strain of malware that has been around since at least 2019. Other ransomware gangs may also be adopting similar tactics, particularly if they prove effective.",
    "What’s more, it’s been observed that ransomware attackers have begun backing up their campaigns with threatening phone calls, press outreach and other tactics to put pressure on businesses and individuals to meet ransom demands.",
    "Often, this new type of ransomware attack looks for information regarding any ongoing legal disputes that a company may be experiencing. Bill Siegel, CEO of security firm Coveware, told ZDNet that any claims made by an attacker should be scrutinized. Many ransomware groups overstate the importance of the information they have secured in an attempt to encourage payment.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Individual targets"
  },
  "links": {
    "ransomware protection": "https://www.techradar.com/best/best-ransomware-protection",
    "“Clop” ransomware": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-7914271816757339000/https://www.mcafee.com/blogs/other-blogs/mcafee-labs/clop-ransomware/",
    "ZDNet": "https://www.zdnet.com/article/some-ransomware-gangs-are-going-after-top-execs-to-pressure-companies-into-paying/"
  }
}