{
  "source": "https://www.techradar.com/news/twitter-is-working-on-tweet-reactions-so-it-can-be-more-like-facebook",
  "title": "Twitter is working on tweet reactions so it can be more like Facebook",
  "category": "computing",
  "updated": "2021-05-31T10:35:22Z",
  "author": "david-nield",
  "summary": "Express sadness and mirth",
  "article": [
    "How would you feel about being able to cheer or laugh at a tweet as well as like it? Hidden features not yet visible to users suggest that Twitter could be launching Facebook-style emoji reactions to tweets in the very near future.",
    "Well-known tipster Jane Manchun Wong has a picture of how the upcoming feature is supposedly going to look, although not all of the reactions have the correct corresponding emoji at the moment – this still appears to be a 'work in progress' for now.",
    "The reactions shown are Like, Cheer, Hmm, Sad and Haha, giving you a much wider range of responses to the tweets coming through on your timeline. At the moment, all you can do is 'like' a tweet, which used to be called 'favoriting' a tweet.",
    "This isn't completely out of the blue: for quite some time now we've been hearing rumors that Twitter is working on this feature. It makes sense to give users a broader range of reactions they can use, matching the diverse types of content that get posted.",
    "From this leak at least we don't get any indication of when tweet reactions might appear. That some of the code is already deployed suggests that a launch isn't too far away, though it doesn't look as though the feature is near to being finished at the moment.",
    "It's been a busy time for Twitter leaks and rumors lately, with the social network about to unveil a Twitter Blue subscription service that will give paying customers some extra features – features said to include the ability to recall sent tweets and up to six different color schemes to play around with.",
    "The rumors suggest that the powerful Twitter client TweetDeck could soon become a paid-for extra too. TweetDeck on the web offers real-time timeline updates, advanced search functionality and plenty more, and has long appealed to power users.",
    "When Twitter does have something official to say about all of this, expect a barrage of announcements to arrive, covering new features and the subscription plan (tipped to cost $2.99 a month). We will of course keep you updated as all of this news breaks."
  ],
  "headers": {},
  "links": {
    "has a picture": "https://twitter.com/wongmjane/status/1398359547731841024",
    "hearing rumors": "https://www.techradar.com/news/twitter-is-trialling-emoji-reactions",
    "a Twitter Blue subscription service": "https://www.techradar.com/news/twitter-subscription-service-leaks-reveal-name-price-and-an-undo-tweet-option",
    "TweetDeck": "https://tweetdeck.twitter.com/"
  }
}