{
  "source": "https://www.techradar.com/news/how-to-buy-a-gimbal",
  "title": "How to buy a gimbal: 6 steps to smooth video from your camera or phone",
  "category": "cameras",
  "updated": "2021-08-25T11:29:56Z",
  "author": "leon-poultney",
  "summary": "We help you find the right gimbal for your camera or phone",
  "article": [
    "Camera stabilizers, or gimbals to most folk, have been commonplace in high-end television and film productions for over 30 years, but it has only been recently that the technology has become popular with budding filmmakers and hobbyists.",
    "Like so many pieces of consumer tech, this is chiefly down to advances in sensor and motor design. This means these things are now smaller and, more importantly, more affordable than ever, meaning you can now achieve Hollywood-style action shots without the shake and damage to the bank balance.",
    "So, what is a gimbal? In essence, it is a tool to remove shake and stabilize video by detecting and counteracting unwanted movement using advanced sensors and motors. Using basic technology pioneered by our Ancient Greek ancestors, a modern gimbal will keep a video recording device in a fixed point in inertial space, despite what the operator is doing with his or her arms.",
    "But gimbals go beyond just smoothing out video. They can also add an element of creativity to any project, allowing the user to mimic maneuvers only previously possible with the sort of cranes, dollies and tracks found in Hollywood studios.",
    "Beautiful reveal shots, where the camera smoothly moves from behind an object to reveal the subject, as well as high-octane action chases and Christopher Nolan-esque ‘Vortex' shots can be easily be inserted into a homemade video sequence in order to take your content to the next level. Here are the six things to consider when buying your first gimbal, whether it's for a camera or phone.",
    "Today’s gimbals come in all shapes and sizes and are made to fit a number of devices, from the smartphone in your pocket or tiny action cameras to much higher-end cinema camera rigs and set-ups. Unless you really take your videography seriously, it’s likely you’ll be looking at the consumer end of the spectrum, so the smaller gimbals for smartphones, action cams and lighter mirrorless cameras should be the place to start.",
    "That said, many of us have already invested in a DSLR for our photography. Modern DSLRs and their respective lenses can be weighty, meaning something like the Zhiyun Crane 2S (above, $399 / £479 / AU$740), which has been made to handle a payload of up to 3.2kg, could be the one if you’re already an avid photographer looking to make the jump to moving images. Whatever the case, a general rule of thumb is that the greater the payload, the larger and more expensive your gimbal will have to be.",
    "But if you don't want to use your existing camera, and need something that's super-simple to set up, then check out the DJI Pocket 2 ($349 / £339 / AU$599). It might have relatively small sensor, which only makes it suitable for shooting b-roll on high-end productions, but it combines a tiny 3-axis gimbal with a minuscule built-in 4K Camera. There’s also a holder for a smartphone on the side, allowing you to effectively use the phone as an external monitor and have full control of the action.",
    "The most important feature of a gimbal is its stabilization and you can buy single-axis, two-axis or three-axis gimbals to help deliver this. Single-axis gimbals can be useful if you only need to level the horizon (for example, on an FPV drone), but they don't really add any creative element to your production. Most camera or phone gimbals will offer two-axis or three-axis stabilization.",
    "Two-axis gimbals are cheaper and a little smaller, but the lack of stabilization on one axis (usually the tilt axis) means it can be hard to get consistently smooth results if you are, for example, doing walking shots. This is why most of the gimbals we recommend offer 3-axis stabilization. These correct movement on all three planes and tend to offer additional features, such as auto-tracking, panning for time lapse shots, and assistance with a number of highly stylized shots, such as vortex (where camera effectively barrel rolls) and rapid whip pans.",
    "When it comes to other gimbal features, it's best to decide what you need in order to achieve your creative vision. If that's merely to reduce some of the motion sickness-inducing shake in footage, some of the more basic gimbals (even a non-powered mechanical gimbal) will be the best place place to start.",
    "But if you want to remotely control the gimbal using your phone, you'll need one (like the Zhiyun Crane 2S or DJI RSC 2) that has Bluetooth connectivity. Equally, if you want to adjust settings without using your phone, look for one that has an OLED display (like the DJI RSC2) or even a built-in touchscreen, which you can find on the Zhiyun Weebill 2.",
    "It might feel awesome to run around with the DJI Ronin 2 (above), but you will be looking at a bill for $8,399 / £6,499 / AU$10,999 for that model. By contrast, something like the DJI OM 4 costs just $149 / £139 / AU$239 and works with most modern smartphones. Using just this piece of kit and the power of a your iPhone’s awesome video capabilities, it’s possible to capture epic footage on a much tighter budget.",
    "Similarly, the Zhiyun Crane-M2 is designed for beginners and costs just $199 / £199 / AU$269, but is compatible with a number of cameras, from light mirrorless models to smartphones and action cameras. Thanks to a number of gimbal modes, it’s easy to achieve various professional and creative camera shots with minimal knowledge and set-up time. For beginners, this pricing ballpark is a good place to start, whether you need a gimbal for your phone or camera.",
    "Just like cameras, gimbals come in all manner of shapes, sizes and weights. Look towards the more professional end of the market and they'll likely involve large rigs that have to be held with both hands and require a carry case to transport. Also bear in mind that a gimbal requires batteries to power the electric motor and sensors, so these can add bulk to your kit bag.",
    "Models like the DJI RSC 2, Zhiyun Weebill-S or Crane range, and Manfrotto MVG460 are all designed to fold down fairly flat so they can be stashed in a backpack (preferably one with safe compartments). You’ll also find that handles and bases screw away from the main body to reduce size even more.",
    "The mini gimbals for smartphones and action cameras are much smaller and can easily be folded and put into a small backpack, bag or even a deep pocket. Zhiyun’s extremely clever Smooth-Q3 smartphone gimbal, for example, is tiny, measuring just 45x154x180mm when folded and weighs 340g, yet it features a built-in flash and an accompanying app that takes the hard work out of mastering professional grade shots.",
    "One of the trickier aspects of owning a gimbal, particularly those designed for larger mirrorless and DSLR cameras, is the set-up. You can’t simply open the box, attach a camera and start filming, as they require careful balancing to ensure the motors aren’t overworked and prematurely burn out.",
    "Granted, there are apps (like DJI's one above) and video tutorials to help with this, but it still requires time and a healthy dose of patience to get it right. Entry-level units for smartphones and action camera tend to be far simpler, as it’s typically a case of going through a quick set-up and balance and then leaving this for all future uses.",
    "The more complex the gimbal, the more likely you are to have to make small tweaks every time you go out shooting, so it is something to bear in mind. That said, if quick setup is a priority, look for a model – like the Zhiyun Crane 2S or DJI RSC 2 – that has locking mechanisms for each axis, so you can balance each one at a time.",
    "Modern gimbals also have numerous built-in modes for achieving various filming effects, and these also take time to master. Differentiating between a Pan Follow and a POV mode, for example, will determine what axis remains locked and ultimately how the camera behaves. After all, a modern three-axis gimbal will support pan, tilt and roll functionality, typically with a mode to prioritize one or two of those.",
    "The aforementioned Zhiyun Smooth-Q3 smartphone gimbal (above) uses a supporting app to take most of the hard work out of achieving great-looking shots, as users can interact with the smartphone screen, lock onto and follow subjects and even zoom the phone’s camera in and out (depending on the model) using a toggle switch on the side.",
    "Anything with electric motors and sensors is going to require a power source and this typically comes in the form of rechargeable batteries. The more professional gimbals, such as those for heavier mirrorless and DSLR cameras, will often use removable battery units, so those on longer, professional shoots can keep spare sets and swap over when necessary.",
    "Consumer-level models, like those for action cameras and smartphones, tend to use built-in rechargeable batteries, which are smaller and won’t last as long. Plus, you’ll have to plug it into a socket to recharge.",
    "That said, both the DJI RSC 2 and Zhiyun's Crane range boast a claimed battery run time of 12-14 hours. Take this with a pinch of salt if you're using lots of the features over extended periods of time, but they are designed to last extensive shoots without letting the operators down.",
    "It’s also worth noting that some of the more professional models can also power the camera and other ancillaries via their built-in battery packs, offering greater peace of mind that your video camera isn’t going to suddenly die mid-shoot."
  ],
  "headers": {
    "5": "1. Which camera do you have?",
    "8": "2. Which features do you need?",
    "12": "3. Set a budget",
    "14": "4. Think about size and weight",
    "17": "5. Consider setup time",
    "22": "6. How long do you need to shoot for?"
  },
  "links": {
    "DJI Pocket 2": "https://www.techradar.com/reviews/dji-pocket-2",
    "DJI RSC 2": "https://www.techradar.com/reviews/dji-rsc-2",
    "Zhiyun Weebill 2": "https://www.techradar.com/news/zhiyun-weebill-2-is-the-first-camera-gimbal-with-a-handy-built-in-touchscreen",
    "DJI OM 4": "https://www.techradar.com/reviews/dji-om-4-gimbal"
  }
}