{
  "source": "https://www.techradar.com/news/the-simpsons-renewed-season-33-and-34",
  "title": "The Simpsons has been renewed for two more seasons – will it ever end?",
  "category": "entertainment",
  "updated": "2021-03-03T21:20:50Z",
  "author": "samuel-roberts",
  "summary": "The Simpsons remains evergreen",
  "article": [
    "The Simpsons has been renewed for two more seasons by the Fox network in the US, it's been confirmed. The show will run until 2023, making these the show's 33rd and 34th seasons, according to THR.",
    "The Simpsons is currently on season 32 in the US. The show has been on the air since 1989, during which time six different presidents have occupied the White House.",
    "A (slightly) interesting factor here is that while Fox has always been the broadcast home of The Simpsons, the network wasn't acquired by Disney when it bought Fox's assets for $72 billion a few years ago. Essentially, that means the dynamic between the studio making the show – which is owned by Disney – has changed, because they're no longer part of the same company.",
    "Nonetheless, Disney no doubt benefits from having the show on the air – The Simpsons library is available to stream on Disney Plus, and we expect new seasons to be added to the platform after they air, as we saw with season 31 last year.",
    "The Simpsons releases every Sunday on Fox in the US, with newer episodes streaming on Hulu. In the UK, new episodes of The Simpsons air on Sky.",
    "Complaints about The Simpsons not being as good as it was during its glory days are now more than two decades old – the show's success is clearly evergreen, and it seems like it'll be still some time before The Simpsons actually ends.",
    "The launch of Disney Plus has no doubt kept the series valuable to its owners, since this is the first time the show has been available to stream in full internationally. For a long time, too, it was one of the only truly interesting things for adults to binge watch on the otherwise family-friendly service.",
    "The Simpsons will pass 700 episodes this month, with an instalment called 'Manger Things' on March 21."
  ],
  "headers": {
    "5": "Will The Simpsons ever end?"
  },
  "links": {
    "THR": "https://www.hollywoodreporter.com/live-feed/the-simpsons-scores-another-two-season-renewal-at-fox",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}