{
  "source": "https://www.techradar.com/news/new-ring-video-doorbell-lets-you-see-whos-knocking-for-a-very-cheap-price",
  "title": "New Ring Video doorbell lets you see who's knocking for a very cheap price",
  "category": "smart-home",
  "updated": "2021-01-27T16:14:50Z",
  "author": "carrie-ann-skinner",
  "summary": "Smaller and cheaper than ever",
  "article": [
    "Video doorbells have put an end to missed packages or dealing with cold callers, as they let you see and speak to whoever is on your doorstep via a smartphone app, but in some cases, they don't come cheap.",
    "Ring is hoping to make this a thing of the past with its latest video doorbell, which is also its most affordable to-date. The Ring Video Doorbell Wired will go on sale in the US on February 24 for $59.99 and in Australia on February 25 for AUS$119.00. In the UK it'll cost £49 but it won't go on sale until May.",
    "Slimmer than other Ring video doorbells – it's the firms smallest smart doorbell ever – it works in the same way, providing an app notification on your smartphone when someone presses the button on the doorbell. It has a FullHD camera with night vision so you can clearly see who's on your doorstep even at night, while two-way audio means you can see and speaker to the visitor, all through the Ring app.",
    "The Ring Video Doorbell Wired doesn't have a removable battery, unlike the Ring Video Doorbell (2nd generation) and Ring Video Doorbell 3 models. Instead, it can only be installed in homes that have existing wired doorbells.",
    "Just like Ring's other smart doorbells, the Ring Video Doorbell Wired also detects and alerts you about motion in its field of view. Through the Ring app, you can select 'Motion Zones' so you're only alerted about activity in these areas while 'Privacy Zones' block out areas of the picture from being monitored.",
    "If you miss the caller on your doorstep, or you want to view the source of a motion laert, you'll need to subscribe to a Ring Protect Plan to go back and view the footage. Prices start from $3 / AU$4 / £2.50 per month or $30 / AU$40 / £24.99 for a year but also include access to the 'Advanced Pre-Roll' feature that provides a six-second video preview highlighting what triggered the motion alert and smartphone notifications that include a snapshot of the motion.",
    "Ring Video Doorbell Wired also works with some Alexa devices with a screen so you can see a live feed from the doorbell on screen. You’ll need to activate the Ring Skill in the Alexa app, then just say “Alexa, show me the front door”. Alternatively, say “Alexa, talk to the front door,” to converse with whoever is at the door."
  ],
  "headers": {
    "4": "Motion zones"
  },
  "links": {
    "Video doorbells": "https://www.techradar.com/news/video-doorbells-the-cheaper-option-for-home-security",
    "Ring Video Doorbell Wired": "http://en-uk.ring.com/products/video-doorbell-wired"
  }
}