{
  "source": "https://www.techradar.com/news/iphone-se-3-rumored-to-launch-before-the-end-of-march-2022",
  "title": "iPhone SE 3 rumored to launch before the end of March 2022",
  "category": "phones",
  "updated": "2021-12-01T11:06:08Z",
  "author": "david-nield",
  "summary": "A little earlier than expected",
  "article": [
    "When is the iPhone SE 3 going to see the light of day? A new industry analyst report suggests it will be sometime during Q1 2022 – so January, February or March, and it's likely to be more towards the end of that time frame than the start.",
    "The prediction is from Taiwanese research firm TrendForce (via MacRumors), and fits in broadly with what we've heard before. The second-generation iPhone SE made its debut in April 2020, so we're looking at a gap of around two years.",
    "As has also been mentioned by other sources, the TrendForce report says that 5G is going to be added to the mix this time around. Although there will be very few design changes, the phone should get the latest A15 processor already found in the iPhone 13.",
    "At this point we're expecting the third-generation iPhone SE to arrive with the same 4.7-inch screen as the current model, and it would appear that Apple is happy to stick with LCD for the time being – rather than swapping to the OLED displays used in the flagship iPhone models.",
    "As for the internals, we've mentioned the A15 processor, which should ensure some rapid performance from this compact handset. The second-generation iPhone SE only has 3GB of RAM and starts with 64GB of internal storage, so expect both of these specs to get a bump next year as well.",
    "When it comes to cameras, the iPhone SE 3 could be the first in the line to come with a dual-lens camera module around the back: we haven't actually heard any rumors about that yet, but Apple would risk looking behind the times if it launched a handset in 2022 with only a single-lens rear camera.",
    "When the iPhone SE 3 breaks cover, it most likely won't be called the iPhone SE 3 – if Apple continues its previous strategy, it'll simply be called the iPhone SE again, with a \"third-gen\" or \"2022\" label sometimes used next to it for clarity.",
    "That makes life a little difficult for tech reporters and rumor mongers, especially with whispers about an iPhone SE Plus floating around as well. As the name might suggest, the Plus model is expected to be bigger than the standard iPhone SE, with a screen size of 5.5 inches being talked about.",
    "Rather confusingly, one analyst has said the iPhone SE Plus is actually the 4.7-inch model coming in 2022, with the true iPhone SE 3 – sporting a larger screen as big as 6.1 inches – showing up at some point in 2024.",
    "It would seem that some wires have been crossed there, because it makes much more sense for the third-gen, minor upgrade, same size iPhone SE to be out first, without the Plus moniker... but be aware that Apple could have a naming surprise in store."
  ],
  "headers": {
    "3": "Let's talk about specs",
    "6": "Analysis: what's in a name?"
  },
  "links": {
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "TrendForce": "https://www.trendforce.com/presscenter/news/20211130-11032.html",
    "MacRumors": "https://www.macrumors.com/2021/11/30/iphone-se-3-release-date-rumor/",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "other sources": "https://www.techradar.com/news/the-iphone-se-3-tipped-to-get-5g-and-a-spec-bump-but-no-redesign",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "would appear": "https://www.techradar.com/news/iphone-13-followed-by-iphone-se-5g",
    "iPhone SE Plus": "https://www.techradar.com/news/iphone-se-plus",
    "has said": "https://www.techradar.com/news/iphone-se-3-could-be-years-away-but-an-iphone-se-plus-might-land-first"
  }
}