{
  "source": "https://www.techradar.com/news/visa-buys-currencycloud-in-cross-border-payments-push",
  "title": "Visa buys Currencycloud in cross-border payments push",
  "category": "computing",
  "updated": "2021-07-22T22:08:13Z",
  "author": "anthony-spadafora",
  "summary": "Currencycloud platform allows banks and fintechs to offer cross-border payments",
  "article": [
    "Payments giant Visa has announced that it has entered into a definitive agreement to acquire the UK-based firm Currencycloud.",
    "Founded back in 2012, Currencycloud's global platform enables banks and fintechs to provide foreign exchange solutions for cross-border payments around the world.",
    "The acquisition builds on the existing strategic partnership between the two companies and values Currencycloud at £700m (around $963m). However, the financial consideration will be reduced by the outstanding equity of the company that Visa already owns.",
    "CEO of Currencycloud, Mike Laven explained in a press release how the acquisition will allow it and visa to deliver greater customer value when it comes to cross-border payments, saying:",
    "“At Currencycloud, we’ve always strived to deliver a better tomorrow for all, from the smallest start-up to the global multi-nationals. Re-imagining how money flows around the global economy just got more exciting as we join Visa,” said Mike Laven, Chief Executive Officer, Currencycloud. “The combination of Currencycloud’s fintech expertise and Visa’s network will enable us to deliver greater customer value to the businesses moving money across borders.”",
    "Through its cloud-based platform, Currencycloud offers a broad set of APIs which enable banks and financial services providers to offer currency exchange services including real-time notifications on foreign exchange transactions, multi-currency wallets and virtual account management. The platform also currently supports almost 500 banking and technology clients with reach in over 180 countries.",
    "The acquisition will allow Visa to strengthen its existing foreign exchange capabilities by extending them to better serve financial institutions, fintechs and partners while making new use cases and payment flows possible.",
    "Cross-border payments have seen significant growth in recent years to due rising demand from businesses of all sizes that want to engage in international trade. By adding Currencycloud's capabilities to visa's network, the payments giant will be able to widen access to international payment products to help businesses meet their cross-border needs.",
    "Following regulatory approval and customary closing conditions, Currencycloud will continue its operations from its headquarters in London and the company will retain its current management team."
  ],
  "headers": {
    "5": "Cross-border payments"
  },
  "links": {
    "Visa": "https://www.techradar.com/news/new-visa-services-turn-traditional-banks-into-bitcoin-exchanges",
    "Mike Laven": "https://www.techradar.com/news/world-of-tech/where-do-traditional-banks-fit-in-the-fintech-revolution-1278054",
    "press release": "https://usa.visa.com/about-visa/newsroom/press-releases.releaseId.18161.html",
    "Cross-border payments": "https://www.techradar.com/news/visa-launches-suite-of-ai-tools-to-enable-smarter-payments"
  }
}