{
  "source": "https://www.techradar.com/news/stripe-and-klarna-partner-to-offer-businesses-buy-now-pay-later",
  "title": "Stripe and Klarna partner to offer businesses buy now, pay later",
  "category": "computing",
  "updated": "2021-10-26T19:00:57Z",
  "author": "anthony-spadafora",
  "summary": "Stripe users in 20 countries can now offer Klarna as a payment option",
  "article": [
    "Stripe and Klarna have announced a new strategic partnership that will enable businesses using Stripe's payment gateway to let their customers to buy now and pay later using Klarna.",
    "Buy now, pay later options have become increasingly popular over the last few years as they allow consumers to receive products first while spreading their payments out over time. Businesses also benefit from this new payment model as the flexibility it provides can dramatically increase conversions and boost revenue.",
    "According to research from Klarna, businesses offering its services at checkout generated a 30 percent average increase in conversion and a 41 percent increase in average order value. Additionally, some retailers discovered that 40 percent of Klarna shoppers were new to their brand which allowed them to win over entirely new customer segments.",
    "By partnering with Stripe, Klarna's flexible payment options will now be available to millions of ecommerce businesses using Stripe across the US and 19 countries in Europe.",
    "However, the two companies have also decided to collaborate further and Stripe will now be Klarna's preferred payments partner for consumer purchases. This means that after a customer's purchase from a retailer is funded by Klarna, the subsequent repayments will also be processed by Stripe.",
    "Following initial tests with Stripe that yielded significant improvements in reliability and performance, Klarna decided to shift even more of its payments volume to the company than it had originally planned. Going forward, Klarna will now rely on Stripe to process the majority of its payment volume in both the US and Canada.",
    "Chief technology officer at Klarna, Koen Köppen provided further insight on the company's new strategic partnership with Stripe in a press release, saying:",
    "“Over the past years, Klarna and Stripe redefined the e-commerce experience for millions of consumers and global retailers. Together with Stripe, we will be a true growth partner for retailers of all sizes, allowing them to maximize their entrepreneurial success through our joint services. By offering convenience, flexibility, and control to even more shoppers, we create a win-win situation for both retailers and consumers alike.”"
  ],
  "headers": {
    "3": "Increased payment flexibility"
  },
  "links": {
    "payment gateway": "https://www.techradar.com/best/best-payment-gateways",
    "Buy now, pay later": "https://www.techradar.com/news/buy-now-pay-later-services-set-to-soar",
    "Klarna": "https://www.techradar.com/news/klarna-launching-into-consumer-bank-accounts",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "collaborate": "https://www.techradar.com/best/best-online-collaboration-tools",
    "press release": "https://stripe.com/newsroom/news/klarna-partnership"
  }
}