{
  "source": "https://www.techradar.com/news/google-stadia-will-now-come-pre-installed-on-all-new-chromebooks",
  "title": "Google Stadia will now come pre-installed on all new Chromebooks",
  "category": "computing",
  "updated": "2021-02-11T12:21:20Z",
  "author": "axel-metz",
  "summary": "Go on, give it a try",
  "article": [
    "Google has confirmed that its cloud gaming service, Google Stadia, will arrive pre-installed on all new Chromebook laptops.",
    "It’s worth noting that Stadia isn’t pre-installed in the same way you’d expect to find a desktop app already downloaded when booting up your device for the first time, rather that a pre-installed Stadia icon in the app menu will act as a web-shortcut to the main gaming page.",
    "The news comes as a recent tweet from the official Made by Google account confirmed that “Chromebooks [will] now come with Google Stadia already installed” to allow users to “start playing games without waiting for downloads or updates.”",
    "This is a major move from Google given the doom and gloom that has surrounded the cloud gaming service in recent months. The company announced that it plans to shut down its internal development studio and divert all resources to enticing third-party developers to launch games on the platform.",
    "Google only began making its own games in the last two years, and its closing of the doors on both its Los Angeles and Montreal game studios was largely seen as an abandonment of the Stadia service. But, according to the company, the reasoning behind the move lies in the desire to free up resources to allow the better development of the Stadia platform itself.",
    "Chrome OS and Chromebooks have experienced something of a renaissance over the past 18 months, largely, it’s assumed, due to the Covid-19 pandemic.",
    "Google will hope this translates into a big increase in the Stadia player-base over the next few years, and the announcement that Chrome-powered devices will now come with super easy access to the gaming service seems a promising sign that Stadia might not be as dead as everyone thought.",
    "On top of this, when you pick up a new Chromebook, Google already offers three months of Stadia Pro for free, which seems likely to further encourage new users to at least try out the service.",
    "With titles like Cyberpunk 2077 arguably best experienced on Stadia given the well-publicized bugs on its console counterparts, this looks like a move that could benefit everyone involved.",
    "So, whether you believe in the Stadia vision or not, Google is at least asking you to try – for free, and without the hassle of downloads – its flagship gaming service.",
    "Via 9to5Google"
  ],
  "headers": {
    "5": "A new lease of life?"
  },
  "links": {
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "doom and gloom": "https://www.techradar.com/news/google-closes-game-development-studios-but-promises-stadia-will-go-on",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "9to5Google": "https://9to5google.com/2021/02/11/stadia-now-comes-pre-installed-on-all-new-chromebooks/"
  }
}