{
  "source": "https://www.techradar.com/news/the-fujifilm-gfx50s-ii-is-the-cheapest-digital-medium-format-camera-ever",
  "title": "The Fujifilm GFX50S II is the cheapest digital medium format camera ever",
  "category": "cameras",
  "updated": "2021-09-03T00:00:57Z",
  "author": "sharmishta-sarkar",
  "summary": "New medium format snapper's low price aims to please",
  "article": [
    "Fujifilm has been trying to make medium format photography more mainstream by not just shrinking the size of the camera bodies – as shown by the Fujifilm GFX 100S – but by also making them more affordable. Its latest medium format camera, the Fujifilm GFX 50S II is one of the cheapest ones yet, with a lower price tag than the now-discontinued Fujifilm GFX 50R.",
    "With an intro price of $3,999 / £3,499 / AU$6,499 for the body alone, Fujifilm is trying to carve a space for its large sensor cameras in the mainstream full-frame mirrorless market, at least from a price perspective.",
    "In terms of specs, it’s unrealistic to expect any medium format camera to offer the blisteringly-fast burst speeds and autofocus performance of a Sony A1, but the GFX50S II is taking steps towards proving that not everything is about speed.",
    "While the GFX50S II has the same contrast-detect autofocus as its predecessor, Fujifilm claims it has improved the AF algorithm in the Mark II to be faster and more accurate. To make sure the camera keeps its promise of sharp shots, Fujifilm has also upgraded the 5-axis in-body image stabilization system to provide 6.5 stops of correction for camera shake, the highest of any GFX-series camera yet.",
    "Need even more detail? There’s a Multi-shot Mode on board that works via pixel shifting to capture 16 raw images that can be combined during post-processing to produce a 200MP image.",
    "All 19 of Fujifilm’s Film Simulations picture presets are on board, including the Nostalgic Neg that debuted in the GFX 100S. It also inherits the latest X-Processor 4 that was used in the 102MP sibling, but unfortunately Fujifilm hasn’t brought over the DCI 4K/30p video capabilities of the GFX 100S to the GFX50S II – the video resolution here remains at FHD (1080p) at up to 30fps.",
    "Thankfully, it inherits the same compact body as the GFX 100S, giving it a more traditional DSLR-like styling and familiar control layout that will make it easy for anyone upgrading from a different system to adapt to the GFX series.",
    "The Fujifilm GFX50S II will be available from late September 2021 as a body-only option for $3,999 / £3,499 / AU$6,499 apiece or as a single-lens kit with the GF 35-70mm f/4.5-5.6 WR lens for $4,499 / £3,899 / AU$7,299.",
    "It’s a little disappointing to see that Fujifilm hasn't updated the video specs of the GFX50S II, as many photographers today work with both stills and video. We’re not asking for 8K video, but a 4K update would have been good.",
    "That said, most photographers looking to move to medium format might not be keen on video at all. Instead, their main priorities are likely to be bokehlicious depth of field, smooth transitions between the in-focus subject and out-of-focus background, great colors and tonality, and the ability to play with longer focal lengths without compromising field of view.",
    "That’s not all, though. A 51.4MP medium format sensor means you get larger pixels and a lower pixel density compared to a 102MP sensor, which translates to better signal-to-noise ratio, excellent dynamic range and superior low-light performance. Throw in the GFX50S II’s IBIS performance and handheld photography promises to be a dream, particularly for a medium format camera.",
    "While its meager 3fps burst speed is not going to win any sports accolades, Fujifilm’s improvements in AF algorithms means autofocus promises to be snappy. In fact, we had the camera with us for a week prior to launch and were impressed with its AF performance. Sure, it’s not going to be able to track a tennis ball across a court, but it managed to keep pace with one of Sydney’s river ferries. You can read more about our initial experience with the camera in our hands-on Fujifilm GFX50S II review.",
    "Does the lack of 4K video and a slow continuous shooting speed warrant a price tag of $3,999 / £3,499 / AU$6,499? Perhaps not for some people, but let’s put that price into perspective. Not only is it more affordable than the original GFX 50S at launch, it’s also cheaper than the Hasselblad 907X 50C at $6,399 / £5,990 / AU$11,500.",
    "Want to compare it to the current crop of full-framers? While it's slightly unfair to do so because of the huge difference in performance, the GFX50S II comes in at the same price as the 45.7MP Canon EOS R5, a touch higher than the 61MP Sony A7R IV, and is a heck of a lot cheaper than the 50.1MP Sony Alpha 1.",
    "All of those full-frame cameras have raised the bar when it comes to video performance and speed, but that's not what Fujifilm's GFX cameras are about. The aim here is to make medium format photography more accessible and mainstream, and that’s something the Japanese camera maker is succeeding in doing with cameras like the GFX50S II."
  ],
  "headers": {
    "8": "Analysis: Not all cameras are about video and speed"
  },
  "links": {
    "Fujifilm GFX 100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Fujifilm GFX 50R": "https://www.techradar.com/reviews/fujifilm-gfx-50r-review",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Fujifilm GFX50S II review": "https://www.techradar.com/reviews/fujifilm-gfx50s-ii",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony Alpha 1": "https://www.techradar.com/reviews/sony-a1"
  }
}