{
  "source": "https://www.techradar.com/news/the-last-of-us-2-goes-free-on-playstation-now-and-our-minds-are-blown",
  "title": "The Last of Us 2 goes free on PlayStation Now, and our minds are blown",
  "category": "gaming",
  "updated": "2021-10-05T08:53:15Z",
  "author": "rhys-wood",
  "summary": "Naughty Dog's post-apocalypse goes free",
  "article": [
    "In a move that's genuinely quite surprising, Sony has added The Last of Us Part 2 to its growing roster of titles available to download and play on the PlayStation Now subscription service.",
    "If you're a PlayStation Now subscriber, you can either download The Last of Us 2 directly to their console or play instantly via the cloud, provided you have a fast enough internet connection.",
    "Other games joining The Last of Us 2 on October 5, 2021 include Amnesia Collection, Fallout 76 and Final Fantasy 8 Remastered. This should give PS4 and PS5 players plenty to play through this October, the spookiest of all the months.",
    "If you'd like to subscribe to PlayStation Now in order to play The Last of Us 2 or the litany of other titles available on the service, simply head to the PlayStation Store on your console, where there will be a dedicated section for the subscription.",
    "If you've never subscribed to PlayStation Now before, you'll be eligible for a 7-day free trial, after which you'll be billed on a monthly basis. Subscriptions to PlayStation Now are $9.99 / £8.99 per month, but do keep in mind that this does not include a subscription to PlayStation Plus.",
    "One last thing to note is that while game streaming is available on PlayStation Now, image quality caps at 1080p, which means that you won't be able to enjoy The Last of Us 2 at a 4K resolution unless you download the game to your console.",
    "Microsoft's Xbox Game Pass is arguably the biggest gaming subscription service on the block. And with its Xbox Game Pass Ultimate option, probably the most consumer friendly, as it rolls both Xbox Live Gold and Xbox Cloud Gaming into one monthly payment.",
    "That said, PlayStation Now has certainly come a long way. Originally, a very limited number of games were available on the service, and they could only be streamed via the cloud. This meant for a very choppy gameplay experience for those who didn't have the best internet connections.",
    "However, PlayStation Now has been transformed into a very respectable service. And while there's still no PS5 games available to play, there's a huge library of PS2, PS3 and PS4 titles all ready to be downloaded or streamed instantly.",
    "With big additions like The Last of Us 2, it looks like Sony could be growing more confident with releasing its highest profile titles onto PlayStation Now, and much earlier than we're used to, though we're sure Sony will never opt to launch its biggest titles on the service on day one as is the case with Game Pass.",
    "The Last of Us 2 joins other high profile PS4 games available on the PlayStation Now service, such as God of War, Nioh 2, Uncharted 4 and Bloodborne. Here's hoping the release of one of the company's most highly regarded titles onto PlayStation Now means we're just that little bit closer to seeing PS5 titles go live on the service."
  ],
  "headers": {
    "6": "Analysis: is PS Now's flex enough to take on Xbox Game Pass?"
  },
  "links": {
    "The Last of Us Part 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "Fallout 76": "https://www.techradar.com/news/fallout-76-review-part-1-our-first-steps-in-the-wasteland",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox Live Gold": "https://www.techradar.com/news/xbox-live-gold-free-games",
    "Xbox Cloud Gaming": "https://www.techradar.com/news/xbox-cloud-gaming-gets-a-monumental-upgrade-and-is-now-available-on-ios-and-pc",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Uncharted 4": "https://www.techradar.com/news/gaming/uncharted-4-a-thief-s-end-review-1320412",
    "Bloodborne": "https://www.techradar.com/news/games-of-the-generation-bloodborne-is-a-lovecraftian-nightmare-that-will-keep-you-coming-back-for-more"
  }
}