{
  "source": "https://www.techradar.com/news/yetis-new-off-road-e-bike-is-built-for-mud-and-speed-if-you-can-afford-it",
  "title": "Yeti's new off-road e-bike is built for mud and speed – if you can afford it",
  "category": "fitness",
  "updated": "2021-09-15T10:28:54Z",
  "author": "cat-ellis",
  "summary": "The 2022 Yeti 160E is an e-MTB designed for racing",
  "article": [
    "Off-road bikemaker Yeti has released its first e-bike – and it's built for serious speed. As off-road.cc explains, the 2022 Yeti 160E has been a work in progress since 2016, and is specifically designed for racing on the trails.",
    "For starters, there's a completely new carbon fiber frame to accommodate the extra weight of the motor and battery pack, plus the extra forces exerted on the bike – essential on downhills when you're riding without power assistance.",
    "The suspension has been redesigned as well, and there are 29in wheels compared to 16in, 20in, or 26in for a typical electric bike, making it more stable at high speeds.",
    "As you'd expect from an e-bike made to tackle mud, cables are routed internally through the frame to prevent damage, with a tube-in-tube design that should prevent them rattling inside on rough rides.",
    "Both the battery and motor are provided by Shimano, allowing you to adjust settings through the Shimano E-Tube app. This will also allow your phone to double as a handy cycle computer when mounted on your handlebars.",
    "The 630 watt-hour battery has an easy charge design, and is toggled by a power switch fitted on the top tube. The DU-EP800 drive unit is specifically made for trail riding, with less drag when pedaling and reduced heat buildup.",
    "Naturally, an e-bike with these specs comes with a sizeable price tag. The new electric Yeti starts at $10,100 / £9,499 (about AU$1,400) and goes up to $12,700 / £11,899 (about AU$17,300) for the top-end model.",
    "If that's too steep, there are plenty of other options for off-roading (albeit built for more casual riding). For example, the new Rad Power Bikes RadRhino 6 Plus, which has just gone on sale, comes in at $1,999 (about £1,500 / AU$2,700), and is equipped with fat tires, a new frame with a choice of step-over and step-through designs",
    "Electric mountain bikes make a lot of sense – and they're not just about taking the effort out of off-roading. They can make the sport more enjoyable for anyone, including experienced riders.",
    "The new Yeti might be built for fast riding, but its motor has a top speed of 15.5mph, which is necessary for it to be classed as bicycles rather than mopeds in countries including the UK.",
    "That's not the point, though; the real fun comes on the downhills, where the motor is off and your only assistance is gravity, The motor just allows you to keep going for longer, helping you tackle more trails and more laps.",
    "Lower-end e-MTBs like the RadRhino also open up the trails to riders who'd struggle to tackle any hills under their own steam, providing an entry into a sport that they'd otherwise not consider, and providing a stepping stone on the way to more traditional pedal-powered trail riding."
  ],
  "headers": {
    "6": "The price of power",
    "8": "Analysis: electric mountain bikes are here to stay"
  },
  "links": {
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "off-road.cc": "https://off.road.cc/content/news/yeti-unleashes-the-160e-a-race-team-race-bike-with-a-motor-for-2022-8597",
    "2022 Yeti 160E": "https://yeticycles.com/",
    "Rad Power Bikes RadRhino 6 Plus": "https://www.techradar.com/news/rad-powers-latest-off-road-e-bike-is-super-powerful-and-surprisingly-cheap"
  }
}