{
  "source": "https://www.techradar.com/news/which-ring-video-doorbell-should-you-choose-on-black-friday",
  "title": "Which Ring Video Doorbell should you choose on Black Friday?",
  "category": "smart-home",
  "updated": "2021-11-13T11:10:10Z",
  "author": "alistair-charlton",
  "summary": "From the Ring Video Doorbell 4 to the Ring Video Doorbell Pro 2, here’s how to pick the right video doorbell for your home.",
  "article": [
    "The best video doorbells are a great way to ensure you never miss a delivery again by letting you converse with whoever is at your doorstep even when you’re not around. They’re often heavily discounted on Black Friday and Cyber Monday, which can make them a very appealing purchase too. In fact, you can be the first to know about all of the discounts as soon as they drop in our best Black Friday Ring video doorbell deals round-up.",
    "Ring, which is owned by Amazon, is one of the biggest names in the video doorbell market: it currently sells no fewer than eight different models of Ring Video Doorbell. At first glance, these all look pretty much the same. They all have a camera lens and a ringer button surrounded by a circular blue light.",
    "But each model is slightly different. Deciding on which Ring Video Doorbell is for you will depend on what you’re looking for. Do you have existing mains-wiring or do you require a battery-operated model? For many people, keeping a budget in mind will also help, but it's worth taking note of the features designed to help you identify what caused the doorbell to notify you about motion, and how much space on your wall the doorbell will take up.",
    "Know which Ring Video Doorbell you want, rather than reading our guide? Then check out these great deals for some of the best on the market right now.",
    "The Ring Video Doorbell 4 is the brand’s newest battery-powered video doorbell and is ideal for anyone that wants a fully-loaded camera doorbell. Colour Pre-Roll, where you can see up to four seconds of colour video from before the button was pressed, or before motion was detected, is what really sets it apart from other models. These extra seconds could be key to helping you work out what caused the camera to send a motion alert in the first place.",
    "Priced at $199.99 / £179 / AU$329, it records footage in Full HD and like all Ring Video Doorbells, it lets you see and hear whoever is on your threshold or within the camera’s field of view, while the microphone ensures you can converse with them too.",
    "It’s battery-powered but has the option to be attached to existing wiring, although this resorts in a trickle charge. Depending upon how often the doorbell is pressed and live view is activated, you may still find you need to charge the battery on the doorbell. In short, this is the Ring option that we think offers the most flexibility.",
    "The Ring Video Doorbell Pro 2, which costs $249.99 / £219 / AU$399,, may look the same as the previous version, but with a higher 1536 X 1536 resolution and 1:1 aspect ratio. This creates a head-to-toe view, which makes it easier to see if anyone on your doorstep has a package with them too – great for those who receive a lot of deliveries.",
    "It also benefits from 3D Motion Detection, a system for creating more precise motion notifications thanks to the inclusion of distance, speed, angle and trajectory data, along with a system called Bird’s Eye View, which creates an aerial map of your property to show when motion events took place over time.",
    "The doorbell requires existing electrical wiring, but also features colourized night vision, which uses ambient light in the camera’s field of view to apply a simulated color to the image, offering more detailed footage than other designs",
    "The Ring Video Doorbell Wired is the cheapest doorbell from Ring and is just $59.99 / £49 / AU$119, yet looks much like models costing several times as much. It uses existing doorbell wiring for power rather than a rechargeable battery and has a slightly narrower 155-degree field of view than other Ring models.",
    "Like all Ring Video Doorbells, it doesn’t come with a chime included and even though its mains-powered, it will bypass any existing chime you have in your home. Instead, an optional chime can be bought from Ring separately and plugged into any power outlet, or you can use an Amazon Echo smart speaker or Amazon Echo Show smart display.",
    "Ring sells this doorbell in Australia too, but only with a plug-in adapter instead of doorbell wiring. It is priced at AU$119.",
    "The Ring Video Doorbell (2nd generation) is priced at $99.99 / £89 / AU$149, making it ideal for those on a budget that don’t have existing doorbell wiring. This video doorbell has all of the features of the Ring Video Doorbell Wired (above) above, but is battery powered.",
    "As with all other Ring models, this doorbell camera is given extra software features if you subscribe to Ring Protect, which is priced from $3 / £2.50 /AU$4 per month. These features include People Only Mode, where you will only receive notifications when a person is detected; handy if you keep being alerted by next door’s cat.",
    "The $149.99 / £119 Ring Door View Cam, which is known as the Peephole Cam in the US, is unlike any other in the Ring range, as it attaches via the peephole of your door. That way, you can still see through the peephole (and a lens at the top of the Door View Cam), but also view who’s at the door via an integrated HD camera and the Ring phone app. This means no screws or mounts are required, and no wiring either as the camera is battery-powered. All this makes it even more landlord-friendly.",
    "This doorbell camera also features knock detection, so you can be notified by the Ring app when someone knocks at the door. The Door View Cam is compatible with doors that are between 34mm and 55mm thick. However, it’s currently not available in Australia.",
    "Ring has two generations of Video Doorbell Pro. Priced at $169.99 / £159, the original Ring Video Doorbell Pro has is powered from a standard electrical socket instead of doorbell wiring or a junction box. This makes it a good option for homes that lack any existing doorbell wiring.",
    "Like most other Ring doorbells, this model has 1080p Full HD video, infrared night vision, two-way communication and customizable motion detection, where you can set the camera to only be triggered by movement in a certain portion of its field-of-view.",
    "The Ring Video Doorbell 3 benefits from dual-band Wi-Fi with a 5GHz option for an improved connection to your router; this could be helpful for those who live in a property with a lot of wireless devices fighting for bandwidth.",
    "Priced at $179.99 / £159 / AU$299, this doorbell has a slightly wider lens than its predecessor, at 160 degrees compared to 155. It also comes with an integrated battery, but can instead be powered from doorbell wiring already installed in your home. As we’ve already mentioned, this does result in trickle charging, however. The Video Doorbell 2 and 3 are very similar, with the only real differences being the latter having 5GHz Wi-Fi and improved motion detection capabilities.",
    "Finally, the current flagship of the Ring Video Doorbell range is the Elite, which costs $349.99 / £349 / AU$499. This is powered by existing doorbell wiring and Ring recommends buyers have it installed by a qualified professional.",
    "The Elite stands out from other models of Ring thanks to its low-profile design and ability to be powered over Ethernet, for a more stable connection than Wi-Fi. It is also the only Ring doorbell to include multiple face plates in the box, with the options of satin nickel, pearl white, Venetian and satin black to help it match your home.",
    "But, beyond the aesthetics, its core feature set is similar to that of cheaper models. It records video in 1080p Full HD, has two-way audio, plus Quick Replies, infrared night vision, and a field-of-view that is 160 degrees horizontal and 90 degrees vertical."
  ],
  "headers": {
    "4": "Which is the best Ring Video Doorbell you can buy?",
    "7": "Which is the best Ring Video Doorbell for homes with lots of deliveries?",
    "10": "Which Ring Video Doorbell is best for those on a budget?",
    "13": "Which is the best battery-powered Ring Video doorbell for those on a budget?",
    "15": "Which Ring Video Doorbell should I buy if I’m renting?",
    "17": "What is the best Ring Video Doorbell for homes without doorbell wiring?",
    "19": "Which is the best Ring Video Doorbell for homes with poor Wi-Fi",
    "21": "Which Ring Video Doorbell is best for style?"
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "best Black Friday Ring video doorbell deals": "https://www.techradar.com/black-friday/the-best-black-friday-deals-on-amazons-ring-doorbell",
    "Ring Video Doorbell 4": "https://www.techradar.com/reviews/ring-video-doorbell-4",
    "Ring Video Doorbell Pro 2": "https://www.techradar.com/reviews/ring-video-doorbell-pro-2-review",
    "Ring Video Doorbell Wired": "https://www.techradar.com/reviews/ring-video-doorbell-wired-review",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "smart display": "https://www.techradar.com/best/best-smart-displays",
    "Ring Video Doorbell Pro": "https://www.techradar.com/reviews/ring-video-doorbell-pro-review",
    "Ring Video Doorbell 3": "https://www.techradar.com/reviews/ring-video-doorbell-3-plus-review"
  }
}