{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-august-21-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-08-20T14:32:49Z",
  "author": "axel-metz",
  "summary": "Here’s what’s dropping on streamers this weekend",
  "article": [
    "It’s been a while since the last good sci-fi thriller, hasn’t it?",
    "Christopher Nolan’s Tenet is probably the most recent example of a bona fide mind-bender, so it’s no surprise that Nolan’s sister-in-law and Westworld co-creator, Lisa Joy, should be the one to re-ignite the synapses in our moviegoing brains with Reminiscence, a time-hopping adventure in the vein of Inception.",
    "If you’re not one for recreational headaches, though, fear not. This weekend sees a host of new movies and TV shows dropping on the likes of Netflix, Amazon Prime Video and HBO Max. The Green Knight, in fact, is available to stream for those in the US, though some mixed marketing means we’re not certain of just how long A24 intends to keep the film available, nor exactly where in the world you can watch it. UK viewers who want to watch The Green Knight are still left in the dark, which is a poor showing.",
    "Below, then, we round up seven of the biggest streaming additions we do know are available to watch right now – from quirky new comedies to twisty dramas.",
    "Arriving as Warner Bros’ latest hybrid release gambit on HBO Max, Reminiscence stars Hugh Jackman as a private investigator living in a post-apocalyptic Miami tasked with sifting through memories to uncover a violent conspiracy.",
    "If that sounds like a perplexing premise, that’s because the movie comes from the mind of Westworld co-creator Lisa Joy, who makes her directorial debut here alongside her husband, Jonathan Nolan, who serves as executive producer.",
    "This memory-hopping thriller – which boasts shades of The Matrix, Inception, Gone Girl and, of course, Westworld – also stars Thandiwe Newton and Rebecca Ferguson, though it's so far been the subject of mixed critical reception.",
    "Still, we described Reminiscence as a “thrilling Westworld-style sci-fi movie” in our review, so there’s definitely something worth watching here. UK viewers will have to see this one on the big screen, as with all of Warner's movies on HBO Max in the US.",
    "Now available to stream on HBO Max in the US for 31 days",
    "Based on Liane Moriarty’s novel of the same name, Nine Perfect Strangers sees Nicole Kidman star as Masha, an owner of a holistic wellness spa who makes it her mission to ‘reinvigorate’ (inverted commas intended) the minds and bodies of nine unsuspecting guests.",
    "After also fronting Moriarty’s Big Little Lies adaptation, Kidman is typically unsettling as a woman who isn’t all that she seems, though critics have lauded the most praise upon co-star Melissa McCarthy’s scene-stealing turn as Francis.",
    "Luke Evans, Bobby Cannavale and Michael Shannon also star in Nine Perfect Strangers, which is now available to stream on Hulu in the US and Amazon Prime Video in the UK. New episodes are rolling out weekly.",
    "For more info on the making of the show, TechRadar chatted to actor Manny Jacinto, who spoke of its complex characters and themes.",
    "Now available to stream on Hulu in the US and Amazon Prime Video in the UK",
    "What is it with Netflix and dysfunctional schools? The Umbrella Academy, Sex Education, Elite… the list goes on, and The Chair’s arrival on the streamer this weekend does little to buck the trend.",
    "Produced by Games of Thrones showrunners David Benioff and D.B. Weiss (in what marks their first Netflix project), The Chair stars Killing Eve’s Sandra Oh as a newly-appointed English professor at a decidedly old fashioned (read: male-dominated) university.",
    "It’s a dramedy, so expect satire aplenty, but the show has also been praised for its smart skewering of academia – as well as Oh’s typically brilliant performance.",
    "Now available to stream on Netflix",
    "If Netflix has a thing for school-based dramas, Amazon loves a good one-word title. Anna, Jolt, Greenland… Borat? Annette – not a direct sequel to Anna, we’re told – is the latest in the sequence.",
    "The English-language debut for veteran French director Leos Cara, Annette follows the unravelling relationship of married couple Adam Driver and Marion Cotillard after the birth of their unexpectedly-gifted daughter.",
    "To say anything more would spoil the movie’s intrigue, but Annette seems like art cinema’s answer to Marriage Story. It’s also a full-on rock musical, which sounds… interesting.",
    "UK viewers will have to wait until November 26 to stream this one, which is when it lands on the movie specialist service Mubi – but it will be getting a theatrical run from September 3.",
    "Now available to stream on Amazon Prime Video US",
    "Again, definitely not a sequel to Sweet Tooth, Sweet Girl sees Jason Momoa embroiled in a political conspiracy as a man seeking justice for his wife's death, while also trying to protect his daughter from the resulting chaos.",
    "Momoa himself produces the movie, which is essentially a run-of-the-mill chase thriller with anti-Big Pharma sentiments, while long-time collaborator with the actor, Brian Mendoza, directs.",
    "If you watched Beckett last week, you’ll likely find more of the same man-on-the-run beats here – though that’s not necessarily a criticism.",
    "Now available to stream on Netflix",
    "Landing on Netflix via Nordic streamer Viaplay, The Defeated (originally called Shadowplay) sees Taylor Kitsch return to the screen as an American cop navigating the fallout of WWII in 1946 Berlin.",
    "This under-the-radar show also stars Nina Hoss (Homeland), Tuppence Middleton (Mank) and Logan Marshall-Green (Prometheus), and combines English and German-language action to provide an authentic portrait of post-war Europe.",
    "Critics haven’t weighed in on The Defeated just yet, but an interesting historical premise makes this one worth a look, regardless.",
    "Now available to stream on Netflix",
    "We couldn’t end the round-up without mentioning a new documentary now, could we? Luckily, In the Same Breath arrives on HBO Max to abate our weekly thirst for facts.",
    "This feature-length doc likely marks one of the first of many Covid-19-related exposés to hit streamers in the coming years, and explores how cover-ups in the early days of the pandemic led to... well, the world around you right now.",
    "That said, In the Same Breath is “not a film about a virus,” according to its director, Nanfu Wang, so expect a deeper dive into the dirty politics that kept the world in the dark about an issue that continues to reverberate all over the world.",
    "Now available to stream on HBO Max in the US"
  ],
  "headers": {
    "4": "Reminiscence (HBO Max)",
    "9": "Nine Perfect Strangers (Hulu/Amazon Prime Video)",
    "14": "The Chair (Netflix)",
    "18": "Annette (Amazon Prime Video US)",
    "23": "Sweet Girl (Netflix)",
    "27": "The Defeated (Netflix)",
    "31": "In the Same Breath (HBO Max)"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "our review": "https://www.techradar.com/news/reminiscence-is-a-westworld-style-sci-fi-movie-with-cautionary-tales-at-its-heart",
    "chatted to actor Manny Jacinto": "https://www.techradar.com/news/nine-perfect-strangers-on-hulu-and-prime-asks-how-far-youd-go-to-find-your-true-self",
    "Sweet Tooth": "https://www.techradar.com/news/sweet-tooth-season-2"
  }
}