{
  "source": "https://www.techradar.com/news/the-legend-of-zelda-skyward-sword-joy-con-are-wonderfully-regal",
  "title": "The Legend of Zelda: Skyward Sword Joy-Con are wonderfully regal",
  "category": "gaming",
  "updated": "2021-02-18T16:48:01Z",
  "author": "adam-vjestica",
  "summary": "Wield these carefully, hero",
  "article": [
    "Nintendo is set to release a delightfully ornate pair of Legend of Zelda: Skyward Sword Joy-Con – and they look fit for royalty.",
    "The company announced that a HD port of the 2011 Wii game was coming to its hybrid console on July 21, and while no special edition console was revealed, it is at least celebrating the milestone with a pair of custom Joy-Con controllers.",
    "The Legend of Zelda: Skyward Sword HD can be played using motion controls, much like how players experienced it on the Wii, or buttons if you’d prefer. Nintendo Switch Lite owners will have to make do without motion controls, unless they sync up a pair of detached Joy-Con.",
    "The Joy-Con are modeled on Link’s famous Master Sword and Hylian Shield, and mark the second time Nintendo has made a custom controller for Skyward Sword. Alongside its original 2011 release, the game launched with a gold Wii Remote as part of a special edition bundle.",
    "Collector’s will undoubtedly be eyeing this pair of Skyward Sword Joy-Con, not only because of the lavish and attractive design, but because Zelda’s 35th anniversary is fast approaching. It’s also rare that Nintendo releases custom Joy-Con controllers, as it has often kept special designs for bundles or the Nintendo Switch Pro Controller only.",
    "While fans of the long-running series may have been disappointed that Nintendo didn’t share any updates on Breath of the Wild 2, at least there will be a new Zelda game to play on Nintendo Switch this year if the heavily anticipated sequel slips to 2022.",
    "There was hope that Nintendo would announce a Legend of Zelda compilation for Nintendo Switch which would include Twilight Princess and Wind Waker, however, this turned out not to be the case.",
    "Rumors suggest that both Zelda games are indeed on the way, though, with an announcement tipped for later this year."
  ],
  "headers": {
    "5": "Legendary wait"
  },
  "links": {
    "Joy-Con": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Zelda’s 35th anniversary": "https://www.techradar.com/news/from-breath-of-the-wild-2-to-remakes-10-predictions-for-the-legend-of-zeldas-35th-anniversary",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Rumors suggest that both Zelda games": "https://www.techradar.com/news/zelda-twilight-princess-and-wind-waker-are-rumored-for-nintendo-switch-in-2021"
  }
}