{
  "source": "https://www.techradar.com/news/apple-watch-8-might-be-able-to-track-blood-sugar-and-alcohol-levels",
  "title": "Apple Watch 8 might be able to track blood sugar and alcohol levels",
  "category": "wearables",
  "updated": "2021-05-03T08:54:05Z",
  "author": "james-rogerson",
  "summary": "And blood pressure too",
  "article": [
    "A while ago we heard a rumor that the Apple Watch 7 might be able to monitor your blood sugar, and while a new report suggests that it probably won’t, it looks quite likely that the Apple Watch 8 will have the feature on board.",
    "That’s according to The Telegraph (a UK newspaper) which found in filings from the SEC (the US Securities and Exchange Commission) that Apple is the biggest customer of Rockley Photonics – a company that focuses on sensors that track blood sugar, blood pressure, and alcohol levels.",
    "On top of that, the CEO of Rockley Photonics has reportedly claimed that its technology would be in consumer products from 2022. They didn’t specifically say an Apple product, but with Apple being responsible for the majority of Rockley Photonics’ revenue over the past two years, that seems likely.",
    "If this tech does arrive in an Apple product then an Apple Watch is the obvious candidate, given that the company has made a big push to turn that into a health and fitness device.",
    "Of course, we wouldn’t necessarily expect the Apple Watch 8 to be able to monitor blood pressure or alcohol levels. Blood sugar seems the most likely, since that’s been rumored before, but it’s possible that it will be able to track two or even all three of those things.",
    "Blood sugar monitoring (also known as glucose monitoring) could be particularly useful for diabetics, as they need to keep a close eye on this. But it’s something that anyone who has an interest in how their body’s performing could also want to track, so it would be a handy feature for a future Apple Watch to have.",
    "Via Engadget"
  ],
  "headers": {
    "3": "Don't count on all three sensors"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "monitor your blood sugar": "https://www.techradar.com/news/apple-watch-7-and-samsung-galaxy-watch-4-both-could-get-potentially-life-saving-new-feature",
    "The Telegraph": "https://www.telegraph.co.uk/technology/2021/05/01/apple-watch-could-add-blood-sugar-alcohol-readings-deal-uk-tech/",
    "SEC": "https://sec.report/Document/0001193125-21-105235/",
    "Engadget": "https://www.engadget.com/apple-watch-blood-sugar-rockley-photonics-212241562.html"
  }
}