{
  "source": "https://www.techradar.com/news/you-can-now-pre-order-samsung-z-fold-and-flip-3-deals-from-these-retailers",
  "title": "You can now pre-order Samsung Z Fold and Flip 3 deals from these retailers",
  "category": "phones",
  "updated": "2021-08-12T13:35:51Z",
  "author": "alex-hughes",
  "summary": "A host of US carriers and retailers stocking these foldable phones",
  "article": [
    "Samsung’s two latest smartphones have officially launched today - the Samsung Galaxy Z Flip and Fold 3. Replacing the brand’s popular Note series, these are two premium devices with a unique feature - they fold.",
    "If you tuned in for the big reveal event and are now looking to buy them, we’ve got all of the information you need to know. Both handset’s are now in their pre-order stage, allowing you to get your hands on them as soon as they become available to buy on August 27.",
    "On top of the early access you’ll get, pre-ordering either of these handsets will also get you a free Fold starter kit including a charger, case and S Pen and a year of Samsung Care. If you head directly to Samsung you can also get a host of exclusive colours that aren’t available elsewhere.",
    "So you’ve decided you want one of Samsung’s latest foldable devices, but which of the two handsets is going to be the better fit for you? While the Fold is the more powerful, larger and overall, more impressive option, the Flip’s price is really impressive this year.",
    "Coming in at just $999, Samsung Galaxy Z Flip 3 deals cost less than the price of a Samsung Galaxy S21 Plus. Despite that, it is packed full of high-end specs like a 5nm 64-bit Octa-Core Processor, an 120Hz refresh rate display and more.",
    "Whichever of the two handsets interests you more, we’ve listed all of the retailers offering pre-orders down below.",
    "It will be no surprise to hear that both the Fold and Flip 3 are two of the best foldable smartphones on the market now. Both have been loaded with 2021 high-end specs and have seen considerable drops in their price tags compared to their predecessors.",
    "Samsung Galaxy Fold 3 The Samsung Galaxy Fold 3 received an incremental upgrade over its predecessor. As well as slightly cutting down the price, Samsung has loaded it with a 5nm 64-bit Octa-Core Processor.",
    "No changes were made to the camera and the battery saw a tiny reduction in its capacity but otherwise, everywhere else Samsung has made small upgrades. It has reduced the weight and cut down the size of the phone.",
    "Samsung Galaxy Flip 3 Considering the Flip 3 saw its price fall under the $1000 mark, it is suddenly looking like a really good value foldable phone. Like the Fold 3, it is now fitted with a 5nm 64-bit Octa-Core Processor and it now offers 120Hz refresh rates with its display.",
    "Also like the Fold, the Galaxy Flip 3 didn't see any changes to its camera quality but it has added a collection of new modes, allowing you to get the most out of your photos.",
    "One of the key upgrades with this device is in its strength, fitting a display that is 3x as strong as the Flip 2. And with a Full HD AMOLED performance stretching across a 6.7-inch display, the screen quality is, in typical Samsung fashion, looking impressive."
  ],
  "headers": {
    "6": "What are the Samsung Galaxy Flip and Fold devices like?"
  },
  "links": {
    "Samsung Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "head directly to Samsung": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1151336159239950600&xs=1&url=https%3A%2F%2Fwww.samsung.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fyou-can-now-pre-order-samsung-z-fold-and-flip-3-deals-from-these-retailers",
    "Samsung Galaxy Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review"
  }
}