{
  "source": "https://www.techradar.com/news/hbo-max-boosts-its-anime-library-in-fight-against-netflix",
  "title": "HBO Max adds four more anime films and two Ghibli documentaries to its library",
  "category": "entertainment",
  "updated": "2021-03-09T13:34:28Z",
  "author": "henry-st-leger",
  "summary": "New shows, old hits, and two Studio Ghibli documentaries",
  "article": [
    "HBO Max is not playing around. This month sees the TV streaming service build its already-impressive library of anime shows with a number of new films – as well as two documentaries looking at the famed Studio Ghibli production company and its most well-known director, Hayao Miyazaki.",
    "HBO's platform made quite a claim for itself as a home for anime in 2019, when it managed to net the rights to stream the entire Studio Ghibli movie catalogue, from My Neighbor Totoro and Spirited Away to Princess Kaguya and Howl's Moving Castle. In the US, it's the only place where you can stream the films, while Netflix has the rights in most other territories worldwide.",
    "It makes sense, then, for HBO Max to lean into its Ghibli associations, with not one but two documentaries. Subscribers are getting both Never-Ending Man: Hayao Miyazaki (a film about, you guessed it, Miyazaki) and The Kingdom of Dreams and Madness (more about the studio itself). You can sign up to HBO Max on its website.",
    "But the platform will also be home to two films from Masaaki Yuasa, the director behind Devilman: Crybaby (Netflix). The first, Ride Your Wave, is a love letter to surfing, youth, and, well, love; the second, The Night Is Short, Walk On Girl is a 2017 animated romantic comedy that you can stream on Netflix outside of the US.",
    "There's also Weathering With You, a supernatural story from the director of the massive hit film Your Name – and Promare, a fiery superpower anime from the studio behind the upcoming Edgerunners mini-series based on the world of Cyberpunk 2077.",
    "It's not surprising to see HBO Max seek to cement its status as a home for anime, particularly with the competition around. Sony-owned Funimation recently acquired Crunchyroll, consolidating the company's dominance of both subbed and dubbed anime in Western markets. Netflix, too, is continuing to produce and gain streaming licenses for a host of anime shows.",
    "2021 may be the year that HBO Max truly takes hold, though, with the same-day release of every Warner Bros. movie this year on the platform – a decision met with no small amount of ire from Dune director Denis Villeneuve and Tenet director Christopher Nolan.",
    "But the decision, however controversial, will mean HBO Max subscribers get a lot of new content to tide them over while cinemas remain either shut or unsafe, and it could be what the service needs to gain prominence in this fiercely competitive market."
  ],
  "headers": {
    "5": "There's competition"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "TV streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Studio Ghibli movie": "https://www.techradar.com/best/studio-ghibli-movies",
    "sign up to HBO Max on its website": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-6616721456667363000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhbo-max-boosts-its-anime-library-in-fight-against-netflix",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "anime shows": "https://www.techradar.com/best/best-anime",
    "Dune director Denis Villeneuve": "https://www.techradar.com/news/hbo-max-could-kill-the-dune-franchise-says-director",
    "Tenet director Christopher Nolan": "https://www.techradar.com/news/hbo-max-is-the-worst-streaming-service-says-tenet-director-after-movie-release-debacle"
  }
}