{
  "source": "https://www.techradar.com/news/logitech-says-its-the-end-of-the-line-for-its-harmony-remotes",
  "title": "Logitech says it's the end of the line for its Harmony remotes",
  "category": "smart-home",
  "updated": "2021-04-11T13:30:34Z",
  "author": "david-nield",
  "summary": "Support will continue though",
  "article": [
    "Logitech says it will no longer be manufacturing its series of Harmony universal remotes, which can control a variety of audio and video kit through one single device. With few hardware updates in recent years, the news doesn't come as a huge surprise.",
    "The announcement was made through a forum post (via TechHive), revealing that Logitech isn't going to be making or launching any Harmony remotes going forward – but that support will continue to be offered for existing models.",
    "\"We have been getting questions from the community surrounding the future of Harmony, and we're here with an official update,\" the post reads. \"While Harmony remotes are and continue to be available through various retailers, moving forward Logitech will no longer manufacture Harmony remotes.\"",
    "Various incarnations of the Harmony remote have been around for years at this point, and while their aim of offering one remote to control everything was a noble one, in the end it seems it hasn't been appealing or affordable enough for substantial numbers of users.",
    "Logitech seems committed to helping out customers who've already purchased a Harmony remote. Support and updates will be provided \"as long as customers are using [the platform]\" apparently, with no immediate impact on the user experience.",
    "\"We plan to continue to make updates to the Harmony desktop software and Harmony apps for Android/iOS,\" says Logitech. \"Our support team will continue to be available, and we will continue to offer resources such as FAQs on support.myharmony.com.\"",
    "Some stock is still available at third-party retailers, according to Logitech, so it is still possible to pick up a fully working Harmony Elite if you need one – that's the most recent and the most advanced universal remote in the series that's still on sale.",
    "Even the Elite is several years old at this point though, so you could say the writing has been on the wall. Logitech did debut a Harmony Express smart remote in 2019, but the product was discontinued less than 18 months after it first arrived."
  ],
  "headers": {
    "4": "Updates will continue"
  },
  "links": {
    "Harmony universal remotes": "https://www.techradar.com/reviews/logitech-harmony-elite",
    "forum post": "https://support.logi.com/hc/en-us/community/posts/1500000658341",
    "TechHive": "https://www.techhive.com/article/3614814/logitech-officially-discontinues-its-line-of-harmony-universal-remotes.html",
    "Harmony remote": "https://www.techradar.com/reviews/pc-mac/peripherals/input-devices/remote-controls/logitech-harmony-touch-1122730/review",
    "universal remote": "https://www.techradar.com/news/universal-remotes-101-the-ultimate-beginners-guide",
    "was discontinued": "https://www.techradar.com/news/logitech-pulls-the-plug-on-its-alexa-smart-remote-experiment"
  }
}