{
  "source": "https://www.techradar.com/news/call-of-duty-vanguard-zombies-is-happening-and-its-in-very-good-hands",
  "title": "Call of Duty: Vanguard Zombies is happening – and it's in very good hands",
  "category": "gaming",
  "updated": "2021-08-20T09:58:46Z",
  "author": "rhys-wood",
  "summary": "Zombies shambles into current-gen",
  "article": [
    "Yes, Call of Duty: Vanguard Zombies mode is happening, and its original creator, Treyarch, is handling its development. The popular co-operative horde mode has been a staple in Treyarch-developed CoD games since 2008's World at War, and it will be making a return this year.",
    "Activision discussed the return of Zombies in a press release, confirming that the ongoing Zombies narrative will be built upon in Call of Duty: Vanguard, while introducing new gameplay innovations to make the mode better than it's ever been.",
    "Zombies will be available in Call of Duty: Vanguard at launch on November 5, 2021 for PS4, PS5, Xbox Series X/S, Xbox One and PC via Battle.net, alongside the game's Campaign and Multiplayer offerings.",
    "Activision elaborated on Zombies' narrative continuation: \"From the birthplace of Zombies, Treyarch helps deliver a franchise first Call of Duty Zombies crossover as Vanguard connects with the Call of Duty: Black Ops Cold War Zombies storyline delivering a new connection for Call of Duty players.\"",
    "It sounds like fans of Call of Duty: Black Ops Cold War's Zombies offering will be able to pick up where they left off in the previous title, and Activision promises that \"players will be able to survive the relentless onslaught of the undead in a chilling all-new Zombies experience\".",
    "There's no doubt that Treyarch has developed some of the best Zombies modes for Call of Duty over the years, so we're confident that the ongoing co-op shenanigans are in safe hands with the developer in charge.",
    "It's interesting that the Zombies narrative will be a continuation of the plot set up in Black Ops Cold War, as Call of Duty: Vanguard takes place well before that. That said, Zombies modes aren't always tied to the era the main game is set in, but we do wonder if the likes of Frank Woods and Lawrence Sims will return as playable characters.",
    "Zombies has also featured no shortage of celebrity guest appearances over the years. Celebs who have previously starred in Zombies modes include David Tennant, Sarah Michelle Gellar, Danny Trejo and Ving Rhames. Real historical figures like John F Kennedy and Fidel Castro have also appeared as playable characters.",
    "We wonder if Treyarch has adopted a celeb-filled approach to Zombies in Call of Duty: Vanguard, or if it'll stick to recognizable series characters.",
    "Either way, knowing that Treyarch is behind the wheel of Vanguard's Zombies mode has us more than assured that it'll be a ton of fun. Treyarch's offerings are usually fantastic, loaded with great level design, hidden objectives and oodles of fun Easter eggs, including some that took years to discover."
  ],
  "headers": {
    "5": "Analysis: Treyarch is the perfect dev for the job"
  },
  "links": {
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Call of Duty: Black Ops Cold War": "https://www.techradar.com/reviews/call-of-duty-black-ops-cold-war",
    "took years to discover": "https://www.youtube.com/watch?v=LAU-JJjDj28"
  }
}