{
  "source": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought",
  "title": "Intel Alder Lake CPUs could be more powerful than we thought",
  "category": "computing",
  "updated": "2021-02-17T16:27:46Z",
  "author": "darren-allan",
  "summary": "Little cores could be cause for celebration even on desktop PCs…",
  "article": [
    "Intel’s 12th-gen Alder Lake processors could be more powerful than anticipated, at least if a new rumor is near the mark regarding the performance levels of the low-power (or ‘little’) cores on the chips.",
    "This interesting piece of speculation – and bear in mind, it is just a rumor floating down from a YouTube leaker, ‘Moore’s Law is Dead’, so plenty of salt at the ready – contends that the low-power cores won’t be so weedy as to be of dubious use on a desktop PC.",
    "Up until now, many folks reading up on Alder Lake rumors have been scratching their heads as to exactly how much use the low-power cores will be in a desktop scenario. Remember that Alder Lake is a very different design for CPUs from Intel, using a mix of normal (big) cores and efficient low-power (little) cores; much in the same vein as ARM’s big.LITTLE configuration.",
    "The big cores provide the usual power you’d expect from a contemporary CPU core, with the real oomph to get things done, while the little cores have obvious benefits for laptops – because they are seriously power-efficient, battery longevity could be considerably extended when only these cores are used to complete basic tasks and keep the system ticking over.",
    "Exactly how the little (‘Gracemont’) cores will fit in on a desktop PC is the question that has been causing the aforementioned head-scratching, but according to Moore’s Law is Dead, these little cores perhaps won’t be so little as we pictured.",
    "In actual fact, the Gracemont architecture could provide around the same performance levels as Intel delivered with Skylake – 6th-gen processors which are admittedly old now (they came out in 2015), but still, that kind of power is not what we were expecting from the ‘little’ guys in Alder Lake.",
    "And remember, these Gracemont cores are only backing up the main event, the big ‘Golden Cove’ cores on Alder Lake CPUs, which could deliver a hefty boost over Rocket Lake (Intel’s inbound next-gen processors that aren’t out yet). Moore’s Law is Dead estimates around a 20% performance improvement over Rocket Lake – so you’ll have 8 of those (16-threads) cores with the Gracemont power on top of that. (The rumor is that the top Core i9 Alder Lake chip will have 8 full Golden Cove cores plus 8 low-power Gracemont cores).",
    "Roughly, then, Moore’s Law is Dead speculates that compared to the incoming 8-core Rocket Lake flagship, the Alder Lake top dog CPU could offer performance equivalent to more like 10-cores, plus another 2.5-cores added courtesy of the Gracemont cores – to make for an equivalent of 12.5-cores of power on the desktop compared to Rocket Lake. Buckets of salt are needed here, of course, but that would be a Ryzen 5900X beater in theory.",
    "Indeed, before we get carried away with how Alder Lake could be a truly revolutionary leap for Intel, we must remember that this is just speculation. And even Moore’s Law is Dead admits that while the Gracemont architecture may (purportedly) be able to deliver IPC (instructions per clock) performance of around a Skylake level, those cores will be clocked slower; quite possibly much slower (and they won’t use hyper-threading, either – only the Golden Cove cores will).",
    "Even so, the discussion around this certainly makes Gracemont sound a lot more promising than we previously imagined in terms of backing up the full-power cores on Alder Lake CPUs. And this makes sense in terms of Alder Lake being a good direction for Intel to go on the desktop, and not just with laptops.",
    "However, a final warning comes directly from Moore’s Law is Dead in a reply to folks who are “getting ahead of themselves” in the comments thread on the YouTube video: “Having 8 Gracemont cores is NOT like having a ‘free 9900K’ attached to your CPU, but it may be close to an underclocked 9700K... which is impressive if these things use very little energy.”",
    "It’s also worth noting that a recently leaked Alder Lake-S performance benchmark looks promising, and that these processors will support DDR5 RAM and PCIe 5.0. Alder Lake is expected to debut in the second half of 2021, quite possibly in September, which won’t give Rocket Lake CPUs much airtime before they’re replaced.",
    "Via PC Gamer"
  ],
  "headers": {
    "8": "Clock speeds"
  },
  "links": {
    "processors": "https://www.techradar.com/news/best-processors",
    "Moore’s Law is Dead": "https://www.youtube.com/watch?v=wvKCQTWEep0",
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-12th-gen-cpus-could-usher-in-a-new-socket-in-2021-leaving-z490-motherboards-out-in-the-cold",
    "obvious benefits for laptops": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-something-very-special-for-laptops-leak-suggests",
    "recently leaked Alder Lake-S performance benchmark": "https://www.techradar.com/news/intel-isnt-messing-around-if-these-alder-lake-s-benchmarks-are-real",
    "will support DDR5 RAM": "https://www.techradar.com/news/intel-adler-lake-s-will-support-ddr5-according-to-new-benchmark",
    "possibly in September": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september",
    "Rocket Lake CPUs much airtime": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "PC Gamer": "https://www.pcgamer.com/uk/intel-alder-lake-gracemont-cores-skylake/"
  }
}