{
  "source": "https://www.techradar.com/news/vpn-usage-is-proving-a-security-liability-for-many-businesses",
  "title": "VPN usage is proving a security liability for many businesses",
  "category": "computing",
  "updated": "2021-02-06T11:00:23Z",
  "author": "mike-moore",
  "summary": "Inadequate security found to be the number one pain point when it comes to VPN usage",
  "article": [
    "Using VPN services could be causing businesses more headaches than expected, a survey has found.",
    "Small businesses across the world have embraced the use of VPN services as a way to ensure their employees stay connected with workplace networks during the pandemic, and the enforced periods of remote working.",
    "However, worries around security and efficiency of their chosen VPN are causing many SMBs to debate whether the services are really worth their while.",
    "A survey by software firm DH2i found that nearly two thirds (62%) of businesses reported inadequate security as their number one VPN pain point. This was followed by cost concerns (46%) performance issues (45%) and reliability of the services (48%).",
    "Security remained paramount for many users, however, with almost 40% of respondents believing their network had already been breached by malicious forces.",
    "DH2i noted that its survey was started before the global pandemic spread, and the lockdown orders that followed, meaning VPN usage could now be even higher than recorded. Its figures found that the top three use cases for VPN were remote user access (83%), site-to-site connections (57%) and site-to-cloud and/or cloud-to-cloud connections (48%).",
    "Many businesses also revealed they were not completely wedded to the idea of using VPN services forever. The survey found that 86% of respondents said they would consider an alternative if it could offer improvements in terms of security, configuration and management, cost, performance and availability.",
    "89% of the respondents went even further, noting that if they could limit remote users’ access to specific applications or services without creating a network attack surface, they would immediately embrace an alternative to VPNs.",
    "“It was indeed surprising to have almost 40% of those responsible for keeping ransomware and other malware from penetrating their network, believe that in fact, it already had. And, while this survey was completely anonymous, we believe that this number is actually even higher – as some respondents would likely prefer not to admit it, even to themselves,” said Don Boxley, CEO and Co-Founder of DH2i.",
    "“We expect this number to grow during the next research phase, given the rise in bad actors during the past year that were looking to exploit data security vulnerabilities as a result of the pandemic.”"
  ],
  "headers": {
    "3": "Security worries"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}