{
  "source": "https://www.techradar.com/news/the-tcl-6-series-could-feature-the-most-affordable-8k-tv-ever-made",
  "title": "The TCL 6-Series could feature the most affordable 8K TV ever made",
  "category": "televisions",
  "updated": "2021-01-11T15:35:00.410Z",
  "author": "nick-pino",
  "summary": "TCL is upgrading its popular 6-Series TVs to 8K in 2021",
  "article": [
    "8K could hit critical mass this year: TCL has just announced that its uber-popular 6-Series TVs will have 8K support in 2021.",
    "The 6-Series TVs, which have gained popularity in the last few years, have long-offered cutting-edge features like full array local dimming, quantum dot and, as of last year, mini-LED as well, and now you can add 8K resolution to the list, too.",
    "Though TCL hasn’t announced the pricing of the new 2021 R648 models, if past years' models like the TCL 6-Series R635 are anything to go by, we’re about to see a sub-$1,000 8K TV sometime in the next 12 months.",
    "Importantly, TCL says that it will still be making 4K versions of the 6-Series for folks who don't want to pay a premium for a mostly unsupported resolution, but the option is there for folks who want to pay a bit more for the extra fidelity.",
    "While it’s easy to get caught up in the whirlwind of flagship OLEDs from LG or cutting-edge QLEDs from Samsung, most of the flagship TVs shown at CES aren’t exactly affordable for the average joe trying to buy an affordable 4K TV.",
    "But TCL? It actually makes affordable TVs with some great features.",
    "The only downside about today's announcement is that we don't have exact details on all the specs – like how many HDMI 2.1 ports the TV will have, or if TCL plans on dropping the number of contrast control zones to save money.",
    "Those questions will likely be answered in a few months time before the TVs launch around mid-year, but even without those details the TCL 6-Series 8K is one of the most exciting TVs yet to be shown at CES."
  ],
  "headers": {
    "4": "High-end thrills at a low-end price"
  },
  "links": {
    "TCL 6-Series R635": "https://www.techradar.com/reviews/tcl-6-series-2020"
  }
}