{
  "source": "https://www.techradar.com/news/sonys-ps-plus-lineup-for-november-includes-three-bonus-psvr-games",
  "title": "Sony’s PS Plus lineup for November includes three bonus PSVR games",
  "category": "gaming",
  "updated": "2021-10-13T17:04:57Z",
  "author": "emma-boyle",
  "summary": "VR-y good",
  "article": [
    "It’s been five years since the launch of PlayStation VR and to celebrate Sony is adding three bonus PSVR games to November’s PS Plus lineup.",
    "Sony announced the news in a recent post on the official PlayStation Blog, saying that “to celebrate this PS VR milestone” and to “give a special thank you to PlayStation fans”, “starting in November, PlayStation Plus members will get three PS VR bonus games for no extra charge.”",
    "What exactly the three games will be hasn’t been confirmed just yet—we’ll likely learn more about that when the full November lineup is revealed towards the end of this month—but they’ll be in addition to the service’s usual three-game monthly offering.",
    "Elsewhere in the blog post, Sony revealed the five most popular games for the platform on a global scale but the results aren’t particularly shocking: Rec Room, Beat Saber, PlayStation VR Worlds, The Elder Scrolls V: Skyrim VR and Resident Evil 7 biohazard make up the list.",
    "Digging down into regions, there are some subtle differences to be found. While Beat Saber and The Elder Scrolls V: Skyrim are popular across Europe, Northern America and Japan, Job Simulator and Firewall: Zero Hour only appear on the most popular list for North America and Gran Turismo Sport only makes the top five in Japan.",
    "With Sony currently looking back over how far PlayStation VR has come, you might be wondering what the future holds. Well, things look very promising as we know that a successor to the current headset, known unofficially as the PlayStation VR 2, is currently in development.",
    "Working exclusively with the PS5, the PSVR 2 is expected to be a real step-up, with Sony saying that it will be “a next-gen VR system that enhances everything from resolution and field of view to tracking and input.” Sony has also promised improved ease-of-use with a single cord connection and a much-improved new VR controller, which will incorporate some of the features introduced in the new DualSense controller such as adaptive triggers. All in all, it’s a pretty enticing prospect.",
    "That said, while we’ve had a glimpse at the PSVR 2’s controllers, we’ve yet to see the headset itself and we don’t have any solid specs so there’s still plenty we have to find out.",
    "A recent report has suggested that when it comes to PSVR 2, Sony could lean more into hybrid experiences, which would mean more instances of VR modes being offered rather than standalone dedicated VR games. This wouldn't be a new thing—there are many great games that can be played with and without a PSVR headset—but we'd hope that a focus on hybridity wouldn't mean fewer unique purpose-built experiences. As it is, Sony hasn't confirmed this is its plan so, at the moment, it's best to take it with a pinch of salt.",
    "As for when we’ll get a chance to actually put on the headset, that also remains a mystery. Sony has ruled out a 2021 release—maybe not all that surprising given ongoing console shortages—so we’re looking hopefully towards the end of 2022.",
    "In the meantime, as Sony points out in its post, there are still several games in development for the original PSVR headset for players to look forward to, with Moss: Book II, Wanderer, After the Fall and Zenith: The Last City among them."
  ],
  "headers": {
    "5": "Analysis: What’s next for PSVR?"
  },
  "links": {
    "PlayStation VR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "official PlayStation Blog": "https://blog.playstation.com/2021/10/13/celebrating-five-years-of-playstation-vr/#sf250310085",
    "PlayStation VR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "we’ve had a glimpse at the PSVR 2’s controllers": "https://www.techradar.com/news/psvr-2-controllers-revealed-heres-what-vr-on-ps5-will-feel-like",
    "A recent report": "https://www.techradar.com/news/psvr-2-could-see-sony-sideline-vr-only-games-on-ps5",
    "fewer unique purpose-built experiences": "https://www.techradar.com/news/without-purpose-built-games-psvr-2-could-be-a-big-mistake-for-sony",
    "ongoing console shortages": "https://www.techradar.com/news/why-ps5-shortage"
  }
}