{
  "source": "https://www.techradar.com/news/major-windows-10-update-is-coming-to-more-pcs-whether-you-want-it-to-or-not",
  "title": "Major Windows 10 update is coming to more PCs – whether you want it to or not",
  "category": "computing",
  "updated": "2021-06-23T09:16:32Z",
  "author": "darren-allan",
  "summary": "Automatic rollout of May 2021 Update is stepping up a gear",
  "article": [
    "Windows 10 May 2021 Update is going to be coming to a lot more PCs from now on, as Microsoft is putting the pedal to the metal when it comes to the speed of the automatic rollout of the upgrade.",
    "Wccftech spotted that Microsoft has announced the beginning of a new phase of the deployment of the update also known as 21H1, and that the firm is confident that its AI-powered rollout will allow for a greater number of Windows 10 devices to be safely reached.",
    "Microsoft said: “We are now starting a new phase in our rollout. Using the machine learning training we have done so far, we are increasing the number of devices selected to update automatically to Windows 10, version 21H1 that are approaching end of servicing. We will continue to train our machine learning through all phases to deliver a smooth update experience.”",
    "As noted, the main push will be for machines which are on versions of Windows 10 that are about to run out of road for support, and that means versions as recent as the May 2020 Update, support for which expires in December 2021 (meaning vital security patches will no longer be delivered).",
    "Those users will soon find the May 2021 Update being pushed to their PCs automatically, although if you’re keen to upgrade, you needn’t wait – you can try heading to Windows Update and manually checking for updates, which might trigger the latest feature upgrade to appear.",
    "Windows 10 itself, of course, now has a defined lifespan, with support set to end in October 2025, with Windows 11 set to replace it later this year. Microsoft is expected to reveal the successor OS – which comes complete with a whole new look for the desktop – tomorrow on June 24, although we’ve already got a good look thanks to a leaked build of Windows 11."
  ],
  "headers": {
    "3": "End of support"
  },
  "links": {
    "Windows 10 May 2021 Update": "https://www.techradar.com/how-to/how-to-get-the-windows-10-may-2021-21h1-update",
    "Wccftech": "https://wccftech.com/windows-10-21h1-multi-month-automatic-update-process-begins/",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "support set to end in October 2025": "https://www.techradar.com/news/microsoft-is-planning-to-kill-off-windows-10-in-2025-does-this-confirm-windows-11",
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "complete with a whole new look for the desktop": "https://www.techradar.com/news/windows-10-could-be-getting-a-modern-redesign",
    "leaked build of Windows 11": "https://www.techradar.com/news/microsoft-issues-copyright-takedown-request-over-leaked-windows-11-build"
  }
}