{
  "source": "https://www.techradar.com/news/iphone-12-can-interfere-with-pacemakers-apple-confirms",
  "title": "iPhone 12 can interfere with pacemakers, Apple confirms",
  "category": "phones",
  "updated": "2021-01-25T10:22:08Z",
  "author": "james-rogerson",
  "summary": "But can still be used at a safe distance",
  "article": [
    "If you have a pacemaker then you might want to think twice about buying an iPhone 12 (or any other model in the iPhone 12 range), as one of the star features of the phone also makes it a risk.",
    "We’re talking of course about MagSafe, which uses magnets and radios to let you attach accessories to the back of the phone. If you have a pacemaker then you’re probably already aware that magnets don’t mix well with it, but Apple has now confirmed that the iPhone 12’s are no exception.",
    "In an update to a support document spotted by MacRumors, Apple states that you should keep your iPhone 12 and MagSafe accessories (including the MagSafe Charger and MagSafe Duo Charger) “a safe distance away” from your implanted pacemaker or defibrillator. Apple defines a safe distance as more than 6 inches / 15cm, or – if wirelessly charging – more than 12 inches / 30cm.",
    "The company also notes that you should “consult with your physician and your device manufacturer for specific guidelines.”",
    "Despite this new warning, Apple oddly also states that the iPhone 12 range is “not expected to pose a greater risk of magnetic interference to medical devices than prior iPhone models.”",
    "So the risk may not be high, but it’s probably not worth taking, especially since – as MacRumors notes – an article in the Heart Rhythm Journal previously suggested that an iPhone 12 could cause an implantable cardioverter defibrillator to enter a suspended state.",
    "None of this necessarily means that an iPhone 12 isn’t suitable for you if you have a pacemaker or defibrillator, just that you should be wary of the safe distances, and probably therefore not keep it in a chest pocket. But if in doubt, follow Apple’s advice to consult your physician.",
    "Via Engadget"
  ],
  "headers": {
    "3": "More magnets, more risk?"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "support document": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8874524532025396000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT211900",
    "MacRumors": "https://www.macrumors.com/2021/01/23/apple-updates-iphone-magnet-support-document/",
    "MagSafe accessories": "https://www.techradar.com/best/best-magsafe-accessories",
    "Heart Rhythm Journal": "https://www.heartrhythmjournal.com/article/S1547-5271(20)31227-3/fulltext",
    "Engadget": "https://www.engadget.com/apple-iphone-12-magsafe-pacemaker-warning-194549268.html"
  }
}