{
  "source": "https://www.techradar.com/news/motorola-phones-are-the-best-android-phone-deals-this-amazon-prime-day",
  "title": "Motorola offers the best cheap Android Prime Day phone deals",
  "category": "phones",
  "updated": "2021-06-22T22:03:53Z",
  "author": "michael-hicks",
  "summary": "14 sub-$200 Motorola phone deals, plus some lowest-price-ever discounts",
  "article": [
    "Prime Day deals are winding to a close, and many people are snatching up the excellent Galaxy S21 and S21+ deal still available on Amazon. But even up to $300 off, these phones are still expensive for frugal shoppers. For the best cheap phones that will save you real cash, you need to turn to Motorola.",
    "There are a huge number of discounted Motorola phones for Prime Day that'll remain on sale until the event ends. That includes the lowest prices we've seen on two solid Motorola phones – the budget Moto G9 Play ($50 off) and Techradar's 'best cheap 5G phone' pick: the Motorola One 5G ($100 off).",
    "If you look through our picks for the best Motorola phones, you'll find several other handsets on sale for Prime Day. The mid-range Motorola Edge ($220 off) is our number two pick thanks to its durable battery life, 6.7-inch 90Hz OLED screen, and impressive gaming performance. The #7 Moto G Power (20% off) and #8 Moto G9 Plus ($105 off) aren't as high performing but cost very little for their level of quality, even without a Prime Day deal.",
    "Almost every discounted Motorola phone costs less than $300 today, with performance that belies the cheap price. Plus, you can find the flagship OnePlus 8 for half-off today, another amazing Android deal. Below, you'll find links and more info on the best Android phone deals and which to buy.",
    "(Not in the United States? Scroll down for deals in your region).",
    "Motorola releases a huge number of phones every year, to the point that it's hard to determine which, if any, are worth buying! So we'll briefly break down the differences here.",
    "For the best performance, the Edge and One 5G both have the solid, mid-range Snapdragon 765G, though the Edge has 6GB of RAM instead of 4GB. The Stylus and Fast have the 665 and 4GB, while the Play and Power have the 662 and 4GB.",
    "Comparing displays, the Edge and One 5G both have 6.7-inch, 2K displays with 90Hz refresh rates; the difference is that the Edge is curved, while the One is LCD with a tall 21:9 aspect ratio. The Moto G Stylus is 1080p, while the rest are merely 720p, matching their low prices.",
    "For the best battery life, the Moto G Power has a massive 6,000mAh battery that'll last you for long stretches between charges, though it makes the phone thick and heavier. The Play and One 5G have solid 5,000mAh batteries, the Edge lasts about a day with its 4,500mAh model, and the Stylus and Fast make do with 4,000mAh batteries.",
    "Generally speaking, we reviewed most of these phones (not the Moto G Fast or Moto G Play 2021), and almost all of them received 4 out of 5 stars in their reviews – the Razr 5G disappointed us at 3 stars. These aren't perfect phones, but all performed very well for their respective price ranges. So which you choose will depend on what you're looking for in an Android phone; whichever you choose should serve you well.",
    "If you're not sold on Motorola, you can find deals on Samsung and OnePlus phones still available today:",
    "For folks outside of the US looking for Prime Day deals, you'll find all the lowest prices for the Motorola Edge, Stylus, Power, Fast, Play, Moto Razr 5G, and One 5G from around the web below."
  ],
  "headers": {
    "5": "Today's best Motorola deals on Prime Day",
    "10": "Other Android phone Prime Day deals",
    "11": "More Motorola deals",
    "12": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Galaxy S21 and S21+ deal": "https://www.techradar.com/deals/best-samsung-galaxy-s21-deals",
    "best cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "discounted Motorola phones": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fb%2F%3Fnode%3D23528186011%26ref%3Ddeals_primeday_deals-grid_slot-5_21f9_dt_dcell_tlt_1_2b1e8463%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5789326380745743000-20",
    "Moto G9 Play": "https://www.techradar.com/reviews/moto-g9-play",
    "Motorola One 5G": "https://www.techradar.com/reviews/moto-g-5g-plus-review",
    "best Motorola phones": "https://www.techradar.com/news/best-moto-phones",
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Moto G9 Plus": "https://www.techradar.com/reviews/moto-g9-plus-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8"
  }
}