{
  "source": "https://www.techradar.com/news/cyberpunk-2077-dlc-could-be-coming-soon-but-dont-hold-your-breath",
  "title": "Cyberpunk 2077 DLC could be coming soon – but don't hold your breath",
  "category": "gaming",
  "updated": "2021-01-02T10:51:57Z",
  "author": "olivia-tambini",
  "summary": "New ‘substantial story-driven content’ may have to wait",
  "article": [
    "The Cyberpunk 2077 launch on last-gen consoles has been a mess – and as a result, the free downloadable content (DLC) that was expected to be released in the coming months could be pushed back in favor of crucial patches for PS4 and Xbox One players.",
    "We first heard about the new DLC in a trailer from CD Projekt Red in December 2020, with the promise that DLC will drop as planned in \"early 2021\".",
    "In the trailer, CD Projekt Red said: “We’ll first be kicking off our free DLC program in early 2021. Just like with The Witcher 3, expect an assortment of free DLC packs to begin hitting Night City, dropping a bunch of cool stuff that’ll inject even more life into the world of the dark future.”",
    "The text also mentioned that expansions are coming for Cyberpunk 2077 – no great surprise there – but the developer assured us that these follow-ups will feature “substantial, story-driven content that’ll give you tough choices to make through impactful narratives that you won’t soon forget”.",
    "Of course, the promise of free DLC for Cyberpunk 2077 was made before the game was actually released – and before the surrounding outcry.",
    "With reports of hard crashes, bugs and poor performance on the base Xbox One and PS4 units plaguing the game since its launch, CD Projekt Red has since entered damage control on its open world RPG.",
    "In response, the developer offered refunds via social media, and Sony Interactive Entertainment (SIE) announced the removal of Cyberpunk 2077 from its PlayStation Store, offering full refunds to those who purchased the game via its online storefront. CD Projekt Red also released a transcript of a conference call discussing issues with the game.",
    "As The Verge points out, the planned DLC was announced before the developer began coordinating its response to the game's failings – and as a result could be delayed.",
    "In fact, during that conference call, CD Projekt president and co-CEO Adam Kiciński told investors that it was “too early to judge” when the company might be able to release DLC.",
    "For now, we're expecting to see two patches for Cyberpunk 2077 in January and February, which the company says will \"fix the most prominent problems gamers are facing on last-gen consoles\"."
  ],
  "headers": {
    "4": "Crucial patches"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/news/where-can-you-play-cyberpunk-2077-on-launch-day",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/original-2013-xbox-one",
    "in a trailer": "https://www.ign.com/articles/cyberpunk-2077-dlc-early-2021",
    "\"early 2021\"": "https://www.cyberpunk.net/en/dlc",
    "the developer offered refunds": "https://www.techradar.com/news/cyberpunk-2077-apology-promises-fixes-for-the-ps4-and-xbox-one-versions",
    "announced": "https://www.playstation.com/en-au/cyberpunk-2077-refunds/",
    "The Verge": "https://www.theverge.com/2021/1/1/22209719/cyberpunk-2077-free-dlc-early-2021",
    "two patches for Cyberpunk 2077": "https://twitter.com/CyberpunkGame/status/1338390123373801472/photo/1"
  }
}