{
  "source": "https://www.techradar.com/news/for-some-reason-zoom-wants-to-help-smooth-the-return-to-the-office",
  "title": "For some reason, Zoom wants to help smooth the return to the office",
  "category": "computing",
  "updated": "2021-02-03T14:01:13Z",
  "author": "joel-khalili",
  "summary": "Zoom is aiming to cement its place in the hybrid working environment of the future",
  "article": [
    "Zoom may have been one of the greatest beneficiaries of the pandemic and remote working explosion, but the company has revealed it intends to play a significant role in the return to the office too.",
    "The video conferencing firm has unveiled a selection of new features and additions to its product suite, designed to assist organizations in implementing health and safety policies once office doors reopen.",
    "For example, the company’s conference room solution, Zoom Rooms, can now be operated via mobile devices, eliminating the need for users to touch the shared in-room controls.",
    "Zoom Rooms devices can also be converted into a virtual receptionist via a new kiosk mode, allowing staff and guests to sign into offices with minimal face-to-face interaction or contact with shared surfaces.",
    "IT teams, meanwhile, will be able to use the Zoom dashboard to monitor the number of people in any given meeting, as well as the humidity and air quality in the room, provided supported hardware is installed.",
    "With vaccine rollouts gathering steam worldwide, the most begrudging remote workers will begin to entertain thoughts of a return to the office. However, it’s clear that certain measures will need to be put in place to mitigate associated risks and some workers will feel a greater sense of trepidation than others.",
    "The new enhancements, according to Zoom, will help address the three main concerns expressed by employees with respect to a return to the office: unwell co-workers, overcrowding and proper ventilation.",
    "“People are at the heart of every organization and keeping them safe, connected and productive is a top priority,” said Oded Gal, Chief Product Officer at Zoom.",
    "“As the world plans to safely reopen businesses, educational institutions, healthcare facilities and government entities, we are focused on innovating across our platform to support their needs.”",
    "With the pandemic having provided a perfect case study for the viability of remote working, but also its limitations, Zoom expects a large proportion of organizations to adopt a hybrid working model in future, whereby employees spend some time in the office and some at home.",
    "By broadening its offering with services that cater to both working environments, Zoom will hope to build on the momentum gathered during the pandemic and cement its place at the heart of business communications."
  ],
  "headers": {
    "5": "Zoom and the return to the office"
  },
  "links": {
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office#",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software"
  }
}