{
  "source": "https://www.techradar.com/news/noise-cancelling-headphones-deals-listen-in-peace-without-the-high-price-tag",
  "title": "Noise-cancelling headphones deals: listen in peace without the high price tag",
  "category": "news",
  "updated": "2021-06-23T00:55:34Z",
  "author": "olivia-tambini",
  "summary": "Don't miss these incredible ANC headphones deals",
  "article": [
    "Noise-cancelling headphones are perfect for when you want to lose yourself in your music without any distractions – but they can be pricey. However, these Prime Day deals prove that you don't have to break the bank in your quest for audio nirvana.",
    "Our top deal in the US is on the Sony WH-1000XM4 (AKA the best headphones you can buy today), which have been reduced from $348 to $248, saving you $100.",
    "There are great deals in the UK, too, with the Sony WH-1000XM4 also being discounted to £240 – though you'll need to act fast, as Prime Day has officially ended in the UK, and these deals probably won't last long. (Not in the US or UK? Scroll down for noise-cancelling headphones deals in your region).",
    "It's not just about over-ear headphones, either. There are plenty of fantastic deals on noise-cancelling wireless earbuds, from the Apple AirPods Pro to the Jabra Elite 85t, meaning there's a Prime Day headphones deal out there for everyone.",
    "No matter where you live, you'll find all the lowest prices for noise-cancelling headphones from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "More noise-cancelling headphones deals",
    "5": "More Amazon Prime Day deals in the UK"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "$248": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSony-WH-1000XM4-Canceling-Headphones-Phone-Call%2Fdp%2FB08MVGF24M%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1415611213268642300-20",
    "to £240": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB08C7KG5LP%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-6109365155443740000-21",
    "Prime Day headphones deal": "https://www.techradar.com/amazon-prime-day/best-prime-day-headphone-deals"
  }
}