{
  "source": "https://www.techradar.com/news/its-time-for-businesses-to-shore-up-their-cloud-strategy",
  "title": "It’s time for businesses to shore up their cloud strategy",
  "category": "computing",
  "updated": "2021-04-12T16:03:10Z",
  "author": "nick-turner",
  "summary": "After a year of heavy weather, businesses need to turn their attention to the future",
  "article": [
    "It’s been a stormy year for businesses. The wide-scale disruption of the pandemic has forced organizations across nearly every sector to rewrite the rules of digital engagement at a speed and scale many have never experienced before.",
    "Fortunately, the Covid-19 vaccine rollout is pushing some much-needed rays of light through the gloom. Even so, the weather ahead is by no means sunny skies just yet. Forecasting the future, and preparing for it, remains challenging.",
    "Last March, many businesses rapidly accelerated their journey to the cloud to support a digital workforce. According to a survey of more than 700 IT leaders in the UK and US, 68% have seen their digital transformation leap forward between one and five years during the pandemic.",
    "Digitization has become the standard, as technologies such as video conferencing, VoIP and remote collaboration tools have become ingrained into daily operations. And Covid-19 has given rise to a new generation of hybrid workers who expect far greater flexibility when, or if, they come to the office.",
    "However, while 83% of IT leaders have seen value from initial digital transformation efforts, they believe they “still have a way to go.” With many accelerating to the cloud, a successful migration will be dependent on a company’s ability to keep their data secure while scaling availability, storage and cost effectively for changing workloads needs. Cloud adoption is not as simple as flicking a switch. To protect against security risks and unlock the technology’s true value, organizations need to stop trying to play catch up with employees and instead start getting ahead of the game.",
    "Below are four steps businesses can take to turn their COVID cloud into their forever cloud, and thrive in a future of hybrid work.",
    "Bolt the door…then keep adding new locks",
    "Recently released UK government data reveals cyberattacks have spiked dramatically during the pandemic, with two in five UK firms experiencing a cyberattack within the last year. Meanwhile, our survey found 73% of IT leaders worry more about protecting their organizational data from ransomware now than before Covid-19.",
    "As employees increasingly access sensitive information from outside the office, organizations must ensure they have the right data protection strategy in place to keep data out of the hands of those who would exploit it. SaaS applications, cloud workloads, and endpoint devices can be especially vulnerable and are good places to start. But bolting the door is just the beginning; businesses must proactively maintain and extend their protection in line with the shifting nature of the cyberthreats they face.",
    "Train the security guards",
    "Data losses don’t just occur from the result of deliberate criminal action. As employees become accustomed to remote working, many companies fall afoul of simple human error. When such incidents occur, the key is to respond swiftly and decisively, thereby limiting the risk of further damage. And to keep missteps to a minimum, businesses should provide ongoing training to educate employees in their role as guardians of the organization’s data.",
    "Back up, back up, back up",
    "In a new digital working environment, people will make mistakes. Cloud systems may also fail in unexpected ways and new configurations can trigger latent software bugs. When things go wrong, data needs to be recovered quickly to curb business disruption, reduce risk to customers, partners or staff, and mitigate the possibility of any legal ramifications. Automating data protection in the cloud is the most effective way for businesses to guarantee their information is backed up and retrievable no matter what happens. Knowing you have a safety net will also let employees go about their jobs with greater confidence.",
    "Mind the gap",
    "As well as reinventing the concept of the office, the shift towards hybrid working has exposed a generational gap within many organizations’ workforces. While millennials and Gen Z who were raised on a diet of social media and mobile devices may feel confident working digitally, this isn’t necessarily the case for older generations or those for whom technology is less accessible. In their enthusiasm to progress, businesses must ensure no one is left behind. The new normal will only be normal if everyone has the skills, confidence, and support to participate in it.",
    "As we pass the one year anniversary of the first UK lockdown, organizations should take a moment to reflect on the whirlwind of the last twelve months. It has been a historic stretch, but we should also congratulate ourselves on the impressive display of resilience, agility and determination to reach this moment where overcoming the pandemic is in our reach.",
    "At the same time, this is not the moment to dwell on the past. With the promise of calmer weather ahead, businesses must step out of the storm and ensure their cloud strategy is ready to accelerate their business and prepared for whatever the world has planned next."
  ],
  "headers": {
    "5": "Four steps to success",
    "15": "One year onwards"
  },
  "links": {
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "VoIP": "https://www.techradar.com/news/best-voip-service",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}