{
  "source": "https://www.techradar.com/news/amazon-black-friday-deals-apple-macbook-air-last-chance",
  "title": "Today is your last chance to get a MacBook Air with Amazon's Black Friday deals",
  "category": "computing",
  "updated": "2021-11-25T18:03:17Z",
  "author": "alex-whitelock",
  "summary": "Not to be a downer, but these ones are selling real quick",
  "article": [
    "Today could be your last chance to score an Apple MacBook Air M1 at Amazon for $849.99 - they're almost all gone now apart from a few left in the Rose Gold color.",
    "Yes, it's not even Black Friday yet but Amazon has already pretty much sold out of all of its stock. The culprit? A sudden pre-Black Friday flash sale that saw this stunning ultrabook go for just $799 - easily the lowest price yet. At $50 more, today's sale isn't quite as good but we'd definitely consider it if Amazon is your retailer of choice - this one is sure to go quite quickly too as demand picks up tomorrow.",
    "Another good option today for Black Friday MacBook deals at Amazon is the larger 512GB model - which is also on sale for $1,099.99 (was $1,249). While not as cheap as the 256GB, this is a fine choice that's available in all colors. We'd definitely recommend it too - larger capacity storage models often fetch a lot more second-hand, should you want to sell on your laptop in a few years.",
    "There's also the 13-inch MacBook Pro M1 on sale for $1,100 (was $1,299) in today's Amazon Black Friday deals - a fine choice indeed if you need something with a bit more power and don't mind swapping out for a smaller storage drive. This one's got a real upcharge versus the baseline Air model, but the M1 chip inside this one works a lot harder thanks to the addition of some discreet fans.",
    "Outside the US? See the best Black Friday MacBook deals in your region just down below.",
    "Looking for a different model? We recommend our main Black Friday MacBook deals for today's best prices on the Pro models. Alternatively, head on over to our Black Friday laptop deals page for leading Window's machines from Dell, HP, and more."
  ],
  "headers": {
    "5": "A good alternative..."
  },
  "links": {
    "or $849.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MacBook-13-inch-256GB-Storage%2Fdp%2FB08N5M7S6K%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6611434947859038000-20",
    "for $1,099.99 (was $1,249)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MacBook-13-inch-256GB-Storage%2Fdp%2FB08N5LFLC3%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5483228841499467000-20",
    "for $1,100 (was $1,299)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08N5LLDSG%2Fref%3Dfs_a_mbt2_us2%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1350405281371847400-20",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday MacBook deals": "https://www.techradar.com/black-friday/black-friday-macbook-deals",
    "Black Friday laptop deals": "https://www.techradar.com/black-friday/black-friday-laptop-deals"
  }
}