{
  "source": "https://www.techradar.com/news/xiaomi-mi-11t-pro-edges-closer-to-launch-with-regulatory-approval",
  "title": "Xiaomi Mi 11T Pro edges closer to launch with regulatory approval",
  "category": "phones",
  "updated": "2021-08-02T12:16:36Z",
  "author": "david-nield",
  "summary": "It looks like the name's confirmed then",
  "article": [
    "If Xiaomi follows its usual path, then the Xiaomi Mi 11 will be followed by a more affordable Xiaomi Mi 11T model later this year – and new regulatory documents back that up, at least as far as the Xiaomi Mi 11T Pro model is concerned.",
    "As spotted by @stufflistings on Twitter, a device called the Xiaomi Mi 11T Pro has just been certified in Malaysia. It seems the same handset was approved by the Federal Communications Commission (FCC) in the US last month, though the Mi 11T Pro name wasn't mentioned.",
    "These certifications and approvals from regulators across the world are usually among the final steps before a gadget appears on the market, so it shouldn't be too long before the Xiaomi Mi 11T Pro (and probably the standard Xiaomi Mi 11T) show up.",
    "The Xiaomi Mi 10T and Xiaomi Mi 10T Pro were unveiled in the second half of last year, so it makes sense that Xiaomi would follow a similar sort of timetable in 2021, not wanting to cut off sales of the previous handset too early.",
    "From what we've heard so far, we're looking at phones with OLED screens, running at 120Hz, with up to 12GB of RAM and 256GB of storage on board. The rumors are that under-display cameras and ultra-wideband (UWB) will also be involved.",
    "The main differences between the standard and Pro version of the phone are expected to be the camera and possibly the processor too, with the Snapdragon 888 tipped to be inside the Xiaomi Mi 11T Pro. We did get a Lite version last year as well, but so far there's no sign of one this time around.",
    "You only need to take a quick look back at reviews of phones like the Xiaomi Mi 10 and the Xiaomi Mi 11 to see that we're usually very impressed with any mobile device that the Chinese tech giant manages to bring to market.",
    "The T variants provide something at a more affordable level, and if you want to spend even less then the Xiaomi Redmi phones have you covered. Few phone makers can balance performance, build quality and price quite as well as Xiaomi can at the moment.",
    "We're encouraged by news that the Xiaomi Mi 11T Pro is on the way, together with a standard, Pro-less variant, and having multiple Xiaomi phones at multiple price points is only going to end up benefiting consumers who have more handsets to choose from.",
    "Even Apple has realized the wisdom of having handsets that cover every level from budget to flagship, and we're hoping that the Xiaomi Mi 11T hits a sweet spot between features and affordability when it shows up later this year."
  ],
  "headers": {
    "3": "What we've heard so far",
    "6": "Opinion: the more Xiaomi phones the better"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "@stufflistings": "https://twitter.com/stufflistings/status/1422064185949626369",
    "Xiaomi Mi 10T": "https://www.techradar.com/news/xiaomi-mi-10t-release-date",
    "Xiaomi Mi 10T Pro": "https://www.techradar.com/reviews/xiaomi-mi-10t-pro-review",
    "The rumors are": "https://www.techradar.com/news/the-xiaomi-mi-11t-could-boast-two-innovative-upgrades-to-beat-the-iphone-13",
    "are expected": "https://www.gizchina.com/2021/08/02/xiaomi-mi-11t-pro-got-various-certifications-hinting-at-upcoming-launch/",
    "Xiaomi Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "the Xiaomi Redmi phones": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-5g"
  }
}