{
  "source": "https://www.techradar.com/news/star-wars-visions-a-galaxy-far-far-away-as-youve-never-seen-it-before",
  "title": "Star Wars: Visions is a galaxy far, far away as you’ve never seen it before",
  "category": "entertainment",
  "updated": "2021-09-21T15:11:58Z",
  "author": "richard-edwards",
  "summary": "How the new Disney Plus anime series is putting a new spin George Lucas’s universe",
  "article": [
    "The closing credits for Star Wars: Visions describe the show as “inspired by Star Wars created by George Lucas”. The line elegantly distils the essence of this new animated Disney Plus anthology series, because unlike most other Star Wars movies and TV shows released during the Disney era, its stories aren’t restricted by the existing canon of a galaxy far, far away.",
    "Instead, Lucasfilm has given a selection of top Japanese anime studios the freedom to reinvent the mythology of that famous universe how they see fit. The nine short films that comprise Visions are riffs on a theme of Star Wars, delivered in a variety of anime styles – ranging from dark and moody monochrome, to cute Chibi versions of Boba Fett and Jabba the Hutt.",
    "“We always knew we wanted to find a way to connect Star Wars to the storytellers in animation in Japan,” explains Star Wars: Visions executive producer James Waugh. “It was a matter of [finding] the best approach to allow those creators to do what they do best. That meant allowing them to explore all their imaginative potential in a way that didn't have the expectations of the core [Star Wars] saga story.",
    "“[Lucasfilm president] Kathy Kennedy was actually the person who really championed this,” he continues. “She'd worked with [Studio Ghibli legend] Hayao Miyazaki, and she loved the work coming out of Japan. So we very quickly started taking meetings with different studios that we liked – we found unbelievable Star Wars fans, incredible passion, enthusiasm and great ideas.”",
    "One of the other big reasons for Visions’ existence is the arrival of Disney Plus, which has given Lucasfilm a platform to try out more experimental Star Wars projects that may not reach orbit on other networks and streamers.",
    "“The world very quickly evolved when Disney Plus became an option,” Waugh explains. “It became this incredible robust space to be able to tell new stories. Then we got to a place of thinking, ‘There’s so many great, unexpected stories and perspectives on Star Wars – where do we start?’ That’s when we realized the power of Disney Plus allows us to break traditional form, and we decided to do something more anthological, and to really showcase the entire spectrum of tones and styles going on in Japan.”",
    "Freed from the constraints of existing mythology, Star Wars: Visions reveals aspects of that famous galaxy we’ve never seen before. While the lightsabers, Stormtroopers and Star Destroyers look familiar, they’re also reflected through an all-new prism, with exciting new reinterpretations of very familiar iconography. But, with the envelope being pushed by the creative teams, was there ever a moment when Lucasfilm felt the need to hold them back?",
    "“I think, in general the misnomer is that we're usually not [open to new ideas] in some sense,” Waugh counters. “And I think, no matter what kind of storytelling we're doing, we're always trying to find a way to make sure a creator can realize their vision. With these Visions in particular, there was an opportunity to use the form of animation to do things we just haven’t done in live-action.”",
    "That freedom to experiment allows ‘The Ninth Jedi’ – one of the standout episodes of the anthology – to put an entirely new spin on the color-scheme of a Jedi’s lightsaber. “We definitely had an internal conversation of, ‘Look, this isn’t normally what we do, but it really works with the logic of the story,’” says Waugh. “Also, the inherent values of Star Wars are so baked into that short that we went with it.”",
    "And while musicians have always been a part of the Star Wars universe – from Figrin D’an and the Modal Nodes in A New Hope to the Max Rebo Band in Return of the Jedi – ‘Tatooine Rhapsody’ breaks convention by putting rock group Star Waver (quite literally) on center stage.",
    "“‘Tatooine Rhapsody’ was one of the first pitches we got, and it definitely was a testing ground moment for us,” Waugh admits. “‘Can we do a space opera? Is this too far?’ But I think that, very quickly, we realized just how cool and unique [it was], and how Visions essentially opens the door for lightsabers that change color and rock operas – and Pinocchio stories about droids who wish they could become a Jedi one day.”",
    "“Star Wars is a universe and there’s history and storytelling going on all the time,” Waugh adds. “With Star Wars the opportunity to be able to continue those stories in other spaces is, I think, absolutely there. I personally want to see the band, Star Waver, carry on – we'll see what happens with that, but I think potential is rife. All those ideas are just so unique – I hope the enthusiasm is there, because we're really excited about that potential too.”",
    "Another of the most compelling elements of Visions is the way the Japanese influence shines through, both in the soundtrack (both Japanese and English-language dubs are available), and the visuals, where elements of Japan’s culture, architecture and history mesh seamlessly with the iconography of George Lucas’s universe.",
    "“George Lucas was inspired by Akira Kurosawa films and classic Japanese cinema,” says producer Kanako Shirasaki. “Now animators and creators in Japan are heavily influenced by Star Wars, because they watched Star Wars when they were teenagers, or really small with their parents. They have the essence of both, and they’re very excited to explore their visions, drawing influence from Star Wars, while at the same time bringing their Japanese aspect to the shorts.”",
    "“The sort of dialogue between East and West, culture inspiring culture, has been really amazing to watch,” continues Waugh. “Star Wars is so infused with Kurosawa films and [Japanese film genre] Jidaigeki storytelling that it almost feels that it was coming home in a way.”",
    "As ever in the Star Wars franchise, there’s also the potential for the Star Wars: Visions shorts to spin-off in other directions – in fact, the story of the mysterious lead character from ‘The Duel’ will continue in novel Ronin by Emma Mieko Candon (on sale October 12).",
    "“There's so many interesting droids and characters in every short that you feel you want to learn more about them,” says Shirasaki. “I’d love to hear how fans react when the series is officially released.”",
    "Star Wars: Visions debuts on Disney Plus on Wednesday September 22."
  ],
  "headers": {
    "6": "A new Vision",
    "11": "East meets West"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Star Wars movies": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order"
  }
}