{
  "source": "https://www.techradar.com/news/best-batman-games-to-play-while-waiting-for-gotham-knights",
  "title": "Best Batman games to play while waiting for Gotham Knights",
  "category": "gaming",
  "updated": "2021-04-24T11:00:18Z",
  "author": "matthew-forde",
  "summary": "Become the Knight",
  "article": [
    "As the gaming industry continues to feel the knock-on effects of the ongoing pandemic, Gotham Knights became yet another causality of launch delays, with Warner Bros pushing the action RPG out of its 2021 release window and into an unknown date in 2022.",
    "With this, and the inevitable likelihood that Suicide Squad: Kill the Justice League will similarly be delayed (also currently slated for 2022), it means there will have been no new Batman game for four years. A dark day for Gotham indeed.",
    "Thankfully, the Dark Knight already has a plethora of excellent outings readily available across most major consoles and PC to keep players occupied for the foreseeable future. So, suit up, prepare the Batmobile, and grab the nearest can of shark repellent spray you can find, as we dive into the best Batman games to play while waiting for Gotham Knights.",
    "Platforms: PS4 and Xbox One",
    "Since 1986, the Caped Crusader has received all manner of game experiences, however, it wasn't until Arkham Asylum in 2009 that players actually felt what it was really like to be the Bat. Developers Rocksteady followed up this success in the sequel, Arkham City, creating not only the best Batman games on this list but arguably two of the greatest video games ever to exist.",
    "The decision to bring back Kevin Conroy as Batman and Mark Hamill as The Joker was an inspired choice, giving fans of the animated series and alike memorable performances that will live on for years to come. This remaster puts both absorbing adventures together in one collection, including all of the previously released downloadable content. Smashing.",
    "Platforms: PS4, Xbox One, Nintendo Switch, and PC",
    "While not strictly an out-and-out Batman title, the character does feature plenty throughout this \"bricktastic\" action-adventure. Anyone that has played a Lego game will be well aware of just how much love and charm is poured in by Traveller's Tales. Of which, Lego DC Super-Villains lives up to the studio's high standards, with an even more impressive roster.",
    "Having the opportunity to masquerade as everyone from The Joker and Lex Luthor to Polka Dot Man and the Condiment King is exactly the sort of bonkers setup that makes this franchise as fun as it is. Also, it's hard to discount the added two-player co-op that works swimmingly, allowing both casual and hardcore players to explore together without any irritation of one holding the other back.",
    "Platforms: PS4, PS3, Xbox One, Xbox 360, Nintendo Switch, iOS, Android, and PC",
    "Looking to eradicate all of the tireless gameplay and get down to the core story beats? Well, Batman: The Telltale Series may be exactly what you're looking for. This five-episode (per season) point-and-click adventure puts you firmly in the shoes of Bruce Wayne, making decisions that impact the overall narrative arc, for better or worse.",
    "Going in with an open mind makes this adaptation hugely rewarding; notably because of its dark tone and a surprising amount of detective work that forces the \"world's greatest\" to prove he is just that. Not to mention, the episodic nature makes for great evening entertainment, splitting each two-hour segment into chunks that you play through at your own leisure… or just binge-watch (play?) the whole thing as we did with no regrets.",
    "Platforms: PS3, Xbox One (backward compatible), Wii U, and PC",
    "Taking inspiration from the likes of Batman: Year One and Legends of the Dark Knight, Arkham Origins sees WB Games Montréal behind the (Bat) wheel. Set on Christmas Eve, a young Batman goes up against Black Mask and eight other assassins (enter the rogue's gallery) after the mafia boss puts a bounty on his head.",
    "The snow-drenched Gotham is a wonder to explore, while the combat is hugely satisfying without straying too far from the near-perfect system established in Asylum and City. Incredibly, this 2013 prequel was the last game shipped by WB Games Montréal until the yet-to-be-released Gotham Knights - putting nine years between releases. Let's hope history doesn't repeat itself.",
    "Platforms: PS4, Xbox One, iOS, Android, and PC",
    "Batman v Superman may not have been the knockout punch general audiences wanted, so NetherRealm Studios took it upon themselves to give fans just what they wanted - action, spectacle, and a surprisingly cohesive story. More widely recognized as the creators of Mortal Kombat, the Chicago-based developer went all out for Injustice 2, with its deep combat system, impressive visuals, and abundance of customization options. Seriously, it's mighty impressive how much content is here.",
    "As mentioned, the shock factor arrives from the story. No last-minute cobbled together narrative just used to square our superheroes off against one another. It's actually a deep plot that is rooted in comics, as Batman leads a team of reformed heroes against the Society, a line-up of villains fronted by Gorilla Grodd. All of this while a tyrannous Superman and invading Brainiac loom, as each vies for control of the planet. Chaos. Beautiful chaos.",
    "Platforms: PS4, Xbox One, and PC",
    "It's a testament to the ingenuity at Rocksteady that, nearly six years on, Batman: Arkham Knight is still one of the best looking games of the last generation. Closing the Arkham trilogy in fine fashion, Bruce goes up against Scarecrow in an open-world Gotham that pushes the billionaire philanthropist to the brink of insanity.",
    "Most infamously, the Batmobile makes its debut; being fully playable to traverse the streets, launch the Dark Knight skywards, and (gently) concuss thugs from any wrongdoings. Remember. Batman doesn't kill (wink, wink). This blockbuster climax to the series is full of memorable moments, gripping tension, emotional resonance, and enough Riddler trophies to drive the Joker insane. Still, what a crowning achievement."
  ],
  "headers": {
    "3": "Batman: Return to Arkham",
    "6": "Lego DC Super-Villains",
    "9": "Batman: The Telltale Series 1/2",
    "12": "Batman: Arkham Origins",
    "15": "Injustice 2",
    "18": "Batman: Arkham Knight"
  },
  "links": {
    "Gotham Knights": "https://www.techradar.com/news/gotham-knights-release-date-trailers-gameplay-news-and-rumors",
    "Suicide Squad: Kill the Justice League": "https://www.techradar.com/news/suicide-squad-game",
    "Injustice 2": "https://www.techradar.com/how-to/injustice-2-tips-and-tricks"
  }
}