{
  "source": "https://www.techradar.com/news/apples-adaptation-of-asimovs-foundation-series-gets-a-launch-date",
  "title": "Apple's adaptation of Asimov's Foundation series gets a launch date",
  "category": "entertainment",
  "updated": "2021-02-15T15:53:41Z",
  "author": "harry-domanski",
  "summary": "Sci-fi epic to start streaming on Apple TV Plus late this year",
  "article": [
    "Apple's adaptation of Isaac Asimov's classic Foundation sci-fi novels is unquestionably one of the most high-profile original shows coming to the Apple TV Plus streaming service, and we've just learned a little more about when we can expect it to land on our screens.",
    "New information on the series comes from interviews that writer David S. Goyer and executive producer Michael Malone gave to LovinMalta, a publication that covers the Maltese Islands, a prominent filming location for the show.",
    "According to the publication, the first season of Foundation will consist of 10 episodes and is due to land in \"Autumn 2021\", which would place it roughly within the last three months of this year. Those initial 10 episodes are just the tip of the iceberg, however, with LovinMalta reporting that current plans include an impressive 80 episodes in total.",
    "Speaking on the filming location itself, Goyer said that \"Malta was always part of the plan. We have a water planet [...] and Malta has copious water tanks – there aren't a lot of those in the world.\"",
    "Due to the pandemic and its impact on filming, Goyer states that the team \"decided to expand [its] footprint on Malta\", with some other locations in the series now being represented by other areas of the island country.",
    "Asmiov's series of novels centre around a futuristic and space-faring human civilization, where Hari Seldon (played by Jared Harris) hopes to better humanity with his future-predicting theory of psychohistory.",
    "Other details of Apple's take on the sci-fi epic are thin on the ground, with little else being revealed since the teaser trailer dropped in June last year. For now, you can soak in everything that trailer has to offer below until we hear more."
  ],
  "headers": {
    "3": "Solid foundations"
  },
  "links": {
    "Apple TV Plus streaming service": "https://www.techradar.com/reviews/apple-tv-plus",
    "LovinMalta": "https://lovinmalta.com/lifestyle/film/watch-malta-will-be-turned-into-a-water-world-in-apple-tvs-epic-new-asimov-sci-fi-series-foundation/",
    "teaser trailer dropped in June last year": "https://www.techradar.com/news/apple-teases-its-upcoming-isaac-asimov-foundation-series-in-stirring-new-trailer"
  }
}