{
  "source": "https://www.techradar.com/news/huawei-could-launch-a-foldable-phone-to-rival-the-samsung-galaxy-z-flip-3",
  "title": "Huawei could launch a foldable phone to rival the Samsung Galaxy Z Flip 3",
  "category": "phones",
  "updated": "2021-11-30T13:00:22Z",
  "author": "david-nield",
  "summary": "Going for the clamshell look",
  "article": [
    "Huawei has already dabbled in foldable phones with the Huawei Mate Xs and Mate X2, but it could be changing direction with its next effort: the latest rumor is that Huawei will soon launch a clamshell device in the vein of the Samsung Galaxy Z Flip 3.",
    "This leak comes via sources on Chinese social media platform Weibo (via Notebookcheck.net), and mass production has apparently already started on the new phone. That means it could be officially unveiled before the end of the year.",
    "We don't have much more information about what this clamshell phone is going to look like, though it's apparently the manufacture of a simplified hinge that has revealed the device's existence. Let's hope a simpler hinge means a lower price too.",
    "The only other detail we get from this particular source is that the foldable phone will come with a \"fashionable\" design and a \"rich\" color scheme (if Google Translate can be trusted). It sounds as though the new clamshell will be made to catch the eye.",
    "This is by no means the first time we've heard rumors of a clamshell Huawei foldable phone – we saw patents for this device over a year ago. More recent leaks have suggested that the upcoming handset could be called the Huawei Mate V when it appears.",
    "Due to the ongoing trade restrictions that the US is imposing on Huawei, it is going to have to settle for 4G technology for the time being. The Huawei Mate V could well come running a 4G version of the Snapdragon 888 when it makes its debut.",
    "However you like your foldable phone – as a clamshell you can snap shut, or as a device that opens up like an electronic book – the main appeal is the same. You've got a fully functioning, full size phone that also fits neatly in your pocket.",
    "There's a lot that's different in terms of these two form factors though. The phone-to-tablet transformation ultimately gives you much more in the way of screen space: the display on the Samsung Galaxy Z Fold 3, for example, measures a rather impressive 7.6 inches when opened out.",
    "The clamshell form factor, meanwhile, is much more about keeping the dimensions of the device down and making it more convenient to use. The likes of the Samsung Galaxy Z Flip 3 and the Motorola Razr can be operated with one hand, you'll notice (and can be locked with a pleasing snap as well).",
    "Samsung has decided that it wants to cover both bases with its foldable phone range, and it would appear that Huawei is about to follow suit – and as always, more hardware on the market means a wider choice of devices for consumers to pick from."
  ],
  "headers": {
    "3": "A simplified hinge",
    "6": "Analysis: a tale of two form factors"
  },
  "links": {
    "Huawei Mate Xs": "https://www.techradar.com/reviews/huawei-mate-xs",
    "Mate X2": "https://www.techradar.com/news/huawei-mate-x2",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Notebookcheck.net": "https://www.notebookcheck.net/Huawei-tipped-to-release-a-cheap-clamshell-foldable-smartphone-next-month-mass-production-already-started.582082.0.html",
    "saw patents": "https://www.techradar.com/news/huaweis-next-foldable-phone-could-have-a-clamshell-design-like-the-galaxy-z-flip",
    "have suggested": "https://www.techradar.com/news/huawei-could-launch-a-samsung-galaxy-z-flip-3-rival-soon",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Motorola Razr": "https://www.techradar.com/reviews/motorola-razr-2020-review"
  }
}