{
  "source": "https://www.techradar.com/news/sony-launches-its-fastest-ever-lens-for-alpha-mirrorless-cameras",
  "title": "Sony launches its fastest ever lens for Alpha mirrorless cameras",
  "category": "cameras",
  "updated": "2021-03-16T21:51:39Z",
  "author": "mark-wilson",
  "summary": "Behold Sony's new 50mm f/1.2 prime",
  "article": [
    "Sony has just launched its brightest ever lens for Alpha cameras – a 50mm f/1.2 GM (or 'G Master') lens that's aimed at professional street, portrait, and video shooters.",
    "The much-rumored lens, which has been designed for pro bodies like the Sony A7R IV and Sony A1, is a piece of flagship glass that's here to show off what's possible on with the latest E-Mount cameras.",
    "The 50mm focal length is renowned for being a camera bag essential and offers a similar field of view to the human eye, making it a versatile option for all kinds of photography.",
    "What's interesting about the 50mm f/1.2 GM is its combination of that bright maximum aperture – which promises to deliver some stunning bokeh (or background blur) – and its relatively compact, lightweight dimensions.",
    "Impressively, the 50mm f/1.2 GM weighs exactly the same (778g) as the older Planar T FE 50mm f/1.4 ZA, which lets in significantly less light (around half a stop less) due to its f/1.4 aperture. It's also similar in size to Canon's RF 50mm F1.2L USM, and smaller than its Nikon equivalent.",
    "Sony's new 50mm f/1.2 is its 13th 'G Master' lens, which is a sub-brand that it created back in 2016 to denote its highest-quality lenses. This means the new 50mm prime also comes with the latest advances in lens construction and autofocus powers.",
    "This includes four XD linear motors that are fast enough to keep up with the demands of Sony's latest AF systems, and powerful enough to move around the lens' 10 groups of 14 glass elements. If previous GM lenses, like the Sony FE 35mm f/1.4 GM, are anything to go by, you can also expect that autofocus to be near-silent.",
    "Further boosting its premium billing, the 50mm f/1.2 GM also has Sony's latest Nano AR Coating II, which promises to reduce internal reflections so that ghosting and flare issues are kept to a minimum. The lens' 11-blade circular aperture should also produce super-smooth bokeh, particularly with close-ups – with the lens capable of focusing on objects from as close as 15.7 inches / 40 cm.",
    "Naturally, all of this performance comes at a cost. The Sony 50mm f/1.2 GM costs $1999 / £2,100 / AU$3,399, with the on-sale date dependent on where you live – in the US and Australia it's expected to arrive some time in May, while those in the UK will be able to get their hands on one in April.",
    "We're in the process of testing the 50mm f/1.2 GM – the unofficial notes from the field so far include the words \"damn sharp\" and \"sublime\", but we'll bring you our official verdict on whether it can justify that hefty price tag very soon."
  ],
  "headers": {
    "6": "Focus groups"
  },
  "links": {
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A1": "https://www.techradar.com/news/sony-alpha-a1-camera-official-and-its-the-most-powerful-mirrorless-camera-so-fa",
    "Sony FE 35mm f/1.4 GM": "https://www.techradar.com/reviews/sony-fe-35mm-f14-gm"
  }
}