{
  "source": "https://www.techradar.com/news/ps5s-dualsense-could-inspire-updates-to-the-xbox-controller-says-phil-spencer",
  "title": "PS5’s DualSense could inspire updates to the Xbox controller, says Phil Spencer",
  "category": "gaming",
  "updated": "2021-08-30T02:04:52Z",
  "author": "emma-boyle",
  "summary": "“I think Sony's done a nice job with their controller”",
  "article": [
    "Head of Xbox, Phil Spencer, has said that the Xbox controller could get an update sometime in the future, while complimenting what Sony has done with the PS5’s DualSense.",
    "Spencer discussed peripherals and the possibility of an updated Xbox Series X/S controller in the latest episode of Kinda Funny Gamescast (via VGC), saying that the team is “definitely thinking about different kinds of devices that can bring more games to more places.”",
    "“There’s probably some work we’ll do on [the] controller,” Spencer said, adding, “I think Sony’s done a nice job with their controller, we kind of look at some of that [and think] ‘are there things that we should go do?”",
    "While the new Xbox Wireless controller takes a more iterative approach, improving on its predecessor in subtle but important ways, the DualSense is more of an overhaul, introducing new features like adaptive triggers and haptic feedback.",
    "Of course, Xbox has already shown that it’s paying attention to what its competitors are doing before now—as recently as January 2021, a survey asked Xbox Series X/S owners if they were “aware of features on PlayStation controllers” that they wish were on Xbox controllers.",
    "Adding to that, this isn’t the first time Phil Spencer has offered praise for the DualSense; shortly after the launch of the new consoles, Spencer told The Verge, “I applaud what they did with the controller...I think for all of us in the industry, we should learn from each other and the innovation that we all push on, whether it’s distribution of business model like Game Pass, or controller tech…”.",
    "Spencer then went on to explain to The Verge that people have a “common expectation” for the Xbox controller and that while “it doesn’t keep us from innovating...we do have to think about all of the use cases that are out there. We can’t turn the controller inside out because there’s so much expectation about the way it should work now. We can innovate on top of that, and we’re going to look at what any other company does and learn from it, and see if it’s something that we want to apply to what we’re doing.”",
    "An updated controller is certainly more likely than any big bespoke accessories, such as an answer to Sony’s PSVR 2, as VR and AR peripherals are “not really” something Xbox is looking at. Spencer told Kinda Funny Gamescast that the team is “probably not in the more bespoke accessories place right now. We just look at what happens on Windows and other places and see if there’s a unique opportunity for us. Right now, I don’t think there’s anything that’s obvious to me.”",
    "“We’re watching what happens on PC,” he said. “As it relates to VR specifically, the best experience that I’ve seen is Quest 2 and I just think its untethered [and] ease of use in its capability just doesn’t, to me, require it being connected to an Xbox in any way.",
    "“So when I look at a scenario like that, I think about XCloud, I think about the Xbox Live community, I think about other things, of how could we bring content to a screen like that. Whether we do something like that through first-party or third-party partnerships I think is kind of a second step to ‘do we think the games that we currently have that we’re able to run on our platform would work there?’”",
    "This stance on VR lines up with what Spencer has previously said about VR support on Xbox. Back in 2020, prior to the Xbox Series X launch, Spencer said that Microsoft is waiting until VR on Xbox becomes a “no brainer” before it considers stepping into that field. This followed on from a previous interview in which he said that the new console wasn’t created with VR in mind, adding “We’re responding to what our customers are asking for and… nobody’s asking for VR.”",
    "Spencer didn’t give a timeline on when we might expect to see any kind of updated Xbox controller but, hey, at least we know it’s a possibility. As for any hints that might have been lurking behind Spencer in his shelves during the interview, he was pretty clear that this time he's \"not trying to signal anything\"."
  ],
  "headers": {
    "7": "No VR plans"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Kinda Funny Gamescast": "https://www.youtube.com/watch?v=5VPMMMTOUWw",
    "VGC": "https://www.videogameschronicle.com/news/phil-spencer-compliments-dualsense-and-suggests-xbox-could-update-its-controller/",
    "Xbox Wireless controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "a survey asked": "https://www.techradar.com/news/xbox-series-x-survey-asks-if-you-want-ps5-dualsense-features-on-its-controller",
    "The Verge": "https://www.theverge.com/21611412/microsoft-phil-spencer-interview-xbox-series-x-launch-decoder-podcast",
    "Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "XCloud": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "said": "https://www.techradar.com/news/xbox-series-x-vr-would-be-pointless-right-now-claims-phil-spencer",
    "previous interview": "https://www.techradar.com/news/xbox-project-scarlett-could-sidestep-vr",
    "in his shelves": "https://www.windowscentral.com/whats-phil-spencer-hiding-future-xbox-based-phils-latest-shelf-teases"
  }
}