{
  "source": "https://www.techradar.com/news/a-labor-of-queer-love-the-battle-to-preserve-the-history-of-lgbtq-games",
  "title": "A labor of queer love: the battle to preserve the history of LGBTQ+ games",
  "category": "gaming",
  "updated": "2021-01-23T01:25:19Z",
  "author": "rachael-davies",
  "summary": "A look at the challenging but vital effort to preserve LGBTQ+ gaming history",
  "article": [
    "Today, queer gaming characters stride confidently onto our screens. Playable characters, like Alexios and Kassandra of Assassin’s Creed Odyssey and Ellie of The Last of Us, are queer, but not every aspect of their characters hinges on their sexuality. But how long has this been the case? Who walked so that Ellie could run?",
    "Exploring the origins and evolution of queer games and characters, and preserving them for posterity, is a task that no one seemed willing to do. That is, until Adrienne Shaw of Temple University in Philadelphia, USA, took on the job.",
    "“After 10 years [of researching LGBTQ+ games], no one had done what I assumed would be an obvious project to do, so I figured that was a sign that I should do it,” Shaw laughs.",
    "As part of her graduate studies, Shaw began a project looking into why there was little queer representation in video games. She went out looking for game designers working on queer content, and created a list of 51 games for her own use. Little did she know that this list would turn into a decade of work. In 2015, Shaw turned her attention to building a more comprehensive list, resulting in a still-growing collection of 151 queer games. This was the start of the LGBTQ+ Video Game Archive.With recommendations and tips from volunteers and game fans, Shaw still works on the list in her spare time outside of other research projects, building an online database that details exactly what kind of queer content is in each game. Although each entry on the database takes time, for Shaw, it’s a labor of love.",
    "“It’s actually good that it’s taking a long time to put it all together,” she says. “If I was ever done, I would actually be sad, because that would mean that there were no more new games to find, and nobody was making new games with queer content.”",
    "Shaw’s list of 151 games has expanded to over 1,200 now, reaching back to 1976, with Bunnies and Burrows, an RPG game based on the novel Watership Down, in which users play as intelligent rabbits interacting with one another and escaping foxes and other threats. The Archive focuses on digital games, and is managed by Shaw herself and one assistant. But how do they actually go about documenting every queer game ever?",
    "Many game entries begin with a tip-off from a fan. Someone may have played a queer game in their youth, or seen an obscure one released today. They send in a note via the Archive’s website, and its preservation begins.",
    "Any queer representation will do, no matter how minor – and that includes negative representations too; for Shaw, it’s equally important that these are documented. Every game in the Archive can represent anywhere between five and 80 hours of work from Shaw or her assistant.",
    "“I don’t have the resources or the time to go through and play every single game that ever existed to see if we can find the queer characters,” Shaw explains, “but we can have good documentation of what has been said about this content because of fan sites, walkthroughs, Wikis, and YouTube videos.”",
    "This community-driven aspect of the Archive is vital for its survival. Shaw started it as a passion project, and continues to do other work alongside it to pay the bills. Anyone who gets involved with the Archive does so to preserve games that are in danger of vanishing completely – and it’s a good thing that they’re doing it, because time is running out.",
    "Documenting digital games presents its own unique challenges: you only have so long before the technology needed to play a game is obsolete, or before the very memory of a game dies out.",
    "Shaw stumbled across one game, Caper in the Castro, almost by accident, while researching another game. The mystery adventure game was designed by game designer C.M. Ralph in 1989, and was originally released as so-called ‘Charity Ware’, with players asked to donate to an AIDS organization after downloading the game; Ralph was motivated to raise money for the cause after 90% of their close friend group in California died from AIDS.",
    "Caper in the Castro sees a lesbian detective, Tracker McDyke, trying to find a missing drag queen, and turned out to be one of the hardest games to preserve in the Archive. After hunting down the disc, it had to be reverse-engineered with an old Macintosh so that its 1980s Mac software was playable. Uncovering Caper in the Castro not only provided a snapshot of one of the earliest playable queer characters; it provided useful lessons in the intricacies of picking apart outdated gaming tech.",
    "While it was a great discovery, the fact that Caper in the Castro was uncovered by chance is a worrying sign for LGBTQ+ gaming preservation. How many more games are being missed? How many more games might be lost forever if the right person doesn’t happen to come across them?",
    "“I think one of the hardest parts is that we don’t know what’s already been lost,” muses Shaw. “We don’t know how many games we just don’t have a record of, because the people that made them aren't alive anymore, or because nobody bothered to save any copies of it.”",
    "Losing queer games from the past might not seem like a big deal, especially if they’re hard to play nowadays. But losing any instance of queer representation in gaming means we miss out on cultural representations that are vastly different from those in any other media. Queer characters in video games are not presented as the stereotypes that are so common in TV and film.",
    "“The dominance of queer people as a villain actually isn’t quantitatively dominant in games compared to other media,” Shaw explains. “In film and television that was a pretty common theme, but it seems like most LGBTQ+ characters are sort of like helpful, neutral, non-player characters.”",
    "Similarly, different snapshots of queer culture are brought to light in video games than in other media. The HIV crisis, as one example, has been depicted time and again in TV and film. Yet very few of the queer games in the Archive make mention of it; instead, queer characters most often exist as helpful non-player characters (NPCs), rather than filling the same well-trodden roles that we see in TV and film.",
    "Video games, more so than TV and film, offer their players escapism from the real world. They create whole universes that players can become immersed in, so perhaps that’s why common areas of queer history are skimmed over in digital game storytelling. While some major events, like the HIV crisis, are largely overlooked, new perspectives on queer culture are offered, showing what other topics were at play in queer communities over time. Queer characters in video games were allowed to explore a whole range of topics that weren’t available to their real-world counterparts. Although there were still negative connotations attached to some queer figures, the greater freedom that gaming storytelling offer to dive into topics outside of common queer tropes often made for more dynamic and varied stories.",
    "Whether positive or negative, the nuance and different perspectives that LGBTQ+ games bring to the discussion of queer culture is something that’s not often found elsewhere. Shaw and her team see these unique qualities, and their work is driven by the belief that everyone else should see them too. Queer literature, queer films, and queer TV are all well documented, with each genre bringing its own unique angle to LGBTQ+ history. The same meticulous curation needs to be applied to digital games – before, by their very nature, they’re gone forever.",
    "Find out more about the LGBTQ Video Game Archive here."
  ],
  "headers": {
    "2": "The birth of the LGBTQ+ Video Game Archive",
    "6": "An exercise in collaboration",
    "10": "LGBTQ+ gaming’s countdown to extinction",
    "15": "Worlds worth saving"
  },
  "links": {
    "Assassin’s Creed Odyssey": "https://www.techradar.com/news/assassins-creed-odyssey-review",
    "The Last of Us": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "LGBTQ+ Video Game Archive": "https://lgbtqgamearchive.com/",
    "here": "https://lgbtqgamearchive.com/about/about-archive/"
  }
}