{
  "source": "https://www.techradar.com/news/the-amd-rx-6600-xt-hasnt-gone-down-well-but-that-could-be-a-good-thing",
  "title": "The AMD RX 6600 XT hasn't gone down well, but that could be a good thing",
  "category": "components",
  "updated": "2021-08-12T11:23:40Z",
  "author": "jess-weatherbed",
  "summary": "Opinion: The sacrificial lamb of PC gaming",
  "article": [
    "Despite the current generation of graphics cards being around for almost a year now, we've not seen any great improvement in regards to availability. It's been a long and depressing year for many PC gamers trying to get their hands on a new GPU for their rig, but a spark of hope may have emerged in an unlikely product launch.",
    "Depending on region, customer reports are coming in across social media that indicate stock of the AMD RX 6600 XT remained available for longer than other hardware launches we've seen this generation, and at a better price. While reasons for this are mostly speculative, it does indicate that we could see the tides changing for the better over the coming months.",
    "On a Reddit thread, user b3rdm4n said: \"They launched here in Australia and you can actually buy them from effectively msrp, making them an amazing deal compared to literally everything else AMD or Nvidia that has this level of performance or higher being charged waaaay over msrp.\"",
    "AMD released the RX 6600 XT for sale on August 11 and received a mixed reaction. The general sentiment is that while Team Red's latest offering is a perfectly capable GPU, the suggested retail price of $379 (about £270, AU$520) is much too high for an entry-level GPU. As with the RTX 3060, the RX 6600 XT is offered through third-party manufacturers only, which means that 'suggested' pricing can be ignored given that you can't get an AMD-made model.",
    "The RX 6600 XT targets 1080p performance with low power consumption, but doesn't quite stand up against Nvidia's RTX 3060. That said, unappealing pricing hasn't prevented people from rushing to buy up the available stock of previous graphics card launches, often crashing websites or causing people to queue around the block for physical stock.",
    "Overclock3d reports that launch day saw improvement in the UK however, especially when compared to other graphic card launches, writing: \"Even 30 minutes after AMD's launch, we could purchase RX 6600 XT graphics cards at MSRP through Scan, and we found that no RX 6600 XT models reached the dreaded £500 mark at any major UK retailer, though CCL got awfully close. With previous graphics card launches, GPUs with MSRP prices practically disappeared as soon as they become available. Demand was high, and supply was low, creating a situation where pricing soared, and products were being resold on eBay for absurd prices.\"",
    "While we don't think retail scalping is coming to an end any time soon, this is at least a spot of good news in the vast ocean of misery we've been sailing in, and the results of this launch might not just affect customers hunting for an RX 6600 XT.",
    "You'll have your reasons for wanting a different GPU, but increased stock for AMD's latest offering doesn't mean that's your only option. It's been noted that the RX 6600 XT is a very attractive card for cryptominers, which might sound bad but this could create an opportunity for other GPUs to flourish while this latest offering keeps miners satiated.",
    "After all, we're hardly lacking for graphics card options should stock availability improve. AMD has pushed back on requests to built anti-mining technology into its products as it feels you can do whatever you want with the hardware. Nish Neelalojanan, a product manager at AMD was asked if AMD would follow Nvidia's anti-mining stance, replying \"The short answer is no. We will not be blocking any workload, not just mining for that matter.\"",
    "With Nvidia having implemented its hash rate limiter across almost the entire RTX 30 series, cheaper AMD cards may prove to be a suitable distraction for gamers to get some much-needed upgrades from Team Green.",
    "That is of course, if the ongoing crackdown of large cryptomining operations in countries like China doesn't greatly reduce most of the competition on that front. For anyone who's been trying to get their hands on an RTX 3060 or RTX 3070 in recent months, you might find that there is less competition on the market.",
    "We're keeping our fingers crossed that the RX 6600 XT can either see improved availability for customers in the US market (as PCMag noted, the card was hard to find in US-based retailers and websites), or that its affordability and appeal in mining will leave some GPUs for the rest of us who don't plan on sticking them into a mining rig."
  ],
  "headers": {
    "7": "But I don't want to buy an RX 6600 XT..."
  },
  "links": {
    "Reddit thread": "https://www.reddit.com/r/Amd/comments/p2stpo/25_6600xt_in_stock_microcenter_cambridge_for_39999/",
    "b3rdm4n": "https://www.reddit.com/user/b3rdm4n/",
    "RX 6600 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6600-xt",
    "queue around the block for physical stock": "https://www.techradar.com/news/life-in-the-queue-meet-the-gamers-camping-out-for-an-rtx-3080-ti-across-the-us",
    "Overclock3d": "https://www.overclock3d.net/news/gpu_displays/the_end_of_retail_scalping_rx_6600_xt_launch_prices_were_much_better_than_expected/1",
    "RX 6600 XT is a very attractive card for cryptominers": "https://www.techradar.com/news/bad-news-for-gamers-the-new-rx-6600-xt-may-be-obscenely-good-at-cryptomining",
    "crackdown of large cryptomining operations": "https://www.techradar.com/news/china-crypto-mining-crackdown-could-give-you-a-better-chance-of-getting-a-new-rtx-3080",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "PCMag": "https://uk.pcmag.com/graphics-cards/135019/amds-radeon-rx-6600-xt-was-hard-to-find-on-launch-day-except-at-micro-center"
  }
}