{
  "source": "https://www.techradar.com/news/spike-in-employee-surveillance-is-driving-workers-away",
  "title": "Spike in employee surveillance is driving workers away",
  "category": "computing",
  "updated": "2021-11-11T11:43:01Z",
  "author": "sead-fadilpasic",
  "summary": "Webcam monitoring? No, thank you",
  "article": [
    "A new report from VMware has found the majority of businesses are looking to install some form of employee surveillance to monitor home workers - who in turn, are walking out the door in protest.",
    "Based on a survey of 7,600 respondents all over the world, working in HR, IT, and managerial roles, the study found 70% of companies have either already implemented, or are planning to implement - surveillance measures.",
    "These include the monitoring of email accounts, web browsing, as well as collaboration tools. On top of that, some are considering attention tracking through webcams and keyloggers, as well as video surveillance - something almost a third (29%) are considering.",
    "The flipside is clear - 39% of those who already implemented device monitoring, and 41% of those who are in the process - are seeing “drastically increasing” employee turnover due to potential privacy issues.",
    "Most employees are well aware of the fact that the Covid-19 pandemic and remote working changed how leaders value their work. Time spent in office is no longer a valid metric for most, and they are turning towards performance-measuring. Most employees agree their productivity is now being more valued, adding that remote work technologies enabled them to be more efficient than before.",
    "Most organizations, on the other hand, were forced to come up with new ways to track employee productivity, such as regular catch-ups with managers to discuss workloads, assessing output and agreed deliverables, as well as using new project management software.",
    "To make sure employee privacy remains protected, while business leaders get a chance to assess everyone’s output, transparency remains “critical”, the report concludes.",
    "“Globally we are seeing organizations shift permanently to hybrid work models that don’t require knowledge workers to be office-based all the time. With this shift, employers should proceed with caution when replacing presentism with monitoring tools. Monitoring and performance are two very different things,” says Shankar Iyer, senior vice president and general manager, End-User Computing, VMware.",
    "“Digital workspace tools enable people to work from anywhere and our research shows employees are feeling more valued and trusted. A lack of transparency and measurement by ‘stealth and numbers,’ can quickly erode employee faith and lead to talent heading for the door, in a highly competitive and challenging skills market.”",
    "Here's everything you need for remote working"
  ],
  "headers": {
    "4": "Replacing presentism with monitoring tools."
  },
  "links": {
    "surveillance": "https://www.techradar.com/vpn/best-vpn-for-business",
    "email": "https://www.techradar.com/news/best-email-provider",
    "webcams": "https://www.techradar.com/best/best-business-webcams",
    "privacy": "https://www.techradar.com/vpn/best-vpn",
    "monitoring tools": "https://www.techradar.com/best/proxies",
    "everything you need for remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}