{
  "source": "https://www.techradar.com/news/new-mass-effect-could-and-should-ditch-frostbite-for-a-better-engine",
  "title": "New Mass Effect could (and should) ditch Frostbite for a better engine",
  "category": "gaming",
  "updated": "2021-09-07T09:05:51Z",
  "author": "rhys-wood",
  "summary": "Opinion: it's a decision that seems Unreal",
  "article": [
    "Even though we've only had a brief teaser so far, the fact that a new Mass Effect is on the way has me cautiously excited. I'm a huge fan of the original trilogy (yes, even the Mass Effect 3, for all its faults) and I'm personally glad to see EA and BioWare aren't throwing in the towel after 2017's divisive Mass Effect Andromeda.",
    "And a recent job listing (via VentureBeat) may have given me even more reason to be excited about BioWare's next galactic adventure. The listing is for a role as a technical director on the new Mass Effect, which usually wouldn't be all that noteworthy given that BioWare has confirmed that a new Mass Effect is in the works for PS5 and Xbox Series X/S - so new hirings are bound to take place",
    "However, one of the role requirements is particularly eye-catching: \"Experience with Unreal Engine 4+ is an asset\". This is potentially huge news in and of itself, as it could signify a shift away from EA's in-house Frostbite engine, and believe me when I say that can only be a good thing.",
    "It's absolutely worth noting that Frostbite is by no means a bad engine. When it comes to first-person shooters, it's one of the best engines around, and is clearly greatly suited to the large-scale warfare of the Battlefield series for which Frostbite was initially developed.",
    "This is because Frostbite was developed for the Battlefield series first and foremost. In this sense, it's a very bespoke engine, extremely good at tackling the epic scale of Battlefield's maps. The trade-off is that Frostbite is ill-suited to other genres, such as sports games, third-person action titles and RPGs. All of which developers within EA's family have attempted to develop with the Frostbite engine.",
    "In fact, Frostbite was largely only used for first-person shooters for its first few years of existence, bar the occasional Need for Speed game as well as Dragon Age: Inquisition in 2014. However, some teething problems were inevitable when EA decided to make Frostbite its 'one-size-fits-all' engine.",
    "Frostbite has since been used for a litany of projects spanning lots of different genres, including sports games with FIFA and Madden, as well as two hugely disappointing games BioWare is still reeling after releasing: Anthem and Mass Effect Andromeda.",
    "Frostbite, while the perfect fit for the likes of Battlefield, wasn't quite so well suited to Mass Effect Andromeda. In fact, Frostbite's negative effect on Andromeda has been well-documented. Using Frostbite meant that BioWare was working with limitations like stiff, outdated facial animations (we all got a chuckle out of the classic \"my face is tired\" meme) and a lack of convincing world-building.",
    "Compare the busy, claustrophobic streets of Omega in Mass Effect 2 to any of the sparsely populated worlds of Andromeda, and you'll immediately see one of many issues that plagued the game.",
    "The difference? The original Mass Effect trilogy was developed with Unreal Engine 3. A far more versatile engine, Unreal tech allowed BioWare to create detailed environments - often crammed with NPCs - to create worlds that felt truly lived in.",
    "In many ways, Unreal was the perfect engine for BioWare to use. It's the most commonly used engine to develop games alongside Unity, and has been used to develop games in all kinds of genres from RPGs to fighting games and beyond. If you play a wide variety of games, chances are you've seen that Unreal Engine splash screen pop up before you've started playing.",
    "Frostbite, by comparison, hadn't been used to develop something like an RPG/shooter hybrid until Mass Effect Andromeda. According to Kotaku's deep-dive on Andromeda, Frostbite wasn't able to perform basic functions you'd expect from an RPG, and thus had to be programmed in manually.",
    "“Frostbite is a sports car,\" one developer said. \"Not even a sports car, a Formula 1. When it does something well, it does it extremely well. When it doesn’t do something, it really doesn’t do something.”",
    "You have to think that by the time the next Mass Effect releases (probably still a good few years away), Unreal Engine 5 will be the new standard. Even VentureBeat's Jeff Grubb warns that \"Frostbite could end up extremely out of date by the time work starts in earnest on Mass Effect 5.\"",
    "It's hard to disagree with that. We've already seen what Unreal Engine 5 will be capable of thanks to some impressive tech demos that already outmatch what we've seen in the most recent iteration of Frostbite.",
    "It only makes sense for BioWare to get ahead of the curve and start developing on Unreal Engine 5, rather than wait for a new generation of Frostbite that might not even be best suited for the kind of game the next Mass Effect will be - very likely the third-person action-RPG BioWare is known and loved for.",
    "While a shift to the Unreal Engine is a rumor we'd love to take stock in, it should of course be noted that a fancy new engine won't solve all of Mass Effect's problems. Both Andromeda and Anthem's issued stemmed far beyond the choice of engine.",
    "Andromeda's writing and characters simply weren't up to par with the stunning example set by the original trilogy. I couldn't point to a single character in Andromeda that was as fun or iconic as the likes of Garrus, Tali, Mordin or Shepard themselves.",
    "Even worse still, Kotaku's look into Andromeda's development, linked above, alleged incessant crunch, that being the often painful process of employees working long hours to meet strict deadlines.",
    "So a move to Unreal would most likely be an improvement over Frostbite. Using the latest build, which will be Unreal Engine 5, will allow the next Mass Effect the best chance possible at both looking and playing superbly. Plus, the backlash faced by Andromeda could (hopefully) encourage EA to give BioWare the time it needs to make a truly excellent role-playing game.",
    "I'm definitely rooting for BioWare here. I'm cautiously optimistic that the developer can turn over a new leaf with both the next Mass Effect as well as Dragon Age 4, both of which seem to be adopting a 'when it's ready' approach, at least for the time being."
  ],
  "headers": {
    "3": "What's the deal with Frostbite?",
    "13": "Will Unreal be that much better?",
    "16": "Not out of the woods yet"
  },
  "links": {
    "new Mass Effect": "https://www.techradar.com/news/bioware-confirms-theres-a-new-mass-effect-game-in-development",
    "Mass Effect Andromeda": "https://www.techradar.com/news/mass-effect-andromeda-review",
    "VentureBeat": "https://venturebeat.com/2021/09/03/mass-effect-5-unreal/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "well-documented": "https://www.usgamer.net/articles/the-frostbite-engine-nearly-tanked-mass-effect-andromeda",
    "my face is tired": "https://www.youtube.com/watch?v=5b6qH48bslA",
    "Kotaku's deep-dive": "https://kotaku.com/the-story-behind-mass-effect-andromedas-troubled-five-1795886428"
  }
}