{
  "source": "https://www.techradar.com/news/whatsapp-is-rolling-out-disappearing-photos-and-videos-to-android",
  "title": "You can finally vanish your WhatsApp photos and videos on Android",
  "category": "computing",
  "updated": "2021-06-30T14:05:22Z",
  "author": "daryl-baxter",
  "summary": "Your media will disappear in..",
  "article": [
    "If you’ve been wanting to send over an important photo or video that can self-destruct after a certain amount of time, soon it will be possible with WhatsApp now rolling out the feature to Android devices.",
    "According to WABetaInfo, the feature has been in the works for a while, with Mark Zuckerberg and WhatsApp CEO Will Cathcart stating that it was coming to the app in due time, along with multiple device and iPad support.",
    "In the last year, the usage of messaging apps has grown exponentially, with huge demand for privacy and even better features to help manage the many chats we’ve all become accustomed to.",
    "With other apps such as Telegram already having these features for their users, pressure was on WhatsApp for these to also arrive for their users as well. With efforts to minimise their terribly mismanaged new privacy guidelines still, they’re doing all they can to retain and attract new users to their service.",
    "Imagine if you need to send across an important photo that has some sensitive information. It could involve a sale and you may need to transfer money across to a bank. Instead of the photo being constantly backed up and stored in WhatsApp, the image can disappear once the recipient has looked at it, and then it will not be able to be viewed again.",
    "For security reasons this is incredibly useful, and it’s a feature that users have been wanting for a long while on WhatsApp, especially as apps like Telegram have had this for over a year already.",
    "With other features such as iPad support and multiple device support coming soon, there’s plenty to look forward to if you’re a heavy user of the app. While the feature is only available for Android devices, it’s only a matter of time before it arrives for iPhone as well."
  ],
  "headers": {
    "4": "Why is this feature useful?"
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/whatsapp-is-rolling-out-photos-and-videos-set-to-view-once/#more-9432",
    "terribly mismanaged": "https://www.techradar.com/news/whatsapp-flip-flops-on-privacy-policy-threats-again"
  }
}