{
  "source": "https://www.techradar.com/news/major-windows-10-update-will-make-your-webcam-better",
  "title": "Major Windows 10 update will make your webcam better",
  "category": "computing",
  "updated": "2021-04-08T10:51:50Z",
  "author": "matt-hanson",
  "summary": "Windows 10 21H2 will also bring new display settings",
  "article": [
    "The Windows 10 21H2 ‘Sun Valley’ update is shaping up to be quite a big overhaul for the operating system, and an early build has revealed that it will introduce some handy new settings for your webcam – and your monitor.",
    "With more people working from home – or working remotely – many people have been investing in the best webcams their budgets can stretch to – so the fact that Windows 10 21H2 looks set to make it easier to set up and configure your webcam is certainly welcome.",
    "According to Windows Latest, which has been trying out an early build of the update, new webcam settings will be found in Settings > Devices > Camera. From there, you can configure any webcam connected to your PC (or built in to your laptop), such as adjusting the brightness and contrast for better image quality.",
    "New privacy settings are also due to come to Windows 10 in a future update, and will let you know when your webcam is being used by apps such as Google Chrome. An icon on your taskbar will also display, alerting you.",
    "Windows 10 21H2 is also adding a new setting for you to turn off “Content adaptive brightness control.” This feature dims the screen of your device depending on what apps you’re using and the media you’re watching, and it can sometimes be distracting or negatively impact image quality.",
    "When Windows 10 21H2 launches in the latter half of 2021, you will be able to turn this feature off by going to Settings > System > Display.",
    "Adding more control over your device is always good, and we expect more new settings and features to be added to the Windows 10 21H2 update in the run-up to its official launch."
  ],
  "headers": {
    "4": "Display settings"
  },
  "links": {
    "Windows 10 21H2 ‘Sun Valley’ update": "https://www.techradar.com/news/windows-10-21h2-update",
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "According to Windows Latest": "https://www.windowslatest.com/2021/04/08/windows-10-sun-valley-update-comes-with-new-display-and-camera-settings/",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}