{
  "source": "https://www.techradar.com/news/godaddy-customers-can-now-sell-their-products-on-amazon-and-ebay",
  "title": "GoDaddy customers can now sell their products on Amazon and eBay",
  "category": "computing",
  "updated": "2021-06-08T02:36:15Z",
  "author": "anthony-spadafora",
  "summary": "New integrations are available to Canadian Websites + Marketing customers",
  "article": [
    "The web hosting giant GoDaddy has announced that its Canadian customers can now sell their products on Amazon and eBay directly through its Websites + Marketing solution.",
    "For those unfamiliar, Websites + Marketing pairs an easy-to-use website builder with a suite of marketing tools to help small businesses grow and reach new customers.",
    "Now with GoDaddy's latest Marketplaces feature, entrepreneurs in Canada can sell their products on Amazon and eBay through a single dashboard view. By using their existing Websites + Marketing product catalog, customers can list products with Amazon and eBay in just a few clicks and everything is kept updated for them.",
    "All orders come into one place so that ecommerce site owners won't need to login to each marketplace to see what they've sold, what needs to be shipped and needs to be restocked. At the same time, inventory is automatically adjusted and synced as orders are received so that customers don't need to worry about accidentally overselling out of stock items.",
    "In addition to GoDaddy's new Amazon and eBay integrations, Websites + Marketing now allows customers to leverage the power of social media to help grow their business' online presence.",
    "Entrepreneurs can now schedule, publish and monitor their company's Instagram account directly from the Websites + marketing dashboard.",
    "VP and country manager for GoDaddy Canada, Anne De Aragon provided further insight on the company's latest updates to its Websites + Marketing solution in a press release, saying:",
    "\"While selling online has been a key driver of sales, especially amid the COVID-19 pandemic, it's never been more important to ensure businesses are set up for digital success. With the integrations with Amazon, eBay and Instagram, we're excited to offer these powerful new features as part of our growing suite of ecommerce and digital marketing tools to ensure Canadian businesses can create a professional and unique online shopping experience to thrive in the digital economy.\"",
    "Although these new features are currently only available in Canada, they could possibly come to the US at a later date to help American entrepreneurs grow their small businesses as well."
  ],
  "headers": {
    "4": "Leveraging social media"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "Websites + Marketing": "https://www.techradar.com/news/godaddys-new-solution-bundles-a-website-builder-with-marketing-tools",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "marketing tools": "https://www.techradar.com/best/best-online-marketing-services",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "Instagram": "https://www.techradar.com/news/instagram-launches-professional-dashboard-to-help-run-business-accounts",
    "press release": "https://www.newswire.ca/news-releases/godaddy-launches-new-features-for-ecommerce-including-integration-with-amazon-and-ebay-and-for-publishing-on-instagram-making-it-easier-than-ever-to-grow-online-807738221.html"
  }
}