{
  "source": "https://www.techradar.com/news/outriders-patch-scheduled-for-next-week-launch-window-players-getting-free-loot",
  "title": "Outriders patch scheduled for next week - launch window players getting free loot",
  "category": "gaming",
  "updated": "2021-04-08T19:23:49Z",
  "author": "vic-hood",
  "summary": "The first big Outriders patch is on the way",
  "article": [
    "Square Enix has announced that its first big Outriders patch will roll out next week, which aims to fix some of the sci-fi shooter's bugs, crashes and performance issues.",
    "In a post on Steam, Square Enix explained that it hasn't got a firm release date for the patch yet but that it is currently scheduled for \"next week\" as the developer is using this week to \"identify as many severe issues as possible, fix them and then thoroughly test the changes across all platforms.\"",
    "\"We are doing our utmost to deliver you a stable patch as soon as possible and we are continually looking at ways to bring the patch release day earlier,\" the post reads. \"This is why we are not yet committing to a patch release date, as we may still be able to release the patch before such a date.\"",
    "Square Enix went on to say that it will share a release date for the patch as soon as it can, encouraging players to keep an eye on the Outriders Twitter account for more updates.",
    "In addition, Square Enix announced that it will give a free \"appreciation package\" to those who played (or tried to play) Outriders during its launch weekend. While the details are apparently still being worked out, the package will be available to all players who played Outriders between March 31 and April 11 (UTC timezones), as well as those who played outside that window but have fallen afoul of a bug leading to an automatic inventory wipe restoration.",
    "The appreciation package gives players' highest level character a \"level-appropriate Legendary Weapon\" and a \"level-appropriate amount of Titanium\", as well as the emote \"Frustration.\"",
    "\"These are our intentions, but these details are subject to change based on what is technically feasible for us to do,\" Square Enix wrote in the post. \"We are still determining when the appreciation package will be delivered.\"",
    "The first big Outriders patch aims to fix a host of performance issues and bugs, as well as stabilizing Outriders crossplay to make PC-to-console crossplay viable again.",
    "In addition, Square Enix has said it believes the patch will reduce the chance of the inventory wipe bug happening as often, while backend updates were rolled out earlier today to help with re-balancing.",
    "Here's the list of fixes from the patch notes:",
    "In addition to details on the upcoming patch, Square Enix also gave an explanation as to why Outriders has such a rocky launch weekend.",
    "\"tl;dr: Our team worked throughout the Easter weekend and around the clock to resolve the server issues players were experiencing,\" the post reads. \"We completely understand how frustrating this experience will have been especially given the huge amount of players eagerly anticipating the launch. We had enough server scaling capacity but our externally hosted database was seeing issues that only appeared at extreme loads. \"We’re committed to full transparency with you. Today, just as we have been over the past year. So we won’t give you the expected “server demand was too much for us. \"We were in fact debugging a complex issue with why some metric calls were bringing down our externally hosted database. We did not face this issue during the demo launch earlier this year. Our database is used to hold onto everyone’s gear, legendaries, profile and progression.\"",
    "For more information, read the more detailed explanation on Steam."
  ],
  "headers": {
    "7": "Outriders patch: what does it fix?",
    "10": "Explaining Outriders issues"
  },
  "links": {
    "post": "https://store.steampowered.com/news/app/680420/view/3086629758330646650",
    "Outriders Twitter account": "https://twitter.com/Outriders",
    "Outriders crossplay": "https://www.techradar.com/how-to/how-to-enable-outriders-crossplay",
    "inventory wipe bug": "https://www.techradar.com/news/outriders-inventory-wipe-bug-remains-unfixed-and-a-seriously-scary-prospect",
    "Steam": "https://store.steampowered.com/news/app/680420/view/3086629758330646650"
  }
}