{
  "source": "https://www.techradar.com/news/luca-on-disney-plus-is-the-nostalgic-pixar-fantasy-movie-to-get-you-ready-for-summer",
  "title": "Luca on Disney Plus is the nostalgic Pixar fantasy movie to get you ready for summer",
  "category": "entertainment",
  "updated": "2021-07-06T15:22:26Z",
  "author": "tom-power",
  "summary": "Luca on Disney Plus is the summer-infused Pixar film we need right now",
  "article": [
    "Pixar movies have become a fan favorite staple of the yearly movie release schedule. Ever since Toy Story wowed audiences in November 1995 (thanks to its at-the-time revolutionary CG animation), the studio has released at least one feature film annually in all but six of the past 26 years.",
    "Such a turnaround could have led to a decline in quality – but not with Pixar. The Disney subsidiary has consistently churned out critically acclaimed movies, including Oscar-winning flicks like Finding Nemo and Inside Out, that have enthralled cinemagoers for nearly three decades.",
    "Luca, though, has more to deal with than simply living up to fan expectations. Pixar’s latest animated feature is the first to be produced remotely (due to the Covid-19 pandemic) and, as a result, some film aficionados might be concerned that Luca won’t hit the heights of its predecessors.",
    "Thankfully, any potential fears are unfounded. Luca is a delightful, friendship-oriented adventure that’s full of the signature charm, humor, emotional gut punches and innovative animation style that viewers have come to expect from a Pixar flick.",
    "Set on the Italian Riviera in the 1950s, Luca tells the story of Luca Paguro (Jacob Tremblay), a shy and lonely teenager who dreams of living an adventurous life.",
    "That is, until he meets the confident and free-spirited Alberto (Jack Dylan Grazer). The duo soon become inseparable and embark on an impulsive trip to the fictional seaside town of Portorosso in search of the ultimate summer experience.",
    "Luca and Alberto, though, hide a dark secret – they’re sea monsters (albeit ones who can transform into humans on land), who have been hunted by Portorosso’s residents for generations.",
    "Forced to maintain their secret identities from townsfolk including Giulia Marcovaldo (Emma Berman), her fisherman father Massimo (Marco Barricelli) and local bully Ercole Visconti (Saverio Raimonde), it isn’t long before Luca and Alberto find themselves out of their depth literally and metaphorically.",
    "From the outset, what’s immediately apparent about Luca’s plot is it’s more lighthearted than other recent Pixar productions. That isn't to say that the studio's latest movie is still packed with plenty of moments that will tug at the heartstrings; it's just that they're not as heavy or pronounced here.",
    "Luca, then, isn’t as mature or dark as Soul or Coco, which explored life, death and existence – but it doesn’t need to be. With its summer setting, escapist tendency, and focus on Luca and Alberto’s budding friendship, Luca acts as a nostalgic window to view our own childhood through. It captures the curiosity we had to try new things (and to go through with them despite being fearful) and the freedom of having no responsibilities.",
    "In that sense, Luca’s story will really resonate with adult viewers, but there’s also plenty to keep the kids entertained, too. Luca is packed with funny moments – Luca’s deep sea dwelling uncle and Giulia’s cat Macchiavelli bring the laughs whenever they’re on screen – and, while the film’s set pieces are par for the course, they’re enjoyable enough that they’ll retain any young viewer’s focus.",
    "Stylistically, Luca has all the hallmarks of a Pixar movie (it’s bright, colorful and beautifully animated), but what sets it apart from its predecessors is what inspired its aesthetic.",
    "Luca’s painterly, manga-influenced characters and backgrounds are reminiscent of Hayao Miyazaki’s back catalog, and you can see (and feel) how the legendary Japanese animator and director inspired the look of Pixar’s latest flick.",
    "Subtle nods to Aardman Animation Studios (Wallace & Gromit, Chicken Run) and Wes Anderson (Isle of Dogs, Moonrise Kingdom) are also noticeable and, blended together with Miyazaki’s influence and the golden era of Italian cinema from the 1950s – complete with an authentic, Italian-style score from Dan Romer – Luca’s appearance feels unique yet recognizable. It’s an art style that Pixar hasn’t experimented with before, but it works and helps Luca to visually stand out among its Pixar peers.",
    "Speaking of ‘standing out’, Luca’s young cast does just that. The chemistry between Tremblay’s Luca and Grazer’s Alberto feels natural and authentic, while Emma Berman sparkles in her first major movie role as outgoing bookworm Giulia.",
    "What’s most impressive about Luca’s teenage cast, though, is that all three (as well as the movie’s adult actors) recorded their entire performances at home as a by-product of the pandemic.",
    "With no fellow voice actor to bounce off during the recording process, the biggest compliment you can pay to Luca’s young acting trio is that this doesn’t show in scenes they share together. Luca, Alberto and Giulia riff off one another so well that it’s indiscernible, and you truly get the sense that all three actors were actually recording lines alongside each other at a studio.",
    "It’s pleasing, too, that Pixar opted to cast Tremblay, Grazer and Berman as Luca’s leads. It’s been four years since a young actor led a Pixar film (Anthony Gonzalez in Coco) and it would have been easy for the studio to plump for more experienced actors to carry these roles, as it did in last year's Onward. As it is, Tremblay and the other actors help accentuate the kid-like charm and plot that Luca goes for.",
    "Luca is a charming love letter to Italy and the friendships that forge us. Through its wonderful coming-of-age fantasy story, Luca explores the power of childhood friendships, accepting who you are and, ultimately, what shapes us into the people that we are today.",
    "Designing and developing a movie during a global pandemic is (by all accounts) extremely difficult, so Pixar deserves huge credit for crafting another highly resonant, humorous and marvelously animated feature film. Better still that you can just stream it on Disney Plus without paying anything extra.",
    "It may not be as thematically dense as Soul, nor will it overthrow the likes of Toy Story, Monsters Inc or The Incredibles in many fans’ top three Pixar lists.",
    "Luca, though, is the summer-infused fantasy movie about escapism and friendship that we need right now – and that's just enough.",
    "Luca launches exclusively on Disney Plus on Friday, June 18."
  ],
  "headers": {
    "4": "Sun, sand and sea monsters",
    "11": "Ghibli vibes and casting calls",
    "18": "What we think"
  },
  "links": {}
}