{
  "source": "https://www.techradar.com/news/super-mario-party-on-nintendo-switch-is-now-actually-worth-buying-heres-why",
  "title": "Super Mario Party on Nintendo Switch is now actually worth buying – here’s why",
  "category": "gaming",
  "updated": "2021-04-27T15:35:11Z",
  "author": "adam-vjestica",
  "summary": "Finally, Nintendo did the right thing",
  "article": [
    "Seemingly against all odds, Super Mario Party on Nintendo Switch has received a bumper free update that is set to have a transformative effect on the game – and might encourage more people than before to pick it up.",
    "Super Mario Party isn’t a bad game by any means: it has over 80 minigames that take full advantage of the Joy-Con and Nintendo Switch’s unique capabilities, and they’re all as hilarious and frantic as you’d expect when you’re competing against your friends and family in a bid to come out on top.",
    "But when it came to the game's online support, well, it wasn't even worth celebrating. Previously, only 10 of the game’s 80 minigames were playable online, and the board games, which are undeniable the main course of Mario Party banquet, were also restricted to offline play only.",
    "That’s all changed now after the latest update, though, which is actually the only other patch the game has received since 2019. Owners of the Nintendo Switch game can play 70 out of the 80 available minigames and finally play board games online. That’s a substantial improvement, then, and should greatly broaden the game’s appeal to those who were put off with owning yet another Switch game that can only be enjoyed locally.",
    "It’s interesting that this update has taken so long to arrive, but with the pandemic restricting in-person parties over the last year or so, it’s a pleasing decision by Nintendo. It's also a huge boon for the game itself, as it originally came under fire for having such a limited online offering.",
    "Another nice touch that comes when playing online is that all 20 characters and maps are available, even if you haven’t made any in-game progress. That means if you just want to pick up the game to play online your friends, you won't have to sink any time into unlocking everything beforehand.",
    "Of course, if you do want to play Super Mario Party online, you’ll need to pick up a Nintendo Switch Online subscription. You can then join three other players to battle it out against, but there are a few caveats, as outlined on Nintendo’s support site. For example, if two players are each playing Super Mario Party on their own systems, you won’t be able to play with two players who are using one other Switch."
  ],
  "headers": {
    "4": "The waiting game"
  },
  "links": {
    "Super Mario Party": "https://www.techradar.com/news/super-mario-party-the-5-best-minigames-from-nintendos-ultimate-party-game",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Joy-Con": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "Nintendo Switch game": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Nintendo Switch Online subscription": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer",
    "support site": "https://en-americas-support.nintendo.com/app/answers/detail/a_id/43737/~/how-to-update-super-mario-party#v110"
  }
}