{
  "source": "https://www.techradar.com/news/hostpapa-ushers-rocketnet-into-growth-program-with-dollar11m-financing",
  "title": "HostPapa ushers Rocket.net into growth program with $1.1m financing",
  "category": "computing",
  "updated": "2021-05-15T09:01:14Z",
  "author": "abigail-opiah",
  "summary": "Where web hosting meets managed WordPress hosting",
  "article": [
    "Canadian web hosting and cloud service provider HostPapa has taken managed WordPress hosting provider Rocket.net under its wing with a newly-formed growth accelerator program.",
    "As Rocket.net joins the program, the managed WordPress firm has also secured $1.1 million in financing from HostPapa.",
    "The funds have been put in place to boost Rocket.net's strategic growth plan, as the company revealed it will be taking advantage of HostPapa's extended support services, which includes access to customer support and overall product development resources.",
    "Since launching in early 2020, Rocket.net provides an all-in-one solution built on top of Cloudflare, catering to each WordPress website and prioritizing traffic routing and caching in every Cloudflare location.",
    "“We’re thrilled to be adding Rocket.net to our accelerator program,\" said Jamie Opalchuk, HostPapa Founder & CEO.",
    "\"Rocket.net’s growth has been phenomenal and playing a small part in helping the founders scale the company to another level by providing them not only funding but the required resources they will need to continue to grow at the level they are today and beyond is exactly what this program is about. We are excited to have Rocket.net as part of our extended HostPapa family.”",
    "HostPapa’s investment will provide Rocket.net with capital as well as access to resources that is meant to allow the company to scale its business, and HostPapa’s management team will also play an important advisory role for Rocket.net.",
    "Ben Gabler, CEO of Rocket.net also added: “Working with the team at HostPapa to help us scale our company has already positively impacted our development as we continue to accelerate, protect, and deploy WordPress at the edge of the cloud.”",
    "“We are proud to bring this edge-first managed WordPress platform to the masses. We’ve already seen great market adoption from website owners and agencies that are looking for the fastest, easiest-to-use WordPress experiences.”"
  ],
  "headers": {
    "3": "Web hosting program"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "cloud service": "https://www.techradar.com/news/the-best-cloud-storage",
    "managed WordPress hosting": "https://www.techradar.com/news/best-managed-wordpress-hosting",
    "HostPapa": "https://www.techradar.com/reviews/hostpapa",
    "Cloudflare": "https://www.techradar.com/reviews/cloudflare",
    "edge of the cloud": "https://www.techradar.com/news/cloud-computing-vs-edge-computing"
  }
}