{
  "source": "https://www.techradar.com/news/halo-infinites-first-bot-focused-preview-could-happen-as-soon-as-next-weekend",
  "title": "Halo Infinite’s first ‘Bot-focused’ preview ‘could happen as soon as next weekend’",
  "category": "gaming",
  "updated": "2021-07-24T09:57:30Z",
  "author": "emma-boyle",
  "summary": "But there’s no definite date yet",
  "article": [
    "As Halo Infinite’s holiday release window draws closer, 343 Industries is gearing up to begin several rounds of technical previews, with the first expected to focus on Bots in the near future.",
    "Details of the first technical preview were laid out in July's Inside Infinite blog post, with 343 Industries saying that it’s getting “very close” to starting the flighting process and that while it’s “a fluid process”, the team has “been given the okay to say our first Bot-focused technical preview could happen as soon as next weekend.”",
    "A firm date hasn’t been set just yet but it won’t land out of nowhere, with 343 confirming that it intends to host a livestream first, “where we’ll dive into the actual build and walk through nearly every facet” of the technical preview.",
    "Ahead of that taking place, however, the blog post digs into what players have to look forward to, while managing some expectations. The first technical preview “will focus on Bots and a slice of the new Academy experience”, introducing players to the Bot Arena and Academy Weapon Drills.",
    "Halo Infinite \"is the franchise’s first foray into the world of multiplayer Bots\" and in the post, Head of Creative, Joseph Staten, says they're one of his “favorite features” that the team “always wanted to land but that consistently got cut due to limited time and resources.”",
    "The team is looking to “gather feedback on Bot behavior and online performance” by testing the Bot Arena playlist, which puts 4 players against 4 Bots on Arena maps. According to Staten, there are four kinds of bots in Halo Infinite: Recruit, Marine, ODST and Spartan, with “each level representing an increase in bot skill.” Bots are, he explains, challenging and able to become “smarter and more resourceful” but they’re also “fair”.",
    "This particular preview will feature Slayer on the Bazaar, Recharge, and Live Fire maps. While things will start off slow, the post says the plan is to have “a daily content offering that will evolve over the course of the flight based on the overall engagement of participants”, ramping up steadily through the Bot skill levels “to provide greater challenge and variety.”",
    "343 Industries is also looking to test its Academy Weapon Drills with a limited list of weapons, dropping players into a firing range arena where they’ll use bots for scored target practice “to learn how each weapon functions before entering the heat of battle”.",
    "Lastly, the team hopes to get some feedback on the game’s menus and is particularly interested “in seeing how players move through the UI to unlock their Battle Passes, check their Challenges, use the Store, and apply their earned customization elements in the Armor Hall.”",
    "In order to test out Battle Passes, invited players will receive “a set amount of in-game credits” that they can spend as they please, however, “customization items unlocked during technical previews will not carry over when the game releases later this year.” As 343 is testing the Battle Passes and customization on a purely technical level, players should expect them to be limited and not a “ a showcase of our launch content.”",
    "Continuing expectation management, 343 Industries makes it clear in the post that as the preview is a work-in-progress and “a couple months behind” the current main build, players should expect some “bumps and rough edges.”",
    "The main goal of the previews, the blog post says, is “truly technical in nature—we are looking to push our systems and services at a larger scale than we’ve been able to thus far as an important step towards ensuring we are as ready as possible when the flood gates fully open at launch this holiday. Feedback and other insights are certainly valuable, but first and foremost we are testing and stressing the technical side of Halo Infinite.”",
    "Bots are just the first stages of 343 Industries’ testing and further down the line, flights will “expand into more content including traditional PVP Arena and Big Team Battle.”",
    "If you want a chance of taking part in Halo Infinite’s flighting process, then you need to be a Halo Insider. Signing up for this is a matter of registering for the program with your gamertag and opting in for communications and flighting. Halo community manager John Junyszek has posted a Twitter thread, breaking down the steps to register in detail.",
    "While just being an Insider isn’t a guarantee of being invited to take part in technical previews or flights, 343 Industries says that it’ll be hosting “hundreds of thousands” of players in the first preview with hopes of inviting “even more” for the next round. “Our goal”, the post says, “is to eventually get every eligible Halo Insider a chance to go hands-on and help us achieve our goals on the road to launch. Remember, if you don’t get in this time, please don’t despair – more opportunities will come.”",
    "Halo Infinite is still scheduled for a holiday 2021 release and it will launch exclusively on Xbox platforms and PC."
  ],
  "headers": {
    "13": "How to take part"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Inside Infinite blog post": "https://www.halowaypoint.com/en-us/news/inside-infinite-july-2021",
    "registering for the program": "https://www.halowaypoint.com/en-us/community/halo-insider"
  }
}