{
  "source": "https://www.techradar.com/news/oneplus-nord-2-could-fix-its-predecessors-biggest-weaknesses",
  "title": "OnePlus Nord 2 could fix its predecessor's biggest weaknesses",
  "category": "phones",
  "updated": "2021-06-10T09:42:51Z",
  "author": "bodhisatwa-ray",
  "summary": "A battery boost and a camera upgrade",
  "article": [
    "Since the OnePlus Nord launched last year, the range has spawned a number of spin-offs, with the OnePlus Nord CE 5G set to be the next arrival. But a true successor is seemingly on the way too, and we now have a good idea of the OnePlus Nord 2's specs.",
    "A leak by 91Mobiles and OnLeaks (a reliable leaker) has revealed an almost full specs list for the OnePlus Nord 2, and it suggests big changes are coming to the camera and battery, which were arguably two of the biggest weaknesses of the original Nord.",
    "The camera this time around apparently includes a 50MP main sensor, which is supposedly the Sony IMX766 used for the ultra-wide lens on the OnePlus 9 Pro. That's then said to be joined by an 8MP sensor (which we'd guess is for either ultra-wide or telephoto shots) and a 2MP one (probably either a macro or depth sensor).",
    "That's actually one less lens than the original OnePlus Nord, but while the cameras on that phone were fine, it did feel a bit like the approach was quantity over quality, so this rumored change is promising - especially if the phone is inheriting a sensor from the OnePlus 9 Pro.",
    "On the front, the OnePlus Nord 2 will apparently feature a 32MP selfie camera, which is the same as its predecessor, though there's no mention of the secondary 8MP sensor that the original Nord also had.",
    "This leak also suggests that the OnePlus Nord 2 will come with a 4,500mAh battery, which would be an improvement over the 4,115mAh battery in the first-generation model. We noted in our OnePlus Nord review that the battery life was average, so we certainly hope this rumor is accurate, and that it leads to improved life.",
    "Beyond that, the OnePlus Nord 2 is supposedly set to come with a new MediaTek Dimensity 1200 chipset, which is something that was previously hinted at in leaks. It will apparently also come with a choice of 8GB of RAM and 128GB of storage or 12GB of RAM with 256GB of storage, which is in line with its predecessor.",
    "The screen meanwhile is said to be a 6.43-inch FHD+ AMOLED one with a 90Hz refresh rate and an in-display fingerprint sensor, which again is very similar to the original OnePlus Nord.",
    "So it sounds like a lot of things will be staying the same or similar, but with the chipset, battery and camera all potentially being improved.",
    "As for the price, this report suggests that the OnePlus Nord 2 could cost around CNY 2,000, which is roughly $310 / £220 / AU$400 / Rs 23,000.",
    "Presumably that's the starting price, but the leak doesn't specify. In any case, we wouldn't expect an exact conversion, or for the Nord 2 to necessarily land in all those regions. The original Nord for example started at £379, and didn't launch in the US or Australia.",
    "In any case, we should know all the official details about the OnePlus Nord 2 before long, as rumors suggest it could land as soon as July."
  ],
  "headers": {
    "5": "A bigger battery and more"
  },
  "links": {
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus Nord CE 5G": "https://www.techradar.com/reviews/oneplus-nord-ce-5g",
    "91Mobiles": "https://www.91mobiles.com/hub/oneplus-nord-2-specifications-revealed-exclusive/",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "previously hinted at in leaks": "https://www.techradar.com/news/oneplus-nord-2-may-launch-soon-without-a-snapdragon-chipset"
  }
}