{
  "source": "https://www.techradar.com/news/iphone-13-display-production-is-rumored-to-be-underway-with-120hz-support",
  "title": "iPhone 13 display production is rumored to be underway, with 120Hz support",
  "category": "phones",
  "updated": "2021-05-30T13:30:16Z",
  "author": "david-nield",
  "summary": "Expect a September reveal",
  "article": [
    "All the key pieces of the jigsaw are apparently now coming together for the production of the iPhone 13, with a report out of South Korea revealing that LG and Samsung have started manufacturing the displays destined for Apple's upcoming flagship phones.",
    "The usually reliable outlet The Elec has the news (via MacRumors), pointing out that production is currently a month ahead of schedule compared to the iPhone 12 – that suggests we'll be seeing the new iPhone 13 models in September, as normal.",
    "You may remember that the iPhone 12 wasn't unveiled until October, what with a coronavirus pandemic and a global chipset shortage getting in the way of Apple's plans. This new report suggests we can expect a return to the standard September slot the next time Apple has some smartphones to show off.",
    "It was only a few days ago that we heard from another source that production is underway on the iPhone 13 chipset, rumored to be the Apple-made A15. While the pandemic and the chip shortage continues, it appears Apple's suppliers are better prepared this time around.",
    "The Samsung-made displays are being tipped to offer the ProMotion feature that's been available on the iPad Pro for several years: that means their refresh rates can be upped to 120Hz if needed, depending on what's happening on screen at the time.",
    "A faster refresh rate means a smoother experience in terms of visuals – from playing fast-paced games to opening app menus, everything that happens on a 120Hz screen should feel slicker and more fluid. The current batch of iPhones have displays that are fixed at 60Hz, so this is quite an upgrade.",
    "Display support for 120Hz was predicted for the iPhone 12 by some sources, but it looks as though this year will be the year that Apple adds the tech. We've already heard numerous rumors and leaks on the topic, though it does appear that the 120Hz ProMotion display will be exclusive to the Pro models of the iPhone 13.",
    "Other leaks and speculation are hinting at improvements to camera stabilization quality and a smaller notch on the front of the device, though for major design and component changes we might have to wait until the iPhone 14 upgrade happening next year."
  ],
  "headers": {
    "4": "Refresh rate upgrade"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "The Elec": "http://www.thelec.net/news/articleView.html?idxno=2858",
    "MacRumors": "https://www.macrumors.com/2021/05/29/samsung-production-iphone-13-displays/",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPad Pro": "https://www.techradar.com/news/new-ipad-pro-2021-is-the-best-tablet-money-can-buy-and-its-out-today",
    "by some sources": "https://www.techradar.com/news/first-iphone-12-video-leak-shows-120hz-refresh-rate-and-new-camera-settings",
    "numerous rumors": "https://www.techradar.com/news/two-iphone-13-models-look-set-to-have-a-120hz-screen-built-by-samsung",
    "camera stabilization quality": "https://www.techradar.com/news/iphone-13-range-could-have-improved-camera-stabilization-for-sharper-shots",
    "a smaller notch": "https://www.techradar.com/news/iphone-13-pro-final-design-leaked-in-high-quality-renders",
    "iPhone 14": "https://www.techradar.com/news/iphone-14-could-have-a-stronger-thinner-screen"
  }
}