{
  "source": "https://www.techradar.com/news/knuckles-steals-the-show-in-first-sonic-the-hedgehog-2-movie-trailer",
  "title": "Knuckles dominates the screen in first Sonic the Hedgehog 2 movie trailer",
  "category": "entertainment",
  "updated": "2021-12-10T03:39:30Z",
  "author": "stephen-lambrechts",
  "summary": "But Tails is also great",
  "article": [
    "The first Sonic the Hedgehog film surprised pretty everyone by being one of the best video game adaptations to hit the big screen up until that point.",
    "That the film was able to overcome a dreadful first impression from fans due to Sonic's initial character design was just the icing on the cake.",
    "Now, everyone's favorite ring-collecting rodent is back for his second adventure, and this time he's brought some familiar faces along with him. You can check out the film's first trailer, which was revealed during The Game Awards 2021, below.",
    "We're pleased to see that Sonic's trusty sidekick Tails is now along for the ride, and is being voiced by Colleen O'Shaughnessey, who's brought life to the character a number of times before in games such as Sonic Forces and Team Sonic Racing.",
    "Of course, the big drawcard for fans will surely be the arrival of Knuckles the Echidna, voiced to tough guy perfection by none other than Idris Elba.",
    "As per Sonic the Hedgehog canon, Knuckles is tricked into fighting Sonic (Ben Schwartz) and Tails by the evil Dr. Robotnik, played once again by Jim Carrey, who has now gone full Eggman with bald head and ridiculously over-the-top moustache.",
    "So far, everything we've seen from Sonic the Hedgehog 2 leads us to believe that the sequel will drastically improve on its already-enjoyable predecessor. We can't wait to check it out when it releases exclusively in theatres on March 31, 2022."
  ],
  "headers": {
    "3": "Our take: Sonic the Hedgehog 2 looks like a winner"
  },
  "links": {
    "best video game adaptations": "https://www.techradar.com/best/best-game-movies-sonic",
    "dreadful first impression": "https://www.techradar.com/news/sonic-the-hedgehog-is-officially-getting-a-sequel",
    "The Game Awards 2021": "https://www.techradar.com/news/the-game-awards-2021-the-biggest-announcements-and-reveals"
  }
}