{
  "source": "https://www.techradar.com/news/asus-zenfone-8-and-zenfone-8-flip-revealed-in-huge-image-and-spec-leak",
  "title": "Asus Zenfone 8 and Zenfone 8 Flip revealed in huge image and spec leak",
  "category": "phones",
  "updated": "2021-05-06T09:45:22Z",
  "author": "aakash-jhaveri",
  "summary": "The range includes one mini and one flippy",
  "article": [
    "Spoiler alert: a massive leak just revealed the designs and specs of the Asus Zenfone 8 flagship series ahead of its launch on May 12 – and it looks as though the flip camera that we saw on the Zenfone 7 handsets is making a return after all.",
    "The team at 91mobiles and well-known tipster Ishan Agarwal have shared leaking duties to reveal both the compact Zenfone 8 (previously rumored to be called the Zenfone 8 Mini) and the Zenfone 8 Flip. There's no mention in this leak of an extra Zenfone 8 Pro model.",
    "Starting with the Zenfone 8, it has a simple design with two cameras on the back and a punch-hole camera on the front. With a screen apparently spanning 5.92 inches, it will be amongst the smallest high-end Android smartphones on the market, though it doesn't quite match the compactness of the iPhone 12 Mini.",
    "According to 91mobiles, the diminutive Zenfone 8 will bring with it a Snapdragon 888 processor, 8GB of RAM, and 128GB of internal storage. The battery size is said to be 4,000mAh, with 30W fast charging supported, and the phone will apparently also find room for a 3.5mm headphone jack.",
    "As for the Asus Zenfone 8 Flip, it's seemingly going to retain the iconic flipping camera module of some of its predecessors: the triple-lens 64MP+12MP+8MP module in this leak can do double duty as a rear camera and a selfie camera, so you get the same results whichever side of the phone you're on.",
    "Here the screen is rumored to be a 6.67-inch AMOLED display supporting a 90Hz refresh rate – thanks to that flipping camera, there's no punch-hole of course. A larger 5,000mAh battery capacity is predicted, though the 30W maximum wired charging rate is the same as the standard model.",
    "The rumored internal specs of the Flip model line up with the standard Zenfone 8 as well, except the internal storage gets a bump to 256GB. If there is a Pro model that 91mobiles hasn't mentioned, it will almost certainly use the same Snapdragon 888 processor inside, and we've also heard whispers about a 16GB of RAM configuration.",
    "It looks as though we're in line for silver and gray versions of both phones, based on these renders – which match up nicely with other leaked renders we've seen. All will be revealed on May 12, and we will of course bring you every announcement from the event."
  ],
  "headers": {},
  "links": {
    "its launch on May 12": "https://www.techradar.com/news/asus-confirms-the-zenfone-8-is-launching-on-may-12-with-a-compact-version-rumored",
    "91mobiles": "https://www.91mobiles.com/hub/asus-zenfone-8-flip-specifications-renders-exclusive/",
    "Ishan Agarwal": "https://twitter.com/ishanagarwal24/status/1389987244295950354",
    "the Zenfone 8 Mini": "https://www.techradar.com/news/upcoming-asus-phone-could-fill-the-sony-xperia-compact-shaped-hole-in-your-heart",
    "iPhone 12 Mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "heard whispers": "https://www.techradar.com/news/asus-zenfone-8-minis-specifications-revealed-in-a-benchmark-listing",
    "other leaked renders": "https://www.techradar.com/news/new-asus-zenfone-8-leaks-reveal-mini-design-and-ip68-rating"
  }
}