{
  "source": "https://www.techradar.com/news/samsung-tv-plus-the-free-tv-streaming-service-explained",
  "title": "Samsung TV Plus: the free TV streaming service explained",
  "category": "televisions",
  "updated": "2021-07-12T10:54:45Z",
  "author": "henry-st-leger",
  "summary": "Samsung TV Plus offers TV for free",
  "article": [
    "Curious about Samsung TV Plus? If you’ve just bought a new Samsung TV, are seriously considering it, or are just now exploring every inch of your smart TV interface, you might be wondering what this free (yes, free) content service is all about.",
    "Samsung TV Plus is designed as a free (albeit ad-supported) content platform, offering a unique and widely varied mix of TV channels depending on your region (the US gets 115, for instance, while those of you in the UK get a more modest 49). Don't fancy subscribing to Netflix or Disney Plus right after shelling out for a new TV? Samsung TV Plus lets you watch its ad-supported channels for free instead.",
    "If you’ve come across Samsung TV Plus before, and didn’t think there was much on it for you, that might have changed in the past few months. There are now over twice as many TV channels (518) worldwide, and double the number of Samsung TVs supporting the app since last year.",
    "So if you’re after more information about Samsung TV Plus, what and how many channels you can access, and which TVs support it, read on for everything you could possibly need below.",
    "UPDATE: Samsung TV Plus has got something of an overhaul on 2017-2020 Samsung TVs, with a new overlay layout that summarizes recently-viewed channels, as well as \"top recommendations tailored to their viewing preferences\". It sounds like Samsung TV Plus is starting to be treated as its own content portal, rather than an add-on (previously, the service was found quite awkwardly poking out of the bottom end of the home page, so a design change seems long overdue).",
    "Samsung TV Plus is now available in a total of 23 countries worldwide, after doubling the number of regions in an early 2021 expansion. That means you can now find it in the US, Canada, UK, Germany, Austria, Switzerland, France, Spain, Italy, Thailand, and Korea (where it initially launched), as well as new additions of Australia, Belgium, Brazil, Denmark, Finland, India, Luxembourg, Mexico, Netherlands, Norway, Portugal, and Sweden.",
    "If your region isn’t included in that list, you can’t access Samsung TV Plus. Sorry! Given the gradual expansion of the service, though, we would expect new territories to be included in the coming years – and Samsung tells us that more European countries will get the service in 2021.",
    "You can find the Samsung TV Plus app by turning on the television and heading to the Samsung TV Plus icon on the home screen – it should be on the far left, in a fixed position rather than mixed with the third-party apps.",
    "If you're in the US, you can also watch Samsung TV Plus on your favorite internet browser. Quietly launched in May 2021, the browser version of Samsung TV Plus is sadly not yet available worldwide, but if you're in the States, you can head to the Samsung TV Plus website to give the app a go without needing to own a Samsung smart device.",
    "There are over 500 TV channels available worldwide through Samsung TV Plus, though you’ll only get a portion of that total in each region:",
    "Each territory benefits from a mix of news, sports, and entertainment channels. In the US, that means you get the likes of CBSN, USA Today, fubo Sports Network, BelN Sports, IGN, Anime All Day, Comedy Dynamics, Kitchen Nightmares, Docurama, Wipeout, Tastemade, and Toon Goggles. There are a host of dedicated movie and music channels too.",
    "None of these will likely feel like essential watching – not in the same way as the best Netflix shows and Disney Plus movies out there – but they'll certainly pass the time.",
    "To remove TV channels you’re not keen on – and prevent them from coming up in the Recommended section – you can hover over the TV Plus app and select Channel List > Edit Channels > Delete.",
    "The exact Samsung TV models that support Samsung TV Plus will, again, vary between regions, but you can count on it featuring on new and recent models.",
    "We’re told by Samsung that all 2016-2020 smart TVs in the US, Europe and Thailand support the service, while those of you in Canada can access it on Samsung TVs made in 2017 onwards. In Samsung’s home nation of Korea, though, TVs as old as 2013 support the service.",
    "New-for-2020 models like the Q950TS or Q80T QLED will come with dedicated Samsung TV Plus buttons on the TV remote, too – that is, in the US and Canada.",
    "Not got a Samsung TV yet – or thinking about an upgrade? Check out the Samsung TV deals listed below:"
  ],
  "headers": {
    "5": "Samsung TV Plus app: where is it available?",
    "9": "Samsung TV Plus channels: what can you watch?",
    "13": "Which TVs support Samsung TV Plus?"
  },
  "links": {
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "favorite internet browser": "https://www.techradar.com/news/samsung-tv-plus-is-now-available-online-and-you-can-try-it-for-free",
    "Samsung TV Plus website": "http://www.samsungtvplus.com",
    "best Netflix shows": "https://www.techradar.com/best/best-netflix-shows",
    "Disney Plus movies": "https://www.techradar.com/best/best-disney-plus-movies",
    "Q950TS": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "Q80T QLED": "https://www.techradar.com/reviews/samsung-q80t-qled-tv"
  }
}