{
  "source": "https://www.techradar.com/news/every-new-tv-announced-at-ces-2021-from-lg-to-samsung",
  "title": "Every new TV announced at CES 2021, from LG to Samsung",
  "category": "televisions",
  "updated": "2021-01-25T12:35:27Z",
  "author": "henry-st-leger",
  "summary": "QNED, MicroLED, and more",
  "article": [
    "The CES 2021 expo is coming to a close, bringing in a medley of new television displays set to empty our wallets in the year to come.",
    "It hasn’t been quite the extravaganza of previous years, no doubt due to the fact the event moved online, and plenty of electronics brands who might have graced the show floor have chosen to sit out the digital event and make announcements on their own terms and timelines. (Hisense, for one, hasn’t shown off any new TVs this time, despite usually having a sizable number of TVs on display.)",
    "So what was shown off? LG, Samsung and Sony all showed up in earnest, with new 2021 TV ranges unveiled – if not in full, certainly with a decent chunk of planned models. Panasonic only showed off one TV, too, but we’re confident that other, step-down sets will emerge in the coming months.",
    "Want to know what TVs were announced at CES 2021? Read our full guide below – though keep in mind that pricing and availability information is still scarce at this point. You can be sure most of these sets will be landing sooner rather than later though, with the majority expected to launch by mid-2021.",
    "Samsung really pulled out the stops with its MicroLED TV, available in 88-inch, 99-inch, and 110-inch sizes. Its self-emitting LEDs can rival OLED with their contrast, with none of the low brightness issues that plague the competing technology. MicroLED is still expensive, though, even if these latest models bring Samsung’s The Wall range to its smallest sizes (and therefore price tags) yet.",
    "You can split the screen into four video feeds, too, allowing you to watch four different content steams simultaneously (if you’re into that). There’s no pricing yet, but we’ll keep you informed when we hear more.",
    "You can find out more in our Samsung The Wall guide.",
    "Samsung has also revamped its high-end QLED range, launching another three 8K TVs (as it did at last year’s expo): the QN900, QN800, and QN700.",
    "These sets are referred to as ‘Neo QLED’, marking upgrades to the backlight that pack in 10 times the number of LEDs, radically increase brightness, reduce blooming and widen viewing angles. The Neo QLED TVs also achieve 100% color volume of DCI-P3, plus better local dimming.",
    "The QN900 will feature Samsung’s Infinity Display, without a bezel, while packing in 6.2.2 channel sound and OTS-enabled verticality to the audio, as well as an 8K Quantum processor. The QN800 and QN700 are similar in spec and capability, though without the Infinity Display or all of the bells and whistles of its step-up sibling. (The QN700 is technically the entry-level 8K model, and given last year’s surprise fourth 8K TV was called the Q700T, we reckon Samsung will be sticking with just three models in this year’s range.)",
    "There are also two Neo QLED 4K TVs, the QN90A and QN80A, as updates to the Q90T and Q80T respectively, and we expect to see lower-spec QLEDs to emerge later in the year too.",
    "Find out more in our Samsung TV 2021 guide.",
    "LG made the surprising move of announcing a brand new LCD range, branded as ‘QNED’ TVs. That technically stands for ‘quantum nano-emitting diode’, but what you need to know is that it utilizes a MiniLED backlight of 30,000 tiny LEDs, in order to achieve a million-to-one contrast ratio and boost brightness control. It’ll be something of an upgrade over LG’s prior NanoCell LCD TVs then, which have always paled in comparison to the company’s OLED screens, though we don’t expect these QNED models will be biting at the heels of LG’s OLED range either.",
    "There are two 8K QNED models, the QNED99 and QNED95, which sit at the top of LG’s 2021 LCD range and are packing LG’s latest a9 Gen 4 AI processor. Then there are two 4K QNED models, the QNED90 and QNED85, which use a lower-spec a7 Gen 4 AI chip. The first in both pairings boasts a 120Hz panel, whereas the second makes do with 60Hz.",
    "The LG UP80 and LG UP70, meanwhile, are Ultra HD TVs without QNED or OLED technology, for those wanting to buy LG at less of a financial cost.",
    "To find out more, head to our LG TV 2021 guide.",
    "Have no fear, though, as QNED isn’t going to be replacing OLED anytime soon. LG’s Gallery Series and C Series OLEDs are back for 2021, jumping from the ‘X’ branding to ‘1’ in new G1 and C1 models. There are some changes, though, which include an OLED evo technology to help up peak brightness in the G1’s panel, meaning the Gallery Series should outperform the C Series this year in terms of its picture quality. There’s also a new 83-inch model size for select OLEDs, while a 42-inch screen size has been confirmed by panel supplier LG Display that will likely make an appearance later in the year.",
    "The budget B Series seems to have been replaced with an entry-level A Series model – sporting a low-spec a7 Gen 4 AI processor, rather than the a9 iteration used in its more premium siblings – though LG isn’t ruling out a B1 television later in the year.",
    "To find out more, head to our LG TV 2021 guide.",
    "Sony has announced its 2021 lineup of TVs that will all include a new processor called the Cognitive Processor XR – a successor to Sony's long-running X1 line of chips.",
    "The Cognitive Processor XR will be used on five new series of TVs – the Sony Z9J Master Series 8K TV, X95J and X90J LED-LCD 4K TVs, and the A80J and A90J OLEDs. While all models will be equipped with better upscaling, better color reproduction, and enhanced contrast, it’s the new A90J OLED that will see the biggest boost with the technology, as it could be the first OLED to cross 1,000 nits of peak brightness. We look forward to comparing it to the brightness-boosted OLED evo tech used in LG’s new Gallery Series OLED, though.",
    "Find out more in our Sony TV 2021 guide.",
    "Well, there’s technically only one of these confirmed for 2021 so far: the JZ2000 OLED. As the successor to last year’s excellent HZ2000, it certainly has big boots to fill, but Panasonic has found a very smart way of expanding sideways. The JZ2000 features side-firing speakers as well as the upward-firing and front-firing systems utilized in previous models, for an all-sides audio assault you won’t quite get on any other TV today.",
    "There’ll certainly be more OLEDs from Panasonic to come, likely to replace the HZ1500, HZ1000 and HZ980 OLEDs, as well as step-down LCD models.",
    "Find out more in our Panasonic TV 2021 guide.",
    "TCL made one massive announcement around its popular 6 Series range, confirming it was set to get an 8K upgrade for 2021. It joins a raft of features such as full array local dimming, quantum dot contrast, and MiniLED that have come to the series in recent times. Given TCL’s largely aggressive pricing, that means we could be about to see a sub-$1,000 8K TV in the coming months.",
    "TCL tends to keep its best TVs for the US, though, so we’re not holding out on an 8K model to come to the UK just yet."
  ],
  "headers": {
    "4": "Samsung The Wall MicroLED TV",
    "7": "Samsung Neo QLED TVs",
    "12": "LG QNED TVs",
    "16": "LG OLED TVs",
    "19": "Sony OLED and LCD TVs",
    "22": "Panasonic JZ2000 OLED TV",
    "25": "TCL 6 Series 8K TV"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "only showed off one TV": "https://www.techradar.com/news/the-panasonic-jz2000-4k-oled-tv-has-a-built-in-sound-system-like-no-other",
    "MicroLED": "https://www.techradar.com/news/microled-vs-oled-the-battle-of-the-high-end-display-tech",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Samsung The Wall": "https://www.techradar.com/news/samsung-the-wall-microled-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "OTS": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Q700T": "https://www.techradar.com/news/new-samsung-8k-tv-is-cheaper-than-the-q800t-qled-and-with-a-more-desirable-size",
    "Samsung TV 2021": "https://www.techradar.com/news/new-samsung-tv-2021",
    "brand new LCD range": "https://www.techradar.com/news/lgs-first-qned-mini-led-tv-will-feature-up-to-30000-tiny-leds",
    "QNED": "https://www.techradar.com/news/what-is-qned",
    "Ultra HD TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "LG TV 2021": "https://www.techradar.com/news/lg-tv-2021",
    "should outperform the C Series this year": "https://www.techradar.com/news/lg-gallery-series-oled-tv-to-become-new-flagship-as-cx-successor-loses-out",
    "42-inch screen size has been confirmed": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them",
    "a new processor called the Cognitive Processor XR": "https://www.techradar.com/news/sony-oled-tvs-could-shine-brighter-than-lgs-thanks-to-new-xr-processor",
    "Gallery Series OLED": "https://www.techradar.com/reviews/lg-gallery-gx-oled-tv",
    "Sony TV 2021": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "HZ2000": "https://www.techradar.com/reviews/panasonic-hz2000-4k-oled-tv",
    "features side-firing speakers": "https://www.techradar.com/news/the-panasonic-jz2000-4k-oled-tv-has-a-built-in-sound-system-like-no-other",
    "HZ1500": "https://www.techradar.com/reviews/panasonic-hz1500-oled-4k-tv",
    "HZ1000": "https://www.techradar.com/reviews/panasonic-hz1000-oled-4k-tv",
    "HZ980": "https://www.techradar.com/news/should-i-buy-the-panasonic-hz980-oled-tv",
    "Panasonic TV 2021": "https://www.techradar.com/news/panasonic-tv-2021",
    "set to get an 8K upgrade for 2021": "https://www.techradar.com/news/the-tcl-6-series-could-feature-the-most-affordable-8k-tv-ever-made"
  }
}