{
  "source": "https://www.techradar.com/news/the-ps5-and-the-pandemic-have-changed-my-relationship-with-pc-gaming",
  "title": "The PS5 and the pandemic have changed my relationship with PC gaming",
  "category": "gaming",
  "updated": "2021-05-19T08:00:55Z",
  "author": "samuel-roberts",
  "summary": "Opinion: How the pandemic warped my playing habits",
  "article": [
    "What do you think about when you look at your computer desk? Until the pandemic, I thought of it as a fun space – somewhere I sit to enjoy the vast riches of my Steam library with a mouse and keyboard, and play Sea of Thieves every Thursday with friends.",
    "At whatever point in the pandemic this is, though, it's been my office for over a year. Sitting at my PC now makes me think about work and nothing else.",
    "I definitely don't discount my luck that I've been able to keep working throughout the last 14 months. But I do think the lack of boundaries between work and home in terms of living space has warped my relationship with PC gaming. I'm very used to working in an office – I know it's not for everyone, but having somewhere to go every day is definitely good for me. Plus, the employees of the sandwich shops near my office know me on a first-name basis.",
    "There was a point last year where I was playing PC games with friends on 4 or 5 nights a week, alongside working at my desk full-time. I eventually burned out on this big time, and scaled back my social gaming period on PC to one night a week, mostly so I could go and sit in a different part of my flat during the evenings. Fundamentally, my gaming PC is less a part of my spare time than it's ever been.",
    "The PS5 arrived at exactly the right time: just as I was truly sick and tired of looking at my desktop for 10-16 hours a day. As my desire to jump on at 10pm for a few rounds Apex Legends waned, this console picked up the slack. I started playing PS4 games I'd missed like Ghost of Tsushima and Days Gone just to see how the unexpected frame rate update benefitted each one.",
    "Right now, the PS5 is at the center of my gaming life in a way that the PS4 never was, and I attribute that to the console feeling more like an actual generational leap than its predecessor ever did.",
    "The PS5 menu music is lovely. Everything from this choice of background theme to the UI is surely designed to make the console feel more premium than the PS4 did. This might sound like I'm rubbing it in if you've been trying and failing to find PS5 stock while scalpers hoover console supplies up, but it is genuinely nice to have the console switched on while you're making a drink. Everything about the PS5 experience feels very considered.",
    "As new consoles come and go, we see the same commentary pop up – that the gap between generations is so slim it's getting harder to tell what the upgrade is. Superficially, I understand that with the PS5 and Xbox Series X. In the post-HD era of games, the differences aren't as drastic as they used to be. For example: eight years separated the release of Super Mario Bros 3 on NES and Super Mario 64 on N64. Meanwhile, eight years ago we were playing The Last of Us on PS3. Progress is more incremental in terms of graphical fidelity as well as everything else, which isn't a shock to anyone.",
    "This generation, though, has proved to be about meaningful niceties so far, which is an approach I really like. For the longest time, barring a few examples like Call of Duty, console games never targeted higher frame rates than 30fps. Pretty much every game I've enjoyed playing on PS5 so far – like Miles Morales: Spider-Man or Resident Evil Village – has run at 60fps, usually at 4K. To me, that difference is enough to make the generational leap seem important, simply because this has never been the standard before. It's one of the main reasons I've been playing big games on PC for the past decade.",
    "Developers are also now providing flexibility to console players, with optional fidelity or frame rate modes to customize the experience depending on what you want. Now, this is nothing compared to the suite of graphics options you get on PC, but the developers behind blockbuster games are standardizing these choices, more so than they did with the mid-gen upgrades of the Xbox One X and PS4 Pro. This, combined with the console's fast loading via the SSD, means the PS5 does feel like a serious upgrade to me – certainly more than PS3 was to PS4.",
    "For once, I don't feel like I'm missing out by playing a game on PS5 rather than PC. This was not the case with PS4, where very early on, games like Alien Isolation or Shadow of Mordor ran at 30fps on Sony's console, while even a mid-range PC would have no problem outputting 60fps for those same titles. That's probably going to change over time, as graphics cards improve and the PS5's specs stay the same, but it's an impressive start. It's close enough to the PC experience, to be able to enjoy Assassin's Creed Valhalla at 4K 60fps, that I feel comfortable making the choice to play on console.",
    "Now, I'm not too militant about performance – I enjoyed the experience of owning a PS4, and played it plenty – but it is impressive to see these things taken more seriously by Sony and Microsoft this time. If anything, Microsoft deserves extra credit for delivering frame rate boosts for last-gen games, offering them the PC-level experience they never got to have on Xbox One.",
    "To me, making the console experience of playing a blockbuster game feel closer to the premium PC experience is a worthwhile generational upgrade.",
    "The PS5 is not an adequate substitute for my PC long-term, however. The range of games I can play on PC outstrips Sony and Microsoft's console many times over, and it's still the only place I can enjoy Red Dead Redemption 2 above 30fps – plus I keep meaning to fly over my home town in Microsoft Flight Simulator (though the game is set to come to Xbox Series X in the future). I love the variety presented by PC gaming, and how it can create overnight Early Access hits like Valheim by sheer word-of-mouth. It's not something I've ever seen replicated on closed-platform consoles in the same way.",
    "Really, though, it'll take the end of the pandemic for me to start seeing my PC as a fun place again. The lingering memory of waking up at 8.50 for an entire year, dozily putting the kettle on, sitting at my desk and logging on to Slack is something I'll need time to shake. I might even need to move house to remove the psychological barrier of the computer desk feeling like a work place.",
    "As consequences of a global pandemic go, this is extremely mild. But it is one way my relationship with technology has fundamentally changed over the past year. I'm sure you've got your own examples of things that seemed important before March 2020, until they didn't.",
    "PC gaming will always win out for me, then. But the PS5 is the kind of next-gen console I've always wanted – something that doesn't make me feel like I'm missing out on the best experience."
  ],
  "headers": {
    "6": "A proper upgrade",
    "13": "Why PC still rules"
  },
  "links": {
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "Days Gone": "https://www.techradar.com/news/fireside-chat-is-days-gone-worth-buying",
    "PS5 stock": "https://www.techradar.com/news/where-to-buy-ps5"
  }
}