{
  "source": "https://www.techradar.com/news/canons-eos-r3-mirrorless-camera-could-arrive-sooner-than-expected",
  "title": "Canon's EOS R3 mirrorless camera could arrive sooner than expected",
  "category": "cameras",
  "updated": "2021-06-01T03:13:22Z",
  "author": "sharmishta-sarkar",
  "summary": "The new sports full-frame mirrorless camera gets listed on several retailer sites",
  "article": [
    "It was only a month back that Canon announced that the EOS R3 was in development and it seems like the camera could launch soon.",
    "Camera retailers around the world have started listing the upcoming pro-level full-frame mirrorless camera on their websites – including B&H Photo in the US and Georges Cameras in Australia.",
    "While none of them actually mention a price on their sites, a Google Search shows a price tag of $6,000 listed under US retailer Adorama.",
    "These placeholder listings may indicate that the Canon EOS R3 could be launching soon. We were expecting it to arrive in time for the 2021 Olympics in Tokyo that's scheduled to start on Friday, July 23 (provided all goes well on the pandemic front), but we may not need to wait until next month for the official launch announcement.",
    "We've already had product images leak on Twitter thanks to prolific and oft-reliable camera leaker Nokishita, as well as plenty of whispers on the wind on how much the body will cost.",
    "Reports have suggested that Canon plans to undercut the competition and price the EOS R3 lower than what the EOS 1-D X Mark III and the Sony Alpha A1 costs right now – at launch, rumors suggest the EOS R3 will carry a price tag of $5,999 (about £4,215 / AU$7,725). This is seemingly confirmed by the $6,000 price that's displayed on Google Search results as seen on the screenshot above.",
    "To put that price into perspective, the 1-D X Mark III had a launch price of $6,499 / £6,499 / AU$9,999 in 2020, while the Sony A1 arrived earlier in 2021 for $6,500 / £6,499 / AU$10,499 body only.",
    "That, as Canon explained, would put the EOS R3 between the Canon EOS R5 (priced at $3,899 / £4,199 / AU$6,899) and the 1-D X Mark III – not the 'flagship' we thought it was supposed to be.",
    "Given what we already know about the EOS R3's specs and features, it's definitely shaping up to be a pro sports shooter. But if the EOS R3 is coming in cheaper than the Sony A1, could it be missing out on some features that the Sony boasts of? It could come in the form of lower sensor resolution, which would make sense if Canon is prioritizing speed (it's rumored to be able to shoot bursts of 30fps like the A1).",
    "Looking at the leaked images, especially the one of the rear control layout, it seems the R3 is identical to the 1-D X Mark III – the new Smart Controller included. That indicates the camera is designed for the pros, and coming in cheaper than the 1-D X Mark III will allow budding professionals to reach for the Canon R system, especially now that there are some excellent telephoto optics in the RF arsenal.",
    "Sadly that also indicates that Canon is likely not going to be looking at making any more pro DSLRs and is hoping the existing 1-series users will switch to its mirrorless system.",
    "Another factor that could help Canon price the R3 lower is weather sealing. While it will have some degree of weather sealing, the memory card slot lacks the twisting lock that's available in the 1-series DSLRs. It also lacks the smaller LCD display that shows the shooting settings on the 1-D X.",
    "A closer look at the rear of the R3 also indicates that it's coming with a fully articulating display, which has never been used in the DSLR version. This provides versatility to different types of photographers, which means Canon is not just targeting news and sports photographers, but potentially making this type of camera more mainstream.",
    "All this is still conjecture though. We still have no idea when Canon will officially launch the EOS R3 and what the final feature list will look like. But a camera priced competitively and coming with some high-end specs is definitely looking like a good tactic from Canon."
  ],
  "headers": {
    "8": "Analysis: high-end specs for a better price"
  },
  "links": {
    "Canon announced that the EOS R3 was in development": "https://www.techradar.com/reviews/canon-eos-r3",
    "B&H Photo": "https://www.bhphotovideo.com/c/product/1634981-REG/canon_eos_r3_mirrorless_digital.html?BI=20811&KBID=16572&SID=trd-us-1414181809867334400",
    "Georges Cameras": "https://www.georges.com.au/canon-eos-r3-mirrorless-digital-camera-body-only.html",
    "Reports": "https://www.canonrumors.com/the-canon-eos-r3-pricing-to-undercut-the-competition-cr3/",
    "EOS 1-D X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "Sony Alpha A1": "https://www.techradar.com/reviews/sony-a1",
    "not the 'flagship'": "https://www.techradar.com/news/canon-explains-why-the-canon-eos-r3-isnt-its-flagship-mirrorless-camera"
  }
}