{
  "source": "https://www.techradar.com/news/airpods-pro-2-tipped-to-launch-in-the-third-quarter-of-2022",
  "title": "AirPods Pro 2 tipped to launch in the third quarter of 2022",
  "category": "audio-visual",
  "updated": "2021-11-13T12:00:05Z",
  "author": "david-nield",
  "summary": "The waiting continues",
  "article": [
    "Thank you Apple, for launching the shiny new AirPods 3 last month – but we'd also quite like to know when the AirPods Pro 2 are showing up. The answer, according to one tipster, is in the third quarter of 2022 (so July, August or September).",
    "The information comes courtesy of @FrontTron (via MacRumors), who says that the launch of the premium wireless earbuds has been pushed back from Q2 2022 to Q3 2022 for an as yet unspecified reason.",
    "This particular source has something of a hit and miss record when it comes to previous Apple rumors, but the updated launch window details are said to come direct from a supply chain insider – so we leave you to draw your own conclusions on this one.",
    "Some of the most reliable Apple sources, including well-respected analyst Ming-Chi Kuo, have said that the AirPods Pro 2 earbuds are going to be breaking cover at some point in 2022. But until now, no one has been any more specific than that.",
    "As for what new features and functions we might get with the arrival of the AirPods 2, we've heard that we might be getting improved noise cancellation with the new earbuds, as well as a number of fitness features – including blood oxygen level monitoring.",
    "Pricing is of course going to be crucial, and one leak has said the Apple AirPods 2 will cost the same as the previous model – so $249 / £249 / AU$399. You can currently pick up the standard Apple AirPods 3 for $179 / £169 / AU$279.",
    "If this latest rumor is right, we could be waiting up to another 10 months for the second-generation Apple AirPods Pro to be unveiled. That's quite a stretch, considering that the original AirPods Pro launched back in October 2019.",
    "It would mean a gap of almost three years between the first and second editions of AirPods Pro, which is a long time to be waiting. We're presuming that the much publicized global chip shortage is making it difficult for Apple to get its production lines running as smoothly as it would like, but even so.",
    "While the Pro version of Apple's AirPods are significantly more expensive than the standard version, they do bring with them plenty of upgrades: you get active noise cancellation and silicone eartips for a better fit for example. We would expect the AirPods 3 to add even more reasons to go for the pricier pair.",
    "And such has been the smash hit success of the AirPods line for Apple that there are bound to be plenty of people willing to pay a premium for wireless earbuds that are more powerful and more impressive than anything else."
  ],
  "headers": {
    "3": "The waiting game",
    "6": "Analysis: the AirPods Pro are due an upgrade"
  },
  "links": {
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "AirPods Pro 2": "https://www.techradar.com/news/apple-airpods-pro-lite-what-we-want-to-see-from-the-rumored-true-wireless-earbuds",
    "@FrontTron": "https://twitter.com/FrontTron/status/1459000065247219718",
    "MacRumors": "https://www.macrumors.com/2021/11/12/airpods-pro-2-release-third-quarter-2022/",
    "at some point in 2022": "https://www.techradar.com/news/apple-airpods-pro-2-could-release-next-year-says-analyst",
    "a number of fitness features": "https://www.techradar.com/news/the-airpods-3-could-coach-you-through-your-workouts",
    "one leak": "https://www.techradar.com/news/apple-airpods-pro-2-price-leak-reveals-bad-news-for-true-wireless-earbuds-fans",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "plenty of upgrades": "https://www.techradar.com/news/apple-airpods-3-vs-airpods-pro"
  }
}