{
  "source": "https://www.techradar.com/news/this-dell-xps-13-for-dollar685-is-the-best-pre-black-friday-laptop-deal-weve-seen-so-far",
  "title": "This Dell XPS 13 for $685 is the best pre-Black Friday laptop deal we've seen so far",
  "category": "computing",
  "updated": "2021-10-08T16:17:21Z",
  "author": "alex-whitelock",
  "summary": "The lowest price yet for a 11th gen Core i5 model",
  "article": [
    "We've just spotted what will easily be one of the best pre-Black Friday laptop deals this side of November - this 11th gen Core i5 Dell XPS 13 Touch for just $685.99 (was $1,049.99).",
    "To get this price, simply use the coupon code 50OFF699 at checkout. That'll slash the price right down to a new record low for this model, which also features 8GB of RAM, and a 256GB SSD.",
    "Considering the premium looks, spec, and price of this Dell XPS 13, we'd say it's going to be very hard to beat this one when it comes to sheer bang for the buck, especially if you're looking for one of the best laptops money can buy.",
    "It's a little more expensive than last year's Black Friday laptop deal on a Dell XPS 13 - which featured a 10th gen Core i3 processor for $649 - but this model is far, far more powerful. Having an 11th gen Intel Core i5 CPU is going to help you plow through a much wider range of tasks with greater speed - even the most intensive of work applications.",
    "It's important to note that this is the baseline '(9305)' model, which essentially means it's featuring a slightly thicker bottom screen bezel than the latest Dell XPS 13 (9310) model. It does, however, still feature an absolutely fantastic 400 Nits display, quality build materials, and it's much, much cheaper ($300+ in this case).",
    "Outside the US? See today's best laptop deals in your region just below.",
    "Get ready for the big day itself with our handy guide to the upcoming Black Friday deals. Also, check out our main Dell XPS 13 deals page if you're looking for the cheapest prices on other models."
  ],
  "headers": {
    "6": "Laptop deals: Dell XPS 13 lowest price ever"
  },
  "links": {
    "just $685.99 (was $1,049.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3176566960787812400/https://deals.dell.com/en-us/member/productdetail/auss",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Dell XPS 13 (9310) model": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1106729243733280800/https://www.dell.com/en-us/member/shop/dell-laptops/new-xps-13-laptop/spd/xps-13-9310-laptop/xn9310cto210h",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Dell XPS 13 deals": "https://www.techradar.com/news/dell-xps-13-deals"
  }
}