{
  "source": "https://www.techradar.com/news/dont-want-to-return-your-peloton-treadmill-there-are-other-solutions",
  "title": "Don't want to return your Peloton treadmill? There are other solutions",
  "category": "fitness",
  "updated": "2021-05-20T09:11:04Z",
  "author": "cat-ellis",
  "summary": "Peloton is offering other safety options",
  "article": [
    "If you're fond of your Peloton treadmill and don't want to return it after it was recalled, you're in luck – the company has introduced several other options to make it safer, including a software update that locks the belt if the treadmill isn't used for a period of time.",
    "Earlier this month, Peloton issued voluntary recalls for all Peloton Tread and Tread Plus machines, after reports of injuries and an accident where a small child was pulled underneath a Tread Plus and killed.",
    "Owners of either treadmill were advised to stop using it immediately, and offered the opportunity to return it to Peloton for a refund (which you can do until November 6, 2022). However, if you'd prefer to keep your machine, there are a few other options.",
    "The main problem with the Tread is its touchscreen, which could come loose and fall off. Peloton has offered to send an engineer to owners' homes to repair the problem free of charge if they'd rather not return the whole thing.",
    "Peloton hasn't yet started sending out engineers, but you can sign up with the email address you used when ordering the treadmill and your order ID, and the company will be in touch once it's ready to start making repairs.",
    "The issue with the Tread Plus (which was only ever sold in the US) is its slatted belt, which can pull children, pets and objects underneath. Again, Peloton is developing a mechanical solution, though we don't yet know the details. It's possible that it could involve a type of barrier that covers the belt at the rear of the machine, preventing anything getting caught as it rotates.",
    "The company is also offering to move treadmills to a safer room in your house, well away from pets and children. Although they have wheels, the Peloton Tread weighs 290lb (131kg), and the Tread Plus is 455lb (206kg), so moving them alone would be unwise.",
    "The new software update applies to the Tread Plus, and locks the machine automatically when it's set to sleep, or is 'inactive' for 45 seconds.",
    "This means that you're not in a class, the belt isn't moving, the screen hasn't been touched, and the incline hasn't been adjusted. It'll also lock if a class is ongoing, but the treadmill detects that nobody is running. To unlock it again, you'll need to enter a PIN on the touchscreen.",
    "We've contacted Peloton to find out whether the update will need to be downloaded and installed manually (and if so, how), or if it will be downloaded automatically when the treadmill is online.",
    "Via NBC News"
  ],
  "headers": {
    "7": "Update your firmware"
  },
  "links": {
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Peloton issued voluntary recalls": "https://www.techradar.com/news/peloton-recalls-all-treadmills-in-the-us-what-you-should-do",
    "Peloton Tread": "https://www.techradar.com/reviews/peloton-tread",
    "you can sign up": "https://form.onepeloton.com/forms/view/4646818/?tfa_dbWorkflowId=12&tfa_dbWorkflowStep=0&tfa_dbWorkflowControl=8bef3879f69b6e6245f5d7b96ae146e4",
    "NBC News": "https://www.nbcnews.com/business/consumer/peloton-releases-software-fix-recalled-treadmills-n1267938"
  }
}