{
  "source": "https://www.techradar.com/news/square-plans-to-launch-savings-and-checking-accounts-for-smbs",
  "title": "Square plans to launch savings and checking accounts for SMBs",
  "category": "computing",
  "updated": "2021-05-25T10:47:06Z",
  "author": "rob-clymo",
  "summary": "Banking services may soon be coming to Square",
  "article": [
    "Leading card payments provide Square, looks set to offer checking and savings accounts to its customers in a bid to take on major players in the banking world.",
    "Although Square hasn’t made any official announcement about the accounts, which would be aimed primarily at the SMB community, possible evidence of its plan has appeared in hidden code discovered in a recent app update.",
    "Eagle-eyed techies spotted the code in Square’s app for the iPhone and iPad, which appears to make references to both checking and savings accounts. It also indicates that the checking edition will work hand-in-hand with Square’s debit card, which can currently be used by businesses.",
    "More interestingly for small business owners trying to keep a handle on overheads, the information garnered also points to Square offering banking services that will not have any monthly service charges or fees linked to minimum balances and overdrafts.",
    "Square has already shaken up the card payment processing world, with its simplified systems that offer cheap and cheerful card readers and affordable processing rates. The company also launched its Square Financial Services arm of the business back in March, with a view of offering business loans and deposit products. Although nothing is set in stone, the spotting of specific code by iOS developer Steve Moser could be significant.",
    "However, Square so far remains tight-lipped about the potential move towards offering savings and checking accounts, despite the emergence of Square Financial Services recently. Nevertheless, all points could lead to additional services appearing in the near future, based on its comments to Bloomberg on Monday. “We’ve long said its purpose will be to offer business loan and deposit products,” Square pointed out in a statement."
  ],
  "headers": {
    "3": "Banking services"
  },
  "links": {
    "card payments": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "Square’s app": "https://www.techradar.com/reviews/square-pos-system-review",
    "banking services": "https://www.techradar.com/news/square-gets-approval-to-launch-banking-services-including-smb-loans",
    "card payment processing": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}