{
  "source": "https://www.techradar.com/news/google-drive-now-lets-you-block-other-peoples-comments",
  "title": "Google Drive now lets you block other people's comments",
  "category": "computing",
  "updated": "2021-11-10T11:34:08Z",
  "author": "mike-moore",
  "summary": "Avoid extra distractions with this Google Drive update",
  "article": [
    "Staying productive when working remotely could be a lot easier thanks to a new feature coming to Google Drive.",
    "The cloud storage platform has announced a new update that will allow users to block comments or tags mentioning them, meaning they won't get distracted by emails or pings when trying to get work done.",
    "The update follows an earlier feature for Google Drive which allowed users to block other users, meaning the user would not be able to share any Drive items, and items owned by the user would not be able to be shared or be shown when browsing Google Drive.",
    "The tool has now been expanded to cover comments and mentions, hopefully leading to a smoother experience, with Google noting that the upgrade \"will make the feature more predictable and comprehensive.\"",
    "Going forward, notifications containing an @-mention between you and a blocked user in comments or action items on Google Docs, Sheets, or Slides will be prevented completely.",
    "The new feature is rolling out now, with Google expecting users to see it within the next few weeks. It will be available to all Google Workspace customers, as well as G Suite Basic and Business customers, as well as personal Google accounts.",
    "The update is the latest in a series of improvements being made to Google Workspace as the platform looks to aid users embracing the hybrid working life.",
    "This includes Google Drive borrowing the search chips function seen in Gmail to make finding files easier, with the new feature displaying possible results as a user is typing in the search bar - offering autofill suggestions and other possibilities for what it thinks they could be looking for.",
    "Another recent update means users will be able to access files such as Google Docs, Sheets, and Slides in Chrome, even if they aren't connected to the internet, which could be great news for workers on the go.",
    "Here's our pick of the best business cloud storage offerings around today"
  ],
  "headers": {
    "3": "Google Drive block"
  },
  "links": {
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "noting": "https://workspaceupdates.googleblog.com/2021/11/google-drive-user-block-comments-mention.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "search chips function": "https://www.techradar.com/news/finding-files-in-google-drive-will-soon-be-even-faster",
    "aren't connected to the internet": "https://www.techradar.com/news/you-can-now-access-all-your-google-workspace-files-offline",
    "best business cloud storage": "https://www.techradar.com/best/best-business-cloud-storage-service"
  }
}