{
  "source": "https://www.techradar.com/news/ipad-mini-2021-has-a-jelly-scrolling-issue-that-sometimes-blurs-the-screen",
  "title": "iPad mini 2021 'jelly scrolling' is normal, says Apple",
  "category": "tablets",
  "updated": "2021-09-29T08:20:03Z",
  "author": "james-peckham",
  "summary": "Can it be fixed?",
  "article": [
    "Update: Apple has commented to Ars Technica on the 'jelly scrolling' issues, and it says that this is normal behavior for LCD screens. This means the company isn't intending to fix the problem in future.",
    "Apple says that because the screens refresh line by line, there is a delay. This effect is definitely more noticeable than we've seen it on other LCD screens, so it seems like that's something you'll have to deal with if you want an iPad mini 6.",
    "Original story: Some iPad mini 2021 owners have noted a display issue called 'jelly scrolling' on the tablet's screen when using it in its portrait orientation.",
    "That term 'jelly scrolling' refers to an effect where lines of texts tilt left when you're scrolling through a webpage or a document. It's easier to understand by watching the effect, and you'll find an example in the tweet embedded below.",
    "The tablet went on sale on on Friday, September 24 so more and more users have begun to notice an issue. Apple has yet to comment on the problem, but TechRadar has asked for clarification from the company.",
    "In the tweet below, you can see the issue in slow motion. It's much harder to spot when you're normally using the tablet, but it's certainly visible and that's especially true when you know it's there.",
    "Since hearing these reports, TechRadar has tested the same issue and found it is noticeable on certain occasions with the iPad mini 2021.",
    "It isn't clear if this is a hardware issue, or if it's something that Apple would be able to fix with a future software update.",
    "A similar issue also impacted certain iPad Air 4 units, according to tech leaker Jon Prosser. However, this wasn't a problem we saw in our time with that tablet so it may be that not every model is affected.",
    "Previously when we've seen a similar issue, it has been a hardware problem so it may not be something that can be simply fixed.",
    "The OnePlus 5 saw a similar issue, and it's thought it was down to the screen being mounted on the wrong way around. That meant it wasn't an issue that could be fixed by a software upgrade.",
    "We won't know what Apple will be able to do until we hear directly from the company, and that's if we get a response at all. If you've bought an iPad mini 2021, it may be a problem you have to get used to, or you may need to swap your tablet for an alternative."
  ],
  "headers": {
    "9": "Analysis: what can Apple do?"
  },
  "links": {
    "Ars Technica": "https://arstechnica.com/gadgets/2021/09/2021-ipad-mini-suffers-from-uneven-jelly-scrolling-in-portrait-mode/",
    "iPad mini 2021": "https://www.techradar.com/reviews/ipad-mini-2021",
    "tech leaker Jon Prosser": "https://twitter.com/jon_prosser/status/1442578923020115970?ref_src=twsrc%5Etfw",
    "OnePlus 5": "https://www.techradar.com/reviews/oneplus-5",
    "it's thought it was down": "https://www.xda-developers.com/confirmed-oneplus-5-display-upside-down-likely-reason-jelly-scrolling/"
  }
}