{
  "source": "https://www.techradar.com/news/windows-10-powertoys-update-brings-back-a-classic-feature-by-popular-demand",
  "title": "Windows 10: PowerToys update brings back a classic feature by popular demand",
  "category": "computing",
  "updated": "2021-09-30T14:06:30Z",
  "author": "joel-khalili",
  "summary": "Latest PowerToys release rolls out for Windows 10",
  "article": [
    "Microsoft has pushed out a new version of its PowerToys utility suite for Windows 10, which reintroduces an old feature by popular demand.",
    "Although PowerToys v0.47 doesn’t come bundled with any new tools per se, it does see the return of the “highly requested ability to activate Shortcut Guide via holding down the Windows key”, the GitHub changelog explains.",
    "The change makes it easier to access the catalogue of Windows key and taskbar shortcuts, most of which help power users launch into common apps and utilities (e.g. File Explorer) more quickly.",
    "“The great feedback the community provides is invaluable in helping PowerToys continually grow and improve as a product,” added Deondre Davis, a contributor to the project.",
    "Beyond the new shortcut, the update also includes a number of fixes and optimizations that should help the suite run as smoothly as possible. For example, the contributors have remedied various crash-causing bugs, reduced the size of the installer and updated the shortcut configuration experience.",
    "PowerToys is an open source suite of tools for advanced Windows 10 users, designed to help bypass certain settings and perform actions that are unavailable by default. It also gives people a wider range of customization options.",
    "The utility library includes tools such as Color Picker, which copies color data from any running application to the clipboard, and Fancy Zones, which lets users create complex window layouts specifically suited to their applications (although the arrival of Windows 11 may diminish the usefulness of this particular tool).",
    "Others, like Image Resizer and PowerRename, help Windows 10 users perform common actions with greater ease and speed, maximizing productivity.",
    "Although the latest PowerToys release doesn’t add to this portfolio, the forecast looks promising for those eagerly awaiting new utilities. According to a tweet from Clint Rutkas, who heads up the project at Microsoft, the team is “quickly approaching stability” and new toys are on the way."
  ],
  "headers": {
    "5": "PowerToys update"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "GitHub changelog": "https://github.com/microsoft/PowerToys/releases/tag/v0.47.0",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "tweet": "https://twitter.com/ClintRutkas/status/1443285579131547653"
  }
}