{
  "source": "https://www.techradar.com/news/echo-show-8-2021-vs-echo-show-5-2021-which-amazon-smart-display-is-for-you",
  "title": "Echo Show 8 (2021) vs Echo Show 5 (2021): which Amazon smart display is for you?",
  "category": "smart-home",
  "updated": "2021-06-09T07:03:18Z",
  "author": "carrie-ann-skinner",
  "summary": "Is the Amazon Echo Show 8 a cut above?",
  "article": [
    "Now that Amazon has launched all-new versions of its smart displays (the new Echo Show 8 and Echo Show 5), we’ve been able to peruse the specs and see the key differences that exist between the two.",
    "These models replace the Echo Show 8 and Echo Show 5 released a few years ago, and come with a number of key upgrades too. We’ve got all the details you need to help you decide which one to go for while we wait for our full reviews to appear.",
    "Don't fancy the new Echo Show smart displays? Then check out the best prices right now for Amazon’s other Echo Show smart displays below:",
    "The new Amazon Echo Show 5 is Amazon’s most affordable smart display, costing $84.99 / £74.99 / AU$119 - this is actually $5 / £5 / AU$30 more than the price of the current Echo Show 5 when it launched in June 2019.",
    "The Amazon Echo Show 8 is priced at $129.99 / £119.99 / AU$199.00, which is the same price as the current iteration of the Echo Show 8 when it first went on sale in September 2019.",
    "Amazon is known for discounting its own devices throughout the year, especially during Amazon Prime Day and Black Friday, so we hope to see some discounts of these new smart displays later in the year.",
    "Both the new Amazon Echo Show 5 and Echo Show 8 retain the same design sported by the current versions: A color screen on the front, with a wedge-shaped back covered in fabric that houses the speaker.",
    "The Amazon Echo Show 5 unsurprisingly has a 5.5-inch screen with a resolution of 960 x 480, while the Echo Show 8 has an 8-inch display with a resolution of 1280 x 800.",
    "The Echo Show 5 is Amazon’s most compact smart display measuring 14.8 x 8.6 x 7.3, while the Echo Show 8 is only slightly larger at 20 x 13.59 x 9.91 - both will comfortably fit on a bedside table, or under a lamp in the sitting room.",
    "The Echo Show 8 is available in a choice of different colored fabrics; Charcoal, which is a dark grey, and Glacier White that’s well...white. The Echo Show 5 comes in both these colors along with a dark blue option.",
    "The Amazon Echo Show 5 (2021) retains the same 1-megapixel camera found on the first generation 5.5-inch Echo Show, while the Echo Show 8 (2021) has had a hefty camera upgrade and now sports a 13-megapixel camera - the same found in the Echo Show 10, in fact.",
    "The camera also has the same pan and zoom function as the Echo Show 10, which means during video calls you’ll always be in the centre of the frame, even if you move around during the call (a feature recently nabbed for the new iPad Pro 2021 as well).",
    "Both the cameras on the Echo Show 5 (2021) and the Echo Show 8 (2021) can also double as a home security camera, allowing you to check in on your property from the Alexa app when you’re not there - another feature that first debuted on the Echo Show 10.",
    "For those that are privacy-conscious, both new smart displays also have a physical camera and microphone switches that cut to the power to these features.",
    "When it comes to sound quality, the Echo Show 5’s more compact size is reflected in the sound quality too - it's 1.65-inch speaker isn’t as powerful as the Echo Show 8’s dual 2-inch speakers with passive bass radiator.",
    "However it’s unlikely either smart display will be used as the main listening device, so this isn’t really an issue and both speakers will suffice for some background music.",
    "The Echo Show 5 does have one ace up its sleeve - in the form of a 3.5mm audio out socket so you can connect an external speaker to boost the sound quality. Unfortunately there’s no audio out on the Echo Show 8, which is a little odd.",
    "When it comes to responding to your queries and commands, both the Amazon Echo Show 5 and Echo Show 8 are evenly matched as voice assistants. However, the size is the one key difference, and if you’re planning on using one of these models as a regular video calling device, the 13MP camera on the Show 8 is going to be a real draw, along with its much-improved speaker enhancement."
  ],
  "headers": {
    "2": "Best Amazon Echo Show deals",
    "3": "Price",
    "6": "Design",
    "10": "Camera",
    "14": "Speakers and microphones",
    "17": "Verdict",
    "18": "FAQ"
  },
  "links": {
    "new Echo Show 8": "https://www.techradar.com/reviews/amazon-echo-show-8-2nd-gen",
    "Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "new iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review"
  }
}