{
  "source": "https://www.techradar.com/news/gta-san-andreas-beat-saber-updates-and-new-games-announced-for-oculus-quest-2",
  "title": "GTA San Andreas, Beat Saber updates and new games announced for Oculus Quest 2",
  "category": "gaming",
  "updated": "2021-10-28T19:14:13Z",
  "author": "hamish-hector",
  "summary": "Meta announced several new games its Facebook Connect event",
  "article": [
    "Oculus Quest 2 owners will have plenty of new games to enjoy in 2022, as Facebook (now called Meta) announced several new titles coming in the near future that could be contenders for our best VR games list.",
    "Grand Theft Auto fans will be able to enjoy GTA San Andreas in an all-new way when it lands on the Oculus Quest 2. If Resident Evil 4 VR was anything to go by, the more realistic first-person perspective is sure to bring San Andreas to life in a way fans won't have experienced before.",
    "Beyond that, we saw a brief snippet of new Beat Saber content as well as hearing that Vertigo Games is working on five different titles for VR right now - including some set in worlds gamers might already recognise.",
    "For a full breakdown of everything announced at Meta's event read on.",
    "Arguably the most interesting announcement during Facebook Connect was that one of the PS2’s defining classics, Grand Theft Auto San Andreas is coming exclusively to Oculus Quest 2. We didn’t get any footage at the Facebook Connect event, but our mind races with the possibilities of what San Andreas will look and play like in VR, especially off the back of the tremendous Resident Evil 4 VR.",
    "Blade & Sorcery was arguably one of the first VR games to intelligently implement tactical melee combat into VR, and do so successfully. Now, the virtual reality stalwart is getting a sequel in the form of Blade & Sorcery Nomad, and it’s coming to Oculus Quest 2 later in 2021.",
    "This VR battle royale is one of the best Oculus Quest games and sees up to 24 players receive a new trailer during Facebook Connect. New events are coming throughout the year, including substantial ones in November and December. In the meantime, a new Halloween event will allow players to earn double EXP over the weekend of October 30 - 31.",
    "To say Beat Saber had a presence at Facebook Connect is perhaps giving it a bit too much credit. The new trailer showed off a brand new sword, and… well, that was about it. The developers have promised new content coming to the game throughout 2022 and beyond.",
    "The developer of VR hits like Arizona Sunshine and Unplugged are working on five new - unannounced - VR titles for Oculus Quest headsets. These games include “fan favorite game worlds from Deep Silver and others,” according to the Oculus blog post announcing the Facebook Connect titles.",
    "This could mean that projects Deep Silver has had ties to in the past, including Saints Row, Shenmue and Persona, might see the VR treatment sometime in the future. Although we wouldn’t hold our breath there, it does seem like at least some of these new VR titles will be tied to existing properties."
  ],
  "headers": {
    "4": "GTA San Andreas VR",
    "5": "Blade & Sorcery Nomad",
    "6": "Population One",
    "7": "Beat Saber",
    "8": "Vertigo"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "(now called Meta)": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
    "best VR games": "https://www.techradar.com/best/the-best-vr-games",
    "GTA San Andreas": "https://www.techradar.com/news/grand-theft-auto-san-andreas-is-in-development-for-oculus-quest",
    "Resident Evil 4 VR": "https://www.techradar.com/reviews/resident-evil-4-vr-review",
    "best Oculus Quest games": "https://www.techradar.com/news/best-oculus-quest-games"
  }
}