{
  "source": "https://www.techradar.com/news/unstoppable-domains-gives-back-over-dollar100m-in-credits-to-customers",
  "title": "Unstoppable Domains gives back over $100m in credits to customers",
  "category": "computing",
  "updated": "2021-06-16T11:31:58.136Z",
  "author": "abigail-opiah",
  "summary": "Also adds eight more Blockchain domains to its roster",
  "article": [
    "Blockchain domain registrar Unstoppable Domains will be airdropping over $100 million worth of promo credits to its customers and is set to launch eight new top-tier domain names.",
    "The company will begin airdropping credit to its loyal customers at Noon PDT on June 17, 2021 - giving three times promo credits for every dollar spent with Unstoppable Domains to date.",
    "As for the new domain names, in addition to the original .crypto and .zil, Unstoppable Domains will now offer a total of ten blockchain-based domain names for different communities and interests on the decentralized web.",
    "The company revealed that any domains purchased up until 9:00am PDT June 17 2021 will also qualify for 3x promo credits, including purchases of regular or premium domains.",
    "Unstoppable Domains customers will have the option to use the promotional credits on any domain extensions offered by the company within 60 days of issuance.",
    "Founded in 2018, Unstoppable Domains has grown to become the largest blockchain domain registry in the world. With domains that are now readable on over 500M installed browsers worldwide through integrations with top browsers like Brave and Opera.",
    "The eight new domains include: .blockchain, .bitcoin, .coin, .nft, .wallet, .x, .888, and .dao.",
    "Universal usernames using any of these domain endings will be available for pre-purchase from Unstoppable Domains from next week with prices starting at $20.",
    "“Each of these domain names comes with the Unstoppable Domains promise - users who buy them will own them forever with no renewal fees,” Unstoppable Domains said.",
    "“These domain names act as crypto wallet addresses that can be used to send and receive hundreds of cryptocurrencies across 50+ wallets and exchanges around the globe. This solves the problem of crypto going to the wrong address due to typos in longer, more complex addresses, which results in losing funds forever.”"
  ],
  "headers": {
    "3": "Premium domains"
  },
  "links": {
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "decentralized web": "https://www.techradar.com/news/vpn-vs-dpn-the-dawn-of-decentralized-web-privacy",
    "Brave": "https://www.techradar.com/reviews/brave-web-browser",
    "Opera": "https://www.techradar.com/reviews/opera-browser",
    "said": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3349954820405124600&xs=1&url=https%3A%2F%2Funstoppabledomains.com%2Fblog%2F100-million-airdrop-and-the-launch-of-8-new-domain-registries&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Funstoppable-domains-gives-back-over-dollar100m-in-credits-to-customers"
  }
}