{
  "source": "https://www.techradar.com/news/future-apple-homepod-could-double-up-as-an-interactive-vr-speaker",
  "title": "Future Apple HomePod could double up as an interactive VR speaker",
  "category": "audio-visual",
  "updated": "2021-04-14T11:45:37Z",
  "author": "gerald-lynch",
  "summary": "Microphones and positional audio working in tandem",
  "article": [
    "Apple may have discontinued its current line of full-size HomePod speakers, but that’s not to say the company isn’t still looking to the future of what its audio devices may be able to achieve. A newly-uncovered patent shows that Apple has ambitions for its smart speakers to potentially work alongside its rumored Apple VR headsets.",
    "The patent describes an audio speaker system that is equipped with additional microphones and depth-sensing cameras. In tandem, they’d be able to pinpoint a user’s position in a room, and tailor a 3D audio experience to suit what’s being seen in a virtual reality environment.",
    "From what we can gather from the patent, a user with one or more HomePods set up could enjoy adaptive and surrounding audio without the need for headphones or on-device speakers like what you see with the Oculus Quest headsets. Say there’s a virtual cat in your VR experience – walking towards it could increase the volume of its meow from a HomePod Mini, for instance.",
    "This would also work in two way communication applications – a user with a similar set up elsewhere could transmit their spatial audio information to another user in VR with the same set up, and both would be able to identify sound coming from the other in 3D space.",
    "The patent also goes to describe how this could be used for commercial purposes, and lays out how a recording and transmission system could be set up at a live music event, and beamed to a VR headset with the resulting spatial audio information.",
    "The rumor mill surrounding Apple VR hardware has been turning at full speed recently, with the Cupertino company’s long-brewing experiments in the virtual reality space seemingly starting to bear fruit.",
    "If supply chain rumors and analyst reports are to be believed, Apple is investigating both virtual reality and augmented reality headsets and wearables, with the former being close to being officially revealed. The upcoming WWDC 2021 event, Apple’s annual developer showcase, had an invite that even teased augmented reality will be on the agenda. With Apple keen to keep the synergy and inter-reliance between its product ecosystem, it makes sense that it’s now looking at new ways to bring its audio and potential VR and AR gear together.",
    "Via Patently Apple"
  ],
  "headers": {
    "2": "How it could work",
    "5": "VR futures"
  },
  "links": {
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "newly-uncovered patent": "https://www.patentlyapple.com/patently-apple/2021/04/apple-wins-a-patent-for-a-next-gen-homepod-with-depth-cameras-and-a-microphone-array-for-virtual-reality-communication-apps.html",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "Apple VR": "https://www.techradar.com/news/apple-vr-headset",
    "3D audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "HomePod Mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "WWDC 2021": "https://www.techradar.com/news/apple-glass-is-what-wwdc-2021-needs",
    "Patently Apple": "https://www.patentlyapple.com/patently-apple/2021/04/apple-wins-a-patent-for-a-next-gen-homepod-with-depth-cameras-and-a-microphone-array-for-virtual-reality-communication-apps.html"
  }
}