{
  "source": "https://www.techradar.com/news/best-n64-games",
  "title": "The best N64 games: Mario, Zelda, Perfect Dark and more",
  "category": "gaming",
  "updated": "2021-06-23T12:45:51Z",
  "author": "gerald-lynch",
  "summary": "The best N64 games ever, from Super Mario 64 to The Ocarina of Time",
  "article": [
    "On the hunt for the best N64 games of all time? Then you've landed on the right page. When it was first released in 1996, the N64 stood apart from the console crowd with its commitment to cartridges, ground-breaking controller and, most importantly, its games. N64 games were among the best of their generation and many of them still hold up to modern scrutiny, while even more remain a source of comforting nostalgia.",
    "Sure, comparatively there weren’t a huge number of N64 games released but they were high quality and some of them made such an impression that their franchises and characters are still going today.",
    "Titles like Super Mario 64 and Banjo-Kazooie still loom large in the memories of plenty of gamers and there are continued calls for other games that called the console home, like Pokémon Snap, GoldenEye and Perfect Dark, to receive remakes or reboots - some have even been confirmed.",
    "So, whether you’re simply looking to bask in nostalgia or you’re putting together a wish list of titles you hope might one day become available on Nintendo Switch Online, these are the best N64 games that you just can't afford to miss.",
    "In some ways, the N64 was a little too reliant on Zelda and Mario – an extended software drought meant the console went months at a time without any big hitters. Nonetheless, Ocarina of Time was well worth waiting for. This long, packed adventure game translated everything great about the 2D Zelda games into 3D, including the dungeons, tools, the series' iconography and the sense of scale in its world.",
    "It's hard to imagine modern open-world games even looking the same without those first moments stepping out onto Hyrule Field. It's still a classic, even if playing it on 3DS is the way to go these days.",
    "The daddy of 3D platformers. Heck, the daddy of 3D gaming, full stop. A true game-changer, when Mario made the jump to 3D with the N64’s then-innovative analog stick in tow, it was not only the evolution of the portly plumber, but of games as a whole.",
    "Now more than 20 years old, it still stands up as a joy to play thanks to Nintendo’s water-tight control scheme and solid camera management options, which had been notoriously troublesome to nail in the early days of 3D gaming. Packed with interesting things to do and secrets to unearth, it has that Nintendo magic touch, in that every task it sets you is enjoyable in its own right. It’s just surprising that it took the launch of the Nintendo Switch before Nintendo would return to the ‘free roaming’ format with Super Mario Odyssey.",
    "Released almost two years after the Pierce Brosnan Bond movie it was based on hit cinemas, GoldenEye popularized first-person shooter games on consoles, particularly with its local multiplayer competitive mode. Its single-player campaign, which sometimes adapts just a few seconds of the film into dense levels packed with secrets, was fantastic.",
    "But it was GoldenEye's multiplayer that made the N64 the centerpiece of any gathering of friends. Licence to Kill, slaps. DK mode. So much about this game entered the popular vernacular. Now it just needs a proper remaster.",
    "By no means the best in the series – that's still up for debate, though the modern Switch version is the most comprehensive – it's hard to explain the sheer novelty of seeing Mario, Link, Pikachu, Samus Aran and more in a single game back in the late '90s. It was so exciting.",
    "The original Smash Bros is an incredibly light affair compared to later offerings in its selection of fighters and levels, and good god Kirby is OP in this one. But its multiplayer was yet another great use of those four controller ports on the N64.",
    "What may look like a pantomime in the ring was turned by THQ into a chunky brawler in WWF Wrestlemania 2000. Remaining one of the best wrestling games ever, it was slightly slower than the likes of WWF Attitude, focusing on light and heavy grapples that would become battles to pull off moves and counter-attacks.",
    "In terms of pacing, nothing else has quite managed to give the impression that you’re taking part in a legitimate wrestling match, spectacle and all, as WWF Wrestlemania 2000. Its follow-up, No Mercy, is also well worth a look.",
    "In retrospect, it may be one of the weaker Mario Kart games. But just by having that Nintendo mascot-powered core, it’s still head and shoulders above the copycat kart racers that the series inspired. Mario Kart 64 took full advantage of the N64’s four controller ports, making for a riotous local multiplayer experience.",
    "The PC had the X-Wing and TIE Fighter intergalactic flight sim series, but it wasn’t until Rogue Squadron did console gamers feel the full force of the Star Wars films’ aerial combat. Sure, we had a taste of it with ambitious-if-janky launch title Shadows of the Empire’s opening Hoth battle, but Rogue Squadron took it to new heights.",
    "A lengthy, challenging campaign that puts you in control of a fleet of classic Star Wars ships, it had some great unlockable secrets and a fantastic medals system that made for high replayability.",
    "One of the few Nintendo 64 games to require the RAM-injecting expansion pack add-on, Donkey Kong 64 was the zenith of the late-'90s obsession with platforming collectathons (arguably to the point of overkill, in fact). Putting everything it had learned on the console thus far into one giant simian-themed adventure, it gave you expansive levels to explore, five different Kongs to control (each with their own unique skillsets) and even a reasonably well-executed multiplayer shooter mode.",
    "Mario may have been the mascot for Nintendo, but Rare’s Banjo and Kazooie gave him a run for his money when it came to pure joyous gameplay. Colorful, inventive and with densely-packed levels, Banjo Kazooie found a good balance between tight 3D platforming and the era’s collect-all-the-things gameplay model.",
    "The Bond license escaped Nintendo after GoldenEye, leading to the dreadful Tomorrow Never Dies from EA on PSone. Rare instead decided to make a spiritual successor called Perfect Dark, which had an entirely different fictional setting, and a lot more sci-fi weaponry.",
    "Otherwise, it felt comfortably similar, and its multiplayer was unbeatable – it even carried a few of the better maps from GoldenEye across, under different names. Another important, influential addition to Perfect Dark was the option to add AI bots to multiplayer, giving you the option to play this part of the game without friends.",
    "If Mario Kart was about the power-ups, F-Zero X was about pure sci-fi speed. Remaining one of the fastest-feeling racers to this day, it took the SNES game’s 2D sprites and tracks, reimagining them as twisting, turning, gravity-defying roller coasters. A series that’s well overdue a return.",
    "This is the best Pokémon game. No, seriously, stay with us! Rather than having to catch-'em-all, you’ve got to snap-'em-all. It is, essentially, an on-rails first-person shooter, except your AK is swapped out for a Polaroid, and your enemies are little cute portrait subjects. Though it’s a short game as you simply take photos of the Pokémon out in the wild, being rendered in 3D (a novelty at the time) proved to be a big sell, as you used a number of lures and gadgets to coax rare Pokémon out of hiding and to perform their most photogenic poses.",
    "This N64 classic has been given a new lease of life thanks to New Pokémon Snap on the Switch - but it's not quite as impressive.",
    "Mario is no stranger to jumping into different genres, but it was irregular to see him in an RPG during the N64 era. Paper Mario takes a few cues from Super Mario RPG on the SNES, fleshing out the Mushroom Kingdom in a way the platform games couldn’t, but also introduced a smart new aesthetic that saw Mario transformed into a 2D cutout – with some clever puzzle elements using the perspective along the way.",
    "The N64 had three Mario Party games, and you can take your pick as to which was actually the best – there's not a lot in it. But the series made good use of the console's ability to support four controllers, getting players to compete at a whole slew of minigames to see who was the best or the fastest.",
    "Those N64 controllers took a lot of damage during more intense multiplayer showdowns, and these days the series has little credibility. But this once again cemented the N64 as the place to enjoy multiplayer with friends.",
    "Largely considered the only good thing to come out of The Phantom Menace other than Duel of the Fates, Episode I: Racer is basically an easier version of WipEout set on various Star Wars worlds.",
    "Tatooine gets well-represented, of course, with both a training track and the Boonta Eve race seen in the movies. But it's being able to customize your racer that makes journeying through this game such a treat. It's a racing game for people who don't usually enjoy them.",
    "Skateboarding is hard – just ask anyone who has ever worn a pair of Vans and scrapped a knee while listening to The Offspring. But Tony Hawk’s Pro Skater not only made a cool sport seem easy, it made it cooler.",
    "Stringing together impossibly intricate trick runs around outlandishly imaginative skateparks, no kid that played Tony Hawk’s Pro Skater didn’t end up with a real-life skateboard on their Christmas lists. And the soundtrack was banging, too.",
    "If Ocarina of Time is Star Wars, then Majora’s Mask is The Empire Strikes Back. An inventive remixing of the cast and locations of Ocarina of Time, Majora’s Mask may reuse assets from that first 3D adventure but has a dark attitude all of its own.",
    "Using a wild Groundhog Day-like time-turning conceit that sees you working against the clock to prevent the end of the world, it’s the wackiest and (at times) most unsettling Zelda there’s ever been. A cult classic.",
    "This third-person arcade shooter is still the best of the Star Fox games. It's essentially Star Wars with talking animals, and with multiple paths across the game, you have to replay it a bunch of times to see every stage.",
    "Levels vary from Death Star-style space stations to lava-spitting fire planets, and it's easy to finish a run in a single sitting. The 3DS offers the best version of Star Fox 64, but no N64 collection is complete without it.",
    "A bizarre puzzle-action game that saw developer Rare at perhaps its most inventive, Blast Corps saw you take on the role of a wrecking crew that has to carve a path for an explosives-laden truck to pass through. Using a menagerie of vehicles and robots, this would see you leveling cities and towns, crashing mechs and digger trucks into buildings, to protect your cargo.",
    "Challenging and addictive for anyone that’s ever fancied themselves as a demolitions expert – or a Godzilla wannabe.",
    "Having made some of the console’s most cutesy platformers, Rare let its devilish British humor shine through with Conker’s Bad Fur Day. Yes, it was essentially another (ace) 3D platforming collect-a-thon in the same mould as Banjo-Kazooie, but Conker was so ridiculously crude that it came with a warning on the box.",
    "He may have looked cute, but Conker was a randy badass. Come for the poop jokes, stay for the solid platforming action."
  ],
  "headers": {
    "4": "The Legend of Zelda: Ocarina of Time",
    "6": "Super Mario 64",
    "8": "GoldenEye 007",
    "10": "Super Smash Bros.",
    "12": "WWF Wrestlemania 2000",
    "14": "Mario Kart 64",
    "15": "Star Wars: Rogue Squadron",
    "17": "Donkey Kong 64",
    "18": "Banjo-Kazooie",
    "19": "Perfect Dark",
    "21": "F-Zero X",
    "22": "Pokémon Snap",
    "24": "Paper Mario",
    "25": "Mario Party",
    "27": "Star Wars Episode I: Racer",
    "29": "Tony Hawk’s Pro Skater",
    "31": "The Legend of Zelda: Majora’s Mask",
    "33": "Star Fox 64/Lylat Wars",
    "35": "Blast Corps",
    "37": "Conker’s Bad Fur Day"
  },
  "links": {
    "Pokémon Snap": "https://www.techradar.com/news/new-pokemon-snap",
    "Perfect Dark": "https://www.techradar.com/news/perfect-dark-trailer-at-game-show-awards-shows-joanna-dark-is-back",
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Mario Odyssey": "https://www.techradar.com/news/super-mario-odyssey-review",
    "New Pokémon Snap": "https://www.techradar.com/reviews/new-pokemon-snap-review"
  }
}