{
  "source": "https://www.techradar.com/news/pick-up-the-stress-busting-fitbit-sense-and-get-the-lenovo-smart-clock-free-right-now",
  "title": "Pick up the stress-busting Fitbit Sense and get the Lenovo Smart Clock free right now",
  "category": "wearables",
  "updated": "2021-01-26T11:59:25Z",
  "author": "cat-ellis",
  "summary": "A powerful smartwatch and smart speaker bundled together",
  "article": [
    "Right now at Best Buy, you can grab the Fitbit Sense smartwatch and get a Lenovo Smart Clock free of charge. That's $329.95 for both devices – a saving of $79.99 compared to buying them separately.",
    "The Fitbit Sense is the company's most powerful smartwatch to date. It's capable of tracking your steps throughout the day, measuring your heart rate at rest and during exercise, tracking workouts with its on-board GPS, and making contactless payments via Fitbit Pay – but that's not all.",
    "Place your palm over the face for one minute, and the Sense will use your skin's conductivity to estimate your stress levels. This will be logged automatically in the Fitbit app, where you can add notes about any factors that might have affected your feelings. You can also check your heart health with the Fitbit Sense's ECG feature, which checks your heart rhythm for signs of potentially dangerous atrial fibrillation.",
    "If you live outside the US, scroll down for the best Fitbit Sense deals near you.",
    "The Lenovo Smart Clock is, as the name suggests, an alternative to your regular alarm clock, and is designed to sit comfortably on your nightstand (there's no camera, in the interests of privacy).",
    "Despite its small size, it's just as capable of controlling your smart home as any smart speaker thanks to its Google Home integration. Set it up through the Google Home app, and you'll be ready to issue voice commands. Just say 'OK Google' and it'll start listening.",
    "In our review, we were impressed by its sunrise alarm, which helps wake you more gently than audio, and although it lacks some features you'll find in larger devices (such as a YouTube video player) it's a great addition to your bedroom – and even more so when it's free.",
    "Outside the US? Here are the best Fitbit Sense deals near you."
  ],
  "headers": {},
  "links": {
    "grab the Fitbit Sense smartwatch and get a Lenovo Smart Clock free of charge": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-2964482158039883000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fpromo%2Ffitbit-sense-gift-with-purchase&article_name=Pick%20up%20the%20stress-busting%20Fitbit%20Sense%20and%20get%20the%20Lenovo%20Smart%20Clock%20free%20right%20now&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fpick-up-the-stress-busting-fitbit-sense-and-get-the-lenovo-smart-clock-free-right-now",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "the Fitbit Sense's ECG feature": "https://www.techradar.com/news/fitbit-sense-ecg-update-lets-it-check-your-heart-rhythm-for-irregularities",
    "Lenovo Smart Clock": "https://www.techradar.com/reviews/lenovo-smart-clock-review",
    "our review": "https://www.techradar.com/reviews/lenovo-smart-clock-review"
  }
}