{
  "source": "https://www.techradar.com/news/upcoming-zte-axon-30-pro-smartphone-will-sport-a-whopping-200mp-camera",
  "title": "Upcoming ZTE Axon 30 Pro smartphone will sport a whopping 200MP camera",
  "category": "phones",
  "updated": "2021-02-01T09:17:01Z",
  "author": "aakash-jhaveri",
  "summary": "Where do we stop?",
  "article": [
    "Ever since the unveiling of the Qualcomm Snapdragon 888 chipset in December last year, smartphone manufacturers have been busy trying to win a share of the attention by teasing their upcoming flagship products. Joining the fray, we have the ZTE Axon 30 Pro that is now expected to launch with a 200MP camera.",
    "Ni Fei, ZTE's president took to Weibo (a Chinese social networking site) to talk about the upcoming ZTE Axon 30 Pro and, more specifically, its camera. He confirmed that the upcoming smartphone will be able to shoot photos with a resolution of 200MP or over 2.7 billion pixels.",
    "It will also be capable of capturing photos in low-light scenarios that are as dark as 0.1 lumens. It'll also feature 4K HDR video recording and 10-bit color support.",
    "The post also mentions the use of the Spectra 580 image signal processor and the Snapdragon 888. This will be a significant change over the ZTE Axon 20 from last September as that phone was powered by the mid-range Snapdragon 765G.",
    "Another leak on Weibo shed some more light on the camera sensor, but note that this information doesn't come directly from the company's president.",
    "It is expected to implement the S5KGND image sensor from Samsung, which is yet to be announced but not unexpected as leaks have given us some information on the tech.",
    "It is said to have a diagonal size of 1/1.37-inches, allowing it to shoot 50MP images at 0.64μm with quad-pixel-binning and 12.5MP images at 1.28μm with 16-in-1 pixel binning. It’s unclear if it will also be capable of shooting at the full 200MP resolution, as that would mean shifting to a pixel size of just 0.16μm — the smallest on any camera phone by quite a margin, leading to lower light sensitivity.",
    "Just like its predecessor, the ZTE Axon 30 Pro is also likely to sport an under-display selfie camera. Now in its second iteration, it remains to be seen how much better it gets as the maiden attempt was not really great. Similarly, there will be obvious questions over the need for such a high-resolution camera when some of the best camera phones continue to use 12MP sensors.",
    "ZTE is yet to confirm the Axon 30 Pro launch date, but we expect it to be in the coming months itself.",
    "Via GSMArena, GizmoChina"
  ],
  "headers": {},
  "links": {
    "Snapdragon 888": "https://www.techradar.com/news/snapdragon-888-phones-in-india-everything-you-need-to-know",
    "Weibo": "https://m.weibo.cn/detail/4598749115193153",
    "ZTE Axon 20": "https://www.techradar.com/news/zte-axon-20-5g-with-an-under-display-camera-is-now-official",
    "not unexpected": "https://www.techradar.com/news/forget-108mp-camera-samsung-tipped-to-launch-a-200mp-sensor-this-year",
    "the best camera phones": "https://www.techradar.com/news/best-cameraphone",
    "GSMArena": "https://www.gsmarena.com/zte_axon_30_pro_might_come_with_samsungs_200mp_sensor-news-47475.php",
    "GizmoChina": "https://www.gizmochina.com/2021/01/29/zte-axon-30-pro-5g-will-be-the-first-flagship-with-the-second-gen-under-display-cam/"
  }
}