{
  "source": "https://www.techradar.com/news/the-suicide-squad-game-could-succeed-where-marvels-avengers-failed",
  "title": "The Suicide Squad game could succeed where Marvel’s Avengers failed",
  "category": "gaming",
  "updated": "2021-10-18T17:00:16Z",
  "author": "rhys-wood",
  "summary": "Opinion: Rocksteady’s chaotic return could be the perfect tonic after Marvel’s Avengers",
  "article": [
    "Developer Rocksteady is no stranger to DC, particularly when it comes to the Caped Crusader. Having developed three of the four titles in the Batman: Arkham quadrilogy (Asylum, City and Knight), it’s easy to think that the upcoming Suicide Squad: Kill the Justice League is in safe hands at the London-based studio.",
    "Arriving sometime in 2022 for PS5, Xbox Series X/S and PC, Suicide Squad: Kill the Justice League’s recent story trailer gave us our best look yet at the upcoming anti-hero action adventure, featuring an ensemble of iconic characters much like we saw with last year’s Marvel’s Avengers, developed by Crystal Dynamics and Square Enix.",
    "The key difference, though, is that (in a polar opposite effect to DCEU vs MCM movies) judging from the story trailer, Suicide Squad: Kill the Justice League seems to have all the gusto and energy that Marvel’s Avengers lacked. Not only that, but the performances given by DC’s anti-heroes here outmatches what we’ve seen in the upcoming Guardians of the Galaxy video game.",
    "Before I get too ahead of myself, no, we haven’t yet seen any gameplay for Suicide Squad: Kill the Justice League. It could very well disappoint, much in the same way the 2016 Suicide Squad movie did. However, the James Gunn-directed The Suicide Squad was arguably the much-needed shot in the arm the franchise needed.",
    "Throw in that Rocksteady is responsible for three of the best superhero games, well, ever, along with a revolutionary combat system that snuck its way into countless other titles (yes, even fantastic ones like Insomniac’s Spider-Man), and I simply find it hard to believe that the developer will mess this one up.",
    "What we do know so far is that Suicide Squad: Kill the Justice League will feature at least a somewhat similar structure to the Arkham games, being set in an open-world Metropolis. The big difference here is that instead of skulking around in the shadows as The Bat, you’ll very much be on the front lines as Harley Quinn, Captain Boomerang, Deadshot and/or King Shark.",
    "The game can be played with up to four players cooperatively, but if you’re flying solo, you’re able to switch between characters seemingly at will. This is already a step above what we’ve seen with Guardians of the Galaxy, where Star Lord seems to be the only player-controlled character – his friends ready to simply jump in and perform an ability on command.",
    "The ability to switch between characters, then, is pretty huge for this type of big-budget, hero-centric action game, and certainly gives me Marvel: Ultimate Alliance vibes. Getting bored caving in skulls with Harley’s bat? Switch off to King Shark for something a bit more brutal.",
    "We imagine, too, that much like the Arkham games, we’ll often have to pick the best tools and abilities for the job in Suicide Squad: Kill the Justice League, in which quick-swapping between characters could become integral to its gameplay.",
    "We may as well be honest, “Kill the Justice League” is nothing if not an eyebrow-raising subtitle. Are we really going to be offing DC’s most iconic heroes like Superman, Green Lantern and The Flash? And if so, why? Well, the story trailer keeps things unsubtle, which is pretty on-brand for the Suicide Squad.",
    "While DC’s most vicious villains and anti-heroes likely want nothing more than to put the Justice League in their place, something certainly seems off about them in the trailer. They look overtly corrupted, as we clearly see thick, dark veins crawling through both Superman and The Flash, likely a result of Brainiac’s powerful influence.",
    "As such, it should be fairly safe to assume that killing the Justice League isn’t just to the benefit of A.R.G.U.S. or Harley and pals, as it probably isn’t wise to leave a Brainiac-controlled group of ultra-powered heroes unchecked.",
    "This feud isn’t the only thing that seems to be happening in Suicide Squad’s story, though, as we’re also treated to appearances from Gizmo and The Penguin (who’s certainly had better days).",
    "Perhaps most interesting is that Wonder Woman appears to be the only member of the League that’s remained incorrupt. The trailer shows Diana both helping and sparring with the Squad. It’ll be interesting to see if she’s able to swallow her pride and work with Harley and friends throughout the game.",
    "Lastly, the one member of the League absent from the trailer (understandably) is Batman. If Kill the Justice League is to be a continuation from the events of Arkham Knight, then the game will have some explaining to do, as (spoilers for Arkham Knight ahead!) things didn’t exactly look too peachy for Bruce at the end of the game.",
    "As I mentioned earlier, I remain tentatively excited for Suicide Squad: Kill the Justice League. Sure, we’ve not seen any gameplay as of yet, but the in-engine story tidbits we’ve seen so far get me far more pumped than the efforts on the Marvel side have.",
    "Marvel’s Avengers had tons of potential. After all, who doesn’t want to wreak havoc as Earth’s mightiest heroes? Unfortunately, the game failed to capture the effervescence of the MCM, and a muddled live service model served only to turn people away from what could have been a simple yet satisfying superheroic AAA brawler.",
    "Similarly, Guardians of the Galaxy just isn’t doing it for me. Sure, the environments look pretty imaginative, but the gameplay, performances and the overall script have fallen flat in the abundance of trailers the game’s had up to this point. Still, as it’s not out yet, I’m more than happy to be proven wrong as to whether or not Square Enix’s next Marvel effort will entertain.",
    "Suicide Squad, on the other hand, looks to be absolutely nailing the tone of James Gunn’s big screen offering. It’s fast-paced, doesn’t know when to slow down, and keeps the deliciously edgy humor running throughout. And for a group of dysfunctional anti-heroes, I can’t really ask for anything more than that."
  ],
  "headers": {
    "3": "Addressing the mutated shark in the room",
    "9": "How about that subtitle?",
    "15": "Lots to look forward to, then?"
  },
  "links": {
    "DC": "https://www.techradar.com/how-to/how-to-watch-the-dceu-movies-in-order",
    "Batman: Arkham": "https://www.techradar.com/news/batman-arkham-asylum-is-10-rocksteady-founders-on-the-genre-defining-superhero-game",
    "Suicide Squad: Kill the Justice League": "https://www.techradar.com/news/suicide-squad-game",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Marvel’s Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "DCEU": "https://www.techradar.com/news/dc-extended-universe-movies-ranked",
    "MCM movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Guardians of the Galaxy": "https://www.techradar.com/reviews/marvels-guardians-of-the-galaxy",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "Spider-Man": "https://www.techradar.com/news/spider-man-review",
    "Wonder Woman": "https://www.techradar.com/news/wonder-woman-3-is-coming-after-ww84-hbo-max-stream-proves-a-big-success"
  }
}