{
  "source": "https://www.techradar.com/news/8-new-diablo-immortal-features-to-know-about-ahead-of-the-android-closed-beta",
  "title": "8 new Diablo Immortal features to know about ahead of the Android closed beta",
  "category": "gaming",
  "updated": "2021-10-28T15:00:39Z",
  "author": "gerald-lynch",
  "summary": "Mash those pads and clear those dungeons in the new Diablo Immortal beta",
  "article": [
    "From a rather rocky first reveal, Diablo Immortal has slowly become one of the most hotly anticipated games on the horizon – definitely from a mobile perspective, at least. And with a fresh closed beta kicking off today for Android (an iOS version is also in the works), developer Blizzard has revealed lots more to be excited about ahead of the game’s ‘early 2022’ release.",
    "For the uninitiated, this is Diablo Immortal’s second beta testing phase after a long alpha period getting feedback from players on an early version of the game. Diablo Immortal looks to squeeze the full Diablo action RPG gameplay (kill baddies, clear dungeon, collect loot, become addicted, repeat), to mobiles in a free-to-play format, with more live service features than the series has previously had, and with an even greater emphasis on multiplayer. This will be as close as Diablo has ever come to being an MMO, and a mobile title to finally sweep the floor with the dozens of Diablo clones clogging up phone app stores.",
    "Here are 8 new things you need to know about Diablo Immortal, ahead of its closed beta launch on Android devices later today.",
    "Got an Xbox controller lying around? Or a PS4 Dualshock pad handy? Or even the Razer Kishi mobile controller? You’ll be able to use them to play Diablo Immortal on the go. Now, to be clear, at this stage controller support is listed as “limited” by Blizzard. That’s not just in the number of compatible controllers at this stage (which includes the Xbox Series X but not the PS5 DualSense gamepad), but also the fact that certain interface elements, such as menus, remain touchscreen-controlled only. But it’s a step towards a more comfortable way of playing for those not into touchscreen play.",
    "A fan-favorite character class, the Necromancer makes its debut in Diablo Immortal as part of this closed beta session. It joins the Barbarian, Crusader, Demon Hunter, Monk and Wizard as the playable classes revealed so far, and will continue in the classic Necromancer tradition of letting players raise an army of the dead to fight alongside them. Don't worry: we'll see more classes from the Diablo franchise return, as well as new, never-before-seen classes in Diablo Immortal, game devs Wyatt Cheng and Caleb Arseneaux confirmed in a recent Q and A session – though they couldn't speak to which will arrive first, or when.",
    "Now this is really cool. Players of the previous beta will be aware of a mode called the Cycle of Strife which has players forming a faction called the Shadows, taking on high-level challenges against an elite and exclusive enemy faction called the Immortals. The process to unseat the Immortals and take their throne now has a new endgame, culminating in a battle called the Rite of Exile, in which 30 Shadows take on 1 player who has been assigned as the Immortal.",
    "The Immortal then becomes a boss-sized bad guy with new skills, fighting to retain their dominant position. Should the Immortal be beaten, the Shadows themselves then duke it out to see who will be crowned the new Immortal. It’s basically a fight to become the king of the server, a position one will have to be ready to defend at a moment’s notice.",
    "If you want to prove yourself as the best-of-the-best in Diablo Immortal’s PvP modes, you’ll now appreciate ladder rankings coming to the 8v8 Battlegrounds competitive section of the game. Class balances have been applied to make PvP battles fairer since the first beta test, too.",
    "For those in the end game grind, a new secondary gear system, Set Items, is being introduced. Fans of the franchise will recognize the green-tinged equipment with exotic looks and lore, but in Diablo Immortal, they've been carefully assigned to inventory slots that won't overlap with your favorite skill-granting legendary items.",
    "Set pieces for hands, feet, neck, waist, and the two ring slots will drop as dungeon rewards, and players will be able to loot them if three and six set pieces are being worn at the same time. The more pieces you have, the more powerful the stacked bonuses conferred on your armor set become.",
    "An endgame PVE activity for groups, Helliquary Raids are among the toughest content in the game, and will now scale to support as many as eight co-operative players at a time. Offence rating and defense rating recommendations for taking on this content will be shown, letting you judge when the time is right to enter into these challenging scenarios.",
    "Being a free-to-play game, Diablo Immortal was always going to feature microtransactions of some sort. This beta will implement the store for the first time, letting players try out promotional item bundles, an Empowered Battle Pass and Eternal Orbs. A few things worth noting here – all purchases are optional and will not be required to progress in the game, and anything purchased in the beta will not carry over to the final game. Instead, any money spent will be converted into account credit to be spent in the full Diablo Immortal game when it launches.",
    "While it won’t be ready in time for the closed beta, cross save support will be available for Diablo Immortal, with character states saved via a player’s Battlenet account. So, if you’ve got an Android phone and an iOS iPad tablet, for instance, you’ll be able to play as the same character on both systems when the full game arrives."
  ],
  "headers": {
    "3": "Controller support is being added",
    "4": "Introducing the Necromancer",
    "5": "Become the battle royale boss",
    "7": "Ladder rankings",
    "8": "Set Items and bonuses",
    "10": "Helliquary Raids are now fully fledged 8-player raids",
    "11": "In-game purchases added",
    "12": "Cross save incoming"
  },
  "links": {
    "Diablo Immortal": "https://www.techradar.com/news/diablo-immortal-release-date-news-trailers-phones",
    "early version": "https://www.techradar.com/news/ive-played-diablo-immortal-how-blizzards-dark-action-rpg-plays-on-smartphones",
    "MMO": "https://www.techradar.com/news/diablo-immortal-will-be-a-mobile-mmo-developers-reveal-at-blizzcon-2021",
    "Razer Kishi": "https://www.techradar.com/reviews/razer-kishi"
  }
}