{
  "source": "https://www.techradar.com/news/qualcomm-poised-to-swoop-if-dollar40bn-nvidia-arm-deal-crumbles",
  "title": "Qualcomm poised to swoop if $40bn Nvidia-Arm deal crumbles",
  "category": "computing",
  "updated": "2021-06-14T15:36:33Z",
  "author": "joel-khalili",
  "summary": "Another twist in Nvidia’s quest to acquire semiconductor designer Arm",
  "article": [
    "US chipmaker Qualcomm has announced it is willing to invest in semiconductor designer Arm, in the event the latter's $40 billion takeover deal with Nvidia falls through.",
    "Unlike Nvidia, which is attempting to purchase Arm outright, Qualcomm has said it would club together with a consortium of industry players to purchase a stake in Arm, if current owner SoftBank is willing to float the British firm.",
    "“If Arm has an independent future, I think you’ll find there is a lot of interest from a lot of the companies within the ecosystem, including Qualcomm, to invest in Arm,” said Cristiano Amon, soon-to-be Qualcomm CEO.",
    "“If it moves out of SoftBank and goes into a process of becoming a publicly-traded company, [with] a consortium of companies that invest, including many of its customers, I think those are great possibilities,” he said.",
    "Nvidia, for its part, has dismissed the idea of an IPO as counter-productive. According to a spokesperson, a public listing would only hamper Arm’s ability to innovate as it enters a pivotal new phase.",
    "“To grow and meet the demand of the AI era, Arm needs much more than an IPO. Arm needs an infusion of new technology that it can provide to Arm licensees everywhere, which is why we stepped up and agreed to buy Arm,” said Nvidia.",
    "The acquisition of Arm by Nvidia has been anything but smooth sailing since it was announced in September 2020, with various regulators and industry players (Google, Qualcomm, Microsoft and more) making their opposition crystal clear.",
    "Arm processor architecture is found in the vast majority of mobile devices and an increasing number of computers, providing the foundations for chips manufactured by the likes of Apple, Samsung , Intel and, indeed, both Qualcomm and Nvidia.",
    "The main concerns are that Arm will no longer maintain its manufacturer-neutral stance post-acquisition and that the company’s R&D activity might be skewed in such a way that benefits Nvidia most.",
    "With these issues in mind, the US Federal Trade Commission (FTC), UK Competitions and Markets Authority (CMA) and European Commission have all launched investigations into the deal. The UK government is also looking into potential national security issues that may arise as a result.",
    "Adding a further layer of complexity is the internal battle being waged at Arm for control over its Chinese branch. Arm fired Allen Wu, its China CEO, in June last year over perceived conflict of interest, but Wu has refused to vacate his position. Since then, the China unit has filed lawsuits against three executives chosen by the Arm board to replace Wu.",
    "This cocktail of factors has led to speculation over the viability of the acquisition, perhaps opening the door for a company such as Qualcomm to invest via an alternate route.",
    "Via City AM"
  ],
  "headers": {
    "6": "Arm acquisition"
  },
  "links": {
    "$40 billion takeover deal with Nvidia": "https://www.techradar.com/news/uk-government-intervenes-in-nvidias-dollar40bn-arm-takeover",
    "computers": "https://www.techradar.com/news/best-business-desktop-pcs",
    "US Federal Trade Commission": "https://www.techradar.com/news/nvidias-dollar40-billion-arm-acquisition-has-hit-a-speedbump",
    "UK Competitions and Markets Authority": "https://www.techradar.com/news/nvidia-arm-deal-under-investigaton-by-uk-watchdog",
    "European Commission": "https://www.techradar.com/news/eu-will-investigate-nvidia-takeover-of-arm",
    "internal battle being waged at Arm": "https://www.techradar.com/news/arm-sacks-china-boss-over-secret-cayman-islands-activity-but-he-wont-leave",
    "City AM": "https://www.cityam.com/qualcomm-ready-to-swoop-on-arm-if-40bn-nvidia-deal-is-blocked/"
  }
}