{
  "source": "https://www.techradar.com/news/new-samsung-ssd-offers-businesses-maximum-capacity-longer-lifespan",
  "title": "New Samsung SSD offers businesses maximum capacity, longer lifespan",
  "category": "computing",
  "updated": "2021-06-02T10:36:44Z",
  "author": "balakumar-k",
  "summary": "Samsung PM1731a features Zoned Namespace (ZNS) tech",
  "article": [
    "Samsung has unveiled a new enterprise SSD featuring Zoned Namespace (ZNS) technology that is says offers significant steps forward in power and longevity.",
    "The company claims that the Samsung PM1731a aims to maximize available user capacity and offer longer lifespan in storage server, data center and cloud computing environments.",
    "Built upon Samsung’s sixth-generation V-NAND, the 2.5-inch PM1731a will come in two terabyte (TB) and four TB models. The new SSDs will feature dual ports, ensuring the drive is fully accessible for continuous operations and minimizing downtime - essential for enterprises and public cloud companies that cannot afford any pause in the continuity of their businesses.",
    "The improved SSDs will enable enterprise customers to handle big data and artificial intelligence applications with much greater efficiency, Samsung said.",
    "“Samsung’s ZNS SSD reflects our commitment to introducing differentiated storage solutions that can substantially enhance the reliability and lifetime of server SSDs,” said Sangyeun Cho, senior vice president of the Memory Software Development Team at Samsung Electronics.",
    "The company is hoping the new releases will help to expand the ZNS ecosystem. It is making ZNS available to xNVMe, which offers software libraries and tools to improve the performance of NVMe devices, as well as taking part in the Storage Performance Development Kit (SPDK) community created by Intel, hopefully meaning SPDK users can implement ZNS more easily in the future.",
    "ZNS technology keeps data in groups based on their usage and access frequency, and stores them sequentially in independent zones within an SSD. So, ZNS SSDs can significantly reduce the amount of data rearrangement operations.",
    "“This will make the drive last up to four times longer than conventional NVMe SSDs, making it a greener, more sustainable solution for server infrastructure,” the company claimed.",
    "ZNS also allows users to take advantage of the SSD’s full capacity by eliminating the need for overprovisioning, which would have required reserving some storage space for background tasks, it added.",
    "Samsung is hoping to mass-produce its ZNS SSDs in the second half of the year."
  ],
  "headers": {
    "5": "Samsung ZNS tech"
  },
  "links": {
    "SSD": "https://www.techradar.com/news/samsung-releases-first-dram-less-consumer-ssd-its-980-nvme-ssd",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "new SSDs": "https://www.techradar.com/news/ssd-vs-hdd-which-is-best-for-your-needs"
  }
}