{
  "source": "https://www.techradar.com/news/hisense-takes-on-samsung-with-ultra-bright-mini-led-tvs-and-even-an-oled-tv",
  "title": "Hisense launches new OLED, Mini LED and laser TVs – but not for everyone",
  "category": "televisions",
  "updated": "2021-06-15T13:49:03Z",
  "author": "henry-st-leger",
  "summary": "Here's what's coming from Hisense in 2021",
  "article": [
    "Hisense has unveiled its 2021 TV range for the UK, including a fleet of Mini LED TVs poised to do battle with similar screens being launched by Samsung, LG and Philips this year. We've seen a similar Hisense TV range launch in Australia, too, though US shoppers won't get any of the same OLED TV or Mini LED options enjoyed by those in the UK.",
    "Mini LED is the key player of 2021, it seems, with Hisense joining rank to release a number of 4K TVs and 8K TVs with the advanced backlighting technology. Mini LED is effectively an evolution of regular LCD-LED, but with LEDs that are a fraction of the size of those in normal screens, allowing for more precise brightness control and more LEDs overall.",
    "Hisense's flagship U9GQ (£3,299) is a Mini LED TV with a 120Hz panel, boasting a 3,000 nits brightness – on a par with the brightest new Samsung TVs, thanks to a 10,000 LED array in its backlight. It also features \"Quantum Dot Colour\", going head-to-head with the QLED screens offered by Samsung, but with both Dolby Vision and HDR10+ support, rather than the single-standard support of its competitor.",
    "Step-down models include the U8GQ (£1,699 for 65-inch, £1,099 for 55-inch), which drops the brightness to 1,000 nits for a more affordable – if less ambitious – QLED television. It does, however, still pack in Full Array Local Dimming for consistent lighting and precise brightness control. Lower-end screens like the A7GQ (£549 for 43-inch, £649 for 50-inch, £749 for 55-inch, £999 for 65-inch and £1,699 for 75-inch) and E76GQ (£649 for 50-inch and £749 for 55-inch) offer a 4K HDR display and 60Hz panel at lower prices, too, while the \"entry-level\" A6G brings 4K resolution down to a more compact 43-inch size.",
    "We're also getting more laser TVs – a technology that melds ultra short throw projection with a dedicated screen for enhancing color and contrast – in 88-inch and 100-inch sizes.",
    "That's not all, though. Hisense is delving deep into multiple panel technologies, including a return to OLED with the Hisense A9G. Available in 55-inch (£1,799) and 65-inch sizes (£2,499), it utilises a \"wide viewing angle\", and both the HDR10+ and Dolby Vision dynamic HDR formats. In terms of audio, you're getting 2.1.2 channel speakers (front-firing) as well as Dolby Atmos support.",
    "It'll also support VRR (variable refresh rates) and ALLM (auto low latency mode) for the gamers out there, keeping gameplay smooth and responsive through its four HDMI 2.1 ports – meaning you can get maximum performance out of a PS5 or Xbox Series X console on its 4K/120Hz screen. Freeview Play is included too, for UK viewers wanting broadcaster catchup apps like All4, iPlayer, and My5.",
    "The A9G sports an interesting design, with a slim, minimal-bezel screen placed within a sturdy soundbar. You're not getting the benefits of OLED's thin properties, though, as the casing and TV stand bulk out the back quite a bit, but it looks quite swish from the front.",
    "We're yet to test out the models above, but they're launching imminently and you can be sure to see coverage of these Hisense TVs on our site in the coming weeks. If you're after a good buy, though, last year's Hisense TVs like the U7QF are now on sale for a decent amount less than their launch price, and Prime Day 2021 might be the time to get even more discounts on Hisense sets.",
    "Hisense has a reputation for testing out TV technologies in Australia or Europe that don't make it to the US market – and it's interesting that the Chinese electronics company is releasing Mini LED and OLED screens in the UK, and the former in Australia, while keeping them from US buyers.",
    "The disparity is quite clear in the company's flagship sets in each region, with the Hisense U9DG in North America capping out at 1,000 nits with its Dual Cell panel technology, while the U9GQ in the UK will reach 3,000 nits peak brightness with Mini LED backlighting. That's a big, big difference.",
    "Ultimately, the TV market is fought on many fronts, and Hisense will have distinct strategies in each region, with distinct areas of the market it seeks to occupy or disrupt. It may also make sense to Hisense's execs to be offering different screen technologies in different areas before seeing which ends up sticking.",
    "Dual Cell is a new, proprietary technology for the company, only launching in commercial screens this year, and we sit at the start of a wave of Mini LED screens too, meaning the market could go in several different directions.",
    "For now, it looks like Hisense has all its bases covered, but we just hope that doesn't stop any of its different TV ranges from truly achieving excellence."
  ],
  "headers": {
    "5": "OLED returns",
    "9": "Not for you"
  },
  "links": {
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "launch in Australia": "https://www.techradar.com/news/hisenses-first-4k-and-8k-mini-led-tvs-are-coming-to-australia-this-month",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "PS5 or Xbox Series X": "https://www.techradar.com/news/ps5-vs-xbox-series-x-which-next-gen-console-should-you-buy",
    "Freeview Play": "https://www.techradar.com/news/freeview-play",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}