{
  "source": "https://www.techradar.com/news/sennheiser-sells-off-consumer-brand-in-professional-switch",
  "title": "Sennheiser sells off consumer brand in 'professional' switch",
  "category": "computing",
  "updated": "2021-05-10T10:24:11Z",
  "author": "sead-fadilpasic",
  "summary": "Sennheiser will focus entirely on \"Professional\" products going forward",
  "article": [
    "German audio giant Sennheiser has announced that it is selling its consumer business to focus entirely on the professional market.",
    "The buyer is Sonova, a Swiss-based business specializing in hearing care solutions, with around 600 employees in Sennheiser's Consumer Elecronics division making the switch.",
    "In a press release announcing the news, Sennheiser says its headphones and soundbars will thus be added to Sonova’s portfolio which is, at the moment, comprised of products such as hearing aids and cochlear implants.",
    "The financial details of the deal were not disclosed, although Sennheiser did describe it as a “permanent cooperation” between the companies, which includes licensing the existing brand name.",
    "“The fast-growing market for personal audio devices is rapidly evolving. Combining our audiological expertise with Sennheiser’s know-how in sound delivery, their great reputation, as well as their high-quality products, will allow us to expand our offering and to create important touchpoints with consumers earlier in their hearing journey,” commented Arnd Kaldowski, CEO of Sonova.",
    "“Combining our market-leading technology with the strong brand and well-established distribution network of Sennheiser creates a strong foundation for future growth.”",
    "Sennheiser first announced plans to sell its consumer business in February.",
    "\"We couldn't have asked for a better partner than Sonova for our Consumer Electronics business,\" Daniel Sennheiser, co-CEO at Sennheiser, said. \"Sonova is a strong, well-positioned company. Not only do we share a passion for unique audio experiences, we also share very similar corporate values. This gives us an excellent foundation for a successful future together.\"",
    "What Sonova does with Sennheiser is yet to be seen, but it could well roll the latter's technology into its existing products in the so-called hearables category.",
    "Hearables are basically smart headphones, earbuds, or other speaker-oriented, wearable devices. They’re defined as “technically advanced, electronic in-ear-devices designed for multiple purposes ranging from wireless transmission to communication objectives, medical monitoring and fitness tracking.”",
    "At the moment, they can be divided into sports devices, voice-focused devices, commodity devices, hearing enhancement earbuds and hearing aid wearables, with the latter two falling within Sonova’s field of operation.",
    "Via: TechCrunch"
  ],
  "headers": {
    "8": "Hearables"
  },
  "links": {
    "Sennheiser": "https://www.techradar.com/reviews/sennheiser-hd-250bt",
    "TechCrunch": "https://techcrunch.com/2021/05/07/sennheiser-sells-off-its-consumer-brand/"
  }
}