{
  "source": "https://www.techradar.com/news/witcher-nightmare-of-the-wolf-trailer-teases-a-wild-ride-for-vesemir",
  "title": "Witcher: Nightmare of the Wolf trailer teases a wild ride for Vesemir",
  "category": "entertainment",
  "updated": "2021-07-21T13:59:57Z",
  "author": "tom-power",
  "summary": "The Witcher: Nightmare of the Wolf arrives this August",
  "article": [
    "If you thought that Netflix was about to leave its Witcher fanbase devoid of content to enjoy before The Witcher season 2's arrival, think again.",
    "The streaming giant is gearing up to release The Witcher: Nightmare of the Wolf – an anime-style prequel movie that focuses on the origins of Geralt's mentor Vesemir – on August 23.",
    "Until recently, we'd only received a release date announcement trailer to give us a glimpse at Netflix's next Witcher production. That's changed now, though, after the streamer released a teaser trailer for its upcoming animated feature film.",
    "Posted on Netflix's official social media channels, The Witcher: Nightmare of the Wolf's new trailer gives us a better idea of what the movie will entail.",
    "Judging by the minute-long video, Nightmare of the Wolf won't be a completely serious film. There's plenty of humor to go alongside the action and likely emotional story beats. Add in a cast that includes Theo James (Castlevania), Lara Pulver (Sherlock), Graham McTavish (Outlander) and Mary McDonnell (Battlestar Galactica), and Nightmare of the Wolf looks like it'll be a worthwhile watch.",
    "If the movie's visuals look familiar, that's because Nightmare of the Wolf has been created by Studio Mir, the company behind other animated Netflix productions including DOTA: Dragon's Blood.",
    "There's a fair bit riding on Netflix's next Witcher production.",
    "Lauren Schmidt Hissrich, the showrunner for Netflix's TV adaptation of Andrzej Sapkowski's book series, wants to build a Witcher universe for the streaming giant – and Nightmare of the Wolf is the first of those non-Geralt focused projects. A live-action spin-off show, Blood Origin, will follow after The Witcher season 2 as well.",
    "While Witcher fans should tune in to watch Nightmare of the Wolf, especially with season 2's release being five months away, the movie's viewing figures will give Hissrich and Netflix a better idea as to whether there's an appetite for more Witcher spin-offs.",
    "If Nightmare of the Wolf doesn't do as well as they hope, Netflix might decide that Blood Origin is the second and final spin-off that it'll agree to produce. That could mean that fans are left waiting a long time between seasons of The Witcher.",
    "However, should Nightmare of the Wolf be successful, Netflix may opt to greenlight further Witcher projects regardless of whether they're live-action or not. This would allow Hissrich to press on with other potential spin-offs, and bring more of Sapkowski's literary world to the small screen.",
    "Our view? The Witcher: Nightmare of the Wolf should have enough about it to entertain both established fans and newcomers. It may convince some viewers to check out The Witcher season 1, Sapkowski's books or even the video game adaptations, and increase The Witcher's already sizable fanbase.",
    "The Witcher: Nightmare of the Wolf lands on Netflix on Friday, August 23."
  ],
  "headers": {
    "6": "Analysis: will The Witcher: Nightmare of the Wolf be successful?"
  },
  "links": {
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Blood Origin": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect"
  }
}