{
  "source": "https://www.techradar.com/news/humble-bundle-partners-with-stop-aapi-hate-coalition",
  "title": "Humble Bundle partners with Stop AAPI Hate coalition",
  "category": "gaming",
  "updated": "2021-03-31T13:25:39Z",
  "author": "rhys-wood",
  "summary": "Humble doing what it does best",
  "article": [
    "Digital storefront Humble Bundle has partnered with the Stop AAPI Hate coalition to help combat the rise of hate crimes against Asian American and Pacific Islander communities amid the Covid-19 pandemic.",
    "Humble Bundle had this to say on the matter: “There has been a rise in violence against Asians and Pacific Islanders and in the last few months, it has continued to intensify with the elderly across the U.S. being targeted and the heartbreaking, senseless shootings in Atlanta targeting Asian women. Humble Bundle condemns these violent acts which are based on racism, hate, and ignorance.”",
    "This week, the storefront launched two bundles to help support Stop AAPI Hate: the Humble Burn Rubber bundle and the Humble Software Bundle: Biggest Graphics Ever. A third bundle will debut in April, and a portion of the proceeds will go directly to Stop AAPI Hate.",
    "The Stop AAPI Hate coalition will also be Humble’s featured charity for the month of April, where all applicable purchases (as well as 5% of Humble Choice earnings) will be donated to Stop AAPI Hate.",
    "The Humble Burn Rubber bundle features a ton of highly rated racing games that you can redeem on your Steam account. These games include Absolute Drift: Zen Edition, Dirt Rally 2.0, Grip, Pacer, Assetto Corsa and more.",
    "The Humble Software Bundle, meanwhile, packs in thousands of overlays, filters and fonts covering a wide variety of themes, making it a perfectly robust collection for graphic designers and photographers.",
    "The Stop AAPI Hate website has a section dedicated to reporting hate incidents available in multiple languages. If you want to donate directly to Stop AAPI Hate, the website has a GiveDirect page where you can do just that, too."
  ],
  "headers": {
    "3": "Help combat hate today"
  },
  "links": {
    "Stop AAPI Hate": "https://stopaapihate.org/",
    "Humble Burn Rubber bundle": "https://www.humblebundle.com/games/burn-rubber?utm_campaign=burnrubber_ann&utm_campaign=2021_03_26_burnrubber_bundle_press&linkID=&linkID=605d313ff235135de53e8288&mcID=102%3A605d173bf235136d9e5d1e17%3Aot%3A57aa41cc0dca63f1bdaaaeb0%3A1&utm_source=Humble+Bundle+Newsletter&utm_medium=email&utm_content=hero_image&partner=pcgamer",
    "Humble Software Bundle: Biggest Graphics Ever": "https://www.humblebundle.com/software/biggest-graphics-ever-software?partner=pcgamer",
    "reporting hate incidents": "https://stopaapihate.org/reportincident/",
    "GiveDirect page": "https://donate.givedirect.org/?cid=14711"
  }
}