{
  "source": "https://www.techradar.com/news/finished-ted-lasso-this-bollywood-sports-movie-is-the-inspirational-film-you-need",
  "title": "Finished Ted Lasso? This Bollywood sports movie is the inspirational film you need",
  "category": "entertainment",
  "updated": "2021-09-25T13:00:52Z",
  "author": "henry-st-leger",
  "summary": "Let’s go, India",
  "article": [
    "In the wake of Ted Lasso’s glorious Emmy win, it’s easy to see that the beloved Apple TV Plus show has stirred our collective love for an inspirational, underdog sports story. But for those who have finished the latest season, or simply want more of the heartwarming on-the-pitch action and off-the-pitch drama that made Ted Lasso such a success, they need look no further than Chak De! India.",
    "Chak De! India (Let’s Go! India in translation) is a 2007 movie about the national women’s hockey team of India, as a disgraced former hockey player – played by Bollywood superstar Shah Rukh Khan, often known simply as SRK – coaches the ragtag band of athletes to global victory.",
    "Inspired by the Indian women’s team’s 2002 win at the Commonwealth games, it’s a story with the usual ups and downs of inspirational sports movies: bickering teammates, last-minute funding dropouts, and the tension of matches decided by a single penalty shot.",
    "The similarities to Ted Lasso are often striking, even if Chak De! India released over a decade earlier. The corralling of arguing teammates, the tensions that move seamlessly between locker rooms and on-pitch passes, as well as the light tone that keeps a – still largely serious – sports drama from feeling too weighed down by the ambitions and obstacles the athletes face. There’s even a precursor to Ted Lasso season 2’s ‘Led Tasso’ scene, where Jason Suidekis inverts his usual charm to become a bully, giving the players a common enemy to unite against.",
    "But Chak De! is still a film all of its own, and it can be a disservice to dissect it too much through the lens of a contemporary (and American-British) production, rather than on its own terms.",
    "The writing and characterization are incredibly sharp. An angry Punjabi girl says sorry to another player, while threatening them with violence if they don’t accept the apology. A despairing father asks what his daughter will feed her future husband, as she brandishes her hockey stick and says \"this\". It’s moments like these that so clearly define the drive, and pressures, of Chak De!’s incredible cast.",
    "It helps that these girls can actually play hockey, giving a sense of realism to a genre that can often be weighed down by airy, unconvincing gameplay.",
    "The film’s director, Shimit Amin, has said that, in order to get the actors ready, “We had training sessions for three to four months. They had to wake up at 4:30 am, go to camp and stick to a diet. It was pretty crazy, but we had to do it. “Unlike cricket, this is a very physical sport with 70 minutes of strenuous running, pushing a stick and bending that could break your back. The ball can hit you, as can the stick; we had to take many precautions to make sure our players knew what they had to do. They had to be fit enough to go for 70 minutes – actually, more, because we were shooting over an eight-hour day.”",
    "However, it’s the context of India that gives Chak De! its most insightful and moving moments.",
    "In India, field hockey is technically the national sport, even if the cultural presence of cricket is a lot larger – and it's a tension that’s ripe for on-screen exploration, with the contempt shown not just for women’s sports but a second-tier “dribbling” activity pushing these athletes on in their journey to prove themselves. (“It’s not exactly cricket,” one player’s boyfriend tells her scornfully.)",
    "As a nation containing over 1.3 billion people, too, a team that draws on players from across the country pulls player differences to their limit – with some speaking entirely different languages and dialects to the rest of the team.",
    "In 2018, an analysis of India’s census showed that almost 20,000 distinct ‘mother tongues’ were alive and well across the nation – and having some players who can only communicate through their actions is an incredible way for a film to show, and not tell, how characters are feeling about each other.",
    "The legacy of partition, as well as the discrimination Muslims in India face, is subtly woven into the backdrop of the story. SRK’s coach Kabir was once the captain of the India men’s hockey team, but fell from grace and hurriedly left his family home after baseless accusations of match-fixing in an India-Pakistan match.",
    "Civilians interviewed on the street ask why ‘his type’ (Muslims) didn’t move to Pakistan during the partition, as neighbors write ‘traitor’ on the side of his home. When SRK utters an Arabic prayer, saying “Nasrun minal lahe wah fatahun kareeb” (Allah give me strength to win) it punches right at the heart of the mistreatment he’s faced because of his religion.",
    "The eventual victory is a huge vindication not just of Kabir, but true sportsmanship – having been victim to career-ending rumors after something as simple as a handshake with a member of the Pakistan team, and fought to bring unity to a group of young women who spend much the film holding grudges against each other. When two warring players learn to pass to each other – enabling the other to score instead of trying to rack up their own goals – it’s hugely moving.",
    "At a run time of two and a half hours, it’ll take the equivalent of around five Ted Lasso episodes to finish Chak De! India off – likely with subtitles, if you're an English speaker – but trust us, it’s well worth the playtime.",
    "Chak De! India is available to watch on Apple TV, Amazon Prime Video, YouTube, and Google Play."
  ],
  "headers": {
    "5": "An epic sports drama"
  },
  "links": {
    "Ted Lasso’s glorious Emmy win": "https://www.techradar.com/news/netflix-and-the-crown-win-big-at-the-emmys-but-the-competition-grows-stronger",
    "has said that": "https://www.rediff.com/movies/2007/aug/07shimit.htm?print=true",
    "analysis of India’s census": "https://www.thehindubusinessline.com/news/variety/india-is-home-to-more-than-19500-mother-tongues/article24305725.ece"
  }
}