{
  "source": "https://www.techradar.com/news/source-of-dinosaur-killing-asteroid-possibly-found-in-darkest-corner-of-asteroid-belt",
  "title": "Source of dinosaur-killing asteroid possibly found in darkest corner of Asteroid Belt",
  "category": "appliances",
  "updated": "2021-08-09T22:57:04Z",
  "author": "john-loeffler",
  "summary": "There's more where that came from",
  "article": [
    "Roughly 66 million years ago, a massive object smashed into Earth just off the cost of the Yucatán Peninsula, bring a cataclysmic end to the 150-million-year reign of the dinosaurs. Now scientists believe they've finally found its source.",
    "The object was about six miles wide (a little under 10 km), which has led to a lot of debate over the nature of the impactor, since 10 km is considered very large for an asteroid impactor but relatively small for a comet. New research published in the journal Icarus suggests that an appropriately-named giant dark primitive (GDP) asteroid was the culprit in the murder of the T-rex and its kin.",
    "Ever since the discovery of the Chicxulub Impact Crater in the Gulf of Mexico put to rest nearly all doubt around what killed off the non-avian dinosaurs, questions about the nature of the impactor have been hotly contested.",
    "\"Two critical ones still unanswered are: ‘What was the source of the impactor?’ and ‘How often did such impact events occur on Earth in the past?’\" said Dr. William Bottke, a researcher with the Southwest Research Institute (SwRI) and co-author of the new research.",
    "To answer that question, researchers with SwRI studied existing 66-million-year-old rock samples from the Chicxulub crater, both from rock layers on land and drill core samples, that identified the impactor as part of the carbonaceous chondrites class of asteroids. This only confuses the matter, since very few carbonaceous chondrites larger than a mile wide have hit Earth, as far as we can tell from the geological record.",
    "So, the SwRI team went hunting for a possible source of a carbonaceous chondrites of sufficient size. “We decided to look for where the siblings of the Chicxulub impactor might be hiding,\" said Dr. David Nesvorný, lead author of the paper.",
    "Using computer modeling, the team now believes that the asteroid came from the outer half of the asteroid belt between Mars and Jupiter, a region long-thought to produce few impactors. This region is filled with larger carbonaceous chondrites asteroids left over from the formation of the solar system billions of years ago.",
    "Their model showed that the processes that can send these GDP asteroids hurtling towards Earth are 10 times as common as previously believed. And while not every displaced GDP asteroid ends up hitting Earth, it does mean that the inner solar system might have more heavy hitters flying around then we originally thought.",
    "The modeling also puts the odds of an impact of this kind at once every 250 million years, which is in line with what scientists have found in the geological record.",
    "“This result is intriguing not only because the outer half of the asteroid belt is home to large numbers of carbonaceous chondrite impactors, but also because the team’s simulations can, for the first time, reproduce the orbits of large asteroids on the verge of approaching Earth,” said Dr. Simone Marchi, co-author of the study. “Our explanation for the source of the Chicxulub impactor fits in beautifully with what we already know about how asteroids evolve.”",
    "“This work will help us better understand the nature of the Chicxulub impact,\" Nesvorný said, \"while also telling us where other large impactors from Earth’s deep past might have originated.\"",
    "Fortunately, it also means that we might have some breathing room before a similar planet-killer comes stalking out of the darkest reaches of the asteroid belt and also gives us an idea where to keep on eye on in the future."
  ],
  "headers": {},
  "links": {
    "Icarus": "https://www.sciencedirect.com/science/article/abs/pii/S0019103521002840?via%3Dihub",
    "said Dr. William Bottke": "https://www.swri.org/press-release/swri-team-zeroes-source-wiped-out-dinosaurs"
  }
}