{
  "source": "https://www.techradar.com/news/amazons-latest-cloud-tool-will-spot-any-chips-or-scratches-in-your-online-purchases",
  "title": "Amazon's latest cloud tool will spot any chips or scratches in your online purchases",
  "category": "computing",
  "updated": "2021-02-25T22:30:40Z",
  "author": "mayank-sharma",
  "summary": "It's already demonstrated positive results in early deployments",
  "article": [
    "Putting Artificial Intelligence (AI) and Computer Vision (CV) to novel use, Amazon Web Services (AWS) has launched a new tool that is able to spot defects in manufactured goods.",
    "Named Amazon Lookout for Vision, the tool is designed for manufacturing companies and can help detect defects, such as cracks, dents, incorrect color, and such by looking at the images of the products.",
    "\"We’re excited to deliver Amazon Lookout for Vision to customers of all sizes and across all industries to help them quickly and cost effectively detect defects at scale to save time and money while maintaining the quality their consumers rely on,” noted Swami Sivasubramanian, Vice President of Amazon Machine Learning for AWS, adding that the tool helps quality control in challenging industrial scenarios.",
    "The tool has already been tested by Swedish food producer Dafgards, who used it to inspect their frozen pizza production lines to ensure there’s enough cheese and the correct topping.",
    "AWS adds that the new tool can be easily trained with as few as 30 baselines images. Moreover, Amazon Lookout for Vision is offered as a cloud service to further ease the process of adapting the tool into the quality control workflow.",
    "According to the company, the service can process thousands of images every hour and reports the ones that differ from the baseline images either via its dashboard or the “DetectAnomalies” real-time API.",
    "AWS says that the tool can also account for variance in camera angle, pose, and lighting, which makes it suitable for all kinds of work environments. To further promote the adoption of the new service, it is offered without any up-front costs or minimum fee, and customers only pay by the hour for actual usage."
  ],
  "headers": {
    "3": "Offered as a service"
  },
  "links": {
    "Artificial Intelligence (AI)": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "Amazon Web Services (AWS)": "https://www.techradar.com/news/aws",
    "Amazon Lookout for Vision": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1201749256752404500&xs=1&url=https%3A%2F%2Faws.amazon.com%2Flookout-for-vision%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Famazons-latest-cloud-tool-will-spot-any-chips-or-scratches-in-your-online-purchases"
  }
}