{
  "source": "https://www.techradar.com/news/oneplus-10-could-launch-early-except-you-wont-be-able-to-buy-it",
  "title": "OnePlus 10 could launch early - except you won't be able to buy it",
  "category": "phones",
  "updated": "2021-11-17T14:41:08Z",
  "author": "tom-bedford",
  "summary": "A China-only launch",
  "article": [
    "We're not going to name names, but certain tech companies have a habit of launching smartphones in China months ahead of a global launch - and rumors suggest the OnePlus 10 will follow suit, too.",
    "We recently heard that the OnePlus 10 Pro could land in January or February, but following on from this, big-name leaker Max Jambor tweeted an image of a timeline saying '10 Pro CN January/February' and '10 Pro Global March/April'.",
    "The meaning is clear: the OnePlus 10 unveiling near the beginning of the year, that we heard about recently, will be just for the Chinese market, while the full global launch is set for later in the year.",
    "It's not clear why Jambor is specifying the Pro model of OnePlus 10, when you'd assume both handsets would launch together - but as the top-end and more exciting model of the family, we often hear rumors about the 10 Pro that also refer to the 10.",
    "OnePlus is a Chinese company, but unlike some other tech brands from the country it generally doesn't launch its mobiles in China before anywhere else. This would be a change of pace for the brand, if this leak is correct.",
    "When tech brands delay global launches for months after the Chinese one, we often see consumer interest wane in the interim period - at least for western audiences, though obviously it doesn't make a difference for Chinese ones.",
    "Take, for example, the Xiaomi Mi 11. It was unveiled in China in late December 2020, but only got a global launch in February 2021 - but because we all already knew what the phone was like after the first event, not as many people tuned in for the latter one.",
    "Phone launches seem to be much more popular when the device is launched worldwide at once - this is what previous OnePlus launches have been like, and is likely why the big-name launches like the iPhone and Samsung Galaxy each year are so anticipated.",
    "So by staggering its launches - either for the OnePlus 10 Pro, or for all members of the family - we might find buyers aren't as interested in March or April when the global launch takes place.",
    "We might find this rumor turns out to be bogus - we hope this is the case - but we'll have to wait to find out."
  ],
  "headers": {
    "5": "Analysis: why this kind of launch doesn't always work"
  },
  "links": {
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10",
    "the OnePlus 10 Pro could land in January or February": "https://www.techradar.com/news/oneplus-10-pro-renders-specs-and-surprisingly-early-release-date-leaked",
    "Max Jambor tweeted": "https://twitter.com/MaxJmb/status/1460905392557408260",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review"
  }
}