{
  "source": "https://www.techradar.com/news/disney-plus-gift-card",
  "title": "What is a Disney Plus gift card and how do I send one?",
  "category": "entertainment",
  "updated": "2021-05-19T11:06:50Z",
  "author": "daniel-pateman",
  "summary": "Give someone the gift of all-year-round entertainment",
  "article": [
    "With a Disney Plus Gift Card you can guarantee a year full of magic to someone special. It provides a 12-month subscription to streaming platform Disney Plus – one of the most popular VOD services around – whose library of content is packed.",
    "Discover iconic animated movies (Toy Story, The Lion King), Marvel blockbusters (Avengers: Endgame), the entire Star Wars saga. There is also a growing line-up of thrilling Original shows like WandaVision and The Falcon and the Winter Soldier, as well as a whole 31 seasons of The Simpsons.",
    "Plus, if you’ve left your gift shopping until the last minute, it’ll be more warmly received than gas station chocolates and a $20 book token.",
    "Below we’ll explain how to purchase and send a Disney Plus Gift Card (without even leaving the house), the amount you’ll pay, and any conditions that might prohibit the recipient from activating their gift subscription.",
    "Yes, although they’re more accurately called ‘gift subscriptions’, because the recipient is emailed a digital code that, once redeemed, provides them with an entire year of access to Disney Plus. So, rather than getting a physical card loaded with a fixed amount of cash, you activate a year-long paid subscription online. (If you want an actual gift card, these are available at Disney Stores and theme parks in the US).",
    "An annual gift subscription is convenient to purchase through the Disney Plus website. There’s no option to gift one-month or six-months instead. But this way you end up saving a loved one – or yourself if you’d normally foot the bill – about 15% on a rolling monthly membership. Not only that, but each account can be shared with up to four other people, so it’s easy to spread the Disney Plus cheer.",
    "There are a few caveats worth mentioning, however, before firing gift subs off to everyone in your address book. Disney Plus gift cards are currently only available in the US, UK, Canada, Australia, France and Germany, and can only be purchased for someone living in the same country as you. The recipient must not have an active Disney Plus account, and they should be at least 18 years of age.",
    "You can find out more here about the Disney Plus price and plans, including how it compares to other streaming services.",
    "It's easy to make someone's online streaming dreams come true. Just follow the steps below:",
    "- Follow this link and select “Gift a Year”",
    "- Enter your name and email address",
    "- Enter the recipient's name and email address, and the date you’d like to send them the gift subscription (e.g., their birthday, graduation date)",
    "- Add your credit card or PayPal details",
    "- Confirm the purchase. Your account will then be instantly charged",
    "Once the lucky recipient has the email, they should visit this address to redeem their gift subscription, and manually enter the code provided in the email.",
    "Easy. Now they can sit back and enjoy 12-months of unprecedented Disney Plus entertainment, all thanks to you. And, if they’re still loving it when the year ends, they can renew the membership by entering their own credit card details.",
    "A Disney Plus Gift Card costs the same amount as you’d pay for an annual membership. Prices are detailed below, and will vary depending on what region you live in:",
    "- America $79.99 USD",
    "- United Kingdom £79.90 GBP",
    "- Australia $119.99 AUD",
    "- Canada $119.99 CAD",
    "- France €89.90 EUR",
    "- Germany €89.90 EUR",
    "At the moment, these are the only countries where you can buy a Disney Plus gift subscription.",
    "It’s not ideal. As per the terms and conditions, only new Disney Plus subscribers can redeem a Disney Plus subscription that’s been gifted to them.",
    "However! If you’ve been gifted a year of the VOD service from family or friends, but are already paying for Disney Plus on a monthly, or annual basis, go ahead and cancel your current subscription. Once it’s elapsed, you’ll be free to redeem the digital subscription code and utilize that complimentary 12-month membership."
  ],
  "headers": {
    "4": "Does Disney Plus have gift cards?",
    "8": "How do I send someone Disney Plus with a gift card?",
    "16": "How much does a Disney Plus gift card cost?",
    "24": "What if I give a Disney Plus gift card to somebody who already subscribes?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "WandaVision": "https://www.techradar.com/news/how-to-watch-wandavision-online-stream-all-new-marvel-series-on-disney-plus-today",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/how-to-watch-the-falcon-and-the-winter-soldier-online-stream-avengers-spin-off",
    "Disney Plus website": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1288131935071983600&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-us%2Fwelcome%2Fgift-subscription",
    "Disney Plus price and plans": "https://www.techradar.com/deals/disney-plus-price",
    "link": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1321637025297162500&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fgift-subscription",
    "this address": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-6507074667060043000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fredeem"
  }
}