{
  "source": "https://www.techradar.com/news/google-pixel-6-with-5-years-of-support-is-good-but-other-android-makers-must-follow",
  "title": "Google Pixel 6 with 5 years of support is good, but other Android makers must follow",
  "category": "phones",
  "updated": "2021-07-17T07:00:10Z",
  "author": "james-rogerson",
  "summary": "Opinion: Keep those updates coming",
  "article": [
    "Perhaps the most exciting Google Pixel 6 rumor so far has nothing to do with its radical redesign or in-house chipset, but rather the number of updates it will get, with a leak suggesting the Pixel 6 (and Pixel 6 Pro) will get at least five years of software updates.",
    "This is excellent news if true. It means not only that the Pixel 6 won’t feel dated as quickly (as its software will remain up to date even as its hardware ages), but also that apps are likely to remain compatible with it for longer, and that it’ll actually be safe to use for longer – because as well as operating system updates, phones also get security updates to patch vulnerabilities.",
    "But while I’m very happy to hear this, it’s basically the least I’d expect from a flagship phone in 2021, so other Android phone makers really need to follow suit.",
    "Right now, most Android phones only get two years of OS updates. So if your phone launched with Android 9, there’s a good chance it would get Android 10 and 11, but that’s it, and some aren’t even supported for that long. Security updates sometimes run for another year or so, but that still means that after around three years – or less - your phone is not only outdated, but potentially unsafe to use.",
    "Whether this is done to push people into buying more phones (and therefore spending more money) or simply because keeping phones updated would be more time and expense for the manufacturer, it seems that ultimately this situation comes down to money, but with how expensive many phones are that’s not okay.",
    "Top-end Android phones like the Samsung Galaxy S21 Ultra and Sony Xperia 1 III cost upwards of $1,000/£1,000/AU$1,800, so the least I’d expect is that we shouldn’t feel the need to replace them two or three years down the line. Not when other expensive tech like computers and TVs can last way longer.",
    "And sure, many smartphones are actually quite cheap these days, but they’re still not exactly sold at pocket money prices, and some such phones will only get one major update if they get any at all.",
    "If you ask me, we’re well past the point where companies should be getting a free pass on this, especially when there’s already a big example out there of how to do software updates right.",
    "Apple, for all the – sometimes justified – criticisms of its pricing, keeps offering updates to iPhones long after they launch. iOS 15 is landing later this year and it’s coming to all iPhones from the iPhone 6S onwards.",
    "That’s a phone that launched in 2015 with iOS 9, meaning it will have got six years of OS updates, which is even more than Google is reportedly promising with the Pixel 6 range, and at least three times as much as most Android phones.",
    "And that phone isn’t an outlier – Apple consistently supports its handsets for a long time. So while you might have to spend a lot to buy one, the cost is no higher than the priciest Android phones, and you can rest assured that you won’t feel compelled by software to buy a new handset a couple of years later.",
    "That means in the long run it can actually be cheaper to be an iPhone owner than an Android fan.",
    "I touched on why it’s important for Android phones to offer longer software support above, but there really are a lot of significant reasons.",
    "Perhaps the biggest is simply that your phone or tablet remains safe to use, since it’s one thing for a device to feel dated, but if you actually can’t safely use it then upgrading becomes near essential.",
    "To remain safe it requires security updates, and companies are at least sometimes better with these than operating system updates, but you’ll still be lucky to get more than three years of these, and many phones get less.",
    "Operating system updates by contrast are less essential. These are the updates that move Android to new version numbers, often bringing new features and occasionally even a whole new look to the phone in the process. These are nice to have, especially if you’ve bought an expensive handset, but are less vital.",
    "That said, some apps only support relatively recent versions of Android, so as your phone’s software becomes dated you might find that it either can’t run some apps, or that they don’t perform as they should.",
    "And then there’s the environmental aspect of keeping phones updated for longer. Doing so means you’re buying new phones less often, so the hardware remains in use for longer. If more people did that it would have a big positive environmental impact, which everyone should be in favor of, not least those companies that want to increasingly be seen as environmentally responsible.",
    "Samsung for example doesn’t include chargers with the Galaxy S21 range in order to reduce e-waste – but it’s telling that this is a step that costs it nothing, and potentially even makes it money (since some people will need to buy a charger separately, and phone prices may not be lowered by as much as the charger would have cost).",
    "Supporting phones for longer on the other hand costs the company money, so that once again is what it all comes back to.",
    "I don’t want to be too hard on Samsung here. Whatever its motivations, taking steps to protect the environment is undoubtedly a good thing, and recently Samsung has been a bit better about software updates than many other companies too.",
    "It announced earlier in 2021 that it would start providing three years of OS updates and four years of security patches for its devices – that’s one more year of each than it previously offered, or than most other Android phone makers offer.",
    "OnePlus soon followed suit with the same promise – although only for its flagship devices, while Vivo has said it will offer three years of both OS and security updates for select models, and Oppo has said it will offer three years of security updates (with no word on numbered OS updates) for the Oppo Find X3 Pro, Oppo Find X3 Lite, and Oppo Find X3 Neo.",
    "This all happened in 2021, so things are clearly, finally heading in the right direction. But it’s long overdue, and these companies are still going nowhere near far enough – their extended support is still well short of Apple’s (or Google’s if the rumors are true) and is limited in most cases to select handsets.",
    "And many Android phone makers haven’t committed to any improvements in software support, with companies like Motorola, HMD Global (the maker of Nokia phones), Sony and Xiaomi making no such promises.",
    "Hopefully, the news about the Pixel 6 is true, and with Google making a push for longer software support, maybe more companies will do the same, because they really, really should. Either that or we should all just start buying iPhones – a phrase I never thought I’d say."
  ],
  "headers": {
    "3": "Planned obsolescence",
    "7": "The Apple approach",
    "12": "The case for longer support",
    "20": "A step in the right direction"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "get at least five years of software updates": "https://www.techradar.com/news/huge-google-pixel-6-leak-says-it-may-get-iphone-like-software-support",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "announced earlier in 2021": "https://www.techradar.com/news/how-future-android-updates-for-samsung-phones-will-work",
    "soon followed suit": "https://www.techradar.com/news/oneplus-commits-to-three-years-of-android-updates-for-its-flagship-phones",
    "Oppo has said": "https://www.techradar.com/news/android-is-getting-closer-to-matching-ios-for-supporting-older-phones",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Oppo Find X3 Lite": "https://www.techradar.com/reviews/oppo-find-x3-lite",
    "Oppo Find X3 Neo": "https://www.techradar.com/reviews/oppo-find-x3-neo-review"
  }
}