{
  "source": "https://www.techradar.com/news/demeo-is-tabletop-gaming-for-the-dandd-curious-and-one-of-the-best-vr-games-yet",
  "title": "Demeo is tabletop gaming for the D&D curious and one of the best VR games yet",
  "category": "gaming",
  "updated": "2021-05-06T17:00:27Z",
  "author": "gerald-lynch",
  "summary": "Approachable, social, and supremely polished",
  "article": [
    "I love me a roleplaying video game, I do. But I’ve never managed to get my head around tabletop gaming and classic in-the-flesh Dungeons and Dragons sessions. I’ve walked the wild wastes of Skyrim, smitten gnolls in Baldur’s Gate and even amassed a healthy collection of Fighting Fantasy game books. But I’ve never felt the sweet caress of a 20 sided die in my hand.",
    "I’m ‘D&D-curious’, you might say, but the barrier to entry has always been too great. There are lots of rules and instructions to learn and hours upon hours required to finish a quest, while perhaps the greatest challenge of all has been rounding up a gang of friends able to commit the time to the experience, too.",
    "Demeo is the dungeon-crawling icebreaker I’ve always wanted then – a pick-up-and-play accessible RPG tabletop game that, through the power of VR, rolls a critical hit against all the obstacles that have stopped me from enjoying the hobby in the past. And it may also be one of the best virtual reality games, period.",
    "Demeo takes the tabletop board game experience and literally transports it into VR, letting you and up to three friends take on a dungeon crawling quest. You’ll each appear as disembodied, fantasy-themed avatars around a grid-based, 3D diorama of a dungeon to explore. Each taking on one of four character classes - the powerful Guardian, the spell casting Sorcerer, the stealthy Assassin and bow-equipped Hunter – your task is to navigate three sizeable dungeon maps from a combination of dozens, taking on the armies of the Mad Elven King as you look to escape.",
    "Despite being both in a VR game space and offering a tabletop board game, Demeo proves to be not only one of the most accessible virtual reality titles, but one of the most easy-to-grasp tabletop games too.",
    "The four players surround the virtual board and, by using a combination of motion controllers (we tested using an Oculus Quest 2, but Steam VR headsets and controllers will also be supported), grabs, twists and turns, are able to zoom in and out of the catacomb setting, getting up close and personal with digital miniatures of heroes and goblins, or zooming out and tilting the table for an overhead strategic view.",
    "Each player has a semi-instanced version of the game area (itself set inside a stereotypical D&D basement à la the kids from Stranger Things), meaning they each can pick up pieces to check stats and attributes – or just to admire the lovingly rendered models – without interrupting the flow of play for everyone else. Each player also has useful tools mapped to gloves that cover their virtual in-game hands, including playable buff cards and powers, as well as a ‘laser pointer’ to highlight points of interest other players might have missed.",
    "Of course, not everyone has access to a VR headset. But that shouldn’t stop gangs of pals joining up for a game of Demeo, regardless of hardware barriers – the developers at Resolution Games have stated that a PC desktop, monitor-first, version of the game is also in the works and coming soon, letting VR and non-VR players enjoy the same quest together, albeit from different perspectives.",
    "Being played from a relatively fixed perspective, and using grab-and-pull motions to maneuver around the table, it’s an incredibly comfortable game to play. The grip-based locomotion system prevents any nauseating disconnect between what you’re doing and what you’re seeing, and it’s also incredibly intuitive to navigate – perhaps with the exception of turning your view of the table, which uses a gesture that requires some getting used to.",
    "Smart locomotion is not the only accessible part of the game. With the maps and objectives preset, all dice, cards and tokens managed by the game, and the control system literally as simple as picking up a piece and dropping it where you want to be (with a few virtual dice rolls thrown in), even a newcomer can jump into a game and get playing within minutes. A smart, short tutorial explains the key concepts in less than ten minutes, but most players could probably figure things out without even viewing that, so good is the game at intelligently offering up information as you interact with each of its mechanics.",
    "Everything is satisfyingly rendered, too. The virtual dice clack and clatter wonderfully around the catacombs (without annoyingly knocking pieces over, might I add), while the little combat animations add a level of immersion that wouldn’t be seen with plastic figures. For tabletop players that have dreamed of getting in close to their fantasy environments while still being surrounded by friends, it’s that dream realized.",
    "It doesn’t hurt that the underlying gameplay is good too. Turn-based and strategic, it’s a little like a Tolkien-esque take on X-Com, with loot to uncover and unlock, and a level-based progression system that will reward long-term players.",
    "Launching on May 6, 2021 for Oculus and SteamVR headsets (with the PC-only version following in the coming months), there feels like there’s tons of potential for Demeo, even as it launches in its full-game state.",
    "The developers at Resolution Games have committed to offering free, additional campaigns as time goes on, and the scope for what they could include is vast. It’s a game that would easily lend itself to other settings outside of the go-to fantasy realm, with sci-fi, western and post-apocalyptic add-ons all mentioned as potential areas they’d be keen to explore in the future. And while there’s a single-player skirmish option available in the game, a fully-fledged solo campaign would likely be well-received, too.",
    "Perhaps more than anything though, Demeo leans on the strengths of VR as a social play space. I played with fellow dungeon crawlers across continents, jollily pushing our heroes through a spider-and-goblin infested tomb. In a socially distanced age that’s lead to our party-based tabletop games gathering dust, Demeo can let your real-world crew of rogues, wizards, and warriors reunite again – wherever they may be."
  ],
  "headers": {
    "3": "A virtual tabletop",
    "8": "Supreme comfort",
    "12": "Great future potential"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Steam VR": "https://www.techradar.com/news/steam-vrs-latest-trick-boosts-quality-for-lower-power-windows-10-pcs",
    "Stranger Things": "https://www.techradar.com/news/stranger-things-season-4",
    "Launching on May 6, 2021 for Oculus and SteamVR headsets": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=43993&u1=trd-us-4508530667883106300&murl=https%3A%2F%2Fwww.oculus.com%2Fexperiences%2Fquest%2F3634830803298285%2F%3Flocale%3Den_GB"
  }
}