{
  "source": "https://www.techradar.com/news/the-mandalorian-season-3-is-filming-sooner-than-youd-think",
  "title": "The Mandalorian season 3 is reportedly filming sooner than you'd think",
  "category": "entertainment",
  "updated": "2021-01-27T14:07:08Z",
  "author": "samuel-roberts",
  "summary": "A new listing page says filming begins very soon",
  "article": [
    "We already knew that new Star Wars TV show The Book of Boba Fett was being filmed for Disney Plus just before The Mandalorian season 3, and now a new listing suggests a filming date for the latter isn't that far away.",
    "According to the Film and Television Industry Alliance's production listing for season 3 of Mando, the next set of episodes starts filming on April 5, 2021 (thanks, r/StarWarsLeaks). The Book of Boba Fett has a confirmed release date of December 2021, but The Mandalorian season 3 does not have a date yet – it's widely expected to debut at some point in 2022.",
    "The Mandalorian takes a long time to make, which probably comes as no surprise given how effects-heavy the show is. When the first season debuted in November 2019, the second was already filming. Season 2 of The Mandalorian finished filming just before Covid-19 hit in early March 2020, before debuting in October of that year.",
    "The Book of Boba Fett had already begun filming by late 2020.",
    "There's a long wait ahead, then, but our hope is that season 3 will debut in the first half of next year. In the meantime, Lucasfilm is apparently already filming the Star Wars TV shows Andor and Obi-Wan Kenobi. Read about all the new Star Wars TV shows and movies in the works here.",
    "That's a long to wait and find out what happened after Luke Skywalker went off to train Grogu, the cute specimen variously referred to as Baby Yoda and The Child.",
    "Out of Disney's Investor Day in 2020, when it was announced that 10 Star Wars TV shows and 10 Marvel series were in the works for Disney Plus, the reaction from some circles was a little negative. It's true that on paper, this is a lot – but the reality is that these series take a long time to make. The gap between The Mandalorian season 2's finale and The Book of Boba Fett will still be a year long.",
    "That could change in 2022, if we see Andor, Obi-Wan Kenobi and Mando season 3 arrive within the same 12 months. Given that those shows are all pretty different from each other in terms of their timeframe in the Star Wars universe and the creators working on them, though, hopefully they'll be different enough that we never really stop and think about it that much."
  ],
  "headers": {
    "6": "Why Star Wars overload seems unlikely"
  },
  "links": {
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "production listing": "https://productionlist.com/production/mandalorian-season-3/",
    "r/StarWarsLeaks": "https://www.reddit.com/r/StarWarsLeaks/comments/l50xu2/the_mandalorian_season_3_to_start_filming_april/",
    "new Star Wars TV shows and movies in the works here": "https://www.techradar.com/news/new-star-wars-movies-and-tv-shows",
    "Luke Skywalker": "https://www.techradar.com/news/luke-skywalker-in-the-mandalorian-season-2-finale-explained",
    "10 Star Wars TV shows and 10 Marvel series": "https://www.techradar.com/news/disney-plus-confirms-its-making-10-marvel-and-10-star-wars-tv-shows"
  }
}