{
  "source": "https://www.techradar.com/news/best-gta-games",
  "title": "Best GTA games: the Grand Theft Auto series ranked ahead of GTA 6",
  "category": "gaming",
  "updated": "2021-07-17T16:00:58Z",
  "author": "techradar-team",
  "summary": "Ranking the GTA games from worst to best",
  "article": [
    "It looks like it’s going to be a while before we get our hands on GTA 6 - with rumors suggesting we may be waiting until 2025 for the highly-anticipated new Grand Theft Auto.",
    "Hype surrounding GTA 6 is at a fever pitch, with the rumor mill in full swing speculating about where the new GTA will take place, who the playable characters will be and what new features it will bring with it. After all, the Grand Theft Auto series is one of the most lauded - if not controversial - game series of all time, with entries spanning main instalments, expansion packs and ports. But which GTA games are the best?",
    "Here at TechRadar, we’ve taken the liberty of ranking every key GTA game, expansion and port from worst to best. The entries in this list may not all be core Grand Theft Auto games, and not every port makes an appearance, but those selected are the entries we feel are keystones in the GTA series. So, read on for the best GTA games ranked.",
    "Ambitious but flawed, it takes some guts to try to squeeze even the top-down GTA games onto the old Game Boy handhelds. And while they’re not the smoothest (or enjoyable) ways to play GTA, they’re impressive efforts from a technical point of view. Toned down in terms of violence and language to suit a more delicate Nintendo audience, what they don’t dial back is the scale of the game, which are a match for the home console and PC versions of the original titles.",
    "GTA Advance finds itself quite low on our list, but it’s by no means a bad game. The fact a game of its size was able to fit on a tiny GBA cartridge is commendable in itself, and it carried on the fast-paced, unpredictable fun that could be had in the series’ earliest entries.",
    "GTA Advance also featured a fairly simple narrative to supplement its handheld brand of sandbox mayhem, fleshing out the package to something more than a proof of concept, and while it’s true we’d rather play almost any other title in the series, GTA Advance is a curio well worth exploring if you’ve got an old Game Boy Advance lying around.",
    "A reheat of GTA 3 made for PSP, this was a prequel entry that is mainly remembered for being an absolutely dazzling example of what was possible on Sony's handheld. Seeing a Rockstar open-world game running on that device in a pre-smartphone age felt like pure magic. The game itself, though, was really just okay – Liberty City returned from GTA 3 in a near-identical form, but it lacked some of the later games' niceties, like helicopters and a vast armory. Still, if you owned a PSP in late 2005, there was no way you weren't playing this game.",
    "Released on PSP and PS2, Vice City Stories isn’t quite Vice City but it serves as a fun prequel. Following Victor “Vic” Vance, a character you may remember from Vice City, Vice City Stories sees Vic attempting to build up a criminal empire alongside his brother Lance (who you likely will remember).",
    "While Vice City Stories boasted the same 80s aesthetic as Vice City, along with another killer classic soundtrack, its innovative empire building system gave it its own unique stamp.",
    "In the wake of Austin Powers, '60s London was suddenly a big thing in the late '90s. DMA Design joined the fun with this memorable expansion pack, which threw cockney accents and Minis into the GTA formula – it was otherwise pretty familiar as a top-down GTA experience. But a few nice touches stick in the memory: stealing a tank that was actually just a taxi with a cannon strapped to it, for example, or the local radio stations. A PC-only prequel expansion to the expansion, GTA: London 1961 followed, and added new features such as drive-by shootings and nitro speed boosts.",
    "The weirdest Grand Theft Auto game ever? That title has to go to GTA 2. With its near-future setting, cyberpunk leanings and sci-fi vehicle list, GTA 2 was a somewhat-bizarre departure for a fledgling franchise finding its footing. Released in 1999 on everything from the PC to Dreamcast, it was the last game in the franchise before the open-world, fully 3D re-imagining of the series took place. Some interesting ideas were introduced in GTA 2 that would later become series staples however, including car customization and more interactive city citizens. It also introduced a really interesting gang affiliation mechanic, that saw the game open up or lock up missions with certain criminal societies based on whether or not you helped or hindered their nefarious activities.",
    "Rockstar made a deal with Microsoft for two premium pieces of DLC back when the Xbox 360 launched. That later materialized as a pair – The Lost and Damned and The Ballad of Gay Tony. Let's start with this biker-themed expansion, which did the clever thing of reusing GTA 4's uber-detailed Liberty City environment, but reframed it through the eyes of a very different character. You played as Johnny Klebitz, member of the biker gang the Lost, and the whole story is about the near-collapse of that unit at the hands of its reckless leader, Billy Grey. What it amounts to is a short but thrilling GTA mini-campaign, that cleverly took you to mission locations you didn't see quite as much of in the main game.",
    "The one that started it all, it’s easy to forget the humble beginnings of the GTA series, given its culture-dominating reputation these days. Top down, 2D and visually primitive even by the standards of its 1997 peers, what the original Grand Theft Auto had that the competition lacked was attitude. Here was a game that not only offered you the chance to enter a criminal underworld, but revelled in it, rewarding car jackings, high-speed chases and killing sprees. Introducing the now-notorious trio of GTA locations (Liberty City, San Andreas and Vice City), it offered a real sense of freedom as you completed different objectives for the gangsters of each city locale. It’s a rough start, but the blueprint is clearly there – being the bad guy can be a lot of fun.",
    "Chinatown Wars is arguably one of the best games on the original Nintendo DS. The classic top-down approach to the game was a perfect fit for Nintendo’s dual-screened handheld and once again, Rockstar was able to pack a massive explorable sandbox onto a tiny cartridge.",
    "Players explore the seedy underbelly of Liberty City as Huang Lee, and the game focuses on conflict with the Triads, a gang featured prominently in both GTA 2 and GTA 3. Chinatown Wars also uses the DS’s touchscreen smartly, controlling elements like the map and even the trajectory of grenades.",
    "If GTA 4 got one persistent complaint from players, it's that it was too grounded and not silly enough. Compared to San Andreas, with its fighter jets, alien Easter eggs and ability to eat burgers until your character can no longer run as quickly, GTA 4 was super serious – but The Ballad of Gay Tony took that same world and cut loose, both in its low-stakes story about its hapless titular nightclub owner and its level design. One of the early missions in the game puts you on a moving train with an automatic shotgun, as you bring down a whole fleet of helicopters. It escalates from there, and gives you a bigger and better arsenal than the main game ever did, paving the way for GTA 5's return to daft large-scale antics. GTA 4 and its two DLCs form one essential complete experience – with some neat crossover in their storytelling.",
    "GTA 3 is the game in the series that left the biggest impact when it was first released. It’s among the PS2’s earliest killer apps (alongside Final Fantasy 10 and Tekken Tag Tournament), and was such a technical achievement (for its time) that it was largely responsible for shifting millions of consoles so early in its lifecycle.",
    "Despite being the series’ first fully 3D entry, GTA 3 perhaps had more in common with its PS1 predecessors than later titles like Vice City and San Andreas. For one, you play as a silent protagonist, Claude Speed, and the story acts more of an excuse to blow stuff up as opposed to adding any meaningful commentary.",
    "Still, GTA 3 set the bar for open-world titles, and its chaotic sandbox would go on to inspire similarly silly games like the Saints Row series. It’s certainly aged quite poorly by today’s standards, but it’s hard to swat away the influence GTA 3 has on open-world games to this day.",
    "San Andreas was the series’ biggest technical leap forward of its time, featuring an enormous map connecting three major areas and no shortage of weird and wonderful desert locales to explore. Players took on the role of Carl Johnson, freshly returned to San Andreas from an extended stay in Liberty City, only to find the neighborhood he grew up in reduced to turmoil and gang violence.",
    "San Andreas is still iconic to this day for a number of reasons. It featured a well-rounded, often hilarious cast of characters, a constantly surprising story, arguably the best open world of its time and one hell of a soundtrack provided through the game’s numerous radio stations.",
    "It certainly wasn’t the most graphically impressive game of its day, but the sheer scope of San Andreas was utterly mind blowing, not to mention the litany of side activities like customizing cars, buying new clothes for CJ, forming relationships with NPCs and even improving stats like stamina and strength at the gym. Thinking of the swathe of additions San Andreas introduced to the series, especially on such limited hardware, it’s little wonder it went on to become the best-selling game on the PS2.",
    "Vice City represented a huge shift for the Grand Theft Auto series, offering more freedom, interactive activities and violence than we had seen before - which also made it extremely controversial at the time. But Vice City also boasts perhaps the most memorable Grand Theft Auto aesthetic. From its classic soundtrack and Hawaiian shirt-clad characters to hot pink convertibles and sun-soaked bust ups, GTA Vice City’s 80s Miami-like setting begged to be explored. It’s no wonder fans are excited at rumors we could return to Vice City once more in GTA 6.",
    "GTA 5 almost made it to our number one spot, but was just narrowly beaten out. The most recent entry in the Grand Theft Auto Series, GTA 5 is truly a marvel. Not only does it pack in a campaign and vast open-world filled with illicit activities to get up to, but GTA 5’s story itself is gripping and its characters are some of the best in the series - who doesn’t love a bit of Trevor?",
    "But the true kicker for GTA 5 has been GTA Online, its online multiplayer mode. GTA Online has essentially become its own entity, offering players the chance to explore Los Santos with friends - turning the fictional city into a virtual playground of chaos. Despite releasing nearly eight years ago, Grand Theft Auto 5 remains hugely popular, as does GTA Online. It’s no surprise, then, that an expanded and enhanced version of GTA Online and GTA 5 are coming to PS5 and Xbox Series X this November.",
    "Claiming our number one spot is GTA 4. GTA 4 may not be the newest entry in the series but it’s absolutely the best - especially when combined with the two expansions on this list. Following Eastern European war veteran Niko, GTA 4 arguably has one of the most human stories of the series as Niko tries to shake his past in an effort to move on with his life. The narrative offers more depth than we had seen previously in the series and, for once, has you questioning whether your actions were actually for the greater good.",
    "But it’s not only in its narrative that GTA 4 excels. Set across three islands, GTA 4’s Liberty City set a new bar for open-world design when the game released in 2008, offering a living and breathing city that you never tired of exploring. What results is one of the darkest but well built entries in the series, which isn’t afraid to dig into the seediness of organized crime - and we love it."
  ],
  "headers": {
    "3": "15. Grand Theft Auto / GTA 2 (Game Boy / Game Boy Color)",
    "4": "14. GTA Advance",
    "6": "13. GTA: Liberty City Stories",
    "7": "12. GTA: Vice City Stories",
    "9": "11. GTA: London 1969 / GTA: London 1961",
    "10": "10. GTA 2",
    "11": "9. GTA 4: The Lost and Damned",
    "12": "8. Grand Theft Auto",
    "13": "7. Grand Theft Auto: Chinatown wars",
    "15": "6. GTA 4: The Ballad of Gay Tony",
    "16": "5. GTA 3",
    "19": "4. GTA: San Andreas",
    "22": "3. GTA: Vice City",
    "23": "2. GTA 5/GTA Online",
    "25": "1.GTA 4"
  },
  "links": {
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "waiting until 2025": "https://www.techradar.com/news/you-wont-be-playing-gta-6-any-time-soon-heres-why",
    "enhanced version of GTA Online": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}