{
  "source": "https://www.techradar.com/news/mozilla-vpn-is-now-available-across-all-platforms-including-mac-and-linux",
  "title": "Mozilla VPN is now available across all platforms including Mac and Linux",
  "category": "computing",
  "updated": "2021-01-13T09:27:52Z",
  "author": "barclay-ballard",
  "summary": "Privacy has come to more platforms",
  "article": [
    "Mozilla has announced that its VPN solution is now available for users of Mac and Linux devices, following its Windows, iOS, and Android launch last year. Mozilla VPN is currently available in six countries (the US, the UK, Canada, New Zealand, Singapore, and Malaysia), with more regions coming soon.",
    "Like many VPNs, Mozilla’s offering uses the WireGuard protocol to encrypt network activity and hide the user’s IP address. WireGuard’s use of high-speed cryptographic primitives also means that users of Mozilla VPN should still be able to experience fast network speeds.",
    "Mozilla VPN provides device-level encryption, utilizing more than 280 servers spread across over 30 countries, promising no bandwidth restrictions and no recording of your online activity. Signing up for the VPN costs $4.99 a month and allows up to five devices to be connected.",
    "VPN usage skyrocketed last year as a result of the coronavirus pandemic. With COVID-19 forcing many individuals to work remotely, VPNs enabled employees to secure their online connections and access their office PC and other resources from home.",
    "Mozilla also points out that VPNs are worth adopting even if you are not able to work remotely. Anyone who, for example, uses public Wi-Fi networks would benefit from the added privacy provided by a VPN solution And VPNs even deliver benefits for individuals that mostly go online using their home network.",
    "Mozilla may be best known for its Firefox web browser, but the company also has a few other online products, including its Pocket app for saving web articles and reading them later on. With its VPN service now available to Mac and Linux users, the company has pretty much covered all platforms but will come up against fierce competition from the many other VPN solutions out there."
  ],
  "headers": {
    "3": "The importance of VPNs"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Mozilla VPN": "https://www.techradar.com/reviews/mozilla-vpn",
    "VPN usage skyrocketed": "https://www.techradar.com/news/vpn-usage-soars-across-the-world",
    "home network": "https://blog.mozilla.org/firefox/when-to-use-a-vpn/"
  }
}