{
  "source": "https://www.techradar.com/news/t-mobile-investigates-massive-potential-data-breach",
  "title": "T-Mobile investigates massive potential data breach",
  "category": "computing",
  "updated": "2021-10-08T16:07:21Z",
  "author": "mayank-sharma",
  "summary": "T-Mobile breach reportedly affects 100 million customers",
  "article": [
    "A hacker appears to be selling personally identifiable information (PII) relating to millions of US-based T-Mobile customers on an underground forum.",
    "While the forum post doesn’t say the data belongs to T-Mobile explicitly, the seller told Motherboard they obtained the information by breaching the telecom company's servers.",
    "The pool of data reportedly includes the social security numbers (SSN), phone numbers, names, physical addresses, unique IMEI numbers, and driver license (DL) information of roughly 100 million T-Mobile customers.",
    "The hacker has put up less than a third of the stolen data with SSN and DL details for sale on the dark web - for the price of six bitcoin (about $270,000) - with the intent to sell the rest of the database privately.",
    "Responding to reports, T-Mobile issued a statement claiming that it is investigating the potential breach.",
    "\"We are aware of claims made in an underground forum and have been actively investigating their validity. We do not have any additional information to share at this time,\" the company told Motherboard.",
    "Interestingly, the hacker claims that T-Mobile is aware of the breach since the company has sealed their access to the breached servers.",
    "\"I think they already found out because we lost access to the backdoored servers,\" the seller told Motherboard in an online chat.",
    "T-Mobile did not immediately respond to TechRadar Pro’s request for confirmation of the breach.",
    "Via Motherboard"
  ],
  "headers": {
    "3": "Under investigation"
  },
  "links": {
    "T-Mobile": "https://www.techradar.com/news/mint-mobile-vs-t-mobile-which-carrier-is-best-for-you",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "bitcoin": "https://www.techradar.com/best/mining-rigs",
    "database": "https://www.techradar.com/best/best-database-software",
    "Motherboard": "https://www.vice.com/en/article/akg8wg/tmobile-investigating-customer-data-breach-100-million"
  }
}