{
  "source": "https://www.techradar.com/news/amd-ryzen-5000-processor-failures-are-they-really-that-bad",
  "title": "AMD Ryzen 5000 processor failures: are they really that bad?",
  "category": "computing",
  "updated": "2021-02-16T14:32:52Z",
  "author": "matt-hanson",
  "summary": "What's going on?",
  "article": [
    "We’ve seen some concerning reports that AMD’s latest Ryzen 5000 Zen 3 processors, along with the X570 motherboards they use, could be suffering from a high failure rate.",
    "PowerGPU posted a tweet – which has since been deleted – that claimed the PC builder ordered a large number of Ryzen 5000 processors, and a surprising number of them were DOA (Dead on Arrival).",
    "According to PowerGPU, of the 50 AMD Ryzen 9 5950X CPUs it received, eight were DOA. Out of 50 AMD Ryzen 9 5900X CPUs, four were DOA.",
    "PowerGPU’s AMD 7 Ryzen 5800X and AMD Ryzen 5 5600X stock also reportedly had high failure rates as well.",
    "While a certain amount of defective units is to be expected when bulk buying, PowerGPU’s numbers are worryingly high.",
    "However, before we go any further, it’s important to note that this is an unsubstantiated claim from a single source. It should also be noted that the original tweet was deleted, which could mean PowerGPU has backtracked on its claims.",
    "But, while PowerGPU has deleted its original tweet, it is still replying to other users – many of whom are taking issue with PowerGPU’s claims.",
    "The company is also posting screenshots of the r/AMD Subreddit, where users are posting about their issues.",
    "While PowerGPU’s claimed numbers are high, other PC parts retailers and builders are claiming that the failure rates seem to be normal.",
    "Hardware Unboxed asked some ‘major’ PC parts retailers in Australia, and were told the AMD Ryzen 5000 failure rate was below 2% – which is around normal.",
    "So, what’s going on here? As PowerGPU been unlucky with its high failure rate? Hardware Unboxed suggests that it could be the fault of PowerGPU – either the CPUs were wrongly installed or they were combined with incorrect hardware.",
    "Many other users are suggesting that it is PowerGPU’s fault. However, it would have been pretty embarrassing for a PC building company to publicly call out AMD for something that was its own fault – and by incorrectly building the PCs, no less.",
    "Perhaps that’s why PowerGPU took down its initial tweet. However, it is still replying to users, so it doesn’t appear to be a complete climbdown.",
    "It’s also noticeable that both PowerGPU and Hardware Unboxed tweets on the subjects have people replying that claim their have faulty CPUs, while other users say they have not.",
    "When it comes to consumers, this shouldn’t make too much of a difference, as PC builders will test out their products before sending them out. PowerGPU claims that systems it built that were found to have a DOA Ryzen 5000 chip had the faulty chip removed and replaced with a working one, so none of their customers will receive a faulty product.",
    "However, if the failure rates of this chips does end up being high, it means stock of these processors – which is already very low – could become even more scarce.",
    "It’s a complex picture at the moment, and we’ve contacted AMD to find out what’s going on. A spokesperson told us:",
    "\"AMD is looking into a claim by a custom PC builder regarding higher-than-expected failure rates they are experiencing with Ryzen 5000 series desktop processors. We are unaware of any similar issues at this time.\"",
    "So, AMD is certainly taking these claims seriously, though it doesn't seem to be widespread for the moment. We'll be keeping an eye on this.",
    "Via Wccftech"
  ],
  "headers": {
    "8": "How much of an issue is this?"
  },
  "links": {
    "Ryzen 5000 Zen 3": "https://www.techradar.com/news/amd-ryzen-5000",
    "PowerGPU": "https://www.powergpu.com/",
    "AMD Ryzen 9 5950X": "https://www.techradar.com/news/amd-ryzen-9-5950x-16-core-monster-could-be-the-first-ryzen-chip-to-hit-5ghz",
    "AMD Ryzen 9 5900X": "https://www.techradar.com/reviews/amd-ryzen-9-5900x",
    "AMD 7 Ryzen 5800X": "https://www.techradar.com/reviews/amd-ryzen-7-5800x",
    "AMD Ryzen 5 5600X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-5-5600x-find-stock-here",
    "r/AMD Subreddit": "https://www.reddit.com/r/Amd/",
    "Wccftech": "https://wccftech.com/amd-ryzen-5000-zen-3-desktop-cpus-x570-motherboards-high-failure-rates/"
  }
}