{
  "source": "https://www.techradar.com/news/this-weekends-kindle-deals-offer-excellent-prices-from-amazon-and-best-buy-but-which-sales-are-better",
  "title": "This weekend's Kindle deals offer excellent prices from Amazon and Best Buy - but which sales are better?",
  "category": "tablets",
  "updated": "2021-05-08T11:47:26Z",
  "author": "tabitha-baker",
  "summary": "Grab an additional Shutterfly voucher or Kindle Unlimited free trial",
  "article": [
    "Both Amazon and Best Buy are offering some excellent Kindle deals this weekend, with prices dropping close to their Black Friday record lows. That's perfect if you're looking to make the most of the summer months ahead with a cheap ereader - and plenty of extras as well. However, there are some key differences in each retailer's Kindle deals.",
    "The difference lies in the additional extras packed into these prices. While Best Buy is offering an additional $25 Shutterfly voucher for use on an 8x8 photo book, we'd recommend going with Amazon here. You'll receive a three month subscription to Kindle Unlimited, worth $29.97 - a better incentive for making the most of your Kindle deal and a higher value overall.",
    "The entry level Amazon Kindle is now down to $64.99 (was $89.99), with a $25 discount that brings us to within $5 of the lowest price we've ever seen on the 8GB ereader. However, if you're after a sharper display and waterproofing, you'll also find Kindle deals on the Paperwhite model right now. At $94.99 (was $129.99), we're $10 away from its cheapest price yet but you're still getting an excellent offer.",
    "We do expect these prices to drop even further during the upcoming Amazon Prime Day deals, but if you're after an ereader now these are some excellent offers.",
    "Not in the US? Scroll down for more Amazon Kindle prices in your region.",
    "The Oasis model isn't included in this weekend's Kindle sales, but if you're looking for an even better display than the Paperwhite, a slimline design with ergonomic page turn buttons, and a larger screen you'll find all the latest prices just below. It's worth noting that Amazon is still offering three months of Kindle Unlimited for free with this device as well.",
    "Find out more about the Amazon Kindle Unlimited price, or check out the latest Audible free trials to get even more out of your reading experience. Plus, we're rounding up all the latest Amazon Echo deals this weekend and you can stay tuned for upcoming Prime Day Kindle deals next month as well."
  ],
  "headers": {
    "5": "More Kindle deals"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "$64.99 (was $89.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FKindle-Now-with-Built-in-Front-Light%2Fdp%2FB085VT322X%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5187277516994286000-20",
    "$94.99 (was $129.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAll-new-Kindle-Paperwhite-Waterproof-Storage%2Fdp%2FB07PQ96B6B%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8339650068460413000-20",
    "Amazon Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Amazon Kindle prices": "https://www.techradar.com/news/portable-devices/portable-media/kindle-deals-1296345",
    "Amazon Kindle Unlimited price": "https://www.techradar.com/news/amazon-kindle-unlimited-price-how-much-does-it-cost",
    "Audible free trials": "https://www.techradar.com/deals/the-audible-free-trial-whats-included-and-how-to-get-audible-free",
    "Amazon Echo deals": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals",
    "Prime Day Kindle deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-kindle-deals-2020"
  }
}