{
  "source": "https://www.techradar.com/news/google-is-giving-its-wired-doorbell-the-best-nest-doorbell-battery-feature",
  "title": "Google is giving its wired doorbell the best Nest Doorbell (battery) feature",
  "category": "smart-home",
  "updated": "2021-09-30T09:20:56Z",
  "author": "carrie-ann-skinner",
  "summary": "Opinion: Google’s mains powered doorbell owners have been missing out",
  "article": [
    "Keeping an eye on your property when you’re not around was once a luxury many of us couldn’t afford, as CCTV systems were expensive, required professional installation and resulted in cables running all over your home.",
    "However, thanks to the best video doorbells and home security cameras, keeping an eye on your property when you’re not around has become much more accessible. Many of these devices also offer continuous video recording too, rather than just storing footage when motion is detected, which can be handy if you want a full picture of what’s happening at your home throughout the day.",
    "That is unless you own Google’s original, and currently only, mains-powered video doorbell, the Nest Hello. It’s one of the few on the market that doesn’t let you record video 24/7, unlike it’s recently launched Google Nest Doorbell (battery), which has left some Nest Hello users feeling disappointed.",
    "Google acknowledged this in a blog post and confirmed it plans on “launching a 2nd generation of Nest Doorbell (wired) in 2022” that will support continuous video recording, providing you have a Nest Aware subscription.",
    "One in four homes in the US and the UK owns a video doorbell, according to Strategy Analytics, and it’s no surprise these handy devices have taken off. As well as allowing you to keep an eye on your property when you’re not around, they also ensure you never miss a delivery again and can avoid being caught out by cold callers, as they let you converse with whoever is at your threshold through your smartphone.",
    "For most of us, a video doorbell that stores footage captured by the camera when motion is detected should be enough, but on occasions activity might not be captured. This could be because the sensitivity to activity is too low, or something is blocking the motion sensor, and when this happens it can be frustrating, especially if there is an intruder on your property.",
    "However, video doorbells that record constantly ensure this isn’t a problem as you’ll have a record of what was happening at any given point in the day at your property. This is ideal if you want peace of mind that you haven’t missed anything.",
    "The lack of this feature on the Nest Hello is somewhat frustrating, as consumers shouldn’t be penalized for choosing a mains-powered video doorbell over a battery-operated version. While battery-powered video doorbells are easier to install, and ideal for those that are renting, a mains-powered doorbell means you don’t have to worry about the doorbell being out of action when the battery needs recharging, or investing in additional batteries to ensure this isn't an issue.",
    "If you have an existing chime in your home, a video doorbell that connects to your existing wiring will also mean this rings whenever the doorbell is pressed, rather than needing one of the best smart speakers or best smart displays to ensure an alert is audible. In our eyes, the next generation of the Google Nest Doorbell (wired) can’t come soon enough as continuous recording is one of the most important features on a video doorbell and those that choose to opt for mains power over a rechargeable battery shouldn’t have to miss out."
  ],
  "headers": {
    "4": "Know what happened at any moment"
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Google Nest Doorbell (battery)": "https://www.techradar.com/news/google-nest-doorbell-battery",
    "blog post": "https://www.googlenestcommunity.com/t5/Blog/Message-from-our-GM-Updates-for-our-Nest-customers/ba-p/17122",
    "Strategy Analytics": "https://news.strategyanalytics.com/press-releases/press-release-details/2020/Strategy-Analytics-One-in-Four-Smart-Homes-Have-a-Video-Doorbell/default.aspx",
    "best smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "best smart displays": "https://www.techradar.com/best/best-smart-displays"
  }
}