{
  "source": "https://www.techradar.com/news/oneplus-9-has-a-unique-camera-mode",
  "title": "OnePlus 9 has a unique camera mode",
  "category": "phones",
  "updated": "2021-03-10T15:12:22Z",
  "author": "tom-bedford",
  "summary": "Native tilt-shift",
  "article": [
    "The OnePlus 9 tease-train has left the station: before every phone launch, OnePlus slowly drip-feeds us information about its upcoming device, before taking the wraps off everything else on the day. That's no different in 2021, it seems, as we're already chugging our way down the rails, and OnePlus is tooting the train whistle with vigor.",
    "The latest piece of information doesn't come directly from OnePlus; instead popular tech YouTuber Marques Brownlee was seemingly given permission to post a snap of the OnePlus 9 Pro. The picture shows the camera app in use, and we can see the usual modes: nightscape, portrait mode, pro camera and... tilt-shift?",
    "Tilt-shift is something we haven't seen on a smartphone before - well, not in the native camera app of any recent device, at least, though you can download third-party apps to take such photos.",
    "In very, very basic terms, tilt-shift photography makes a wide-angle picture look like a macro (close-up) snap by fiddling with focus and lens positioning. It takes pictures that look pretty cool, and we'd recommend doing a quick google image search to find some neat snaps.",
    "For the technically-minded among you, we've also got a guide to tilt-shift photography which goes into detail about the complicated technique. Presumably a smartphone tilt-shift mode wouldn't require the skill and actions of typical tilt-shift photography, and it's possible the phone's multiple sensors will collaborate to produce the effect.",
    "So it seems the OnePlus 9 is getting this mode, or at least the Pro model - will this revolutionize the smartphone camera game, or just provide a fun new mode to play around with? At the very least, the phone will have something its competitors don't.",
    "We'll have to see, as the OnePlus 9 launches on March 23, so there's not long to go. Expect many, many more teases from OnePlus in the run-up."
  ],
  "headers": {},
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Marques Brownlee": "https://twitter.com/MKBHD/status/1369654228231327753",
    "guide to tilt-shift": "https://www.techradar.com/news/computing-components/tilt-shift-photography-how-it-works-1085107"
  }
}