{
  "source": "https://www.techradar.com/news/thor-love-and-thunder-casts-gladiator-star-in-mystery-role",
  "title": "Thor: Love and Thunder casts Gladiator star in mystery role",
  "category": "entertainment",
  "updated": "2021-03-30T09:10:45Z",
  "author": "tom-power",
  "summary": "Maximus has joined the fight",
  "article": [
    "It's a busy time for those involved in Thor: Love and Thunder. Not only is filming currently underway in Australia, but director Taika Waititi is continuing to add new faces to the MCU movie's already stacked cast.",
    "According to a Deadline report, you can now add Gladiator and Man of Steel star Russell Crowe to that growing ensemble. The New Zealand-born actor is the latest big-name to join the Thor 4 cast, but it's unclear what role he will play in the superhero flick.",
    "Crowe joins an all-star cast that includes Chris Hemsworth as Thor, Chris Pratt as Star-Lord, Natalie Portman as Jane Foster, and Christian Bale as Gorr the God Butcher.",
    "Waititi is expected to reprise his role as lovable rock-based alien Korg, while Tesse Thompson has also returned as Valkyrie, who is Queen of New Asgard following the events of Avengers: Endgame.",
    "Crowe isn't the only veteran actor who will have a role in Thor: Love and Thunder either. Matt Damon and Sam Neill are believed to be returning in their cameo roles as Asgardian actors from Thor: Ragnarok, while Jeff Goldblum is rumored to be reprising his Grandmaster role from the Thor threequel too.",
    "Deadline has reported that Crowe's role is being kept secret for the time being. Marvel Studios and Disney had allegedly wanted to surprise fans with his reveal as part of the movie. However, images of Crowe hanging out with the Thor 4 cast have emerged online in recent days, which has only added fuel to the speculation fire.",
    "With Damon and Neill returning, it's inevitable that Thor: Love and Thunder will see Asgardian actors performing a humorous re-enactment of Thor: Ragnarok's events.",
    "In Ragnarok, Damon and Neill - as well as Luke Hemsworth - acted out the events of Thor: The Dark World for the Asgardian population. With this trio seen on set, it's pretty much guaranteed that Love and Thunder will poke fun at Ragnarok's events.",
    "That said, we could even see a re-enactment of Avengers: Infinity War and Endgame. Admittedly, Infinity War's opening sequence saw many Asgardians massacred by Thanos, so it's unlikely that this would be mocked.",
    "However, if Endgame is joked about as part of any Love and Thunder Asgardian stage play, Crowe could feasibly play 'Fat Thor' from the fourth Avengers movie.",
    "If Crowe isn't part of that Asgardian acting guild, he could have another small role in Love and Thunder. He might be a scientist who Jane Foster (Portman) seeks out after she acquires Thor-like abilities, and becomes the Goddess of Thunder, to find out what's happening to her.",
    "Alternatively, he could play Old King Thor. In the comics, this is an aged Thor who exists in the far future who becomes the All Father of Asgard after Odin. Thor has had visions of the future in previous MCU movies, such as Avengers: Age of Ultron, so he could conceivably have another in Love and Thunder.",
    "If he does, who is to say that Crowe wouldn't play an older version of the God of Thunder, or even an alternate timeline one now that the Marvel Cinematic Multiverse is a possibility?",
    "Thor: Love and Thunder is currently slated for a worldwide May 6, 2022 release date."
  ],
  "headers": {
    "5": "Who will Russell Crowe play in Thor: Love and Thunder?"
  },
  "links": {
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Deadline report": "https://deadline.com/2021/03/thor-love-and-thunder-russell-crowe-1234723853/"
  }
}