{
  "source": "https://www.techradar.com/news/rainbow-six-quarantine-has-a-new-name",
  "title": "Rainbow Six: Quarantine has a new name",
  "category": "gaming",
  "updated": "2021-06-07T16:54:59Z",
  "author": "samuel-tolbert",
  "summary": "The name has changed and the game has grown",
  "article": [
    "Tom Clancy's Rainbow Six: Quarantine has changed quite a bit since it was first revealed at E3 2019. After a delay, the game was renamed Rainbow Six: Parasite, at least as an internal placeholder. Now, Ubisoft has set the record straight with a new name. The game is now called Rainbow Six: Extraction, which seems to reflect just how it plays.",
    "Rainbow Six: Extraction builds on the concepts first introduced in a limited time event in Rainbow Six: Siege, with different Operators facing off against a strange alien threat. This idea has been built into an entire game, though it seems like quite a bit has evolved over the course of development.",
    "You can listen to the developers at Ubisoft Montreal talk about the changes, including the new official name, in the video below.",
    "Players face an \"ever-evolving\" alien threat while trying to make sure no team members are left behind, so expect more of a PvE take for the game instead of PvP.",
    "The gameplay reveal for Rainbow Six: Extraction will take place during Ubisoft Forward on June 12 as part of E3 2021. It's also possible we'll get an updated release date for the game. Ubisoft is also expected to show more of Far Cry 6, a game slated to be available later in October, though the remake for Prince of Persia: Sands of Time will not be present at this event.",
    "Other big reveals are also coming during and around E3, with Microsoft presenting an Xbox and Bethesda Games Showcase on June 13, with Halo Infinite and Starfield expected to make appearances. Meanwhile, Nintendo has an official E3 2021 Nintendo Direct set for June 15, an event the company says is focused solely on games."
  ],
  "headers": {
    "4": "See more at E3 2021"
  },
  "links": {
    "Rainbow Six: Parasite": "https://www.techradar.com/news/rainbow-six-extraction",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "Xbox and Bethesda Games Showcase": "https://www.techradar.com/news/e3-2021-xbox-and-bethesda-games-showcase-set-for-june-13",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "E3 2021 Nintendo Direct": "https://www.techradar.com/news/breath-of-the-wild-2-release-date-is-in-2022-watch-the-zelda-teaser-trailer-now"
  }
}