{
  "source": "https://www.techradar.com/news/spotify-vs-tidal-which-music-streaming-service-is-best-for-you",
  "title": "Spotify vs Tidal: which music streaming service is best for you?",
  "category": "audio-visual",
  "updated": "2021-04-30T10:32:31Z",
  "author": "olivia-tambini",
  "summary": "The streaming titan does battle with Jay-Z's Hi-Res upstart",
  "article": [
    "Choosing the best music streaming service for your needs can be a little tricky; while streaming is still relatively new in the grand scheme of music-listening, there are so many platforms to choose from these days, two of the biggest being Spotify and Tidal.",
    "Spotify is currently the world’s most popular streaming service, hitting 113 million subscribers in October last year, and continuing to grow; and that’s in spite of mounting competition from the likes of Apple Music.",
    "However Spotify isn’t perfect as a service, and its lossy audio streams have left audiophiles craving a little more fidelity – which is where Tidal comes in.",
    "With a focus on providing Hi-Res Audio at a CD-like level of quality, the platform was acquired in 2015 by hip-hop star Jay-Z, becoming the first major music service to be owned by the artists themselves. As such, Tidal claims to pay higher royalties than its competitors to artists and songwriters.",
    "It’s not just about ethics and audio quality though; both Spotify and Tidal offer different user experiences, pricing structures, and music catalogues. Making the best choice for your needs can be confusing, to say the least.",
    "That’s why we’ve put together this handy guide to both services so you can compare them in one easy place, and hopefully find out whether Spotify or Tidal is the best streaming service for you.",
    "Both Spotify and Tidal offer a number of different subscription tiers – but only Spotify offers a free plan (though it is ad-supported and you can’t listen to tracks in the order you want).",
    "The cheapest paid Spotify plan is Spotify Premium, which costs $9.99 / £9.99 / AU$11.99 per month, and gives you unlimited access to its 30 million-plus track library on your laptop, phone, and tablet. Spotify Premium also lets you download tracks to three devices at a time for offline playback.",
    "Discounts are available for students, and you can even get Premium and access to mindfulness app Headspace under one discounted plan. Students get Headspace access as part of their Premium package.",
    "If there are a few people in your household that want to use Spotify, you can save money by signing up to a Spotify Premium for Family account, which allows up to six people to connect to Spotify at one time (if you try to do this with a regular account, you’ll get bumped off the service as soon as another user plays a song). This tier costs $15.99 / £16.99 / AU$17.99, and requires all members to live under the same roof.",
    "Tidal offers two subscription plans, the cheapest being Tidal Premium, which costs $9.99 / £9.99 / AU$11.99, and offers streams at a bitrate of 320kbps – the same audio quality as Spotify.",
    "If it’s Hi-Res Audio you’re after, you’ll need to shell out for $19.99 / £19.99 / AU$23.99 per month for Tidal HiFi. So, Spotify offers cheaper subscription plans, but it doesn’t provide a higher fidelity tier for audiophiles like Tidal does.",
    "One of the reasons that Spotify is so popular is down to its easy-to-use interface. When you open up the app, you’ll find a number of personalized playlists - your ‘Daily Mixes’ – that have been curated by Spotify based on your listening habits, alongside your top artists, top playlists, and new releases.",
    "That’s a thing to note about Spotify; there are a lot of playlists. That might sound daunting, but it’s a strategy that works as its algorithms ultimately tailor the app to each user.",
    "Everything is laid out in colorful tiles that pop against Spotify’s dark background. The tile system is just small enough to make selecting new albums and playlists easy while packing in plenty into a timeline of content that’s ultimately curated to what you’ve been listening to and what you might want to jump into next.",
    "On the desktop app and web player, there’s a sidebar on the left of the screen that lets you navigate new music releases, radio stations, as well as your library, playlists, recently played songs and more. In the mobile app these sections are a little more hidden away to save space, and it’s worth noting that the layout of the desktop and mobile platforms are a little different.",
    "Searching is very intuitive and even if you misspell an artist’s name, Spotify will generally find what you’re looking for.",
    "Tidal uses a similar tile-based interface on a dark background, and you’ll find curated playlists, recommended albums, and charts on your home screen. Clicking the sidebar will take you to your ‘My Music’ area, where you’ll find all your saved tracks, and browsing is generally very easy.",
    "You can’t search by genre, unlike Spotify, which is a shame for a platform aimed at true music lovers. Search generally isn't terribly smart - misspell an album or artist name even by one character or one piece of punctuation, and you'll be left with zero results. A bit of optimization here wouldn't hurt, but as long as you're careful you won't have any problems with it.",
    "Saying that, Tidal does boast one cool feature that Spotify doesn’t; audio-search is essentially like having Shazam built directly into the app. Press the button and it’ll listen out for any song it can pick up in your environment, identify it, and allow you to save it to your own Tidal library.",
    "You can get Spotify on Android, iOS and Windows Phone devices. If you use a laptop or desktop, Spotify also supports OS X and Windows, and there’s a flash-based web player, too.",
    "Support for Tidal is largely the same, so you can get it on devices that run iOS 11 and higher, Android 5 and higher, macOS, and Windows. Both streaming platforms are also supported by a number of more left-field gadgets, including AV receivers, TVs, and even cars.",
    "Spotify currently boasts over 50 million songs, whereas Tidal claims to have 60 million tracks in its catalogue.",
    "Spotify’s strong influx of tracks helped it take off in its early days, and with a reported 40,000 tracks added on average every single day – and it’s showing no signs of slowing down.",
    "The streaming giant has a heavy focus on promoting new tracks and breakthrough artists, through curated playlists like New Music Friday acting as a launch pad for fledgling artists to break through into the big time.",
    "Curated playlists are almost always the first thing you see when you load any version of the app, with the service seemingly designing playlists for almost every musical sub-genre. These are constantly being updated too, so your favorite ones never grate following extended use.",
    "As we mentioned before, you’ll also find personalized playlists based on your listening habits, which is a fantastic way to discover new music, as well as revisiting some of your favorite tracks.",
    "Spotify does have some glaring omissions in its music catalog, however, largely down to artists who don’t want to make their music available to stream anywhere or artists who have a particular dislike of Spotify’s royalty payments.",
    "You won’t find artists like Joanna Newsom and Garth Brooks on Spotify, and until fairly recently you couldn't even listen to The Beatles – though you’ll find their entire discography on the streaming platform these days (thank goodness).",
    "Some of the artists who are absent from Spotify have close ties to Jay-Z and therefore favor his platform, Tidal. Beyoncé’s 2019 album Lemonade debuted on Tidal exclusively, for example.",
    "That means Tidal’s catalogue can feel somewhat skewed towards hip-hop and rap artists, though it’s possible that this is down to the platform’s editorial curation of its tracks.",
    "That being said, Tidal does a good job of curating music playlists based on your listening habits, and you’ll find that just a few weeks of use will give its algorithms enough information to serve you truly exciting recommendations.",
    "Aside from these personalized recommendations, Tidal also signposts the most popular playlists and releases on its service, as well as mood-based playlists, and the Tidal Rising section, which flies the flag for new talent.",
    "Both platforms also offer podcasts, though it seems like Spotify is taking this area a little more seriously, having spent over $200 million to acquire two podcast production companies in 2019.",
    "If you subscribe to Spotify Premium, you can choose between three sound quality levels: normal, high and extreme. When using the mobile and desktop apps, Spotify uses Ogg Vorbis. This was a semi-popular format a decade ago, and Spotify continues to use it because it's open source. Spotify doesn't have to pay a license fee for it.",
    "At Standard setting, music streams at 96kbps, which sounds a lot better than MP3 at 129kbps. Switch up to the high quality setting and the bitrate bumps up to 160kbps. The extreme setting uses 320kbps, which is perceptually close to lossless. Spotify doesn't offer any lossless or Hi-Res streaming, which is one reason why audiophiles might want to consider another service.",
    "If you’re dead-set on the best possible audio quality, then Tidal is your best bet. For that, you’ll need a Tidal HiFi subscription, which allows you to stream lossless 16-bit FLAC and ALAC audio – though there are also thousands of TIDAL Masters files that stream at 24-bit.",
    "Even if you opt for Tidal Premium, its catalogue is still available to stream in 320kbps, the same quality as Spotify’s highest setting – and you may even find that Tidal’s tracks sound a little richer at this setting.",
    "So, why bother with lossless streaming? Well, Hi-Res Audio codecs are capable of reproducing the full range of sound from recordings that have been mastered from better-than-CD quality music sources, a sound that closely replicates the quality that the musicians and engineers were working with in the studio at the time of recording.",
    "The increased bit depth of HRA improves the dynamic range, basically giving you a greater breadth of things to actually hear from the recording, making tracks sound more detailed and clear.",
    "It’s a little like the difference between SD and HD television; the former works just fine, but you’ll notice a real difference in quality if you make the upgrade to higher resolution audio.",
    "Choosing between Spotify and Tidal largely comes down to whether you care about Hi-Res Audio; if you do, you won’t find it in Spotify, and you should absolutely opt for Tidal.",
    "It’s also worth considering Tidal if you’re a devoted fan of specific artists like Jay-Z, Beyoncé, Kanye West, and others – these artists are likely to release music exclusively on Tidal, at least to begin with, with releases trickling down to Spotify months later.",
    "Even with these few omissions, Spotify and Tidal are pretty much on the same level in terms of music catalogue and discovery, and both platforms’ cheapest subscription tiers cost the same (though only Spotify offers a free service).",
    "Spotify does win out in terms of its interface; while the two platforms are pretty similar in this regard, Spotify’s search function is much better than Tidal’s, and it’s just a little bit easier to navigate as a platform."
  ],
  "headers": {
    "6": "Price and availability",
    "12": "User interface",
    "20": "Compatibility",
    "22": "Music catalogue and discovery",
    "34": "Audio quality",
    "41": "Takeaway"
  },
  "links": {
    "best music streaming service": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "hitting 113 million subscribers": "https://www.techradar.com/news/amazon-music-could-soon-beat-apple-but-spotify-is-still-the-streaming-king",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "AV receivers": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy",
    "TVs": "https://www.techradar.com/news/lg-oled-tvs-are-having-production-issues-heres-why-that-matters"
  }
}