{
  "source": "https://www.techradar.com/news/macbook-air-2020-vs-macbook-pro-2020-which-is-the-best-for-you",
  "title": "MacBook Air (2020) vs MacBook Pro (2020) which is the best for you?",
  "category": "computing",
  "updated": "2021-10-25T22:10:07Z",
  "author": "john-loeffler",
  "summary": "The battle of the Apple M1 laptops",
  "article": [
    "When it comes to the Apple MacBook Air (2020) vs MacBook Pro (2020) in the battle for the M1 crown, it's really going to come down to whether you're looking for the best price or best performance.",
    "The MacBook Air (2020) and MacBook Pro (2020) are two of the best 13-inch laptops you're going to find anywhere and even give the very best laptops on the market a run for their silicon.",
    "Speaking of, both are powered by the Apple M1 chip, but they come with enough to distinguish them from each other to justify the difference in price.",
    "If you're looking for one of the best Ultrabooks around, the Apple MacBook Air has always been a hit, and the MacBook Air (2020) isn't any different. If you're looking for the best student laptops, you can't go wrong with the MacBook Air (2020).",
    "If you're looking for the best mobile workstation to easily take with you on the go, the 13-inch Apple MacBook Pro (2020) is hard to beat. It might not be as powerful as the beefier MacBook Pro 16-inch (2021), which comes with the much more powerful Apple M1 Pro and M1 Max chips, but it offers a great balance between portability and performance that is hard to beat.",
    "So how does the MacBook Air (2020) vs MacBook Pro (2020) shake out by the numbers? We're glad you asked.",
    "When it comes to the Apple MacBook Air (2020) vs MacBook Pro (2020) in terms of price and specs, you really get into the primary difference between the two devices.",
    "In terms of price, the MSRP for the M1-powered MacBook Air (2020) starts at $999 / £999 / AU$1,599, which comes with the 8-core CPU and 7-Core GPU version of the M1 chip, 8GB RAM and a 256GB SSD.",
    "There is a higher-specced model for $1,249 / £1,249 / AU$1,949 that comes with the slightly more powerful 8-core CPU and 8-Core GPU version of the M1 chip, 8GB RAM, and a 512GB SSD.",
    "Both these are available with an upgrade to 16GB RAM for an extra $200 / £200 / AU$300 and up to 2TB SSD for an additional $800 / £800 / AU$1,200.",
    "The MacBook Pro (2020) on the other hand, starts at $1,299 / £1,299 / AU$1,999, which comes with the 8-core CPU/8-core GPU version of the M1 chip, 8GB RAM and a 256GB SSD. You can bump this up to 16GB RAM and a 2TB SSD for $2,299 / £2,299 / AU$3,499.",
    "It's important to note here that even though the MacBook Air (2020) and MacBook Pro (2020), both feature the M1 chip and that a MacBook Air with 8GB RAM and a 512GB SSD is about the same price as the MacBook Pro's starting configuration with a bigger SSD and the same 13-inch Retina display that also supports the P3 color gamut, which was previously exclusive to the MacBook Pro models.",
    "Here is where the rubber hits the road in terms of performance, since even though the specs are nearly identical, the MacBook Air features a fanless design. This means that as heat builds up over prolonged use, your MacBook Air (2020) might start throttling performance to reduce heat.",
    "If you plan on working for a longer stretch of time with your new laptop, the performance of the MacBook Air (2020) vs MacBook Pro (2020) is going to become very noticeable, and could possibly be the deciding factor. If you are going to be working on intensive tasks like video editing for several hours, the MacBook Pro (2020)'s performance will be much more up for the task than the MacBook Air (2020).",
    "There isn't a lot of difference in the design of the MacBook Air (2020) and MacBook Pro (2020), other than the thickness of the two laptops. The MacBook Air (2020) is thinner but, with the same screen size as the MacBook Pro (2020), it has the same dimensions otherwise.",
    "You also get the same silver chassis design, touchpad, and keyboard, so there isn't much that really distinguishes the two from one another. If you like the look and build of one, you'll probably like the look of the other. If you're buying a MacBook with the design in mind, it will really come done to whether you want a highly portable laptop or an ultra-portable one.",
    "The biggest difference here, though, is with the new fanless design of the MacBook Air (2020). This allows the MacBook Air (2020) to be whisper quiet while you work, which is great if you're working around others and load fan noise could be a distraction. As we noted above though, it comes at cost of sustained performance when you need to work for extended stretches.",
    "Here, too, there isn't much difference between the MacBook Air (2020) and MacBook Pro (2020). Both laptops feature a 13.3-inch, 2,560 x 1,600p Retina True Tone display, so one of the MacBook Pro's key advantages over the MacBook Air is now gone.",
    "As far as the quality of the display, you're going to get the same experience from both laptops.",
    "Fortunately, both the MacBook Air (2020) and the MacBook Pro (2020) feature Apple's Magic Keyboard, so no need to worry about the Butterfly Keyboard of yesteryear, which featured some reliability problems that really dragged it down.",
    "The big difference between the MacBook Air (2020) vs MacBook Pro (2020) is the TouchBar, which the MacBook Pro (2020) features but the MacBook Air (2020) lacks. Otherwise, they both also feature the TouchID fingerprint scanner, which is one of the best out there.",
    "When it comes to the MacBook Air (2020) vs MacBook Pro (2020), the two most important issues you need to decide on is how much are you willing to spend and how much performance will you need.",
    "When it comes to price, the MacBook Air (2020) has a lot to offer and still provides a powerful user experience for general computing and lighter-weight tasks for a relatively accessible price.",
    "If you need to do some heavy-duty lifting though, the MacBook Pro (2020) really pulls ahead of the MacBook Air (2020). The fans might be loud at times and they might make the laptop itself somewhat thicker, but they also do their job managing heat, so you can run the new M1 chip at full tilt for much longer than the MacBook Air (2020).",
    "As it has been before, with the Apple MacBook Air (2020) vs MacBook Pro (2020), if you need a higher level of performance, you're going to lean heavily if not decisively towards the MacBook Pro (2020). If you just need a great, highly portable laptop for all-around computing needs and productivity work, then the MacBook Air (2020) is about as good as its gets, especially for the money."
  ],
  "headers": {
    "6": "Price and specs",
    "14": "Design",
    "17": "Display",
    "19": "Keyboard",
    "21": "MacBook Air 2020 vs MacBook Pro 2020: which one should you buy?"
  },
  "links": {
    "MacBook Air (2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pro (2020)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "best 13-inch laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-13-inch-laptops-which-is-right-for-you-901574",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "best student laptops": "https://www.techradar.com/news/mobile-computing/laptops/10-best-laptops-for-students-983385",
    "best mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "MacBook Pro 16-inch (2021)": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "Apple M1 Pro and M1 Max": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date"
  }
}