{
  "source": "https://www.techradar.com/news/destruction-allstars-is-worth-a-spin-but-lacks-longevity",
  "title": "Destruction AllStars on PS5 is worth a spin, but it lacks longevity",
  "category": "gaming",
  "updated": "2021-02-05T10:44:27Z",
  "author": "jordan-oloman",
  "summary": "Opinion: Some middling mayhem that crashes and burns",
  "article": [
    "PlayStation Plus members should definitely give Destruction AllStars a go. You can’t argue with the low price of free – subscription fee aside – and if you’re one of the lucky few who have managed to pick up a PlayStation 5, it’s a great excuse to play a truly next-gen multiplayer game with your friends for the first time.",
    "The visuals are striking, and live up to the previously released teaser trailers, while the characters are quirky, over the top, and unique. The game makes the most of the DualSense controller’s adaptive triggers and haptic feedback technology, too, which help give it that next-gen feel.",
    "Destruction AllStars is a good test bed for the PS5’s potential, then, but unfortunately for this vehicular arena-based combat game, it can get rather boring... fast. Destruction AllStars ultimately feels like it’s trying to be too many games at once, without excelling in any one area in a meaningful way. It’s also sorely lacking a battle pass or some kind of underlying progression system to help keep people playing right now, though one is on the way.",
    "The DNA of the edgy custom-car-smasher Twisted Metal courses through this game, albeit filtered through a more trendy Rocket League aesthetic. Burnout’s famous directional shunting mechanics have also been grafted in for good measure, and this is arguably where the game achieves its greatest success. It feels really good to ram into other player’s cars, and older players will be reminded of Destruction Derby on the original PlayStation when pile-ups get particularly frantic.",
    "It’s clear that the game has some great elements, then, but I wish the developers had focused more on one of these inspirations rather than all of them – sadly, everything that surrounds the game’s Burnout-esque ramming mechanic only serves to drag the game down.",
    "The driving feels satisfyingly weighty in Destruction AllStars. You’re always pulling hard on the sticks to line up a spectacular wreck, and when you miss (and be prepared to miss quite a lot) it's often agonizing. You spend a lot of time trying to position yourself up throughout matches, spinning around and feeling disoriented. But then when you do get into a nasty pile-up, the adrenaline tapers out in seconds as everything grinds to a strange halt.",
    "The chaos feels surprisingly organized, too. When several cars get stuck into each other, everyone starts awkwardly reversing out or leaving their banged-up motor for a shiny new model. And exiting your car to traverse the map on foot should be Destruction AllStars’ ace in the hole, but I’m not convinced it adds much to the actual gameplay. Leaping and bounding over cars sure looks cool in the close-up slow-motion footage on the main menu, but this is far from the in-situ reality.",
    "Your actions don’t feel very fluid and they suffer from long cooldowns. You also don’t get into satisfying back and forth scraps with your fellow drivers very often – you’re just running around like a headless chicken on a busy motorway, lunging towards nothing and worrying about your contribution to the scoreboard.",
    "Parkour sections are peppered above the maps, providing platforming puzzles that you can complete for gems that let you build your special ability meters. But given how easily they build anyway, I don’t see the point. In multiplayer, the objectives are so frantic and demanding that I always felt like I was letting the team down if I stopped committing to KO’ing the opposing drivers at all times, so it’s hard to justify the climb.",
    "The only time being outside of your car really makes sense is in the game mode Stockpile, one of only four currently in the game. Stockpile sees you collect gears from wrecked drivers on foot. This teases out some of this idea’s potential, but it’s still not very convincing. Same goes for the carjacking mechanic, which is heavily weighted against the driver, who has to wiggle a control stick to escape, quickly pulling players out of their flow. You’re better off accepting defeat and trying to escape as soon as possible when this happens, as there’s always a steady stream of new cars – it’s strangely never a big deal.",
    "Outside of the aforementioned Stockpile, the game offers a mode called Gridfall, a half-baked vehicular spin on the Hex-A-Gon minigame from Fall Guys. There’s also Mayhem, a more stoic demolition derby deathmatch, but the best of the bunch is easily Carnado. Players must accrue points by wrecking others and then wreck their own car in a giant tornado to bank the points. It’s dumb fun, which is a neat summary of this game’s mediocre appeal.",
    "Destruction AllStars is by nature a competitive game, but it’s certainly easier to enjoy if you strip out that aspect and just focus on having fun. Its moment-to-moment brainlessness robs it of any esports potential because it just can’t strike a meaningful balance between competition and casual silliness. Focusing on the objective doesn’t feel like a tactical, rewarding way to play the game. It just leaves you overwhelmed by the end of the round. If you do fancy playing it, don’t worry too much about winning, just switch your grey matter off and start smashing up the place.",
    "There are 16 characters in Destruction AllStars, and it’s a classic case of too many cooks. The character designs themselves are fantastic: there’s a box-headed postman wearing short shorts, a Tony the Tiger cosplayer and a Russian influencer donning a skeleton onesie.",
    "But the wide diverse roster means unique abilities are spread so thin that none of them feel meaningful or built to create a sense of balance. It’s trying to be a hero shooter, but I don’t really feel the difference between, say, the driver that can slice cars in two and the driver that shreds them. Similarly, a handful of heroes have area-of-effect damage abilities that could be interchangeable.",
    "But to be honest, It’s not clear how you’re even meant to know what specific ability killed you, or how to counter it, or what team compositions might counter certain enemies in battle. These are all competitive considerations when building a ‘hero shooter’ roster that seem to have been overlooked in Destruction AllStars in favor of manic accessible demolition. This might work for some, but it’s going to be hard to get players to commit long-term to something so shallow.",
    "It might survive on the basis of being free and one of the few PlayStation 5 exclusives on the market, but it wont' really hold your attention for long, especially if you’re looking for a game with substance that can be played regularly with friends. The addition of microtransactions certainly doesn’t help sell a promising future for Destruction AllStars either, especially when they’re tied to unlocking challenge runs that reward players with uninspired palette-swap cosmetics.",
    "A distinct lack of nuance is Destruction AllStars most obvious problem. When the fundamentals start to feel stale, how is a free game like this going to sustain a committed audience, when all of their actions feel like a flash in the pan? There’s not much incentive to stick around without the potential for tactical play, or any incentive to communicate with your teammates. This may be another redemption story months down the line, but at the moment, this chaotic hero smasher is fun for a few hours, but quickly loses its admirable introductory shine."
  ],
  "headers": {
    "5": "Mutually assured destruction",
    "8": "Grand Theft Auto",
    "12": "Too many cooks",
    "16": "Wrecked"
  },
  "links": {
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-deals",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "Rocket League": "https://www.techradar.com/news/gaming/7-tips-to-help-you-be-a-better-rocket-league-dueller-1315004",
    "Fall Guys": "https://www.techradar.com/how-to/fall-guys-tips-guide"
  }
}