{
  "source": "https://www.techradar.com/news/februarys-ps-plus-free-games-include-ps5-improved-control-and-destruction-allstars",
  "title": "February's PS Plus free games include PS5-improved Control and Destruction Allstars",
  "category": "gaming",
  "updated": "2021-01-27T17:37:22Z",
  "author": "vic-hood",
  "summary": "It's a fantastic offering",
  "article": [
    "Sony has officially announced its free PS Plus games for February 2021 and it's a fantastic offering. PS Plus members will be able to get their hands on Control: Ultimate Edition, Destruction Allstars and Concrete Genie.",
    "It's one of the best lineups we've seen yet, especially when you take into account that Destruction Allstars will be available on PS Plus from its launch day on February 2, giving PS5 owners the chance to check out the vehicular combat game for free as soon as it lands. It's worth noting though, this game is only available on PS5.",
    "But it isn't just Destruction Allstars that has us excited. Control: Ultimate Edition is also on offer. Nevermind the fact that supernatural thriller Control is considered one of (if not the best) game of 2019, players will be able to play either the PS4 or PS5 version of the game - with the PS5-enhanced version releasing on the very day it comes to PS Plus. The Ultimate Edition means that those who decide to play on PS5 will be treated to a next-gen upgrade.",
    "Finally, indie gem Concrete Genie is also on offer, which follows the heartwarming story of a bullied teen called Ash who possesses a magic paintbrush that he uses to paint mischievous genies which help to solve puzzles and ward off those wretched bullies. Concrete Genie is a PS4 title, but PS5 players can try it out thanks to backward compatibility - just don't expect next-gen visuals.",
    "Remember, you need to be an active PlayStation Plus subscriber to pick up these free PS Plus games – and they're yours to play whenever you want as long as you remain a subscriber.",
    "Being a PS Plus subscriber means you can play online with friends, but also means you get to take advantage of discounts and free games each month. It's great way to try PlayStation games you might not otherwise have played, whether they're indie titles that slipped under your radar, or titles that were too expensive to buy. Each month we see Sony offering a mix of PS4 and PS5 games, so it's worth getting even if you haven't upgraded yet.",
    "All these games will be available from February 2, with Control and Concrete Genie available until March 1. However, Destruction Allstars is available a bit longer than normal, free to grab until May 4."
  ],
  "headers": {
    "4": "A worthy investment"
  },
  "links": {
    "free PS Plus games": "https://www.techradar.com/news/playstation-plus-free-games",
    "Control": "https://www.techradar.com/reviews/control-review",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games"
  }
}