{
  "source": "https://www.techradar.com/news/nvidia-geforce-rtx-3050-and-3050-ti-laptop-gpu-specifications-revealed-by-lenovo",
  "title": "Nvidia GeForce RTX 3050 and 3050 Ti laptop GPU specifications revealed by Lenovo",
  "category": "computing",
  "updated": "2021-04-20T10:33:19Z",
  "author": "jess-weatherbed",
  "summary": "Entry-level mobile RTX is on the horizon once again",
  "article": [
    "Despite not being officially announced by Nvidia yet, the long-rumored GeForce RTX 3050 Ti and RTX 3050 mobile graphics cards have had their respective specifications leaked by Chinese PC manufacturer Lenovo. These new laptop GPUs are anticipated to be the lowest entry in the Ampere series, and previously leaked benchmarks indicate we should expect performance somewhere between the GTX 1660 Ti Max-Q (a smaller, cut down version of the usual mobile GTX 1660 Ti used in slimmer devices) and the RTX 2060 Max-Q, making these the first graphics cards to include ray tracing below the usual 60 series, with the previous baseline being the RTX 2060.",
    "Videocardz reported on the information listed on the Lenovo site that reveals both the standard and Ti version of the card will be a GA107 GPU, a variant currently unused by Nvidia in any of its other graphics cards. Both Laptop SKUs will feature a small memory capacity and short bus with up to 4GB of GDDR6 memory across a 128-bit interface. These specifications suggest we're looking at an entry-level 1080p GPU, but It's worth bearing in mind that these are RTX models, so are not only equipped with raytracing capabilities but also DLSS. With the assisted AI framerate booster, you might be getting a lot more performance than older non-RTX models and at a (hopefully) affordable price point.",
    "It was previously also rumored that the RTX 3050 series Total Graphics Power (or TGP as it's usually abbreviated to) would start from around 60W, however the information over on the Lenovo site suggests the SKU could achieve up to 80W, pushed to 95W if used with the supported Dynamic Boost technology for some additional oomph.",
    "The Lenovo Legion 5 Pro laptop from the leak will come with a choice of either of the two new RTX 3050 GPUs, or the already released RTX 3060 or RTX 3070. These will all be uncapped Max-P variations rather than the slimmer Max-Q, theoretically giving you a more powerful device. You'll also be getting a 16-inch and 16:10 aspect ratio display and up to a Ryzen 7 5800H CPU.",
    "The GeForce RTX 3050 and RTX 3050 Ti are anticipated to also come in a desktop variant, but the development has been rife with delays and changes. We're still expecting the GPU to launch, but there is currently no expected date for this and nothing to confirm that both the desktop and mobile GPUs will launch together, but given the mobile version is already being spotted in pre-release laptops, it shouldn’t be too long now before we see them on the shelves."
  ],
  "headers": {
    "2": "A first step into RTX gaming"
  },
  "links": {
    "GeForce RTX 3050 Ti": "https://www.techradar.com/news/nvidia-rtx-3050-ti-gpu-spotted-in-leak",
    "RTX 3050": "https://www.techradar.com/news/nvidia-rtx-3050-rumor-gets-gamers-excited-about-a-powerhouse-budget-gpu",
    "previously leaked benchmarks": "https://www.techradar.com/news/nvidia-rtx-3050-and-3050-ti-laptop-gpus-look-promising-in-leaked-benchmarks",
    "Videocardz": "https://videocardz.com/newz/lenovo-confirms-geforce-rtx-3050-ti-and-rtx-3050-laptop-gpus-tgp-and-clocks",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "Lenovo Legion 5 Pro": "https://www.techradar.com/news/lenovo-unveils-new-additions-for-the-legion-gaming-laptop-range-at-ces-2021",
    "Max-P": "https://www.techradar.com/news/geforce-rtx-3000-laptop-gpu-benchmarks-have-started-to-appear",
    "Ryzen 7 5800H": "https://www.techradar.com/news/amd-ryzen-7-5800h-cpu-destroys-predecessor-and-could-worry-intel-in-leaked-benchmark",
    "spotted": "https://www.techradar.com/news/nvidia-rtx-3050-ti-gpu-could-soon-power-up-budget-gaming-laptops",
    "pre-release laptops": "https://www.techradar.com/news/nvidia-rtx-3050-ti-gpu-spotted-in-leak"
  }
}