{
  "source": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
  "title": "Qualcomm Snapdragon 8 Gen 1 features, news, compatible phones and what it can do",
  "category": "phones",
  "updated": "2021-12-01T21:17:03Z",
  "author": "james-peckham",
  "summary": "Our introduction to the next big phone chipset",
  "article": [
    "If you’re a fan of Android phones then the Snapdragon 8 Gen 1 is a big deal, as this upcoming chipset will almost certainly power many of the best Android phones of 2022.",
    "The latest innovation from Qualcomm is now here after the company introduced its new Snapdragon 8 Gen 1 platform at its annual Tech Summit event. This is the new chipset that we expect to see powering a lot of the top-end phones in 2022 and beyond.",
    "It's the sequel to the Snapdragon 888 (and its sibling the Snapdragon 888 Plus) that was introduced in 2020 and featured on smartphones like the Galaxy S21, OnePlus 9 Pro, Oppo Find X3 Pro and Xiaomi Mi 11.",
    "That means we'll likely see it included in the next iterations of those phones, so we expect manufacturers like Samsung, Oppo, Xiaomi, OnePlus, Motorola, Realme and many more to include this chipset in their absolute best smartphones.",
    "This is top-end power, so it's reserved for the most expensive devices. If you're a smartphone fan, you've likely noticed that the new chipset also has a new naming structure, too. We expected this to be called the Snapdragon 898, but Qualcomm moved to what it believes is a more \"simplified\" naming structure.",
    "A lot of phones are likely to use the Snapdragon 8 Gen 1, and five devices have been confirmed so far. They are the Xiaomi 12, a new Motorola Edge handset, Oppo's upcoming flagship, the next flagship OnePlus phone and the Realme GT 2 Pro.",
    "The Xiaomi 12 is the first phone that will feature the chipset, while we expect that new OnePlus and Oppo phones will be the rumored OnePlus 10 and Find X4. The new Motorola Edge is a touch more complicated, and we have reason to believe it'll be a China-only device.",
    "Rumored handset include the Samsung Galaxy S22 range, which will reportedly use this chipset in either most or all parts of the world. That’s a change, as typically Samsung splits its Galaxy S models between the latest Snapdragon and the latest Exynos.",
    "The Samsung Galaxy S22 range is likely to land in February, but before that we could see the Snapdragon 8 Gen 1 in the Xiaomi 12 in December (though that launch will probably only be for China, with the rest of the world getting it later).",
    "Leaks also suggest that the Huawei P60 range could use this chipset. That’s slightly surprising as Huawei usually makes its own, but the US trade ban has complicated things there. Finally, there’s also evidence of the Snapdragon 8 Gen 1 being used in at least one Vivo phone.",
    "Beyond the leaks and rumors, we also expect other phones like Sony Xperia 1 IV to use this chipset, based on past form, as probably will the Samsung Galaxy Z Fold 4, the Samsung Galaxy Z Flip 4, and many other phones.",
    "Don't expect Pixel phones in 2022 to be using this as it's likely Google will continue using its own Tensor chipset. One oddity is a rumor that Samsung won't be using its Exynos chipsets in certain models of the Galaxy S22.",
    "Basically, if you buy a high-end Android smartphone in 2022, there’s a good chance the Snapdragon 8 Gen 1 will be at its heart.",
    "The Snapdragon 8 Gen 1 is designed to offer a top-end flagship experience. Be aware though, not every manufacturer will use each of the features below.",
    "A lot of the new features we talk about are now are an option for manufacturers to implement, but not every phone maker in 2022 will decide to introduce each of the below features. So don't expect these features to be guaranteed in your smartphone when you unpackage it in 2022.",
    "Ziad Asghar, VP of Product Management at Qualcomm, told TechRadar during a briefing that the new chipset introduces, \"The biggest changes that we've ever brought about in a product.\"",
    "That's a big claim (and one we'd expect Qualcomm to make) so we'll be breaking down every feature we've learned about so far.",
    "First off, the CPU has been improved by being 20% faster than the last generation; it also offers 30% power savings. That should hopefully result in better overall performance on your smartphone, and perhaps longer battery life.",
    "The CPU (central processing unit) is the brains of your phone for everyday tasks such as booting up and running apps, or navigating around your phone's operating system. Improvements to the CPU performance should mean your phone is slicker and speedier than previous generations.",
    "Those stats aren't the biggest jump in numbers we've seen from a new Qualcomm platform, but the Snapdragon 888 Plus was already one of the most powerful chips on the market so we didn't expect a huge improvement here.",
    "Artificial intelligence features also remain a focus for Qualcomm, and the company is partnering with Google Cloud to introduce its Cloud Vertex AI Neural Architecture Search features into the Snapdragon 8 Gen 1 platform.",
    "A Qualcomm spokesperson said, \"It allows [manufacturers] to apply Neural Architecture Search techniques, and would let [manufacturers] be able to optimize the model to the fullest extent to be able to get the most optimal models for best accuracy\".",
    "Essentially, you should expect the best possible artifical intelligence features from this latest Snapdragon platform. Plugging in Google Cloud's features should only offer improvements here, but it's currently unclear what exactly this will offer.",
    "Most of the exciting improvements for the Qualcomm Snapdragon 8 Gen 1are in the camera, which opens up a whole new variety of features for manufacturers to introduce to your smartphone's snapper.",
    "The image signal processor (ISP) has been improved on this chip with it introducing 4,096 times more camera data than previous models. It was previously a 14-bit ISP on the Snapdragon 888, and this features an 18-bit one.",
    "Those four extra bits allow for improved dynamic range, which should mean you'll be able to take photos with brighter bright areas and darker dark areas.",
    "Faster shooting in burst mode is now possible, and Qualcomm has doubled the number of photos you can take in quick succession. For example, in one second you can now take 240 12MP photos using the burst mode features.",
    "Wide-angle photography may also be improved on your next phone. A new de-warp technology and Chromatic Aberration Correction have been introduced here, and they're designed to improve wide-angle shots.",
    "Facial recognition technology has been improved on the latest Snapdragon with the company saying it's faster and more accurate than ever. We've yet to get any hard data specifically on that claim, though.",
    "The company says it will better track the position of your nose, mouth, eyes, eyebrows, jawline and more. There are more than 300 facial landmarks now being used by the platform, but we're not clear on how many were used on previous generations.",
    "The platform allows for you to shoot in 8K HDR for the very first time, and that's both HDR 10 and HDR 10 Plus. Not many smartphones currently offer 8K video recording – and it's rare you'll find a screen that is capable of making use of the footage – but it's a useful feature for future smartphones.",
    "Sticking on video recording, and a new feature called Video Super-Resolution for Extreme Zoom should mean that your phone's telephoto camera can record better video. It's rare you'd want to shoot video at long distances, but this could be better on future smartphones.",
    "The final video feature is a new bokeh engine that will allow for the blurred effect on the rear of your portrait shots. This will be like how it works on Portrait mode on many top-end smartphones, but the capability here is up to 4K video.",
    "We've seen this introduced on the iPhone 13 series previously, although it was called Cinematic Mode. It'll be interesting to see which Android manufacturer includes this feature first.",
    "Another big camera feature is the fact you can record video, but also take photos at the same time. This is up to 8K HDR video, while the camera also takes 64MP shots. It's not entirely clear how this would be implemented yet, but it's a feature you may find helpful when shooting certain moments that you also want photographs of.",
    "Finally, you'll also be able to shoot in 18-bit RAW for the first time. This is likely a feature that will appeal to true camera enthusiasts who want to export raw images for editing.",
    "Another big improvement is in gaming, which introduces an AI engine that offers 4x faster artificial intelligence performance than the Snapdragon 888. It'll be interesting to see how this works in real life.",
    "The Adreno GPU is 30% faster than the last-gen chipset, while the Vulkan is 60% faster. That essentially means you'll be getting into your games quicker, and they should run better than your previous smartphones.",
    "A new feature called Adreno Frame Motion Engine will allow you to double the frame rate in the games you're playing while maintaining the same power levels. Qualcomm also confirmed the feature would allow you to keep playing at the same frame rate, but you'd be using half the power.",
    "There are further gaming features to be introduced on the Snapdragon 8 Gen 1, but we haven't heard about them in full yet. Expect to see more in this article at a later date.",
    "A new always-on camera is an impressive introduction with the Snapdragon 8 Gen 1. The idea here is your phone's camera would be able to constantly be running, and then software developers can introduce new features to make use of that.",
    "As an example, Qualcomm suggested you could unlock your phone without having to press a button to start a facial recognition process.",
    "Another example, and perhaps a more interesting implementation, would be for security purposes. The camera would be able to monitor if anyone is looking over your shoulder while you're using certain apps. If you're looking at confidential files, it would then be able to lock your phone to ensure no one else is able to peek over your shoulder.",
    "That would only be possible for certain uses (for example, someone looking at an angle would likely not be picked up by the camera) but it's an interesting feature that could be useful.",
    "There are improvements for audio, too. For example, Qualcomm is introduced CD lossless audio and Bluetooth LE audio into the platform for the first time.",
    "Plus, a new feature called Android Ready SE is designed to allow you to include identification documents on your smartphone. This would allow for this process to be done securely, but there is little detail on how that would look for the average person.",
    "The platform also includes the most advanced Wi-Fi 6 connectivity, so you may be able to experience a slightly faster Wi-Fi connection on your next smartphone.",
    "Finally, 5G is improving on the Gen 1, but we've yet to hear many specifics about the features. Qualcomm has said this platform supports up to 10Gbps, which is likely to keep you connected without any concerns."
  ],
  "headers": {
    "5": "Which phones will use the Snapdragon 8 Gen 1?",
    "13": "What does it do?",
    "15": "How powerful is it?",
    "23": "New camera features",
    "36": "What does it change for gaming?",
    "40": "Every other feature we've heard about so far"
  },
  "links": {
    "best Android phones": "https://www.techradar.com/best/best-android-phones",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10",
    "Find X4": "https://www.techradar.com/news/oppo-find-x4",
    "we have reason to believe": "https://www.techradar.com/news/new-motorola-edge-is-coming-in-just-a-few-days-but-it-may-be-a-china-exclusive",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "in either most": "https://www.techradar.com/news/samsung-galaxy-s22-could-feature-the-snapdragon-898-in-these-parts-of-the-world",
    "all parts of the world": "https://www.techradar.com/news/samsung-galaxy-s22-could-use-the-same-chipset-everywhere",
    "could use this chipset": "https://www.techradar.com/news/snapdragon-898-benchmarks-appear-and-it-could-power-the-huawei-p60",
    "has complicated things there": "https://www.techradar.com/news/heres-how-the-huawei-p50-and-p50-pro-could-still-feature-kirin-chips",
    "Sony Xperia 1 IV": "https://www.techradar.com/news/sony-xperia-1-iv",
    "Samsung Galaxy Z Fold 4": "https://www.techradar.com/news/samsung-galaxy-z-fold-4"
  }
}