{
  "source": "https://www.techradar.com/news/linux-at-30-how-a-students-hobby-became-a-key-component-in-the-business-it-stack",
  "title": "Linux is 30: How a student’s hobby became a key component in the business IT stack",
  "category": "computing",
  "updated": "2021-09-17T15:12:22Z",
  "author": "mayank-sharma",
  "summary": "How did Linux go from a niche passion project to changing computing forever?",
  "article": [
    "August 25, 2021 marked thirty years of Linus Torvalds’ now-famous announcement on the comp.os.minix news group, where he shared plans to work on a free operating system for 386(486) AT clones as a “hobby” (with the publication date of September 17 1991).",
    "Nobody, least of all Torvalds, would have imagined that three decades later, his hobby OS would not just outgrow his personal computer, but go on to become the backbone of much of the modern IT world.",
    "Rob Gibbon, Product Manager at Canonical, the makers of Ubuntu, has seen an explosion in the adoption of Linux over the years.",
    "“From server deployments and consumer electronics like smartphones, televisions and smart speakers, to industrial applications like automobiles and elevators, you'll find Linux enhancing the everyday lives of billions of humans worldwide – quite often in unseen ways,”.",
    "But how did Linux become the phenomenon as we know it today?"
  ],
  "headers": {},
  "links": {
    "announcement": "https://groups.google.com/g/comp.os.minix/c/dlNtH7RRrGA/m/SwRavCzVE7gJ",
    "operating system": "https://www.techradar.com/reviews/pc-mac/software/operating-systems",
    "Ubuntu": "https://www.techradar.com/best/best-ubuntu-apps",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "server": "https://www.techradar.com/news/best-small-business-servers",
    "smartphones": "https://www.techradar.com/news/best-phone",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "automobiles": "https://www.techradar.com/car-tech"
  }
}