{
  "source": "https://www.techradar.com/news/sorry-cryptominers-new-geforce-rtx-3080s-rtx-3090s-may-get-mining-limiters",
  "title": "Sorry Cryptominers, new GeForce RTX 3080s, RTX 3090s may get mining limiters",
  "category": "computing",
  "updated": "2021-04-16T18:11:31Z",
  "author": "john-loeffler",
  "summary": "Will it work this time?",
  "article": [
    "Nvidia may be preparing to extend its new hash rate limiter across its entire portfolio of RTX 3000-series graphics cards with a new GPU refresh, an effort that could finally help alleviate the voracious demand for these cards among cryptominers and free up stock for gamers who have been unable to buy them.",
    "While we had gotten word that Nvidia was going to refresh the GPUs in the RTX 3060 to reinforce the hash rate limiter that miners had circumvented – with help from an Nvidia partner's beta driver, no less – this is the first we've heard that the limiter might be extended over the entire Ampere line of consumer graphics cards.",
    "Noted Twitter leaker kopite7kimi suggests that the GA106 GPU in the RTX 3060 might not be the only Ampere GPU that Nvidia tweaks, and as PCGamer points out, this could be a pretty big deal for the Ampere lineup.",
    "The limiter could be included in both GA102-302/202 and GA104-302/202 refreshes used in future production runs of RTX cards as well, which would implement the limiter on the RTX 3060 Ti, RTX 3070, RTX 3080, and RTX 3090 cards for the first time.",
    "Since the RTX 3090 and RTX 3080 are two of the most sought-after cards for cryptominers due to their superior hash rates, implementing a limiter on these cards could make them far less attractive to miners by greatly increasing the time it will take to break even, at least in theory.",
    "As it stands, with the current premiums over the MSRP charged by eBay and StockX resellers, it could take almost a year to mine enough Ethereum at its current value to actually start to make any profit with these cards. By halving the hash rate, it would take double the time to get a positive return on your investment, and by then its possible that the value of Ethereum could crash, given its volatility.",
    "Miners are already turning towards older, less powerful GPUs like the Nvidia GTX 1660 Ti and AMD Radeon RX 580 because they are less expensive and are more easily found at retailers, so are more likely to turn a profit.",
    "If Nvidia is able to properly implement a hash rate limiter on these new GPUs that power its latest graphics cards, the demand for these cards among miners will certainly diminish, even if it doesn't collapse entirely.",
    "That should help decrease the incentive for resellers to buy up as many of these cards as they can since they will see less of a return on their investments and are more likely to move on to other products like the PS5 where they can get a larger profit on their investment.",
    "Assuming that Nvidia is able to create a stronger limiter that isn't able to be circumvented like the last one was, that is - which is definitely doable, given that these will be refreshed silicon.",
    "If Nvidia's plan works, it wouldn't make these cards suddenly available for anyone who wants to buy one, but it will likely make them more available than it currently is and at this point, we'll take it."
  ],
  "headers": {
    "4": "Nvidia's latest effort just might work"
  },
  "links": {
    "refresh the GPUs": "https://www.techradar.com/news/nvidia-to-launch-new-anti-cryptomining-gpu-to-replace-the-rtx-3060",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "circumvented": "https://www.techradar.com/news/cryptominers-have-already-cracked-nvidias-rtx-3060-hash-rate-limiter",
    "Nvidia partner's beta driver": "https://www.techradar.com/news/did-nvidia-just-unlock-rtx-3060-cryptomining-by-mistake",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "kopite7kimi": "https://twitter.com/kopite7kimi/status/1382618361725472768?s=20",
    "PCGamer": "https://www.pcgamer.com/nvidia-cryptocurrency-mining-hash-rate-limiters-ampere-30-series-gpus/",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Nvidia GTX 1660 Ti": "https://www.techradar.com/reviews/asus-rog-strix-gtx-1660-ti-oc",
    "AMD Radeon RX 580": "https://www.techradar.com/reviews/amd-radeon-rx-580"
  }
}