{
  "source": "https://www.techradar.com/news/samsung-galaxy-note-21-might-be-canceled-but-with-another-note-coming",
  "title": "Samsung Galaxy Note 21 might be canceled, but with another Note coming",
  "category": "phones",
  "updated": "2021-01-22T09:36:43Z",
  "author": "tom-bedford",
  "summary": "One more for the fans",
  "article": [
    "If you've been following the Samsung Galaxy Note 21 news, you'll have heard time and time again rumors suggesting the future stylus-toting Samsung phone isn't coming, likely due to the Galaxy S21 series now getting stylus compatibility in some models.",
    "A new rumor, though, suggests a different Samsung Galaxy Note phone could be on its way. Analyst Ross Young tweeted some information stating, among other things, \"although now there is no Note 21 coming, we may see a Note 20 FE\".",
    "A Samsung Galaxy Note 20 FE, or Note 20 Fan Edition, would likely be a 'Lite' version of the Note 20, similar to how the Galaxy S20 FE was a more affordable version of the Galaxy S20.",
    "Young doesn't exactly sound certain about the existence of the Note 20 FE, so we can't say for certain it's coming, and you should take this all with a pinch of salt.",
    "Even if we could be sure the Samsung Galaxy Note 20 FE was coming, it'd be hard to know when, as Samsung doesn't tend to keep a regular release pattern with its flagship spin-offs.",
    "The Galaxy S20 FE came in October 2020, six months after the Galaxy S20's February 2020 launch. However the Galaxy S10 Lite, which was also informally known as the S10 FE in some regions (and fulfilled the same role) came out in early February 2020, over 11 months after the Galaxy S10's launch. Then again the Note 10 Lite was launched five months after the Note 10.",
    "So it doesn't seem there's any solid precedent for how long Samsung will wait after its flagship launch to show off a lower-cost version. We'd expect to see it in the first few months of 2021 if the Galaxy Note 20 FE is real, but even that's not certain."
  ],
  "headers": {
    "4": "When could the Samsung Galaxy Note 20 FE launch?"
  },
  "links": {
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Samsung phone": "https://www.techradar.com/news/best-samsung-phones",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "tweeted": "https://twitter.com/DSCCRoss/status/1352294161425330179",
    "Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S10 Lite": "https://www.techradar.com/reviews/samsung-galaxy-s10-lite-full-review",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Note 10 Lite": "https://www.techradar.com/reviews/galaxy-note-10-lite-review",
    "Note 10": "https://www.techradar.com/reviews/samsung-galaxy-note-10-review-and-specs"
  }
}