{
  "source": "https://www.techradar.com/news/dont-hold-your-breath-for-cyberpunk-2077s-ps5-or-xbox-series-x-update-this-year",
  "title": "Don’t hold your breath for Cyberpunk 2077’s PS5 or Xbox Series X update this year",
  "category": "gaming",
  "updated": "2021-12-02T11:20:43Z",
  "author": "rhys-wood",
  "summary": "PS5 and Xbox Series X updates are likely a ways away",
  "article": [
    "Cyberpunk 2077 woes could continue, as developer CD Projekt Red confirms the PS5 and Xbox Series X/S enhanced versions of the open-world game might arrive a little later than expected.",
    "As reported by Eurogamer, Cyberpunk 2077’s enhanced current-gen versions are still slated for release in late 2021, but CD Projekt Red’s senior vice president of business development, Michał Nowakowski, admitted on a results call to investors that things could be delayed further.",
    "Nowakowski stated: \"The target is to release the next-gen version of Cyberpunk 2077 late this year. At the same time, keeping in mind the lessons we have learned during the past year and taking into account that this project still remains in development, we can't say with full certainty that the production schedule will not change.\"",
    "Currently, just over a third of staff at CD Projekt Red are working on the enhanced versions of Cyberpunk 2077, and that same team is also working to improve the base game on all platforms.",
    "Cyberpunk 2077’s latest patch, 1.3, recently released, and was probably its biggest improvement to the game yet. As always, it featured a litany of fixes for glitches and game-breaking bugs, as well as improvements to gameplay overall. The update also included some free cosmetic DLC, featuring new clothing for V and a brand new look for Johnny Silverhand.",
    "Nowakowski claims that CD Projekt Red will be \"keeping in mind the lessons\" it learned over the course of Cyberpunk 2077’s development, and that’s a statement that should have extra attention paid to it. Cyberpunk’s troubled development history is well documented, but suffice to say the game’s launch was nothing short of a disaster.",
    "If CD Projekt Red wants to heed the lessons of its recent past, then, it should absolutely delay the enhanced PS5 and Xbox Series X versions of Cyberpunk 2077 into 2022. Yes, we’re all sick of Cyberpunk delays, and there’s certainly some humor to be mined there, but the pressure is on for the developer to knock the enhanced versions of the game out of the park.",
    "Currently, Cyberpunk 2077 runs admirably on PS5 and Xbox Series X in terms of performance. These are just the last-gen versions running on more modern hardware, but that allows the game to run at a much smoother framerate, and enjoy shorter load times thanks to each console’s SSD.",
    "Of course, CD Projekt Red shouldn’t leave PS4 and Xbox One players behind. Last-gen Cyberpunk players haven’t had the smoothest ride, with woeful framerates and muddy textures rendering the experience nigh unplayable at launch. Patches have improved the experience since then, but there’s still a way to go.",
    "In that case, CD Projekt Red should take all the time it needs to make Cyberpunk 2077 the best game it can possibly be, whether that’s on last or current-gen hardware. And if that means pushing the release of the enhanced versions back to squeeze in a few extra performance patches, then we say go for it."
  ],
  "headers": {
    "5": "Analysis: take all the time you need"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-09-01-cd-projekt-cant-say-with-full-certainty-its-next-gen-cyberpunk-and-witcher-3-updates-will-arrive-this-year",
    "PS5 and Xbox Series X versions of Cyberpunk 2077": "https://www.techradar.com/news/cyberpunk-2077-for-ps5-and-xbox-series-x-what-we-know-so-far"
  }
}