{
  "source": "https://www.techradar.com/news/cheap-prime-day-tv-deals-4k-tvs-starting-at-just-dollar9999",
  "title": "Cheap Prime Day TV deals: 4K TVs starting at just $99.99",
  "category": "televisions",
  "updated": "2021-06-30T03:35:46Z",
  "author": "mackenzie-frazier",
  "summary": "Prime Day TVs have arrived - see today's best budget sets",
  "article": [
    "Day two of Amazon Prime Day is officially underway, and if you're on the hunt for a cheap TV deal – then you've come to the right place. We've scoured through Amazon's sale to find the very best cheap Prime Day TV deals with prices starting at just $99.99 for a new display.",
    "Amazon Prime Day is one of the best opportunities to score a cheap TV with some of the lowest prices you'll find all year from brands like Insignia, Hisense, and Toshiba. We've not only listed the best cheap TVs deals from Amazon, but we've also checked out the bargains from Walmart and Best Buy's competing sales so you can find all the best budget sets on this page.",
    "Our cheap Prime Day TV deals include includes everything from a 24-inch HD set starting at just $99.99 to a 65-inch 4K Fire TV on sale for just $449.99, with features such as smart capabilities and voice control, and at a range of prices to meet all your viewing needs. You must have a Prime membership to take advantage of most of these TV bargains, and you can sign up for a 30-day free trial here, which will take you through Amazon Prime Day and beyond. Amazon's 48-hour sale ends tonight at midnight, so you should snag these epic bargains now before it's too late.",
    "You can also see the best 4th of July sales from Best Buy, Home Depot, Lowe's and more."
  ],
  "headers": {
    "3": "More Prime Day deals"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Prime Day TV deals": "https://www.techradar.com/amazon-prime-day/prime-day-tv-deals-2021",
    "here": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Famazonprime%3F_encoding%3DUTF8%26%252AVersion%252A%3D1%26%252Aentries%252A%3D0%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1887627120853584400-20",
    "4th of July sales": "https://www.techradar.com/deals/the-best-4th-of-july-sales-and-deals"
  }
}