{
  "source": "https://www.techradar.com/news/theres-a-new-big-name-on-the-web-hosting-scene",
  "title": "There's a new big name on the web hosting scene",
  "category": "computing",
  "updated": "2021-02-11T15:15:01Z",
  "author": "barclay-ballard",
  "summary": "A new $3 billion acquisition is shaking up the web hosting space",
  "article": [
    "Investment firm Clearlake Capital Group has announced a host of financial dealings that will have a major impact on the web hosting sector. Perhaps the most eye-catching news released by the company is the completion of its $3 billion all-cash takeover of the Endurance International Group.",
    "Clearlake’s purchase of Endurance was originally announced in November of last year but closure had to wait until the new year. With the acquisition closed, Endurance will now be delisted from the NASDAQ stock exchange.",
    "Upon announcing the deal, Clearlake also confirmed that it would be forming a new web hosting company called Newfold Digital in partnership with Siris Capital Group. Newfold Digital will be an SMB-focused provider of web presence solutions, replacing both Endurance Web Presence and Web. The new organization will serve around 6.7 million customers around the world.",
    "\"This combination creates an industry leader with tremendous scale and a strong portfolio of marquee brands and product offerings that furthers our commitment to helping SMBs establish themselves online,\" Sharon Rowlands, CEO of Newfold Digital, said. \"We are excited to join forces with the Endurance Web Presence team and want to thank Clearlake and Siris for their continued support as we deliver the highest quality solutions for our customers in pursuit of profitable growth.\"",
    "In fact, Newfold Digital now encompasses a host of well-known web hosting brands, including Network Solutions, HostGator, Domain.com, and many others. Collectively, this means that Newfold Digital is able to offer a huge range of web services, such as shared web hosting plans, fully managed offerings, Linux-based hosting, and much more besides.",
    "In addition to its acquisition news and its Newfold Digital announcement, Clearlake and Siris also confirmed that they had completed a strategic equity investment in Constant Contact."
  ],
  "headers": {
    "3": "A new player"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Newfold Digital": "https://newfold-digital.com/",
    "SMB-focused": "https://www.techradar.com/news/best-small-business-website-builders-in-2020-for-smb-sme-and-gig-operators",
    "said": "https://www.prnewswire.com/news-releases/clearlake-completes-acquisition-of-endurance-international-group-and-strategic-investment-transactions-with-webcom-and-affiliates-of-siris-announces-formation-of-newfold-digital-301226338.html",
    "brands": "https://newfold-digital.com/brands",
    "shared web hosting plans": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "managed": "https://www.techradar.com/web-hosting/best-managed-web-hosting",
    "Linux-based hosting": "https://www.techradar.com/web-hosting/best-linux-web-hosting"
  }
}