{
  "source": "https://www.techradar.com/news/tamron-is-making-the-ultimate-travel-zoom-lens-for-sony-mirrorless-cameras",
  "title": "Tamron is making the ultimate travel zoom lens for Sony mirrorless cameras",
  "category": "cameras",
  "updated": "2021-08-05T13:14:13Z",
  "author": "mark-wilson",
  "summary": "Super-bright 35-150mm zoom lens is en route",
  "article": [
    "It's been raining lenses for Sony's full-frame mirrorless cameras this year, and Tamron is planning to add another couple of zoom options to the list – including a very promising 35-150mm f/2-2.8 travel zoom.",
    "The bright zoom lens, which was also announced alongside a 28-75mm f/2.8 for Sony's E-mount cameras, is currently only a development announcement, but Tamron says that both will be available \"sometime during 2021\".",
    "Anyone looking for a versatile zoom lens to stick on their Sony A7R IV or Sony A7 III will be most excited by the 35-150mm f/2-2.8, which promises to marry a very useful focal range for all kinds of subjects with a maximum aperture that remains bright throughout that range.",
    "Tamron has previously released a 35-150mm f/2.8-4 Di VC OSD zoom lens for Canon and Nikon full-frame DSLRs, but this one promises to get closer to that lens' claims of being like having \"six prime lenses in one\".",
    "Naturally, Tamron's new lens is going to be larger and heavier than that compact portrait zoom, but the company still says it's going to be \"ideal for travel photography\" and, on paper, that's certainly the case. That focal range means you get 35mm for street scenes and architecture, 85mm for portraits and 150mm for long-range close-ups.",
    "Tamron does currently make a 70-180mm f/2.8 Di III VXD lens for Sony E-mount cameras, and that lens is likely a good example of what we can expect from the 35-150mm f/2-2.8 Di III VXD. The 70-180mm is a relatively small and light zoom lens with the same-size filter thread (67mm) as the incoming 35-150mm, but lacks built-in image stabilization.",
    "Both the new 35-150mm F/2-2.8 Di III VXD and 28-75mm f/2.8 Di III VXD G2, which will succeed the company's existing 28-75mm lens for E-mount cameras, are promising to offer the typical characteristics of Tamron lenses – they'll be relatively small, light and affordable alternatives to Sony's own 'G Master' options.",
    "We don't yet have any info on the lenses' size, weight or pricing, but the images suggest they'll follow a similar philosophy to Tamron's existing range, only with the addition of some superior autofocus. Both lenses include the brand's newer VXD (Voice-coil extreme-torque drive) linear motor focus mechanism, which we've previously found to work well with Sony bodies like the Sony A7R IV.",
    "One of the main details missing from the development announcement is whether or not these new lenses will have built-in optical stabilization. This is particularly handy on telephoto lenses, but given stabilization is lacking on Tamron's current 70-180mm f/2.8 Di III VXD lens, it seems likely that the 35-150mm F/2-2.8 Di III VXD will again rely on being paired with a Sony body with in-body image stabilization (IBIS).",
    "That's now pretty common, but the ideal camera for an all-in-one travel zoom lens like the 35-150mm F/2-2.8 Di III VXD is surely the long-rumored Sony A7 IV. The current Sony A7 III is the affordable all-rounder in Sony's full-frame mirrorless line-up, but it's now well over three years old and there's still no sign of a successor.",
    "Of course, there'll be plenty of existing Sony camera owners who'll be pencilling in the 35-150mm F/2-2.8 Di III VXD for a spot in their camera bag. But we hope the arrival of yet more full-frame lenses for the Sony E-mount is a sign that the long-awaited launch of the Sony A7 IV will happen later this year."
  ],
  "headers": {
    "6": "Analysis: A perfect match for the Sony A7 IV?"
  },
  "links": {
    "full-frame mirrorless cameras": "https://www.techradar.com/news/best-full-frame-mirrorless-camera",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Sony A7 IV": "https://www.techradar.com/reviews/sony-a7-iv"
  }
}