{
  "source": "https://www.techradar.com/news/iphone-13-may-not-get-in-screen-touch-id-after-all-but-the-iphone-14-might",
  "title": "iPhone 13 may not get in-screen Touch ID after all, but the iPhone 14 might",
  "category": "phones",
  "updated": "2021-06-24T05:00:08Z",
  "author": "david-lumb",
  "summary": "Now rumors suggest the iPhone 13 won’t get in-screen Touch ID.",
  "article": [
    "Don’t get too excited about all the rumors suggesting the iPhone 13 will finally get an in-screen fingerprint sensor: a new rumor insists we won’t see under-screen Touch ID until the iPhone 14.",
    "That rumor comes courtesy of noted Apple analyst and forecaster Ming-Chi Kuo, who predicted that Touch ID sensors underneath screens will come for some models of 2022 phones, according to MacRumors.",
    "Kuo didn’t indicate which phones would be getting the in-screen fingerprint sensor – or under-screen Touch ID, if you will, as we aren’t sure if there’d be any difference between Apple’s tech and the industry standard. While it would make sense for the flagship iPhone 14 models to get the authentication tech, Kuo simultaneously reiterated his previous claims that we should expect an updated iPhone SE in the first half of 2022.",
    "Kuo didn’t suggest the mid-range iPhone would get the under-screen Touch ID, but he did suggest that the iPhone 13 will be the last with a 5.4-inch ‘mini’ size. Instead, the 2022 iPhone 14 range will replace it with an affordable large phone with a 6.7-inch display.",
    "Given Apple’s tendency to leave some features out of the cheaper flagship phones, like the telephoto lens on the iPhone 12 and iPhone 12 mini, we could see the Pro and Pro Max models exclusively getting the under-screen Touch ID.",
    "Kuo predicted that larger 6.7-inch iPhone 14 will still be more affordable than the Pro models, and may cost less than $900 in the US, but will lack certain features – like an in-screen fingerprint sensor – to be that affordable.",
    "But Kuo also predicted that the high-end 6.1-inch and 6.7-inch iPhone 14 models (presumably the Pro and Pro Max) will have upgraded 48MP wide-angle cameras – aka the main cameras – which would presumably be sharper than the 12MP main/wide camera on the iPhone 12.",
    "As always, take Kuo’s predictions with a grain of salt given the far scope of his predictions. While we’ve been hearing about an in-screen fingerprint sensor since July 2020, and several leaks have suggested the feature is coming to this year’s iPhone 13, it’s possible that things could change between now and the phone’s expected release window in late 2021.",
    "Via PhoneArena"
  ],
  "headers": {
    "5": "What else did Kuo predict?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 14": "https://www.techradar.com/news/four-iphone-14-leaks-you-need-to-know-even-though-it-isnt-coming-until-2022",
    "MacRumors": "https://www.macrumors.com/2021/06/23/kuo-2022-iphones-under-screen-touch-id/",
    "hearing": "https://www.techradar.com/news/apples-working-on-an-in-screen-fingerprint-sensor-could-it-come-to-the-iphone-12",
    "several": "https://www.techradar.com/news/iphone-13-could-feature-in-screen-face-id-or-touch-id-unlock",
    "suggested": "https://www.techradar.com/news/another-iphone-13-leak-points-to-in-screen-touch-id-and-a-smaller-notch",
    "PhoneArena": "https://www.phonearena.com/news/apple-iphone-14-under-screen-touch-id-2022-iphone-se-5g-reports_id133065"
  }
}