{
  "source": "https://www.techradar.com/news/rtx-3080-and-rtx-3070-in-stock-newegg-shuffle-today-prices",
  "title": "RTX 3080 and RTX 3070 were in stock at Newegg today – at reasonable prices",
  "category": "computing",
  "updated": "2021-07-07T17:25:35Z",
  "author": "matt-swider",
  "summary": "Of course, you'll have to be lucky to get picked for the Newegg Shuffle GPU lottery",
  "article": [
    "Update: The next opportunity to find the RTX 3080 in stock at Best Buy may be soon, according to our updated news – and it'll be for MSRP.",
    "Prior story: The Newegg Shuffle with the RTX 3080 and RTX 3090 in stock is now for today (check your email to see if you were selected). It had four different Nvidia GPUs on sale as part of the retailer's popular product lottery for June 30, and the prices are close to MSRP when comparing it to the retail prices at Best Buy (where the graphics cards have been sold out since last Thursday). Newegg is also offering a chance to buy the RTX 3080 Ti and RTX 3090, each with two options available for higher prices.",
    "How to know about GPU restock: Our GPU restock Twitter tracker Matt Swider will send you an alert when RTX graphics cards are back in stock – if you follow his account and turn on notifications (the little bell icon).",
    "Trust factor: In addition to helping 54,000 people get next-gen consoles through his Xbox and PS5 restock alerts, Matt is now tracking GPU stock in the US. Here's what we expect to see today and tomorrow from multiple American retailers.",
    "The Newegg Shuffle today, Tuesday, June 30, has four different RTX GPU options, and they're close to MSRP when we compared Newegg's prices to Best Buy's sold-out list prices. Here's what is available for Newegg's lottery:",
    "The RTX 3080 is the most sought-after graphics card of the bunch, and the EVGA FTW3 GeForce RTX 3080 is priced at $899.99, according to Newegg. That's just $10 more than what EVGA is charging from its official website (MSRP is $889.99). Best Buy, while sold out, costs the same $899.99.",
    "Of course, the catch with the RTX 3080 at Newegg is that you're required to buy a power supply for another $179.99, meaning you'll be paying $1,074.98 in the end. Still not as unreasonable as we've seen from Newegg before today.",
    "There's an unbundled option for the EVGA XC3 GeForce RTX 3070 on sale too, and it costs just $649.99 – both Best Buy and EVGA, where this Nvidia graphics card is listed as $639.99 (and, of course, neither has this version of the RTX 3070 on sale).",
    "The Asus RTX Dual GeForce RTX 3070, also part of the Newegg Shuffle today, does have an entry that's bundled with an Asus motherboard, taking the price up to $884.98.",
    "The RTX 3080 Ti will cost you considerably more from Zotac (unbundled at $1,799.99) and Asus (bundled with a PC case for $2,274.98), as will the pair of RTX 3090 cards from Asus and MSI, which both top $2,300 with a motherboard or RAM.",
    "The Newegg Shuffle is only one option for RTX GPUs. While we find Amazon to make it nearly impossible to buy sought-after graphics cards, Antonline RTX stock lasts one or two minutes for the RTX 3080, the most coveted GPU. Best Buy has RTX GPUs for MSRP, but the inventory lasts just one minute – if that.",
    "Antonline: Antonline often has RTX graphics cards in stock weekly and pairs them with other components (just like Newegg does). So you'll also be buying a motherboard, case, monitor or something else with it. The difference with Antonline is that it's first-come-first-serve (vs Newegg's lottery), so if you're fast enough, this is the one to watch. You just have to be okay with GPU bundles with tons of extras.",
    "Best Buy: Best Buy had Nvidia RTX GPUs in stock last Thursday and they were at their normal MSRP online. This may seem better than waiting 20 hours in line when it's a rare in-store restock (see our RTX 3080 Ti launch line coverage). Because the RTX cards from Best Buy aren't part of a bundle and because they're at retail price, they last less than a minute in some cases and we advise people to keep trying until they're totally sold out.",
    "We'll let you know if RTX GPUs are in stock at Best Buy as it's been every two weeks or so recently.",
    "Amazon: This one is at the bottom simply because it's harder to find a GPU restock at Amazon. Whether it's bot scooping up the console before everyone else or a lack of inventory, securing a GPU at Amazon feels next to impossible. That's why our GPU restock tweets tend to focus on Newegg, where it's done by chance, and Best Buy, where it often has two weeks of RTX stock built up and unleashes them all at once. Amazon GPU sales come in drops and drabs."
  ],
  "headers": {
    "4": "Nvidia RTX GPU stock: Newegg Shuffle has the 3080",
    "10": "RTX GPU for MSRP guide at retailers in the US"
  },
  "links": {
    "RTX 3080 in stock": "https://www.techradar.com/news/rtx-3080-in-stock-at-best-buy-soon-track-it",
    "GPU restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider.",
    "PS5 restock": "https://www.techradar.com/news/target-ps5-restock-time-in-the-usa",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "power supply": "https://www.techradar.com/news/best-pc-power-supply",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "RTX 3080 Ti launch line": "https://www.techradar.com/news/life-in-the-queue-meet-the-gamers-camping-out-for-an-rtx-3080-ti-across-the-us"
  }
}