{
  "source": "https://www.techradar.com/news/foundation-episode-3-recap-the-past-always-comes-back-to-haunt-you",
  "title": "Foundation episode 3 recap: the past always comes back to haunt you",
  "category": "entertainment",
  "updated": "2021-10-01T11:00:00Z",
  "author": "tom-power",
  "summary": "Major Foundation episode 3 spoilers follow",
  "article": [
    "Major spoilers follow for Foundation’s first three episodes. Watch them first before reading on.",
    "As Apple TV Plus’ supposedly next big hit, Foundation is taking its time to hit its stride. Ordinarily, a great TV series would’ve hooked viewers by now and already be delivering compelling drama, humor, suspense or action each week.",
    "But Foundation isn’t done with its character and story set-ups – something that its third entry, The Mathematician’s Ghost, is guilty of. There’s a decent amount of progress in its Trantor-centric plot, but episode 3’s Terminus storyline feels like a backwards step as it introduces us to more cast members and settings that, while admittedly key to Foundation’s plot, slow its pacing down once more.",
    "Unlike its predecessors, Foundation episode 3 takes a different approach to its branching narratives. Rather than jumping back and forth between each storyline, The Mathematician’s Ghost’s first half is entirely devoted to its Trantor-based plot. Terminus’ story thread, meanwhile, is reserved for later.",
    "It’s a strategy that works well. Yes, Trantor’s story includes the show’s now customary time jumps – 400 years into the past, then 19 years after the Star Bridge bombing and, finally, another 17 years into the future. Given that Foundation’s story spans an entire millennia, this cycling through time is ultimately necessary.",
    "With episode 3 devoting its first half to Trantor, too, its time hopping isn’t as confusing as Foundation’s two previous entries: its singular storyline, unfolding in the same location, being much easier to follow. This approach also gives Foundation time to provide a clearer insight into how each of Cleon I’s clones are created, carry out their royal duties and undergo their ‘ascension’ when they’re no longer fit for purpose.",
    "And that helps Trantor’s main players to ingratiate themselves to us. What’s notable about Cleon’s clones, and their humanoid advisor Eto Demerzel, is that they’re more available from an emotional perspective than their human counterparts. You can sense the regret and dread in each clone ahead of their ‘ascension’: a pleasant name for the process where each one is incinerated at the end of their lifespan.",
    "Seeing Brother Dusk – now known briefly as Brother Darkness – being terminated in mere seconds makes for harrowing viewing. It’s a somewhat anticlimactic way for someone’s life to end, but it provides viewers with an insight into the callous and self-righteous nature of Cleon I’s original clone plan. It gives no regard to the thoughts and feelings of his clones, regardless of whether they’re considered to be truly alive or not. It’s the first time where Foundation poses an ethical question to its audience and, by doing so sensitively, it challenges us to ponder whether Cleon I’s plan is amoral or not.",
    "The same is true of Demerzel. As a humanoid who’s outlived Cleon I and every one of his clones, we witness the impact that each one’s death has had on her. It’s a sad and lonely existence for Demerzel, particularly after we learned that she’s the last of her kind in episode 2.",
    "Again, we’re able to relate with a non-human emotionally – compare that to the disconnect we feel with Cleon I, or other humans we’ve seen in the show, and there’s a stark contrast between characters we resonate with and those we don’t. It’s akin to TV shows like Westworld or Humans where, as an audience, we care more for humanoids than the series’ real people.",
    "If there’s one aspect of episode 3’s Trantor storyline that’s slightly confusing, it’s how it uses Lee Pace and Terrence Mann to briefly embody younger versions of their emperors.",
    "Pace and Mann end up portraying Brother Dawn and Brother Day – they played Day and Dusk respectively in Foundation’s first two episodes – during Darkness’ ‘ascension’. Initially, it’s difficult to adapt to the pair’s altered roles but, thankfully, it’s only for one scene before they revert back to Day and Dusk respectively. And, while it’s disorienting, it is pleasing that Foundation uses the same actors to inhabit these roles. It maintains continuity between the three emperors’ appearances as they age and forgo the use of prosthetics or other makeup.",
    "While Trantor’s story is straightforward, the same can’t be said for Terminus’. Its plot picks up with Seldon’s followers eventually landing on their new home, but it begins to rush through events with very little time for viewers to immerse themselves in these new surroundings.",
    "We’re quickly reintroduced to the Vault, watch a CGI timelapse of Terminus City being built, and spend a very brief moment meeting a young Salvor Hardin. It’s all a bit breathless, even more so when the show fast forwards to ‘present day’ where an adult Salvor (Leah Harvey) is now Warden of Terminus.",
    "The pacing of episode 3’s second half feels more imbalanced when, after we meet adult Salvor, it slows right down. More characters are introduced, such as Daniel MacPherson’s Hugo, while various plot exposition hampers the episode’s flow.",
    "It’s an issue that grates even more when The Mathematician’s Ghost actually starts to go somewhere.",
    "We get all-too-brief conversations between Salvor and her parents Abbas (Clarke Peters) and Mari (Sasha Behar), which offer a tiny but fun insight into their family dynamic. Meanwhile, a meeting between Terminus’ main leaders, after Anacreon warships are spotted orbiting Terminus, and a sequence where Salvor chases an unknown child into a wrecked spaceship, provide some much needed tension and horror to proceedings.",
    "But it’s just not enough to satisfy viewers’ demands for greater character development or better plot pacing. Episode 3’s ending, which sees Salvor ambushed by an Anacreon landing party, could kickstart the Terminus story arc into life. But, with Salvor’s fate unknown until episode 4 – the credits roll immediately after she’s surrounded – we have to wait another week for Foundation to simply get going.",
    "The Mathematician’s Ghost is a disjointed Foundation entry that continues to wrestle with pacing and plot issues. The change in narrative approach certainly helped its Trantor-centric storyline, but its Terminus plot arc appears to suffer as a result. So it’ll be interesting if subsequent episodes stick to this new formula or return to the location-swapping blueprint that was used in episodes 1 and 2.",
    "If Foundation wants to break away from its continual pacing problems, though, it might need to do away with its location hopping and multiple time jumps. Yes, the show’s world building has been necessary, but it’s been to the detriment of in-depth character development, action sequences, shocking twists and interesting subplots.",
    "Unless there’s a real need to establish any new major characters or locations, Apple’s live-action adaptation needs to start focusing on those latter points. Otherwise, it may struggle to maintain viewers’ interest before season 1 reaches its midway point.",
    "New episodes of Foundation debut exclusively on Apple TV Plus every Friday."
  ],
  "headers": {
    "18": "Our verdict",
    "21": "Foundational facts"
  },
  "links": {}
}