{
  "source": "https://www.techradar.com/news/google-pixel-6-and-pixel-6-xl-names-teased-by-google",
  "title": "Google Pixel 6 and Pixel 6 XL names teased by Google",
  "category": "phones",
  "updated": "2021-07-14T10:53:56Z",
  "author": "tom-bedford",
  "summary": "Not the Pixel 6 Pro, then",
  "article": [
    "Update: while the initial Google Pixel 6 story reported below is unchanged, towards the end we referenced some leaked hands-on photos which appeared around the same time.",
    "As it turns out, these aren't leaked images at all, but a mock-up made by website TechDroider. We've updated the section accordingly.",
    "Regarding the upcoming Google Pixel 6, there's been some debate around its rumored top-end option. Some think it'll be called the Pixel 6 Pro, more say Google will stick with the XL suffix we've seen in the past, and others think there won't be a super-size phone at all, as with the Pixel 5.",
    "The 'Google Pixel 6 XL' name seems most likely now, though, thanks to Google referring to the device itself.",
    "At the time of writing, the company is hosting a conference for mobile game developers, and as spotted by XDA Developers, a form sent out to developers refers to the Pixel 6 and Pixel 6 XL as examples of smartphones.",
    "The form asked for \"device(s) for which these backbuffer resize settings should be applied (e.g. Pixel 6, Pixel 6 XL, etc)\", although the form has since been edited to remove the parenthesis where the device names sit.",
    "The use of the names here is more than a little suspect. Presumably the person working for Google who wrote the survey knows the phones aren't out, and it seems highly unlikely to be a typo either. Perhaps the names were included as a tongue-in-cheek joke - but the fact the form has been amended to remove the names, suggests otherwise.",
    "If there's one thing that seems highly likely, it's that Google wouldn't list these names of the devices if they were incorrect. If there wasn't a Pixel 6 XL coming, or if it were called the Pixel 6 Pro, the Pixel 6 XL almost definitely wouldn't be named in this document.",
    "So we can comfortably assume a new plus-sized Google Pixel 6 XL is coming alongside its standard sibling, and now all we need to know about the phones is... well, everything else. We've still no idea when they'll launch, what they'll be like, or how much they'll cost. Hopefully, we'll hear more as the year progresses.",
    "Apparently not everyone got the 'Pixel 6 XL' memo - we refer here to some new photos of the Pixel 6 Pro. These aren't actual photos of the phone but a mock-up made by TechDroider, to illustrate actual leaked renders.",
    "These are live photos of the phone, not renders, showing a premium-looking device which looks pretty similar to the Xiaomi Mi 11 Ultra, of all things.",
    "The phone has a big screen with curved edges, a cut-out for the front camera at the top-center of the screen, three big rear cameras including a periscope lens, and a two-tone color system with a white and peach rear. We can also see Android 12-looking software.",
    "The phone is accurate to various leaked renders we've seen of the Pixel 6's top-end sibling, but the validity of those source images is still up in the air. Whether or not it's real, it's certainly an ugly phone."
  ],
  "headers": {
    "9": "A 'Pro' picture?"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "XDA Developers": "https://www.xda-developers.com/google-pixel-6-xl-namedrop/",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Android 12": "https://www.techradar.com/news/android-12-news"
  }
}