{
  "source": "https://www.techradar.com/news/microsoft-teams-just-passed-another-huge-milestone",
  "title": "Microsoft Teams just passed another huge milestone",
  "category": "computing",
  "updated": "2021-07-28T14:49:30Z",
  "author": "mike-moore",
  "summary": "Windows 11 should see Microsoft Teams get even more popular",
  "article": [
    "Microsoft Teams can now boast over 250 million active monthly users as the platform apparently continues to go from strength to strength.",
    "The company revealed the news in its FY 2021 results announement, noting that the shift towards working from home has led to contuned interest in its video conferencing service.",
    "Microsoft had preivously revealed in April 2021 that the figure stood at 145 million, marking an impressive rise in the number of active users. This figure looks only set to increase as the company gears up for the release of Windows 11 later this year, which has Teams as one of its central apps.",
    "\"Microsoft Teams is the new front end. It’s where people meet, chat, call, collaborate, and automate business processes, all within the flow of work. Teams usage has never been higher,\" Microsoft’s CEO Satya Nadella said in a call discussing the company's earnings.",
    "Nadella also hinted that this was just the start, and that there would be more to come from Teams in the near future.",
    "“We’re bringing Teams to consumers so people can connect and collaborate with family and friends across desktop, mobile, and the web,\" he added.",
    "The platform is set for a major redesign to align with the launch of Windows 11 later this year, with the new client built around Microsoft Teams for the web.",
    "Reports have claimed that \"Microsoft Teams 2.0\" no longer has an address bar, is significantly faster on desktop and runs better on low-end devices, thanks to using less memory.",
    "The news puts Microsoft Teams firmly on track to compete with its rivals in the enterprise video call space.",
    "Google CEO Sundar Pichai recently stated that its Meet platform had about 100 million active participants per day, whilst Zoom last year reported that it has over 200 million daily active users."
  ],
  "headers": {
    "3": "Microsoft Teams growth"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "a major redesign": "https://www.techradar.com/news/microsoft-teams-is-getting-a-whole-new-look-for-windows-11",
    "Zoom": "https://www.techradar.com/news/microsoft-teams-vs-zoom-which-video-conferencing-and-collaboration-service-is-best"
  }
}