{
  "source": "https://www.techradar.com/news/one-in-five-firms-admit-to-illegally-spying-on-employees-working-from-home",
  "title": "One in five firms admit to illegally spying on employees working from home",
  "category": "computing",
  "updated": "2021-01-19T12:30:18Z",
  "author": "barclay-ballard",
  "summary": "Pandemic has been bad news for privacy advocates",
  "article": [
    "New research has found that a staggering one in five companies has already installed monitoring software to spy on their employees while working from home or plan to do so - often without the workers knowing.",
    "Frances O’Grady, general secretary of the Trades Union Congress, told Metro that the use of worker surveillance technology had surged during the pandemic.",
    "“We know many employers are investing in tech to micro-manage workers and automate decisions about who to hire, and who to let go,” O’Grady said. “Staff must be properly consulted on the use of surveillance at work and protected from unfair management by algorithm. As we emerge from this crisis, technology must be used to make working lives better — not to rob people of their dignity.”",
    "Overall, a YouGov/Skillcast poll of 2,009 companies found 12% of business said they had brought in remote monitoring.",
    "This figure grew to 16% at larger firms, with a further 8% said they were thinking of doing so - with further research by the TUC suggesting one in seven employees currently working from home have seen surveillance of their work increase.",
    "The revelation comes with many members of staff working remotely as a result of the coronavirus pandemic.",
    "Although digital tools have allowed employees to continue working safely while coronavirus restrictions have come into force, concerns have grown that these same tools are also being used to log how many hours individuals are working, what messages they are sending, and even secretly film their actions.",
    "Although government advice states that employers can only monitor employees without their consent if they suspect them of committing a crime, it appears that many workplaces are adopting a more pervasive attitude to surveillance. A recent YouGov poll, for example, found that 12% of businesses had installed remote monitoring.",
    "Earlier this month, it was suggested that Microsoft Teams, one of the video collaboration tools that has seen the largest popularity increase since the outbreak of the pandemic, could be collecting more data than users were aware of.",
    "Specifically, it was found that the Teams Activity Report could be used to read a detailed breakdown for each individual user.",
    "Via Metro"
  ],
  "headers": {
    "5": "Being watched"
  },
  "links": {
    "monitoring software": "https://www.techradar.com/best/best-employee-monitoring-software",
    "Metro": "https://metro.co.uk/2021/01/18/one-in-five-firms-linked-to-spying-on-staff-as-they-work-from-home-13925783/",
    "more data than users were aware of": "https://www.techradar.com/news/microsoft-teams-may-be-tracking-more-of-your-info-than-you-think"
  }
}