{
  "source": "https://www.techradar.com/news/microsoft-teams-down-video-conferencing-tool-offline",
  "title": "Microsoft Teams down: video call service back online",
  "category": "computing",
  "updated": "2021-03-15T21:39:37Z",
  "author": "mike-moore",
  "summary": "Microsoft Teams saw major outages, but should be back online now",
  "article": [
    "UPDATE: As of 5.17pm ET, Microsoft says it is, \"currently rolling out a mitigation worldwide. Customers should begin seeing recovery at this time, and we anticipate full remediation within 60 minutes.\"",
    "Top videoconferencing tool Microsoft Teams has suffered a major outage affecting millions of users across the world.",
    "The online collaboration platform started suffering issues around 3:30PM ET, with Microsoft quickly confirming there were issues with the service worldwide.",
    "The incident was apparently part of a company-wide issue as Microsoft saw outages across a number of its services, with the likes of Xbox Live, Office 365 and Azure also down.",
    "Outage tracker site Downdetector showed a huge spike in complaints and issues for Microsoft Teams users across the world.",
    "In a tweet on its Microsoft 365 status account, the company confirmed that it was, \"investigating an issue for access to multiple M365 services.\"",
    "Microsoft then said that the outage was due to an issue concerning, \"a recent change to an authentication system\". It planned a rollout swiftly, however this process took longer than expected.",
    "Over 100 million users have registered Microsoft Teams accounts, with the service enjoying a huge burst in popularity due to the coronavirus-related lockdown.",
    "This would be the first major outage suffered by Microsoft Teams, and comes as many users in the US were finishing up their afternoon work shift, and Australians are logging on for the new work day."
  ],
  "headers": {
    "4": "Microsoft Teams outage"
  },
  "links": {
    "says": "https://twitter.com/MSFT365Status/status/1371571383004590081",
    "videoconferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Xbox Live": "https://www.techradar.com/news/xbox-live-is-down-again-heres-what-you-cant-access",
    "Downdetector": "https://downdetector.com/status/teams/",
    "longer than expected": "https://twitter.com/MSFT365Status/status/1371567321035145216"
  }
}