{
  "source": "https://www.techradar.com/news/heres-how-mario-kart-could-look-running-on-the-rumored-nintendo-switch-2",
  "title": "Here’s how Mario Kart could look running on the rumored Nintendo Switch 2",
  "category": "gaming",
  "updated": "2021-02-17T17:14:28Z",
  "author": "adam-vjestica",
  "summary": "Mario Kart looks sensational in 4K",
  "article": [
    "Mario Kart 8 Deluxe already looks fantastic on Nintendo Switch, but how would it look running in pristine 4K resolution on the long-rumored Nintendo Switch 2 or Nintendo Switch Pro? Pretty phenomenal, it turns out.",
    "Using the magic of upscaling, a YouTube user named Snazzy AI has taken Mario’s karting antics on Nintendo Switch and bumped the game’s resolution up from 1080p to a crystal clear 4K. You’ll need to watch the video on a 4K-capable display to see the benefits.",
    "As you see for yourself, the difference is stark, and it makes Nintendo’s trademark artstyle look more vibrant than ever. We can only imagine how great the game would look if the Nintendo Switch 2 also supports HDR (high dynamic range), as there’s plenty of room for specular highlights to be emphasized in Mario Kart 8 Deluxe.",
    "Of course, as it stands, this is all just speculation on our part. Nintendo is keeping schtum about the Nintendo Switch’s successor, though all signs point to a 4K-capable machine that will bring the console more in line with the PS5 and Xbox Series X, at least in terms of resolution.",
    "We wouldn’t expect the Nintendo Switch 2 to run at 4K when playing in handheld mode, though. A 1080p display would make more sense, as it’s cheaper to produce, more battery efficient and the benefits of 4K resolution are diminished on smaller screen sizes. When the Nintendo Switch 2 or Nintendo Switch Pro is docked, however, we’d imagine it would output at 4K.",
    "With the Nintendo Switch continuing to sell incredibly well – it’s now become Nintendo’s fifth best-selling console of all time – there’s no pressure for Nintendo to produce a new model just yet. However, much like the Nintendo Switch Lite, having a high-end option for consumers to consider could only be beneficial for the Japanese company, if there's suitable demand.",
    "Via Nintendo Life"
  ],
  "headers": {
    "5": "Hot property"
  },
  "links": {
    "Mario Kart 8 Deluxe": "https://www.techradar.com/how-to/mario-kart-8-deluxe-tips-and-tricks",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch 2": "https://www.techradar.com/news/nintendo-switch-2",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo’s fifth best-selling console of all time": "https://www.techradar.com/news/nintendo-switch-was-a-make-or-break-product-says-former-nintendo-president",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nintendo Life": "https://www.nintendolife.com/news/2021/02/video_heres_how_mario_kart_could_look_running_on_a_4k_console"
  }
}