{
  "source": "https://www.techradar.com/news/amazon-alexa-just-got-better-on-xbox-series-x-heres-what-you-need-to-know",
  "title": "Amazon Alexa just got better on Xbox Series X - here’s what you need to know",
  "category": "gaming",
  "updated": "2021-03-03T11:27:48Z",
  "author": "rhys-wood",
  "summary": "Where's Cortana?",
  "article": [
    "Seemingly out of nowhere, Amazon has launched an Xbox app for its Alexa AI voice assistant. If you own either an Xbox One, Xbox One S, Xbox One X or Xbox Series X|S console and an Amazon Alexa device, then you can make use of the Amazon Alexa Xbox app right now.",
    "At first, this might seem a little strange, considering Cortana was the face (or voice) of Microsoft’s AI efforts on the Xbox platform in the past, as well as the Windows operating system. Cortana has since faded into the background, though, along with the ill-fated Kinect: Microsoft’s motion-sensing camera that was previously bundled in with all Xbox One purchases.",
    "Microsoft is now sharing the floor with other (and arguably better) AI assistants on Xbox, including Google Assistant and now Amazon Alexa.",
    "With the Amazon Alexa Xbox app, users can access both Xbox and Alexa functions. For example, Alexa can be used in conjunction with the app to launch games, or as a means of viewing other Alexa-compatible smart devices on your TV, like the Ring Video Doorbell.",
    "It’s actually been possible to use an Alexa device with Xbox consoles for a while, but the functionality didn’t go both ways. Users could enable the feature through activating the Digital Assistants option via the Settings menu, where Alexa could then be used to launch games and apps on your Xbox.",
    "However, both devices didn’t work in tandem until now. With the new Amazon Alexa Xbox app, Alexa functionality can now be accessed through your Xbox, in addition to being able to launch your Xbox games and apps through an Alexa device.",
    "You might think Xbox sharing its platform with Alexa, a rival to its own Cortana AI voice assistant, is a strange move, but it’s actually not all that out of character. In the past, Microsoft and Xbox have both shown willingness to work in collaboration with other companies for the benefit of consumers.",
    "Perhaps the most famous example of this is when Xbox teamed up with both Nintendo and Sony to offer cross-play on a variety of games, chief among them being Minecraft and Rocket League.",
    "While Xbox’s Kinect device was polarizing at best, its voice-activated functionality was a novel and convenient feature for the time. At least now, with the Amazon Alexa Xbox app, gamers can make use of this voice functionality again, without the need for the sizable Kinect camera device, so long as they have an Amazon Alexa device in their homes ready to go."
  ],
  "headers": {
    "4": "Xbox gets smarter"
  },
  "links": {
    "Amazon": "https://www.techradar.com/news/the-best-amazon-prime-benefit-is-one-you-might-not-even-know-you-have",
    "Xbox": "https://www.techradar.com/reviews/xbox-series-x",
    "Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Xbox One X": "https://www.techradar.com/news/xbox-one-x-vs-xbox-one-s-vs-xbox-one-should-you-make-the-upgrade",
    "Xbox Series X|S": "https://www.techradar.com/reviews/xbox-series-s",
    "Kinect": "https://www.techradar.com/news/gaming/consoles/5-ways-xbox-one-kinect-failed-microsoft-and-stiffed-early-adopters-1248505",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Ring Video Doorbell": "https://www.techradar.com/reviews/ring-video-doorbell-3-plus-review"
  }
}