{
  "source": "https://www.techradar.com/news/chrome-is-gaining-a-handy-tab-group-revival-option-try-it-now",
  "title": "Chrome is gaining a handy tab group revival option – try it now",
  "category": "computing",
  "updated": "2021-04-06T08:56:47Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Accidentally closed a group of tabs? You can get them back",
  "article": [
    "Google Chrome will soon allow you to restore a whole group of tabs that you've closed by mistake.",
    "When you're working away in Chrome, it is all too easy to get a little carried away and click something you didn't intend to. If you've ever accidentally closed a tab you needed, you may well know that you can get it back.",
    "For anyone who has got a little click-happy and killed a tab or two too soon, pressing Ctrl + Shift + T in Windows, or Command + Shift + T in macOS gets them back. It's a great shortcut to remember, but you can also use the browser's History function to resurrect closed tabs. Now this handy feature is in line for a significant upgrade.",
    "Google, like many other browser developers, has been gradually introducing new tab-related features to Chrome. One of the more recent additions is the concept of tab groups, a simple idea that lets you group together related tabs and treat them as a unit.",
    "But while grouped tabs can make life much easier when it comes to managing the things you are looking at, it is pretty easy to accidentally close a group, just as you can accidentally close an individual tab. Well aware of this, Google is introducing the ability to re-open recently closed groups in just the same way.",
    "The feature is currently available for testing the Canary preview builds of Chrome, and will eventually – all things being well – make its way to the Dev, Beta and Stable channels.",
    "Not only does the update mean it's now possible to get back closed tab groups, but there's no new keyboard shortcut to learn.",
    "In the current implementation of tab group reopening, the Ctrl + Shift + T / Command + Shift + T shortcut can also be used to get back the last closed group of tabs. In addition to this, the Recently closed section of History – which you can access via Chrome's menu, or by pressing Ctrl + Y / Command + Y – now includes links to the groups that have been closed, not just individual tabs.",
    "Via XDA Developers"
  ],
  "headers": {
    "5": "Back from the dead"
  },
  "links": {
    "Canary preview builds": "https://www.google.com/intl/en_in/chrome/canary/",
    "XDA Developers": "https://www.xda-developers.com/google-chrome-one-click-reopen-tab-groups/"
  }
}