{
  "source": "https://www.techradar.com/news/this-notorious-cybercriminal-marketplace-is-closing-its-doors",
  "title": "This notorious cybercriminal marketplace is closing its doors",
  "category": "computing",
  "updated": "2021-01-18T17:06:00Z",
  "author": "barclay-ballard",
  "summary": "Joker's Stash will soon be closed for good",
  "article": [
    "The internet’s largest marketplace for stolen credit card information has announced that it will soon be shutting down.",
    "Joker’s Stash, which has gained notoriety as the place where the spoils of identity theft attacks are put up for sale, will close on February 15.",
    "The marketplace’s administrator announced the closure on a number of cybercrime forums often frequented by the site’s buyers and sellers. Further information regarding the shutdown also comes from threat intelligence company Intel 471, which issued a blog post detailing some of Joker’s Stash’s recent difficulties.",
    "“Joker’s Stash’s fall comes after a very turbulent close to 2020,” the blog post read. “In October, the actor who allegedly runs the site announced he had contracted COVID-19, spending a week in the hospital. The condition impacted the site’s forums, inventory replenishment, and other operations. Intel 471 also observed the site’s clients complaining that the shop’s payment card data quality was increasingly poor.”",
    "In addition to the problems mentioned by Intel 471, Joker’s Stash has also recently been dealing with an ongoing police investigation. FBI and Interpol seized four domains associated with the carding forum back in December. The seizure led some users of Joker’s Stash to question when the authorities may be able to shut down more of the site’s core operations.",
    "Although Joker’s Stash will soon be out of action, this does not mean that its administrator will not face additional police action. The marketplace is estimated to have facilitated the transfer of hundreds of millions of dollars in illicit transactions since it launched in 2014.",
    "Previously, law enforcement officials have shown that they have the technical wherewithal to pursue cybercrime cases against individuals despite their best efforts to cover their tracks. Earlier this month, Europol successfully shut down the world’s largest dark web marketplace following an international investigation.",
    "Via ZDNet"
  ],
  "headers": {
    "4": "No joke"
  },
  "links": {
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "blog post read": "https://intel471.com/blog/jokers-stash-closed-february-2021/",
    "the world’s largest dark web marketplace": "https://www.techradar.com/news/europol-shuts-down-the-worlds-largest-dark-web-marketplace",
    "ZDNet": "https://www.zdnet.com/article/jokers-stash-the-internets-largest-carding-forum-is-shutting-down/"
  }
}