{
  "source": "https://www.techradar.com/news/sony-sued-over-alleged-sony-a7-iii-defect-that-makes-camera-unusable",
  "title": "Sony sued over alleged Sony A7 III defect that makes camera 'unusable'",
  "category": "cameras",
  "updated": "2021-03-29T09:57:47Z",
  "author": "mark-wilson",
  "summary": "Shutter shortcomings?",
  "article": [
    "Sony is being sued in the US over an alleged Sony A7 III defect that it's claimed renders the mirrorless camera \"unusable\" and forces owners to pay for pricey repairs.",
    "According to a post on Law Street, picked up by DIY photography, the New York-based plaintiff has filed a class-action lawsuit against Sony claiming that the A7 III has “mechanical problems with the shutter\" that have rendered the cameras \"unusable (to purchasers) provided they do not pay over $500 for repair to an authorized service center.”",
    "Of course, shutter problems aren't uncommon, and while camera companies do give estimates of how many shutter presses a camera can manage over its lifetime – in the Sony A7 III's case, that number is 200,000 – this isn't a guaranteed figure.",
    "But the lawsuit is claiming the A7 III's shutter failures happen in a \"consistent way\", making it more than a one-off issue that hits owners outside of the one-year warranty.",
    "The case doesn't appear to include any statistics showing how widespread the claimed Sony A7 III shutter issues are. But it does say that “numerous users report shutter failures far below 200,000\", with the real-world figure \"between 10,000 and 50,000 for most of the users who experienced this\".",
    "The crux of the lawsuit's argument appears to be that this often happens outside of the one-year warranty, with the result being \"that purchasers must pay approximately $500-$650 for repair and replacement of the shutter mechanism.”",
    "The lawsuit goes into quite granular detail about what it thinks causes the alleged Sony A7 III shutter issue.",
    "It claims that \"the shutter blade catches on the front edge as it moves down in taking a picture\" and that \"because the blades are positioned farther forward\", this means \"they 'catch' and fail to fully clear\". The lawsuit also suggests that \"the front curtain shutter material is of limited strength, causing it to break.\"",
    "You can read the New York case's allegations in the full class action complaint, but so far there's been no conclusion suggesting this is a problem that's widespread enough to lead to a recall. We've reached out to Sony for official comment and will update this story when we hear back.",
    "The other question this case may raise in the minds of Sony Alpha camera owners is whether or not the A7 III's shutter is used in other Sony cameras. While it's hard to answer that exhaustively, many recent Sony cameras – including the Sony A7R IV –include redesigned shutter units that bring a different number of shutter actuation ratings to the A7 III.",
    "The A7R IV, for example, is rated at a very respectable 500,000 shutter actuations, suggesting it does use a different shutter design to the A7 III. So while the lawsuit will be an interesting one to watch, there's no suggestion right now that the A7 III or any other Sony camera has any widespread shutter issues."
  ],
  "headers": {
    "6": "Curtain twitcher"
  },
  "links": {
    "Law Street": "https://lawstreetmedia.com/tech/sony-sued-over-defective-camera-shutters-rendering-cameras-unusable/",
    "DIY photography": "https://www.diyphotography.net/sony-sued-in-class-action-over-a7-iii-shutters-bricking-cameras-forcing-an-expensive-repair/",
    "full class action complaint": "https://www.docketalarm.com/cases/New_York_Southern_District_Court/7--21-cv-02618/Guerriero_v._Sony_Electronics_Inc/1/",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review"
  }
}