{
  "source": "https://www.techradar.com/news/new-avatar-series",
  "title": "New Avatar series: what to expect from Nickelodeon's Avatar Studios",
  "category": "entertainment",
  "updated": "2021-03-12T16:25:50.021Z",
  "author": "henry-st-leger",
  "summary": "Could Aang or Korra return?",
  "article": [
    "Avatar is having a moment – and no, we’re not talking about James Cameron’s Avatar franchise, with its countless sequels stuck in development. We’re talking about Avatar: The Last Airbender, the acclaimed Nickelodeon cartoon series that has inspired the children’s network to create a whole production studio for Avatar content – including both TV shows and films.",
    "Avatar is a beloved cartoon franchise, following the adventures of the eponymous 'Avatar': a being able to master all four of the elements (fire, water, wind, earth) in a world where most are able to manipulate one, or none at all.",
    "The setting is very clearly inspired by Buddhist mythology and Chinese martial arts – a point of contention at times, given the American production studio and creative leads – and sees the Avatar attempting to bring harmony between warring nations and various powerful beings.",
    "Avatar Studios, as it’s called, will be headed by the franchise’s original creators, Michael Dante DiMartino and Bryan Konietzko, and appears to have a number of projects in the pipeline, even if details are currently limited so far.",
    "The first confirmed product is an animated feature film – possibly a reboot of sorts for the franchise – rather than another TV series, but the latter seems inevitable at this point too.",
    "The announcement came in February 2021, a good seven years after the end of The Legend of Korra, long enough that many fans had given up hope of the franchise continuing. But what exactly is coming, and what story beats could a new Avatar series or movie pick up on next?",
    "In a statement released by Nickelodeon, Avatar's creators wrote that: “It’s hard to believe it’s been 19 years since we created Avatar: The Last Airbender. But even after all that time, there are still many stories and time periods in Aang’s world that we are eager to bring to life.",
    "\"We are fortunate to have an ever-growing community of passionate fans that enjoy exploring the Avatarverse as much as we do. And with this new Avatar Studios venture we have an unparalleled opportunity to develop our franchise and its storytelling on a vast scale, in myriad exciting ways and mediums. We are exceedingly grateful to Brian Robbins and Ramsey Naito for their enthusiasm and respect for the Avatar property and us as its stewards. From the start, they’ve supported our ambitious plans and created a positive, proactive environment for us.",
    "\"We’re excited to be back at Nickelodeon where Avatar began, doing what we do best in the biggest way possible. We can’t wait to build the great teams and productions to make all of this fantasy a reality” (via ScreenRant).",
    "We really don't know very much about the animated film already in the works at Avatar Studios. It could act as a refresher of sorts, revisiting the story of Aang before jumping off into different eras and story threads in follow-up TV series. We could also see the film act as a bridge between The Last Airbender and The Legend of Korra, or indeed a 'what happened next' feature following from the latter series.",
    "As you can see, it's very speculative at this point, but we expect a mix of returning faces and new settings to capitalize on the Avatar fandom.",
    "A new Avatar TV series would be exciting to many, being set in the same world as the original Avatar television show (which ran for three seasons) and its sequel, The Legend of Korra (four seasons).",
    "While the original series has more of a cult following, the latter boldly jumps forward several decades in time, with far more modern technologies and cities compared to the more feudal backdrop of The Last Airbender. Any new films or TV show, then, could be set in the same time period as Aang, as Korra, or a good time after.",
    "With many different Avatars referred to in both series – given the Avatar is essentially reincarnated over and over again throughout history – there are a few past iterations of the character we could see a dedicated season on too. Maybe ‘The First Airbender’ would have a good ring to it?",
    "We know that the co-creators of The Last Airbender, Michael Dante DiMartino and Bryan Konietzko, will be heading up the studio. That sounds great for continuity, though we’re hoping the creative team for any future projects includes more diversity – especially East Asian writers – compared to previous seasons of the show.",
    "Given the scope of Avatar Studios, though, DiMartino and Konietzko will be acting as co-chief creative officers rather than creative leads.",
    "The studio will act as a subset of Nickelodeon, too, meaning that the availability of any upcoming TV shows or films on other platforms and streaming services is uncertain. It's likely that any Avatar content will end up on Paramount Plus, given Nickelodeon is a subsidiary of Paramount – and that means anyone hoping to watch the new Avatar series on Netflix may be disappointed.",
    "Netflix subscribers will, however, have something in the world of Avatar to watch soon – but it won't be from Avatar Studios.",
    "Complicating things further is that Netflix is already making a live-action TV series based on The Last Airbender.",
    "There was an ill-fated, whitewashed and universally-panned live-action movie of The Last Airbender, directed by M. Night Shyamalan – originally intended to be a trilogy of films, but scrapped due to the poor reviews and low profits of the first film.",
    "Back in 2018, though, Netflix announced its own plans to turn The Last Airbender into a live-action TV series. The creators of the animated series were attached to the project, but left over creative differences – and reemerged with Avatar Studios shortly after, where it seems they'll have more control over the franchise's output.",
    "The current status of the Netflix series is unclear, but it does still seem to be going ahead, even if there’s no slated release date as of yet.",
    "Netflix doesn't have great form for live-action adaptations of beloved anime series either, with live-action versions of Bleach, Death Note and the like proving awkward and unnecessary remakes.",
    "You can watch all three seasons of The Last Airbender, and all four seasons of The Legend of Korra on Netflix right now too."
  ],
  "headers": {
    "6": "Avatar Studios: what was announced",
    "9": "New Avatar movie: what we know",
    "11": "New Avatar series: what to expect",
    "14": "Avatar Studios: who’s involved?",
    "18": "Avatar on Netflix: the new live-action series"
  },
  "links": {
    "ScreenRant": "https://screenrant.com/avatar-studios-launch-new-tv-shows-movies-nickelodeon/"
  }
}