{
  "source": "https://www.techradar.com/news/nyse-delists-top-chinese-mobile-operators-in-latest-us-crackdown",
  "title": "NYSE delists top Chinese mobile operators in latest US crackdown",
  "category": "phones",
  "updated": "2021-01-05T11:14:55Z",
  "author": "steve-mccaskill",
  "summary": "Sanctions ban US firms from investing",
  "article": [
    "The New York Stock Exchange (NYSE) has started the process of delisting China’s three major mobile operators following a US executive order.",
    "Outgoing President Donald Trump signed the order back in November, banning American organisations from investing in firms the government believes to have links to the Chinese military - including China Mobile, China Telecom and China Unicorn.",
    "The listings are largely symbolic given that shares in all three are also traded on the Hong Kong Stock Exchange and US firms are only believed to have small stakes. Meanwhile, the companies only have limited interests outside their homeland.",
    "However, the move has angered Beijing, which has once again accused Washington of acting politically rather than in national security interests. It has pledged to defend Chinese companies interests and hopes the two countries can work together to create certainty for investors.",
    "Political and trade tensions between the US and China have intensified during Trump’s presidency. The two sides have exchanged tit-for-tat tariffs that have affected consumer electronics, while America has pressured its allies to follow its lead and ban the use of Huawei equipment in 5G networks.",
    "The US government has also imposed sanctions that restrict Huawei’s access to American technologies and have threatened the company’s prospects in the global smartphone market. Huawei recently sold its Honor subsidiary as a result of these sanctions and its ambitions to become the world’s largest mobile phone manufacturer.",
    "As part of these activities, US operators have also bene formally banned by the US Federal Communications Commission (FCC) from providing services to China Telecom.",
    "Via Bloomberg"
  ],
  "headers": {
    "3": "NYSE China mobile"
  },
  "links": {
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-01-01/nyse-to-delist-chinese-telco-giants-on-u-s-executive-order"
  }
}