{
  "source": "https://www.techradar.com/news/facebook-data-breach-how-to-check-if-your-details-were-leaked",
  "title": "Facebook data breach: how to check if your details were leaked",
  "category": "computing",
  "updated": "2021-04-06T10:45:23Z",
  "author": "harry-domanski",
  "summary": "Find out if you were affected in the Facebook data breach",
  "article": [
    "Over the last few days, it's been revealed that the personal data of hundreds of millions of Facebook users around the globe has been leaked online.",
    "More specifically, over 533 million accounts from 106 countries that contain phone numbers, full names, locations, email addresses and other sensitive information have been found posted publicly in a hacking forum.",
    "According to a Facebook spokesperson on Twitter, \"this is old data that was previously reported on in 2019. [Facebook] found and fixed this issue in August 2019.\"",
    "For those of us who might still have the same full name, birth date, mobile number, physical address, or email address that we did in 2019, this leaked data is still sensitive – here's how to find out if your details were among the leaked.",
    "Checking to see if you're affected is very simple: just visit Have I Been Pwned and enter your email address.",
    "The site is the project of security researcher Troy Hunt and is dedicated to alerting people to whether or not their personal details have been leaked in any of the major documented security breaches, including this recent Facebook incident.",
    "If your email address (and its associated account) has been leaked in any of the breaches, Have I Been Pwned will let you know which particular breach it was involved in, and the site or service that was affected.",
    "If you've found yourself victim to this recent Facebook breach, or any other, it's recommended that you change your passwords to the affected account and any other account associated with the email address.",
    "For additional security, a password manager service can be useful in making and securely storing particularly strong and unique passwords that are unlikely to be guessed.",
    "Whether or not your details show up in the above site's search tool, it's a good idea to practice strong online security either way, and institute two-factor authentication (2FA) in any online service that offers it, ensuring that you'll need a second security check (such as a message sent to your phone) in order to access your account or change your details."
  ],
  "headers": {
    "7": "Patching up the leaks"
  },
  "links": {
    "the personal data of hundreds of millions of Facebook users": "https://www.techradar.com/news/massive-facebook-data-breach-leaks-info-on-millions-of-users",
    "Twitter": "https://twitter.com/Liz_Shepherd/status/1378398417450377222",
    "Have I Been Pwned": "https://haveibeenpwned.com/",
    "password manager service": "https://www.techradar.com/best/password-manager"
  }
}