{
  "source": "https://www.techradar.com/news/the-matrix-4-finally-gets-a-title-and-a-first-trailer-sort-of",
  "title": "The Matrix 4 finally gets a title – and a first trailer (sort of)",
  "category": "entertainment",
  "updated": "2021-08-25T09:48:47Z",
  "author": "axel-metz",
  "summary": "Back from the dead",
  "article": [
    "After years of speculation, The Matrix 4 finally has an official title: the fourth instalment in the iconic franchise will be called The Matrix Resurrections, a name that had previously been reported.",
    "Warner Bros. made the announcement at CinemaCon, an event aimed at exhibitors, where it also showed off a first trailer for the movie. It's scheduled for release simultaneously in theaters and on HBO Max on December 22.",
    "Unfortunately, the trailer itself hasn’t yet been made public, but those in attendance have penned details of what they saw to give us the first real glimpse of The Matrix Resurrections’ premise (thanks, THR).",
    "Before the studio’s presentation, the only concrete information surrounding the fourth Matrix movie related to cast announcements and Keanu Reeves’ enthusiasm for its “beautiful script and wonderful story.”",
    "Laurence Fishburne won’t be appearing, but Carrie-Anne Moss is set to join the returning Reeves as Trinity. We also know original co-director Lana Wachowski is helming the project.",
    "Beyond that, though, we knew little about the movie’s plot, or indeed how Neo and Trinity would return from the dead following the events of The Matrix Revolutions. Obviously, given the movie’s now-confirmed title, at least one or both of them will be ‘resurrected’ – though this first trailer doesn’t appear to give too much away.",
    "The Hollywood Reporter describes an opening scene that sees Thomas Anderson (Reeves) in therapy telling his therapist (Neil Patrick Harris), “I had dreams that weren’t just dreams. Am I crazy?” He senses something is not quite right with the world, but he has no memory of what The Matrix is.",
    "Later, according to THR, he runs into a woman (Moss) at a coffee shop. They shake hands, and there seems to be something between them, but neither one remembers the other. Meanwhile, Reeves’ Thomas spends his days taking prescription blue pills, and wondering why everyone in his world is glued to their phones — looking around and realizing he’s the only one on a crowded elevator not looking at a device.",
    "Eventually, Reeves’ Thomas runs into a man (Yahya Abdul-Mateen II) who has a similar energy to Morpheus, the freedom fighter played by Laurence Fishburne in the original trilogy. This mysterious man hands Anderson a red pill, and then we see footage of him with powers, seeing The Matrix for the fake reality that it is. THR says the trailer then followed some similar beats of the original, including Neo (Reeves) fighting Abdul-Mateen's character in a dojo, and an image of Anderson in an incubator.",
    "There’s also a shot of Neo looking in a mirror and seeing an older version of himself. Neo also seems to have a few new powers from the last time, with the trailer including a shot of what looks like him controlling a missile through telekinesis to prevent it from hitting him.",
    "Those lucky few who saw the footage in action have praised it as “stunning” and “extremely impressive,” though some have called out the obvious absence of the movie’s other main characters.",
    "In any case, the CinemaCon trailer is expected to drop online on August 25, so we shouldn’t have too long to wait until we get to see Neo and co. in action for ourselves.",
    "It’s safe to say that the appetite for another Matrix movie after 2003’s The Matrix Revolutions was decidedly lacking, especially since that entry in the franchise marked the third in just a four-year period.",
    "Revolutions was also the worst of the three movies, both critically and financially, so it didn’t seem likely that Warner Bros. would opt to revive the once-popular IP any time soon after its release.",
    "That said, it’s now been 18 years since the last Matrix movie, and given Hollywood’s recent tendency to rehash well-worn properties (Indiana Jones 5, Teenage Mutant Ninja Turtles, and so on), it didn’t come as a surprise to see Warner Bros. give Wachowski the green light to take audiences back into the simulated world of The Matrix.",
    "What's more, its themes – AI-gone-wrong, corporate control, the rejection of groupthink – are also perhaps more pertinent today than they ever have been, so expect critics and moviegoers alike to once again lap up Resurrections’ undoubtedly existential questions of free will and the positions of power.",
    "The fight scenes should also be pretty cool, too – John Wick director Chad Stahelski, who played Reeves' stunt double in the original movies, worked on this film's set pieces."
  ],
  "headers": {
    "12": "Analysis: Why is The Matrix being resurrected, anyway?"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "THR": "https://www.hollywoodreporter.com/movies/movie-features/matrix-4-batman-dune-warner-bros-1235002600/",
    "cast announcements": "https://www.techradar.com/news/the-matrix-4-gets-another-confirmed-cast-member",
    "Keanu Reeves’ enthusiasm": "https://www.techradar.com/news/the-matrix-4-has-a-beautiful-script-and-wonderful-story-says-keanu-reeves",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-features/matrix-4-batman-dune-warner-bros-1235002600/",
    "Indiana Jones 5": "https://www.techradar.com/news/indiana-jones-5-is-about-to-begin-filming-heres-what-we-know",
    "Teenage Mutant Ninja Turtles": "https://www.techradar.com/news/teenage-mutant-ninja-turtles-reboot-gets-2023-release-date"
  }
}