{
  "source": "https://www.techradar.com/news/sony-is-releasing-another-black-ps5-accessory-to-go-with-your-white-ps5",
  "title": "Sony is releasing another black PS5 accessory to go with your white PS5",
  "category": "gaming",
  "updated": "2021-09-15T15:00:21Z",
  "author": "adam-vjestica",
  "summary": "A Midnight Black Pulse 3D Wireless Headset is on the way",
  "article": [
    "Sony has announced that you’ll soon be able to buy another black PS5 accessory to go alongside your white PS5.",
    "The Midnight Black Pulse 3D Wireless Headset is getting a matte black makeover and will use the same subtle shades of black as seen on the Midnight Black DualSense controller that was released on June 18, 2021.",
    "The Midnight Black Pulse 3D Wireless Headset will begin rolling out globally in October, and is tuned to take full advantage of Sony’s 3D audio tech. A recent PS5 update added a new equalizer control feature for the Pulse 3D Headset, and it’s a real boon for Sony’s official pair of cans.",
    "The equalizer comes with three presets – Standard, Bass Boost, or Shooter, which were popular presets with players who used the PS4 headset companion app. If none of these sound good to you, you can create and save up to three of your own EQ presets.",
    "Now that Sony has released a black DualSense controller and black pair of PS5 headphones, will we ever officially get a black PlayStation 5? And perhaps more importantly, will Sony release some black faceplates for the PS5, or expect consumers to purchase a new console entirely?",
    "The latter would be a huge disappointment, and wouldn’t really make sense considering the PS5’s side panels can be removed with ease. This technically paves the way for all sorts of custom designs that Sony could sell, but it also makes the idea of purchasing a limited edition console, like the Xbox Series X Halo Infinite console, seem pointless if only the side panels feature special designs.",
    "The only solution available right now to those who want a black PS5 is to head to skin manufacturer dbrand and buy its Dark Plates, which let you transform the look of Sony’s PS5.",
    "It remains to be seen if Sony will release a black PS5 HD Camera and black PS5 DualSense Charging Station, but we wouldn't rule it out at this rate. The Pulse 3D Midnight Black Wireless Headset will be released on October 29, 2021, and will be priced at $99 / £89.99 / AU$159."
  ],
  "headers": {
    "4": "Analysis: will we ever get a black PS5?"
  },
  "links": {
    "PS5 accessory": "https://www.techradar.com/best/ps5-accessories",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Pulse 3D Wireless Headset": "https://www.techradar.com/reviews/ps5-pulse-3d-wireless-headset",
    "Midnight Black DualSense controller": "https://www.techradar.com/news/ps5s-dualsense-gets-two-new-color-options-and-you-can-pre-order-them-now",
    "Sony’s 3D audio tech": "https://www.techradar.com/news/best-ps5-headsets-for-3d-audio-experience-more-immersive-sound",
    "PS5 update": "https://www.techradar.com/news/ps5s-long-awaited-new-system-update-lets-you-upgrade-your-storage-on-september-15",
    "new equalizer control feature for the Pulse 3D Headset": "https://www.techradar.com/news/new-ps5-system-update-finally-makes-the-sony-pulse-3d-wireless-headset-a-must-buy",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox Series X Halo Infinite console": "https://www.techradar.com/news/halo-infinite-xbox-series-x-console-is-a-space-themed-monolith-how-to-get-it",
    "Dark Plates": "https://www.techradar.com/news/okay-so-i-kind-of-love-the-darkplates-that-have-given-me-a-black-ps5",
    "PS5 HD Camera": "https://www.techradar.com/news/what-does-the-ps5-hd-camera-accessory-do-and-should-you-buy-it"
  }
}