{
  "source": "https://www.techradar.com/news/heres-why-the-iphone-13-will-quickly-look-dated-next-year-says-top-analyst",
  "title": "Here's why the iPhone 13 will quickly look dated next year, says top analyst",
  "category": "phones",
  "updated": "2021-03-02T00:38:37Z",
  "author": "david-lumb",
  "summary": "Apple to make big changes – but likely to wait until the iPhone 14 in 2022 and rumored iPhone Flip in 2023",
  "article": [
    "The iPhone 13 is rumored to look a lot like its predecessor, but Apple might finally be ditching the unsightly notch cutout in its smartphones – just not until the iPhone 14 in 2022, according to a new report. And perhaps a year later, the company may finally release its much-rumored iPhone Flip foldable in 2023.",
    "These and other iPhone predictions come courtesy of noted Apple analyst Ming-Chi Kuo, who presented a new report for supply chain investors, according to 9to5Mac. What will replace the notch on the iPhone 14 lineup? A punch-hole, though it isn’t clear what Apple will do with the suite of sensors – a dot projector, infrared camera, and flood illuminator – that occupy newer iPhone notches to make Face ID work and add depth to selfies.",
    "It’s possible that only the higher-end iPhone 14 Pro and Pro Max get this upgrade, Kuo hedged, leaving the iPhone 14 and/or 14 mini with a notch.",
    "Kuo also suggests Apple could launch a 7.5- or 8-inch model of the iPhone Flip foldable, or whatever it ends up being called, by 2023, per 9to5Mac. But he didn’t have any other details about Apple’s version of a foldable phone to share.",
    "Below the presumed 'flagship' level of iPhone 14 models (mini/standard/pro/pro max) are the more affordable and lower-featured models of iPhones, but Kuo predicts these will get 5G versions by 2022 as well.",
    "First is a 5G-capable replacement for the iPhone 11, should Apple end up replacing that model (which first came out in 2019), though it will still be a 6-inch display model with Face ID...and 5G connectivity . Given its place between flagship and affordability, this suggests Apple wants to keep a model in this slot around the $599 / £599 / AU$999 price point, which is where the iPhone 11 currently resides.",
    "Kuo also anticipates that Apple will release an update of last year's iPhone SE in the first half of 2022 that’s 5G-capable, finally bringing connectivity to the low end of the iPhone lineup. But, perhaps unsurprisingly, the new mid-range iPhone is expected to retain the iPhone 8-like design and 4.7-inch display, meaning only a new chipset and connectivity may be added.",
    "In summary, Kuo’s predictions outline a focus from Apple on just getting 5G across its iPhone portfolio in the next 2-3 years – with any advancements coming solely to the top of the lineup and, once again, years after they’ve debuted on Android flagships.",
    "Via XDA Developers"
  ],
  "headers": {
    "4": "Apple will make its whole lineup 5G by 2022, Kuo predicts"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "9to5Mac": "https://9to5mac.com/2021/03/01/kuo-apple-8-inch-foldable-iphone-2023/",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "XDA Developers": "https://www.xda-developers.com/iphone-2022-hole-punch-iphone-2023-foldable-display/"
  }
}