{
  "source": "https://www.techradar.com/news/save-a-huge-dollar50-off-this-lg-slm3r-soundbar-ahead-of-black-friday",
  "title": "Save a huge $50 off this LG SLM3R soundbar ahead of Black Friday",
  "category": "news",
  "updated": "2021-11-11T01:00:02Z",
  "author": "rhys-wood",
  "summary": "Walmart Plus subscribers can access the Black Friday deal early",
  "article": [
    "We're sure many of you will be scouring Black Friday deals to potentially grab yourself one of the best soundbars at a discounted price. However, this fantastic cheap soundbar has just gotten even cheaper due to this impeccable deal.",
    "Walmart just launched its early Black Friday sale, and the retailer has the LG SLM3R 4.1 wireless Bluetooth soundbar for just $129, down from the usual retail price of $179. That's a $50 saving for this excellent, affordable soundbar.",
    "(Not in the US? Scroll down for deals in your region).",
    "This is a fantastic deal for the LG SLM3R 4.1 wireless Bluetooth soundbar, as the value for money is simply astounding. Not only do you get the soundbar, but it also comes with a wireless subwoofer and a pair of wireless rear speakers. This allows you to set up a basic home theater layout, making it an excellent deal for first time soundbar buyers.",
    "It's worth noting that the 4.1 setup isn't exactly typical for soundbars. However, the soundbar itself, in this case, acts as a stereo speaker, supported by the subwoofer and two rear speakers to fill your room with audio. That audio experience can be further enhanced with spatial audio codecs like Dolby Atmos, if you have devices like TVs or games consoles that support the feature.",
    "You also have options in how you want to connect your soundbar to your devices, including optical for a wired connection and Bluetooth for a strictly wireless one. The latter allows for more versatile placement of the soundbar, subwoofer and rear speakers, but do keep in mind that a Bluetooth connection isn't quite as stable as a wired one, meaning a rare audio hiccup or stutter can occur.",
    "No matter where you live, you'll find all the lowest prices for the best LG soundbars from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Black Friday soundbar deal",
    "6": "More LG soundbar deals"
  },
  "links": {
    "best soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "cheap soundbar": "https://www.techradar.com/news/best-soundbar-for-under-dollar200pound200",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "just $129": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-3680799234544884700&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FLG-4-1-Channel-420W-Soundbar-Surround-System-with-Wireless-Speakers-SLM3R%2F664513690",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "TVs": "https://www.techradar.com/news/best-tv"
  }
}