{
  "source": "https://www.techradar.com/news/ps5-needs-discord-way-more-than-xbox",
  "title": "PS5 needs Discord way more than Xbox",
  "category": "gaming",
  "updated": "2021-03-27T15:30:36Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Forget about Microsoft, Sony should splash the cash",
  "article": [
    "Microsoft is in exclusive talks to buy Discord for the princely sum of $10 billion dollars. That’s a cool $2.5 billion more than it recently paid to acquire ZeniMax Media, the parent company of Bethesda. However, I can’t help but think that it’s Sony that should be trying to purchase Discord, not Microsoft.",
    "While it’s unlikely to have the capital at hand that Microsoft can muster, buying Discord would help Sony address one of the most disappointing aspects of the PS5: its lackluster voice chat.",
    "Objectively speaking, voice chat on PS5 doesn’t compare too favorably with Xbox. You can argue until you’re blue in the face that it’s “just as good” but you’d be wrong. Anyone who regularly switches between the two platforms can attest that PlayStation’s offering isn’t up to snuff when compared with Microsoft’s implementation. But there’s a good reason why.",
    "It’s easy to forget that Microsoft first brought voice chat to the original Xbox way back in 2002. It then took voice chat one step further by introducing Party Chat (or cross-game chat) during the Xbox 360 era in 2008 and has continued to tweak it since (you can now adjust the individual audio level of each party member now, for example). Microsoft has since invested heavily into its online services, something which was helped by users paying to play online. It’s had time and the resources, then, to hone its offering.",
    "Sony, meanwhile, took a different approach to online chat. Online was free on PS3, but Party Chat never materialized on Sony’s platform due to restrictions with the console’s memory. PlayStation fans had to wait until the PS4 for Party Chat to finally make an appearance on console, which coincided with the company making PlayStation Plus mandatory for online play.",
    "While this was certainly a much-needed addition to PlayStation’s online suite of services, Microsoft went one step further to improve voice chat in a big way on Xbox One. The Redmond-based company bought Skype in 2011 for $8.5 billion, and quickly implemented the voice platform’s technology into Xbox One to significantly improve the audio quality.",
    "The difference in audio quality from Xbox 360 to Xbox One was stark, and it’s for this reason that I think Sony could benefit immensely from acquiring Discord. It’s an established platform that excels at instant messaging, voice chat and video, and its technology would do wonders for PlayStation users. It would help PlayStation close the aforementioned development gap with Xbox almost instantly, too.",
    "If Sony owned Discord, it could immediately supercharge its current online offering by integrating the same technology that powers Discord so successfully. Audio quality could be improved, along with stability; its messaging system could finally work as intended, instead of being cumbersome and inconsistent; and it could even pave the way for video chat on PlayStation, which has grown in importance during the pandemic. A lot of people bought the new PS5 camera, after all, but there’s little you can do with it as it stands.",
    "Discord’s voice chat has a number of desirable features that would benefit PlayStation users, such as options for echo cancellation, noise reduction and automatic gain control. Voice chat also doesn’t require constant invites to start conversations: you simply join a voice channel that’s always open and drop in and out as you please. Considering how bad creating a Party Chat is on PS5 right now, that would be a blessing in itself.",
    "Discord would also give Sony access to hundreds of communities to engage with right away, the majority of which are gaming focused. Sony’s teams of devs could each have official Discord channels that players could congregate in, and it would provide a far more effective platform to deliver news and updates than using the PS5’s Activity Cards and home screen.",
    "With Sony set to remove PlayStation Communities from PS4, which is essentially a homage to the many channels and servers on Discord where communities thrive, Sony wouldn’t need to create another feature that essentially lives and dies on a closed platform. Having it be accessible via Discord would require less maintenance, and increase its chance of being utilized far more.",
    "But alas, it appears that Microsoft is already one step ahead of its closest competitor, mainly because it has the financial clout to do so. But also because Microsoft is all too aware that when you purchase a company, you don’t just own a successful business and brand: you’re now able to utilize the tools, technology and people that helped make those companies so successful in the first place.",
    "In fairness, it makes sense for Microsoft to go after Discord so strongly. Xbox and PC are now closely aligned thanks to Xbox Game Pass, and head of Xbox Phil Spencer has suggested that Microsoft would be open to “cross-talk” between Xbox Party Chat and Discord for quite some time. You’d like to think that Microsoft would ensure that this became a reality quickly, and would also use Discord to become a place for the Xbox community to congregate, something which its failed streaming service Mixer never managed to accomplish.",
    "I also wouldn’t be surprised to see Discord Nitro, the communication app’s paid tier which gives users an enhanced experience, be bundled in as part of Xbox Game Pass Ultimate. This would undoubtedly encourage more PC users to sign up to Xbox Game Pass, too, and would also introduce Discord to more Xbox users as a result. Microsoft has already given away three months of Discord Nitro to Xbox Game Pass Ultimate subscribers as part of its ‘Perks’ scheme, so the precedent is there.",
    "Ok, maybe it’s fine if Microsoft buys Discord after all… Sorry, Sony."
  ],
  "headers": {
    "5": "Skype up your life",
    "7": "Nitro fueled",
    "12": "Money talks"
  },
  "links": {
    "Microsoft is in exclusive talks to buy Discord": "https://www.techradar.com/news/microsoft-is-in-talks-to-acquire-gaming-chat-platform-discord-for-dollar10-billion",
    "Bethesda": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "Discord": "https://www.techradar.com/how-to/how-to-use-discord",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox 360": "https://www.techradar.com/news/gaming/consoles/how-the-xbox-360-won-the-console-war-1196990",
    "adjust the individual audio level of each party member": "https://www.techradar.com/news/xbox-one-is-getting-a-game-changing-feature-for-those-who-play-with-friends",
    "restrictions with the console’s memory": "https://www.eurogamer.net/articles/2011-08-19-why-the-ps3-cant-do-cross-game-voice-chat",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "bought Skype in 2011 for $8.5 billion": "https://www.techradar.com/news/world-of-tech/official-microsoft-buys-skype-for-8-5-billion-953924",
    "implemented the voice platform’s technology into Xbox One to significantly improve the audio quality": "https://www.polygon.com/2013/5/24/4359342/xbox-one-voice-chat-skype",
    "PS5 camera": "https://www.techradar.com/news/what-does-the-ps5-hd-camera-accessory-do-and-should-you-buy-it",
    "PS5’s Activity Cards": "https://www.techradar.com/news/the-ps5-ui-looks-like-its-designed-to-promote-busywork-not-save-you-time",
    "remove PlayStation Communities from PS4": "https://www.techradar.com/news/sony-is-removing-another-ps4-feature",
    "open to “cross-talk” between Xbox Party Chat and Discord": "https://www.theverge.com/2019/11/14/20965239/xbox-project-scarlett-price-performance-ps5-phil-spencer-interview",
    "Mixer": "https://www.techradar.com/news/mixers-death-means-the-xbox-series-x-could-have-facebook-gaming",
    "Discord Nitro": "https://discord.com/nitro",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}