{
  "source": "https://www.techradar.com/news/whatsapp-group-chats-are-getting-more-private",
  "title": "WhatsApp group chats are getting more private",
  "category": "phones",
  "updated": "2021-04-13T14:06:54Z",
  "author": "sofia-wycislik-wilson",
  "summary": "New self-destructing WhatsApp message options are coming",
  "article": [
    "WhatApp will soon allow you to decide who can send self-destructing messages in group chats, giving you an extra level of control over privacy.",
    "WhatsApp has been working on its disappearing message feature for quite some time, giving users the ability to configure the messages they send automatically vanish after a set period.",
    "The company is continuing to develop the feature, working on new options that will make it even more useful. The latest change sees the arrival of new admin options that make it possible to choose which members of a group chat are able to control and use the feature.",
    "The disappearing messages option has been available in both individual and group chats for a while now, but only administrators have been able to enable or disable the feature for a group.",
    "This is set to change, however. In the latest beta version of the Android app, it's possible to choose between two options – either all group members can enable or disable disappearing messages, or only administrators.",
    "The update means that if you head to Edit group info, you will see that the setting lets you choose who can change this group's subject, icon, description and disappearing messages setting. You can pick between All participants and Only admins, depending on the level of control you are will to hand out to group members.",
    "At the moment you'll need to be part of the WhatsApp beta program to see the new feature. Group controls for disappearing messages can be found in WhatsApp 2.21.8.7 beta for Android, but it's safe to assume that the same options will be landing in iOS in the near future.",
    "Via WABetaInfo"
  ],
  "headers": {
    "5": "Now you see it..."
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-8-7-whats-new/"
  }
}