{
  "source": "https://www.techradar.com/news/remote-desktop-cyberattacks-top-new-high",
  "title": "Remote desktop cyberattacks top new high",
  "category": "computing",
  "updated": "2021-02-10T05:20:30Z",
  "author": "anthony-spadafora",
  "summary": "RDP attack attempts rose by 768 percent last year",
  "article": [
    "As employees around the world were busy making the transition to working from home last year, cybercriminals were quick to capitalize on the fact that their home networks lacked the security and safeguards found on corporate networks.",
    "While some workers used VPN services to connect to their corporate networks, many relied on remote desktop software including Microsoft's Remote Desktop Protocol (RDP) which comes included with Windows 10.",
    "Due to the high number of users leveraging RDP, the cybersecurity firm ESET saw a record 768 percent increase in RDP attack attempts last year, according to its Q4 2020 Threat Report.",
    "Chief research officer at ESET, Roman Kováč explained in a press release how cybercriminals often use RDP as a means to deploy ransomware, saying:",
    "“RDP security is not to be underestimated especially due to ransomware, which is commonly deployed through RDP exploits, and, with its increasingly aggressive tactics, poses a great risk to both private and public sectors. As the security of remote work gradually improves, the boom in attacks exploiting RDP is expected to slow down – we already saw some signs of this in Q4.”",
    "ESET's Q4 2020 Threat Report also offers further insight on how the cybersecurity firm took part in a global disruption campaign alongside Microsoft, FS-ISAC, Lumen's Black Lotus Labs, NTT and Broadcom's cybersecurity division Symantec to take down TrickBot.",
    "By working together to disrupt one of the largest and longest-lived botnets, the firms coordinated efforts resulted in 94 percent of TrickBot's servers being taken down in a single week.",
    "The Q4 2020 Threat Report also goes into detail about how ESET researchers discovered a previously unknown APT group named XDSpy which targeted the Balkans and Eastern Europe as well as how the firm discovered a remarkable number of supply chain attacks last year.",
    "Via The Register"
  ],
  "headers": {
    "5": "2020 Threats"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "RDP": "https://www.techradar.com/reviews/microsoft-remote-desktop-review",
    "ESET": "https://www.techradar.com/news/eset-unveils-advanced-protection-services-for-microsoft-365",
    "Q4 2020 Threat Report": "https://www.welivesecurity.com/wp-content/uploads/2021/02/ESET_Threat_Report_Q42020.pdf",
    "press release": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8868089204004480000/https://www.eset.com/us/about/newsroom/press-releases/eset-issues-its-q4-2020-threat-report-recording-a-massive-increase-in-rdp-attack-attempts-since-q1-1/",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "TrickBot": "https://www.techradar.com/news/the-avengers-of-security-teamed-up-to-try-and-take-down-the-trickbot-botnet",
    "supply chain attacks": "https://www.techradar.com/news/dell-looks-to-crack-down-on-possible-supply-chain-security-attacks",
    "The Register": "https://www.theregister.com/2021/02/09/eset_threat_report_2020/"
  }
}