{
  "source": "https://www.techradar.com/news/is-buying-refurbished-tech-the-best-way-to-find-black-friday-deals",
  "title": "Is buying refurbished tech the best way to find Black Friday deals?",
  "category": "appliances",
  "updated": "2021-11-13T17:38:56Z",
  "author": "hamish-hector",
  "summary": "Why buy new when you can get a used item for less?",
  "article": [
    "Even with the discounts we’re likely to see thanks to upcoming Black Friday deals, the latest tech rarely comes cheap. On the hunt for a bargain, your eyes might have been drawn to the reduced price of refurbished tech, but should you steer clear of these tempting offers or not?",
    "Refurbished, used and like-new devices may be less expensive than their out-of-the-box counterparts, but they also come with a degree of uncertainty - is the item just a little scuffed or are we paying out for a plastic brick?",
    "Thanks to our experience with buying tech secondhand we’re here to highlight why the refurbished tag shouldn’t immediately scare you away, but also what you need to look out for when buying something used.",
    "The reduced cost of refurbished tech is likely the biggest draw, attracting those on the hunt for reasonable prices. Even outside of Black Friday you can typically find savings of around 10-20% on gadgets that might be only a few months old.",
    "During Black Friday the deals will often get even sweeter as the sale prices on new products are carried over to their secondhand counterparts; with the refurbished discount being added on top you can potentially save a significant amount compared with the device’s usual RRP.",
    "We’ve had success buying second-hand games consoles, webcams, smartphones, and more - all of it at a much lower price than we would have otherwise paid. We further compounded the savings by trading in our own old tech at the same time, sometimes paying nothing to get our hands on the device we were after.",
    "Savings aren’t the only draw though, with another driving force being that secondhand purchases reduce electronic waste.",
    "Following the recent COP26 conference, climate change, its effects, and what we can do to prevent the situation from worsening have been on the minds of citizens across the globe. One way we can do our bit is by buying up older but usable tech rather than sending it to landfill.",
    "Recent efforts are only starting to make electronic waste easier to recycle - the UK’s Royal Mint unveiled its high-tech solution very recently - so for now we need to find other ways of keeping our old technology out of the trash and using it for as long as we can.",
    "While this won’t convince as many people to buy used as the discounts available, the feeling that you’re doing the right thing is an added benefit that you won’t get from buying new.",
    "Before you head straight for the secondhand sites you need to be careful though, as not all refurbished and used items are equal. Like all things, tech components will get worn out with use, and if you aren’t careful you could end up buying a gadget that’s more worn down than its age might have you believe.",
    "With any piece of secondhand kit you expect the odd scuff or scrape on the outer shell - but it’s the internal components (the ones you can’t see) that you need to worry about.",
    "If you’re looking to save more over and above the best Black Friday OLED TV deals that are out there then a refurbished offering can seem like a good bet - especially given how expensive these screens can be.",
    "Unfortunately, we’d recommend you steer clear of second-hand OLEDs unless you can see them in action or they’re from a retailer with quality guarantees. That's because OLED screens can be damaged by an effect called burn-in - where an image has been on display for too long and becomes permanently branded into the screen.",
    "Manufacturers say that - especially with newer OLED screens - burn-in is much less of a concern than it used to be and isn’t something that the average user should worry about. However, it’s the kind of damage that might make someone else want to abandon their TV and get a new one - potentially leaving the damaged tech with whichever sucker buys it off them.",
    "Customers after a high-end PC that takes advantage of Black Friday gaming laptop deals should be on the lookout, too. Cryptocurrency mining has become massive these past few years, causing most of the best components to be sold out almost instantly - laptops using GPUs like the RTX 3080 and equally powerful processors have also been snatched up quickly.",
    "Mining is an intensive process that puts strain on these components though, and eventually, they’ll be too worn out to function properly. At this point, a shady character might decide to sell them on as ‘used’, offering them up for a very reasonable price online; in actuality, you're paying $500 for the equivalent of a pet rock.",
    "Because of these fears, we’d recommend steering clear of sites like Facebook Marketplace or eBay unless you are certain there are sufficient buyer protections and the seller is reliable. Also, be sure to read the item description’s fine print - you don’t want to be sold a printed-out image rather than the real deal.",
    "Instead, we’d recommend buying from sites that offer a warranty on the refurbished items. In the US that’s stores like Best Buy, Walmart, and the device’s original manufacturer. If you’re in the UK you can also turn to the original manufacturers as well as the store CEX. Amazon also offers refurbished and used items, but they aren’t always from Amazon-certified sellers so be sure you understand all the terms before you check out.",
    "Beyond that, our recommendation would be to make sure you’re actually paying less when buying secondhand.",
    "Sometimes you’ll find secondhand items are actually more expensive than if you’d bought the item new, and that's especially likely during Black Friday as some vendors may offer savings that beat out the savings from buying used.",
    "Sought-after gadgets like the PS5 and Xbox Series X may also be sold at a premium second hand, so it’s always worth double-checking the price against what you can find elsewhere - ur Black Friday guides are a great place to start if you want to compare prices you see online.",
    "You can check out a few of our Black Friday deals guides below:"
  ],
  "headers": {
    "3": "Old to them, new to you",
    "10": "One person’s trash is another person’s... trash"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "UK’s Royal Mint unveiled its high-tech solution": "https://www.techradar.com/news/we-can-finally-reuse-billions-worth-of-gold-from-discarded-smartphones-heres-how",
    "Black Friday OLED TV deals": "https://www.techradar.com/black-friday/black-friday-oled-tv-deals-2021-the-best-early-oled-sales-you-can-find-today",
    "Black Friday gaming laptop deals": "https://www.techradar.com/black-friday/black-friday-gaming-laptop-deals",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "paying $500 for the equivalent of a pet rock": "https://www.techradar.com/news/graphics-card-maker-warns-on-dangers-of-buying-second-hand-mining-gpus",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft"
  }
}