{
  "source": "https://www.techradar.com/news/theres-a-surprise-new-star-wars-game-headed-to-apple-arcade",
  "title": "There's a surprise new Star Wars game headed to Apple Arcade",
  "category": "gaming",
  "updated": "2021-10-20T08:19:23Z",
  "author": "gerald-lynch",
  "summary": "Another Lego Star Wars title is on the way",
  "article": [
    "Well, we didn't Force-forsee this one coming – there's a new Star Wars game on the way, headed to Apple Arcade on November 19.",
    "Lego Star Wars Castaways again recreates that galaxy far, far away in minifig block form, but this sounds as if it's going to be a Lego game with a difference, with MMO-like elements thrown into the mix.",
    "Developed by Gameloft, you'll create a wholly new Star Wars minifig as your character, who has been left stranded among a community of the titular 'castaways' on an unknown planet.",
    "The socially-minded game will then see you racing microfighters, fighting foes, solving puzzles and joining fellow players for missions and quests to unlock new customisable pieces and solve the mystery of an ancient civilisation on the planet.",
    "Another Apple Arcade exclusive, you'll only be able to play on iPhone, iPad, Mac and Apple TV.",
    "Lego Star Wars Castaways is sounding pretty cool then, and is another seemingly-solid addition to the ever-growing Apple Arcade library. Like Xbox Game Pass, Apple Arcade is becoming an unmissable service for gamers – especially mobile players.",
    "It's not the first Lego game on Apple Arcade either, let alone Lego Star Wars game. The service is becoming a great stop for Lego titles, including Lego Brawls, Lego Builder's Journey and Lego Star Wars Battles.",
    "And the Lego Star Wars gaming universe is set to grow wider still in the near future – the long-awaited launch of Lego Star Wars: The Skywalker Saga is still sitting just over the horizon, expected to release at some point in Spring of next year. As for other Star Wars games, there's also the Knights of the Old Republic remake in the works, heading to PS5 at an as-yet-undisclosed point in the future.",
    "Whether you're a Lego nut, Star Wars fan or both, there's lots to look forward to."
  ],
  "headers": {
    "5": "The expanding Lego Star Wars universe"
  },
  "links": {
    "Apple Arcade": "https://www.techradar.com/reviews/apple-arcade",
    "iPhone": "https://www.techradar.com/reviews/iphone-13",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Lego Star Wars: The Skywalker Saga": "https://www.techradar.com/news/lego-star-wars-the-skywalker-saga-release-date-trailers-news-and-gameplay",
    "Knights of the Old Republic remake": "https://www.techradar.com/news/knights-of-the-old-republic-remake"
  }
}