{
  "source": "https://www.techradar.com/news/nvidia-unveils-the-uks-fastest-supercomputer",
  "title": "Nvidia unveils the UK's fastest supercomputer",
  "category": "computing",
  "updated": "2021-07-07T13:19:51Z",
  "author": "mayank-sharma",
  "summary": "Cambridge-1 runs completely on renewable energy",
  "article": [
    "Nvidia has launched its Cambridge-1 supercomputer, reportedly the most powerful supercomputer in the UK, in a bid to bolster the country’s world-leading life sciences industry.",
    "The supercomputer represents $100 million worth of investment by Nvidia, and has been made available to external researchers in the UK healthcare industry.",
    "“Cambridge-1 will empower world-leading researchers in business and academia with the ability to perform their life’s work on the UK’s most powerful supercomputer, unlocking clues to disease and treatments at a scale and speed previously impossible in the UK,” said Jensen Huang, founder and CEO of Nvidia.",
    "An NVIDIA DGX SuperPOD supercomputing cluster, the Cambridge-1 ranks at number 41 on the Top 500 supercomputers list and is fully powered by renewable energy.",
    "Nvidia claims it has poured all its artificial intelligence (AI) and simulation expertise into the supercomputer, and hopes it will enable healthcare researchers in their efforts to fight Covid-19.",
    "The company leans on a report by Frontier Economics that says Cambridge-1 has the potential to create an estimated value of £600 million (about $825 million) over the next decade.",
    "“This is an Nvidia industrial supercomputer owned and operated by Nvidia, and it’s the first one that we’re opening up to public use,” said Kimberly Powell, vice president of healthcare at Nvidia speaking to VentureBeat.",
    "Nvidia complimented the supercomputers’ launch by announcing a handful of healthcare projects with various research institutes and companies, such as AstraZeneca, GSK, Guy’s and St Thomas’ NHS Foundation Trust, King’s College London and Oxford Nanopore Technologies."
  ],
  "headers": {
    "4": "AI for healthcare"
  },
  "links": {
    "Nvidia": "https://www.techradar.com/news/nvidia-geforce",
    "Jensen Huang": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-6302816562610673000&murl=https%3A%2F%2Fnvidianews.nvidia.com%2Fnews%2Fnvidia-launches-uks-most-powerful-supercomputer-for-research-in-ai-and-healthcare",
    "Top 500": "https://www.techradar.com/news/nvidia-intel-chips-continue-to-dominate-the-hpc-landscape",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "VentureBeat": "https://venturebeat.com/2021/07/06/nvidia-launches-100m-supercomputer-for-u-k-health-research/"
  }
}