{
  "source": "https://www.techradar.com/news/marvels-avengers-is-coming-to-xbox-game-pass-on-september-30",
  "title": "Marvel’s Avengers is coming to Xbox Game Pass on September 30",
  "category": "gaming",
  "updated": "2021-09-28T16:17:57Z",
  "author": "jamel-smith",
  "summary": "Avengers, assemble!",
  "article": [
    "Marvel’s Avengers developer Crystal Dynamics has announced that its ambitious superhero game is coming to Xbox Game Pass on September 30 for Xbox consoles, PC and via Xbox Cloud Gaming.",
    "Marvel’s Avengers on Xbox Game Pass includes the full game and all previously released content, post-launch heroes, and expansions. That means you can prepare to fight for Wakanda in the Black Panther: War for Wakanda expansion.",
    "But that’s not all. Any future content and expansions featuring new heroes, missions and expansions will be added to Marvel’s Avengers on Xbox Game Pass, so you’ll always be playing the most up-to-date version of the game.",
    "Marvel’s Avengers joins the plethora of other Xbox games in supporting Xbox Smart Delivery, which means that players who own the Xbox One version will be able to upgrade to the Xbox Series X/S version at no extra cost. The next-gen version of Marvel’s Avengers features higher framerates and a better resolution than the Xbox One version.",
    "Even though Marvel’s Avengers appearance on Xbox Game Pass will be a huge boon for the game’s player base, there’s still no plan for Xbox, or any other platform, to receive the upcoming Spider-Man DLC other than PlayStation consoles. The Spider-Man DLC will be an “event” according to Crystal Dynamics’ Dan Matlack, which features its own cutscenes and story. Hopefully, we’ll get some more information on whether this PlayStation exclusive content will come to other platforms, but we wouldn’t count on it.",
    "Additionally, players of Marvel’s Avengers on Xbox Game Pass will have to buy the digital-only Endgame Edition separately if they want to receive the eight cosmetic items that are tied to that edition.",
    "Marvel’s Avengers was also recently added to PS Now, Sony’s subscription service that lets you download and stream PS4, PS2, and PS3 games, though the latter cannot be downloaded. Unfortunately, though, it was only the PS4 version of the game, as PlayStation Now doesn’t include any PS5 titles as of yet – something that we hope will change in the future."
  ],
  "headers": {
    "4": "Analysis: a few downers"
  },
  "links": {
    "Marvel’s Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Spider-Man DLC": "https://www.techradar.com/news/marvels-avengers-spider-man-exclusivity-deal-is-bad-for-everyone-including-sony",
    "Crystal Dynamics’ Dan Matlack": "https://mp1st.com/news/marvels-avengers-klaw-raid-will-be-unique-spider-man-will-have-story-cutscenes-confirmed",
    "PS Now": "https://www.techradar.com/news/best-ps-now-games",
    "PlayStation Now doesn’t include any PS5 titles": "https://www.techradar.com/news/the-problem-with-playstation-now-and-how-to-fix-it"
  }
}