{
  "source": "https://www.techradar.com/news/funimation-roku",
  "title": "How to install Funimation on Roku",
  "category": "entertainment",
  "updated": "2021-09-01T15:24:09Z",
  "author": "georgia-silcox",
  "summary": "Now you can watch all your favorite anime on your TV",
  "article": [
    "Since its launch in 2016, Funimation has accumulated an impressive 2.5 million users through its app, which is available on a number of devices. You can even get Funimation on Roku and other media streamers, where users can tune into the anime streaming service and watch over 15,000 hours of available content.",
    "If you want to watch one of the best streaming services for anime on your TV, we're going to explain how to get the Funimation on Roku. So keep reading for our guide to getting access to the biggest library of English dubbed anime on your Roku device, including Attack on Titan and Black Clover.",
    "It sure is! You can watch all your favorite anime on your TV with Funimation on Roku. From the Roku Streaming Stick+, Roku Ultra, and Roku Express, you can install the Funimation app on all the best Roku streaming devices.",
    "Funimation is one of thousands of free and paid for channels available on Roku devices. Better still, Roku streaming players are a more convenient way to watch TV in one place, and gives you access to HD anime and movies, OVAs, extras, and the hottest, top-trending shows.",
    "It's a simple process to install Funimation on Roku. We've created a step-by-step guide to make it even easier for you.",
    "If you haven't already got a Funimation account, head to the website to sign up. You can get a 14-day Funimation free trial, so you can work out which of the free or paid for options is for you.",
    "With over 600 shows available to watch, it's no wonder that Funimation is one of the most popular anime streaming services. Specializing in dubs and distributing TV shows and movies from East Asia, specifically Japanese anime, Funimation has an impressive library. So whether you're looking for a light-hearted comedy, romance, or live-action, you can watch Funimation on Roku and get a bit of everything.",
    "If you're an Attack On Titan fanatic, or a lover of My Hero Academia, you can watch on Funimation on Roku. Some of the other top titles available to stream include One Piece and Rurouni Kenshin, with Toradora!, Naruto, and High School DxD all on the Funimation recommended tab for when you can't decide what to watch.",
    "The free subscription option only gives you access to a sample of the extensive Funimation library and there will be some ad breaks in there too. For full access to the thousands of hours of anime on Funimation and ad-free viewing, you'll want to upgrade to a Premium Plus plan instead. Then you'll be able to watch the latest shows from Japan on your TV with Funimation on Roku.",
    "If you're looking for a more general streaming service to fill the gaps between anime binge-watches, a whole host of streaming services are available on Roku, including:",
    "Read more:"
  ],
  "headers": {
    "2": "Is Funimation available on Roku?",
    "4": "How do I get Funimation on Roku?",
    "6": "What can I watch with Funimation on my Roku device?",
    "9": "What other streaming services are available on Roku?"
  },
  "links": {
    "Funimation": "https://www.techradar.com/news/funimation-explained-subscriptions-sign-up-free-account",
    "best streaming services for anime": "https://www.techradar.com/best/best-streaming-service-for-anime",
    "Funimation app": "https://www.techradar.com/news/funimation-app",
    "best Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "head to the website to sign up": "https://funimation.8u86.net/c/221109/302280/4688?subId1=trd-us-1012375661711128200&sharedId=trd-us&u=https%3A%2F%2Fwww.funimation.com%2Fsubscribe%2F",
    "Funimation free trial": "https://www.techradar.com/news/funimation-free-trial"
  }
}