{
  "source": "https://www.techradar.com/news/paypal-may-soon-offer-stock-trading",
  "title": "PayPal may soon offer stock trading",
  "category": "computing",
  "updated": "2021-08-31T15:17:39Z",
  "author": "sead-fadilpasic",
  "summary": "New PayPal hire hints at new services at the payment service provider",
  "article": [
    "Global payments powerhouse PayPal may be considering expanding into the retail investing business, reports have claimed.",
    "According to CNBC, the company is considering allowing its users to trade stocks and has, to that end, hired brokerage industry veteran Rich Hagen. After leaving his position of CEO at Ally Invest, Hagen joined Invest at PayPal, a brand new division about which there are very few details at the moment, although his LinkedIn account notes Hagen is tasked with “exploring opportunities” in the consumer investment business.",
    "This is in line with what PayPal CEO Dan Schulman said during the company’s investor day in February 2021 when discussing his long-term vision, which included the possibility of including “investment capabilities” as part of the company’s offerings.",
    "This is far from PayPal’s first foray into investing. Last year it expanded into the cryptocurrency market, slowly allowing an increasing number of users to buy, hold and sell bitcoin.",
    "This service was recently extended into the UK, allowing Brits to buy or sell bitcoin, bitcoin cash, ethereum or litecoin.",
    "The popularization of cryptocurrencies has had a side-effect - growing awareness of the possibility of retail investment and trading, where ordinary individuals are able to easily trade everything from stocks, to precious metals, to cryptocurrencies.",
    "The trend reached its peak when a group of retail investors, organized on a Reddit subforum, “shorted” GameStop stocks, leaving WallStreet with billions in losses.",
    "“It has been doing really well in the U.S.,” Jose Fernandez da Ponte, PayPal’s general manager for blockchain, crypto and digital currencies, told CNBC, when asked about the company’s crypto services. “We expect it’s going to do well in the U.K.”.",
    "“The tokens and coins have been around for a while but you had to be a relatively sophisticated user to be able to access that,” da Ponte said. “Having that on a platform like ours makes a really good entry point.”",
    "It might take a while for PayPal to kick things off, though, and it’s unlikely the service will be available this year.",
    "Via: CNBC"
  ],
  "headers": {
    "5": "Retail trading"
  },
  "links": {
    "PayPal": "https://www.techradar.com/reviews/paypal-commerce-platform",
    "bitcoin": "https://www.techradar.com/news/best-bitcoin-wallets",
    "CNBC": "https://www.cnbc.com/2021/08/22/paypal-crypto-service-launches-in-the-uk.html"
  }
}