{
  "source": "https://www.techradar.com/news/adobe-brings-apple-m1-to-more-of-its-creative-cloud-apps",
  "title": "Adobe brings Apple M1 to more of its Creative Cloud apps",
  "category": "computing",
  "updated": "2021-06-08T16:17:01Z",
  "author": "daryl-baxter",
  "summary": "Now 80% faster on M1",
  "article": [
    "Only a day after Apple’s announcements at WWDC, Adobe has now announced native M1 support for three of its applications for Apple’s M1 Macs, including the recently-released iMac and its assorted colors.",
    "Only last month Adobe Audition was updated to include M1 support, which works from Apple’s Silicon chips rather than Intel’s that has significant performance gains across the Creative Cloud suite.",
    "While Premiere Pro is still in beta testing for the M1 chips, it’s a significant June update for Adobe that brings huge speed improvements to the three apps.",
    "Adobe is fast approaching having all of its Creative Cloud suite of apps running natively on Apple’s M1 Macs. While there weren’t any new MacBooks announced at the WWDC keynote, it still means that these updates bring over 80% faster speeds when working on a project.",
    "Lightroom Classic, Illustrator and InDesign now all run on Apple’s M1 chip, but there’s even more updates across the board:",
    "While M1 support is the headline feature in Adobe’s June update, it’s great to see custom brushes now appear on the iPad version of Photoshop, alongside new retouching features in Photoshop Express.",
    "The June update is now available in the Creative Cloud hub. Go to the ‘Updates Available’ option and once the June 2021 update appears, click Update and it will download and install, ready for you to use the M1 versions of Lightroom Classic, Illustrator and InDesign."
  ],
  "headers": {
    "3": "What’s in the June Update?",
    "6": "How to update your Creative Cloud apps"
  },
  "links": {
    "was updated": "https://www.techradar.com/news/adobe-updates-creative-cloud-with-m1-support-for-audition"
  }
}