{
  "source": "https://www.techradar.com/news/oneplus-buds-pro-will-feature-adaptive-noise-cancellation-and-warp-charging",
  "title": "OnePlus Buds Pro will feature adaptive noise cancellation and warp charging",
  "category": "audio-visual",
  "updated": "2021-07-18T11:00:21Z",
  "author": "david-nield",
  "summary": "New tech on the way",
  "article": [
    "We know that the OnePlus Buds Pro are arriving on July 22, and now we've learned more specifics about the features the new wireless earbuds are going to bring with them – including \"adaptive noise cancellation\" technology and OnePlus' fast charging tech known as Warp Charge.",
    "The revelations come via a CNET interview with Kinder Liu, the head of research and development at OnePlus. Lui says the earbuds have been in the works for a year, and aren't the result of the recent merger of OnePlus and Oppo.",
    "When it comes to the \"adaptive noise cancellation\" mentioned in the article, this seems to be very similar to the active noise cancellation (ANC) used by other earbuds. Apparently the OnePlus Buds Pro will use three microphones to monitor external sounds and \"intelligently produce noise-canceling counter frequencies\" to create an audio bubble.",
    "As for the Warp Charge, which we've seen on many a OnePlus phone, this will juice up the earbuds with 10 hours of battery life from just 10 minutes of charging. Its inclusion isn't much of a surprise, because the technology was also integrated into the OnePlus Buds.",
    "Speaking of time between charges, Kinder Lui says that the OnePlus Buds Pro and the case will give a combined battery life of up to 28 hours with adaptive noise cancellation enabled, and up to 38 hours with adaptive noise cancellation turned off.",
    "CNET has also teased the design of the incoming wireless earbuds: they're apparently similar to the AirPods Pro in terms of their looks, and will be available in matte black. As yet, we haven't seen any image leaks for the OnePlus Buds Pro.",
    "The new earbuds will follow on from the OnePlus Buds and the OnePlus Buds Z, and are expected to offer buyers a superior audio experience while sticking to an affordable price. We should here much more when they're officially unveiled on July 22 alongside the OnePlus Nord 2 phone.",
    "\"For OnePlus, we always want to create the best user experience possible. Audio devices are a vital part in our users' daily digital life and are key to bringing the digital entertainment experience to the next level,\" says Liu."
  ],
  "headers": {
    "4": "More to come"
  },
  "links": {
    "OnePlus Buds Pro": "https://www.techradar.com/news/the-oneplus-buds-wireless-earbuds-will-soon-be-joined-by-a-pro-edition",
    "CNET": "https://www.cnet.com/tech/mobile/oneplus-buds-pro-are-designed-to-take-on-higher-end-earbuds/",
    "OnePlus and Oppo": "https://www.techradar.com/news/oneplus-is-merging-with-oppo-heres-what-that-could-mean-for-android-phones",
    "many a OnePlus phone": "https://www.techradar.com/reviews/oneplus-9-review",
    "into the OnePlus Buds": "https://www.techradar.com/news/exclusive-oneplus-buds-to-charge-faster-than-apple-airpods-via-warp-charge-technology",
    "OnePlus Buds": "https://www.techradar.com/reviews/oneplus-buds",
    "OnePlus Buds Z": "https://www.techradar.com/reviews/oneplus-buds-z",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "says Liu": "https://www.cnet.com/tech/mobile/oneplus-buds-pro-are-designed-to-take-on-higher-end-earbuds/"
  }
}