{
  "source": "https://www.techradar.com/news/the-intel-core-i9-11900k-isnt-good-but-at-least-it-means-well-finally-get-faster-ssds",
  "title": "The Intel Core i9-11900K isn't good, but at least it means we'll finally get faster SSDs",
  "category": "computing",
  "updated": "2021-03-30T19:53:09Z",
  "author": "bill-thomas",
  "summary": "Analysis: give us the speedy drives already",
  "article": [
    "Intel has finally launched its 11th-generation Rocket Lake processors, and while they're not very good – the Intel Core i9-11900K is slower than the i9-10900K in many tests – there are benefits that the entire computing world is going to start feeling in the very near future.",
    "And, really the biggest of these is going to be faster SSDs. With Rocket Lake, Intel has finally baked in PCIe 4.0 support into its desktop processors, which finally means that both current-generation mainstream desktop platforms now support the technology. And, of course, with industry-wide support, we're going to start seeing SSDs that can really push it to the limit.",
    "It's not just PC gamers that are going to feel the benefit, either. One of the biggest reasons that the PS5 still doesn't support expandable internal SSD storage is because there aren't enough commercially-available drives that can saturate the connection. Well, those days might be finally coming to a close.",
    "PCIe 4.0 SSDs have been available for a couple years now, but until the Samsung 980 Pro dropped in September 2020, the drives would typically top out around 5,000MB/s read speeds, which is well below the potential speed that they could offer.",
    "But because the technology was only supported on AMD platforms, there wasn't really a big push to develop extremely fast SSDs that anyone could buy off the shelf. Well, as PCGamer reports, Rocket Lake is the signal that a lot of SSD manufacturers were waiting for, with upcoming SSDs offering speeds of up to 7,500MB/s.",
    "Even that is pretty far below the potential bandwidth that the PCIe 4.0 interface allows. So, hopefully within the next couple of years we'll start seeing more SSDs available that can push up against the theoretical max speed of 7,880MB/s. What may be more important too, is drives that can push these kind of speeds but are also affordable.",
    "We would be remiss to not mention PCIe 5.0 as well. We've already started seeing leaks that suggest that Intel's 12th-generation Alder Lake CPUs will support the next PCIe interface. And if the rumors are right, that could be coming later this year.",
    "With PCIe 4.0 drives becoming more prevalent, PCIe 3.0 NVMe and SATA SSDs have become even more affordable. So, hopefully, the launch of PCIe 5.0 combined with faster cutting edge PCIe 4.0 drives, means that a ton of new PCIe 4.0 drives hit the market soon.",
    "Right now, if you just want a solid M.2 SSD and you go on Newegg, you can pick up the Intel 660p for just $109 – and that's for a 1TB drive. This definitely isn't going to be an SSD you can pop into your PS5, and never will be, it's simply not fast enough. But it illustrates just how far of a gap there is between affordable SSDs and the cutting edge.",
    "The fastest PCIe 4.0 SSD we've tested so far is the Samsung 980 Pro which costs $199 on Newegg right now, and that's with a discount of 13%. And, in our testing, that drive only reached 6,783.23MB/s read speeds in CrystalDiskMark. And that's one of the fastest drives available right now.",
    "And while the primary market for SSDs is always going to be for PCs, we think the PS5 is going to serve as an interesting benchmark for the path to affordable SSDs that are actually fast. Because right now, it's looking like even when Sony enables its expandable internal storage – something it still hasn't done – the drives that it supports are going to be extremely expensive at first.",
    "PNY has just launched an SSD that it claims can reach up to 7,500MB/s, but that's listed at $199 as well.",
    "We are moving in the right direction, and hopefully there will be a plethora of drives to choose from that can deliver the truly next-generation speeds that PC games are going to require in the future."
  ],
  "headers": {
    "3": "What's the holdup?",
    "8": "Because right now, they're kind of expensive"
  },
  "links": {
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "Intel Core i9-11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "PCGamer reports": "https://www.pcgamer.com/bandwidth-busting-pcie-40-ssds-rated-over-7gbs-are-launching-by-the-day/",
    "12th-generation Alder Lake CPUs will support the next PCIe interface": "https://www.techradar.com/news/intel-isnt-messing-around-if-these-alder-lake-s-benchmarks-are-real",
    "that could be coming later this year.": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september",
    "Intel 660p for just $109": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-1492792901671732700&murl=https%3A%2F%2Fwww.newegg.com%2Fintel-660p-series-1tb%2Fp%2FN82E16820167462%3FItem%3DN82E16820167462%26Description%3Dssd%26cm_re%3Dssd-_-20-167-462-_-Product%26cm_sp%3DSP-_-464228-_-0-_-0-_-20-167-462-_-ssd-_-ssd-_-3%26quicklink%3Dtrue",
    "$199 on Newegg right now": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-2275468772126732300&murl=https%3A%2F%2Fwww.newegg.com%2Fsamsung-1tb-980-pro%2Fp%2FN82E16820147790",
    "but that's listed at $199": "https://www.pny.com/cs3140-m2-nvme-ssd?sku=M280CS3140-1TB-RB"
  }
}