{
  "source": "https://www.techradar.com/news/finally-cowboy-bebops-live-action-netflix-adaptation-has-wrapped-filming",
  "title": "Finally, Cowboy Bebop's live-action Netflix adaptation has wrapped filming",
  "category": "entertainment",
  "updated": "2021-03-16T09:56:39Z",
  "author": "tom-power",
  "summary": "Whatever happens, happens",
  "article": [
    "Netflix's live-action adaptation of beloved anime series Cowbop Bebop has been a rollercoaster of a production. At long last, though, filming has wrapped on the first season according to one of the show's stars.",
    "Daniella Pineda, who will portray Faye Valentine in the series, took to Instagram late last week to reveal that production on Cowboy Bebop was done and dusted. A Deadline report has also confirmed that Season 1 is in the bag, with Netflix allegedly revealing as much to the US outlet.",
    "Take a look at Pineda's Instagram post below, which comes with a very cool looking Cowboy Bebop t-shirt that we'd love to add to our own collection:",
    "It's been over three and a half years since a live-action adaptation of the anime classic was announced, and two and a half years after Netflix confirmed that Cowboy Bebop would land exclusively on its platform. That gives you an indication of how production has stuttered since, with two major causes behind production delays.",
    "John Cho, who will play the iconic Spike Speigel, suffered an on-set knee injury that caused production to shut down in October 2019. Netflix resisted pressure to recast Spike in an effort to move ahead with filming, but the Covid-19 pandemic's arrival ensured that a potential restart date following Cho's recovery was also postponed.",
    "According to a October 2020 Deadline report, filming resumed in New Zealand on September 30 after the nation's government gave the green light for production to start up again. With filming now wrapped on the project, Netflix's Cowboy Bebop will enter its post-production phase ahead of a potential release later this year.",
    "For those unfamiliar with the anime, Cowboy Bebop is set in the year 2071 and follows a group of bounty hunters – led by Spike – as they travel across the galaxy using their Bebop starship. Registered as 'Cowboy' bounty hunters by the Inter Solar System Police, the gang chase down criminals to bring in alive for huge cash rewards.",
    "The sci-fi anime has earned a massive following since its initial 1998 Japanese release, with hard-hitting themes including loneliness, existentialism, and trying to escape the past making it a worldwide critical and commercial success. It's not a surprise, then, that Netflix is trying to reproduce that with this live-action retelling.",
    "Cho and Pineda are joined by the likes of Mustafa Shakir (Jet Black), Alex Hassell (Vicious), and Elena Satine (Julia) in Netflix's Cowboy Bebop. No official release date has been revealed yet, but we know that Season 1 will be made up of 10 one-hour episodes, according to Anime News Network."
  ],
  "headers": {
    "3": "The long road to Netflix's Cowboy Bebop adaptation"
  },
  "links": {
    "Deadline report": "https://web.archive.org/web/20201004014307/https://deadline.com/2020/09/the-lord-of-the-rings-resumes-production-amazon-new-zealand-cowboy-bebop-netflix-dtart-of-production-1234584918/",
    "on-set knee injury": "https://deadline.com/2019/10/cowboy-bebop-netflix-series-shuts-down-production-7-9-months-hiatus-star-john-cho-on-set-injury-1202764024/",
    "10 one-hour episodes": "https://www.animenewsnetwork.com/news/2020-04-19/netflix-live-action-cowboy-bebop-show-plans-season-2-teases-yoko-kanno-music/.158742"
  }
}