{
  "source": "https://www.techradar.com/news/life-is-strange-3-is-a-big-change-from-past-games-heres-why",
  "title": "Life is Strange 3 is a big change from past games - here's why",
  "category": "gaming",
  "updated": "2021-03-18T17:39:47Z",
  "author": "vic-hood",
  "summary": "And Life is Strange Remastered Collection is on the way",
  "article": [
    "Square Enix has announced Life is Strange: True Colors (the newest mainline entry in the Life is Strange series) and Life is Strange Remastered Collection during its 'Presents' showcase.",
    "Life is Strange: True Colors follows a brand new protagonist, Alex Chen (played by Erika Mori), who has suppressed her \"curse\", the psychic power of Empathy, for most of her life. This power allows Alex to experience, absorb and manipulate the strong emotions of others, which appear to her as colored auras.",
    "Following a life in foster care, Alex is invited by her long-lost brother Gabe to reunite in Haven, the epitome of the American small town promise, where she hopes to finally find a home. But when Gabe dies in an \"accident\", she learns that she must embrace her power to unearth the mysteries of Haven and to find out what actually happened.",
    "Check out the trailer below:",
    "In true Life is Strange fashion, True Colors will be underpinned by an exclusive soundtrack featuring new songs by mxmtoon (who provides the singing voice of Alex) and Novo Amor, in addition, the game will feature licensed songs from Radiohead, Phoebe Bridgers, Gabrielle Aplin and more.",
    "Alex also has two new friends - and potential love interests - Ryan and Steph (the latter you may recognize from Life is Strange: Before the Storm).",
    "Unlike previous entries in the mainline series, Life is Strange: True Colors isn't being developed by Dontnod. Instead, True Colors is being developed by Deck Nine Games, who created spin-off Life is Strange: Before the Storm.",
    "\"It has been such an honor to return to the vibrant, emotive, and impactful world of Life is Strange,\" Jeff Litchford, Vice President at Deck Nine Games stated. \"We are delighted to share this new story with you: a story of empathy, human connection, and the struggle to find a place to call home.",
    "\"All of the advancements in storytelling, development technology, and premium voice acting that we have made since Life is Strange: Before the Storm will allow players to be more immersed in the compelling world of Life is Strange: True Colors than ever before.\"",
    "True Colors is set to be the most \"most visually advanced entry in series\", brought to life through full performance capture tech.",
    "Life is Strange fans will be pleased to know that they will be able to binge True Colors in one sitting. Rather than releasing episodes intermittently, as with previous games in the series, True Colors will be one single release - divided into five chapters.",
    "Life is Strange: True Colors will release on PS5, PS4, Xbox One, Xbox Series X/S, PC and Google Stadia on September 10, 2021.",
    "It's a good day for Life is Strange fans as, in addition to Life is Strange 3, Square Enix also announced the Life is Strange Remastered Collection.",
    "The Life is Strange Remastered Collection includes Life is Strange and Life is Strange: Before the Storm, enhanced with engine and lighting upgrades, improved character animation using full facial mocap performance and remastered visuals across characters and environments.",
    "While this collection doesn't include Life is Strange 2, it's a great opportunity for those who haven't played the series before to jump in.",
    "The Life is Strange Remastered Collection will be included in the Life is Strange: True Colors Ultimate Edition, but will also be available as a standalone edition in \"Fall 2021\" (so between September and November this year)."
  ],
  "headers": {
    "6": "Some big changes",
    "12": "Life is Strange Remastered"
  },
  "links": {}
}