{
  "source": "https://www.techradar.com/news/canon-vs-nikon",
  "title": "Canon vs Nikon: which DSLR or mirrorless camera should you buy?",
  "category": "cameras",
  "updated": "2021-05-27T13:05:32Z",
  "author": "amy-davies",
  "summary": "The best Nikon and Canon cameras you can buy right now",
  "article": [
    "Despite there now being a bigger proliferation of camera brands on the market than perhaps ever before, the old Canon vs Nikon debate continues to rumble on. For first time camera buyers, these two heritage brands will likely be at the forefront of your mind. Although there's now lots of competition from other brands such as Sony, Nikon vs Canon tends to be an obvious starting point for those new to photography.",
    "DSLRs were once the main stay of Canon and Nikon, with mirrorless options being pioneered by brands such as Olympus and Sony. However, it's now true to say that all brands are concentrating their efforts on mirrorless, with both Nikon and Canon offering some very strong mirrorless - indeed even class-leading - options in their respective line-ups. If you're still keen on DSLR though, and you still have plenty of reasons to be, they both still offer more traditional options for photographers.",
    "Choosing your first camera can be a difficult task, with an at-times overwhelming amount of choice. Once you add in picking between DSLR and mirrorless, the choice becomes even harder. However, if you've at least narrowed it down to these two classic heritage brands, at least your decision has been made a little easier. With these two brands, it's likely you'll be thinking first about the type of camera you need. For that reason, we've compared models from the two brands across all categories and price points.",
    "Speaking of price point, if that's your main concern, you'd do well to wait a little while until Amazon Prime Day 2021. This year, we're expecting lots of camera models to be discounted, especially models which are a little older in the line-up and have perhaps subsequently been replaced by newer models. Remember that older cameras are still fantastic, they just might be missing some of the bells and whistles that you might not even require.",
    "If you're thinking of starting to become serious about photography and want to up your game from a smartphone to an entry-level mirrorless camera. If that's you, then we've got plenty of options here for you. After that, we'll be taking a look at higher-end mirrorless options. Finally, we'll compare the best Canon and Nikon DSLRs, for beginners, hobbyists and those with the most experience looking for full-frame models.",
    "Keep reading to discover how we answer that classic battle - Nikon vs Canon, which is best?",
    "When it comes to buying your first camera, mirrorless options are a fantastic choice. Generally, they’re smaller and lighter than equivalent DSLRs, so making the jump up from your smartphone doesn’t feel like such a huge step.",
    "Both Canon and Nikon have great options for those new to photography, but unlike DSLRs which have been around for much longer, they can be a little pricier. Shifting your thinking to consider 'best value' rather than outright cheapness is a good way to look at it – investing in a good camera usually means you won’t outgrow it quickly and have to spend again to upgrade.",
    "The best of the current crop of Nikon and Canon entry-level mirrorless cameras, offering all-round shooting capabilities, are both APS-C models, in the shape of the Canon EOS M50 and the Nikon Z50. We think the latter is the better of the two, largely due to it being a better all-round offering and much newer. Recently, Canon introduced the Canon EOS M50 II, which is a very minor upgrade which adds a couple of extra features primarily aimed at vloggers. As it uses the same sensor and processor as its predecessor, for stills photographers, it's worth sticking with the original.",
    "Making its debut in late 2019, the Nikon Z50 is an excellent mid-range, enthusiast camera. As well as being popular for beginners, it’s a great option for travel, with its smaller proportions making it easy to transport. It shares the same Z mount with its full-frame siblings, but there have been a number of lenses specifically designed to match the smaller chassis, such as the 16-50mm f/3.5-5.6 pancake lens which you’ll generally find bundled with the Z50.",
    "The screen and viewfinder of the Z50 are both impressive, with the the former tilting downwards and forwards, making it useful for shooting selfies and possibly even vlogs – though it’s not possible to mount the camera on a tripod and flex the screen at the same time, annoyingly.",
    "Importantly, image quality is very good from the 20.9MP sensor, and there’s also 4K video recording and a 209-point AF system that puts in a decent performance. In essence, the Z50 is a lot like using a miniaturized version of the higher-level Z6/Z7 models.",
    "By contrast, Canon’s EOS M50 is now three years old – and while in some ways it’s beginning to show its age, it’s still a cracking little camera for lots of different users. The recently announced Mark II has done little to address those age concerns, too.",
    "The sensor offers a 24.1MP resolution, and although it shoots 4K video, unfortunately it is cropped – so vloggers may find it a little on the restrictive side. Better news is the vari-angle touchscreen display on the rear, which is joined by very decent viewfinder.",
    "Excellent proportions make the Canon EOS M50 a pleasure to use, with streamlined controls and an intuitive user interface. Unlike the Nikon Z system, Canon uses a different mount for its APS-C mirrorless models and full-frame options - which is frustrating as lenses can’t be shared between the two should you decide to upgrade at a later point.",
    "Other entry-level models are also available and are worth considering, with two full-frame models for those who are keen to progress to the larger format. Canon has the Canon EOS RP, while Nikon has the Nikon Z5. Both distill the vital elements of the company's full-frame mirrorless offerings into more affordable packages, but with a number of trade-offs that come from the cheaper price.",
    "Winner: Nikon Z50"
  ],
  "headers": {
    "6": "Canon vs Nikon: Beginner-friendly mirrorless"
  },
  "links": {
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Canon EOS M50 II": "https://www.techradar.com/reviews/canon-eos-m50-mark-ii",
    "Nikon Z50": "https://www.techradar.com/reviews/nikon-z50",
    "Canon’s EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "Canon EOS RP": "https://www.techradar.com/reviews/canon-eos-rp-review",
    "Nikon Z5": "https://www.techradar.com/reviews/nikon-z5"
  }
}