{
  "source": "https://www.techradar.com/news/apple-tested-under-display-touch-id-for-iphone-13-but-dont-expect-it-to-happen",
  "title": "Apple tested under-display Touch ID for iPhone 13, but don't expect it to happen",
  "category": "phones",
  "updated": "2021-08-23T09:07:44Z",
  "author": "james-rogerson",
  "summary": "Under-display Face ID is the future",
  "article": [
    "Earlier this year we heard rumblings that Apple was working on an under-display fingerprint scanner, and the latest news suggests those rumblings were well founded – but that this feature might not ever make it onto an iPhone.",
    "That’s according to Mark Gurman (a journalist with a good track record for Apple information). In the latest edition of his Power On newsletter for Bloomberg, he claims that Apple had been testing under-display Touch ID for the iPhone 13 range, but that it won’t make the cut this year.",
    "In fact, Gurman went so far as to say that “I believe Apple is all-in on Face ID for its higher-end iPhones and its long-term goal is to implement Face ID in the display itself.\" So that suggests we probably won’t see under-display Touch ID on any iPhone if he’s right, but that Apple will instead offer under-display Face ID – which is something else we’ve heard rumored before.",
    "Presumably that would also mean the selfie camera going beneath the display, something we've seen on the likes of the Samsung Galaxy Z Fold 3.",
    "That doesn’t mean Face ID in its current visible form is going anywhere though, as Gurman suggested that lower-end iPhones – such as perhaps the iPhone SE 3 or future models in that range – would get the current version of Face ID, while high-end models, such as perhaps the iPhone 14 range, would get an under-display version.",
    "That suggests the days of Touch ID in any form could be numbered, since the iPhone SE (2020) for example has a home button with a Touch ID scanner built in, but if future models move to Face ID, they’ll probably lose that feature. Of course, we’d take all of this with a pinch of salt for now, but Gurman tends to be fairly reliable.",
    "Face ID is great, and moving it under-display would eliminate the main downside of it – the need for a notch – but that’s not the only downside.",
    "As many have discovered during the pandemic, it doesn’t work so well when you’re wearing a mask, prompting Apple to devise a workaround for Apple Watch owners. But those who don’t own an Apple Watch are still out of luck here, and mask-wearing to some extent might well be here to stay.",
    "There are other situations where Face ID doesn’t work perfectly either; some sunglasses can interfere with it for example.",
    "So while we don’t want Face ID to go anywhere, having a convenient alternative for those times when it’s not doing its job would be ideal. And no, entering your PIN is not what we consider convenient in 2021.",
    "So under-display Face ID coupled with an under-display fingerprint scanner would give you the best of both worlds, and should have no impact on the visual design of the phone.",
    "Via PocketNow and iMore"
  ],
  "headers": {
    "6": "Opinion: no Touch ID is no good"
  },
  "links": {
    "working on an under-display fingerprint scanner": "https://www.techradar.com/news/another-iphone-13-leak-points-to-in-screen-touch-id-and-a-smaller-notch",
    "Power On newsletter": "https://www.bloomberg.com/account/newsletters/power-on",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "we’ve heard rumored": "https://www.techradar.com/news/iphone-13-could-feature-in-screen-face-id-or-touch-id-unlock",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "devise a workaround for Apple Watch owners": "https://www.techradar.com/how-to/how-to-unlock-your-iphone-while-wearing-a-mask-with-ios-145",
    "PocketNow": "https://pocketnow.com/under-display-touch-id-no-in-screen-face-id-yes",
    "iMore": "https://www.imore.com/mark-gurman-apple-tested-screen-touch-id-it-will-not-be-featured-iphone-13?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+TheIphoneBlog+%28iMore%29"
  }
}