{
  "source": "https://www.techradar.com/news/bioware-says-sorry-for-no-ea-play-news-with-new-dragon-age-4-art",
  "title": "BioWare says ‘sorry for no EA Play news’ with new Dragon Age 4 art",
  "category": "gaming",
  "updated": "2021-07-03T10:01:16Z",
  "author": "emma-boyle",
  "summary": "A murder of Crows",
  "article": [
    "BioWare has softened the blow of the news that neither Dragon Age 4 or Mass Effect 5 will make an appearance at EA Play Live later this month by releasing some brand new Dragon Age 4 concept art.",
    "Dragon Age 4 executive producer, Christian Dailey, shared the new image on Twitter with an accompanying message that reads, “sorry for no EA Play news this year but please know that the team is heads down with a lot of momentum and making great progress. We are excited to share more when the time is right. Please stay safe and have a great weekend!”",
    "Based on the insignia in the corner of the image and the clothing of the characters, the art Dailey shared features the Antivan Crows, an organization of thieves, assassins and spies with a long, important and bloody history in Antiva and Thedas as a whole.",
    "The Antivan Crows have made an appearance in the games before in the form of Dragon Age: Origins companion Zevran but there’s still a lot to learn about them. This image suggests there’s a chance we’ll see a little more of them in Dragon Age 4 and, based on the well-dressed chaos we’re seeing here, we want to.",
    "This isn’t the first piece of concept art that Dailey has shared to tide fans over since Dragon Age 4’s announcement, either. Previous posts have featured another Thedas organization, the Grey Wardens, as well as a mage and an archer with some pretty intriguing backgrounds.",
    "Solid information on Dragon Age 4 is still pretty thin on the ground and at the moment the game doesn't yet have a solid release date. The most recent trailer for the game was released during the 2020 Game Awards with a Varric voiceover teasing \"demons, dragons, Darkspawn and even the Dread Wolf.\"",
    "While it’s disappointing that Dragon Age 4 and Mass Effect 5 won’t be present at this year’s EA Play Live, it seems that the show will still be worth watching for updates on some of EA's other big franchises.",
    "The main show will take place on July 22 but EA has also announced four additional spotlight streams through the month that will focus on titles like Battlefield 2042, Madden NFL 22 and provide key updates on games like Apex Legends.",
    "You’ll be able to tune into the main EA Play Live stream on July 22 at 10am PDT / 1pm EDT / 6pm BST."
  ],
  "headers": {
    "5": "What to expect"
  },
  "links": {
    "the news": "https://www.techradar.com/news/dont-expect-to-see-mass-effect-5-or-dragon-age-4-at-ea-play-live",
    "Dragon Age 4": "https://www.techradar.com/news/dragon-age-4-release-date-news-and-rumors",
    "Grey Wardens": "https://twitter.com/ChristianDailey/status/1388261670095622146?s=20",
    "a mage": "https://twitter.com/ChristianDailey/status/1373062292003246085?s=20",
    "an archer": "https://twitter.com/ChristianDailey/status/1347380810093977601?s=20",
    "recent trailer": "https://www.youtube.com/watch?v=W7x685DxMcw",
    "EA Play Live": "https://www.techradar.com/news/ea-play-2021-confirmed-for-july-following-rumored-battlefield-june-reveal",
    "announced": "https://www.ea.com/news/announcing-the-ea-play-live-spotlight-series?isLocalized=true",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Madden NFL 22": "https://www.techradar.com/reviews/madden-nfl-22-review"
  }
}