{
  "source": "https://www.techradar.com/news/ios-15s-name-was-just-leaked-by-apple",
  "title": "iOS 15 name was just leaked by Apple",
  "category": "phones",
  "updated": "2021-03-31T09:22:20Z",
  "author": "axel-metz",
  "summary": "Strength in numbers",
  "article": [
    "References to the next versions of iOS and macOS have been spotted in a WebKit code – giving us the best sign yet that they’ll be called iOS 15 and macOS 12, respectively.",
    "The mentions were spotted by 9to5Mac, and mark a departure from Apple’s usual approach of referring to future software versions as TBA. These references were added with the message “Update WKWebView getUserMedia delegate to latest proposal,” by an Apple employee who works on the WebKit technology.",
    "While we won’t expect to see an official announcement of the new operating systems until the company’s expected WWDC (Worldwide Developers Conference) 2021 event, these findings nonetheless suggest the next major Apple updates will carry their expected numeric titles.",
    "In 2020, Apple jumped from macOS 10.15 Catalina to macOS 11 Big Sur, offering no signs that the company might be returning its old method of cycling through point versions of yearly updates like it did with Mac OS X.",
    "Given that macOS 11.1 was released as a minor update, too, we had an inkling that the next major software version would carry the macOS 12 title.",
    "Naturally, the WebKit code gives little away as to what to expect from the upcoming versions of iOS and macOS.",
    "The only real iOS 15 leak at the time of writing is a claim that the update will only be available for the iPhone 7 and later. This will mean that the likes of the iPhone 6S, iPhone 6S Plus and original iPhone SE will miss out on the new software.",
    "In terms of what we want to see, though, the list is a little longer. Siri gets better with each new version of iOS, and while it’s pretty good now, the improvements made by Google Assistant in recent years suggest Apple can do better. We’d like to see Siri respond quicker and become less reliant on web results for accurate responses to questions.",
    "We’d also appreciate a new Apple Maps update, specifically one which allows cycling directions and Guides (which recommends things to see and do) to become available in more places than just major cities.",
    "As for macOS 12, we’re hoping for better FaceID, improved notifications and, perhaps most importantly, a continued commitment to updating older apps so they can run natively on Apple's new M1 chips.",
    "Via 9to5Mac"
  ],
  "headers": {
    "5": "What we expect to see"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "9to5Mac": "https://9to5mac.com/2021/03/29/ios-15-and-macos-12-naming-mentions/",
    "WWDC (Worldwide Developers Conference) 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "will only be available for the iPhone 7 and later": "https://www.techradar.com/news/ios-15-rumor-suggests-three-phones-will-miss-out-on-the-next-big-upgrade",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "iPhone 6S Plus": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-plus-1303759/review"
  }
}