{
  "source": "https://www.techradar.com/news/realme-race-pro-specs-confirmed-and-it-beats-the-samsung-galaxy-s21-ultra",
  "title": "Realme Race Pro specs confirmed, and it beats the Samsung Galaxy S21 Ultra",
  "category": "phones",
  "updated": "2021-02-18T09:48:34.127Z",
  "author": "tom-bedford",
  "summary": "Realme X9 Pro specs too",
  "article": [
    "If you thought the Samsung Galaxy S21 Ultra would likely be the most premium phone of early 2021, you might be wrong because Realme has an upcoming handset that looks set to trump it.",
    "Realme has provided an abridged specs list for two of its upcoming phones to TechRadar. These are the Realme X9 Pro, the successor to the Realme X7 Pro from late 2020, and the Realme Race Pro, the premium model in the company's brand-new premium line. This latter phone has some incredible specs",
    "Both of the phones are coming 'Q1 2021', according to the company, so up until March. We don't know prices for either, though the Realme X9 Pro seems mid-ranged and the Race Pro will likely get a very high price judging by its specs list.",
    "We'll run you through the confirmed specs of both phones now, so you know all the information that's out there right now, ahead of full releases of both handsets soon. The main thing we're missing on both now is a design, as well as a few more specs and camera details.",
    "When both phones get announced, we'll be sure to bring you our impressions, and everything else you need to know.",
    "Realme has told us the Race Pro has a 6.8-inch display with a 3200 x 1440 display - so far, exactly the same as the Samsung Galaxy S21 Ultra - but with a 160Hz refresh rate. We've never seen a phone with a display that refreshes so fast before, with most phones capping at 120Hz and a few reaching 144Hz.",
    "That's not the only wildly impressive spec, as the handset also has 125W charging, faster than any other smartphone widely available right now. This powers up a 5,000mAh battery.",
    "Other specs include the premium Snapdragon 888 chipset, also seen in the Xiaomi Mi 11 and Samsung Galaxy S21, paired with a generous 12GB RAM. We've also been told the phone will come in storage options of 128GB, 256GB or 512GB.",
    "The handset will have a 64MP main camera joined by two 13MP auxiliaries, likely one with a telephoto lens and another with an ultra-wide, though that's speculation for now. We also know the phone will come on Android 11 with Realme's UI laid over the top.",
    "The Realme X9 Pro specs might look a little less impressive than the Race Pro, but compared to many other handsets it's definitely no slouch.",
    "The phone will have a 6.4-inch 1080 x 2400 display with 120Hz refresh rate. Its charging speed is 65W, which is still faster than most phones on the market, and it has a 4,500mAh battery.",
    "The chipset here is the recently launched MediaTek Dimensity 1200 - we haven't tested this on a phone, but we'd expect it to provide good performance, though perhaps not Snapdragon 888-tier. There's also 12GB RAM, and either 128GB or 256GB storage.",
    "The cameras here include two 13MP snappers - possibly the same two as the Realme Race Pro - but with a high-end 108MP main shooter. It seems Realme has joined the 108MP-high club along with Samsung and Xiaomi.",
    "As with the Realme Race Pro, the phone comes on Android 11, with Realme UI 2.0 laid over the top."
  ],
  "headers": {
    "5": "Realme Race Pro",
    "9": "Realme X9 Pro"
  },
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}