{
  "source": "https://www.techradar.com/news/ps6",
  "title": "PS6: when can we expect the PlayStation 6 and what do we want to see?",
  "category": "gaming",
  "updated": "2021-02-23T17:09:13Z",
  "author": "techradar-staff",
  "summary": "What has Sony got in store for the PS6?",
  "article": [
    "It may be early days for the PS5, but we're already thinking about the PS6 (aka the PlayStation 6).",
    "We're unlikely to see another new, mainline PlayStation console for a few years yet, but that doesn't mean we can't fantasize about what we would like to see from the next PlayStation - or predict when we're likely to get our hands on it. After all, we know that Sony is already thinking about the future, having trademarked the PS6, PS7, PS8, PS9 and PS10 names.",
    "So we've gathered up everything we want to see from the PS6 and when we expect to get our hands on the next PlayStation.",
    "The PS6 is likely to be a long way off. The PS5 only released in November 2020, so it's unlikely Sony will consider releasing a brand new PlayStation for several years.",
    "Typically PlayStation consoles launch around six or seven years apart, with the PS4 arriving in 2013 and the PS5 following up in 2020.",
    "In an interview with Game Informer, Sony's Executive VP of Hardware Engineering Masayasu Ito confirmed that the PS5 life cycle is expected to last about six or seven years, meaning we won't see the PS6 until at least 2026.",
    "\"Indeed, in the past, the cycle for a new platform was seven to 10 years, but in view of the very rapid development and evolution of technology, it's really a six to seven-year platform cycle,\" Masayasu said.",
    "\"Then we cannot fully catch up with the rapid development of the technology, therefore our thinking is that as far as a platform is concerned for the PS5, it’s a cycle of maybe six to seven years. But doing that, a platform lifecycle, we should be able to change the hardware itself and try to incorporate advancements in technology.",
    "\"That was the thinking behind it, and the test case of that thinking was the PS4 Pro that launched in the midway of the PS4 launch cycle.\"",
    "It looks like Sony is following a similar roadmap to the PS4, meaning we're likely to see a PS5 Pro or PS5 Slim release sometime in the middle of this lifecycle: around 2023 or 2024.",
    "A smaller console The PS5 is a mammoth console. In fact, it's the biggest console in modern history. But bigger doesn't always mean better, and the PS5's size makes it impractical for those who don't have the shelving unit to house it - and, let's be honest, not many of us do. With the PS6 (and perhaps even with a PS5 Slim Edition), we're hoping that Sony can learn from its mistakes, making the next-gen console smaller and more streamlined, while allowing for adequate airflow.",
    "More affordable expandable internal storage It will be possible to expand the PS5's internal storage by popping off the side panel and installing an SSD, once Sony drops a software update to enable it - but it's not that simple. The PS5 only accepts compatible NVMe SSDs, which match or excel past the existing drive specifications, and they don't come cheap. These types of SSDs are typically pretty pricey, meaning that players may opt for external storage instead - but unfortunately, these externals storage options don't harness the raw power of the PS5. With the PS6, we hope that Sony will make expanding internal storage easier - perhaps taking an approach similar to the Xbox Series X's expandable storage card.",
    "Built-in Bluetooth Audio Support - so we don't need a dongle for the official headset It is baffling that, in the year 2020, a brand-new games console launched and it requires you to plug-in a USB dongle receiver to use its own-brand wireless headphones. Like, what the actual hell Sony. Talk about an aesthetic assault on our eyes and under-TV storage area. Just build the freaking support into the PS6 will you. Good grief.",
    "Wireless charging for controllers/headset - can just be placed on top when off Sure, the Sony charging dock for the PS5 DualSense controllers works pretty well and the controllers slide nicely against the charging pins - but we don't want yet another piece of hardware by our TV. Sony should take a leaf out of the smartphone industry's book and build in a wireless charging pad to the top of the PS6. That will allow you to place a controller on the top of the console, when you're not gaming, to charge - and you could even expand the wireless charging tech to headphones, a media remote and any other peripherals.",
    "Wire-free (and zero-latency) connection to the TV There are far too many wires behind our media stations - and the PlayStation 5 is a guilty party. We've got the power and HDMI, plus a completely separate plug block for the controller charging base. Add in the HD camera, and the additional cable for PSVR 2 when that launches and things are a mess. With the PS6, we want a single power lead and everything else to be wireless - obviously with zero lag and latency.",
    "Improve the UI The updated PS5 UI definitely screams \"next-gen\", but it also has some flaws that we would like to see ironed out with the PS6. The PlayStation Store is a pain to navigate, especially when it comes to finding sales, trying to find your friends and organize a party isn't as straightforward as it was with the PS4 and - to top it all off - even trying to find the 'off' button takes longer than it should. While the PS4 UI absolutely needed an update, we found it more accessible to use. With the PS6, we hope to see Sony settle on a middle ground that is both futuristic and accessible."
  ],
  "headers": {
    "3": "PS6 release date: when do we expect it to launch?",
    "10": "PS6: what we want to see"
  },
  "links": {
    "having trademarked the PS6, PS7, PS8, PS9 and PS10 names": "https://www.techradar.com/news/we-may-be-thinking-about-the-ps5-but-sony-is-already-considering-the-ps10",
    "Game Informer": "https://www.gameinformer.com/feature/2019/12/03/the-first-25-years"
  }
}