{
  "source": "https://www.techradar.com/news/marvels-wolverine",
  "title": "Marvel's Wolverine: everything we know about the PS5 exclusive so far",
  "category": "gaming",
  "updated": "2021-10-28T07:11:04Z",
  "author": "vic-hood",
  "summary": "A Wolverine game is on the way for PS5",
  "article": [
    "Marvel's Wolverine is officially in the works from Insomniac Games, the studio behind the critically acclaimed Marvel's Spider-Man and Spider-Man: Miles Morales.",
    "Announced during Sony's PlayStation Showcase 2021, Marvel's Wolverine will be a standalone PS5 exclusive game that focuses on the grizzly, adamantium-clawed Mutant James \"Logan\" Howlett. If the teaser trailer is anything to go by, Insomniac Games' Wolverine game will be bloodier and potentially more mature than its Spider-Man offerings - a fitting tone for the popular X-Men hero.",
    "It may be a while before we get our claws on Marvel's Wolverine, but that hasn't stopped us from speculating on what we could see from Insomniac's take on Logan and collecting every bit of information we can. Read on for everything we know about Marvel's Wolverine so far.",
    "Marvel's Wolverine game currently doesn't have a release date but unfortunately it will likely be a while before we get our claws on it. Insomniac Games has stated that the game is in \"very early development\" so we wouldn't expect to see it until at least 2023 - especially given that Insomniac Games is currently working on Marvel's Spider-Man 2, due is due for release in 2023.",
    "Marvel's Wolverine is set to be a PS5 exclusive, much like Spider-Man, so unfortunately it won't be available to Xbox Series X/S and PC players.",
    "PlayStation Showcase 2021 Marvel's Wolverine was announced during Sony's PlayStation Showcase in September 2021, with a brief teaser trailer giving us our first look at Insomniac's take on Logan. Well, kind of.",
    "The teaser trailer shows a destroyed bar, with injured men lying on the floor, before cutting to a back view of a man in a cowboy hat and checkered shirt drinking at the bar - his knuckles and surrounding area covered in blood. In the background, we see one of the injured men getting up and pulling out a knife. Sensing the assailant, the man at the bar, the man at the bar clenches his fist, resulting in long metallic claws appearing from them. Yep, it's Wolverine.",
    "The trailer may not give us a look at gameplay or at Logan himself, but it does set the tone of Marvel's Wolverine game - which at first glance appears to be a more bloody, mature alternative to Insomniac Games' Spider-Man game/. You can check out the trailer below:",
    "A \"full-size\" game with a \"mature tone\" According to Marvel's Wolverine's Creative Director, Brian Horton, James 'Logan' Howlett's standalone adventure on PS5 will be a full-size game with a \"mature tone\". Horton confirmed this in response to a fan on Twitter asking whether Wolverine on PS5 will be \"big or a 'miles morales' size game\".",
    "Being directed by Spider-Man: Miles Morales creative leads In a PlayStation Blog post, Insomniac Games revealed that Marvel's Wolverine is being directed by Brian Horton (creative director) and Cameron Christian (game director), who led the creative efforts on Marvel’s Spider-Man: Miles Morales.",
    "Respecting the DNA, with a fresh take Insomniac Games has said that, while it intends to honor the \"DNA\" of what makes Wolverine popular, it will be putting its own fresh spin on Weapon X.",
    "\"In the vein of our Spider-Man games, our goal here is to not only respect the DNA of what makes the character so popular, but also look for opportunities to make it feel fresh and truly reflect the Insomniac spirit,\" Insomniac Games wrote in a PlayStation blog post. According to the developer, despite being in early development, Marvel's Wolverine boasts an \"emotional narrative and cutting-edge gameplay\".",
    "Embracing Wolverine's dark side While Marvel's Spider-Man and Miles Morales are critically acclaimed, there's no denying they're pretty family-friendly - after all, Spider-Man himself is your \"friendly neighborhood Spidey\". But Wolverine isn't all sunshine and rainbows, his backstory and character are actually pretty dark.",
    "We're hoping that Insomniac explores that side of Logan in the Wolverine game, offering a more mature experience than Spider-Man did (fortunately Insomniac Games has confirmed the game will have a \"mature tone\") We're not asking for gratuitous violence but, to really dig into Wolverine's backstory (depending on when this game is set), you can't shy away from the darker moments. Also, you can't slash up enemies without a bit of bloodshed.",
    "The appearance of other Marvel heroes... We don't want them hogging the spotlight, but it would be nice to see Insomniac's take on some other Marvel heroes popping up in the Wolverine game as side characters. Which characters would really depend on the story Insomniac wants to tell and which Marvel universe it's largely basing its narrative on. But we're hoping to see some of the X-Men make cameos, including Jean Grey, Professor X or maybe even Rogue.",
    "...and infamous villains We currently don't know who will serve as the main adversary in Marvel's Wolverine, but there are plenty of infamous villains to choose from - and we imagine some could appear as smaller roles. We're hoping we could see Logan battling Sabertooth, Lady Deathstrike or even Silver Samurai, or perhaps we'll see him simply battling to bring down the Weapon X program that turned him into a mutant.",
    "A Marvel Game Universe With Insomniac Games now working on another Marvel title for PS5, we're hoping that we could see a Marvel Game Universe in the future. In our opinion, it could work pretty well. Like with the MCU, Insomniac has created standalone products allowing us to get to know individual superheroes within its universe, if we continue to see more Marvel heroes getting their own games, could we potentially see crossovers in the future? We're hoping so as Crystal Dynamic's Marvel's Avengers certainly left a lot to be desired."
  ],
  "headers": {
    "3": "Marvel's Wolverine: cut to the chase"
  },
  "links": {
    "Marvel's Spider-Man": "https://www.techradar.com/news/spider-man-review",
    "Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "PlayStation Showcase": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "Marvel's Spider-Man 2": "https://www.techradar.com/news/venom-comes-to-ps5-in-marvels-spider-man-2",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Twitter": "https://twitter.com/BrianHortonArt/status/1437066535839809544?s=20",
    "PlayStation Blog post": "https://blog.playstation.com/2021/09/09/marvels-spider-man-2-and-marvels-wolverine-revealed/"
  }
}