{
  "source": "https://www.techradar.com/news/websites-at-30-how-much-has-the-internet-changed",
  "title": "Websites at 30 - how much has the internet changed?",
  "category": "computing",
  "updated": "2021-08-10T15:19:54Z",
  "author": "abigail-opiah",
  "summary": "There are currently over 1.86 billion websites online - so where do they go next?",
  "article": [
    "Sir Tim Berners-Lee developed the World Wide Web (WWW) in 1989 while working at CERN, the European Organization for Nuclear Research. Shortly after, the first website ever was launched, on August 6, 1991 -- and thirty years on, the look, design and functionality of a website has completely transformed.",
    "To celebrate this, we've taken a look at some of the key launches and developments, highlighting how the website as we know it has changed so much over the years.",
    "In 1993, CERN put the World Wide Web software in the public domain and later made a release available with an open licence. A year later the first blog surfaced, created by then-student Justin Hall as a place to publish his writing. Links.net consisted entirely of brief posts, containing links and some of his thoughts on the content within.",
    "By 1995, Jeff Bezos had launched one of the biggest global ecommerce websites to date - Amazon, which was initially introduced as an ecommerce platform for books - and in 2001 Wikipedia went live, after the domain was registered by Jimmy Wales and Larry Sanger.",
    "As of June 18, 2021, there are over 1.86 billion websites online, with Siteefy noting that more than 547,200 new websites are created globally every day.",
    "Commenting on the progression websites have made since the very first one created, Fabio Torlini, SVP & MD International at WP Engine, said: “Fast forward three decades after the first website was launched, the web is now central to all commerce. Entire livelihoods rely on the web.\"",
    "\"In fact, the economy for WordPress, the open source platform and ecosystem on which almost half of all websites are built, is estimated at a staggering $596.7bn. If WordPress were a country, its economy would rank above Sweden’s as 39th largest in the world.”",
    "Web hosting providers have been on a major growth journey since the launch of GeoCities in 1994 allowed users to upload pages of content online that were relevant to the subject of the content.",
    "Before this, to host a website on the internet, an individual or company would be required to have their own computer or server. As the demand grew, web hosting services began to pop up and offer to host websites on their own servers, eradicating the need for individuals or organizations to own their own infrastructure that was needed to host a website.",
    "Now, there are over 330,000 web hosting providers worldwide, with GoDaddy holding nearly 20% of the market, followed by Amazon AWS, 1&1, and Hostgator, according to the Hosting Tribunal.",
    "With all the rapid development, the natural progression would be to ask \"what is next for websites?\"",
    "Torlini added that the pandemic has accelerated web trends like online shopping, and WP Engine research found that three-quarters (75%) of Gen Z Brits and two-thirds (67%) of British Boomers say they plan to shop online either entirely or at least part of the time in the next year.",
    "\"That means the physical world needs a better link to the digital world. For example, when consumers are buying a premium product like a new car or designer clothes, today’s online experiences fall far short of the in-store equivalent,\" he said.",
    "\"Websites aren’t fit to provide or reflect the kinds of high-end experiences consumers expect when buying, say, an SUV or a diamond ring. And luxury businesses aren’t the only ones that must rethink their web strategy to take advantage of the web’s massive economic potential.”",
    "With all the change that has happened over three decades, the trend of \"continual expansion\" is evident. As Artificial Intelligence (AI) and Machine Learning (ML) continues to take the center stage in website development, the number of efficient websites taking up space online will continue increasing rapidly.",
    "It's been a whirlwind first 30 years for the humble website, and given the rapid rate of development over the years, it's fair to say that they should still be around in another 30 - but what they will look like is anyone's guess."
  ],
  "headers": {
    "2": "Websites at 30 - the key dates",
    "7": "What about web hosting?",
    "10": "The future of websites"
  },
  "links": {
    "the first website": "https://www.techradar.com/news/the-best-website-builder",
    "domain": "https://www.techradar.com/news/best-domain-registrars",
    "ecommerce websites": "https://www.techradar.com/news/best-ecommerce-website-builder-of-2021-build-the-best-online-store-for-your-business",
    "ecommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Siteefy": "https://siteefy.com/how-many-websites-are-there/",
    "1&1": "https://www.techradar.com/reviews/11",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Hosting Tribunal": "https://hostingtribunal.com/blog/web-hosting-statistics/",
    "WP Engine": "https://www.techradar.com/reviews/wp-engine"
  }
}