{
  "source": "https://www.techradar.com/news/blizzcon-2021-full-schedule-reveals-diablo-deep-dive-and-overwatch-2-sneak-peek",
  "title": "BlizzCon 2021: full schedule reveals Diablo 'deep dive' and Overwatch 2 'sneak peek'",
  "category": "gaming",
  "updated": "2021-02-10T19:04:39Z",
  "author": "emma-boyle",
  "summary": "Prepare for some panels",
  "article": [
    "The full schedule for BlizzCon 2021, or BlizzCon Online, has been revealed and it looks like there are a few panels for fans of Overwatch and Diablo to get excited about.",
    "Running from February 19 to February 20, BlizzCon 2021 will be an entirely online experience and the newly-released schedule shows that it’ll take place across six streaming channels. There'll be a main channel for highlights and replays and a further five dedicated to World of Warcraft, Hearthstone, Diablo, Overwatch and 'Strategy', which appears to involve StarCraft and a retrospective behind-the-scenes.",
    "Though Blizzard has recently said that Overwatch 2 and Diablo 4 won’t be released in 2021, after the lengthy opening ceremony on February 19, a couple of the most eye-catching events on the BlizzCon 2021 schedule are related to the Overwatch and Diablo franchises.",
    "On February 19 at 11:10 PM GMT/ 3:10 PM PT/ 6:10 PM ET Overwatch fans will be able to settle into a 40-minute behind-the-scenes “sneak peek” of the game, in which the development team will “dive into the development process and share some work in progress.”",
    "This will be followed up with a Voices of Overwatch panel, in which some of the game’s voice actors will share their stories of working on the series and then perform an “iconic cinematic” from the Overwatch universe. There’ll also be a 20-minute discussion with some of the Overwatch score composers in the Overwatch: Creating a Soundtrack panel.",
    "For Diablo fans, there are also plenty of panels to get stuck into with a “What’s Next” discussion with developers, as well as a roundtable with the development team in which they’ll discuss “recent learnings and more”. One of the most intriguing Diablo panels is also one of the most vague: a 40-minute \"Deep Dive\" into Diablo.",
    "The description for the panel doesn’t reveal which specific Diablo games will be involved in the discussion but 40 minutes seems like plenty of time to fit in some conversation on Diablo 4, Diablo Immortal and maybe even that long-rumoured remake of Diablo 2. Or maybe we're just being overly optimistic. This panel will be taking place on February 19/20 at 5:00 PM PT/ 8:00 PM ET/ 1:00 AM GMT.",
    "Like the Diablo franchise, World of Warcraft will also be getting \"What's Next\" and \"Deep Dive\" panels across the two days, offering a similar balance in terms of an overarching look at what fans can expect to see next in Azeroth and more detailed developer discussion.",
    "The full schedule for BlizzCon 2021 can be found on the official site. Those looking to tune in will be able to start watching the Opening Ceremony across all the channels on February 19 at 2:00 PM PT / 5:00 PM ET / 10:00 PM GMT. We’re hoping for some big news from the show and will report the latest as it happens."
  ],
  "headers": {
    "5": "The Diablo is in the deep dive"
  },
  "links": {
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "revealed": "https://blizzcon.com/en-gb/schedule",
    "Overwatch 2": "https://www.techradar.com/news/overwatch-2-release-date-features-and-rumors",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "Diablo Immortal": "https://www.techradar.com/news/diablo-immortal-release-date-news-trailers-phones",
    "long-rumoured remake of Diablo 2": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "on the official site": "https://blizzcon.com/en-gb/schedule"
  }
}