{
  "source": "https://www.techradar.com/news/heres-yet-another-reason-to-ditch-internet-explorer-11",
  "title": "Here's yet another reason to ditch Internet Explorer 11",
  "category": "computing",
  "updated": "2021-03-01T18:27:28Z",
  "author": "anthony-spadafora",
  "summary": "Google Workspace apps will stop supporting IE11 on March 15",
  "article": [
    "Although Internet Explorer 11 (IE11) will be supported for the life of Windows 10, more and more online services have stopped or will soon stop supporting Microsoft's legacy browser.",
    "In an update to the Google Workspace blog, the search giant reminded both end users and IT admins that Workspace apps including Docs, Sheets and Slides will no longer support IE11 beginning on March 15.",
    "Google isn't the only company ending support for IE11 though as last November, Microsoft ended support for the Teams web app in the browser while announcing that Office 365 apps would no longer be supported from August 17 of this year.",
    "In its blog post, Google recommends that Workspace users make the switch to a supported browser such as Chrome, Firefox, Safari or Microsoft Edge in order to continue using its web apps.",
    "The end of support for IE11 in Workspace will affect users of Google Workspace Essentials, Business Starter, Business Standard, Business Plus, Enterprise Essentials, Enterprise Standard, and Enterprise Plus, as well as G Suite Basic, Business, Education, Enterprise for Education, and Nonprofits customers, which is why Google is warning users about the upcoming change.",
    "For those that didn't see its blog post though, the company has begun showing a banner alert to Workspace users in IE11 telling them they'll need to upgrade their browser by March 15 to continue using its services.",
    "While users could switch to Chrome or Firefox, Microsoft has made a number of advancements to Chromium-based Edge since its initial release in 2019 and the browser now really feels like a modern replacement of IE11.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Ending IE11 support"
  },
  "links": {
    "Internet Explorer 11": "https://www.techradar.com/news/microsoft-is-finally-killing-off-internet-explorer",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "update": "https://workspaceupdates.googleblog.com/2021/02/reminder-ending-support-for-ie11-for.html",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Docs": "https://www.techradar.com/reviews/google-docs",
    "Sheets": "https://www.techradar.com/reviews/google-sheets",
    "Slides": "https://www.techradar.com/reviews/google-slides",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "browser": "https://www.techradar.com/best/browser",
    "Chromium-based Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "ZDNet": "https://www.zdnet.com/article/still-using-internet-explorer-11-time-to-switch-because-soon-your-google-workspace-apps-wont-work/"
  }
}