{
  "source": "https://www.techradar.com/news/microsoft-teams-update-will-make-your-next-presentation-less-of-a-snoozefest",
  "title": "Microsoft Teams update will make your next presentation less of a snoozefest",
  "category": "computing",
  "updated": "2021-06-07T10:09:21Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams will soon let you present like a news anchor",
  "article": [
    "Microsoft is preparing to launch two highly anticipated options for collaboration platform Teams that will give presenters the ability to flex their presentation style to the occasion.",
    "As per a new entry to the company’s product roadmap, Teams users will soon be able to take advantage of new presentation views: Reporter and Side-by-Side.",
    "“Reporter places content as a visual aid above your shoulder like a news story. Side-by-Side displays your video feed next to your content,” wrote Microsoft.",
    "The company says the additions will help presenters tweak the Teams feed to better suit their specific needs and “promote a more engaging presentation and consumption experience”.",
    "The new presentation modes are still under development, but are set to roll out to all users in a public build by the end of July.",
    "Microsoft first dropped hints about the new Teams presentation options at its annual Ignite conference, back in March. At the time, the additional modes were billed as a way to make remote presentations less stiff and help presenters hold the attention of the audience.",
    "The new modes also expand upon recent efforts to improve interoperability between Teams and the company’s presentation software, PowerPoint.",
    "Microsoft is in the process of rolling out a new Teams feature, called PowerPoint Live, which will allow users to launch presentations without having to share their screen with the audience. The idea is to cut out any potential privacy and compatibility issues, and to help presenters juggle information more efficiently.",
    "Using PowerPoint Live, presenters will be able to manage their slides, notes and the chat feed from within a single view. The service has also been equipped with a live slide translation feature, allowing audience members to convert slide text into their native tongue.",
    "The campaign to bolster the Teams presentation experience shows Microsoft is confident remote presentations will continue to play a central role in work, despite the anticipated return to the office. Having capitalized on the transition to remote working, Microsoft will hope it can consolidate its position as businesses enter a new phase in the coming months."
  ],
  "headers": {
    "5": "Microsoft Teams updates"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1310736953854926000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D83371",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "presentation software": "https://www.techradar.com/best/best-presentation-software",
    "PowerPoint": "https://www.techradar.com/reviews/microsoft-powerpoint",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}