{
  "source": "https://www.techradar.com/news/5-xbox-series-x-features-i-wish-were-on-ps5",
  "title": "5 Xbox Series X features I wish were on PS5",
  "category": "gaming",
  "updated": "2021-01-24T15:00:26Z",
  "author": "adam-vjestica",
  "summary": "Opinion: There’s nothing wrong with sharing.",
  "article": [
    "The PS5 has been my go-to gaming machine since it launched in November, but there are some Xbox Series X features that I seriously wish were on Sony’s console. In fact, I’d go as far to say that some of the features that PS5 is missing are actually far more egregious absences than the ones that don't appear on Microsoft’s console.",
    "As I mentioned last time, I’m in no way advocating that the PS5 and Xbox Series X be carbon copies of one another. But when a feature becomes so essential to my console experience, I can’t help but wish it was available on both next-gen systems.",
    "After mulling over five PS5 features I wish were on Xbox Series X, it’s clear that there are innovations on Microsoft’s console that would ultimately make Sony’s system better. So, without further ado, let’s jump in.",
    "If you own a PS5 and game on a monitor, you’ve probably already encountered this frustrating issue. Right now, the PS5 can’t output at 1440p. That means you’re stuck at 1080p resolution, and missing out on 78% more pixels.",
    "Not having 1440p support is a baffling oversight from Sony, particularly as the Xbox Series X is compatible. In fact, all of the Xbox family of consoles support it. When you consider that thousands of gamers prefer to play on a monitor, particularly when it comes to competitive titles or those who stream on console, by not supporting a resolution that is so widely used, Sony is severely limiting the PS5’s appeal.",
    "In an interview with Japanese publication AV Watch (as translated by Eurogamer), PlayStation hardware boss Masayasu Ito and PlayStation platform boss Hideaki Nishino said Sony “want to prioritize support for TVs” and that “there’s no technological problem at all” that prevents the PS5 from outputting at 1440p. Ito-san went on to say that the company would respond if there was demand for it… well, there certainly is, so please add 1440p support soon, Sony.",
    "Sony decided to go its own route for the PS5’s spatial audio, and while I’ve been fairly impressed with the Tempest 3D Audio in games like Demon’s Souls and Marvel’s Spider-Man: Miles Morales, I still wish Sony would support Dolby Atmos and DTS Headphone:X as well.",
    "Yes, you have to pay a premium for either service, but Dolby Atmos is being adopted more and more throughout the entertainment industry, and not having Atmos support is a blow to any cinephile who plans to use the PS5 as their main home entertainment system.",
    "Sony’s Tempest 3D Audio is also extremely limited when it comes to customizing your experience. Both Dolby Atmos and DTS Headphone:X let you create your own equalizer settings and support a variety of presets, while Sony’s 3D Audio only lets you choose between five differing levels, which you’re supposed to match to your ear's comfort.",
    "At the moment, 3D audio is also available via headphones only. Sony has said support is coming for TV speakers and soundbars in the future, but right now, you’re out of luck if you don’t wear a headset when gaming.",
    "I’m not optimistic we’ll see other spatial audio solutions anytime soon on PS5, but more choice for consumers is always a good thing. You hear that, Sony?",
    "Arguably the jewel in Microsoft’s next-gen crown, Quick Resume is a revelation. Being able to suspend and resume multiple games at the same time and switch between them seamlessly is simply awesome, and I’m still surprised whenever I return to a game after a couple of weeks, only to discover I’m exactly where I left off.",
    "Even though PS5 games boot up extremely quickly, and have some nifty shortcuts thanks to Activity Cards, you'll still have to sit through the odd splash screen and navigate through menus whenever you start a new game.",
    "The issue really becomes apparent when playing PS4 games, though. None of them support Activity Cards, and they haven’t been optimized to take advantage of the PS5’s super-fast SSD. Games like Days Gone still have lengthy load times, and if you decide to play something else, it’s an exercise in patience as you wait to play. The Xbox Series X basically all but eliminates this problem, and it would be a serious win if Sony could do something similar.",
    "If you’re a fan of unlocking achievements or collecting trophies, as many gamers are, the PS5 isn’t exactly designed with virtual completionists in mind.",
    "When you bring up the PS5’s command center, there’s no quick shortcut to view trophies like there was on PS4. Instead, you have to scroll to your profile to find your trophy list, which isn’t immediately obvious. A couple of button presses later, and you’re finally where you want to be, but it’s a process that needs to be simplified.",
    "On Xbox Series X, achievements are far more accessible. Simply open the Guide during a game and you can view a full list of what you need to unlock at a glance. I also prefer the vertical scrolling nature of achievements as opposed to Sony’s horizontal layout. When you’re trying to skim through what’s often a long list of accolades, it feels far more cumbersome to sift through them horizontally, so it would be nice to see Sony make some improvements here.",
    "Even after nearly three months, I still forget how to turn off the PS5 correctly. For some reason, unknown to perhaps anyone but Sony’s chief UI designers, the team decided to turn its back on years of ingrained muscle memory and change the way we shut down the PS5. Why?",
    "On PS4, you simply held down the PS Button, and selected whether you wanted to put the console into rest mode. The same is basically true on Xbox Series X. On PS5, however, holding down the PlayStation button now takes you to the home screen, and to turn off the system, you have to tap the PS Button and make one nudge to the left (or 10 to the right) until you reach the power icon. From there, you can choose either Rest Mode or to turn off the system completely.",
    "That means it can potentially take up to 12 button presses instead of two to shut down the PS5 (as I often forget you can even nudge it to the left when in the command center). What the heck, Sony?",
    "Unfortunately, by the time Sony decides to revert this weird decision to something more reasonable, I’ll have undoubtedly got so used to the long-winded way of turning off the PS5 that I’ll have to relearn everything again. Urgh."
  ],
  "headers": {
    "3": "1. 1440p support",
    "6": "2. Dolby Atmos and DTS headphone X support",
    "11": "3. Quick Resume",
    "14": "4. Better achievement tracking",
    "17": "5. Turning off the system"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "last time": "https://www.techradar.com/news/5-ps5-features-i-wish-were-on-xbox-series-x",
    "five PS5 features I wish were on Xbox Series X": "https://www.techradar.com/news/5-ps5-features-i-wish-were-on-xbox-series-x",
    "AV Watch": "https://av.watch.impress.co.jp/docs/series/rt/1288103.html",
    "Eurogamer": "https://www.eurogamer.net/articles/2020-11-10-sony-says-ps5-currently-doesnt-support-1440p-because-it-wants-to-prioritise-support-for-tvs",
    "Tempest 3D Audio": "https://www.techradar.com/news/ps5-wont-use-dolby-atmos-in-games-and-may-require-you-to-send-sony-a-picture-of-your-ears",
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Marvel’s Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "DTS Headphone:X": "https://www.techradar.com/reviews/audio-visual/av-accessories/dts-headphone-x-1213250/review",
    "Quick Resume": "https://www.techradar.com/news/xbox-series-x-quick-resume-is-as-seamless-as-you-hoped",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games"
  }
}