{
  "source": "https://www.techradar.com/news/realme-8-pro-is-a-new-cheap-phone-that-beats-redmi-moto-at-their-own-game",
  "title": "Realme 8 Pro is a new cheap phone that beats Redmi, Moto at their own game",
  "category": "phones",
  "updated": "2021-03-24T15:02:08Z",
  "author": "tom-bedford",
  "summary": "Lots of top specs",
  "article": [
    "There are loads of great phones available at low price tags, and another contender has just joined the ring. The Realme 8 Pro is a new low-cost phone to rival the Redmi Note series and some of the higher-end Moto G devices.",
    "Unveiled at a launch event on March 24 alongside a non-Pro version, the Realme 8 Pro has a few top specs that make it a tempting buy compared to its rivals - we'll run you through the key selling points below.",
    "The handset costs £279 in the UK, which converts to roughly $390, AU$500 – that's a low cost for a phone with these top specs. It's no wonder, then, that we gave it four and a half stars out of five in our review.",
    "The Realme 8 Pro has a 108MP main camera, and it's one of the cheapest phones to have such a high-res main sensor. We found it took good-looking photos, but since they were so high-res, we could take them into an editing app and tweak them to make them look even better.",
    "The handset also has 50W wired charging, which is incredibly fast for a low-cost phone. With this, it takes barely any time to get the phone powered up to full.",
    "Our favorite aspect of the Realme 8 Pro, though, was something it does a lot better than its rivals: its design. While many low-cost phones are massive, clad in cheap plastic, and pretty heavy, the Realme phone is lightweight, thin, and has a suave-feeling textured rear.",
    "If you want to find out more about the phone, including how it stacks up against its rivals, you can check out our full Realme 8 Pro review here."
  ],
  "headers": {
    "3": "Realme 8 Pro: three big selling points"
  },
  "links": {
    "Realme 8 Pro": "https://www.techradar.com/reviews/realme-8-pro",
    "full Realme 8 Pro review here": "https://www.techradar.com/reviews/realme-8-pro"
  }
}