{
  "source": "https://www.techradar.com/news/dji-air-2s-has-landed-and-its-an-exciting-mix-of-djis-best-two-drones",
  "title": "DJI Air 2S is an almost perfect blend of its two best drones",
  "category": "cameras",
  "updated": "2021-08-25T11:50:53Z",
  "author": "mark-wilson",
  "summary": "Meet DJI's best flying camera so far",
  "article": [
    "The DJI Air 2S has officially landed after more leaks than a colander-shaped cruise ship – and as expected, it's an exciting mix of DJI's best two drones. (Looking for our final verdict DJI's new drone? Read our in-depth DJI Air 2S review).",
    "The Air 2S takes the compact, foldable form of the DJI Mavic Air 2 and combines it with a camera that has a large 1-inch sensor, which is the same size as the chip in the DJI Mavic 2 Pro.",
    "As our DJI Air 2S review concludes, this impressive DNA means it's probably the best drone ever made for hobbyist fliers – or anyone looking for a travel-friendly drone that can shoot high-quality aerial photos and videos.",
    "The Air 2S can shoot 20MP still images or 5.4K video from that one-inch sensor, and also packs in all of DJI's automated flight modes – including a new one called MasterShots.",
    "That new MasterShots feature lets the DJI Air 2S automatically plan a flight path through a scene for you. In the app, you just drag a square around the subject you want the drone to follow, then choose the size of the flight area – you'll then get an auto-generated video based on a few different optional themes.",
    "This joins other DJI drone staples like its QuickShots (which are automated camera moves like 'Helix' or 'Boomerang') and a freshly updated ActiveTrack 4.0 mode, which DJI promises has improved obstacle avoidance algorithms and subject-tracking powers. To help on that front, the Air 2S now has four-way obstacle avoidance sensors, thanks to a pair of additional ones on top.",
    "But the headline feature is that new 1-inch sensor. It's significantly larger than the 1/2-inch chip in the DJI Mavic Air 2, which will remain on sale, and the same size as the Mavic 2 Pro's sensor. Along with the ability to shoot 5.4K/30p video, it also lets you capture 4K/60p footage with a 150Mbps bit-rate (again, higher than the Mavic Air 2).",
    "Another bonus is that, like the DJI Mavic 2 Pro, the Air 2S can shoot in 10-bit color, which gives you much more editing leeway than the 8-bit Mavic Air 2. The Air 2S lets you shoot in three color profiles – standard 8-bit, 10-bit D-Log and 10-bit HLG (Hybrid Log Gamma) – and also has a handy 8GB of internal storage.",
    "Like most DJI drones, aside from the new DJI FPV, the Air 2S' camera is supported by a three-axis gimbal, to help keep your video footage smooth. And it now has a new digital zoom function, which promises to let give you either 4x or 6x zoom (albeit with some slightly quality loss) depending on which mode you're shooting in.",
    "So is the DJI Air 2S the perfect all-rounder drone? Almost, but there are few small disappointments.",
    "Despite rumors to the contrary, the Air 2S isn't compatible with the new DJI Goggles V2.0 or Motion Controller, which both launched at the same time as the DJI FPV. These are ideal for the 'First Person View' flying experience offered by the DJI FPV, which sends the drone's video signal straight to a headset.",
    "This is slightly strange, as the DJI Air 2S does have Ocusync 3.0 connectivity, which is the company's latest transmission tech and is what the Goggles V2.0 use for their low-latency video feed. DJI told us it was \"theoretically\" possible that the Air 2S could eventually support the Goggles V2.0 and Motion Controller, but that \"there's no roadmap or timeline for this.\"",
    "The other slight disappointment for anyone coming from a Mavic 2 Pro is that the Air 2S' camera doesn't have a variable aperture. This is a useful feature because it means you don't need to use ND (Neutral Density) filters in bright conditions or land the drone to change filters. But the Air 2S Fly More Combo does at least come with a pack of ND filters, which you can use to avoid overexposure in bright conditions.",
    "Lastly, DJI has employed a slightly cheeky trick with the Air 2S' raw files, which (as DJI told us) automatically have \"temporal denoising technology\" applied to them to reduce high ISO noise. The result are fantastic, even if they're not exactly true raw files.",
    "Despite these small niggles, DJI's new drone remains a fantastic all-rounder – as you can discover in our full DJI Air 2S review.",
    "Its predecessor, the DJI Mavic Air 2, has been our number one drone for a long time, because it hits the sweet spot of size, performance and price for most people – particularly anyone looking to take a step up from a beginner drone like the DJI Mini 2.",
    "But the DJI Air 2S adds big, pro-level performance upgrades to the Mavic Air 2's compact, folding design – and it's a brilliant combination. The only downside is that this brings a slightly higher price tag, which is why the Mavic Air 2 will remain on sale.",
    "You can buy the DJI Air 2S today in its standard bundle, which includes the drone, remote controller and one battery, for $999 / £899 / AU$1,699. Or you get it in a Fly More Combo bundle (which includes two extra batteries, a set of ND filters, a charging hub and a shoulder bag) for $1,299 / £1,169 / AU$2,099."
  ],
  "headers": {
    "9": "Missing pieces",
    "14": "Airs and graces"
  },
  "links": {
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s",
    "DJI Air 2S review": "https://www.techradar.com/reviews/dji-air-2s",
    "DJI Mavic Air 2": "https://www.techradar.com/reviews/dji-mavic-air-2-review",
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "DJI FPV": "https://www.techradar.com/reviews/dji-fpv-drone",
    "DJI Mini 2": "https://www.techradar.com/reviews/dji-mini-2"
  }
}