{
  "source": "https://www.techradar.com/news/microsoft-surface-pro-8-looks-set-to-launch-soon-with-the-latest-wi-fi-tech",
  "title": "Microsoft Surface Pro 8 looks set to launch soon with the latest Wi-Fi tech",
  "category": "computing",
  "updated": "2021-04-13T15:53:55Z",
  "author": "jess-weatherbed",
  "summary": "LTE and Wi-Fi 6 connectivity included",
  "article": [
    "The Microsoft Surface Pro 8 has been rumored for a while now, but we may be seeing an impending launch date thanks to a confirmed FCC certification filing. FCC stands for 'Federal Communications Commission', and the certificate means that the product is under the approved limits for electromagnetic interference, and suitable for retail in the USA.",
    "The FCC certification has also revealed that the upcoming Surface Pro device will use built-in LTE (Long Term Evolution) connectivity, Bluetooth 5, and offer Wi-Fi 6 courtesy of Intel’s Wi-Fi 6 AX201 adapter.",
    "All of these hardware features should result in better wireless performance when compared to previous Surface Pro models. The Surface 8 Pro is expected to be announced in early 2021, though an official launch date has yet to be announced.",
    "Whilst we don't have any official release information, the Surface Pro 8 has had sufficient leaks and speculation from reliable sources to get a good indication of the final product family, such as eBay listings and benchmarks. The Surface Pro 8 lineup still starts with an Intel Core i3 chipset but will pack 8GB of RAM for its minimum spec, a massive increase on the base specifications of the previous Pro 7. The rumored information provided by German tech outlet WinFuture includes a full lineup of configurations: the i3 model is expected to pack 128GB of storage, while the i5 chipset models (both LTE and WiFi-only) will include either 8GB or 16GB of RAM and either 128GB or 256GB of storage.",
    "Finally, the Intel Core i7 models should come in either 16GB and 256GB, 512GB, or 1TB of storage – with an additional maxed out model packing a whopping 32GB of RAM and 1TB of storage. This coincides with another rumor we reported on a few weeks ago, that also indicated no changes would be made to the screen size or overall design of the new 2-in-1 from the previous Surface Pro 7 model. All of the information provided should be taken with a pinch of salt until the product line is officially announced by Microsoft, and we’ll hold off getting too excited (or disappointed) until we can get our hands on a Surface 8 Pro to put through the wringer. Let's keep our fingers crossed that we won’t have too long to wait.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "What else do we know about the Surface 8 Pro?"
  },
  "links": {
    "Microsoft Surface Pro 8": "https://www.techradar.com/reviews/microsoft-surface-pro-8",
    "FCC certification": "https://fccid.io/C3K1986",
    "Surface Pro": "https://www.techradar.com/reviews/microsoft-surface-pro-6",
    "Wi-Fi 6 courtesy of Intel’s Wi-Fi 6 AX201 adapter": "https://fccid.io/C3K1985",
    "eBay listings and benchmarks": "https://www.techradar.com/news/surface-pro-8-prototype-apparently-shows-up-again-this-time-with-benchmarks",
    "WinFuture": "https://winfuture.de/news,120222.html",
    "rumor": "https://www.techradar.com/news/new-microsoft-surface-pro-8-rumor-brings-good-news-and-bad-news",
    "Windows Latest": "https://www.windowslatest.com/2021/01/05/microsoft-fcc-filing-hints-at-surface-pro-8-with-lte-and-intel-wi-fi-6/"
  }
}