{
  "source": "https://www.techradar.com/news/microsofts-onedrive-is-becoming-a-better-web-app-heres-why-it-matters",
  "title": "Microsoft's OneDrive is becoming a better web app - here's why it matters",
  "category": "computing",
  "updated": "2021-06-14T09:49:37Z",
  "author": "daryl-baxter",
  "summary": "OneDrive as one web app",
  "article": [
    "As users wait to see if Windows 11 is indeed real, Microsoft is working on bringing OneDrive, its popular cloud storage service, as a web app to Edge, Google Chrome and Mozilla’s Firefox browser in July.",
    "Web apps have become increasingly useful in recent years, as they’re essentially apps that run in your web browser, so you don’t have to do anything else in managing them on your hard drive.",
    "With OneDrive usually accessed through File Explorer or your taskbar, using it as a web app could be much easier to manage and upload files, and Microsoft is keenly aware of this.",
    "Microsoft has a roadmap that lays out what they’re currently working on for OneDrive. It states that the Progressive Web App, or a PWA, is being worked on for browsers that support this type of web app, which will work similar to the application you use on your desktop.",
    "A PWA is the next step up from a usual web app, as it can take on the appearance of a desktop application launched from your web browser, but it barely takes up any space on your hard drive. Google has been working on a different version of this for Chrome, but here, it’s compatible with any browser that supports Progressive Web Apps.",
    "This is scheduled for July, so you may be able to manage your files from within Edge sooner than later.",
    "While this is a decent improvement, Microsoft and Google have yet to explain the benefits of what a PWA can bring, which has meant they are not as popular as they could be.",
    "Essentially, its ease of use. We use web browsers every day on our computers and smartphones, for all sorts of tasks, such as creating documents and editing photos. Going into another app can break your workflow, spending wasted time trying to find a certain file on your cloud storage of choice.",
    "Here, it will be a matter of selecting the OneDrive icon in your chosen web browser, searching for the file in question, and then dragging it to the project you’re working on, most likely in another tab in the same web browser.",
    "It makes it much easier to find those files, and with Windows 11 rumored to appear later this month, we may see even more new features of OneDrive coming soon that’s just one part of the PWA story.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Road to July",
    "6": "Analysis: why it matters"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-3577180656336052700&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D82040",
    "version": "https://www.techradar.com/news/watch-out-windows-10-google-chrome-is-getting-super-charged-web-apps",
    "Windows Latest": "https://www.windowslatest.com/2021/06/14/microsofts-onedrive-is-becoming-a-progressive-web-app/"
  }
}