{
  "source": "https://www.techradar.com/news/apple-app-store-isnt-as-scam-free-as-you-might-think",
  "title": "Apple App Store isn't as scam-free as you might think",
  "category": "computing",
  "updated": "2021-06-07T11:00:14Z",
  "author": "mayank-sharma",
  "summary": "Scam apps have raked in about $50m from unsuspecting iOS users",
  "article": [
    "A new investigation has revealed that 18 of the top 1,000 highest grossing apps on Apple’s App Store are guilty of scamming iOS users.",
    "While there’s nothing new about scam apps on mobile stores, finding them on Apple's marketplace is more concerning. One of the company's main justifications its tight control over the iOS apps ecosystem is so it can shield customers from insecure and duplicitous apps.",
    "However, according to an investigation by The Washington Post, scam apps are “hiding in plain sight\" on the App Store.",
    "Based on figures from market research firm Appfigures, the report suggests the scam apps have milked about $48 million from iOS users. Some of this cash is expected to have made its way into Apple’s coffers too, as the iPhone maker charges developers up to 30% of revenue generated through the App Store.",
    "The investigation revealed that app makers use fake customer reviews to propel their products up the rankings and trick users into paying higher prices.",
    "The Washington Post also claims it identified complaints from customers of several VPN services suggesting the apps infected their devices with viruses and pushed unnecessary bloatware.",
    "The list of dubious apps also includes a QR code reader that costs $4.99 a week, for a function that can now be performed by the iPhone’s default camera app.",
    "Further, the investigation revealed some apps are mimicking the branding of renowned companies - such as Amazon and Samsung - to deceive App Store customers.",
    "In all, the Washington Post reported eighteen offending apps to Apple, two thirds of which have now been removed from the App Store.",
    "TechRadar Pro reached out to Apple to ask if any sort of inquiry has been initiated, but the company has not yet provided a response.",
    "Via Washington Post"
  ],
  "headers": {
    "4": "Scam apps on iOS"
  },
  "links": {
    "App Store": "https://www.techradar.com/best/best-iphone-apps-2021",
    "iOS apps": "https://www.techradar.com/news/best-free-iphone-apps",
    "iOS": "https://www.techradar.com/news/ios-15-update",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "default camera app": "https://www.techradar.com/how-to/phone-and-communications/mobile-phones/how-to-scan-qr-codes-from-your-iphone-or-ipad-1308841",
    "Washington Post": "https://www.washingtonpost.com/technology/2021/06/06/apple-app-store-scams-fraud/"
  }
}