{
  "source": "https://www.techradar.com/news/ipad-pro-could-face-tough-competition-from-xiaomis-next-tablet",
  "title": "iPad Pro could face tough competition from Xiaomi's next tablet",
  "category": "tablets",
  "updated": "2021-03-16T13:18:06Z",
  "author": "tom-bedford",
  "summary": "Top specs, but low prices (probably)",
  "article": [
    "If you're looking for a new super-powerful tablet the iPad Pro range is currently the place to look, but a new contender could take to the ring as it's rumored Xiaomi is working on a super-powerful Android tablet.",
    "A source on Chinese social media site Weibo has shared some details of the upcoming tablet, which make it sound pretty premium. We'll share them below - take this with a pinch of salt, because we haven't heard of the leaker 'Bald Panda' before (and we'd recognize a name like that), but that doesn't mean they're not real.",
    "We don't have a rumored price for the Xiaomi Mi Pad 5, as it's apparently called (Xiaomi used to put out affordable Android tablets, before stopping in 2018), but Xiaomi's known for competitive pricing, so this will likely undercut Samsung and Apple's competition.",
    "Apparently, the Xiaomi Mi Pad 5 will have a 10.95-inch screen (very similar to the smaller-size iPad Pro, at 11 inches), but with a 2K resolution, 120Hz refresh rate and 480Hz touch input rate. The iPad Pros match all those specs, though its refresh rate is variable, so only goes up to 120Hz for certain tasks.",
    "There are supposedly two rear cameras, a 20MP and 13MP snapper, one of which presumably being for wide-angle pictures. As with the iPad Air 4, there's said to be a side-mounted fingerprint sensor to unlock the tablet.",
    "The chipset is said to be the Qualcomm Snapdragon 870, a high-end processor used for lots of top Android phones (though it's not the best Android chipset available - that's the Snapdragon 888). The slate apparently uses Android, with Xiaomi's MIUI user interface laid over the top.",
    "So in all departments (that we've heard of so far) the Xiaomi Mi Pad 5 seems to roughly match up to the iPad Pro, though admittedly that's based on limited information. We'll have to see how much Xiaomi's tablet costs, before seeing if its a true rival or not.",
    "Via MyFixGuide"
  ],
  "headers": {
    "3": "Xiaomi tablet specs"
  },
  "links": {
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "Android tablet": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "Weibo": "https://m.weibo.cn/detail/4614734659720413",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "MyFixGuide": "https://www.myfixguide.com/xiaomi-mi-pad-5-specifications-leaked/"
  }
}