{
  "source": "https://www.techradar.com/news/tesla-model-x-vs-tesla-model-y",
  "title": "Tesla Model X vs Tesla Model Y: which Tesla SUV should you buy?",
  "category": "car-tech",
  "updated": "2021-07-26T16:42:51Z",
  "author": "rob-clymo",
  "summary": "What to look for if you're in the market a Tesla SUV",
  "article": [
    "Tesla is gradually filling every spot in the current carbuying marketplace. There's even a budget level compact on the way that'll open up the brand to more customers.",
    "It's also establishing itself in the burgeoning SUV sector with models in the shape of the older Tesla Model X and the new Tesla Model Y.",
    "Both offer the classic SUV experience while blending it with Tesla's unique styling, dazzling performance and lots of innovation.",
    "With demand for SUV's still high, the Tesla Model X is perfect for anyone who needs a high-rise vehicle with lots of space and plenty of performance to back it up.",
    "However, the Model X was first mooted all the way back in 2012 and didn't make it to customers until 2015, so it's been a bit of a slow burner.",
    "The Model Y, on the other hand, is a new arrival with owners taking delivery of vehicles during 2020 in the US. Deliveries in Europe are on track for later 2021, although the UK won't get the Model Y until 2022.",
    "So, is it a case of out with the old and in with the new? Can the Tesla Model X still cut it, or has the Tesla Model Y superseded it? Read on to find out.",
    "While the bloated SUV market has plenty of cars that look very similar, the same cannot be said for the Tesla Model X.",
    "It's got that certain look that only a Tesla can have, but the main talking point has been its distinctive Falcon Wing rear doors. These open upwards and allow easy access to the rear and with this being an SUV with seating for up to seven that's a very good thing.",
    "However, in the years since the Tesla Model X hasn't seen too many changes to its overall design, although more recently it has undergone a relatively minor facelift.",
    "Chrome trim on the exterior, for example, is very much out and has been replaced with a premium gloss black finish.",
    "In many ways the Tesla Model Y is like a bigger, mini-SUV version of the Tesla Model 3, so has more in common with that than the Model X in terms of component parts.",
    "However, viewed from some angles it's a bit of a Model X doppelganger but certainly doesn't pack those premium Falcon Wing doors given its much more reasonable price tag.",
    "And, despite its newness, the SUV has already been treated to some subtle cosmetic upgrades including neat black exterior trim instead of traditional chrome. Other improvements have included auto-dimming mirrors and laminated window glass.",
    "The car is a little more manageable than its bigger brother too, although the trade-off is you only get seating for five, which is two less than its full-size SUV relative. However, the Model Y Long Range AWD model can be adapted to seat seven if you wish to order the option.",
    "In terms of cargo space though, it's the Tesla Model X that makes it the SUV to head for if you're in need of storage, with 91 cubic feet, compared to the 68 cubic feet found inside the Model Y.",
    "There are two versions of the Tesla Model X currently in production. Top of the pile has to be the Tesla Model X Plaid edition, which boasts 1,020 horsepower that'll propel it from 0 to 60mph in just 2.5 seconds according to Tesla's figures.",
    "It's suitably impressive in a straight line drag race scenario too, with a quarter mile time of 9.9 seconds possible from the Tri Motor powertrain. Equally, it's a great car for pulling things around, with 5,000lbs of towing capacity on tap.",
    "The Tesla Model X Long Range model, meanwhile, dials things back a little, with 670 horsepower available that will push the car from 0 to 60mph in 3.8 seconds. That's still pretty impressive given that this is a full-size SUV.",
    "Adding similar appeal is the 5,000lbs towing capability that's given a boost from the Dual Motor powertrain. The car can also reach a top speed of 155mph.",
    "As an alternative choice, the Tesla Model Y has plenty of get up and go too. The Performance edition can deliver a 0 to 60mph time of 3.5 seconds from the Dual Motor All-Wheel Drive powertrain and reach a top speed of 155mph.",
    "The Long Range Dual Motor All-Wheel Drive model uses the same battery as the Performance edition, but is slightly more sedate with a 0 to 60mph time of 4.8 seconds and a top speed of 135mph.",
    "The Tesla Model X Plaid edition comes with an estimated range of around 340 miles, whereas the Long Range model bumps that up a notch with around 360 miles.",
    "That's still pretty good given that this is a full-size SUV also weighs in at well over 5,000lbs. Both cars benefit from up to 250 kW charging via the Tesla Supercharger network.",
    "Both editions of the Tesla Model Y feature the Long Range battery, which allows the Performance car to get around 303 miles of range.",
    "The Long Range All-Wheel Drive car improves on that figure ever so slightly, delivering around 326 miles from a full charge.",
    "Again, both cars make use of the Tesla Supercharger network for replenishing their batteries including compatibility with the latest third-generation 250kW units.",
    "New owners buying the Tesla Model X will be able to enjoy an updated interior, which is dominated by a new 17-inch landscape oriented touchscreen and digital gauge cluster.",
    "Tesla has reportedly worked on improving the user experience, based on feedback from owners of earlier models. However, a lot of what you get here is much the same as that seen on the inside of the Tesla Model S, including the latest yoke-style steering wheel and associated control buttons.",
    "Occupants now get the benefit of no less than four wireless smartphone charging pads too, while rear occupants won't feel left out on the entertainment front thanks to another smaller 8-inch rear screen located between the front seats.",
    "Again, this follows the same route as the technical setup of the Model S, with an Ultra High Fidelity Sound system adding obvious value for music fans.",
    "Tesla has come up with a minimalist design for the Tesla Model Y, but that hasn't stopped it packing in the usual array of tech.",
    "The driver and front seat passenger can control all of the car's functions using the 15-inch portrait-oriented touchscreen above the centre console. However, core information is also shown on the streamlined dash in front of the driver.",
    "The experience is akin to that of sitting in the Tesla Model 3, which is unsurprising given that both cars are built on the same platform. In terms of tech the car follows suit, with Wi-Fi and Bluetooth connectivity, a 14-speaker and single subwoofer in-car audio system, though the car doesn't have the Ultra High Fidelity Sound system as per the Model X.",
    "Nevertheless, it's possible to console yourself by enjoying the excellent 8-way power adjustable heated seats.",
    "Driving aids for both cars feature the core suite of Autopilot driving aids including the likes of forward collision warning, automatic emergency pedestrian detection, adaptive cruise control and blind spot monitoring.",
    "You'll need to spend an additional $10,000 in the US if you want to enjoy the option of Full Self Driving capability however.",
    "The Tesla Model X can currently be ordered in the US with latest deliveries expected to arrive early next year.",
    "As of now (July 2021), Tesla has the purchase price for the Long Range Dual Motor All-Wheel Drive model set at $94,990 / £94,980.",
    "The Tri Motor All-Wheel Drive Plaid Model X costs $119,990 / £110,980 with deliveries also expected around January of February of 2022.",
    "Supplies of the Tesla Model Y are rather more readily available, with the Dual Motor All-Wheel Drive edition costing $52,990 / £39,000 with a delivery date of around October for those in North America.",
    "The Dual Motor All-Wheel Drive Performance edition can be had even sooner with a delivery time currently set at around 7 to 11 weeks (again, in the US) and carries a $60,990 / £46,000 price tag.",
    "However, it's always worth remembering that market forces can affect Tesla cars alongside other unforeseen problems such as component supply issues.",
    "That can often mean prices and availability change, sometimes rather abruptly. Delivery times quoted are also based on US orders and cars destined for overseas can often have very different arrival dates. It's a point to note if you're serious about any of the Tesla range and not based Stateside.",
    "If you're left feeling like you need a Tesla Model X or a Tesla Model Y in your life then you can expect a unique experience from either car.",
    "However, as has always been the way with Tesla, model specifications and prices can change like the wind. At least the Model X has been around for long enough that you should be able to get your hands on one within a reasonable time frame. The same can also be said for the Tesla Model Y if you live in the US.",
    "Meanwhile, potential customers in the UK and Europe have to wait a little longer for the car to arrive. Indeed, there also seems to be speculation as to where supplies of the European Model Y will come from.",
    "Tesla is building a facility in Berlin, but rumors suggest that cars could end up being shipped from the company's factory in China as opposed to its original plant in Fremont, California. There's an element of wait and see to all this, which is, it has to be said, is typically Tesla. Either way, both cars deliver a proper SUV experience, with the Model X offering a full-size and extremely spacious car with plenty of carrying capacity, beefy performance and all of the Tesla toys.",
    "However, the Model Y might sound that little more appealing being the newer car even if it offers a little less on the load-carrying front. It's certainly much cheaper.",
    "That being said, you might have to wait a little longer in order to actually get your hands on one."
  ],
  "headers": {
    "7": "Tesla Model X vs Tesla Model Y: design",
    "16": "Tesla Model X vs Tesla Model Y: performance",
    "22": "Tesla Model X vs Tesla Model Y: range & charging",
    "27": "Tesla Model X vs Tesla Model Y: in-car tech",
    "37": "Tesla Model X vs Tesla Model Y: price and availability",
    "44": "Takeaway"
  },
  "links": {}
}