{
  "source": "https://www.techradar.com/news/apple-is-making-things-right-for-iphone-13-buyers-with-apple-cards",
  "title": "Apple is making things right for iPhone 13 buyers with Apple Cards",
  "category": "phones",
  "updated": "2021-10-06T09:03:54Z",
  "author": "james-rogerson",
  "summary": "Get your cashback even if your Apple Card failed",
  "article": [
    "You’d think the one place that you’d never have a problem using the Apple Card is Apple’s own website, but you’d be wrong, because a number of customers reported problems when trying to use their Apple Cards to buy an iPhone 13.",
    "In many cases this led to them switching to a different card and missing out on the 3% cashback they’d have been eligible for, but Apple is addressing this situation.",
    "MacRumors reports that affected customers have been receiving emails from Apple, which acknowledge the issues and say that the 3% cashback will be provided anyway.",
    "It seems that if you initially attempted to purchase an iPhone 13 with an Apple Card, had it declined, and then successfully purchased it with another payment method, you should get this email.",
    "As for the cashback, that will appear as a Balance Adjustment in the Wallet app, and will also appear on your October monthly statement. Users report that they’re already getting this money credited to their accounts, so if you don’t have it yet you shouldn’t have to wait long.",
    "Apple’s email finishes by saying that if you have any questions you should contact an Apple Card Specialist, which is presumably also what you should do if you haven’t received this email and think you should have.",
    "This was clearly the right thing for Apple to do, and it’s good to see the company making amends. It’s a move that’s also sure to build a lot of goodwill among customers.",
    "Yet some will probably have to wait longer for their iPhone 13 to arrive, since they failed to get payment through fast enough to be in the first batch of orders, so for them this won’t be a complete fix.",
    "There’s also the question of why this happened at all. Even giant companies are fallible of course, but it could shake consumer confidence in the Apple Card. Hopefully things will go more smoothly for the Apple Watch 7, which goes up for pre-order on October 8."
  ],
  "headers": {
    "6": "Opinion: a good approach, but not a total fix"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "MacRumors": "https://www.macrumors.com/2021/10/05/apple-card-daily-cash-iphone-13-credit/",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news"
  }
}