{
  "source": "https://www.techradar.com/news/the-6-airpods-3-features-we-wanted-from-apple-but-didnt-get",
  "title": "The 6 AirPods 3 features we wanted from Apple – but didn’t get",
  "category": "audio-visual",
  "updated": "2021-10-19T03:32:09Z",
  "author": "nick-pino",
  "summary": "ANALYSIS: No noise cancellation or fitness features this time around, sadly",
  "article": [
    "After months of rumors, Apple finally announced the new AirPods 3 during its Unleashed event, where we were also treated to new colors for the Apple HomePod mini, the Apple M1 Pro and M1 Max, MacBook Pro 14, and MacBook Pro 16.",
    "Sporting new features like Spatial Audio with dynamic head tracking, adaptive EQ, and longer battery life than their predecessors, they certainly look like an improvement on the original earbuds… but it doesn’t quite feel like Apple pulled out all the stops.",
    "Potentially that's because in those aforementioned months of rumors we had heard Apple was bringing big new features to the third iteration of its earbuds like noise cancellation and fitness features, as well as safety features that would help keep you safe. Unfortunately, none of those materialized in the final product.",
    "However, rather than vent about it, we’ve decided to put together something constructive – a guide to all the features we’d like to have seen. Maybe we won’t get them in this generation, but with enough luck, we’ll get them in the AirPods 4.",
    "While Apple is adding spatial audio support to its true wireless earbuds, it doesn’t plan on adding Hi-Res Audio support… which is a bit disappointing. Like its other wireless earbuds, Apple simply hasn’t found a way to send Hi-Res Audio over Bluetooth on the AirPods 3.",
    "In fairness, the necessary bit-rate to deliver truly lossless audio over Bluetooth hasn’t been available until very recently. In September, Qualcomm announced aptX Lossless, a new feature of it’s Snapdragon Sound technology, which the company claims is capable of delivering 16-bit / 44.1kHz audio over a Bluetooth connection. Without something like that in the AirPods, there’s no way we’ll get true Hi-Res Audio in this generation of AirPods.",
    "With Apple touting its latest fitness features on the Apple Watch and iPhones, we thought it’d be a sure thing that those same features would appear on the AirPods 3.",
    "Among the fitness features we thought we’d see on AirPods 3 were ambient light sensors that could make them much more useful as health monitoring devices. With light sensors installed, you might’ve been able to monitor more health aspects like heart rate, which has so far been limited to the Apple Watch.",
    "A few months back Apple even filed patents for something similar – but unfortunately those upgrades aren’t coming to AirPods 3.",
    "When we heard the rumors that the AirPods 3 might resemble the AirPods Pro, we were nearly certain that we’d finally get active noise cancellation in the base model AirPods.",
    "Unfortunately, that wasn’t the case. In some ways it makes total sense that Apple wants to keep noise cancellation a feature of its more expensive AirPods Pro, it’s somewhat shortsighted – other earbuds makers like Sony have included at least some basic noise cancellation performance in its entry-level earbuds and Apple not doing so here could help the competition by giving them a clear advantage.",
    "It’s not a deal breaker for us, but it would’ve been nice to see the new AirPods in some interesting colorways instead of the iconic white. Sure, that’s a classic, but it would’ve been nice to see Apple ape some of the colors that Samsung put out with its new Galaxy Buds 2 like Olive and Lavender on top of the traditional Black and White options.",
    "This has been something Apple has slowly been improving over time as seen by the announcement of the new color options for the HomePod mini, but as of yet that design mentality hasn’t quite made its way to Apple’s flagship earbuds.",
    "Another entry in the “improved... but maybe not enough” category is the EQ in the earbuds. Apple says it’s enabling the adaptive EQ from the AirPods Pro in the AirPods 3 that will tailor the sound of the earbuds in real time, based on how they fit in your ear – however they won’t allow you to go in and tweak things how you like.",
    "In our review of the 2019 AirPods we said that they had a lively, powerful presentation, but said that they sound slightly harsh when it comes to higher-frequencies and lacked the proper bass response.",
    "To its credit, Apple says it has redesigned the drivers inside of the earbuds for better bass, but it’s still not allowing users to go in and tweak the sound to their liking with the latest launch of the AirPods.",
    "While it was a bit far-fetched, we had grown to like the idea that the AirPods 3 might come with some neat safety features. They were always a bit nebulous, but rumors had pointed to a patent that allowed the earbuds to adjust their audio output based on the user's activities and location, including \"adjusting audio volume, stopping or preventing audio from playing, providing feedback, directions, encouragement, advice, safety information and instructions\".",
    "In an example we saw, the earbuds could \"pause or prevent audio playback\" through the earbud that’s adjacent to the road when you’re out cycling or running, allowing you to hear traffic while still listening to music through the other earbud.",
    "That’s currently not something any earbuds are doing, so to see it in the AirPods 3 would’ve really felt unique and special. Oh well, there’s always the AirPods 4."
  ],
  "headers": {
    "4": "Feature #1: Hi-Res Audio",
    "6": "Feature #2: Fitness support",
    "9": "Feature #3: Noise cancellation",
    "11": "Feature #4: More color options",
    "13": "Feature #5: More control over their sound",
    "16": "Feature #6: Safety features"
  },
  "links": {
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "Unleashed event": "https://www.techradar.com/news/live/apple-event-october-2021-live-blog",
    "Apple HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "Apple M1 Pro and M1 Max": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "MacBook Pro 14": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "MacBook Pro 16": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Qualcomm announced aptX Lossless": "https://www.techradar.com/news/qualcomms-aptx-lossless-could-transform-the-way-wireless-headphones-sound",
    "something similar": "https://www.techradar.com/news/the-airpods-3-could-coach-you-through-your-workouts",
    "Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "2019 AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "patent": "http://patft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&r=1&f=G&l=50&s1=10743095.PN.&OS=PN/10743095&RS=PN/10743095"
  }
}