{
  "source": "https://www.techradar.com/news/intel-warns-of-cpu-stock-shortages-in-near-future",
  "title": "Intel warns of CPU stock shortages in near future",
  "category": "computing",
  "updated": "2021-07-25T12:49:10Z",
  "author": "darren-allan",
  "summary": "Intel CFO says to expect ‘acute’ supply problems in Q3",
  "article": [
    "Intel has warned that we are entering a period where the supply of its processors for consumers is going to become thin on the ground, so unfortunately, we can expect trouble ahead on the stock front.",
    "In fact, Intel’s chief financial officer, George Davis, has said there will be ‘acute’ supply problems in Q3 (from now through to September), following CEO Pat Gelsinger’s recent observation that the global chip shortage is likely to continue for one or two years, so perhaps until 2023.",
    "Davis said on an earnings call (as transcribed by Seeking Alpha): “Persistent industry-wide component and substrate shortages are expected to lower CCG (Client Computing Group) revenues sequentially. We expect supply shortages to continue for several quarters but appear to be particularly acute for clients in Q3. In data center, we expect enterprise, government and cloud to show further recovery in Q3.”",
    "Intel is prioritizing the production of heavyweight processors for the likes of data center use because that’s where the big profits lie (and also due to contracts the chip giant is bound by). Of course, if you only have a certain amount of production capacity, it makes sense to produce the biggest earning CPUs with the beefiest premium. Indeed, we’ve seen this before when Intel has struggled with supply issues, with the firm sacrificing lower-end processors to produce high-end Core models and server chips.",
    "The central issue here is a problem with substrate (the base layer of the chip) supply, and as Tom’s Hardware, which picked up on this, points out, the specific issue is with insufficient Ajinomoto ABF substrates. Lacking these, Intel is constrained in terms of the amount of CPUs it can actually make, and while the company has made moves to work on self-sufficiency – finishing production of ABF substrates in-house, and also investing in ABF substrate makers – these efforts won’t have an impact to mitigate shortages until later in the year.",
    "Davis said: “We did a really good job of eating up a lot of our substrates, some of which we thought we would have available to us in Q3. He added: “In Q3, we could see we had a real supply challenge, it is acute. But Q4, we are doing everything we can to help our substrate suppliers increase supply, including finishing up some of their manufacturing in our own facilities, which is something we could do with as an IDM [integrated device manufacturer].”",
    "While stock shortages are hardly anything new these days, and we’ve previously been told that component supply issues aren’t going away anytime soon – despite some glimmers of hope regarding GPUs – this latest admission from Intel is certainly disappointing.",
    "More to the point, the production issues for Q3 being referred to as ‘acute’ and rather serious sounding is an ominous note for those looking to pick up an Intel chip in the near future.",
    "Furthermore, remember that Intel is preparing to launch its next-gen Alder Lake CPUs later in 2021. Given the increasing amount of leakage around Alder Lake, and the fact that sample chips are reportedly already being slyly sold over in China, it seems like the 12th-gen processors are on target for a rumored October launch.",
    "That’s Q4, of course, where Intel expects matters to pick up a little from Q3, but if Alder Lake turns out to be as promising as the grapevine reckons, it’ll likely be in serious demand. And given what we’re hearing here, it’s not difficult to imagine another situation where CPU stock becomes a struggle to find with new models, and scalpers then getting involved with the usual results and spiralling prices."
  ],
  "headers": {
    "3": "Heavyweight priorities",
    "6": "Analysis"
  },
  "links": {
    "processors": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "CEO Pat Gelsinger’s recent observation": "https://www.techradar.com/news/intel-ceo-says-chip-shortage-could-stretch-into-2023",
    "Seeking Alpha": "https://seekingalpha.com/article/4440868-intel-intc-ceo-pat-gelsinger-on-q2-2021-results-earnings-call-transcript",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/intel-warns-of-consumer-chip-shortages-for-q3",
    "some glimmers": "https://www.techradar.com/news/amd-and-nvidia-gpu-stock-is-reportedly-recovering-and-prices-could-come-down-fast",
    "regarding GPUs": "https://www.techradar.com/news/ethereums-crashing-value-could-finally-net-you-an-nvidia-rtx-3060-graphics-card",
    "next-gen Alder Lake CPUs": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "sample chips are reportedly already being slyly sold over in China": "https://www.techradar.com/news/intels-next-gen-alder-lake-cpus-are-already-on-sale-but-you-wont-want-to-buy-one",
    "a rumored October launch": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows",
    "Alder Lake turns out": "https://www.techradar.com/news/intel-alder-lake-leak-shows-a-flagship-cpu-that-could-be-an-amd-ryzen-5950x-killer",
    "promising as the grapevine reckons": "https://www.techradar.com/news/intel-alder-lake-cpu-rumored-specs-could-mean-amd-has-a-serious-fight-on-its-hands"
  }
}