{
  "source": "https://www.techradar.com/news/home-depot-presidents-day-sale-2021-the-best-deals-on-appliances-tools-and-more",
  "title": "Home Depot Presidents' Day sale: the best deals happening right now",
  "category": "news",
  "updated": "2021-02-14T21:56:29Z",
  "author": "mackenzie-frazier",
  "summary": "Score Presidents' Day deals at Home Depot today",
  "article": [
    "The highly anticipated Home Depot Presidents' Day sale is live with fantastic deals on everything from appliances, tools, and furniture to decor, mattresses, outdoor items, and more. To help you sort through the maze of offers, we've rounded up the very best Home Depot Presidents' Day deals below Presidents' Day sales typically focus on home items, which is Home Depot's bread and butter, and - why its annual holiday sale is so popular. Whether you're looking to save on major appliances like refrigerators or washing machines or smaller kitchen appliances like air fryers and coffee makers, or interested in outdoor items like patio furniture and lawnmowers - Home Depot's Presidents' Day sale has you covered. See our top picks from Home Depot's Presidents' Day sale below, and make sure to bookmark this page as we'll be updating it will all the best deals throughout the holiday event. If you're interested in other offers, make sure to check out our main Presidents' Day sales for bargains on TVs, mattresses, laptops, and more.",
    "Shop more offers with our roundup of the best Presidents' Day TV sales and the best Presidents' Day mattress sales. You can also see more bargains from the Walmart Presidents' Day sale."
  ],
  "headers": {
    "1": "More Presidents' Day sales"
  },
  "links": {
    "Presidents' Day sales": "https://www.techradar.com/news/presidents-day-sales-deals-2021",
    "best Presidents' Day TV sales": "https://www.techradar.com/news/the-best-presidents-day-tv-sales-tv-deals-from-best-buy-walmart-and-amazon",
    "best Presidents' Day mattress sales": "https://www.techradar.com/news/presidents-day-mattress-sales-deals-2021",
    "Walmart Presidents' Day sale": "https://www.techradar.com/news/walmart-presidents-day-sale-2021-here-the-10-best-deals-happening-now"
  }
}