{
  "source": "https://www.techradar.com/news/subnautica-below-zero-dives-onto-pc-ps5-xbox-series-x-and-switch-in-may",
  "title": "Subnautica: Below Zero dives onto PC, PS5, Xbox Series X and Switch in May",
  "category": "gaming",
  "updated": "2021-02-25T17:00:47Z",
  "author": "darren-allan",
  "summary": "Plus PS4 and Xbox One",
  "article": [
    "Subnautica: Below Zero, the sequel to the much-loved underwater open-world survival game, is officially releasing on May 14 for PC and consoles.",
    "Specifically, Unknown Worlds' Subnautica: Below Zero will be out on Windows PCs (and Macs) via Steam and the Epic Games Store, and the game will land on Xbox Series S|X and PlayStation 5, plus Xbox One and PlayStation 4, as well as Nintendo Switch, with physical and digital copies that’ll set you back $29.99 (UK and AU pricing TBC).",
    "Of course, Below Zero has been in Early Access on Steam for a couple of years, but it wasn’t announced for any console platform save Nintendo Switch until now.",
    "Unknown Worlds revealed that Subnautica: Below Zero will be published in partnership with Bandai Namco, which will distribute the physical edition in the US, EMEA, and Japan. It’ll be available on Switch as a physical bundle which will combine both Subnautica (which wasn’t on Nintendo’s console previously) and Below Zero for $59.99.",
    "In Subnautica: Below Zero, players will still be exploring Planet 4546B, except time has moved on a year since the original, and they’ll be struggling to survive in an icy world (as the title indicates).",
    "There’s an all-new storyline with its own mysteries and nuances, plus new tech to craft and more base building options, not to mention a whole load of new creatures and other stuff to encounter in the deep icy depths.",
    "Ted Gill, President of Unknown Worlds, notes that the game has been continuously shaped and evolved going by feedback from the community of Steam Early Access players. Gill enthused: “After two years of implementing player feedback and adding new features and content, we’re excited to welcome players back to the depths of Planet 4546B to find an all-new experience on PC and console.”",
    "The original Subnautica makes the cut for our roundup of the best survival games, not least because it offers such a polished and compelling survival experience."
  ],
  "headers": {
    "4": "Nice and icy"
  },
  "links": {
    "Steam": "https://www.techradar.com/news/the-best-steam-games",
    "Xbox Series S|X": "https://www.techradar.com/news/xbox-series-x-vs-xbox-series-s-which-xbox-will-be-right-for-you",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "roundup of the best survival games": "https://www.techradar.com/news/best-survival-games"
  }
}