{
  "source": "https://www.techradar.com/news/amd-ryzen-5700g-could-let-you-build-a-console-like-gaming-pc-without-needing-a-gpu",
  "title": "AMD Ryzen 5700G could let you build a console-like gaming PC without needing a GPU",
  "category": "computing",
  "updated": "2021-06-02T10:55:45Z",
  "author": "jess-weatherbed",
  "summary": "Who needs dedicated graphics anyway?",
  "article": [
    "We reported recently that AMD’s Ryzen 7 5700G and Ryzen 5 5600G, two desktop APUs (accelerated processing units) from the Cezanne family, were exclusively available to the OEM (original equipment manufacturer) market. Team Red has since announced during its Computex 2021 keynote that the products will soon also be available to DIY PC builders on August 5. The Ryzen 5000G series was announced back in April 2021, with the 'G' in the name representing integrated graphics. This could be great news for anyone wanting to create mini-PC builds without the need for a dedicated GPU, with AMD claiming that both APUs are capable of running most games at 1080p, though we'd need more benchmarks to see what real-world performance actually looks like across various titles.",
    "We did get a glimpse of what these two APUs are capable of in leaked benchmarks, supposedly using an early engineering sample of the Ryzen 7 5700G. The results look promising, with the Core i9-11900K defeated by the Ryzen 7 5700G in multi-threaded performance, and the Ryzen 5 5600G proved to be faster than the Core i7-10700K in single-threaded performance despite a lower clock speed. With both APUs coming to retail soon, we should start to see more official benchmarks appear which will have better reliability than engineering samples however, so don't put too much faith in those early results just yet.",
    "The flagship Ryzen 7 5700G will retail for around $359 (around £250, AU$460), which was on the lower end of our initial estimates, and will feature eight cores and 16 threads, with clock speeds currently reported at 3.8 GHz base and a 4.6 GHz boost. the total power draw (or TPD) is being set at 65W and the integrated Vega GPU has eight compute units or 512 stream processors running at 2.0 GHz.",
    "The Ryzen 5 5600G is a little cheaper at $259 (around £180, AU$335) and has six cores and 12 threads, with a base clock speed of 3.9 GHz and a boost clock speed of 4.4 GHz. The integrated graphics on this should be a little lower, with a Vega 7 clocked at 1,900 MHz. In a blow to Intel yet again, AMD showcased the integrated Vega graphics to be 2.45 times faster than those on the Xe graphics featured on Rocket Lake desktop CPUs. Team red has been rolling with the punches against Team Blue recently, and at this pricepoint AMD has a viable solution to the ongoing GPU shortage for anyone looking to build a budget miniature gaming rig. Success will be reliant on stock availability of course, which AMD has had difficulty with due to the rocketing demand for Ryzen CPUs and global silicon shortages, but the affordability of these all-in-one chips could make DIY PC gaming builds affordable again if the inventory is sufficient.",
    "Via TomsHardware"
  ],
  "headers": {
    "2": "The APU doesn't fall far from the Zen 3"
  },
  "links": {
    "reported recently": "https://www.techradar.com/news/ryzen-7-5700g-and-ryzen-5-5600g-cezanne-benchmarks-should-concern-intel",
    "Ryzen 7 5700G": "https://www.techradar.com/news/amd-ryzen-7-5700g-leak-suggests-a-seriously-promising-8-core-apu",
    "Computex 2021 keynote": "https://www.techradar.com/how-to/how-to-watch-the-amd-computex-2021-keynote-will-we-finally-see-big-navi-gaming-laptops",
    "Ryzen 5000G series": "https://www.techradar.com/news/amd-ryzen-5000g-processors-are-official-but-you-wont-be-able-to-buy-one",
    "Core i7-10700K": "https://www.techradar.com/news/intel-core-i7-10700k-vs-intel-core-i7-9700k-how-does-intels-10th-gen-chip-stack-up",
    "ongoing GPU shortage": "https://www.techradar.com/news/whats-the-point-of-releasing-new-gpus-if-nobody-can-actually-buy-them",
    "demand for Ryzen CPUs": "https://www.techradar.com/news/amd-ryzen-5000-restock-should-improve-soon-heres-when",
    "TomsHardware": "https://www.tomshardware.com/news/amds-ryzen-cezanne-apus-coming-to-retail-for-desktop-pcs"
  }
}