{
  "source": "https://www.techradar.com/news/the-surface-laptop-4-comes-with-free-surface-earbuds-but-not-for-long",
  "title": "The Surface Laptop 4 comes with free Surface Earbuds - but not for long",
  "category": "computing",
  "updated": "2021-04-14T14:33:51Z",
  "author": "tabitha-baker",
  "summary": "Offer ends April 15",
  "article": [
    "The brand new Surface Laptop 4 is now up for grabs, and if you order before tomorrow, April 15, you can bag free Surface Earbuds at the same time. That's an excellent promotion considering these true wireless earbuds usually go for $199.99.",
    "Microsoft has been running this offer itself, however, we'd recommend heading to Best Buy right now. You'll find the same freebie available, but Best Buy has a much wider range of configurations still in stock.",
    "Starting at $999.99 for a Ryzen 5 / 256GB SSD configuration, the Surface Laptop 4 isn't cheap. However, if you're a fan of Microsoft's polished ultrabooks, you'll find plenty to get excited about in this premium chassis. From new 11th generation Tiger Lake Intel processors to an impressive 19-hour battery life and a price that remains competitive with the previous generation, there's plenty more value in the recent release.",
    "Both Best Buy and Microsoft are shipping free Surface Earbuds with the new Surface Laptop 4. However, Microsoft has set an end date of April 15 for this promotion. We don't know whether Best Buy will play by the same book here, so to be safe, we'd recommend grabbing it sooner rather than later.",
    "The Surface Earbuds you'll also receive in this deal offer premium custom-tuned drivers with up to 24 hours of battery life and excellent integration with digital assistants. There's a big focus on productivity here, with dictation features that work natively with the Microsoft suite of office apps and even PowerPoint integrations as well.",
    "Not in the US? Scroll down for more laptop deals in your region.",
    "If you're looking for something a little more flexible, we see regular Surface Pro 7 deals offering bundle discounts on the tablet and a Type Cover keyboard as well. Or, for something even cheaper take a look at the latest Surface Go deals. Not sure about Microsoft's premium pricing? Check out the latest Dell laptop deals for cheaper alternatives."
  ],
  "headers": {
    "6": "More Surface Laptop 4 deals"
  },
  "links": {
    "Microsoft has been running this offer itself": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1119483958235663900&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fstore%2Fconfigure%2FSurface-Laptop-4%2F946627FB12T1",
    "much wider range of configurations": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1031710797343268100&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fpromo%2Fnew-surface-family&article_name=The%20Surface%20Laptop%204%20comes%20with%20free%20Surface%20Earbuds%20-%20but%20not%20for%20long&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-surface-laptop-4-comes-with-free-surface-earbuds-but-not-for-long",
    "Starting at $999.99": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-3142613914712980500&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fmicrosoft-surface-laptop-4-13-5-touch-screen-amd-ryzen-5-surface-edition-8gb-memory-256gb-ssd-latest-model-platinum%2F6455189.p&article_name=The%20Surface%20Laptop%204%20comes%20with%20free%20Surface%20Earbuds%20-%20but%20not%20for%20long&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-surface-laptop-4-comes-with-free-surface-earbuds-but-not-for-long",
    "laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "Surface Pro 7 deals": "https://www.techradar.com/deals/surface-pro-deals-bundles",
    "Surface Go deals": "https://www.techradar.com/news/microsoft-surface-go-deals-prices",
    "Dell laptop deals": "https://www.techradar.com/news/dell-laptop-deals"
  }
}