{
  "source": "https://www.techradar.com/news/chinese-government-orders-90-apps-removed-in-data-collection-crackdown",
  "title": "Chinese government orders 90 apps removed in data collection crackdown",
  "category": "computing",
  "updated": "2021-05-17T14:51:21Z",
  "author": "mayank-sharma",
  "summary": "Removed apps include several official and popular Chinese platforms",
  "article": [
    "China has asked domestic app stores to delist some 90 mobile apps that were found to violate its new user data collection policy.",
    "The crackdown follows the implementation of steps that were floated by the country’s top regulators to dissuade mobile app developers from collecting excessive details about their users.",
    "China’s Ministry of Industry and Information Technology (MIIT) said that the apps had been taken offline for an indefinite period. Meanwhile, users who already have the apps installed can continue to use them.",
    "Besides violating the new policy’s user data collection norms, China has also accused the apps of several other wrongdoings.",
    "It found the apps were “requesting user authorization in a compulsory, frequent and excessive manner”. Furthermore, the apps were found to misuse the collected information to direct targeted promotions at its users. Some apps were even called out for “misleading users to download the app.”",
    "Surprisingly, the list includes official apps of some of the most well-known and widely-used reputable platforms, including the popular online ticket booking platform Damai, and the online travel booking app, Tuniu.",
    "The official app of China’s biggest LinkedIn rival Maimai has also been deplatformed, and so has Tianya, an online community for people to share views and ideas.",
    "Some of these apps are alleged to have committed the misconduct “repeatedly.”",
    "Two of the apps, namely Maimai and Tianya, have publicly apologized for their data collection policies and claim to be working to rectify the apps and get them listed again.",
    "Via South China Morning Post"
  ],
  "headers": {
    "5": "Popular apps"
  },
  "links": {
    "mobile apps": "https://www.techradar.com/best/best-android-apps-2021",
    "implementation of steps": "https://www.techradar.com/news/china-is-apparently-easing-up-on-collecting-mobile-app-data",
    "mobile app developers": "https://www.techradar.com/best/best-mobile-app-development-software",
    "South China Morning Post": "https://www.scmp.com/tech/policy/article/3133493/beijing-removes-90-apps-crackdown-information-collection-flexing-new"
  }
}