{
  "source": "https://www.techradar.com/news/nubia-red-magic-6-gaming-phone-price-and-release-date-confirmed",
  "title": "Nubia Red Magic 6 gaming phone release date and price confirmed",
  "category": "phones",
  "updated": "2021-03-16T14:03:33Z",
  "author": "axel-metz",
  "summary": "Magic in the air",
  "article": [
    "Having revealed its latest series of gaming phones in China earlier in March, Nubia has announced the US and UK prices and release dates for the Red Magic 6 and Red Magic 6 Pro.",
    "Both devices will be available to pre-order globally from April 9 before going on general sale on April 15. The Red Magic 6 is set to cost $599 / £509 (around AU$775), with the Red Magic 6 Pro priced slightly higher at $699 / £599 (around AU$900).",
    "Interestingly, each model will only come in one color variant and with one memory option, respectively. The Red Magic 6 will ship in the Eclipse Black color and come with 12GB RAM and 128GB of storage, while the Pro will arrive in Moon Silver with 12GB RAM and 256GB. At least you won’t be spoilt for choice.",
    "The Nubia Red Magic 5G topped our list of the best gaming phones for quite some time, so we’re excited to see how this next-gen model ranks among the other big-hitters on the market in 2021.",
    "For the most part, the Nubia Red Magic 6 and Red Magic 6 Pro are similar phones.",
    "They’re both equipped with an impressive Qualcomm Snapdragon 888 chipset – the newest and most powerful Android chipset to date – as well as a 6.8-inch AMOLED screen that looks perfect for gaming. They’ll also mark the first smartphones to have 165Hz refresh rate displays, beating the 144Hz a few top gaming phones use currently, meaning gameplay will likely feel smoother than ever before on a mobile device.",
    "The main differences lie in their aforementioned storage capacities and colors, as well as battery sizes. The Red Magic 6 will come with a 5,050mAh battery and snappy 66W charging, which Nubia says will power up the phone in an impressive 38 minutes. The Red Magic 6 Pro, though, goes one better with its faster 120W charging capabilities, despite a smaller 4,500mAh battery.",
    "Another notable difference is a seemingly-improved cooling system in the Pro model, which will presumably better prevent overheating during long gaming sessions. That by no means indicates that the standard model will be prone to overheating, though, just that its more premium sibling will be slightly better equipped in that department.",
    "When the Red Magic 6 and Red Magic 6 Pro were first announced, we couldn’t wait to get our hands on what look to be a mightily impressive pair of gaming smartphones. Now, with an April release date in the diary, we won’t have to wait much longer."
  ],
  "headers": {
    "4": "Brothers in arms"
  },
  "links": {
    "latest series": "https://www.techradar.com/news/the-first-gaming-phone-of-2021-is-here-and-it-has-a-seriously-impressive-screen",
    "gaming phones": "https://www.techradar.com/news/best-phone-for-gaming",
    "Nubia Red Magic 5G": "https://www.techradar.com/reviews/nubia-red-magic-5g",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888"
  }
}