{
  "source": "https://www.techradar.com/news/that-pink-iphone-13-would-be-great-but-why-do-premium-phones-always-miss-out",
  "title": "That pink iPhone 13 would be great - but why do premium phones always miss out?",
  "category": "phones",
  "updated": "2021-05-29T06:00:12Z",
  "author": "james-rogerson",
  "summary": "Opinion: I see a black phone and I want it painted red",
  "article": [
    "It’s a well known fact in phones that only budget buyers want colorful handsets. This of course isn’t true, but you’d be forgiven for thinking it was based on the state of the smartphone scene, a state that I can’t help thinking about – and puzzling over – now that there’s talk of a pink iPhone 13 Pro Max.",
    "A Twitter account (and phone shop) called Peng Store tweeted that a rose pink iPhone 13 Pro Max will land in December. It’s a claim that’s deeply suspect – not least because the attached render is a fan-made one from Instagrammer Ali Sayed Ali, and it predates this leak.",
    "December also seems late for an iPhone 13 model to launch, but perhaps the biggest reason I’m skeptical of this is simply that Apple doesn’t typically use bright colors for its premium phones. The iPhone 12 Pro and iPhone 12 Pro Max for example are available in black, silver, gold and pacific blue shades – with those latter two being understated.",
    "Yet Apple isn’t afraid of using bright or unusual colors on its other phones. Beyond the boring colors, the iPhone 12 and iPhone 12 mini are available in bright purple and red shades, along with a snazzy green. The iPhone SE (2020) too can be purchased in a bright red.",
    "So while I’m not sold on this rumor, I also wouldn’t be totally surprised if the iPhone 13 came in pink – but I would be surprised if the iPhone 13 Pro or Pro Max did.",
    "And this isn’t exclusively an Apple issue. Want a Samsung Galaxy S21 Ultra? Your color choices are black or silver (or a small selection of similarly smart additional shades if you buy it direct from Samsung). Yet the standard Samsung Galaxy S21 comes in pink and violet options, and if you move further down into, say, the Samsung Galaxy A range, you have a similarly vibrant selection of colors for many models.",
    "The same can be seen to a lesser extent with OnePlus – while for the most part the brand focuses on subtle shades, the mid-range OnePlus Nord can alternatively be had in a bright ‘Blue Marble’. And it’s a similar story with other brands – not all of them all the time, but enough for there to be a definite pattern.",
    "What I don’t understand though, is why. Having lots of money doesn’t make someone less interested in garish gadgets – you only have to look at how Donald Trump decorates for evidence of that.",
    "Appreciating or desiring high-end tech doesn’t make you allergic to color either – I definitely fall into that category, and a couple of phones back I had an Honor 10 in large part because of the flashy blue color scheme I could get it with.",
    "So I’m stumped as to why this isn’t more often an option at the high end. Sure, not everyone will want a phone that shines like the sun, but options are always appreciated, especially when you’re paying that much money.",
    "So I – like apparently many, many other people – hope Apple does make a pink iPhone 13, but what I really hope is that the color is available across the whole range."
  ],
  "headers": {
    "7": "Bring on the brightness"
  },
  "links": {
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13",
    "Peng Store": "https://twitter.com/PengPhones/status/1389865175667331074",
    "Ali Sayed Ali": "https://www.instagram.com/p/CK61VNggcyK/",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Honor 10": "https://www.techradar.com/reviews/honor-10-review",
    "many, many other people": "https://www.cnet.com/news/the-aesthetic-iphone-trend-continues-people-really-want-a-pink-iphone-13/"
  }
}