{
  "source": "https://www.techradar.com/news/4-things-wed-like-to-see-from-the-sequel-to-cities-skylines",
  "title": "4 things we’d like to see from the sequel to Cities: Skylines",
  "category": "computing",
  "updated": "2021-09-03T15:43:19Z",
  "author": "jamel-smith",
  "summary": "Prepare to spend another 100 hours solving traffic issues in a virtual city",
  "article": [
    "It’s been six years since the release of arguably the greatest city-building game of all time: Cities: Skylines. Developer Colossal Order created a beloved city-builder that’s amassed a huge fan base – on Steam, Cities: Skylines still garners around 16,000 current players per day – and those fans are now eagerly awaiting the announcement of a sequel.",
    "There was speculation that we’d get an announcement about the rumored sequel at the recent PDXCon- which is the Cities: Skylines publisher: Paradox Interactive's own convention- but that didn’t happen. We can now only hope there will be some form of an announcement soon.",
    "Cities: Skylines is probably one of the best simulation games we’ve ever played but improvements could be made, and new features added, that would make the sequel the ultimate GOAT of PC simulation games. And having spent more than 200 hours in Cities: Skylines tinkering with our city’s road and transport networks – and tormenting the civilians of our city to see if they could survive a tsunami – we’re well placed to talk about four things we’d like to see from the sequel.",
    "It’s quite well known that Cities: Skylines isn’t a very well-optimized game – many players have likely seen framerate drops and stutters when their cities have reached a 100,000 population. For example, our largest city, with a 200,000 population, is virtually unplayable with a framerate that reaches an average of 20fps, and even scaling back the graphics quality to low hasn’t improved the performance. The sequel needs to support the simulation of dense cities with larger populations.",
    "Fans have largely assumed that the Unity engine running Cities: Skylines is to blame for the lackluster optimization. But Unity is constantly upgraded year on year, and the Unity engine of 2021 is much better than the Unity engine of 2015 used to make Cities: Skylines, so we should see better optimization for the next Cities: Skylines if Colossal Order carries on using Unity. That said, and while it’s unlikely, we could see Colossal Order scrap using Unity and use a whole new engine for the sequel.",
    "Many fans thought mods would be released for Cities: Skylines to enable more in-depth economic and political systems, effectively adding aspects of Democracy 4 to Cities: Skylines. That hasn’t happened, though, and we don’t think anyone would want to see the convoluted political systems of Democracy 4 incorporated into Cities: Skylines.",
    "But many fans would like to see more complex economic and political systems in the sequel to Cities: Skylines that will impact their cities in various ways – for example, letting us manage events budgets and trade, and in the event of a freak disaster giving us more granular control over the recovery process.",
    "One glaring omission from Cities: Skylines is seasons. The Cities: Skylines Snowfall DLC did implement a temperature gauge and winter maps, with winter maps requiring a superficial level of management, with hot water pipes having to be spread throughout cities. This DLC left us wanting more, with fans asking for seasons to be added to the vanilla game.",
    "The addition of seasons could introduce a number of new systems for players to manage. Cities would go through summer, spring, winter, and autumn, presenting players with season-specific issues to solve. For example, summer could see players required to pay to implement air conditioning in residential areas and on public transportation; or there could be an increase in weather-related disasters, with thunderstorms, hurricanes, and tornados impacting a city’s economy and population, requiring players to invest in adequate weather protection.",
    "Mods are an essential part of the Cities: Skylines experience. Like many players, we can’t see ourselves playing Cities: Skylines without the Traffic Manager or Network Extensions mods, which have fleshed out the game by providing more in-depth management of road systems. Cities: Skylines Youtuber and traffic expert Biffa always uses the Traffic Manager mod to solve the traffic problems in cities sent to him by his viewers.",
    "Fans would love to see Cities: Skylines implement these fan-favorite mods into the Cities: Skylines vanilla game, and Colossal Order does have a track record of doing this with particular features. In a free update, it added the option to remove and add traffic lights at intersections, an option that was introduced in the Traffic Manager mod, and it’s likely we’ll see Colossal Order add features of mods into the sequel.",
    "Lastly, a direct appeal to Colossal Order: please make sure that all the features and systems that are currently available in the vanilla version of Cities: Skylines will be included in the sequel’s base game. We don’t want to see key features from the original game missing from the sequel, only to later be added as DLCs, as we’ve seen with some other simulation games."
  ],
  "headers": {
    "3": "1. Better game optimization",
    "5": "2. Economy and politics",
    "7": "3. Seasons",
    "9": "4. Mods"
  },
  "links": {
    "PC simulation games": "https://www.techradar.com/news/best-simulation-games",
    "Traffic Manager": "https://steamcommunity.com/sharedfiles/filedetails/?id=1637663252",
    "Network Extensions": "https://steamcommunity.com/sharedfiles/filedetails/?id=812125426",
    "traffic expert Biffa": "https://www.youtube.com/watch?v=kbCrqN5ODx0"
  }
}