{
  "source": "https://www.techradar.com/news/pubg-could-be-going-free-to-play-according-to-leaker",
  "title": "PUBG could be going free-to-play, according to leaker",
  "category": "gaming",
  "updated": "2021-07-27T11:31:03Z",
  "author": "vic-hood",
  "summary": "PUBG could be getting a major shakeup",
  "article": [
    "PlayerUnknown's Battlegrounds (PUBG) could be going free-to-play in the future, a notable leaker has claimed.",
    "According to a tweet by PUBG leaker PlayerIGN (via GamesRadar), developer PUBG Corporation \"wants to go free-to-play\" and plans to \"track player responses\" to a (currently unannounced) free-to-play week for PUBG in August. These responses will apparently factor into whether this model will become permanent.",
    "The leaker also claims that the developer originally planned to change the battle royale to a free-to-play model back in 2019, just three years after its release, but didn't get the player response it wanted from a free-to-play test at the time.",
    "PlayerIGN is a well-known dataminer and has proved to be a pretty reliable PUBG leaker in the past, revealing features such as PUBG's clan system, before it was officially announced.",
    "However, it's worth noting that neither PUBG Corporation, or its parent company KRAFTON, Inc, has confirmed this is the case - nor has a PUBG free-to-play week been announced. TechRadar has contacted KRAFTON, Inc for comment on this story and we'll update you as soon as we get a response.",
    "It makes sense for PUBG to go free-to-play for a variety of reasons. While PUBG consistently remains one Steam's top games (in terms of concurrent players), the battle royale has seen a steady decline in its average and peak players on PC over the past few years. PUBG is still pulling in the figures, but nowhere close to how it used to.",
    "Going free-to-play would offer PUBG a new lease of life, likely resulting in an influx of new players. We've seen titles changing to a free-to-play model successfully before. CS:GO is a perfect example, which went free-to-play in late 2018 following waning numbers and now steadily remains Steam's most popular game. Or Destiny 2, which went free-to-play in 2019, asking players to only pay for any extra DLC they wanted.",
    "With PUBG 2 now rumored to be scrapped, and PUBG: New State set to improve the PUBG experience on mobile, the main (now almost five-year-old) game needs a bit of a shake-up if it wants to still compete with the likes of Call of Duty: Warzone, Fortnite and Apex Legends - and a free-to-play model could do that.",
    "It's also worth remembering that this isn't PUBG's first foray into free-to-play. PUBG Lite, a free-to-play (and less intensive) PC version of PUBG, was shut down in April by publisher KRAFTON, with little detail given as to why. Could it be that this version was shut down to pave the way for a more substantial free-to-play PUBG in the future? We can only speculate on this right now but it would make sense.",
    "PUBG is also available to download for Xbox Game Pass subscribers at no extra cost, which greatly contributed to the number of players engaged with the battle royale on console. This wide availability thanks to Game Pass could be another factor into PUBG's free-to-play considerations.",
    "However, there are issues with changing to a free-to-play mode. For one, those who bought the game at full price aren't likely to be pleased - something we saw with Destiny 2 - after all, why did they pay when others didn't?",
    "Another major concern for PUBG players appears to be cheaters, as an influx of new players will mean that more cheaters will inevitably get into the game - unless a considerable amount of extra moderators and a more robust report system is brought in.",
    "We're hoping that PUBG Corp has taken these elements into consideration if it does plan to follow through with its alleged plans to change to a free-to-play model. And, while PlayerIGN is a reliable leaker, it's still worth taking this rumor with a big pinch of salt."
  ],
  "headers": {
    "5": "Analysis: free-to-play PUBG would make sense"
  },
  "links": {
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
    "PlayerIGN": "https://twitter.com/PlayerIGN/status/1418897430859460613?s=20",
    "GamesRadar": "https://www.gamesradar.com/uk/pubg-going-free-to-play-claims-leaker/",
    "PUBG's clan system": "https://www.techradar.com/news/clans-could-be-coming-to-pubg-on-pc",
    "Steam's top games": "https://steamcharts.com/app/578080",
    "PUBG: New State": "https://www.techradar.com/news/pubg-mobile-new-state-release-date-price-trailer-and-everything-we-know-so-far",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}