{
  "source": "https://www.techradar.com/news/what-time-is-luca-released-on-disney-plus",
  "title": "What time is Luca released on Disney Plus?",
  "category": "entertainment",
  "updated": "2021-07-06T15:25:48Z",
  "author": "tom-power",
  "summary": "Luca has made a splash on Disney Plus",
  "article": [
    "Update: Luca, the 26th movie from animation studio Pixar, is now available to stream exclusively on Disney Plus. You can check out our review before diving in to watch it, or simply turn it on and enjoy the first summer-themed movie of the year.",
    "Original story follows.",
    "Luca, Pixar's latest animated feature film, will arrive on the streamer on Friday, June 18.",
    "Set in the fictional seaside town of Portorosso, the film tells the tale of Luca (Jacob Tremblay), a shy teenage boy who begins to experience life to the fullest when he meets the confident and brave Alberto (Jack Dylan Grazer).",
    "The duo, though, will have to keep their wits about them in Portorosso. Luca and Alberto are actually sea monsters who, while they can disguise themselves as humans on land, don't blend in well with their surroundings – and Portorosso's inhabitants are suspicious of anyone who doesn't fit in.",
    "If Pixar's latest flick sounds intriguing to you (or if you're just a big Pixar fan who can't wait for it to arrive), you'll want to know when its release time is.",
    "Below, you'll find out when Luca launches in your world region. We've also covered whether it'll be free to watch on Disney Plus and if it'll be getting a theatrical release, too.",
    "Luca is set to arrive on Disney Plus on Friday, June 18 at 12AM PT/ 3AM ET/ 8AM BST/ 7PM AEST.",
    "As has become the norm for US Disney Plus subscribers, you'll need to stay up past midnight if you want to catch Luca as soon as it lands on the streaming platform. The film is 90 minutes long, so you won't have to settle in for a three-hour movie marathon if you decide to stay awake.",
    "UK and Australian subscribers, though, will have a better time of it. Luca lands on UK shores on Friday morning, while Australian fans can settle in to watch Luca on Friday evening. Make sure you have some Italian-themed snacks to go alongside your watch parties.",
    "Yes. Luca will be free to watch to all Disney Plus subscribers when it arrives on Friday, June 18.",
    "Unlike other Disney Plus movies, such as Raya and the Last Dragon or Marvel's upcoming Black Widow movie, Luca won't be a Premier Access title.",
    "That means you won't have to pay $29.99/ £19.99/ AUS$34.99 when it launches later this week. It also means that Pixar fans won't have to wait three months for Luca to become freely available on Disney Plus, too.",
    "Luca will only get an international theatrical release in countries that Disney Plus isn't currently available in (per Deadline).",
    "However, official launch dates for these countries are yet to be announced, so Luca may not arrive in theaters in certain nations on Friday, June 18.",
    "Those countries include Thailand, Hong Kong, Macau, the Philippines, South Korea, Taiwan and much of Eastern Europe. Disney Plus will arrive in Thailand on June 30 (it's unclear if Luca will be available here on that date), while Eastern Europe and the other Asian nations listed are set to receive the streamer later in 2021.",
    "For now, Pixar fans in these nations will have to keep their eyes on Pixar's social media channels to find out when Luca is available to watch in theaters."
  ],
  "headers": {
    "7": "When is Luca coming to Disney Plus?",
    "10": "Is Luca going to be free on Disney Plus?",
    "13": "When is Luca coming out in theaters?"
  },
  "links": {
    "Luca": "https://www.techradar.com/news/luca-on-disney-plus-is-the-nostalgic-pixar-fantasy-movie-to-get-you-ready-for-summer",
    "our review": "https://www.techradar.com/news/luca-on-disney-plus-is-the-nostalgic-pixar-fantasy-movie-to-get-you-ready-for-summer",
    "Raya and the Last Dragon": "https://www.techradar.com/reviews/raya-and-the-last-dragon",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Deadline": "https://deadline.com/2021/03/black-widow-cruella-disney-plus-theaters-day-and-date-release-1234720116/",
    "on June 30": "https://www.reuters.com/business/media-telecom/disney-misses-quarterly-revenue-estimates-shares-fall-2021-05-13/"
  }
}