{
  "source": "https://www.techradar.com/news/2022-could-be-the-year-of-8k-monitors-heres-why",
  "title": "2022 could be the year of 8K monitors: Here’s why",
  "category": "computing",
  "updated": "2021-11-14T04:57:05Z",
  "author": "desire-athow",
  "summary": "Exclusive: Fast cards, high-octane displays, what’s not to like",
  "article": [
    "The first 8K monitor to launch was the Dell UltraSharp UP3218K 8K back in May 2017, nearly five years ago. It remains the only one of its category with an extremely high price tag (several thousand dollars/pounds) and lacking newer technology, like HDMI 2.1.",
    "This may all change in 2022 though. TechRadar Pro contacted a number of monitor vendors - and Dell rivals - that have confirmed plans to release 8K - and/or 5K monitors - in 2022.",
    "A spokesperson for Benq said their models are likely to arrive in Q2 2022 at the earliest while NEC - reinforced by its partnership with Sharp - confirmed that 8K displays are on its future roadmap.",
    "Another major monitor vendor, Viewsonic, confirmed that 8K monitors will be launched next year while Hannspree said that models launched are likely to be bigger than current models.",
    "Perhaps the most exciting of all the statements is one from Monoprice who said that they \"are currently looking into key new technologies such as OLED, mini-LED and higher resolution panels for future development of the Dark Matter Series. We expect to see some of these new products start rolling out as early as next year.\"",
    "None of the manufacturers confirmed the screen size of their future models or pricing, but we expect a hefty price tag, as the new products will target users looking for large format display, monitors for video editing and monitors for photo editing.",
    "Other companies we got in touch with (MSI, Lenovo, Asus and HP) have yet to confirm whether they will still go ahead with displays with 5K or 8K screen resolutions. IIyama has no plans for 8K monitors in 2022 while Dell told us that it wouldn’t comment on future product releases.",
    "Despite 8K video editing being touted as the next big thing with 8K TV and 8K video recording now hitting the mainstream, 8K screens have been left out.",
    "Even Apple is still sticking with lower resolutions, much to the chagrin of creative professionals worldwide, despite having one of the fastest mobile workstations in the world, the MacBook Pro 16-inch.",
    "While using 8K television sets (like the LG 55NANO956) is an option, the lack of advanced features limits their usefulness to the target audience. So while traders or number crunchers will not scoff at viewing data spread over more than 33 million pixels, others will consider the poor color accuracy, the size (starting from 55-inch) or absence of fine tuning options as major deal-breakers.",
    "Since the launch of the emblematic UP3218K, a number of trends and new technologies have been deployed en masse that should make 8K mainstream in 2022.",
    "A new interface (HDMI 2.1) can be found even in laptops (even sub-$1000 ones) while the number of discrete GPUs that are powerful enough to take on a display that’s equivalent to 16 full HD panels is increasing.",
    "2022 will also - hopefully - be the year where the current global supply chain problems will go away bringing prices down while more video editing software developers will add 8K video compatibility to their products.",
    "Other improvements we expect to see in 2022 are the native support for 8K-over-HDMI for onboard graphics (given the lesser appeal of DisplayPort as a universal video connector) and more widespread availability of Thunderbolt 4 both on laptops and desktop PCs."
  ],
  "headers": {
    "5": "Coming soon?",
    "10": "Nvidia, Intel and AMD embracing 8K"
  },
  "links": {
    "8K monitor": "https://www.techradar.com/best/best-5k-and-8k-monitors",
    "Dell UltraSharp UP3218K 8K": "https://www.techradar.com/reviews/dell-ultrasharp-up3218k",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "large format display": "https://www.techradar.com/news/large-format-displays",
    "monitors for photo editing": "https://www.techradar.com/news/best-monitor-for-photo-editing",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "mobile workstations": "https://www.techradar.com/news/best-mobile-workstations",
    "MacBook Pro 16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "LG 55NANO956": "https://www.techradar.com/news/should-i-buy-a-55-inch-8k-tv",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "video editing": "https://www.techradar.com/best/free-video-editing-software",
    "desktop PCs": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391"
  }
}