{
  "source": "https://www.techradar.com/news/edge-is-going-to-make-it-easier-to-saving-money-shopping-on-your-phone",
  "title": "Microsoft Edge's new money-saving feature might make you ditch Chrome",
  "category": "phones",
  "updated": "2021-05-11T15:07:20Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Microsoft's browser will automatically cut your shopping cart bill",
  "article": [
    "Microsoft is adding an option to Microsoft Edge that will show available coupons for discounts when you're shopping online.",
    "We all like the idea of a bargain, and online shopping has made it easier than ever to find a great deal on just about anything you might want to buy. Price comparison sites are handy in tracking down the best price, but there are also great savings to be made by using coupons.",
    "There are sites (some of which you have to pay to use) that will let you know about all of the latest money-saving coupons that you can use to slash the price of your online shopping. There are also free sites, but these can be a little unreliable. But soon Microsoft Edge will be able to help you reduce the cost of your shopping.",
    "In the latest Canary build of Edge 92 for Android, there's an experimental setting called Shopping Site Coupons. You can probably guess what this does – it lets you know when money-saving coupons are available for the online store you are shopping at.",
    "But the feature goes a little beyond this. More than just letting you know that you could save money, the browser will automatically apply any available coupons and voucher codes so savings are applied without any extra work from you.",
    "The system works in a similar way to money-saving browser extensions like Honey. This feature, however, is specific to the Android version of Microsoft Edge and does not require you to install any add-ons or extensions. It's not clear at the moment whether Microsoft intends to bring the same feature to the desktop version of Edge, but time will tell.",
    "If you would like to try out the feature for yourself, you will need to install the latest version of Edge Canary. You can then use the following steps to enable coupons:",
    "When you visit a supported shopping site, you'll wee a new icons in the address bar letting you know that there is a coupon available. Tap the icon for more details and you'll see a list of all available coupons, which you can then apply with a further tap.",
    "Via XDA Developers"
  ],
  "headers": {
    "5": "Mobile money saving"
  },
  "links": {
    "install the latest version of Edge Canary": "https://play.google.com/store/apps/details?id=com.microsoft.emmx.canary",
    "XDA Developers": "https://www.xda-developers.com/microsoft-edge-android-save-money/"
  }
}