{
  "source": "https://www.techradar.com/news/amd-promises-itll-sort-graphics-card-stock-shortages-this-year",
  "title": "AMD promises it’ll sort graphics card stock shortages this year",
  "category": "gaming",
  "updated": "2021-04-29T08:56:31Z",
  "author": "darren-allan",
  "summary": "AMD Radeon RX 6000 GPU sales will ‘grow significantly’ as the year goes on",
  "article": [
    "AMD is promising that more Big Navi graphics cards will be available to buy as 2021 rolls on, PC gamers hunting for a new GPU will be glad to hear.",
    "In AMD’s latest earnings call, chief executive Lisa Su explained that: “We expect Radeon 6000 Series GPU sales to grow significantly over the coming quarters as we ramp production.",
    "“We see good customer ordering patterns and strong backlog. And then we have also seen that the supply chain has been tight overall for the semiconductor industry. And we’ve been working very closely with our supply chain partners. And so we also have good visibility to additional supply as we go throughout the year.”",
    "She added that “we believe there’s strong demand, and we’re continuing to ramp supply to meet that.”",
    "We don’t think anyone is disputing the strong demand – for both AMD and Nvidia cards – but it’s certainly good to hear that AMD sounds confident enough that additional supply of Big Navi graphics cards is indeed in the pipeline. Even if some gamers are already thoroughly disillusioned with the GPU market these days…",
    "The RX 6000 range currently consists of the Radeon RX 6800 and RX 6800 XT, plus the beefy RX 6900 XT, along with AMD’s more recent addition, the more affordable (relatively speaking) RX 6700 XT.",
    "In other recent news, owners of RX 6800 models and RX 6900 XT GPUs will reportedly find the latest graphics driver from AMD has implemented something of a stealth upgrade, taming power consumption somewhat in certain scenarios, and allowing for cooler and quieter running.",
    "That new driver also brought in the ability to play local co-op games remotely, another nifty bonus (although note that all participants must have an AMD graphics card, which isn’t the case with the likes of Steam’s similar Remote Play tech, introduced some time ago).",
    "Via Wccftech"
  ],
  "headers": {
    "4": "Comforting words"
  },
  "links": {
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Big Navi graphics cards": "https://www.techradar.com/news/amd-big-navi",
    "RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "RX 6900 XT": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
    "RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "allowing for cooler and quieter running": "https://www.techradar.com/news/amd-has-a-surprise-upgrade-for-some-big-navi-gpus-in-latest-graphics-driver",
    "ability to play local co-op games remotely": "https://www.techradar.com/news/amd-now-lets-windows-10-gamers-with-radeon-gpus-play-local-co-op-remotely",
    "Wccftech": "https://wccftech.com/amd-promises-increase-radeon-rx-6000-rdna-2-graphics-card-supply-ramp-production/"
  }
}