{
  "source": "https://www.techradar.com/news/new-nvidia-quadro-rtx-cards-found-online",
  "title": "New Nvidia Quadro RTX cards found online",
  "category": "computing",
  "updated": "2021-03-24T21:23:36Z",
  "author": "john-loeffler",
  "summary": "Professional grade graphics cards incoming",
  "article": [
    "Two new professional-grade RTX graphics cards from Nvidia, the RTX A5000 and RTX A4000, have been spotted in an online OpenCL certification document, suggesting Nvidia may be close to bringing the new cards to market.",
    "The two cards, first flagged by Twitter user @KOMACHI_ENSAKA, appeared on the Khronos Group's OpenCL conformant products page, listing several Nvidia products certified for OpenCL 1.2, including Quadro RTX A5000 and Quadro RTX A4000 graphics cards, which have not yet been announced by Nvidia.",
    "As Tom's Hardware notes, this certification step is a good sign that Nvidia is getting ready to announce these cards and release them commercially. Nvidia submitted the graphics cards to Khronos Group a little over a month ago, so they are most likely ready to ship.",
    "Interestingly, these cards were submitted under the Quadro branding, which Nvidia announced late last year that they would be moving away from for their professional cards. The RTX A6000, for example, does not carry the Quadro name in-market, but is still listed as a Quadro card in the Khronos Group certification.",
    "We don't know anything about specs so far, since neither card has been announced yet, but the RTX A6000 is built on the GA102 GPU with 10,752 CUDA cores and 48GB VRAM so the two new cards are likely to be powered by the GA104 chip, with the A4000 possibly using the GA106, and both are likely to have less VRAM.",
    "With certifications already being posted, we'll likely hear more about the two cards in the coming weeks as they get closer to release. We'll have to wait until then for full details, but we'll be keeping an eye on these two cards for more news."
  ],
  "headers": {},
  "links": {
    "@KOMACHI_ENSAKA": "https://twitter.com/KOMACHI_ENSAKA/status/1374438927562539011?s=20",
    "conformant products page": "https://www.khronos.org/conformance/adopters/conformant-products/opencl#submission_356",
    "Tom's Hardware": "https://www.tomshardware.com/news/nvidia-rtx-a5000-rtx-a4000-spotted",
    "RTX A6000": "https://www.techradar.com/news/nvidia-launches-ampere-for-graphics-professionals-rtx-a40-and-rtx-a6000-cards"
  }
}