{
  "source": "https://www.techradar.com/news/a-risc-v-raspberry-pi-rival-is-about-to-hit-the-market",
  "title": "A RISC-V Raspberry Pi rival is about to hit the market",
  "category": "computing",
  "updated": "2021-12-01T19:06:20Z",
  "author": "mayank-sharma",
  "summary": "The VisionFive V1 is everything the BeagleV was supposed to be",
  "article": [
    "Shanghai-based StarFive has announced a new single-board computer (SBC) based on the RISC-V architecture, which is being touted as the spiritual replacement for the cancelled BeagleV.",
    "StarFive hails the upcoming VisionFive V1 as the world's first generation of affordable RISC-V boards designed to run Linux, just as it did with BeagleV at the start of the year, before shelving the project in July.",
    "“VisionFive pushes open source to the next level and gives developers more freedom and power to innovate and design industry-leading solutions,” said StarFive.",
    "Although StarFive hasn’t yet announced a release date, according to Liliputing, the VisionFive V1 will retail for $149.",
    "The SBC, which measures slightly larger than the Raspberry Pi 4, will be powered by the 1.5 GHz dual-core SiFive U74 RISC-V processor, together with 8GB of LPDDR4 RAM. There’s a micro SD card slot for storage, HDMI 1.4, gigabit Ethernet, 3.5mm audio out, 4 x USB 3.0 Type-A ports, and a Type-C for power.",
    "There's also Wi-Fi 4 and Bluetooth 4.2, and the board features a 40-pin GPIO header along with two MIPI connectors for connecting compatible cameras and other accessories.",
    "Liliputing says the board will ship with support for Fedora Linux, as well as other operating systems including Yocto, Buildroot, FreeRTOS, and Zephyr. The distro reportedly plans to add support for other operating systems in the future. Also on the horizon is a quad-core variant, the VisionFive V2, though we’ll wait for V1 to hit the shelves before getting too excited."
  ],
  "headers": {
    "3": "Well-stocked"
  },
  "links": {
    "RISC-V": "https://www.techradar.com/news/risc-v-breaks-into-the-mainstream-to-go-toe-to-toe-with-arm",
    "BeagleV": "https://www.techradar.com/news/heres-a-new-well-stocked-risc-v-raspberry-pi-challenger",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "developers": "https://www.techradar.com/news/best-laptop-for-programming",
    "Liliputing": "https://liliputing.com/2021/11/visionfive-v1-is-a-risc-v-single-board-pc-picks-up-where-the-beaglev-left-off.html",
    "Raspberry Pi 4": "https://www.techradar.com/reviews/raspberry-pi-4-model-b",
    "micro SD card": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards"
  }
}