{
  "source": "https://www.techradar.com/news/apple-glass-ar-could-create-holograms-of-virtual-objects",
  "title": "Apple Glass AR could create holograms of virtual objects",
  "category": "wearables",
  "updated": "2021-03-23T15:30:46Z",
  "author": "hamish-hector",
  "summary": "A little less virtual",
  "article": [
    "Apple Glass may use holograms to make virtual objects appear as if they are in the real world. That’s according to a proposed patent design that would have the holograms projected onto the headset’s lenses to create 3D virtual content that would be adjusted in real-time for a user",
    "This news has come courtesy of a recently granted US patent, which shows how cameras on the Apple Glass could record the real world around the wearer and then use that information to create realistic holograms. The patent also focuses on ensuring that cameras and holograms would not disrupt the wearer’s view.",
    "As you can imagine, it appears the design does have some restrictions though. These holograms will only be perceptible to someone wearing the Apple Glass headset — this patent does not suggest Apple Glass will be able to create 3D objects that everyone can see – though you’d presume they could eventually be shared with fellow Apple Glass users.",
    "There’s a lot going on in the image above so let’s explain what each component means.",
    "The ‘scene cameras’ — there will be one for each eye — are effectively the Apple Glass' eyes, capturing the real world and locating specific points of reference. These images are analyzed by the ‘controller’, which can adjust what the wearer sees virtually based on where they are looking in real life. The ‘light engine’ is then a projector that will display holograms on the lens based on all of those inputs.",
    "The light beams on the diagram show how light from the holograms and the real world can reach a wearer’s eyes — represented by an ‘eye box’ in the diagram.",
    "In practical terms, what you’d experience doesn’t look too different from other AR headsets, like the HoloLens 2, but there are a couple of differences with this Apple Glass patent. Apple wants its device to look more like traditional glasses, and it’s looking to pull off its hologram display with only one lens screen — not multiple like HoloLens 2 and so brings to mind the ill-fated Google Glass.",
    "As with all patent news we have to remember that even if a patent is granted we might not ever actually see the technology hit the market. However, with how excitingly sci-fi holograms sound, we can’t help but speculate how they could be used in Apple Glass.",
    "One simple idea could be with maps and directions. The Apple Glass could create hologram arrows for you to follow down streets on your way to a destination. You could even pull up a virtual map that you could move with your hands, appearing in front of you in the real world through the lenses of the wearable.",
    "Another would be the creation of virtual environments — similar to what we saw in the Pokemon Go demo on Microsoft’s HoloLens 2. We might even see a social element brought in perhaps two Apple Glass users could see and interact with the same virtual environment. This could be as a virtual Pokemon battle, or a more cooperative adventure through an imaginary space.",
    "For now, all of this is just speculation, but if the patented design is incorporated into Apple Glass this could be a headset to keep your eye on.",
    "Via AppleInsider"
  ],
  "headers": {
    "3": "How are the holograms made?",
    "7": "What could the holograms do?"
  },
  "links": {
    "Apple Glass": "https://www.techradar.com/news/apple-glasses",
    "US patent": "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.htm&r=56&f=G&l=50&d=PTXT&s1=apple.AANM.&p=2&OS=aanm/apple&RS=AANM/apple%0D%3C/p%3E%3C/div%3E%3Cdiv%20class=",
    "HoloLens 2": "https://www.techradar.com/reviews/microsoft-hololens-2",
    "Google Glass": "https://www.techradar.com/reviews/gadgets/google-glass-1152283/review",
    "Pokemon Go demo": "https://www.techradar.com/news/pokemon-go-gets-a-full-ar-demo-but-theres-a-catch",
    "AppleInsider": "https://appleinsider.com/articles/21/03/23/apple-glass-may-use-holograms-to-create-3d-virtual-objects"
  }
}