{
  "source": "https://www.techradar.com/news/games-that-take-you-to-ireland-for-st-patricks-day-without-leaving-the-sofa",
  "title": "Games that take you to Ireland for St Patrick's Day (without leaving the sofa)",
  "category": "gaming",
  "updated": "2021-03-20T10:00:00Z",
  "author": "vic-hood",
  "summary": "Opinion: there’s no place like home",
  "article": [
    "Ah, the Emerald Isle. From the hustle and bustle of Dublin, to the majesty of the Antrim Coast, all the way to the beaches of Donegal, the island of Ireland is seeping with ancient Celtic landmarks, rugged landscapes and a rich culture that everyone must experience at least one in their lives.",
    "I’m fortunate enough to be able to call Ireland home but, like many Irish ex-pats, returning to the homeland right now isn’t possible - a fact that especially stings when you consider it’s Saint Patrick’s Day weekend.",
    "Without the promise of celebrating Lá Fhéile Pádraig in a darkened, Guinness-merchandise-clad pub, I must make do with returning home in the closest way I know how: through games. Fortunately, there are a myriad of games that remind me of Ireland for a plethora of reasons: whether that’s the characters, the landscape or the folklore. So, read on for the games that I feel capture the essence of Ireland.",
    "Dragon Age: Inquisition may not be a game that immediately springs to mind when you think of Ireland, but it’s probably the game I look to most fondly when I’m feeling particularly homesick.",
    "Easy to miss, Inquisition’s rugged Storm Coast is a beautiful recreation of Northern Ireland’s famous Giant’s Causeway. The Giant’s Causeway, which I’m fortunate enough to have on my doorstep back home, is an area of interlocking, hexagonal-shaped, basalt column and, in Inquisition, I was surprised (and somewhat emotional) to see it make a quiet appearance.",
    "So what actually caused the columns to form that way? Well, the scientific answer is that it was the result of a volcanic fissure eruption (boo, boring). Personally, I find the legend is far more interesting.",
    "According to Irish mythology, the Causeway was built by Irish giant Fionn mac Cumhaill (also called Finn MacCool) after he was challenged to a fight by Scottish giant Benandonner. This is where the story starts to differ, in one version MacCool gets across the water and realizes that he’s seriously outsized, so returns home, dresses like a baby and hides in a cot. When Benandonner arrives, he sees this GIANT baby and decides to scarper because he figures that if that’s the size of the baby, the father must be absolutely huge. The Scottish giant flees, destroying half the causeway on his way so he can’t be chased back.",
    "There are a few aspects of The Witcher 3 which remind me of Ireland, but Skellige is probably the most prominent. In the Witcher, Skellige, or the Skellige Isles, is an archipelago made up of two islands: Ard Skellig (meaning ‘High Skellig’ in Irish) and An Skellig (meaning ‘The Skellig)’. While the Isles appear to have an undeniably strong Viking influence (see Norse Gaels), there’s also a heavy Gaelic influence too - getting into how these two mix is a whole other thing.",
    "For a start, Skellige is named after the Skellig Islands off the coast of County Kerry. You’ve likely seen these islands if you’ve watched Star Wars: The Force Awakens, as the scenes with Luke Skywalker on his isolated island were filmed there.",
    "Like the Witcher’s Skellige, the islands themselves are rugged, ancient and undeniably beautiful, with a splash of vivid green throughout so you’ve no doubt that you’re still in the Emerald isle. Like The Witcher’s Skillege too, the Skellig Island (or \"the Skellocks\") are split into two, Skellig Michael (the Great Skellig) and Little Skellig - though The Witcher avoids depicting just how many puffins are on the damn islands.",
    "It’s not just the Skellige islands themselves that remind me of home, the residents of Skellige speak with a mix of Northern Irish, Irish and Scottish accents and dress with a mixture of kilts and broaches. As someone from the northeast of Northern Ireland, this mixture of Ulster Scot and Irish accents rings especially true. Combine that with the rugged beauty of Skellige and it feels like the closest depiction of Ireland’s rich and varied culture that I’ve seen to date.",
    "This one is slightly more on the nose, but it’s also a forgotten classic. Folklore is quintessentially Irish, with the action RPG’s whole premise focusing on Celtic Mythology - not to mention the village of “Doolin” that it’s partly set in.",
    "For anyone who knows anything about Celtic Mythology, it is dark. You would be lucky to find a legend, myth or folktale that isn’t born or ends in some sort of tragedy. What is great about Folklore is that it leans into that innate darkness, exploring the realms of the Netherworld (a depiction of the Celtic Otherworld) and the creatures which reside within it.",
    "Take the unsettling Far Darrig, who is shown in Folklore as a rat in an oversized coat and top hat - and is one of the game’s many “half-lives” (creatures who are born of powerful desires). In Irish Folklore, Far Darrig (meaning Red Man) is a fairy known for wearing a red coat and cap.",
    "These fairies are sometimes called Rat Boys because they’re fat, hairy and have a rat-like snout and tail. In tales of folklore, Far Darrig isn’t actually helpful - like he is to Ellen in Folklore - but instead, they’re mischievous practical jokers who often take a joke maybe too far. For example, Far Darrig’s are known to sometimes change babies in their cradles and kidnapping people in sacks.",
    "It’s a breath of fresh air to see a game depict these dark and often grotesque mythical creatures - and to see something other than a bloody Leprechaun take center stage for once.",
    "Finally, we have The Bard’s Tale. While The Bard’s Tale (2004) does include some Irish locations and names, it’s the game’s dry wit that truly reminds me of home. The Bard’s Tale is full of madcap characters who will sarcastically cut you down in a heartbeat, but they do so in a way that you can only laugh - not to mention the scathing, deadpan remarks from the Bard himself.",
    "Then there are the sudden bursts into song by these characters. While most of these songs and situations are completely ridiculous, the one that I fondly remember years after playing The Bard’s Tale is The Beer Song, which sees tavern punters coming together for a sing-song.",
    "The Irish pub sing-a-long is a tradition that encapsulates the heart of Ireland, whether it takes the form of gathering around a tiny table to listen to a traditional folk band or singing your lungs out to The Wild Rover.",
    "While The Beer Song may not capture that Irish essence in quite the same way, it doesn’t capture that feeling of togetherness that an Irish pub can offer and it’s the closest many of us will get to the real thing this year."
  ],
  "headers": {
    "3": "Dragon Age: Inquisition",
    "7": "The Witcher 3: Wild Hunt",
    "11": "Folklore",
    "16": "The Bard's Tale"
  },
  "links": {}
}