{
  "source": "https://www.techradar.com/news/whatsapp-is-making-voice-messages-look-more-exciting",
  "title": "WhatsApp is making voice messages look more exciting",
  "category": "computing",
  "updated": "2021-12-06T09:49:15Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Voice waveforms are starting to roll out",
  "article": [
    "Voice messages are, by their very nature, an audio experience – but this is something that WhatsApp is looking to change. When you receive a voice message form a contact (or, indeed, if you send one yourself), you will be used to seeing a progress bar during playback.",
    "This is a handy visual aid that helps let you know how long a message is and how much more there is to listen to. But now the feature is getting a bit of an upgrade to make it more visually appealing thanks to voice waveforms.",
    "We've seen WhatsApp playing around with waveforms previously, with Android users who are signed up for the beta program having been given a sneaky glimpse at the feature. But it was only a brief look, as voice waveforms were swiftly disabled without a word of explanation",
    "However, they appear to be back. The fact that the new visual accompaniment to voice messages is now available for iOS and Android beta testers (but still only beta testers) could be indicative of the feature being almost complete and ready for an even wider rollout. But what's all the fuss about?",
    "On one hand, these are just pretty animations to watch while you listen to a message you have received. On the other, they are helpful visual tools that can be reassuring when there is a period of silence in a message; if there is no activity in the waveform, you can safely assume that there is no sound to hear, rather than there being a problem with your speakers… or ears.",
    "As is often the case with WhatsApp, although this new feature is being made available to beta testers, it is not necessarily going to be available to all beta testers immediately. It's something that's controlled server-side, so while ensuring that you have the latest version of the app installed is undoubtedly a good idea, it's sadly no guarantee of getting access to voice wave forms right now.",
    "WABetaInfo reports that WhatsApp beta for Android 2.21.25.11 and WhatsApp beta for iOS 2.21.240.18 are compatible with the feature, so make sure that you have one of these installed for the best possible change of getting to try out the new feature."
  ],
  "headers": {
    "4": "Sound and vision"
  },
  "links": {
    "WhatsApp": "https://www.techradar.com/news/new-whatsapp-app-for-windows-11-fixes-some-of-its-biggest-problems",
    "WABetaInfo reports": "https://wabetainfo.com/whatsapp-is-rolling-out-voice-waveforms-for-chat-bubbles/"
  }
}