{
  "source": "https://www.techradar.com/news/the-metaverse-is-coming-but-what-does-that-even-mean",
  "title": "What is the metaverse?",
  "category": "computing",
  "updated": "2021-11-23T16:39:39Z",
  "author": "katie-dundas",
  "summary": "Everything you need to know about the metaverse",
  "article": [
    "It’s the word of the hour - ’metaverse’ - but what does it actually mean? Will the metaverse change the way we live, work, and socialize - or is it all hype?",
    "With Mark Zuckerberg recently announcing that the name of the Facebook parent company has changed to Meta, it’s clear the tech giant intends to pursue metaverse opportunities aggressively.",
    "The metaverse supposedly has the potential to revolutionize the way we do business, visit friends, shop and network, but it doesn’t fully exist yet beyond a theoretical concept.",
    "So what exactly is the metaverse, why is Meta so intent on bringing it to life, and what will it involve for businesses and consumers?",
    "The term metaverse may have just come to the attention of many, but it’s not a new word, nor was the term invented by Zuckerberg.",
    "Metaverse is a portmanteau, combining the prefix ‘meta’ and the word ‘universe’, and is generally used to describe a virtual universe, accessed by virtual reality (VR) technology.",
    "The word was coined in 1992 by science fiction novelist Neal Stephenson in his work Snow Crash. In the novel, characters enter the metaverse via their avatars, which are virtual representations of themselves. In the metaverse, avatars can transcend reality and enter a VR world, however, in Stephenson’s novel, the metaverse was an escape from a world that was bleak, dystopian, and fueled by corporate greed.",
    "Since then, the word has increased in popularity, especially in the gaming space. Anyone who’s enjoyed a role-playing game (RPG) where they entered the world of the game and played live with other players and characters is probably familiar with the concept of a metaverse. The term has also been used by futurists for years to describe how we might connect digitally in years to come.",
    "There’s no set definition of what the metaverse actually is - but Meta describes it as:",
    "“A set of virtual spaces where you can create and explore with other people who aren’t in the same physical space as you. You’ll be able to hang out with friends, work, play, learn, shop, create and more”.",
    "Meta and many other tech companies are keen to expand the metaverse idea beyond a vague concept and into something real, developing the tools required to bring the metaverse to life.",
    "Today, the word metaverse generally refers to interconnected, virtual communities, or worlds, where avatars of individuals can connect. Using VR headsets, augmented reality (AR), smart watches and smart glasses, we can transport ourselves into the metaverse. As of now, a global metaverse that anyone can access doesn’t completely exist yet, so most of Meta’s ideas for the metaverse are still in the theoretical stages.",
    "At the company’s 2021 Connect conference, Zuckerberg introduced viewers to his company’s vision for the metaverse, integrating both 2D and 3D worlds into one virtual community.",
    "Its metaverse will incorporate current Meta products, like WhatsApp and Messenger, but also offer plenty of new tools like virtual homes, offices, and ecommerce opportunities for businesses and content creators. In Meta’s metaverse imagining, users will have complete creative control over their virtual worlds, designing everything from waterfront homes to space stations where you can work collaboratively, chat with friends, or study.",
    "Using VR, AR, and our current tech tools, the metaverse will combine both the physical and digital worlds. This will be a huge expansion of Facebook Horizon, now known as Horizon Worlds, which was created in 2019 as a VR game and game creation platform, accessed via Facebook’s Oculus VR headsets. In 2021, a beta version of Horizon Workrooms was added to this project, allowing remote teams to work together.",
    "At the Connect conference, Meta announced its elusive ‘Project Cambria’, a yet-to-be-launched premium VR headset that users will ostensibly use to access the metaverse. The firm is also planning to release a smartwatch, which will likely connect with the new VR hardware.",
    "Zuckerberg has made it clear that Meta sees the metaverse as a priority and will invest massive amounts of time, research and energy into bringing it to life. But why?",
    "In his latest Founder’s Letter, Zuckerberg stated:",
    "“When I started Facebook, we mostly typed text on websites. When we got phones with cameras, the internet became more visual and mobile. As connections got faster, video became a richer way to share experiences. We’ve gone from desktop to web to mobile; from text to photos to video. But this isn’t the end of the line”.",
    "He sees the metaverse as the next logical step forward in how we utilize the internet and social media.",
    "The brand wants to create a future where more and more of us will spend time online, and aims to play a central role in architecting this change, designing a new world where we can connect. The metaverse will help people connect and Meta sees this as the next leap forward, building tools that go beyond apps and social media and increase our ability to connect with others.",
    "Some critics claim the name change to Meta is an attempt to deflect from Facebook’s negative publicity in recent years, such as the Cambridge Analytica data scandal, the company’s misuse of personal data, and various security breaches. However, Meta has stated the brand’s name change is to better encompass everything the company does, beyond just the social media app Facebook.",
    "What about financial motive? Might Meta’s profits soar from the development of a metaverse? In short, yes. Zuckerberg describes a virtual world where consumers will not only buy hardware to access the metaverse but will also have plenty of shopping opportunities within the metaverse itself, with users buying everything from new outfits for their avatars to browsing shops.",
    "However, the days of huge profits within the metaverse are still years, if not decades, away. Some analysts think that cryptocurrency may play a big role in metaverse commerce, but how transactions will occur is all speculation at this point.",
    "Facebook isn’t the only company interested in the metaverse. And most experts imagine the metaverse as a global space that anyone can access, not something that’s owned by one company. Therefore, many organizations would become involved and work together within the same space, as websites do today within the internet.",
    "“The metaverse will not be created by one company. It will be built by creators and developers making new experiences and digital items that are interoperable and unlock a massively larger creative economy than the one constrained by today’s platforms and their policies,” asserts Zuckerberg.",
    "So, how are other companies becoming involved? It’s no surprise that other tech corporations are sensing the potential and investing time and money into the metaverse’s development. Here’s how a few corporate heavyweights are imagining integrating their products and services with the metaverse.",
    "Microsoft The pandemic taught us that working from home is not only possible but also efficient, with many workers loving the convenience and flexibility of remote work. Not everyone is in a hurry to go back to the office either, so it’s no surprise that tech companies like Microsoft are seeing the possibilities of how the metaverse could make remote work easier.",
    "Microsoft recently announced that it will add 3D avatars and immersive digital workspaces to Microsoft Teams, allowing companies to build ‘digital twins’ of their physical offices for remote workers to access. This will be powered by Microsoft Mesh, a virtual collaboration tool that uses VR and AR to create digital spaces and is expected to be available in 2022. A new app, called Microsoft Loop, will allow remote workers to easily move, sync, and share documents and resources via a digital collaboration canvas.",
    "Microsoft has also indicated it plans to expand its gaming offerings into the metaverse space, potentially taking Xbox games into the 3D world in the future.",
    "Zoom Video conferencing platform Zoom has also indicated that it sees itself having an important role in digital working environments within the metaverse in the future. CEO Eric Yuan mentioned in a recent interview that he sees this as still being a few years away, though.",
    "Amazon With Amazon’s huge market share in ecommerce, digital entertainment and cloud computing, it’s highly likely the company is considering how Amazon shopping and media consumption could occur within the metaverse. But as of now, its hasn’t released any statements on the topic.",
    "Roblox Online gaming platform Roblox is heavily involved in the metaverse space. You might not have heard of it, but chances are your kids have. Roblox created a virtual platform where users can make their own games. While playing the games is free, users can buy virtual currency called Rubux to purchase add-ons for the games - and the company is making serious money.",
    "Roblox has essentially already created a platform where users can create their own metaverse and have also proven that it can be profitable, so it’s a major player to watch in this space.",
    "Epic Games Entertainment company Epic Games, makers of Fortnite, also see huge potential in the metaverse. In April 2021, the company announced a $1 billion round of funding, including an investment from Sony Group Corporation, to bring its vision of the metaverse to life.",
    "Nike Why does a sneaker company want to join the metaverse? Sportswear giant Nike is thinking ahead to the days when users might want to buy virtual products, such as Nike activewear, for their avatar - if you and your buddies are shooting virtual hoops, you want to look good while doing it. Nike has filed several trademark requests for selling virtual products with its logo and brand.",
    "However, this also raises the bigger question of how trademarking and counterfeit goods will be regulated in the metaverse, with Nike taking preemptive measures to protect itself well before the metaverse is realized.",
    "The concept of the metaverse offers more questions than answers when it comes to international tech regulation. In a virtual world, who is the governing body of the metaverse? How do companies protect the privacy, facial recognition, and personal data of metaverse users?",
    "Meta has touched on this, mentioning in its keynote speech how its metaverse vision includes safeguards for user safety and even for preventing avatar identity theft, but little is known as to how, if at all, the metaverse will be governed, regulated, and controlled to ensure user privacy and protection.",
    "With so many valid concerns relating to social media use today, spanning from detrimental mental health effects on children to sharing misinformation on vaccines, it’s not hard to imagine how the metaverse could open up a whole new range of serious issues that we’ve yet to even think about.",
    "In November 2021, Meta announced several governmental and nonprofit partnerships, including Peres Center for Peace and Innovation in Israel, that will collaborate on how to build the metaverse responsibly.",
    "Ready to jump into this exciting new world? Not so fast - the metaverse, as envisioned by Zuckerberg, is still years away. By his estimates, many of the metaverse products Meta is working on won’t be ready for at least the next 10-15 years. But when (or if) the metaverse comes to fruition, how will we access it?",
    "Hardware will play a big role in metaverse access, with users purchasing their own virtual reality headsets to transport them from their living room into their metaverse world. While Facebook already has its own Oculus headset and has teased the arrival of a newer headset for 2022, there are a number of other companies with their own VR headsets, including Samsung and HP.",
    "Users will pop on their headset whenever they want to enter the metaverse via their internet connection, but there will likely be less immersive ways to use the metaverse for those who don’t have a pricey headset kit.",
    "Once you’re in the metaverse, you’ll be represented by your avatar, designed and created by you. Users will be able to customize the virtual version of themselves in every possible way, including selecting height, weight, skin color, head coverings, body type, and even facial hair. There’s sure to be plenty of shopping opportunities too, letting users purchase clothes and accessories for their avatar.",
    "Security measures will need to be paramount in the metaverse login process, ensuring that the right person is logging into their own metaverse account. This could include measures such as passwords, retina recognition, or two-factor authentication.",
    "“In this future, you will be able to teleport instantly as a hologram to be at the office without a commute, at a concert with friends, or in your parents’ living room to catch up. Think about how many physical things you have today that could just be holograms in the future. Your TV, your perfect work setup with multiple monitors, your board games and more - instead of physical things assembled in factories, they’ll be holograms designed by creators around the world”, explains Zuckerberg.",
    "However, will the metaverse become a digital utopia where we can connect with friends from all over the world instantly, watching concerts and playing board games? Or, is it likely that the platform will never gain critical mass?",
    "It’s still too soon to know how, if at all, the metaverse will change the way we live. Social chats with friends might become more immersive and gaming enthusiasts will definitely enjoy the possibilities of the metaverse. Imagine stepping into your favorite game with all of your friends and not just playing on a 2D level, but by actually putting yourself into the world of the game?",
    "There are seemingly infinite ways how a fully-realized metaverse could revolutionize how we socialize, relax, or even date. However, not everyone is eager to socialize digitally. And, although the metaverse itself will be free, the expensive tech hardware required to fully immerse yourself in it means they’ll always be a barrier for entry.",
    "There’s also the important issue of human connection. Whether we’re socializing or working, loneliness is a real and powerful emotion that millions of people felt during the last two years of the pandemic. Can a coffee in the metaverse ever compete with meeting up with your friends down the road at the café? Loneliness and isolation could still weigh heavily against the metaverse since nothing can replace a hug, a handshake, or a smile.",
    "If there’s one thing the pandemic has proven, it’s that workers are no longer satisfied with 9-5 office jobs and endless commutes. More and more workers are embracing remote work, seeking out companies that allow working from home, or ditching the traditional career path for freelance or entrepreneurial opportunities.",
    "When you want to be able to work from anywhere in the world, the metaverse could theoretically be a gamechanger in how we connect for business purposes, especially on a global level. From virtual office spaces to interviews, there’s so much that can be done online rather than in-person. The metaverse could take boring team meetings from 2D into 3D, letting you place yourself into your virtual office and feel like you’re actually sitting there next to your colleagues.",
    "If the metaverse can integrate with our current office software and technology, then you could easily pull up a PowerPoint presentation you’d made offline and present it to colleagues in your metaverse boardroom. Or, hand an avatar colleague a file that they can download in their own time at home.",
    "Workers can work from home, ditch the commute, and have more time with their family and friends. It’s easy to see how this would be appealing, but will companies be ready to lose the cubicles forever? Despite the benefits of remote work for staff morale and retention, many businesses still cite concerns about productivity and time monitoring as hindering them from allowing staff to become fully remote.",
    "From a commerce perspective, the metaverse is likely to open up many new shopping opportunities. Business owners can set up shop in the metaverse, content creators will have a new platform for sharing content and video, and how we shop online could change, letting you walk into a clothing boutique in the metaverse, browse for new outfits, then have the physical products sent to your home.",
    "Gaming and recreation purchases are likely to play into the metaverse as well, with in-game purchases, character accessories, or extra lives just being a few ways gaming companies can make money in the metaverse.",
    "As for digital advertising? Yes, ad placement could be just about everywhere, with businesses creating specifically targeted metaverse ad campaigns, just as we currently see online and on social media. In the future, would users pay a premium to enter an ad-free version of the metaverse? Anything is possible.",
    "Should the metaverse take off, it could make workplace collaboration more effective, faster, and more productive.",
    "Despite all of the recent hype around the metaverse and Meta’s involvement, it’s very much the case of hurry up and wait. It’s clear that corporations see massive potential in the metaverse and are willing to invest the time and money into bringing it to life.",
    "Many are excited about the new collaboration and connectivity options the metaverse would create, but there’s still huge amounts of work to be done in the space before we get to the point where the metaverse becomes a pivotal place where we live, play, and work.",
    "Metaverse infrastructure, privacy concerns, and international governance are just a few of the issues that businesses and governments are discussing moving forward.",
    "Technology moves at such a rapid pace, however, that the metaverse could be here before we know it. But will the world be ready?"
  ],
  "headers": {
    "4": "What is the metaverse and where does the word come from?",
    "12": "How does Meta imagine the metaverse?",
    "16": "Why is Meta intent on developing the metaverse?",
    "24": "What do other companies think of the metaverse?",
    "37": "Who controls the metaverse?",
    "41": "How do you access the metaverse?",
    "46": "How will it change the way we live?",
    "51": "How will it change the way we work?",
    "59": "What happens next?"
  },
  "links": {
    "Meta": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
    "virtual reality": "https://www.techradar.com/news/best-business-vr-headset",
    "smart watches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Horizon Worlds": "https://www.techradar.com/news/horizon-home-announced-at-facebook-connect-2021",
    "Founder’s Letter": "https://about.fb.com/news/2021/10/founders-letter/",
    "recently announced": "https://www.techradar.com/news/microsoft-teams-is-entering-a-new-dimension",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Microsoft Mesh": "https://www.techradar.com/news/microsoft-mesh-is-a-holographic-communication-platform-straight-from-science-fiction",
    "Video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "recent interview": "https://www.msn.com/en-us/money/news/zoom-ceo-on-the-metaverse/vi-AAPWE6y",
    "announced": "https://about.fb.com/news/2021/09/building-the-metaverse-responsibly/",
    "trademark requests": "https://www.cnbc.com/2021/11/02/nike-is-quietly-preparing-for-the-metaverse-.html",
    "passwords": "https://www.techradar.com/best/password-manager",
    "remote work": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "office software": "https://www.techradar.com/news/office-365-vs-g-suite-whats-the-best-office-software",
    "PowerPoint": "https://www.techradar.com/reviews/microsoft-powerpoint",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}