{
  "source": "https://www.techradar.com/news/the-worlds-most-powerful-supercomputer-is-being-used-to-identify-covid-19-treatments",
  "title": "The world's most powerful supercomputer is being used to identify Covid-19 treatments",
  "category": "computing",
  "updated": "2021-06-22T11:30:31Z",
  "author": "joel-khalili",
  "summary": "Fugaku supercomputer will also help identify possible Covid-19 mutations",
  "article": [
    "The world's fastest supercomputer is being put to work by researchers in a bid to identify new treatments for Covid-19.",
    "The research project is led by a team from the University of Tokyo, who will use the machine (called Fugaku) to simulate molecular interactions en masse, with the goal of identifying compounds that can be used to fight infection.",
    "Developed jointly by Fujitsu and the RIKEN Institute, Fugaku will also be used to “clarify the molecular mechanism by which Covid-19 infections are inhibited”, which could help optimize the molecular structure of new drugs, thereby improving their efficacy.",
    "Built on Arm-based Fujitsu A64FX processors, Fugaku topped the Top 500 supercomputer rankings in June 2020. It achieved 415.5 petaFLOPS by the High Performance Linpack (HPL) benchmark, almost triple the score of IBM Summit, the previous record holder.",
    "Fugaku was also top of the charts for Graph 500, HPL-AI and HPCH workloads; a feat never before achieved in the world of high performance computing (HPC).",
    "Since then, the introduction of a further 330,000 cores (increasing the total to 7,630,848) has boosted the machine’s performance even further, to 442 petaFLOPS.",
    "In other words, there is currently no other machine on the planet capable of coming close to the performance achieved by Fugaku, which means it is uniquely positioned to assist in research and drug discovery.",
    "“By utilizing Fugaku, molecular simulations for viral proteins can be accelerated, clarifying the complexity of binding states and interactions between viral proteins and inhibitory compounds, with the aim of identifying inhibitory compounds that can lead to therapeutic drugs at an early stage,” Fujitsu explained.",
    "The supercomputer will also be used to predict the behavior and properties of Covid-19 mutations, which could pose a serious threat to the return to normal life if able to circumvent the current crop of vaccines.",
    "By identifying potential patterns of mutation, researchers could design drugs in advance, before a new strain has even occurred in the wild.",
    "The research begins in earnest from today and will continue until March 2022."
  ],
  "headers": {
    "3": "Fukagu supercomputer"
  },
  "links": {
    "Fugaku": "https://www.techradar.com/news/the-worlds-fastest-supercomputer-is-now-even-more-absurdly-powerful-than-before",
    "Top 500": "https://www.top500.org/lists/top500/"
  }
}