{
  "source": "https://www.techradar.com/news/tcls-mwc-2021-lineup-includes-smart-glasses-that-mimic-a-140-inch-display",
  "title": "TCL’s MWC 2021 lineup includes smart glasses that mimic a 140-inch display",
  "category": "phones",
  "updated": "2021-06-24T14:00:03Z",
  "author": "david-lumb",
  "summary": "TCL introduces smart glasses that plug into phones and mimic an external 140-inch display",
  "article": [
    "TCL’s got several innovations to show off at MWC 2021, from gadgets to software updates to 5G hubs. It’s an interesting mix for an off-year in the phones industry, and building off of things shown off at CES 2021.",
    "The biggest thing is the NXTWEAR G, a pair of smart glasses that operate like a secondary display. Want to watch a YouTube video on a far bigger screen than your phone? Plug TCL’s NXTWEAR G into the USB-C port of your phone, tablet, or computer and you’ll be able to use it as the equivalent of a 140-inch display.",
    "The pair of Full HD-resolution Sony Micro OLED panels combine for a 4K image, according to TCL, though they don’t sit flush on your face – a small gap below the glasses gives you peripheral vision to see what’s going on. While TCL’s glasses don’t have batteries, and depend on a cable for power, that makes them light at 130g total.",
    "While they aren’t quite the Apple AR glasses we’ve heard rumors about for years, TCL’s NXTWEAR G will soon be available to buy: originally revealed at CES 2021, the glasses will go on sale later this year for €599 (around $715 / £510 / AU$945), first in Australia and then South Korea and Japan. Depending on consumer demand, the glasses could be released elsewhere, but there are no plans yet.",
    "The biggest advantage to sticking in the Apple ecosystem is having so much integration that you can respond to an iMessage from any iPhone, iPad, or Mac. TCL recently introduced its own version of multi-device, multi-screen functionality for its Android phones, starting with the TCL 20 Pro 5G and eventually making its way to other TCL phones. At MWC 2021, the company showed off the feature in a video.",
    "The feature, called Multi-Screen Collaboration, allows TCL 20 Pro 5G owners to use other devices to access files, photos, and other media from the device, as well as respond to text messages. If you connect your TCL 20 Pro 5G to a Windows 10 computer (either via QR code or over Bluetooth), for instance, a window approximating the size of the phone’s screen will pop up on your computer and you’ll be able to interact with the phone as usual, clicking where you’d tap on a touch interface.",
    "From there, you can click-and-drag files and photos off your phone and see them on your computer, or respond to texts, or watch videos on bigger screens – or with TVs, use your phone screen like a touchpad controller. You can access your phone this way on compatible devices – TCL hasn’t released a list of product lines, but you’ll be able to use Multi-Screen Collaboration on tablets like the TCL 10 TABMAX, Windows 10 computers, and TCL as well as other brands of TVs.",
    "TCL has sold 5G modems as enterprise products for awhile, but now it’s bringing that functionality to consumers. The TCL LinkHub 5G is aimed at folks who want 5G connectivity throughout their home but who are too far from existing networks for ISPs to run broadband to their door.",
    "The LinkHub 5G is a modem that picks up sub-6 wireless 5G signals and rebroadcasts them in the area. The rugged box is IP67-rated for dust and water resistance and can be mounted on walls or poles outdoors for better coverage; stick a 5G SIM card into the box and it will give surrounding users download speeds up to 4.67Gbps, according to TCL.",
    "It’s not hard to imagine the cases where an outdoor router like this might be useful to blanket a house or large homestead in 5G. At €499 (around $595 / £425 / AU$785), it’s not affordable for everyone, but could be a viable upgrade for a family or small business to invest in."
  ],
  "headers": {
    "4": "Multi-screen functionality",
    "7": "5G outdoor hub"
  },
  "links": {
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "revealed": "https://www.techradar.com/news/tcls-ces-2021-lineup-includes-the-cheapest-5g-phone-yet",
    "introduced": "https://www.tcl.com/global/en/blogs/work-smarter-with-tcl-multi-screen-collaboration.html"
  }
}