{
  "source": "https://www.techradar.com/news/the-new-matrix-resurrections-trailer-mixes-kung-fu-with-deja-vu",
  "title": "The new Matrix Resurrections trailer mixes kung-fu with déjà vu",
  "category": "entertainment",
  "updated": "2021-12-02T10:49:35Z",
  "author": "axel-metz",
  "summary": "A 60-second nostalgia trip",
  "article": [
    "A new trailer for The Matrix Resurrections has arrived – and it’s basically a highlight reel of the best scenes from the first three (okay, two) movies.",
    "Titled Déjà Vu, the 60-second teaser merges sequences from the original trilogy with those from the upcoming fourth instalment, which is scheduled to land in theaters on December 22, 2021.",
    "To be honest, we don’t learn all that much more about what to expect from Resurrections in this new trailer – it’s more a series of glitchy code and morphing faces than telling reveals – but it’s still managed to make us even more excited to see how director Lana Wachowski plans to breathe new life into the iconic sci-fi franchise.",
    "You can check it out below.",
    "The trailer opens with an ominous line from Carrie-Anne Moss’ Trinity – “a déjà vu is usually a glitch in The Matrix, it happens when they change something” – which itself is an immediate callback to the 1999 original.",
    "From then on (once again to the tune of Jefferson Airplane’s White Rabbit), we’re treated to a montage of moments from The Matrix and its sequels, including Morpheus’ offering of the red or blue pill, Neo’s awakening from the gunge-filled pod, the dojo fight sequence and Neo’s battle with Merovingian.",
    "These are spliced with new scenes from Resurrections, like those showing Trinity disintegrating into code, an angry-looking Jonathan Groff and an explosive fight against the machines.",
    "It then ends with a rather on-the-nose piece of text reading CHANGE, followed by a voiceover saying, “Why use old code to make something new?” A third voice (Jessica Henwick’s Bugs, we think) closes proceedings by revealing that “maybe this isn’t the story we think it is.”",
    "Yes, that is hype we’re breathing now.",
    "As for what we already knew about The Matrix Resurrections, it’s clear that the film will be dealing with Neo’s return to The Matrix and the as-yet-unexplained survival of Trinity (who – spoilers! – was killed at the end of Revolutions).",
    "Lana Wachowski, who directed the first three entries alongside her sister, Lilly, is helming this one alone, while Reeves and Moss are both reprising their roles. We also know Laurence Fishburne won’t be returning as Morpheus, and that his character is instead being re-interpreted (though we don’t yet know specifics) by Yahya Abdul-Mateen II.",
    "New cast members include Jessica Henwick, Jonathan Groff, Neil Patrick Harris, Christina Ricci, Priyanka Chopra Jonas and Eréndira Ibarra – but, again, we’re still unsure of their respective roles.",
    "We do learn from this trailer, though, that Groff’s character is likely to play a villainous role. In our first look at Resurrections back in September, he appeared in more of a therapeutic capacity – clearly excited by the possibility of Neo’s return to The Matrix – but this time around we see him don a more menacing facial expression à la the tortured Morpheus in the original movie.",
    "Speaking of that mythical martial arts maestro, this new teaser also suggests Resurrections will at least acknowledge Fishburne’s time spent playing the character. He’s included here more than Abdul-Mateen’s version of Morpheus, so we’re excited to see how the new movie ties the two together.",
    "And then, of course, there’s the trailer’s closing line – “maybe this isn’t the story we think it is.” Not that we had much of an idea beforehand, but it’s good to know that Wachowski and co. have clearly made it their mission to subvert expectations with the upcoming sequel.",
    "All will be revealed on December 22, when The Matrix Resurrections is released concurrently in theaters and on HBO Max."
  ],
  "headers": {
    "9": "So, what did we learn?"
  },
  "links": {
    "first look at Resurrections": "https://www.techradar.com/news/the-matrix-4-trailer-breakdown-11-things-we-noticed-in-the-resurrections-teaser",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained#"
  }
}