{
  "source": "https://www.techradar.com/news/hurry-apples-all-new-ipad-pro-hits-lowest-sale-price-ever-at-amazon",
  "title": "Huge iPad deal: the all-new iPad Pro drops to a new record-low price at Amazon",
  "category": "tablets",
  "updated": "2021-09-16T18:19:14Z",
  "author": "mackenzie-frazier",
  "summary": "Snag this epic iPad deal before it's too late",
  "article": [
    "We're rounding up today's best iPad deals, and we've just spotted an incredible bargain on Apple's latest and greatest iPad Pro. For a limited time, you can get the all-new iPad Pro on sale for $699.99 (was $99.01) at Amazon. That's a massive $99 discount and the lowest price we've ever seen for the powerful 11-inch tablet.",
    "Released in May, Apple's 2021 iPad Pro features a stunning 11-inch Liquid Retina display, an all-new ultra-wide front-facing camera, and an impressive speaker system. Perfect for students, the lightweight iPad Pro delivers more power than most laptops by offering Apple's M1 chipset and 256GB of storage. You're also getting Face ID for secure authentication and Apple Pay, and 10-hours of battery life. While we've seen the iPad Pro drop to $749 since its release, this is the first time the powerful tablet has dropped to this new record-low price. This fantastic deal has been flashing in and out of stock, so you should take advantage now before it's too late.",
    "You can see more of the best cheap iPad deals and if you're looking for something with less power you can also see the best cheap Amazon Fire tablet deals and sales. You can also shop bargains with our roundup of the best Amazon deals that are happening right now and look forward to upcoming Black Friday 2021 offers."
  ],
  "headers": {
    "1": "Today's best iPad deal",
    "2": "More iPad deals"
  },
  "links": {
    "on sale for $699.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2F2021-Apple-11-inch-Wi%25E2%2580%2591Fi-128GB%2Fdp%2FB0932B5NVD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6462940495010092000-20",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "best cheap iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "best cheap Amazon Fire tablet deals and sales": "https://www.techradar.com/deals/the-best-cheap-amazon-fire-tablet-deals",
    "Amazon deals": "https://www.techradar.com/deals/best-amazon-sales-deals-discounts",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}