{
  "source": "https://www.techradar.com/news/new-rumours-about-amds-new-rx-6600-xt-gpu-emerge-could-it-compete-with-nvidia",
  "title": "New rumors about AMD's new RX 6600 XT GPU emerge - could it compete with Nvidia?",
  "category": "components",
  "updated": "2021-05-21T10:57:47Z",
  "author": "jess-weatherbed",
  "summary": "A couple of fresh leaks shed light on the inbound RX 6600 graphics cards",
  "article": [
    "The existence of AMD’s rumored Radeon RX 6600 graphics cards may now have some additional weight after an image of a possible engineering sample was spotted on Twitter. The GPU doesn't have any mention of the RX 6600 XT name, but a SKU label reads that the product is a Navi 23 XT that features 8GB GDDR6 memory. This also reinforces the previous speculation that the on-board VRAM will be 8GB (rather than the 12GB which was previously suggested), and if the image is to be believed then we will be getting a single HDMI and three DisplayPorts.",
    "It's currently anticipated that the RX 6600 XT will have 2,048 stream processors and Videocardz reports we should expect it to offer a boost clock of up to 2,684MHz and a memory clock of 16 Gbps, with an estimated power consumption of 130W",
    "AMD has been lagging behind its rival Nvidia in recent months given its lack of Navi-based mobile GPUs for the gaming laptop market and its own 'Gaming Super Resolution' (designed to take on Nvidia DLSS) still in development.",
    "Available GPU stock has been slim across both manufacturers too, though Nvidia has officially announced more variants of its graphics cards for the Ampere line which leaves AMD with a smaller current-gen portfolio at the time of writing. As we can't verify the source, take the leaked image and information as purely speculative for now to avoid any disappointment. The RX 6600 XT is expected to launch with both desktop and mobile variants which should finally bring the latest generation of AMD graphics to gaming laptops. Given all the recent leaks emerging about the RX 6600 GPUs, we're anticipating that Team Red is set to make an official announcement soon to clear up any rumors – possibly at its Computex keynote on June 1."
  ],
  "headers": {
    "1": "Lagging behind"
  },
  "links": {
    "Radeon RX 6600 graphics cards": "https://www.techradar.com/news/yet-more-amd-and-nvidia-gpus-could-be-coming-including-rx-6600-and-rtx-3050-models",
    "RX 6600 XT": "https://www.techradar.com/news/amd-rx-6600-xt-gpu-leak-suggests-that-8gb-vram-may-not-be-the-only-disappointment",
    "on-board VRAM will be 8GB": "https://www.techradar.com/news/amd-rx-6600-and-6600-xt-gpus-could-have-less-vram-than-expected",
    "12GB which was previously suggested": "https://www.techradar.com/news/amd-rx-6700-and-6600-xt-gpus-could-both-load-up-with-12gb-vram",
    "Videocardz": "https://videocardz.com/newz/amd-radeon-rx-6600-xt-with-navi-23-gpu-pictured",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "'Gaming Super Resolution'": "https://www.techradar.com/news/amd-patents-gaming-super-resolution-to-take-on-nvidia-dlss",
    "Nvidia DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "Available GPU stock": "https://www.techradar.com/news/whats-the-point-of-releasing-new-gpus-if-nobody-can-actually-buy-them",
    "AMD graphics to gaming laptops": "https://www.techradar.com/news/powerful-all-amd-gaming-laptops-are-on-the-horizon",
    "Computex": "https://www.techradar.com/news/computex-goes-online-only-for-the-second-year-running-here-are-the-dates"
  }
}