{
  "source": "https://www.techradar.com/news/is-your-apple-watch-waterproof",
  "title": "Is your Apple Watch waterproof? Everything you need to know",
  "category": "wearables",
  "updated": "2021-12-05T13:44:29Z",
  "author": "suzie-dundas",
  "summary": "Everything you need to know before taking the plunge",
  "article": [
    "Is your Apple Watch waterproof? Well, the short answer is: no. But most models are water-resistant, so they won’t get damaged when exposed to or submerged in water up to a certain depth. But there are several levels of water resistance on apple watches, so it’s best to know precisely how your watch is rated before you go jumping into any jacuzzis or hot springs this winter.",
    "The good news for Apple Watch owners is that the days of destroying your costly Apple product because you got caught in the rain are gone. Even the oldest Apple Watches offer some degree of protection from moisture, and fortunately, each series of watch comes with a rating to tell you exactly the extent of moisture it can handle.",
    "If you’re in the market for a new Apple Watch and plan to wear it for soaking in the tub, swimming, or even ocean sports, read on to learn what activities and depth your new watch can handle. Remember that your Apple warranty doesn’t usually cover water damage, so it’s essential to heed the water-resistance ratings (unless you want to fork over for a new watch, of course.)",
    "Unlike most electronics, including iPhones, iPads, and all other tablets and smartphones, Apple watches don’t use the IP water resistance rating. Instead, they use the standard rating method for watches, based on depth.",
    "However, being rated to 50 meters doesn’t mean you should take it anywhere near 50 meters – it just means that in lab tests, it was able to withstand the amount of pressure you’d find at that depth (which is about 4.5 times the amount at the surface.) But there’s really no reason to test that yourself, considering it could damage your watch. If you need a smartwatch for scuba diving or freediving, you’re better off getting one that doubles as a dive computer, like the Garmin Descent.",
    "It’s also important to know that Apple watches aren’t designed to withstand repeated high-energy impacts. Jumping into a pool or ocean is no problem, but avoid wearing it for more extreme sports, like water skiing or surfing. It’ll probably be fine a few times, but too many high-velocity impacts could start to compromise the water resistance, eventually ruining your watch."
  ],
  "headers": {
    "3": "A note about water resistance"
  },
  "links": {
    "waterproof": "https://www.techradar.com/best/waterproof-fitbit",
    "Garmin Descent": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4087315268771407400/https://buy.garmin.com/en-US/US/p/568181"
  }
}