{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-other-prices-leak-ahead-of-unpacked",
  "title": "Samsung Galaxy Z Fold 3 and other prices leak ahead of Unpacked",
  "category": "phones",
  "updated": "2021-10-20T08:50:43Z",
  "author": "david-lumb",
  "summary": "The Samsung Galaxy Watch 4 could be cheaper than its predecessors",
  "article": [
    "It’s official - Samsung Unpacked will be on August 11, and we’re expecting a slew of devices to be revealed thanks to months of rumors, including the eagerly-awaited Samsung Galaxy Z Fold 3. But a new leak has given us a fascinating list of info we haven’t heard before: what each device will supposedly cost.",
    "Redditor u/FragmentedChicken posted a list of the prices they found on LambdaTek for a few supposed Samsung products that are expected to launch at the event on August 11. Obviously, this leak may not be accurate - either because the listings could be faulty or simply out of date, as Samsung could tweak prices in the weeks left until Unpacked.",
    "First is the most eagerly-awaited device, the Samsung Galaxy Z Fold 3, which the LambdaTek listings suggest will be priced at €1673.21 (around $1,970 / £1,439 / AU$2,680) for 256GB of storage and €1777.47 (around $2,095 / £1,529 / AU$2,849) for 512GB of storage. It will supposedly come in phantom black, phantom silver, and phantom green colors.",
    "This price would be around what the Samsung Galaxy Z Fold 2 cost when it launched ($1,999 / £1,799 / AU$2,999), though we had heard rumors that it would be cheaper. One thing to keep in mind - for this and all Samsung devices - is that the company tends to round off its prices to a nice, clean number, so we’d expect the final price tags to get nudged to the nearest 50 or 100 denomination in all currencies.",
    "The clamshell foldable Samsung Galaxy Z Flip 3’s price will supposedly start at €975.04 (around $1,150 / £839 / AU$1,560) for 128GB of storage and cost €1025.95 (around $1,210 / £880 / AU$1,645) for 256GB storage. It will have a more varied color palette, coming in black, white, light pink, dark blue, grey, lavender, cream, and green, according to this leak.",
    "Those prices are far below the original Samsung Galaxy Z Flip ($1,380 / £1,300 AU$1,800), and even the slightly costlier Z Flip 5G ($1,449 / £1,399 / AU$2,599), so we’re eager to see if the Z Flip 3 could have a price tag closer to that of a flagship phone - which could conceivably increase its adoption.",
    "The other devices are an interesting grab bag of gadgets that we nonetheless wouldn’t be surprised to see launch at Unpacked, given the rumors.",
    "The Samsung Galaxy Watch 4, for instance, referred to as the Galaxy Watch 4 Classic on LambdaTek and come in 42mm with a starting price tag of €256.46 (around $425 / £309 / AU$575) for the GPS only model and €298.17 (around $470 / £344 / AU$640) for 4G LTE. The much larger 46mm model, if these listings are right, will start at €379.02 (around $447 / £326 / AU$608) for the GPS only version, while the 4G LTE model will cost €419.46 (around $495 / £360 / AU$672). This model will only come in black and silver, the leak suggests.",
    "What the leaker refers to as the Galaxy Watch 4 but which will likely be a sportier version (what we know as Active, as in the Samsung Galaxy Watch Active 2) starts at €256.46 (around $300 / £220 / AU$410) for a smaller 40mm model in GPS only and €298.17 (around $350 / £255 / AU$479) for 4G LTE. The larger 44mm model, on the other hand, will start at €277.97 (around $327 / £239 / AU$445) for the GPS only version, while the 4G LTE model will cost (around $375 / £275 / AU$510). The leak suggests it will come in black, silver, green, and pink gold.",
    "The leaked info claims the Samsung Galaxy Buds 2 will cost €149.64 (around $176 / £129 / AU$240), and come in black, violet, white, and green. That’s smack in between the launch prices of the Samsung Galaxy Buds Plus ($149.99 / £159 / AU$299) and the Samsung Galaxy Buds Pro ($199 / £219 / AU$349), so we wouldn’t be shocked if this price was close to being true.",
    "Even if the pricing doesn’t turn out to be accurate, it still hints at which devices we could see revealed at Unpacked on August 11.",
    "Via Android Authority"
  ],
  "headers": {
    "6": "Price predictions: wearables and audio"
  },
  "links": {
    "Samsung Unpacked": "https://www.techradar.com/news/rip-galaxy-note-21-samsung-galaxy-z-fold-3-to-launch-in-august-hints-unpacked-invite",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "posted": "https://www.reddit.com/r/Android/comments/oove8f/samsung_galaxy_z_fold3_z_flip3_galaxy_watch4_and/",
    "LambdaTek": "https://www.lambda-tek.eu/shop/?region=IE&searchString=z+fold3",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Samsung Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Android Authority": "https://www.androidauthority.com/galaxy-unpacked-summer-2021-pricing-1647291/"
  }
}