{
  "source": "https://www.techradar.com/news/how-to-watch-track-and-field-athletics-at-olympics-2020-free-live-stream",
  "title": "How to watch Track and Field Athletics at Olympics 2020: free live stream, schedule and more",
  "category": "computing",
  "updated": "2021-08-05T09:34:14Z",
  "author": "georgia-silcox",
  "summary": "Expected the unexpected at the Tokyo Olympic Stadium",
  "article": [
    "The 2020 Olympics may soon be coming to an end but there is still plenty of track and field athletics to watch - in fact a huge 17 gold medals are to be handed out in the final three days of athletics in Tokyo. This page will be your handbook of key dates and Olympic live streams of the track and field athletics action so you don’t miss a second - including absolutely free! - including absolutely free.",
    "After rain paused play in the women’s pole vault qualifying, the athletes did well to recompose and qualify for the final. Unfortunately, US favorite Sandi Morris quite literally crashed out after her pole snapped, injuring her hip and heartbreakingly ending her Olympics. This leaves pre-event tips Katerina Stefanidi, Holly Bradshaw and Anzhelika Sidorova to settle the medals amongst them.",
    "Saturday will see the climax of Sifan Hassan’s unprecedented pursuit for three Olympic golds in the 1500m, 5000m and 10,000m. With the 5000m gold already around her neck, can she write her name in the history books by doing the same in the 1500m and 10,000m?",
    "The track and field action concludes with the ever-popular relays. Four athletes passing a baton around the track seems simple right? Wrong - that little metal baton can cause havoc for even the most drilled of teams. The 4x100m and 4x400m will see the best of the best from each nation, including medallists from the individual events in Tokyo, come together in the battle for those Olympic golds.",
    "Keep up to date with the track and field athletics by watching the 2020 Olympic live stream available in your location. In this guide you'll find the key dates you need to put in your calendar and how to watch track and field live streams of all your favorites competing for gold at the 2020 Olympics.",
    "Women’s pole vault final: Thursday, August 5, 7pm JST / 11am BST / 6am ET",
    "Men’s 400m final: Thursday, August 5, 9pm JST / 1pm BST / 8am ET",
    "Women’s 400m final: Friday, August 6, 9.35pm JST / 1.35pm BST / 8.35am ET",
    "Women’s 1500m final: Friday, August 6, 9.50pm JST / 1.50pm BST / 8.50am ET",
    "Women’s 4x100m final: Friday, August 6 at 10.30pm JST / 2.30pm BST / 9.30am ET",
    "Men’s 4x100m final: Friday, August 6 at 10.50pm JST / 2.50pm BST / 9.50am ET",
    "Women’s 10,000m: Saturday, August 7 at 7.45pm JST / 11.45am BST / 6.45am ET",
    "Women’s 4x400m final: Saturday, August 7 at 9.30pm JST / 1.30pm BST / 8.30am ET",
    "Men’s 4x400m final: Saturday, August 7 at 9.50pm JST / 1.50pm BST / 8.50am ET",
    "For all the key times and events (including longer distance races) the official Olympics site has them all listed in one place.",
    "The free, online Olympics Channel has highlights and other programming. But if you want more in-depth coverage, you'll need to look at domestic broadcasters. Those living in the UK have the benefit of the BBC's free-to-air coverage for example, with soooooo much being available on BBC iPlayer.",
    "It's a similar story in the likes of Australia (Channel 7 and its jam-packed 7plus online), Ireland (RTE), France (TF1) and, Germany (ARD and ZDF). Even NBC's streaming service Peacock TV is getting in on the act, with free track and firled live streams in the US,",
    "We have further information about worldwide Olympics streams below.",
    "Most countries are offering coverage of the 2020 Olympics, whether this be a paid subscription or free service. However, if you find you are unable to watch these streams because your place of work or education has blocked the service, or because you are in a location outside of your home country, fear not.",
    "All you need to do is download and install a VPN to your laptop, phone, tablet, or whichever device you are trying to watch on. Using a VPN will trick your device into thinking it is in a different country so that you can enjoy your usual streaming service safely from any region.",
    "Use a VPN to watch Tokyo 2020 Olympic Games from anywhere",
    "In just three basic steps you can get up and running with a VPN...",
    "1. Download and install a VPN - our recommended choice is ExpressVPN",
    "2. Connect to the appropriate server location - open the VPN app, hit 'choose location' and select the appropriate location",
    "3. Go to the broadcaster's live stream - so if you're from the US or UK, just head to Peacock or the BBC iPlayer respectively",
    "As the biggest global sporting event, it will come as no surprise to you that most countries will have some coverage of Tokyo 2020 - albeit at different prices and varying levels of coverage.",
    "There is a dedicated Wikipedia page with an extensive list of all the channels covering the Olympics if you aren’t in one of the countries mentioned above."
  ],
  "headers": {
    "5": "Olympics 2020 track and field athletics: key dates and times",
    "15": "Free Olympics track and field athletics live stream",
    "18": "How to watch your Olympics live stream when abroad",
    "25": "Other 2020 Olympics broadcasters around the world"
  },
  "links": {
    "the official Olympics site": "https://olympics.com/tokyo-2020/olympic-games/en/results/athletics/olympic-schedule-and-results.htm",
    "Olympics Channel": "https://olympics.com/en/live/",
    "BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "7plus online": "http://7plus.com.au/",
    "NBC's streaming service Peacock TV": "https://imp.i305175.net/c/221109/828265/11640?subId1=trd-us-1415635977596625400&sharedId=trd-us&u=https%3A%2F%2Fwww.peacocktv.com%2F",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "just head to Peacock": "https://imp.i305175.net/c/221109/828265/11640?subId1=trd-us-3192253434463214600&sharedId=trd-us&u=https%3A%2F%2Fwww.peacocktv.com",
    "the BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "Wikipedia": "https://en.wikipedia.org/wiki/List_of_2020_Summer_Olympics_broadcasters"
  }
}