{
  "source": "https://www.techradar.com/news/quick-sonys-65-inch-oled-tv-just-crashed-to-record-low-price-at-amazon",
  "title": "Quick - Sony's 65-inch OLED TV just crashed to record-low price at Amazon",
  "category": "televisions",
  "updated": "2021-10-20T14:41:37Z",
  "author": "mackenzie-frazier",
  "summary": "Grab this early Black Friday deal before it's too late...",
  "article": [
    "Amazon is releasing early Black Friday deals throughout the month of October, including a massive discount on one of 2021's best OLED TVs. Today only, you can grab this 65-inch OLED TV from Sony on sale for $1,699.99 (was $2,999.99) at Amazon. That's a massive $1,300 discount and the lowest price we've ever seen. Today's bargain is not only one of the best early Black Friday deals we've seen but also an incredible price for a premium OLED TV. The previous record-low stood at $2,498 - which is $700 (!) more than today's deal. This offer is valid for today only, so you should snag this epic Black Friday TV deal now before it's too late.",
    "The stunning Sony A9G Series TV is loaded with premium features and provides a brilliant picture with lifelike images thanks to Sony's powerful X1 ultimate processor. The 4K TV features millions of OLED pixels that are supercharged by the Pixel Contrast Booster, which delivers deep blacks and intense colors for sharp contrast and lifelike images. The smart TV also features Game Mode for a super smooth experience and works with Amazon Alexa and the Google Assistant for hands-free control.",
    "See more of the best cheap TV deals that are happening now and the cheapest OLED TV deals and prices."
  ],
  "headers": {
    "1": "OLED TV deal",
    "2": "More TV deals"
  },
  "links": {
    "on sale for $1,699.99 (was $2,999.99) at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSony-XBR-65A9G-65-Inch-Compatibility%2Fdp%2FB07NZZLDP9%3Fref%3Ddeals_epicdeals_deals-grid_dcell_img_1_10d9f8f9_dt_slot-5_653a%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8718808781782992000-20",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday TV deal": "https://www.techradar.com/black-friday/tv-deals",
    "Sony A9G Series": "https://www.techradar.com/reviews/sony-bravia-a9g-ag9-oled",
    "best cheap TV deals": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales",
    "cheapest OLED TV deals and prices": "https://www.techradar.com/deals/best-oled-tv-prices-deals"
  }
}