{
  "source": "https://www.techradar.com/news/how-to-recycle-nespresso-pods-and-why-you-absolutely-should",
  "title": "How to recycle Nespresso pods, and why you absolutely should",
  "category": "appliances",
  "updated": "2021-07-03T07:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Reduce waste while still enjoying espresso",
  "article": [
    "For many of us, creating great-tasting coffee at home is one of life’s little pleasures. Nespresso machines feature heavily in our round-up of the best coffee makers, which is no surprise as these easy-to-use espresso machines are compact, sleek, and use single-serve capsules to ensure you can create the perfect cup of Java every time.",
    "However, while these single-serve capsules, which Nespresso calls pods, require minimum effort to make great-tasting coffee, they are contributing to an increase in waste. The number of single-serve coffee pods from manufacturers such as Nespresso, Keurig, and Tassimo that are thrown away is staggering. Halo, which produces compostable coffee capsules, estimates some 56 billion single-serve pods end up in landfill each year.",
    "What you may not know is that many of these single-serve capsules, including Nespresso pods can actually be recycled, and there’s a number of ways you can ensure your coffee isn’t contributing to landfill. We’ve rounded up everything you need to know when it comes to recycling Nespresso and other coffee pods.",
    "Nespresso pods are made from aluminum with a food-grade shellac coating and filled with ground coffee, and depending upon the coffee blend chosen, added flavorings as well. They come in two sizes; original, which offers traditionally sized espresso servings, and Vertuo - a coffee capsule capable of producing larger drinks as well.",
    "We spoke to Nespresso and it revealed 80% recycled aluminum is currently used in all of its Master Origins and Lungo coffee pod ranges. However by the end of 2021, Nespresso said it will ensure all of its Original capsules will use 80% recycled aluminum, and by early 2022 it plans to expand this to include all Vertuo capsules.",
    "When a Nespresso coffee pod is inserted into a Nespresso coffee machine, it is pierced several times and heated water is pumped into the capsule at high pressure until it bursts, releasing the espresso into your cup. Once the drink is ready, the pod is then ejected into a container in the coffee machine, ready to be disposed of. However, here’s where you can do your bit for the environment by recycling the pods rather than adding them to the garbage.",
    "Has all this coffee talk got your mouth-watering? Then check out these great deals on Nespresso coffee machines now.",
    "Nespresso offers its own dedicated pod recycling scheme around the world, and all you need is a free-of-charge Nespresso pod recycling bag. You can either add a recycling bag, which holds around 150 Original capsules or 65 Vertuo pods, to any online order through Nespresso’s website, or you can pick one up from any Nespresso Boutique store.",
    "When the recycling bag is full, there are a number of ways you can get the used pods back to Nespresso. If you’re placing a coffee order through the Nespresso website, you can request a doorstep collection at the same time.",
    "Alternatively, you can drop off the recycling bag at any Nespresso Boutique store or a dedicated Nespresso collection point. There are currently 122,287 collection points worldwide. In the US, this includes stores such as Sur la Table and Williams Sonoma, while in the UK these include local stores that offer the CollectPlus service.",
    "In some areas, Nespresso also offers curbside collection - for example in New York you can put your used Nespresso capsules into your usual metal, glass and plastic recycling bin - without having to place them in a Nespresso recycling bag first.",
    "In the UK, Cheltenham Borough Council and South Derbyshire District Council areas state Nespresso pods are among the brands of used coffee pods that are being collected and recycled through a scheme called Podback, that Nespresso co-founded. The pods should be placed in the dedicated Podback bag and left out for collection at the same time as other recycling and refuse. If you don’t live in one of these areas, Podback bags can currently be dropped off at stores offering Collect+. However Podback plans to roll out the collection scheme to other areas of the UK in the future. We think this should happen sooner rather than later, as the easier it is to recycle coffee pods, the less likely they are to end up in landfill.",
    "Once Nespresso receives the used pods, it uses a recycling facility to separate the aluminum and any remaining coffee grounds in the pods. The coffee grounds are then used to create compost while the empty capsules have the plastic melted off leaving pure aluminum which is melted and recycled.",
    "Nespresso isn’t the only coffee machine manufacturer that uses single-serve capsules. Keurig coffee makers take K-Cup coffee pods but unlike Nespresso they don’t offer a dedicated recycling service. Instead, Keuring recommends rather than throwing the pods in the garage, the lids should be peeled back, the coffee grounds emptied and the empty pods placed in the relevant recycling bin. However, as not all communities can recycle these pods, you should check first, the same applies to coffee pods from other manufacturers, too."
  ],
  "headers": {
    "3": "What are Nespresso pods made from?",
    "7": "How to recycle Nespresso pods",
    "13": "What about Keurig and other coffee pods?"
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines",
    "56 billion single-serve pods end up in landfill each year": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2364812058779427000&xs=1&url=https%3A%2F%2Fhalo.coffee%2Fblogs%2Fblog%2Fis-recycling-aluminium-coffee-capsules-really-the-way-forward&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-recycle-nespresso-pods-and-why-you-absolutely-should",
    "Nespresso’s website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3922909293999585300&xs=1&url=https%3A%2F%2Fwww.nespresso.com%2Fus%2Fen%2Fhow-to-recycle-coffee-capsules&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-recycle-nespresso-pods-and-why-you-absolutely-should",
    "Podback": "https://www.podback.org/",
    "Keurig coffee makers": "https://www.techradar.com/news/keurig-k-compact-coffee-maker-should-i-buy-one"
  }
}