{
  "source": "https://www.techradar.com/news/dells-new-latitude-laptops-promise-improved-security-and-productivity-for-businesses",
  "title": "Dell's new Latitude laptops promise improved security and productivity for businesses",
  "category": "computing",
  "updated": "2021-01-07T06:19:36Z",
  "author": "anthony-spadafora",
  "summary": "New portfolio of intelligent PCs enable employees to work from anywhere securely",
  "article": [
    "Dell Technologies has unveiled a number of new business laptops in its Latitude line that provide users with enhanced security and productivity features while working from home or at the office.",
    "The company's new Latitude 9420 laptop includes a built-in speakerphone as well as camera enhancements that provide automatic light correction and background blur for improved video conferencing. The laptop is also the world's first PC with Intel Visual Sensing Technology which offers a more reliable auto wake and lock.",
    "Users looking for additional screen real estate may want to consider Dell's Latitude 7520 as it now comes with a 15-inch screen with a 4k UHD display as well as an optional FHD camera for video calls.",
    "SVP of Dell Technologies' Client Product Group Ed Ward provided further insight on the company's new intelligent PCs in a press release, saying:",
    "“People’s expectations of their technology continue to evolve. It’s why we push beyond barriers to create devices that offer better experiences and are more integrated into our lives. Our new intelligent PCs make it possible for us to work smarter and collaborate easier, so we can give our best selves in all that we do. Secure, sustainable and smart: that’s the way forward for PCs.”",
    "Dell is also working to make its PCs more secure and this begins at the factory with supply chain security and integrity controls to extend their built-in safeguards designed to prevent, detect and respond to malicious attacks below and above a device's operating system.",
    "Privacy is another important aspect when it comes to security which is why the Latitude 9420 and 9520 include the company's SafeShutter feature. SafeShutter is the industry's first automatic webcam shutter and it knows when to automatically open or close by syncing with a user's video conferencing software.",
    "Dell has also added its proprietary Dell Optimizer software to its new intelligent PCs to automatically fine-tune application performance, battery life, audio quality and connectivity using AI and machine learning. The latest Dell Optimizer updates make collaboration easier across the company's new device portfolio by adding intelligent background noise-cancelling and auto-mute as well as ExpressConnect to prioritize bandwidth to video conferencing apps in order to prevent dropped calls.",
    "The Latitude 9420 will be available in the spring starting at $1,949 (£1,434) while pricing for the Latitude 9520 has not yet been announced. The larger Latitude 7520 will be available on January 12 starting at $1,649 (£1,213)."
  ],
  "headers": {
    "5": "Laptops for secure work"
  },
  "links": {
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "press release": "https://corporate.delltechnologies.com/en-us/newsroom/announcements/detailpage.press-releases~usa~2021~01~20210105-dell-technologies-reimagines-work-with-new-pcs-monitors-and-software-experiences.htm#/filter-on/Country:en-us",
    "supply chain security": "https://www.techradar.com/news/dell-looks-to-crack-down-on-possible-supply-chain-security-attacks",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "Dell Optimizer software": "https://www.techradar.com/news/new-dell-latitude-9510-laptop-comes-with-5g-and-built-in-ai",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know"
  }
}