{
  "source": "https://www.techradar.com/news/a-peloton-rowing-machine-gets-mentioned-in-hidden-android-app-code",
  "title": "A Peloton rowing machine gets mentioned in hidden Android app code",
  "category": "fitness",
  "updated": "2021-08-22T09:30:55Z",
  "author": "david-nield",
  "summary": "Sounds like it's on the way",
  "article": [
    "It's long been rumored that a Peloton rower would be the next device in the series from the premium fitness brand – following the bike and the treadmill – and hidden code inside Peloton's Android app would seem to confirm that such a piece of equipment is indeed on the way.",
    "As spotted by 9to5Google, the latest Peloton app for Android includes references to starting positions for rowing strokes, as well as scenic backdrops that could accompany your virtual trip down a virtual river.",
    "It seems that two rowers are on the way, with the codenames Mazu and Caesar, and functionality in the app is being prepared to track stats for rowing sessions – these should include total strokes, max stroke rate, and average stroke rate.",
    "Talk of a Peloton rower has been swirling for years, and it's not difficult to understand why: a rowing machine is the obvious next choice for Peloton's range of equipment, given how popular they already are in terms of home and gym fitness.",
    "One eagle-eyed visitor to Peloton's research labs has already spotted a rower being developed, and last month a job listing at Peloton specifically mentioned rowers alongside bikes and treadmills – even though no such device has been announced.",
    "As for when the Peloton rower might become official, if the groundwork is being done in the Android app already then it can't be far away. An unveiling might happen before the end of the year – although of course company plans are always subject to change.",
    "You don't have to be an industry expert to work out why home fitness equipment remains phenomenally popular at the moment – for reasons that are obvious, we've all been spending more time stuck inside and less time outdoors (or down at the gym).",
    "While the Peloton Bike and Treadmill models are on the very expensive end of the scale, most reviews agree that the high entry cost is worth it: the combination of livestreamed classes and excellent build quality on the equipment itself seem to win most people over.",
    "Of course, other brands are available – we've got up-to-date deals on a range of exercise bikes and treadmills that you can check out – but Peloton seems keen to make the most of the home fitness boom before many of us head back to the local gyms or parks to make sure we're doing enough exercise.",
    "It's unlikely that Peloton will stop with the rower, too: there are rumors that it's busy working on a device to turn your television into a connected fitness class streamer, a set of weight training equipment, and a wearable for monitoring your heart rate."
  ],
  "headers": {
    "3": "What we know so far",
    "6": "Analysis: the home fitness boom continues"
  },
  "links": {
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "bike": "https://www.techradar.com/news/peloton-bike-vs-peloton-bike-plus",
    "treadmill": "https://www.techradar.com/reviews/peloton-tread",
    "9to5Google": "https://9to5google.com/2021/08/20/peloton-app-confirms-rower-prepares-scenic-waterways/",
    "already spotted": "https://connectthewatts.com/2021/02/21/peloton-rower-in-development-fortune-magzine-spots-rower-in-peloton-rd-lab/",
    "most reviews": "https://www.techradar.com/reviews/peloton-tread",
    "exercise bikes": "https://www.techradar.com/best/exercise-bike-deals",
    "treadmills": "https://www.techradar.com/best/best-treadmill-deals",
    "there are rumors": "https://www.pelobuddy.com/peloton-survey-focus-platform/",
    "monitoring your heart rate": "https://www.techradar.com/news/peloton-is-reportedly-working-on-a-heart-rate-monitoring-wearable"
  }
}