{
  "source": "https://www.techradar.com/news/android-games-are-coming-to-windows-11-with-google-play",
  "title": "Android games are coming to Windows 11 with Google Play",
  "category": "computing",
  "updated": "2021-12-10T11:32:36Z",
  "author": "daryl-baxter",
  "summary": "Google is going alone on this",
  "article": [
    "The Game Awards, hosted by Geoff Keighley, wrapped up last night, and it came with a fair share of surprises.",
    "Google was one of many companies to appear, announcing that Android apps from the Google Play Games store are coming to both Windows 11 and Windows 10 in 2022.",
    "This is an effort being made by Google itself. While Microsoft has an agreement with Amazon to host Android apps from the Amazon App Store on the redesigned Microsoft Store in Windows 11, this is a different approach from Google.",
    "This will be its own app, enabling users with a Google Play account to download their Android games without having to purchase them again. They can also resume where they left off in a game on their Windows device.",
    "Google was light on the details during The Game Awards, but the company did explain to The Verge that this will be available in Windows 10 and above.",
    "If you’re playing a game on your Pixel 6 Pro for example, and you decide to switch to your Windows device, you can carry on your progress through this new app from Google.",
    "“Starting in 2022, players will be able to experience their favorite Google Play games on more devices: seamlessly switching between a phone, tablet, Chromebook, and soon, Windows PCs,” Greg Hartrell, Product Director of Games on Android and Google Play explained in a statement. “This Google-built product brings the best of Google Play Games to more laptops and desktops, and we are thrilled to expand our platform for players to enjoy their favorite Android games even more. We’ll have more to share soon!”",
    "It’s a surprising move, but one that’s always seemed inevitable ever since the Amazon App Store was announced to be coming to the Microsoft Store in Windows 11.",
    "We have said before that it would be a matter of time before Google would be interested in bringing Android apps to Windows, but it’s much sooner than we were expecting from the company.",
    "Granted, this is just games from the Google Play Store for now, but it could be the start of other categories of apps eventually arriving on Windows.",
    "With Amazon apps already in testing on the Windows Insider developer channel, where you can test out features in development for Windows, it did seem that Google was the odd one out in this partnership. There were already unofficial efforts where you could run your Android apps in Windows 11.",
    "Google Play Games could make an impact on Windows, but that depends on whether the most popular games will be available. On the Google Play Store, games such as Candy Crush, Coin Master, and Monopoly constantly appear on the charts, so it’ll be important to see these arrive in this new app for Windows.",
    "It won’t be a stretch to see games such as Minecraft appear on the app as well, as it’s owned by Microsoft, but it does depend on whether developers want their games to appear on the app as well.",
    "As with other storefronts that users can visit on their Windows devices, such as Steam and Epic Games Store, it may be a challenge to showcase to users what the benefits of having Google Play Games on Windows will be. Some may think it is just another store that will clog up their PC.",
    "However, being able to resume your progress in Candy Crush may be a tempting feature for some. This effort could encourage Google to not only bring more games to this app but other categories from the Google Play Store in time as well."
  ],
  "headers": {
    "4": "How will the app work?",
    "8": "Analysis: It’s happening sooner than we expected"
  },
  "links": {
    "Game Awards": "https://www.techradar.com/news/the-game-awards-2021-the-biggest-announcements-and-reveals",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Microsoft has an agreement with Amazon to host Android apps": "https://www.techradar.com/news/why-windows-11-going-with-amazon-for-its-android-apps-and-not-google-is-a-masterstroke",
    "Android games": "https://www.techradar.com/best/best-android-games",
    "The Verge": "https://www.theverge.com/2021/12/9/22827037/google-android-games-windows-pc-google-play-games",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "unofficial efforts": "https://www.techradar.com/news/installing-android-apps-in-windows-11-is-now-much-easier",
    "Google Play Store": "https://play.google.com/store/apps/category/GAME?gl=GB"
  }
}