{
  "source": "https://www.techradar.com/news/lenovo-wants-to-jazz-up-your-old-fashioned-meeting-rooms",
  "title": "Lenovo wants to jazz up your old-fashioned meeting rooms",
  "category": "computing",
  "updated": "2021-08-23T19:30:35Z",
  "author": "anthony-spadafora",
  "summary": "Lenovo's ThinkSmart Core modular collaboration solution is now available",
  "article": [
    "As organizations begin implementing hybrid work policies, Lenovo has announced that its ThinkSmart Core collaborative solution is now available for companies looking to provide the best video conferencing experience in their meeting rooms.",
    "ThinkSmart Core is Lenovo's first modular room kit for meeting spaces that is both flexible and scalable. The collaborative solution is powered by the 11th Gen Intel vPro platform and is designed to deliver high performance and comprehensive hardware-based security features.",
    "In addition to being a certified solution for Microsoft Teams Rooms, ThinkSmart Core is available in two room kit configurations. The ThinkSmart Core + Controller kit is designed for workspaces already equipped with Teams-certified audio and visual devices while the ThinkSmart Core Full Room Kit also includes the company's ThinkSmart Cam and ThinkSmart Bar to offer high-quality video and immersive audio.",
    "Lenovo's ThinkSmart Core Full Room Kit can be used in huddle rooms, boardrooms and home offices though it can be scaled up further with an added table-top mic.",
    "Lenovo's ThinkSmart Core compute device, which is powered by an 11th Gen Intel Core vPro processor with a 256GB SSD, supports any meeting room and can be placed discreetly. The device also features integrated cable management and can even be wall mounted thanks to the inclusion of VESA mount capability.",
    "The ThinkSmart Controller on the other hand is a 10.1-inch point-to-point touchscreen powered by USB-C through a 10-meter cable. Through its integrated infrared sensors, the device can detect whenever participants enter the room and its stand offers both 30-degree or 60-degree viewing angles.",
    "The ThinkSmart Core Kit comes with a year of Lenovo's software and services including a license for its collaboration management software suite ThinkSmart Manager Premium and ThinkSmart Professional Services: Deploy and Maintain.",
    "Both the ThinkSmart Core + Controller and ThinkSmart Core Full Room Kit are now available in select markets but you will need to contact a local Lenovo representative for pricing details."
  ],
  "headers": {
    "4": "ThinkSmart Core"
  },
  "links": {
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "11th Gen Intel vPro": "https://www.techradar.com/news/intel-11th-gen-chips-offer-a-game-changing-security-upgrade",
    "Microsoft Teams Rooms": "https://www.techradar.com/news/new-microsoft-teams-integration-makes-for-even-more-elaborate-video-conferencing",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "USB-C": "https://www.techradar.com/deals/best-usb-c-adapters"
  }
}