{
  "source": "https://www.techradar.com/news/more-files-were-hacked-in-2020-than-the-previous-15-years-combined",
  "title": "More files were hacked in 2020 than the previous 15 years combined",
  "category": "computing",
  "updated": "2021-03-30T12:52:02Z",
  "author": "mayank-sharma",
  "summary": "Threat actors sense an opportunity as business are distracted by the pandemic",
  "article": [
    "Despite an increase in the spending on cybersecurity, the number of successful data breaches is at an all time high, according to a new report.",
    "Canalys’ report on cybersecurity notes that while security investments did outweigh several other IT segments in 2020, the year saw more successful data compromises than in the last 15 years combined.",
    "Canalys notes that while businesses increased their cybersecurity budgets by 10% to an industry-wide total of $53 billion in 2020, thanks to the pandemic they were forced to divert more funds towards business continuity and workforce productivity.",
    "“Cybersecurity must be front and center of digital plans, otherwise there will be a mass extinction of organizations, which will threaten the post-COVID-19 economic recovery,” said Canalys Chief Analyst Matthew Ball.",
    "The pandemic drove many businesses out of business and several others ensured their survival by implementing stringent measures, which usually involved curtailing the cybersecurity budget, says Canalys.",
    "This exposed businesses to attacks by organized threat actors as well as to opportunistic hackers.",
    "Ball believes that the under-investment in cybersecurity last year is manifesting in the form of an acceleration in ransomware attacks this year. He points to the ransomware attacks that specifically targeted hospitals to underline his point.",
    "Canalys looks at the increasing sophistication of the threats and the recent surge in ransomware attacks in the first part of the freely available report, as it examines the implications of the changing workforce dynamics in the post-pandemic workplace.",
    "Via: VentureBeat"
  ],
  "headers": {
    "4": "Prioritize security"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "data breaches": "https://www.techradar.com/news/best-data-protection-companies-2020",
    "workforce productivity": "https://www.techradar.com/best/best-productivity-apps",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "targeted hospitals": "https://www.techradar.com/news/ryuk-ransomware-returns-and-takes-multiple-us-hospitals-offline",
    "VentureBeat": "https://venturebeat.com/2021/03/29/canalys-more-data-breaches-in-2020-than-previous-15-years-despite-10-growth-in-cybersecurity-spending/"
  }
}