{
  "source": "https://www.techradar.com/news/expect-2021s-upcoming-android-phones-to-embrace-under-display-selfie-cameras",
  "title": "Expect 2021's upcoming Android phones to embrace under-display selfie cameras",
  "category": "phones",
  "updated": "2021-05-28T11:54:25Z",
  "author": "david-nield",
  "summary": "The new tech is expanding",
  "article": [
    "The next step forward for smartphone displays is to banish notches and punch-holes – and to do that, manufacturers need to find ways of putting a front-facing camera under the screen. According to one tipster, the second half of 2021 is when this will happen in a big way.",
    "The usually reliable @UniverseIce has tweeted that phones from Samsung, Xiaomi, Oppo, Vivo and ZTE are all going to come with under-display selfie cameras in the second half of the year, so there are a lot of innovative new products to look forward to.",
    "No mention of Apple and the iPhone in this particular leak – it's likely that Apple will wait until the technology is refined even further before using it, so the iPhone 13 will most likely still come with a notch (albeit a smaller one).",
    "One of the phones mentioned in the leak, the Xiaomi Mi Mix 4, was already rumored to be coming with an under-display camera, so it looks likely that these predictions are accurate – even if we can't say for sure until the products have actually launched.",
    "It's also worth noting that @UniverseIce is predicting that both the Samsung and Oppo models with cameras under the screen will be folding phones – so straight away that makes us think of the Samsung Galaxy Z Fold 3 as a prime candidate.",
    "The ZTE Axon 20 5G was the first phone to reach the consumer market with a camera embedded in the screen, though the photo quality from it wasn't particularly good. Today's leak hints that ZTE's next attempt will be much better.",
    "Of course getting a camera that can take good-quality pictures through a touchscreen is no easy task – it looks as though most manufacturers are exploring the idea of using a second screen built into the main one in order to make this work properly.",
    "The benefit is that the front of the phone can be all display, with super-thin bezels and no notches getting in the way of whatever's on screen. Once all of these phones appear, we'll be sure to test them and their selfie cameras rigorously."
  ],
  "headers": {},
  "links": {
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1384002765622448130",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "albeit a smaller one": "https://www.techradar.com/news/the-smaller-iphone-13-notch-shows-up-again-in-another-image-leak",
    "already rumored": "https://www.techradar.com/news/xiaomi-mi-mix-4-leaks-with-under-display-selfie-camera",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "ZTE Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "will be much better": "https://www.techradar.com/news/this-android-phones-under-display-selfie-camera-isnt-great-but-its-a-sign-of-the-future",
    "using a second screen": "https://www.techradar.com/news/a-future-samsung-phone-could-have-an-under-display-camera-based-on-this-patent"
  }
}