{
  "source": "https://www.techradar.com/news/how-my-phone-became-a-lifeline-after-major-surgery-and-how-it-could-do-even-better",
  "title": "How my phone became a lifeline after major surgery - and how it could do even better",
  "category": "phones",
  "updated": "2021-05-01T12:00:32Z",
  "author": "jennifer-allen",
  "summary": "Opinion: A change I wasn't expecting",
  "article": [
    "Phones are so useful, aren't they? We all already know that as they help us stay in touch with friends and family, help us find places easily, allow us to search for information about mostly everything, and they're fantastic for distracting us with streaming services and games.",
    "My phone is generally always by my side, but I didn't realize just how dependent I could become on it until earlier this year.",
    "A few days before Christmas last year, I needed to have fairly significant surgery for the first time in my life. I was given all the standard advice for anything that involves your abdomen -- don't bend, don't lift anything, wear loose clothes, rest as much as possible for the first few days.",
    "I still underestimated the effect it had on my body and how much I needed help. Having someone at home able to look after you helps, but sometimes, you just want to do the basics for yourself. That's where my smartphone became a miracle worker.",
    "Bed rest is simultaneously very tedious and wonderful while you're recovering from an operation. Getting out of bed feels like a military maneuver when you need to clutch a pillow to your stomach to feel vaguely stable enough to lift yourself up. I soon realized two handy things about my phone besides its ability to message my devoted temporary carer whenever I needed a drink.",
    "At its simplest, I could use my phone to set alarms for any time I was due more painkillers. I was told to make sure to take painkillers every four hours without fail. When you're napping and feeling rough, it's easy to forget. Forget and you end up regretting it. However, set a regular alarm and you’re covered when it comes to your lovely buildup of vital medication.",
    "My favorite feature though? Being able to control my bedroom lights. While the rest of the house has Philips Hue smart lighting scattered around, my bedroom has one Lifx smart bulb and that's all I needed.",
    "I was able to spin the dial on my Lifx app, I could choose to enjoy natural lighting if I wanted to or I could dim it to its darkest setting. Whenever I needed to get up in the night to go to the bathroom, I could take a moment to use the Lifx app rather than have to fumble for a light switch while a little shaky on my feet",
    "As the days went by, I grew stronger which meant I discovered more ways that my phone was useful. I didn't really have the energy to play a game or watch a film, so I took to Audible and podcasts.",
    "A quick 'Hey, Siri' and I could start listening to my favorites without bothering to stretch for my phone. A small yet mighty victory when I was still figuring out which movements my body hated me making.",
    "As my brain returned, I realized I could do even more than just listen to Audible. Thanks to my trusty carer, I moved my Eufy robotic vacuum cleaner to my bedroom. It's not the newest of robotic vacuum cleaners and it can't compete with a 'proper' vacuum cleaner given my cat's love of pulling fur out on a white carpet, but it's still useful.",
    "Lacking Siri support, I relied on Alexa this time around which took a brief bit of setup but wasn't too complicated for my recovering brain. It simultaneously gave me something to do while also making me feel like I was useful. Even if I was mostly instructing it to suck up breadcrumbs.",
    "I stumbled across the Holy Grail of recovery tools (my smartphone) by accident. As a freelance tech journalist, I should have thought of it all long before my surgery, but hey, I was busy worrying about the actual operation. Not the recovery. It’s amazing how much you take for granted until the ability is taken from you.",
    "If you’re ever called for a major operation - and you're given the benefit of some notice beforehand - I’d recommend setting up smart home gadgets to help smooth your recovery period.",
    "In hindsight, I actually wish my home had been smarter. I've postponed installing a Nest thermostat for too long. This would have been the ideal opportunity. Being able to warm my room from my bed without having to move a muscle? Perfect.",
    "Similarly, a Ring video doorbell would have been great to avoid that one time a few weeks in that I tried to rush down the stairs to answer the door and simply pushed my recovery back a few days and caused myself a lot of unnecessary pain.",
    "Smart blinds feel tempting too, although somewhat out of my budget when I could just leave the curtains shut during my bed-bound days and rely on smart lighting instead.",
    "As a long-term solution though? I'll see how things fare. It's certainly tempting if I continue to have flare-ups. Also, I can't stress enough how useful it is to have a long charging cable for your phone because otherwise, well, you've got a big problem in around just over a day (if you're lucky).",
    "Ultimately, my phone provided a strange source of companionship while also being immensely practical and helpful. It can't beat a real person, of course, but it was still incredibly useful.",
    "It became a lifeline in more ways than I anticipated. I'll likely need another operation again at some point in the future. Hopefully, it won't be for several years, but I fully plan on making my home smarter ready for that day. After all, who wants to be in pain when a swipe of their phone could have helped them out?"
  ],
  "headers": {
    "4": "A remote to my bedroom",
    "8": "Entertainment (and convenience) while recovering",
    "12": "My idea was half-baked, but I have plans"
  },
  "links": {
    "Philips Hue smart lighting": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "Lifx smart bulb": "https://www.techradar.com/reviews/lifx-smart-light-a19a60",
    "Nest thermostat": "https://www.techradar.com/reviews/gadgets/appliances/nest-learning-thermostat-1256380/review"
  }
}