{
  "source": "https://www.techradar.com/news/what-are-oneplus-phones-a-guide-to-the-company-and-its-smartphones",
  "title": "What are OnePlus phones? A guide to the company and its smartphones",
  "category": "phones",
  "updated": "2021-07-15T15:53:27Z",
  "author": "tom-bedford",
  "summary": "The brand with a strong fan base",
  "article": [
    "Of all the smartphone brands on the market, OnePlus has arguably the most passionate fan base (save, perhaps, for Apple). Its followers will often form long queues outside shops to pick up the company's device on launch day, and it has a bustling online community through OnePlus forums and Reddit.",
    "So what’s the attraction? Well, the brand originally became known for its ‘flagship-killer’ products, which offered top-tier features and specs for lower prices. For the past few years, OnePlus has even operated in the premium market it once sought to undercut.",
    "Now, new OnePlus handsets are some of the most hyped products of the year, with people clamoring to see the next big thing from the company, something OnePlus does its best to kindle with a slow tease of information in the run-up to launches.",
    "To help you understand more about OnePlus, including the products it releases, we run you through everything you need to know about the company.",
    "OnePlus was formed in late 2013, with the company releasing its first handset, the OnePlus One, in early 2014. The brand rapidly expanded, launching in new regions across 2014 and then putting out new phones on an annual basis.",
    "Part of the reason behind OnePlus’ speedily growing popularity was its ‘invite’ system for buying its smartphones – you had to sign up to receive an invite to purchase the phone. This created extra hype around OnePlus devices, akin to ‘forbidden fruit’ – although the scheme was dropped with the launch of the OnePlus 3.",
    "In 2018, OnePlus moved into non-phone products, launching its first wireless earbuds, which you can read more about further on.",
    "Alongside Oppo, Vivo and Realme, OnePlus is owned by a tech conglomerate BBK Electronics. Its biggest sibling from that list is Oppo. OnePlus has previously confirmed it shares R&D teams and manufacturing lines with Oppo, and often the brands' handsets bear more than a passing resemblance to each other.",
    "OnePlus’ flagship line of phones is its numbered one: the OnePlus 7 and 8, for example. In recent years, these phones have had a ‘Pro’ version accompanying the standard model, enabling the brand to sell to the high-mid-range and fully fledged premium market at time.",
    "The T-line of handsets, released roughly six months after the numbered line, takes the half-year-old phone and tweaks it little to encompass technological advances. The OnePlus 7T was an upgrade on the 7, and so on. OnePlus has always maintained that a T-series phone isn’t a definite release, but precedent suggests they’re all but guaranteed.",
    "In 2020, OnePlus launched the OnePlus Nord line of smartphones. These are mid-ranged devices, aimed at capturing the market segment the brand once held, but which it left with the increasing premium-ness ofits flagship line. There are some budget units in the Nord line, too.",
    "The numbered OnePlus phone series launches in the first few months of the year – typically April or March – with the T version of the device being released roughly six months later, around September or October.",
    "The Nord line doesn’t appear to have an annual cycle – although it’s pretty new, so we could see such a pattern over time.",
    "Generally, OnePlus phones are available the world over, although this isn't true of the Nord handsets, which have limited availability. The original OnePlus Nord wasn't released in the US, for example.",
    "Alongside its ranges of smartphones, OnePlus also makes wireless earbuds, such as the Bullets Wireless and Buds. These are designed for use with OnePlus phones, and are often pretty affordable.",
    "OnePlus is also taking its first steps into the wearable tech market, with the OnePlus Band fitness tracker already having been launched in certain countries, and the OnePlus Watch expected soon.",
    "We’ve also seen a range of OnePlus TVs, but these are available in only limited countries."
  ],
  "headers": {
    "4": "A brief history of OnePlus",
    "8": "What phones does OnePlus make?",
    "11": "OnePlus phone availability information",
    "14": "Other tech OnePlus sells"
  },
  "links": {
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "OnePlus 7T": "https://www.techradar.com/reviews/oneplus-7t",
    "7": "https://www.techradar.com/reviews/oneplus-7-review",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Bullets Wireless": "https://www.techradar.com/reviews/oneplus-bullets-wireless",
    "Buds": "https://www.techradar.com/reviews/oneplus-buds",
    "OnePlus Band": "https://www.techradar.com/reviews/oneplus-band",
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review"
  }
}