{
  "source": "https://www.techradar.com/news/final-fantasy-7-remake-ps5-upgrade-could-be-in-the-works-according-to-this-leak",
  "title": "Final Fantasy 7 Remake PS5 upgrade could be in the works, according to this leak",
  "category": "gaming",
  "updated": "2021-02-25T15:36:12Z",
  "author": "hamish-hector",
  "summary": "And it could make an appearance at Sony State of Play",
  "article": [
    "According to a new leak, an upgraded version of Final Fantasy 7 Remake could be headed to the PS5 and PS4 - and it might even be unveiled at today’s State of Play.",
    "Initially posted on 4Chan before being shared on Reddit (via GamesRadar), a supposed press release details 'Final Fantasy 7: Ever Crisis' which is described as being the “definitive edition” of Final Fantasy 7 Remake. According to the 'leaked' press release, Ever Crisis will include a Performance mode, two new chapters - Chapter 8.5 \"All Dressed Up\" and Chapter 19 - as well as a new boss battle, Photo Mode, a new set of trophies, Materia Quick Change and full DualSense support on PS5.",
    "This matches up with previous reports we've seen from sites like Gematsu and GamesRadar that Final Fantasy 7 Remake DLC could be on the way - alongside a PS5 port - though as with any leak it's worth taking this all with a pinch of salt. Still, if it is true, this could be very exciting for any Final Fantasy fans out there.",
    "We can’t say for certain either way right now but there are a few details that could shine a light on if this Final Fantasy 7: Ever Crisis leak is real or a hoax.",
    "Adding legitimacy to the leak we have the reports that Square Enix has trademarked ‘Ever-Crisis’ in multiple regions according to Gematsu. This term felt like it could fit Final Fantasy 7 Remake DLC - Crisis has shown up in Final Fantasy 7 spinoffs such as Before Crisis: Final Fantasy 7 and Crisis Core: Final Fantasy 7 - alongside another trademarked term ‘First Soldier’ - which is seemingly a reference to the Final Fantasy 7 organization and Sephiroth.",
    "It’s possible that the leaker knows this and just added Ever-Crisis to give their hoax legitimacy. Even if this is the case, the trademarks could still come to something and we might get Final Fantasy 7 Remake news related to them soon.",
    "Also in the hoax camp, we have the supposed release date for the definitive edition - April 10, 2021 - being exactly one year after Final Fantasy 7 Remake released. April 10 2021 is also a Saturday which isn’t normal for modern releases, which typically release on a Tuesday or Friday. While neither of these facts rules the leak out completely, it feels a little too convenient.",
    "It won't be long until we know for sure, as the leak claims that Ever Crisis will be revealed today at Sony State of Play. Make sure to check out our guide on how to watch Sony State of Play to catch all the action live."
  ],
  "headers": {
    "3": "Is this Ever Crisis leak legit?"
  },
  "links": {
    "Final Fantasy 7 Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "State of Play": "https://www.techradar.com/news/final-fantasy-7-remake-ps5-upgrade-brings-new-story-content-and-visual-upgrades",
    "Reddi": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/lrxe6p/final_fantasy_vii_remake_ever_crisis_for_ps4ps5/?utm_source=share&utm_medium=web2x&context=3",
    "t": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/lrxe6p/final_fantasy_vii_remake_ever_crisis_for_ps4ps5/?utm_source=share&utm_medium=web2x&context=3",
    "GamesRadar": "https://www.gamesradar.com/uk/final-fantasy-7-remake-reportedly-coming-to-ps5-and-pc-with-new-story-content/",
    "DualSense support": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Gematsu": "https://www.gematsu.com/2021/01/square-enix-trademarks-ever-crisis-the-first-soldier-and-shinra-logo-in-japan",
    "how to watch Sony State of Play": "https://www.techradar.com/news/final-fantasy-7-remake-ps5-upgrade-brings-new-story-content-and-visual-upgrades"
  }
}