{
  "source": "https://www.techradar.com/news/new-resident-evil-movie-details-have-us-scared-for-all-the-wrong-reasons",
  "title": "New Resident Evil film details have us scared for all the wrong reasons",
  "category": "entertainment",
  "updated": "2021-08-31T14:40:07Z",
  "author": "hamish-hector",
  "summary": "We're quaking in our boots",
  "article": [
    "New images and details about Resident Evil: Welcome to Racoon City have been released, thanks to a new interview with writer and director Johannes Roberts at IGN.",
    "Roberts, known for his work on 47 Meters Down and The Strangers: Prey at Night, promised fans that this reboot would focus on horror rather than the sci-fi action of previous films – with a story and characters that more closely match what fans know from the Resident Evil games.",
    "These comments are sure to excite plenty of those who adore Resident Evil, as will the images showing off our first look at iconic characters like Leon Kennedy, Claire Redfield, and her brother Chris Redfield – each bearing some resemblance to their video game appearances.",
    "Still, while some fans will be eagerly anticipating Welcome to Racoon City, we aren’t quite sold on it based on this first look.",
    "While Roberts is saying the right things with references to how Resident Evil 2 Remake, The Exorcist, and The Shining all provided inspiration for his movie, we can’t help but feel nervous. It could just be that the long history of terrible video game adaptations has worn us down (especially with respect to Resident Evil), but we aren’t optimistic for how this flick will fare – and this isn't just based on our past experiences of seeing games make it to the big screen.",
    "Welcome to Raccoon City will supposedly combine the stories of Resident Evil 1 and 2 into a single film. At first glance, this doesn’t appear to be a bad idea given how much the adventures tie together, but this certainly wouldn’t be our choice of games to intertwine.",
    "Resident Evil 1’s horror is driven by the unknown. Sure, the S.T.A.R.S. operatives are expertly trained fighters, but the monsters they encounter on the grounds of an abandoned mansion are completely new to them and the player. The claustrophobic corridors and halls of the setting create the perfect hiding spots for creatures to lie in wait, and our heroes have to explore further in order to discover the origins of the monsters that hunt them.",
    "Meanwhile, Resident Evil 2 induces a sense of hopelessness with its apocalyptic-style, city-scale horror adventure. We know about the zombies from the start, and we (for the most part) know how to kill them – but the sheer number of mutated abominations swarming the city center creates an insurmountable threat that Leon and Claire have no real hope of defeating. The situation feels especially dire for our protagonists as any allies they meet are quick to suffer some terrible fate, a possible harbinger of doom for our heroes.",
    "One starts as a haunted house story, and the other is about a city already on the brink of total ruin. There are definite points of cross-over and similarity between the tales, but making them work in tandem tonally will be a big challenge for Roberts. Then there's the question, of course, of whether the games' stories have enough meat on their bones to make for a great movie.",
    "As a veteran horror director and writer, Johannes Roberts could be the creator who ensures this adventure works as a cohesive unit but, unfortunately, his past body of work doesn’t instill us with confidence. Horror is always divisive as not everyone will find the same scenarios as scary as someone else, but his past movies are generally rated mixed-to-negative on Rotten Tomatoes (with films like The Strangers: Prey at Night and 47 Metres Down rated just 40% and 53% respectively on the site).",
    "Finally, and most jarringly, we have that the released stills that make the characters look like mediocre cosplayers. While the outfits worn by Kaya Scodelario and Avan Jogia as Clair and Leon would wow at a Halloween Party, we expected more from the budget of a full-length cinematic feature.",
    "We know that the addition of effects and acting could help to sell the look when the full film arrives, but it’s yet another factor that makes us sit on the more pessimistic end of the scale. That being said, we want it to be good – and we'd be happy to take back our skepticism if it reviews well.",
    "Distributor Sony Pictures will likely be desperate for this film to succeed, and not just to ensure the movies' box office draw. Sony's next big video game adaptation is 2022's Uncharted, starring Tom Holland, and it won't want to put viewers off seeing more adaptations of their favorite games with a Resident Evil misfire.",
    "We’ll have to just wait and see what Resident Evil: Welcome to Raccoon City has in-store for us when it releases in cinemas on November 24 (US), November 25 (Australia), and December 3 (UK)."
  ],
  "headers": {
    "5": "Zombies aren’t all we should worry about"
  },
  "links": {
    "IGN": "https://www.ign.com/articles/resident-evil-welcome-to-raccoon-city-characters-cast-photos",
    "Rotten Tomatoes": "https://www.rottentomatoes.com/celebrity/johannes_roberts",
    "The Strangers: Prey at Night": "https://www.rottentomatoes.com/m/the_strangers_prey_at_night",
    "47 Metres Down": "https://www.rottentomatoes.com/m/47_meters_down"
  }
}