{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-lite-5g-listing-reveals-power-and-screen-specs",
  "title": "Xiaomi Mi 11 Lite 5G listing reveals power and screen specs",
  "category": "phones",
  "updated": "2021-03-03T09:56:45Z",
  "author": "james-rogerson",
  "summary": "Mid-range through and through",
  "article": [
    "The Xiaomi Mi 11 has already launched, but for those who don’t want to spend big bucks on a new smartphone it looks increasingly like a Xiaomi Mi 11 Lite is on the way, and we now have a much clearer idea of some of the key specs.",
    "Mukul Sharma (a leaker with a solid track record) posted a screenshot of a listing for the Xiaomi Mi 11 Lite 5G found on the Google Play Console. That’s a tool that developers use to publish apps on Android, and details of phones listed on there are likely to be accurate.",
    "As for what this listing includes, it mentions that the Xiaomi Mi 11 Lite 5G has a 1080 x 2400 screen, runs Android 11, has 8GB of RAM, and has a Snapdragon 765G chipset. That chipset is notable because previous rumors had pointed to either the Snapdragon 775G or the 755G.",
    "We would therefore take this information with a pinch of salt, but as sources go it’s arguably the best we’ve seen so far for Mi 11 Lite information.",
    "In any case, those specs paint the picture of a mid-range phone, which is what we’d expect from the Xiaomi Mi 11 Lite 5G. We’ve also previously heard that it could have a 64MP main camera, 5x optical zoom, an OLED display, and up to 256GB of storage.",
    "It’s worth noting though that a 4G model of the Xiaomi Mi 11 Lite has also been rumored, and looks like it could have quite different specs, so depending on where you are you might have a choice of Xiaomi Mi 11 Lite devices, or be stuck with just one or the other.",
    "Hopefully the situation will become clear soon, but right now we’re not sure exactly when the Xiaomi Mi 11 Lite will launch. With all the leaks though we’d expect it before long, and it might land alongside the Xiaomi Mi 11 Pro and the Xiaomi Mi 11 Ultra, so Xiaomi fans could have a lot to look forward to.",
    "Via GizmoChina"
  ],
  "headers": {},
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 11 Lite": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "Mukul Sharma": "https://twitter.com/stufflistings/status/1366936435224236034",
    "previously heard": "https://www.techradar.com/news/xiaomi-mi-11-could-have-a-lite-model-and-the-budget-phone-has-finally-leaked",
    "has also been rumored": "https://www.techradar.com/news/xiaomi-mi-11-lite-might-launch-in-march-without-a-key-mi-11-feature",
    "Xiaomi Mi 11 Pro": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/news/xiaomi-mi-11-ultra-leak-shows-off-a-phone-with-120x-zoom-and-a-second-screen-for-selfies",
    "GizmoChina": "https://www.gizmochina.com/2021/03/03/xiaomi-mi-11-lite-5g-spotted-at-google-play-console-with-key-specifications/"
  }
}