{
  "source": "https://www.techradar.com/news/why-you-should-get-a-smartwatch-now-lockdowns-are-easing",
  "title": "Why you should get a smartwatch now lockdowns are easing",
  "category": "wearables",
  "updated": "",
  "author": "michael-sawh",
  "summary": "Feature-packed smartwatches can make life easier",
  "article": [
    "COVID isn't going anywhere soon, but the world is learning day by day how we might need to live with the virus and try to get back to some sort of normality.",
    "The gradual easing of lockdowns around the world has meant journeys, no matter how long, that you wanted to do but couldn't, can start to happen again. We can resume exploring, adventuring and feeling like the world is there to start enjoying again.",
    "It also means it's time to start thinking more about what goes with you as you start to venture further afield.",
    "Strapping one of the best smartwatches to your wrist might not sound like the first thing you'd think about doing, but these connected timepieces have come a long way.",
    "There's actually very good reasons why you should have one now that it's a little easier to get around.",
    "Remember when we were all doing home workouts, trying to find the last kettlebell available to swing and trying to mountain climb ourselves out of boredom?",
    "Now is the time to fill those lungs with fresh air on a more regular basis and get sweaty outside.",
    "It doesn't have to be a big walk, lacing up your running shoes or getting on your bike. You could get off the land and get into the water.",
    "Going for a dip has plenty of mental as well as physical benefits. The good news is that if you've got your smartwatch on, many are now capable of capturing open swim time so you always have a record of the time you decided to brave it and jump into that lake.",
    "We spent a lot of time staring at big screens and our phones at home, and while smartwatches still mean staring at albeit significantly smaller displays, they can help you to spend less screen time overall and engage with them when you actually really need to.",
    "You can use them to better filter the stream of notifications that catch your eye. Pay attention to the messages and emails that matter or ignore them altogether, make use of quick replies, or send a simple emoji response to deal with calls so you can focus on the things that matter.",
    "Ultimately, smartwatches won't close the door on communication with the world, but they can help you be more selective about who and when you do that communicating.",
    "Smart assistants live in our homes, our phones and they're present on our smartwatches too. Their presence on our wrists though just doesn't get spoken about as much.",
    "Maybe they should because while you might not feel all that comfortable taking a call from a watch, these voice-enabled helpers are getting much better at their job.",
    "So much so you can now turn to them to do more than simply set a reminder to pick up some milk on the way home later.",
    "They're bringing greater context to those conversations making it much more useful to connect other features on your smartwatch and actually better understand some of your more complex demands.",
    "Your smartwatch doesn't have to be a way to help you spend less time on your smartphone or somewhere to quickly check your daily step count progress.",
    "Increasingly, smartwatches are becoming better at keeping you safe, whether you're with others or travelling solo.",
    "They're bringing increased safety features that make it easier to raise the alarm and let the ones closest to you know when you might be in some trouble.",
    "More smartwatches are embracing what it means to be a companion and that includes being something to turn or glance at when things don't feel quite right.",
    "Yes, your phone can do it and you’ve probably got a cluster of contactless cards to make those transactions less cumbersome.",
    "The smartwatch has the power to replace your wallet, purse or the loose change in your pocket when you need to grab an impromptu lunch.",
    "Just make sure your smartwatch of choice plays nice with your favored bank and take the time to get things set up. You won't regret having another way to pay contactlessly, and without reaching into your pocket.",
    "Being able to get on a plane in Covid times has brought with it a few more extra checks and things you need to remember to carry with you.",
    "One thing that hasn't changed is keeping your boarding pass nearby. Just as a smartwatch can replace the funds in your wallet, it can also be a place to stop you worrying about where you put that paper version of your boarding pass.",
    "You'll have a tougher time misplacing it when it's already stored on your watch. Just make sure you pick it up out of that tray after you pass through the security checks."
  ],
  "headers": {
    "5": "1. Take that exercise outside",
    "9": "2. Spend less time on your phone screen",
    "12": "3. Use your voice to get things done",
    "16": "4. Stay safe as you return to travel",
    "20": "5. Pay by watch",
    "23": "6. Make airport travel a breeze"
  },
  "links": {
    "best smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074"
  }
}