{
  "source": "https://www.techradar.com/news/dead-space-remake",
  "title": "Dead Space remake release date, trailer, platforms and everything you need to know",
  "category": "gaming",
  "updated": "2021-07-23T10:25:25Z",
  "author": "adam-vjestica",
  "summary": "The Necromorph nightmares of Dead Space return",
  "article": [
    "In space, no-one can hear you scream, but the Dead Space remake announcement will have certainly caused a few fans to let out a few shrill, Necromorph-like screeches of joy.",
    "Developed exclusively for the next-generation of consoles, Dead Space returns as a full remake, completely built from the ground up using the Frostbite game engine. Players can expect heightened levels of immersion, heart stopping horror and a number of improvements to the 2008 original.",
    "EA says that the new Dead Space will improve the game's story, characters and gameplay mechanics, but we'll have to wait and see how exactly that will be achieved.",
    "\"The Dead Space franchise made a huge impact on the survival horror genre when it was released 12 years ago, and I came to Motive as a fan first to specifically work on this game,\" said Phillippe Ducharme, senior producer of Dead Space.",
    "According to Ducharme, the potential of the next-gen consoles is what has the team really excited about what the Dead Space remake can deliver.",
    "\"We have a passionate team at Motive who are approaching this remake as a love letter to the franchise,\" Ducharme said. \"Going back to the original and having the opportunity to do so on next-gen consoles excited everyone on the team.\"",
    "Ducharme revealed that the game has been developed with input from Dead Space fans.",
    "\"As we look to modernize the game, we've reached out to dedicated fans and invited them to provide us with feedback since the early stages of productions to deliver the Dead Space game they want for new players to enjoy as well.\"",
    "It’s been eight years since we joined protagonist Isaac Clarke in Dead Space 3, but after the third game flopped at retail and with critics alike, developer Visceral Games’ sci-fi survival horror series was dead in more than name alone.",
    "EA later disbanded the studio, and it seemed like the future of Dead Space was destined to be suspended in animation. However, in a surprise announcement at its EA Play Live event, the publisher’s mini-E3 style conference, Dead Space is back – and it looks just as terrifying as we’d hoped.",
    "This Dead Space remake has likely come about from Capcom’s successful Resident Evil 2 reboot, which is as fine a muse as any. But will it be able to recapture the same magic that left players quaking in their space boots when they first stepped onto the abandoned USG Ishimura in 2008?",
    "Keep close to that airlock – we’re about to run through all the Dead Space remake news that has been announced so far.",
    "Dead Space is expected to be released sometime during 2023, though this is just speculation for now. EA revealed the game without a release date during its EA Play Live event, which took place on June 22, 2021. The 2023 window is based on the understanding that the game is very early in development – but it's an educated guess. The series has been on hiatus since 2003, and original developer Visceral Games has since been disbanded.",
    "The fourth entry in EA’s survival horror series will be released on PS5, Xbox Series X/S and PC, and is being developed by Motive Studio.",
    "We’ve rounded up all the latest Dead Space remake trailers so you can watch them collected in one place. We’ll continue to add more trailers of the upcoming survival horror game below, so sit back, turn the lights down low, and get reacquainted with the world of Dead Space.",
    "Dead Space official teaser trailer We got our first look of the Dead Space remake at EA Play Live 2021. You can check it out below.",
    "Dead Space looks set to recreate the intense and unnerving third-person horror action which the series was renowned for. Claustrophobic and narrow space station corridors have the potential to house all sorts of nasties, otherwise known as Necromorphs. Thankfully the best way of stopping these sinewy fiends will still be by amputating their limbs with the Plasma Cutter, and various other weaponry should help you keep any other hostile creatures you encounter at bay.",
    "Another tool in Isaac’s arsenal is the environment itself. The Dead Space series has always encouraged players to use explosive canisters, airlocks, and other crude means to turn the tide against encroaching enemy creatures, especially as ammo is always scarce. Just don’t forget to drive your foot through the head of any fallen enemies, or risk them coming back to haunt you at a later date.",
    "If you’re new to the Dead Space series, the premise for the game’s story is rather simple. Humanity has exhausted all of Earth’s natural resources and has headed into space to find new materials to keep the world turning. Researchers discover a mysterious alien artifact known as the Marker, a limitless source of energy which could solve Earth’s ongoing ecological crisis. Unfortunately, inevitably, things don’t go as planned, and you’re left fighting for your life in the cold, dark reaches of space against a hostile alien lifeform.",
    "In Dead Space, Isaac boards the USG Ishimura, only to make a horrific discovery. The ship's crew has been slaughtered by an alien scourge, and Isaac's partner Nicole is somewhere on board. Isaac has to rely on his engineering skills and tools to uncover exactly what has happened on the USG Ishimura, while clinging onto his own sanity.",
    "In an interview with IGN, Motive Studio has outlined how the Dead Space remake will take full advantage of the PS5, Xbox Series X/S and latest PC hardware. \"In terms of visuals, sound, gameplay, everything, we are rebuilding all of these assets,\" said creative director Campos-Oriola. \"We are not porting them, it's not uprezzing the texture or adding more polygons to the model. It's really rebuilding all these elements, shooting all the animations, et cetera.\" Campos-Oriola also said that the Dead Space remake will utilize the super-fast SSD storage available on the next-gen consoles to create a seamless experience from start to finish.",
    "\"We want to make that immersion even deeper with a fully interactive experience, from the start screen to the end credits. We don't want anything to pull you out of the experience and we don't want any cuts,” Campos Oriola said. [The faster SSDs should mean] there's not going to be any loading. There's not going to be any moment where we're going to cut your experience, where we're going to cut your camera. You can play it from the start screen to the end credits seamlessly.\" But how else will the power of the PS5 and Xbox Series X make Dead Space feel more immersive? Well, like any good horror game, audio will be significantly improved and Dead Space will include support for 3D audio.",
    "\"We wanted to use the sounds you're used to [in the original Dead Space] as well and improve those sounds, and improve this immersion so the sounds of the door that you're hearing, the sound of the health bar, the sound of the creatures... we're building on top of the original and recreating it, but [we] make sure it is true to the original and that we are honoring the legacy of the original game,\" said senior designer Phillipe Ducharme. Ducharme also went on to explain how 3D audio will help add to the game's sound design.",
    "\"3D audio [will also add the] understanding of where the sound comes from, having the right propagation, in the corridors, making it come from the vents above you, or behind you. These are all things that we'll be able to expand on to increase the level of immersion.\" The new Dead Space could also feature evolved dismemberment mechanics, which was a famed feature of the original. Players could slice off limbs of the various Necromorphs that Isaac encountered, and this combat pillar could become gorier and evolve further.",
    "\"Something that is also really important for us that was not there 12 years ago... is all those options or different ways to play the game if you need it. All those elements of accessibility will definitely be something important for us in terms of opening the Dead Space experience to a broader set of people that didn't necessarily have the opportunity or could play the game when it came out,\" Campos-Oriola said.",
    "Want to know the latest Dead Space news and updates? We’ve gathered up all the big details you need to be aware of below, as well as information on the team making the game.",
    "Dead Space remake will be designed with fan feedback in mind",
    "In a move that's sure to please Dead Space fans, the team at Motive Studio has said that the community will be involved in actively helping guide the development process. Speaking to IGN, senior producer of Dead Space Phillipe Durcharme said: \"We don't want to be in siloed and create our own bubble of the game we're making. So from the conception, we've reached out to members of the community to create a community council to be a sounding board for what we were making. Making sure that if we're deciding to make a change, we want to be able to explain it and get told if, ‘No, what are you doing? What were you thinking? You're actually breaking the game, why are you changing this,'\" Ducharme explained.",
    "And it seems like the team has already benefited from this community-led approach. \"...we've received some extremely valid feedback from that group. We're trying to meet with them on a two, three week basis to show them content and have that ongoing discussion. And they've had access, unfiltered access, to what we're making from a very early point in production,” Ducharme continued. Having early feedback on the title will prove invaluable, according to Ducharme, who noted that fan feedback often comes when a game is almost done or already shipped. By striking up a constant dialog with fans, Ducharme believes the Dead Space remake will benefit greatly. \"Usually, when we receive feedback, the game is almost shipped or done and you're like, ‘Aw, I wish I knew that. I could have fixed this, what they're saying, that it's not good,’\" Ducharme said.",
    "Creative director Roman Campos-Oriola went on to say: \"There's always that element of being a little scared of showing [your work], but like Phil said, what's really cool is you discover a thing that otherwise you might have discovered reading Reddit two weeks after launching the game,\" Campos-Oriola said. \"But also it's really energizing for the team… because when you show something and you get feedback and good reactions on what you're doing, it gives you that energy to go, \"’Okay, that's cool. Let's keep pushing that.’\" Dead Space remake won't include microtransactions Developer Motive Studio has said that the Dead Space remake won't include microtransaction, a controversial aspect of Dead Space 3 which arguably led to the series' downfall. Speaking to IGN, senior producer of Dead Space Phillipe Durcharme said: \"We're also learning from mistakes such as microtransactions, which we will not have, for instance, in our game,” and reiterated that the team “never” has plans to introduce microtransactions in any way to the remake. It's encouraging to see that EA is stepping back from its past trend of stuffing microtransactions into its games, something which Star Wars Battlefront 2 was heavily criticized for upon release. Our take",
    "We first heard rumour of a Dead Space remake at the start of July, 2021, when rumors began circulating that EA’s Motive studio, the team behind Star Wars: Battlefront II, were behind the resurrection. This followed on from author and game designer Jeff Grubb (of Forgotten Realms fame) revealing some kind of remake was in the works at Motive.",
    "The game series resurgence is, just as it was with the original Dead Space games, in a large part thanks to Capcom’s Resident Evil series. The recent Resident Evil remakes have provided a model for EA to follow, taking the spirit of the originals, but firing them up with modern graphical niceties and gameplay mechanics. The Resident Evil franchise generally is in rude health too – not just with the remakes, but through the popularity of Resident Evil 7, and Resident Evil Village breathing new life into the horror series. EA will want its part of that pie, and will likely be feeling renewed confidence in single-player-focussed titles, given the success of Star Wars: Jedi Fallen Order.",
    "As for Motive’s pedigree here? Well, it had been working alongside original (now-defunct) Dead Space developer Visceral Games on a now-canned Star Wars title, so it would have certainly taken some learnings from that team. The Motive team as it exists today is only responsible for two games – the redeemed Star Wars: Battlefront II, and the superb space flight sim Star Wars: Squadrons. Despite both being multiplayer-first games, both feature surprisingly meaty single-player campaigns. Motive can certainly tell a good story in space – whether or not they can tell a scary one remains to be seen.",
    "We’ll continue to update this article with more Dead Space information, so make sure you check back regularly for the latest announcements.",
    "New to Dead Space and can't wait for the remake to release? You can play the entire series on EA Play, which is included as part of Xbox Game Pass Ultimate. Dead Space, Dead Space 2 and Dead Space 3 are all available as part of the subscription on Xbox consoles and PC, so if you're curious about the series, you can give it a go before the remake releases."
  ],
  "headers": {
    "12": "Dead Space remake: Cut to the chase"
  },
  "links": {
    "EA Play Live event": "https://www.techradar.com/news/ea-play-games-list-here-are-all-the-ea-play-2021-game-trailers",
    "E3": "https://www.techradar.com/news/e3-2021",
    "IGN": "https://www.ign.com/articles/dead-space-remake-gameplay-story-ps5-xbox-tech-details",
    "Star Wars: Battlefront II": "https://www.techradar.com/news/star-wars-battlefront-2-ea-review",
    "Resident Evil 7": "https://www.techradar.com/news/resident-evil-7-review",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Star Wars: Jedi Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "Star Wars: Squadrons": "https://www.techradar.com/news/if-star-wars-squadrons-cant-save-vr-gaming-nothing-can",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate"
  }
}