{
  "source": "https://www.techradar.com/news/new-ps5-system-update-finally-makes-the-sony-pulse-3d-wireless-headset-a-must-buy",
  "title": "New PS5 system update finally makes the Sony Pulse 3D Wireless Headset a must-buy",
  "category": "gaming",
  "updated": "2021-09-14T14:07:52Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Supercharge your sound",
  "article": [
    "Sony’s latest PS5 system update delivers a number of pleasing changes that vastly improve the overall user experience. From expanding the internal storage with an SSD for PS5 to vertical Trophy lists, I’ve been testing out a beta version of the system update for the past few days – and I must admit, many of the qualms I had with the PS5’s UI have mostly been resolved.",
    "But what I didn’t expect this new system update to dramatically improve was the PS5 Sony Pulse 3D Wireless Headset. In fact, it makes such a difference that I believe anyone who owns Sony’s official PS5 headset will greatly benefit, and it means I can now strongly recommend the Pulse 3D to those who might be considering picking up a PS5 headset in the future. And that wasn’t previously the case.",
    "I’d purchased the Pulse 3D Wireless Headset in the past on a whim, only to send it back due to the headset’s volume being frustratingly quiet. This isn’t just a problem related to Sony’s official headset, though: I’ve consistently found that headsets are quieter overall on PS5 compared to the likes of Xbox Series X and PC, which can make some headsets more difficult to drive, and often leaves me wanting more “oomph” from certain cans when gaming.",
    "My initial first impressions of the Pulse 3D Wireless Headset were exactly the same as before: it was painfully quiet, even when listening at max volume, which meant that games like Resident Evil Village and Returnal sounded far more muted than I would have liked.",
    "After finding the new equalizer presets, which can be found by going to ‘Sound’ in the PS5’s Control Center, the EQ presets available include ‘Standard’, ‘Bass Boost’, ‘Shooter’ and three customizable slots called ‘Audio Mode’. After flicking between Bass Boost and Shooter, one thing immediately stood out: the headset was noticeably louder. However, it wasn’t as dramatic as I’d like, which led me to creating my own Audio Mode preset.",
    "What followed was a slight Eureka moment.",
    "While I’d never usually commit the cardinal sin of sliding every EQ band up to max, the PS5’s equalizer doesn’t really impact the headset’s sound signature as clearly as the Xbox Wireless Headset’s EQ does. But what it does do is significantly increase the volume of the headset whenever you raise each slider. And that’s proven to be a game changer.",
    "After settling on a V-shaped style EQ, which essentially helps to boost the low and high-end frequencies, I’ve found that it’s helped bring some of my favorite PS5 games to life in the audio department, particularly those with native 3D Audio support. More importantly, there’s the flexibility to lower and raise the volume depending on the game I’m playing without maxing out.",
    "The combination of being able to tailor the frequencies of the 3D Pulse Headset as well as it resulting in a much-needed boost to overall volume has suddenly made Sony’s official headset my go-to cans for gaming on PS5. Resident Evil Village can now make the hairs on my neck stand on end with its chilling audio, and I can pick out threats in Returnal far easier simply using sound alone. Switching back to the ‘Standard’ EQ only serves to outline just how damn quiet Sony’s cans were before.",
    "One caveat that’s worth mentioning, though, is that bass is still pretty limited on the 3D Pulse Headset, particularly compared to the eardrum thumping lows that the Xbox Wireless Headset can provide. The new EQ won’t fundamentally change that, however, I’ve found that spatial audio benefits most when the higher end frequencies aren’t drowned out by too much low-end. So ultimately, that isn’t a deal breaker for me.",
    "Sony’s system update brings more pleasing changes to PS5 owners, but if you care about 3D audio and have lamented the Pulse 3D Wireless Headset’s subpar volume level, things are about to get a lot louder in the near future."
  ],
  "headers": {
    "3": "Listen up",
    "6": "Crank it",
    "9": "Bass facts"
  },
  "links": {
    "PS5 system update": "https://www.techradar.com/news/ps5s-long-awaited-new-system-update-lets-you-upgrade-your-storage-on-september-15",
    "SSD for PS5": "https://www.techradar.com/best/best-ssd-for-ps5",
    "Sony Pulse 3D Wireless Headset": "https://www.techradar.com/reviews/ps5-pulse-3d-wireless-headset",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Xbox Wireless Headset’s EQ": "https://www.techradar.com/news/best-xbox-wireless-headset-eq-settings-dial-in-the-perfect-sound",
    "Xbox Wireless Headset": "https://www.techradar.com/reviews/xbox-wireless-headset-review"
  }
}