{
  "source": "https://www.techradar.com/news/lg-oled-tvs-embrace-cloud-gaming-with-google-stadia-and-geforce-now-support",
  "title": "Google Stadia and GeForce Now streaming services come to LG smart TVs",
  "category": "televisions",
  "updated": "2021-02-10T14:39:56Z",
  "author": "henry-st-leger",
  "summary": "LG embraces the cloud",
  "article": [
    "LG TVs are getting a massive boost in cloud gaming support, with the OLED TV maker confirming that both Google Stadia and Nvidia GeForce Now will be coming to its screens in the coming months.",
    "Both of these game streaming services – which allow players to stream games over an internet connection, rather than deal with massive downloads – would be notable news by themselves, but bringing both in the same year is certainly a big play.",
    "Google Stadia launched to no small amount of hype in 2019, though its growth has been somewhat slow, with a limited lineup of Stadia games and a pay-per-title business model rather than an all-you-can-eat buffet (though you can get Destiny 2, Assassin's Creed Valhalla, and Cyberpunk 2077, among others). You can get 1080p streaming and stereo sound on the free / base tier, but need to pay a monthly fee to get 4K resolution and and 5.1 surround sound.",
    "Nvidia GeForce Now launched around the same time, if because of a handful of delays – but it's a much more accessible service up front. There's a Free tier which enables you to stream games you already own on Steam without Stadia's monthly subscription fee; the paid-for Founders edition ($4.99 per month in the US) fast-tracks you past server queues and even enables ray tracing (something you won't get on Stadia).",
    "Stadia has something of a sleeker interface, as well as a stylish Stadia controller, but GeForce Now's ability to stream games you already own may tempt many to opt for it over Google's service. Either way, the fact that LG has opted for both, rather than pick one service to back, will only be good for consumers in the long run – and helps cement LG's reputation as a maker of gaming TVs.",
    "LG has made no secret of its gaming ambitions, with its 2020 OLED TVs boasting a sub-1ms input lag and featuring Nvidia's G-Sync technology for reducing screen tears for PC-connected play.",
    "This latter feature definitely only affected a minority of gamers, though – something our Computing Editor took a strongly negative view on. It does, however, seemed to have lain the groundwork for more fruitful collaboration between Nvidia and LG.",
    "There's competition for both services, of course, with Microsoft's Cloud Gaming (formerly Project xCloud) service now being bundled for free with Xbox Game Pass Ultimate, and allowing you to stream Xbox Game Pass games on a multitude of different devices. If you're in the Xbox ecosystem, it's a no brainer, but we expect there'll be room for more than one game streaming service in the long run (even if PS Now barely gets a look in these days).",
    "PS5 and Xbox Series X game consoles will supply competition too, with LG's 2021 OLED TVs coming with four HDMI 2.1 ports, VRR (variable refresh rate), and a \"Game Optimizer\" function to keep input lag below 1ms.",
    "Both Google Stadia and Nvidia GeForce Now are slated to land on LG TVs in the second half of 2021. We'll be sure to update you when more specific timings are announced."
  ],
  "headers": {
    "5": "A long time coming"
  },
  "links": {
    "LG TVs": "https://www.techradar.com/best/best-lg-tv",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Nvidia GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "Stadia games": "https://www.techradar.com/news/best-google-stadia-games",
    "Destiny 2": "https://www.techradar.com/news/destiny-2-release-date-news-and-rumors",
    "Assassin's Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Stadia controller": "https://www.techradar.com/reviews/google-stadia-controller",
    "gaming TVs": "https://www.techradar.com/news/best-gaming-tv",
    "took a strongly negative view on": "https://www.techradar.com/news/lg-is-bringing-nvidia-g-sync-to-a-bunch-of-oled-tvs-we-think-thats-a-mistake",
    "Project xCloud": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox Game Pass games": "https://www.techradar.com/best/best-xbox-game-pass-games",
    "PS Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know"
  }
}