{
  "source": "https://www.techradar.com/news/the-best-games-like-diablo-to-play-while-waiting-for-diablo-4",
  "title": "The best games like Diablo to play while waiting for Diablo 4",
  "category": "computing",
  "updated": "2021-03-14T12:00:38Z",
  "author": "robert-zak",
  "summary": "With rivals like these, Diablo 4 will have a tough time reclaiming the ARPG throne",
  "article": [
    "If you’re reading this then you probably know that Diablo 4 is coming, Diablo 2 is being resurrected, and it’s not long until Mephisto, Baal, Diablo and the old team will try to recapture our hearts, minds and souls like previous games in the series.",
    "But there is a problem for Blizzard and Diablo - a bunch of them, in fact. Because in the intervening decade since Diablo 3, a lot of games have built on its DNA of looting, power-levelling and ploughing through endless enemy swarms. And some of those games have done it really well.",
    "There are a lot of Diablo alternatives that not only scratch that Diablo itch, but may make it tricky for the de facto king of the genre to rule again. Here are ten of them.",
    "There’s no point postponing mention of the game that’s the most direct Diablo rival out there. Path of Exile is slower and more complex than Diablo 3, focusing instead on a seemingly infinite pool of character customisation and glorious endgame that can keep its hooks in you for years. You could also make the case that Path of Exile’s grimdark aesthetic is more true to Diablo 2 than Diablo 3 was.",
    "Path of Exile takes full advantage of being an online-only game thanks to a great player economy where any rare item you pick up may be of great value to another player. The community is huge, and you can have some great fun joining some random players for some questing.",
    "It’s completely free too, except for cosmetic gubbins.",
    "If you prefer steampunk over high fantasy, and believe a blunderbuss would make a fine off-hand accompaniment to a sword, then take a gander at Grim Dawn. The gothic Victorian theming gives it a flavour quite unlike anything else on this list, while retaining that moreish hack-and-slash-and-loot gameplay loop.",
    "Grim Dawn is for those who have grown tired of Diablo 3’s infinite scaling and relative ease. This is a tougher game, with a tougher grind that’s ultimately more rewarding for those seeking a challenge. The class system is interesting too - Inquisitors? Occultists? Combine the two to get a Deceiver? Color us intrigued.",
    "Made by a studio of Diablo alumni, Runic Games’ Torchlight series was always going to have an almost preternatural understanding of what made Diablo great. Torchlight 2 abandons the dark Diablo aesthetic for a bold high-fantasy style, but the compelling simplicity of combat combined with intricacy of character building is all there.",
    "Torchlight 2 isn’t as deep, gruelling or complex as some of the entries on this list - more like an old-school Diablo with pretty colors than a trailblazing ARPG - but a fine old itch-scratcher. And yes, there is a Torchlight 3, but it improves so little over its predecessor that it doesn’t justify the substantially higher price tag.",
    "This may be the biggest deviation from the classic ARPG formula on this list, but ploughing through ravenous hordes of Skaven in liquid-smooth first-person combat recretes that intense, endorphin-releasing combat that drew us to Diablo 2 all those years ago. Vermintide 2 is visceral and bloody, and its roster of five distinct heroes battling evil in a grimdark world pretty much echoes the classic Diablo setup.",
    "Vermintide 2 is often compared to Left 4 Dead, but that doesn’t quite do justice to its satisfying levelling system, loot variety and other tidbits of RPG depth. If you find Diablo a bit wanting in the skill department, then this will give you the extra challenge you crave.",
    "Mixing roguelike elements with hack-and-slash dungeon crawling, Children of Morta is a beautiful pixel-art game telling the story of a family of gifted warriors taking on a fast-spreading evil. You’ll die more here more in one evening than you would in an entire Diablo 3 run on normal difficulty, but each time you do you get a little more story and resources to level up your characters.",
    "Like Diablo, Morta has a fixed set of heroes for you to choose from, but encourages you to use all the characters on a single run, which is actually something Blizzard’s series could learn from. It’s a wonderful game to play in couch co-op too.",
    "There are few games that manage to look so dramatically different to Diablo while being so clearly descended from it. Borderlands may look like a zany cel-shaded first-person shooter, but behind that stylistic facade it’s a numbers-based looter RPG where you traverse a hostile world and mow down swathes of very mad enemies in pursuit of those rare gun drops.",
    "You pick from several preset heroes, each specialising in different things like crowd control, support, DPS and other familiar ARPG traits. Comprehensive skill trees let you mod your hero to your liking, and playing alongside three friends really ramps up the frenzied feeling, elevating this series to one of the best co-op experiences in gaming.",
    "If you’re looking for an endless and satisfying grind to sink months (or even years) into, then Destiny 2 might be a better match than Borderlands. Its personality is more ‘classic sci-fi’ and slick, but the feel of the guns, the high-flying combat, and raiding with your friends is almost unrivalled.",
    "Seeing as it’s been around for a couple of years and had a lot of updates, there’s a lot to get your head around with Destiny 2’s different currencies, game modes and inventories, but give it some time and you’ll eventually get pulled into its impressive future-industrial universe.",
    "A quirky twist on the dungeon-crawler, Book of Demons slims things down by keeping your hacky-slashy hero on rails as he traverses dungeons, caves and other murky subterranea.",
    "The combat takes a moment to adjust to, but once it clicks you start to see how this harnesses that old-school Diablo feel with its own clever twists. The card-based skill system, for example, is a great alternative to typical skills and equipment, offering a ton of build options and flexibility about how you progress your hero.",
    "It looks beautiful too, with a paper cutout art style that really comes to life when your whole screen is ablaze with magic and explosion.",
    "Ancient Greek mythology is fast becoming the most well-trodden fictional-historical setting in video games, and Titan Quest puts it through the loot-em-up meat grinder to great effect. It’s a stylish setting, where you rip apart hydras, cyclops’ and satyrs just like you did Diablo’s demonic legions.",
    "Titan Quest is pretty ancient now, but 2016’s Anniversary Edition smooths out the rough edges and gives those gleaming weapons and ambery hue of Greece’s arid countryside a nice warm glow. It’s pretty simplistic as ARPGs go, but the theme and presentation make it a treat to tear through.",
    "The second Warhammer game on this list is more closely aligned with the traditional Diablo formula, with its isometric-style perspective and focus around loot and builds. If you find the grind of endgame a bit tiring, then you’ll be happy to hear that Martyr scraps that in favour of a tight well-told campaign that you can still sink plenty of hours into.",
    "Being set in the 40k universe, it’s all boltguns, chainswords and Space Marines, as you pick from three distinct classes to rip your way through the rusting hulls and moulding planets of the grim far future. The standalone Prophecy expansion is also worth a look if you enjoyed the main campaign."
  ],
  "headers": {
    "3": "1. Path of Exile",
    "6": "2. Grim Dawn",
    "8": "3. Torchlight 2",
    "10": "4. Warhammer: Vermintide II",
    "12": "5. Children of Morta",
    "14": "6. Borderlands series",
    "16": "7. Destiny 2",
    "18": "8. Book of Demons",
    "21": "9. Titan Quest",
    "23": "10. Warhammer 40,000: Inquisitor - Martyr"
  },
  "links": {
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "Path of Exile": "https://store.steampowered.com/app/238960/Path_of_Exile/",
    "Grim Dawn": "https://store.steampowered.com/app/219990/Grim_Dawn/",
    "Torchlight 2": "https://store.steampowered.com/app/200710/Torchlight_II/",
    "Vermintide 2": "https://store.steampowered.com/app/552500/Warhammer_Vermintide_2/",
    "Children of Morta": "https://store.steampowered.com/app/330020/Children_of_Morta/",
    "Borderlands": "https://store.steampowered.com/app/8980/Borderlands_Game_of_the_Year/",
    "Destiny 2": "https://store.steampowered.com/app/1085660/Destiny_2/",
    "Book of Demons": "https://store.steampowered.com/app/449960/Book_of_Demons/",
    "Titan Quest": "https://store.steampowered.com/app/475150/Titan_Quest_Anniversary_Edition/",
    "second Warhammer game": "https://store.steampowered.com/app/527430/Warhammer_40000_Inquisitor__Martyr/"
  }
}