{
  "source": "https://www.techradar.com/news/amd-ryzen-5000",
  "title": "AMD Ryzen 5000 release date, price, benchmarks and specs",
  "category": "computing",
  "updated": "2021-07-15T13:31:42Z",
  "author": "jackie-thomas",
  "summary": "AMD continues its winning spree",
  "article": [
    "Releasing on November 5, 2020, the AMD Ryzen 5000 series of processors have been gracing us with its presence for some time now. Its mid-range and high-end CPUs, in fact, are already powering such popular desktop PCs as the Alienware R10 Ryzen Edition and a gaming laptop such as the ASUS ROG Zephyrus Duo SE, as there’s a big focus for this newly-launched lineup of processors on gaming.",
    "With the AMD Ryzen 5000 CPUs, AMD has finally dethroned Intel when it comes to raw gaming performance. The new CPU lineup is led by the AMD Ryzen 9 5950X, a high-end chip packed with 16 cores and 32 threads, with a whopping 4.9GHz boost clock. That's a pretty massive generational leap over the Ryzen 9 3950X already, before you consider the boost to IPC (instructions per clock) performance, thanks to the massive Zen 3 redesign.",
    "At CES 2021, AMD also unleashed the mobile editions of the Ryzen 5000 series, promising big things like longer battery life, and “the only 8-core x86 CPU for ultrathin laptops”. That’s not all. AMD has most recently unveiled its first Ryzen 5000 series desktop APUs or processors with built-in graphics, coming at a time when all manufacturers are struggling to replenish GPU inventory. Though PC builders will have to wait as these will only be available for pre-built systems initially.",
    "Now that all the processors have hit the streets and we're in the process of running all of them through our lab, we can share everything you need to know if you want to upgrade to AMD's new hotness. Stock remains scarce, however, so also check out our guides like where to buy AMD Ryzen 7 5800X and where to buy AMD Ryzen 9 5900X to help you find stock if you’re struggling to take one of these home.",
    "AMD Ryzen 5000 series processors hit the streets on November 5, 2020, heralded by the AMD Ryzen 9 5950X and Ryzen 9 5900X. However, we've seen some availability issues, and it could be a while before you can get your hands on them.",
    "As for the Ryzen 5000 APUs, these launched on April 13, 2021 for pre-build systems. AMD is promising that the processors will be made available for home built PCs \"later this year.\"",
    "Here are the prices of the AMD Ryzen 5000 series of processors:",
    "These are slightly higher prices than AMD Ryzen 3rd Generation chips, which also saw higher prices than Ryzen 2000. Here are the prices AMD Ryzen 3000 chips launched at for comparison:",
    "Zen 3 marks one of the biggest architecture redesigns we've seen in a single generation. These new AMD Ryzen 5000 processors are still based on the same 7nm manufacturing process as the Ryzen 3000 chips that hit the market in 2019.",
    "The main focus of this redesign was to boost IPC performance in order to attain single-core performance that could finally topple Intel. While a good portion of this was through incredibly complicated work reducing prediction latency and implementing faster code fetching, a huge part of it is the way AMD redesigned the die itself.",
    "You see in AMD Zen 2 processors, each Compute Die (CCD) had two Core Complexes (CCX), which each had 4 cores and 16MB of L3 cache. This means in single-core workloads, the core would only have direct access to 16MB of cache, and would have to reach outside of the CCX if more was needed. With Zen 3, however, each CCX now has 8 cores and 32MB of L3 cache, so the amount of cache that each individual core has direct access to has doubled. This cuts latency down dramatically and boosts single-core performance higher than we've ever seen.",
    "For instance, in our testing, the AMD Ryzen 9 5900X is around 15-20% faster than the Ryzen 9 3900X in single-core benchmarks, and manages to completely obliterate the Intel Core i9-10900K pretty much across the board.",
    "This obviously also results in faster gaming performance, too, as the best PC games are still heavily dependent on clock speed and single-core performance. In our testing, both the Ryzen 9 5900X and Ryzen 7 5800X were about 7-9% faster than the Core i9 10900K in the games we tested. We haven't seen this much of a jump in gaming performance for processor in a while, and it mean that AMD now makes the best processor for gaming.",
    "We're still working on the reviews for the Ryzen 5 5600X and Ryzen 9 5950X and we'll update this article as soon as we're done testing those. We've also included our Ryzen 5000 benchmarks and specs below for your reference.",
    "AMD talked up a big game when it came to Ryzen 5000 mobile CPUs at its CES 2021 launch, which are aimed at gamers, creatives and general users. When it comes to productivity apps, AMD promises a decent advantage over the Intel Core i7-1165G7, and a big leap over previous Ryzen 4000 mobile processors.",
    "The full lineup of AMD Ryzen 5000 mobile processors is below:",
    "AMD struggling to restock its Ryzen 5000 desktop CPUs hasn’t stopped it from releasing its lineup of desktop processors with radeon graphics. With these Ryzen 5000 APUs finally on the shelves – at least for pre-build systems, those who are struggling to get a hold of a Ryzen chip or a Radeon graphics card will have alternatives on-hand.",
    "Though initially released for pre-builds, these APUs should be made available for purchase later in 2021, as per AMD, which means that gamers building their own PCs should be able to get their hands on one then."
  ],
  "headers": {
    "4": "AMD Ryzen 5000 release date",
    "6": "AMD Ryzen 5000 price",
    "8": "AMD Ryzen 5000 specs and performance",
    "14": "AMD Ryzen 5000 mobile processors",
    "16": "AMD Ryzen 5000 desktop APUs"
  },
  "links": {
    "Alienware R10 Ryzen Edition": "https://www.techradar.com/reviews/alienware-aurora-r10-ryzen-edition",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "ASUS ROG Zephyrus Duo SE": "https://www.techradar.com/reviews/asus-rog-zephyrus-duo-15-se-gx551",
    "Zen 3": "https://www.techradar.com/news/amd-zen-3",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "available for pre-built systems initially": "https://www.techradar.com/news/amd-ryzen-5000g-processors-are-official-but-you-wont-be-able-to-buy-one",
    "where to buy AMD Ryzen 7 5800X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-7-5800x-find-stock-here",
    "where to buy AMD Ryzen 9 5900X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-9-5900x-and-5950x-find-stock-here",
    "availability issues": "https://www.techradar.com/news/the-amd-radeon-rx-6800-xt-might-run-into-the-same-rtx-3080-stock-issues",
    "Intel Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "best PC games": "https://www.techradar.com/news/best-pc-games"
  }
}