{
  "source": "https://www.techradar.com/news/microled-vs-oled-the-battle-of-the-high-end-display-tech",
  "title": "Micro LED vs OLED: the battle of the high-end display tech",
  "category": "televisions",
  "updated": "2021-05-07T11:59:48Z",
  "author": "bill-thomas",
  "summary": "Can the next-gen TV tech Micro LED beat out OLED?",
  "article": [
    "Micro LED, a new kind of TV tech, is here. But will 2021 finally be the year it hits mainstream TVs?",
    "Ever since we set eyes on Samsung’s ‘The Wall’ at CES 2018 we’ve been looking forward to seeing whether this exciting new panel tech catches on in such a competitive market – or gets left behind in favor of less expensive alternatives.",
    "Fast-forward to the present day and ‘The Wall’ is back. During a spate of announcements ahead of CES 2021, Samsung unveiled a new Micro LED set that can be wall-mounted without professional installation – and looks to be putting its modular design to good use.",
    "What’s important is this isn’t the only example of Micro LED tech. Augmented reality and wearable tech developer Vuzix has announced its newest pair of smart glasses at CES 2021, which are powered by microLED tech.",
    "What's more, Apple has reportedly been playing around with Micro LED tech to add into a future version of the Apple Watch (although it wasn’t added to the Apple Watch Series 6).",
    "Finally, it’s also being used in film-making – as we explored recently during the filming for The Mandalorian.",
    "At this point, you might be wondering “what about OLED?” And, “I just sold my house to buy an OLED TV, will my wife/husband/significant other be mad at me?”",
    "Don’t worry – it doesn’t look like Micro LED is going to replace OLED any time soon, as it’s still in the very early stages and nowhere near mass production.",
    "So, with all of the unfounded (at least for a while) fears out of the way, let’s explore what exactly Micro LED is, what it’ll be used for, and whether or not it will one day replace OLED.",
    "To put it simply, Micro LED takes traditional LEDs and shrinks them down to the microscopic level. Now, that might not seem all that impressive on first glance, but because of how small these LEDs are, and the fact that they’re self-emitting, microLED is able to produce a picture with brightness that rivals OLED – without any of the downsides that come with using an organic substance.",
    "This means that you won’t have to worry about a Micro LED display degrading over time. A Micro LED display, barring outside forces, will stay at its peak brightness with no natural degradation. You also won’t have to worry about images burning into the screen, which will be a boon for anyone playing games, or even for smartphone and smartwatch manufacturers who would otherwise have to worry about UI elements reducing the lifespan of their devices.",
    "The only problem here is that it’s currently extraordinarily difficult to manufacture any kind of screen using Micro LED – even for robots. For a standard 55-inch panel, you’re looking at millions of Micro LEDs that need to be placed perfectly. Misalignment can lead to uneven lighting and colors, so until manufacturers can cross this hurdle, we likely won’t see this technology in the mainstream.",
    "Not to be confused with QLED TV, Samsung's other premium panel technology, which you can see plenty of in this year's new Samsung TVs, along with the Mini LED technology being utilized in their backlights.",
    "The biggest thing that separates Micro LED and OLED is the price. It wouldn’t make much sense to manufacture lots of TVs using Micro LED technology – so OLED takes the win there, as it can literally be printed.",
    "There’s also the issue of longevity. OLED, because it uses an organic compound that naturally decays over time, doesn’t last forever. This is an issue, primarily because when you spend thousands of dollars on a high-end TV, you’re doing so under the assumption that you’re making an investment that will last a while. And, while you likely won’t see any degradation within the first 5 years or so of using your device, it’s not going to stay like that.",
    "That’s not to mention the burn in. As gaming becomes more and more popular, with devices like the Nintendo Switch bringing in people who may have never played games before, burn in is going to start making a lot of headlines – especially as the price of OLED displays comes down. Micro LED doesn’t have this problem. It’s just a shame that Micro LED is so far away from being implemented into consumer televisions.",
    "However, it’s a completely different story when it comes to mobile tech. Both Apple with its Apple Watch and Google with its rumored Google Glass comeback, are investing in Micro LED technology – even if we haven't seen any solid evidence of it yet. This could be where Micro LED is going to shine within the next couple of years.",
    "That being said, however, don’t expect the first generation of Micro LED wearables to be cheap – Apple is going to need to recoup the cost of research somehow.",
    "This is what everything has been building towards. If you’ve been paying attention, you might be sitting comfortably thinking that your OLED display is going to be future-proof, but we wouldn’t be too sure.",
    "When it comes to the short term – over the next five years or so – OLED is probably going to stay the king of high-end TVs. This is mainly because of the cost involved with making panels right now.",
    "Samsung’s 'The Wall' has been an awesome showcase of the technology, but it's still unlikely to be an affordable or viable option for many people. That's changed with the 2021 version of 'The Wall', which is now modular and, importantly, can be wall-mounted without professional installation. But it's design and price point mean it's not going to hit the mainstream TV buying market anytime soon.",
    "However, once the manufacturing technology catches up, and Micro LED panels don’t cost a fortune to make, we think OLED is going to go the way of Plasma when LED took the market by storm. If consumers can buy a TV that’s going to last longer, have the same picture quality – and they don’t have to worry about leaving static images on the screen? It’s pretty easy to see why that’s an attractive offer.",
    "While Micro LED might not be taking over TVs anytime soon, the mobile phone market might be in for a shake-up.",
    "In 2017, the iPhone X made waves with its gorgeous OLED display, and we all know that the second it’s viable, Apple is going to implement microLED into its iPhones – it’s already investing in the technology. OLED was used first in phones as well, dating back to around 2005. We’ll see Micro LED start off in mobile tech, and move into televisions sometime in the next 10 years – then it’s all uphill from there.",
    "Conversely, Micro LED tech might only be a viable option for film-making, which means we might not see much evidence of it at all in our day-to-day lives.",
    "In 2020, we reported that, according to The Hollywood Reporter, Sony has announced a pair of new Crystal LED modular direct view displays that could make virtual movie production – of the kind used to create the digital sets in The Mandalorian – a far more widespread method of filmmaking.",
    "Look, we’re not telling you to avoid buying an OLED display. In fact, OLED displays are behind some of the best 55-inch TVs and best 65-inch 4K TVs you can buy today. We likely won’t see Micro LED make its way into consumer devices for a very long time (if at all), so holding off on a TV if you need one right now doesn’t make much sense.",
    "However, we do think it's worthwhile to look towards the future to try and predict the tech that’s going to be on our radar in the next decade – it’s all in the name.",
    "We just can’t wait to see what the future holds for Micro LED, and we would love nothing more than to get our hands on a TV powered by it."
  ],
  "headers": {
    "9": "What is Micro LED?",
    "13": "Micro LED vs OLED: considering cost",
    "18": "Will Micro LED replace OLED?",
    "26": "OLED or Micro LED, who's the winner?"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "newest pair of smart glasses": "https://www.techradar.com/news/ces-2021-these-microled-smart-glasses-might-be-the-coolest-weve-seen",
    "Apple Watch": "https://www.techradar.com/news/apple-is-reportedly-developing-its-own-thinner-brighter-screens",
    "Apple Watch Series 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "filming for The Mandalorian": "https://www.techradar.com/news/the-mandalorians-microled-displays-could-kill-off-the-green-screen-for-good-heres-why",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "QLED TV": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "rumored Google Glass comeback": "https://www.techradar.com/news/google-glass-comeback-could-be-powered-by-over-eye-micro-led-displays",
    "Samsung’s 'The Wall'": "https://www.techradar.com/news/samsung-has-a-microled-tv-that-can-split-into-four-different-screens",
    "2021 version of 'The Wall'": "https://www.techradar.com/news/samsung-has-a-microled-tv-that-can-split-into-four-different-screens",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "dating back to around 2005": "https://www.edn.com/electronics-news/4323246/OLEDs-Replacing-LCDs-in-Mobile-Phones",
    "we reported that": "https://www.techradar.com/news/the-mandalorians-microled-displays-could-kill-off-the-green-screen-for-good-heres-why",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/behind-screen/sony-unveils-crystal-led-displays-for-virtual-production",
    "best 55-inch TVs": "https://www.techradar.com/best/55-inch-4k-tv",
    "best 65-inch 4K TVs": "https://www.techradar.com/news/best-65-inch-4k-tvs"
  }
}