{
  "source": "https://www.techradar.com/news/an-nft-just-sold-for-dollar69-million-making-beeple-the-third-most-valuable-living-artist",
  "title": "An NFT just sold for $69 million, making Beeple the 'third most valuable living artist'",
  "category": "computing",
  "updated": "2021-03-12T11:19:36Z",
  "author": "joel-khalili",
  "summary": "NFT mania has reached stratospheric new heights",
  "article": [
    "A non-fungible token (NFT) has been sold at auction house Christie’s for a record-breaking $69.3 million.",
    "The token in question acts as proof of ownership of a digital collage by Mike Winkelmann (aka Beeple), who has produced and published a unique print every day since May 2007.",
    "According to Christie’s, the sale places Beeple “among the top three most valuable living artists,” behind only David Hockney and Jeff Koons. Until October, the most Beeple had ever fetched for a print was $100.",
    "The sale represents the first time an established auction house has paired a digital-only work with an NFT and also the first time cryptocurrency has been used to make a purchase of this kind.",
    "Beeple’s collage, entitled Everydays: The First 5,000 Days, also obliterated the record for the most expensive NFT. The previous record-holder was an NFT in the CrytoPunks series, which was flipped for $7.56 million.",
    "Although NFTs have been around for many years, only in recent weeks have begun to capture the attention of the public and gain traction with artists.",
    "Minted and stored primarily on the Ethereum blockchain, NFTs are unique representations of digital properties that allow for ownership to be traced and verified. They cannot be erased (unless specifically designed to self-destruct) and nor can they be duplicated or divided.",
    "This cocktail of attributes has provided digital artists with a new way to monetize their works and secure ongoing royalties in the event their pieces are sold on in secondary markets.",
    "“Artists have been using hardware and software to create artwork and distribute it on the internet for the last 20+ years, but there was never a real way to truly own and collect it, said Beeple, in a statement published by Christie’s.",
    "“With NFTs that has now changed. I believe we are witnessing the beginning of the next chapter in art history, digital art.”",
    "However, NFT mania has raised eyebrows in some quarters, with many struggling to understand why someone might spend millions of dollars on a digital artwork that can be found online with ease.",
    "Others have pointed to the potential for fraud and abuse, the likelihood of a dip in the value of NFTs and the environmental impact of minting tokens on the Ethereum blockchain.",
    "Whether NFTs end up having a material impact on the art industry will likely hinge on the ability of marketplaces and other major players to address these sorts of concerns.",
    "Via New York Times"
  ],
  "headers": {
    "5": "Beeple NFT"
  },
  "links": {
    "NFT": "https://www.techradar.com/news/what-is-an-nft-non-fungible-tokens-explained-and-why-you-shouldnt-dismiss-this-fad",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "NFT mania": "https://www.techradar.com/news/nfts-are-seriously-hot-right-now-but-were-falling-into-a-familiar-trap",
    "New York Times": "https://www.nytimes.com/2021/03/11/arts/design/nft-auction-christies-beeple.html"
  }
}