{
  "source": "https://www.techradar.com/news/imessage-in-2021-what-could-it-learn-from-whatsapp-and-other-messaging-apps",
  "title": "iMessage in 2021: what could it learn from WhatsApp and other messaging apps",
  "category": "phones",
  "updated": "2021-04-25T20:00:48Z",
  "author": "david-lumb",
  "summary": "Will iOS 15 upgrade iMessage to a social media network?",
  "article": [
    "While we wait for the sizeable iOS 14.5 update, details about the even bigger iOS 15 update expected toward the end of the year have leaked in a Bloomberg report, which suggested that Apple is working on iMessage upgrades that will make it more of a social network to compete with global messaging platforms like WhatsApp.",
    "iMessage is still superior to other messaging apps in some categories – most notably security given its end-to-end encryption and back-end improvements continually made through iOS 14, as Forbes explained. iMessage also works pretty well across Apple’s device ecosystem, with message synchronization and interactions possible on screens great and small.",
    "So what could Apple learn from rival messaging services?",
    "There are obvious answers, like bringing iMessage to Android – something Apple has resisted for the better part of a decade, new evidence has shown. Extending it to another mobile operating system could be seen as losing a unique feature to iPhones and iPads.",
    "But the less obvious changes could revolve around the ‘social media’ direction Bloomberg reported – a direction that many messaging services evolved into, like WhatsApp, Line, and others. Here are the big ways iMessage could likewise evolve from a robust messaging service to something much more.",
    "When we say ‘social media,’ we don’t necessarily anticipate iMessage to go full Facebook – but given how aspects of social media have crept into other messaging services, it makes sense for Apple’s to finally follow suit. While most messaging apps tick off some basic ‘social media’ requirements to exchange messages, photos, and videos directly with other users, some have added other ways of public sharing and expression.",
    "For instance, WhatsApp and Line have personal profiles visible to other contacts, let users put up status messages, and have some sort of content history across a timeline (whether that’s posts or stories). Through this, a personal narrative emerges, along with opportunities for other users to interact with each other.",
    "Apple’s already laid the groundwork for some of these interactions – if you’ve opted to share fitness activity with contacts with the health app, you’ll get prompted to respond when they finish a workout and vice versa. It would make sense to exchange or publicly post similar activities, even ones that aren’t tracked through Apple devices or products.",
    "There are other social media features that iMessage is already primed to engage with – it already does group messaging and more complex conversation interactions, like message replies. It also has a well-integrated and secure payment system through Apple Pay, which seems primed to empower a public exchange like Facebook Marketplace.",
    "Since iMessage was introduced with iOS 5 in 2011, it’s never been offered on Android, with the same reasons offered year after year – most commonly that limiting it to Apple devices allows the company to ensure security and end-to-end encryption from sender to receiver. Android users have coveted iMessage, if only to get rid of the ‘green bubble’ telling Apple device users that the conversation was over SMS after iPhone Elitism grew around folks who could have iMessage-enabled ‘blue bubble’ conversations.",
    "We’ve heard differently now: documents made public as a result of the Epic Games vs. Apple lawsuit in the US reveal that an SVP of Apple Software and Services argued in 2013 that iMessage should be cross-platform, only to get shouted down by other executives who claimed that iMessage was “the #1 most difficult [reason] to leave the Apple universe.”",
    "Apple continues vying for the top slot for most smartphones sold per year, and its device revenues continue to break records – its Q1 2021 quarterly earnings reported $81 billion in iPhone, Mac, and iPad sales ($65 billion for Apple’s smartphones alone), so those Apple executives were savvy to keep iMessage exclusively within the company’s ecosystem as another value addition.",
    "But keeping iMessage on Apple devices also just makes life easier for Apple. No compatibility worries or laboring over security snafus. No laborious chat migrations across operating systems, a feature that’s just coming to WhatsApp 12 years after it was first released.",
    "In other words, we wouldn’t bet on iMessage’s growth into ‘social media’ to require Apple to expand it to the Android userbase, especially as device sales continue – especially in markets Apple continues trying to expand into, like China, which saw the highest increase in revenue from Dec 2019 to Dec 2020, according to that Q1 2021 earnings report. Apple could just expand iMessage for all the iPhone, iPad, Apple Watch, and Mac users out there – leaving Android users with greener bubbles of envy.",
    "To be clear, we may not see iMessage drastically change with iOS 15 – the Bloomberg report notes that the upgrades are still early in development, and could come ‘later’ – though whether that’s months after in a big update (perhaps its own iOS 15.5) or years down the line is impossible to say."
  ],
  "headers": {
    "5": "Social media: the next frontier",
    "9": "iMessage on Android: will it ever happen?"
  },
  "links": {
    "details": "https://www.techradar.com/news/ios-15-tipped-to-bring-upgrades-to-notifications-and-the-ipad-home-screen",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-04-22/apple-plans-notifications-ipad-home-screen-upgrades-for-ios-15?sref=HrWXCALa",
    "Forbes": "https://www.forbes.com/sites/zakdoffman/2021/02/06/whatsapp-beaten-by-new-imessage-update-for-apple-iphone-users/?sh=5b9cb9865698",
    "Epic Games vs. Apple lawsuit": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "reveal": "https://www.techradar.com/news/why-apple-doesnt-want-imessage-on-android-phones",
    "Q1 2021": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1349962132174120700&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F01%2Fapple-reports-first-quarter-results%2F%23%3A~%3Atext%3DCupertino%252C%2520California%2520%25E2%2580%2594%2520January%252027%252C%2Cof%2520%25241.68%252C%2520up%252035%2520percent.",
    "feature": "https://www.techradar.com/news/whatsapp-may-be-working-on-chat-migration-feature-between-android-and-ios"
  }
}