{
  "source": "https://www.techradar.com/news/nintendo-switch-sales-could-slump-if-part-shortages-continue",
  "title": "New Nintendo Switch consoles could prove scarce amid supply issues",
  "category": "gaming",
  "updated": "2021-04-12T14:28:52Z",
  "author": "henry-st-leger",
  "summary": "Too popular for its own good",
  "article": [
    "The Nintendo Switch console could face production challenges this year, says Nintendo President Shuntaro Furukawa, due to shortages of crucial semiconductors.",
    "Speaking to Japanese news site Nikkei (via VGC), the Nintendo President signalled that the immense demand for the hybrid home-handheld console made sourcing necessary parts on a sufficient scale difficult – and that it could cause problems with order fulfilment later in the year, even if \"immediate\" production wasn't impacted.",
    "Furukawa said that “We have been able to secure the necessary materials for the immediate production of semiconductors for switches. However, in Japan and other countries, demand has been very strong since the beginning of the year, and there is a possibility of shortages at some retailers in the future.\"",
    "Given the continued popularity of the Nintendo Switch and Switch Lite consoles, it's likely that some may struggle to nab a device in the coming months – and that the smartest thing is to scout out some Nintendo Switch deals before stockists run into trouble.",
    "The ongoing semiconductor shortage is spelling trouble for a lot of other manufacturers too, notoriously causing supply issues for the PS5, and leading to the likely cancellation of the Samsung Galaxy Note 21.",
    "The incoming Qualcomm CEO expects things to settle down within the coming year, but it's clearly having a big impact in hardware availability in the meantime.",
    "We haven't heard anything about how these shortages could affect the rumored Nintendo Switch Pro, of course, given the next iteration of the Switch console has yet to be formally announced.",
    "Some reports have suggested a Switch Pro – an upgraded model with an OLED panel and 4K resolution upscaling in TV mode – could be unveiled before 2021 is over.",
    "With Nintendo confirmed to appear at E3 2021, too, it may be that the house of Mario and Zelda will be using the annual games event to show off new Switch hardware.",
    "It's worth noting that Nintendo hasn't shown off new hardware at an E3 event since the arrival of the Wii U in 2011. The Switch was unveiled in an October broadcast, while the Switch Lite was announced several weeks after E3 2019, showing Nintendo's willingness to go by its own schedules and ensure the limelight isn't crowded by other publishers and console makers.",
    "These semiconductor shortages could spell delays for a new iteration, though, and make a 2022 launch far more likely."
  ],
  "headers": {
    "6": "What does this mean for the Switch Pro?"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nikkei": "https://www.nikkei.com/article/DGXZQOHD128VH0S1A210C2000000/?unlock=1",
    "VGC": "https://www.videogameschronicle.com/news/nintendo-says-it-has-enough-parts-for-immediate-switch-production/",
    "Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nintendo Switch deals": "https://www.techradar.com/news/nintendo-switch-deals",
    "causing supply issues for the PS5": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "the likely cancellation of the Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
    "Qualcomm CEO": "https://www.techradar.com/news/incoming-qualcomm-ceo-warns-chip-shortage-wont-ease-until-end-of-2021",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Wii U": "https://www.techradar.com/reviews/gaming/games-consoles/nintendo-wii-u-1084120/review"
  }
}