{
  "source": "https://www.techradar.com/news/nintendo-switch-pro-may-have-accidentally-been-confirmed",
  "title": "Nintendo Switch Pro may have accidentally been confirmed",
  "category": "gaming",
  "updated": "2021-07-06T13:59:34Z",
  "author": "rhys-wood",
  "summary": "Gaming’s worst kept secret?",
  "article": [
    "Well, it took a little longer to come than we though, but it's now here: the Nintendo Switch OLED will cost $349 when it finally lands in October.",
    "Original article continues below:",
    "OLED firm Universal Display Corp might have inadvertently revealed that a Nintendo Switch Pro (or Nintendo Switch 2) is indeed on the way, as a recent transcription of an investors call by the company made mention of a “new Switch Pro” and its choice of OLED as its screen.",
    "Spotted by Twitter account Spawn Wave and reported by Nintendo Life, Universal Display Corp CEO Steven V. Abramson stated during the investors call: “...Nintendo has selected an OLED screen for the new Switch Pro due to OLED benefits of higher contrast and faster response times.”",
    "Previously, it was reported that the Nintendo Switch 2 would have a 7-inch OLED screen manufactured by Samsung Display. Universal Display Corp’s investors call also states that: “...Samsung Display announced that it will aggressively expand its OLED presence in the gaming, smartphone and laptop markets.”",
    "The investors call from Universal Display Corp seems to line up with leaks that have previously surfaced in regards to the Nintendo Switch Pro. However, it’s worth noting that Nintendo itself still hasn’t announced anything official for the rumored upgraded Switch device. It’s also reportedly increased Nintendo Switch production this year.",
    "Given the incredible sales run Nintendo is enjoying with both its Switch hardware and software currently, we still might not hear any official details about the Nintendo Switch 2 for some time.",
    "Additionally, the current global semiconductor shortage could greatly impact Nintendo’s hardware manufacturing efforts going forward, which could delay the Nintendo Switch Pro from its projected 2021 launch to well into 2022."
  ],
  "headers": {
    "5": "Switch Pro: a foregone conclusion?"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Nintendo Life": "https://www.nintendolife.com/news/2021/05/oled_display_firm_mentions_switch_pro_during_its_q1_investors_call",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "7-inch OLED screen": "https://www.techradar.com/news/nintendo-switch-2-launch-news-and-features",
    "incredible sales run": "https://www.nintendo.co.jp/ir/en/finance/hard_soft/",
    "global semiconductor shortage": "https://www.techradar.com/news/nintendo-ramps-up-switch-production-but-what-about-nintendo-switch-pro"
  }
}