{
  "source": "https://www.techradar.com/news/why-this-marvel-icon-wont-play-star-wars-grand-admiral-thrawn",
  "title": "Why this Marvel icon won't play Star Wars' Grand Admiral Thrawn",
  "category": "entertainment",
  "updated": "2021-03-12T12:00:59Z",
  "author": "tom-power",
  "summary": "Rebelling against the rumor mill",
  "article": [
    "The Mandalorian season 2 on Disney Plus opened the door to a potential live-action appearance from one of Star Wars fans' favorite villains. Ahsoka Tano's arrival on the show sent the rumor mill into overdrive, with many diehard fans believing that the Jedi's appearance could lead to Grand Admiral Thrawn's introduction in the series.",
    "Thrawn crossed paths with Tano in Star Wars: Rebels, and many Star Wars aficionados have already installed Benedict Cumberbatch as their number one choice if the villain ever shows up in a live-action production. Speaking to Collider about that possibility, though, the Doctor Strange star revealed that he wouldn't be interested in taking on the role for two crucial reasons.",
    "\"That’s a straight no from me, right now,\" Cumberbatch said when asked about playing Thrawn. \"There’s no way I want to be turned blue. I turned the air blue, very recently. No no, seriously, I have precious time with my children and I think sitting in a makeup chair and being painted blue, and the amount of time it would take to do that and then take it off at the end of the day might just… it’s not the right time in my life for that.\"",
    "It looks like Thawn will have to be played by someone else.",
    "Huge spoilers for The Mandalorian follow. Do not proceed if you aren't caught up.",
    "It's possible, but it's more likely that Thrawn would appear in Ahsoka Tano's live-action Star Wars series instead. Thrawn was last seen in Star Wars: Rebels' finale, but his fate is unclear following the events of that episode. With Ahsoka also featuring in this animated TV show, a live-action Thrawn appearance would hold greater weight in Ahsoka's spin-off.",
    "That isn't to say that Thrawn wouldn't be a welcome addition to The Mandalorian. Jon Favreau's hit series has already introduced characters from the wider Star Wars universe. Season 2 saw Katee Sackhoff reprise her role as Bo Katan, while a de-aged version of Luke Skywalker appeared in the final episode to take Baby Yoda under his wing and train it in the ways of the Jedi. There's definite room for a Thrawn crossover in this production then and, with Moff Gideon's fate unclear after he was defeated in Season 2's finale, The Mandalorian will need a new foe for Din Djarin to battle.",
    "With Cumberbatch out of the running for a possible Thrawn role, it remains to be seen who fans might like to see cast as the villain's live-action counterpart. Lars Mikkelsen voiced the character for 13 episodes in Star Wars: Rebels, and a Small Screen rumor had alleged that multiple sources close to LucasFilm say Mikkelsen is in talks to reprise his role. Take that speculation with a big pinch of salt for now, though, as we don't even know if Thrawn is being lined up to appear in The Mandalorian Season 3."
  ],
  "headers": {
    "4": "Will Grand Admiral Thrawn appear in The Mandalorian?"
  },
  "links": {
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Collider": "https://collider.com/benedict-cumberbatch-thrawn-casting-comments-the-mandalorian/",
    "Ahsoka Tano's live-action Star Wars series": "https://www.techradar.com/news/the-mandalorian-spin-offs-ahsoka-and-rangers-of-the-new-republic-explained",
    "Small Screen rumor": "https://www.small-screen.co.uk/lars-mikkelsen-is-reportedly-in-talks-to-play-the-live-action-thrawn-in-the-mandalorian-exclusive/"
  }
}