{
  "source": "https://www.techradar.com/news/nokia-offers-cloud-based-esim-and-isim-management-for-iot",
  "title": "Nokia offers cloud-based eSIM and iSIM management for IoT",
  "category": "phones",
  "updated": "2021-07-07T14:48:08Z",
  "author": "steve-mccaskill",
  "summary": "eSIM and iSIM technology offer flexibility and capability for IoT",
  "article": [
    "Nokia has launched a new platform to help mobile operators and enterprises manage embedded SIMs (eSIM) and integrated SIMs (iSIM) used to connect IoT devices to the network.",
    "Whereas traditionally mobile devices have used physical SIM cards to authenticate a user’s identity and subscription when connected to a cellular network, eSIMs and iSIMs are software-based. This means they can be remotely managed and can manage multiple subscriptions simultaneously.",
    "There are several advantages to eSIM and iSIM technology. Changes to connectivity can be done without having to incur the logistical challenge, time and expense of sending out an engineer or risking a loss of service.",
    "Meanwhile, device manufacturers have greater freedom in design because there is no need to include space for a physical SIM slot and there are fewer points of failure.",
    "All of these factors mean eSIM and iSIM are more suited to long-term IoT projects such as smart meters. The ability to support multiple networks without touching the device significantly boots effectiveness.",
    "Nokia’s iSIM Secure Connect platform allows providers to automate manage both M2M and consumer eSIM and iSIM lifecycles and provision new services more quickly. This drives customer satisfaction, operational efficiency and opens new revenue streams.",
    "The company says its platform is vendor agnostic and works across various network and cloud architectures. It believes the market for eSIM and iSIM devices is set to be worth more than €6 billion by 2025.",
    "“iSIM unleashes a wide range of growth opportunities for CSPs and enterprises and enables new innovations that build proven value on top of this new technology,” said Hamdy Farid, Head of Business Applications, Cloud and Network Services, Nokia.",
    "“As part of Nokia’s Cloud and Network Services product portfolio, iSIM Secure Connect will help our customers both streamline the process of managing millions more device subscriptions and deliver more innovative services quickly and securely.”"
  ],
  "headers": {
    "3": "Nokia 5G"
  },
  "links": {}
}