{
  "source": "https://www.techradar.com/news/iphone-13-release-date-looks-to-be-on-schedule-for-september",
  "title": "iPhone 13 release date looks to be on schedule for September",
  "category": "phones",
  "updated": "2021-04-08T09:00:40Z",
  "author": "james-rogerson",
  "summary": "Its chipset is seemingly even ahead of schedule",
  "article": [
    "Apple almost always launches new iPhone models in September, but in 2020, due to the pandemic, the launch didn’t happen until October. It looks like things are back on schedule for the iPhone 13 range though, based on how far along in production the chipset seemingly is.",
    "According to supply chain sources speaking to DigiTimes, TSMC (a chipset manufacturer) will start shipping the A15 Bionic chipset to Apple by the end of May. That’s seemingly ahead of schedule, with the site previously reporting that the chipset wouldn’t even enter production until the end of May.",
    "But even that would have been well ahead of where the A14 Bionic was at the same time last year, as that didn’t enter production until late June. So while the chipset is just one aspect of the iPhone 13, this rapid progress bodes well for the phone as a whole being on schedule.",
    "We’ve previously heard from other sources that the iPhone 13 range is on track for a September launch too, so while there’s plenty of time for that to change, right now it looks like things are back to normal on that front.",
    "As for the chipset, another notable detail in this latest report is that TSMC is apparently expected to 'see major increases in output from its advanced processes,' which suggests the iPhone 13 range might not be affected by the global chipset shortage that’s impacting Android phones.",
    "In less positive news though, it’s previously been rumored that the A15 Bionic chipset will be made on a 5nm (nanometer) process, same as the A14 Bionic, which means improvements will likely be limited.",
    "Specifically, there have been mentions of a 5% performance improvement and a 10% reduction in power. Still, the A14 Bionic remains one of the most powerful chipsets around, so small improvements might be all Apple needs.",
    "Of course, we’d take all of this with a pinch of salt for now. Nothing will be known for sure until Apple announces the iPhone 13 range – likely in September.",
    "Via Phone Arena"
  ],
  "headers": {
    "4": "No supply shortages"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "DigiTimes": "https://www.digitimes.com/news/a20210407VL200.html",
    "enter production until the end of May": "https://www.techradar.com/news/iphone-13s-a15-chip-production-could-start-soon-but-the-upgrades-might-be-small",
    "on track for a September launch": "https://www.techradar.com/news/iphone-13-range-likely-to-land-in-september",
    "global chipset shortage": "https://www.techradar.com/news/incoming-qualcomm-ceo-warns-chip-shortage-wont-ease-until-end-of-2021",
    "Phone Arena": "https://www.phonearena.com/news/apple-a15-bionic-of-iphone-13-ahead-of-schedule_id131287"
  }
}