{
  "source": "https://www.techradar.com/news/good-omens-season-2-is-coming-to-amazon-prime-but-is-it-needed",
  "title": "Good Omens season 2 is coming to Amazon Prime – but is it needed?",
  "category": "entertainment",
  "updated": "2021-06-29T14:14:44Z",
  "author": "tom-power",
  "summary": "Good Omens or bad ones?",
  "article": [
    "It's time to prepare for another (potentially world-ending) adventure with Aziraphale and Crowley: Good Omens season 2 is officially in the works at Amazon Prime Video.",
    "Neil Gaiman, who co-wrote the 1990 novel alongside the late Terry Pratchett, revealed the news to his fanbase on social media on Tuesday, June 28.",
    "Little is known about the plot for season 2 but, according to Variety, season 2 will find Crowley and Aziraphale living in Soho, London \"when an unexpected messenger presents a surprising mystery\".",
    "David Tennant and Michael Sheen will reprise their roles as Crowley and Aziraphale respectively in season 2. Per Variety, the duo have signed up for another six-episode run, which will begin filming in Scotland later in 2021. No release date has been set for the series yet, but we'd expect to see it next year at some point.",
    "Check out Gaiman's tweet below:",
    "It's complicated. Good Omens season 1 has been a huge hit for Amazon since its original release in May 2019, with numerous award wins and an 84% approval rating, with critics at least, on review aggregation website Rotten Tomatoes.",
    "The TV adaptation's score rises to 90% where Rotten Tomatoes' general audience is concerned, so it's unsurprising that Amazon will want to capitalize on its popularity and make a second instalment.",
    "The problem for Good Omens, though, is that the novel's story was wrapped up by the end of season 1 (albeit the TV adaptation wasn't a completely faithful adaptation). That means that, in order to renew Good Omens for another season, Gaiman and Amazon will need to come up with an entirely original story for season 2.",
    "Speaking to Variety as part of the announcement, however, Gaiman teased what season 2's plot may entail.",
    "“It’s thirty-one years since ‘Good Omens’ was published,\" Gaiman said. \"Which means it’s thirty-two years since Terry Pratchett and I lay in our respective beds in a Seattle hotel room at a World Fantasy Convention, and plotted the sequel.",
    "\"I got to use bits of the sequel in Good Omens – that’s where our angels came from. Terry’s not here any longer, but when he was, we had talked about what we wanted to do with ‘Good Omens,’ and where the story went next.\"",
    "You would think that Gaiman wouldn't have returned for a second season if he didn't have a solid plot in mind. After all, this is the author behind critically-acclaimed comics and novels including The Sandman, American Gods, the 2007 comic run of Marvel's Eternals and Coraline.",
    "Judging by Gaiman's comments above, then, it seems that his and Pratchett's initial idea for a sequel will form the base of Good Omens season 2.",
    "However, some fans are unsure about whether there's a need for a second season. In the wake of Gaiman's tweet, a few disgruntled viewers replied to the award-winning author to say that they weren't overly enamored with the prospect of Good Omens season 2.",
    "That isn't to say that everyone is against it, though, as plenty of fans have also voiced their happiness at the news.",
    "What's our view? We think Good Omens season 2 could work. Providing Gaiman uses his and Pratchett's sequel idea as the foundations for season 2's story, we're fairly confident that Gaiman, Amazon, Tennant and Sheen will do it justice."
  ],
  "headers": {
    "5": "Analysis: do we really need a second season of Good Omens?"
  },
  "links": {
    "Variety": "https://variety.com/2021/tv/news/good-omens-terry-pratchett-gaiman-david-tennant-season-2-1235007190/",
    "Rotten Tomatoes": "https://www.rottentomatoes.com/tv/good_omens/s01",
    "weren't": "https://twitter.com/nearlyasinner/status/1409863186900267008",
    "overly": "https://twitter.com/gouglov/status/1409860300082384900",
    "enamored": "https://twitter.com/alexbuzzbee/status/1409860292431974404",
    "voiced": "https://twitter.com/QueenOfBlades66/status/1409862443849990151",
    "their": "https://twitter.com/JenBraden/status/1409863415418351616",
    "happiness": "https://twitter.com/makeitepic/status/1409872310895628306"
  }
}