{
  "source": "https://www.techradar.com/news/star-trek-producer-believes-section-31-spin-off-is-still-happening",
  "title": "Star Trek producer believes Section 31 spin-off is still happening",
  "category": "entertainment",
  "updated": "2021-04-14T09:28:31Z",
  "author": "samuel-roberts",
  "summary": "The Star Trek: Discovery spin-off has been touted for a long time",
  "article": [
    "Section 31 is a long-touted spin-off of Star Trek: Discovery that was supposed to film after season 3 ended production last year. It was set to star Michelle Yeoh as Emperor Philippa Georgiou from the show's Mirror Universe, and sees her being recruited by the titular Federation intelligence agency.",
    "The problem is, Section 31 didn't feature in Star Trek's recent online event, which revealed a first teaser for Picard season 2 – and this spin-off has now been years in the making. It didn't play a part in the marketing for streaming service Paramount Plus, either, which is Star Trek's de facto home in the US.",
    "This week, THR asked Picard and Strange New Worlds producer Akiva Goldsman if the spin-off was still going ahead.",
    "\"I don't know. I believe so,\" he says. \"Alex [Kurtzman, executive producer] has a plan. You know, Picard wasn't supposed to be a series. It was just a one-off scene in a Short Trek. He wasn't even going to be played by Patrick Stewart. They were going to have a young Picard at the end of a short we were making up. Then Alex was like, 'What if it was Patrick Stewart? … What if it wasn't one scene?' Alex has a plan, and it's pretty cool.\"",
    "Section 31 was announced back in January 2019, around the time Discovery season 2 aired. It had a writers' room by February 2020, was reportedly set to film in May last year, too – although that was before the pandemic upended production schedules across the industry.",
    "In February, a Variety report stated that there likely won't be more new Trek series until one of the existing shows – Discovery, Picard, Lower Decks, Strange New Worlds or Prodigy – ends its run. At that point, Trek overseer Alex Kurtzman and Paramount Plus programming chief Julie McNamara said there are still \"conversations\" about Section 31.",
    "Based on the history of how the show has been discussed publicly, it seems like at one point, the plan was for Section 31 to push ahead. Now, for whatever reason, it seems like those ambitions have been dialed back.",
    "Our take is that five Trek series is probably enough for the time being; if their popularity continues to grow in the streaming space, though it's not inconceivable that Paramount could double down on more of it.",
    "We were very fond of Yeoh's role in Discovery, but it's hard not to see the premise of Strange New Worlds being more appealing to viewers than Section 31. A more traditional, episode-of-the-week Trek show should be a nice tonic to the more serialized Discovery and Picard."
  ],
  "headers": {
    "6": "What happened to Section 31?"
  },
  "links": {
    "Section 31": "https://www.techradar.com/news/star-trek-section-31-release-date-cast-plot-how-it-ties-into-canon-and-more",
    "Star Trek: Discovery": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Picard season 2": "https://www.techradar.com/news/star-trek-picard-season-2-is-learning-one-big-lesson-from-season-1",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "THR": "https://www.hollywoodreporter.com/heat-vision/star-trek-producer-reveals-strange-new-worlds-plan-evolving-q-for-picard",
    "Variety": "https://variety.com/2021/tv/news/star-trek-universe-paramount-plus-prodigy-1234914526/"
  }
}