{
  "source": "https://www.techradar.com/news/amd-and-nvidia-take-note-gpus-will-soon-become-obsolete-for-crypto-mining",
  "title": "AMD and Nvidia, take note: GPUs will soon become 'obsolete' for crypto mining",
  "category": "computing",
  "updated": "2021-03-10T08:39:34Z",
  "author": "joel-khalili",
  "summary": "It would be ‘very foolish’ to invest in a high-end crypto mining GPU today, report claims",
  "article": [
    "The rise in popularity of cryptocurrency mining contributed to a significant surge in GPU sales in Q4 2020, new research suggests.",
    "According to a report from analysts at Jon Peddie Research (JPR), GPU shipments rose by 20.5% quarter-on-quarter and by 12.4% over Q4 2019.",
    "Although various factors contributed to this growth, including the rise of remote working and the popularity of gaming during the pandemic, JPR claims crypto mining (specifically, mining on the Ethereum network) also played a sizeable role.",
    "However, the company also noted that upcoming changes to the Ethereum ecosystem will likely see demand for GPUs among crypto miners fall through the floor.",
    "A combination of chip shortages, a surge in interest around crypto mining and other factors has made graphics cards seriously difficult to pin down.",
    "To ensure gamers can get their hands on GPUs, both Nvidia and AMD are currently toying with the idea of mining-specific cards. The former has also throttled the ETH mining performance of the GeForce RTX 3060 and will reportedly use the same hash rate limiter for its next Ampere GPU, the RTX 3080 Ti.",
    "However, these efforts may ultimately prove unnecessary, with GPU mining set to become effectively obsolete as a result of architectural changes to the Ethereum blockchain.",
    "According to Jon Peddie, President at JPR, the quantity of power consumed by top-end GPUs “greatly diminishes the payoff”, while the transition to Ethereum 2.0 will further disincentivize the use of GPUs for crypto mining.",
    "“Ethereum, the best-suited coin for GPUs, will fork into version 2.0 very soon, making GPUs obsolete,” he said. “A person would be very foolish to invest in a high-end, power-consuming [GPU] for crypto mining today.”",
    "As part of the transition to Ethereum 2.0, the network will transition from a Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS).",
    "The former pits the computational power of network participants against each other as they race to crack cryptographic puzzles. Solving one of these puzzles first earns the miner the right to process a “block” of transactions and receive a cryptocurrency award.",
    "PoS, however, does away with mining entirely, in favor of a system that rewards participants based on the value they have tied up in the network. In this set-up, there is no need for turbo-charged mining GPUs.",
    "The main caveat, however, is that it will take some time before Ethereum shifts entirely to PoS. The network overhaul will occur in multiple phases, the last of which isn’t scheduled to occur until 2022 (and that’s if there are no unforeseen delays). Until then, gamers will likely have competition on their hands when it comes to securing a GPU."
  ],
  "headers": {
    "4": "Crypto mining GPUs"
  },
  "links": {
    "cryptocurrency mining": "https://www.techradar.com/how-to/how-to-mine-bitcoin-and-other-cryptocurrencies",
    "report": "https://www.jonpeddie.com/press-releases/gpu-shipments-soar-once-more-in-q4",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "crypto": "https://www.techradar.com/best/mining-rigs",
    "Nvidia": "https://www.techradar.com/news/how-nvidia-is-tackling-cryptomining-so-more-gamers-can-get-rtx-cards",
    "AMD": "https://www.techradar.com/news/want-an-amd-ryzen-6900-xt-leaked-crypto-specific-gpu-could-be-good-news",
    "Ethereum 2.0": "https://www.techradar.com/news/ethereum-20-goes-live-next-month-heres-why-thats-a-huge-deal",
    "mining GPUs": "https://www.techradar.com/best/mining-gpu"
  }
}