{
  "source": "https://www.techradar.com/news/airpods-pro-beta-teases-even-more-ios-15-features",
  "title": "AirPods Pro beta teases even more iOS 15 features",
  "category": "audio-visual",
  "updated": "2021-08-05T09:21:37Z",
  "author": "hamish-hector",
  "summary": "Turn up the real world with conversation boost",
  "article": [
    "The latest beta version of the Apple AirPods Pro firmware shows even more neat features are headed to the headphones with iOS 15. When the iOS update drops (likely in September), AirPods Pro users will get a slew of new features, including a conversation boost to help those with hearing impairments.",
    "Conversation boost is like a reverse noise canceling feature. The tool takes advantage of the AirPods’ microphones and should be able to help those with mild to moderate hearing challenges listen to conversations when it’s turned on.",
    "On top of that, previous beta firmware updates indicate that the Apple AirPods Pro will be able to support iOS 15’s FaceTime audio enhancements. This includes ambient noise reduction features and spatial audio to make calls sound clearer. Spatial audio is Apple’s own 3D audio technology and could make talking over FaceTime feel more like talking in real life.",
    "For now, the feature is only available to developers enrolled in the AirPods Pro developer beta. That means we’ll have to wait a while longer before we can try these features out for ourselves. But with iOS 15 believed to be launching in September, hopefully, these new features won’t be far away.",
    "To download the latest beta firmware officially, you’ll have to sign up for a developer account and then head to the Apple Developer website on your iPhone to download the AirPods Pro update.",
    "This means that most of us won’t be able to try out these features until iOS 15 launches officially, and that’s not a bad thing. Developer betas for Apple products are typically less stable than public betas, or the public release, and can cause a few issues that can outweigh the new benefits and features you get.",
    "Also, once beta firmware is installed, it can’t be downgraded back to an official release. That means you’ll be stuck with any beta bugs until iOS 15 hits public release. Additionally, we wouldn’t recommend trying to find a way around these developer-only restrictions, as unauthorized users can end up making their devices unusable and out of warranty.",
    "It’s a shame we’ll have to wait for the latest updates, but when iOS 15 releases to everyone all the kinks and glitches should have been worked out. That means you’ll get the best AirPods Pro experience possible, and isn’t that what you want?"
  ],
  "headers": {
    "4": "Advice: Don’t download the Airpods Pro developer beta"
  },
  "links": {
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "Apple Developer website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8047259934339826000&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2F",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "public betas": "https://www.techradar.com/how-to/how-to-get-ios-15-developer-beta-on-your-iphone"
  }
}