{
  "source": "https://www.techradar.com/news/bmw-is-aiming-to-build-the-perfect-electrically-driven-car",
  "title": "BMW is aiming to build the ‘perfect electrically-driven car’",
  "category": "car-tech",
  "updated": "2021-08-11T16:44:36Z",
  "author": "chris-teague",
  "summary": "Bold from BMW",
  "article": [
    "BMW is charging ahead into an electrified future. The German automaker has confirmed it will release several all-electric models – including sedans, performance vehicles, and SUVs – over the next few years.",
    "In an interview with CAR Magazine, BMW CEO Oliver Zipse outlined his company’s new ‘Neue Klasse’ architecture, which will allow the brand to pursue the “perfect electrically-driven car.”",
    "Interestingly, Zipse notes that BMW can build its next-generation electric vehicles alongside traditional gas-powered cars in the same factory. Right now, that flexibility allows it to produce models like the i4 EV and standard 4 Series on the same production line in Munich – which in turn allows the automaker to hedge its bets against an uncertain electrified future.",
    "That same openness about the future also includes a willingness to leave the door open for combustion engines in its new architecture.",
    "As for the next generation of 3 Series cars, the current G20 models are expected to be phased out in the mid-2020s, around the same time that BMW will be rolling out the Neue Klasse cars. But BMW boss Zipse feels that there could be a time when both a traditional 3 Series and electric versions of the vehicle exist side-by-side. “In some fully electric markets, that might work,” he told CAR. “Globally, serving 140 markets, you might come to a different conclusion.”",
    "BMW’s next wave of vehicles will also be much more sustainable and built using a larger amount of recycled materials.",
    "For example, the automaker will focus on end-of-life processing for its vehicles, using materials that can be more easily recycled or disposed of. This philosophy is difficult and expensive to introduce to existing vehicles and architectures, Zipse says, but the Neue Klasse allows BMW to engineer the materials into the process from the very beginning.",
    "A revised battery design is also on the way to its new vehicles. The Gen 6 batteries that will power Neue Klasse vehicles are set to carry a higher energy density, faster recharge times, and more recycled materials instead of components that require extensive mining and refinement.",
    "As for autonomous driving, Zipse says BMW can build an autonomous car, but the regulatory environment is so unstable that it’s not something that will be a near-term goal for the auto industry.",
    "However, as CAR notes, the Neue Klasse architecture will need to be open enough to accommodate at least Level 4 autonomy with processing and communications technologies.",
    "All in all, then, BMW’s new architecture accommodates a future open to wider developments in the automotive industry – whether that’s a future of total electrification, increased autonomy, or both simultaneously."
  ],
  "headers": {
    "5": "Analysis: Going green"
  },
  "links": {
    "CAR Magazine": "https://www.carmagazine.co.uk/electric/bmw-neue-klasse-electric-cars-2025-/",
    "i4 EV": "https://www.techradar.com/news/bmw-i4-challenges-tesla-model-s-and-audi-e-tron-gt"
  }
}