{
  "source": "https://www.techradar.com/news/far-cry-6s-world-isnt-as-big-as-assassins-creed-odysseys-but-its-more-ambitious",
  "title": "Far Cry 6’s world isn’t as big as Assassin’s Creed Odyssey’s, but it’s more ambitious",
  "category": "gaming",
  "updated": "2021-09-25T13:00:40Z",
  "author": "vic-hood",
  "summary": "Interview: ‘We've been able to fuse the two philosophies together’",
  "article": [
    "Set on the fictional Caribbean island of Yara, Far Cry 6 looks to push the boundaries of what we’ve seen from the long-running series before, offering not just a region to explore but an entire country.",
    "Yara’s Cuban influences are clear: sweeping vistas, vivid flora and a guerrilla revolution brewing at its core in response to a tyrannical dictatorship. What results is a conflict set against a tropical paradise that’s brimming with culture, music and personality, but also oppressed by the dictator Anton Castillo, with its citizens harassed by his military checkpoints and patrols.",
    "It’s an environment you might not immediately associate with another of Ubisoft’s established franchises, Assassin’s Creed. But Far Cry 6 World Director Ben Hall tells us that, while there are key differences between the worlds of Far Cry and Assassin’s Creed, there are some clear similarities too.",
    "If there’s one person who has the experience necessary to create Yara’s living and breathing world, it’s probably Ben Hall. A senior-level designer on Assassin’s Creed Syndicate, before becoming the World Director on Assassin’s Creed Odyssey, Hall knew that taking on the role of World Director of Far Cry 6 would present a challenge different to any he’d faced before. While Assassin’s Creed games are third-person, open-world titles with a heavy historical influence, Far Cry games, by contrast, are first-person shooters and as Hall Points out “much faster”.",
    "“It's a new challenge in the way you approach certain elements of world building,” he tells us. “But from an overarching philosophy, it remains somewhat the same in terms of the process of building, the level of detail – going into that research was something that was important that we put into this world for Far Cry. We went to similar lengths of reference and research as we would for an Assassin's Creed game, so bringing that same philosophy into it was important.",
    "“But then obviously, being in first-person, spatial awareness becomes slightly different, the focus and attention to detail at an individual location level becomes slightly different. And that's where the support of the team that I've been working with has been phenomenal because they've helped me with that. They've got that experience from previous Far Cry games and we've been able to fuse the two philosophies together to try and build the best worlds we possibly can for players.”",
    "While it’s common knowledge that the team visited Cuba as part of its research, Hall stresses that Yara is not a replication of Cuba. Instead, the team at Ubisoft created a fictional world that drew inspiration from Caribbean countries, including Cuba, as well as from Central and South American countries, but didn’t see them “beholden to real-world reference”.",
    "As an example, Hall points out some key differences between Yara and Cuba, including alligators in swimming pools (Cuba doesn’t have alligators) and a lack of flamingos (Cuba is crawling with them). It’s a somewhat different approach to that taken with Assassin’s Creed Odyssey, where the goal was to recreate environments that already exist as historically accurate as possible – so much so that Odyssey is now used as a learning tool in schools – but Hall emphasizes that research still plays an important role.",
    "“We do a lot of research, and it's really important that people do that because we're not from that part of the world,” Hall says of the countries the Far Cry 6 team used for inspiration. “For us, it's really important that we go to the lengths to make sure we learn as much as we possibly can. So that when we are speaking to experts, and they're looking at what we've built, we're talking about changing and tweaking little things that we've perhaps not got quite right, or that we can make better, rather than whole sweeping changes to the world.“",
    "From concept to completion, Yara took roughly four years to create, the challenge being to create a complete, fully-realized country that also serves as the playground Far Cry fans expect – a first for the series.",
    "“No matter where we ended up with the setting, it was always going to be that we were going to do a revolution that's going to be about a country,” Hall tells us. “And that really changed the mindset of the team, because it was now much wider, our reference and research-gathering widened out. But we also needed to make sure that Yara could contain all of those different elements that make it feel like a country, all the different layers of infrastructure, the idea of where people lived and worked, and how those things used to work once upon a time, was something that we now needed to think about.”",
    "Yara’s map is the largest of any Far Cry game to date, but Hall “didn't want to just go for size for the sake of size”. Instead, the focus was on ensuring that Yara felt like a country in terms of its scale, while at the same time being a realistic undertaking for players. But how does this differ from Odyssey, which boasted a mammoth map covering roughly 90.7 square miles (according to GameRant)?",
    "“Footprint-wise, it's not as big as Odyssey, which was important because we didn't want to create the same sense of emotion,” Hall explains. “With Odyssey, it was about exploring: taking time to explore the wilderness and find those locations. Whereas, with the Far Cry games, it's faster-paced, you want to get to places more quickly. But we also want to evoke exploration, the sensation of being a guerrilla is about understanding the landscape that you're in, exploring that landscape you're in, and then finding things that you can use to give you one up over the military so that concept of exploration was still important.",
    "“It's not as big as Odyssey but it's the most ambitious Far Cry map that we've set to date.”",
    "According to Hall, that ambition’s focus is primarily on the depth of content and the level of detail within the world. Ubisoft has created a country that has its own history, unique locations and people with their own stories and opinions on dictator Anton – however, it’s hard to ignore the Cuban influences on these elements. Hall tells us that one of his goals was to entice players away from their main objective, to explore these more intrinsic elements of the world.",
    "If Hall’s previous world-building is anything to go by, Far Cry 6’s Yara looks like it will offer a very intriguing proposition when it releases on October 7, 2021 – just prepare to be tempted off the beaten path."
  ],
  "headers": {
    "3": "Fusing philosophies",
    "9": "Creating a fully realized country"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "Assassin’s Creed Odyssey": "https://www.techradar.com/news/assassins-creed-odyssey-review"
  }
}