{
  "source": "https://www.techradar.com/news/oppo-enco-air-true-wireless-earbuds-are-cheap-airpods-rivals",
  "title": "Oppo Enco Air true wireless earbuds are cheap AirPods rivals",
  "category": "audio-visual",
  "updated": "2021-05-25T14:16:52Z",
  "author": "olivia-tambini",
  "summary": "Oppo's latest buds are budget-friendly",
  "article": [
    "If you love the style of the Apple AirPods, but hate the ($159 / £159 / AU$249) price tag, Oppo's latest true wireless earbuds could be worth checking out.",
    "The Oppo Enco Air come with Bluetooth 5.2 connectivity, a 24-hour battery life, and a decidedly AirPods-esque design – but at £69, they're much cheaper. (That works out at around $100 / AU$125, though global pricing and availability is yet to be confirmed.)",
    "Inside the Oppo Enco Air true wireless earbuds are 12mm titanium dynamic drivers, each with a dedicated bass-boosting duct, which Oppo says \"work in harmony to channel and amplify every detail\".",
    "They come with a Vocal Enhancement mode, too, which uses a real-time algorithm to adjust the signal and make vocals stand out from the instrumental aspects of your music.",
    "While there's no active noise cancellation, Oppo says that the buds come with DNN (Deep Neural Network) Noise Cancellation for phone calls, which apparently makes for clearer call quality by reproducing the sound of human voices as you would hear them in person using a binaural audio algorithm.",
    "The battery life comes in at 24 hours in total – that's four hours from the buds themselves and a further 20 hours from the charging case. That's not the best battery life we've seen, but it is about the same as the AirPods, despite the much lower price.",
    "According to Oppo, the Enco Air have been tested on over 400 different ear shapes, so they should provide a pretty comfy fit – and they come with IPX4 water-resistance, so you could use them for working out without worrying about a little sweat or rain breaking them.",
    "So, should you buy the Oppo Enco Air instead of the Apple AirPods? Well, it depends on what you're looking for from a pair of true wireless earbuds.",
    "Oppo earbuds that we've previously tested, like the Oppo Enco X, have impressed with their comfy fits and assertive sound. However, they don't offer the seamless connectivity with iOS devices that the AirPods are capable of – in fact, you can't download the accompanying control app for the Enco Air from the App Store.",
    "And, don't forget – even though the Oppo buds are cheaper, the Apple AirPods could easily be discounted during Prime Day 2021, which is coming up in June.",
    "Via What Hi-Fi?"
  ],
  "headers": {
    "7": "Should you buy them?"
  },
  "links": {
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Oppo Enco X": "https://www.techradar.com/reviews/oppo-enco-x",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "What Hi-Fi?": "https://www.whathifi.com/us/news/oppo-enco-air-earbuds-the-new-airpods-rival-that-costs-just-pound69"
  }
}