{
  "source": "https://www.techradar.com/news/fasthosts-launches-e-commerce-website-builder-for-smbs",
  "title": "Fasthosts launches e-commerce website builder for SMBs",
  "category": "computing",
  "updated": "2021-06-04T10:14:10Z",
  "author": "abigail-opiah",
  "summary": "Businesses can now create online stores with Fasthosts",
  "article": [
    "UK-based web hosting service provider Fasthosts has unveiled the launch of its new ecommerce website builder in a bid to help businesses create professional online shops.",
    "With the new website builder offering, companies will be able to establish their online space quickly as the company boasts of the new product’s ease of use and price transparency.",
    "The ecommerce website builder offers drag and drop tools for users to create an online shop in minutes, according to Fasthosts.",
    "The new product features a wide range of designs and mobile-friendly templates that require no coding experience, and will give businesses the option to take payments exactly as desired.",
    "The website builder also allows businesses to reach customers across social media and marketplaces, which includes automatically syncing the main shop with platforms including Google Shopping, Facebook Messenger, Ebay, Amazon, Instagram and Facebook.",
    "There is a huge range of add-on features, including access to partner apps, within Ecommerce Website Builder. These bolster the functionality of a site and customise its performance to best suit business needs. Additionally, the product comes with a free domain name and SSL security, plus a business-class email, providing everything a retailer needs to establish a professional online store.",
    "When referring to the new launch, Michelle Stark, Director at Fasthosts said: “In the current economic climate, it’s vital that new firms equip themselves with the best tools for quick success.”",
    "“Creating a website that works for you does not have to eat into profit, nor take an age. With our new Ecommerce Website Builder, retailers can create a professional looking online shop quickly with little to no technical expertise.”"
  ],
  "headers": {
    "3": "e-commerce website builder features"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Fasthosts": "https://www.techradar.com/reviews/fasthosts",
    "website builder": "https://www.techradar.com/news/the-best-website-builder"
  }
}