{
  "source": "https://www.techradar.com/news/microsoft-wants-you-to-help-it-find-bugs-in-windows-11",
  "title": "Microsoft wants you to help it find bugs in Windows 11",
  "category": "computing",
  "updated": "2021-07-09T12:29:29Z",
  "author": "mayank-sharma",
  "summary": "User testing could help find bugs in Windows 11",
  "article": [
    "Microsoft has kicked off a bug bash program to enable testers in its Windows 11 Insiders program to iron out known issues in the upcoming Windows release.",
    "Announced on June 24, the first preview build of Windows 11 has already been delivered to members of the Windows Insiders program, and Microsoft now wants to capitalize on their initial experience by seeking feedback on known issues.",
    "“Our first Windows 11 Bug Bash will run from July 7th through July 14th. Throughout the Bug Bash, we’ll be posting Quests in Feedback Hub covering different areas of Windows 11. You can help make Windows better for everyone by trying them out and sending feedback,” said Microsoft in a blog post.",
    "Bug bashes are an integral part of the Windows Insider program and help the software company essentially outsource some of its testing to experienced Windows users.",
    "HotHardware peeked inside the Windows 11 bug bash and lists some of the tasks identified by Microsoft.",
    "Most of the listed tasks are pretty basic and involve reporting on the experience of using specific Windows 11 features such as connecting an external monitor with a laptop, customizing the Start menu, doing math and getting other instant answers in the Taskbar, and such.",
    "While the bug bash rewards participants with honorary badges to show off their achievements, the software giant also has several bug bounty programs that pay real money, including one specifically designed for Windows Insiders.",
    "“Over the past 12 months, Microsoft awarded $13.6M in bug bounties to more than 340 security researchers across 58 countries,” reveals Microsoft Security Response Center in a blog post."
  ],
  "headers": {
    "4": "Real rewards"
  },
  "links": {
    "bug bash program": "https://twitter.com/windowsinsider/status/1412836313867431943",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1438138670503491000&xs=1&url=https%3A%2F%2Fmsrc-blog.microsoft.com%2F2021%2F07%2F08%2Fmicrosoft-bug-bounty-programs-year-in-review-13-6m-in-rewards%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-wants-you-to-help-it-find-bugs-in-windows-11",
    "lists": "https://hothardware.com/news/microsoft-windows-11-bug-bash-earn-sweet-rewards",
    "external monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "designed for Windows Insiders": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8499643960535487000&xs=1&url=https%3A%2F%2Fmsrc-blog.microsoft.com%2F2020%2F07%2F24%2Fupdates-to-the-windows-insider-preview-bounty-program%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-wants-you-to-help-it-find-bugs-in-windows-11"
  }
}