{
  "source": "https://www.techradar.com/news/apples-iphone-12-just-got-a-new-color-option",
  "title": "iPhone 12 now comes in a brand new color",
  "category": "phones",
  "updated": "2021-04-21T07:30:31Z",
  "author": "hamish-hector",
  "summary": "Mmm... purple",
  "article": [
    "Apple has announced a new color for its iPhone 12 line of phones at its Spring Loaded event. The iPhone 12 can now be bought in purple.",
    "You can pre-order the purple shade for the iPhone 12 mini and iPhone 12, with the new color set to ship on April 23. However, the iPhone 12 Pro and iPhone 12 Pro Max miss out on the fresh new hue.",
    "As revealed by Tim Cook, CEO of Apple, the iPhone 12 and 12 mini now come in six colors instead of five – black, white, blue, green, red, and purple.",
    "While this won't be exciting to everyone, if you're in the mood for a new smartphone just know that you have another color option for Apple's more affordable latest handsets.",
    "If a purple iPhone sounds familiar, then you'd be on to something. The iPhone 11 is also available in a purple, but the shade used on the older handset is much, much lighter than Apple's deeper, new offering. For purple fans, the new shade on the 12 and 12 mini will likely be much more your style.",
    "Spring Loaded (thankfully) didn't just announce a new iPhone 12 color. Apple's first event of 2021 had plenty more on offer for fans of its products.",
    "If you constantly find yourself losing your keys, wallet, or other non-Apple products Apple AirTags should now be able to help you out. Using tracking based on the Find my iPhone feature, you'll soon be able to locate your AirTagged items quickly and easily – whether they are at home or lost in the outside world. AirTags will be available from April 30.",
    "And if you like colorful new hardware, you'll soon be able to can pick up the iMac (2021) in a range of options including yellow, blue, and classic white. Utilizing Apple's best components – including the powerful M1 processor – Apple promises you'll find working from home much easier. Orders open on April 30 and the iMac (2021) is available from May 2."
  ],
  "headers": {
    "5": "What else was announced at Spring Loaded?"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Spring Loaded event": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "iMac (2021)": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "M1 processor": "https://www.techradar.com/news/apple-m1-chip"
  }
}