{
  "source": "https://www.techradar.com/news/macbook-pro-2021-apple-event-in-october-seems-even-more-likely",
  "title": "MacBook Pro (2021) Apple event in October seems even more likely",
  "category": "computing",
  "updated": "2021-10-04T12:47:03Z",
  "author": "hamish-hector",
  "summary": "The M1X sounds impressive too",
  "article": [
    "Yet another rumor points to an October reveal event for the new MacBook Pro. The long-awaited laptop is likely to be powered by the highly anticipated M1X Apple silicon chip – the next generation of Apple’s already impressive M1 chip that features in its best Mac and iPad devices.",
    "The latest speculation comes from Bloomberg's Mark Gurman who in his latest Power On newsletter suggested Apple is gearing up for an October launch event that could be announced soon. Gurman has been on the money with Apple leaks in the past and as he notes this event’s timing would fit with Apple’s usual schedule which typically includes an October Mac-centric event – with last year’s November show being an outlier.",
    "During the event, we expect Apple would also unveil the long-rumored Mac Mini 2021 redesign – which would likely feature the same souped-up M1X chip as the MacBook Pro. If this is true we won’t have long to wait to find out given that October ends in just a few weeks.",
    "The M1X chip is the name currently given to the new and improved processor that should sit inside Apple’s soon-to-be-announced MacBook Pro and Mini Mac.",
    "According to Gurman, the M1X will be “a more graphics-intense and professional-focused M1 chip”. In addition, it has reportedly been developed with two variations planned for release; both have 10 CPU cores but either 16 or 32 GPU cores.",
    "For comparison, the M1 only uses 8 cores for its CPU and a further 8 for its GPU.",
    "We’ll want to temper our expectations though. While the M1 chip is undeniably an improvement over the Intel chips that Apple had been using previously, the company made some pretty bold claims about its M1 chip that might not have fully panned out in the end – the same could be true of these M1X rumors.",
    "So for now we’ll want to wait and see how good the M1X chips are for ourselves to know if you really need to upgrade your current tech, and hopefully, we’ll have one in our hands to test fairly soon."
  ],
  "headers": {
    "3": "Analysis: is the M1X chip a worthy upgrade?"
  },
  "links": {
    "new MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "M1X Apple silicon chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Bloomberg's": "https://www.bloomberg.com/europe",
    "Mac Mini 2021 redesign": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "might not have fully panned out in the end": "https://www.techradar.com/news/is-the-apple-m1-really-the-best-mobile-processor-we-put-it-to-the-test"
  }
}