{
  "source": "https://www.techradar.com/news/ces-2021-the-hottest-headphones-and-wireless-earbuds-from-the-virtual-tech-expo",
  "title": "CES 2021: the hottest headphones and wireless earbuds from the virtual tech expo",
  "category": "audio-visual",
  "updated": "2021-01-18T16:53:56Z",
  "author": "olivia-tambini",
  "summary": "Noise-cancelling headphones dominated CES 2021",
  "article": [
    "It wouldn’t be CES without an influx of new headphones from brands big and small, and while this year’s tech expo has been a little different, CES 2021 hasn’t disappointed when it comes to personal audio devices.",
    "We’ve seen everything from premium noise-cancelling headphones that’ll put a healthy dent in your bank balance to cheap true wireless earbuds that could rival the ever-popular Apple AirPods Pro.",
    "Noise cancellation was the star of the show this year, with more brands furnishing their earbuds with the clever tech – and with more of us than ever working from home, it makes sense that audio companies would focus on products that will help us to block out the environmental sound.",
    "Most companies seem to have concentrated on refining features like noise cancellation that’s already pretty well established, we have seen a few brands delving into more futuristic technologies, like Mobvoi with its air gesture-controlled wireless earbuds.",
    "While many of these new headphones won’t be available to buy until later in the year, CES provides us with a great opportunity to see which cans will be on our 2021 wishlist. Here are the headphones we think you should keep an eye out for this year.",
    "JBL has gone big on noise-cancelling headphones and earbuds this year, with a comprehensive range of new cans for 2021.",
    "First up, are the new JBL Tour ONE over-ear headphones and the JBL Tour Pro+ true wireless earbuds.",
    "Both models come with adaptive noise cancellation, an Adaptive Ambient Aware mode for when you want to tune into your surroundings, and TalkThru, which allows you to hear the voices of people around you without turning off your music.",
    "Best of all, JBL's latest headphones come with a 'SilentNow' feature, which means you can activate noise cancellation without having to turn Bluetooth on – perfect if your device is in airplane mode during a flight.",
    "Both models will be available to buy in May, with the JBL Tour One costing £279.99 and the JBL Tour Pro+ costing £179.99. Global availability is still TBC, but that works out at around $380 / AU$490 for the JBL Tour ONE and $240 / AU$310 for the JBL Tour Pro+.",
    "Read more: These noise-cancelling headphones could be the perfect travel companions",
    "JBL also announced its Live range of headphones. The JBL Live Pro+ boast adaptive noise cancellation as well as a 'Smart Ambient' mode, which allows you to hear your surroundings without removing the earbuds – handy if you need to have a quick conversation and don't want to interrupt your music. There's also an auto-pause feature, which means your music will stop as soon as you take out your buds.",
    "An IPX4 water-resistance rating means you should be able to work out using the JBL Live Pro+ without worrying that a little sweat or rain will cause them to break. Meanwhile, battery life comes in at seven hours of playback from the buds themselves, with a further 21 hours provided by the wireless charging case – that's longer than the AirPods Pro, though not the best battery life we've ever seen.",
    "At £169.99, they're cheaper than Apple's premium earbuds too – though you'll have to wait until April to get your hands on them. Global pricing is still to be confirmed, but that works out at around $230 / AU$300.",
    "That’s not all – the new wireless earbuds are joined by two more noise-cancelling models, including a pair of over-ear headphones and a pair of on-ear headphones.",
    "The JBL Live 660NC over-ear headphones come with up to 40 hours of battery life with ANC turned on, jumping to 50 hours when that feature is switched off, making them ideal for commuting (or more likely these days, working from home).",
    "If you prefer the on-ear form factor there's the JBL Live 460NC, the cheapest headphones in the new line-up at £119.99 (about $160 / AU$210). Despite the lower price, they still come with adaptive noise cancellation, JBL's Smart Ambient mode, support for voice assistants, and up to 50 hours of battery life.",
    "Read more: JBL unveils noise-cancelling wireless earbuds to rival the Apple AirPods Pro",
    "Continuing the trend for cheap noise-cancelling earbuds was Anker, with the Soundcore Liberty Air 2 Pro. These buds come with active noise cancellation, custom-tuned sound, and wireless charging for just $129.99 (about £95 / AU$170).",
    "In terms of design, these true wireless earbuds have elongated stems similar to the original Apple AirPods, which house six noise-cancelling microphones that Anker says helps keep your calls sounding clear, and come with a sliding charging case that uses USB-C to charge.",
    "On paper, the earbuds have a lot of the same features as the Apple AirPods Pro – which are among the best true wireless earbuds out there right now – but with a few new tricks exclusive to Anker, like HearID that tests your hearing and creates a custom sound profile for you.",
    "Read more: This new AirPods Pro rival offers noise cancellation and wireless charging at half the cost",
    "At the other end of the price scale are the V-Moda M-200 ANC. These premium cans look almost identical to their predecessors (the exceptional V-Moda M-200), with hexagonal earcups – which come in customizable colors and the option to include a personalized engraving – and a rugged, foldable headband.",
    "However, they’ve been upgraded for 2021 with active noise cancellation and wireless connectivity, making them a compelling alternative to the Apple AirPods Max.",
    "The drivers inside have been downsized to 40mm compared to the 50mm drivers found in the non-ANC model. Hopefully that won't have too much of an impact on the sound quality; the original V-Moda M-200 impressed us with their excellently balanced soundstage, well-extended bass, and detailed trebles.",
    "Unlike the Apple AirPods Max, the V-Moda M-200 ANC come with the option of wired listening, with a 3.5mm audio cable included in the box. The lack of audio port on Apple's headphones was particularly contentious, with many – quite fairly – expecting a level of flexibility to come with headphones that cost $549 / £549 / AU$899.",
    "Saying that, they're not exactly cheap either; the V-Moda M-200 ANC will cost $499 when they become available to buy in March. While global pricing and availability is yet to be announced, that works out at about £370 / AU$640.",
    "Read more: Can't get the Apple AirPods Max? These noise-cancelling headphones might do the trick",
    "Sennheiser also has a great reputation when it comes to audiophile headphones, and its latest earbuds prove that you don't have to skimp on the specs when it comes to the more compact form factor.",
    "The Sennheiser IE 300 are powered by a refined version of the company's 7mm Extra Wide Band transducer, which it says will deliver a well-balanced sound signature with excellent sonic accuracy.",
    "Inside the transducer is a membrane foil that's designed to reduce natural resonances and harmonic distortion, a transducer back volume to minimize reflection within the earbuds' housings, and a resonator chamber to reduce resonance in the ear canal, which should lead to more detailed treble.",
    "A frequency response of 6Hz – 20kHz means that the Sennheiser IE 300 should deliver impactful bass – although frequencies below 20Hz are generally 'felt' rather than heard in the traditional sense.",
    "Available in Europe on January 19, the Sennheiser IE 300 will cost $299.95 / £259 – while global pricing is still to be confirmed, that works out at around AU$390.",
    "That's certainly pricey for a pair of wired in-ear headphones, though those audiophile-friendly specs may convince buyers to fork out the extra cash in the pursuit of pristine sound.",
    "Read more: Sennheiser's latest in-ear headphones are made for audiophiles",
    "Lastly, wearables brand Mobvoi announced its latest wireless earbuds following a successful crowdfunding campaign – and they come with a mind-blowing 60-hour battery life.",
    "The Mobvoi Earbuds Gesture boast 10 hours of battery life from the buds themselves, with a further 50 hours provided by their 600mA charging case, making them among the longest-lasting true wireless earbuds on the market.",
    "The new earbuds also come with Mobvoi’s TicMotion technology, which allows you to accept incoming calls by nodding your head, and reject them by shaking your head. We first saw this feature with the TicPods 2 Pro at CES 2020, however, we found that in practice, the technology rarely worked as it was supposed to, with the buds often failing to register our head movements.",
    "Hopefully Mobvoi has refined the technology for 2021 – if not, the earbuds also feature touch controls, so you can control your music playback, incoming calls, and your device’s voice assistant by tapping their outer housings.",
    "For what it’s worth, voice calls should sound pretty clear, thanks to built-in mics that help the buds to apply noise isolation to your voice. Plus, an IPX5 water-resistance rating means they should be suitable for use while working out.",
    "As for the audio? We’re left guessing somewhat, but we do know that the Mobvoi Earbuds Gesture come with 6mm dynamic drivers inside.",
    "You’ll be able to buy the new wireless earbuds for $89.99 / £79.99 via Amazon and the Mobvoi website. Global pricing is still to be confirmed, but that works out at roughly AU$115.",
    "Read more: These wireless earbuds boast incredible battery life – but will their unusual controls actually work?"
  ],
  "headers": {
    "5": "The latest JBL headphones",
    "18": "Anker Soundcore Liberty Air 2 Pro",
    "22": "V-Moda M-200 ANC",
    "28": "Sennheiser IE 300",
    "35": "Mobvoi Earbuds Gesture"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "These noise-cancelling headphones could be the perfect travel companions": "https://www.techradar.com/news/these-noise-cancelling-headphones-could-be-the-perfect-travel-companions",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "on-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-on-ear-headphones-1304537",
    "JBL unveils noise-cancelling wireless earbuds to rival the Apple AirPods Pro": "https://www.techradar.com/news/jbl-unveils-noise-cancelling-wireless-earbuds-to-rival-the-apple-airpods-pro",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "This new AirPods Pro rival offers noise cancellation and wireless charging at half the cost": "https://www.techradar.com/news/this-new-airpods-pro-rival-offers-noise-cancellation-and-wireless-charging-at-half-the-cost",
    "Apple AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Can't get the Apple AirPods Max? These noise-cancelling headphones might do the trick": "https://www.techradar.com/news/cant-get-the-apple-airpods-max-these-noise-cancelling-headphones-might-do-the-trick",
    "audiophile headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Sennheiser's latest in-ear headphones are made for audiophiles": "https://www.techradar.com/news/ces-2021-sennheisers-latest-in-ear-headphones-are-made-for-audiophiles",
    "crowdfunding campaign": "https://www.indiegogo.com/projects/mobvoi-earbuds-gesture-intuitive-ai-assistance#/",
    "TicPods 2 Pro": "https://www.techradar.com/reviews/ticpods-2-pro",
    "Mobvoi website": "https://mobvoi.m4ibck.net/c/338476/733475/10848?subId1=trd-us-9523524641722320000&u=https%3A%2F%2Fwww.mobvoi.com%2F",
    "These wireless earbuds boast incredible battery life – but will their unusual controls actually work?": "https://www.techradar.com/news/these-wireless-earbuds-boast-incredible-battery-life-but-will-their-unusual-controls-actually-work"
  }
}