{
  "source": "https://www.techradar.com/news/heres-why-amazon-prime-videos-lord-of-the-rings-series-cost-dollar465-million-to-make",
  "title": "Here's why Amazon Prime Video's Lord of the Rings series cost $465 million to make",
  "category": "entertainment",
  "updated": "2021-05-14T16:15:45Z",
  "author": "samuel-roberts",
  "summary": "Money Baggins",
  "article": [
    "Amazon Prime Video has explained why its TV adaptation of The Lord of the Rings cost $465 million just for a single season. While it's partly to do with the scale of the show, which is expected to release this year on the streaming service, it's also because Amazon is setting up the infrastructure for the entire series.",
    "\"This is a full season of a huge world-building show,\" Amazon's Jennifer Salke told THR, explaining that the market had become 'crazy' generally – using Netflix's $469 million deal to buy two Knives Out sequels as an example. \"The number is a sexy headline or a crazy headline that’s fun to click on, but that is really building the infrastructure of what will sustain the whole series.\"",
    "Salke explained that the studio had to make decisions on when to spend, and when to draw the line when bidding for series like The Lord of the Rings.",
    "Of course, the high price is motivated by another factor: getting attention in a streaming landscape that's suddenly become the domain of big properties like Marvel and Star Wars.",
    "\"As for how many people need to watch Lord of the Rings? A lot,\" Salke continued with a laugh. \"A giant, global audience needs to show up to it as appointment television, and we are pretty confident that that will happen.\"",
    "New Zealand, where the show is filmed, has stumped up some of the cash to make The Lord of the Rings – a subsidy of up to $160 million NZD was reportedly part of the deal to make the show, according to local publication Stuff.",
    "Every streamer is looking for that big show that moves the needle on subscribers. The Lord of the Rings – even though it was done definitively on the big screen by director Peter Jackson – is one of those series with the recognition to get everyone interested. The challenge, for the show's creators, is making its story just as exciting to people as Frodo Baggins' journey to destroy the ring.",
    "This is a show set in the second age of The Lord of the Rings – thousands of years before the other stories. While it means lots of crossover in setting, and some regonizable characters like Galadriel (played by Morfydd Clark, the breakout star of horror movie Saint Maud), it's otherwise likely to feel fairly unfamiliar to anyone who hasn't spent a day reading through the appendices of the books.",
    "The style of this show is also likely to be quite different to Jackson's movies, too. The show's opening episodes will be directed by JA Bayona – the brilliant mind behind A Monster Calls and The Impossible.",
    "Setting the series apart from those movies, while underlining to audiences that this is Middle-earth, will be an interesting challenge for Amazon to thread. If nothing else, no one will claim the streamer didn't spend enough to make it happen."
  ],
  "headers": {
    "6": "Analysis: worth it for Amazon?"
  },
  "links": {
    "The Lord of the Rings": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "THR": "https://www.hollywoodreporter.com/business/business-news/hollywood-top-female-executives-1234950963/",
    "two Knives Out sequels": "https://www.techradar.com/news/netflixs-knives-out-2-cast-four-actors-this-week-the-latest-is-a-wandavision-star",
    "Stuff": "https://www.stuff.co.nz/national/politics/300278735/behind-the-amazon-deal-fancy-dinners-film-premieres-and-a-covid19-pandemic"
  }
}