{
  "source": "https://www.techradar.com/news/microsoft-should-just-admit-defeat-and-give-windows-10-product-keys-away-for-free",
  "title": "Microsoft should just admit defeat and give Windows 10 product keys away for free",
  "category": "computing",
  "updated": "2021-04-17T10:00:13Z",
  "author": "matt-hanson",
  "summary": "Windows 10 for free – you know it makes sense",
  "article": [
    "When was the last time you had to enter in your Windows 10 product key? This thought struck me earlier this week when we were talking about building and upgrading PCs.",
    "I realised that on a few of my PCs, I've not had to enter in the Windows 10 product key for years, despite numerous upgrades and even fresh installations of Windows 10 itself. Over the years, some of the PCs have been upgraded so many times that one could argue that they are no longer the same machines that Windows 10 was originally installed on. Sort of like the Ship of Theseus that Vision was talking about at the end of WandaVision.",
    "Now, with previous versions of Windows, every time you reinstalled, you'd need to enter in your product key. These days, Windows 10 seems to run perfectly fine without one - except for a watermark encouraging you to activate Windows 10.",
    "And, if you have activated Windows 10 once before with a product key, that seems to be enough, no matter how many times you do fresh reinstall - which completely wipes the hard drive.",
    "So, what's happening? Has Microsoft come up with a way to tie in the Windows 10 product key with your hardware? I would have thought it would also tie into your Microsoft account, but then I reset a PC and signed in with a local account instead - and Windows 10 was happily activated without an issue.",
    "Or, does Microsoft not really care that much? I suspect it's a bit of both",
    "But, why wouldn't Microsoft care? This is, after all, the company that tries to get you to use its Edge browser and Bing search engine at every opportunity – so why would it suddenly become so carefree about Windows 10?",
    "That’s sort of the answer. You see, it’s in Microsoft’s interests to get as many people on Windows 10 as possible for a simple reason: as a trojan horse for Edge and Bing. The amount of valuable ad money and user information Microsoft would get from more people using Edge and Bing is huge, and by getting people onto Windows 10 as quickly as possible – which has both of those deeply integrated – it can help boost the userbase of those services.",
    "And it needs all the help it can get. While the new Chromium-based Edge browser is gaining in popularity – it recently overtook Firefox – it still languishes miles behind Google’s Chrome.",
    "And Bing is doing even worse, with the search engine nowhere near as popular as Google’s… Google.",
    "So, Microsoft will want to get more people using them, and to do that it needs to knock down the biggest barrier to entry: paying for Windows 10.",
    "That’s right. I think Microsoft should give Windows 10 away for free.",
    "In many ways, Microsoft sort of is anyway. While it originally offered a free upgrade to Windows 10 for Windows 8.1 and Windows 7 users, it was supposed to only be for a limited time.",
    "However, six years after Windows 10 launched, it’s still incredibly easy to upgrade to Windows 10 for free.",
    "The free update doesn’t involve doing or downloading anything illegal. You simply have to use the official Windows Media Creation Tool and select “Download tool now” under the section titled “Create Windows 10 installation media.”",
    "Some people consider this a loophole, but it’s not even that. You just use the official tools Microsoft is offering.",
    "Microsoft must be keenly aware that there’s an easy way to upgrade to Windows 10 for free, rather than paying for an upgrade, yet it has done nothing about it. Why? I think, it’s because Microsoft tacitly approves.",
    "After all, if it means more people using Windows 10 (and therefore possibly Bing and Edge), then that’s good.",
    "It was also painfully easy to find cheap Windows 10 product codes on eBay. While many seem to have been removed, there used to be so many, there was no way Microsoft didn’t know about them. Yet it seemed in no rush to do anything about them at first. Why? Again, it was getting more people onto Windows 10.",
    "The amount of money Microsoft can make by getting more people to use Edge and Bing (and share their data) probably dwarfs the money they’d get from selling Windows 10 Home licence keys (bulk selling Windows 10 Pro or Enterprise licences to businesses is a different matter).",
    "So, the answer is simple: by making Windows 10 Home free, Microsoft will be getting more people than ever onto the operating system, and will stop people from going to resellers – or even worse, pirating the operating system.",
    "So… will it? While I’d love to see Microsoft do something so bold, it may be hesitant to do so. For a start, there’s no way it would want to give up on getting money for licences for businesses. That probably remains a big revenue stream, so while Windows 10 Home could be free, Pro and Enterprise would still need to be charged for (and means more companies and organisations looking to move to open-source alternatives like Linux).",
    "Also for a huge amount of people, the first thing they do with a new Windows 10 installation is open up Edge and search on Bing… to download Chrome. Microsoft’s ability to squeeze out profit from those users will be difficult. In fact, we would then probably see more adverts baked into Windows 10, and more tighter integration of Edge and Bing into the operating system – and definitely more annoying pop-ups trying to get you to use it.",
    "This is also all based on the fact that Microsoft would be making money not from Windows 10 licences any more, but from selling off your data. That won’t go down very well with many people.",
    "So, while offering Windows 10 for free may seem like a great idea, perhaps it’ll still be too high a price for people to pay."
  ],
  "headers": {
    "6": "Why wouldn't Microsoft care?",
    "12": "Do it, you cowards"
  },
  "links": {
    "Windows 10 product key": "https://www.techradar.com/how-to/how-to-find-your-windows-10-product-key",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "it recently overtook Firefox": "https://www.techradar.com/news/firefoxs-popularity-falls-further-as-microsoft-edge-becomes-second-most-popular-web-browser-after-chrome",
    "Windows 8.1": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-8-1-1161745/review",
    "Windows 7": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-7-622923/review",
    "upgrade to Windows 10 for free": "https://www.techradar.com/how-to/software/operating-systems/how-to-upgrade-to-windows-10-for-free-1325764",
    "Windows Media Creation Tool": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-6015845050139258000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fsoftware-download%2Fwindows10"
  }
}