{
  "source": "https://www.techradar.com/news/rumored-dji-fpv-drone-revealed-in-full-in-unboxing-video",
  "title": "Rumored DJI FPV drone revealed in full in unboxing video",
  "category": "cameras",
  "updated": "2021-08-25T11:59:05Z",
  "author": "sharmishta-sarkar",
  "summary": "Taking drone racing to new heights?",
  "article": [
    "We've been hearing a lot about a DJI FPV (first-person-view) drone over the last few months, with leaked images and news of its US registration in December sparking rumors that DJI is making a new kind of drone.",
    "It seems those rumors may now well be true after an unboxing video of the DJI FPV drone leaked on Twitter, spilling a lot of its design secrets. The only thing we don't know is how well the upcoming quadcopter flies and what its exact specs are.",
    "The video confirms the design leaks revealed earlier, showing off a rounded quadcopter body with a front-facing camera on a gimbal. Also clearly seen are two smaller downward-facing cameras which, according to the video, don't appear to be for capturing footage but are potentially obstacle-avoidance sensors.",
    "The drone itself appears compact, with the accompanying FPV goggles looking just as large as the flying machine itself. However, as the unboxing video notes, the newly designed goggles are \"lighter\" than DJI's existing FPV headset.",
    "The FPV controller also seems to have been redesigned, looking more like a gamepad than before and featuring better hand grips and triggers.",
    "The battery that fits into the back of the drone is much larger than what you'd find in one of DJI's current line of consumer drones, which is what we'd expect as FPV drones are essentially used in racing that need better flight times. Also included in the box is a portable power bank, but it's unclear where that would plug in.",
    "Everything else about the DJI FPV Combo would be familiar to drone users, although it does feel like DJI's first FPV quadcopter would be user-friendly and not too intimidating for beginners.",
    "That said, FPV drones are very different beasts from the consumer fliers that we use for aerial photography. They're usually harder to maneuver, are much faster in the air and quite sensitive to control – meaning they need some amount of expertise to fly. They can also be used to carry heavy filming rigs.",
    "Whether DJI is targeting professional drone racers and filmmakers is as yet unclear, but we doubt there's long to wait before we find out exactly what the upcoming DJI FPV Combo can do. Earlier rumors suggested DJI would debut the drone after the Chinese New Year – if true, we're likely just days away from an official reveal."
  ],
  "headers": {
    "6": "Ready for take-off"
  },
  "links": {
    "leaked images": "https://www.techradar.com/news/leaked-dji-fpv-drone-photos-suggest-imminent-launch-for-speedy-new-flier",
    "US registration": "https://www.techradar.com/news/dji-fpv-drone-gets-official-registration-ahead-of-imminent-take-off",
    "leaked on Twitter": "https://twitter.com/OsitaLV/status/1360817679557402624",
    "DJI's existing FPV headset": "https://www.techradar.com/news/dji-fpv-goggles-2019"
  }
}