{
  "source": "https://www.techradar.com/news/microsoft-brings-the-best-windows-10-copy-and-paste-feature-to-android",
  "title": "Windows 10 update brings its copy-and-paste feature to Android",
  "category": "computing",
  "updated": "2021-08-05T13:54:07Z",
  "author": "joel-khalili",
  "summary": "Windows 10 users encouraged to opt for Android",
  "article": [
    "Microsoft is set to give Android users a significant upgrade with a new update for its SwiftKey keyboard tool that allows users to copy and paste content between almost all their devices.",
    "In the latest edition of the SwiftKey beta, Microsoft has enabled an integration with the Windows 10 cloud clipboard, a tool that has historically been used to copy data between multiple Windows devices (e.g. a desktop and Surface device).",
    "Now, however, cloud clipboard functionality has been extended to Android devices too, which means users can copy data to their smartphone or tablet clipboard and paste it on their Windows PC - and vice versa.",
    "Although SwiftKey is available for iOS, cloud clipboard support is not yet included. Likewise, users will not be able to use SwiftKey to copy information over to devices running on macOS.",
    "While the new copy-and-paste feature is likely to roll out as part of a full SwiftKey build in the near future, users can sample the upgrade early by installing the beta from the Google Play Store.",
    "However, the cloud clipboard integration is not active by default, so will need to be switched on via Settings > Rich input > Clipboard. Here, the “Sync clipboard history” option will need to be toggled on.",
    "A bit of tinkering is also required on the Windows 10 side. From Settings > System > Clipboard, three options will need to be activated here: “Clipboard history”, “Sync across devices” and “Automatically sync text that I copy”.",
    "Further, users will need to be running the Windows 10 October 2018 update or newer in order to have access to the cloud clipboard.",
    "With all these parameters fulfilled, any data copied to the clipboard on either operating system should sit ready and waiting to be pasted into applications on the user’s other Windows or Android devices.",
    "Via Neowin"
  ],
  "headers": {
    "4": "Boost your copy-and-paste"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "beta": "https://play.google.com/store/apps/details?id=com.touchtype.swiftkey.beta",
    "Neowin": "https://www.neowin.net/news/microsoft-will-finally-allow-users-to-sync-windows-10-clipboard-with-their-android-device/"
  }
}