{
  "source": "https://www.techradar.com/news/your-garmin-watch-is-getting-a-bundle-of-new-tools-to-help-you-get-fitter",
  "title": "Your Garmin watch is getting a bundle of new tools to help you get fitter",
  "category": "fitness",
  "updated": "2021-08-17T15:01:53Z",
  "author": "cat-ellis",
  "summary": "A little extra push to meet your goals",
  "article": [
    "If you own a high-end Garmin watch, there's good news - it's about to get even better. Watches in the Fenix 6 series, the MARQ collection, and the Enduro are all getting a software update that'll add a set of new tools that'll encourage you to push yourself that little bit harder.",
    "Once you've received the update, complete a workout and you'll be asked to record how hard it was, and how it felt. These scores will be synced with the Garmin Connect app.",
    "Rate of perceived exertion (RPE) can be a very handy tool, particularly if you're not used to training with heart rate zones, or haven't yet set up your heart rate zones in the Garmin Connect app. Although it's a subjective measurement, it can be very useful as a way of determining how hard you're pushing yourself, and help you adjust your training sessions accordingly.",
    "Challenges are also getting an upgrade. These are goals you can sign up for through the Garmin Connect app, which you can complete to earn virtual badges. You can take part in these regardless of which device you own, but Enduro, Fenix 6, and MARQ watches now support the Garmin Connect Challenges app, which lets you keep tabs on them directly from your wrist.",
    "If a top-end Garmin is out of your price range, don't worry – the Garmin Connect Challenges app is also compatible with all watches in the Forerunner line (including the entry-level Forerunner 55), plus Venu and Vivoactive devices.",
    "The Fitness Age tool is also getting an upgrade. Fitness Age is a number calculated using your chronological age, plus your resting heart rate, level of physical activity, and either BMI or (if you have a smart scale like the Garmin Index S2) body fat percentage. If your Fitness Age is lower than your actual age, you're on the right track. If it's higher, you might want to make some lifestyle changes.",
    "The Fitness Age tool already some suggestions to help you lower your score, but until now, the activity recommendations haven't been tailored to you specifically. Now, rather than simply advising you that you need to spend longer in high heart rate zones, you can receive specific workout suggestions to help you hit the recommended target.",
    "Finally, Intensity Minutes are getting an upgrade. Intensity Minutes are a metric based on time spent in different heart rate zones, and following the upgrade, you'll be able to see how and when you earned them through the Garmin Connect app. If you add an optional data field to your watch face, you can also see them during an activity.",
    "Some people are intrinsically motivated enough to push themselves with no external reward, but the rest of us need a little chivvying. Achieving a new personal best is a particularly good goal, but if you don't have a specific event on the horizon (a common situation during the pandemic), app-based challenges, achievements and badges are a useful tool to encourage you to go the extra mile.",
    "I've been working on lowering my own Fitness Age in Garmin Connect, which has been quite insightful. My resting heart rate was already low enough, but reducing the number further involved dropping a BMI point and stepping up my activity level - pushing me to put in more intense training sessions rather than falling into a routine of more leisurely runs.",
    "Strava is another excellent tool if you're more competitively minded, and learning that you've been 'dethroned' for a particular segment (ie someone else has beaten your best time for a section of a course) can really incentivize you to lace up your running shoes and put in some extra effort to reclaim your title.",
    "Working for virtual points and badges might seem silly at first, but the benefits to your fitness are very real – and it's also fun. There's no shame in waking up at 4am for a run to earn your Early Riser badge, or heading out in the snow to complete the Frosty achievement. Quite the opposite,"
  ],
  "headers": {
    "5": "Turn back the clock",
    "8": "Opinion: extra motivation is a powerful thing"
  },
  "links": {
    "Garmin watch": "https://www.techradar.com/best/garmin-watch",
    "Garmin Connect Challenges app": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1421774326393358600/https://apps.garmin.com/en-US/apps/57c2c92a-4fb8-4c63-8d3b-d906bd720c82",
    "Garmin Index S2": "https://www.techradar.com/reviews/garmin-index-s2",
    "data field": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4533132286152768000/https://www8.garmin.com/manuals/webhelp/fenix66s6xpro/EN-US/GUID-5176B6E4-F272-4437-BDA7-85B31231CB3E.html"
  }
}