{
  "source": "https://www.techradar.com/news/using-an-iphone-may-not-be-as-safe-as-you-thought",
  "title": "Using an iPhone may not be as safe as you thought",
  "category": "phones",
  "updated": "2021-03-16T19:41:38Z",
  "author": "anthony-spadafora",
  "summary": "It's time to move beyond the myth that iPhones are unhackable",
  "article": [
    "Although many iPhone users think of themselves as unhackable, that simply isn't the case as the past few years have shown that our smartphones, whether they run iOS or Android, can be exposed to a wide variety of different vulnerabilities.",
    "In a new blog post, NordVPN has pitted the two most popular mobile operating systems against each other to reveal that while iOS is safer than Android when it comes to the security of its hardware and App Store, iOS security can still be breached.",
    "For instance in August of 2019, Google Project Zero security researcher Ian Beer discovered an unseen vulnerability in a number of iPhones and other devices running iOS that allowed an attacker to reboot and take control of them remotely. By exploiting this vulnerability, an attacker could read emails, download photos and even potentially spy on users through their microphone and camera. Thankfully Apple released a fix for this issue and all up-to-date devices are now secure.",
    "Digital privacy expert at NordVPN, Daniel Markuson provided further insight on this vulnerability and its implications when it comes to iOS security, saying:",
    "“This case has proven that no one is ever fully safe. And even though there are no recordings of hackers using such a vulnerability, many Apple users should be more cautious and maybe forget the fact that iPhones are unhackable.”",
    "One of the most common ways to take control of your iPhone or at least your Apple ID is through guessing your password. This can be easily done if you reused your password across multiple accounts and it found its way into NordVPN's list of the most common passwords.",
    "For this reason, you should avoid reusing passwords and ensure that you create a strong, unique and complex password for each one of your accounts. While you could use a password generator to achieve this, most password managers now have this capability in addition to being able store and sync your passwords across devices.",
    "Besides exploiting vulnerabilities or guessing your password, cybercriminals can also gain access to your iPhone through human error. For instance, someone might send you a suspicious link or use a fake landing page in order to steal your credentials. At the same time though, an app could request unnecessary permissions to location services or to your camera as another means to steal your data.",
    "Finally, unprotected or public WiFi networks are often used by hackers to steal personal information which is why you should always secure your iPhone with a VPN when connecting to networks outside of your home.",
    "While Apple's iPhone may be more secure than some Android smartphones, the tricks and tools used by hackers can be used to compromise anyone's accounts or devices which is why our online security is something we all need to take more seriously."
  ],
  "headers": {
    "5": "iPhone security"
  },
  "links": {
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "blog post": "https://go.nordvpn.net/aff_c?offer_id=564&aff_id=3013&source=trd&aff_click_id=trd-us-7270050749838920000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fusing-an-iphone-may-not-be-as-safe-as-you-thought&url=https%3A%2F%2Fnordvpn.com%2Fblog%2Fios-vs-android-security%2F",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Google Project Zero": "https://www.techradar.com/news/google-project-zero-changes-rules-on-revealing-cyberattacks",
    "spy on users": "https://www.techradar.com/news/malicious-code-reportedly-found-in-ios-apps-installed-by-billions-users",
    "Daniel Markuson": "https://www.techradar.com/news/thousands-more-american-were-monitored-through-their-devices-last-year",
    "Apple ID": "https://www.techradar.com/how-to/computing/apple/how-to-add-extra-security-to-your-apple-id-1320421",
    "most common passwords": "https://www.techradar.com/news/chances-are-your-passwords-are-absolutely-terrible",
    "password generator": "https://www.techradar.com/best/password-generator",
    "password managers": "https://www.techradar.com/best/password-manager",
    "unnecessary permissions": "https://www.techradar.com/news/which-macos-and-ios-apps-are-collecting-data-on-you-apple-finally-tells-all",
    "public WiFi networks": "https://www.techradar.com/news/public-wi-fi-and-why-you-need-a-vpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones"
  }
}