{
  "source": "https://www.techradar.com/news/hurry-dont-miss-the-best-cyber-monday-gaming-laptop-deal-of-2021",
  "title": "Hurry! Don't miss the best Cyber Monday gaming laptop deal of 2021",
  "category": "computing",
  "updated": "2021-11-28T14:15:13Z",
  "author": "jess-weatherbed",
  "summary": "Seriously, act fast to grab this cheap gaming laptop",
  "article": [
    "It looks like Dell has just dropped the best Cyber Monday gaming laptop deal for this year. This incredible Dell G15 is packing all the latest hardware, from an 11th generation Intel Core i5 processor, 8GB of RAM and the recently released Nvidia RTX 3050 Ti graphics card.",
    "There are plenty of gaming laptops on offer right now in the Cyber Monday deals, but this is by far one of the cheapest that doesn't contain ageing components like a GTX 1650 or an outdated, underpowered CPU.",
    "The G15 is available for just $799.99, saving you a whopping $419 off the usual $1,218.99 asking price (Not in the USA? Scroll down for deals in your region).",
    "It's not the most powerful gaming laptop on the market right now, but with features like DLSS, it doesn't have to be. You can boost your framerate at higher game quality settings thanks to the Nvidia AI, and despite being highly affordable, you also get to use ray tracing in supported titles.",
    "This is especially beautiful in games like Minecraft, where RTX graphics make the blocky favorite feel like a totally new game, with realistic light effects that change across a variety of surfaces.",
    "At this price, we expect the available stock will run out pretty quick, so if you've been eyeing up any affordable gaming laptops in the sales this year, we're pretty confident that this offer will be hard to beat.",
    "Its 15.6-inch 1080p display is crisp and has a speedy 120Hz refresh rate, showing you up to 120 frames of your precious framerate, which can make a real difference if you're a skilled pro in any competitive titles like Fortnite or Apex Legends.",
    "No matter where you live, you'll find all the lowest prices for gaming laptops from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best Dell G15 gaming laptop Cyber Monday deal",
    "7": "More Cyber Monday gaming laptop deals",
    "8": "More Cyber Monday deals"
  },
  "links": {
    "Cyber Monday gaming laptop": "https://www.techradar.com/news/cyber-monday-gaming-laptop-deals-2021-what-to-expect",
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "The G15 is available for just $799.99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5168774463950860000/https://deals.dell.com/en-us/productdetail/bq59",
    "in games like Minecraft": "https://www.techradar.com/news/i-thought-minecraft-rtx-was-a-gimmick-and-then-i-played-the-damn-thing"
  }
}