{
  "source": "https://www.techradar.com/news/microsoft-remote-desktop-update-on-ios-finally-brings-these-features",
  "title": "Microsoft Remote Desktop update on iOS finally brings these features",
  "category": "computing",
  "updated": "2021-02-24T23:03:59Z",
  "author": "mayank-sharma",
  "summary": "Latest release fixes bugs and improves app’s usability",
  "article": [
    "The latest version of the iOS version of Microsoft Remote Desktop brings a slew of enhancements, most notably to the app’s connection bar.",
    "The updated version 10.2.4 of the app enhances its usability, particularly on iOS devices with large screens such as the iPad and iPhone Pro.",
    "Microsoft Remote Desktop is one of the most commonly used remote desktop applications. It is available for both Android and iOS and provides a useful cache of features for both personal and business use cases.",
    "Microsoft has been constantly improving the usability of the Remote Desktop app, most notably adding shortcuts to access common functions in recent releases.",
    "The app’s first update of the year is a considerable one and besides bug fixes, also brings in several user experience enhancements. The update includes a new zoom slider, which can be invoked by long pressing the maximize button.",
    "The app also brings new options to collapse and dock the connection bar. The changelog notes that the connection bar can now be collapsed simply by moving it to one of the four corners of the screen. The connection bar can even be docked to the left or right edge of the screen, which will allow for easier multitasking, especially on large screen devices.",
    "Behind the scenes, Microsoft has worked to iron out a bug which sometimes caused the user interface to stop resolving the workspace name during subscription.",
    "The latest updated release of the app is available for download from the App Store now.",
    "Via: MSPowerUser"
  ],
  "headers": {
    "3": "Easier to multitask"
  },
  "links": {
    "Remote Desktop": "https://www.techradar.com/news/best-remote-desktop-software",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "Microsoft Remote Desktop": "https://www.techradar.com/reviews/microsoft-remote-desktop-review",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "MSPowerUser": "https://mspoweruser.com/microsoft-remote-desktop-ios-changelog-10-2-4/"
  }
}