{
  "source": "https://www.techradar.com/news/twitch-hack-reveals-amazons-steam-rival-could-be-cheekily-named-vapour",
  "title": "Twitch hack reveals Amazon’s Steam rival could be cheekily named Vapour",
  "category": "computing",
  "updated": "2021-10-07T11:46:53Z",
  "author": "darren-allan",
  "summary": "Vapour could be a games store integrated directly within Twitch",
  "article": [
    "The big Twitch hack that just happened also came with an interesting revelation in the form of leaked details that seem to indicate that Amazon (which owns Twitch) is building a Steam rival.",
    "The would-be online games store is codenamed Vapour (or Vapor) – presumably a cheeky dig at Steam rather than a serious candidate for a final name – and according to the info spilled in the hack, it’ll integrate Twitch features as you might expect. This was uncovered by data miner Sinoc on Twitter.",
    "Think of Twitch but with a built-in games platform where you can buy the latest titles, and have your games library in the same place that you do all your stream viewing.",
    "Sinoc also discovered code for what’s apparently an app by the name of ‘Vapeworld’, which would appear to be some kind of VR chat app complete with various assets including 3D emotes. Presumably this could be integrated with Vapor within Twitch, given the reference in the name.",
    "The (claimed) presence of this stuff in the leaked material does not necessarily mean it’s anything beyond concepts and potential ideas for the future, of course.",
    "Vapour – or whatever it may end up being called, if anything ever comes of it – makes sense from Amazon’s point of view, given that Twitch represents an instant community as a purchasing audience on tap. With some clever strategy – and exclusive games or content, maybe – it’s not difficult to imagine how this could be a way of very quickly building a compelling rival to Steam.",
    "Such a platform would, of course, add to Amazon’s gaming strengths, with Prime Gaming (previously Twitch Prime) already offering free in-game goodies (and freebie games for that matter).",
    "Whether Vapour will end up on the pile as a missed (or perhaps that should be ‘mist’) opportunity, or if it’ll actually ever come to anything, obviously remains to be seen. Although PC Gamer, which spotted the above tweet, points out a piece of evidence which seemingly reinforces the likeliness – namely an Amazon patent filing from 2017 describing an interface for ‘joining games from a spectating system’, with the ability to ‘order, purchase, or otherwise obtain demo or full versions of games’.",
    "There are a few digital dots here, as it were, but we’d be foolish to be too hasty to join them. Epic has, of course, already gone toe-to-toe with Steam for years now, backed with a ton of cash for exclusives, and Valve has managed to weather that storm thus far…"
  ],
  "headers": {
    "5": "Analysis: Could this happen, or is it likely to be Vapourware?"
  },
  "links": {
    "The big Twitch hack": "https://www.techradar.com/news/all-twitch-data-and-source-code-has-been-leaked-online",
    "which owns Twitch": "https://www.techradar.com/news/gaming/why-amazon-buying-twitch-is-great-news-1262678",
    "Steam": "https://www.techradar.com/news/the-best-steam-games",
    "compelling rival to Steam": "https://www.techradar.com/news/epic-games-store-vs-steam-battle-of-the-online-stores",
    "previously Twitch Prime": "https://www.techradar.com/news/twitch-prime-is-now-prime-gaming-will-keep-serving-up-free-gaming-goodies",
    "PC Gamer": "https://www.pcgamer.com/twitch-megaleak-reveals-secret-steam-competitor-codenamed-vapour/",
    "already gone toe-to-toe with Steam": "https://www.techradar.com/news/epic-games-to-take-on-steam-with-its-own-digital-games-store"
  }
}