{
  "source": "https://www.techradar.com/news/amd-and-xilinx-merger-gets-shareholder-approval",
  "title": "AMD and Xilinx merger gets shareholder approval",
  "category": "computing",
  "updated": "2021-04-08T10:06:33Z",
  "author": "bodhisatwa-ray",
  "summary": "$35bn deal is nearly complete",
  "article": [
    "Chipmaker AMD is edging closer to its $35bn takeover of semiconductor firm Xilinx after the deal was given shareholder approval by both companies.",
    "AMD revealed that stockholders have voted to approve their respective proposals, saying that acquisition will combine the two company's product portfolios and customers, bring together CPUs, GPUs, FPGAs, adaptive SoCs, and deep software expertise for better computing platforms for cloud, edge, and end devices.",
    "“For several years, AMD has successfully executed our long-term growth strategy and deepened the company’s partnerships to drive high-performance computing leadership,” said Dr. Lisa Su, AMD president, and CEO. “The acquisition of Xilinx marks the next leg in our journey to make AMD the strategic partner of choice for the largest and most important technology companies in the world as an industry leader with the vision, talent, and scale to support their future innovation.”",
    "This deal helps AMD ratchet up competition with Intel and Nvidia in the highly lucrative datacenter market.",
    "Xilinx specializes in Field Programmable Gate Arrays (FPGAs) - a type of semiconductor that can be altered even once they have been deployed. This level of programmability often makes them slower than GPUs or CPUs, but also far more versatile.",
    "Being so polyvalent means Xilinx technology can be used almost anywhere in a datacenter, which is great when you face a plurality of tasks. For example, a cloud storage company will have a different workload to a VPN service, the best website builder platform or video conferencing service.",
    "AMD now plans to improve its businesses in data centers, gaming, PCs, communications, automotive, industrial, aerospace, and defense.",
    "“The Xilinx team is one of the strongest in the industry and we are thrilled to be joining AMD,” said Victor Peng, Xilinx President, and CEO. “Our shared cultures of innovation, excellence, and collaboration will enable us to accelerate growth in the data center and pursue a broader customer base across more markets as a combined company.”",
    "The deal is not yet completed, however both AMD and Xilinx hope that the deal will be completed by the end of 2021."
  ],
  "headers": {
    "3": "Billion-dollar deal"
  },
  "links": {
    "$35bn takeover of semiconductor firm Xilinx": "https://www.techradar.com/news/watch-out-intel-and-nvidia-amd-just-made-a-game-changing-acquisition",
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Intel": "https://www.techradar.com/news/intel-sells-off-nand-storage-unit-in-multi-billion-dollar-deal",
    "Nvidia": "https://www.techradar.com/news/nvidia-will-build-the-worlds-fastest-ai-supercomputer",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "VPN service": "https://www.techradar.com/vpn/best-vpn",
    "best website builder": "https://www.techradar.com/news/the-best-website-builder",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software"
  }
}