{
  "source": "https://www.techradar.com/news/netflixs-new-horror-movies-will-be-a-binge-watching-experiment-heres-how",
  "title": "Netflix's new horror movies will be a binge watching experiment – here's how",
  "category": "entertainment",
  "updated": "2021-05-19T14:06:32Z",
  "author": "tom-power",
  "summary": "Netflix's Fear Street trilogy arrives this summer",
  "article": [
    "Netflix is preparing to push the streaming platform boundaries once more. Not content with releasing new ways to consume media, such as its recent Play Something button launch, the streaming giant is ready to take binge watching in a new direction.",
    "How? By making us binge watch movies, of course.",
    "July will see Netflix embark on an experiment of sorts with Fear Street, an upcoming horror movie trilogy based on the books by acclaimed author R.L. Stine.",
    "However, rather than staggering Fear Street's three instalments throughout the year or into 2022, Netflix will release each movie on a weekly basis beginning July 2. Part 1, which is set in 1994, will launch on that date, and it'll be followed by Part 2: 1978 and Part 3: 1666 on July 9 and July 16 respectively.",
    "To commemorate this landmark occasion, Netflix released an official teaser for its Fear Street trilogy and, by the looks of it, it'll be more gruesome and horrifying than Stine's original works.",
    "Check out the teaser trailer below:",
    "Like Stine's novels, Fear Street's plot takes place across three centuries in the small Ohio town of Shadyside. It centers on a group of teenagers who make the startling discovery that events, which have plagued their town for generations, may be connected somehow – and they could be the mysterious killer's next targets.",
    "As we mentioned, Netflix isn't afraid to push the boundaries when it comes to streaming content. This latest trial, then, isn't an unexpected move for the company to make, but it remains to be seen if audiences will take to the prospect of binge watching films in the way that they do with TV shows.",
    "While movies are less time consuming than TV series, they require viewers to be engaged in their plots for longer. Sure, you can take bathroom breaks when watching a film, but TV shows have self-installed breaks between their episodes, so the average viewer is more likely to take one once the credits roll at the end of an episode.",
    "Movies, on the other hand, don't have a break in their action, so you're more inclined to stick through your viewing until the film's end credits appear. Given the length of some flicks these days – Avengers: Endgame, for example is over three hours long – that's a decent chunk of time to sit through a movie, especially in your own home.",
    "What the Fear Street trilogy has going for it, however, is how its instalments are spread out.",
    "With each movie being released one week after the other, Netflix's decision could prove to be a masterstroke. Its weekly schedule for Fear Street will give viewers enough time to watch one instalment, discuss it with their friends, family or on social media, and prepare themselves for the next film.",
    "Not only that, but audiences won't need to re-watch the previous movie before they settle in for Fear Street's subsequent instalments. The events and plot details from, say, Part 1 will be fresh in viewers' minds by the time Part 2 launches. Nothing outside of a quick recap at the beginning of Part 2 or Part 3, will be necessary to bring audiences back into the fold.",
    "If Netflix's Fear Street experiment proves to be a success, it's a model we could see employed more in the future. If it isn't, though, there's no great harm done. The streamer will continue to release its TV properties in a binge watchable format for people to consume regardless of how Fear Street's trial turns out, so it won't be damaged by how well or poorly received this upcoming test is."
  ],
  "headers": {
    "7": "Analysis: will Netflix's movie binge watch experiment work?"
  },
  "links": {
    "recent Play Something button launch": "https://www.techradar.com/news/netflix-finally-releases-play-something-its-shuffle-play-feature"
  }
}