{
  "source": "https://www.techradar.com/news/oneplus-nord-2-charging-speed-confirmed-and-its-impressively-fast",
  "title": "OnePlus Nord 2 charging speed confirmed, and it's impressively fast",
  "category": "phones",
  "updated": "2021-07-21T08:34:43Z",
  "author": "tom-bedford",
  "summary": "65W fast charging",
  "article": [
    "We now live in a world where cheap phones can get premium features like top chipsets and high-res cameras, and as evidenced by the OnePlus Nord 2, fast charging is another tool no longer exclusive to expensive smartphones.",
    "Ahead of the Nord 2's launch event on July 22, the company has been teasing various features of the upcoming smartphone via Twitter, and most recently the device's battery capacity and charging speed have been detailed.",
    "Firstly, we know the phone will have a 4,500mAh battery. That's a fine size for a phone - not very big, but not too small - but it's not the real interesting part of the story.",
    "The eye-catching spec is the phone's 65W fast charging which is impressively fast for a handset at this price. In fact, in the lower-mid-range phone market that the Nord 2 will likely enter, only Realme phones like the Realme GT match that spec.",
    "Realme is a sibling company of OnePlus too, both being owned by BBK Electronics, and we often see brands under the umbrella share tech.",
    "The OnePlus Nord's 30W charging was fairly good as powering speeds go, but even in mid-2020 lots of other budget handsets had 30W charging too. The Nord 2's 65W powering will help it stand out a lot more.",
    "So what will the OnePlus Nord 2 charging times be like? OnePlus states you'll get a \"full day’s power in just 15 minutes.\", but what a 'full day's power' means is laughably vague.",
    "The Realme GT had 65W charging and a 4,500mAh battery, and we found it powered to full in just over half an hour, so the Nord 2 will probably be similar.",
    "There's not too much we don't know about OnePlus' new phone at this point - check out our OnePlus Nord 2 hub for everything that's confirmed - and with a launch just a day away, we won't have to wait to fill in the blanks."
  ],
  "headers": {},
  "links": {
    "cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "Twitter": "https://twitter.com/OnePlus_IN/status/1417490218521964552",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus Nord 2 hub": "https://www.techradar.com/reviews/oneplus-nord-2-review"
  }
}