{
  "source": "https://www.techradar.com/news/huawei-watch-3-is-coming-very-soon-and-it-could-give-us-some-huawei-p50-clues",
  "title": "Huawei Watch 3 is coming very soon - and it could give us some Huawei P50 clues",
  "category": "wearables",
  "updated": "2021-05-27T08:32:07Z",
  "author": "tom-bedford",
  "summary": "Big software changes",
  "article": [
    "If you're a fan of smartwatches, June 2 is a date to mark in your calendar. We already knew Huawei was hosting a launch event for its new HarmonyOS software, as the company has announced as much, but now Huawei is teasing its next-gen smartwatch will be shown off too.",
    "On Chinese social media platform Weibo, Huawei posted the above teaser image. While it's a bit ambiguous as to what that ribbed loop is, leakers are convinced it's the Huawei Watch 3 - a conviction that makes sense when you consider the only other product we're expecting is a tablet.",
    "One leaker in particular called Changan Digital King has provided more leaked information about the watch - apparently it'll have all-day body temperature monitoring, heart disease screening, battery life of at least three days and e-sim support. They're one of the main voices suggesting the product pictured is the Watch 3.",
    "The leaker adds something which seems pretty obvious, in that the Huawei Watch 3 will run on HarmonyOS (we call it 'obvious' because the June 2 event is intended to showcase this new operating system, so the company wouldn't show off tech which didn't use it).",
    "HarmonyOS is Huawei's alternative to Android, and it's an operating system that can be used on all gadgets including TVs, smartwatches, tablets, smartphones and more. We're expecting the Huawei P50 to be the first smartphone that comes with it installed, and so this Watch 3 launch could give us big clues as to the new phones.",
    "While we likely won't hear about any features of the new phone - its cameras, design, battery life and so on likely won't be detailed - HarmonyOS on a smartwatch will likely have the same visuals as the operating system on a smartphone.",
    "So the Huawei Watch 3 unveiling could show us what the P50's operating system could look like, which is important because EMUI (Huawei's Android overlay) had a distinct and vibrant appearance.",
    "Oh, and if you're keen on Huawei, it's worth knowing its next tablet is expected to launch - which could have the same chipset as the P50 will.",
    "It'll likely be the same piece of tech the Huawei Mate 40 Pro had, as the company tends to debut its home-made chipsets in its Mate phones before rolling them out to its tablets and P-series devices.",
    "So June 2 could bring big things for all Huawei fans. We'll be tuning in, to bring you all the important information, so check back on the day for that."
  ],
  "headers": {
    "4": "HarmonyOS on the Huawei P50"
  },
  "links": {
    "HarmonyOS": "https://www.techradar.com/news/harmonyos-2",
    "as the company has announced as much": "https://www.techradar.com/news/huaweis-harmonyos-alternative-to-android-is-tipped-to-launch-on-june-2",
    "Weibo": "https://m.weibo.cn/detail/4641395102716157",
    "Huawei Watch 3": "https://www.techradar.com/reviews/huawei-watch-3",
    "Changan Digital King": "https://m.weibo.cn/status/4641390145309101",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "Huawei Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review"
  }
}