{
  "source": "https://www.techradar.com/news/microsoft-edge-blocks-firefox-installer-says-itll-hurt-your-pc",
  "title": "Microsoft Edge blocks Firefox installer, says it'll hurt your PC",
  "category": "computing",
  "updated": "2021-05-11T09:23:23Z",
  "author": "mike-moore",
  "summary": "Dirty ticks or just a mistake?",
  "article": [
    "The battle for web browser supremacy appears to have taken another serious turn following a new move from Microsoft Edge.",
    "Microsoft's browser has long been engaged in a struggle for top spot alongside competitors such as Google Chrome and Mozilla's Firefox.",
    "But as spotted by Techdows, anyone trying to download the installer software to get Firefox on their device will be blocked by Edge itself.",
    "The site reported a number of users seeing a warning pop-up appear when downloading the Firefox installer using Edge.",
    "\"Firefox Installer.exe was blocked because it could harm your device,\" the warning read, with users only able to click through to see more details rather than continue the download.",
    "Techdows says that all versions of the Firefox Installer, including release, beta, dev, and nightly, appear to be affected, with multiple Reddit threads detailing download issues.",
    "Some users were able to download and install Firefox using Edge after disabling Microsoft Defender SmartScreen, a program which monitors downloaded files and checks them against known threats.",
    "For this reason, it isn't advised to disable SmartScreen as it could leave your system open to attack.",
    "Since its launch in January 2020, Microsoft Edge has been slowly increasing market share comapred to its rivals in the browser space in recent months, helped by a rapid cycle of upgrades and updates for the software. The introduction of features such as vertical and scrolling tabs, a secure password generator and in-built price comparison tool all proved popular with users, as did a number of tweaks designed to improve the browser’s performance, including sleeping tabs and a feature known as start-up boost.",
    "However recent data from Statcounter found that Edge’s market share has dipped month-on-month for the first time after fourteen consecutive months of growth. With just 3.39% of total market share in April 2020, Edge remains a minor player in comparison to Google Chrome, which holds 64.47% of the market, with Firefox in second place on 3.59%.",
    "Via Techdows"
  ],
  "headers": {
    "3": "Edge vs Firefox"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "threads": "https://www.reddit.com/r/firefox/comments/n749u5/firefox_nightly_installer_can_harm_your_device_i/",
    "detailing": "https://www.reddit.com/r/firefox/comments/n7gige/ms_edge_blocking_firefox_installer_download/",
    "Techdows": "https://techdows.com/2021/05/microsoft-edge-flags-firefox-installer-as-harmful.html"
  }
}