{
  "source": "https://www.techradar.com/news/some-samsung-phones-are-getting-surprise-power-boosts",
  "title": "Some Samsung phones are getting surprise power boosts",
  "category": "phones",
  "updated": "2021-10-05T08:49:14Z",
  "author": "tom-bedford",
  "summary": "Thanks to a new feature",
  "article": [
    "If you own a Samsung phone, it's possible your device might get a slight power boost soon, because it sounds like the company is rolling out a new feature to some of its existing phones that does just that.",
    "RAM Plus is a feature that lets your smartphone temporarily boost its RAM by adapting some of the storage memory into virtual RAM. Samsung introduced it with the Galaxy A52s, but according to SamMobile it's coming to more phones.",
    "An update has brought RAM Plus to the Galaxy Z Fold 3, if for some reason the 12GB RAM on that phone isn't enough, which suggests it'll come to other handsets too. After all, the Galaxy S and Galaxy A phones would benefit more from a RAM boosting feature than a top-end gigabyte-toting foldable. A Z Fold 3 with memory boosted would be a positively RAM-bunctious device.",
    "The phones that could do with RAM Plus most are the low-end Galaxy J, M and A-series, but as the A52s suggests, these phones might launch with the feature in the future anyway.",
    "Samsung usually brings new features to its top-end phones first, before trickling them down to older or mid-range models, so it's very possible other Galaxy devices will get RAM Plus with a future update.",
    "Smartphones naturally get slower over time - that's true of your top-end iPhone or your low-end Redmi device. In fact, it's one of the reasons people would consider ditching their old mobile in favor of a new one.",
    "With RAM Plus, you might be able to get an extra lease of life on your aging handset, sacrificing a little bit of storage space for some speed. Sure, that banks on you not having filled your phone's memory after years of use, but with cloud storage it's possible to free up some more room.",
    "That could be great news for smartphone longevity, as it'd remove a big reason you'd otherwise ditch your mobile - even if it only kept your device going a year or so longer, that's still great news for your wallet and for the environment.",
    "Samsung isn't the only company with such a RAM-adaptation feature, as a few smartphone companies have equivalents too, and on lower-end devices they can be pretty useful. Hopefully we'll see other companies adopt this to ensure all handsets are more powerful in their twilight years."
  ],
  "headers": {
    "5": "Analysis: keeping Samsung phones going longer"
  },
  "links": {
    "Samsung phone": "https://www.techradar.com/news/best-samsung-phones",
    "Galaxy A52s": "https://www.techradar.com/news/samsung-galaxy-a52s-5g-offers-a-minor-mid-range-upgrade",
    "SamMobile": "https://www.sammobile.com/news/samsung-ram-plus-feature-arriving-on-more-phones/",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review"
  }
}