{
  "source": "https://www.techradar.com/news/a-mysterious-chinese-gpu-firm-with-deep-pockets-is-gunning-for-nvidia-and-amd",
  "title": "A mysterious Chinese GPU firm with deep pockets is gunning for Nvidia and AMD",
  "category": "pro",
  "updated": "2021-11-27T18:09:01Z",
  "author": "desire-athow",
  "summary": "Cryptically named Moore Threads, loosely based on Moore’s law",
  "article": [
    "Little is known about Moore Threads, a Chinese tech company that just celebrated its first birthday, and now wants to double the number of concurrent threads in today's computers every two years. But rather than doing it in a CPU, the company plans to do it in a GPU - putting it in direct competition with the likes of AMD, Intel and Nvidia.",
    "The company has just secured a second funding round of $313 million from a number of investors mostly based in China. This comes after an earlier round in February 2021 worth “billions of yuan”. One particular investor, Tiktok owner Bytedance, is also developing its own Cloud AI and server chips based on ARM.",
    "Moore Threads has already rolled out its first generation of GPU products, which it describes as “a standard GPU that includes graphics rendering, universal parallel computing, video codecing [sic], high-precision parallel computing and AI reasoning training for a variety of integrated computing power, which can effectively build a super computing platform”.",
    "The company's ambitions extend beyond this, to “data center, edge computing server, professional workstations, and high performance personal computing devices” in verticals as varied as “robotics, autonomous driving, biocomputing, smart energy and healthcare”.",
    "As it stands though, nothing has yet transpired with regards to the underlying technology, the performance reached by this GPU, the manufacturing process, the transistor counts, clock speeds or the amount of memory.",
    "In October 2021, Moore Threads joined the Khronos group, an open, non-profit, member-driven consortium. This organization regroups all the leading names in 3D graphics, augmented reality, and virtual reality, and it is responsible for a plethora of standards. Joining as a contributor member, the company will be able to participate and vote in working groups and therefore influence working group level decisions.",
    "AMD and Nvidia need not lose sleep on this newcomer just yet; Nvidia’s grip on the GPU and the GPGPU market is unlikely to loosen, thanks to the likes of the Nvidia RTX 3090. And with the impending arrival of Intel’s Arc GPU to the mainstream market, Moore Threads’ influence is likely to be initially limited to the local Chinese market, one which is expected to reach around $6.4 billion annually.",
    "But the latest investment certainly shows the size of thes competition. Both chip designing startups and established players in China have lined up to produce designs capable of replacing Western technology at scale domestically. The Huawei ban by the Trump administration was the catalyst that accelerated investment worth tens of billions of yuan in the booming local chip industry.",
    "Alibaba, Tencent, Baidu and Huawei have all started to produce a variety of processing units that tackle various stages of data processing, from the end client device (e.g. NPUs within the smartphone) to the data center (e.g. AI inference).",
    "And that's a trend that should worry America's tech giants."
  ],
  "headers": {
    "3": "A GPU for many purposes",
    "6": "Rival to Geforce and Radeon?"
  },
  "links": {
    "CPU,": "https://www.techradar.com/news/best-processors",
    "GPU": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "second funding round of $313 million": "https://www.dealstreetasia.com/stories/moore-threads-secures-313m-271373/",
    "One particular investor": "https://kr-asia.com/bytedance-to-design-ai-chips-amid-chinas-tech-independence-drive",
    "describes as": "https://www.mthreads.com/%E5%89%AF%E6%9C%AC-21-7-1%E6%91%A9%E5%B0%94%E7%BA%BF%E7%A8%8B%E8%87%AA%E4%B8%BB%E5%8F%AF%E6%8E%A7gpu%E6%90%BA%E6%89%8B%E6%B5%A9%E8%BE%B0cad%E5%8A%A9%E5%8A%9B%E5%9B%BD%E4%BA%A7%E5%B7%A5%E4%B8%9A%E8%BD%AF%E4%BB%B6%E5%8F%91%E5%B1%95",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "super computing": "https://www.techradar.com/news/one-of-the-worlds-largest-supercomputers-lived-for-only-10-minutes",
    "data center": "https://www.techradar.com/news/data-center-and-hosting-services-will-get-a-lot-more-popular-in-china",
    "server": "https://www.techradar.com/news/best-small-business-servers",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "Nvidia RTX 3090": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3090-find-stock-here",
    "Huawei ban": "https://www.techradar.com/news/huawei-and-zte-tech-banned-from-us-government-use",
    "Alibaba": "https://www.techradar.com/news/alibaba-unveils-its-own-cloud-ai-chip",
    "Tencent": "https://www.techradar.com/reviews/tencent-cloud-content-delivery-network",
    "Baidu": "https://www.techradar.com/news/a-chinese-company-may-have-come-up-with-the-future-of-smartphones-and-computing",
    "Huawei": "https://www.techradar.com/news/best-huawei-phones"
  }
}