{
  "source": "https://www.techradar.com/news/windows-10-update-could-give-edge-an-important-advantage-over-chrome",
  "title": "Windows 10 update could give Edge an important advantage over Chrome",
  "category": "computing",
  "updated": "2021-05-05T13:42:28Z",
  "author": "daryl-baxter",
  "summary": "The name’s Edge, Microsoft Edge",
  "article": [
    "Microsoft’s Edge browser will soon show you the names of every tab you have open in Task Manager.",
    "Previously, trying to decipher which tab was the most demanding would usually end up in the whole application being closed by accident by the user.",
    "You would be greeted with a long list of ‘Edge’ processes, but no way of deciphering which tab was the most demanding on memory.",
    "With this latest update, it gives Edge a great advantage over Chrome, as these also are unnamed in Task Manager, with Google yet to confirm if a similar feature is also coming to their browser anytime soon.",
    "The Microsoft Edge team have laid out how it would look in Task Manager, with every tab named so you can tell which page is taking up the most memory.",
    "You have to be on both the Microsoft Edge Dev channel 91.0.852.0 and the Windows Dev channel 21364 for the tabs to be named in Task Manager.",
    "If you want to access this feature now, alongside other features that are currently in development for both Microsoft Edge and Windows 10, you can download the latest build of Edge from their site. The Windows 10 build can also be downloaded by going into ‘Settings’ on a Windows PC, choosing ‘Windows Update’ and then switching on the ‘Windows Insider Programme’. The details of what a new build contains is published from their Windows Insider site.",
    "It’s important to keep in mind that while you will reap the benefits of brand new features, your PC may be more prone to bugs and crashes.",
    "Microsoft has also made it clear that this is slowly being rolled out to more users in the Insider channel, so you may have both versions installed, but no named tabs as yet.",
    "However, it’s only a matter of time before the feature is rolled out worldwide in a future Windows 10 update later this year."
  ],
  "headers": {
    "4": "How to access the feature"
  },
  "links": {
    "how it would look": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7017979663759114000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Farticles%2Fmicrosoft-edge-windows-task-manager-improvements%2Fm-p%2F2280526%23M5416&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-10-update-could-give-edge-an-important-advantage-over-chrome",
    "from their site": "https://www.microsoftedgeinsider.com/en-us/download",
    "Windows Insider site": "https://blogs.windows.com/windows-insider/"
  }
}