{
  "source": "https://www.techradar.com/news/holy-hell-diablo-4-looks-gorgeous-in-a-totally-gross-way",
  "title": "Holy hell, Diablo 4 looks gorgeous (in a totally gross way)",
  "category": "gaming",
  "updated": "2021-07-01T10:19:57Z",
  "author": "gerald-lynch",
  "summary": "Monster slaying has never looked better than with Diablo 4",
  "article": [
    "With action RPGs, sometimes you’re so busy clicking on loot and killing beasts that you forget to take in the scenes around you. That won’t be a problem with Diablo 4. Blizzard’s latest quarterly update on the development of Diablo 4 gives a deep-dive look at its gorgeously gruesome art style.",
    "From a gameplay perspective, perhaps the most important aspect is that Diablo 4 will let you customize your hero character in more complete ways than ever before. Not only will you be able to tweak armor styles, but for the first time you’ll be able to change individual features of the characters themselves so that all players have a truly unique hero in the world.",
    "“You will be able to change the face of your character, the hairstyle, the facial hair (beards and eyebrows), and add jewelry (nose piercing or earrings), makeup, and body markings such as tattoos or body paint,” explains Arnaud Kotelnikoff, Lead Character Artist for Diablo 4.",
    "“You will also be able to change the color values of your character’s skin, eyes, hair/facial hair, and body markings. Some elements will be class specific, to support the classes’ unique backgrounds, but many will be shared between classes allowing more possibilities to mix and match.”",
    "“The look and feel of the classes has always been one of Diablo’s secret ingredients, each class instantly recognizable and imbued with a strong and unique personality,” says Luis Barriga, Game Director for Diablo IV.",
    "“Diablo IV offers players more customization options than ever in a Diablo game, which makes achieving that result more challenging, but the outcome is well worth it. Your Barbarian is different from anyone else’s but still feels undeniably like a Barbarian. With monsters, the focus has been on creating new foes and updating classics drawn from the pantheon of atrocities in our previous games, while using new processes and technology to their fullest.”",
    "Blizzard had to “completely rebuild [its] rendering engine and authoring tools,” to hit the new level of fidelity, according to John Mueller, the game’s Art Director.",
    "“We wanted to use the latest tools and techniques, but we did have a concern about leaning into ‘realism’ in a way that wouldn’t have that hand-crafted feeling we felt was fundamental to a Blizzard game. We didn’t want the characters to feel procedural or generic because of these processes. We also embraced realism in terms of materials and character appearance. I think the touchpoint being the amazing pre-rendered look from the Diablo III cinematics.”",
    "But the end result is plain to see – this is by far the most richly-detailed Diablo game ever and, possibly (going by this early look at least), the best looking game Blizzard has ever made.",
    "“We made massive improvements to the level of detail, the surfacing of complex materials like skin, cloth simulation, hair, fur, metal, even down to the details of the highlights of the eyes and rivulets of perspiration,” adds Mueller.",
    "“We built a robust character customization system that is entirely new to Diablo and it was a daunting amount of technical character work. These solutions had to work not just for a single character, but for hundreds of componentized armor sets, different body types, dozens of unique personas, and completely unique art for five distinct classes (to start). This was an entirely new challenge for our team to tackle.”",
    "But the money shot of the latest Diablo 4 update is a sneak peek at some of the creatures you’ll be battling as you traverse the roads, fields, mountains and dungeons of Sanctuary. Take a look at the following clips of the monsters you’ll face: from the succubus to the incredibly-named “Blood Bishop”, they’re horrifyingly captivating.",
    "This isn’t all just a bunch of pre-rendered show pieces either – these are in-engine looks at what the new game will include. And it’s at a rather advanced stage of development – at least when it comes to the art department’s role. “[At] this point the work is a very good representation of what you will see when the game is in your hands,” notes Mueller.",
    "Diablo 4, with a more open world and greater focus on dynamic multiplayer opportunities, has from day one been taking its inspiration from the darker aesthetic of series classic Diablo 2, rather than the slightly more colorful take of Diablo 3. That decision seems to really be paying off now – I’d imagine for many gamers, this art style is how Diablo has always looked in their heads, now brought to life.",
    "There’s still no release date for Diablo 4, but those itching for a click-killing can get back to the series roots when Diablo 2: Resurrected, a remastered take on the second game in the series, releases September 23, 2021. Diablo Immortal, a new entry for the series for mobile phones, is set for release some time in 2021, too."
  ],
  "headers": {
    "11": "Monstrously good looking"
  },
  "links": {
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "Diablo 3": "https://www.techradar.com/news/diablo-3-nintendo-switch-review-battling-hells-demons-while-on-the-toilet",
    "Diablo 2: Resurrected": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "Diablo Immortal": "https://www.techradar.com/news/diablo-immortal-release-date-news-trailers-phones"
  }
}