{
  "source": "https://www.techradar.com/news/forza-motorsport-7-will-be-removed-from-sale-later-this-year",
  "title": "Forza Motorsport 7 will be withdrawn from sale later this year",
  "category": "gaming",
  "updated": "2021-07-30T12:03:39Z",
  "author": "vic-hood",
  "summary": "Forza Motorsport 7 will reach 'End of Life status' in September",
  "article": [
    "Forza Motorsport 7 will be pulled from sale in September, meaning the game and its DLC will no longer be available for purchase.",
    "In a blog post on the official Forza Motorsport website, it was announced that Forza Motorsport 7 will reach \"End of Life status\" on September 15, just four years after its release, with the game and its downloadable content being removed from both the Microsoft Store and Xbox Game Pass – the only platforms it's available on.",
    "However, those who already own Forza Motorsport 7 will still be able to download and play it after this date (along with any DLC purchased), with multiplayer and online services still available. Microsoft is even offering a discount on the game until it's pulled from sale.",
    "Those who played Forza Motorsport on Xbox Game Pass, but paid for DLC, will receive a token from the Xbox Message Center to allow them to continue to play the title. This token distribution will be through August 2 but if you haven't received your token after this date, contact Xbox Support. Make sure to use your token by September 15, or it will expire.",
    "It's unclear if those who buy physical editions of the game after this point will still be able to play them, but TechRadar has contacted Microsoft for clarity on this.",
    "With the new Forza Motorsport on the horizon, you could be forgiven for assuming that Forza Motorsport 7 is being pulled from sale ahead of its successor's release.",
    "However, on Twitter, the official Forza Motorsport account confirmed that the game is being pulled as its third-party licenses (which allow the game to feature real-world cars, tracks and other elements) are set to expire.",
    "While Microsoft could opt to renew these licenses, with a new Forza Motorsport game on the horizon – and Forza Horizon 5 set to release in November – it's unsurprising that it's chosen not to. Paying for licenses for an older game while also paying for new licenses is a financial drain that Microsoft wants to avoid. What's more, we don't know the ins and outs of Microsoft's license agreement for these real-world elements.",
    "While some racing games have their licenses extended, we have seen a number of racing games featuring real-world elements pulled from sale before. Forza Motorsport 6 was pulled from sale in September 2019, just four years after its release in 2015, while EA announced earlier this year that a number of Need For Speed games will be shut down in August this year.",
    "These Need for Speed games were apparently pulled as EA claimed it was \"no longer feasible\" to maintain the servers for these older titles while developing new ones – something Microsoft will potentially have also taken into account.",
    "There will, however, be a sizeable gap for Forza Motorsport players between Forza Motorsport 7 being pulled from sale and the next installment in the series releasing. Right now Forza Motorsport – technically Forza Motorsport 8 – doesn't have a release date, so it could be at least 2022 before we get our hands on it."
  ],
  "headers": {
    "5": "Analysis: why so soon?"
  },
  "links": {
    "blog post": "https://forzamotorsport.net/en-us/news/forza-motorsport-7-end-of-life",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "discount": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-5866259836093984000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fforza-motorsport-7-standard-edition%2F9n3nk5ww05ht%3Factivetab%3Dpivot%3Aoverviewtab",
    "Xbox Support": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1332328112203568600&murl=https%3A%2F%2Fsupport.xbox.com%2Fen-US%2Fcontact-us",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "EA claimed": "https://www.reddit.com/r/needforspeed/comments/np6uig/sun_is_setting_on_some_older_nfs_titles_its_not/"
  }
}