{
  "source": "https://www.techradar.com/news/jbs-paid-dollar11-million-bitcoin-ransom-to-restore-systems-avoid-further-attacks",
  "title": "JBS paid $11 million Bitcoin ransom to restore systems, avoid further attacks",
  "category": "computing",
  "updated": "2021-06-10T10:19:09Z",
  "author": "mayank-sharma",
  "summary": "White House says paying ransom isn’t a good idea",
  "article": [
    "JBS reportedly paid about $11 million in ransom to the cyber criminals who encrypted their network, disrupting operations across North America and Australia.",
    "The ransomware attack, attributed to the notorious REvil gang, forced the world's largest meat producer to shut down its beef plants in the US, as well as halting operations across Canada, and Australia.",
    "The shutdowns sent shockwaves across the food industry, leading to calls to double down the security of critical infrastructure following several major recent incidents.",
    "“It was very painful to pay the criminals, but we did the right thing for our customers,” chief executive of JBS SA’s US division, Andre Nogueira told The Wall Street Journal.",
    "Nogueira added that the ransom, which as usual was paid in Bitcoin, was made only after the majority of JBS plants were back up and running again.",
    "JBS is the latest company to give in to the demands of their cyber perpetrators, following the example of Colonial Pipeline, which reportedly paid around $5 million after its network was held hostage by the DarkSide ransomware gang, leading to a temporary increase in fuel prices in parts of the US.",
    "The increasing frequency of cyberattacks has forced the US government to toughen its stance on ransomware. In addition to setting up a dedicated ransomware taskforce, the country has vowed to treat such incidents as acts of terrorism.",
    "Bloomberg quotes an unnamed White House National Security Council spokesperson as saying that “private companies should not pay ransom. It encourages and enriches these malicious actors, continues the cycle of these attacks, and there is no guarantee companies get their data back.”",
    "In fact, the US has managed to recover a substantial portion of the Bitcoin ransom paid by Colonial, which only converts to about $2.2 million thanks to the declining value of Bitcoin.",
    "Via CNN"
  ],
  "headers": {
    "5": "Tough stance"
  },
  "links": {
    "disrupting operations": "https://www.techradar.com/news/the-worlds-biggest-meat-producer-got-taken-down-by-a-cyberattack",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Bitcoin": "https://www.techradar.com/best/mining-rigs",
    "paid around $5 million": "https://www.techradar.com/news/colonial-pipeline-paid-dollar5m-ransom-to-hackers",
    "acts of terrorism": "https://www.techradar.com/news/us-will-give-ransomware-hacks-similar-priority-to-terrorist-attacks",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-06-09/jbs-paid-11-million-in-ransom-to-resolve-cyberattack-dj",
    "managed to recover": "https://www.techradar.com/news/colonial-pipeline-attack-made-possible-by-compromised-vpn-password",
    "CNN": "https://edition.cnn.com/2021/06/09/business/jbs-cyberattack-11-million/index.html"
  }
}