{
  "source": "https://www.techradar.com/news/new-windows-11-update-could-speed-up-your-pc-and-fix-a-host-of-issues",
  "title": "New Windows 11 update could speed up your PC and fix a host of issues",
  "category": "computing",
  "updated": "2021-12-05T22:13:57Z",
  "author": "matt-hanson",
  "summary": "Windows 11 KB5007215 is an update you’ll want to grab",
  "article": [
    "Microsoft’s latest Windows 11 update, known as Windows 11 KB5007215, is now being made available as a free download for users around the globe - aiming to fix some pretty huge issues for PCs with AMD Ryzen CPUs.",
    "As Windows Latest reports, if you have a PC with an AMD processor, you’ll want to install this update ASAP, as it could result in your PC running much faster, after some quite dramatic performance drops after installing Windows 11 were found with those components.",
    "The update also addresses several issues with File Explorer, the tool that most people use every day to access files and folders on their PC. The new Windows update saw some users encounter problems where the performance of their PC slowed down when trying to find a key file.",
    "Microsoft has also fixed an issue where you could not rename files, and solved a memory leak when using the Virtual Desktop.",
    "A Windows 11 issue where searching for files in the Windows Search tool, or via File Explorer, failed as well and is smoothed out in the latest upgrade.",
    "With these issues fixed, many people using Windows 11 should hopefully find their computers are now running much better.",
    "Some of those changes might sound pretty niche - but get ready for even smaller alterations, with the other fixes Microsoft has added with Windows 11 KB5007215:",
    "This update will be downloaded automatically, so you don’t need to do anything to get it. However, if you’re keen to get it straight away, you can open up the Windows Update app in Windows 11 (type ‘Windows Update’ into the search bar), then click ‘Check for Updates’.",
    "If you are still encountering issues, make sure you check out our how to fix Windows 11 problems for more help.",
    "This latest Windows 11 update is certainly welcome, as it looks like it fixes many of the most frustrating and – let's be blunt here – embarrassing issues with Windows 11.",
    "The new operating system was supposed to be a break from Windows 10, offering people who upgraded a range of new features and a revamped user interface.",
    "However, with reports that the operating system was slowing down PCs with AMD chips, along with the fact that a key tool, File Explorer, was also causing issues for some people, a lot of that initial excitement for Windows 11 was dampened.",
    "So, it's good that Microsoft has fixed these problems, and while people are still encountering other issues with Windows 11, this new update should at least make people feel more comfortable upgrading to the new operating system.",
    "As we said in our Windows 11 review, this operating system feels like a work in progress, but at least progress is being made when it comes to improving the overall stability and performance of Windows 11. For Microsoft, this is definitely a step in the right direction.",
    "You might also want to check out how to fix a stuck Windows update."
  ],
  "headers": {
    "2": "File Explorer fixed",
    "9": "Analysis: A step in the right direction"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows Latest reports": "https://www.windowslatest.com/2021/11/10/windows-11-kb5007215-comes-with-a-speed-boost-explorer-fixes/",
    "quite dramatic performance drops": "https://www.techradar.com/news/windows-11-is-killing-game-performance-for-pcs-with-amd-processors",
    "installing Windows 11": "https://www.techradar.com/news/how-to-download-windows-11",
    "how to fix Windows 11 problems": "https://www.techradar.com/how-to/windows-11-problems-how-to-fix-the-most-common-issues",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "fix a stuck Windows update": "https://www.techradar.com/how-to/software/operating-systems/how-to-fix-a-stuck-windows-update-1326307"
  }
}