{
  "source": "https://www.techradar.com/news/google-is-upgrading-one-of-its-most-unloved-productivity-tools",
  "title": "Google is upgrading one of its most unloved productivity tools",
  "category": "computing",
  "updated": "2021-08-11T14:07:18Z",
  "author": "joel-khalili",
  "summary": "Google Tasks has a fresh new look on mobile",
  "article": [
    "Google has announced a small but useful upgrade for its task management application that should help workers better organize their schedule.",
    "As per a new blog post, Google has overhauled the interface for the Tasks mobile app, introducing a tabbed system that lets users better categorize and distinguish between the different items on their to-do list.",
    "“The update allows users to organize their tasks in multiple lists and allows for better management of tasks on mobile,” the company explained.",
    "The new version of Google Tasks will roll out to Workspace customers gradually over the coming weeks.",
    "Since the start of the pandemic, much of Google’s energy has been piled into Google Workspace (previously G Suite), the suite of productivity apps that houses the likes of Gmail, Drive, Docs, Meet and more.",
    "When the rebrand was first revealed, Google announced its focus was to create a more “deeply integrated user experience”, by improving the interoperability of its various software products - something its rival Microsoft has historically done extremely well.",
    "Since then, the company has introduced picture-in-picture functionality for Docs and Slides that lets users hear and see their colleagues while they collaborate, a system whereby Chat makes intelligent suggestions based on Calendar data, and other fresh synergies.",
    "Admittedly, the new Tasks update is unlikely to set the world on fire, but Google’s efforts to bolster the user experience shows the company is on top of the need to refresh the functionality of individual apps, in addition to building new integrations.",
    "It’s also no coincidence that Google has chosen to target the Tasks mobile app at this particular time; with the transition to hybrid working, the ability to use mobile devices as a means of organizing the working day will become all the more important."
  ],
  "headers": {
    "4": "Google productivity tools"
  },
  "links": {
    "task management": "https://www.techradar.com/best/best-to-do-list-apps",
    "blog post": "https://workspaceupdates.googleblog.com/2021/08/easily-switch-between-lists-in-google.html",
    "Workspace": "https://www.techradar.com/reviews/google-workspace",
    "productivity apps": "https://www.techradar.com/best/best-productivity-apps",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "Docs": "https://www.techradar.com/reviews/google-docs",
    "Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "first revealed": "https://www.techradar.com/news/g-suite-gets-massive-overhaul-rebranded-as-google-workspace",
    "intelligent suggestions": "https://www.techradar.com/news/google-is-creating-new-synergies-between-workspace-apps",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}