{
  "source": "https://www.techradar.com/news/another-top-source-says-global-chip-shortage-could-drag-on",
  "title": "Another top source says global chip shortage could drag on",
  "category": "computing",
  "updated": "2021-05-13T08:37:15Z",
  "author": "mike-moore",
  "summary": "Gartner says lack of chips could last until late 2022",
  "article": [
    "The global chip shortage is nowhere near its end, and could in fact drag on for some time now, experts have suggested.",
    "The latest prediction reports from Gartner have claimed that the shortage of semiconductors, used in everything from laptops to smart vehicles, could last through the remainder of 2021 and through much of 2022 as well.",
    "With supply chains recovering following the pandemic, this could mean delays in the production and shipping of a wide range of electronic and smart goods around the world.",
    "“The semiconductor shortage will severely disrupt the supply chain and will constrain the production of many electronic equipment types in 2021. Foundries are increasing wafer prices, and in turn, chip companies are increasing device prices,” said Kanishka Chauhan, principal research analyst at Gartner.",
    "The analyst house is now advising OEMs to take four steps to help mitigate risk and damage to their revenues in the upcoming months.",
    "This includes extending supply chain visibility, guaranteeing supply with a companion model and/or preinvestments, tracking leading indicators, and diversifying their supplier base.",
    "The warning is the latest concerning the chip shortage from leading tech figures. Dell co-founder and CEO Michael Dell recently expressed his views, saying he believes the ongoing chip shortage will persist for a few more years.",
    "Dell, which with a reported annual order volume of $70 billion is one of the biggest customers for semiconductor companies, has been forced to pay a premium to meet its demands. The CEOs of several other major semiconductor users such as Cisco, Qualcomm, and Micron have also expressed concern about the longevity of the crisis.",
    "Estimates by the US-based Semiconductor Industry Association say around 75% of global manufacturing capacity is in East Asia, with Taiwan's TSMC and South Korea's Samsung being the dominant players. However a severe drought in Taiwan, which forced the country to divert water supply from several industrial areas, including one that is a hub of semiconductor manufacturing, made matters even worse."
  ],
  "headers": {
    "3": "\"Severely disrupt\""
  },
  "links": {
    "chip shortage": "https://www.techradar.com/news/global-computer-chip-shortage-could-last-for-months",
    "Michael Dell": "https://www.techradar.com/news/worldwide-chip-shortage-could-last-years-says-dell-founder"
  }
}