{
  "source": "https://www.techradar.com/news/how-to-watch-top-chef-online-stream-every-season-18-episode-anywhere",
  "title": "How to watch Top Chef online: stream every season 18 episode anywhere",
  "category": "computing",
  "updated": "2021-04-01T21:56:33Z",
  "author": "kevin-lynch",
  "summary": "The culinary competition heads to Portland Oregon.",
  "article": [
    "With lockdown stopping many of us from visiting our favorite restaurants, host Padma Lakshmi makes a timely return this week, serving up a tempting taste of fine dining. Read on and we'll tell you where to watch Top Chef Season 18 online wherever you are.",
    "Having showcased the chefs of San Francisco, Las Vegas, Seattle, Boston, Los Angeles, Miami, Chicago and New York City, this new season turns its attention to the talented foodies of picturesque Portland, Oregon.",
    "Despite the production challenges of the coronavirus, we’ve been told to expect the regular helping of chefs competing against each other in culinary challenges.",
    "Padma will be joined once again by regular judges Tom Colicchio and Gail Simmons, along with a host of familiar guest critics including Gregory Gourdet, Richard Blais, Carrie Baird and Nina Compton, while Portlandia comedy duo Fred Armisen and Carrie Brownstein are also set to make an appearance.",
    "With Oregon fast growing a reputation as an American culinary hot spot thanks to its wine producing valleys and fresh fish from the coast, Season 18’s setting should make for an appetising new installment of the show.",
    "Watch Top Chef season 18 online easily by following our guide below.",
    "For anyone abroad right now wanting to watch Top Chef, you’ll likely be unable to watch series 18 due to annoying regional restrictions.",
    "Fortunately, there’s a simple solution. Downloading a VPN will allow you to stream Top Chef online no matter where you are. The simple bit of software changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home."
  ],
  "headers": {
    "6": "How to watch Top Chef: Season 18 online from outside your country",
    "8": "How to watch Top Chef online in Canada"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}