{
  "source": "https://www.techradar.com/news/the-walking-dead-season-11-episode-1-recap-few-surprises-fewer-answers",
  "title": "The Walking Dead season 11 episode 1 recap: few surprises, fewer answers",
  "category": "entertainment",
  "updated": "2021-08-23T18:43:59Z",
  "author": "ross-kennedy",
  "summary": "Huge spoilers ahead",
  "article": [
    "Spoilers for The Walking Dead season 11 episode 1 follow.",
    "It’s been a long time coming, and this is it. ‘The Beginning of The End’, reads season 11’s tagline. Over a decade has passed since we first watched Rick Grimes awake amid the apocalypse, and now the curtains start to close on this award-winning show.",
    "Despite the consistent drop in viewers for several seasons now, and some dire periods of pacing and characterization throughout, even The Walking Dead's biggest critics would have to agree that the show's long run is remarkable. After watching this opening episode, 'Acheron: Part I', it’s hard to say if this final season has a little more life in it yet, as it finally prepares to shamble off center stage.",
    "We pick up soon after the conclusion of the last season, following the various residents of Alexandria as they recover from the The Whisperer War, and encounter new groups of survivors with potential friends and foes alike. Things are at a precarious stage for our motley crew. Resources are low, tensions are high. You’ve heard all this before – it's the same tried and true narrative structure we've seen in The Walking Dead since the first season's arc more than a decade ago.",
    "Despite the predictable story setup, though, the characters actually behave in surprising ways in this episode.",
    "The once-villainous Negan has turned into a closely-watched ally, as he guides the Alexandrians through an underground railway to the Warden’s ransacked settlement for supplies. Though clearly unwelcome, Negan being trusted to lead the people he once terrorized says a lot about how things have changed.",
    "Things haven't changed, of course, for Maggie.",
    "While Negan began his ‘redemption’ arc, Maggie had left the group to raise her son after he killed Maggie’s husband Glenn and their friends in a bloody spectacle. Funnily enough, she’s kept a grudge against him. Her return brings that tension with Negan back, and it looks to be the real internal conflict going forward with our group, to the point where they each almost kill the other in this episode.",
    "Your loyalty to Maggie as a viewer and the recent humanizing of Negan does make it hard to root for one over the other – it's sort of like when your friends are arguing, and you don’t want to pick sides because they're both making good points. Though this conflict involves more undead and gunfights then your friends’ bickering, we’d wager.",
    "Meanwhile, a different detachment from Alexandria seeking aid finally reaches a community of survivors. This storyline has been building since Eugene heard a mysterious woman, Stephanie, over a ham radio and their developing relationship became a core plot point in the previous season.",
    "Being strung along that whole time without any real answers has been grating, so you'd think we'd get some closure in this new season, right? Sadly, that's not the case just yet.",
    "Upon arrival, Eugene and the group are locked up and interrogated by Stephanie’s community, a group called the Commonwealth. They're a militarized faction, and the main characters must prove themselves to their captors. After the brutal treatment they receive, the group tries to leave, before Yumiko discovers her sister might be among them and wishes to stay. Inevitably our protagonists and the Commonwealth will butt heads, before finding reasons to trust one another.",
    "This is a familiar arc for The Walking Dead at this point, and yet we can’t look away. Even though the show walks and talks like it always has, the path it takes finds ways to be unexpected and engaging.",
    "As this is the first episode of a two-parter, we’re left with half of the story and plenty of questions still up in the air. There are indications about where things are going for the first part of the season, at least, with a focus on Maggie and Negan’s conflict, the continuing threat of the Reapers (not seen in this episode) and the wariness around the Commonwealth alliance.",
    "It's nothing out of the ordinary, but with this being near the end of the show’s run, it feels like it's playing it safe when we should be seeing something grander fall into place. Then again, we’ve seen high-profile shows take a left turn in their last seasons before, and rarely has that turned out well (here’s looking at you, Jon Snow).",
    "The Walking Dead is always on a knife’s edge of giving us a tense, human-feeling drama or an all-out gore fest. The writers appears be aiming for a tried-and-true conclusion with season 11, but that safety doesn’t necessarily sit well. We'll just have to see what changes – if anything – with part two of the opener next week.",
    "Verdict:",
    "The Walking Dead still has a unique magic, all these years later. But despite the always fantastic efforts of the show's cast, the same problems continue to plague the series, such as poor lighting, bad dialogue mixing and the zombies rarely feeling that menacing.",
    "When it comes to the story and characters, this first part feels like more of the same, for better or worse. If there's a grand vision planned out for this final season, we didn't really see enough of it in this episode to get enormously excited about what's to come.",
    "The Walking Dead season 11 airs on AMC in the US every Sunday, and releases weekly on Disney Plus in the UK each Monday."
  ],
  "headers": {
    "5": "Maggie vs Negan",
    "19": "Dead facts"
  },
  "links": {}
}