{
  "source": "https://www.techradar.com/news/mwc-2021-news",
  "title": "MWC 2021 news, dates and everything from the big smartphone show",
  "category": "phones",
  "updated": "2021-07-02T10:27:53Z",
  "author": "james-rogerson",
  "summary": "It's late, but it's happened",
  "article": [
    "MWC (Mobile World Congress) is the biggest trade show in the mobile calendar and it’s where many of the year’s most exciting handsets are often announced – alongside tablets, wearables, and other tech.",
    "It's now finished for 2021, with the event running from June 28 to July 1, and this year - thanks to Covid-19 - it was smaller than normal, as well as being held later than normal and being run as a hybrid event, with lots of the announcements happening online.",
    "In fact, it's a whole lot smaller, as very few things were announced. That said, there have been some highlights, including a look at Samsung's new One UI Watch that will be debuting on the Galaxy Watch 4, plus a whole truckload of tablets from Lenovo. You'll find all that below, along with the rest of the announcements.",
    "MWC 2021 is now over, having run from June 28 to July 1. Those aren’t the original dates, as it had previously been planned for early March, but it was delayed to increase the chance of it actually being able to go ahead.",
    "While it was held in Barcelona as usual, it also had “virtual elements” this time, with the physical show being much further scaled back than in previous years.",
    "In an interview with Mobile World Live, GSMA Limited CEO John Hoffman confirmed that the plan was to have between 40,000 and 50,000 attendees. In 2019, the last physical MWC show, there were around 110,000 attendees.",
    "Ericsson is one of the biggest companies that often attends MWC, but the company made an early decision to withdraw from the 2021 event. Google, Samsung, Sony, Nokia and others later said the same - but some still took part in the virtual elements.",
    "What is the plan for MWC 2022? Mats Granryd, Director General of the GSMA, has confirmed to TechRadar plans to keep its February window for future shows after the 2021 event.",
    "\"We do want to be going back to the February Barcelona rhythm once 2021 is done.\" Granryd said. \"A lot of product launches are happening towards the beginning of the year, so we'd like to time that into our event.\"",
    "Not much has been announced at MWC 2021, but you'll find the significant consumer announcements below.",
    "Samsung didn't have a physical presence at MWC 2021, but it did use the event to reveal its new software for smartwatches.",
    "The company revealed that future Galaxy Watch wearables will run One UI Watch - an interface that will be overlaid on the new version of Wear OS that Samsung helped Google build.",
    "That means Galaxy watches will have access to Wear OS apps through the Play Store, including Google's own apps.",
    "The change will also apparently lead to apps starting up to 30% faster with smoother transitions, plus improvements to sensor readings for health and fitness services, and reduced battery drain when measuring your heart rate, among other things.",
    "The company also revealed that its next Galaxy Watch (believed to be the Galaxy Watch 4) will be announced \"this summer\" (likely meaning July, August or September).",
    "The Chinese computing company Lenovo was at MWC 2021, and it has revealed a bunch of new gadgets in the mobile computing space.",
    "Its new announcements include the Lenovo Yoga Tab 13, Yoga Tab 11, Tab M7, Tab M8 and Tab P11 Plus. Those last three are cheaper Android tablets, while the first two are more computing focused devices.",
    "The company has also introduced a new product called the Lenovo Smart Clock 2, which is the company's latest smart home device.",
    "TCL made its MWC announcements several days before the event officially kicked off, but it's not unusual for companies to get the ball rolling early.",
    "The most interesting of its announcements was the NXTWEAR G, a pair of smart glasses that you can connect to your phone to have videos displayed on them. But the effect is the equivalent of viewing the videos on a 140-inch screen.",
    "They don't have a battery, so need to be plugged into your phone, but that ensures they're light and compact. They're going on sale later this year for €599 (around $715 / £510 / AU$945).",
    "The company also unveiled the Alcatel 1, a super-cheap Android 11 smartphone, costing just €59 (roughly $70, £50, AU$90), and launching in Europe in August. This has a 5-inch screen, so it's compact too, but we don't know much else about it yet.",
    "Plus, there's the TCL MoveTime Family Watch 2, which is a smartwatch designed for kids. This includes 4G and the ability to make video calls from your wrist.",
    "And TCL additionally launched a 5G outdoor hub (to bring 5G to your home), and demoed its new Multi-Screen Collaboration feature, which lets you connect a TCL 20 Pro 5G to another device (such as a Windows 10 PC) and interact with it on your monitor."
  ],
  "headers": {
    "3": "What are the MWC 2021 dates?",
    "9": "What happened at MWC 2021",
    "10": "Samsung at MWC 2021",
    "15": "Lenovo at MWC 2021",
    "18": "TCL at MWC 2021"
  },
  "links": {
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Mobile World Live": "https://www.mobileworldlive.com/blog/blog-mwc-shanghai-to-provide-china-5g-showcase-barcelona-blueprint/",
    "to withdraw from the 2021": "https://www.mobileworldlive.com/featured-content/home-banner/gsma-respects-ericsson-mwc21-withdrawal",
    "reveal its new software for smartwatches": "https://www.techradar.com/news/samsung-galaxy-watch-4-reveal-set-for-upcoming-unpacked-event",
    "revealed a bunch of new gadgets": "https://www.techradar.com/news/lenovo-has-five-new-android-tablets-including-a-huge-ipad-pro-rival",
    "called the Lenovo Smart Clock 2": "https://www.techradar.com/news/lenovo-quietly-unveils-smart-clock-2-and-wireless-charging-dock",
    "the NXTWEAR G": "https://www.techradar.com/news/tcls-mwc-2021-lineup-includes-smart-glasses-that-mimic-a-140-inch-display",
    "Alcatel 1": "https://www.techradar.com/news/this-new-super-cheap-android-phone-is-absolutely-tiny",
    "TCL MoveTime Family Watch 2": "https://www.techradar.com/news/this-kids-fitness-tracker-lets-your-little-ones-make-video-calls-from-their-wrists",
    "TCL 20 Pro 5G": "https://www.techradar.com/reviews/tcl-20-pro-5g"
  }
}