{
  "source": "https://www.techradar.com/news/chip-shortage-nightmare-could-last-for-years-says-ibm",
  "title": "Chip shortage nightmare could last for years, warns IBM",
  "category": "computing",
  "updated": "2021-05-14T20:30:48Z",
  "author": "john-loeffler",
  "summary": "Another two years of PS5 and RTX 3080 purgatory, folks",
  "article": [
    "IBM is joining the ranks of Intel and TSMC in their pessimistic outlook for a quick end to the global semiconductor shortage, putting the end of the silicon supply crunch sometime in late 2022/early 2023, at the very earliest.",
    "In case you aren't aware, there's a bit of a drought in semiconductors, the silicon-based chips that power everything from the best graphics cards and the new iMac to cars, medical equipment, and mobile phones - heck, even wired landlines have microcontrollers in them that are going to be impacted.",
    "This shortage isn't just making it harder to find the latest graphics cards like the RTX 3080 or consoles like the PS5, its also hammering the bottom lines of some pretty big industry heavyweights. According to The Guardian, the global auto industry alone could lose about $110 billion (about £78.1 billion/AU$141.34 billion) this year as a result of the silicon bottleneck.",
    "IBM president Jim Whitehurst told the BBC this week that the tech industry was unable to meet the soaring demand for chips now that the global economy is reopening as the pandemic starts to subside in some parts of the world.",
    "The confluence of factors tied to the pandemic, namely the plummeting production from factories due to health protocols and plant closures, and the sudden, soaring demand for tech products as people around the world were forced inside due to lockdowns for the past year, helped bring about the silicon crunch last year. This also came just as major console and hardware launched, like the PS5, Xbox Series X|S, Nvidia Ampere, and AMD Big Navi, all of which rely heavily on semiconductors that simply haven't been as available as expected.",
    "Now, with the global economy starting to come back online in earnest, the problems are only going to get worse before they get better, Whitehurst says. \"There’s just a big lag between from when a technology is developed and when [a semiconductor fabrication plant] goes into construction and when chips come out,\" he told BBC world business news.",
    "\"We’re going to have to look at reusing, extending the life of certain types of computing technologies, as well as accelerating investment in these [fabricating plants], to be able to as quickly as possible get more capacity online.\"",
    "“So frankly, we are looking at couple of years…before we get enough incremental capacity online to alleviate all aspects of the chip shortage,” he added.",
    "IBM isn't the only one sounding the alarm about the ongoing chip shortage. As PC Gamer notes, Intel and TSMC - both major global suppliers of semiconductors, along with Samsung - have both indicated that they weren't going to be able to meet the demand for silicon for a long while yet.",
    "“We do believe we have the ability to help,” Intel CEO Pat Gelsinger told The Washington Post last month. Still, Gelsinger added that “I think this is a couple of years until you are totally able to address it. It just takes a couple of years to build capacity.”",
    "TSMC, the largest contract manufacturer of semiconductors in the world, said in an earnings call last month that it was operating above 100% utilization in order to keep up with orders and that it was investing $30 billion (about £21.28 bilion/AU$ 38.55 billion) in new capacity this year.",
    "That capacity means literally building new fabrication plants, which are multi-year projects before a single silicon wafer rolls off the line and into consumer products. So, yeah, don't expect the shortage of consoles and graphics cards to ease up anytime soon."
  ],
  "headers": {
    "8": "IBM confirms what Intel and TSMC have already told us"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "new iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "The Guardian": "https://www.theguardian.com/technology/2021/may/14/global-shortage-of-computer-chips-could-last-two-years-says-ibm-boss",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "S": "https://www.techradar.com/reviews/xbox-series-s",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "AMD Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "PC Gamer": "https://www.pcgamer.com/ibm-agrees-with-intel-and-tsmc-this-chip-shortage-isnt-going-to-end-anytime-soon/",
    "The Washington Post": "https://www.washingtonpost.com/technology/2021/04/13/intel-ceo-semiconductor-chip-shortage/",
    "earnings call": "https://www.datacenterdynamics.com/en/news/tsmc-intel-and-nvidia-warn-of-years-of-chip-shortages/"
  }
}