{
  "source": "https://www.techradar.com/news/making-the-most-of-your-data-can-be-the-key-to-innovation",
  "title": "Making the most of your data can be the key to innovation",
  "category": "computing",
  "updated": "2021-09-15T13:05:32Z",
  "author": "sead-fadilpasic",
  "summary": "By maturing data practices, businesses can expect a more productive workforce",
  "article": [
    "Businesses that have mature data practices have a more productive workforce, are faster in innovating, faster at entering new markets, and are more likely to be directly monetizing their data, compared to their less-mature peers.",
    "That's according to a new survey from Splunk, which polled 1,250 global business and IT managers on their data practices, and found that data maturity is now a key business accelerator.",
    "What these firms need, Splunk says, is a complete view of their data, and the ability to act quickly. Heavy investors are said to innovate at double the rate of beginner-level firms, and are able to enter new markets at twice the rate. They are also able of increasing customer wallet share at almost twice the rate, too.",
    "Employee productivity at such firms jumped by 16% in the past year, while beginners can only boast with a 9% increase. Finally, mature businesses are almost twice as likely to be directly monetizing their data.",
    "“In today’s world, data is a strategic asset helping organizations not just survive, but thrive,” said Doug Merritt, President and CEO, Splunk.",
    "“Our current era of innovation is propelled by those who are doing more than just storing and managing data. Organizations that have invested in placing data at the core of their operations are twice as innovative and twice as productive as those that aren’t.”",
    "Not all industries are created equal, though, and some are able to innovate better than others. Manufacturers apply data innovation to improve material yields, and half of them reported “game-changing” impact.",
    "The same impact was felt among more than half of retailers that used data innovation to optimize and personalize offers, product recommendations and customer service.",
    "On the other hand are government agencies, where two-thirds (67%) are considered “beginners”.",
    "Data innovation also varies by geography, the report further states, albeit slightly. For example, businesses in North America and the APAC region invest 14% of their budgets to solutions and staff that investigate, monitor, analyze and react to data, compared to 12% in Europe."
  ],
  "headers": {
    "6": "Data newbies"
  },
  "links": {}
}