{
  "source": "https://www.techradar.com/news/global-cloud-spending-saw-a-huge-boom-in-q1-2021",
  "title": "Global cloud spending saw a huge boom in Q1 2021",
  "category": "computing",
  "updated": "2021-07-06T00:58:23Z",
  "author": "anthony-spadafora",
  "summary": "Cloud spending surpassed non-cloud spending during the first quarter",
  "article": [
    "Enterprise spending on cloud computing saw a big boost during the first quarter of this year according to new data from the International Data Corporation (IDC).",
    "In its latest tracker, the market intelligence firm revealed that spending on compute and storage infrastructure products for cloud infrastructure rose by 12.5 percent year over year during Q1 2021 to reach $14.1bn. Investments in non-cloud infrastructure meanwhile increased by 6.3 percent year over year to reach $13.5bn.",
    "As businesses around the world begin to return to the office and implement hybrid working policies, sectors of the economy that suffered the most revenue loss during the pandemic are returning to growth.",
    "According to IDC, a lasting impact on IT infrastructure will be an increased reliance on cloud platforms in the commercial, educational and social sectors while organizations will be more focused on business continuity and risk management. This will likely help drive digital transformation initiatives and also increase the usage of as-a-service delivery models.",
    "During the first quarter of this year, spending on shared cloud infrastructure increased by 11.6 percent year over year to reach $10.3bn. As a result, IDC expects shared cloud infrastructure spending to surpass non-cloud infrastructure spending in the near future.",
    "Spending on dedicated cloud infrastructure also saw a huge increase of 14.7 year over year last quarter to reach $4.8bn with 45.5 percent with 45.5 percent of this figure deployed on-premises. However, IDC expects cloud environments to continue to outpace non-cloud throughout its forecast.",
    "For the year, the firm forecasts that cloud infrastructure spending will grow by 12.9 percent to $74.6bn, non-cloud infrastructure spending will grow by 2.7 percent to $58.5bn following two years of declines and shared cloud infrastructure will grow by 12.2 percent year over year to %51.8bn.",
    "When it came to spending on cloud infrastructure worldwide, Canada saw the highest growth rates (40.3%) followed by China (35%) and Asia/Pacific excluding Japan and China (28.8%). Meanwhile Western Europe grew by 10.8 percent, the US grew by 4.5 percent and Japan declined by 1.1 percent. At the vendor level, all major vendors grew their cloud infrastructure revenue with Lenovo (38.2%) and Huawei (37.9%) experiencing the highest growth rates though Dell Technologies took the the top spot with 2.4bn in revenue followed by HPE/H3C at .16bn and Inspur at 1.02bn.",
    "IDC expects spending on compute and storage cloud infrastructure to have a compound annual growth rate of 11.3 percent over the 2021-2025 forecast period to reach $112.9bn in 2025.",
    "Via IDC"
  ],
  "headers": {
    "4": "Moving away from non-cloud infrastructure"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "IDC": "https://www.idc.com/getdoc.jsp?containerId=prUS48050621",
    "latest tracker": "https://www.idc.com/getdoc.jsp?containerId=prUS48050621",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation",
    "Lenovo": "https://www.techradar.com/news/lenovo-has-five-new-android-tablets-including-a-huge-ipad-pro-rival",
    "Huawei": "https://www.techradar.com/news/huawei-uk-revenues-fall-as-5g-ban-makes-impact",
    "Dell Technologies": "https://www.techradar.com/news/dell-enterprises-has-a-green-vision-to-stop-our-love-for-technology-killing-the-planet"
  }
}