{
  "source": "https://www.techradar.com/news/roku-chromecast-and-paramount-plus-set-to-look-far-better-on-your-4k-tv",
  "title": "Roku, Chromecast and Paramount Plus could soon look far better on your 4K TV",
  "category": "televisions",
  "updated": "2021-04-27T23:43:46Z",
  "author": "nick-pino",
  "summary": "Dolby Vision rival is coming to some big-name players and services",
  "article": [
    "Roku and Google have announced that their players will soon support HDR10+ content on certain streaming apps.",
    "Google announced the certification of the dynamic metadata-based HDR format this week with the Chromecast with Google TV and Roku announced two weeks ago that its new Roku Express 4K+ streamer would have it as well.",
    "In addition to the streaming platforms, Paramount Plus is also beginning to stream shows and movies in HDR10+, joining the likes of Amazon and Rakuten in its support for the format.",
    "The first show to get the treatment is The Stand available on Paramount Plus in HDR10+, and newer Roku devices like the Roku Ultra and Express 4K should have HDR10+ enabled after the players update to RokuOS 10.",
    "Like Dolby Vision, HDR10+ is an HDR format that uses dynamic metadata to change the peak luminance and black levels of each scene.",
    "Both formats are similar – but also very different – from the ‘standard’ HDR10 that uses static metadata that’s set in stone for the entire show or film. While Dolby Vision requires some editing to do this, however, HDR10+ uses a proprietary algorithm for faster up-conversion from static to dynamic metadata.",
    "Both Samsung and Dolby, the two proprietors of the respective technologies, insist there’s no war between the formats, however it has caused some divisions in support: Samsung QLED TVs, for example, only support HDR10+ while LG OLEDs only do Dolby Vision.",
    "The good news? There are a few TV manufacturers that support both formats like Vizio in the US and Panasonic in the UK, and soon we’ll be able to add devices like the Roku Ultra and Chromecast with Google TV to that list as well.",
    "Via Flatpanels HD and What Hi-Fi?"
  ],
  "headers": {
    "4": "What’s the deal with HDR10+?"
  },
  "links": {
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "Roku Express 4K+": "https://www.techradar.com/news/the-new-roku-express-4k-could-be-a-threat-to-the-amazon-fire-tv-stick-4k",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Roku Ultra": "https://www.techradar.com/reviews/roku-ultra-2020",
    "Flatpanels HD": "https://www.flatpanelshd.com/news.php?subaction=showfull&id=1619502881",
    "What Hi-Fi?": "https://www.whathifi.com/news/hdr10-support-expands-to-chromecast-roku-and-paramount"
  }
}