{
  "source": "https://www.techradar.com/news/ted-lassos-darkest-moments-are-its-most-relatable",
  "title": "Ted Lasso’s darkest moments are its most relatable",
  "category": "entertainment",
  "updated": "2021-09-05T18:00:36Z",
  "author": "nick-pino",
  "summary": "OPINION: The show’s saccharine nature is nice, but it’s the struggles with heavy topics that make it so relatable",
  "article": [
    "Critics of the show Ted Lasso have long complained that its cloyingly sweet characters and never-fail protagonist are, to put it nicely, unwatchable TV.",
    "Admittedly, if you only watch Ted Lasso for a few minutes each week and catch Ted giving an upbeat pep-talk to one of his players or peers, you might begin to suspect that the show is all fluff. Or rather, that Ted Lasso as a character is so saccharine in the way he methodically wins people over that he becomes unbearable instead of endearing.",
    "And I’ll admit, as a longtime advocate of the show, I have to agree. Ted’s affability can come off as annoying at times, especially if you’re only catching the parts where he warms people up faster than a fried egg on a hot sidewalk. That said, in my experience, it’s not the lighthearted parts of Ted Lasso that make it a great show – I’d argue that it’s the characters’ struggles with divorce, failure and mental health issues that truly make it top-notch.",
    "To appreciate Ted Lasso you don’t have to relate to the eponymous lead character’s successes, try instead to relate to his failures.",
    "You’ll find both minor and major spoilers for Seasons 1 and 2 ahead, up to and including the most recent episode, “Headspace”.",
    "Right out of the gate in season one, you’re given a front-row seat to Ted Lasso’s utter destruction of a fictional Premier League team, AFC Richmond.",
    "The way the club slowly goes from top of the table to relegation is done in such a way that the loss never feels overwhelming - nor does it appear to even upset Ted Lasso - but it’s clear from the outset that the town isn’t a huge fan of Lasso’s coaching style.",
    "This comes to a boil at the end of the first season, when the team loses in overtime and finally gets the boot to the lower league, leaving you to sympathize for the team as they wrap their heads around the loss.",
    "What I love most about the bittersweet scene is that it’s crafted in such a way that you’ll sympathize with Ted - believing in fact that AFC will make it back next season - while still feeling the pang of an important loss.",
    "The balance between optimism and sadness sets a perfect tone, and one I feel like that’s easier to relate to than if Ted’s coaching style won every game.",
    "Of course, football is sometimes a metaphor for some of the characters’ other struggles.",
    "Ted Lasso provides not one just character going through divorce, but two of them. The club’s manager Rebecca goes through the emotions of it in the front half of the first season as she gets revenge on her ex by sabotaging his favorite team, while Ted follows closely behind in the second half.",
    "These characters handle their emotional burdens differently (it’s around this time that we see Ted actually has a drinking problem and is less than perfect) and yet you can empathize with both of them.",
    "On one hand, we see Ted’s optimism begins to fade in the moments he talks about divorce. Ted’s never-give-up mentality is like a steaming locomotive on a track laden with brick walls. Try as he might to keep smashing through them, the train finally runs out of steam and he finds himself – as many of us would – in a deep state of depression.",
    "While Rebecca’s character arc has a few parallels to Ted’s it does things in a different way. After her plan for revenge goes awry, we see Rebecca emerge renewed, cautiously optimistic about what’s to come.",
    "Not only are both experiences relatable – but they’re achingly heartfelt. Breakups and divorces have both components – dejection and eventual optimism – and the show illustrates both aspects beautifully.",
    "However, the show’s best character flaw (if you can even call it that) is Ted’s panic disorder. Who’d expect that this genuinely kind, affable person struggles with something as heavy as panic and anxiety?",
    "Now, there have assuredly been portrayals of a panic disorder before Ted Lasso – not that many come to mind, however – but it feels more poignant here watching someone go through all the physical symptoms in real time.",
    "We’ve gotten a glimpse of this in the past, specifically in the seventh episode of season one (“Make Rebecca Great Again”) when Ted has to leave karaoke, but it wasn’t until last week’s episode that it began affecting his on-the-job performance.",
    "That twist is, in my opinion, absolutely crucial. So many of us feel anxiety but until it affects how you feel on the job on an everyday basis, it feels less real – something you cope with but maybe not actually struggle with. The moment it impacts you at the place you spend most of your time, it becomes a Problem.",
    "Already Ted is trying to address his issues with the team’s psychologist, the wonderfully terse Dr. Sharon Fieldstone (played by Sarah Niles). I'm afraid that the show might fast-track his counseling to speed things along, but seeing him anxiety at all in therapy is a huge blow to the stigma of going to see a counselor.",
    "Without moments like these, the show’s humor and genuineness would feel insincere. With them, however, it’s moments of joy feel more relatable, and its sadness, while painful, is just a part of the whole – just like life itself."
  ],
  "headers": {
    "5": "He's not the greatest coach of all time",
    "10": "His marriage is in shambles",
    "16": "He has an ever-present panic disorder"
  },
  "links": {}
}