{
  "source": "https://www.techradar.com/news/why-pinball-3d-needs-to-come-back-in-windows-11",
  "title": "Why 3D Pinball needs to come back in Windows 11",
  "category": "computing",
  "updated": "2021-10-17T11:00:26Z",
  "author": "daryl-baxter",
  "summary": "Opinion: It’s time for multi-ball to return",
  "article": [
    "The release of Windows 11 has come and gone, but already there’s feature wishes for future releases of the newest Windows upgrade. One in particular from me is for 3D Pinball to make a return.",
    "As a child, one of the primary reasons for using the family computer would be to see what search engines would bring in the way of games. While there were random Flash games of British Soaps and non-sanctioned Matrix games to play online, Windows itself had its fair share of games pre-installed.",
    "One from Windows XP was 3D Pinball, where hours would easily be wasted in achieving a high score. With a programmer now having reverse-engineered the game to work on web browsers, and even Sony’s PlayStation Vita, it’s time to see the game return for Windows 11.",
    "Steve Jobs once said that having iTunes on Windows was akin to having a glass of water in hell, and while this quote is harsh in retrospect, playing 3D Pinball on an iPad Pro feels strange. It’s similar to playing a Sonic game on a Nintendo console, or using Apple Music on a Google Pixel device.",
    "Using the Z and / keys for the flippers, alongside the spacebar for launching the ball instantly takes you back to Windows XP. The sounds and graphics are intact, and you can even play 3D Pinball on your smartphone if you wish.",
    "Using this in Windows 11, within a web browser, instantly takes you back to that time as well, and there are ways of using it as its own app as well. Playing 3D Pinball on a laptop with a touch screen is also possible, but a full screen mode would be much better for this orientation.",
    "There are plans for new music tracks, multi-ball and other features to come soon, but as it stands, you’re at risk of losing many hours already to this new way of playing 3D Pinball, as I already have in iPadOS 15 and Windows 11.",
    "We’re in an age where remakes are a valuable commodity in the games industry. Pokémon, Resident Evil and other franchises have already seen critically acclaimed remakes. They tap into the nostalgia associated with our childhood years but updated for modern times with improved graphics and gameplay, and 3D Pinball can fit that brief perfectly.",
    "While there were other games included in Windows across the years, such as Minesweeper and Solitaire, 3D Pinball brought a competitiveness to the family PC. There was a thrill about beating the high scores of your relatives with every visit you made to them once a week.",
    "A new 3D Pinball game that’s built from the ground up in Windows 11 could add to the mantra that Microsoft has about this release; that it’s an upgrade meant for everyone.",
    "With a new focus on gaming thanks to HDR and the Xbox app being heavily featured for the Windows upgrade, a new 3D Pinball game with online multiplayer and leaderboards, alongside native touch-support for those with laptops that have this feature, could be a big temptation to many who are still waiting to update to Windows 11."
  ],
  "headers": {
    "3": "Playing 3D Pinball on an iPad",
    "7": "Time for a remake in Fluent Design"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "reverse-engineered the game": "https://alula.github.io/SpaceCadetPinball/",
    "are ways": "https://github.com/k4zmu2a/SpaceCadetPinball",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15"
  }
}