{
  "source": "https://www.techradar.com/news/first-images-of-spacex-inspiration4-crew-in-orbit-reveal-their-window-onto-the-world",
  "title": "First images of SpaceX Inspiration4 crew in orbit reveal their window onto the world",
  "category": "appliances",
  "updated": "2021-09-17T13:20:23Z",
  "author": "john-loeffler",
  "summary": "SpaceX's cupola definitely lives up to its billing",
  "article": [
    "The first images from Inspiration4 during its first day in orbit reveal the crews mesmerizing view of our planet, courtesy of SpaceX Crew Dragon Resilience's special cupola window.",
    "The historic all-civilian mission is into its second day in orbit, after the crew spent their first full day in space taking in sights. The mission, beyond its historic milestone, is also aiming to raise $200 million for St. Jude's Children's Research Hospital, which treats pediatric cancers and other diseases.",
    "The pictures, posted to the Inspiration4 mission's Twitter account, show the crew posing for a zero-gravity group photo, mission commander Jared Isaacman speaking into a radio against a backdrop of the Earth beyond the capsule's cupola, mission specialist Chris Sembroski, seen from outside the capsule (via an external camera, most likely) taking a photo from inside the cupola.",
    "Finally, there is an absolutely magical photo of mission medical officer Hayley Arceneaux floating beneath the cupola with the Earth filling the window, her hand outstretched. Arceneaux herself is a survivor of pediatric bone cancer and works at St. Jude's.",
    "We were expecting to see the nose cone of the Resilience capsule open shortly after it entered orbit on Wednesday night, but a video connection problem cut the video feed short before we could catch a glimpse.",
    "There was a lot of disappointment around the mission's video feed getting knocked offline just before the nose cone of the Crew Dragon Resilience capsule opened up to reveal the cupola that SpaceX had installed in place of the usual docking equipment for connecting with the International Space Station.",
    "The cupola, the largest single window ever flown in space, offers the Inspiration4 crew a 360 degree view of Earth and the vastness of space beyond.",
    "The Inspiration4 mission is set for one more day in space before returning to Earth on Saturday, September 18, with an Atlantic ocean splashdown. The crew has brought several items with them in the Crew Dragon Resilience that will be auctioned off after the mission returns to Earth, with all proceeds going to St. Jude's."
  ],
  "headers": {
    "5": "Analysis: it was worth the wait"
  },
  "links": {
    "Inspiration4": "https://www.techradar.com/news/inspiration4-successfully-lifts-off-in-historic-first-all-civilian-mission-to-space"
  }
}