{
  "source": "https://www.techradar.com/news/times-running-out-to-bag-half-price-paramount-plus-deal-before-this-weeks-launch",
  "title": "Paramount Plus lands tomorrow and so you only have today to get 50% off",
  "category": "entertainment",
  "updated": "2021-03-03T14:50:37Z",
  "author": "adam-marshall",
  "summary": "Save half on a year of CBS All Access, which rebrands Thursday",
  "article": [
    "March is here (somehow) and with it the much-anticipated launch of the new Paramount Plus streaming service. Thursday, March 4 is the date for your diaries, which means you only have a few hours left in which to bag a generous 50% off an annual subscription.",
    "The service, which rebrands the existing CBS All Access streamer, will feature new originals and become the home to TV shows from the Star Trek franchise – like Strange New Worlds or Discovery season 4. Not to mention the obvious place to watch Frasier's return when America's favorite radio shrink hits screens again, and a platform to catch the best of CBS's live sports action without having to splash out on pricey cable.",
    "You can sign up to Paramount Plus (currently still called CBS All Access) here. Then, using the offer code PARAMOUNTPLUS, you'll see 50% knocked off both the Limited Commercials plan ($30 from $60) and the No Commercials plan ($50 from $100).",
    "We'll be reviewing Paramount Plus when it lands in the US, so if you want to wait and see what we think, it's worth keeping in mind. If you'd rather take advantage of this offer now, though...",
    "Read more:"
  ],
  "headers": {},
  "links": {
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "Strange New Worlds": "https://www.techradar.com/news/star-trek-strange-new-worlds",
    "Discovery season 4": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "You can sign up to Paramount Plus (currently still called CBS All Access) here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4925485112852111000&xs=1&url=https%3A%2F%2Fwww.cbs.com%2Fcbs-all-access%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ftimes-running-out-to-bag-half-price-paramount-plus-deal-before-this-weeks-launch"
  }
}