{
  "source": "https://www.techradar.com/news/behold-the-worlds-first-water-cooled-ps5",
  "title": "Behold, the world’s first water-cooled PS5",
  "category": "gaming",
  "updated": "2021-03-09T12:28:40Z",
  "author": "axel-metz",
  "summary": "Keeping things cool",
  "article": [
    "Hardware modders on YouTube have created what’s believed to be the world’s first water-cooled PS5.",
    "A 13-minute video from Vietnamese channel Modding Cafe details the full construction process involved in building a complete water-cooling system for Sony’s latest console, including a step-by-step walkthrough of how to deconstruct the next-gen hardware.",
    "Of course, it's worth bearing in mind that if you attempt to do this, you'll most certainly void your PS5's warranty.",
    "At the end of the video (around the 12-minute mark), the presenters put their innovative system to the test, with surprisingly-effective results. The water-cooler is able to successfully stabilize the heat emitted from the PS5, limiting the hot air around the backplate of the console.",
    "The channel also hints at constructing a variant of the cooling system for the mass market. The description to the video reads: “We are continuing to prepare for a commercial version [of the system] and also ready to integrate the water-cooled PS5 into one of our next PC builds.”",
    "Judging by the way it looks – like a weapon belonging to Mr. Freeze – we’ll bet plenty of people would line up to have their PS5 cooled by Modding Cafe’s quirky water-based system.",
    "It goes without saying that this isn’t the first PS5 console to receive a makeover.",
    "Although Sony’s flagship hardware currently only ships in a basic white color variant, you’re still able to purchase custom faceplates which jazz up the aesthetic of your next-gen system. A company called dbrand offers PS5 \"darkplates\", which are available for $49.99 (around £40 / AU$60).",
    "Given that we’ve seen how easy it is to dissect a PS5 system – there’s an official Sony teardown video, if trusting internet modders isn’t your thing – switching up the color of your console isn’t the daunting task it might initially seem.",
    "Naturally, if you’d rather skip the DIY, you could always just opt for a 24K gold PS5. It costs a cool $10,000 (around £7,700 / AU$14,000), but who doesn't have that sort of cash lying around?",
    "Via Gamestop"
  ],
  "headers": {
    "6": "Custom job"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Modding Cafe": "https://www.youtube.com/watch?v=PeuyxWcJnaM",
    "custom faceplates": "https://www.techradar.com/news/these-custom-ps5-faceplates-let-you-change-the-look-of-sonys-console/news/black-ps5-finally-becomes-a-reality-as-faceplates-go-on-sale-but-not-from-sony",
    "dbrand": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4180044878107944400/https://dbrand.com/shop/special-edition/ps5",
    "official Sony teardown video": "https://www.techradar.com/news/ps5-hardware-is-finally-revealed-in-this-sony-teardown-video",
    "gold PS5": "https://www.techradar.com/news/this-dollar10000-24k-gold-ps5-might-have-revealed-an-important-ps5-price-detail",
    "Gamestop": "https://www.gamesradar.com/hardware-modders-create-incredible-watercooled-ps5/"
  }
}