{
  "source": "https://www.techradar.com/news/battlefield-2042-could-be-filled-with-bots-on-ps5-and-xbox-series-x",
  "title": "Battlefield 2042 could be filled with bots on PS5 and Xbox Series X",
  "category": "gaming",
  "updated": "2021-06-24T10:21:06Z",
  "author": "hamish-hector",
  "summary": "The 128 player matches could be 50% AI",
  "article": [
    "When Battlefield 2042 was announced, it was revealed that players on Xbox Series X, PS5 and PC would be able to play in servers with up to 128 players at once. However, you might not always be playing against humans in those matches, with EA now explaining more about the role of AI bots in Battlefield 2042 multiplayer.",
    "Speaking to The Verge, EA explained that up to 64 'AI soldiers' could be used to fill up empty lobbies depending on factors like your region, platform and the time of day. However, the company added that human players will always take priority, so at busy times it’s likely you won’t run into many AI.",
    "Ironically though, this could mean that last-gen gamers on Xbox One and PS4 might end up with a better gameplay experience than next-gen. That’s because while bots will be used to fill their servers too, the max lobby size is just 64 on older consoles and many Battlefield 2042 players might still stuck using last-gen machines thanks to next-gen shortages.",
    "While many players will be worried about how significantly bots will impact the gameplay experience of Battlefield 2042, the multiplayer might not suffer too heavily. If the bots can play competently then it’s possible that players might not ever really know when they’re playing against humans or not.",
    "Even if bots aren’t quite up to snuff, they’ll give newer players a chance to earn some easy experience - and we’d imagine that bots would be spread evenly across both teams so no one side is given an advantage.",
    "This also wouldn’t be the first time bots have appeared in an EA game either - just look at the recent Battlefront games. They can make matches feel larger and keep the epic sense of scale the developer is hoping to achieve even when player numbers are on the low side.",
    "When Battlefield 2042 launches we probably won't see many bots at first, as servers are flooded with human players looking to try out the new game. As bots start popping up though, EA and Dice will have to make sure they're well implemented or even more AI replacements could be needed as players head for the exit."
  ],
  "headers": {
    "3": "Bots might not be all bad"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "The Verge": "https://www.theverge.com/2021/6/23/22547946/ea-battlefield-2042-bots-ai-soldiers-128-player-backfill"
  }
}