{
  "source": "https://www.techradar.com/news/sea-of-thieves-just-had-its-biggest-month-yet-three-years-after-it-first-released",
  "title": "Sea of Thieves just had its biggest month yet, three years after it first released",
  "category": "entertainment",
  "updated": "2021-02-19T15:54:01Z",
  "author": "vikki-blake",
  "summary": "And developer Rare says this year is going to be its biggest yet",
  "article": [
    "Sea of Thieves has just celebrated its biggest ever month, almost three years after it was released in March 2018.",
    "In a developer update video shared on Rare's YouTube channel, executive producer Joe Neate said it was an \"incredible\" achievement that the game – which recently launched its first season of content – had just seen its highest concurrent user figure since it released three years ago.",
    "\"January has been our biggest month yet in terms of [Monthly Active Users]. The most people we've had playing in a single calendar month, which is incredible seeing as we've been out nearly three years now,\" Neate said.",
    "\"We also saw our highest concurrent users – people playing at the same time – since around the launch period in March 2018.",
    "\"To be nearly three years into the journey of Sea of Thieves and to be in that position is just incredible,\" Neate added. \"So thanks to everyone who has been here since the start or has joined us more recently. It's an amazing moment in time for us.\"",
    "Neate also teased at what's to come in the next few months, hinting that this year is \"going to be [Sea of Thieves'] biggest one yet\".",
    "Sea of Thieves is just one of the hundreds of games available now on Xbox Game Pass, which no doubt contributed to its success.",
    "If you’re already missing the recently-removed Final Fantasy 15, why not jump into Final Fantasy 12? This remaster of the series’ twelfth mainline instalment will put you in the shoes of another pirate – this one a wannabe sky pirate – in a world of magic and airships.",
    "Other games that arrived this month on the service include Project Winter, the Falconeer, Ghost of a Tale, Jurassic World Evolution, Stealth Inc. 2: A Game of Clones, and Wolfenstein: Youngblood, while De Blob, Ninja Gaiden 2, World of Horror, and Shadows of the Damned have recently been removed.",
    "Thanks, Gamespot."
  ],
  "headers": {
    "6": "Shiver yer timbers"
  },
  "links": {
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Other games that arrived this month": "https://www.techradar.com/news/final-fantasy-xii-and-jurassic-world-evolution-headline-new-xbox-game-pass-titles-for-february",
    "Gamespot": "https://www.gamespot.com/articles/sea-of-thieves-just-had-its-biggest-month-ever-35-months-after-release/1100-6487747/"
  }
}