{
  "source": "https://www.techradar.com/news/intel-chooses-vmwares-pat-gelsinger-to-replace-bob-swan-as-ceo",
  "title": "Intel appoints VMware's Pat Gelsinger to replace Bob Swan as CEO",
  "category": "computing",
  "updated": "2021-01-13T19:58:43Z",
  "author": "anthony-spadafora",
  "summary": "Chipmaker taps industry veteran and former employee to lead the company",
  "article": [
    "Intel has announced that VMWare CEO Pat Gelsinger will lead the company once current CEO Bob Swan steps down in February.",
    "The chipmaker has appointed 40-year technology industry leader Gelsinger as the company's new chief executive officer and he will also be joining its board of directors upon assuming the role.",
    "The move makes a great deal of sense on Intel's part as Gelsinger started his career at the company where he worked for 30 years before taking on the role of president and COO at EMC and becoming VMware's CEO back in 2012.",
    "Independent chairman of the Intel board Omar Ishrak praised the company's new CEO in a press release and explained how Geslinger will be able to draw on his technology and engineering expertise in his new role, saying:",
    "“Pat is a proven technology leader with a distinguished track record of innovation, talent development, and a deep knowledge of Intel. He will continue a values-based cultural leadership approach with a hyper focus on operational execution. After careful consideration, the board concluded that now is the right time to make this leadership change to draw on Pat’s technology and engineering expertise during this critical period of transformation at Intel. The board is confident that Pat, together with the rest of the leadership team, will ensure strong execution of Intel’s strategy to build on its product leadership and take advantage of the significant opportunities ahead as it continues to transform from a CPU to a multi-architecture XPU company.”",
    "Bob Swan was named the CEO of Intel back in January of 2019 after serving as the company's interim CEO for seven months.",
    "However, during Swan's tenure the company faced stiff competition from its top competitor AMD as well as the UK-based chip designer Arm. Intel suffered a major blow to its chip business in the fall of last year when Apple announced that it would use its own proprietary M1 chips in its Mac computers after a 15-year partnership with the company.",
    "While Swan has a background in business having served as the CFO of Intel and eBay before becoming CEO, Geslinger's background is more technical as he became Intel's first ever CTO back in 2000. Due to this, Geslinger will likely leverage his technical background to help right the company's course once he takes on the role of CEO.",
    "In its press release announcing that Geslinger will take over for Swan, Intel highlighted the fact the announcement is unrelated to the company's 2020 financial performance and that it expects Q4 revenue to exceed its prior guidance.",
    "Via CNBC"
  ],
  "headers": {
    "5": "Shifting Intel's course"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/intel-is-making-some-of-the-thinnest-gaming-laptops-ever-at-ces-2021",
    "EMC": "https://www.techradar.com/news/dell-emc-powerscale-wants-to-conquer-all-your-unstructured-data",
    "press release": "https://newsroom.intel.com/news-releases/intel-appoints-tech-industry-leader-pat-gelsinger-as-new-ceo/#gs.qj6dji",
    "AMD": "https://www.techradar.com/news/amd-ryzen-5000-mobile-processors-arrive-at-ces-2021-to-steal-the-laptop-crown-from-intel",
    "Arm": "https://www.techradar.com/news/arm-has-launched-an-nvidia-cpu-monster-that-will-get-intel-and-amd-very-worried",
    "M1 chips": "https://www.techradar.com/news/apple-m1-chip-will-save-dollar25b-a-year-after-dumping-intel-for-the-m1-chip",
    "CNBC": "https://www.cnbc.com/2021/01/13/intel-ceo-bob-swan-to-step-down-in-february.html"
  }
}