{
  "source": "https://www.techradar.com/news/realme-gt-2-looks-weirdly-like-the-google-pixel-6-according-to-leaked-renders",
  "title": "Realme GT 2 looks weirdly like the Google Pixel 6, according to leaked renders",
  "category": "phones",
  "updated": "2021-12-01T14:19:39Z",
  "author": "tom-bedford",
  "summary": "Another horizontal camera bump",
  "article": [
    "When the Google Pixel 6 was unveiled lots of people mocked its weirdly-large horizontal camera bump – but apparently that didn't put off Realme, as it sounds like the next flagship phone from the company could have a similar design.",
    "Shortly after Realme unveiled the 'GT 2 Pro' name for its next smartphone, which will apparently be the brand's \"first and most premium flagship phone\" according to its CEO, a leaker provided some pictures of what the device could look like.",
    "Popular leaker Onleaks provided these pictures to 91mobiles, and they show green and white versions of the GT 2 Pro – no word on the non-Pro version, but many Chinese manufacturers tend to make more of a song and dance about their top-end devices.",
    "We've seen quite a few Android phones with horizontal camera bumps, but like the Pixel 6, the GT 2 Pro's lens-home sticks a fair way out from the back fo the device.",
    "As well as providing these images, OnLeaks shared some specs for the phone: apparently it'll have a 6.8-inch WQHD+ screen with a 120Hz refresh rate, 50MP main camera joined by a 50MP ultra-wide and 8MP telephoto snapper, a 32GB selfie camera, 12GB RAM, the next top-end Snapdragon chipset and 125W fast charging.",
    "A rough price is provided at $799 (around £600, AU$1,120) – that's the cost the Galaxy S21 launched at, so the GT 2 Pro seems like a close rival for that mobile. It's worth pointing out that Realme doesn't see its devices in the US though, yet at least.",
    "One of the most distinguishing things about the first wave of Realme GT phones was their designs – above you can see a gallery showing the original, the GT Neo 2 and the GT Master Edition.",
    "They've all got noteworthy appearances, with the stripes and bold colors of the first two and the ridged suitcase style of the third.",
    "That's not the case with these Realme GT 2 Pro renders though – judging by the pictures, the handset looks a lot more generic and standard. It's a shame, because at TechRadar we're big fans of interesting-looking phones, and found the GT a refreshingly novel device.",
    "Plus, it doesn't seem like we're getting a vegan leather Realme GT 2 Pro, despite how nice that felt in the hand for the GT.",
    "Perhaps the 'standard' Realme GT 2 will have some more design elements in keeping with the original entry in the series, but we'll have to wait to find out."
  ],
  "headers": {
    "6": "Analysis: a strange design side-step"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Realme unveiled the 'GT 2 Pro' name": "https://twitter.com/skyli_realme/status/1465244372576784387",
    "91mobiles": "https://www.91mobiles.com/hub/realme-gt-2-pro-render-specs-price-exclusive/",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "GT Neo 2": "https://www.techradar.com/reviews/realme-gt-neo-2-review",
    "GT Master Edition": "https://www.techradar.com/reviews/realme-gt-master-edition-review"
  }
}