{
  "source": "https://www.techradar.com/news/zoom-is-about-to-make-video-calls-even-more-interesting",
  "title": "Zoom is about to make video calls even more interesting",
  "category": "computing",
  "updated": "2021-03-22T22:17:02Z",
  "author": "anthony-spadafora",
  "summary": "Developers can now build their own video-based apps using Zoom's Video SDK",
  "article": [
    "As being able to communicate over video can lead to greater engagement and collaboration, Zoom has announced that its Video Software Development Kit (SDK) is now available as part of the Zoom Developer Platform.",
    "By using the video conferencing firm's Video SDK, developers can now leverage its HD video, audio and interactive features to build their own video-based applications and desktop experiences without being tied to the Zoom Meetings user interface.",
    "In a blog post announcing the availability of Zoom's Video SDK, principal analyst at ZK Research, Zeus Kerravala explained how developers can capitalize on the growing popularity of video conferencing by adding video to their apps and software, saying:",
    "“Video usage is at an all-time high. The next wave of video-based experiences will be driven by embedding video directly into business and consumer applications that seamlessly improve workflows and enhance social interaction. Zoom’s Video SDKs are easy to work with, and enable nimble development of fully customizable video-based applications.”",
    "Zoom's new Video SDK is available in two plans with the Pay As You Go plan providing 10,000 minutes of video per month while the $1,000 a year plan offers 30,000 minutes of video per month. Regardless of which plan developers choose, they'll be able to create new video-based customer experiences across a wide range of different categories.",
    "In her blog post, product marketing manager at Zoom, Natalie Mullin explained that the SDK can be used to create social, gaming, retail and other experiences. For instance, developers can integrate Zoom's functionality into social media apps to offer on-the-go live streaming with interactive chat, desktop gaming apps that offer new opportunities for audience engagement or retail apps with unique shopping experiences that are tailored to customers.",
    "Zoom's Video SDK is an important component of the Zoom Developer Platform which includes APIs, SDKs, chatbots, webhooks, distribution for applications and integrations. The company's latest release also includes more detailed analytics to give developers greater insights into how their apps perform and are used on the Zoom App Marketplace.",
    "To get started using Zoom's Video SDK, developers can either pick out a plan or if they have more questions, they can select the “Contact Sales” option on the Video SDK page to get in touch with the company's ISV team for more details."
  ],
  "headers": {
    "4": "Zoom Video SDK"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Zoom Meetings": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "blog post": "https://blog.zoom.us/bring-industry-leading-video-to-your-application-with-zooms-video-sdk/",
    "two plans": "https://zoom.us/buy/videosdk",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "live streaming": "https://www.techradar.com/news/the-best-free-streaming-software",
    "Zoom App Marketplace": "https://www.techradar.com/news/zoom-finally-catches-up-with-microsoft-teams-with-new-native-app-integrations"
  }
}