{
  "source": "https://www.techradar.com/news/a-mars-secret-solved-a-colossal-comet-and-mind-fractals-all-in-this-weeks-science-news",
  "title": "A Mars secret solved, a colossal comet, and mind fractals all in this week's science news",
  "category": "appliances",
  "updated": "2021-10-01T22:14:06Z",
  "author": "john-loeffler",
  "summary": "From the human mind to intermediate mass black holes",
  "article": [
    "A lot of mysteries were solved this week in the science world, while new ones seemed to present themselves.",
    "First, we might have finally found what's responsible for all those the ancient trench valleys on Mars that have long puzzled scientists, and the cause is about as violent as befits an ancient Greek god.",
    "Then, there was news that a long-elusive intermediate black hole has finally been found, all on account of its voracious appetite.",
    "Looking deeper into our own mind, researchers discovered that our thoughts might actually have a kind of geometry all their own, and that it isn't all too dissimilar from fractals.",
    "Then, out beyond the orbit of Neptune, a new comet so large that it was originally mistaken for a dwarf planet is being watched as it enters our solar system, and some scientists think that yet another planet might be lurking out there in the Kuiper Belt – which is a totally different one than the proposed Planet Nine that everyone's been looking for over the past few years.",
    "This week, researchers at the University of Texas at Austin (UT) published a paper analyzing 262 craters on Mars that were once believed to house ancient lakes or seas, and discovered that these may be the key to understanding Mars' heavily scarred surface.",
    "According to the paper, these crater lakes would exert so much pressure on the walls of the crater, which extended high above the surrounding region, that eventually these walls would rupture, dumping out nearly the entirety of the water contained within them in fast-moving, violent floods.",
    "\"They greatly varied in terms of their volumes,\" Tim Goudge, an assistant professor at UT's Jackson School of Geosciences and lead author of the paper told us earlier this week, \"but some were the size of small seas on Earth (e.g., Caspian Sea).\"",
    "These massive lakes or seas would empty out in a soon as a few weeks, and the amount of sediment the rushing waters carved out of the Martian surface was incredible.",
    "“When you fill [the craters] with water, it’s a lot of stored energy there to be released,” Goudge said. “It makes sense that Mars might tip, in this case, toward being shaped by catastrophism more than the Earth.”",
    "We've long known that black holes come in at least two sizes: stellar-mass black holes that are 15 to 100 times the size of the sun, and supermassive black holes, which are a million times the size of the sun or even greater.",
    "But we've long wondered if there were any black holes in between, a so-called intermediate-mass black hole, and now we know that they do indeed exist after catching one tearing apart a hapless star that got caught in its gravitational tendrils.",
    "A team of researchers at the University of Arizona (UA) analyzed records of a previous flare from a tidal disruption event – where a star gets torn to shreds by the gravity of a black hole and emits powerful X-rays in the process – and were able to deduce both the spin and the mass of the black hole that caused it. According to their calculations, the black hole weighed in at about 10,000 solar masses.",
    "\"The fact that we were able to catch this black hole while it was devouring a star offers a remarkable opportunity to observe what otherwise would be invisible,\" said Ann Zabludoff, a professor of astronomy at UA and co-author of the paper. \"Not only that, by analyzing the flare we were able to better understand this elusive category of black holes, which may well account for the majority of black holes in the centers of galaxies.\"",
    "Even though it has been studied since antiquity, there is a great deal we simply don't know about the human mind, but new research is giving us some insight into what happens when we think.",
    "Dartmouth College researchers had volunteers listen to a 10-minute short story and analyzed the patterns of activity in the brains network of neurons and found that these patterns looked a lot like fractals.",
    "\"To generate our thoughts, our brains create this amazing lightning storm of connection patterns,” Jeremy R. Manning, assistant professor of psychological and brain sciences at Dartmouth and the paper's senior author, said. “The patterns look beautiful, but they are also incredibly complicated. Our mathematical framework lets us quantify how those patterns relate at different scales, and how they change over time.\"",
    "Everybody's probably heard by now that scientists are hard at work looking for a possible ninth planet out beyond the orbit of Neptune, but we might need to add one more to the mix.",
    "Astronomers, using powerful computer simulations, now say there is about a 50% chance that a rocky planet was dragged out of the inner solar system by the outer gas giants and effectively used as a gravitational foothold for the gas giants to achieve their current positions and orbits – and shoving the rocky Mars-sized planet out into the Kuiper Belt, if not out of the solar system entirely, in the process.",
    "\"Our simulations found that in about half of the cases, all of the Mars-scale planets in the outer Solar System were ejected into interstellar space,” said Scott Tremaine, of the Institute for Advanced Study in Princeton, New Jersey. “But in the remaining half, one ‘rogue’ planet was left in an orbit similar to that of the detached population of Kuiper Belt objects.\"",
    "Whether such an object can be found will be tricky, but if true, then there could be even more mysteries out in the Kuiper Belt than we originally thought.",
    "The comet Bernardinelli-Bernstein is making its second trip through the solar system after about a 3.5-million-year hiatus, and it's the largest comet we've ever seen.",
    "First discovered in June 2021, Bernardinelli-Bernstein is believed to be somewhere between 60 and 120 miles wide (about 100 to 160 km) and was originally thought to be a dwarf planet when it was first spotted in the vicinity of Neptune from an image taken in 2014.",
    "Now closer to Uranus, the comet has already sprung a tail, the farthest comet to ever be seen doing so. The fact that it is so large indicates that this might be one the second time the comet has made its way through the solar system.",
    "\"It's very rare to see big comets basically because unless you're catching it in its first or second passage, most of its material would already be gone,\" Bernardinelli said.",
    "The loss of material comes from their approaching the sun. Since comets are effectively gigantic snowballs in space, getting close to the sun melts the ice around their core and produces their spectacular tails. This melting though also reduces their mass each time they pass through the inner solar system.",
    "The nearest Bernardinelli-Bernstein will come to Earth will be about 11 AU, or 11 times the distance Earth is from the sun, which puts it just outside the orbit of Saturn and far enough from us that it isn't a threat to us, at least not this go around. If it were to hit us though, boy howdy, Earth would be in for a world of hurt."
  ],
  "headers": {
    "5": "Mystery of Martian trenches has a violent solution",
    "10": "An intermediate-mass black hole has finally been found when it got caught snacking on a star",
    "14": "The human mind bears a strong resemblance to mathematical fractals",
    "17": "Yet another planet might be hiding out beyond Neptune, this one a rocky world the size of Mars",
    "21": "A colossal comet once mistaken for a dwarf planet is making its way towards the sun"
  },
  "links": {
    "understanding Mars' heavily scarred surface": "https://www.techradar.com/news/mystery-of-mars-ancient-trenches-might-have-finally-been-solved",
    "these patterns looked a lot like fractals": "https://www.techradar.com/news/are-human-thoughts-made-of-fractals",
    "Earth would be in for a world of hurt": "https://www.techradar.com/news/a-colossal-comet-once-mistaken-for-a-dwarf-planet-is-headed-to-our-solar-system"
  }
}