{
  "source": "https://www.techradar.com/news/nintendo-switch-vs-nintendo-switch-lite-is-bigger-really-better",
  "title": "Nintendo Switch vs Nintendo Switch Lite: is bigger really better?",
  "category": "gaming",
  "updated": "2021-07-08T13:27:41.236Z",
  "author": "lloyd-coombes",
  "summary": "There's another Switch in town",
  "article": [
    "Nintendo Switch vs Nintendo Switch Lite: if you're thinking about picking up the latest Nintendo console, it's a decision that might be difficult at first, but we're here to help. When it comes to convenience, the Nintendo Switch is a hard console to beat. Since its release in 2017, the console has been a hit for Nintendo, appealing to players the world over due to its ability to offer at-home and on-the-go gaming as well as a fantastic library of games.",
    "Of course, it’s not everyone that needs their Nintendo console to plug into their TV—in fact, shortly after the console’s release it was found that handheld mode was the most popular for players. It’s not surprising, then, that in 2019 Nintendo continued its tradition of leading the handheld-only console market with the release of the Nintendo Switch Lite. Smaller, lighter and less expensive than the original Nintendo Switch, it’s the perfect option for those who have no interest in docking their console.",
    "So, now prospective Switch owners have two options when it comes to Nintendo’s latest console (unless that rumored Nintendo Switch Pro makes an appearance) but which model is right for you? Is it the handheld-only Switch Lite? Or the original hybrid?",
    "To help you decide, we’ll take you through the similarities and differences between each of the consoles, comparing design, prices and game libraries. Keep reading to settle the Nintendo Switch vs Switch Lite battle.",
    "The current Nintendo Switch model retails for $299/£279.99/AU$469, with plenty of bundle options. For that price, you get yourself the console, two Joy-Con controllers, a dock and the associated cables.",
    "Bundles tend to include massively popular games like Mario Kart 8: Deluxe, Pokemon Sword and Shield or Super Smash Bros. Ultimate – all of which are great games to get you started.",
    "Meanwhile, the Nintendo Switch Lite retails for the lower price point of $199.99/£199.99/AU$329.95 for the console on its own. The console is focused on handheld play so you don’t get a dock or detachable Joy-Con controllers (more on that later), but bundles with the most popular games can be found at most retailers, with the accompanying games generally adding a little extra onto the cost.",
    "Bundles aside, looking at the prices of the consoles alone shows that the Switch Lite does, as you'd expect, cost less than the original version. If you’re not interested in the Switch's TV output capabilities then opting for the Switch Lite is money worth saving as it could be enough to get you another couple of games.",
    "Arguably, the Switch’s main selling point is the console’s versatility. You can use your console to conquer Hyrule in The Legend Of Zelda: Breath Of The Wild on your morning commute, before docking the console once you get home to play with either your detached Joy-Con or the Pro Controller.",
    "It’s instant, and feels almost like magic as you transfer your game from the screen on the device to the television and back again.",
    "Nintendo has opted to forgo this hybrid functionality on the cheaper Nintendo Switch Lite. It has fixed Joy-Con controllers and can’t be docked to a TV – and while this may be a deal breaker for many, we think it could be very attractive to new customers and existing ones alike.",
    "As an example, the bright colors really help give it a more toy-like feel which younger players will find appealing. Between yellow, gray, coral and turquoise, there’s plenty of room to express yourself – albeit without swapping joy-cons to your heart’s content.",
    "The lower price is ideal for those looking for a second device for a younger child, too, or simply a console you can take on the go more readily – the more plastic-looking Switch Lite with its fewer moving parts looks a little more durable than its more versatile older brother.",
    "Despite the controllers being fixed, they offer mostly the same buttons as the original Switch – except the A,Y,B,X buttons have been replaced by a D-Pad – while some functionality has been removed which we’ll get onto shortly. Both models also allow for wireless connectivity, Bluetooth and the use of MicroSD cards to increase the meager 32GB of console storage.",
    "The Nintendo Switch offers a 6.2 inch LCD display, with a maximum resolution of 720p. With PlayStation and Xbox chasing higher and higher pixel counts, 720p feels decidedly unambitious but the system’s raft of high-quality exclusives belie any technical shortcomings. Of course, there’s also the ability to dock the console to output at 1080p: it’s not 4K, but it’s a bit crisper when stretched across your TV or monitor of choice.",
    "The Switch Lite’s lower price point means that the system has to make some cutbacks, and while the display is still an LCD with capacitive touch functionality (and reaches the same 720p resolution), it’s slightly smaller than on the original Switch, measuring at 5.5 inches. Still, it’ll be ideal for younger siblings to catch fish in Animal Crossing: New Horizons while on the go.",
    "This is where things arguably get a little bit complex, given the discrepancy between the two console’s feature sets.",
    "Because the Switch Lite’s controllers are fixed they don’t offer HD Rumble, motion controls, or the IR Motion Camera found on the previous model’s Joy-Con. This means that any game that requires any of these pieces of kit will require the wireless connection of a pair of extra Joy-Con controllers.",
    "That means Snipperclips (and the Plus version) and Mario Tennis Aces will both require additional controllers for those playing on the Nintendo Switch Lite.",
    "That isn’t all, though. Because many games require detached Joy-Con controllers, the following are unsuitable for the Switch Lite: Labo kits, 1-2 Switch and Super Mario Party.",
    "Perhaps the biggest concern is that there is a chance that games will eventually launch which aren’t compatible with the handheld mode of the Switch, thereby meaning you’ll be unable to play them on the Switch Lite. It seems unlikely, but consider a world where the next big Mario platformer requires full Joy-Con support and you might feel like you're missing out.",
    "Also, consider that the Joy-Con charge either via connecting to the Nintendo Switch or by the charging stand. If you’ve only got the Lite, you’ll need to invest in the charging stand.",
    "Much easier to explain is the console’s interface. The Switch has offered a clean, arguably barebones UI which has only seen minor incremental updates over the last two years, and the Lite will offer the same functionality.",
    "This means you’ll have your friends list, your titles, and the eShop all at a touch or button press away. You can share screenshots, catch up on the latest Nintendo news, and access your settings just as you can on the full-fat Switch.",
    "You’ll be able to play multiplayer games like Splatoon 2 with friends regardless of which Switch model you’re using, although a subscription to Nintendo Switch Online is required. This currently costs $3.99/£3.49/AU$5.95) a month, $7.99/£6.99/ AU$11.95 for 90 days, or $19.99/£17.99/AU$29.95 per year – a family plan with eight accounts will set you back $34.99/£31.49/AU$54.95.",
    "Whether you have a Nintendo Switch or a Nintendo Switch Lite, then, you’ll be able to enjoy online play, cloud saves, and exclusive offers for members. The big draw here is the ability to play NES games, while any masochists will also get access to Nintendo’s uniquely awful smartphone app too.",
    "So there you have it, two Switch models to agonize over in preparation for your next holiday. Which will you be jumping into? Thankfully whichever you choose, you’ll be able to play a huge library of excellent games."
  ],
  "headers": {
    "4": "Nintendo Switch vs Nintendo Switch Lite: price",
    "8": "Nintendo Switch vs Nintendo Switch Lite: design",
    "14": "Nintendo Switch vs Nintendo Switch Lite: display",
    "16": "Nintendo Switch vs Nintendo Switch Lite: games",
    "22": "Nintendo Switch vs Nintendo Switch Lite: software and interface"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "found that": "https://www.eurogamer.net/articles/2017-10-31-nintendo-switch-owners-play-slightly-more-in-handheld-mode-than-on-tv",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Mario Kart 8: Deluxe": "https://www.techradar.com/how-to/mario-kart-8-deluxe-tips-and-tricks",
    "Pokemon Sword": "https://www.techradar.com/reviews/pokemon-sword-and-shield-review",
    "Super Smash Bros. Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review",
    "The Legend Of Zelda: Breath Of The Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "Pro Controller": "https://www.techradar.com/reviews/nintendo-switch-pro-controller",
    "MicroSD cards": "https://www.techradar.com/best/nintendo-switch-micro-sd-cards-the-best-memory-cards-for-storing-your-games",
    "Animal Crossing: New Horizons": "https://www.techradar.com/reviews/animal-crossing-new-horizons",
    "Labo kits": "https://www.techradar.com/reviews/nintendo-labo",
    "Super Mario Party": "https://www.techradar.com/news/super-mario-party-review-the-most-tactical-mario-party-game-yet",
    "Splatoon 2": "https://www.techradar.com/how-to/splatoon-2-tips-and-tricks",
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer"
  }
}