{
  "source": "https://www.techradar.com/news/mini-led-vs-oled",
  "title": "Mini LED vs OLED: how do the top TV technologies compare?",
  "category": "televisions",
  "updated": "2021-03-07T11:00:41.742Z",
  "author": "jeremy-laird",
  "summary": "Can the Mini LED backlight give LCD TVs what it takes to beat OLED?",
  "article": [
    "Mini LED is the next big thing in TV technology. But how does it compare to the current king of premium sets, OLED? Can it really beat OLED for everything from brightness, contrast, HDR performance and response – or give QLED the edge that it needs?",
    "Mini LED certainly looks like being the ultimate evolution in LCD display technology, the culmination of decades of development and advances. Contrary to the name, however, Mini LED remains a transmissive technology based on LCD panels, and the ‘LED’ bit only refers to the type of backlight being used.",
    "The inherent shortcomings of LCD? They’re still present and accounted for. So don’t get it confused with Micro LED, which is a totally different proposition. With all that in mind, it’s time to find out if Mini LED can topple OLED, or if the picture is a bit more complicated than that.",
    "OLED’s core advantage is its per-pixel lighting. OLED is a self-emissive technology, which means each pixel is its own light source, enabling total control over brightness and contrast.",
    "While Mini LED is intended to dramatically improve backlighting control in LCD TVs, it works a little bit differently to OLED. Upcoming Mini LED TVs are expected to have as many as 3,000 lighting zones. That’s a big improvement on existing LCD TVs, but it still implies comparatively low resolution control over lighting and contrast. By comparison, the per-pixel lighting of OLED means that a 4K set effectively has over eight million zones.",
    "Think about that. Imagine the whole screen entirely black, save for a single pixel out of eight million in pure, bright white – because that’s totally doable on an OLED. On a Mini LED set, it’s not even close: in a 4K panel with around 3,000 lighting zones, each backlight zone would actually drive around 2,700 pixels.",
    "In other words, precision lighting for very detailed objects still won’t be possible with Mini LED. At least not with any Mini LED implementation that has so far been revealed. And that means Mini LED’s HDR performance will be compromised. As we’ll see, peak brightness won’t be a problem for Mini LED, but entirely eradicated artefacts like bright halos around dark objects won’t be possible either.",
    "Winner: OLED, by some distance",
    "OLED TVs aren’t that bright. The traditional response is that they don’t need to be, thanks to inherently excellent contrast. Since OLED can achieve essentially perfect black levels, the dynamic difference or contrast between light and dark pixels is dramatic.",
    "What’s more, 2021 is turning out to be the year that OLED brightness could truly step up. Both LG and Sony are promising OLED sets with increased brightness. Sony has shown off a new OLED panel apparently able to hit a retina-searing 1,300 nits, while LG is claiming 20 percent improvements over previous-generation panels. However, it’s thought that 1,300 nit figure may be misleading and only achievable for a very short time period over a small portion of the panel.",
    "Indeed, existing OLED panels typically achieve under 200 nits of full-panel sustained brightness while the brightest LED-backlit LCD TVs can sustain as much as 800 nits across the entire panel. Mini LED only promises to widen that gap. Until proven otherwise, this is an easy win for Mini LED. But remember that pure brightness isn’t the only metric that matters for HDR performance and contrast.",
    "Winner: Mini LED is brighter by far",
    "The very name Mini LED is something of a misnomer. Mini LED TVs are simply the latest flavour of LCD panel, just with a more advanced backlight. The basic approach of shining light through an array of liquid crystal cells remains and with it the same built-in limitations including the loss of colour control when viewing the panel off-axis.",
    "OLED panels are absolutely perfect when it comes to viewing angles. But as a self-emissive technology in which light is generated by the pixel itself, OLED does have clearly superior viewing angles to an LCD technology, including Mini LED.",
    "Winner: OLED, unambiguously",
    "There are two core issues here. One is the time delay, known as lag or latency, between the output of video data from a device (like a console, PC or set top box) and a viewable image on a given screen. The other is the time taken for pixels to respond to new image data and change state.",
    "The former is a factor of several issues, many of which are not directly related to panel type, including imaging processing and refresh rates. It’s somewhat circumstantial, but for now the very fastest screens in terms of latency are LCD panels, albeit typically gaming monitors rather than necessarily TVs.",
    "On the other hand, OLED technology has an inherent advantage when it comes to response. The because updating the image on an LCD panel involves the movement of crystals in response to an electrical charge. That process has been accelerated in recent years. But it still takes time.",
    "That makes the choice of Mini LED or OLED for gaming tricky. The best high refresh Mini LED screens will have lower latency, but OLED panels counter with superior pixel response.",
    "Winner: Draw, it depends on the metric",
    "OLED used to rule this category, but by improving the purity of the backlight, quantum dots have allowed LED TVs to surge forward in color accuracy, color brightness, and color volume, putting them on par with OLED TVs.",
    "Those looking for TVs with Wide Color Gamut or HDR will find both OLED and LED TV models that support these features. OLED’s better contrast ratio is going to give it a slight edge in terms of HDR when viewed in dark rooms, but HDR on a premium LED TV screen has an edge because it can produce well-saturated colors at extreme brightness levels that OLED can’t quite match.",
    "Winner: Draw",
    "Mini LED is a new technology, but only in the scale of its implementation. It’s the same LED tech as other LCD panels, just with smaller, more numerous LEDs. That means endurance and reliability shouldn’t be a concern.",
    "Not so for OLED. The ‘O’ in OLED, of course, stands for organic, which is where the problems start. Long story short, OLED panels are made up of tiny red, green and blue organic LEDs. Unfortunately, the blue LEDs degrade faster than the others. In time, that can shift the colour balance of individual pixels. That tends to happen faster where a persistent image is shown, like an operating system menu. The result can be ‘burn in’ where a ghostly shadow of the persistent image remains even when something completely different is being displayed.",
    "However, OLED burn in can be mitigated with various measures and isn’t really an issue for the latest OLED sets. But the fact remains that OLED tech is less robust than conventional non-organic LED backlights.",
    "Winner: Mini LED",
    "So far, OLED sets have clearly been the more expensive option. Which is why they haven’t extended their reach across the whole market and remain the premium option.",
    "However, the latest 8th gen OLED substrates due to go into TVs later this year are expected to be the cheapest yet. Meanwhile, Mini LED implementations are more complex and expensive than any previous LCD backlight tech. Some industry analysts think Mini LED panels are so complex to manufacture, they’re only 10% cheaper than existing OLED screens. Add in those cheaper 8th gen OLED panels and the result could be awfully close in terms of pricing.",
    "Winner: Draw, for now",
    "It’s early days for Mini LED. TCL has been quick out of the blocks with Mini LED sets, but upcoming implementations from the likes of LG and Samsung are expected to pack in significantly more lighting zones. It’s yet to be seen how many zones are required to reduce problems like halos and blooming to the point where they are no longer visible for most users.",
    "Likewise, we don’t know how much brighter or how much cheaper incoming 8th gen OLED panels will be. But on the balance of probabilities, OLED’s per-pixel nature will probably, ultimately give it the edge."
  ],
  "headers": {
    "3": "Mini LED vs OLED: per-pixel lighting",
    "8": "Mini LED vs OLED: brightness",
    "12": "Mini LED vs OLED: viewing angles",
    "15": "Mini LED vs OLED: speed and response",
    "20": "Mini LED vs OLED: color accuracy",
    "23": "Mini LED vs OLED: endurance and reliability",
    "27": "Mini LED vs OLED: price",
    "30": "Conclusion"
  },
  "links": {
    "Mini LED": "https://www.techradar.com/news/mini-led-wont-overtake-oled-tvs-heres-why/news/mini-led-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained"
  }
}