{
  "source": "https://www.techradar.com/news/intels-15th-gen-laptop-cpus-could-lead-to-powerful-yet-affordable-gaming-laptops",
  "title": "Intel’s 15th-gen laptop CPUs could lead to powerful yet affordable gaming laptops",
  "category": "computing",
  "updated": "2021-08-11T16:13:53Z",
  "author": "darren-allan",
  "summary": "Arrow Lake aiming for the bullseye with integrated graphics",
  "article": [
    "What could be Intel’s 15th-gen processors, potentially codenamed Arrow Lake, might just offer a vast leap in integrated graphics performance, if fresh leakage is on the money.",
    "Intel’s Arrow Lake could be the 15th-gen range of CPUs to follow 7nm Meteor Lake, or so this latest rumor predicts – and bear in mind that there’s some huge reaching into the future being done here, so a lot can change anyway, even if this is actually Intel’s current plan. (Lunar Lake, which we’ve already heard is believed to be coming after Meteor Lake in previous rumors, will actually follow Arrow Lake, according to these latest bits of spillage anyway).",
    "The theory is Arrow Lake chips will arrive in 2023, and on the desktop they might run with 8-cores at the top-end – just like next-gen Alder Lake – but with a jaw-dropping 32 small cores (low-power ones) backing that up (compared to a max loadout of 8 little cores for Alder Lake). Massive doses of salt here, but this rumor, which comes from YouTube hardware leaker AdoredTV, is not about the desktop chips, but purported mobile CPUs.",
    "Arrow Lake-P (meaning mobile processors for laptops) will supposedly be equipped with up to 6 full-power (normal) ‘Lion Cove’ cores and 8 low-power ‘Skymont’ ones, and certainly looks a good deal less compelling than what might be planned on the desktop at first glance (this is the same top dog configuration as Alder Lake mobile, going by leaks).",
    "However, the interesting bit about the rumor is the claim that Intel will push massively ahead with Arrow Lake’s integrated graphics capabilities on laptops, to the tune of loading up with 320 EUs (Execution Units) for the top GPU.",
    "To put that into perspective, the beefiest current Tiger Lake chip boasts 96 EUs, so Arrow Lake is taking that performance level and more than tripling it. Which sounds seriously impressive (and here – catch! – another bagful of salt).",
    "Given that Tiger Lake’s integrated graphics can already make a pretty decent job of laptop gaming, and handle some titles at 1080p just fine, if Arrow Lake really is trebling performance as suggested here, it should be clear enough that this generation of mobile chips will be able to cope with the demands of Full HD with ease. We could be looking at an integrated GPU that stands up to contemporary discrete mid-range offerings like the 6700 XT, maybe – but overall performance will, of course, depend on other factors like memory bandwidth.",
    "What this means is that laptops could be capable of some pretty great gaming chops just with an Arrow Lake CPU alone, and no need for adding a discrete GPU – and the demands of space, power usage and cooling the latter brings with it (not to mention the effect on the price tag of the portable).",
    "In short, we should eventually – perhaps in a few years – see more affordable yet truly capable gaming laptops running purely on an Intel chip and its integrated graphics. The main caveat being that this is looking way into the future, and as such it’s even more speculative than a normal rumor.",
    "Via PC Gamer"
  ],
  "headers": {
    "6": "Analysis: Exciting times for wallet-friendly gaming laptops"
  },
  "links": {
    "processors": "https://www.techradar.com/news/intel-cpu-sales-surge-fighting-amd-ryzen-dominance-but-will-it-last",
    "7nm Meteor Lake": "https://www.techradar.com/news/watch-out-amd-intels-finally-powering-towards-7nm-as-meteor-lake-cpu-design-comes-together",
    "Lunar Lake, which we’ve already heard": "https://www.techradar.com/news/intel-lunar-lake-spotted-again-but-rumored-14th-gen-cpus-may-not-arrive-for-ages",
    "AdoredTV": "https://www.youtube.com/watch?v=pmKSLILb5Cg",
    "Tiger Lake": "https://www.techradar.com/news/intel-tiger-lake",
    "laptop gaming": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "PC Gamer": "https://www.pcgamer.com/uk/intel-arrow-lake-p-rumour-mobile-processor-gpu/"
  }
}