{
  "source": "https://www.techradar.com/news/loki-episode-6-ending-explained",
  "title": "Loki episode 6 ending explained",
  "category": "entertainment",
  "updated": "2021-07-14T11:03:28.801Z",
  "author": "tom-power",
  "summary": "Spoilers for Loki episode 6 follow",
  "article": [
    "Spoilers follow for Loki episode 6.",
    "Loki episode 6 (aka For All Time, Always) has arrived on Disney Plus – and the MCU will never be the same again.",
    "The season 1 finale may only be 45 minutes long, but there's plenty to unpack from the last episode in Marvel's latest TV show.",
    "If you're confused about what's just happened, or need a bit of context added to episode 6's events, we're here to help. We'll take an in-depth look at Loki's season finale below, including new character introductions and how episode 6's climactic moments will impact Marvel's Phase 4 plans.",
    "It goes without saying, but there are huge spoilers for Loki episode 6 below. Make sure you've watched the series in its entirety before reading on, or proceed at your own risk.",
    "Finally, after weeks of speculation and a firm denial from actor Jonathan Majors about his involvement in the show, Kang the Conqueror is supposedly the individual responsible for the events throughout Marvel's Loki – or is he?",
    "After Loki (Tom Hiddleston) and Sylvie (Sophia Di Martino) reach the Citadel at the End of Time, and after they reject some tantalizing offers from Miss Minutes (Tara Strong) that would allow them to exist in their timelines again, the pair are greeted by an individual who will be familiar to Marvel comic fans.",
    "Viewers will immediately think that this character is Kang – except it isn't. Not exactly anyway.",
    "As Majors' character reveals to Loki and Sylvie, his character has gone by many names throughout history.",
    "In this instance, Majors is playing a character called He Who Remains, but this variant seems to be heavily inspired by another Kang variation in Marvel's comic history: Immortus.",
    "For those unfamiliar with this comics character, Immortus calls himself the 'Master of Time', which is a fitting title, as he has overseen the Sacred Timeline for millennia by the time Loki and Sylvie meet him.",
    "He Who Remains/Immortus and Kang are incarnations of an individual who goes by the name of Nathaniel Richards. Richards is the 31st century scientist, and another variant who was the first of his kind to travel throughout time, that He Who Remains mentions during his lengthy multiversal war chat with Loki and Sylvie.",
    "Much like Loki and potentially every other MCU character at this point (more on this later), there are numerous variants of Richards spread across the multiverse. Not all of them are good, however, and He Who Remains reveals that it was his variants that were the sole cause of the previous multiversal war.",
    "In a bid to end the chaos that ensued, He Who Remains (who is getting meta with his story at this point) encountered Alioth, the cloud monster from episode 5, and weaponized it to end the multiversal war.",
    "This restored peace to the multiverse and allowed He Who Remains to isolate a singular timeline, the Sacred Timeline, which we know as the MCU. To prevent similar wars occurring in the future, he also created the TVA to prune branching timelines and any variants with ambitions on causing permanent alternate timelines.",
    "Despite his earlier insistence that he knows everything that's about to happen, though, He Who Remains is lying: he only knows how events will play out up until a certain point.",
    "As soon as he reveal this piece of truth to Loki and Sylvie, branches begin to emerge on the sacred timeline – and another multiversal war looms large over the trio.",
    "Loki buys into He Who Remains' explanation, but Sylvie doesn't. She believes that He Who Remains is lying about everything and, fuelled by the rage and grief of being removed from her timeline decades earlier by Ravonna Renslayer (Gugu Mbatha Raw), Sylvie is only interested in killing him.",
    "Loki, though, believes He Who Remains. Loki tries to dissuade Sylvie from murdering He Who Remains as he's the only one who can stop another multiversal war from breaking out. It's the lesser of two evils in Loki's mind, even though He Who Remains' millennia-spanning plan will essentially end the concept of free will and prevent anyone (in any universe) from determining their own destiny.",
    "Unable to come to an agreement, the duo fight. Sylvie seemingly comes out on top and prepares to kill He Who Remains. In a last-ditch bid to stop her, Loki tries to reason with Sylvie's good side.",
    "Unsurprisingly (given the chemistry that's built up between them throughout the season), Loki and Sylvie kiss – but it's a ploy by Sylvie. Using He Who Remains' all-action temp pad, she sends Loki back to the TVA through a time door so he can't stop her from killing the man responsible for all of her pain.",
    "With no one to stop her, she kills He Who Remains – but it comes at a cost. His death means that there's nobody to stop the timeline branching off into different universes: a new multiversal war is about to begin.",
    "Back at the TVA, a dejected Loki tries to come to terms with Sylvie's betrayal. Realizing that Agent Mobius (Owen Wilson) and the TVA's workforce can still try and stop the multiversal war, though, Loki has a new glorious purpose and sets off to find his friend.",
    "Eventually, he meets up with Mobius and Hunter B-15 (Wunmi Mosaku), but nothing is as it seems. Loki tells the duo that he and Sylvie freed the timeline and that multiple variations of He Who Remains are coming to bring death and destruction to every universe.",
    "Mobius, though, doesn't know who Loki is. It appears that this Mobius and Hunter B-15 are variants of the characters, who exist in a different universe, to the ones that Loki had previously worked with. If that's the case, and they haven't had their minds wiped by the arrival of the multiverse, it seems that any MCU character can have multiple variants, which may impact future movies and TV shows.",
    "Shocked by Mobius and Hunter B-15's response, Loki realizes that he's in an alternate reality version of the TVA. Looking up, he sees a statue, but not of one of the so-called Time Keepers.",
    "It appears to be He Who Remains, but it's one of Nathaniel Richards's other variants: Kang the Conqueror, which is confirmed by this Marvel.com article.",
    "Yes. As He Who Remains and Loki said at different points in episode 6, there are multiple variants of Nathaniel Richards and some of them are downright evil.",
    "In the comics, Nathaniel Richards has seven main alter-egos. Of that septuplet, Kang is arguably the most dangerous because, as his name suggests, he conquers worlds (though he mainly tries to take over Earth) using advanced weaponry, his ability to time travel and his genius-level intellect.",
    "It's possible that we'll see other Nathaniel Richards variants across Marvel's Phase 4 slate of movies and TV shows, but Kang seems primed to be the next big bad of the MCU (or should that be Marvel Cinematic Multiverse now?).",
    "We already know that Majors will portray Kang in Ant-Man and the Wasp: Quantamania, which won't arrive until February 2023, so he'll be showing up in at least one other Marvel production.",
    "However, it's possible that Kang or another Richards variant will make cameo appearances in other projects.",
    "Upcoming animated TV series What If...? might be the first of those, although Majors isn't on the series' cast list, so this is a long shot.",
    "He may also crop up in Doctor Strange 2, given that this movie will explore the multiverse in more detail. Kang may be mentioned in passing in Spider-Man: No Way Home if Doctor Strange (who will cameo in the webslinger's third MCU solo outing) somehow knows that it's Kang/Richards/He Who Remains is behind all of this.",
    "Kang could turn up in the MCU version of Fantastic Four (Kang has ties to this group and their arch rival Doctor Doom), too, as well as Armor Wars if another Richards variant (Iron Lad) ends up being part of that cast.",
    "What does all of this point to? Loki episode 6's final moments have set up Kang as the possible primary antagonist for Phase 4 and maybe even beyond.",
    "As Loki head writer Michael Waldron told Marvel.com, Kang is \"probably going to be the next big cross-movie villain... because he is a time-traveling, multiversal adversary\", which certainly sets the stage for him being a Thanos-level threat in the years to come.",
    "Our prediction? Kang will want chaos to rein across the multiverse so he can conquer as many Earths as possible, and it'll be up the likes of Doctor Strange and others to stop him and restore peace to the multiverse.",
    "Time will tell, however, if they'll be successful or not."
  ],
  "headers": {
    "5": "Loki episode 6 ending explained: who is He Who Remains?",
    "17": "Loki episode 6 ending explained: the multiversal war begins",
    "22": "Loki episode 6 ending explained: something's wrong at the TVA",
    "27": "Loki episode 6 ending explained: will Kang the Conqueror be the next major MCU villain?"
  },
  "links": {
    "MCU": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "his involvement in the show": "https://variety.com/2021/film/podcasts/lovecraft-country-jonathan-majors-ant-man-3-mcu-creed-the-harder-they-fall-1234996903/",
    "Marvel.com": "https://www.marvel.com/articles/tv-shows/loki-he-who-remains-jonathan-majors",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know"
  }
}