{
  "source": "https://www.techradar.com/news/starfield-gets-a-november-2022-release-date-and-isnt-coming-to-ps5",
  "title": "Starfield gets a November 2022 release date, and isn't coming to PS5",
  "category": "gaming",
  "updated": "2021-06-13T17:30:58Z",
  "author": "samuel-tolbert",
  "summary": "The Starfield release date has been confirmed at E3 2021",
  "article": [
    "Starfield made an appearance during the Xbox and Bethesda games showcase at E3 2021, with a new trailer for the sprawling sci-fi RPG revealing a release date of November 11, 2022 - and confirming it will be an Xbox exclusive.",
    "The new trailer for Starfield leaked on the Washington Post ahead of the event, prematurely revealing the release date. But it wasn't long until we got a look at the official teaser trailer, which gave us a glimpse of Starfield's world.",
    "In the trailer we see an astronaut preparing their ship for takeoff, as a voice-over talks about how you're part of something called \"Constellation\" and suggesting that you've found something that is \"the key to unlocking everything\". You can take a look at the trailer below:",
    "But it's bad news for PS5 players, as Microsoft confirmed that Starfield is an Xbox exclusive, coming to Xbox Series X, Xbox Series S and PC, but not PS5. This is in line with earlier comments from Head of Xbox Phil Spencer, who said that future Bethesda titles will be exclusive to \"platforms where Game Pass exists\" but, until now, we hadn't had solid confirmation that Starfield won't land on PS5.",
    "Microsoft also revealed that Starfield is coming to Xbox Cloud Gaming and Xbox Game Pass at launch.",
    "We're hoping to hear about Starfield in the coming months but at least now we have a solid release date to look forward to."
  ],
  "headers": {
    "3": "Xbox exclusive"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Washington Post": "https://www.washingtonpost.com/video/sports/launcher/trailer-starfield/2021/06/13/6dc44dc4-fbc4-4073-b99e-88593e4127aa_video.html",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}