{
  "source": "https://www.techradar.com/news/xiaomis-four-new-cheap-phones-look-set-to-leave-the-moto-10-in-their-dust",
  "title": "Xiaomi has four new cheap phones, and one might be the best budget camera phone",
  "category": "phones",
  "updated": "2021-03-04T16:15:31Z",
  "author": "tom-bedford",
  "summary": "That's a lot of phones",
  "article": [
    "Xiaomi's premium line of smartphones has seen its time in the spotlight with the recent Mi 11 launch, and now its Redmi line of affordable handsets gets its time to shine, as the new Redmi Note 10 range has launched.",
    "There are four new smartphones in all - the Redmi Note 10, Note 10 Pro, Note 10S and Note 10 5G - though it's worth pointing out the former isn't coming to all regions, including the UK.",
    "We'll run you through three of the smartphones below (not the Note 10, since you can't buy it), so you can see how they compare, though we'll need to test out the phones to make a decisive verdict.",
    "We don't have the prices for these phones just yet, and we'll need them to fully rate their potential - these are Redmi devices though, and as such we're not expecting them to cost much at all.",
    "It's also worth pointing out that, just hours before the global Redmi Note 10 launch, an India-only event showed us three new Redmi Note 10 phones - and they're not exactly the same, which is horribly frustrating. The Indian Note 10 is the same as the global one, but the Note 10 Pro Plus in that region is the same as the Note 10 Pro elsewhere, and the Indian Note 10 Pro isn't coming out anywhere else. Thanks, Xiaomi.",
    "Judging by the specs, some of these phones could prove hot competition for the recently-launched Moto G10 and G30, two new phones from one of Redmi's biggest competitors, Motorola. The Redmi Note 10 Pro, though, looks like it could be a 'flagship-killer' of its very own, with a seriously impressive main camera, so let's start with that one.",
    "When it comes out, the Xiaomi Redmi Note 10 Pro will very likely be the most affordable smartphone with a 108MP main camera - that's right, a budget device has a super-high res sensor, that's previously mainly been seen on premium devices. It's joined by an 8MP ultra-wide, 5MP telemacro, 2MP depth-sensing and 16MP front-facing snapper.",
    "The phone has a 6.67-inch FHD+ AMOLED display with 120Hz refresh rate, which are more premium specs for the phone - it has a 'punch-hole' cut-out for the selfie camera in the top-middle of the display.",
    "There's a USB-C port and 3.5mm headphone jack on the phone, as well as a side-mounted fingerprint sensor. In pictures this feature looks pretty low on the side, but we'll have to test the phone to see if it's too low or just right.",
    "Powering this all is a 5,020mAh battery, which is on the big side for such a phone, and there's snappy 33W fast charging to power it back up quickly. Unlike with most cheap phones, a fast-charging block that reaches this speed is included in the box.",
    "In terms of specs, there's a Snapdragon 732G chipset which is a mid-range processor that supports only 4G connectivity. It comes paired with either 6GB or 8GB RAM, and 64GB or 128GB storage.",
    "Is this the low-end member of the Redmi Note 10 line? Uh - we couldn't quite tell you. In some ways it's better, and in other ways worse, than the Note 10 5G.",
    "The phone has a 6.43-inch FHD+ display, with a 60Hz refresh rate - like the Pro it has a 3.5mm headphone jack, USB-C port and side-mounted fingerprint sensor. It's the smallest device of the range, so it's likely to be the best for people who like a one-hand experience.",
    "There's no 108MP main camera here - it's instead 64MP, joined by an 8MP ultra-wide, 2MP depth-sensing and 2MP macro, with a 13MP selfie camera around the front.",
    "The chipset is a MediaTek Helio G95, a mid-range processor that performed fairly well when we tested it in the Realme 7, and it's joined by 6GB or 8GB RAM and 64GB or 128GB storage.",
    "Charging speed here is 33W, and the battery is 5,000mAh. Thanks to the smaller screen but similar battery size, the Note 10S may be able to outlast its Pro sibling in the battery life department - depending on how power efficient the MediaTek chip is.",
    "There's no points for guessing what the Redmi Note 10 5G's selling point is - it's the only member of the line-up to come with 5G compatibility, so if you want to connect to the next-gen data network, it's your only choice.",
    "This is thanks to the MediaTek Dimensity 700 chipset running the show, and that's paired with 4GB or 6GB RAM and 64GB or 128GB storage.",
    "One thing the Note 10 5G has over the Note 10S is its display - it's a larger 6.5-inch display with the same FHD+ resolution but a snappier 90Hz refresh rate, which should lead to motion looking smoother.",
    "Cameras? There's a 48MP main camera, a 2MP macro snapper, and a 2MP depth-sensor - no ultra-wides for you, buddy. There's also an 8MP front-facer.",
    "The battery, like for the Note 10S, is 5,000mAh, but it only supports 18W charging. Curiously, the box comes with a 22.5W charger. Judging by the specs, this is a rather low-end phone, and as such could take the title of the 'cheapest 5G phone'."
  ],
  "headers": {
    "6": "Xiaomi Redmi Note 10 Pro",
    "11": "Xiaomi Redmi Note 10S",
    "16": "Xiaomi Redmi Note 10 5G"
  },
  "links": {
    "Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Moto G10": "https://www.techradar.com/reviews/moto-g10-review",
    "Realme 7": "https://www.techradar.com/reviews/realme-7-review"
  }
}