{
  "source": "https://www.techradar.com/news/intel-alder-lake-leak-shows-a-laptop-cpu-which-outperforms-apple-m1-max",
  "title": "Intel Alder Lake leak shows a laptop CPU which outperforms Apple M1 Max",
  "category": "computing",
  "updated": "2021-10-25T10:01:39Z",
  "author": "darren-allan",
  "summary": "Intel Core i9-12900HK looks like a sterling performer",
  "article": [
    "Intel’s Alder Lake processors for laptops are expected to arrive in Q1 of 2022, following the launch of 12th-gen desktop chips which is purportedly imminent, but when these mobile CPUs debut, they could be great performers according to a fresh leak.",
    "In fact, going by screenshots of Geekbench results which were published by Wccftech, the Intel Core i9-12900HK mobility CPU outperforms Apple’s impressive new M1 Max SoC (as introduced with the new MacBook Pros), which is quite something to see. Although as with any pre-release leak, we should be very cautious about taking it for granted that this is an authentic benchmark.",
    "Giving the benefit of the doubt for now, the 12900HK hits 1,851 in Geekbench 5 single-core, compared to leaked results showing 1,785 for Apple’s M1 Max, and 1,616 for the current Intel 11980HK laptop processor. Therefore the 12900HK is purportedly almost 4% quicker than Apple’s SoC, and nearly 15% faster than its Tiger Lake predecessor.",
    "For multi-core, the 12900KH manages to rack up a score of 13,256, compared to 12,753 for the M1 Max, and 9,149 for the 11980HK. So, that’s another 4% victory over Apple, and a whopping 45% multi-core generational leap for Intel’s laptop silicon.",
    "Remember, that’s with both Intel chips having roughly the same power consumption, and it shows how much difference those small efficiency cores can seemingly make to multi-core results. The 12900KH is marked down as a 14-core CPU with 20-threads, so that must mean it has 6 performance cores (for 12-threads) and 8 efficiency cores (which have no hyper-threading).",
    "Oh, and to compare with AMD, Wccftech included the Ryzen 5980HX in the results, which recorded a score of 8,217, meaning the 12900KH was 61% faster for multi-core in this set of leaked results.",
    "These are seriously impressive results, hence the need for a bit more skepticism around this leak, we feel. But assuming it’s true, then beating out the M1 Max not just in single-core, but in multi-core as well, is quite an achievement for Intel.",
    "That said, Apple will still reign as the clear top dog when power-efficiency is brought into the equation, as you’d expect. As mentioned, this Alder Lake chip will presumably have a similar power envelope to the 11980HK, which is a 65W part, and when pushed will consume a fair bit more than that – compared to the M1 Max which is believed to be 30W going by Apple’s initial reveal (it’ll have more room to be pushed, though; don’t forget the ‘High Power Mode’ on the new MacBook Pro 16-inch).",
    "At any rate, while Apple is clearly going to have the best of Intel, and by quite a long way, when it comes to out-and-out power-efficiency, we shouldn’t underestimate the impact that Alder Lake will have for laptops powered by Intel’s mobile silicon. Those efficiency cores being on hand to run the show when idling, or when performing light tasks, should make a big difference to battery life compared to current notebooks with Tiger Lake engines.",
    "We’re looking at some potentially very exciting times ahead for laptops, then."
  ],
  "headers": {
    "6": "Analysis: Alder Lake looking good for laptops, but won’t come near Apple’s efficiency"
  },
  "links": {
    "Intel’s Alder Lake processors": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "purportedly imminent": "https://www.techradar.com/news/new-intel-alder-lake-rumor-suggests-cpu-launch-is-imminent",
    "Apple’s impressive new M1 Max SoC": "https://www.techradar.com/news/m1-pro-vs-m1-max",
    "new MacBook Pros": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Wccftech": "https://wccftech.com/intel-alder-lake-mobility-cpu-benchmarks-leaked-faster-than-the-apple-m1-max-smokes-amd-5980hx-11980hk/",
    "new MacBook Pro 16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "Tiger Lake": "https://www.techradar.com/news/intel-tiger-lake"
  }
}