{
  "source": "https://www.techradar.com/news/amazons-lord-of-the-rings-wont-air-anytime-soon-says-star",
  "title": "Amazon's Lord of the Rings won't air anytime soon, says star",
  "category": "entertainment",
  "updated": "2021-06-30T13:41:32Z",
  "author": "tom-power",
  "summary": "Don't expect Lord of the Rings season 1 to launch in the near future",
  "article": [
    "Amazon's Lord of the Rings is set to be the most expensive TV show of all-time.",
    "With season 1 of the live-action TV adaptation reportedly costing $465 million, it's unsurprising that Amazon (and the series' cast and crew) are taking their time with its production.",
    "Lord of the Rings fans are hoping that it won't be long until they're able to immerse themselves in the Amazon Prime Video show, but it sounds like the wait could be longer than we initially thought.",
    "Benjamin Walker, who was added to Lord of the Rings' cast in December 2020, has revealed that filming on season 1 is ongoing, which means that we won't be seeing the series air on Amazon Prime anytime soon.",
    "Walker was speaking to Collider as part of Netflix's The Ice Road press junket when he was asked, among many Lord of the Rings questions, about how much longer season 1's production would go on for.",
    "\"It is a bit nebulous at this point,\" Walker responded. \"We've been here a long time and they [Amazon] will let us go when they're done with us.\"",
    "It isn't shocking to hear that there's still plenty of filming left on season 1. The Covid-19 pandemic and on-set injuries to the stunt team delayed production for much of 2020 and, as we said, Amazon will want to get every aspect of its adaptation right, given the series' monetary outlay.",
    "This is purely speculation on our part, but it's also plausible that Amazon has decided to shoot seasons 1 and 2 back-to-back. This is something that Lord of the Rings fansite TheOneRing.net alleged in January 2021, too, so we aren't the only ones to ponder this possibility.",
    "We already know that Amazon renewed Lord of the Rings for a second instalment in November 2019 (per Deadline). Walker's Collider comments, coupled with those made by Morfydd Clark to Esquire (Clark is rumored to be playing a young Galadriel in the show), suggest that there's plenty of principal photography left to conduct.",
    "With Covid-19 continuing to play havoc with travel and quarantine restrictions, it might make sense for Amazon to keep its core Lord of the Rings cast in New Zealand and film seasons 1 and 2 simultaneously, just like The Lord of the Rings and The Hobbit movies were.",
    "If Amazon decided to take this approach – to reiterate, we're merely speculating here – it wouldn't come as a huge surprise. The show's talent is already together in a country that's not been hit as hard by Covid-19 as other nations. Letting them head home and return at a later date, to shoot season 2, may impact production if anyone needs to self-isolate or if New Zealand closes its borders to other countries again.",
    "It's likely that Walker's comments are simply referring to season 1. Given that Lord of the Rings live-action properties have previous for filming back-to-back, however, it's not out of the realms of possibility that seasons 1 and 2 are being shot at the same time."
  ],
  "headers": {
    "6": "Analysis: Is Amazon filming Lord of Rings seasons 1 and 2 back-to-back?"
  },
  "links": {
    "Amazon's Lord of the Rings": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "reportedly costing": "https://www.techradar.com/news/heres-why-amazon-prime-videos-lord-of-the-rings-series-cost-dollar465-million-to-make",
    "December 2020": "https://press.amazonstudios.com/us/en/press-release/amazon-studios-announces-additional-cast-memb",
    "Collider": "https://collider.com/lord-of-the-rings-amazon-series-benjamin-walker-interview/",
    "TheOneRing.net": "https://www.theonering.net/torwp/2021/01/12/110065-exclusive-official-show-synopsis-for-amazons-lord-of-the-rings-series/",
    "Deadline": "https://deadline.com/2019/11/the-lord-of-the-rings-series-renewed-season-2-amazon-early-renewal-season-1-hiatus-writers-room-reassembled-1202788730/",
    "Esquire": "https://www.esquire.com/uk/culture/a36001016/morfydd-clark-interview/"
  }
}