{
  "source": "https://www.techradar.com/news/intel-scraps-insurance-plans-for-cpu-overclockers-and-the-reason-might-surprise-you",
  "title": "Intel scraps insurance plans for CPU overclockers – and the reason might surprise you",
  "category": "computing",
  "updated": "2021-03-02T10:05:21Z",
  "author": "darren-allan",
  "summary": "PTPP plans simply weren’t popular…",
  "article": [
    "Intel has announced that it’s ditching the Performance Tuning Protection Plan program, a long-running scheme whereby the chip giant provided insurance for those overclocking its processors.",
    "The plan was offered with the firm’s latest Comet Lake CPUs at launch, but won’t be available for incoming Rocket Lake (or any other) chips, as Intel says demand for bolting on overclocking protection to the warranty has waned.",
    "Intel said: “As customers increasingly overclock with confidence, we are seeing lower demand for the Performance Tuning Protection Plans (PTPP). As a result, Intel will no longer offer new PTPP plans effective March 1, 2021.”",
    "The company then clarifies: “All existing plans will continue to be honored through the duration of the processor warranty period.”",
    "PTPP was available for ‘K’ model processors – in other words, the unlocked ones that can be overclocked – and lasted for the same length as the CPU warranty, meaning three years.",
    "In that period, if an insured chip was pushed too hard by the user and died, Intel would issue a replacement. Although only one replacement was allowed in an effort to stop the scheme from being abused (otherwise, potentially folks could keep killing chips until they got a silicon lottery winning CPU).",
    "All in all, this development is somewhat surprising, as it wasn’t expensive to pick up the insurance – it was $20 for a standard desktop CPU, $30 for an HEDT model – so we would have thought the scheme would’ve been more popular than Intel indicates, what with lack of demand leading to the demise of PTPP.",
    "At any rate, going forward there will be no overclocking insurance with Intel’s new chips. Speaking of which, Rocket Lake processors are set to land at some point this month – the latest rumor we’ve heard is that pre-orders might kick off mid-March ahead of an on-sale date of March 30.",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "4": "One-shot replacement"
  },
  "links": {
    "overclocking its processors": "https://www.techradar.com/news/overclockers-push-intel-rocket-lake-s-processor-to-69ghz",
    "The plan was offered": "https://www.techradar.com/news/intel-core-i9-10900k-cpu-might-be-pricey-but-at-least-you-can-insure-it-for-overclocking",
    "Comet Lake": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "said": "https://tuningplan.intel.com/",
    "pre-orders might kick off mid-March": "https://www.techradar.com/news/intel-rocket-lake-cpu-pre-orders-could-go-live-early-to-make-the-most-of-amd-ryzen-stock-woes",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/intel-kills-off-performance-tuning-protection-plan-overclock-warranty"
  }
}