{
  "source": "https://www.techradar.com/news/cloud-gaming-on-apple-arcade-may-never-happen-but-why-compete-with-xbox-anyway",
  "title": "Apple Arcade shouldn't get cloud gaming anytime soon – but is it because of Stadia?",
  "category": "gaming",
  "updated": "2021-10-20T16:19:04Z",
  "author": "henry-st-leger",
  "summary": "Apple Arcade comes down to Earth",
  "article": [
    "Apple reportedly considered a cloud gaming component or counterpart to Apple Arcade, with one technology analyst claiming the idea was raised – and then mooted – by the tech giant in the recent past.",
    "According to Mark Gurman (in his Power On newsletter), Apple \"in the past has internally discussed the prospects of launching such a service\" (via Bloomberg).",
    "It's a fascinating admission, if one that shouldn't come as a huge surprise. Apple has no doubt considered many things that never made it to market, and is permanently toying with and researching new avenues for both its hardware ranges and its software services.",
    "But cloud gaming in particular has been a huge topic for gaming providers for much of the past decade, and we've seen many failed, floundering, or under-appreciated attempts for cloud gaming in the past – often due to average internet speeds simply not being ready to make such a service a mass success.",
    "We were reviewing OnLive services a full decade ago, and it's astonishing that there's still no player in the market that's fully found a foothold in the gaming public.",
    "Google Stadia launched to much hype just a couple of years ago, and has since become a quiet proposition – not quite shut down, but with reduced efforts from Google showing a hesitancy around investing in it much harder.",
    "It may well be the splashy arrival of Stadia, or the gaming public's perceived indifference to the service, that caused Apple to stay its hand. After all, Stadia launched just a month or so after Apple Arcade back in 2019, adding another well-funded player to the cloud gaming market.",
    "Xbox Cloud Gaming, too – the rebranded Project xCloud teased for so long – is now being tested by Xbox Insiders, and looks set to roll out to everyday Xbox gamers soon. It's this service that seems to have the most potential for gamers, being bundled in with existing Xbox Game Pass Ultimate subscriptions, and allowing a multitude of different devices to stream Xbox games.",
    "Stadia's insistence on making you pay a subscription fee, and buy a new game at a full-price RRP, has likely hindered the service's growth – whereas those subscribing to the Xbox service are getting a much more fleshed-out package deal, gaining the ability to stream games on the go, or play away from their Xbox, but likely for games they've separately bought through their console already. In this sense, Xbox Cloud Gaming simply adds flexibility, rather than offering a whole new payment portal for modern players.",
    "Even before Xbox Cloud Gaming rolls out in earnest, in its final form, there's no denying the added value this gives countless Xbox gamers – and Apple, like Google, would be starting much more from scratch, without the ecosystem to make as attractive an offering. So why bother fighting a losing battle, in a market full of failed attempts at that very thing?",
    "With Apple Arcade having quietly ballooned in size since its launch, we wouldn't rule out a cloud gaming expansion in the future – but for now, we expect Apple will want to see how Microsoft's fortunes play out before going all in on such an uncertain venture."
  ],
  "headers": {
    "6": "Serious competition to consider"
  },
  "links": {
    "Apple Arcade": "https://www.techradar.com/reviews/apple-arcade",
    "Bloomberg": "https://www.bloomberg.com/news/newsletters/2021-10-17/when-will-new-apple-aapl-macbook-pro-launch-as-soon-as-monday-kuvjbbne",
    "a full decade ago": "https://www.techradar.com/reviews/gaming/games-consoles/onlive-1030468/review/2",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "is now being tested by Xbox Insiders": "https://www.techradar.com/news/xbox-cloud-gaming-is-now-available-for-xbox-insiders-to-test",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play"
  }
}