{
  "source": "https://www.techradar.com/news/the-biggest-lego-set-ever-made-is-this-gigantic-world-map",
  "title": "The biggest Lego set ever made is this gigantic world map",
  "category": "appliances",
  "updated": "2021-05-25T11:12:51Z",
  "author": "rhys-wood",
  "summary": "Are you up to the challenge?",
  "article": [
    "Lego is set to release the Lego Art World Map, an enormous and fully buildable world map that, at a whopping 11,695 individual elements, will be the biggest set the company has ever produced.",
    "The Lego Art World Map final build measures 25.5 inches (65cm) high and 40.5 inches (104cm) wide. And if you’re worried about where on earth (no pun intended) you’ll have to painstakingly place each piece, don’t be. Lego seems to be eschewing the strict jigsaw puzzle route for a more customizable map building experience.",
    "The Lego Art World Map will be available on Lego’s online store and in its high street shops from June 1, 2021, and will cost £249.99 (around $350 / AU$450). It will also be made available globally on August 1, 2021, so buyers outside of the UK won’t have to wait that much longer.",
    "It’s worth noting that the Lego Art World Map is aimed at customers over the age of 18, so it’s definitely a project to be undertaken by more experienced builders. Perhaps people looking to brighten up their living rooms or office spaces with some tactile Lego flair.",
    "As mentioned, the Lego Art World Map appears to be more than a simple jigsaw puzzle. The set also includes templates for three map variants, as well as a custom build option to tailor the map to your liking, such as to highlight your favorite travel destinations. Hanging elements are also included, allowing builders to place the map on their wall upon completion.",
    "Strangely, but welcomely, a soundtrack is also included in the box. This soundtrack is intended for immersive purposes, and features a variety of travel stories from world-famous globetrotters like Syazwani Baumgartner and Once Upon a Saga founder Torbjørn C. Pedersen."
  ],
  "headers": {
    "3": "Everything is awesome"
  },
  "links": {
    "Lego’s online store": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-5282369189845271000&murl=https%3A%2F%2Fwww.lego.com%2Fen-gb"
  }
}