{
  "source": "https://www.techradar.com/news/whatsapp-beta-reveals-more-about-end-to-end-encrypted-backups",
  "title": "WhatsApp beta reveals more about end-to-end encrypted backups",
  "category": "phones",
  "updated": "2021-05-12T11:56:19Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Password-protected message backups are on the horizon",
  "article": [
    "The latest beta version of WhatsApp for Android has given us another interesting glimpse into the future of the app. The most recent release shows that developments is continuing on an important feature that we have known was in the works for a little while now.",
    "The ability to securely back up messages as well as the media files attached to them is something that will eventually be available to all WhatsApp users. For now, work is underway to finalize the feature that will make it possible to backup to Google Drive using end-to-end encryption.",
    "The use of end-to-end encryption for backups is important for WhatsApp users who have become used to the security and peace of mind the app offers with end-to-end encrypted messaging. Being tied to Google Drive makes a great deal of sense for Android user due to being linked to a Google account which includes 25GB of cloud storage for free.",
    "Taking into account the fact that most people backing up in this way will want to take advantage of the end-to-end encryption, an update to the backup user interface now makes it very clear when this security feature is enabled. For anyone with concerns about their sensitive messages, this makes it easy to check that encryption is in place without having to dig too deeply into settings.",
    "When the feature eventually sees the light of day – and it is difficult to say just when this might be, as testing new options can be a lengthy process – it will make life much easier for people moving between devices as it will be much easier to restore messages on a new phone, maintaining the security and privacy of communication",
    "While signs of the continuing development of end-to-end encrypted backups can be seen in the latest Android app beta, it is not yet functional. Check out the WhatsApp Beta program if you'd like to keep a closer eye on how things are developing, and perhaps get involved with testing.",
    "Via WABetaInfo"
  ],
  "headers": {
    "4": "Safe and sound"
  },
  "links": {
    "Android": "https://www.techradar.com/best/best-android-phones",
    "Check out the WhatsApp Beta program": "https://play.google.com/apps/testing/com.whatsapp",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-10-9-whats-new/"
  }
}