{
  "source": "https://www.techradar.com/news/microsofts-latest-acquisition-wants-to-help-your-company-hit-all-its-goals",
  "title": "Microsoft's latest acquisition wants to help your company hit all its goals",
  "category": "computing",
  "updated": "2021-10-08T12:23:19Z",
  "author": "sead-fadilpasic",
  "summary": "Software giant welcomes Ally.io into its ranks",
  "article": [
    "Microsoft has acquired objectives and key results (OKR) solutions provider Ally.io,.",
    "The company confirmed the acquisition in a blog post, saying it expects the deal to “improve employee experience by aligning people’s work with team goals and company mission.”",
    "Once the formalities are out of the way, Ally.io will join Microsoft Viva, the company’s “employee experience platform,” whose goal is to bring together data, comms, learning and resources. It is powered by Microsoft 365, the company’s cloud-based collaboration suite, and is integrated in Microsoft Teams. It currently has four modules, Connections, Insights, Topics and Learning.",
    "As an OKR platform, Ally.io works to give everyone within an organization visibility and clarity into their entire work process, tying day-to-day work with the firm’s overall strategic objectives.",
    "It launched in 2018 and has, according to Microsoft’s announcement, been adopted by more than 1,000 “leading high-tech, manufacturing, financial services and healthcare businesses” in more than 80 countries around the world.",
    "Over the next year, Microsoft will invest further to bring Ally.io into the Microsoft cloud, Microsoft Teams, and weave it into Viva, Office, Power BI and the broader set of Microsoft 365 apps and services.",
    "“We are deeply committed to a smooth transition for all customers as we bring Ally.io into the Microsoft cloud,” Kirk Koenigsbauer, COO and Corporate VP for Experiences and Devices said in the blog post.",
    "For Microsoft, the acquisition means further reinforcement of the idea of helping businesses adapt to the new normal and the realities of remote working. Combined with Microsoft Viva, Ally will “enrich how individuals and teams come together to align and achieve better business outcomes.”",
    "The financial details of the deal were not disclosed, but Ally.io has raised a total of $76 million in two funding rounds so far."
  ],
  "headers": {
    "5": "Helping businesses adapt to remote work"
  },
  "links": {
    "Microsoft Viva": "https://www.techradar.com/news/microsoft-viva-wants-to-shake-up-the-future-of-remote-work-for-good",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives"
  }
}