{
  "source": "https://www.techradar.com/news/intels-gaming-graphics-card-could-be-built-by-tsmc-and-sounds-like-a-threat-to-nvidia-and-amd",
  "title": "Intel’s gaming graphics card could be built by TSMC, and sounds like a threat to Nvidia and AMD",
  "category": "computing",
  "updated": "2021-01-13T10:48:05Z",
  "author": "darren-allan",
  "summary": "Will purportedly be built using an enhanced 7nm process which sounds promising",
  "article": [
    "Intel’s high-performance gaming graphics card, known as DG2, will reportedly be made by TSMC – a possibility that has been rumored before, although this fresh piece of speculation adds some interesting details to the picture.",
    "The Reuters report contends that Intel will outsource production of DG2 to TSMC which will use an enhanced 7nm process for the card. Intel has already said it won’t make the GPU itself, but hasn’t yet clarified which third-party fab it’ll turn to.",
    "Previous word from the grapevine suggested that a 6nm process might be employed by TSMC, but either way, the end result sounds like it could be promising. The sources Reuters spoke to observed that this enhanced 7nm process is expected to be more advanced than Samsung’s 8nm process, which is what Nvidia’s latest RTX 3000 graphics cards are based on (and for that matter, it’ll be more advanced than AMD’s RX 6000 cards which are built on 7nm at TSMC, of course).",
    "That sounds promising in terms of how competitive Intel’s high-end GPU might be, but we’d obviously take all this with a huge pinch of salt, and there is a great deal more to the capabilities of a graphics card than simply what process it’s built on.",
    "The report further claims that DG2, also known as Intel’s Xe-HPG (high-performance gaming) GPU, will be going up against Nvidia and AMD graphics cards in the $400 to $600 price bracket. So that would seem to indicate an asking price of around $500 or so.",
    "Early rumors floated the prospect that DG2 will be pitched at about the same performance level as Nvidia’s RTX 3070, and indeed that’s a graphics card with a retail price of $499. The pieces of the rumor puzzle fit together here, then, but as ever, exercise plenty of caution (and let’s face it, this is a pretty fair bet for an educated guess anyway).",
    "In terms of the release date, what we’ve heard previously indicates that Intel will be getting this graphics card out later in 2021, and the Reuters report also mentions this, but further indicates that the timeframe could also be early 2022. Of course, that’s entirely possible, and even if the intention is to get DG2 out later this year, Intel’s plans may slip for one reason or another.",
    "Certainly the chip giant needs to take time to get things right, because it’s a pretty big ask to try to muscle into the GPU market when Nvidia and AMD are such strongly established players with their respective long-term fanbases.",
    "If you’re wondering where DG1 is, by the way, that’s Intel’s Iris Xe Max discrete graphics card for laptops which is already out."
  ],
  "headers": {
    "4": "Pricing prospects"
  },
  "links": {
    "rumored before": "https://www.techradar.com/news/intel-xe-hpg-gaming-graphics-card-could-beat-nvidia-and-amds-best-in-one-key-area",
    "Reuters": "https://www.reuters.com/article/intel-tsmc/intel-graphics-chip-will-tap-new-version-of-tsmc-7-nanometer-process-sources-idUSL1N2JJ2Y4",
    "6nm process might be employed": "https://www.techradar.com/news/intel-xe-hpg-gaming-graphics-card-could-beat-nvidia-and-amds-best-in-one-key-area",
    "AMD’s RX 6000": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "Xe": "https://www.techradar.com/news/intel-xe-graphics-cards",
    "Early rumors floated the prospect": "https://www.techradar.com/news/intels-high-end-gaming-gpu-sparks-into-life-and-its-rumored-to-challenge-nvidias-rtx-3070",
    "Nvidia’s RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "what we’ve heard previously": "https://www.techradar.com/news/intel-xe-graphics-card-for-gamers-could-arrive-in-2021-with-ray-tracing-and-gddr6-memory",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471"
  }
}