{
  "source": "https://www.techradar.com/news/the-new-scream-movie-looks-like-a-smart-home-nightmare",
  "title": "The new Scream movie looks like a smart home nightmare",
  "category": "entertainment",
  "updated": "2021-10-12T14:38:37Z",
  "author": "henry-st-leger",
  "summary": "The Scream trailer brings the thrills with... smart locks?",
  "article": [
    "The new Scream movie is set to bring the famed horror franchise kicking and screaming into the digital age, with a trailer that has more than a touch of technology tied into its thrills.",
    "A trailer has now dropped for the incoming Scream movie, which acts as a sequel – the fifth in the long-running series – featuring a number of cast members from the original 1996 slasher film, including Courtney Cox (Friends) and Neve Campbell (Scream's original lead).",
    "What's most fascinating about the trailer, though, is that it ties some smart home considerations into its terror, as you can see below.",
    "As a young woman stands with her phone in the kitchen – a familiar sight for anyone who saw the original film – she finds herself attempting to relock the smart locks on her front door as they continually open and shut at the command of someone else.",
    "We can see this becoming a strong theme, with people increasingly reliant on safety systems that then become their downfall – or the need to look down into a smartphone screen being the perfect moment for some jump scares, or surprises, when looking up again.",
    "It's a short trailer, but this short snippet by itself points to how Scream has been updated for more modern audiences. Given how new smart locks are to most people's lives – if indeed, someone has them at all – it's a brilliant thing to tap into. For something designed for security, what if that very security is out of your hands – and what happens when someone has more control over your home than you do?",
    "It's been hard to replicate the cultural impact of the original Scream movie, especially because of how knowing the film was – with its characters referring to the tropes of slasher movies as they attempt to navigate the plot they find themselves embroiled in.",
    "A smart look at what makes someone feel safe, and unsafe, in a world of connected devices, could be the thing to make the series feel fresh again, even if it's just for passing moments of tension like these.",
    "An understanding of a Nest Video Doorbell won't save a poor script, or a film stuck in the cliches the series was once so adept at satirising, of course. But we hope the new Scream movie is able to look forward, instead of just looking back.",
    "With Scream 5 – or just 'Scream', as it's officially known – set to land on January 14, 2022, we won't have to wait too much longer."
  ],
  "headers": {
    "6": "Taking it home"
  },
  "links": {
    "smart locks": "https://www.techradar.com/news/best-smart-locks"
  }
}