{
  "source": "https://www.techradar.com/news/westworld-season-4-looks-like-its-finally-filming",
  "title": "Westworld season 4 looks like it's finally filming",
  "category": "entertainment",
  "updated": "2021-06-16T16:41:13Z",
  "author": "axel-metz",
  "summary": "Prepare for more headaches",
  "article": [
    "It’s been just over a year since Westworld’s third season left us scratching our heads all over again, and we’ve now had our first inkling that production on season 4 is officially underway.",
    "Via an Instagram post, series mainstay Jeffrey Wright (aka Bernard) uploaded a photo of his character’s name attached to what we presume is a set chair, suggesting filming on new episodes has now begun.",
    "He accompanied the post with the caption, “Good morning… old friend” – a less-than-cryptic reference to Bernard’s relationship with Anthony Hopkins’ character, Dr. Robert Ford.",
    "Jonathan Nolan and Lisa Joy’s cerebral sci-fi series premiered back in 2016, and has so far stuck to a bi-annual release schedule. Season 2 arrived in 2018, while the show’s third season landed in April last year.",
    "It follows, then, that production on Westworld season 4 is underway in anticipation of a 2022 release – provided Covid-19 restrictions don’t hinder filming, that is.",
    "Unfortunately, Wright’s tease offers little more than confirmation that season 4 is still going ahead. The last time we saw Bernard, he was returning from ‘The Valley Beyond’ – the virtual world Ford created for Hosts to live freely away from humans – though we were left unsure as to how long he’d spent there.",
    "Of course, that’s only one thread in a myriad of loose and complex ends to be tied up by Westworld’s return. Season 3’s finale saw the redemption – but ultimate demise – of Evan Rachel Wood’s Dolores, while Aaron Paul’s Caleb Nichols destroyed Rehoboam (a malicious quantum computer system à la Skynet) to allow humanity to operate on its own terms.",
    "William (aka The Man in Black) also met his end (we think?) after returning to Delos' headquarters and finding himself face-to-face with a replica host, while the fate of Tessa Thompson’s Charlotte is anyone’s guess.",
    "Season 3’s conclusion was all about the end of one world and the beginning of another, basically, so there’s every chance season 4 will take the series to entirely new places. We've made a few predictions of our own here.",
    "Although Westworld began life with a bang, critical reception has steadily – though perhaps unfairly – waned since the premiere of the show’s second season.",
    "Overnight viewing figures have decreased with each new outing, and Westworld’s convoluted (and at times headache-inducing) plot has borne the brunt of criticism. Though it's possible the rise of streaming has offset that, with people able to stream the show on HBO Max.",
    "There’s no question that the series remains a benchmark for TV production value and a showcase of some triple-A acting talent, but season 4 faces the challenge of figuring out what a dystopian future looks like after a massive status quo change – that's far from where Westworld started five years ago.",
    "As for what we know about the Hosts’ next adventure, details are few and far between. We do know Wood won’t be returning as Dolores, and that Aurora Perrineau (Prodigal Son) has been added to the cast in a major role.",
    "Given the impermanent nature of the show’s deaths, though, there’s no telling who will and won’t make an appearance in Westworld’s upcoming season.",
    "Via Collider"
  ],
  "headers": {
    "9": "In layman's terms"
  },
  "links": {
    "Westworld": "https://www.techradar.com/news/how-to-watch-westworld-online-stream-season-3-from-anywhere",
    "Instagram post": "https://www.instagram.com/p/CQGjae8p7JD/",
    "Westworld season 4": "https://www.techradar.com/news/westworld-season-4",
    "here": "https://www.techradar.com/news/westworld-season-4",
    "Collider": "https://collider.com/westworld-season-4-filming-jeffrey-wright-set-photo/"
  }
}