{
  "source": "https://www.techradar.com/news/the-batman-star-drops-huge-tease-over-possible-sequel-plans",
  "title": "The Batman star drops huge tease over possible sequel plans",
  "category": "entertainment",
  "updated": "2021-03-16T15:43:02Z",
  "author": "tom-power",
  "summary": "What are you trying to tell us, Commissioner Gordon?",
  "article": [
    "The Batman, Matt Reeves' upcoming take on the Caped Crusader, may well be getting a sequel or two. That's according to star Jeffrey Wright, who recently took to Twitter to tease such a possibility after production finally wrapped on the Robert Pattinson-led flick.",
    "Wright tweeted after filming had ended on the Dark Knight's latest incarnation, and seemingly hinted that he would reprise his role as Batman's closest ally in the future.",
    "You can check out Wright's tweet below:",
    "Wright's tease came in the wake of Reeves revealing that The Batman had wrapped production with his own tweet on March 13. The director simply tweeted out \"#LastDay #TheBatman\" in his message alongside an image of the final film slate used on set.",
    "Check our Reeves' tweet below:",
    "No. The Batman is a soft reboot of the character and has no ties to any other film adaptation, but it did at one point. Back in March 2016, a report from The Wrap revealed that Warner Bros. was pressing ahead with a Batman movie that Ben Affleck would write, direct and star in. However, by February 2017, Reeves had taken over directorial duties and Affleck's vision for his movie was reportedly sidelined later that year.",
    "According to The Hollywood Reporter, Reeves had wanted to retain Affleck's services but, after a script rewrite, the director opted for a younger actor (h/t The Hollywood Reporter) to fill the role. Affleck confirmed his departure from the project in January 2019 (h/t Deadline) and, in May of that year, Pattinson was confirmed - per Variety - as the new Caped Crusader.",
    "An original crime noir film - but not an origin story - that places Batman's detective skills front and center, The Batman will focus on a younger version of the character. The movie will draw heavily from Mike Barr's 1987 Detective Comics storyline and Batman: Ego, a 2000 comic arc from Darwyn Cooke and Jon Babcock, which has also inspired the movie's plot and themes.",
    "Set in the second year of Bruce Wayne's career as the masked vigilante, The Batman sees the Dark Knight explore the corruption that plagues Gotham City while also coming into contact with the serial killer known as The Riddler. Alongside Pattinson and Wright, The Batman stars the likes of Zoë Kravitz (Selina Kyle/Catwoman), Paul Dano (Edward Nashton/Riddler), Colin Farrell (Oswald Cobblepot/Penguin), and Andy Serkis as Bruce's faithful butler Alfred.",
    "The Batman is set for release on March 4, 2022."
  ],
  "headers": {
    "5": "The Batman: Is it a continuation of other Dark Knight movies?"
  },
  "links": {
    "The Wrap": "https://www.thewrap.com/ben-affleck-to-direct-solo-batman-movie-for-warner-bros/",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/heat-vision/ben-afflecks-batman-future-doubt-as-warner-bros-plots-franchise-future-1023296",
    "Hollywood Reporter": "https://www.hollywoodreporter.com/heat-vision/how-robert-pattinson-became-batman-1215438",
    "Deadline": "https://deadline.com/2019/01/the-batman-june-2021-release-date-ben-affleck-not-starring-1202545821/",
    "Variety": "https://variety.com/2019/film/news/robert-pattinson-batman-1203230054/"
  }
}