{
  "source": "https://www.techradar.com/news/wireless-earbuds-deal-save-on-panasonics-excellent-airpods-pro-rivals",
  "title": "Wireless earbuds deal: save on Panasonic's excellent AirPods Pro rivals",
  "category": "audio-visual",
  "updated": "2021-04-26T08:34:38Z",
  "author": "olivia-tambini",
  "summary": "Panasonic's wireless earbuds get a big discount",
  "article": [
    "If you need some new wireless earbuds and don't want to splurge on the Apple AirPods Pro, these brilliant deals on the Panasonic RZ-S500W could be right up your street.",
    "In the US, Amazon has reduced the earbuds from $179.99 to $99.95, saving you just over $80.",
    "Meanwhile, UK buyers can get the earbuds for just £99.99, a huge £50 saving compared to their original £149.99 RRP. (Not in the US/UK? Scroll down for the best prices in your region.)",
    "The Panasonic RZ-S500W true wireless earbuds come with active noise cancellation to rival the AirPods Pro – and they’re considerably cheaper, making them a great alternative for anyone on a strict budget.",
    "With an understated design, the RZ-S500W look subtly stylish and come with a choice of five differently-sized silicone eartips that makes it easy to find a snug and comfortable fit. They’re also suitable for working out, thanks to an IPX4 waterproof rating, though the lack of earfins means we’d be hesitant to take them out on a vigorous run in case they fell out.",
    "Sound quality isn’t quite on the same level as their rivals, with an overly bassy presentation – bass heads however, will probably love these earbuds.",
    "They come with a USB-C charging case, which gives you 20 hours of juice, on top of the 6 hours contained within the buds themselves – that’s better than the Apple AirPods Pro, and more than enough to get you through a week’s worth of commuting.",
    "Not in the US or UK? Check out the best Panasonic earbuds deals we've spotted below."
  ],
  "headers": {
    "3": "Today's best wireless earbuds deals"
  },
  "links": {
    "from $179.99 to $99.95": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0863RPRRK%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8156339736035040000-20",
    "£99.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FPanasonic-RZ-S500WE-K-Wireless-Cancelling-Resistance-Black%2Fdp%2FB088C43RGZ%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1097576205658178800-21",
    "Panasonic RZ-S500W": "https://www.techradar.com/reviews/panasonic-rz-s500w",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review"
  }
}