{
  "source": "https://www.techradar.com/news/micro-focus-wants-to-help-businesses-modernize-cobol-apps",
  "title": "Micro Focus wants to help businesses modernize COBOL apps",
  "category": "computing",
  "updated": "2021-09-14T14:27:02Z",
  "author": "mayank-sharma",
  "summary": "You can now code in COBOL using Visual Studio Code",
  "article": [
    "COBOL specialist Micro Focus has released the next iteration of their COBOL development and integration tools, Visual COBOL 7.0 and Enterprise Suite 7.0.",
    "Devised in 1959, COBOL with over 220 billion lines of code still in use today, is one of the oldest programming languages that’s still powering a good part of the world’s banking, business and governmental systems.",
    "The latest releases equip COBOL users to modernize their business-critical applications running on the mainframe or distributed environments.",
    "“This latest release reinforces our commitment to our customers by delivering proven, robust solutions that protect their investments and enables them to meet the changing business expectations while taking advantage of new environments and infrastructures,” said Neil Fowler, General Manager of Application Modernization and Connectivity at Micro Focus.",
    "The release features the newest updates with a view to give developers new ways to work with legacy enterprise applications.",
    "According to Micro Focus it focused on three aspects in particular in this release. Enabling developers to use Visual Studio Code for COBOL development helps them take advantage of the latest programming conveniences to manage their legacy code.",
    "Similarly, the integration with Micro Focus Fortify gives developers the ability to scan their COBOL code for vulnerabilities across both Micro Focus COBOL and mainframe-based applications. Finally, the release also helps improve the cloud compatibility of the mainframe COBOL apps.",
    "“Scalability and serviceability allows applications and data to scale out elastically on lower cost commodity cloud infrastructure but retain the same or better level reliability and continuous operations seen on the mainframe,” asserts Micro Focus."
  ],
  "headers": {
    "4": "Application modernization"
  },
  "links": {
    "COBOL": "https://www.techradar.com/best/cobol-online-courses",
    "Devised in 1959": "https://www.techradar.com/news/the-programming-language-that-doesnt-want-to-die",
    "Visual Studio Code": "https://www.techradar.com/reviews/microsoft-vs-code",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}