{
  "source": "https://www.techradar.com/news/call-of-duty-warzone-season-3",
  "title": "Call of Duty: Warzone Season 3 – everything we know so far",
  "category": "gaming",
  "updated": "2021-07-30T09:24:32Z",
  "author": "samuel-tolbert",
  "summary": "This massive ongoing free-to-play title is coming back for another season.",
  "article": [
    "Call of Duty: Warzone updates continue to expand the free-to-play battle royale game, with the game transitioning to include content like operators and guns from Call of Duty: Black Ops Cold War over the last couple of months.",
    "Now, the story continues as the hunt for Perseus is on. Season 3 is here and it's bringing tons of new content from skins, weapons, operators and maps to story details. Here's everything you need to know about Call of Duty: Warzone Season 3.",
    "Using the current season's Battle Pass expiration date, we were safely able to guess that Season 3 is going to begin on April 22, 2021. That date has now been confirmed by Activision, so get your squad ready: April 22 is the day you can begin on the new Battle Pass.",
    "The developers at Raven Software are also continuing to issue massive waves of bans against any players confirmed to be hacking or otherwise cheating in the game. This number continues to climb, with over 13,000 accounts banned on March 23 alone and over 500,000 accounts banned in total.",
    "Season 3 sees three completely new Operators added to the fray, as well as an \"old friend\" made new again. The three completely new Operators are Wraith, Knight and Antonov, all members of the Warsaw Pact. Meanwhile, a new version of the iconic Captain Price is also being added.",
    "Separate from the Modern Warfare 2019 version of Price, this new mustachioed Operator is free to anyone who has bought Call of Duty: Black Ops Cold War.",
    "Wraith is an \"ex-Norwegian Intelligence Services alpine warfare specialist-turned-Perseus-agent\" available at Tier 0 in the Season 3 Battle Pass, with a Legendary Skin at Tier 100. Knight and Antonov will be available with various bundles throughout Season 3.",
    "Six weapons are being thrown into the fray for Season 3.",
    "The PPSH-41 is available at Tier 15 of the Battle Pass. The Swiss K31 Sniper Rifle has been added for everyone. The Ballistic Knife is now in Black Ops Cold War and is coming to Warzone around the midpoint of the season. The CARV.2 Tactical Rifle is here for everyone, while the Baseball Bat and AMP63 Pistol are also coming sometime during the season.",
    "There's no new big Warzone map this season. There are however four new maps for Call of Duty: Black Ops Cold War players to enjoy in standard multiplayer.",
    "The maps include: Yamantau, Diesel, Standoff and Duga. Yamantau and Diesel are in at the beginning of the season, while Standoff and Duga will be added later on as the season continues.",
    "Things are surprisingly restrained on the Zombies front for now. A new field upgrade is being added called Toxic Growth. As the name implies, this summons toxic growths of thorns in front of your Operator and it can be upgraded to increase its damage or cause enemies killed by the thorns to explode.",
    "Outbreak is continuing, with a new region called Duga being added. That means more secrets to uncover, documents to find and zombies to kill as the story of Requiem and the Dark Aether continues. You'll also be able to find the D.I.E Machine Wonder Weapon for the first time in Outbreak.",
    "It seems like the future seasons will revolve around the inclusion of Zombie mode in some fashion. Right now, zombies are infesting the Prison section of the Verdansk map. Season 4 could see the zombies spread out across the other parts of the map.",
    "Meanwhile, the next mainline Call of Duty for 2021 is heavily rumored to be a return to World War 2, with development being led by Sledgehammer Games. It's far too early for this game to be officially revealed however, so we shouldn't expect any sort of tie in to Warzone here, though that may change once the game has been revealed.",
    "Call of Duty: Warzone and Call of Duty: Black Ops Cold War are both currently available on Xbox Series X, Xbox Series S, Xbox One, PC, PS5 and PS4."
  ],
  "headers": {},
  "links": {
    "Call of Duty: Black Ops Cold War": "https://www.techradar.com/reviews/call-of-duty-black-ops-cold-war",
    "heavily rumored": "https://www.techradar.com/news/new-call-of-duty-name-leak-suggests-a-return-to-ww2",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}