{
  "source": "https://www.techradar.com/news/buy-now-pay-later-services-set-to-soar",
  "title": "Buy now pay later services set to soar",
  "category": "computing",
  "updated": "2021-06-14T09:02:10Z",
  "author": "rob-clymo",
  "summary": "Spreading the cost of a purchase is more appealing than ever, report suggests",
  "article": [
    "So-called \"buy now pay later\" services such as Klarna are due for a significant rise over the next few years, with a market cap set to reach $995 billion by 2026, new predictions have said.",
    "A report from Juniper Research claims that such services, which are often integrated into e-commerce checkout options, are due to see a growth of 274% compared to the $226 billion figure expected for 2021.",
    "There’s a growing appetite for more flexible payment options from consumers, with many choosing fixed instalment plans and flexible credit accounts to help them spread the cost of goods, especially when it comes to big ticket items.",
    "While it’s expected that regulations could put restrictions on some payment options, including charge limitations and increased affordability checks, overall the appeal of buy now pay later is proving a practical solution for many digital shoppers.",
    "However, the research also recommends that companies who offer by now pay later services need to ‘focus on improving the transparency and use of credit assessment and reporting now to minimize future disruption’.",
    "Buy now pay later might not always find favour with consumer groups, but it certainly doesn’t look like disappearing any time soon. The research findings suggest that it will account for over 24% of global e-commerce transactions for physical goods by value. It’s currently at just 9% for 2021.",
    "Research co-author Damla Sat explains: “As a tool to split the cost for users, buy now pay later is ideally suited for high-cost items, as it enables users to seamlessly split large costs into smaller, more manageable payments. By 2026, these platforms will increasingly become the norm for lower-cost purchases as well; driven by user demand and e-commerce platform integrations.”",
    "The number of consumers using buy now pay later services is already healthy, with 340 million expected to choose flexible payment options at the checkout this year. But by 2026 the Juniper Research findings predict that users tapping into the flexibility of buy now pay later will be in excess of 1.5 billion.",
    "The report also suggests that it is therefore prudent for e-commerce merchants to implement the option or risk losing out, with shoppers taking their transactions to other payment platforms that offer more flexible payment options."
  ],
  "headers": {
    "5": "Buy now pay later"
  },
  "links": {
    "e-commerce checkout": "https://www.techradar.com/best/best-shopping-cart-software",
    "digital shoppers": "https://www.techradar.com/news/global-e-commerce-is-booming-despite-pandemic",
    "e-commerce transactions": "https://www.techradar.com/best/best-credit-card-processing-service",
    "checkout": "https://www.techradar.com/news/many-online-shoppers-are-using-guest-checkout-over-data-privacy-fears",
    "e-commerce merchants": "https://www.techradar.com/best/best-payment-gateways",
    "payment platforms": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}