{
  "source": "https://www.techradar.com/news/fortnite-skins-april-2021-all-the-skins-coming-to-fortnite-and-how-to-get-them",
  "title": "Fortnite skins November 2021: All the skins coming to Fortnite and how to get them",
  "category": "gaming",
  "updated": "2021-11-15T10:09:02Z",
  "author": "hamish-hector",
  "summary": "Get ready for battle with November's Fortnite skins",
  "article": [
    "November 2021 is here and that means Fortnite's spooky Halloween skins have disappeared. Even with that huge selection gone though, we know it's hard to keep up with all of the new skins that are being added so we're here to help you out.",
    "This is also Fortnite Season 8, and so far it's been one of the best Seasons in Chapter 2. While the gameplay has been mixed up, the effort that goes into skin designs hasn't changed at all and Epic is churning out some great-looking character models.",
    "We’ve rounded up every Fortnite skin we expect to land in the battle royale in November 2021, with not only skins confirmed by Epic Games but leaks and rumors for upcoming collaborations. We'll tell you how to unlock them all so you can look fashionable while racking up the eliminations.",
    "This far-fetched collaboration has been through the rumor mill a few times, but Epic Games has finally confirmed that Naruto will be officially added to Fortnite.",
    "We don't know which characters will appear but we can at least expect Naruto Uzumaki will appear with Sasuke, Sakura and their sensei Kakashi also likely candidates. We imagine the Full Tilt emote will return too - now under the Naruto series set.",
    "The collaboration launches on November 16 where we expect most items will be confined to the Item Shop, though with the way Epic Games is marketing this collab we might see some free cosmetics added too which players can earn through challenges- we'll have to wait and see.",
    "The Dark Phoenix has arrived from the X-Men Universe into Fortnite. This skin looks amazing but we'll be honest this one kinda comes outta nowhere as there was no fanfare around it like the Naruto collab - but maybe it ties into Season 8's apocalypse theme.",
    "Like most of Fortnite's Marvel skins the Dark Phoenix outfit has to be bought through the item shop for 1,500 V-Bucks, with the Rising Phoenix emote costing 300 V-Bucks.",
    "Boba Fett and Fennec Shand are coming to Fortnite on December 24 to celebrate the release of the Disney Plus show The Book of Boba Fett. The Bounty Hunter duo will join other Fortnite characters who are already on the Island including Rey, Kylo Ren, and The Mandalorian.",
    "Right now it looks like this collab could end up being another one where all the cosmetics are tied to the Item Shop, but we might be given a free questline and reward when it releases - we'll just have to wait and see.",
    "Following on from the previous Fortnite x Batman crossover it looks like DC and Epic Games are teaming up for another collaboration that will bring the Batman who Laughs to the Fortnite Island.",
    "This terrifying version of the caped crusader is a fusion of Batman and the Joker - making him Bruce Wayne's worst nightmare brought to life. His arrival on October 26 is part of a tie-in with the new Batman/Fortnite: Foundation comic.",
    "Like previous DC collaboration cosmetics, you can earn the Batman who Laughs skin by purchasing the comic and entering your unique code in-game. Alternatively, you can buy the skin with V-Bucks when it returns to the in-game Item Shop.",
    "It wouldn't make sense for us to single out every Season 8 Battle Pass skin, so we're going to do a big dump of them all here. As you can see in the trailer above Charlotte looks like a goth with martial arts abilities, Toona Fish is a cartoonized Fishsticks, Kor-9 seems to be a badass assassin, J.B. Chimpanski is a human-sized chimpanzee in a spacesuit and Torin appears to be a fantasy hero with strange mystical powers.",
    "Our two favorites have to be Fabio Sparklemane – a buff My Little Pony-esque unicorn humanoid – and Carnage – the red symbiote appearing in Venom 2.",
    "You'll also need the Battle Pass if you want to unlock the 'secret' Cube Queen Fortnite skin later this Season.",
    "You can unlock the Battle pass by paying 950 V-Bucks or by signing up to Fortnite Crew for $11.99 / £9.99 / AU$15.99/ per month.",
    "Epic Games has officially teased its next three Fortnite Crew skins called the First Shadows. Looking at the picture above the skins will be added from left to right; September brought The Burning Wolf, Chaos Origins arrived with October, and finally Sierra has dropped in November.",
    "Lore wise these skins seem to tie into the Shadow vs Ghost story from Fortnite Chapter 2, with these characters being the first three Shadows that Midas recruited.",
    "If you subscribe for all three months you'll also get a bonus style for each outfit. Fortnite Crew costs $11.99 (£9.99 / AU$15.99) per month and alongside the exclusive skin it will net you 1,000 V-Bucks as well as the Battle Pass if you don't currently own it.",
    "Twitter user, and leaker @ShiinaBR has suggested that Peacemaker could follow on from Bloodsport as yet another The Suicide Squad tie-in. The same person who leaked Bloodsport suggested John Cena's character could appear too, meaning we might see the character show up soon.",
    "We don't have anything more concrete, like in-game files, so take this with a pinch of salt but we could see Peacemaker arrive in January 2022 when his new show is expected to be released on HBO Max.",
    "In Fortnite Chapter 2 Season 5 many fans were calling for Nintendo to be represented by an in-game skin after both Xbox and PlayStation got their mascots in the Battle Royale. The obvious choice was bounty hunter Samus from the Metroid series – but she never showed up.",
    "Leaked documents shared on Twitter from the Epic Games vs Apple court battle indicate that Samus is/was planned to appear in the game (alongside multiple other characters like Naruto and Ariana Grande). The above panel from issue three of the Batman Zero Point series adds to the speculation that the character could still be coming after fans spotted a silhouette that looks a lot like Samus.",
    "Take this rumor with an unhealthy amount of salt, but it could mean that Samus might soon arrive as a Fortnite skin.",
    "Here's a leak to take with an extra pinch of salt: multiple Fortnite leakers on Twitter have shared images from a recent Epic survey showing off several new skin designs. In it the company detailed potential Fortnite skins and included images of ones we might eventually see added to the game.",
    "You can see all of the in the tweet above but some of our favorites are Cartoon Bushranger, a Vampire Drift, and Guff dressed as a Christmas tree. We have no clue if any of these skins will ever be added to the game, but be on the lookout in future seasons.",
    "The Foundation, a character that appeared in the epic Fortnite Season 5 event, is rumored to be becoming a Fortnite skin at some point in the future. It's likely we won't see him for a while longer though his involvement in the Batman who Laughs tie-in might cause this skin to finally be added; we'll have to wait and see what happens.",
    "Leaker Hypex found files related to the skin in-game so he could be on the way sooner than that, but we'll just have to wait and see what happens."
  ],
  "headers": {
    "3": "Naruto",
    "6": "Dark Phoenix",
    "8": "Boba Fett",
    "10": "Batman who Laughs",
    "13": "Season 8 Battle Pass Skins",
    "17": "First Shadows – Fortnite Crew September to November",
    "20": "Peacemaker – Star of The Suicide Squad",
    "22": "Samus Aran – Nintendo's bounty hunter",
    "25": "Leaked survey skins",
    "27": "The Foundation – Leader of the Seven"
  },
  "links": {
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Batman/Fortnite: Foundation comic": "https://www.epicgames.com/fortnite/en-US/news/batman-fortnite-foundation-universes-collide-again-in-new-limited-edition-comic-landing-october-26",
    "Venom 2": "https://www.techradar.com/news/is-venom-2-landing-this-year-after-all-nobody-seems-to-know",
    "Fortnite Crew": "https://www.techradar.com/news/fortnite-could-be-getting-a-monthly-paid-subscription-plan",
    "@ShiinaBR": "https://twitter.com/ShiinaBR/status/1429481791015067650?s=20",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "Peacemaker": "https://www.techradar.com/news/hbo-maxs-suicide-squad-spin-off-series-peacemaker-will-star-john-cena",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Leaked documents shared on Twitter": "https://twitter.com/iFireMonkey/status/1389265690868203520?s=20",
    "Epic Games vs Apple court battle": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "Hypex": "https://twitter.com/HYPEX/status/1371708754329272321/photo/1"
  }
}