{
  "source": "https://www.techradar.com/news/microsoft-is-blocking-some-versions-of-outlook-from-microsoft-365",
  "title": "Microsoft is blocking some versions of Outlook from Microsoft 365",
  "category": "computing",
  "updated": "2021-09-06T10:34:45Z",
  "author": "sead-fadilpasic",
  "summary": "There's a few months to update your systems though",
  "article": [
    "Several versions of Microsoft's Outlook email client will no longer be able to connect to Microsoft 365 services soon, the company has warned.",
    "In a recent blog post, Microsoft said that in less than two months, Outlook 2007, 2010, and, to an extent, Office 2013 users (versions earlier than 15.0.4971.1000), will lose connectivity",
    "The company has now invited its users to upgrade to newer versions before the deadline in order not to experience any disruptions in their work.",
    "“Since our Message Center post last fall, we’ve seen a drop in the usage of the unsupported versions of Outlook for Windows – great job! If you’re still running older versions, please start working on a plan to move by November 1st,” the blog post reads.",
    "Microsoft said its customer support team is contacting people who still use Outlook 2007 and 2010 to “help them meet the deadline,” and said anyone struggling to do so should reach out for help.",
    "Further explaining what the move means, Microsoft said that from November 1 onwards, older versions of Outlook will no longer have support for basic authentication (that should improve the security of Microsoft 365, the company said).",
    "“We’re working on adding support for HTTP/2 in Microsoft 365. HTTP/2 is a full duplex protocol, which decreases latency through header compression and request multiplexing. On the service side, we’ll be able to better prioritize requests and more effectively push data to clients,” it added.",
    "And while upgrading to the latest and greatest of Microsoft “can be a challenge”, the company says there are many benefits to keeping up with the times, such as being up to date with security fixes, having more reliable software, and having access to all the new features.",
    "Small and medium-sized businesses often can’t afford, or simply can’t be bothered, to upgrade their software. However, this puts them at great cybersecurity risks because software that has reached end-of-life will have known vulnerabilities that are easy to exploit and very expensive to mitigate.",
    "Security experts are constantly warning against keeping outdated systems, software and security solutions.",
    "Via MSPowerUser"
  ],
  "headers": {
    "5": "Moving on"
  },
  "links": {
    "email": "https://www.techradar.com/news/best-email-provider",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5084150231742533000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-365-blog%2Fnew-minimum-outlook-for-windows-version-requirements-for%2Fba-p%2F2684142&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-blocking-some-versions-of-outlook-from-microsoft-365",
    "MSPowerUser": "https://mspoweruser.com/microsoft-will-soon-block-outlook-2010-and-earlier-from-connecting-to-microsoft-365-exchange-servers/"
  }
}