{
  "source": "https://www.techradar.com/news/how-to-watch-herself-online-stream-anywhere",
  "title": "How to watch Herself online: stream the powerful new movie from anywhere now",
  "category": "computing",
  "updated": "2021-01-08T11:57:06Z",
  "author": "james-laird",
  "summary": "Mamma Mia! director Phyllida Lloyd back with new drama",
  "article": [
    "Almost a decade after helping guide Meryl Streep to an Oscar in The Iron Lady, director Phyllida Lloyd returns to the silver screen with Herself - a hard-hitting new drama that is already picking up award nominations. And while the coronavirus pandemic has stopped the film from getting a full cinematic release in many countries, it's now available for VOD home streaming in select markets. Read on to find out how to watch Herself online, no matter where you are in the world right now.",
    "A complete contrast to her recent work on the breezy ABBA musical Mamma Mia!, Herself marks another change of pace for Lloyd, with the film featuring a low budget aesthetic and no major Hollywood stars",
    "It tells the story of Sandra, a single mother in Dublin, played by Clare Dunne. Having escaped an abusive marriage, Sandra decides to build her own house after failing to get what she needs from the housing system.",
    "The project allows Sandra rediscover herself, but her new life comes under threat when her ex-husband sues her for custody of their two young daughters. Dunne, who also has a co-writing credit for the movie, has already picked up a British Independent Film Award nomination for Best Actress for her stunning performance.",
    "Movie buffs in the US and Canada can judge for themselves, too, as Herself has been released exclusively (to the best of our knowledge) on Amazon Prime Video in the US and Canada. That means it's available at no extra cost to Prime subscribers in North America - and that anyone new to the online giant's subscription service can take advantage of Amazon's FREE 30-day Prime trial to watch Herself free online, if they decide not to keep the service.",
    "Also, Prime members from countries like these where the movie is now available can log-in to their account from almost anywhere in the world. All that's needed is the help of a good VPN. Here's how that works in more detail and our top recommendation.",
    "If you're a Prime Video subscriber but find yourself stuck abroad in a country where the service isn't available or you can't log-in as usual, that's probably down to geo-blocking restrictions.",
    "Thankfully, help is at hand. Downloading a VPN will allow you to watch Herself no matter where you are, simply by changing your IP address to one that's back in your country of residence. Here's how to get started with this essential bit of streaming software.",
    "More from Amazon Prime:"
  ],
  "headers": {
    "6": "How to watch Herself from outside your country",
    "8": "How to watch Herself: stream the new Prime Video movie right now"
  },
  "links": {
    "Amazon's FREE 30-day Prime trial": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Famazonprime%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8277786623437264000-20",
    "the help of a good VPN.": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-6507971917816955000",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}