{
  "source": "https://www.techradar.com/news/mercedes-benz-usa-accidentally-leaked-customer-data",
  "title": "Mercedes-Benz USA accidentally leaked customer data",
  "category": "computing",
  "updated": "2021-06-25T12:58:31Z",
  "author": "mayank-sharma",
  "summary": "Details surrounding the the leak are sketchy",
  "article": [
    "Luxury car manufacturer Mercedes-Benz USA disclosed that it had inadvertently leaked sensitive personal information of about a thousand current and potential customers via its cloud storage platform.",
    "Reuters reports that the American subsidiary of renowned German automotive brand Daimler AG did not share any further details about the circumstances that led to the data being shared, or the steps the company has taken to ensure that it doesn’t reoccur in the future.",
    "Mercedes-Benz did however add that none of the files were maliciously used, while again stressing that the leak was not the result of its systems being compromised.",
    "The lack of details surrounding the circumstances of the leak and its subsequent detection is a little disconcerting, especially concerning the nature of the data that was leaked.",
    "The company itself admitted that the exposed data consisted of customers’ and buyers’ self-reported credit scores, driver licenses, social security numbers and credit card information.",
    "Mercedes-Benz USA claims the information was entered by the individuals themselves either on a dealer’s website or on the company’s official websites, January 2014 and June 2017.",
    "The good news however is that the company is said to be offering a complimentary two-year subscription to a credit monitoring service to individuals who’ve had their data exposed. However, again the Reuters report didn’t mention how the company plans to coordinate with the affected individuals."
  ],
  "headers": {
    "3": "Lack of details"
  },
  "links": {
    "Mercedes-Benz": "https://www.techradar.com/news/mercedes-benz-eqa-review-mercs-affordable-ev-gets-almost-everything-right",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Reuters": "https://www.reuters.com/technology/mercedes-us-data-breach-affects-nearly-1000-customers-2021-06-24/",
    "credit monitoring service": "https://www.techradar.com/best/us-credit-monitoring-services"
  }
}