{
  "source": "https://www.techradar.com/news/1password-expands-protection-to-linux-devices",
  "title": "1Password expands protection to Linux devices",
  "category": "computing",
  "updated": "2021-05-18T20:09:18Z",
  "author": "anthony-spadafora",
  "summary": "New Linux password manager app for desktop also supports Secrets Automation",
  "article": [
    "The business password management company 1Password has released a full-featured desktop app for Linux that allows users to secure their credentials across devices.",
    "The new app for Linux also allows for seamless management of infrastructure secrets as it supports the company's recently released Secrets Automation product. By using the service, secrets such as corporate credentials, API tokens, keys and certificates can all be stored using the same security found in 1Password's password manager.",
    "The company has a long history of engaging with the open source community and providing more than 250 open source projects with free accounts for their teams. 1Password developed its new Linux desktop app with this community in mind and co-founder Dave Teare, who initiated the project, provided further insight on its development in a press release, saying:",
    "\"This is an important milestone for Linux users and underscores that community's desire for 1Password to be their password manager of choice. In a time where other companies are moving away from dedicated apps for desktop, we are leaning into it - creating a leading password manager that works wherever you are - desktop, mobile, server or command-line. This dedication to building world-class apps, using the latest and greatest technologies is something we passionately believe in.\"",
    "1Password made the decision early on to write its new desktop app for Linux entirely in Rust as the secure systems programming language has seen widespread adoption in the enterprise. In fact, Rust is even under consideration as the official language for the Linux kernel.",
    "As 1Password for Linux uses the Linux kernel keyring to establish a fully encrypted connection, if you unlock one, the other will also be unlocked. Since the app uses the same authentication mechanisms and APIs provided to all user applications on Linux, users can unlock 1Password with their Linux user account, fingerprint sensors or any other authentication method supported by PAM.",
    "Additionally, it doesn't matter which Linux distribution you're running as 1Password for Linux is available for all major distros via signed packages as well as from app stores like Ubuntu's Snap Store. The app is also compatible with virtually all other distributions through a standard .tar.gz download.",
    "CEO of 1Password Jeff Shiner explained how entire organizations can now be protected regardless of which type of device their using, saying:",
    "\"1Password for Linux is the latest step in our commitment to enterprise. While 1Password can be utilized by anyone, business or individual, we have seen a real need for robust Linux support - outside of just the browser - in DevOps and IT teams in larger organizations. 1Password for Linux means that the entire organization can be protected irrespective of their device choice.\""
  ],
  "headers": {
    "4": "1Password for Linux"
  },
  "links": {
    "business password management": "https://www.techradar.com/best/business-password-management-software",
    "1Password": "https://www.techradar.com/reviews/1password",
    "Secrets Automation": "https://www.techradar.com/news/1password-wants-to-help-organizations-protect-their-secrets",
    "password manager": "https://www.techradar.com/best/password-manager",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "press release": "https://www.prnewswire.com/news-releases/1password-unveils-application-to-protect-linux-users-and-developers-301293641.html",
    "Rust": "https://www.techradar.com/news/rust-for-windows-gets-major-update",
    "Linux kernel": "https://www.techradar.com/news/big-changes-could-be-coming-to-linux-programming",
    "Linux distribution": "https://www.techradar.com/best/best-linux-distros",
    "Snap Store": "https://www.techradar.com/news/google-has-some-great-news-for-linux-developers"
  }
}