{
  "source": "https://www.techradar.com/news/nvidia-wants-to-own-a-piece-of-your-smartphone-but-hits-another-speed-bump",
  "title": "Nvidia wants to own a piece of your smartphone, but hits another speed bump",
  "category": "computing",
  "updated": "2021-10-28T07:47:53Z",
  "author": "allisa-james",
  "summary": "One problem after the next",
  "article": [
    "Nvidia has been working on the $54 billion bid for UK-based chip designer Arm since 2020, with plenty of snags along the way. But now the tech company is facing its biggest obstacle yet as the European Commission has gotten involved with the merger.",
    "The European Commission has stated that they will fully investigate the acquisition and determine whether it will result in a monopoly that would harm other industries and companies such as Qualcomm, Apple, and Samsung.",
    "Nvidia has made “insufficient concessions” during its preliminary review from the antitrust regulator, according to the report from Reuters. And while it has not been revealed what those concessions were, Nvidia did state that Arm would remain a neutral technology supplier and would not rock the marketplace boat.",
    "The European Commission will reportedly make its decision by March 15, 2022.",
    "Nvidia’s attempt to acquire Arm from the SoftBank Group has been facing scrutiny from the UK’s Competition and Markets Authority (CMA), as well as tech giants such as Google and Microsoft, and US chipmaker Qualcomm.",
    "All three have even voiced concerns to regulatory bodies such as the US Federal Trade Commission, the European Commission, the CMA, and China's State Administration for Market Regulation. There’s also the fact that Qualcomm previously announced it would invest in Arm if the deal with Nvidia falls through, giving it even more incentive to intervene.",
    "Though each company has its own stakes at risk if the merger goes through, they all share the same concerns that it would be far harder to license Arm's intellectual property afterward, as the company’s chip designs are currently used in 95%of the world's smartphones.",
    "There are also concerns that, unlike Softbank, which expanded UK jobs when it purchased Arm, Nvidia could possibly outsource jobs or operations abroad.",
    "Via Windows Central"
  ],
  "headers": {
    "4": "Analysis: Objections so far"
  },
  "links": {
    "Reuters": "https://www.reuters.com/technology/setback-nvidias-54-bln-arm-bid-eu-regulators-open-probe-2021-10-27/",
    "has been facing scrutiny": "https://www.techradar.com/news/nvidia-arm-takeover-raises-serious-concerns",
    "Google and Microsoft": "https://www.techradar.com/news/google-and-microsoft-now-raise-questions-over-nvidia-arm-deal",
    "Qualcomm": "https://www.techradar.com/news/qualcomm-latest-to-object-to-nvidia-arm-deal",
    "it would invest": "https://www.techradar.com/news/qualcomm-poised-to-swoop-if-dollar40bn-nvidia-arm-deal-crumbles",
    "far harder to license": "https://www.techradar.com/news/qualcomm-latest-to-object-to-nvidia-arm-deal",
    "outsource jobs or operations": "https://www.techradar.com/news/nvidia-arm-deal-under-investigaton-by-uk-watchdog",
    "Windows Central": "https://www.windowscentral.com/nvidias-arm-acquisition-hits-another-roadblock-thanks-eu-regulator-probe"
  }
}