{
  "source": "https://www.techradar.com/news/try-out-little-nightmares-2-for-free-on-ps4-xbox-one-and-nintendo-switch",
  "title": "Try out Little Nightmares 2 for free on PS4, Xbox One and Nintendo Switch",
  "category": "gaming",
  "updated": "2021-11-11T16:58:31Z",
  "author": "vic-hood",
  "summary": "And grab Little Nightmares for free",
  "article": [
    "Little Nightmares 2 may not be officially out until February 10, but players can try out a free demo of the game ahead of its release - if you dare.",
    "Bandai Namco has announced that a Little Nightmares 2 free playable demo is now available on PS4, Xbox One and Nintendo Switch, allowing you to try out a few hours of the spine-tingling sequel. This same demo is already available for PC players.",
    "Little Nightmares 2 sees you playing as new protagonist Mono, a young boy (with a bag on his head) who has become trapped in a world distorted by an evil transmission. Teaming up with new raincoat-wearing friend Six, the protagonist from the previous game and who is a computer-controlled character this time around, the two go in search of what's causing the transmission.",
    "The free demo gives you a glimpse of Mono's journey through the game's unsettling Wilderness level. Check out the new trailer below:",
    "There's also good news for those of you who haven't checked out Little Nightmares before, as Bandai Namco is offering the opportunity to try out the first game for free on PC and Xbox. PC players can pick up Little Nightmares for free from January 13 to January 17 via the BNEE store, while Xbox Live Gold subscribers can pick up the suspense-adventure for free in January as part of Xbox Games with Gold.",
    "It's certainly worth trying out ahead of the Little Nightmares 2 release on February 10, especially as you'll get a better understanding of what Six has already been through in the Maw before she meets Mono.",
    "Console players can download and play the free Little Nightmares 2 demo on PlayStation 4, Xbox One and Nintendo Switch. While PC players can check it out via Steam and GOG.com.",
    "Little Nightmares 2 will release on PS4, Xbox One, Switch and PC on February 10, 2021 and on PS5 and Xbox Series X later in 2021."
  ],
  "headers": {
    "4": "Play Little Nightmares for free"
  },
  "links": {
    "Little Nightmares 2": "https://www.techradar.com/reviews/little-nightmares-2",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1193406894855968300&xs=1&url=https%3A%2F%2Fwww.microsoft.com%2Fp%2FLittle-Nightmares-II-DEMO%2F9PNXV84C0T2H&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ftry-out-little-nightmares-2-for-free-on-ps4-xbox-one-and-nintendo-switch",
    "Nintendo Switch": "https://www.nintendo.co.uk/Games/Nintendo-Switch/Little-Nightmares-II-1891827.html",
    "BNEE store": "https://store.bandainamcoent.eu/ref/D00059",
    "Xbox Games with Gold": "https://www.techradar.com/news/xbox-live-gold-free-games",
    "PlayStation 4": "https://store.playstation.com/fr-fr/product/EP0700-CUSA25312_00-LITTLENIGHTS2DEM",
    "Steam": "https://store.steampowered.com/app/860510/Little_Nightmares_II/",
    "GOG.com": "https://www.gog.com/game/little_nightmares_ii_demo?pp=d965a463ac183af4828302b14522bb3371cec49f"
  }
}