{
  "source": "https://www.techradar.com/news/halo-infinite-release-date-may-have-been-leaked",
  "title": "Halo Infinite release date may have been leaked",
  "category": "gaming",
  "updated": "2021-03-25T11:43:04Z",
  "author": "vic-hood",
  "summary": "A Halo Infinite actor seems to have spilled the beans",
  "article": [
    "We may know the Halo Infinite release date, thanks to one of the game's actors.",
    "During an appearance on the Fadam and Friends podcast last week, Halo Infinite actor Verlon Roberts seemed to reveal that the next Halo will release in November 2021 (via GamesRadar).",
    "\"That was one of my first auditions, was auditioning for the video game Halo Infinite,\" Roberts said. \"Which was supposed to already be out but with the pandemic and everything, and then I think they had some leadership changes, and now it's pushed to later November this year.\"",
    "Roberts also revealed that he is playing Spartan Griffin in Halo Infinite. Though we don't know how big a role this character will play, this too was previously unreleased information.",
    "You can watch the podcast below, with Halo Infinite section clocking in around the 1 hour 10 minutes mark.",
    "Following a delay from releasing in November 2020, as a flagship title for the Xbox Series X and Xbox Series S, Halo Infinite was then delayed \"indefinitely\" before developer 343 Industries confirmed the game will release in \"Fall 2020\" (sometime between September and November).",
    "However, if Roberts' comments are to be believed, this release window has now been narrowed further to a November release. This release window would make sense, In addition, given that we were already predicting a November release date for Halo Infinite and that Halo's 20th anniversary falls on November 15.",
    "It's worth noting that Roberts may not be entirely clued in on developer 343 Industries' plans for Halo Infinite's launch, but it's possible the actor did reveal more than he was meant to."
  ],
  "headers": {
    "5": "Halo Infinite release"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Fadam and Friends podcast": "https://youtu.be/Awj5FVlhu90",
    "GamesRadar": "https://www.gamesradar.com/halo-infinite-actor-says-game-is-launching-in-november-2021/"
  }
}