{
  "source": "https://www.techradar.com/news/starfield-release-date-looks-like-its-2022-and-it-will-reportedly-be-a-pcxbox-exclusive",
  "title": "Starfield release date looks like it's 2022 and it will reportedly be a PC/Xbox exclusive",
  "category": "gaming",
  "updated": "2021-05-20T19:44:39Z",
  "author": "nick-pino",
  "summary": "Expect to hear something about the game at E3 2021",
  "article": [
    "For the last few days, new information has begun to emerge about Starfield – Bethesda’s next open-world space adventure that’s currently in development.",
    "It started with a tweet from GamesBeat's Jeff Grub who said the game \"is confirmed\" to be PC/Xbox exclusive after Microsoft’s acquisition of Bethesda earlier this year, and now some other industry sources say that the game might make an appearance at Microsoft and Bethesda’s E3 2021 conference.",
    "It’s there, says Bloomberg’s Jason Schreier, that we’ll get the bad news: Starfield’s most likely release date is late 2022.",
    "Neither Microsoft nor Bethesda have corroborated these reports yet, but Xbox Game Studios head Matt Booty said in a recent interview that the two companies will share a spotlight at E3 2021 with a joint keynote event that will take place between June 12 and June 15.",
    "Since the teaser trailer dropped for Starfield back at E3 2018, Bethesda has been pretty tight-lipped about its outer space open-world RPG.",
    "Very likely the game is targeting Xbox Series X and Xbox Series S as its two primary console platforms, but all we know at this point is that the game will use a new engine that has been massively overhauled since the release of The Elder Scrolls V: Skyrim in 2011 and that the map will be gargantuan in scale because Starfield will use procedural generation to create new areas.",
    "That’s not a lot to go off of, unfortunately, but we’re hoping we’ll be hearing a lot more about the game in just a few weeks at E3 2021.",
    "We'll keep our ears to the ground in the meantime and report back if we hear anything before then."
  ],
  "headers": {
    "4": "Starfield remains one of the universe’s great mysteries"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "tweet": "https://twitter.com/JeffGrubb/status/1393383582370992128",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "a recent interview": "https://www.lefigaro.fr/secteur/high-tech/jeux-video-microsoft-savoure-son-mariage-avec-bethesda-20210519",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}