{
  "source": "https://www.techradar.com/news/hbo-max-price-falls-to-dollar10-with-ad-tier-plan-heres-how-it-compares",
  "title": "HBO Max price falls to $10 with ad-tier plan – here’s how it compares",
  "category": "entertainment",
  "updated": "2021-05-19T18:52:54Z",
  "author": "nick-pino",
  "summary": "It’s the full catalogue… minus the blockbuster movies that launch in theaters",
  "article": [
    "HBO’s parent company WarnerMedia announced that it will be launching a new pricing tier of HBO Max that has ads for under $10 per month.",
    "The service will be available starting in the first few weeks of June, and the company says that it will have fewer and less aggressive ads than some of its competitors (*cough* Hulu).",
    "The down side here is, as we reported back in March, the ad-supported tier of HBO Max won’t have new Warner Bros. films the day they’re released in theaters like the regular tier of HBO Max – at least not for the rest of the year. After that, it’s unclear whether either service will continue to get movies the day they’re released in theaters or if WarnerMedia will pull back on that completely.",
    "Outside of those films, HBO Max with ads will have the same catalogue as HBO Max and will use the same app and interface – which means you won’t have to worry about which app to download.",
    "The last bit of news HBO and WarnerMedia announced today is that HBO Max will be rolling out to more countries in the coming months.",
    "According to WarnerMedia, HBO Max is scheduled to launch (without ads) in 39 countries across Latin America and the Caribbean in late June, and then will be available on HBO-branded streaming services in Europe (the Nordics, Spain, Central Europe, and Portugal) later this year.",
    "Because the vast majority of the content on HBO Max is made by the studio itself, the content library should theoretically be the same across countries; however, it’s unclear whether some of the more popular syndicated shows like The Big Bang Theory and Friends will also be available in other countries on the service.",
    "Still, a wider rollout will be nice as it greatly increases the reach of the service and will allow other countries to watch HBO Max without needing to use a VPN."
  ],
  "headers": {
    "4": "HBO Max is coming to a country near you"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "as we reported back in March": "https://www.techradar.com/news/hbo-max-is-getting-a-cheaper-ad-supported-tier-but-theres-a-huge-drawback"
  }
}