{
  "source": "https://www.techradar.com/news/netflixs-knives-out-2-cast-four-actors-this-week-the-latest-is-a-wandavision-star",
  "title": "Netflix's Knives Out 2 cast four actors this week – the latest is a WandaVision star",
  "category": "entertainment",
  "updated": "2021-05-14T15:10:36Z",
  "author": "samuel-roberts",
  "summary": "Kathryn Hahn joins the murder mystery sequel",
  "article": [
    "Netflix's Knives Out 2 has reportedly cast four actors this week – first, we learned about Edward Norton, Dave Bautista and Janelle Monae joining the cast of Rian Johnson's sequel, and now WandaVision villain Kathryn Hahn is set to join the cast of the second mystery featuring Daniel Craig's Benoit Blanc.",
    "That's according to Deadline, which says Hahn is joining the sequel as it plans to film in Greece this summer. Details about the movie's story are confidential, it seems, but it's clear that Johnson is prepping another mystery movie with a big-name ensemble cast – and considering that these casting reports have been rolling out once a day this week, our guess is that their timing is somewhat calculated.",
    "Bautista joined the cast on Monday, while Norton's casting was revealed on Tuesday. Monae was revealed on Wednesday, while Hahn was reported on Thursday. Could we see more before the week is out?",
    "Netflix bought the rights to two Knives Out sequels for a massive $469 million. According to THR, the deal's specifics required that Daniel Craig return for the sequels, and that the individual budgets of the two films have to match the original movie's at minimum – that one cost around $40 million to make.",
    "Knives Out 2 has no release date on Netflix yet, but if they're filming the movie within the next few months, hopefully we'll see it some time in 2022.",
    "Netflix has done a great job of generating franchises on its streaming service, particularly on the TV side – and it's also made a few successful movie series, like The Kissing Booth and The Babysitter. This feels like something different, with Netflix swooping in to snap up a new movie series with a pre-built audience – and two sequels to a movie that was both an audience hit and a light Oscar contender.",
    "This happened because the rights to make these movies were put up for auction by the owners of the Knives Out property, director Rian Johnson and producer Ram Bergman.",
    "Apple and Amazon were also bidding for the rights, according to Deadline. Netflix is a good fit because of its market-leading reach of 207 million-plus subscribers – this basically ensures that anyone who saw the first movie will have easy access to the sequels."
  ],
  "headers": {
    "5": "Analysis: Why did Netflix buy Knives Out?"
  },
  "links": {
    "Dave Bautista": "https://www.techradar.com/news/knives-out-2-may-have-an-all-star-cast-to-rival-the-original-heres-why",
    "Deadline": "https://deadline.com/2021/03/knives-out-two-sequels-netflix-400-million-plus-deal-daniel-craig-rian-johnson-ram-bergman-1234724575/",
    "THR": "https://www.hollywoodreporter.com/movies/movie-news/janelle-monae-knives-out-sequel-1234950252/"
  }
}