{
  "source": "https://www.techradar.com/news/xbox-at-e3-what-can-we-expect-from-microsofts-first-party-studios",
  "title": "Xbox Series X: what can we expect from Microsoft’s first-party studios at E3 2021?",
  "category": "gaming",
  "updated": "2021-06-12T21:02:02Z",
  "author": "adam-vjestica",
  "summary": "We're hoping to see a lot of Xbox Series X games",
  "article": [
    "After six months on sale, Microsoft’s Xbox Series X could be seen as a sleeping giant at the moment. We’re yet to see what the new Xbox is truly capable of after all, with The Medium being the only true exclusive available for the console that isn’t compatible with Xbox One.",
    "We also haven’t seen a return on Microsoft’s multi-billion dollar investments, which has seen the company amass 23 first-party studios, including Bethesda Softworks. Fans will be expecting to see some new games sooner rather than later, then, and E3 could serve as a rousing wake up call.",
    "We know that Microsoft’s E3 2021 conference on June 13 is set to last 90 minutes, and it’s the perfect opportunity for Microsoft to set out a compelling roadmap of what’s to come for Xbox Series X and Xbox Series S owners.",
    "But what can we expect to see? Well, let’s go through each of Microsoft’s first-party studios and make some realistic predictions.",
    "Microsoft is likely to open its E3 presentation with a closer look at Halo Infinite. We should see how the game has evolved since its first gameplay reveal back in July 2020, and hear more details about Halo Infinite’s story. We’d also expect a deep dive into the game’s new multiplayer mode, with a beta announcement taking place during the show or in the near future.",
    "Don’t expect to see any announcements from The Coalition at this year’s E3. The studio revealed it was moving on to Unreal Engine 5 for its next title, and that this would be a “big undertaking”. We can safely presume The Coalition’s next title will be Gears 6, and we might possibly see Gears Tactics 2 in the future, but we’d be surprised if anything was shown this year.",
    "The developer behind We Happy Few has already promised its next title will be “much better than the last game” it made, particularly now that it’s part of Xbox Game Studios. While we wouldn’t rule out seeing a sequel to We Happy Few, a new IP announcement might also be a possibility. But we believe the studio won’t be present this year.",
    "Double Fine Productions will surely reveal a release date for Psychonauts 2, which is tipped to release in August 2021. However, with development coming to a close on the psychedelic platformer, we wouldn’t be surprised if Double Fine Productions had something else to show at this year’s E3 conference. Fingers crossed it’s Brutal Legends 2.",
    "Microsoft has invested heavily in The Initiative, a studio which has been built to rival the likes of Naughty Dog and Sony Santa Monica. We know that The Initiative is working on Perfect Dark, and we’re hoping to find out more about Joanna’s next adventure at Microsoft’s E3 event. While we wouldn’t expect to see any gameplay just yet, an in-engine trailer would certainly be welcome, and could steal the show.",
    "inXile Entertainment are masters of the strategy game genre, with recent releases like Wasteland 3 garnering critical acclaim. However, the studio is reportedly working on a “next-gen RPG” powered by Unreal Engine 5. While it’s unclear how far along the team is in development, we might at least get a title for inXile’s next project.",
    "Minecraft probably won’t take up too much of Microsoft’s E3 conference, but we wouldn’t be surprised if we saw some more DLC for Minecraft Dungeons and the original game itself. Minecraft continues to be enjoyed by millions of players, so expect a short and snappy update to keep fans abreast of what’s on the way. Perhaps the ray traced version of Minecraft will finally make its way to Xbox Series X?",
    "It’s easy to forget that one of the first games announced for the Xbox Series X was Hellblade 2: Senua’s Saga. The game has been in development for some time, then, and we’re hopeful that a portion of gameplay will be shown. We could also get an update on Ninja Theory’s Project Mara, which is an experimental game that focuses on recreating the terror of mental health issues. Either way, we hope Senua shows up at E3.",
    "Obsidian Entertainment could provide some more details on Avowed, its Elder Scrolls-esque RPG set in the Pillars of Eternity universe, which was revealed in July 2020. There’s also rumblings that the studio could announce The Outer Worlds 2, but that’s only a rumor for now. If we don't see Avowed, we’d at least expect Obsidian to set a date for when Grounded will come out of Xbox Game Preview. We may even get a Fallout: New Vegas announcement, if we’re lucky.",
    "We know that Playground Games is working on Fable, but we don’t expect to see much, if anything, of the supposedly open-world RPG. Instead, we’re placing our bets on a Forza Horizon 5 announcement that will see the game set in Mexico. Forza Horizon has grown into one of the best-selling franchises for Microsoft, so we’d be genuinely disappointed if it didn’t make an appearance as it’s bound to be a big draw come the holiday season.",
    "Like Fable, we’re not confident that Rare will show any Everwild gameplay or footage. We haven’t heard any details since the game was revealed at X019, but the game still seems like it’s early on in development. We think that Rare is more likely to use its E3 presence to hype up an upcoming Sea of Thieves event or new season instead.",
    "Forza Motorsport underwent its first playtest on May 8, which means the game is further along in development than some may have thought. We’re expecting to see a glimpse of Microsoft’s premier racing sim at E3 this year, and maybe a release date alongside it. We think it’s likely to arrive after Forza Horizon 5, though, so expect 2022 for this one.",
    "We saw a CGI-trailer for State of Decay 3 during Microsoft’s July games event last year, but we don’t think Undead Labs’ next project will appear at E3. Zombie fans will have to wait a little longer for the next evolution in the State of Decay franchise.",
    "With mouse and keyboard support available, there’s no reason why World’s Edge can’t announce Age of Empires 4 for Xbox Series X at E3. Microsoft has been reluctant to bring the series over to console, but we hope that will change sooner rather than later.",
    "Alpha Dog Games is primarily a mobile developer, so we don’t expect to see any Xbox specific announcements from the studio at E3.",
    "It’s strange to think that Arkane Studios’ next game is a timed PS5 exclusive, but that’s the situation the developer finds itself in after Microsoft bought Bethesda. It remains to be seen whether we’ll get a release date for Deathloop on Xbox Series X and Xbox Series S, or whether the studio will reveal a brand-new IP for Microsoft’s consoles.",
    "We strongly believe that Starfield will be shown in gameplay form at E3, though it won’t release until 2022. Bethesda may also touch on the development of The Elder Scrolls 6, and we wouldn’t be too surprised if it had a classic, “Oh… and one more thing” reveal to share.",
    "After the release of Doom Eternal, what is id Software working on next? And if it’s another Doom game, will it be exclusive to Xbox consoles and PC? That’s hard to answer, but we’d love to see id Software give the same reboot treatment to its other classic FPS, Quake.",
    "We know that MachineGames is working on an Indiana Jones game, but it’s unlikely to be shown during E3. The studio could reveal what’s next for the Wolfenstein franchise, or could even announce a brand new IP.",
    "Little is known about Roundhouse Studios other than the fact that many of its employees come from Human Head Studios, the team responsible for Prey (2006). We think a new IP announcement would make sense for Roundhouse, though it’s unclear whether its project will be revealed at E3.",
    "Tango Gameworks next project is a PS5 exclusive Ghostwire: Tokyo, and while it’s unclear whether the game will come to Xbox consoles, we wouldn’t be too surprised to see The Evil Within 3 get announced.",
    "We’re not expecting much from ZeniMax Online Studios, and believe that any announcements regarding The Elder Scrolls Online will be made during a post-show event as opposed to the main stage.",
    "Microsoft's publishing arm has brought games like Ori and the Will of the Wisps to Xbox and PC, along with the punishingly difficult yet awesome Cuphead. We hope to finally get a release date for the Cuphead: Delicious Last Course DLC.",
    "It’s clear that Microsoft has enough studios to dedicate an entire show to highlight what its teams are working on, but even if just half of these predictions come true, we should be in for a great show."
  ],
  "headers": {
    "4": "343 Industries - Halo Infinite",
    "5": "The Coalition - Gears 6, Gears Tactics 2",
    "6": "Compulsion Games - new IP",
    "7": "Double Fine Productions - Psychonauts 2",
    "8": "The Initiative - Perfect Dark",
    "9": "inXile Entertainment - “next-gen RPG”",
    "10": "Mojang Studios - Minecraft Dungeons, Minecraft",
    "11": "Ninja Theory - Hellblade 2, Project Mara",
    "12": "Obsidian Entertainment - Avowed, The Outer Worlds 2, Grounded",
    "13": "Playground Games - Fable, Forza Horizon 5",
    "14": "Rare - Everwild, Sea of Thieves",
    "15": "Turn 10 Studios - Forza Motorsport",
    "16": "Undead Labs - State of Decay 3",
    "17": "World’s Edge - Age of Empires 4",
    "18": "Alpha Dog Games",
    "19": "Arkane Studios - new IP, Deathloop",
    "20": "Bethesda Game Studios - Starfield, The Elder Scrolls 6",
    "21": "id Software - Doom",
    "22": "MachineGames - Wolfenstein, Indiana Jones",
    "23": "Roundhouse Studios - new IP",
    "24": "Tango Gameworks - The Evil Within 3",
    "25": "ZeniMax Online Studios - The Elder Scrolls Online",
    "26": "Xbox Game Studios Publishing"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "The Medium": "https://www.techradar.com/reviews/the-medium",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "first gameplay reveal": "https://www.techradar.com/news/halo-infinite-returns-to-the-series-roots-and-master-chief-has-never-looked-better",
    "moving on to Unreal Engine 5 for its next title": "https://www.gears5.com/the-future-of-gears-5",
    "Gears Tactics": "https://www.techradar.com/news/best-xbox-series-x-optimized-games",
    "We Happy Few": "https://www.techradar.com/news/failure-by-design-we-happy-few-and-five-other-games-whose-worlds-disappointed",
    "Psychonauts 2": "https://www.techradar.com/news/always-be-kind-time-schafer-talks-psychonauts-2-and-mental-health",
    "Perfect Dark": "https://www.techradar.com/news/perfect-dark-trailer-at-game-show-awards-shows-joanna-dark-is-back",
    "“next-gen RPG” powered by Unreal Engine 5": "https://twitter.com/BrianFargo/status/1262855710859116544",
    "Minecraft": "https://www.techradar.com/how-to/how-to-download-minecraft-for-pc",
    "Minecraft Dungeons": "https://www.techradar.com/reviews/minecraft-dungeons",
    "ray traced version of Minecraft": "https://www.techradar.com/news/i-thought-minecraft-rtx-was-a-gimmick-and-then-i-played-the-damn-thing",
    "Hellblade 2: Senua’s Saga": "https://www.techradar.com/news/senuas-saga-hellblade-2-release-date-trailers-news-and-rumors",
    "Project Mara": "https://www.techradar.com/news/hellblade-2-devs-project-mara-could-be-one-of-the-best-looking-next-gen-games",
    "Avowed": "https://www.techradar.com/news/avowed-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know/news/avowed-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "The Outer Worlds": "https://www.techradar.com/news/how-the-outer-worlds-escaped-the-shadow-of-fallout-according-to-its-creators",
    "Fable": "https://www.techradar.com/news/fable-4-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "Forza Horizon": "https://www.techradar.com/news/forza-horizon-4-review",
    "Everwild": "https://www.techradar.com/news/everwild-release-date-trailers-news-rumors",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-review",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "first playtest on May 8": "https://www.techradar.com/news/forza-motorsport-is-a-huge-generational-leap-from-previous-games-heres-why",
    "State of Decay 3": "https://www.techradar.com/news/new-games-2021",
    "Age of Empires 4": "https://www.techradar.com/news/age-of-empires-4-release-date-trailers-and-features",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Indiana Jones game": "https://www.techradar.com/news/new-indiana-jones-game",
    "Wolfenstein": "https://www.techradar.com/reviews/wolfenstein-youngblood",
    "The Elder Scrolls Online": "https://www.techradar.com/news/5-new-things-summerset-isles-brings-to-the-elder-scrolls-online",
    "Ori and the Will of the Wisps": "https://www.techradar.com/news/ori-and-the-will-of-the-wisps-5-big-changes-that-are-coming-to-ori-2",
    "Cuphead": "https://www.techradar.com/news/cuphead-5-things-you-need-to-know-about-the-xbox-indie-darling"
  }
}