{
  "source": "https://www.techradar.com/news/moto-g100-samsung-galaxy-a82-and-more-phones-unveiled-in-massive-phone-leak",
  "title": "Moto G100, Samsung Galaxy A82 and more phones unveiled in massive phone leak",
  "category": "phones",
  "updated": "2021-03-15T09:49:29Z",
  "author": "tom-bedford",
  "summary": "Google has leaked loads of phones",
  "article": [
    "Hard-working leakers will spend ages finding out information on an upcoming smartphone to leak; Google, on the other hand, is apparently able to reveal the existence of loads of unconfirmed smartphones at the bat of an eye. We know this, because it's done just that.",
    "As spotted by 9to5Google, Google's ARCore recently added reference to a bunch of new smartphones - this is a list of all the phones that support Google's AR services, and the phones' existence on the list makes it seem almost definite they're real devices.",
    "Some of the phones listed were ones we already know, including the Moto G10, Moto G30 and Asus ROG Phone 5 which were already unveiled, the Vivo X60 and Oppo Reno 5 Pro Plus which were released in China, and the Realme 8 Pro which has already been teased. Some of the phones are brand new though.",
    "The Moto G100, LG Stylo 7, Asus Zenfone 8 Flip and Samsung Galaxy A52, A72 and A82 were all name-dropped - none of those have been confirmed by their own companies, and some of them hadn't even been leaked before. That's pretty embarrassing for Google.",
    "It's worth noting that all reference to these new phones has been dropped, even the ones that were already confirmed (or launched).",
    "It seems that Google's new ARCore list covers phones that span a wide amount of time, so we might not see all of these upcoming phones straight away.",
    "Some, though, might be just around the corner - a new Samsung phone event is taking place on March 17, where we could see those three new phones.",
    "We'll have to wait and see when these phones get launched, but will be able to do so safe in the knowledge they will launch eventually."
  ],
  "headers": {},
  "links": {
    "9to5Google": "https://9to5google.com/2021/03/14/lg-stylo-7-samsung-a82-more-show-up-on-google-support-doc-hinting-at-incoming-releases/",
    "Moto G10": "https://www.techradar.com/reviews/moto-g10-review",
    "Moto G30": "https://www.techradar.com/reviews/moto-g30",
    "Asus ROG Phone 5": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "Vivo X60": "https://www.techradar.com/news/vivo-x60",
    "new Samsung phone event": "https://www.techradar.com/news/samsung-s21s-mid-range-successor-may-be-revealed-at-next-samsung-unpacked-on-march-17"
  }
}