{
  "source": "https://www.techradar.com/news/microsoft-excel-can-now-do-your-job-for-youyes-really",
  "title": "Microsoft Excel can now do your job for you – yes, really",
  "category": "computing",
  "updated": "2021-10-01T04:45:20Z",
  "author": "jess-weatherbed",
  "summary": "Automate the boring bits",
  "article": [
    "Microsoft Excel just got an update that could streamline your workday by allowing you to automate repetitive tasks, without the need for VBA Macros. Office Scripts are a new way for users to record their actions inside an Excel workbook (such as converting a freshly imported spreadsheet into a presentation for daily meetings) and save it as a script to be used later or shared with others. This anticipated feature for the spreadsheet software has now entered general availability for anyone with a commercial or education version of Microsoft 365, after being announced back in November 2019. You can find the Office Scripts feature in the Automate tab on the upper taskbar/ribbon.",
    "On its blog overview for the new update, Microsoft states \"as an example, say you start your workday by opening a .csv file from an accounting site in Excel. You then spend several minutes deleting unnecessary columns, formatting a table, adding formulas, and creating a PivotTable in a new worksheet. Those actions you repeat daily can be recorded once with the Action Recorder. From then on, running the script will take care of your entire .csv conversion. You'll not only remove the risk of forgetting steps, but be able to share your process with others without having to teach them anything.\"",
    "You can even set a specific time to run a script on a schedule using Power Automate, formerly known as Microsoft Flow, allowing you to trigger a set of actions to react to a specific event, even outside of other applications and services. This can also be set to just respond to a timer to create hourly reports or declutter ongoing downloads.",
    "Microsoft has provided a list of script samples and scenarios for you to use right off the bat, as well as instructional video tutorials to guide you through creating your own. In essence, if part of your job involves running the same daily tasks, this will be a blessing, saving you time to get on with other less mundane tasks by allowing you to action your usual daily process with just the press of a button. You can learn more about this new feature on the Dev update page, including troubleshooting for any issues you may encounter trying to use Office Scripts or Power Automate.",
    "Via MSPowerUser"
  ],
  "headers": {
    "2": "Making life easier"
  },
  "links": {
    "Microsoft Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "spreadsheet software": "https://www.techradar.com/best/spreadsheet-software",
    "Power Automate": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1199811747826713300&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-gb%2Fpower-automate%2F",
    "script samples and scenarios": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1233132216335236900&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-gb%2Foffice%2Fdev%2Fscripts%2Fresources%2Fsamples%2Fsamples-overview",
    "Dev update page": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1252876229919471000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Foffice%2Fdev%2Fscripts%2Foverview%2Fexcel",
    "MSPowerUser": "https://mspoweruser.com/office-scripts-microsoft-automate-tasks/"
  }
}