{
  "source": "https://www.techradar.com/news/a-future-samsung-phone-could-have-an-under-display-camera-based-on-this-patent",
  "title": "A future Samsung phone could have an under-display camera based on this patent",
  "category": "phones",
  "updated": "2021-01-08T10:29:25Z",
  "author": "james-rogerson",
  "summary": "Two screens are needed to make it work",
  "article": [
    "It’s been rumored for a while that Samsung – among many other smartphone companies – is working on under-display cameras, and now a patent has been filed by the company showing exactly how this tech might work.",
    "Filed with the USPTO (United States Patent and Trademark Office) and spotted by LetsGoDigital, the patent, called simply ‘Display Device’, details a phone with two different display panels on the front.",
    "The bulk of the screen would use one panel – a panel that’s much like those we find on smartphones now, but a section housing the selfie camera (which is shown in various possible positions in the image below) would use a separate panel.",
    "This second panel would have higher light transmission than the main one and may also be a lower resolution, two things that would help the camera work through it. Speaking of which, the patent talks about a camera, flash module, and infrared blaster all being housed under this second panel.",
    "While there would be two panels though they would of course be seamlessly connected, so that to the user it would just look like one panel, with the only possible sign of a split being the differing resolutions that might be offered.",
    "Hopefully if the secondary panel is lower resolution it won’t be much so, or alternatively will be a small enough panel that it won’t much matter, but these are the sorts of things Samsung is probably working on now.",
    "Still, even if it is noticeably lower resolution, that could be preferable to having a visible notch or cut-out for the selfie camera, as with an under-display one the camera theoretically wouldn’t be visible at all when not in use.",
    "So when might we see this patent put into practice? That’s unclear. Some sources suggest the Samsung Galaxy Z Fold 3 (probably landing sometime this year) could be the first Samsung phone with an under-display camera, but we’ve previously heard that other Samsung phones would have one, and they didn’t in the end.",
    "This patent is firm evidence that Samsung is at least exploring the idea, but whether we’ll see this or any version of it in a Samsung phone anytime soon remains to be seen. That said, the ZTE Axon 20 5G already has an under-display camera, so if you can’t wait for Samsung there’s at least one other option.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/samsung-under-display-camera/",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "could be the first Samsung phone with an under-display camera": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-have-an-under-display-camera",
    "ZTE Axon 20 5G": "https://www.techradar.com/news/zte-axon-20-5g-the-worlds-first-phone-with-an-under-display-camera-is-on-sale-now",
    "GSMArena": "https://www.gsmarena.com/samsung_patent_reveals_how_the_company_plans_to_make_underdisplay_cameras-news-47076.php"
  }
}