{
  "source": "https://www.techradar.com/news/assassins-creed-valhalla-on-pc-just-got-ps5s-best-feature",
  "title": "Assassin’s Creed Valhalla on PC just got PS5’s best feature",
  "category": "gaming",
  "updated": "2021-07-05T15:16:22Z",
  "author": "darren-allan",
  "summary": "Bow aiming gets the benefit of adaptive triggers",
  "article": [
    "Assassin’s Creed Valhalla just got better on the PC for those playing with a PS5 DualSense controller, as Ubisoft has patched the PC version to support its adaptive triggers.",
    "As you’re likely aware, the adaptive triggers and haptic feedback of the DualSense controller have been one of the big success stories of the PS5 – we’ve certainly enthused about the transformative nature of these fresh features in terms of immersion – and it’s possible to use the DualSense controller on a PC.",
    "While initially there was no support for the aforementioned fancy extras on PC, back in May, Metro Exodus: Enhanced Edition received a patch to enable the adaptive triggers and haptics for firing guns, making firefights a more satisfying experience.",
    "And now, Assassin’s Creed Valhalla has done the same in a stealthy update, as spotted by VGC. Just as with Metro Exodus, you’ll need to have the controller connected via its cable to get the benefit, and when aiming a bow in Valhalla, the trigger will stop halfway, requiring a further pull to actually fire – exactly how launching an arrow works on the PS5.",
    "That’s the only benefit with the DualSense controller on both console and PC for Valhalla, but it’s still a very smart extra for PC gamers, and hopefully suggests that support for the triggers and haptics will be coming to further titles before long (now that we’ve seen two games take up the adaptive gauntlet, as it were, in as many months).",
    "That said, it’s taken some time for this support to come through, seeing as the PS5 controller was first introduced to gamers on Steam back in November 2020.",
    "If you want to know how to hook up your PS5 controller to your computer, we’ve got a full guide on how to use your DualSense controller on a PC.",
    "In terms of PS5 and Windows 10 gaming synergy, there’s recently been another reason for PC gamers to get excited – namely the acquisition by Sony of Nixxes Software, an expert dev house when it comes to PC ports.",
    "That could suggest more ports are on their way, and of course, Sony has already indicated this – albeit that PC players will have to wait until the ‘right time’, with a suitable delay from the PlayStation launch (unsurprisingly).",
    "Remember that Horizon Zero Dawn and Days Gone have been ported over from the PS4, with Uncharted 4: A Thief’s End potentially next in line."
  ],
  "headers": {
    "7": "Port storm?"
  },
  "links": {
    "Assassin’s Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "enthused about the transformative nature": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Metro Exodus: Enhanced Edition received a patch": "https://www.techradar.com/news/one-of-the-best-ps5-features-is-now-available-on-pc",
    "VGC": "https://www.videogameschronicle.com/news/assassins-creed-valhalla-has-quietly-added-dualsense-support-on-pc/",
    "how to use your DualSense controller on a PC": "https://www.techradar.com/how-to/how-to-use-the-ps5-dualsense-controller-on-a-pc",
    "namely the acquisition by Sony of Nixxes Software": "https://www.techradar.com/news/sony-might-be-bringing-more-ps5-games-over-to-pc-with-its-latest-acquisition",
    "Sony has already indicated this": "https://www.techradar.com/news/sony-is-waiting-for-the-right-times-to-release-ps4-games-on-pc",
    "Uncharted 4: A Thief’s End potentially next in line": "https://www.techradar.com/news/ps4-hit-uncharted-4-could-be-headed-to-pc"
  }
}