{
  "source": "https://www.techradar.com/news/black-friday-streaming-deals-save-on-hulu-disney-plus-hbo-max-subscriptions",
  "title": "Black Friday streaming deals: save on Hulu, Disney Plus, HBO Max subscriptions",
  "category": "entertainment",
  "updated": "2021-11-26T15:51:56Z",
  "author": "henry-st-leger",
  "summary": "Bingeing your favorite TV shows has never felt so cheap",
  "article": [
    "Subscribing to all the TV streaming services you want can be an expensive endeavor – but these Black Friday streaming deals are set to help you out on your quest.",
    "Hulu is running an astonishingly good Black Friday deal for US viewers, offering a full 12 months of the service for only $0.99 a month. You will be putting up with the ad-supported tier, but it's still a brilliant price and very hard to say no to.",
    "But why pay little, when you could pay nothing? That's the argument from Disney Plus, which you can use free for six months if you subscribe to Amazon Music Unlimited.",
    "The average US household is estimated to use eight streaming services a week – according to analysts at Omdia – and that's a big total bill each month. But until someone releases an all-access pass to all of the biggest platforms, these Black Friday streaming deals should help reduce some of the damage.",
    "Want to see how much Hulu's other plans cost? We’ve included the pricing on all three services down below."
  ],
  "headers": {
    "4": "Today’s best Hulu deals",
    "5": "Other early Black Friday deals"
  },
  "links": {
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "$0.99 a month": "https://click.linksynergy.com/fs-bin/click?id=kXQk6*ivFEQ&offerid=966271.977&type=3&subid=0&u1=trd-us-7596178648328686000",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "subscribe to Amazon Music Unlimited": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fmusic%2Famazon-music-disney-plus-promotion%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1207246655998933800-20"
  }
}