{
  "source": "https://www.techradar.com/news/developing-apps-for-windows-10-just-became-a-little-easier",
  "title": "Developing apps for Windows 10 just became a little easier",
  "category": "computing",
  "updated": "2021-03-30T14:11:36Z",
  "author": "mayank-sharma",
  "summary": "Project Reunion reaches a major milestone.",
  "article": [
    "Microsoft has taken another step forward with its Project Reunion to allow Windows developers to easily write apps that make use of the modern Windows 10 features.",
    "Announced at the Build 2020 conference, Project Reunion had its first release in December last year, and is Microsoft’s attempt to bridge the gap between Win32 and Universal Windows Platform (UWP) to ease app development. Microsoft is developing Project Union on GitHub under the open source MIT license.",
    "“Project Reunion is a set of libraries, frameworks, components, and tools that you can use in your apps to access powerful Windows platform functionality from all kinds of apps on many versions of Windows,” is how the developers describe the project on GitHub.",
    "Project Reunion is not a new app model, but rather a set of libraries that developers add to their existing apps to modernize them.",
    "With the release of v0.5, the project has reached a major milestone on its way to the final 1.0 release expected in Q4 2021 as per the official roadmap.",
    "According to the release notes, the latest 0.5 release is supported for use in MSIX-packaged desktop apps in production environments. Furthermore, packaged desktop apps that use the latest release can be published in the Microsoft Store.",
    "The biggest component of this release is support for the Windows UI (WUI) library 3.The Project Reunion 0.5 release includes Visual Studio project templates to help developers build user interfaces using the next generation of the user experience platform for Windows apps.",
    "While the 0.5 release currently supports Windows 10 releases down to the October 2018 update, the final release will work on all supported versions of the operating system.",
    "Via: ZDNet"
  ],
  "headers": {
    "3": "Modern app development"
  },
  "links": {
    "developers": "https://www.techradar.com/news/best-laptop-for-programming",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "first release": "https://www.techradar.com/news/windows-10-could-see-big-changes-as-microsoft-officially-launches-project-reunion",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "ZDNet": "https://www.zdnet.com/article/microsofts-project-reunion-hits-the-0-5-milestone/"
  }
}