{
  "source": "https://www.techradar.com/news/oneplus-is-merging-with-oppo-heres-what-that-could-mean-for-android-phones",
  "title": "OnePlus is merging with Oppo: here's what that could mean for Android phones",
  "category": "phones",
  "updated": "2021-06-28T11:09:42Z",
  "author": "james-rogerson",
  "summary": "The name will remain",
  "article": [
    "OnePlus has achieved a lot in the years since it launched the OnePlus One in 2014, but now the company could be undergoing its biggest change since it formed, as it’s merging with Oppo.",
    "Well, the word ‘merge’ isn’t actually used in the forum post where OnePlus CEO Pete Lau announced the change, but it certainly sounds a lot like a merger, with Lau saying they’ve “decided to further integrate our organization with OPPO.”",
    "Based on the post, it seems this will involve things like integrating teams and sharing resources, as you’d expect in a merger. That said, the OnePlus brand will remain separate from Oppo, so you can expect both companies to continue releasing phones.",
    "So what will this move actually mean? It might not amount to much. Both OnePlus and Oppo are subsidiaries of BBK Electronics already, so they’ve always been linked, and last year Lau began overseeing product strategy for both OnePlus and Oppo, a move which saw some of their teams becoming integrated.",
    "So this might not be a massive shift, but it’s sure to mean some changes, and most of them are likely to be positive. Lau points out for example that this allows the two brands to streamline their operations and capitalize on additional shared resources.",
    "Those extra resources should lead to better products, according to Lau, but - while not mentioned - there's a chance it could also lead to a greater range of OnePlus handsets launching, and perhaps lower prices, since this could save the company money in terms of R&D and production costs.",
    "The move will apparently also improve the OnePlus's efficiency, allowing for software updates to arrive faster – and be more stable when they do.",
    "While not announced in this post, it’s possible that the software could undergo some changes too, with OnePlus potentially switching from OxygenOS to ColorOS (the Android overlay used by Oppo). We say that because the OnePlus 9 range in China already uses ColorOS.",
    "Alternatively, perhaps the two interfaces will just become more similar, or maybe nothing will change here – at least outside China.",
    "Back on the hardware front, given that Oppo makes a wide range of other gadgets, such as smartwatches, fitness trackers and wireless earbuds, it might mean OnePlus will expand its non-smartphone offerings too.",
    "We could also see OnePlus phones with ever faster charging, given that Oppo is one of the leaders there, and this might even lead to a foldable or rollable OnePlus phone, since Oppo is working on flexible devices.",
    "Finally, this move might lead to the phones put out by OnePlus and Oppo becoming even more similar than many of them already are. That would be a less-positive change, not because Oppo’s phones are bad, but because we like variety. But it seems a likely outcome, despite OnePlus’s claims that it will continue to operate independently.",
    "We wouldn’t necessarily expect this move to affect the OnePlus 9T much, since that’s probably already well into development, but it will be interesting to see what it means for the OnePlus 10 and the Oppo Find X4."
  ],
  "headers": {
    "3": "Better, faster and potentially cheaper",
    "9": "More devices with more similarities"
  },
  "links": {
    "OnePlus One": "https://www.techradar.com/reviews/phones/mobile-phones/oneplus-one-1244307/review",
    "forum post": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-1043792270114255500&sharedId=trd-us&u=https%3A%2F%2Fforums.oneplus.com%2Fthreads%2Fa-new-journey-for-oneplus.1454492%2F",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "working on flexible devices": "https://www.techradar.com/news/oppos-next-foldable-phone-will-have-a-rollable-oled-display-but-you-cant-buy-it",
    "Oppo’s phones": "https://www.techradar.com/news/best-oppo-phones",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "Oppo Find X4": "https://www.techradar.com/news/oppo-find-x4"
  }
}