{
  "source": "https://www.techradar.com/news/lexus-ux-300e-review",
  "title": "Lexus UX 300e review: a good start, but this EV has room for improvement",
  "category": "car-tech",
  "updated": "2021-06-26T09:30:55Z",
  "author": "john-mccann",
  "summary": "The first fully-electric Lexus falls down in a few areas",
  "article": [
    "Lexus has been producing self-charging hybrid vehicles for a number of years, and it’s not rushed into producing a fully electric car. However, now it has, and the Lexus UX 300e is the firm's first EV (electric vehicle).",
    "The Japanese auto maker skipped over plug-in hybrids (PHEV) in favor of going all electric first, but the new Lexus NX 450h+ PHEV will be available by the end of 2021.",
    "The Lexus UX 300e price starts at £41,745, with the \"with Premium Plus Pack\" grade we drove starting at £45,245, and with the addition of metallic paint the total cost of the vehicle we drove was £47,400.",
    "There is also a range-topping “with Takumi Pack” which upgrades the central display inside the vehicle to a 10.3-inch offering with navigation, plus an upgraded sound system and more.",
    "That puts the UX 300e in direct competition with another luxury, crossover fully-electric SUV - the Mercedes EQA.",
    "The UX 300e features classic Lexus design, inside and out. Whereas some manufacturers have opted to push the boundaries of design for something that looks a little different to the rest of the range, the Lexus UX 300e goes almost undetected as the firm's first - and currently only - fully electric car.",
    "That's not an issue, and Lexus fans will likely be pleased to see the familiar styling and interior layout.",
    "There's a mix of ruggedness and sporty in the exterior design, with sizable plastic wheel arches and a sloping rear window with small spoiler. While the rear design is attractive, it does leave you with somewhat of a shallow rear windscreen, reducing the visibility out the back.",
    "Climb inside and the crossover nature of this compact SUV gives you a slightly elevated ride height, producing an improved view of the road ahead.",
    "The cabin has the premium finish you'd expect from Lexus, and the first signature analogue clock sits next to the main display in the center of the dash.",
    "In the \"with Premium Plus Pack\" grade, the front seats come with both heating and cooling functions.",
    "At the base of the center console you'll find dual cup holders and a phone tray with wireless charging just behind them. The central armrest opens to provide more storage, while the front door pockets are small with space for a bottle and a wallet and that's about it.",
    "The front seats are comfortable however and there's enough leg and head room here, but things are a little different in the back.",
    "Rear seat passengers will find that room is at a premium, and you'll find the floor level is higher than you'd expect - which means your knees and legs are in a more uncomfortable position.",
    "The sloping roof line means adults - especially those who are taller - will find it a cramped space to be.",
    "There's not much in the way of storage either, with no door pockets and a single magazine slip on the back of a seat.",
    "There are a couple of nice highlights though, with heated outer seats (sorry middle seat passenger, a cold bum awaits), and access to two USB ports allowing those in the back to charge their devices.",
    "The Lexus UX 300e provides an excellent ride. It's smooth, quiet and relatively effortless at all speeds.",
    "There are three drive modes to choose from, with 'Normal' being the default and providing a balanced setup between economy and power. Switch to Sport and you'll be able to get close to the UX 300e's touted 0-62mph time of 7.5 seconds, delivered from an electric motor that produces 201bhp.",
    "That's not too bad, and provides enough pick up to get you away from junctions and perform overtakes at higher speeds - although a top speed of 100mph shows that this crossover SUV is, unsurprisingly, better suited to the city than the racetrack.",
    "For the times when you want to conserve as much battery power as possible you can switch to Eco, which reduces acceleration and increases regenerative braking to help you go as far as possible on a single charge.",
    "You can adjust the level of regenerative braking by using paddles located just behind the steering wheel to increase and decrease the amount of engine braking when you lift off the accelerator. Increasing it will help conserve battery power, especially useful if you're running low.",
    "Lexus says the UX 300e can offer up to 196 miles from a single charge of the 54.3kWh battery, but you'll need to be driving very efficiently in Eco mode almost exclusively to get that.",
    "During our time with the UX 300e, we were averaging around 160 miles with a mix of driving in the city, on country roads, and on higher speed lanes. That's okay, but it's not a leader in terms of range and there are other EVs which can offer more distance.",
    "Handily, the Lexus UX 300e features two charging ports - one above each of the rear wheel arches. One side is a fast-charging CHAdeMO DC port for use at EV charging stations, while the other side has a Type 2 AC connector which supports slower speeds (up to 6.6kWh) and is best suited for at-home charging.",
    "With a dedicated home wallbox capable of delivering 6.6kWh you can fully recharge the UX 300e in eight hours and 15 minutes, while plugging it directly into a mains socket in your home will be much slower - taking 19 hours for a full charge.",
    "Meanwhile a full charge at a fast charging station via the DC connector can take as little as 50 minutes.",
    "Look mom, no nav! The Lexus UX 300e doesn't have a sat nav. A bit of a peculiar omission - especially in a fully electric car, where technology is more at the forefront of the vehicle than ever, and also when you consider the list price.",
    "There is a sat-nav option, but it's only available in the range-topping UX 300e with Takumi Pack. All is not lost, as it does support both Apple CarPlay and Android Auto as standard at all grades.",
    "This support allows you to connect your smartphone to the UX 300e via a USB cable and access select apps - including Apple Maps and Google Maps - on the car's main 7-inch display.",
    "The display does feel a little on the small side, but is bright and clear - with a simple interface that's relatively easy to navigate.",
    "We say relatively, as unlike many displays in modern cars, this one isn't touch sensitive. Instead you have to use a laptop-like trackpad, which sits between the front seats with an array of shortcut buttons, to move around.",
    "There will be some people who prefer this non-touchscreen interface, but we found it to be a little slow, and not always as responsive as we’d like. It takes longer to drag your finger across the pad to highlight the option you want, versus just tapping the screen.",
    "It does provide a safer way to interact with the infotainment system when driving a phone, as you can feel for the buttons rather than attempting to prod at a screen which tends to draw your focus away from the road more.",
    "You'll find audio and phone options on-screen, and you can opt to connect your handset to the car via Bluetooth instead of via the USB cable, which will allow you to stream music to the UX 300e's speakers and make and receive calls hands-free.",
    "Meanwhile the cluster display behind the steering wheel is divided into three sections, with only the right hand third able to be customized. You can pick from a range of things to be displayed here, including drive information, audio, driver aids, messages and settings.",
    "There are physical buttons for climate control, along with the heated and ventilated seats, and the heated steering wheel.",
    "You get a reversing camera plus front and rear parking sensors to help you operate in tight spaces, while lane assist and adaptive cruise control works well and makes long journeys less taxing on the driver.",
    "The sound system is very good, producing clear, crisp audio with punchy bass, even at high volume. You get controls for audio on the steering wheel too, allowing you to skip tracks, change stations and adjust volume with ease.",
    "There's a wireless charging pad for compatible smartphones at the base of the center console along with a pop-up 12v socket, while two USB ports and a 3.5mm headphone jack reside under the central arm rest.",
    "The Lexus UX 300e is a promising start in the fully electric market for the Japanese firm, but there are a number of areas where it falls down versus its competitors.",
    "If you're sold on the Lexus brand, styling and drive-ability, then the UX 300e provides a gentle transition into the world of EVs, but if you're on the hunt for a fully electric vehicle that gives you bang for you buck this option doesn't quite hit the mark.",
    "Limited rear space, a basic infotainment system and middling range are the key areas where there's room for improvement, yet if these are less important to your usage then you may find the Lexus UX 300e fits the bill."
  ],
  "headers": {
    "5": "Lexus UX 300e design",
    "17": "Lexus UX 300e drive, range and charging",
    "27": "Lexus UX 300e specs and tech",
    "40": "Verdict"
  },
  "links": {
    "will be available by the end of 2021": "https://www.techradar.com/news/the-new-lexus-nx-has-two-features-thats-got-us-saying-finally",
    "Mercedes EQA": "https://www.techradar.com/news/mercedes-benz-eqa-review-mercs-affordable-ev-gets-almost-everything-right"
  }
}