{
  "source": "https://www.techradar.com/news/playdate-pre-orders-price-features-and-season-one-games",
  "title": "Playdate pre-orders, price, features and season one games",
  "category": "gaming",
  "updated": "2021-07-30T07:13:44Z",
  "author": "rhys-wood",
  "summary": "With the Playdate, what’s old is new again",
  "article": [
    "Update: Playdate pre-orders are still available, but shipments from here on out will arrive in 2022, according to the official website. Details below.",
    "The Playdate is a curious little thing. Created by video game publisher Panic, this delightfully retro handheld evokes a Game Boy-like aesthetic from both a hardware and software standpoint, while also offering modern conveniences like Wi-Fi connectivity and USB-C charging.",
    "It comes as a nice surprise and, hopefully, a worthwhile alternative to two upcoming handheld giants, those being the Nintendo Switch OLED and the Steam Deck – the former being an arguably minuscule upgrade to aging hardware, while the latter boasts impressive specs and Steam library portability at a relatively high price.",
    "The Playdate, then, might be something that’s genuinely refreshing in the handheld space. It’s more affordable than both the Steam Deck and Switch OLED, and comes with its own suite of tailor-made games. Interested? Read on to find out how you can pre-order the Playdate for yourself, as well as what to expect on the device, and when you can finally play it.",
    "Pre-orders for the Playdate handheld console opened on Panic's very own website on Thursday, July 29 at 10am PDT / 1pm EDT / 6pm BST.",
    "The initial cost is $179 (around £129 / AU$239) before shipping and, for that price, you’ll get the console and access to 24 games as part of ‘Season One’ of the Playdate’s library.",
    "You can also pre-order the Playdate Cover for $29 (around £19 / AU$39). This clamshell-like cover folds over your PlayDate, and secures itself magnetically to the device, allowing you to protect your screen more efficiently.",
    "If you're just now catching onto the Playdate, mark your calendar for 2022. The late 2021 shipments for the console – some 20,000 units for 2021 says Playdate maker Panic – have given way to a 2022 delivery date.",
    "There’s no word as of yet on the Playdate’s official launch date, but it’s expected to release sometime in 2021. With the Nintendo Switch OLED launching this October, though, Panic might want to get its handheld out there before Nintendo’s mid-gen upgrade hits the market.",
    "A stereo dock is also in development for the Playdate, though no price or release date has been announced for it just yet. The dock will be able to charge your console and acts as a Bluetooth speaker and pen holder. Yes, really.",
    "On its website, Panic notes the Playdate is “familiar,” but insists that it’s “unlike anything you’ve ever seen.” It may well be right about that, as the handheld certainly has an odd build, and some strangely unique features, too.",
    "Let’s look at what’s most important first, though: that lovely-looking 2.7-inch reflective monochrome screen. If that sounds a little on the smaller side, that’s because it is. The Playdate is a tiny device, but much like Nintendo’s oft-forgotten Game Boy Micro, games are sure to look remarkably sharp and clear on such a bespoke screen.",
    "In terms of controls, the Playdate features a simple D-Pad and two face buttons. There’s a menu button located above the speaker and next to the screen, which may also be used to pause games or activate other ancillary features like putting the system to sleep.",
    "What sticks out the most though – literally – has to be the crank on the side of the Playdate. This crank folds outward and can be manipulated as a control method for certain games. It’s easily mistaken as one of those kinetic charging functions – one that would let you charge up the battery by cranking the mechanism – but Playdate’s website insists that isn’t the case.",
    "Now onto the really interesting stuff. As mentioned, purchasing the Playdate will grant you access to 24 games, to be released on a consistent schedule of two games per week. You don’t have to pay anything extra to access the games, and they’ll be added to the system automatically each week.",
    "The Playdate website states that this is just the first season of games, too, with more planned in the future: “We’re lining up more games, and we’re working on cool ways to distribute them.”",
    "Here's the list of currently confirmed season one games:",
    "If you’re the creative type, the Playdate could be a perfect match for you, too. The Playdate SDK will be made available for free sometime after launch. When paired with Playdate’s browser-based Pulp game maker, you’ll be able to develop and test your own Playdate games and side-load them directly onto the console.",
    "We’re definitely impressed with what we’ve seen so far with the Playdate handheld console. There’s a ton of handhelds out there that are just shoddily made, but we don’t get that impression from the Playdate. The console looks sleek and professionally made, and we love its distribution model featuring entirely unique games released on a regular basis.",
    "Can’t wait for the Playdate? Check out these Nintendo Switch Lite deals below:"
  ],
  "headers": {},
  "links": {
    "Playdate": "https://www.techradar.com/news/playdate-takes-on-nintendo-switch-dock-with-speaker-stand-accessory",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "very own website": "https://play.date/",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079"
  }
}