{
  "source": "https://www.techradar.com/news/fossil-gen-6-wear-os-smartwatch-revealed-in-leaked-images-and-specs",
  "title": "Fossil Gen 6 Wear OS smartwatch revealed in leaked images and specs",
  "category": "wearables",
  "updated": "2021-08-19T09:07:28Z",
  "author": "david-nield",
  "summary": "Here's what's next from Fossil",
  "article": [
    "All of a sudden, the Wear OS smartwatch scene is exciting again: following on from the big reveal of the Galaxy Watch 4 Classic and the Galaxy Watch 4 (featuring Samsung's take on Wear OS), we've got a sneak preview of the next watches coming from Fossil.",
    "Fossil has already confirmed a Gen 6 model sporting the new and updated Wear OS is on the way, and thanks to some digging from WinFuture, we've now got leaked images and specs for the smartwatch models too. According to this unconfirmed information dump, they could be unveiled on September 27.",
    "According to WinFuture, the Gen 6 series will run the Qualcomm Snapdragon Wear 4100 Plus chipset launched last year: it's currently the fastest chipset around for Wear OS, and is a significant step up from the Wear 3100 processor in the Fossil Gen 5 smartwatches.",
    "You'll apparently be able to buy Fossil Gen 6 watches in 42mm or 44mm sizes, with straps options made of leather, fabric and metal. Water resistance up to a depth of 50 meters will be on \"most\" of the available models, it sounds like.",
    "There will be 8GB of internal memory on these watches, say the sources speaking to WinFuture, as with the Gen 5 models. The screens will be 1.28 inches in size, with a resolution of 416 x 416 pixels, which again matches the previous generation.",
    "Battery life is listed as 24 hours between charges, and all the usual sensors – including one for oxygen saturation – are mentioned. The quoted price in Europe is €299-329, which works out at about $350-385 / £255-280 / AU$490-535 with a straight currency conversion.",
    "There's an awful lot to like about the Apple Watch: it's speedy, it's stylish, it boasts an incredible number of functions and features, and it works seamlessly with other gadgets... as long as they're all made by Apple.",
    "However, after years in the doldrums, Wear OS is back. Google seems interested in smartwatches again, Samsung is getting heavily involved, and now we have new smartwatches on the way from Fossil – which to be fair has done an admirable job of keeping the Wear OS flag flying with its products down the years.",
    "With the right investments in hardware and software, there's no reason why Wear OS can't take on the Apple Watch in the same way that Android battles iOS for market share. There are plenty of people out there without an iPhone who want a top-quality smartwatch to wrap around their wrist.",
    "Based on its past track record, the Fossil Gen 6 models should be well worth looking out for – and by the end of the year we might even have seen the long-awaited Google Pixel Watch (no doubt with a bit of a Fitbit flavor added to it)."
  ],
  "headers": {
    "3": "Smart specs",
    "6": "Analysis: the Apple Watch isn't invincible"
  },
  "links": {
    "Wear OS smartwatch": "https://www.techradar.com/news/best-wear-os-watch",
    "Galaxy Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "already confirmed": "https://www.techradar.com/news/fossil-is-making-a-new-premium-smartwatch-for-the-new-wear-os",
    "WinFuture": "https://winfuture.de/news,124696.html",
    "Fossil Gen 5 smartwatches": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Wear OS is back": "https://www.techradar.com/news/wear-os-3-name-announced",
    "Google Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "Fitbit flavor added to it": "https://www.techradar.com/news/5-likely-reasons-why-google-just-bought-fitbit"
  }
}