{
  "source": "https://www.techradar.com/news/ipad-mini-6-leak-shows-design-but-dont-expect-it-at-todays-apple-event",
  "title": "iPad mini 6 leak shows design, but don't expect it at today's Apple event",
  "category": "tablets",
  "updated": "2021-09-14T09:09:26Z",
  "author": "james-rogerson",
  "summary": "Two designs shown and specs leaked",
  "article": [
    "We’re just hours away from the announcement of the iPhone 13 range, set to happen at 10am PDT / 1pm EDT / 6pm BST on September 14, or 1am ACT September 15 in Australia, but while other products might land alongside it, leaks suggest the iPad mini 6 won’t. That said, Apple’s next mini slate can’t be too far off, as case renders have just emerged revealing the possible design.",
    "Majin Bu (a leaker on Twitter) shared images of two different case renders, one of which lines up with what we’ve seen before, complete with no home button and with the volume buttons housed on one of the long edges.",
    "However, the other is a bit different, with the power and volume buttons on the top edge alongside some of the speaker grilles. This makes that edge look cluttered, but the reasoning for it is clear – it’s so that there’s space for the Apple Pencil to be housed on one of the long edges.",
    "The source suggests that they had previously heard the design we’ve seen multiple times would be the final one, possibly paired with a smaller Apple Pencil, but speculates that in the end Apple might have gone with this new design in order to allow for a full size Apple Pencil to be housed on the slate.",
    "Given that this is the first we’re seeing of this design we’d take it with a pinch of salt, but we can’t rule it out, and either way it looks like the iPad mini 6 will ditch the home button, which is sure to be the biggest visual change.",
    "The source also claims that the iPad mini 6 will have an 8.6-inch screen with Touch ID (which is rumored to be built into the power button rather than the home button this time), and that it will have an A14 chipset (the same as the iPhone 12), a Smart Connector, USB-C, and Apple Pencil 2 support. It will also apparently come in space gray, silver, rose gold, green, and sky blue shades.",
    "Given that the iPad mini 6 is rumored to have a much different – and much more modern – design to its predecessor, coupled with a likely larger screen and potentially 5G support, it could make for an exciting upgrade, one that’s likely to stand out in any event that doesn’t feature a new iPhone.",
    "So don’t be surprised if when the iPad mini 6 does launch (probably within a few weeks if leaks are right) it’s the star of whatever event it appears at – even with a new iPad (2021) and a new MacBook Pro possibly landing alongside it.",
    "There’s still an outside chance that the iPad mini 6 will arrive today (September 14) but if it does it’s liable to be buried under iPhone hype – even though it looks like a more substantial upgrade than Apple’s upcoming phone.",
    "Via PocketNow"
  ],
  "headers": {
    "6": "Analysis: the iPad mini 6 could be the star of the show in a few weeks’ time"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPad mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "one of which": "https://twitter.com/MajinBuOfficial/status/1437435274376720386",
    "the other is a bit different": "https://twitter.com/MajinBuOfficial/status/1437136558331727873",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "if leaks are right": "https://www.techradar.com/news/expect-iphone-13-and-apple-watch-7-on-september-14-ipad-and-mac-to-come-later",
    "new iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "PocketNow": "https://pocketnow.com/case-images-reveal-ipad-mini-design-change-and-support-for-full-size-apple-pencil"
  }
}