{
  "source": "https://www.techradar.com/news/this-echo-dot-and-smart-light-bulb-bundle-can-kick-start-your-smart-home-for-a-low-price",
  "title": "This Echo Dot and smart light bulb bundle can kick start your smart home for a low price",
  "category": "appliances",
  "updated": "2021-08-20T09:14:57Z",
  "author": "carrie-ann-skinner",
  "summary": "Act now to get the Amazon Echo Dot (2020) and a TP Link smart light bulb for less",
  "article": [
    "The best smart speakers not only enable you to listen to your favorite streaming services, they also let you control several smart home devices at the same time, with just your voice. However, setting up a smart home can be costly, so a good deal on smart home devices is always welcome.",
    "In the US, Amazon has bundled the Echo Dot (2020) with the TP-Link Kasa KL135 Color Smart Light bulb, slashing 45% off the price of buying the two devices separately. They’ll now cost you $39.99 from $72.98. This means you’re paying just $5 for the smart bulbs, and is as good as similar bundles we saw on Black Friday and Cyber Monday. (Not in the US? Scroll down for the best Amazon Echo Dot and Smart Light deals in your region.)",
    "Smart lights are one of the most affordable smart home devices you can buy. They replace your existing light bulbs and connect to the internet, meaning they can be switched on or off and dimmed from your smartphone. However, if you’re not someone that has their phone to hand all the time, this bundle means you can simply ask Alexa, which is built into the Echo Dot, to control the light bulb for you.",
    "As well as being brightened and dimmed, and switched on and off from a smartphone or by Alexa, the color of the TP-Link Kasa Smart Wi-Fi Bulb included in this deal can also be tweaked to one of 16 million colors, making it great for creating dramatic lighting effects in your home.",
    "The Amazon Echo Dot (2020) is the brand’s smallest smart speaker and totes an unusual spherical design that’s a departure from the look of the previous Echo Dot. While the sound quality won’t blow you away - the vocals are clear but it lacks a powerful booming bass - it's the ideal device if you’re looking for a smart speaker to start your smart home journey rather than listen to music on."
  ],
  "headers": {
    "2": "Today’s best Amazon Echo Dot bundle deal in the US",
    "5": "More Echo Dot and smart light deals"
  },
  "links": {
    "best smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "Echo Dot (2020)": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "$39.99 from $72.98": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSmart-speaker-Alexa-Glacier-TP-Link%2Fdp%2FB0939Y5MMP%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3185238593047783000-20",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}