{
  "source": "https://www.techradar.com/news/waze-is-now-a-real-alternative-to-google-maps-thanks-to-new-lane-guidance",
  "title": "Waze has been updated to better rival Google Maps",
  "category": "phones",
  "updated": "2021-08-04T14:18:46Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Don't want to use Google Maps? There is another...",
  "article": [
    "Waze announced at their remote event that lane guidance is coming to the app, alongside a plethora of other features to help you get from home to work in an easier fashion.",
    "Navigation apps such as Apple Maps and Google Maps make it easier than ever to travel from A to B even if you have no idea where you are. Gone are the days of looking at printed roadmaps.",
    "But when you're in an unfamiliar city, there can still be issues when it comes to getting around – such as knowing which lane you need to be in so you don't miss your turn or have to cut across traffic at the last minute.",
    "Google Maps has long featured lane guidance to help drivers get into the correct lane in plenty of time but, despite being owned by the same company, this is something that has been missing from Waze. Now this is changing.",
    "Lane guidance is something that Waze users had been requesting for quite some time, and now users are in luck. If you update your app to the latest version either from the Google Play Store or App store, you'll see a Google Maps-style lane indicators at the top of the screen showing you where you need to position yourself on the road.",
    "At the WazeON event back in September 2020, the Waze teams announced that lane guidance was coming to both Android phones and iPhones.",
    "The below video shows the feature in action:",
    "Lane Guidance kicks in when drivers are around 500 metres from a turn in a city and 1km on motorways, giving plenty of time to switch to the right lane.",
    "The company also announced other features, such as traffic notifications for when a certain build-up of traffic is occurring on your route, alongside route suggestions for your most common journeys.",
    "During 2020, the pandemic caused many highways to be far less busy than what they had been for years. This gave navigation apps an opportunity to improve upon what they've had available for years on Android phones and iOS devices.",
    "With widgets and better ways of seeing how you can get from one destination to another, it's important that map apps keep their user interface clear and concise.",
    "Depending on whether your phone is on a holder so you can glance at it, or its connected to the car by way of Android Auto or Apple's CarPlay, updates to these apps are crucial now that more drivers are returning to the roads, and they want to make sure that there's almost no delays in reaching the destination.",
    "Waze has been a great alternative to Apple Maps and Google Maps, and with guest voices and appearances from franchises such as Halo coming in, it's an innovative app that still has plenty of mileage ahead of itself.",
    "Via 9to5Google"
  ],
  "headers": {
    "5": "Driving in suggested lanes",
    "9": "Analysis: Motorways are coming back"
  },
  "links": {
    "Apple Maps": "https://www.techradar.com/how-to/how-to-report-a-traffic-incident-with-apple-maps-in-ios-145",
    "Google Maps": "https://www.techradar.com/news/major-google-maps-update-includes-useful-pandemic-feature",
    "Halo coming in": "https://www.techradar.com/news/halo-comes-to-your-car-with-master-chief-as-navigator",
    "9to5Google": "https://9to5google.com/2020/09/15/waze-lane-guidance-notifications-update/"
  }
}