{
  "source": "https://www.techradar.com/news/wandavision-season-2-what-we-know-after-the-finale",
  "title": "WandaVision season 2: what we know after the finale",
  "category": "entertainment",
  "updated": "2021-03-05T19:32:18Z",
  "author": "samuel-roberts",
  "summary": "Spoilers for WandaVision episode 9 follow",
  "article": [
    "Spoilers for the complete season of WandaVision follow.",
    "WandaVision has ended on Disney Plus. Clearly, the story of Wanda Maximoff has not ended – in fact, it's only really just begun. Completing her transition into becoming the Scarlet Witch – a powerful figure foretold in the Darkhold book, who can use magic without the aid of incantations or a coven – Wanda must now work out how to control her powers. And possibly save her children, based on the post-credits scene in WandaVision episode 9.",
    "So, is this the end of her and Vision's story together on Disney Plus? For now, yes. But Marvel has not ruled out another season of WandaVision down the line. Below, we've summed up everything we know about a potential WandaVision season 2 so far, including what Marvel's Kevin Feige has said on the matter.",
    "If you want to know more about what the WandaVision episode 9 mid-credits scene means for the future of the MCU, we've got you covered on that front too.",
    "Disney Plus currently has no plans for a WandaVision season 2. While some of the MCU shows rolling out on the platform have been built with a second season in mind, Wanda Maximoff's story is already confirmed to continue in Doctor Strange in the Multiverse of Madness, which is releasing in 2022.",
    "In this movie, we expect Wanda to learn to control her powers, as she alluded to in the WandaVision finale – no doubt with the help of Doctor Stephen Strange, the Sorcerer Supreme. We also expect the post-credits scene of episode 9 to be a factor in the story, as it's teased that Tommy and Billy are crying out for help to their mother.",
    "So what has Marvel said about WandaVision getting a season 2? \"I've been at Marvel too long to say a definite no or yes to anything, in regards to another season of WandaVision,” Marvel Studios head Kevin Feige explained to reporters during the Television Critics Association press tour panel. Whether a second season happens or not \"will be dictated by the story\" of the MCU.",
    "For now, it sounds like Marvel and Disney Plus have no firm plans for a WandaVision season 2, then – but Marvel hasn't ruled out the possibility entirely.",
    "Marvel has plans to make second seasons for some of its upcoming Disney Plus shows, but it's unclear which, yet. \"When we start with a movie, we hope there is a part two, we hope there is part three, but we aren't factoring that into the part 1,\" Feige told THR recently.",
    "\"Some of the shows that I mentioned that we are about to start filming, we are keeping in mind a structure that would lead into a season two or a season three in a more direct way compared to a show like WandaVision that goes into a feature,\" he added.",
    "WandaVision, then, will continue its story in Doctor Strange in the Multiverse of Madness – and that's why a season 2 of the show hasn't been scoped out yet.",
    "According to Feige at the TCAs, though (via TVLine), \"the fun of the MCU is all of the crossover between series and films. Sometimes [a show] will go into a season 2, and sometimes it will go into a movie and then back into a series.\" That would appear to keep WandaVision season 2 on the table, if it follows the second Doctor Strange film.",
    "Will The Falcon and the Winter Soldier be the first to get renewed, since it isn't leading in to an upcoming MCU film (that we know of)? That seems possible (though actor Anthony Mackie has had no discussions about a season 2, according to a recent Variety interview), but we'll have to wait and see for now.",
    "If Marvel did decide to revisit WandaVision, we can see that the sitcom format would be abandoned – the show would have to be about something completely different.",
    "That said, in terms of another set of episodes about Wanda and Vision, there are a couple of unresolved threads in the series that a WandaVision season 2 could pull on – what happened to the White Vision at the end of this season? We saw the revived, once-dangerous Vision body obtain the original Vision's memories and fly away.",
    "Surely, an encounter between this real-world Vision and Wanda Maximoff down the line is something we can expect in the MCU's future? When or where that will happen, however, remains a mystery for the time being.",
    "There's also the matter of what the cry for help meant from Wanda's kids in episode 9's post-credits scene, though we expect to see this resolved in Doctor Strange in the Multiverse of Madness."
  ],
  "headers": {
    "4": "WandaVision season 2 hasn't been ruled out – but it won't happen before Doctor Strange 2",
    "8": "Some MCU shows will get second seasons on Disney Plus, but not others",
    "13": "What could a WandaVision season 2 be about?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "WandaVision episode 9 mid-credits scene": "https://www.techradar.com/news/wandavision-episode-9-mid-credits-scene-explained",
    "THR": "https://www.hollywoodreporter.com/heat-vision/marvels-kevin-feige-talks-wandavision-future-netflixs-heroes-and-r-ratings",
    "TVLine": "https://tvline.com/2021/02/24/wandavision-season-2-renewed-cancelled-disney-plus/",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "recent Variety interview": "https://variety.com/2021/tv/news/anthony-mackie-the-falcon-and-the-winter-soldier-1234919610/"
  }
}