{
  "source": "https://www.techradar.com/news/hurry-this-great-early-macbook-air-black-friday-deal-wont-last-long",
  "title": "Hurry! This great early MacBook Air Black Friday deal won't last long",
  "category": "computing",
  "updated": "2021-11-18T13:39:42Z",
  "author": "matt-hanson",
  "summary": "Now just $899",
  "article": [
    "Not only is the latest MacBook Air the best laptop in the world right now, but it's also now had a great early Black Friday deal, with B&H Photo cutting the price of the MacBook Air M1 to just $899.",
    "(Not in the US? Scroll down for deals in your region).",
    "This deal is for the MacBook Air with Apple's excellent M1 chip, 8GB of unified memory, and 256GB SSD, and has been knocked down to the lowest price we've seen for this model. While B&H hasn't been the first store to offer the MacBook Air for $899, it's currently one of the only places where you'll get it this cheap, and we can't imagine the price dropping any further when Black Friday rolls around on November 26.",
    "If you're in the UK, Amazon has a similar MacBook Air deal that drops the price to £899.",
    "As you'll see when you click through to B&H Photo's MacBook Air deal, the retailer says there is limited stock at this price, so you'll want to act fast before it sells out!",
    "When the MacBook Air (M1, 2020) launched last year, we were incredibly impressed with how Apple had drastically boosted the performance of its thin and light laptop thanks to its new M1 chip, while keeping the MacBook Air's relatively low price.",
    "Not only does it have a gorgeous thin and light design and fantastic screen, it's powerful enough to handle everything from browsing the web to editing 4K videos, and it does all that completely silently, due to its fanless design. It also offers an incredible battery life that puts many of its competitors to shame.",
    "B&H Photo also has some great MacBook Pro Black Friday deals as well, including the latest models, and these are great picks if you want a MacBook Black Friday deal that offers more power.",
    "No matter where you live, you'll find all the lowest prices for the MacBook Air from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best MacBook Air deals",
    "8": "More MacBook Air deals",
    "9": "More Black Friday deals"
  },
  "links": {
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "MacBook Air M1 to just $899": "https://www.bhphotovideo.com/c/product/1604825-REG/apple_mgn63ll_a_13_3_macbook_air_with.html?SID=trd-us-1157499361682914000",
    "drops the price to £899": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FApple-MacBook-Chip-13-inch-256GB%2Fdp%2FB08N5NHG4H%3Fref_%3DOct_d_otopr_d_429886031%26pd_rd_w%3DrvX5K%26pf_rd_p%3D6148cfef-4466-4d6b-bb0d-b7c594ccc8b6%26pf_rd_r%3DXQ6JV0RGN57XRTNP84EG%26pd_rd_r%3D40c93604-7b92-4728-b023-2c66b819935e%26pd_rd_wg%3DStc52%26pd_rd_i%3DB08N5N1WBH%26th%3D1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-7442280825766919000-21",
    "MacBook Air (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pro Black Friday deals": "https://www.techradar.com/black-friday/black-friday-macbook-pro-deals",
    "MacBook Black Friday deal": "https://www.techradar.com/black-friday/black-friday-macbook-deals"
  }
}