{
  "source": "https://www.techradar.com/news/anthem-update-news-dlc-tips-patch-notes-and-more",
  "title": "Anthem: update news, DLC, tips, patch notes and more",
  "category": "gaming",
  "updated": "2021-02-26T18:00:42Z",
  "author": "vic-hood",
  "summary": "Is this an anthem still worth singing?",
  "article": [
    "Anthem, BioWare's cooperative, team-based shooter is a change of pace for the makers of Dragon Age and Mass Effect. With a focus on cooperative PvE combat popularized by the likes of Destiny, it landed amid a swirl of hype and expectation, which it has so far failed to meet.",
    "Anthem had a big challenge in front of it then – with arguments that its endgame content is weak, its loot system broken and its story not up to scratch when compared with previous narrative-driven BioWare RPGs, it's fighting to win back the hearts of those who were initially in awe of its promise.",
    "With EA backing it and BioWare's heritage at its heart, there was hope that Anthem would be redeemed given behemoths such as Destiny and Fortnite all went through rough launches before becoming gaming juggernauts. In February 2020, BioWare announced a dedicated team was working on an ambitious overhaul that would effectively relaunch the game at some point in the future.",
    "Sadly, that dream seems ended: BioWare officially cancelled the planned overhaul in February 2021, instead focusing on upcoming Dragon Age 4 and new Mass Effect projects.",
    "That means no more new content beyond Anthem Cataclysm and whatever else came out. BioWare has pledged to continue live service of the game for its players, but didn't say for how long.",
    "So read on for everything you need to know about the Iron Man simulator and how we got to this point.",
    "As we said in our full Anthem review:",
    "\"It is a game of oxymorons and inconsistencies. The story is designed to be single-player but the game is clearly not. The gameplay is an absolute joy but is stifled by the repetitive nature of the end-game. The character animations are truly sublime, but most of the characters themselves are cliché and predictable.",
    "\"Anthem is a fun game, and a stunningly pretty one, but with flaws in nearly every other aspect of its design. It will improve with patches, updates, and a strong community, but it isn’t a particularly strong foundation. This is less an anthem, and more an annoying earworm...\"",
    "It's finally here! After months of delays, Anthem's Cataclysm event is now live on all platforms.",
    "The new season-long event brings with it a bunch of new features including new enemies, rewards, in-game currency, story missions and much more.",
    "Here's EA's explanation of the Cataclysm event:",
    "\"The people of Bastion have much to fear – malevolent creatures roaming the wilds, fanatical Dominion forces testing their strength and fortitude – but nothing inspires as much terror and dread as a Cataclysm. They are one of the most destructive and chaotic manifestations of the Anthem – leaving devastation and death in their wake. And now, Freelancer, it’s your turn to face the chaos head on and do your best to end it.\"",
    "Essentially it seems like we're going to be venturing into a chaotic, black portal of death. Sounds good.",
    "Cataclysm and arenas First things first, you don't need to be a certain level to jump into the new Cataclysm map area.",
    "To enter the Cataclysm, you select the 'Cataclysm' option from the Game Modes menu and wallah! You're be in the swirly area of possible death. EA warns that it's probably not a great idea to immediately start exploring as the storm will damage your javelin when you're out in it. Instead, you should look to close rifts inside the new arenas.",
    "Arenas are scattered throughout Cataclysm, if you close the rifts inside them then you will be able to \"find temporary shelter from the storm, complete tasks, increase available mission time, and engage in combat for loot, in-game currency, and scoring opportunities\". Seems like the safest option.",
    "But you'll also be able to take part in Cataclysm events in Freeplay mode. There are balls of light in the sky called Storm Gates, when these open you can fly through and complete the objectives within before time runs out to earn rewards. The upper right corner of your screen will tell you how long you need to wait until it opens.",
    "In-game currency and war chests Cataclysm brings with it a new in-game currency in the form of Major Crystals and Minor Crystals. These can be earned and spent during the event.",
    "According to EA, Major Crystals are mainly given out as mission and challenge rewards while Minor Crystals are earned through playing. Minor Crystals can be used to purchase Major Crystals, war chest or vanity items. But, what's in a war chest? All Cataclysm's non-vanity items apparently.",
    "This new in-game currency can be spent at Head Herschel’s Hut in the Fort Tarsis market.",
    "Enemies, rewards and scoring Bored of Anthem's enemies? Well, you're in luck. There's a bunch of new enemies to keep you on your toes, including Bristlebacks and Dominion Crystal Troopers.",
    "Tired of the grunts? Then take on Vara, Cataclysm's big bad who commands an army of Valkyries.",
    "There's also new rewards in the form of new Masterwork and Legendary melee items, support, gear, weapons and some exclusive cosmetics. You'll also receive an additional melee slot.",
    "If you're all about the score, then know that the way to earn points in a Cataclysm run is through taking out enemies, gathering items, and completing puzzles and objectives. You also get points for spending time in the storm, but remember it hurts.",
    "Pointing scoring is more important than ever (for the competitive among us) due to the introduction of a global leaderboard that lets you see the highest score you’ve earned during the Cataclysm and how you rank against the entire player base.",
    "Finally, there are three new story missions for you to sink your teeth into.",
    "The first sees you investigating a Dominion connection to the storm, the second has you teaming up with others to capture an old enemy, and the final mission will see you stopping the Catclysm itself. Hopefully...",
    "Anthem is a complex game. With four classes to master, a ton of loot to uncover and large world to explore, it can be daunting for a newcomer, and difficult for even a long term player to master.",
    "Get ahead of the pack with our selection of Anthem guides, designed to help you get your Iron Man-like Javelin suit fighting fit as soon as possible.",
    "Anthem was an ongoing project at EA and BioWare, a game that both companies expect to support for many years, with a player base that will grow and evolve along with the game. Sadly, both have effectively abandoned the game to focus on Dragon Age and Mass Effect games, but here's what they were planning to make Anthem as successful as other games-as-a-service titles like Destiny.",
    "How did both teams hope to achieve this? Through regular content drops, that's how. As pictured above, EA and BioWare had already mapped out the \"ongoing narrative of Anthem\", with updates mapped out until May 2019 – but things hadn't exactly gone to plan.",
    "This first \"Act\" is called \"Echoes of Eternity\", which was initially scheduled for March 2019 introducing the \"Evolving World\" chapter, April 2019 the \"Stronger Together\" chapter and May 2019 bringing the ominous sounding \"Cataclysm\" chapter. However, as mentioned above, BioWare isn't on track to hit its roadmap. So we're not quite sure when these updates will arrive.",
    "Evolving World will focus on battles with huge bosses such as Titans of War, Ruin, Bane and Havoc in freeplay mode, as well as new Legendary missions and a Scar Infestation freeplay event.",
    "Stronger Together will expand the endgame with a new Mastery System for the skill tree progression, as well as host of new freeplay events, more legendary missions, a new Stronghold called \"The Sunken\" (which will have its own weekly challenge) as well as the introduction of leaderboards and guilds.",
    "Cataclysm arrived in August despite initially being pegged for a May release. So, by this logic, BioWare is running roughly three months behind its initial roadmap.",
    "But what about paid DLC? We initially expected Anthem's release to follow a similar path as Destiny, which had a continued supply of small improvements and features added, interspersed with larger paid-for DLC packs, before an eventual sequel.",
    "EA never ended up announcing it's mid-to-long term plans for Anthem, as all future plans were seemingly scrapped in favor of the whole-game overhaul announced in February 2020 that would refine Anthem's core mechanics and gameplay loop.",
    "While the small team dedicated to the overhaul (called Anthem Next or Anthem 2.0) released several updates over the course of the year, Anthem's lead announced he would also help lead the Dragon Age 4 development in December 2020, and the writing seemed to be on the wall. When the announcement came in February 2021 that Anthem Next would be abandoned, it wasn't long until another report stated the small team dedicated to Anthem's overhaul would be transferred to work on Dragon Age 4.",
    "In other words, that's pretty much the end of Anthem's development, unless we hear more."
  ],
  "headers": {
    "9": "Anthem update news and Anthem patch notes",
    "28": "Anthem tips and tricks guides",
    "30": "Anthem DLC – what's next?"
  },
  "links": {
    "Anthem": "https://www.techradar.com/reviews/anthem",
    "overhaul": "https://www.techradar.com/news/anthem-is-getting-a-substantial-reinvention-but-is-it-too-late",
    "cancelled": "https://www.techradar.com/news/rip-anthem-bioware-says-it-will-finally-abandon-its-ambitious-destiny-rival",
    "Dragon Age 4": "https://www.techradar.com/news/dragon-age-4-release-date-news-and-rumors",
    "Anthem Cataclysm": "https://www.techradar.com/how-to/anthem-cataclysm-what-to-know-before-jumping-into-anthems-new-event",
    "Anthem review": "https://www.techradar.com/reviews/anthem",
    "EA's explanation": "https://www.ea.com/en-gb/games/anthem/news/everything-you-need-to-know-about-anthem-cataclysm?utm_campaign=anth_hd_ww_ic_ic_twt_catclys-08052019-tw&utm_source=twitter&utm_medium=social&cid=59328&ts=1565181953384",
    "abandoned": "https://www.techradar.com/news/rip-anthem-bioware-says-it-will-finally-abandon-its-ambitious-destiny-rival",
    "updates mapped out until May 2019": "https://www.ea.com/en-gb/games/anthem/acts",
    "updates": "https://www.techradar.com/news/biowares-anthem-is-still-alive-heres-what-you-need-to-know-about-anthem-20",
    "report": "https://www.techradar.com/news/dragon-age-4-is-going-to-be-a-solo-experience-after-eas-change-of-heart"
  }
}