{
  "source": "https://www.techradar.com/news/smart-speakers-are-ruining-my-relationships-heres-why",
  "title": "Smart speakers are ruining my relationships – here's why",
  "category": "smart-home",
  "updated": "2021-02-14T11:00:45Z",
  "author": "henry-st-leger",
  "summary": "Opinion: Alexa, call the counsellor",
  "article": [
    "Having a bunch of smart devices in your home, whether that’s smart speakers like the Amazon Echo, smart displays like the Lenovo Smart Clock, or the many security cameras and video doorbells out there, is an increasingly common part of living in a connected modern home. We can use voice commands to dim the lights, turn up the thermostat, or even change channels on our smart TVs – and we’re seeing an explosion in the number of ways we can interface with our various gadgets and toys.",
    "When you’re a technology journalist, though, the smart meter goes up to 11 – and there’s a personal cost when you’re living with people who don’t share your level of ease around intelligent devices.",
    "I’ve reviewed a number of smart speakers, like the Amazon Echo Plus, or (my personal favorite and ongoing music buddy) the Pure DiscovR – and I have to keep a bunch of associated smart plugs and security cameras on site, too, just to make sure different devices work in tandem. So the number of wires, plugs, and speakers packed into my shelves and cupboards is, at times, a bit embarrassing, especially when I’m only ever going to have one or two devices set up at any one time.",
    "My previous flatmate made it clear when I moved in that “the Alexa” wouldn’t be allowed in communal spaces, out of privacy concerns. Not that two geeks in their 20s were saying much worth listening to between sessions of Halo and anime binges, but the principle still stood: why would anyone be ok with being constantly overheard, when it’s not even a device they plan on using?",
    "My partner prefers to use a ‘dumb’ Bluetooth speaker unable to eavesdrop on us, too, and it means any testing periods or new device setups have to be carefully arranged, so as not to compromise someone else’s feeling of safety in their home.",
    "There have been too many privacy scandals around mainstream smart devices to dismiss them as paranoia. There are security bugs that let hackers listen in to private conversations, reports of Amazon staff listening to user conversations, and hacking vulnerabilities in smart locks – while the Amazon-owned Ring has been beset with both data breaches and reports of employees accessing live camera feeds.",
    "In order to pick up voice commands, Alexa speakers and the like have to be ‘listening’ all the time anyway, and a study by researchers at Northeastern University and Imperial College London found that they can activate by mistake up to 19 times a day.",
    "When it comes to smart speakers, devices that by design are meant to sit in the background until they’re needed, it is worryingly easy for me to forget they’re in the vicinity. (Waiting, listening, plotting, and the like.)",
    "Having used so many of them in a professional capacity means I can forget the unease surrounding their presence in personal spaces. And it’s hard to feel precious about my own data or privacy when I have to sign up to countless technology platforms with my personal details in the name of testing and reviewing.",
    "The compromise I often end up making is only using smart speakers with the microphone muted – something that’s relatively easy to do, though culls their most convenient feature, that being the voice commands. If I have to go and unmute to talk to it, why not just search it on my phone, or use a less advanced Bluetooth speaker?",
    "The Pure DiscovR comes with a physical way to disconnect the microphone, though it also limits the volume and bass frequencies – meaning I have to choose between audio quality and personal privacy when considering the feature.",
    "Being wary of our devices, and the companies that make them, always seems sensible. Amazon, Google, and the like are inevitably serving their own interests, even if they're offering convenient products and services at the same time – and user data is a big part of how these companies monetize their products.",
    "But given how prolific smart devices are now, there’s a growing pressure to accept the potential for privacy invasion – and that’s a pressure I end up exerting on the people around me, just by proximity. When we choose to let smart devices and voice assistants into our lives, it’s very easy to end up making that decision on behalf of your families, friends, and flatmates – and it’s very hard to see our collective acceptance going backwards at this point."
  ],
  "headers": {
    "5": "The privacy problem"
  },
  "links": {
    "smart devices": "https://www.techradar.com/news/smart-home-devices",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "smart displays": "https://www.techradar.com/best/best-smart-displays",
    "Lenovo Smart Clock": "https://www.techradar.com/reviews/lenovo-smart-clock-review",
    "smart TVs": "https://www.techradar.com/news/best-tv",
    "Amazon Echo Plus": "https://www.techradar.com/reviews/amazon-echo-plus-review",
    "Pure DiscovR": "https://www.techradar.com/reviews/pure-discovr",
    "smart plugs": "https://www.techradar.com/news/best-smart-plugs-and-switches",
    "security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "anime": "https://www.techradar.com/best/best-anime",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "security bugs that let hackers listen in to private conversations": "https://www.techradar.com/news/amazon-alexa-security-bug-could-have-let-hackers-listen-in-to-your-chats",
    "Amazon staff listening to user conversations": "https://www.techradar.com/news/amazon-employees-may-be-listening-to-your-recorded-alexa-conversations",
    "hacking vulnerabilities in smart locks": "https://www.techradar.com/news/smart-locks-may-not-be-as-smart-as-you-hope",
    "data breaches": "https://www.techradar.com/news/neighborhood-watch-20-rings-privacy-practices-put-under-the-spotlight",
    "employees accessing live camera feeds": "https://www.techradar.com/news/ring-employees-can-reportedly-access-customers-live-camera-feeds",
    "they can activate by mistake up to 19 times a day": "https://www.techradar.com/news/your-smart-speaker-could-be-accidentally-listening-in-on-your-conversations"
  }
}