{
  "source": "https://www.techradar.com/news/sony-xperia-1-iii-gets-possible-launch-date",
  "title": "Sony Xperia 1 III gets possible launch date",
  "category": "phones",
  "updated": "2021-04-01T13:54:45Z",
  "author": "axel-metz",
  "summary": "Xperia is back",
  "article": [
    "Sony has confirmed it is to host a digital press conference on April 14 – which could mark a possible launch date for its much-anticipated Sony Xperia 1 III flagship.",
    "The event will be streamed via the company’s official YouTube channel at 12:30am PT / 3:30am ET / 8:30am BST / 8:30pm ACT.",
    "Historically, Sony has announced its latest Xperia smartphones at MWC Barcelona, which usually takes place in February. MWC 2021 was postponed, though, given the travel and distancing restrictions imposed by the global Covid-19 pandemic.",
    "This announcement corroborates recent reports suggesting the Sony Xperia 1 III – the expected successor to 2020’s Xperia 1 II – would arrive sometime in April.",
    "It’s worth noting that the post-release production delays surrounding its predecessor mean the Xperia 1 III might not hit the shelves until later in 2021, even if the device is indeed launched at this digital press conference. That being said, it’s exciting to learn that we might finally get an official look at what could be one of the most feature-packed phones of the year.",
    "The Xperia 10 III, a budget entry in Sony's line-up, could also make an appearance at Sony's announcement event, since the latest device in the Xperia 10 line usually comes along with the newest Xperia 1 device.",
    "As per recent leaks, we expect the Sony Xperia 1 III to come packed with impressive specs and features.",
    "Perhaps the most exciting rumor is the possibility that the device will come equipped with a periscope zoom camera – which could mean it may rival the Samsung Galaxy S21 for snapping power.",
    "The Xperia 1 II had a 3x optical zoom telephoto camera, and the addition of a periscope lens – which extends magnification lengthwise through the phone and uses mirrors to angle capture out the rear – could mean its successor boasts impressive 5x, or even 10x, optical zoom capabilities.",
    "Other rumored specs for the device include the latest Qualcomm Snapdragon 888 chipset, as well as 12GB of RAM and 256GB of internal storage (rising to 16GB of RAM and 521GB of storage in a premium variant).",
    "We also expect the Xperia 1 III to arrive with a 6.5-inch OLED panel and an aspect ratio of 21:9 – the same elongated design feature as others in the Xperia series.",
    "What we’re most excited to hear about, though, is its price. Previous leaks have suggested Sony’s next flagship phone will cost 8,999 CNY, which roughly converts to $1,369 / £995 / AU$1,810. That’s a hefty sum, even considering the price of its predecessor, so we’d like to see Sony rebuff those rumors should the device make an appearance on April 14.",
    "Via PhoneArena"
  ],
  "headers": {
    "6": "Laying down a marker"
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "recent reports": "https://www.techradar.com/news/sony-xperia-1-iii-specs-and-features-leaked-and-theyre-impressive",
    "Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "recent leaks": "https://www.techradar.com/news/sony-xperia-1-iii-specs-and-features-leaked-and-theyre-impressive",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Qualcomm Snapdragon 888 chipset": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "PhoneArena": "https://www.phonearena.com/news/sony-xperia-1-iii-5g-announcement-date_id131169"
  }
}