{
  "source": "https://www.techradar.com/news/linkedin-launches-video-profiles-and-creator-mode",
  "title": "LinkedIn launches video profiles and 'Creator Mode'",
  "category": "computing",
  "updated": "2021-03-30T15:57:00Z",
  "author": "anthony-spadafora",
  "summary": "New tools aim to help LinkedIn users stand out on the platform",
  "article": [
    "Making your profile stand out on the business-focused social network LinkedIn is about to get a whole lot easier as the company is rolling video profiles as well as a new Creator Mode.",
    "Using the company's new video Cover Story tool, users will be able to bring their profiles to life with a short video showcasing their abilities and skills while letting recruiters and potential employers know the type of position they're looking for.",
    "Once a user adds a Cover Story to their profile, an orange ring will appear around their profile photo and a preview of their video will auto-play silently within their photo frame.",
    "For job seekers, a Cover Story can be a great way for them to introduce themselves to hiring managers by sharing their career goals while freelancers can use the tool to attract new clients by creating a Cover Story that talks about the services they offer. At the same time though, LinkedIn users can also now create a dedicated Service Page right from their profile.",
    "As LinkedIn is seeing more members share and connect than ever before with almost a 50 percent increase in conversations over the past year, the company is introducing a new Creator Mode in its profile dashboard.",
    "With Creator Mode enabled, users of the social network will be able to add hashtags to indicate what topics they post about the most. The new mode also moves your Featured and Activity sections to the top of your profile to more prominently display your content and changes the “Connect” button to “Follow” to help you better engage with your community and build a following.",
    "Additionally, now when LinkedIn Live broadcasters go live, their profile background will show their live broadcast to help increase the visibility of their content.",
    "Both Creator Mode and Cover Story will roll out to LinkedIn members globally beginning this week and these tools should make it easier for users to stand out on the platform and possibly find their next position or gig."
  ],
  "headers": {
    "4": "Creator Mode"
  },
  "links": {
    "LinkedIn": "https://www.techradar.com/news/linkedin-sales-insights-can-help-your-business-spot-all-the-latest-opportunities",
    "freelancers": "https://www.techradar.com/news/linkedins-new-service-could-be-the-tool-to-book-your-next-freelance-gig",
    "LinkedIn Live": "https://www.techradar.com/news/linkedin-makes-push-into-virtual-events"
  }
}