{
  "source": "https://www.techradar.com/news/oracle-users-can-now-run-hybrid-cloud-absolutely-anywhere-in-the-world",
  "title": "Oracle users can now run hybrid cloud absolutely anywhere in the world",
  "category": "computing",
  "updated": "2021-02-11T00:48:12Z",
  "author": "anthony-spadafora",
  "summary": "Roving Edge Devices can be deployed anywhere",
  "article": [
    "Oracle has expanded its hybrid cloud portfolio with a new offering called Oracle Roving Edge Infrastructure that allows organizations to run cloud workloads from anywhere.",
    "The tech giant's new offering brings core infrastructure services to the edge through ruggedized, portable and scalable server nodes called Roving Edge Devices (REDs). By using Oracle Roving Edge Infrastructure, organizations can run their cloud workloads from anywhere in the world including the back of a plane, a polar observatory or even an oil tanker in the mid-Atlantic.",
    "The new service is part of Oracle's hybrid cloud portfolio which provides customers with more flexibility and control over their cloud deployments to help cut costs.",
    "Oracle Roving Edge Infrastructure is priced per day and organizations that want to use the company's new devices will have to commit to a minimum lease term of 30 days.",
    "Renting an Oracle Roving Edge Device costs $160 per node per day while renting a Roving Edge Cluster Kit, which includes a network switch and cabling for clusters, costs $40 per kit per day. For the price though, customers can use the Oracle RED nodes and clusters in their possession as they see fit without any limitations.",
    "Executive vice president of Oracle Cloud Infrastructure, Clay Magouryk explained how the new service essentially delivers a cloud region wherever a customer needs it in a press release, saying:",
    "“Customers want choice when it comes to running workloads in the cloud. Each customer has different requirements based on data sovereignty, scale, or wanting the full experience of a public cloud on-premises with all of Oracle’s cloud services. Oracle Roving Edge Infrastructure is the latest example, delivering core infrastructure services to remote locations. Oracle’s hybrid cloud portfolio essentially delivers a cloud region wherever and however a customer needs it.”"
  ],
  "headers": {
    "3": "Oracle Roving Edge Infrastructure"
  },
  "links": {
    "Oracle": "https://www.techradar.com/news/oracle-wants-to-drastically-simplify-app-development-with-new-low-code-service",
    "hybrid cloud": "https://www.techradar.com/news/what-is-hybrid-cloud",
    "Oracle Roving Edge Infrastructure": "https://www.oracle.com/cloud/roving-edge-infrastructure/",
    "press release": "https://www.oracle.com/news/announcement/oracle-expands-hybrid-cloud-portfolio-with-roving-edge-infrastructure-020921.html"
  }
}