{
  "source": "https://www.techradar.com/news/oneplus-9-colors-leak-reveals-a-range-of-chilly-shades",
  "title": "OnePlus 9 colors leak reveals a range of chilly shades",
  "category": "phones",
  "updated": "2021-03-02T10:57:46Z",
  "author": "james-rogerson",
  "summary": "Plus some glossy alternatives",
  "article": [
    "The OnePlus 9 range has been extensively leaked at this point, but one thing that we still weren’t sure of was what colors the phones would be available in. Now though we have a very good idea - at least for the two priciest models.",
    "OxygenUpdater (a source which isn’t known for leaks, so should be taken with a pinch of salt), claims to have got its hands on an Engineering Mode APK (Android application package) for the OnePlus 9 range, which includes mentions of various colors.",
    "It’s worth noting that the OnePlus 9 isn’t mentioned by name in this software, but ‘lemonade’ is mentioned, and we’ve previously heard that this is the OnePlus 9’s codename. Alongside ‘lemonade’ there’s mention of Arctic Blue, Arctic Sky, and Winter Mist colors, so it seems OnePlus is looking to colder climes for color inspiration.",
    "Other colors are mentioned alongside ‘lemonadet’, which the source reckons is the model for T-Mobile, ‘lemonadev’, which it says is the Verizon version, ‘lemonadep’, which is apparently the OnePlus 9 Pro, and ‘lemonadept’, which is said to be the OnePlus 9 Pro on T-Mobile.",
    "These conclusions are based on previous OnePlus codenames which follow a similar pattern, and notably there's no mention of the rumored OnePlus 9 Lite (or OnePlus 9R as it might be called), but that doesn't necessarily mean it's not coming, the data could just be incomplete.",
    "In any case, the phone believed to be the OnePlus 9 Pro looks to come in Stellar Black, Forest Green, and Morning Mist shades.",
    "Then, for the OnePlus 9 on T-Mobile there’s Astral Black and Winter Mist listed, so in other words a subset of the standard shades. But it looks like the Verizon version might get some exclusive OnePlus 9 shades, with Gloss black and Gloss gradient purple mentioned. Hopefully these gloss shades will be available in other countries too, but that remains to be seen.",
    "Finally, the OnePlus 9 Pro on T-Mobile is just mentioned as coming in Morning Mist, so you might not have a choice of colors if shopping there.",
    "None of this is confirmed just yet of course, but it should be soon, as we’re expecting OnePlus to announce the OnePlus 9 launch date on March 8, and the launch date itself probably won’t come too long after, as many leaks point to a March unveiling.",
    "Via GSMArena"
  ],
  "headers": {
    "3": "Lots of lemonades"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OxygenUpdater": "https://oxygenupdater.com/api/v2.6/news-content/217/EN",
    "this is the OnePlus 9’s codename": "https://www.techradar.com/news/oneplus-9-codename",
    "OnePlus 9R as it might be called": "https://www.techradar.com/news/confusion-grows-as-oneplus-9-lite-gets-yet-another-possible-name",
    "announce the OnePlus 9 launch date on March 8": "https://www.techradar.com/news/oneplus-9-launch-date-will-be-revealed-next-week",
    "GSMArena": "https://www.gsmarena.com/oneplus_9_series_colors_detailed_affordable_model_to_be_called_oneplus_9r__-news-47993.php"
  }
}