{
  "source": "https://www.techradar.com/news/google-nest-hub-2-vs-amazon-echo-show-8-pick-the-right-smart-display-for-you",
  "title": "Google Nest Hub 2 vs Amazon Echo Show 8: pick the right smart display for you",
  "category": "smart-home",
  "updated": "2021-11-09T14:59:46Z",
  "author": "carrie-ann-skinner",
  "summary": "Which compact smart display should you choose?",
  "article": [
    "Smart displays combine the handy features of a smart speaker with the flexibility of a screen, so you can see and hear the information you’re asking for, whether that's the news, a recipe or even just what the weather is like.",
    "Both Amazon and Google offer several smart displays with varying screen sizes, but now Google has added the Nest Hub 2 to the mix. This 7-inch smart display is priced at $99.99 / £89 / AU$149 and is the first smart display that can track your sleep. On top of that, it'll do everything you’d expect such as acting as a digital photo frame, displaying recipes, and letting you watch streaming services such as Netflix and Disney+.",
    "If you’re considering investing in a smart display, but are wondering which one will suit you best, then we’re comparing the Google Nest Hub 2 and the popular Amazon Echo Show 8 – a similarly priced rival – to help you decide which model is right for you.",
    "UPDATE: Amazon has unveiled a new version of the Echo Show 8 (2021), which has an upgraded 13-megapixel camera. The camera sported by the Echo Show 10, it can pan and zoom to ensure you're always in the center of the frame during video calls. It's priced at $129.99 / £119.99 / AU$199 - the same price as the current Echo Show 8 - and will go on sale on June 9, 2021.",
    "If you’ve already decided which of the two you wish to buy, check out the best prices right now for both products below:",
    "Both the Google Nest Hub 2 and the Amazon Echo Show 8 are relatively compact smart displays. The Google Nest Hub 2 measures 12 x 17.74 x 6.96cm while the Amazon Echo Show 8 has an overall footprint of 20 x 13.59 x 9.91cm - making it slightly larger than the Google Nest Hub 2.",
    "In terms of display size, the Google Nest Hub 2 has a 7-inch screen with a 1024 x 600 resolution, where the Echo Show 8 has an 8-inch display, with a 1200 x 800 resolution.",
    "The Google Nest Hub has a ‘floating screen’ design that almost looks as though the display is suspended in the air, with the rounded base housing the full-range speaker with a 1.7-inch driver. It’s available in four colours; chalk, charcoal, sand, and mist - a soft pastel blue.",
    "Meanwhile, the Amazon Echo Show 8 has a wedge-shaped design that can also be found on the Echo Show 5, it’s smaller sibling, and comes in a choice of charcoal or sandstone. Once again the fabric covered section houses the two-inch speaker with passive bass radiator. Both smart displays come with Wi-Fi and Bluetooth connections too.",
    "Both smart displays use microphones to listen for their relevant wake word and when they’re being used to make calls. The Google Nest Hub 2 has three microphones, while the Amazon Echo Show 8 has four.",
    "The Amazon Echo Show 8 also has a front-facing 2MP camera which can be used to make video calls to other Echo Show smart displays. Just like Google’s original Nest Hub, which was initially called the Google Home Hub, there’s no camera built-in to the smart display so it can’t be used for video calling.",
    "As we’ve already mentioned, there are several uses for smart displays, and the Google Nest Hub 2 and Amazon Echo Show 8 are pretty equal here. They can both play music and videos, with the Google Nest Hub 2 supporting Netflix, Disney+ and YouTube and the Amazon Echo Show 8 supporting Netflix and Prime Video. The built-in voice assistants can control the playback of music, find information on the web and automate your smart home gadgets.",
    "However, the Google Nest Hub 2 trumps the Amazon Echo Show 8 as it can track your sleep, if you use it in your bedroom. It has Soli radar technology built-in, which can already be found in the Google Pixel 4 smartphone and Google’s newest Nest smart thermostat, to analyze your movement through the night and create a report that can details how much sleep you had, and any interruptions caused by coughing, snoring or temperature or light changes in the room. This isn’t something the Amazon Echo Show 8 can do.",
    "Both Google and Amazon have taken privacy seriously with these smart displays. You can ask the built-in voice assistant to stop listening for the wake word at any point, and it’s possible to ask for recording the devices make, when you say the wake word, to be deleted. Alternatively you can erase them from their companion apps too. There’s also a physical switch that cuts the power to the microphones to prevent them listening. The Amazon Echo Show 8 includes a shutter for the smart display’s camera too.",
    "The Google Nest Hub 2 is priced at $99.99 / £89 / AU$149 while the Amazon Echo Show 8 is available now and is slightly more expensive costing $129 / £119 / AU$229. However, it’s frequently discounted and likely to be on sale during Amazon Prime Day and Black Friday later in the year.",
    "The Google Nest Hub 2 and Amazon Echo Show 8 are evenly matched when it comes to design, the big difference lies in the lack of camera on the Google Nest Hub and the fact the Amazon Echo Show 8 can’t track your sleep.",
    "If you already have a smart speaker or smart display from either brand in your home, then it makes sense to opt for the same manufacturer as they’ll work together, for example creating a multi-room music system.",
    "If this is your first smart speaker or display, then it comes to what you value most; a device that can make video calls on, then plump for the Amazon Echo Show 8, while if sleep tracking without the use of a wearable appeals, then the Google Nest Hub 2 is your best bet."
  ],
  "headers": {
    "4": "Best Google Nest Hub 2 and Amazon Echo Show 8 deals",
    "5": "Design",
    "9": "Microphone and camera",
    "11": "Handy features",
    "13": "Privacy",
    "14": "Price",
    "15": "Verdict"
  },
  "links": {
    "Smart displays": "https://www.techradar.com/best/best-smart-displays",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Nest Hub 2": "https://www.techradar.com/reviews/google-nest-hub-2nd-generation-review",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney+": "https://www.techradar.com/reviews/disney-plus-review",
    "Amazon Echo Show 8": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "Echo Show 8 (2021)": "https://www.techradar.com/reviews/amazon-echo-show-8-2nd-gen",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Google Pixel 4 smartphone": "https://www.techradar.com/reviews/google-pixel-4-review",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}