{
  "source": "https://www.techradar.com/news/kevin-feige-confirms-abomination-is-in-shang-chi-what-does-it-mean-for-the-mcu",
  "title": "Kevin Feige confirms Abomination is in Shang Chi – what does it mean for the MCU?",
  "category": "entertainment",
  "updated": "2021-06-30T11:58:52Z",
  "author": "hamish-hector",
  "summary": "The fight we were all waiting for",
  "article": [
    "The latest trailer for Shang-Chi and the Legend of the Ten Rings set the internet ablaze after it appeared to show Wong from Doctor Strange fighting the Incredible Hulk villain Abomination.",
    "Now, in an interview with Rotten Tomatoes, Marvel Studios president Kevin Feige has confirmed that the characters we saw are indeed Wong and Abomination battling it out in a cage match.",
    "\"Some fans said, ‘This looks like a character they hadn’t seen in many years named The Abomination, fighting a character that looks like Wong',\" Feige said. \"And I can say that the reason it looks like that is because that is Abomination fighting Wong.\"",
    "This makes Shang-Chi the first time we’ll have seen the villain since he made his first MCU appearance back in 2008.",
    "Why and how the sorcerer and gamma-irradiated behemoth found themselves going toe-to-toe is yet to be revealed, but it has fans excited to see which other long-lost MCU characters could make a comeback. Given that we’ll finally see the real Mandarin in this film, a cameo from Iron Man 3's Trevor Slattery cameo seems possible.",
    "Shang-Chi and the Legend of the Ten Rings is set to release on September 3, 2021.",
    "We already knew that Abomination would be making a return in Phase 4 of the MCU. During last December's Disney Investor Day, where the company shared its plans for upcoming projects, Kevin Feige announced that Tim Roth will be reprising his role as Abomination/Emil Blonsky in the Disney Plus series She-Hulk (coming in 2022).",
    "This Shang-Chi reveal goes beyond pulling Abomination's return forward by about a year, though – it affirms Marvel's stance that it never forgets about older characters from the MCU, even if it can take more than a decade for them to re-emerge.",
    "Phase 4 has so far spotlighted characters who deserved more attention, like Falcon and Wanda, but it's introduced new characters like Monica Rambeau and John Walker too. As the world fills up with other new faces (like those seen in Shang-Chi and the Eternals), fans might have wondered how much older characters figure into Marvel Studios' plans, especially after Avengers: Endgame seemed to put a capper on so many of their stories.",
    "If anything, this reveal shows that no one ever really goes away in the MCU – 13 years later, the villain of an extremely mediocre Hulk movie is back in action. Who'd have thought that?"
  ],
  "headers": {
    "6": "Abomination shows that Marvel never forgets"
  },
  "links": {
    "latest trailer": "https://www.techradar.com/news/marvels-first-full-shang-chi-trailer-hints-at-the-power-of-the-ten-rings",
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "Doctor Strange": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Rotten Tomatoes": "https://editorial.rottentomatoes.com/article/exclusive-kevin-feige-confirms-that-is-abomination-fighting-wong-in-the-shang-chi-trailer/",
    "Disney Investor Day": "https://www.techradar.com/news/disney-plus-confirms-its-making-10-marvel-and-10-star-wars-tv-shows",
    "Disney Plus series": "https://www.techradar.com/best/best-disney-plus-shows",
    "Monica Rambeau": "https://www.techradar.com/news/wandavision-who-is-monica-rambeau",
    "John Walker": "https://www.techradar.com/news/falcon-and-the-winter-soldier-episode-4-ending-explained/news/new-captain-america-in-the-falcon-and-the-winter-soldier-explained",
    "Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know"
  }
}