{
  "source": "https://www.techradar.com/news/i-cooked-steak-in-a-ninja-foodi-and-ill-never-go-back",
  "title": "I cooked steak in a Ninja Foodi and I’ll never go back",
  "category": "appliances",
  "updated": "2021-12-04T08:00:20Z",
  "author": "helen-mccue",
  "summary": "Forget the frying pan, this Instant Pot alternative is the way forward",
  "article": [
    "The best Instant Pots and the array of alternatives, such as the Ninja Foodi range of multi-cookers, are extremely handy kitchen gadgets, as they offer an array of different cooking methods in one appliance. From slow cooking a stew to pressure cooking meats so they fall off the bone, multi-cookers can have a variety of functions making them one of the most versatile kitchen appliances around.",
    "Some of the newer and even more versatile multi-cookers feature air fry lids, so they can be used to make fries as well as grill/ broil meats and even bake cakes. But would you risk putting an expensive cut of meat, such as a juicy steak, in a multi-cooker?",
    "Ordinarily we’d say don’t do it, as steaks need to be watched constantly, which isn’t possible when you’re using an Instant Pot. However, the recently-launched Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker includes a thermometer that works alongside dedicated programs to cook meat exactly how you’d like it. So does this mean you can cook a juicy steak perfectly with very little fuss?",
    "Want to get your hands on a Ninja Foodi or Instant Pot even without finding out how well this model cooked steak? Then check out the best deals we've found on the web right now.",
    "Whether you prefer a medium rare steak or a beautifully blush lamb chop, it can be tricky to judge when your meat is cooked to perfection. We’ve all heard pressing the meat and comparing the firmness to various parts of your hand can be a simple way to tell whether it's ready. But I for one, have never found these methods reliable and always end up cutting into the meat to see how pink it is inside - which ruins the presentation of the food.",
    "However, the Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker, which is known as the Ninja Foodi 14-in-1 8-qt. Smart XL Pressure Cooker Steam Fryer with SmartLid in the US, comes with a meat thermometer, which will indicate the internal temperature of the meat, so you know exactly when it's cooked to your liking.",
    "The meat probe sits neatly in its own little compartment on the side of the Ninja Foodi, so all we had to do was plug one end into the lid and the other end into the steak. Although rather than inserting the probe into the top, the manual advised I push the probe through the side of the steak rather than the top and also to ensure that the tip is in the middle of the steak, or the middle of the thickest part, to get an accurate reading.",
    "As suggested in the manual, I brushed the steak with oil and popped it in the air fry basket before selecting the air fry function. Next it was just a case of choosing how I wanted it cooked - there are nine options to choose from ranging from rare to well done.",
    "I selected medium rare, closed the lid and let the Ninja take care of the rest. It was a relief to know that I didn’t have to watch it, poke it, or cut into it. All I had to do was wait for the beep that would tell us it was cooked, it really doesn’t get much easier. Plus, it meant I could concentrate on perfecting the side dishes while the steak was cooking.",
    "The steak took eight minutes, after which I removed it and allowed it to rest, covered a plate for four minutes as recommended in the instruction manual. When I sliced it in half, I was delighted to discover that the steak was indeed medium rare – I got exactly what I ordered.",
    "I was even more pleased to discover that the strip of fat running down one side had rendered well, creating a crisp and juicy texture that is usually tricky to achieve in a pan. I often spend ages holding the steak on its side with tongs so that the fat is pressed into the pan, otherwise it just doesn’t cook properly.",
    "During cooking, the Ninja doesn’t determine the cook time based on preset timings. Instead, it uses the probe to monitor the temperature in the center of the meat. It figures out how well-cooked your meat is based on this temperature reading. One of the biggest drawbacks with this method of cooking is that you don’t know exactly when the meat will be finished cooking, so it can be tricky to work out the timings for the rest of the meal. Although I think after you’ve used it a few times for your favorites, you’ll get a pretty good idea how long they take.",
    "If you’re cooking more than one steak and you want them cooked to different levels, the Ninja instructions say to put all the steaks in and set up cooking for the least well done. Once this steak is cooked you have to remove it and transfer the probe to the next steak, resetting the program to how you want this steak cooked.",
    "This probably won’t be the best cooking method to use if one of you wants a rare steak and the other wants theirs well done. Because the rare steak will be cooked far quicker than the well done one. It’s also worth avoiding cuts of meat that are an uneven thickness, otherwise you’ll have perfect results in the thickest part, but the rest is likely to be more cooked than you’d like.",
    "As I’ve mentioned above, there are a few drawbacks, and this won’t be the right choice for everyone. But I was really pleased with my steak, and I definitely think this new Ninja makes it easy to get your meat cooked right, so for a lot of people it’ll take the stress out of cooking and give you the perfect results every time.",
    "I can’t wait to try it for lamb chops, these usually spit fat all over my stove, so the idea of containing that mess inside the Ninja sounds dreamy. I’m also intrigued to try a small roast beef, this is another expensive cut of meat that can be tricky to get right and I suspect my Ninja might be the answer."
  ],
  "headers": {
    "4": "Seriously simple",
    "9": "So, was the steak cooked to perfection?"
  },
  "links": {
    "best Instant Pots": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker": "https://www.techradar.com/reviews/ninja-foodi-max-15-in-1-smartlid-multi-cooker"
  }
}