{
  "source": "https://www.techradar.com/news/sonys-ps5-showcase-2021-will-announce-the-future-of-ps5",
  "title": "Sony's PS5 Showcase 2021 will announce \"the future of PS5\"",
  "category": "gaming",
  "updated": "2021-09-08T18:20:34Z",
  "author": "hamish-hector",
  "summary": "Expect PS5 game announcements for 2022 and beyond",
  "article": [
    "Sony has announced its next PS5 Showcase through its various social media channels, promising the event will show fans what's in store for the future of the PS5.",
    "The event, which takes place September 9, will last for around 40 minutes and give viewers a look at games coming to the PS5 this holiday and next year. To temper expectations, Sony has warned that its next generation of PSVR (what we’re currently calling PSVR2) won’t be making an appearance.",
    "That's not bad news, though, as it'll give us more time to learn about all the games headed to the PS5. Below, you can find all the details you need for when and how to watch, as well as our predictions for the games we might see.",
    "The PS5 Showcase will be taking place next week, on Thursday, September 9 at 1 PM PT / 4 PM ET / 9 PM BST / 6 AM ACT. The event will last around 40 minutes and be watchable on Sony's official PlayStation YouTube and Twitch pages.",
    "There's no broadcast scheduled on those channels yet, so you'll have to set a manual reminder elsewhere if you want to be sure you don't miss the announcements as they happen.",
    "If you do forget though – or aren't able to watch the stream – we'll be sure to recap all the biggest announcements after the event, so check back here for that on September 9.",
    "Sony has made it clear that its 2021 PS5 Showcase will focus on PS5 games.",
    "Hopefully, we'll hear more about already announced Sony first-party games like Horizon Forbidden West and God of War: Ragnarok. Horizon was recently delayed to February 2022 so Sony may want to use the showcase to keep up the momentum for the game. Meanwhile, with few details known about God of War, despite its announcement nearly a year ago, we think it's time that Sony finally shows it off.",
    "We're also looking forward to new game reveals, too, such as sequels to some of the best PS4 games. Given the rumors we've seen circulating for Death Stranding 2, we wouldn't be surprised to see an announcement. We'd also like to see a sequel to Marvel's Spider-Man shown off, too.",
    "We loved Spider-Man: Miles Morales, which came out when the PS5 launched, but it felt a little short and didn't feel like the full sequel we were hoping for. With Ratchet and Clank: Rift Apart now released, Insomniac should be free to start work on Marvel's Spider-Man 2. Our guess? A release date sometime in late 2022 or into 2023 wouldn't be too much of a stretch, right?"
  ],
  "headers": {
    "3": "PS5 Showcase 2021: Date and Time",
    "6": "PS5 Showcase 2021: What we expect"
  },
  "links": {
    "which takes place September 9": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "PSVR2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "YouTube": "http://youtube.com/playstation",
    "Twitch": "https://www.twitch.tv/playstation",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "best PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart"
  }
}