{
  "source": "https://www.techradar.com/news/apple-vr-and-ar-headset-will-have-m1-level-performance-and-gen-2-is-already-on-the-way",
  "title": "Report: Apple's VR headset already has a powerful sequel - even before launch",
  "category": "phones",
  "updated": "2021-12-08T12:01:12Z",
  "author": "gerald-lynch",
  "summary": "Virtual reality ambitions already expanding to future devices, says analyst",
  "article": [
    "Apple’s AR / VR headset has yet to be officially revealed by the company, but fresh information on the mixed reality device points doesn't just point towards its unveiling next year: it also hints that a quick turn around for a follow-up, second generation device in en route, too.",
    "Regular Apple analyst and insider Ming-Chi Kuo has shared new details about the company’s mixed reality ambitions, detailing a first generation device that will set the bar for premium virtual reality and augmented reality hardware to come.",
    "Ming-Chi Kuo states that the headset will weigh in somewhere between 300 and 400 grams (comparing favourably against the 500-ish gram Oculus Quest 2), but will manage to pack in high resolution displays for each eye, and a level of performance similar to what can be expected from the company’s impressive M1 laptop chipsets.",
    "With high-end specs comes a high-end price, and the analyst is anticipating the Apple HMD to start at around $1,000 and launch in 2022, aimed at an early adopter market willing to take a punt on such expensive nascent technology. Despite the expense, Apple is said to expect to sell between 2.5 and 3.5 million headsets across the course of 2023.",
    "But Apple is already also thinking about the next generation of the device, according to Kuo. Lighter, faster, with an updated industrial design and new battery system, Kuo anticipates this being revealed in the second half of 2024, with demand for the product expected to be upwards of 10 million sales.",
    "Apple reportedly has 1,000 engineers working on its VR and AR projects, and with it being the first new major hardware area the company has expanded into since the Apple Watch, it’s unsurprising that it’s already looking forward to iteration on the initial design.",
    "What’s most interesting, however, is Apple’s approach to the market generally. Consumer VR headsets (and to a lesser extent AR headsets) have been around in some capacity for several years now. But the first inkling of them approaching a level of mainstream success has come from the Oculus Quest 2 – a device that intelligently offers just-good-enough specs to hit an approachable price point that newcomers are willing to take a risk on. VR isn’t for everyone, and accessibility – in terms of both access to the hardware and a reasonable price tag – seems to have been the magic formula to get users to buy in.",
    "But Apple’s stance on all its market areas has always been to attempt to be class leading, in terms of technology and industrial design, with no expense spared. When Apple enters a market, it does so with the intention to dominate it. There’s the suggestion then that the Oculus devices have proved the market is ready to upgrade to something with a premium price tag and that – if Apple can provide an accessible and smooth user experience – people will be willing to pay that premium to stay within the aspirational bubble that Apple has built.",
    "Via 9to5 Mac"
  ],
  "headers": {
    "4": "Next-gen on the way"
  },
  "links": {
    "M1 laptop chipsets": "https://www.techradar.com/news/apple-m1-chip",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "9to5 Mac": "https://9to5mac.com/2021/12/08/kuo-apple-ar-vr-headset/"
  }
}