{
  "source": "https://www.techradar.com/news/far-cry-6-gameplay-reveal-coming-later-this-week",
  "title": "Far Cry 6 gameplay reveal coming later this week",
  "category": "gaming",
  "updated": "2021-05-26T16:33:09Z",
  "author": "vic-hood",
  "summary": "Here's how to watch",
  "article": [
    "Ubisoft has confirmed that we will get our first look Far Cry 6 gameplay later this week.",
    "In a short teaser trailer (only 35 seconds long), Ubisoft announced that the worldwide gameplay reveal for Far Cry 6 - which is now a \"Ubisoft Original\", something that all future Ubisoft exclusives are now weirdly called - will take place on May 28 at 9:30am PT / 12:30pm ET / 5:30pm BST.",
    "This will be the first time we see gameplay footage of Far Cry 6, which was previously set to release in February this year before being delayed to an unspecified date sometime before March 2022.",
    "Far Cry 6 takes us to a \"tropical paradise frozen in time\" called Yara. Yara is controlled by dictator Anton Castillo (played by Breaking Bad's Giancarlo Esposito), who aims to restore the island paradise to glory with help from his son, Diego - through any means necessary. However, a revolution is taking place in Yara which aims to take down Castillo. Players will step into the shoes of protagonist Dani, a revolutionist in the fight against Castillo.",
    "While we don't know a whole lot about Far Cry 6's gameplay, we do know that the Fangs for Hire feature from Far Cry 5 will be making a return in the form of 'Amigos', allowing you to recruit animal companions to assist you in fights. So far we only know one animal recruit: Chorizo, an adorable (but feisty) Dachshund. We also know that a lot of the game's combat will be guerrilla, taking place in what narrative director Navid Khavari told GameSpot was the developer's most \"ambitious open-world yet\".",
    "It sounds like we'll finally get to see what Far Cry 6's open-world looks like on May 28 as well as getting a closer look at Yara and its inhabitants. What we're hoping for most is a new, firm release date for Far Cry 6 - hopefully, one that's not too far away."
  ],
  "headers": {
    "3": "What do we want to see?"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "GameSpot": "https://www.gamespot.com/articles/far-cry-6-revealed-heres-everything-we-know-about-/1100-6479617/"
  }
}