{
  "source": "https://www.techradar.com/news/microsoft-edge-update-could-make-it-far-faster-than-google-chrome",
  "title": "Microsoft Edge update could make it far faster than Google Chrome",
  "category": "computing",
  "updated": "2021-04-29T12:30:47Z",
  "author": "mike-moore",
  "summary": "Speed boost for Microsoft Edge on Windows 10 and macOS",
  "article": [
    "The browser wars look set to rumble on for some time yet thanks to another significant upgrade to Microsoft Edge as it looks to topple Google Chrome.",
    "The native Windows 10 browser, which is built on Chromiunm, is getting a speed boost that Microsoft hopes will help Edge run faster at all times.",
    "The change, coming to Windows 10 and macOS users, means that Edge will significantly cut down the animations when a user is not actively using the browser, boosting performance across the board.",
    "The upgrade is part of the new \"performance mode\" introduced to Microsoft Edge recently.",
    "The feature allows users to optimize web browsing speed and responsiveness on Microsoft Edge, as well as reduce CPU, RAM, and battery usage. This will be of benefit to anyone who runs browser tabs alongside other applications or even games, freeing up space to be used where you need the best results.",
    "Microsoft Edge had previously introduced \"sleeping tabs\", which freezes tabs in the browser when not actively in use, reducing RAM and CPU usage. The feature is now also getting an upgrade, with Microsoft saying that inactive tabs will now be set to sleep after five minutes of inactivity instead of the current default of two hours when sleeping tabs is enabled.",
    "For now, Microsoft says that performance improvements for individual users will vary depending on their device configurations and browsing habits.",
    "However it adds that users will immediately see changes when turning the feature on, although video streaming and Microsoft Edge animations will appear less smooth when performance mode is running.",
    "The news marks the latest salvo between Microsoft Edge and Google Chrome in the battle for browser supremacy.",
    "The former recently hinted at further changes that could make Edge the go-to browser for PDF users, including a new function that allows users to pick up where they left off instead of having to manually scroll through a PDF.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Performance mode boost"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "performance mode": "https://www.techradar.com/news/windows-10-brings-a-game-changing-feature-to-edge-to-beat-chrome",
    "recently hinted": "https://www.techradar.com/news/microsoft-edge-is-about-to-give-another-reason-to-drop-google-chrome",
    "Windows Latest": "https://www.windowslatest.com/2021/04/28/microsoft-edge-to-reduce-animation-for-performance-on-windows-10-other-platforms/"
  }
}