{
  "source": "https://www.techradar.com/news/exclusive-next-gen-36tb-tape-will-land-sooner-rather-than-later",
  "title": "Exclusive: Next-gen 36TB tape will land sooner rather than later",
  "category": "computing",
  "updated": "2021-09-13T19:02:38Z",
  "author": "joel-khalili",
  "summary": "We won’t have to wait quite so long for LTO-10",
  "article": [
    "The latest generation of Linear Tape Open (LTO) magnetic tape finally landed last week, after significant delays. But the body that oversees the technology has revealed it anticipates a return to its regular release cadence in future.",
    "New generations of LTO tape have historically arrived every two to three years, but snags in the development process meant it took four years for LTO-9 products to hit the shelves. And that’s despite the decision to cut the native capacity from 24TB to 18TB.",
    "However, a group of spokespeople from IBM, HPE and Quantum (all members of the LTO Program) told TechRadar Pro that the LTO-9 delay was an exception to the rule and we can expect 36TB (LTO-10) cartridges to land sooner rather than later.",
    "“The need to return to the previous cycle of release is being emphasized by large users who are looking to store more data in the same footprint, and are seeing data growth of 35% CAGR or more,” they said.",
    "“Vendors will be reviewing the time to market and we expect development times to return to comparable cycles as seen before LTO-9.”",
    "As the volume of data produced worldwide continues to expand at an aggressive rate, the opportunity to squeeze as much performance as possible out of tape storage will continue to be a priority.",
    "With this in mind, not only does the LTO Program intend to return to its traditional release cycle, but the organization also anticipates a return to 100% capacity increases between generations.",
    "“The goal is not only to adhere [to the current roadmap], but to work to meet the market demand in the future. Aligning to the market is as important as demonstrating the ability to deliver technology or capacity in this instance.”",
    "“One hundred percent capacity improvements per generation are highly feasible. LTO technology has been used to demonstrate a tape density equivalent to five generations of doubling capacity; a demonstration that is not matched by any other storage technology available today.”",
    "It is worth noting, however, that it is not necessarily in the interests of the LTO Program to allow the technology to improve too quickly.",
    "Although researchers are making headway with new storage techniques (using DNA, glass and holograms) that could rival tape in future, LTO currently has a stranglehold on the archival storage market. In theory, this means the LTO community can afford to drag its feet when it comes to capacity increases, generating a burst of revenue with each new generation as businesses scramble to increase their capacity per square meter.",
    "Whether businesses will benefit from new generations of tape is not the question; the LTO Program expects the total cost of ownership for early LTO-9 adopters to be 17% lower than the previous generation. But the market is not organized in such a way as to incentivize rapid innovation, so companies have no choice but to rely on the good will of the LTO Program and its members.",
    "While the current roadmap predicts tapes will have an impressive native capacity of 144TB by the time LTO-12 rolls around, the projections have been dialled back since the decision to cut the capacity of the latest tapes. The next generation of tapes (LTO-10) were originally supposed to have a native capacity of 48TB, significantly more than is now projected."
  ],
  "headers": {
    "5": "The rise and rise of tape storage"
  },
  "links": {
    "finally landed": "https://www.techradar.com/news/the-next-generation-of-tape-storage-is-finally-here-with-a-whopping-45tb-capacity",
    "using DNA, glass and holograms": "https://www.techradar.com/news/dna-data-storage-is-the-most-important-innovation-youve-never-heard-about",
    "current roadmap": "https://www.lto.org/roadmap/"
  }
}