{
  "source": "https://www.techradar.com/news/oneplus-9-images-specs-and-colors-leaked",
  "title": "OnePlus 9 images, specs and colors leaked",
  "category": "phones",
  "updated": "2021-03-11T09:51:33Z",
  "author": "james-rogerson",
  "summary": "Is plastic planned?",
  "article": [
    "The OnePlus 9 range is landing on March 23, but as so often happens with phones the range has been extensively leaked ahead of that, and now we’ve had a close look at the OnePlus 9 and OnePlus 9 Pro in all the likely launch colors.",
    "These images were shared by WinFuture, which claims the OnePlus 9 Pro will initially be available in black, green and silver shades, which is in line with a previous color leak.",
    "The site also mentions other things we’ve heard before, such as that the OnePlus 9 Pro will apparently have a 6.7-inch curved OLED screen, 5G, and that its two main cameras with be 50MP and 48MP, with one using the custom Sony IMX789 sensor that OnePlus has already confirmed, and the other using a Sony IMX766.",
    "The images meanwhile look much as we’ve seen in previous leaks, and indeed in teasers from OnePlus itself.",
    "As for the standard OnePlus 9, that will apparently come in black, blue and purple shades, with a 6.5-inch flat screen and 5G support. Interestingly, it seems that this model might have a plastic frame, while the OnePlus 9 Pro is expected to have a metal one in line with most flagships.",
    "WinFuture doesn’t seem certain that the frame on the OnePlus 9 is plastic, but notes that the lack of visible antenna lines suggests so. It further theorizes that the back might therefore be plastic too, in line with the Samsung Galaxy S21, but that’s just speculation for now.",
    "Given that Samsung seems to have got away with switching to plastic in expensive phones we could believe that OnePlus would too, but if it has made this switch then we hope the OnePlus 9 is at least priced accordingly.",
    "We’ll find out soon, and it’s likely ever more leaks will emerge between now and the March 23 launch, so stay tuned for updates."
  ],
  "headers": {},
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "WinFuture": "https://winfuture.de/news,121663.html",
    "a previous color leak": "https://www.techradar.com/news/oneplus-9-colors-leak-reveals-a-range-of-chilly-shades",
    "teasers from OnePlus itself": "https://www.techradar.com/news/oneplus-9-will-come-with-a-charger-in-the-box",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}