{
  "source": "https://www.techradar.com/news/8-new-shows-and-movies-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-september-11-2021",
  "title": "7 new shows and movies on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-09-10T14:00:00Z",
  "author": "samuel-roberts",
  "summary": "What's streaming over the next few days?",
  "article": [
    "Looking for something new to stream on Netflix and other services this weekend? Good news: it's been a fairly busy week for the release of new shows and movies, with an exciting new miniseries featuring big movie stars, another big movie premiere on HBO Max, and even a documentary about leggings (sort of).",
    "Below, we've selected eight streaming highlights you can enjoy over this September weekend, and we'll explain how to watch each in the US and the UK. Everything from Apple TV and Disney Plus is represented in this varied lineup, so happy streaming!",
    "James Wan (The Conjuring, Saw) returns with an original horror movie this weekend. It's about a woman who sees visions of murders committed by something or someone from her past – it doesn't look enormously innovative, but should be solid for a few scares, given the director's track record. Side note: it's a little strange that Malignant's release wasn't time to coincide with Halloween – but that's probably because Dune is coming out in late October.",
    "US viewers can watch this at home on the HBO Max ad-free $14.99 monthly plan for 31 days. Everyone else, including those who want to see Malignant in the UK, will have to check it out on the big screen.",
    "Now streaming on HBO Max via the ad-free plan",
    "Oscar Isaac and Jessica Chastain, who co-starred in the acclaimed oil-themed drama A Most Violent Year in 2014, reunite in this glossy HBO adaptation of the milestone Ingmar Bergman mini-series.",
    "Watching a relationship deteriorate over time in a mostly isolated location might not be optimal pandemic viewing, but damn, what a cast – Corey Stoll and Nicole Beharie co-star.",
    "Hagai Levy, who worked on the Showtime series The Affair, directed all five episodes of Scenes from a Marriage. Those in the US can catch it on HBO Max, while UK viewers will eventually get to see it on Sky and NOW this year – it just doesn't have a release date yet.",
    "Airs on HBO this Sunday and streaming on HBO Max thereafter",
    "The series that asks 'what if Lucifer ran a nightclub in Los Angeles?' finally comes to a conclusion this week after six seasons – and one mid-run change of home, after Netflix saved it from cancellation. You get 10 episodes in total this season, with episode 3 acting as an animated episode, which is the sort of thing you only get when a popular show has been running this long (see also: the Scrubs and Buffy music episodes).",
    "This season you'll see Lucifer (Tom Ellis) adjust to life with Chloe (Lauren German) after a brief time skip. Hopefully, fans will enjoy the way this often-outrageous DC Comics adaptation comes to a close.",
    "Now streaming on Netflix",
    "Mary Elizabeth Winstead stars in this action movie about an assassin who, during a botched hit on a Yakuza boss, is poisoned and seeks revenge as she slowly dies. It sounds daft, but the trailer makes it look like fun – at least on the action side of things, where it might superficially remind you of John Wick.",
    "Critics haven't been keen, however, with multiple outlets pointing out that it's derivative and pretty anaemic when it comes to story. The set pieces have drawn praise, though. However, now that you have actual movies in the theater to go and watch, maybe this seems a little less appealing than it might have done previously.",
    "If you do end up watching it, you have a supporting turn from Woody Harrelson to look forward to.",
    "Now streaming on Netflix",
    "This documentary series is about the company LuLaRoe, best known for distributing women's leggings, until it was sued by the state of Washington, accused of being a pyramid scheme. Sounds like fertile territory for a documentary series, eh?",
    "LuLaRich is available on Amazon Prime Video in both the US and the UK. The documentary makers previously worked on Fyre Fraud for Hulu, so if you enjoyed the style of that one, this should make for comfortable viewing. There are four episodes in total.",
    "Now streaming on Amazon Prime Video",
    "Daniel Craig reflects on his 15 years playing James Bond in this 46-minute documentary, which is free to watch on the Apple TV app – no Apple TV Plus subscription is required. It features Craig discussing his portrayal of the character with producers Barbara Broccoli and Michael G. Wilson, with exclusive behind-the-scenes footage of the movies' creation.",
    "And with No Time To Die now confirmed for release within the next month, it's a good time to get yourself reacquainted with 007.",
    "Now streaming on Apple TV",
    "This spiritual successor to Neil Patrick Harris kids' series Doogie Howser, MD, has started rolling out on Disney Plus. Set in Hawaii, the show follows 16-year-old up-and-coming medical whizz Lahela Kameāloha (Peyton Elizabeth Lee), who works with her mother at the local hospital.",
    "How do they justify the 'Doogie' part of the title, then? Well, in this universe, the characters have seen the TV show Doogie Howser – so she gets given the nickname as a result of that. Weird, huh?",
    "Still, it looks wholesome enough, and not every big Disney Plus original needs to feature superheroes or bounty hunters (although we wouldn't complain if they did). Jumanji director Jake Kasdan made the first episode.",
    "Now streaming on Disney Plus, with new episodes available weekly"
  ],
  "headers": {
    "2": "Malignant (HBO Max)",
    "5": "Scenes From a Marriage (HBO Max)",
    "9": "Lucifer (Netflix)",
    "12": "Kate (Netflix)",
    "16": "LuLaRich (Amazon Prime Video)",
    "19": "Being James Bond (Apple TV)",
    "22": "Doogie Kameāloha, MD (Disney Plus)"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Dune": "https://www.techradar.com/news/dune-co-writer-wants-you-to-decide-if-itll-get-a-sequel",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "No Time To Die now confirmed for release": "https://www.techradar.com/news/final-no-time-to-die-trailer-drops-confirming-james-bonds-imminent-return"
  }
}