{
  "source": "https://www.techradar.com/news/one-of-the-internets-most-infamous-domain-names-is-up-for-sale",
  "title": "One of the internet's most infamous domain names is up for sale",
  "category": "computing",
  "updated": "2021-08-13T12:04:21Z",
  "author": "joel-khalili",
  "summary": "A bidding war is underway for thepiratebay.com",
  "article": [
    "One of the internet’s most notorious domains, thepiratebay.com, is currently up for sale on auction site Sedo.",
    "The .org and .com addresses attached to the famous torrenting operation changed hands last year after the owners accidentally allowed them to lapse. They were quickly snapped up by Dropcatch, a service that captures lapsed domains, and then auctioned off.",
    "Now, thepiratebay.com is back up for sale, with a current minimum asking price of $65,000, more than double the amount paid by the anonymous buyer last time round ($31,500).",
    "Although the team behind The Pirate Bay ran the torrenting operation predominantly out of thepiratebay.org, they also held the equivalent .com address, which redirected traffic to the main site.",
    "However, thepiratebay.com still attracts a significant number of visitors, which means it holds plenty of value. According to data from Similarweb, upwards of 150,000 people land on the site each month, despite the fact the torrenting operation has long since moved elsewhere.",
    "The person who purchased the domain when it became available last year monetized the site by turning it into an advertising feed.",
    "“I knew it would receive a very large volume of type-in traffic from people mistakenly typing thepiratebay.com instead of .org,” he said, speaking to TorrentFreak.",
    "The individual also had grand plans to turn the website into a legal download library, which would presumably have generated more revenue than a simple advertising feed, but this never came to fruition.",
    "“Due to other commitments/projects, I’ve not had the time,” they explained. “Although it earns pretty well being parked at Sedo, I think parking it is a waste for such a valuable domain, so I decided to list it for sale.”"
  ],
  "headers": {
    "3": "The Pirate Bay changes hands"
  },
  "links": {
    "domains": "https://www.techradar.com/news/best-domain-registrars",
    "current minimum asking price of $65,000": "https://sedo.com/search/?keyword=thepiratebay.com",
    "data from Similarweb": "https://www.similarweb.com/website/thepiratebay.com/",
    "TorrentFreak": "https://torrentfreak.com/thepiratebay-com-goes-up-for-sale-but-renting-is-an-option-too-210812/"
  }
}