{
  "source": "https://www.techradar.com/news/tesla-to-open-supercharger-network-to-other-electric-cars-later-this-year",
  "title": "Tesla to open Supercharger network to other electric cars later this year",
  "category": "car-tech",
  "updated": "2021-07-21T10:01:33Z",
  "author": "axel-metz",
  "summary": "Leading the charge",
  "article": [
    "Electric vehicles (EVs) may be about to get a major shot in the arm thanks to Tesla CEO Elon Musk's plans to open the company's Supercharger network to other EVs later this year.",
    "The news comes from a tweet posted by Musk himself, in which the tech mogul also clarified that the only reason the network wasn't already available to other manufacturers was because Tesla, for a long time, \"was the only maker of long range electric cars,\" and so \"there was no standard [of charging].\"",
    "Tesla's Supercharger network is made up of the company's own proprietary charging connectors, with over 25,000 superchargers positioned around the globe to juice up Tesla models, exclusively.",
    "This is big news for the automotive industry. Essentially, it would mean thousands more stations at which EV owners could charge their cars.",
    "Although Musk didn't specify where in the world Tesla would make its DC fast-charging stations available for use with other EVs, existing rumors have pointed to Germany, Norway and Sweden as preliminary beneficiaries.",
    "The Tesla boss also didn't allude to which makes and models would become compatible with the company's Supercharger network. However, at present, V2 and V3 Tesla Superchargers based in Europe use a CCS connector (used by the Model 3 and most other EVs) so, when opened up to other manufacturers, owners of non-Tesla EVs will be able to use these Superchargers without needing an adapter.",
    "It follows, therefore, that US-based Superchargers will be fitted with CCS connectors, too, to make the entire network more widely available – as opposed to fitting other EVs with Tesla-compatible connectors.",
    "Interestingly, Tesla has used the exclusivity of its Supercharger network as an effective marketing tool to sell its vehicles, so the move to let other manufacturers in on the act seems, at least superficially, in the interest of the industry as a whole rather than Tesla itself.",
    "The chargers currently bill drivers by the minute, so perhaps Tesla owners would be set to receive discounted charging fees compared to drivers of other EVs using the same Supercharger stations. Alternatively, Musk may introduce some kind of tiered subscription service to separate Tesla drivers and those with other vehicles.",
    "Whatever the case, this marks a major step forward for EV accessibility globally – and we expect to see the network open up to more drivers within the year.",
    "Musk’s announcement coincides with new reports showing that even EVs that plug into dirty grids (i.e. grids that still rely on fossil fuels) emit fewer greenhouse gases than their combustion engine equivalents.",
    "The research also puts to bed claims that EVs, in the long-run, aren’t actually that much cleaner than the gas-powered cars they succeeded. Figures show that over the course of an EV’s life-span – from the materials extracted to produce it to its ultimate scrapping some decades later – it will still release fewer greenhouse gas emissions than combustion-based vehicles.",
    "The impending expansion of Tesla’s Supercharger network, then, will only work to further reduce global emissions in tandem with the ever-accelerating EV revolution."
  ],
  "headers": {
    "10": "Green grid"
  },
  "links": {
    "tweet": "https://twitter.com/elonmusk/status/1417593502351826946",
    "new reports": "https://www.theverge.com/2021/7/21/22585682/electric-vehicles-greenhouse-gas-emissions-lifecycle-assessment"
  }
}