{
  "source": "https://www.techradar.com/news/new-m1-macbook-pro-models-could-arrive-sooner-than-you-thought",
  "title": "New M1 MacBook Pros said to be delayed, but still landing this year",
  "category": "computing",
  "updated": "2021-03-10T15:13:09Z",
  "author": "axel-metz",
  "summary": "Out with the new ports, in with the old",
  "article": [
    "Two new Apple Silicon-powered MacBook Pro models are expected to arrive in the second half of 2021 – slightly later than originally planned.",
    "According to a Nikkei Asia report, Apple has rescheduled its plans to begin mass producing two new MacBook laptops in the latter half of the year, whereas previously it was thought they might arrive some time in Q2 2021.",
    "Even though the report refers to a delay, it nonetheless corroborates previous comments made by respected Apple analyst Ming-Chi Kuo, who suggested we’d almost certainly see two new MacBook Pro models at some point in 2021.",
    "We’ve previously reported on the upgrades expected of Apple’s next MacBook Pro iterations, with the focus likely to be on aesthetic changes to their design and port types.",
    "For example, we anticipate the return of the HDMI port and SD card reader in the upcoming devices, features which have been omitted in favor of USB-C and Thunderbolt 3 connections since 2015.",
    "We’re also expecting the new MacBooks to come equipped with an improved Apple Silicon chipset, which rumors suggest might be called the M1X. A recent leak shows an Apple M1X with 12 cores, an increase over its predecessor’s 8, which will reportedly arrive in the form of 8 high-performance ‘Firestorm’ cores coupled with 4 efficient ‘Ice Storm' cores.",
    "The CPU will allegedly see an even more impressive upgrade in the graphics department. The leaked benchmarks, which are said to come from a “pre-sample” of the M1X, suggests the processor will feature a 16-core GPU with 256 execution units.",
    "What’s more, it’s likely the new MacBook Pros will play host to the return of the ‌MagSafe‌ charging connector.",
    "Rumors indicate that the returning ‌MagSafe‌ port will be a standalone charging port used instead of USB-C, with the new port located next to the existing USB-C ports.",
    "The design of the new ‌MagSafe‌ connector will allegedly be similar to the design of the previous ‌MagSafe‌ connector used on Macs, and will allow for faster charging speeds than are possible with USB-C – a technology it seems Apple is unwilling to entirely embrace. As with all rumored information, don't take any of this as gospel. We can't confirm any details until they come directly from Apple or the product hits the shelves, but it certainly bodes well for Mac fans if these leaks prove accurate.",
    "Via WCCFTech"
  ],
  "headers": {
    "7": "Return of the Mag"
  },
  "links": {
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Nikkei Asia": "https://asia.nikkei.com/Business/Technology/Apple-slashes-planned-iPhone-12-mini-production-for-1H",
    "some time in Q2 2021": "https://www.techradar.com/news/macbook-pro-models-could-regain-hdmi-ports-and-sd-readers-in-2021",
    "previous comments": "https://www.techradar.com/news/macbook-pro-models-could-regain-hdmi-ports-and-sd-readers-in-2021",
    "previously reported": "https://www.techradar.com/news/macbook-pro-models-could-regain-hdmi-ports-and-sd-readers-in-2021",
    "HDMI port and SD card reader": "https://www.techradar.com/news/macbook-pro-models-could-regain-hdmi-ports-and-sd-readers-in-2021",
    "recent leak": "https://www.techradar.com/news/apple-m1x-leak-suggests-macbooks-are-in-line-for-a-major-performance-boost",
    "Rumors": "https://www.macrumors.com/2021/01/15/magsafe-coming-to-macbook-pro-2021/",
    "Apple is unwilling": "https://www.techradar.com/news/future-iphones-may-have-magnetic-charging-ports-patent-suggests",
    "WCCFTech": "https://wccftech.com/two-apple-silicon-macbooks-h1-2021-mass-production/"
  }
}