{
  "source": "https://www.techradar.com/news/samsung-reveals-its-biggest-smart-monitors-yet",
  "title": "Samsung reveals its biggest smart monitors yet",
  "category": "computing",
  "updated": "2021-05-24T21:20:57Z",
  "author": "anthony-spadafora",
  "summary": "Samsung has upgraded its do-it-all displays with new form factors and designs",
  "article": [
    "After launching the world's first do-it-all screen last year, Samsung has updated its Smart Monitor series with additional display sizes, new design options and enhanced smart features.",
    "When the Samsung M7 Smart Monitor launched last year, it was already quite big for a business monitor with a screen size of 32 inches. Now though, the Korean hardware giant has increased its size substantially with a new 43-inch model. The 43-inch M7 features a 4K Ultra-High Definition (UHD) display that can seamlessly switch from a work from home device to a 4k entertainment hub with built-in streaming apps, speakers and HDR10 capabilities.",
    "Samsung has also updated its M5 Smart Monitor range with a new sleek and stylish white design for both its 27- and 32-inch models. The new design will help the business monitor blend in and add a finishing touch of color to any interior aesthetic. Those looking for a more compact monitor with the same smart features are in luck as Samsung is launching a new 24-inch version of its M5 Smart Monitor designed to be more accessible in terms of both size and pricing.",
    "SVP of Samsung's Visual Display Business, Hyesung Ha explained how the company's smart monitors can help users adapt their homes into multi-functional environments in a press release, saying:",
    "“As time spent working, learning and playing from home increases for people around the world, homes are being transformed into multi-functional environments. Our expanded Smart Monitor lineup will continue to provide users with even more convenient and flexible ways to accomplish everyday activities through technology, enabling them to truly ‘do it all’ through powerful mobile and PC connectivity on the smartest monitor available on the market today.”",
    "Alongside these new size and design options, Samsung is also unveiling a range of new features for its smart monitors.",
    "As the M7 and M5 Smart Monitor can easily be used to watch content, the company has included a 100 percent free ad-supported Smart TV video service called TV Plus. Finding something to watch will also be easier as Samsung's Universal Guide now offers content recommendations based on user preferences and viewing patterns.",
    "While Samsung's original smart monitors only supported Bixby as a voice assistant, the company's new models also support Google Assistant and Amazon Alexa. The company's smart monitors also support Microsoft 365 applications so that users can view and edit documents and even same them to the cloud without a PC connection.",
    "When it comes to connectivity, the Samsung Smart Monitor Lineup features numerous options for connecting PCs and smartphones. Users can can connect their mobile devices with just a quick tap using Tap View, Mirroring or with Apple AirPlay 2. At the same time though, Samsung DeX allows users to enjoy a complete desktop experience by connecting their monitor with supported Android smartphones over USB-C.",
    "Although Samsung has yet to announce pricing for its new monitors, the 32-inch M7 cost $399 at launch while the 27-inch M5 was $229.99 which should give you a general idea regarding how much these new models will cost."
  ],
  "headers": {
    "5": "Smart upgrades"
  },
  "links": {
    "do-it-all screen": "https://www.techradar.com/news/samsung-launches-do-it-all-smart-monitors-for-offices-and-homes",
    "Samsung": "https://www.techradar.com/news/samsung-is-the-worlds-biggest-smartphone-manufacturer-once-again",
    "Samsung M7 Smart Monitor": "https://www.techradar.com/reviews/samsung-m7-smart-monitor",
    "business monitor": "https://www.techradar.com/news/best-business-monitor",
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "press release": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1148830358596500400&url=https%3A%2F%2Fnews.samsung.com%2Fus%2Fsamsung-expands-smart-monitor-lineup-2021-do-it-all-displays%2F&article_name=Samsung%20reveals%20its%20biggest%20smart%20monitors%20yet&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-reveals-its-biggest-smart-monitors-yet",
    "TV Plus": "https://www.techradar.com/news/samsung-tv-plus-the-free-tv-streaming-service-explained",
    "Bixby": "https://www.techradar.com/how-to/what-is-bixby-our-guide-to-samsungs-voice-assistant",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Apple AirPlay 2": "https://www.techradar.com/news/airplay-2-speakers",
    "Samsung DeX": "https://www.techradar.com/news/samsung-dex-goes-wireless-only-if-you-have-a-galaxy-s21"
  }
}