{
  "source": "https://www.techradar.com/news/amazons-next-neil-gaiman-adaptation-has-found-its-main-star",
  "title": "Amazon's next Neil Gaiman adaptation has found its main star",
  "category": "entertainment",
  "updated": "2021-09-15T13:50:27Z",
  "author": "tom-power",
  "summary": "Amazon's adaptation of Anansi Boys has landed its lead actor",
  "article": [
    "Amazon Prime's next Neil Gaiman adaptation – Anansi Boys – has cast Malachi Kirby in its two lead roles.",
    "In a press release, Amazon Studios revealed that the Small Axe star will portray twin brothers Charles Nancy and Spider in its TV adaptation of Gaiman's best-selling fantasy novel.",
    "Kirby joins Delroy Lindo (Da 5 Bloods, The Good Fight), who had already been cast in the role of Mr. Nancy, the father of Charles and Spider.",
    "Speaking about Kirby's casting as part of Amazon's announcement, Gaiman said: “Malachi Kirby is an actor of astonishing sensitivity, charm, and power. We needed somebody who could bring us the humanity of Charlie and the godly dangerousness of Spider; who could play two very different characters and who could in many ways carry the show. We found Malachi, and I am so thrilled that we did. He's astonishing.”",
    "First published in 2005, Anansi Boys follows Charles, an awkward, stressed and soon-to-be married man who hates his job. When Charles finds out that he has a magical twin sibling called Spider, whose powers originate from their father Mr. Nancy, the pair embark on a series of humorous (and at times tempestuous) adventures as they explore what they have, or don't have, in common.",
    "The six-part limited series, which will begin filming in Scotland later in 2021, is being written by Gaiman and Sir Lenny Henry. Gaiman and Douglas Mackinnon are serving as co-showrunners, with Hanelle M. Culpepper directing the pilot. A release date is yet to be revealed.",
    "Anansi Boys is the third collaboration between Gaiman and Amazon Studios since the author penned an overall deal to exclusively produce new series for the company's streaming platform.",
    "Good Omens, the first of Gaiman's works that Amazon has adapted, was a great success for the pair. The David Tennant and Michael Sheen-starring fantasy comedy series currently holds an 84% approval rating on Rotten Tomatoes, and was lauded by fans and critics alike.",
    "A second season is set to enter production later this year, with Tennant and Sheen reprising their roles as Crowley and Aziraphale respectively. So Amazon clearly has confidence that audiences will tune into more antics involving the pair.",
    "Anansi Boys and Good Omens' second outing, then, have the potential to be as big as Good Omens season 1. Both series are likely to retain the humor and fantastical worlds that Gaiman has built and, with the author heavily involved in their productions, neither should stray too far from his original visions for both shows.",
    "Of course, Gaiman hasn't enjoyed a 100% success rate with adaptations of his works. A Starz adaptation of American Gods – which aired on Amazon Prime in the UK – was initially well received, but subsequent seasons failed to capture viewers' imaginations. The TV adaptation was subsequently canceled after its third season.",
    "Other Gaiman properties, including movie versions of Stardust and How to Talk to Girls at Parties, have also received mixed to poor reviews. Meanwhile, Coraline and Lucifer – the latter of which has just seen its final season released on Netflix – resonated better with audiences.",
    "With Sandman, Gaiman's most famous work, due to land on Netflix sometime soon, the author will hope that upcoming adaptations of his books and graphic novels will be better received on a more consistent basis.",
    "Anansi Boys certainly has the capacity to be part of that and, with two established names attached to star in its TV adaptation, we're pretty confident that it'll be another success for Gaiman and Amazon alike."
  ],
  "headers": {
    "6": "Analysis: will Anansi Boys be another hit adaptation for Gaiman and Amazon?"
  },
  "links": {
    "Rotten Tomatoes": "https://www.rottentomatoes.com/tv/good_omens",
    "set to enter production": "https://www.techradar.com/news/good-omens-season-2-is-coming-to-amazon-prime-but-is-it-needed"
  }
}