{
  "source": "https://www.techradar.com/news/sony-could-be-making-way-for-high-end-aps-c-mirrorless-with-discontinuations",
  "title": "Sony A6500 discontinuation signals shake-up for its APS-C mirrorless cameras",
  "category": "cameras",
  "updated": "2021-05-12T11:13:03Z",
  "author": "sharmishta-sarkar",
  "summary": "RIP A6300 and A6500 – it was a great journey",
  "article": [
    "Sony's crop-sensor APS-C format mirrorless cameras have always had only a limited number of models, and that number is now reducing.",
    "Last year, Sony removed the Alpha A6300 model from its website, which eventually led to retailers removing it from shelves. It's now the turn of the Sony A6500 to follow suit, with the camera no longer listed on Sony's online marketplace and some retailers labeling it as \"no longer available\" or removing any mention of the model entirely.",
    "That leaves just the Sony A6000, A6100, A6400 and the A6600 in the company's APS-C format bodies – at least in some markets. In Australia, only three of those models are available on Sony's online storefront – the A6000 from 2014, and the 2019-released A6400 and A6600. Does this mean the A6100 is doomed as well?",
    "The discontinuation of the A6300 and the A6500 would make sense – they're aging kits that launched in March 2016 and October 2016 respectively – but the A6100 was only announced in 2019 and was the successor to the A6000, bringing some significant upgrades over the older model.",
    "While the effective sensor resolution was more or less the same, the A6100 included a front-end LSI chip that bumped up the camera's performance, alongside a newer BionZ X processor. Native ISO range on the A6100 was also slightly better, taking it to ISO 32000 from the A6000's upper limit of ISO 25,600 (even for video). And it was capable of 14-bit RAW and 16-bit image processing, which the older camera cannot handle.",
    "And then let's not forget the advances in autofocus – Sony mirrorless cameras have come leaps and bounds in AF performance since they first launched, and the A6100 brought real-time Eye AF and tracking for both humans and animals.",
    "The A6100 was also capable of 4K video recording at up to 30fps, while the A6000 is only capable of Full HD 1080p at up to 60fps.",
    "There are some other differences, like small design tweaks to make the A6100 more user-friendly and adding more modern features like the addition of an intervalometer for timelapse videos and Bluetooth connectivity.",
    "That said, the A6000 was a hugely popular beginner-friendly camera, and given it has endured since 2014 is a significant feat for Sony. So it does make sense to hold on to a bestseller.",
    "And the A6100 seems to have been discontinued only in certain markets (where it's still available through a few retailers flogging existing stock), but continues to be sold in the US and UK. Whether the A6100 will soon go the way of the A6300 and A6500 worldwide remains to be seen."
  ],
  "headers": {
    "3": "Are we saying farewell to the Sony A6100?"
  },
  "links": {
    "Alpha A6300": "https://www.techradar.com/reviews/sony-alpha-a6300-review",
    "Sony A6500": "https://www.techradar.com/reviews/sony-alpha-a6500",
    "Sony A6000": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/sony-alpha-a6000-1223772/review",
    "A6100": "https://www.techradar.com/reviews/sony-a6100",
    "A6400": "https://www.techradar.com/reviews/sony-alpha-a6400-review",
    "A6600": "https://www.techradar.com/reviews/sony-a6600"
  }
}