{
  "source": "https://www.techradar.com/news/invincible-season-1s-finale-shows-how-amazon-should-handle-seasons-2-and-3",
  "title": "Invincible season 1’s finale shows how Amazon should handle seasons 2 and 3",
  "category": "entertainment",
  "updated": "2021-05-07T16:37:14Z",
  "author": "tom-power",
  "summary": "Invincible episode 8 is mightily impressive",
  "article": [
    "Spoilers follow for Invincible season 1.",
    "Invincible season 1 has ended on Amazon Prime Video – and, oh boy, is its finale a visceral gut-punch.",
    "The R-rated animated TV series has been largely enjoyable, but Invincible episode 8 took proceedings to a whole new level. It was a violent, tragic and, at times, pretty humorous end to the TV show’s first outing which, after a slow start, found its feet and proved to be a solid adaptation of Robert Kirkman, Cory Walker and Ryan Ottley’s graphic novels.",
    "More than that, though, Invincible season 1’s finale laid down a marker for how Amazon has to approach Invincible season 2.",
    "Invincible has been renewed for two more seasons and, judging by the responses to the announcement, Invincible’s fanbase is delighted. The TV show’s popularity, too, has proved a boon for its source material, with 100,000 copies sold since the series’ debut in March. With plenty of story left for Amazon’s adaptation to explore, it’s unsurprising that seasons 2 and 3 have been greenlit.",
    "Still, Invincible hasn’t been without its problems. While I’ve been largely impressed, I’ve had issues with Amazon’s adaptation. Season 1’s finale, though, gives me hope that these issues can be rectified, and it offers a template for how seasons 2 and 3 should be approached.",
    "Like Nolan Grayson, aka Omni-Man, teaching his son Mark how to use his Invincible superpowers, season 1 needed to walk before it could run. In less analogous terms, TV shows like Invincible need to introduce its characters and world slowly, so audiences don’t feel overwhelmed or confused about who’s who or what’s going on.",
    "This element of Invincible, though, remains for the series’ first few episodes, which makes its pacing feel sluggish. Admittedly, it’s admirable that Invincible’s creators wanted to maintain a 45-minute runtime for each episode. It’s annoying when TV shows, such as Amazon Prime Video horror series Them, arrive in episodes with dramatically different lengths which, in that show’s case, didn’t allow its plot to flow particularly well.",
    "Invincible season 1, though, might have profited from some episodes being shorter than others. The pilot introduced us to Invincible’s universe, while the finale wrapped up season 1’s main story arc. These entries should have longer runtimes, then, in order to book-end the first season’s overarching plot.",
    "Episode 8, in particular, benefits from its 45-minute length. In it, Omni-Man finally tells Mark/Invincible the truth about the Viltrumites. Basically, they’re a race of arrogant superpowered beings who want other civilizations to live under their rule – or face annihilation. This revelation, coupled with Nolan’s cruel assertion that he considered Mark’s mother Debbie to be nothing more than a pet, causes Mark to become enraged.",
    "He refuses to join his dad’s cause to enslave humanity, and the pair fight. What ensues is the destruction of the city of Chicago, countless innocent lives lost (in gratuitous detail, too) and Omni-Man almost pummeling Invincible to death. To Mark’s credit, he tries to save as many people as possible but, ultimately, he’s outmatched by his father’s strength, will and brutality.",
    "Episode 8’s devastating events, then, require a lengthier episode to do them justice. We need to hear the real reason behind Omni-Man’s arrival on Earth, to witness his barbaric assault on Mark and Chicago in detail, and – as viewers – have the time to wrestle with the ramifications of the pair’s actions. Mark’s efforts are noble – sacrificial, even – but his decision to turn on his father only leads to more death and ruin. As Kirkman pointed out to us ahead of the series’ debut, Invincible reckons with the consequences of superpowered individuals and their actions. To do so, the TV show requires episodes with more minutes to convey this.",
    "Other episodes, however, feel stretched out by their 45-minute runtimes. It isn’t necessary to see Mark and Amber squabble numerous times in the same episode, nor to witness the Flaxan aliens’ invasion of Earth four times in episode 2. Sure, such moments offer drama and action aplenty but, ultimately, they slow the flow of episodes down.",
    "Heading into seasons 2 and 3, I’d like to see Amazon’s adaptation take a different approach. Let the first and final episodes breathe with longer runtimes, but restrict other entries to a maximum of 30 to 35 minutes. It would mean cutting five to 10 minutes' worth of content out of each episode, but it would help to make episodic tales tighter, and flow better.",
    "By and large, Invincible’s animation is terrific. The blend between 2D and 3D is superb, fights are viscerally savage, and there’s even a nostalgic hint of old 1990s animated superhero TV shows, such as Batman: The Animated Series, within.",
    "There are, though, moments where I’ve been pulled out of episodes by certain scenes. One such instance takes place in the pilot, when Mark tells his parents that his powers have finally begun to emerge. As Nolan responds to Mark, his movements lack polish and seem unfinished, which felt less immersive to me. In episode 2, again, the Flaxans’ attacks are something of a letdown. It doesn’t feel like there are enough alien soldiers present on screen to properly convey the increasing scale of each invasion, especially in wide shots, and doesn’t present a true reflection of how overwhelmed Mark and the Teen Titans become during the Flaxans’ final assault.",
    "Thankfully, later episodes mostly iron out these problems, which brings me back to season 1’s finale. The magnitude of destruction is better realized due to the field of view in certain scenes (the Chicago skyscraper sequence, for instance), as is the ferocity of Omni-Man’s attacks, such as that harrowing subway scene. Add in the various locations where Mark and Nolan’s battle occurs, and you really get a feeling of scope and reach in episode 8.",
    "Close-up shots are also improved. Characters’ movements are more flexible and, even though it’s an animated series, appear authentic.",
    "With a season under their belts, the various production departments will have a clearer idea of what works from art and animation standpoints. In my view, seasons 2 and 3 can only benefit from the finale’s blend of aesthetics and styles – and if this blueprint is retained, Invincible’s next two instalments will only look better with time.",
    "Invincible season 1 is only the beginning for Amazon’s animated adaptation. It got off to a rough start but, like its comic-book cousin, it’s improved with each instalment.",
    "The first season only seems to have covered the first 23 issues of Invincible as well. With 144 comics in total, there are a lot more stories to be told, characters to introduce, and sadistic battles to endure between now and the TV series’ last-ever episode.",
    "Judging by the season 1 finale thread on the Invincible sub-Reddit, and the high social media engagement for episode 8, fans won’t get tired of the TV adaptation anytime soon.",
    "I include myself in that group. Invincible episode 8 did enough to show me that the series’ producers have learned from its teething problems and, like The Boys, Invincible has the capacity to become a major superhero hit for Amazon. The superhero movie and TV landscape is becoming increasingly congested, however, so Invincible seasons 2 and 3 have to build on the foundations laid by the season 1 finale.",
    "If it does, my interest won’t waver. Right now, I’m excited to see how Amazon adapts the rest of Mark’s story, and the wider Invincible universe, in future seasons. As long as Amazon, Skybound, and everyone else involved maintains the stellar work showcased in Invincible season 1’s finale, the only way for the show, as for Mark, is up.",
    "Invincible season 1 is available to stream in its entirety on Amazon Prime Video now."
  ],
  "headers": {
    "6": "Pace yourself",
    "14": "Animation alterations",
    "19": "Finding its feet"
  },
  "links": {
    "Invincible season 1": "https://www.techradar.com/news/invincible-on-amazon-prime-video-is-a-violent-but-heartfelt-superhero-show",
    "Invincible season 2": "https://www.techradar.com/news/invincible-season-2",
    "100,000 copies sold": "https://bleedingcool.com/comics/invincible-100000-graphic-novels-2021/",
    "Amazon Prime Video horror series Them": "https://www.techradar.com/news/how-them-on-amazon-prime-video-looks-to-tackle-issues-around-racism-in-america",
    "ahead of the series’ debut": "https://www.techradar.com/news/inside-invincible-on-amazon-prime-a-hyper-violent-spin-on-heroes-and-villains",
    "Invincible sub-Reddit": "https://www.reddit.com/r/Invincible/comments/n1htht/invincible_episode_discussion_s01e08_where_i/",
    "high social media engagement": "https://twitter.com/InvincibleHQ/status/1388029875701747714"
  }
}