{
  "source": "https://www.techradar.com/news/amazon-deal-alert-the-all-new-fire-tv-stick-lite-is-on-sale-for-just-dollar2199",
  "title": "Amazon deal alert: the all-new Fire TV Stick Lite is on sale for just $21.99",
  "category": "televisions",
  "updated": "2021-01-28T16:06:12Z",
  "author": "mackenzie-frazier",
  "summary": "Stream your favorite content with Amazon's latest Fire TV Stick",
  "article": [
    "If you're on the hunt for a cheap streaming device, then you're in luck. Amazon's deal of the day includes the all-new Fire TV Stick Lite that's on sale for just $21.99. That's a 27% discount and a fantastic price for an HD streaming device with voice control.",
    "The Fire TV Stick Lite is the newest addition to the Amazon Fire TV family, and it's the cheapest device that Amazon has put out yet. The budget streaming stick allows you to stream your favorite content from apps like Hulu, Amazon Video, Netflix, and more. You'll get access to tens of thousands of channels, Alexa skills, and apps, and the Alexa voice remote allows you to browse shows, launch movies, adjust the volume, and more completely hands-free. As we mentioned above, this is a fantastic deal for a streaming device, and today's price is only $4 more than the record-low set during Black Friday. We don't know how long Amazon will have the Fire TV Stick Lite on sale, so you should take advantage now before it's too late.",
    "Not in the US? See the best Fire TV Stick deals in your region below.",
    "See more of the best cheap Amazon Fire TV Stick deals that are happening now. You can see more offers with our roundup of the best Super Bowl TV deals and our guide to the best President's Day sales."
  ],
  "headers": {
    "1": "Amazon Fire TV Stick deal"
  },
  "links": {
    "on sale for just $21.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Ffire-tv-stick-lite%2Fdp%2FB07YNLBS7R%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1198256238953365200-20",
    "Fire TV Stick Lite": "https://www.techradar.com/reviews/amazon-fire-tv-stick-lite",
    "cheap Amazon Fire TV Stick deals": "https://www.techradar.com/news/best-amazon-fire-tv-deals",
    "best Super Bowl TV deals": "https://www.techradar.com/news/best-super-bowl-tv-deals-201",
    "best President's Day sales": "https://www.techradar.com/news/presidents-day-sales-deals-2021"
  }
}