{
  "source": "https://www.techradar.com/news/anonymous-has-leaked-another-cache-of-epik-user-data",
  "title": "Anonymous has leaked another cache of Epik user data",
  "category": "computing",
  "updated": "2021-09-30T13:29:02Z",
  "author": "mayank-sharma",
  "summary": "New data appears to contain disk images of Epik servers",
  "article": [
    "Hacktivist group Anonymous has shared server disk images extracted from controversial web hosting platform Epik, according to reports.",
    "The latest leak compliments the 180GB of Epik’s data the group had shared earlier this month, in order to express its displeasure with the hosting provider serving as a refuge for hate mongers and extremists.",
    "“A security researcher who was able to verify the extent of the leak to me described it as \"a complete own.\" At over 300 gigabytes worth of data, this leak is larger than the first,” tweeted Journalist Steve Monacelli, who broke the news of the first data release.",
    "In a followup tweet, he added that the latest data dump is made up of fully bootable disk images of Epik servers, which also includes a wide range of passwords and API tokens.",
    "In the wake of the first leak, Epik CEO Rob Monster hosted a video conference call to field questions from customers.",
    "The call however quickly went off the rails after Monster was confronted by activist, journalists, and other who’ve been at the receiving end of Epik’s policy of providing safe heaven to many prominent right-wing and controversial platforms, such as the Gab social media platform, Bitchute video sharing, and the pro-Trump Patriots.win messaging board.",
    "Campaigners who track online hate had hailed the earlier breach as the “mother of all data lodes” as it allegedly contained personally identifiable information (PII) of individuals who spewed venom online under the garb of anonymity. The data has already outed a Florida real estate agent as the owner of several hate-spewing and holocaust denial portals, resulting in his sacking.",
    "Even as researchers begin to digest the latest data dump, it appears it’ll further help unravel the anonymous ecosystem that’s been promoting hate and extremism.",
    "Via The Register"
  ],
  "headers": {
    "4": "More skeletons"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared earlier": "https://www.techradar.com/news/why-anonymous-leaked-decades-worth-of-data-from-the-web-host-epik",
    "tweeted": "https://twitter.com/stevanzetti/status/1443299000187297795",
    "video conference": "https://www.techradar.com/best/best-video-conferencing-software",
    "went off the rails": "https://www.techradar.com/news/epik-ceo-attempts-to-hit-back-on-breach-rumors",
    "already outed": "https://www.techradar.com/news/many-people-affected-by-epik-breach-really-dont-want-their-web-activity-published-online",
    "The Register": "https://www.theregister.com/2021/09/30/anonymous_second_epik_dump/"
  }
}