{
  "source": "https://www.techradar.com/news/new-star-wars-show-sounds-like-its-on-hold-according-to-report",
  "title": "New Star Wars show sounds like it's on hold, according to report",
  "category": "entertainment",
  "updated": "2021-05-24T09:38:27Z",
  "author": "samuel-roberts",
  "summary": "Rangers of the New Republic 'isn't currently in active development'",
  "article": [
    "Star Wars TV show Rangers of the New Republic is no longer in active development, according to a new report.",
    "Little was known about Disney Plus' The Mandalorian spin-off, which was announced back on Disney's Investor Day in December 2020, except that it was being worked on by Mando creator Jon Favreau, and that along with fellow spin-off show Ahsoka, it would tie in to a future \"climactic story event\" linking the different Star Wars series.",
    "This previously unknown information was mentioned as an aside in a Variety piece about Dave Filoni, who along with Favreau, is credited with the enormous creative and commercial success of The Mandalorian. The report simply says Rangers of the New Republic is \"not currently in active development\".",
    "Speculation was rife that the series would feature Cara Dune, a character played by Gina Carano in the series, who was working as a marshal for the New Republic as of the end of The Mandalorian season 2. However, a report from earlier this year cited a Lucasfilm source that said Carano was never part of Disney's presentation that revealed the show. That announcement occurred a couple of months before it was confirmed she wouldn't feature in future Star Wars series.",
    "It's worth noting that just because this report says it isn't in development, this doesn't necessarily mean the project no longer exists at all. Indeed, the show is still mentioned on Disney Plus' official website.",
    "There's no shortage of Star Wars shows coming to Disney Plus – more Mando, The Book of Boba Fett, Ahsoka, Andor, Obi-Wan Kenobi, Lando and The Acolyte mean it's going to be a busy few years for a galaxy far, far away. In this case, we knew so little about the show that it's hard to mourn its potential loss.",
    "Compared to Ahsoka, which is expected to see Rosario Dawson reprise her very well-received portrayal of the Jedi Ahsoka Tano from The Mandalorian, this one was more of a mystery.",
    "Ultimately, while we're a long way off of hitting Star Wars' saturation point on Disney Plus – especially considering some of these shows are probably still years away – one series doesn't make a huge difference."
  ],
  "headers": {
    "5": "Analysis: a small potential loss"
  },
  "links": {
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Variety": "https://variety.com/2021/tv/news/star-wars-the-mandalorian-dave-filoni-lucasfilm-creative-director-1234978130/",
    "Gina Carano": "https://www.techradar.com/news/gina-carano-will-no-longer-appear-in-star-wars-projects",
    "report": "https://www.hollywoodreporter.com/news/general-news/behind-disneys-firing-of-mandalorian-star-gina-carano-4133813/",
    "Disney Plus' official website": "https://disneyplusoriginals.disney.com/show/rangers-of-the-new-republic"
  }
}