{
  "source": "https://www.techradar.com/news/the-witcher-nightmare-of-the-wolf-looks-surprisingly-rad-in-its-official-trailer",
  "title": "The Witcher: Nightmare of the Wolf looks surprisingly rad in its official trailer",
  "category": "entertainment",
  "updated": "2021-08-09T14:19:44Z",
  "author": "tom-power",
  "summary": "Nightmare of the Wolf lands on Netflix soon",
  "article": [
    "The Witcher: Nightmare of the Wolf's official trailer has landed online, and we're pretty excited by what we've seen from the upcoming Netflix movie.",
    "Posted to the streamer's official social media accounts on August 9, the newest trailer provided us with plenty of new footage to pour over, including tense looking action sequences and some humorous quips to boot.",
    "Check out the official trailer below:",
    "The Witcher: Nightmare of the Wolf stars Theo James as Vesemir, Geralt's Witcher mentor as he explores the Continent years before he takes the series' main protagonist under his wing.",
    "Nightmare of the Wolf will depict Vesemir's origins story but, while we'll see the live-action version of the character in The Witcher season 2 later this year, the prequel movie will introduce him to audiences in animated form instead.",
    "On the surface, it may seem like a strange move for Netflix to make. After all, its adaptation of The Witcher – plus the streamer's forthcoming Blood Origin spin-off TV show – are live-action productions, so creating an anime-style prequel film might be viewed as a bit of an oddity.",
    "And yet, based on the two trailers we've seen so far (the teaser trailer arrived in late July), Nightmare of the Wolf actually looks pretty decent.",
    "For one, the animation looks gorgeous. It appears fluid, the colors really pop against the usually gray and drab backgrounds and the lighting appears to be spot on. Add in the natural flowing feel of the movie's set-pieces and Nightmare of the Wolf looks like a top-tier level production.",
    "That shouldn't come as much of a surprise, mind you. The studio behind its development – Studio Mir – also created Dota: Dragon's Blood for Netflix, and that project's animation looked just as lovely as Nightmare of the Wolf does.",
    "The Korean animation company has also led production on Warner Bros' animated properties including Young Justice, as well as The Boondocks for Adult Swim, so it has plenty of experience under its belt that'll have helped to make Nightmare of the Wolf as good as it appears.",
    "Add in the fact that Nightmare of the Wolf was penned by Beau DeMayo, who wrote the episode 'Betrayer Moon' for The Witcher season 1, and has been produced by The Witcher's showrunner Lauran Schmidt Hissrich, and the animated prequel film seems to be in safe hands.",
    "Those links with DeMayo and Hissrich, in particular, will help to bridge the gap between Nightmare of the Wolf and Netflix's live-action Witcher series, too, so we suspect that there'll some call backs to the prequel movie in The Witcher season 2.",
    "All in all, we're pretty pumped for Nightmare of the Wolf's arrival later this month. Netflix has enjoyed success with its other recent animated adaptations, including Castlevania, Masters of the Universe: Revelation (though some fans were unhappy with how it turned out), Blood of Zeus and the aforementioned Dota.",
    "If Nightmare of the Wolf is as good as those properties, it'll be another hit for the streaming giant – and begin to build our anticipation for The Witcher season 2, which launches in December.",
    "The Witcher: Nightmare of the Wolf lands on Netflix on Friday, August 23."
  ],
  "headers": {},
  "links": {
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Blood Origin spin-off": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect",
    "late July": "https://www.techradar.com/news/witcher-nightmare-of-the-wolf-trailer-teases-a-wild-ride-for-vesemir",
    "Masters of the Universe: Revelation": "https://www.techradar.com/news/masters-of-the-universe-revelation-part-1-is-the-subversive-revival-that-he-man-deserves",
    "how it turned out": "https://www.techradar.com/news/netflixs-he-man-reboot-has-been-panned-by-fans-and-its-creator-isnt-happy",
    "Blood of Zeus": "https://www.techradar.com/news/netflixs-blood-of-zeus-is-no-castlevania-but-it-should-tide-you-over-until-season-4"
  }
}