{
  "source": "https://www.techradar.com/news/pixars-new-movie-looks-like-inside-out-meets-clifford-the-big-red-dog",
  "title": "Pixar's new movie looks like Inside Out meets The Incredible Hulk",
  "category": "entertainment",
  "updated": "2021-07-13T14:18:21Z",
  "author": "tom-power",
  "summary": "Pixar's Turning Red lands in theaters next year",
  "article": [
    "Pixar is gearing up for a busy 2022. As it has done three times in the past, the Disney-owned animated studio will release two new movies next year – and a teaser trailer for the first of those projects has finally arrived online.",
    "The first footage for Turning Red, Pixar's 25th animated movie, was released on the studio's social media and YouTube channels on Tuesday, July 13.",
    "As you'd expect from its teaser, Turning Red, which is slated for release in March 2022, doesn't give much away about its overarching plot. However, we are treated to a glimpse at what the movie's plot is – and it could be Pixar's most surreal movie for a while.",
    "Check out the official teaser trailer below:",
    "Turning Red will tell the tale of Mei Lee, a teenager who is dealing with the perils of adolescence while trying to live up to her mom's lofty expectations.",
    "Mei Lee, though, isn't any ordinary 13-year-old girl. Whenever she feels a strong emotion (such as excitement or anxiety), she inexplicably turns into a giant red panda. It isn't surprising to hear, then, that Turning Red has drawn parallels with another coming-of-age Pixar movie – Inside Out – and Norman Bridwell's Clifford the Big Red Dog.",
    "Turning Red is being directed by Domee Shi, who helmed the Oscar-winning Pixar short Bao. Rosalie Chiang (Clique Wars) and Sandra Oh (Killing Eve, Raya and the Last Dragon) will voice Mei Lee and her mom respectively, while award-winning composer Ludwig Göransson (Tenet, Black Panther) will score the film.",
    "Following Toy Story's release in 1995, Pixar regularly released one film per year (with the odd exception) until 2015. As the company's workforce has grown, though, so too has Pixar's output – so much so that three of the past six years have seen the studio release two films every 12 months.",
    "In 2015, Pixar released Inside Out and The Good Dinosaur. That approach was revisited in 2017 with Cars 3 and Coco, before 2020 saw Onward and Soul launch in the same year.",
    "Despite film fans' adoration for Pixar films, however, this 'two movies a year' format produces varied returns when it comes to box office results.",
    "While Inside Out grossed an impressive $858.8 million at the global box office, The Good Dinosaur only amassed a haul of $332.2 million. A similar situation played out in 2017, with Cars 3 earning £383.9 million worldwide compared to Coco's $807.8 million.",
    "It's likely that one of Onward and Soul would have outperformed the other in 2020 as well, but the Covid-19 pandemic skewed the pair's box office figures so much that it's hard to tell which would have won out.",
    "What does all of this mean? Well, on paper it looks like Pixar has struggled to entice movie goers to watch two of its movies in the same calendar year. It's unclear if film fans feel that two movies is too many, or if one animated flick just looks (and sounds) better than its sibling.",
    "In the case of Cars 3 and The Good Dinosaur, we wouldn't consider either of those to be gold standard Pixar releases – the other Pixar movies released in their respective years were, however. Word of mouth could've been a factor, there.",
    "Turning Red's release next year is an interesting proposition, then. Pixar plans to release two movies in 2022, with the other being Toy Story prequel Lightyear.",
    "The latter is due to land during summer blockbuster season and, with Captain America star Chris Evans voicing the real-life Buzz Lightyear, it's likely that film aficionados will flock to see that one regardless.",
    "Still, that doesn't automatically mean 2022's other Pixar movie will be less successful by comparison. While Turning Red may be viewed as the 'lesser' of Pixar's two movie releases next year, it does have a few things going for it.",
    "For one, it has an award-winning director in Domee Shi. A quick YouTube search will show you that millions of people have checked out Pixar short Bao, which Shi directed, so there's a clear audience there for her cute-yet-emotional storytelling – something that Turning Red may benefit from.",
    "Turning Red's March 2022 release, too, may help its box office haul. More economies across the globe should have opened up by then as nations' populations are vaccinated against Covid-19. As such, movie goers may feel more confident going to see a film in a theater by that point, which can only be a good thing for Turning Red.",
    "Of course, time will tell if Turning Red can aid Pixar's yearly multi-film release, which may see it and Lightyear both perform well globally. Providing viewers react well to the above trailer, and any other Turning Red footage that's released before next March, Pixar may have more to celebrate than just its 25th movie release in 2022.",
    "Turning Red will launch exclusively in theaters on March 11, 2022."
  ],
  "headers": {
    "7": "Analysis: will Turning Red aid Pixar's two films per year approach?"
  },
  "links": {}
}