{
  "source": "https://www.techradar.com/news/rick-and-mortys-amortycan-grickfitti-is-a-sinfully-funny-season-5-episode",
  "title": "Rick and Morty’s Amortycan Grickfitti is a sinfully funny season 5 episode",
  "category": "entertainment",
  "updated": "2021-09-06T10:23:02Z",
  "author": "chris-aiken",
  "summary": "What we thought of Rick and Morty's latest instalment",
  "article": [
    "I’m going to admit, the first few minutes of this episode had me for a moment. Over the course of the last few seasons, Rick and Jerry have built up a relationship through a few reluctant adventures together, and it feels like there's more ground to be explored there. So when the episode started with the premise they were sharing some kind of guys' night together, I wholeheartedly believed we were about to see a genuine Rick and Jerry bonding moment.",
    "It only took a moment for the show to reveal that Rick was just using Jerry to pay off another one of his debts. Thankfully, for us viewers, Rick’s debt is owed to a Hellraiser version of hell – making for a very silly but funny episode.",
    "We quickly learn that Rick has been taking Jerry to hang out with a bunch of demons because the demons derive pleasure from pain. And what’s a more painful experience than watching Jerry just live his life being his most cringe self? Apparently, Rick sold the demons a bunch of piss poor meathooks (it wouldn’t be a Hellraiser parody with meathooks) and owed the demons a debt. A packed evening of Jerry making a fool of himself is a good way to pay it off, then.",
    "'Amortycan Grickfitti' doesn’t actually kick into high gear until Beth joins in on the fun. It’s here that I realized how well the Rick/Beth/Jerry dynamic truly works on this show. Jerry is a loser, Rick shits on Jerry, Beth defends Jerry but Beth is also no better than Rick because she ends up demeaning Jerry as well.",
    "The last few seasons have hit home just how similar Beth and Rick are. Once Beth is done chastizing Rick for using Jerry to solve his own personal problems, she very quickly joins in on making fun of Jerry for the demons’ amusement. Since Rick loves Beth, he reluctantly has to save Jerry when the adventure inevitably goes wrong and puts him in danger.",
    "The concept of the Hellraiser demons is such a simple and stupid idea. You have to credit the writers for how well it works. The logic behind deriving pleasure from pain is so nonsensical that trying to wrap your head around it just makes you laugh. Being in pain makes them feel good, but feeling good is what makes them upset, which in turn makes them happier.",
    "It’s dumb, funny, and a great plot device when Rick can’t simply use his multitude of weapons to get rid of the demons. Of course, as always, there is a Rick-powered solution to the problem, but it's one that again makes fun of the concept of how these demons work.",
    "Morty and Summer make up this week’s backup story, and it’s fun too. It’s here that we get a call-back to one of the best moments in the series, also known as “Keep Summer Safe.”",
    "I forget how well the pairing of Morty and Summer works, and it shows here as the two take Rick’s spaceship on a joyride to impress a seemingly cool new transfer student. The show takes the sentient nature of Rick’s spaceship to another level, as their adventure gets out of hand in its own chaotic way.",
    "It’s really the spaceship that shines as a character in this episode – its sassy and unpredictable nature puts Morty and Summer through the wringer. It’s funny enough here that I hope we get to see Rick’s spaceship pop up more as a character in future, especially since the ship plays such a key role in the series.",
    "It would actually be nice to see Rick interact with the ship as a character, too, since it is his prized possession and we haven't really seen them have much of a relationship to date. Morty and Summer's B story is mostly overshadowed by the Hellraiser parody, but it's a plot that works well in small doses and adds to the overall chaotic feel of the episode.",
    "This is another winner for the show's so-far strong fifth season.",
    "Rick and Morty airs every Sunday on Adult Swim in the US, and every Monday on E4 in the UK. Australian viewers can check it out on Netflix each Monday."
  ],
  "headers": {
    "3": "Pleasure and pain"
  },
  "links": {
    "Keep Summer Safe": "https://www.youtube.com/watch?v=4tpYFen3fJM"
  }
}