{
  "source": "https://www.techradar.com/news/digital-marketing-in-2021-what-to-look-out-for",
  "title": "Digital marketing in 2021: What to look out for",
  "category": "computing",
  "updated": "2021-01-20T19:01:23Z",
  "author": "olga-andrienko",
  "summary": "The trends that will have the greatest impact on digital marketing this year",
  "article": [
    "While everything feels unusual at the moment, one thing in life can be certain – the world of digital marketing will continue to be fast moving. Given the pandemic has increased people’s focus on online tools and virtual interactions, ensuring digital marketing strategies are in check has arguably never been so important for brands. Digital can move so quickly that just an algorithm update from Google can upend a brand’s careful planning. With that in mind, here are our predictions and recommendations for elements marketers should keep a close eye on in 2021, to ensure their best laid plans not only stay relevant but stand out with rewarding results.",
    "One of the big trends we will undoubtedly see in 2021 is an increased focus on privacy issues. As digital marketing evolves with a much more targeted approach, consumers are becoming more conscious and concerned about privacy. As a result, we are seeing top brands react very quickly. In March 2020, Safari blocked all third-party cookies. Apple is introducing intelligence tracking prevention across mobile apps, meanwhile, Google plans on also getting rid of third-party cookies by 2022. As many government bodies warm up to the idea of enacting legislation to protect personal data, there is no denying that the data privacy landscape will change immensely — and digital marketers will have to adapt. The impending loss of cookies is potentially a major issue, as so many businesses have become very used to using them as a primary source of insight on who their customers are, how they move, and how to find others like them. If your business is not yet seriously considering how to get hold of more first-hand data on your customers, preparations need to be made immediately.",
    "One recent study suggests contextual targeting might be one of the best ways to handle the transition. However, given the turbulent nature of the new landscape driven by privacy changes, the best next move for many will be sticking to the tried-and-true practices — PPC advertising and content marketing. A rush to these channels could make them less effective given so many others are adopting the same tactics, so again, careful planning is needed.",
    "The key driver behind PPC advertising — search engine queries — is that it is not predicted to be impacted by the privacy changes, and this allows brands to pursue their paid search efforts. This would be a good marketing channel to use that would see beneficial results during turbulent times. Another classic move is concentrating on creating good quality content. The importance of informative, educative and purposeful content positions a brand as leaders in the field and resonates with audiences, clients, consumers and customers.",
    "It’s impossible to ignore that, for many, funds are on a tight leash and business cuts are inevitable. According to our analysis, digital advertisers of all sizes have reduced their online ad budgets by 20% on average. Whilst acclimatising to the new normal, businesses have prioritised online visibility, presence, and exposure. It seems unlikely that this priority will wane until the pandemic is under better control, globally. Spend on digital advertising will regenerate and grow exponentially, and the main growth driver here will be small and medium companies.",
    "In more practical terms, mobile-friendly webpages will be a greater issue in 2021 - 70% of all website traffic comes from mobile phones, and the average adult spends around 5 hours a day on their device. Optimising sites to be mobile-friendly will be a key issue in 2021 - especially if companies aren’t thinking mobile-first, users will likely leave the site for others that are better optimised.",
    "The issue of optimising for Core Web Vitals ties in with mobile-friendliness too. Core Web Vitals are factors that Google thinks is necessary to enhance overall user experience on a website. If a website has poor Web Vitals - this leads to poor UX and affects how users will interact and convert on your site. Digital marketers need to ensure that they are thinking in terms of Google EAT - Expertise, Authority, Trustworthiness. With the rise of fake news and misinformation across the internet, it is getting increasingly hard to find trustworthy content, written by experts with authority in their respective fields. Google has already taken steps to boost content which is backed up with stats and details higher up the visibility ratings to address this issue.",
    "Finally, when thinking of the bigger search picture, we can fully expect that AI and voice search will start to have a greater influence on how rankings function. In fact, the percentage of households predicted to own a smart speaker by 2022 is 55%. To optimise for voice search, consider keywords carefully. Try to match how people ask these questions in normal conversation. Voice searches tend to do better with longer, more natural-sounding phrasing. When people type, they tend to abbreviate. For example, a person might voice search, “What are the new SEO trends for 2021?” but type the words, “new SEO trends 2021.” When it comes to AI’s influence, it’s a matter of keeping a close eye on your performance factors. Google’s AI algorithm will be a major factor – but in typical Google fashion, they haven’t shared much about the specifics of how it works. Unveiled a few years back, the algorithm — called RankBrain — plays an important role in Google’s ranking factors for search engine results pages (SERPs) results. Experts have suggested that user experience signals are the primary determinant on its application. In this case, going back to the fundamentals of what makes a good UX is the best advice. Captivate and engage readers with useful, well-organised content. An on-page SEO checker can help you assess page strength based on points like readability, backlinks, and more.",
    "One of the reasons digital marketing is so exciting, dynamic and effective is because it’s constantly expanding and evolving. Those experienced in keeping up with changing environments simply need to have their ear to the ground and eye on their stats to keep pace with new developments. Those who may be less used to evolving alongside with the internet, or less experienced in keeping a flexible approach to their plans, need to recognise that 2021 is likely to bring a number of significant changes, which could easily cause disruption. Everyone will need to prepare accordingly. Online visibility management not only helps businesses stay afloat but makes them stand out from their rivals in this competitive market."
  ],
  "headers": {},
  "links": {
    "digital marketing": "https://www.techradar.com/best/best-online-marketing-services",
    "content marketing": "https://www.techradar.com/best/best-content-marketing-tools"
  }
}