{
  "source": "https://www.techradar.com/news/heres-why-apple-never-brought-imessage-to-android",
  "title": "Here’s why Apple never brought iMessage to Android",
  "category": "phones",
  "updated": "2021-04-28T10:07:30Z",
  "author": "james-rogerson",
  "summary": "Keeping it in the family",
  "article": [
    "If there’s one good thing to come out of the court battle between Epic Games and Apple, it’s the inside look we’re getting at the two companies, including insights into why iMessage isn’t on Android – and probably never will be.",
    "A document from the trial had already revealed that Eddie Cue (Apple's senior vice president of internet software and services) had wanted iMessage to come to Android back in 2013, but had been shot down by other execs, who argued that iMessage’s exclusivity was “the #1 most difficult [reason] to leave the Apple universe.” But now we have more details on these discussions.",
    "Portions of a 2013 email exchange between Cue and Craig Federighi (Apple’s senior vice president of software engineering) were included in a new deposition, and reveal that it was Google’s attempted purchase of WhatsApp that made Cue really push to make iMessage multiplatform.",
    "In the exchange – reconstructed by The Verge based on the portions verified in the deposition – Cue argued: “Do we want to lose one of the most important apps in a mobile environment to Google? They have search, mail, free video, and growing quickly in browsers. We have the best messaging app and we should make it the industry standard.”",
    "But Federighi countered that “to get users to switch social networks we’d need more than a marginally better app.” He also made the argument that it would be difficult to make the switch from WhatsApp “compelling to masses of Android users who don’t have a bunch of iOS friends”.",
    "Based on The Verge’s reconstruction, Federighi concluded saying that “in the absence of a strategy to become the primary messaging service for [the] bulk of cell phone users, I am concerned [that] iMessage on Android would simply serve to remove an obstacle to iPhone families giving their kids Android phones.”",
    "It seems Cue may not agree with this though, as a questioner in the deposition asked him whether he thought that not having iMessage on Android created an obstacle to families giving their children Android phones, and he replied “no, not at all.”",
    "Also in the deposition it’s revealed – unsurprisingly – that were iMessage to have been offered on Android, the idea was to offer cross-platform compatibility with the iOS version, so Android and iOS users could message each other with it.",
    "It’s a nice dream, but one that at this point will probably never become a reality."
  ],
  "headers": {
    "3": "Countering Google"
  },
  "links": {
    "between Epic Games and Apple": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "had already revealed": "https://www.techradar.com/news/why-apple-doesnt-want-imessage-on-android-phones",
    "a new deposition": "https://www.documentcloud.org/documents/20691843-epic-games-depositions",
    "Google’s attempted purchase of WhatsApp": "https://www.techradar.com/news/phone-and-communications/mobile-phones/is-google-trying-to-buy-whatsapp-1143138",
    "The Verge": "https://www.theverge.com/2021/4/27/22406303/imessage-android-eddy-cue-emails-apple-epic-deposition"
  }
}