{
  "source": "https://www.techradar.com/news/the-xbox-series-x-controller-has-a-handy-hidden-feature-you-might-not-know-about",
  "title": "The Xbox Series X controller has a handy hidden feature you might not know about",
  "category": "gaming",
  "updated": "2021-02-09T17:21:25.505Z",
  "author": "adam-vjestica",
  "summary": "And it’s a game changer for PC/mobile users",
  "article": [
    "The Xbox Series X controller has been out for a while now, but a hidden feature has been shared by a Microsoft employee that’s bound to please gamers who use the Xbox pad on multiple devices.",
    "It turns out the Xbox Series X|S controller can memorize the last PC or mobile device you synced to, so you can switch back and forth between devices at will. The feature is honestly a game changer if you’ve been manually syncing your controller whenever you fancy cloud gaming on Android or want to play Xbox Game Pass on your PC (which we’d hazard a guess is the majority of people).",
    "Microsoft employee Timo Wolf shared how the feature works on Twitter, and it’s so simple and useful that we can’t help but wonder why Microsoft hasn’t made more of a fuss about it.",
    "To recall the last mobile device or PC you synced your Xbox Series X controller to, simply hold down the sync button (located on the top of the controller) until the Xbox Guide button flashes two or three times. To switch back to your Xbox Series X or Xbox Series S console, simply double-tap the sync button (the Xbox Guide button will flash once) and voila!",
    "Wolf showed a video of the functionality in action, and it’s as smooth as you’d have hoped. However, it’s important to note that this will only work if you have the controller synced via Bluetooth with your PC, and not the Xbox Wireless Adapter.",
    "With Microsoft making the Xbox ecosystem available on PC and Android via cloud gaming, being able to jump between multiple devices from one controller certainly widens the appeal of playing Xbox games on the move or on PC.",
    "It also means you won't need to have a dedicated Xbox Series X controller just to play on your PC or mobile, which could save you money in the short term."
  ],
  "headers": {
    "5": "Xbox everywhere"
  },
  "links": {
    "Xbox Series X controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "cloud gaming": "https://www.techradar.com/news/choosing-the-right-cloud-gaming-service-for-you",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/news/xbox-series-s-price-pre-order-specs-live-now"
  }
}