{
  "source": "https://www.techradar.com/news/whatsapp-is-getting-a-new-privacy-tool-but-you-need-to-be-careful-with-it",
  "title": "WhatsApp is getting a new privacy tool, but you need to be careful with it",
  "category": "phones",
  "updated": "2021-04-22T08:54:46Z",
  "author": "cat-ellis",
  "summary": "This message will self-destruct (sort of)...",
  "article": [
    "WhatsApp is preparing to introduce a new tool that will let you send self-destructing videos and photos to your contacts, but things won't be quite as straightforward as they first appeared.",
    "WhatsApp already includes a disappearing messages function, and future versions of the app are riffing on this idea with media that vanishes as well.",
    "We've known that WhatsApp might be working on this feature since September 2020, when researchers at WABetaInfo discovered hidden hints in a beta version of the app. Now, those same sleuths have found a new welcome screen that explains to users exactly how the tool will work – and its limitations.",
    "According to the message, which will be presented on-screen when the feature rolls out publicly, it will only be possible for recipients to open self-destructing images and videos once before they're deleted. However, they will be able to take screengrabs while the media is open.",
    "We've previously speculated that this might not be possible (many web browsers prevent taking screengrabs in private browsing mode, for example), and it meant you'll still need to exercise discretion when sending self-destructing images and videos; you never know who might be hanging onto a copy.",
    "The new screen isn't yet available for testing in WhatsApp Beta (it was discovered by scouring through the app's install files), but the fact that it's there at all suggests the feature may be nearly ready for release.",
    "We can't say when that might be exactly, but if you want to be first to try this and other new features, you can do so by joining the WhatsApp Beta program.",
    "Unfortunately the program for Apple devices is currently full, though it's worth keeping an eye on the Testflight page to see if a space opens up.",
    "To join the beta program for Android, visit the WhatsApp Beta page on Google Play and enter your details. If you already have the public version of WhatsApp installed, it will be updated to the beta version automatically within a few hours."
  ],
  "headers": {
    "5": "When to expect it"
  },
  "links": {
    "disappearing messages": "https://faq.whatsapp.com/general/chats/about-disappearing-messages/?lang=en",
    "researchers at WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-20-201-6-whats-new/",
    "those same sleuths": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-9-3-whats-new/",
    "keeping an eye on the Testflight page": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5082314078215385000&sharedId=trd-us&u=https%3A%2F%2Ftestflight.apple.com%2Fjoin%2Fs4rTJVPb",
    "visit the WhatsApp Beta page": "https://play.google.com/apps/testing/com.whatsapp/join"
  }
}