{
  "source": "https://www.techradar.com/news/wi-fi-6e-certification-programme-paves-way-for-6ghz-adoption",
  "title": "Faster Wi-Fi than ever is now a step closer",
  "category": "phones",
  "updated": "2021-01-08T14:29:27Z",
  "author": "steve-mccaskill",
  "summary": "Wi-Fi 6E promises greater speeds, faster capacity and lower latency",
  "article": [
    "The Wi-Fi Alliance has started the certification process for Wi-Fi 6E devices, paving the way for the rapid adoption of wireless Internet applications that make use of the speed, latency and capacity advantages of 6GHz spectrum.",
    "Wi-Fi 6 is a generational shift in wireless communications and is viewed as a complementary technology to 5G, boosting speeds, enhancing capacity and lowering latency.",
    "The wireless industry positions Wi-Fi 6 as the unlicensed standard of choice for digitisation, competing against licensed cellular networks, proprietary connectivity standards, and other technologies like Bluetooth.",
    "Wi-Fi 6E extends and builds on the capabilities of Wi-Fi 6 through the use of high-level spectrum. Tests have so far achieved 2Gps and consistent two-millisecond low latency. These characteristics make wireless suitable for mission critical business applications as well as use cases that require high data rates such as Virtual and Augmented Reality (VR and AR).",
    "The Wi-Fi Alliance certification programme will ensure they can all work together and ensures a certain level of security and reliability.",
    "“Worldwide interoperability for Wi-Fi 6E devices promotes rapid adoption and innovation in 6 GHz,” said Edgar Figueroa, president and CEO, Wi-Fi Alliance. “Users will soon experience unprecedented Wi-Fi that significantly improves applications and delivers new use cases that will change their connected experiences.”",
    "The development of a Wi-Fi 6E ecosystem received a boost last year when the US Federal Communications Commission (FCC) made 1200MHz of spectrum, currently used by microwave links, available in the US. This additional capacity is nearly six times the total capacity of the 2.4GHz and 5GHz bands currently allocated for Wi-Fi.",
    "The UK, EU and South Korea are among the countries to have followed the US’s lead in allocating 6GHz frequencies for Wi-Fi and analysts expect that 338 million Wi-Fi 6E devices will enter the market ths year. By 2022, it is anticipated that a fifth of all Wi-Fi 6 devices will be compatible, including PCs, laptops, smart TVs and VR systems."
  ],
  "headers": {
    "3": "Wi-Fi 6E certification"
  },
  "links": {
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-routers-the-best-wi-fi-6-routers-you-can-buy-in-2019"
  }
}