{
  "source": "https://www.techradar.com/news/microsoft-edge-update-gets-rid-of-its-most-annoying-quirk",
  "title": "Microsoft Edge update gets rid of its most annoying quirk",
  "category": "computing",
  "updated": "2021-06-03T12:52:34Z",
  "author": "joel-khalili",
  "summary": "Microsoft Edge will no longer bombard you with settings alerts",
  "article": [
    "Microsoft has released a fix for its web browser Edge that does away with a couple of frustrating issues introduced with the last major update.",
    "After the launch of Microsoft Edge 91 last week, users began to find the browser was not opening on their chosen page at launch. Edge also appeared to have adopted the nasty habit of bombarding users with notifications.",
    "Specifically, the browser was repeatedly serving up alerts asking users to switch to recommended browser settings, which also involves embracing Microsoft Bing as the default search engine.",
    "With users making their frustrations known, Microsoft has rolled out an update that addresses both problems. The fix should take effect for all users once the browser has been restarted.",
    "When a new instance of Microsoft Edge is launched, the browser draws down a configuration file specific to the user’s device. This file dictates which features and settings are enabled, as well as the webpage that opens on startup.",
    "Although Microsoft hasn’t explained the precise changes made to remedy the issues, the problems presumably arose due to a glitch in this startup process.",
    "Strangely, this isn’t the first time this week that Microsoft customers have had a problem with pop-up alerts. Some Windows 10 users are complaining of two new recommendation alerts pushing Microsoft Bing, served via the in-built notification center.",
    "The new Bing pop-ups reportedly promote a handful of different attributes and features. The first focuses on the newsfeed and security features, while the second claims users can save money by using Bing, courtesy of an integration with the Microsoft Rewards program.",
    "The alerts give users the option to either temporarily dismiss the pop-up or make the switch to Bing, but do not provide a simple way of disabling future pop-ups of this kind.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Microsoft Edge update"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "two new recommendation alerts": "https://www.techradar.com/news/windows-10-update-brings-back-everyones-least-favorite-pop-up-alert",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-microsoft-edge-91-nag-screens-and-startup-page-bug/"
  }
}