{
  "source": "https://www.techradar.com/news/this-dollar699-dell-g5-15-with-a-gtx-1660-ti-is-a-fantastic-gaming-laptop-deal",
  "title": "This $699 Dell G5 15 with a GTX 1660 Ti is a fantastic gaming laptop deal",
  "category": "computing",
  "updated": "2021-01-23T16:20:57Z",
  "author": "alex-whitelock",
  "summary": "A great price for such a powerful graphics card",
  "article": [
    "We've just spotted a superb gaming laptop deal in the form of a Dell G5 15 retailing for just $699.99 over at the official Dell store this weekend - a great buy for those wanting a hefty machine, but strictly on a budget. What makes this gaming laptop deal stand out from other cheaper options is, arguably, the inclusion of both a GTX 1660Ti graphics card and a 120Hz refresh rate display. Put those together and you've got one slick, premium gaming experience that's easy on the eyes for not a whole lot of cash.",
    "You can easily compare it to other gaming laptop deals in this price range, and you'll generally see a budget of $600 to $700 tends to only secure you a GTX 1650 as your graphics card - a much, much slower card than the one featured in this Dell.",
    "Sure the GTX 1660 Ti is starting to look a little older now with the new RTX 3060 series now making its way to gaming laptops (that's definitely why we're seeing prices drop), but it's going to be months, maybe even years before we see big discounts on those machines. Subsequently, this one's a winner for gaming on a budget, especially since the 1660Ti and Core i5 are more than adequate for 1080p gaming right now.",
    "Not in the US? see the best gaming laptop deals in your region just below.",
    "For plenty more options, we'd recommend heading on over to our best cheap gaming laptop deals article, where you'll find some great alternatives no matter your budget. We've also just launched a brand new Razer Blade deals article, for those of you looking for something a little more premium this weekend. Of course, you'll need something to play, so check out our roundup of the latest game deals available right now."
  ],
  "headers": {
    "4": "Gaming laptop deals at Dell this weekend"
  },
  "links": {
    "just $699.99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1177452268117868000/https://deals.dell.com/en-us/mpp/productdetail/7997",
    "in this price range": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-2867763354834644000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fsearchpage.jsp%3F_dyncharset%3DUTF-8%26id%3Dpcat17071%26iht%3Dy%26keys%3Dkeys%26ks%3D960%26list%3Dn%26qp%3Dcurrentprice_facet%253DPrice~%2524500%2520-%2520%2524749.99%26sc%3DGlobal%26st%3Dgaming%2520laptop%26type%3Dpage%26usc%3DAll%2520Categories&article_name=This%20%24699%20Dell%20G5%2015%20with%20a%20GTX%201660%20Ti%20is%20a%20fantastic%20gaming%20laptop%20deal&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-dollar699-dell-g5-15-with-a-gtx-1660-ti-is-a-fantastic-gaming-laptop-deal",
    "best cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "Razer Blade deals": "https://www.techradar.com/deals/razer-blade-laptop-deals-sales-price",
    "game deals": "https://www.techradar.com/news/cheap-game-deals-sales-xbox-one-ps4-pc"
  }
}