{
  "source": "https://www.techradar.com/news/nvidia-geforce-now-is-about-to-get-much-more-expensive",
  "title": "Nvidia GeForce Now is about to get much more expensive",
  "category": "computing",
  "updated": "2021-03-18T17:44:36Z",
  "author": "carly-page",
  "summary": "New members will have to pay twice as much",
  "article": [
    "Nvidia has announced that it’s doubling the price of a GeForce Now subscription for new members from $4.99 to $9.99.",
    "The price hike comes as Nvidia confirms that its Founders tier, which has always been advertised as a limited-time offer, is being retired and will no longer be offered to new customers.",
    "Instead, the company is introducing a new \"Priority\" membership, which is essentially identical to the old Founders plans, offering gamers the same features such as extended session lengths and RTX ON for ray-traced graphics and DLSS in supported games.",
    "There’s one pretty big difference, though, and that’s the price. While the Founders tier was priced at $4.99, the new Priority membership will cost twice as much at $9.99 per month. Nvidia will also be introducing a yearly plan priced at $99.99.",
    "However, while bad news for new subscribers, Nvidia has said that it customers who are already subscribed to the Founders tier – a group that “rapidly approaches 10 million members\" – will be able to take advantage of a “Founders for Life” benefit. This will let them keep their existing $4.99/month price indefinitely, as long as their account remains active.",
    "“GeForce Now wouldn’t be what it is today without our Founders members. That’s why we’re adding the Founders for Life benefit, which continues the special $4.99 introductory rate as long the account is in good standing,\" Nvidia said in a blog post announcing the change.",
    "“Whether it’s a short time, a long time or a lifetime, we want our Founders members, who’ve supported GeForce Now from the start, to stay a part of the family.",
    "In addition to the price increase, Nvidia also previewed some of the new features it plans to add to its cloud-based streaming service in the near future. These include a larger library of games, account linking for games with cross-platform support, and support for Adaptive Vsync, which “synchronizes frame rates at 60 or 59.94 Hz server-side to match the display client-side, reducing stutter and latency on supported games.”",
    "Nvidia says it’s also adding data center capacity in Phoenix, Arizona, as well as bringing online its first Canadian data center later this year, both of which will help reduce wait times.",
    "Via: The Verge"
  ],
  "headers": {},
  "links": {
    "GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-brings-faster-frame-rates-to-more-games-thanks-to-unreal-engine-plug-in",
    "Nvidia said in a blog post announcing the change": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-1440532640770577700&murl=https%3A%2F%2Fblogs.nvidia.com%2Fblog%2F2021%2F03%2F18%2Fgeforce-now-priority%2F",
    "The Verge": "https://www.theverge.com/2021/3/18/22336600/nvidia-geforce-now-price-tier-cloud-gaming-subscription"
  }
}