{
  "source": "https://www.techradar.com/news/xbox-cloud-gaming-gets-a-monumental-upgrade-and-is-now-available-on-ios-and-pc",
  "title": "Xbox Cloud Gaming gets a monumental upgrade, and is now available on iOS and PC",
  "category": "gaming",
  "updated": "2021-06-29T08:56:51Z",
  "author": "adam-vjestica",
  "summary": "The power of Xbox Cloud Gaming has been unleashed",
  "article": [
    "Xbox Cloud Gaming has received a substantial upgrade, and is now available on iOS devices and Windows 10 PCs, Microsoft has announced. Cloud gaming has been available solely on Android devices for some time, so it’s great to see iOS and PC users can now get in on the action.",
    "Xbox Game Pass Ultimate members can go to xbox.com/play on either Microsoft Edge, Chrome, or Safari on your mobile device or PC, and sign in to start playing hundreds of games.",
    "You can play games using a compatible Xbox Wireless Controller, or use one of the many supported mobile gaming accessories such as the Razer Kishi or even a DualShock 4 controller. If you don’t have a controller to hand, and are playing on a mobile or tablet, more than 50 games include custom touch controls, so you can ditch the pad and get playing right away. Apparently one-in-six players who play from the cloud only use touch controls, according to Microsoft.",
    "Microsoft also revealed that Xbox Cloud Gaming is now powered by custom Xbox Series X hardware, which means players will experience faster load times, improved framerates, and be able to stream at 1080p up to 60fps. We tried it ourselves and can confirm that the overall experience is vastly improved, with games loading quicker, image quality greatly improved and higher framerates across the board.",
    "In a blog post on Xbox Wire, Microsoft said: “Going forward we’ll continue to innovate and add more features to enhance your cloud gaming experience.” We’ll have to wait to find out what those new features are, but it’s clear that Microsoft is serious about it’s cloud gaming platform, as it's a means to reach more players than ever before. The service is technically still in beta, too.",
    "The upgrade to Xbox Cloud Gaming means it's now on par with the likes of Google Stadia, Amazon Luna and Nvidia GeForce Now, which all offer 1080p streaming at 60fps. However, unlike Stadia and Luna, you don’t have to pay for your games again when using Microsoft’s service, as you have access to hundreds of titles in Xbox Game Pass. Your save data also carries over seamlessly between console and when playing in the cloud.",
    "It’s important to note that Xbox Cloud Gaming is only available to those who subscribe to Microsoft’s highest Xbox Game Pass tier, Xbox Game Pass Ultimate. Xbox Game Pass Ultimate costs $15 / £10.99 / AU$15.95 per month, but gives subscribers access to the entire Xbox Game Pass library on console and PC, EA Play, Xbox Live, Xbox Cloud Gaming and various perks and discounts."
  ],
  "headers": {
    "5": "Cloud competition"
  },
  "links": {
    "iOS": "https://www.techradar.com/news/ios-146-update",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "xbox.com/play": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6819365656345661000&murl=https%3A%2F%2Fwww.xbox.com%2Fen-US%2Fplay",
    "Xbox Wireless Controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Razer Kishi": "https://www.techradar.com/reviews/razer-kishi",
    "DualShock 4 controller": "https://www.techradar.com/reviews/gaming/games-consoles/controllers/dualshock-4-controller-1157615/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Wire": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1206003062165126100&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F06%2F28%2Fxbox-cloud-gaming-now-running-on-xbox-series-x%2F",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Amazon Luna": "https://www.techradar.com/news/amazon-luna-first-look-is-amazons-game-streaming-service-worth-trying",
    "Nvidia GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}