{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-lite-release-date-looks-to-be-soon-with-two-versions-landing",
  "title": "Xiaomi Mi 11 Lite release date looks to be soon, with two versions landing",
  "category": "phones",
  "updated": "2021-02-22T09:36:47Z",
  "author": "james-rogerson",
  "summary": "Solving a specs mystery",
  "article": [
    "Since the Xiaomi Mi 11 launched we’ve seen a growing number of leaks about a Xiaomi Mi 11 Lite, and now it looks like the phone could be about to land – in both 4G and 5G versions.",
    "Both 4G and 5G versions of a phone believed to be the Xiaomi Mi 11 Lite have now been certified in Singapore. That’s a process they’d need to go through before launching there, and it’s usually something that happens shortly before launch, meaning the Mi 11 Lite might be announced soon.",
    "The certification – spotted by PriceBaba – doesn’t reveal much else, but the mention of both 4G and 5G models might have solved one of the mysteries surrounding the Xiaomi Mi 11 Lite.",
    "You see, so far two different sources have been behind most of the Xiaomi Mi 11 Lite leaks, and the details they’ve shared don’t line up, with the most notable difference being that one source claimed the phone would have a Snapdragon 755G chipset, and the other said it would have a Snapdragon 732G chipset.",
    "The 755G is expected to be capable of 5G (though it hasn’t been announced yet), while the 732G is only capable of 4G, so there’s a good chance that the 5G model of the Xiaomi Mi 11 Lite will get the former, while the 4G model gets the latter. In other words, both sources might be right.",
    "Other leaked specs include an OLED screen, a 64MP main camera and a 5x telephoto zoom camera for the 5G version, while the 4G model of the Xiaomi Mi 11 Lite might have a triple-lens camera with 64MP, 8MP and 5MP sensors, a Full HD+ LCD screen with a 120Hz refresh rate, 6GB of RAM, and 128GB of storage.",
    "We’d take all of this with a pinch of salt for now, but at least the revelation that there’s two models on the way makes these various specs more convincing. Given that both versions have now been certified in some regions too (with the 4G model previously being certified in India), we’ll hopefully get an official look at the Xiaomi Mi 11 Lite soon.",
    "Via NotebookCheck"
  ],
  "headers": {
    "3": "Two different sets of specs"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 11 Lite": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "PriceBaba": "https://pricebaba.com/blog/xiaomi-mi-11-lite-5g-imda-certification",
    "would have a Snapdragon 755G chipset": "https://www.techradar.com/news/xiaomi-mi-11-could-have-a-lite-model-and-the-budget-phone-has-finally-leaked",
    "would have a Snapdragon 732G chipset": "https://www.techradar.com/news/xiaomi-mi-11-lite-might-launch-in-march-without-a-key-mi-11-feature",
    "NotebookCheck": "https://www.notebookcheck.net/Xiaomi-s-Mi-11-Lite-5G-may-debut-soon-as-it-is-cleared-for-launch-in-Singapore.523189.0.html"
  }
}