{
  "source": "https://www.techradar.com/news/apple-and-googles-infamous-app-tax-could-be-under-threat",
  "title": "Apple and Google’s infamous ‘app tax’ could be under threat",
  "category": "phones",
  "updated": "2021-03-04T11:04:09Z",
  "author": "joel-khalili",
  "summary": "Legislation passed in Arizona sets an unwelcome precedent for Apple and Google",
  "article": [
    "New legislation has been passed in the US state of Arizona that could have significant implications for the way Apple and Google are able to generate income from their respective app stores.",
    "The amendment to the state’s HB2005 , which passed by a margin of two votes (31-29), prevents the two firms from demanding Arizona-based developers use a single payment system exclusively, which in turn poses a threat to their ability to take commissions on app sales and in-app micropayments.",
    "The new rules apply specifically to any app store that has surpassed the million downloads threshold and also prevents the companies affected from penalizing developers that opt for an alternative payment system in the aftermath of the change.",
    "The legislation also prevents Arizona residents from being forced to pay via a prescribed system, which could allow developers based outside the state to benefit from the new rules as well, although this remains unclear.",
    "The sizeable commission collected by Apple and Google on app sales and in-app purchases has become a bone of contention in recent years, with many developers claiming the 30% cut amounts to an abuse of market dominance.",
    "Most notably, Apple is currently embroiled in a legal battle with Epic Games, the maker of popular battle royale title Fortnite. The company attempted to bypass the 30% commission last summer by launching its own in-app payment mechanism, which saw Fornite promptly removed from the App Store.",
    "Although the new legislation applies to only a small pool of developers in the context of the wider iOS and Android ecosystems, it sets a precedent that could give impetus to similar measures in other states and territories.",
    "“Today, Arizona put a marker down and became the first state in the nation to advance a digital market that is free and fair,” said the Coalition for App Fairness (CAF), of which Epic, Match Group (parent company of Tinder) and Spotify are constituent members.",
    "“We look forward to working with the Arizona State Senate to move a solution forward that builds momentum to provide consumer freedom, lower costs and increase developers’ ability to thrive and innovate.”",
    "Neither Apple nor Google have published a response to the verdict, but both firms campaigned determinedly against the changes.",
    "“The commission has been described by some special interests as a ‘payment processing fee’, as if Apple is just swiping a credit card. That’s terribly misleading,” said Kyle Andeer, Chief Compliance Officer, in testimony.",
    "“Apple provides developers an enormous amount of value - both the store to distribute their apps around the world and the studio to create them. This is what the commission reflects, yet this bill tells Apple that it cannot use its own check-out lane in the store we built.”",
    "According to Andeer, the amendment is effectively a “government mandate that Apple give away the App Store.”",
    "Via The Verge"
  ],
  "headers": {
    "4": "App store payments"
  },
  "links": {
    "amendment to the state’s HB2005": "https://www.azleg.gov/legtext/55leg/1R/proposed/H.2005COBB.pdf",
    "payment system": "https://www.techradar.com/best/best-payment-gateways",
    "The Verge": "https://www.theverge.com/2021/3/3/22309284/arizona-app-store-bill-2005-apple-30-percent-cut-bypass-legislation"
  }
}