{
  "source": "https://www.techradar.com/news/apple-airtag-wont-fit-in-your-wallet-make-your-own-that-will",
  "title": "Apple AirTag won’t fit in your wallet? Make your own that will",
  "category": "phones",
  "updated": "2021-05-07T09:49:19Z",
  "author": "hamish-hector",
  "summary": "DIY your own AirTag",
  "article": [
    "Apple’s AirTag trackers have proved to be a hit with iPhone users, though if you’ve tried to put one in your wallet you might be disappointed with how bulky it is. Modder Andrew Ngai decided to take matters into his own hands, and has created the first AirTag card.",
    "Over on his YouTube channel, Ngai explained how he managed to pull off this alteration. If you have some patience it doesn’t seem too difficult to do yourself either, just remember that taking your AirTag apart could void whatever warranty you have.",
    "But if you want to take that risk for a design that better suits your wallet tracking needs, then Ngai’s video lays out everything you need to do. You’ll need access to a 3D printer and some electrical tools though, so make sure you watch all the way through to avoid getting stuck with a busted AirTag.",
    "We expect to see Apple make different AirTag designs eventually, and a slimmer card-like option could be one we'll see within the next couple of years (rival Tile already has a card-shaped design itself). We’d also like to see an AirTag case that uses adhesive to let you attach it to more products than the current version can.",
    "We wouldn’t be surprised to see AirTag tech wind up in Apple’s other products either, like the Apple AirPods. While there is already some integration with Find My and AirPods it’s got a limited range and doesn’t work if the earphones are in their case. AirTag integration might mean you'd finally be able to find your AirPods no matter where you lose them.",
    "These new versions will likely depend on the success of AirTags. While they seem to be all the rage right now, we’ll have to see if they have staying power that warrants Apple developing new designs."
  ],
  "headers": {
    "3": "Could Apple create different versions of the AirTag?"
  },
  "links": {
    "AirTag trackers": "https://www.techradar.com/reviews/apple-airtag-review",
    "YouTube channel": "https://youtu.be/7rHyAAkf5tE"
  }
}