{
  "source": "https://www.techradar.com/news/bitcoin-price-leaps-past-dollar50000-for-the-first-time",
  "title": "Bitcoin price leaps past $50,000 for the first time",
  "category": "computing",
  "updated": "2021-02-16T14:42:44Z",
  "author": "joel-khalili",
  "summary": "Bitcoin price continues to balloon",
  "article": [
    "The world’s largest and most famous cryptocurrency, Bitcoin, has vaulted beyond a valuation of $50,000, just two months after breaking $20,000 for the first time.",
    "The digital currency, which is renowned for its extreme volatility, held the landmark price point only briefly, before retreating to circa $49,000.",
    "The arrival at the current valuation is the product of a bull run (or period of growth) that began in late November, at which point the cryptocurrency was valued at just $16,500.",
    "Ever since Bitcoin entered the public consciousness, a debate has raged about whether its steep rises in price constitute market bubbles (when the value of an asset becomes wildly over-inflated) or are actually representative of the role crypto could play in the financial ecosystem of the future.",
    "Long-time holders of Bitcoin (also known as HODLers) have had to weather a series of rises and falls. Most famously, after reaching highs of $19,783.21 in December 2017, Bitcoin plummeted to below $8,000 within just two months.",
    "Investors that came in at the peak saw 60% of the value of their investment wiped out, which some saw as the popping of the Bitcoin bubble.",
    "The most ardent Bitcoin supporters, however, have long maintained that the currency would reach new heights well beyond the 2017 peak.",
    "And now, confidence in the cryptocurrency is starting to be echoed by institutional investors too. In recent months, insurance giant MassMutual has purchased $100 million-worth, while tech firm MicroStrategy converted most of its balance sheet (circa $500 million at the time of initial purchase) to Bitcoin.",
    "Earlier this month, it emerged that electric car company Tesla, headed up by long-time cryptocurrency proponent Elon Musk, has also invested $1.5 billion in the currency. The announcement saw Bitcoin rise beyond the $40,000 mark for the first time.",
    "However, while Bitcoin may yet reach far loftier valuations, investors looking to catch this latest wave should exercise a measure of caution. As in 2017, a significant market correction may soon take place, which could spell disaster for any investors unable to absorb the losses."
  ],
  "headers": {
    "3": "Bitcoin price"
  },
  "links": {
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin"
  }
}