{
  "source": "https://www.techradar.com/news/hit-the-roads-with-confidence-with-a-rexing-dash-cam",
  "title": "Hit the roads with confidence with a Rexing dash cam",
  "category": "car-tech",
  "updated": "2021-08-05T20:01:12Z",
  "author": "sponsored",
  "summary": "Make sure you're covered in the event of an accident with a quality dash cam that won't miss a trick.",
  "article": [
    "Ever felt that a lot of people on the road at the moment seem to have forgotten how to drive while everything was locked down? You might be the most careful driver on the planet but all it takes is to meet someone coming the other way, who isn't quite as careful as you, to really mess up your day. Alternatively, you could find yourself the victim of an insurance fraudster getting into a deliberate accident for a massive payday.",
    "And just because a road accident wasn't your fault, it doesn't necessarily follow that your insurer will pay up; insurance companies just love an excuse to hold onto their money, and if there's any doubt as to who's to blame for an accident you could find yourself looking at a stack of bills and no payout to cover them.",
    "That's the point at which you might find yourself wishing that you'd got a dash cam. Having quality video footage of an accident can remove all doubt about what actually occurred, and could save you thousands of dollars should the worst happen. And that's where Rexing's range of dashcams can ride to the rescue.",
    "If you're looking for your first dash cam and want something straightforward that'll do a great job without costing the earth, you can't go wrong with the Rexing V1-4K. It's everything you need in a dash cam, packed into a compact, low-profile design, and with over 13,000 Amazon reviews and a rating of 4.4 out of 5, it's one you can buy with confidence.",
    "The big selling point of the V1-4K, as its name suggests, is its 4K resolution. If you want usable dash cam footage it helps to have as much detail as possible, and in some cases, an HD cam might not be up to the job. But with its 4K resolution, the V1-4K can capture important details such as license plates that other dash cams might miss; it also makes it perfect for recording footage of your road trip to share on YouTube.",
    "There's more to it than ultra high resolution; it also has an ultra-wide-angle lens with a 170-degree field of view to reduce blind spots, as well as wide dynamic range technology that adjusts the aperture for the best performance in any lighting situation so that you'll always get clear and balanced images and footage, even at night.",
    "The V1-4K records on a continuous loop, saving its footage at one, two or three minute intervals, and once your memory card is full (it'll take up to a 256GB microSD card) it'll automatically overwrite the oldest recordings. It also features a G-sensor, and if it detects a collision the current recording will be locked so that it's safe from being overwritten and can be retrieved for later use. And when you want to view your recordings, you can connect your phone over Wi-Fi and see them on the Rexing Connect app.",
    "Instead of a traditional battery, the V1-4K has a supercapacitor that can withstand temperatures -20 to 176°F, giving you improved long-term reliability over battery dash cams. And for additional peace of mind, with the Rexing Smart Hardwire Kit, you can also use the V1-4K as a parking monitor that'll either record a 20-second video whenever it detects a vibration, or create a 24/7 timelapse video.",
    "The Rexing V1-4K is easy to install and use, and comes with everything you need to get started; all you need to supply is a microSD card and of course a car. It would normally cost you $99.99, but you can save right now with our exclusive TECH10OFF discount code which is valid until September 10th, 2021.",
    "Want a bit more from your dash cam? You might want to step up to the high-end Rexing V5 dash cam. It shares many of the great features that you'll find in the V1-4K, including ultra high res 4K recording, a 170-degree field of view, and a wide dynamic range for the best possible image quality in any situation, not to mention a G-sensor to detect collisions and protect important footage, a supercapacitor for enhanced reliability and the option to use it as a parking monitor.",
    "There's much more than that, though. With the V5 you get modular capabilities so that you can add more cameras for extra security on up to three channels; there's an in-cabin camera, a rear camera to mount inside your rear windshield, and even a waterproof rear camera for the best possible view of what's happening behind you. And when you're driving at night it won't miss a thing thanks to infrared night vision.",
    "The Rexing V5 also has built-in GPS that accurately records your location and speed alongside your video footage, and with the Rexing GPS Player, you can easily review your route on Google Maps.",
    "The Rexing Connect App makes it easy to control your dash cam and review, share and edit footage via Wi-Fi; the V5 also features advanced voice control so that you can take photos, stop and start recordings, mute and unmute the microphone, and much more without having to take your hands off the wheel.",
    "The Rexing V5 dash cam supports microSD cards up to 256GB and comes with everything you need to get it up and running. Its usual price is $199.99, but with our exclusive TECH10OFF discount code, valid until 31 August, you can grab a welcome saving.",
    "Founded in Connecticut with its headquarters in New York and its own manufacturer in China, Rexing is an innovative company with new product releases every quarter. Rexing prides itself on designing and developing products that meet its customers' needs with a particular eye on reliability and longevity. All of its products come with an 18-month warranty as standard, and it has a professional customer service team based in New York should you need help or repairs. You can find its full range of products, including smart home accessories, cameras, and binoculars, on its Amazon store, but if you prefer to shop in person you can also find its products at Best Buy stores across the country."
  ],
  "headers": {
    "3": "The Rexing V1-4K – a great-value all-rounder",
    "9": "The Rexing V5 – a modular dash cam with even more features"
  },
  "links": {
    "Rexing V1-4K": "https://amzn.to/3rYnCrf",
    "Rexing V5": "https://amzn.to/3ChoA6S",
    "on its Amazon store": "https://amzn.to/3wAnS1k"
  }
}