{
  "source": "https://www.techradar.com/news/uncharted-movie-trailer",
  "title": "Uncharted movie trailer has arrived – and it looks alright, actually",
  "category": "entertainment",
  "updated": "2021-11-05T15:45:59Z",
  "author": "tom-power",
  "summary": "The Nathan Drake Collection in movie form",
  "article": [
    "Update: As we predicted, the official trailer for the Uncharted movie has arrived online – and it doesn't look as bad as initially feared.",
    "Diehard fans of Naughty Dog's gaming series had been underwhelmed by the images and short clips that had been released prior to the movie's official trailer. Now that a two-minute trailer has given us our first proper look at its plot, action and humor, though, it looks pretty decent overall.",
    "Check out the official trailer, which was released on Sony Pictures' social media channels on Thursday, October 21, below:",
    "The Uncharted movie, which stars Tom Holland and Mark Wahlberg as Nathan Drake and Victor 'Sully' Sullivan respectively, lands in theaters on February 18, 2022.",
    "Original story follows.",
    "The release of the Uncharted movie's first official trailer seems to be upon us – you know, if a recently leaked teaser is anything to go by.",
    "Sony's upcoming film adaptation of its iconic gaming series is due to be released on February 18, 2022. But, apart from a few official images and a brief plot synopsis, fans have been kept in the dark about the forthcoming movie.",
    "That is, until now. Late on Wednesday, October 20, a leaked Uncharted movie teaser started circulating online. The choppy, grainy video, which is around 40 seconds long, has been shared across multiple social media sites. If you haven't seen it yet, though, and are curious about its style and tone, you can check it out via MauroNL's tweet below:",
    "The teaser doesn't give anything away about the film's story or potential surprises, but it does show that the Uncharted games have influenced it in some way.",
    "Much of the footage is centered around Tom Holland's Nathan Drake as he tries to re-enter a cargo plane that he's fallen out of. Diehard fans will notice that this is an identical set-piece to the one seen in Uncharted 3: Drake's Deception, so the film honors the source material in some capacity.",
    "Interesting as that is to learn, what's more intriguing is that the leaked teaser seems to confirm that the release of the film's official trailer is imminent. MauroNL suggests as much in their tweet but, while they may have insider information, Sony Pictures does have previous for this kind of thing.",
    "Confused? Let us explain.",
    "Back in August, a leaked copy of the Spider-Man: No Way Home trailer landed online. Why is this important? Because the leaked footage arrived just 24 hours before Sony Pictures, No Way Home's publishing studio, released the official version.",
    "Sony was the casualty of another leak before the release of Venom: Let There Be Carnage, too (spoilers follow). Two weeks before the movie launched in US theaters, its post-credits scene was leaked online, and spoiled a major revelation that hints at the character's future in another cinematic universe.",
    "Sony, then, has dealt with this sort of thing before. And, according to Eurogamer, Sony's lawyers have also been fighting a losing battle to pull the leaked Uncharted trailer since its release.",
    "Our guess? Sony is set to release the Uncharted movie's first trailer before the week is over. The smart money says that it'll arrive today (Thursday, October 21) and, given that the film's launch is less than four months away, it's about time that fans were shown some footage.",
    "We'll be keeping tabs on Sony's official social media channels throughout the day in case the official trailer does arrive. Once it lands online, we'll update this story, so make sure you check back later today for more."
  ],
  "headers": {},
  "links": {
    "Eurogamer": "https://www.eurogamer.net/articles/2021-10-20-watch-tom-holland-fall-out-of-a-cargo-plane-in-uncharted-movie-trailer-leak"
  }
}