{
  "source": "https://www.techradar.com/news/aws-is-helping-make-disney-even-bigger",
  "title": "AWS is helping make Disney+ even bigger",
  "category": "computing",
  "updated": "2021-04-29T13:00:26Z",
  "author": "mayank-sharma",
  "summary": "Disney+ uses over 50 AWS technologies to service over 100 million global viewers",
  "article": [
    "The Walt Disney Company has announced an expansion of its existing collaboration with Amazon Web Services (AWS) for the global rollout of the Disney+ video streaming service.",
    "Amazon said that its cloud computing subsidiary has been working with Disney since its inception.",
    "But before announcing the streaming service, Disney spent a year laying its foundation based on AWS’ public cloud infrastructure.",
    "In fact, AWS touts its use by Disney+ as a prime example of its infrastructure’s scalability potential, which didn’t buckle as the service surpassed 100 million subscribers in about sixteen months after launch across 59 countries in North America, Europe, Asia Pacific, and Latin America.",
    "“AWS has been our preferred cloud provider for years, and its proven global infrastructure and expansive suite of services has contributed meaningfully to the incredible success of Disney+,” said Joe Inzerillo, executive vice president & CTO, direct-to-consumer, The Walt Disney Company.",
    "Amazon shares that in addition to relying on its public cloud infrastructure, Disney+ also makes use of over fifty technologies from the AWS stack.",
    "These include machine learning, cloud databases, cloud storage, content delivery, serverless, and cloud analytics.",
    "For instance, the service collects content, metadata, and logs customer actions that number in the billions every day, with the help of the Amazon Kinesis, which helps collect, process, and analyze real-time, streaming data, and Amazon’s key-value DynamoDB database.",
    "Thanks to these tools, Disney+ enables viewers to add content to their watch lists, and start watching a video and pick it up on a different device, and even make recommendations about what to watch next.",
    "“We look forward to continuing to provide comprehensive cloud capabilities and expertise to The Walt Disney Company to help them reinvent streaming entertainment for Disney fans globally,” said Carla Stratfold, vice president of AWS global and strategic accounts at Amazon Web Services, Inc."
  ],
  "headers": {
    "5": "Continued collaboration"
  },
  "links": {
    "Amazon Web Services (AWS)": "https://www.techradar.com/news/aws",
    "Disney+": "https://www.techradar.com/reviews/disney-plus-review",
    "said": "https://www.businesswire.com/news/home/20210428005808/en/The-Walt-Disney-Company-Uses-AWS-to-Support-the-Global-Expansion-of-Disney",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "public cloud": "https://www.techradar.com/news/what-is-public-cloud",
    "cloud databases": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "cloud analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Amazon Kinesis": "https://www.techradar.com/news/what-is-amazon-kinesis",
    "DynamoDB database": "https://www.techradar.com/news/what-is-amazon-dynamodb"
  }
}