{
  "source": "https://www.techradar.com/news/moto-g30-and-moto-e7-power-leaked-in-full",
  "title": "Moto G30 and Moto E7 Power leaked in full",
  "category": "phones",
  "updated": "2021-02-11T09:56:53Z",
  "author": "james-rogerson",
  "summary": "Not much of an upgrade",
  "article": [
    "Not long ago we heard that Motorola might have a Moto G30 and Moto E7 Power on the way (as well as four other phones) and now we have a clear idea of what to expect from those two, as specs have been leaked and renders have been shared.",
    "This all comes from WinFuture, and we’ll start with the more interesting of the two – the Moto G30. This apparently has a 6.5-inch 720 x 1600 screen, with a teardrop notch for the single-lens front-facing 8MP camera.",
    "It’s also said to have a Snapdragon 662 chipset, 6GB of RAM, 128GB of storage, a microSD card slot, a 5,000mAh battery, and a quad-lens camera with a 64MP main sensor, an 8MP ultra-wide, a 2MP macro, and a 2MP depth sensor. Unsurprisingly, Android 11 is said to be included, and this is apparently a 4G phone, not 5G.",
    "These are specs that put it in line with the Moto G9 range, so if you were hoping for a generational upgrade, you might not really get one here. It’s worth noting however that a Moto G10 and Moto G100 have also previously been rumored, so one of them might be more of an upgrade.",
    "Next up there’s the Moto E7 Power, which apparently has a 6.5-inch 720 x 1600 screen, a MediaTek Helio G25 chipset, 4GB of RAM, 64GB of storage, a microSD card slot, a 5,000mAh battery, a 13MP f/2.0 main snapper, a 2MP macro camera, and a 5MP f/2.2 front-facing camera. It’s said to be stuck on Android 10, but will apparently cost just around 150 euros (roughly $180 / £130 / AU$235).",
    "Those specs are almost identical to the Moto E7, except the battery here is a bit bigger (up from 4,000mAh) and the main camera has fewer megapixels (down from 48MP).",
    "We would of course take all of this with a pinch of salt until these phones are official, but with so many details and renders now out in the wild, we expect they’ll be announced very soon.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "might have a Moto G30 and Moto E7 Power on the way": "https://www.techradar.com/news/moto-g10-g30-and-g100-could-land-soon-alongside-three-other-cheap-phones",
    "WinFuture": "https://winfuture.de/news,121142.html",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Moto G9 range": "https://www.techradar.com/news/moto-g9-series",
    "GSMArena": "https://www.gsmarena.com/motorola_moto_g30_moto_e7_power_full_specs_images-news-47686.php"
  }
}