{
  "source": "https://www.techradar.com/news/this-crypto-trading-hamster-is-outperforming-warren-buffet",
  "title": "This Crypto trading hamster is outperforming Warren Buffet",
  "category": "computing",
  "updated": "2021-09-27T16:28:15Z",
  "author": "jess-weatherbed",
  "summary": "Seriously, he's wheely good",
  "article": [
    "Mr. Goxx is just like many other young investors: he's been dabbling in cryptocurrencies, lives in a minimalist studio and keeps fit with daily cardio. What makes him slightly different from other traders you may have come across on social media, is that Mr. Goxx is a hamster, but don't be too quick to judge – he's up by almost 20% on lifetime career performance and is actually making money on his investments.",
    "In fact, Mr. Goxx is so successful that he isn't beholden to a traditional 9-5 schedule, instead selecting his own working hours. A dedicated 'office' is attached to his everyday cage which he has the freedom to move between, and when he clocks in, a series of automated actions will post a message to his Twitter, updating his followers that a trading session has started, and his Twitch channel will start to broadcast for as long as he's working.",
    "Given how complex this operation is for something with small, furry paws, it's unsurprising that he has help in the form of two anonymous humans who help him run his business.",
    "As reported by the BBC, Mr Goxx and his investment firm Goxx Capital (a reference to Mt. Gox, a Tokyo-based cryptocurrency exchange that operated between 2010 and 2014) was started as a joke between two men from Germany who saw people dumping money into cryptocurrency, despite having little understanding on crypto trading.",
    "\"It seems like most people from our generation see no other chance than throwing a lot of their savings on the crypto market, without having a clue what's going on there. We were joking about whether my hamster would be able to make smarter investment decisions than we humans do.\"",
    "Let's get a few things out of the way: please don't take trading or financial advice from Mr Goxx. He's a hamster and has no understanding of complex investments.",
    "Similarly, we're not advising that you trade according to his streams either as this is entirely down to luck, unless we've been severely under-estimating hamsters' abilities to become self-made entrepreneurs. Mr Goxx's owners are also careful to remind his followers that Goxx Capital isn't a real trading company with every tweet he posts.",
    "Mr Goxx also isn't forced to do any trading and has complete freedom to move between his 'trading office' and his regular living space. If he wants to have a lazy day in bed, he's not obligated to head into work. The entire process is automated, with a wheel selecting what currency will be traded, and then finalized when he runs through either his 'buy' or 'sell' tunnels.",
    "While this project may just be a joke, as of September Mr Goxx's career performance is up 19.41%, which according to Protos means he's outperforming Warren Buffett’s Berkshire Hathaway and the S&P 500, as well as many other successful investment firms. Despite this, the profits from his investments (which started at $390 / €326 /£278) haven't even covered the cost of his cage so he'd best hope his asset portfolio continues to grow."
  ],
  "headers": {
    "5": "Don't take financial advice from rodents"
  },
  "links": {
    "Twitter": "https://twitter.com/mrgoxx",
    "Twitch channel": "https://www.twitch.tv/mr_goxx/videos?filter=clips&range=7d",
    "BBC": "https://www.bbc.co.uk/news/technology-58707641",
    "Protos": "https://protos.com/crypto-trading-hamster-goxx-outperforms-bitcoin-buffett-wood/"
  }
}