{
  "source": "https://www.techradar.com/news/how-free-guys-delayed-release-helped-pack-it-with-so-many-iconic-gaming-easter-eggs",
  "title": "How Free Guy's delayed release helped pack it with so many gaming Easter eggs",
  "category": "entertainment",
  "updated": "2021-08-13T10:38:52Z",
  "author": "tom-power",
  "summary": "“This is a movie that, at its core, is about the gaming community”",
  "article": [
    "Free Guy is a movie steeped in video game history. The action-comedy film, which stars Ryan Reynolds as Guy, a non-playable character (NPC) who becomes self-aware and sets out to become the hero that Free City – the game world that Guy inhabits – needs, is packed with gaming references.",
    "It’ll come as no surprise that multiple viewings are necessary to find them all, but what is unexpected is the sheer amount of gaming Easter eggs on display.",
    "Game developers and studios can be hesitant to license out their products, particularly in an era where IP protection is becoming a more prominent topic of conversation. Free Guy’s chief creative team, though, found that most studios were extremely open to their properties’ inclusions – so what was the primary factor behind this change of heart?",
    "“I think it's the fact that there was a sense early on [among developers] that this isn’t strictly a video game movie,” director Shawn Levy exclusively tells TechRadar. “We’re creating a game inside the movie, so we wanted Free City to have shades of GTA, Fortnite, Halo and other titles.",
    "“When we discussed including certain Easter eggs, we found a lot of game publishers and companies wanted their iconic imagery to be a part of this movie that, at its core, is about community. It’s not just a movie about gaming; it’s about gamers and the communities that they create.”",
    "From Fortnite style ziplines to Pac-Man memorabilia, and Grand Theft Auto-esque character customization to players’ characters glitching out and running into walls, Free Guy – much like Disney’s Wreck-It Ralph films – is packed with nods to numerous game series and commonly occurring (and sometimes humorous) bugs. There are cameo appearances, from famous streamers including Ninja and JackSepticEye, too, which fans of such internet personalities will get a kick out of.",
    "The amount of gaming secrets is certainly a feast for the eyes, but the near-infinite number that are present weren’t always part of the plan. Initially, Levy reveals, there was a limit on the number of Easter eggs that Free City contained.",
    "That is, until the Covid-19 pandemic hit. With the movie’s release delayed, Levy and other key team members, including production designer Ethan Tobman, found themselves reviewing the movie’s original cut and eventually decided to pack Free Guy with as many gaming secrets as possible.",
    "“We were constantly trying to one up each other in the best possible way,” Tobman reveals. “Shawn created this big canvas and we just kept trying to make it more fun, detailed, and self referential. It was a process of layering and adding more on top of what was already there and, hopefully, people will watch it many times over to catch them all.”",
    "“When the pandemic caused production to shut down, I rewatched the movie,” Levy adds. “And I realized that we could create more layers of visual effects. I’d just sit there looking at the movie and tell Ethan that we need more background life, so we added more gaming references in. We have a scene where a Halo tank drives down the street but, originally, that wasn’t in the script or early cuts of the movie.”",
    "Commendable as it is to reference as many iconic games as possible, Free Guy’s stacked catalog of Easter eggs can, at times, be overwhelming. Movies like Ready Player One and Space Jam: A New Legacy have shown that overpopulating a film’s background with incalculable references can be distracting, and potentially draw viewers’ eyes from what they should be focusing on in certain scenes.",
    "Still, the decision to call on Free Guy’s sizable crew – its knowledgeable post-production departments in particular – for many of the movie’s Easter eggs means it feels less about ticking off boxes and more about reverence for the source material.",
    "“I went into this knowing that I’m not an expert on gaming history,” Levy admits. “So I surrounded myself with people who are younger and cooler than me, and they were a constant source of suggestions. The Halo tank was proposed by someone in the computer graphic department of the visual effects army, so ideas really did come from everywhere.”",
    "After years of underwhelming video game movie adaptations, including the Dwayne Johnson-starring Doom and 2015’s Hitman: Agent 47, recent entries in the gaming film genre have been received in a more positive light.",
    "Sonic the Hedgehog, Pokémon: Detective Pikachu and Mortal Kombat have been met with largely positive reviews by fans, as well as performing well at the global box office and on HBO Max respectively.",
    "With The Pokémon Company heavily involved in Detective Pikachu’s production, and Sonic’s revised movie look created by artist and superfan Tyson Hesse, Levy underlines that gaming expertise is clearly vital to their success.",
    "Staying true to a game series’ roots goes a long way to ensuring that diehard fans will be happy with the results. As an original production, Free Guy doesn’t have such an advantage but, through its myriad of gaming paraphernalia and callbacks to iconic franchises, Levy is hopeful that Free Guy will resonate with gamers as much as other recent game-centric movies.",
    "“I would hope that, when you see the whole movie, you'll see this is about the more affirmative aspects of that gaming community,” Levy says. “The globally connective experience of gaming is worth applauding and celebrating as well, and I hope audiences will embrace the new things that our movie brings [to the gaming community].”",
    "Free Guy is showing now in theaters."
  ],
  "headers": {},
  "links": {
    "GTA": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "Halo": "https://www.techradar.com/reviews/halo-infinite",
    "Space Jam: A New Legacy": "https://www.techradar.com/news/space-jam-a-new-legacy-isnt-the-sequel-that-the-original-deserved",
    "Mortal Kombat": "https://www.techradar.com/news/how-to-watch-mortal-kombat-online-see-where-to-stream-new-movie",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained"
  }
}