{
  "source": "https://www.techradar.com/news/the-god-of-war-ps5-sequel-has-finally-been-revealed-and-its-called-ragnarok",
  "title": "God of War on PS5 has finally been revealed – and it's called Ragnarok",
  "category": "gaming",
  "updated": "2021-09-09T22:15:16Z",
  "author": "vic-hood",
  "summary": "God of War: Ragnarok was revealed at the PlayStation Showcase",
  "article": [
    "Sony finally gave us our first look at the long-awaited God of War sequel during its PlayStation Showcase on September 9 - and we now know it's called Ragnarok.",
    "God of War Ragnarok closed the jam-packed showcase, with a three-minute trailer showcasing a glorious return for grizzled God Kratos and his son Atreus.",
    "It appears that tensions are high between Kratos and Atreus, as Ragnarok closes in. The duo is reunited with Mimir, the Norse God of Knowledge, as well as the two blacksmiths, Sindri and Brok.",
    "God of War Ragnarok's gameplay looks just as brutal, spectacular, and devastatingly violent as we'd expect, with various biomes to explore.",
    "The God of War sequel was teased by Sony last year with a brief announcement trailer that simply showed a Norse symbol, followed by the words 'Ragnarok is coming', and \"2021\". In addition, the teaser included a brief voice-over of Kratos saying: \"You must prepare yourself\".",
    "The teaser didn't tell us much, except that Ragnarök, a series of events and catastrophes that - according to Norse mythology - ultimately lead to the end of the world, would likely play a role in the sequel - which we now know to be true/false. The teaser trailer also led many to believe the God of War sequel would be called \"God of War: Ragnarok\", which we now know is also true.",
    "Following the teaser trailer, there had largely been radio silence from Sony Santa Monica Studio on the God of War sequel. However, earlier this year, the studio confirmed rumors that the sequel had been delayed from 2021 to 2022.",
    "The reveal at the PlayStation Showcase was the first time we've been able to see the highly-anticipated sequel in action and we now finally know what to expect when God of War Ragnarok lands on PS4 and PS5 in 2022."
  ],
  "headers": {
    "4": "A long time coming"
  },
  "links": {
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "PlayStation Showcase": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "God of War Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "delayed": "https://twitter.com/SonySantaMonica/status/1400135437763584002?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1400135437763584002%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.techradar.com%2Fuk%2Fnews%2Fgod-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}