{
  "source": "https://www.techradar.com/news/dont-expect-macs-at-apples-iphone-13-event-today-but-they-could-appear-october-12",
  "title": "Don’t expect Macs at Apple’s iPhone 13 event today – but they could appear October 12",
  "category": "computing",
  "updated": "2021-09-14T09:47:09Z",
  "author": "darren-allan",
  "summary": "Could the timing of Apple’s Mac launch be down to the Back to School promo?",
  "article": [
    "Apple is holding its big iPhone 13 launch today, which doubtless won’t have escaped your attention, and while we’re not expecting to see anything save the iPhone 13 itself and the Apple Watch 7 (probably) – plus the AirPods 3, most likely – we are not anticipating Tim Cook to round things off by unveiling something on the Mac front.",
    "Rumor (and past form) has it that Apple will run two major events in the near future, and after today’s launch, there’ll be a second event to follow which will be a Mac and iPad reveal (with the new M1X-powered MacBook 14-inch and 16-inch debuting, and maybe a Mac mini too). We recently heard prolific Apple leaker Mark Gurman insist that the new MacBook Pros will actually be on shelves in the ‘next several weeks’.",
    "Now, MacRumors has made some interesting observations on the previous timing of Apple’s Back to School promotion. Namely that in September last year, Apple extended that promo to run until October 12 in the US, which just so happened to be the day before Apple ran a press event (which was announced after that extension).",
    "So, the theory is that the same thing could hold true this year, with this fall’s second launch event coming on the day after the Back to School promo ends. However, in the US that’s September 27, and as we’ve previously commented ourselves, it seems very unlikely that Apple would hold two big events in the same month just a fortnight apart – that’s just too close for comfort.",
    "The key part here is that in Europe, the Back to School promotion ends on a different date – October 11 – so could that indicate a possible date of October 12 for the MacBook plus iPad launch?",
    "Okay so yes, this is a real stretch – if it was the US date we were talking about, then it’d seem a more likely prospect, but to go off the European schedule for the Back to School promo is clearly a leap. Besides that, even MacRumors itself admits that this is a thin connection to make and that it’s quite possible that the timing of the promo last year was mere coincidence.",
    "What makes us wonder if this might have a grain of truth in it, though, is that the October 12 date pretty much fits with existing speculation and what we were thinking anyway. The MacBook launch timeframe Gurman just floated in his latest rumor suggests a launch in early October, given that we can expect the actual laptops to be on sale within ‘several weeks’. October 12 still just about fits that, assuming that Apple is planning to launch with immediate availability (no gap between reveal and on-sale), and it’s a Tuesday. Plus that date would, of course, more or less match with the timing from last year (October 13).",
    "Here’s another thought: maybe Apple could even be about to put the end date of the Back to School promo in the US back again, as it did last year (in mid-September), to match the European finishing date?",
    "Who knows, and of course ultimately this is all guesswork, as ever, but there’s a chance that there is something in this particular piece of speculation. Whatever the case, it’s certainly starting to seem like October rather than November is the month to watch for the new MacBooks (remember that the latter month has been previously mentioned via the grapevine)."
  ],
  "headers": {
    "5": "Analysis: A stretch too far? Quite possibly"
  },
  "links": {
    "big iPhone 13 launch today": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "MacBook 14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "maybe a Mac mini": "https://www.techradar.com/news/apples-2021-lineup-gets-even-stronger-thanks-to-these-mac-mini-leaks",
    "insist that the new MacBook Pros": "https://www.techradar.com/news/apples-new-m1x-macbook-pros-could-be-on-shelves-in-just-a-few-weeks",
    "MacRumors": "https://www.macrumors.com/2021/09/13/when-is-apples-october-event/",
    "we’ve previously commented ourselves": "https://www.techradar.com/news/apples-new-m1x-macbook-pros-could-be-on-shelves-in-just-a-few-weeks",
    "what we were thinking anyway": "https://www.techradar.com/news/apples-new-m1x-macbook-pros-could-be-on-shelves-in-just-a-few-weeks",
    "his latest rumor": "https://www.techradar.com/news/apples-new-m1x-macbook-pros-could-be-on-shelves-in-just-a-few-weeks",
    "October rather than November": "https://www.techradar.com/news/new-macbook-pro-14-inch-and-16-inch-could-arrive-disappointingly-late-in-2021"
  }
}