{
  "source": "https://www.techradar.com/news/you-can-now-have-your-media-show-once-on-whatsapp-before-disappearing",
  "title": "You can now have your media show once on WhatsApp before disappearing",
  "category": "computing",
  "updated": "2021-08-04T14:21:15Z",
  "author": "daryl-baxter",
  "summary": "Disappearing at the drop of a feature",
  "article": [
    "Another week brings another new feature for WhatsApp, where you can now set a photo or video to be read once, for it to disappear straight after.",
    "The company has recently brought out an improved way of keeping archived chats in their own section, alongside the testing of multi-device support that’s currently in progress.",
    "However, WhatsApp has also been working on smaller features to make smaller moments count, which is where View Once comes in. If you wanted to take a quick photo of a dress or a WiFi password for instance, this feature will remove the photo from view once the recipient has seen it.",
    "There’s plenty of opportunity from WhatsApp to cater to more needs that’s become more prevalent in recent times due to the pandemic, and something as minor as viewing a photo once is a great example of this.",
    "Make sure that you’ve updated to the latest version on your Android phone or iPhone, named 2.21.150. Either check for updates at the App Store or Google Play Store, and WhatsApp should show as an available update to download.",
    "As a blog post from WhatsApp explains, when you choose a photo or video to send to someone or to a group, there will be a numbered icon beside the text box. Enabling this will allow the recipient to view the media only once.",
    "While Telegram and Signal have had this feature for a while, it’s going to be incredibly useful for those who use WhatsApp to talk to family and friends on the app, who just want to quickly share some information that may be too sensitive to keep.",
    "The company has also acknowledged how a user will be able to view certain types of media with this feature in another post, calming any potential anxieties about how the View Once feature is used.",
    "It’s great to see a new feature appear almost weekly from WhatsApp as of late. Compared to this time in 2019, you’d be hard pressed to discover an update that said nothing more than bug fixes.",
    "Sometimes it’s the little things that matter, and features such as archived chats staying archived, alongside having media only view once is going to be a big benefit to many. It gives users more confidence and control over how their media is shared, and the privacy guarantee from the company only helps solidify more confidence to new users as well.",
    "The big test for WhatsApp will be multi-device support. For too long now, users have been relegated to using WhatsApp Web, a lite-version of the service on devices that weren’t a smartphone. Thanks to this feature, being able to use your WhatsApp account without using your phone is going to make a lot of situations easier, especially if your phone is running out of battery more than usual.",
    "After its slight blunder in communicating its new privacy policy just a few months ago, it’s encouraging to see the messaging app focus on the features that matter to new and existing users, while working on features that are making it easier to keep in touch with friends and family on different devices."
  ],
  "headers": {
    "4": "How can ‘View Once’ be used?",
    "8": "Analysis: every little helps"
  },
  "links": {
    "WhatsApp": "https://www.techradar.com/how-to/use-whatsapp",
    "Android phone": "https://www.techradar.com/news/google-pixel-6-and-pixel-6-pro-officially-revealed-by-google",
    "iPhone": "https://www.techradar.com/reviews/iphone-13",
    "blog post from WhatsApp explains": "https://blog.whatsapp.com/view-once-photos-and-videos-on-whatsapp",
    "another post": "https://faq.whatsapp.com/general/chats/about-view-once"
  }
}