{
  "source": "https://www.techradar.com/news/nvidia-rtx-3060-full-specs-confirmed-ahead-of-the-gpus-imminent-launch",
  "title": "Nvidia RTX 3060 full specs confirmed ahead of the GPU’s imminent launch",
  "category": "computing",
  "updated": "2021-02-16T10:03:58.039Z",
  "author": "darren-allan",
  "summary": "The scramble for stock kicks off on February 25",
  "article": [
    "Nvidia has updated its website confirming the core specs of the incoming RTX 3060 graphics card which launches on February 25.",
    "As spotted by Tom’s Hardware, RTX 3060 models (produced by third-party graphics card makers – there will be no Founders Edition) will run with 3,584 CUDA cores and a base clock of 1.32GHz, with a boost clock of 1.78GHz.",
    "As previously confirmed, it’ll have 12GB of GDDR6 VRAM due to the 192-bit memory interface. That’s actually more video memory than the existing 3060 Ti that the vanilla 3060 will launch alongside, which is equipped with 8GB of GDDR6 (but has a 256-bit memory interface – so in other words, while there’s less RAM, it’s faster).",
    "For comparison, the 3060 Ti has a lot more CUDA cores – 4,864 to be precise – although at 1.67GHz it doesn’t boost quite as high as the 3060 (the base clock is faster at 1.41GHz, though).",
    "Nvidia didn’t confirm the number of RT (dedicated ray tracing) cores in the RTX 3060, but as we’ve previously guessed, that should be pitched at 28 RT cores and 112 Tensor cores (given that the GPU has 28 compute units). Tensor cores are what drives Nvidia’s DLSS tech, for the uninitiated.",
    "The power usage of the 3060 is 170W, and you’ll need a 550W power supply in your PC (compared to a 600W PSU for the 3060 Ti).",
    "Price-wise, as Nvidia has said before, in the US the GPU will run to $329, and in the UK it’s £299 (the Australian price still hasn’t been declared). However, as we’ve already seen, your chances of buying this card for the recommended price are shaky – European pre-orders have already seen the price tag jacked up before the RTX 3060 is even available. Hiking to the tune of 50% or even 75% is already underway, according to some reports, and with no Founders Edition card coming from Nvidia itself, it’s doubtful how many third-party models will actually be pitched at the recommended level.",
    "Of course, scalpers and crypto-miners will be vying to buy RTX 3060 cards when they release at the end of February, so we can expect the usual scramble for stock, and all that unpleasantness. Followed by the graphics cards turning up on eBay with far weightier price tags… but such is the contemporary world when it comes to current-gen GPUs.",
    "Meanwhile, Nvidia is bringing back some old graphics cards to try and combat the current stock shortages, resurrecting the GTX 1050 Ti, and the RTX 2060 too, in an effort to give gamers some more options at the affordable end of the market."
  ],
  "headers": {
    "6": "Price hikes"
  },
  "links": {
    "website": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-2588932483867541500&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-gb%2Fgeforce%2Fgraphics-cards%2F30-series%2Frtx-3060-3060ti%2F",
    "RTX 3060": "https://www.techradar.com/news/nvidia-rtx-3060-goes-on-sale-as-retailer-apparently-jumps-the-gun",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/nvidia-confirms-rtx-3060-specs",
    "but as we’ve previously guessed": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "Nvidia’s DLSS tech": "https://www.techradar.com/news/nvidias-dlss-could-soon-bring-faster-frame-rates-to-a-lot-more-games",
    "price tag jacked up before the RTX 3060 is even available": "https://www.techradar.com/news/nvidia-rtx-3060-prices-are-spiralling-upwards-and-the-gpu-isnt-even-out-yet",
    "GTX 1050 Ti": "https://www.techradar.com/reviews/asus-rog-strix-gtx-1050-ti",
    "RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060"
  }
}