{
  "source": "https://www.techradar.com/news/marvels-what-if-first-reactions-heres-what-the-critics-thought",
  "title": "Marvel's What If...? first reactions: here's what the critics thought",
  "category": "entertainment",
  "updated": "2021-08-16T08:34:27Z",
  "author": "tom-power",
  "summary": "Marvel's What If...? has been received well by critics",
  "article": [
    "Marvel's What If...? will be the studio's next TV series to drop on Disney Plus – and early reactions to the animated show have been largely positive.",
    "With the social media embargo lifting over the weekend, critics – including your friends at TechRadar – have given their spoiler-free thoughts on Marvel's latest series.",
    "Below, we've rounded up the most interesting reactions to Marvel's What If...? animated show to give you an idea of what to expect ahead of its release.",
    "Bear in mind that journalists have only seen the first three episodes, though, and that there are no spoilers in any of their tweets, so you're safe to read them.",
    "DiscussingFilm's editor-in-chief Jacob Fisher kicked things off by lauding What If...? as \"one of the best animated shows this year\" and reserved particular praise for the series' animation style and voice actor ensemble:",
    "Fandango journalist Erik Davis compared What If...? to iconic anthology series The Twilight Zone, calling it \"weird, wild, good fun\" with plenty of twists along the way:",
    "Deseret News' Herb Scribner hailed the show's \"nods and winks to the original tales\" and believes that What If...?'s strength lies into its genre storytelling:",
    "Reactions weren't universally positive, however. Rotten Tomatoes critic Tania Lamb said that, while What If...? offers a \"crazy, trippy ride\" for viewers, some of its twists and turns weren't always enjoyable:",
    "SlashFilm's Jacob Hall was more critical, stating that the voice cast's recordings \"felt phoned in\" and that the series \"leans too heavily on the 'isn't this crazy?' factor\":",
    "Finally, TechRadar's Tom Power (that's me) suggested that What If...? may be \"Marvel's most interesting project in a while\", citing its \"superhero sandbox of infinite possibilities\" as an element that could turn What If...? into a long-running Marvel property:",
    "Our full, spoiler-free thoughts will be available in a review for Marvel's What If...? closer to release.",
    "We also recently sat down with What If's chief creative team and star Jeffrey Wright to discuss the animated series in more detail, so check back in with TechRadar before August 11 to see when those articles go live.",
    "Marvel's What If...? will launch exclusively on Disney Plus on Wednesday, August 11."
  ],
  "headers": {},
  "links": {}
}