{
  "source": "https://www.techradar.com/news/ps5-share-factory-studio-update-adds-hdr-support",
  "title": "PS5 Share Factory Studio update adds HDR support",
  "category": "gaming",
  "updated": "2021-04-23T10:24:33Z",
  "author": "vic-hood",
  "summary": "Plus improved clip lengths",
  "article": [
    "Sony has rolled out a new update to its Share Factory Studio app on PS5, which adds HDR support and improves clip lengths.",
    "Announcing the update on PlayStation Blog, Sony revealed that the new enhancements include an increase to clip, transition and music track counts - which have all had their counts doubled.",
    "That means that Track 1 clips have increased from 50s to 100s, Track 1 transitions have increased from 49s to 99s, Music tracks have increased from 12s to 24s and Track 2 clips have increased from 10s to 20s. According to Sony, this was a highly-requested feature from the community.",
    "A number of other features have been rolled out to improve \"the overall editing experience\". The most notable of these is support for HDR screenshots, which were previously unavailable - while 4K HDR videos were possible.",
    "The update also adds improved track visualization, with Track 1 and Track 2 now showing an icon to indicate if your clip is actually in HD, 4K and/or HDR. While a new look for Track 2 has been implemented, with extra support for layouts and frames.",
    "Finally, the update improves integration between Share Factory Studio and the PS5's Media Gallery, meaning clip and screenshot Management should be easier.",
    "According to Sony, \"these new updates will enhance the current features already available on the Share Factory Studio app for PS5\", with users now being able to create videos up to 4K resolution at 60fps with HDR support.",
    "The PS5's Share Factory Studio app is available for free to all users and allows players to edit screenshots and video clips they've taken in-game.",
    "The app allows users to add the likes of stickers, text, sounds effects, filters and camera effects to their clips or screenshots, before sharing them either on PS5 Game Base or social media.",
    "Share Factory Studio is available on PS4, but the technical prowess of the PS5 added a bunch of new features to the app including the ability to take 4K HDR video clips and to import videos, images, music and sound effects from a USB drive.",
    "The latest update is available right now."
  ],
  "headers": {
    "7": "What is PS5 Share Factory Studio?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PlayStation Blog": "https://blog.playstation.com/2021/04/21/latest-update-for-share-factory-studio-on-ps5-is-available-today/"
  }
}