{
  "source": "https://www.techradar.com/news/edward-snowden-warns-expressvpn-users-to-ditch-the-service-immediately",
  "title": "Edward Snowden warns ExpressVPN users to ditch the service immediately",
  "category": "computing",
  "updated": "2021-09-20T16:15:17Z",
  "author": "mayank-sharma",
  "summary": "ExpressVPN doesn’t approve of the spying project, but stands by its employee",
  "article": [
    "Former NSA whistleblower and privacy advocate Edward Snowden has warned users to stop using popular VPN service ExpressVPN.",
    "“If you’re an ExpressVPN customer, you shouldn’t be,” Snowden posted on Twitter.",
    "Snowden’s suggestion was a quote tweet that shared news of ExpressVPN CIO Daniel Gericke’s role in Project Raven, which involved the creation of spying tools for the UAE.",
    "Gericke is part of the three former US intelligence operatives that have been charged by the US Department of Justice (DoJ) for their role in the spying operation, and have agreed not to contest the charges and pay the imposed fine.",
    "In response to the development, ExpressVPN has released a statement to shed light on Gericke’s cybersecurity background and its decision to stick with its CIO.",
    "Gericke was hired by ExpressVPN in 2019, and while the company was aware of his background, it had no details about any “classified activities.”",
    "“To be completely clear, as much as we value Daniel’s expertise and how it has helped us to protect customers, we do not condone Project Raven,” the company added.",
    "The DoJ has charged Gericke and two others for their alleged work as mercenary hackers for the UAE, helping the country create and use zero-click surveillance tools against vocal critics of the country’s human rights record.",
    "Instead of fighting the charges, the three defendants have agreed to cooperate with US authorities and pay the fine in exchange for deferred prosecution.",
    "ExpressVPN meanwhile has decided to standby its CIO, as it tries to allay the fears voiced by privacy advocates such as Snowden.",
    "“Since Daniel joined us, he has performed exactly the function that we hired him to do: He has consistently and continuously strengthened and reinforced the systems that allow us to deliver privacy and security to millions of people,” said ExpressVPN, sharing details of the technology that helps it protect the interest of its users against all kinds of threats.",
    "It’s been a busy couple of weeks for ExpressVPN, with Snowden’s warning following the DoJ resolution that came on the heels of ExpressVPN’s acquisition by Kape Technologies in a deal valued close to $1 billion."
  ],
  "headers": {
    "4": "Privacy is paramount"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "posted": "https://twitter.com/Snowden/status/1438291654239215619",
    "Project Raven": "https://www.vice.com/en/article/3aq9a5/us-company-sold-zero-click-exploit-project-raven-uae",
    "charged by the US Department of Justice (DoJ)": "https://www.techradar.com/news/expressvpn-executive-facing-fine-over-uae-spying-probe",
    "released a statement": "https://xvtelink.com/blog/daniel-gericke-expressvpn/?a_fid=744&data1=trd-us-8997464257061283000",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "ExpressVPN’s acquisition": "https://www.techradar.com/news/expressvpn-to-join-kape-in-largest-deal-ever-in-vpn-industry"
  }
}