{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-looks-likely-to-launch-instead-of-z-flip-2",
  "title": "Samsung Galaxy Z Flip 3 looks likely to launch instead of Z Flip 2",
  "category": "phones",
  "updated": "2021-04-16T08:57:30Z",
  "author": "james-rogerson",
  "summary": "And it could have a triple-lens camera",
  "article": [
    "For a while now it’s been unclear whether Samsung would call its next clamshell foldable phone the Samsung Galaxy Z Flip 3 or the Galaxy Z Flip 2, but it looks like Galaxy Z Flip 3 has probably won out based on the latest leak.",
    "LetsGoDigital claims to have heard as much from “several reliable sources”, so while we’d take this with a pinch of salt for now, it sounds like the site is quite confident of its information.",
    "It’s a name that would make sense too, as it would bring the range in line with the Z Fold, the next model of which is almost certainly going to be called the Samsung Galaxy Z Fold 3. Plus, while there hasn’t been a Z Flip 2, there was a Samsung Galaxy Z Flip 5G launched a while after the original Z Flip, so that could be considered the Z Flip 2 in all but name.",
    "That said, just a few days before this latest leak another source referred to the upcoming clamshell foldable as the Samsung Galaxy Z Flip 2, so it seems there are still some voices of dissent.",
    "But for the reasons listed above, coupled with rumors of the name change dating back as far as last year, we’ve been thinking Galaxy Z Flip 3 is the more likely name, and now we’re almost certain of it.",
    "As well as the likely name, LetsGoDigital also mentions some possible spec details of the Z Fold 3, though it’s not clear whether this is new information or simply reiterating previous rumors. In any case, the site suggests it will have a triple-lens camera, a larger cover screen, smaller bezels, and that it will be available in black, beige, green and purple shades.",
    "We’ll probably find out for sure what the phone is called and what specs it features in July, as that’s when it’s currently rumored to land – alongside the Samsung Galaxy Z Fold 3.",
    "Via SamMobile"
  ],
  "headers": {
    "3": "Don't count 2 out"
  },
  "links": {
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/samsung-z-flip-3/",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "another source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-galaxy-z-flip-2-may-arrive-sooner-than-we-thought",
    "currently rumored to land": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-could-be-many-months-away",
    "SamMobile": "https://www.sammobile.com/news/samsung-decided-not-launch-the-galaxy-z-flip-2-this-year/"
  }
}