{
  "source": "https://www.techradar.com/news/meet-the-billionaire-who-wants-to-help-you-profit-from-your-personal-data",
  "title": "Meet the billionaire who wants to help you profit from your personal data",
  "category": "computing",
  "updated": "2021-08-11T12:48:32Z",
  "author": "joel-khalili",
  "summary": "Jim McKelvey has a madcap plan to fix the data economy",
  "article": [
    "The title of entrepreneur is often thrown around these days to describe nearly anyone successful in business, but somewhere along the way its real meaning was lost, says Jim McKelvey.",
    "Over the years, McKelvey has founded several different companies, including POS and payments titan Square, now worth circa $120 billion. So one can presume he knows a thing or two about entrepreneurship.",
    "By McKelvey’s definition, there is an important distinction between a businessperson and an entrepreneur. A businessperson copies what has already been done, and copies successfully, whereas an entrepreneur is someone brave (or mad) enough to carve a new path entirely.",
    "“Entrepreneurs are just normal people,” he told TechRadar Pro. “There are no superlatives to describe them, except for the fact they were put in a place where they were not allowed to copy, but kept going regardless.”",
    "“When you find a problem that humanity has not yet solved, all your schooling, social experience and biology will tell you to stop. We’re wired as humans to copy, not to innovate, but entrepreneurs have that extra gear.”",
    "McKelvey insists there was never a time he wasn’t thinking about starting a business, even when he was young. “I just had to wait until I had a reason to start one,” he said.",
    "To date, McKelvey has launched companies in a diverse range of areas, from CD cabinet manufacturing to publishing, software and payments. He even dabbles in the arts; McKelvey is a keen glassblower and owns a studio called the Third Degree Glass Factory in St. Louis, Missouri.",
    "The common thread connecting these altogether very different endeavors, McKelvey says, is that they all sought to solve a problem that was yet to be solved. Sometimes, identifying these problems is hard work, but sometimes they present themselves as a bolt from the blue.",
    "It was in his glassblowing studio that McKelvey first came up with the idea for Square. He was trying to sell one of his pieces, but the buyer said they could only pay with American Express, which he didn’t have the necessary equipment to accept. “Suddenly, I discovered I already had a problem I cared deeply about: getting paid,” he quipped.",
    "Coincidentally, Twitter founder Jack Dorsey had approached McKelvey earlier that year, asking whether he was interested in co-founding a new business (aged 15, Dorsey had worked underneath McKelvey as an intern at Mira). The pair had been kicking a few ideas back and forth, but suddenly they had one with potential.",
    "Just three weeks later, they had built a working prototype of what later became the iconic Square card reader, a tiny point-of-sale system that plugged into the audio jack of a smartphone.",
    "Admittedly, it took another year and a half before the duo managed to navigate the various legal complexities and bring the payments incumbents onside (rumor has it that Visa kept a binder containing plans to sink Square). However, they had created a solution to McKelvey’s problem, one that was shared by millions of small businesses worldwide.",
    "“Our value proposition was very simple: get paid fairly,” McKelvey explained.",
    "Since 2009, Square has expanded beyond its original POS device, into areas such as peer-to-peer payments and even stock- and crypto-trading. But that doesn’t mean there weren’t scares along the way.",
    "The most significant threat came in the form of Amazon, a company renowned for putting startups out of business. In 2014, Amazon began to sell a card reader with identical functionality to Square’s, but undercut McKelvey’s company by as much as 30%. However, the number of customers using Square held steady, and Amazon eventually abandoned its offering in early 2016.",
    "McKelvey has been asked many times why he thinks Square was able to fend off the advances of Amazon, when no other business had managed to do so before. The closest he has come to an explanation is that a fortuitous combination of attributes and a collection of different inventions made Square more resilient than perhaps Amazon expected.",
    "This is the topic of McKelvey’s book, The Innovation Stack, which he insists is categorically not a manual to be studied, but rather an exploration of the potency of new ideas when chained together - or rather, stacked.",
    "“In the early days, before Square was Square, people just wouldn’t understand the concept. But we eventually figured out how to make it work; it required a collection of inventions that we came to call Square’s innovation stack,” said McKelvey.",
    "“Part of this innovation stack was that we figured out how to do a really cool thing fast, and then we figured out how to do the cool thing legally.”",
    "Asked how the company manages to remain agile, despite its rapid expansion, McKelvey explained that culture is the all-important second piece of the puzzle.",
    "“We don’t think of ourselves as a financial company, we’re a technology company. We have phenomenal people, we don’t have strong adhesions to existing systems and we never punish failure.”",
    "According to McKelvey, a company that has a little of this “magic” infused into its DNA is much better equipped to weather a crisis, whether in the form of a pandemic or an assault from Big Tech.",
    "Although McKelvey still keeps a hand in at Square via a position on the board, his attention is now largely invested in solving a new problem: the imbalance of power in the data economy.",
    "“We are all being monetized by the platforms that take our information - our digital selves - and sell that for their own benefit. And that’s wrong,” he told us.",
    "To address this hypermodern problem, McKelvey founded Invisibly, a company that is difficult to define, but broadly seeks to return control of personal data to the hands of its owners.",
    "Originally, Invisibly was supposed to help reconfigure the economics that underpin the journalism industry in the digital age. According to McKelvey, as long as the internet is fueled by human attention, “the math that creates false information will be more favorable than the math that creates truth; it’s cheaper to make an interesting lie than an accurate truth.”",
    "His goal was to give publications a way to generate revenue that was not tied to their ability to draw as many eyeballs as possible, or convince people to pay for an expensive all-access subscription. The plan was to reward users with tokens for every advertisement they viewed, which could then be spent to access paywalled media content on a per-article basis.",
    "After a rocky start, which McKelvey pins on the failure of media brands to provide accurate data, Invisibly has since rebooted itself with a closer focus on the people reading the articles as opposed to the publications themselves.",
    "Now, Invisibly asks users to provide as much or as little personal information as they are comfortable with. The company doesn’t sell this data directly, but rather uses it to match people with advertisements for products and services that are most likely to meet their needs.",
    "The companies on the other side of the equation pay Invisibly for the privilege of targeting the most relevant audience possible (and importantly, an audience that has actively consented), with the profits funnelled into the pockets of the people who provided the data in the first place.",
    "“We basically act as your agent,” McKelvey explained. “We try to sell you to advertisers and we give you the money. We ask how much you are willing to sell, package it up and sell it to the highest bidder.”",
    "A separate Invisibly spokesperson told us that early adopters of the beta (currently live in the US only) can expect to earn just a few dollars per month for now, but the company says this figure has the potential to grow dramatically as the marketplace expands. And really, although funds earned on the platform can be cashed out, Invisibly is more interested in putting that money to work for its users.",
    "“Our goal is to give users many ways to use their earnings - you can make someone feel rich when there’s a low friction way to spend small amounts,” said the spokesperson. “Five dollars buys a heck of a lot of great paywalled content, or could be used to buy ridesharing credits, for example.”",
    "In essence, Invisibly is attempting to create a multi-faceted marketplace that realigns the ambitions of everyone involved, from the person providing the data, to the companies who pay to advertize and those whose products will be offered up in exchange for the tokens people earn.",
    "If all this sounds a little complex, that’s because it is. The various market participants and number of moving parts make Invisibly a complex proposition to wrap your head around. But an intricate problem perhaps demands an equally clever solution.",
    "Invisibly is far from the finished article and there are still details to be ironed out. For example, it’s unclear why brands would bother to use Invisibly to target an audience while third-party cookies still exist. But McKelvey is confident his team has, at the very least, built the kernel of something that could be genuinely transformative.",
    "A recent injection of cash from notorious venture capitalist Peter Thiel and early interest expressed by a number of Fortune 500 companies (although Invisibly would not provide names) suggest he might be right.",
    "“It’s still very early days, but come and play! It’s starting to get fun,” said McKelvey, before bounding off to his next meeting."
  ],
  "headers": {
    "5": "A problem to solve",
    "13": "Repelling a technology giant",
    "22": "A new problem",
    "34": "Too good to be true?"
  },
  "links": {
    "POS": "https://www.techradar.com/news/the-best-pos-system",
    "payments": "https://www.techradar.com/best/best-payment-gateways",
    "Mira": "https://www.mirasmart.com/about-us",
    "Invisibly": "https://www.invisibly.com/"
  }
}