{
  "source": "https://www.techradar.com/news/joan-6-pro-makes-booking-a-meeting-room-a-breeze",
  "title": "Joan 6 Pro makes booking a meeting room a breeze",
  "category": "pro",
  "updated": "2021-09-21T05:49:09Z",
  "author": "nick-rego",
  "summary": "Joan’s latest device offers easier room management and stronger security protocols",
  "article": [
    "As people return to the office and start to wrestle once again with booking meeting rooms and boardrooms, an updated solution to an existing market-leading device is on the horizon. Visionect, a company well-versed in ePaper room management devices, announced shipping for its latest device, the Joan 6 Pro.",
    "We’ve previously looked at the company’s offerings in the form of the Joan 6 and Joan 13, but the Joan 6 Pro combines the best of both devices into one streamlined meeting-room booking experience. Rooms can be booked on the fly or through a company calendar, and employees are able to check a room’s calendar directly on the device itself to avoid double bookings.",
    "“The post-pandemic oﬃce is ﬂexible and this ﬂexibility brings another layer of complexity. People will be transiting between work from home and oﬃce. In order to keep the workplace safe and eﬃcient companies need better workplace management solutions. Joan 6 Pro was designed bottom-up based on our extensive experience and customer requirements, and will serve as an important element of the modern post pandemic oﬃce. This is the tool that will help every oﬃce stay safe and eﬃcient. And it perfectly integrates with other solutions from the Joan Workplace Management system,” explains Matej Zalar, Co-founder of Visionect.",
    "Joan 6 Pro has the capability of up to 6-months of battery life, using far less power than other tablet devices. The new device also introduces a new form of connectivity in the shape of Joan Smart Magnets. These attach to any surface and act as location tags for the portable Joan 6 Pro, guaranteeing zero installation costs. Devices automatically reconﬁgure to display each room’s dedicated information every time it is anchored to a networked magnet. Furthermore, devices are trackable and aren’t tied to speciﬁc meeting rooms.",
    "For companies with extra-stringent security protocols, Joan 6 Pro can also be wired directly into a ﬁxed space to take advantage of a PoE network. This allows for perpetual power and increased security. The side of the wall mount is now equipped with LED lights based on customer feedback – green for free and red for booked.",
    "Joan 6 Pro’s other features include the ability to display custom logos and meeting room names, integration with popular calendars such as Google G Suite and Microsoft Exchange, as well as more stable 2.4/5GHz Wi-Fi support.",
    "Joan 6 Pro is available now and is priced at €649.00 (around $761; £557; AU$1,048) per unit, excluding subscription details."
  ],
  "headers": {
    "6": "Price and availability"
  },
  "links": {
    "Joan 6 and Joan 13": "https://www.techradar.com/reviews/joan-6-joan-13"
  }
}