{
  "source": "https://www.techradar.com/news/could-this-be-the-first-gaming-focused-smartwatch",
  "title": "This smartwatch could come with a gaming-themed twist",
  "category": "wearables",
  "updated": "2021-02-24T16:31:26Z",
  "author": "tom-bedford",
  "summary": "Nubia strikes again",
  "article": [
    "Nubia is one of the most interesting phone brands out there, because instead of putting out endless similar iterations on the same concept, it creates some bizarre and fun products - case in point, it could have a gaming smartwatch in the works.",
    "We know the Red Magic 6, Nubia's next entry in its gaming phone line, is due to be launched March 4, and on Chinese social media platform Weibo, Nubia's president Ni Fei unveiled a first look at a Red Magic smartwatch. This wearable is implied, though not confirmed, to be launching alongside the gaming smartphone.",
    "The watch looks startlingly similar to the Honor Magic Watch 2, and the post confirms it'll have a 1.39-inch AMOLED screen with a 454 pixel-per-inch resolution. Other than the design, that's all we can tell from the post, but 'Red Magic' is a gaming range.",
    "This isn't Nubia's first smartwatch, as it follows the Nubia Alpha and Nubia Watch amongst others, but compared to those large, curved-display watches, the Red Magic Watch looks strangely conventional (at least for Nubia).",
    "A gaming smartwatch would just be one of many quirky products from Nubia and parent company ZTE, after the Nubia Z20 with a screen on each side of its body, or the Axon 20 5G with an in-display selfie camera.",
    "If you're scratching your head thinking 'is smartwatch gaming a thing', then we should clarify that no, it's definitely not. In fact, our only inkling that the Nubia Red Magic Watch is a gaming-themed smartwatch is the 'Red Magic' title, and it's likely drawing on the smartphones' design more than function.",
    "There are some ways, though, that a gaming smartwatch could work.",
    "Some smartwatches actually do already allow you to play games - Wear OS devices, using Google's Play Store, and Apple Watches, with Apple's App Store, both have a limited selection of titles you can play.",
    "But these games are few and far between, and new titles aren't exactly frequently released. However if a smartwatch launched with some titles on it, with the promise of more games to come, it could draw in avid gamers who'd like a little wrist fun.",
    "More useful, though, would be a smartwatch app as a companion to a mobile, console or PC game. Companion apps are tools you can download on your phone to give you added functionality in the game, whether that's to peruse a map, quickly change your loadout or something else, and games like Call of Duty, Grand Theft Auto V and Fallout 4 have all had them.",
    "The idea is that you can use your phone while playing a game, but with the time it takes to pick up your handset and load up the app, it's often more convenient just to do the function in the game. That might not be the case with a smartwatch app though - perhaps you could check a map or mission briefing on your wrist, like a real-life James Bond.",
    "This is just speculation, though plausible speculation, and without any Nubia Red Magic Watch functions or features announced, it remains to be seen whether this is a gaming smartwatch or just a normal wearable. If we find out more we'll let you know."
  ],
  "headers": {
    "5": "Is there mileage in a gaming smartwatch?"
  },
  "links": {
    "due to be launched March 4": "https://www.techradar.com/news/nubia-red-magic-6-gaming-phone-launches-soon-and-some-features-have-been-teased",
    "Weibo": "https://m.weibo.cn/detail/4607775705928543",
    "Honor Magic Watch 2": "https://www.techradar.com/reviews/honor-magic-watch-2",
    "Nubia Alpha": "https://www.techradar.com/reviews/nubia-alpha-review",
    "Nubia Watch": "https://www.techradar.com/reviews/nubia-watch-review",
    "Nubia Z20": "https://www.techradar.com/reviews/zte-nubia-z20-review",
    "Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review"
  }
}