{
  "source": "https://www.techradar.com/news/nvidia-update-reveals-geforce-rtx-3060-anti-cryptomining-refresh",
  "title": "Nvidia update reveals GeForce RTX 3060 anti-cryptomining refresh",
  "category": "computing",
  "updated": "2021-05-06T11:02:45Z",
  "author": "rhys-wood",
  "summary": "Can Nvidia’s updated LHR cards curb cryptomining?",
  "article": [
    "Nvidia is releasing a new variant of its GeForce RTX 3060 graphics card in May 2021. This LHR (light hash rate) model will feature an updated hash rate limiter to make the process of mining cryptocurrency more difficult, thus hopefully opening up availability for consumers interested in purchasing a new card for its intended gaming purposes.",
    "While this was previously rumored, additional weight has been added to the refresh as reported by VideoCardz, with Nvidia releasing the GeForce 466.27 driver that appears to be a required download for its new GeForce RTX 3060 LHR variant to work. The card’s PCI device ID will prevent the LHR variant of the GeForce RTX 3060 from being used with older drivers.",
    "This means that Nvidia is likely trying to push cryptominers onto more bespoke cryptocurrency hardware, such as Nvidia’s own CMP HX series. These cards are made specifically for mining popular cryptocurrencies such as Bitcoin and Ethereum and can’t be used for gaming in any capacity as they lack any form of display output.",
    "It remains to be seen if Nvidia’s light hash rate graphics cards will have an impact on availability. One reason why gaming-oriented consumers haven’t been able to get their hands on Nvidia’s high-end GeForce RTX 30 series GPUs is down to the cryptocurrency boom of recent months, where enthusiasts have discovered that graphics cards provide an efficient means of mining cryptocurrencies.",
    "Of course, that’s not the sole reason why high-end GPUs are so elusive. A global shortage of silicone is preventing GPUs to be manufactured en masse, contributing to analysts’ predictions of shortages well into 2022. That, and scalpers have been employing bots to automatically buy up stock refreshes whenever they go live, as was the case with a recent AMD online store debacle.",
    "The reintroduction of the new, updated driver is welcome news, potentially undoing a mistake Nvidia made in the form of a beta driver undoing existing hash rate limiters on RTX 3060 cards, potentially motivating mining enthusiasts to circumvent the previous version of the limiter. There are also rumors that the new hash limiter variant won’t be exclusive to the RTX 3060, as Nvidia could be rolling this out for all GPUs in the RTX 30 series except for the RTX 3090.",
    "Nvidia and Asus are examples of companies that have looked into ways of curbing the use of their GPUs for cryptomining in recent months, with the release of dedicated mining cards like the Asus CMP 30HX.",
    "However, Asus may need to go back to the drawing board in this case, as its cryptomining graphics card, based on an Nvidia GeForce GTX 1660 Super, is actually more expensive to buy than an RTX 3080.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies."
  ],
  "headers": {
    "3": "Deep in the mines again"
  },
  "links": {
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "previously rumored": "https://www.techradar.com/news/nvidia-to-launch-new-anti-cryptomining-gpu-to-replace-the-rtx-3060",
    "VideoCardz": "https://videocardz.com/newz/nvidia-reintroduces-geforce-rtx-3060-cryptomining-hash-limiter",
    "GeForce 466.27 driver": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-4097637338796223000&murl=https%3A%2F%2Fus.download.nvidia.com%2FWindows%2F466.27%2F466.27-win10-win8-win7-release-notes.pdf",
    "Nvidia’s own CMP HX": "https://www.techradar.com/news/nvidias-rtx-3080-saving-crypto-gpu-leaks-online-and-its-underwhelming",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Ethereum": "https://www.techradar.com/how-to/how-to-mine-ethereum-on-your-pc",
    "well into 2022": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "AMD online store debacle": "https://www.techradar.com/news/struggling-to-get-an-amd-gpu-this-website-bug-was-partly-to-blame",
    "beta driver": "https://www.techradar.com/news/did-nvidia-just-unlock-rtx-3060-cryptomining-by-mistake",
    "to circumvent the previous version of the limiter": "https://www.techradar.com/news/nvidia-rtx-3060-gpus-are-cryptomining-despite-the-unbreakable-hash-rate-limiter",
    "won’t be exclusive": "https://www.techradar.com/news/nvidia-is-making-life-difficult-for-cryptominers-buying-geforce-rtx-30s-gpus",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Asus CMP 30HX": "https://www.techradar.com/news/asus-could-be-making-a-crypto-mining-graphics-cardwith-rgb-lighting"
  }
}