{
  "source": "https://www.techradar.com/news/the-lenovo-thinkpad-x1-carbon-for-dollar999-is-the-black-friday-laptop-deal-to-beat",
  "title": "The Lenovo ThinkPad X1 Carbon for $999 is the Black Friday laptop deal to beat",
  "category": "computing",
  "updated": "2021-11-18T19:13:56Z",
  "author": "jackie-thomas",
  "summary": "A pro laptop at a non-pro price",
  "article": [
    "Black Friday deals are finally here, and one of the best laptop deals we've seen so far is on the Lenovo ThinkPad X1 Carbon. This is usually an extremely expensive laptop for professionals, but with this Black Friday laptop deal anyone can get their hands on it.",
    "Right now on Lenovo's website, you can get the Lenovo ThinkPad X1 Carbon Gen 9 for $999, a whopping 59% off its list price of $2,459. This finally makes this laptop more in line with mainstream Ultrabooks, even though it has a ton of features that set it apart.",
    "The reason this laptop is usually so much more expensive than something like the Dell XPS 13 is that it's build on the Intel vPro platform. This means that it boasts some impressive security features, which makes it much harder for the laptop to fall victim to malicious attacks.",
    "So, this is definitely a laptop to get if you do a lot of sensitive work on your laptop and want some peace of mind. But it's also just an attractive piece of kit, unlike a lot of other business laptops out there. Plus it has the beloved Lenovo TrackPoint, which might be worth it by itself at this price.",
    "This definitely won't be one of the cheapest or even one of the fastest laptops on sale for Black Friday 2021, but it's definitely going to be one of the most reliable and durable. And at just $999, we don't see a reason to not get it.",
    "No matter where you live, you'll find all the lowest prices for the Lenovo ThinkPad X1 Carbon from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "More Lenovo ThinkPad X1 Carbon deals",
    "6": "More Black Friday deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Lenovo ThinkPad X1 Carbon": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-carbon-gen-9",
    "Lenovo ThinkPad X1 Carbon Gen 9 for $999": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-5737931221815358000&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Fp%2Flaptops%2Fthinkpad%2Fthinkpadx1%2Fx1-carbon-gen9%2F22tp2x1x1c9",
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-2020"
  }
}