{
  "source": "https://www.techradar.com/news/valve-quietly-updates-half-life-2-to-run-better-with-steam-deck",
  "title": "Valve quietly updates Half-Life 2 to run better with Steam Deck",
  "category": "gaming",
  "updated": "2021-10-20T09:40:34Z",
  "author": "darren-allan",
  "summary": "Prepping the shooter to run better with the Steam Deck",
  "article": [
    "Half-Life 2 is a very old game, of course, but Valve has stealthily initiated a big update – now in beta – for the shooter which applies some considerable changes, and it’s clear these are aimed at making the classic title run better with the incoming Steam Deck.",
    "A YouTube leaker who specializes in Valve news, Tyler McVicker, spotted that Half-Life 2 has kicked off an unannounced beta branch, with Valve quietly working on a number of important improvements.",
    "That includes reworking the interface so it scales correctly to the resolution the game is being run at, meaning that HUD elements are larger, and Half-Life 2 will be able to play nice with the Steam Deck display’s odd aspect ratio (support for ultra-wide monitors will also be incorporated).",
    "Another very telling change is bringing in support for Vulkan, which will allow the game to run more smoothly on SteamOS, which is the operating system installed on the Steam Deck. It’s surely clear enough that this is work being done to ensure that Half-Life 2 looks good, and plays well, on the incoming handheld from Valve.",
    "Other changes being made include fine-tuning to fix a raft of bugs with the game, and the ability to crank up the FOV (Field of View, basically meaning how much peripheral vision you get in the game) up to 110 degrees.",
    "Half-Life addicts have been crying out for some of these changes, and particularly the squashing of some long-standing bugs, for ages, so it’s good to see them finally applied.",
    "Although looking at it another way, it’s pretty disappointing that these bits of polish are only just being applied when Valve has been forced to ensure that its games don’t end up making its new piece of hardware look silly, with a clunky HUD and various annoying glitches. Some of the aforementioned bugs are a decade and a half old, it seems, and many people have long been exasperated at being restricted to a FOV of 90 in Half-Life 2.",
    "YouTuber McVicker also points out that Vulkan support was introduced to Portal 2 at the start of the year, and given that, the likelihood is that Valve is going to provide this retuning treatment for all its games to ready them for the Steam Deck.",
    "All this makes sense as part of the groundwork to ensure that the software side of the Steam Deck equation is up to scratch as well as the hardware, with Valve already implementing a Steam Deck Verified system to mark which games will run really well on the handheld so folks can see at a glance.",
    "Via PC Gamer"
  ],
  "headers": {
    "5": "Analysis: Coming to a Valve game near you, soon"
  },
  "links": {
    "Half-Life 2": "https://www.techradar.com/news/gaming/half-life-2-s-freakish-endurance-and-why-we-need-to-let-half-life-3-go-1314298",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Valve already implementing a Steam Deck Verified system": "https://www.techradar.com/news/steam-deck-will-let-you-know-which-games-run-well-and-which-ones-dont",
    "games": "https://www.techradar.com/news/5-games-i-cant-wait-to-play-on-steam-deck",
    "PC Gamer": "https://www.pcgamer.com/uk/valve-quietly-updates-half-life-2-with-increased-fov-ultrawide-support-and-ancient-bug-fixes/"
  }
}