{
  "source": "https://www.techradar.com/news/elite-dangerous-odyssey-alpha-phase-2",
  "title": "Elite Dangerous Odyssey Alpha Phase 2: back in the pilot's seat – and firefights",
  "category": "computing",
  "updated": "2021-04-09T03:52:26Z",
  "author": "john-loeffler",
  "summary": "Odyssey's Alpha Phase 2 rolls out new combat and ship activities",
  "article": [
    "Elite: Dangerous Odyssey Alpha Phase 2 rolled out this week, introducing changes to combat – including the addition of faction combat zones and related mission – as well as putting Commanders back in the pilot seat and growing the playable region from a single star system to 20 light-years. Oh, and we finally get to try some of that E-breach.",
    "The first thing most Alpha Phase Commanders are going to do once the sizeable update downloads is buy themselves the new suit, the Dominator. This suit is better suited, ahem, for combat situations like the newly implemented planetside conflict zones. It has two slots for primary weapons and a third for a secondary weapon, more armor, but lacks an arc cutter.",
    "This makes the pilot loadout much like ships in the main game, where you end up building a small fleet of ships specifically designed for exploration or hauling cargo. The suits in Odyssey look like they'll be broken down into three categories: Utility, Combat, and Exploration, with some missions (like powering on settlements) requiring a specific type of suit in order to get the job done.",
    "Elite: Dangerous Oddyssey Alpha Phase 2 is predominantly about combat. In addition to the new combat-focused suit, there is the addition of faction conflict that opens up different settlements as battlefields. The combat is fun, to a point - we're not talking Call of Duty: Warzone here - but the fire fights on the ground are a step up from the kinds of combat we've been seeing in Phase 1.",
    "These new missions are handled through Frontline Solutions and the ones I've done so far are basic domination-style maps, where you need to help your side control three control points while fighting off defenders and then defending what you take.",
    "Fortunately, should you die in one of these conflict zones, you won't get sent all the way back to the nearest space station or settlement as you would if you were in a space-based conflict zone. So long as the side you're fighting for has reinforcements left, you can respawn and get back into the fight.",
    "If your side does not have reinforcements left, though, you have to either wait for the fight to end or withdraw from the conflict zone. In either case, you'll be boarded back onto a shuttle and taken back to the station where you signed up for the fight.",
    "It's also possible to take your own ship to the fight, but we haven't tried this yet.",
    "The conflict zones weren't without their foibles though – this is still the game's Alpha Phase – and players jumping into the faction combat to try out their new suits may find themselves dangling over the open bay doors of their vulture dropship for a few minutes before being dropped into combat. There are other similar issues that popped up, but there has already been one hotfix update so these are being ironed out as the Alpha progresses.",
    "Odyssey's Phase 2 also expands the playable region and allows players to skip the Apex Interstellar shuttle and get back into the cockpit themselves, courtesy of a Sidewinder and a free Cobra III for good measure. You can also go to Inter Astra and buy yourself another ship with all that filthy lucre you've been making by slaughtering scientists at some biological hub at the behest of some corporate competitor.",
    "All the normal ship-based activities are there, but the addition of disembarking on foot – either in a space station, a settlement, or just wherever you've touched down on a surface – makes the game feel much more expansive. While there isn't much to do on foot on whatever random world you've landed on outside the range of a settlement, there is exobiology in the next Phase, as well as the possibility of mining and various other surface activities that are possible down the road.",
    "Elite: Dangerous Oddyssey Alpha Phase 2 still does not feel like a complete game yet and there is much that still needs to be done, but so far it's showing some real promise and it'll be exciting to see what the expansion looks like when it's release in a few months."
  ],
  "headers": {
    "3": "Out of the cokpit, into the fire",
    "9": "Well hello, Old Friend"
  },
  "links": {
    "Elite: Dangerous Odyssey": "https://www.techradar.com/news/first-look-elite-dangerous-odyssey",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone"
  }
}