{
  "source": "https://www.techradar.com/news/yes-you-can-play-metal-gear-solid-v-on-an-m1-mac-heres-how",
  "title": "Yes, you can play Metal Gear Solid V on an Apple M1 Mac – here's how",
  "category": "computing",
  "updated": "2021-09-05T11:00:23Z",
  "author": "daryl-baxter",
  "summary": "Opinion: The King of Iron ARM Tournament",
  "article": [
    "I’ve been using an M1 Mac mini for the last several months, and while it’s early days for Apple Silicon, it’s already impressive how much it can handle across the Mac line.",
    "When it comes to games, there’s already a massive library available, mainly thanks to games on iPhone and iPad now able to be played on these devices. However, if someone wants to try and access their Steam library, they’re out of luck.",
    "Well, almost. With Parallels releasing a new version of the virtualization software Parallels Desktop 17, it opened up the opportunity to use Windows 10 ARM on the M1 Macs, and in turn, Valve’s Steam client.",
    "I wanted to see if I could play Metal Gear Solid V: Ground Zeroes without using my gaming PC, and if it did, how well the M1 chip from Apple could run it and other games through Parallels. This began my quest.",
    "Ever since I played the very first Metal Gear Solid on its own demo disc back in 1998, I’ve been a follower of the series ever since. When a fifth entry was finally confirmed in 2014, I waited incessantly for a demo once more.",
    "I had found that playing Metal Gear Solid V: Ground Zeroes on PC was the best way of experiencing Big Boss’ adventure set in the early 80s, so I wanted to see if my test of using Steam to download the game could work on the M1 Mac mini.",
    "After installing the beta version of Windows 10 for ARM devices through Parallels Desktop, I installed the game through Steam, just as any other PC running an Intel or AMD CPU would, and once I clicked on ‘Play’, there Snake was.",
    "Granted, the game runs in a 1440x900 resolution and every graphical setting is on low, but it’s playable at roughly 45 FPS, and it’s not through a cloud service, just virtualization. It was a fantastic moment, as this was now running on a Mac, as if it was a native app on its own.",
    "I rescued Kaz and eventually Hideo Kojima himself, with the M1 chip treating the game as if it was nothing it couldn’t handle. After this playthrough, I wanted to discover if other games would run as well as Ground Zeroes did.",
    "One by one I downloaded the games in my library and left it overnight, wondering whether I would be fighting against Nemesis in Resident Evil 3, or choosing my favored team in Dragon Ball FighterZ.",
    "I chose the following to see whether they would run as well as Ground Zeroes did:",
    "Just DOOM and Dragon Ball FighterZ refused to run, explicitly stating that these two could only be played on an Intel or AMD chip. However, every other game ran on the Mac mini, with Resident Evil 3 remake working but at 5 fps, rendering it an unplayable experience. Others such as Sonic Adventure, GTA IV and even Tekken 7 ran well, the latter easily performing multiple combos with the Kazuya character.",
    "Playing these on the M1 Mac mini with 16GB RAM was a surprising experience, mainly because there’s been no acknowledgement from Parallels, Apple or even Valve that this can be done. While the Xbox and Epic Games apps refuse to run, you can log into your Steam account right now, within Windows 10 ARM, and see if your favorite games can be played with no issues.",
    "It’s been long-known that Steam hasn't had the biggest impact on macOS, with Apple focusing on Apple Arcade and other games from third parties through the Mac App Store and iOS apps.",
    "The M1 chip continues to surprise, and as the iMac, the MacBook Pro and MacBook Air devices also use the same Apple M1 chip, the performance here will be the same across the board, so you can try your hand at installing some games in Parallels Desktop right now.",
    "But using this method opens up a plethora of possibilities, alongside how the next line of Apple Silicon chips could run these games, if the rumors are to be believed.",
    "For years there’s been attempts to run games on the Mac through emulation or other virtualization efforts, but using this method through Parallels only shows what the next line of Macs with an M1X or M2 chip could be capable of.",
    "While running games such as Tomb Raider II and Sonic Adventure at full speed, others such as Resident Evil 3 have a long way to go, even though they can be played at present. With rumors of the next Apple Silicon chips focusing on more cores for graphics, this could give modern games the shot in the arm that it needs to run at a better framerate.",
    "While there’s no reason to expect a full framerate with ray tracing and VR, being able to play games that have almost no chance of appearing on the Mac App Store through virtualization is a fun time. It’s only when you find yourself playing Tekken 7 and Crash Bandicoot on an M1 Mac that this is only the start of what Apple Silicon is capable of, and we may not be far off from seeing some even bigger improvements once the rumored M1X MacBook Pro devices are announced."
  ],
  "headers": {
    "4": "A Foxhound",
    "9": "A Sonic Adventure on M1",
    "16": "Metal Gear M2 Solid"
  },
  "links": {
    "M1 Mac mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 10 for ARM devices": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1125317000715124900&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fsoftware-download%2FwindowsinsiderpreviewARM64",
    "Parallels Desktop": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3370612312082892000/https://www.parallels.com/uk/",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Mac App": "https://www.techradar.com/news/software/applications/30-best-mac-apps-for-just-about-everything-712511",
    "M1X MacBook Pro": "https://www.techradar.com/news/apple-m1x-macbook-pro-might-drop-as-early-as-october"
  }
}