{
  "source": "https://www.techradar.com/news/pandemic-pushing-edge-developers-to-the-forefront-of-innovation",
  "title": "Pandemic pushing edge developers to the forefront of innovation",
  "category": "computing",
  "updated": "2021-01-06T15:12:21Z",
  "author": "luca-collacciani",
  "summary": "Edge developers can help business succeed",
  "article": [
    "The world has fundamentally changed in terms of how we consume services, and, in our socially distanced society, every company needs to become digitally focused to meet constantly changing customer needs. As such, companies are having to accelerate their digital strategies quicker than ever before, something we have observed over the course of last year and continuing as we move into 2021.",
    "Internally, IT management teams have been tasked with introducing entirely new work processes at an unprecedented rate. This has enabled businesses to cope with the rapid shift to remote working, while also protecting employee data, keeping networks secure, and maintaining a more stable internet connection while on the move.",
    "With all of this in mind, edge developers are being tasked with a huge responsibility. The success of industry in coping with the move runs parallel with the efforts of developers and how well they embrace this new challenge.",
    "Regardless of what happens with Covid-19 vaccines, in the post pandemic world more businesses are planning to operate remotely. In fact, according to US-based Enterprise Technology Research (ETR), the number of global workers who are planning to permanently work from home is expected to double in 2021. The research indicates that IT decision-makers expect permanent remote work to become a reality for over a third (34%) of their companies’ workforces, compared with just under a fifth (16%) before the coronavirus outbreak, a result of positive productivity trends.",
    "To meet this ongoing requirement for remote working, there is a growing need to ensure that networks are not overwhelmed. Developers will play a key role in enabling this to happen, by creating the very applications and services that companies will base their strategies on. However, with customers wishing to access services from any device, and anywhere they choose, the rise of mobile and IoT devices means the end user experience is becoming increasingly diverse and complex to manage.",
    "So, what is the solution for businesses as they move forward?",
    "This increased need to meet the demands of the remote workforce and customers alike, regardless of time or location, means companies are turning to the edge, which offers a strategically dispersed network of servers, enabling Content Delivery Networks (CDNs) to provide internet services fully at scale. By removing the need for a central server, data that is collected and stored on the edge has a shorter journey every time an employee or customer makes a request. Therefore, when the network operates on the edge, businesses can respond in real-time to requests from all over the globe without jeopardizing efficiency, speed, or latency.",
    "To turbo-boost these systems, many industries have turned to developers to step up and lead the charge. During lockdown, online traffic increased substantially as it became a staple of everyday life, both for work and leisure time. As such, edge developers have been working overtime to ensure their company is ready and able to access its benefits, including boosting the quality of video webinars and the reliability of video conferencing calls. By increasing latency, the edge decreases lag and down-time, enabling companies to render video on any device – to viewers or participants in any location – while providing large software downloads at scale. Utilizing edge networks, developers have enabled businesses to cope with the surge in connected users, and the number of requests they generate.",
    "However, this did not come without its challenges; trends in computer hacking tended to follow the geographical spread of the pandemic, more people working from home meant hackers targeting those vulnerabilities, with home networks generally easier to infiltrate. Recently, Akamai found that during 2020, there has been a three-fold increase in application layer attacks on websites in the first nine months of the year, in addition to ransom DDoS or “RDoS” attacks, which have targeted various industries for financial gain.",
    "In trying to tackle and mitigate these issues, edge networks play a significant role. For example, in certain businesses, once typical events like face-to-face interactions, are now replaced with social distancing guidelines, places like banks and retail stores, coming up to Christmas, became increasingly reliant on contactless devices and online payments. This demand has made it even more difficult to detect fraud while simultaneously authenticating the identity of the customer in real-time.",
    "Combining 5G with edge servers will speed up the process, quickly transferring the data, and detecting any suspicious activity. Similarly, for businesses more generally, storing data in this way can boost security as, when the server is located on the edge, it is much easier to mitigate attacks before they get near the core network. As we move closer to widespread 5G, the edge will transform the way we share, collect and monitor data.",
    "Technology has been pivotal in helping us through the pandemic and, going forward, customers will continue to rely on and expect more from tech companies and service providers. The role developers play will be key in designing the parameters for systems to cope with continued evolution and new frontiers in technology. In order to do this though, companies must continue to keep the edge in the same conversation as business development.",
    "Edge networks are fundamentally set to define how we connect with other people, both for work and throughout the rest of our everyday lives. These crucial networks will enable society to weather the storm in the face of additional challenges and maintain continuity and stability – something you cannot put a value on. By allowing developers to innovate through the edge, businesses will be able to continue to take advantage of new opportunities and keep servicing customers in this redefined world."
  ],
  "headers": {
    "3": "Developers are in the driving seat",
    "6": "Another step closer to the edge",
    "9": "The significant role of Edge networks",
    "11": "Re-enforce your systems with the Edge"
  },
  "links": {
    "IT management": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "employee": "https://www.techradar.com/best/best-employee-scheduling-software",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "CDNs": "https://www.techradar.com/news/best-cdn-providers",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software"
  }
}