{
  "source": "https://www.techradar.com/news/rode-launches-successor-to-one-of-the-best-wireless-microphones-for-youtube",
  "title": "Rode launches successor to one of the best wireless microphones for YouTube",
  "category": "cameras",
  "updated": "2021-02-24T12:32:40Z",
  "author": "mark-wilson",
  "summary": "Now with dual channel recording and more",
  "article": [
    "Rode has just launched a successor to one of the best wireless microphones around for vlogging and shooting YouTube videos.",
    "The Wireless Go II builds on the same idea as its predecessor – a small wireless mic that clips onto your clothes and sends audio to a little receiver – but brings some big upgrades that could make it the ideal way to boost the audio quality of your videos, whether they're shot on a phone or camera.",
    "The main upgrade is support for dual-channel recording from two separate clip-on microphones, which are both included in the Wireless Go II's box. These send audio over a 2.4Ghz connection to the same receiver from up to 200m away, which could make it an ideal system for YouTubers who regularly shoot with two presenters or interviews.",
    "Another big bonus on the Wireless Go II is on-board recording. Thanks to internal storage, each transmitter can apparently record up to 24 hours of audio, which could be a very handy failsafe for those worried about recording mishaps.",
    "The Wireless Go II will also work with both cameras and phones, with a 3.5mm output for plugging into the latter (assuming your camera has a 3.5mm jack) and a USB-C output for plugging into smartphones, tablets or computers.",
    "While each of the two microphones contain an omnidirectional condenser capsule for recording high-quality audio, you can also plug in a separate lavalier microphone via their 3.5mm inputs. This can help give you an even more discreet recording setup than clipping the Wireless Go II's transmitters (which only weigh 31g each) onto your clothing.",
    "On paper, the Rode Wireless Go II looks like an excellent follow-up to the original Wireless Go, which will remain on sale as a cheaper option for those who only want to record one source.",
    "While shotgun microphones also have their advantages, like being able to capture audio from multiple people and filter out background noise, Rode's system is ideal if you mainly shoot one or two people who want to be free to around a scene.",
    "The Wireless Go II batteries will apparently run for around seven hours, and the system is impressively flexible for such a small setup. This is partly because it's compatible with the Rode Central app, which gives you access to extra features like a safety channel (which records a second track in case the main channel distorts) and granular gain control.",
    "Naturally, the Wireless Go II is a little pricier than the original system, because it includes an extra transmitter along with its other upgrades. But at $299 / £279 / AU$399, it's still in the affordable category of wireless microphone systems and stands a good chance of matching the popularity of its predecessor thanks to these handy new features."
  ],
  "headers": {
    "6": "The Go Team"
  },
  "links": {}
}