{
  "source": "https://www.techradar.com/news/americas-small-businesses-arent-that-worried-about-cyberattacks",
  "title": "America's small businesses aren't that worried about cyberattacks",
  "category": "computing",
  "updated": "2021-08-13T17:22:07Z",
  "author": "anthony-spadafora",
  "summary": "Small businesses don't believe they'll be targeted by cybercriminals",
  "article": [
    "As enterprise organizations continue to face threats from supply chain attacks, ransomware and other online threats, a new survey from CNBC and Momentive has revealed that small businesses in the US are not overly worried about being the victim of a cyberattack.",
    "To compile their new Q3 Small Business Survey, the news outlet and the experience management company surveyed over 2,000 small business owners across the US to learn their thoughts about cyberattacks and gauge their readiness when it comes to fending one off.",
    "Surprisingly, more than half (56%) of respondents said they are not concerned about becoming the victim of a cyberattack during the next 12 months with 24 percent saying they are “not concerned at all”.",
    "Of the 42 percent of small business owners that are concerned about cyberattacks, only 13 percent said they were “very concerned”.",
    "Of the small businesses surveyed by CNBC and Momentive, only 28 percent said they have a disaster recovery plan in place in the event of a cyberattack.",
    "To make matters worse, almost half (42%) said they have no plan while 11 percent revealed that they were “not sure” if their business had a plan in place. Even without a plan for dealing with cyberattacks, cyber insurance could help mitigate the business losses incurred from dealing with an attack though just a quarter (26%) of respondents said they have cyber insurance.",
    "Perhaps the survey was a wake up call for some of the small businesses surveyed as 14 percent of respondents said that although they don't have a cybersecurity response plan, they are currently working on developing one.",
    "Any business, no matter how big or small it is, could be a potential target for cybercriminals which is why having endpoint protection software and antivirus software installed on one's systems is highly recommended. Despite this, cybersecurity training and awareness are also essential when it comes to protecting against both cyberattacks and data breaches.",
    "Taking the necessary precautions ahead of time may be time consuming and difficult for small businesses but this still beats having to deal with the after effects of a cyberattack or identity theft.",
    "Via CNBC"
  ],
  "headers": {
    "4": "Fail to plan, plan to fail"
  },
  "links": {
    "supply chain attacks": "https://www.techradar.com/news/hackers-abuse-container-technology-to-execute-supply-chain-attacks",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "cyberattack": "https://www.techradar.com/news/smbs-dont-expect-to-be-hit-by-a-cyberattack",
    "Q3 Small Business Survey": "https://www.cnbc.com/2021/08/10/main-street-overconfidence-small-businesses-dont-worry-about-hacking.html",
    "disaster recovery plan": "https://www.techradar.com/best/best-disaster-recovery-service",
    "cyber insurance": "https://www.techradar.com/news/cyber-insurance-premiums-are-shooting-up",
    "endpoint protection software": "https://www.techradar.com/news/best-endpoint-security-software",
    "antivirus software": "https://www.techradar.com/best/best-antivirus",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "CNBC": "https://www.cnbc.com/2021/08/10/main-street-overconfidence-small-businesses-dont-worry-about-hacking.html"
  }
}