{
  "source": "https://www.techradar.com/news/8-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-may-29-2021",
  "title": "8 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-05-29T02:19:11Z",
  "author": "axel-metz",
  "summary": "What's worth watching this weekend on Netflix and other streamers?",
  "article": [
    "The big news in streaming this week is incredibly obvious: the long-awaited Friends reunion is here. Whether you’re a fan of the hit 90s sitcom or not, it’s hard to deny the cultural impact of a show which kept audiences young and old hooked for 236 episodes over 10 years. It figures, then, that episode 237 has got people going a little crazy.",
    "Except, it’s not really an episode. 'The One Where They Get Back Together' is a glorified talk show interview made weirder by the casual appearances of David Beckham and Kit Harrington – but more on that later.",
    "For the rest of us, fear not, as there’s plenty more movies and TV shows hitting the likes of Netflix, Amazon Prime and Disney Plus this weekend. Below, we round up eight of the biggest highlights – from brand new Disney adventures to gripping crime docs.",
    "Alas, we’ll start with the big one. Friends: The Reunion sees all six stars of the hit 90s sitcom – Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry and David Schwimmer – return to the show’s original Warner Bros. soundstage for a “real-life, unscripted celebration” after 17 years.",
    "Several supporting characters from the original show also return for The One Where They Get Back Together, alongside an exhaustive and seemingly random assortment of celebrity guests, including BTS and Justin Bieber. It isn’t the new scripted episode fans might have hoped for, but Friends: The Reunion guns for nostalgia and hits exactly that.",
    "Now available to stream on HBO Max in the US, and Sky in the UK",
    "As well as hitting theaters, Cruella is also dropping on Disney Plus via Premier Access for those willing to spend a little extra ($30/£20) to see it at home.",
    "Emma Stone stars in this origin tale of Cruella de Vil, the infamous dog-napper who first terrorized the spotted pooches of 101 Dalmatians in 1961. From what we can tell, there’s a fair few shades of Joker in this one, not least its ’70s backdrop and less-than-conventional protagonist.",
    "Early reception has been positive, with particular praise directed towards both Stone and Emma Thompson, who stars – weirdly – as the movie’s antagonist. Given the additional cost, more casual onlookers might want to wait until it rolls out to all Disney Plus subscribers.",
    "Now available to stream on Disney Plus via Premier Access",
    "Borat Supplemental Reportings Retrieved from Floor of Stable Containing Editing Machine (and breath…) continues the misadventures of Sacha Baron Cohen’s larger-than-life Kazakh through a series of documentary shorts.",
    "It’s split into three parts, which we’d tell you about if they didn’t also have excessively long names. Basically, there’s never-before-seen footage of the 2020 sequel movie, plus several new skits featuring expectedly barmy conspiracy theorists, medical experts and, of course, members of the public.",
    "Great success!",
    "Now available to stream on Amazon Prime Video",
    "If you’re looking for some doom and gloom this weekend, Nail Bomber: Manhunt arrives on Netflix to tell the story of how one right-wing extremist held London to ransom for 13 days in 1999. It's thought that 150 people suffered injuries at the hands of David Copeland, who targeted minority groups using heinous nail bombs.",
    "If you’ve got true crime fatigue, though, don’t despair – critics have described this one as a refreshing take on the genre, and an insightful look at how a city came together to take action against a mindless killer.",
    "Now available to stream on Netflix",
    "Amazon is really rolling out the red carpet of late. Panic is the streamer’s latest high-octane drama series, based on the bestselling novel by Lauren Oliver. It follows the plight of a group of teenagers in a small Texas town who compete in a series of dangerous challenges to win a supposedly life-changing prize.",
    "Oliver herself directs, so expect a faithful adaptation of the source material. We get strong Hunger Games-meets-Spring Breakers vibes from this one, with a little bit of The Purge thrown in for good measure. So, if you want to see college kids get buried alive or ushered off the edge of a cliff, Panic might be for you.",
    "Now available to stream on Amazon Prime Video",
    "Part 2 of Lucifer’s fifth season arrives on Netflix this weekend, with eight new episodes ready to pick up where the show left off in August last year.",
    "For those not in-the-know, Tom Ellis plays Lucifer, a human embodiment of the Devil based on the DC Comics character created by Neil Gaiman. In the conclusion to season 5, the creator himself, God (played by Dennis Haysbert), finally comes to Los Angeles to join Lucifer, so expect hands (or wings?) to be thrown.",
    "Although the fifth season was initially reported to be the last, the series has been renewed for a sixth and final outing, due to air in 2022.",
    "Now available to stream on Netflix",
    "The third and final season of The Kominsky Method also hits Netflix this weekend, with Michael Douglas’ Sandy now faced with the trauma of a difficult loss, a daunting financial obligation and an important reunion.",
    "Former series regular Alan Arkin will not appear in this final season, but Kathleen Turner – who starred alongside Douglas in Romancing the Stone nearly four decades ago – joins the cast as Ruth, Sandy’s ex-wife, for all six episodes.",
    "Now available to stream on Netflix",
    "Joining Friends: The Reunion on HBO Max this weekend (albeit with less fanfare) is Oslo, a HBO original based on the award-winning play of the same name by J.T. Rogers.",
    "It dramatizes the back-channel negotiations among a group of Israelis, Palestinians and Norwegians leading up to the 1993 Oslo Peace Accords, with Ruth Wilson (His Dark Materials) and Andrew Scott (Fleabag) leading its cast. Reviews have been mixed, but for those unaware of its twisty story, Oslo might be worth the watch.",
    "Available to stream from Saturday on HBO Max"
  ],
  "headers": {
    "3": "Friends: The Reunion (HBO Max)",
    "6": "Cruella (Disney Plus via Premier Access)",
    "10": "Borat Supplemental Reportings Retrieved from Floor of Stable Containing Editing Machine (Amazon Prime)",
    "14": "Nail Bomber: Manhunt (Netflix)",
    "17": "Panic (Amazon Prime)",
    "20": "Lucifer season 5 part 2 (Netflix)",
    "24": "The Kominsky Method season 3 (Netflix)",
    "27": "Oslo (HBO Max)"
  },
  "links": {
    "Friends reunion": "https://www.techradar.com/news/what-time-is-the-friends-reunion-released-on-hbo-max-and-sky",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Amazon Prime": "https://www.techradar.com/reviews/amazon-prime-review#:~:text=Amazon%20Prime%20offers%20stunning%20value,Prime%20is%20a%20no%2Dbrainer.",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Disney Plus via Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "Panic": "https://www.techradar.com/news/panic-is-an-amazon-prime-thriller-series-that-drags-the-hunger-games-into-real-life"
  }
}