{
  "source": "https://www.techradar.com/news/your-next-iphones-most-important-feature-may-be-one-you-cant-even-see",
  "title": "Your next iPhone's most important feature may be one you can't even see",
  "category": "phones",
  "updated": "2021-04-07T09:39:08Z",
  "author": "gerald-lynch",
  "summary": "Helping all Apple devices see and speak to each other",
  "article": [
    "Your next iPhone may have features that do more than meets the eye. That's according to a freshly-awarded patent, which has seen Apple detail the use of invisible markers that would let any upcoming Apple AR glasses better interact with the smartphone.",
    "Patent number 10,969,600 (as spotted by Patently Apple), describes how AR glasses may struggle to identify a smartphone in their field of view, and how it differs from other displays – say a laptop or TV display. This would make it difficult for the two devices to interact effectively, with AR information that should be triggered by and associated with a mobile device not appearing.",
    "According to the patent, the solution would potentially be to place on the phone (or Apple Watch, or any other accessory for that matter) visual markers that include \"spectral reflectance codes.\" These would make use of retroreflective materials, photoluminescent materials and thin-film interference filter layers, that could be identified by the glasses, but would be near-invisible on the device to a user. These markers could then tell the AR glasses information relating to shape, orientation, size and location in the real world.",
    "The patent image above shows a device with these markers littered around its edges, and give an idea of how these markers would help an AR headset orient its digital overlays onto an object like a smartphone or tablet.",
    "It's clear that Apple is thinking about how its augmented reality ideas will work across devices. Apple is always keen that its devices form part of an ecosystem where owning more than one Apple device (and buying them) proves beneficial to the functionality of the other.",
    "What's not discussed in the patent, though could be just as useful, is the use of similar markers on other real world objects. While Apple's AR image recognition and location database would intersect to retrieve information for an AR glasses wearer, markers could be used to highlight points of interest where image recognition or location data isn't as readily available.",
    "The rumor mill has been churning out Apple AR glasses details for years, but it's looking increasingly likely that we're going to see some sort of official reveal of them pretty soon now. Even the WWDC 2021 invite seemed to hint at their existence, so be ready to see some more on the specs soon."
  ],
  "headers": {
    "3": "Inter-device AR features"
  },
  "links": {
    "Apple AR glasses": "https://www.techradar.com/news/apple-glasses",
    "10,969,600": "http://patft.uspto.gov/netacgi/nph-Parser?patentnumber=10,969,600",
    "Patently Apple": "https://www.patentlyapple.com/patently-apple/2021/04/apple-has-won-a-patent-for-allowing-future-apple-glasses-to-be-able-to-read-invisible-markers-placed-real-world-objects.html",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog"
  }
}