{
  "source": "https://www.techradar.com/news/intel-gamer-days-dollar900-off-gaming-laptop-deals-end-today-on-razer-alienware-and-more",
  "title": "Intel Gamer Days: $900 off gaming laptop deals end today on Razer, Alienware, and more",
  "category": "computing",
  "updated": "2021-08-27T13:29:18Z",
  "author": "alex-whitelock",
  "summary": "This event lasts 10 days but some deals are ending today",
  "article": [
    "The Intel Gamer Days event has launched today, and with it, a ton of excellent gaming laptop deals at Amazon, Newegg, Best Buy, and other leading retailers.",
    "We've been excitedly rummaging through the various listings today, and so far, our top picks are this gorgeous RTX 2070 Razer Blade 15 for $1,399.99 (was $2,299.99) and this great RTX 3060-equipped MSI GF65 for $919.99 (was $1,099.99). Huge savings aside, both of these are listed at the lowest prices we've seen yet and are the best bang-for-the-buck gaming laptop deals you'll find in the mid to upper price brackets right now.",
    "Amazon's gaming laptop deals on Razer machines are ending today - so don't leave it too long if you're interested in these stunning, premium machines.",
    "While those are our two top picks for today's Intel Gamer Days gaming laptop deals, you'll find a few more worthy additions just down below with full savings, specs, and our thoughts on each machine. The Intel Gamer Days event also lasts for 10 days, so we'll be sure to update this page if we spot any more worthy picks.",
    "Before you jump in, know that most of these machines are pretty pricey indeed. Most are from premium brands like Razer and Alienware and are packing the latest Nvidia RTX graphics cards. While you'll definitely get some rather slick aesthetics and more power than you could ever need with these machines, those on a budget should see our page on this week's best cheap gaming laptop deals.",
    "Also, while you're here, why not read our page on the upcoming Labor Day sales - an event that's sure to have plenty to check out for gamers."
  ],
  "headers": {
    "5": "More Intel Gamer Days sales and links"
  },
  "links": {
    "for $1,399.99 (was $2,299.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FRazer-i7-9750H-Aluminum-Lighting-Thunderbolt%2Fdp%2FB08D1H19G9%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4139998824855907300-20",
    "for $919.99 (was $1,099.99)": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-9970187315248185000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fmsi-gf65-15-6-144hz-gaming-laptop-intel-core-i5-nvidia-geforce-rtx3060-512gb-ssd-8gb-memory-black%2F6456144.p%3FskuId%3D6456144&article_name=Intel%20Gamer%20Days%3A%20%24900%20off%20gaming%20laptop%20deals%20end%20today%20on%20Razer%2C%20Alienware%2C%20and%20more&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fintel-gamer-days-dollar900-off-gaming-laptop-deals-end-today-on-razer-alienware-and-more",
    "best cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020"
  }
}