{
  "source": "https://www.techradar.com/news/pure-electrics-cool-dutch-style-e-bikes-are-some-of-the-cheapest-weve-seen",
  "title": "Pure Electric's cool Dutch-style e-bikes are some of the cheapest we've seen",
  "category": "fitness",
  "updated": "2021-10-04T13:43:01Z",
  "author": "cat-ellis",
  "summary": "Sit up and pay attention",
  "article": [
    "Pure Electric sells some of the best electric bikes and best electric scooters around, and it's now expanded its range with a pair of Dutch-style step-through e-bikes to take the sweat out of short city hops.",
    "The Pure Free City and Pure Free Step come hot on the heels of the Pure Flux One, which was the company's first own-brand e-bike. The Flux One was a stylish e-bike with a simple, clean design and straightforward controls – all for a bargain price – and the two new models are more of the same.",
    "The difference is that while the Flux One has a lightweight step-over frame, the Free City and Free Step are sturdier step-through models that are more suited to carrying heavy loads than threading their way through traffic.",
    "The Pure Free City is marketed as a 'unisex' bike, and will suit riders between 5'2\" and 6'1\" tall. It has mud and chain guards to protect your clothing from dirt and oil, plus built-in lights that run from the main battery for visibility at night and in poor weather conditions.",
    "Whereas most e-bike batteries are mounted on the down tube, the Pure Free City's power pack is tucked neatly inside the rear pannier rack. It can be easily removed, or charged while still on the bike, and has a maximum range of 28 miles. That's relatively short (even budget e-bikes can usually keep running for around 40 miles), but shouldn't be an issue for the type of city riding the Free City is built for.",
    "At 21kg it's fairly heavy, but again that's something we'd expect from a Dutch-style e-bike. If you're looking for something you can hoist onto your shoulder and carry around, take a look at the Pure Flux One instead.",
    "The Pure Free Step isn't marketed as specifically for women, but that's who Pure seems to be targeting judging by its photos. Its white-painted frame will suit riders between 5'1\" and 6'0\", and is fitted with a large front basket for groceries and other cargo. You can also attach panniers on the rear for extra carrying capacity.",
    "Like the Pure Free City, it's equipped with a chain guard and mud guards, plus integrated lights that run from the rear-mounted battery. Its range is also 28 miles.",
    "Both bikes have an upright riding position for good visibility in traffic, with high handlebars and ergonomic grips.",
    "The two also share a price tag: £999 (about $1,400 / AU$1,900) direct from Pure. You can certainly find Dutch-style e-bikes for less, but not from companies as well established, with such good after-sales service. We're hoping to test one (or both) of the new bikes and bring you a full review soon."
  ],
  "headers": {
    "3": "Free and easy"
  },
  "links": {
    "best electric bikes": "https://www.techradar.com/best/electric-bike",
    "best electric scooters": "https://www.techradar.com/best/best-electric-scooters",
    "Pure Free City": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-4434577530578747400&p=https%3A%2F%2Fwww.pureelectric.com%2Fcollections%2Felectric-bikes%2Fproducts%2Fpure-free-city-unisex-electric-hybrid-bike",
    "Pure Free Step": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-7631769461461047000&p=https%3A%2F%2Fwww.pureelectric.com%2Fcollections%2Felectric-bikes%2Fproducts%2Fpure-free-step-electric-hybrid-bike",
    "Pure Flux One,": "https://www.techradar.com/reviews/pure-flux-one",
    "Pure Flux One": "https://www.techradar.com/reviews/pure-flux-one",
    "direct from Pure": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-1108524282978311400&p=https%3A%2F%2Fwww.pureelectric.com%2Fcollections%2Felectric-bikes%2Fproducts%2F"
  }
}