{
  "source": "https://www.techradar.com/news/amazon-kindle-vs-kindle-paperwhite",
  "title": "Amazon Kindle vs Kindle Paperwhite: is it worth spending more?",
  "category": "tablets",
  "updated": "2021-07-20T13:05:31Z",
  "author": "james-rogerson",
  "summary": "An ereader showdown",
  "article": [
    "There are a few different Amazon Kindle ereaders to choose from, and while each of them is great for reading, they've all got different features.",
    "But which one to choose? If you’re not after an all-out deluxe flagship of an ereader then really it comes down to either the basic Amazon Kindle or the Amazon Kindle Paperwhite.",
    "These two reading machines have plenty in common, but there are a number of key differences as well. We’ve highlighted these below, so you can make the right reading choice.",
    "When it comes to the design of these two devices there isn’t a huge amount of difference. In fact, the most obvious difference is potentially just the color, as while both ereaders come in black, the basic Amazon Kindle is also available in white, whereas the Kindle Paperwhite doesn’t give you any color choice - though both models have a selection of colorful cases available for them.",
    "Otherwise, the look is similar, with both sporting a fairly plain plastic body and large bezels around the screen. In the Kindle Paperwhite’s case though those bezels are flush with the screen, whereas they’re raised on the basic Kindle. This leads to the Paperwhite looking and feeling slightly higher end.",
    "Dimensions and weight also differ between the two, with the Amazon Kindle coming in at 160 x 113 x 8.7mm and 174g, while the Kindle Paperwhite is 167 x 116 x 8.2mm and 182g (or 191g if you opt for a version with cellular connectivity). So the Paperwhite is slightly taller, wider and heavier but not quite as thick.",
    "The Amazon Kindle Paperwhite also comes with water resistance. It’s IPX8 rated, meaning it can survive being submerged up to 2 meters deep in fresh water for up to 60 minutes. So you can safely read on the beach or in the bath. The basic Kindle comes with no such reassurances.",
    "In terms of buttons and ports, both have a power button and micro USB port on the bottom edge, and that's it. Everything else is handled by the touchscreen. It's a shame there's no USB-C port on either model, but even the Kindle Oasis lacks that.",
    "Both the Amazon Kindle and the Amazon Kindle Paperwhite have a 6-inch display, and in both cases it’s designed to be glare-free. The main difference is how sharp it is, as while the basic Kindle’s screen is 167 pixels per inch, the Paperwhite is 300 pixels per inch, so text looks crisper and closer to how it would appear printed on paper.",
    "The difference is most noticeable when reading comics and the like though. If you’re just looking at text the higher resolution won’t usually make a big difference.",
    "Both screens also have a front light, so you can read in the dark without needing an external light source, but the Paperwhite’s can get brighter, as it uses 5 LEDs, while the basic Amazon Kindle uses 4.",
    "There are two main differences in the specs of these ereaders. The first is that the Amazon Kindle Paperwhite comes with far more storage, as you can get it with 8GB or 32GB, while the basic Amazon Kindle only comes with 4GB.",
    "This needn’t be a major problem, since ebook files are usually tiny and if you’re buying from Amazon they can be stored in the cloud when you’re not actively reading them anyway.",
    "However, the storage space becomes more of a concern if you plan to listen to audiobooks through Audible. That’s a feature both ereaders support, but it’s far more viable on the Paperwhite - though arguably a smartphone is a better choice for this than either of them.",
    "The other major difference is that as well as Wi-Fi you can get the Kindle Paperwhite in a Wi-Fi and cellular flavor (with free 3G and 4G connectivity), whereas the basic Kindle only supports Wi-Fi.",
    "For most people this again shouldn’t be a big deal, but cellular data does mean you can buy and download books any time, anywhere, whereas you’re a bit more limited with just Wi-Fi.",
    "Most other things are similar or the same, including their software and battery life, with both models offering weeks of life on a single charge with typical usage.",
    "The Amazon Kindle starts at £69.99 / $89.99, but that’s a version with adverts on the lock screen. If you’d rather not have adverts you’ll have to pay £79.99 / $109.99. In Australia you can only get a version without adverts, which costs AU$139.",
    "The Amazon Kindle Paperwhite on the other hand starts at £119.99 / $129.99 for the 8GB Wi-Fi version with adverts, but there are more options here.",
    "For £129.99 / $149.99 / AU$199 you can get the same version without adverts, while for £149.99 / $159.99 you can get a 32GB Wi-Fi model with adverts, and for £159.99 / $179.99 / AU$249 you can get that one without them. As before, Australia only has the ad-free versions.",
    "At the top end there’s a 32GB cellular version for £219.99 / $249.99 / AU$369 - there’s no option to get this one with adverts.",
    "While those are the standard prices, at the time of writing Amazon sells these ereaders at a discount in the US and UK, which brings the starting price down to $59.99 / £59.99 for the Amazon Kindle, and $84.99 / £84.99 for the Kindle Paperwhite. It's not clear whether these price cuts are permanent or not though.",
    "In any case, the Amazon Kindle Paperwhite is substantially more expensive, starting at close to twice the basic Kindle’s price before discounts.",
    "The Amazon Kindle Paperwhite is quite a lot more expensive than the basic Amazon Kindle, but it’s still reasonably affordable and comfortably undercuts the likes of the Kindle Oasis.",
    "The extra money that you’d have to spend for the Paperwhite gets you a sharper screen, more storage, a slightly higher-end design, water resistance, a better front light, and potentially cellular connectivity. Whether those things are worth it will largely depend on when, where, what and how much you plan to read."
  ],
  "headers": {
    "3": "Amazon Kindle vs Kindle Paperwhite design",
    "8": "Amazon Kindle vs Kindle Paperwhite display",
    "11": "Amazon Kindle vs Kindle Paperwhite specs",
    "17": "Amazon Kindle vs Kindle Paperwhite price",
    "23": "Takeaway"
  },
  "links": {
    "Amazon Kindle": "https://www.techradar.com/reviews/amazon-kindle-review",
    "Amazon Kindle Paperwhite": "https://www.techradar.com/reviews/amazon-kindle-paperwhite-2018-review",
    "Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review"
  }
}