{
  "source": "https://www.techradar.com/news/ps5-restock-in-the-us-walmart",
  "title": "PS5 restock disaster at Walmart turned into a $100 discount – what it means for you",
  "category": "gaming",
  "updated": "2021-08-30T09:10:36Z",
  "author": "matt-swider",
  "summary": "Our PS5 restock Twitter tracker Matt Swider has helped over 58,000 people find a next-gen console in stock – and he sent out an alert for the PS5 Digital stock that Walmart fulfilled as PS5 Disc for $100 less than MSRP.",
  "article": [
    "Update: The Walmart PS5 restock date is likely next, and 24/7 PS5 restock Twitter tracker Matt Swider will send you an alert when the PS5 is in stock this week – if you follow his account and turn on notifications. This restock news comes one month (and two days) after Walmart botched a PS5 Digital restock (sold at the MSRP of $399) that forced the top US retailer to offer customers PS5 Disc (a $499 value) for free. Our PS5 restock tracking has detected most Matt Swider Twitter followers have now gotten the upgraded PlayStation 5 console from Walmart.",
    "What does that mean for you today? While it may not offer you the same perk, it's a good sign of an impending Walmart PS5 restock date and our next alert. ► Exactly when? Follow our PS5 restock Twitter tracker Matt Swider and turn on notifications for restock news. It's the fastest way to get PS5 restock updates.",
    "► Don't buy from other Twitter users – which are all scams. Only buy from the US stores Matt alerts you about. No one will legitimate sell a PS5 for just $550.",
    "Click on this example above of a Walmart PS5 restock alert sent by Matt Swider. Another alert will be sent to his 782,500 Twitter followers when the Walmart PS restock happens. Be sure to follow and turn on notifications (it's that little bell icon).",
    "The Walmart PS5 restock date is likely this week, specifically on July 22 at 3pm EDT, as the No. 1 retailer in the US has favored restocking the Sony console on a Thursday in 2021 and has mostly stuck to that time. It's rarely done a different date and time.",
    "It's important to follow PS5 restock Twitter tracker Matt Swider in case Walmart does deviate from that date and time. But with so many people getting the disastrous PS5 restock from June 17, it's a sign that Walmart is ready with either PS5 Disc, PS5 Digital or both consoles, as it has had over a month to build up inventory.",
    "Here's another example of a PS5 restock alert we sent out before today.",
    "We chronicled the Walmart PS5 restock disaster news on June 17 and the days after, which left the American retailer scrambling to fulfill the PS5 Digital consoles that cost $399 with PS5 Disc, which has a higher price of $499, and doing it all at no cost to the customers. Not everyone that was part of this Walmart restock got the upgrade (those who still ended up with PS5 Digital got their orders faster), but it seems like thousands did benefit, including many of the followers of Matt Swider.",
    "An official Walmart email was sent shortly after the PS5 restock from Walmart Chief Customer Officer Janey Whiteside apologizing for the \"mix-up\" and alerting buyers to the fact that they'd be getting the PS5 Disc upgrade – for free. No one complained.",
    "What does this mean you for? We don't expect Walmart to make the same mistake again with the next PS5 restock, but if you're eager to find PS5 in stock, the fact that we can confirm that most prior orders have been fulfilled is an indicator that the next PS5 restock date at Walmart is imminent.",
    "There's a logical explanation on how the Walmart PS5 restock remedy was pulled of so quickly: it owns Sam's Club, which has a PS5 Disc restock (in bundle form) a few hours later that night. Some of the PS5 Disc inventory was likely diverted to help out Walmart when the mix-up was detected. The part company did have the more expensive PS5 console, but it was saving them for Sam's Club bundles originally.",
    "Here's another good sign that there's likely to be a PS5 restock this week: Walmart had a small, but still valid PS5 Disc bundle restock at Walmart-owned Sam's Club this past Thursday close to 1am EDT (the usual time for the club retailer). If one of the Walmart store outlets has PS5 console inventory, its main channel should too.",
    "New PS5 restock dates may be few and far between this week, according to our PS5 restock tracker Matt Swider. Best Buy has had three PS5 restock dates in the last month, Sony Direct had a virtual queue last week but dialed things back to once a month recently, and small stores like Antonline had two PS5 restocks last week.",
    "There's a Best Buy RTX GPU in-store restock tomorrow, Target has been taking three weeks to restock the Sony console, and GameStop has a massive PS5 restock on Thursday, often next restocking every seven to 15 days.",
    "That means the Walmart PS5 restock is the one to pay attention to this week, and we'll be tracking the PlayStation 5 to add to the 58,000 helped so far."
  ],
  "headers": {
    "4": "Walmart PS5 restock date and time likely this week",
    "7": "PS5 restock disaster: what happened, what it means",
    "10": "Walmart PS5 Disc restock: where did the extra consoles come from?",
    "12": "Walmart PS5 restock: your best choice this week"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "Follow our PS5 restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "Best Buy RTX GPU in-store restock": "https://www.techradar.com/news/best-buy-stores-nvidia-rtx-3080-in-stock-date-and-time"
  }
}