{
  "source": "https://www.techradar.com/news/sony-wf-1000xm4-vs-sony-wf-1000xm3-should-you-buy-the-latest-model-or-save-your-money",
  "title": "Sony WF-1000XM4 vs WF-1000XM3: should you buy the latest model or save your money?",
  "category": "audio-visual",
  "updated": "2021-06-28T11:22:23Z",
  "author": "nick-pino",
  "summary": "The Sony WF-1000XM4 offer better noise cancellation and upscaled audio resolution",
  "article": [
    "Not sure whether to buy the new Sony WF-1000XM4 or save some money by picking up the older Sony WF-1000XM3? Well, we can help. We’ve spent time with both of Sony’s true wireless earbuds and can safely say which of the two are worth your money.",
    "What makes it tough is that, if you had asked us six months ago before we knew about the Sony WF-1000XM4, we would’ve told you that the WF-1000XM3 were honestly the best true wireless earbuds on the market. Now, things are less clear.",
    "What the Sony WF-1000M4 offer is superior noise cancellation technology thanks to the new Integrated Processor V1 that replaces the QN1 noise-cancelling processor in the WF-1000XM3, plus Sony’s DSEE Extreme software that better upscales low-resolution audio files.",
    "In addition to those top line features, the WF-1000M4 have slightly better battery life (eight hours vs six hours per charge) and an IPX4 water-resistant rating that make them better for bringing with you to the gym. Last but not least, they’re smaller and use new eartips that conform to the shape of your ear canal and feel more comfortable during longer listening sessions.",
    "So, is the Sony WF-1000XM4 the better choice? Not always. They’re over $100/£100 more, and that’s led a lot of people to wonder if it’s worth upgrading to the WF-1000XM4, or if they should simply stick to the cheaper WF-1000XM3 from 2019.",
    "The choice will be different for everyone. But, to help you understand which model is right for you, we’ve broken down the key differences below.",
    "Of all the reasons to step up to the Sony WF-1000XM4, better noise cancellation is one of the biggest. Thanks to the new Integrated Processor V1, the WF-1000XM4 is able to drastically reduce incoming noise in nearly every audible frequency range. That means you’ll hear less engine noise while flying and less noise while sitting at your desk in a busy office. There's also a new wind guard that makes the buds better at cancelling out ambient noise on a windy day – which is super handy, actually.",
    "In addition to the new processor, Sony includes new Noise Isolation Earbud Tips in the box that help achieve a more stable fit and offer better noise isolation than the previous model. They essentially feel like foam eartips and it’s likely you’ll be able to buy some off-brand ones for the WF-1000XM3 in the future, so they’re not the only reason to upgrade, but their addition is welcome to this year’s model.",
    "Of course, the other major reason to upgrade is the improved sound quality, largely thanks to the DSEE Extreme software that does a better job taking lower-quality audio sources and upscaling them for playback. This is the same technology that we saw from the Sony WH-1000XM4 over-ear headphones last year, and it’s pretty effective at its job.",
    "In terms of the actual drivers, Sony is still using 6mm drivers on the WF-1000MX4, but it says that they’ve been fundamentally improved for better bass response. Having tested them, that definitely feels like it’s the case – however, don’t go in expecting overwhelming bass, as the sound profile is still relatively neutral overall.",
    "Speaking of sound quality, one technical advantage the WF-1000XM4 will have over the WF-1000XM3 is the addition of Sony’s LDAC codec that supports streaming of up to 990kbps – roughly three times the speed of the standard SBC codec.",
    "That extra bandwidth can help the WF-1000XM4 come a bit closer to true hi-res audio status (though they’re not quite there yet) and will make your music sound more detailed than it would if you were listening to it through the WF-1000XM3. That said, you do need to make sure you have an Android device that supports LDAC first. (Sorry, iPhone owners, not you.)",
    "It’s not a huge difference, but the Sony WF-1000XM4 have a slightly longer battery life than the WF-1000XM3 by about two hours per charge. Sony says the WF-1000XM4 should last about eight hours per charge compared to the six hours of the WF-1000XM3 – however the case itself still only holds 24 hours of battery life.",
    "What does that mean for you? You can go a full day at work with them on, but be prepared to charge them every few days.",
    "Another small difference is that the WF-1000XM4 are water-resistant. An IPX4 rating means that the WF-1000XM4 can resist a splash of water, and typically means that they’re safe to bring with you to the gym. Having tested them at the tail-end of the Covid-19 pandemic, we didn’t have the chance to hit the gym with them ourselves, but the protection is fairly standard and should hold up through a spot of rain.",
    "That being said, neither of the two earbuds are fully waterproof – unlike the Samsung Galaxy Buds Pro that have an IPX7 rating – so be sure to keep them away from the pool lest they fall in and can’t be recovered.",
    "If size matters to you, the WF-1000XM4 are significantly smaller than the WF-1000XM3. According to Sony, it’s about a 10% difference in size for the earbuds and a whopping 40% reduction for the charging case. That means it’s easier to carry them around in your pocket without them taking up a lot of space and they might feel a little more comfortable inside your ear.",
    "If you like to be on the cutting-edge of tech, the new WF-1000XM4 case supports wireless charging via a Qi charger. We had one on hand from our recent review of the Amazon Echo Buds (2nd Gen) and found that it worked moderately well for the WF-1000XM4, too. It does seem to take a bit longer charging them this way, but it was convenient putting them on the charging pad every night instead of trying to track down the included USB-C charging cable.",
    "OK, so here’s the primary reason not to jump on the new Sony WF-1000XM4: at launch they’re going to be $279 / £250 / AU$449.95. That’s $100 / £100 / AU$250 more than what the current WF-1000XM3 is selling for at places like Amazon. When you consider that the WF-1000XM3 are only going to fall to lower and lower prices over the next few months, and well, it becomes really tough to choose between two pretty great true wireless earbuds.",
    "The other problem with the WF-1000XM4’s price is that there are other really good earbuds out there that offer many of the same features for a lot less money. For example, there’s the new Amazon Echo Buds (2nd Gen) that offer noise cancellation for just $129, and even the relatively pricey AirPods Pro are cheaper at $199 / £199 / AU$399 at most places. We'll have a complete Apple AirPods Pro vs Sony WF-1000XM4 guide up soon for a complete comparison, but you can see how there are savings to be had if you’re willing to cut out a few features.",
    "At this point it may seem like there’s nothing redeeming about the WF-1000XM3 while the WF-1000XM4 are some sort of true wireless noise-cancelling prodigies sent from the audio gods themselves – but nothing could be further from the truth. The Sony WF-1000XM3 spent the last two years at the top of our list of the best true wireless earbuds – and they’ll still have a spot pretty high up on that list now that the WF-1000XM4 are here.",
    "That’s because, at the most fundamental level, these earbuds offer the same things. They both offer some level of audio upscaling and noise cancellation, as well as decent battery lives and comfortable designs that allow you to wear them for long periods of time. They both do those things better than nearly any other true wireless earbuds out there and use the same app, so really you wouldn’t go wrong buying either one, especially if money’s tight.",
    "Without knowing your specific situation, it’s hard for us to say. But if you’re someone who needs particularly strong active noise cancellation or you’re looking for better audio quality because you care deeply about what your songs sound like, then you’re probably better off paying the extra money for the Sony WF-1000XM4.",
    "However, if you just want some level of noise cancellation and audio upscaling, and you don’t need all the fancy extras like wireless charging and LDAC, then you can probably save a bunch of money by buying the older WF-1000XM3. They’re still darn good earbuds – some of the best, honestly – so there’s no shame in picking them up to save some cash.",
    "Of course, we suggest you read our Sony WF-1000XM4 review and our Sony WF-1000XM3 review to learn even more about them, but hopefully you know a bit more now than you did five minutes ago."
  ],
  "headers": {
    "6": "Difference #1: The noise cancellation is better on the Sony WF-1000XM4",
    "8": "Difference #2: The sound quality is better on the Sony WF-1000XM4",
    "10": "Difference #3: The Sony WF-1000XM4 support LDAC for Hi-Res Audio Wireless",
    "12": "Difference #4: The Sony WF-1000XM4 have a slightly longer battery life",
    "14": "Difference #5: The Sony WF-1000XM4 are IPX4 water-resistant",
    "16": "Difference #6: The WF-1000XM4 buds and charging case are smaller",
    "17": "Difference #7: The WF-1000XM4 support wireless charging",
    "18": "Difference #8: The WF-1000XM4 are significantly more expensive",
    "20": "Are there any similarities between the WF-1000XM4 and WF-1000XM3?",
    "22": "So which one should you buy?"
  },
  "links": {
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Amazon Echo Buds (2nd Gen)": "https://www.techradar.com/reviews/amazon-echo-buds-2nd-gen",
    "Sony WF-1000XM4 review": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Sony WF-1000XM3 review": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}