{
  "source": "https://www.techradar.com/news/nvidia-could-be-about-to-hit-amd-hard-with-launch-of-rtx-3080-ti-and-3070-ti-gpus",
  "title": "Nvidia could be about to hit AMD hard with launch of RTX 3080 Ti and 3070 Ti GPUs",
  "category": "computing",
  "updated": "2021-03-22T10:10:02Z",
  "author": "darren-allan",
  "summary": "Nvidia GeForce RTX 3080 Ti rumored to arrive in April, followed by 3070 Ti in May",
  "article": [
    "Nvidia’s RTX 3080 Ti graphics card could arrive in April, followed by the RTX 3070 Ti in May, going by the latest from the rumor mill.",
    "This comes from VideoCardz which has its ear to the ground and has spilled the latest details from its sources, which include the assertion that the configuration of the 3080 Ti has changed slightly – though it’s not sure what the ramifications might be.",
    "Bearing in mind that this is all speculation – so certainly be skeptical around the details provided – the RTX 3080 Ti is apparently now set to use Nvidia’s GA102-225 GPU, rather than the previously rumored GA102-250.",
    "Not to worry, though, because this switch reportedly doesn’t affect the purported CUDA core count of 10,240, so it’s not clear exactly what the change will mean at all. Apparently, some initial info on the 3080 Ti has already gone out from Nvidia to graphics card makers (under embargo), and the insistence remains that this GPU will be paired with 12GB GDDR6X memory (as per previous speculation, meaning it won’t have 20GB which was the thinking when rumors of the 3080 Ti first emerged).",
    "The marketing kit (with full spec details) for the 3080 Ti is supposedly set for distribution to card manufacturers early in April, ahead of a later launch in the same month for the GPU. Previous word from the grapevine was a mid-April launch, so this is presumably still looking like the most probable timeframe; but we should see the 3080 Ti at some point next month, theoretically (and we could see more leakage imminently, of course).",
    "As for the RTX 3070 Ti, VideoCardz believes that this GPU will follow with a current launch timeframe of the end of May. This card will apparently employ the GA104-400 GPU with 6,144 CUDA cores, but only 8GB of video memory (albeit GDDR6X).",
    "The latter point is interesting, because the previous chatter from the rumor mill pegged the GPU as carrying 16GB of VRAM. While that might seem odd – being double the 3070’s loadout, and indeed more than the above rumored 3080 Ti – we’ve seen Nvidia load up the RTX 3060 with 12GB of VRAM, so it’s not beyond the realms of possibility (though the 3060’s VRAM isn’t speedy in terms of the memory bus compared to Nvidia’s higher-tier products which have less on-board RAM).",
    "Looking at the purported 3080 Ti, though, 8GB for the 3070 Ti could well be a more likely prospect, as this new rumor claims. Also, note that it would be faster memory in this case (the vanilla RTX 3070 uses GDDR6, not GDDR6X).",
    "Naturally, this is all still very much up in the air, but whatever the configuration of the RTX Ti variants – if indeed these fresh spins on the 3080 and 3070 are inbound as suggested – actually buying one, or indeed any Ampere graphics card in the near future, is likely to be a serious struggle.",
    "With production woes and stock shortages meaning that Nvidia’s RTX 3000 products are selling out in a flash, it’s a frustrating time for GPU buyers – particularly seeing as AMD’s RX 6000 range is in the same boat. And the latest gossip is that Nvidia’s stock problems will continue until Q3 of this year (in other words, at least July)."
  ],
  "headers": {
    "5": "VRAM predictions"
  },
  "links": {
    "VideoCardz": "https://videocardz.com/newz/nvidia-geforce-rtx-3080-ti-to-feature-ga102-225-gpu-rtx-3070-ti-gets-ga104-400",
    "as per previous speculation": "https://www.techradar.com/news/nvidia-rtx-3080-ti-gpu-could-arrive-in-april-with-12gb-vram",
    "rumors of the 3080 Ti first emerged": "https://www.techradar.com/news/nvidia-rtx-3080-ti-leak-suggests-a-powerful-gpu-with-20gb-of-vram-to-take-on-amd-big-navi",
    "Previous word from the grapevine was a mid-April launch": "https://www.techradar.com/news/nvidia-rtx-3080-ti-gpu-could-go-on-sale-mid-april-aiming-to-combat-crypto-miners",
    "carrying 16GB of VRAM": "https://www.techradar.com/news/the-nvidia-rtx-3070-ti-might-actually-release-after-cancellation-rumor",
    "3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "stock problems will continue until Q3 of this year": "https://www.techradar.com/news/nvidia-rtx-3080-shortage-could-continue-until-q3"
  }
}