{
  "source": "https://www.techradar.com/news/f1-tv-on-apple-tv",
  "title": "F1 TV on Apple TV: is it available and other options",
  "category": "entertainment",
  "updated": "2021-06-29T14:33:07Z",
  "author": "nikshep-myle",
  "summary": "Can the Apple TV device give you easy access to Formula 1 action?",
  "article": [
    "One of the most expensive sports in the world, Formula 1 has enthralled audiences for decades. And now, thanks to the online streaming industry boom, Grand Prix are widely accessible to watch - especially with the growth of F1 TV.",
    "In this article, we look at what the service is, where you can get it, whether you can install F1 TV on Apple TV and how it can make getting an F1 live stream of every practice, qualifying and race even easier.",
    "F1 TV is Formula 1's official OTT streaming service, and it offers two subscription plans to users. With the standard plan, F1 TV Access, you can view full race replays, highlights, F1’s historic race archives, and more. The premium plan, F1 TV Pro, has the features of F1 TV Access, and you will have live access to the track sessions for all the GPs.",
    "Both plans give you access to the F1 onboard cameras, so you can switch between the live feed and any of the cameras onboard the 20 cars. The camera switching is active even on race replays. You will also be able to watch exclusive documentaries and live shows produced for F1 TV.",
    "F1 TV is available in over 100 countries, including the US, France, South Africa, and Brazil. But in countries like the UK and Germany, the F1 TV Pro plan is not available due to existing commercial agreements.",
    "In the US, an F1 TV Access subscription will cost $26.99 per year at the time of writing. An F1 TV Pro subscription is more expensive at $79.99, but it does come with a seven-day free trial.",
    "Unfortunately, F1 TV on Apple TV is currently not available.",
    "According to Formula 1, F1 TV for Apple TV, Amazon Fire TV, and Android TV devices is still in development and will be rolled out later in 2021.",
    "As of now, F1 TV is available on browsers, mobiles, and tablets.",
    "You can view it on your computer with web browsers like Google Chrome and Microsoft Edge, but F1 TV doesn't provide support for Samsung Internet, UC Browser, and Opera (though some features may work correctly on these browsers). You also can’t use mobile or tablet browsers to stream F1TV.",
    "You can watch F1 TV with Chromecast and Apple Airplay, but you can only cast from your laptop’s web browser, not from your phone or tablet’s F1 TV app. Support for casting from mobile and tablet apps will be launched later in 2021.",
    "To run on Android mobile and tablet, you need to be on Android OS 7 and above. On iPhone and iPad, you need iOS 10 and above, and on Amazon Fire tablet, you must be running OS 7 and above. You can learn more on our dedicated guide to getting F1 TV on Android and iPhone.",
    "Lastly, on Roku devices, you will need 3900x and above.",
    "Like the sound of F1 TV? Head to the website now, sign up and start watching!"
  ],
  "headers": {
    "2": "What is F1 TV?",
    "6": "Is F1 TV on Apple TV?",
    "8": "What other devices can I watch F1 TV on?"
  },
  "links": {
    "F1 TV": "https://www.techradar.com/news/f1-tv-explained-cost-devices-free-trial",
    "F1 live stream": "https://www.techradar.com/news/f1-live-stream-2021-how-to-watch-every-grand-prix-online",
    "the standard plan, F1 TV Access": "https://prf.hn/click/camref:1011liQxs/pubref:trd-us-1238178626029696800/destination:https%3A%2F%2Fwww.formula1.com%2Fen%2Fsubscribe-to-f1-tv.html%23en-US",
    "premium plan, F1 TV Pro": "https://prf.hn/click/camref:1011liQxs/pubref:trd-us-1008982972032932400/destination:https%3A%2F%2Fwww.formula1.com%2Fen%2Fsubscribe-to-f1-tv.html%23en-US",
    "a seven-day free trial": "https://prf.hn/click/camref:1011liQxs/pubref:trd-us-4417383673560716300/destination:https%3A%2F%2Fwww.formula1.com%2Fen%2Fsubscribe-to-f1-tv.html%23en-US",
    "Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "F1 TV on Android and iPhone": "https://www.techradar.com/news/f1-tv-android-iphone-apps-phone-tablet",
    "Head to the website now": "https://prf.hn/click/camref:1011liQxs/pubref:trd-us-8669059478692531000/destination:https%3A%2F%2Fwww.formula1.com%2Fen%2Fsubscribe-to-f1-tv.html%23en-US"
  }
}