{
  "source": "https://www.techradar.com/news/dunes-release-on-hbo-max-is-reportedly-being-reconsidered",
  "title": "Dune’s release on HBO Max is reportedly being reconsidered",
  "category": "entertainment",
  "updated": "2021-04-06T03:36:22Z",
  "author": "stephen-lambrechts",
  "summary": "Godzilla vs. Kong success could mean revised release plans",
  "article": [
    "Warner Bros. is reportedly reconsidering its simultaneous theatrical and streaming release plan for the star-studded sci-fi epic Dune, according to a new report from Deadline.",
    "The report suggests that Warner Bros. remains undecided about Dune's release approach, citing the monstrous theatrical success of Legendary Entertainment's Godzilla vs. Kong as a contributing factor.",
    "Godzilla vs. Kong raked in an enormous $48.5 million at the domestic box office over the Easter long weekend, so far earning $285.8 million globally, making it by far the biggest theatrical hit since the pandemic began – this despite its day-one availability on HBO Max.",
    "\"This movie represents a way for people to slowly re-introduce themselves into a social environment,\" said Josh Grode, CEO of Legendary Entertainment in a statement to Deadline.",
    "He continued, \"Heading back to movie theaters and learning we’re not going to get sick; it’s these steps we’re taking over the next two to three months to get back to the normalcy of life.\"",
    "Dune has been part of HBO Max's 'Same Day Premieres' slate since late last year, when it was announced that the studio's entire 2021 lineup would land on HBO Max and in theaters at the same time.",
    "The decision by Warner Media enraged Dune director Denis Villeneuve, who publicly criticized the move in an open letter to Variety, stating that \"Warner Bros.’ decision means Dune won’t have the chance to perform financially in order to be viable and piracy will ultimately triumph.\"",
    "That said, Warner Bros. has since indicated that it will update its release strategy beyond 2021, having already inked a deal with Regal Cinemas that would give the US theater chain an exclusive 45-day theatrical window for Warner Bros. films starting in 2022.",
    "At present, Dune is scheduled to arrive in theaters and on HBO Max on October 1, 2021. However, if Warner Bros. were to make a special concession for the film and provide it with that same 45-day release window, it might allow the film to earn enough money at the box office to make the Dune franchise commercially viable.",
    "Additionally, were Dune to be given this kind of release, it would not only please Villeneuve, it would also allow HBO Max to keep the film within its 2021 streaming lineup as originally promised."
  ],
  "headers": {
    "5": "Why delaying Dune's streaming release would be good"
  },
  "links": {
    "simultaneous theatrical and streaming release plan": "https://www.techradar.com/news/the-matrix-4-the-suicide-squad-and-dune-will-come-to-hbo-max-the-same-day-as-they-hit-theaters",
    "Dune": "https://www.techradar.com/news/dune-cast-release-date-trailer",
    "Deadline": "https://deadline.com/2021/04/godzilla-vs-kong-approaches-28-million-three-days-opening-1234726022/",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "publicly criticized the move": "https://www.techradar.com/news/hbo-max-could-kill-the-dune-franchise-says-director",
    "inked a deal with Regal Cinemas": "https://variety.com/2021/film/news/regal-cinemas-reopen-cineworld-godzilla-vs-kong-1234936229/"
  }
}