{
  "source": "https://www.techradar.com/news/who-is-the-best-james-bond-the-seven-007-actors-ranked-ahead-of-no-time-to-die",
  "title": "Who is the best James Bond? The seven 007 actors ranked ahead of No Time to Die",
  "category": "entertainment",
  "updated": "2021-09-29T13:37:49Z",
  "author": "samuel-roberts",
  "summary": "Which 007 comes out on top?",
  "article": [
    "Your pick for the best James Bond actor will depend on a few factors: when you were born, what you like in a Bond film, and how your version of 007 is supposed to behave.",
    "Is James Bond meant to be funny, romantic or violent? Does he make amusing remarks after killing a man, or is he wrestling with the loss of a loved one and never making jokes? Your mileage will vary, as the films have experienced some massive ups and downs over the past six decades when it comes to tone and style.",
    "Seven actors have played 007 in live action, and below we've ranked them based on points assigned by TechRadar's editors. Consider this a fun way to pass the time until No Time To Die (read our spoiler-free review first, though) releases on September 30 in the UK, and October 8 in the US.",
    "Doomed to sit at the bottom of these lists forever, David Niven was considered Ian Fleming's ideal James Bond – and he certainly looks and sounds the part in the spoof-like 1967 Casino Royale, where several actors play the role. As an older take on the character, he had a ton of potential and feels like a good fit for the 007 Fleming put on the page, but this wasn't the vehicle for it.",
    "A one-hit wonder, it's hard to argue that Lazenby is the best part of the single Bond movie he starred in – 1969's On Her Majesty's Secret Service features better turns from Telly Savalas as an intimidating Blofeld and Diana Rigg as Bond's doomed partner, Tracy di Vicenzo. Lazenby is charming and looks like Bond, but he's no Connery, even if the movie's notoriously bleak ending brings greatness out of him.",
    "Still, the Australian actor's association with that movie, which has grown in standing over time thanks to praise from the likes of Steven Soderbergh, means he's far from overlooked these days. Like Dalton, he makes you think of the subsequent Bond films that never were, but his legacy remains surprisingly tight almost five decades later.",
    "A sort of proto-Daniel Craig, Timothy Dalton's turn as James Bond results in two somewhat serious but mostly solid outings in The Living Daylights and License to Kill. Following the borderline-Carry On vibe of Roger Moore's films, Bond needed to get more dramatic again, and Dalton imbued the British spy with an intensity and romantic edge that made him memorable.",
    "The Living Daylights definitely looks and feels like a Bond movie, though License to Kill is more up for debate, instead having the violent flavor of an '80s action flick. It's just a shame he didn't get more movies to grow into the character.",
    "Roger Moore's Bond films are mostly synonymous with innuendo, silly comedy and preposterous side characters like Jaws and Sheriff John W. Pepper. This is an important era of James Bond as a pop culture figure, though, and Moore's films are raucously entertaining and full of great action when they're at their best. Yes, the tonal shifts go too far in the likes of Moonraker, but For Your Eyes Only is still one of the best Bond movies of all time. Moore definitely put his comical stamp on the character.",
    "Moore played Bond for 12 years next to Daniel Craig's 15, but was more prolific, starring in seven movies total. His age in the role became more obvious over time – he was 45 when he filmed Live and Let Die, and in his late 50s in A View to a Kill – but he was a great custodian of 007, and remains a decent choice for younger Bond fans getting into the series (the occasionally lewd jokes aside).",
    "Daniel Craig gave the film franchise the gritty reset it needed after Die Another Day – and over time, his version warmed up and got closer to the Bonds of old as the films brought in Q, gadgets and more humor. The Craig films are wildly inconsistent: you've got two duds in Quantum of Solace and Spectre, alongside two genuine classics in Casino Royale and Skyfall. We'll need to let the dust settle on No Time to Die before making a call on that one.",
    "Craig brings to the role a sort of cold masculinity and brutal physicality, landing the part after starring in the excellent British crime thriller Layer Cake. The films around Craig have formed a vague serialized plot, if not a satisfying one – but he's brought credible depth to 007, and will likely cast a long shadow on the role for decades to come.",
    "Who is the best James Bond? Ask any dad, and they'll probably say Sean Connery. That he ranks only second on our list shows how interest in 007 is generational, to a large extent, with fans opting for 'their' Bond rather than an objective choice based on the quality of the movies.",
    "Still, Connery makes a fine showing in our list, and why wouldn't he? Everything the role is now lives in the actor's shadow: the suaveness of it, the violence just below the surface, the wry humor. In some ways, Bond feels shackled by these elements, but it's also what makes him such an appealing movie icon. Connery's turns in Dr No, From Russia With Love and Goldfinger transformed Bond into an immortal silver screen hero, even if some parts of his movies inevitably don't stand the test of time.",
    "A great Bond with only a single classic movie to his name, Pierce Brosnan's passion for the role was obvious. He was a perfect '90s Bond, bringing humor back to the character along with charm and a terrific head of hair. The actor waited so many years to get the part – he initially missed out back in 1987, when a TV show contract for NBC's forgotten Remington Steele stopped him from becoming 007.",
    "His performance throughout his four movies is consistent, but the films are not. GoldenEye is a post-Cold War classic and a top five Bond movie, while Tomorrow Never Dies and The World is Not Enough are middling by comparison. Finally, Die Another Day means Brosnan is forced to bow out with a true dud, weighed down by product placement and silly imagery like an invisible car, which is a little unfair. You almost wonder what he'd have made of starring in Dalton's more dramatic and violent films. Either way, he remains our favorite.",
    "Side note: Brosnan's popularity among TechRadar's editors is surely, in part, driven by playing too much GoldenEye 007 on N64. We love that game."
  ],
  "headers": {
    "3": "7. David Niven",
    "4": "6. George Lazenby",
    "6": "5. Timothy Dalton",
    "8": "4. Roger Moore",
    "10": "3. Daniel Craig",
    "12": "2. Sean Connery",
    "14": "1. Pierce Brosnan"
  },
  "links": {
    "our spoiler-free review": "https://www.techradar.com/news/no-time-to-die-is-a-fitting-end-for-daniel-craigs-bond-but-its-no-skyfall",
    "films around Craig have formed a vague serialized plot": "https://www.techradar.com/news/daniel-craigs-james-bond-movies-are-serialized-but-they-dont-fit-together",
    "GoldenEye 007 on N64": "https://www.techradar.com/news/gaming/relive-the-greatness-of-goldeneye-with-this-hd-fan-made-remake-1326553"
  }
}