{
  "source": "https://www.techradar.com/news/major-open-source-projects-abandon-freenode-following-hostile-takeover",
  "title": "Major open source projects abandon Freenode following alleged \"hostile\" takeover",
  "category": "computing",
  "updated": "2021-06-21T11:22:08Z",
  "author": "mayank-sharma",
  "summary": "Mass Freenode exodus continues unabated",
  "article": [
    "Rey accuses Andrew Lee, the Crown Prince of South Korea and current owner of Freenode, of a \"hostile” takeover after allegedly rescinding his promise to not interfere with the operation of the network.",
    "Andrew Lee response:",
    "Andrew Lee refutes any allegations of “hijacking” or “hostile takeover” and claims he has no involvement in the operation of Freenode, unless his assistance is specifically requested. Legal representatives of Mr Lee and London Trust Media contacted Techradar on 17 June 2021 and provided the following comment:",
    "\"Beginning in or about March 2021, Freenode’s volunteer staff attempted to seize control of the Freenode network from Mr. Lee and London Trust, the publicly known owner of Freenode since April 1, 2017, not the other way around. After Mr. Lee successfully defeated those attempts, the staff created a competing network, Libera Chat, and attempted to persuade existing users to leave Freenode and join their new network. Such actions were in direct violation of Freenode’s existing off-topic use policy.",
    "To address the escalating situation and prevent further issues down the line, Freenode modified the existing policy to provide further elaboration. Prior to the implementation of the new policy, which necessitated certain closures of channels that were already technically “closed” and simply being utilized as billboards, Freenode posted a draft policy revision and solicited feedback from the community for 48-hours in #freenode-policy-feedback. After some channels were erroneously included during the enforcement of the policy, Mr. Lee publicly acknowledged and apologized for the error. These efforts were not part of any purported “hijack[ing]” or “hostile takeover” of Freenode by Mr. Lee. In fact, the opposite is true. They were made in response to reports of increased spamming, the disruption of certain users’ ability to chat on Freenode, and to protect the Freenode community.",
    "The (now) former Freenode staffers orchestrated a public campaign, which included coordinated resignation letters, to falsely paint Mr. Lee an outside corporate raider that was attempting a hostile takeover of Freenode and exposing users’ private data. Nothing could be further from the truth.",
    "Mr. Lee did not have any involvement in the operation of Freenode unless he was asked for assistance, did not issue any gag orders to Freenode staffers, and did not commandeer hundreds of Freenode channels to effectuate a “hostile takeover.” Mr. Lee has acted legally and in Freenode’s best interests at all times.\"",
    "TechRadar Pro has reached out to Libera Chat and José Antonio Rey for comment and will update this story further as it unfolds.",
    "ORIGINAL STORY: Dozens of organizations and projects continue to move away from the popular Freenode IRC chat network, which has long been synonymous with open source projects.",
    "Since last week, several reputable projects and organizations such as Wikimedia (non-profit that runs Wikipedia), along with several Linux distros such as Ubuntu, Gentoo and CentOS have switched away from Freenode, most notably to Libera Chat, which was founded and is run by the former Freenode staff.",
    "In a post, one of Libera Chat’s founders, José Antonio Rey, who is also a member of the Ubuntu Community Council and a former staff volunteer at Freenode, explained the events leading up to the current state of affairs.",
    "Rey accuses Andrew Lee, the Crown Prince of South Korea and current owner of Freenode, of a \"hostile” takeover after rescinding his promise to not interfere with the operation of the network.",
    "Following their resignation, many of the IRC network's volunteer staff created the Libera Chat network.",
    "This led to Freenode taking charge of several hundred channels used by various free and open source software (FOSS) projects, earlier this week, and apparently tweaked their settings, citing “policy violations.”",
    "\"Today (2021-05-26) a large number of Gentoo channels have been hijacked by Freenode staff, including channels that were not yet migrated to Libera chat,\" wrote the Gentoo Linux project calling the move “an open act of hostility.\"",
    "Lee however accuses the former staff of attempting to \"destroy [Freenode] from the inside.\"",
    "“Freenode has been the home for the entire FOSS community for over 20 years. Fracturing the community only hurts users and FOSS. Your users don’t wish to migrate. Stop forcing them,” wrote Lee urging the projects to stay with Freenode.",
    "Meanwhile, in the one week since its launch, Libera Chat claims to have processed the registrations of over 250 projects, and about 20,000 user registrations, calling themselves the “fastest-growing IRC network ever.”"
  ],
  "headers": {
    "12": "Libera Chat"
  },
  "links": {
    "chat": "https://www.techradar.com/best/best-live-chat-software",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "Linux distros": "https://www.techradar.com/best/best-linux-distros",
    "Ubuntu": "https://www.techradar.com/reviews/ubuntu",
    "CentOS": "https://www.techradar.com/news/best-linux-distro-small-business",
    "post": "https://joseeantonior.wordpress.com/2021/05/19/freenode-changes-owners-jose-resigns-as-staff/",
    "wrote": "https://www.gentoo.org/news/2021/05/26/gentoo-freenode-channels-hijacked.html",
    "accuses": "https://freenode.net/news/for-foss",
    "one week since its launch": "https://libera.chat/news/one-week-of-libera-chat"
  }
}