{
  "source": "https://www.techradar.com/news/rocket-lake-leak-reveals-final-specs-of-flagship-intel-core-i9-11900k-desktop-cpu",
  "title": "Rocket Lake leak reveals ‘final’ specs of flagship Intel Core i9-11900K desktop CPU",
  "category": "computing",
  "updated": "2021-01-27T17:40:31Z",
  "author": "carly-page",
  "summary": "The chip will reportedly boast a boost clock of 5.2GHz",
  "article": [
    "Final specifications for the Intel Core i9-11900K, the flagship of Intel's 11th-gen Core Rocket Lake series, have allegedly surfaced online.",
    "This latest leak comes courtesy of Videocardz, which claims to have obtained the “final” specifications of Intel’s 1th-gen Core-K series via an internal MSI presentation.",
    "The Core 19-11900K is expected to be the flagship CPU in the series, and according to this leak, it will feature 8-cores, 16-threads and a maximum boost clock of 5.2GHz.",
    "While that’s the same as last year’s Intel Core i9-10900K, a recent leak showed Rocket Lake chip making impressive gains over the Comet Lake flagship. In single-core tests, the 11900K outperformed its predecessor by a whopping 35%.",
    "The desktop CPU will reportedly also feature Thermal Velocity Boost, which should delivery a 100Mhz boost to the max clock frequency.",
    "The alleged MSI leak also details the so-called Intel Core i7-11700K, another 8-core, 16-thread Rocket Lake part. Although it features the same core configuration as the I9-11900K, it offers reduced clock speeds, with a base clock of 3.6GHz and a boost clock of 4.9GHz.",
    "However, this CPU also supports Thermal Velocity Boost, so you can expect clocks of up to 5GHz.",
    "At the low-end of the Core K-series lineup is the Intel Core i5-11600K, a Rocket Lake desktop CPU with 6 cores and 12 threads. According to the leak, the AMD Ryzen 5 5600X competitor will feature base and boost clock speeds of 3.9GHz and 4.9GHz, respectively. Unlike its siblings, however, the chip doesn’t support Intel’s Thermal Velocity Boost technology.",
    "All three chips all feature feature a 125W TDP and DDR4-3200 memory support, according to the leak. It also reveals that the Core i9-11900K and 11700K will both boast 16MB of L3 cache, while the lower-end i5-11600K will feature a lesser 12MB.",
    "While this leak allegedly gives us a glimpse at final specifications for Intel’s unlocked Rocket Lake desktop CPUs, we won’t know for sure until the chips are released later this year. According to rumours, Intel could be planning a March release."
  ],
  "headers": {},
  "links": {
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "Videocardz": "https://videocardz.com/newz/intel-core-i9-11900k-i7-11700k-and-i5-11600k-rocket-lake-s-specifications-confirmed-by-msi",
    "Intel Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "the 11900K outperformed its predecessor by a whopping 35%": "https://www.techradar.com/news/intel-core-i9-11900k-cpu-leak-could-disappoint-those-hoping-for-faster-boost-speeds",
    "AMD Ryzen 5 5600X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-5-5600x-find-stock-here",
    "Intel could be planning a March release": "https://www.techradar.com/news/intel-rocket-lake-cpus-again-rumored-to-land-in-march-2021"
  }
}