{
  "source": "https://www.techradar.com/news/this-popular-mdm-could-be-apples-next-acquisition-target-in-bid-to-crack-enterprise-market",
  "title": "This popular MDM could be Apple's next acquisition target in bid to crack enterprise market",
  "category": "computing",
  "updated": "2021-01-05T14:47:00Z",
  "author": "barclay-ballard",
  "summary": "Jamf has achieved impressive growth across 2020",
  "article": [
    "Mobile device management (MDM) firm Jamf has confirmed it is now employed across more than 20 million Apple devices worldwide. The announcement raises the prospect of the MDM company being acquired by Apple, with which it has a long-established partnership.",
    "Jamf confirmed that it is now serving 47,000 customers, after adding more than four million devices and 11,000 customers in 2020 alone. Among the organizations that Jamf has added to its customer list are 24 of the 25 most valuable brands, as ranked by Forbes, the 10 largest US banks, and seven of the top 10 Fortune 500 companies.",
    "Although Jamf attributes its growth to strong customer loyalty, the company does acknowledge that a “year like no other” has also contributed to its success. The coronavirus pandemic has resulted in a huge uptick in remote working, something that has contributed to a surge in popularity for mobile device management solutions.",
    "“Coming into 2015, Jamf was 13 years old and managing less than 4 million devices for approximately 5,000 customers. That year, as the enterprise saw a growing number of professionals demanding to use Apple at work, we set an aggressive goal to empower the new workforce by running on 20 million Apple devices by the end of 2020,” said Dean Hager, CEO of Jamf.",
    "“Through our mission to help organizations succeed with Apple, we are proud to have achieved this milestone, and more importantly to have enabled so many organizations to help their employees, doctors, nurses, teachers, and students get the most out of their technology and be their best.”",
    "Confusingly, although Jamf is sometimes referred to as an Apple device management company, the two businesses are simply business partners, operating independently of one another.",
    "However, Jamf’s recent growth could potentially entice Apple to make an acquisition attempt, something that the company did last year with fellow MDM firm Fleetsmith.",
    "Via Apple Insider"
  ],
  "headers": {
    "3": "Partners for now"
  },
  "links": {
    "MDM": "https://www.techradar.com/news/mobile-device-management-where-is-it-headed",
    "said": "https://www.jamf.com/resources/press-releases/jamf-ends-2020-powering-more-than-20-million-enterprise-apple-devices/",
    "Fleetsmith": "https://www.techradar.com/news/apple-buys-mdm-specialist-to-bolster-business-credentials",
    "Apple Insider": "https://appleinsider.com/articles/21/01/04/jamf-now-manages-more-than-20m-apple-devices-for-47000-customers"
  }
}