{
  "source": "https://www.techradar.com/news/cyberpunk-2077-is-finally-returning-to-the-playstation-store",
  "title": "Cyberpunk 2077 is finally returning to the PlayStation Store",
  "category": "gaming",
  "updated": "2021-12-02T11:23:40.908Z",
  "author": "adam-vjestica",
  "summary": "Cyberpunk 2077 was pulled in December 2020",
  "article": [
    "CD Projekt Red’s Cyberpunk 2077 is returning to the PlayStation Store after being unceremoniously pulled from Sony’s digital storefront back in December 2020.",
    "The game started to appear on the PlayStation Store when players searched for Cyberpunk 2077, but CD Projekt Red has now confirmed that its maligned title will go back on sale on June 21.",
    "The company pointed Eurogamer to a regulatory announcement that was issued on June 15, which said that CD Projekt “publicly discloses the decision by Sony Interactive Entertainment to reinstate the availability of the digital edition of Cyberpunk 2077 on PlayStation Store, effective on 21 June 2021”.",
    "That doesn't mean Cyberpunk 2077 will now run perfectly on last-gen consoles, though. A Sony spokesperson told TechRadar: \"SIE can confirm that Cyberpunk 2077 will be re-listed on PlayStation Store starting June 21, 2021. Users will continue to experience performance issues with the PS4 edition while CD Projekt Red continues to improve stability across all platforms. SIE recommends playing the title on PS4 Pro or PS5 for the best experience.\"",
    "This new stance is more in line with Microsoft's approach, who kept the game on sale but its store listing came with a warning that users may experience performance issues.",
    "The launch of Cyberpunk 2077 will go down in history as one of the biggest, but most controversial releases of all time, due to how terribly the game ran on PS4 and Xbox One hardware. It wasn’t perfect on PS5 or Xbox Series X either, with the game suffering regular crashes, bugs and inconsistent performance.",
    "The game fared far better on PC, but still required a high end graphics card to get the most out of, especially for those who want to enable the game’s ray tracing effects.",
    "In fairness to developer CD Projekt Red, Cyberpunk 2077 has received multiple post-launch updates that have improved the game and rectified the most egregious issues players were facing. We still wouldn’t recommend picking it up on last-gen consoles, though – not at least until a full performance break down of any newly-added improvements has been assessed.",
    "CD Projekt Red has vowed to keep updating the game to stop it from dying, and that Cyberpunk 2077 will \"live up to what we promised\". The developer has shared that a PS5 and Xbox Series X upgrade will arrive toward the second half of 2021."
  ],
  "headers": {
    "7": "Choomba woomba"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "pulled from Sony’s digital storefront": "https://www.techradar.com/news/sony-pulls-cyberpunk-2077-from-playstation-store-offers-full-refund",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-06-15-you-can-now-search-for-and-find-cyberpunk-2077-on-the-playstation-store-but-you-cant-buy-it-yet",
    "regulatory announcement": "https://www.cdprojekt.com/en/investors/regulatory-announcements/current-report-no-34-2021/",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "from dying": "https://www.techradar.com/news/cyberpunk-2077-updates-will-keep-the-game-from-dying-says-ceo",
    "\"live up to what we promised\"": "https://www.techradar.com/news/cyberpunk-2077-can-live-up-to-what-we-promised-according-to-cd-projekt-ceo",
    "PS5 and Xbox Series X upgrade": "https://www.techradar.com/news/cyberpunk-2077-for-ps5-and-xbox-series-x-what-we-know-so-far"
  }
}