{
  "source": "https://www.techradar.com/news/whatsapp-will-finally-allow-you-to-move-your-chats-between-iphone-and-android",
  "title": "WhatsApp will finally allow you to move your chats between iPhone and Android",
  "category": "computing",
  "updated": "2021-05-21T13:22:19Z",
  "author": "daryl-baxter",
  "summary": "Chat Transfer re-dialled to 11",
  "article": [
    "It’s been discovered that a future update is in testing where moving all of your WhatsApp chats to a different device will be as easy as following a few steps.",
    "One of the most frustrating methods when upgrading your phone is making sure your WhatsApp chats are safe. If you move your chat history between one iPhone and another, the iCloud service does the bulk of the work, finding the backup and then downloading it onto your new device.",
    "However, if you decide to move to another platform such as Android, or vice-versa, it can be a world of hurt, and you are usually left with group chats that have no content, with your memes and gifs erased from existence.",
    "WhatsApp is one of the most popular apps on both Android and iOS. It allows millions of users to communicate whenever they want. It’s hard to imagine a time where you didn’t have a messaging app that used internet data, just text messaging through a 2G mobile phone.",
    "Now though, messaging apps are used to send video, stickers, memes, and even money. It’s the go-to app for many, regardless of how much you use your smartphone.",
    "But we all reach the point where we either want or need to upgrade these devices, and a big part of the move will involve transferring messages. It could be for nostalgia reasons or to keep messages from a loved one, and WhatsApp is keenly aware of this.",
    "For now, screenshots show a development build where it’s making sure that the latest WhatsApp is installed on both devices, regardless of one being Android or iOS. After this step, the migration will begin.",
    "It also gives the option to move the data to a different phone number. This is already possible, but it’s a game of chance whether it works, regardless if it’s an upgrade between two iPhone devices or a device with a different operating system.",
    "It looks as though it’s in very early development, but with iPhone upgrade season slowly arising, it wouldn’t be a surprise to see this new feature arrive before the end of the year."
  ],
  "headers": {
    "3": "An Easier Affair",
    "6": "Migration Remade"
  },
  "links": {
    "keenly aware": "https://wabetainfo.com/whatsapp-to-support-chat-history-migration-to-a-different-phone-number/"
  }
}