{
  "source": "https://www.techradar.com/news/android-12-easter-egg-drops-the-cats-and-games-in-favor-of-a-bubbly-surprise",
  "title": "Android 12 easter egg drops the cats and games in favor of a bubbly surprise",
  "category": "phones",
  "updated": "2021-07-27T08:47:37Z",
  "author": "tom-bedford",
  "summary": "A smaller easter egg this time",
  "article": [
    "Another version of the Android operating system, another easter egg hidden away in the software: Android 12's easter egg has been discovered, despite the fact that the update hasn't even technically been released yet.",
    "The way of activating the Android 12 easter egg was shared by XDA Developers, it's not yet available in the public beta, but apparently the site found it in the Android 12 code and activated it - perhaps we'll see it in a future public beta build.",
    "Unlike the Android 10 easter egg, which was a nonogram numbers game, or the Android 11 equivalent which was a cat-collecting experience, the Android 12 easter egg isn't a little game at all.",
    "No, this time the easter egg is a tie-in to Material You, the flagship Android 12 feature which lets you design your home page and color scheme. The easter egg basically triggers an eruption of bubbles around the screen, in the color scheme of your Material You homepage.",
    "Apparently this is activated when you use the analog clock widget on your wallpaper, then drag the hands until they're both dead on 12. Cue bubbles everywhere.",
    "So is the Android 12 easter egg going to set your world on fire? No, probably not, and it's certainly not going to consume our time like that cat-collecting Android 11 game. But people who've spent ages designing their Android 12 wallpapers will be glad to see an easter egg that recognizes that.",
    "If you enjoy the Android 10's nonogram easter egg - that's basically a type of numbers and grid puzzle - or the lovely Android 11 game where cats started popping up in your notifications, and you had to collect them, water them and feed them - you might find the Android 12 one a bit... 'meh'.",
    "That's because 'seeing bubbles' isn't quite as gripping as collecting cute kitties, or using your brain to fill in numerical grids, and it certainly doesn't take up as much of your time.",
    "Some people might be disappointed that the Android 12 easter egg isn't a game. But other than the last two years, there isn't as much a precedent for consistent Android games.",
    "For example, the Android 9 easter egg instead showed you a basic drawing app. And a recent Wear OS easter egg gave you a wrist-mounted drum machine. So games aren't part and parcel with the Android easter egg experience.",
    "Don't fret though, because there are some lightweight games baked into your Android phone. If you head on over to the Google Play Games app - most Android phones have this installed, but not all - you can scroll down to 'Mini games' which are small time-killers like Snake, chess and solitaire, which you can use to while away a short commute or boring conversation."
  ],
  "headers": {
    "6": "Why it's not an easter egg game"
  },
  "links": {
    "easter egg": "https://www.techradar.com/news/android-easter-eggs",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "XDA Developers": "https://www.xda-developers.com/android-12-easter-egg-material-you/",
    "Android 10": "https://www.techradar.com/news/android-q",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android 9": "https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list",
    "Android phone": "https://www.techradar.com/best/best-android-phones"
  }
}