{
  "source": "https://www.techradar.com/news/wandavision-who-is-monica-rambeau",
  "title": "WandaVision: who is Monica Rambeau, and what does she tell us about the MCU?",
  "category": "entertainment",
  "updated": "2021-01-30T17:55:55Z",
  "author": "richard-edwards",
  "summary": "Huge spoilers ahead",
  "article": [
    "Spoilers for WandaVision follow.",
    "It’s fair to say it’s been a strange five years for WandaVision’s Monica Rambeau. Having been one of the many victims dusted by Thanos’s ‘Blip’, she rematerialized to learn that her mother, Maria, had passed away in the interim.",
    "Then, after returning to active duty as an agent at SWORD, her first gig was a missing persons case in New Jersey that somehow turned her into a sitcom character named Geraldine. It’s unlikely that living life accompanied by canned laughter was ever part of her career plan…",
    "From its first episode, WandaVision has been the most unconventional story ever to emerge from the Marvel Cinematic Universe. Yet Monica Rambeau’s arrival in (and departure from) the retro suburbia of Westview has made Wanda and Vision’s sitcom existence even weirder.",
    "Here we explain Monica Rambeau’s comic book origins, why she’s such an important character in WandaVision, and how she fits into the wider MCU.",
    "Monica Rambeau made her MCU debut in the 1990s-set Captain Marvel, and is the daughter of Captain Maria Rambeau (played by Lashana Lynch, eventually to be seen in Bond movie No Time To Die). Maria was a pilot in the US Air Force (callsign Photon) who was best friends with Carol Danvers before she became Captain Marvel.",
    "The 11-year-old Monica was pivotal in persuading her mother to team up with Captain Marvel and Nick Fury to aid the Skrulls in their war against the Kree, and also helped Danvers pick the color scheme for her Captain Marvel suit. While Monica refers to Danvers as “Aunty Carol”, Danvers calls the kid “Lieutenant Trouble”.",
    "In the movie, Monica was played by two sisters: Azari Akbar was the five-year-old incarnation, while older sibling Akira Akbar played her at 11.",
    "Having been caught up in a Skrull/Kree conflict during Captain Marvel, Maria Rambeau was aware of the existence of aliens, and went on to found SWORD (Sentient Weapon Observation Response Division), an intelligence agency with a remit to manage extra-terrestrial activities. She was also its director – SWORD’s answer to Nick Fury at SHIELD.",
    "Maria was diagnosed with cancer somewhere around 2018 but – despite going into remission after surgery – passed away two years later.",
    "Monica grew up around SWORD and its headquarters, and eventually followed her mother into the family business. Like her mom, she became a captain in the US Air Force, before getting a transfer to become an agent of SWORD.",
    "While sitting at her mother’s hospital bedside, Monica (now played by Teyonah Parris) was one of the billions removed from existence by Thanos’s infamous finger snap. When she returned from the ‘Blip’ five years later, she learned that Maria had died in the interim, and that former colleague Tyler Hayward (introduced in the WandaVision episode ‘We Interrupt This Program’) was now acting director of SWORD.",
    "Just three weeks after the ‘Blip’, she returned to active duty, but was disappointed to learn that her duties were limited to operations on Earth – Maria had introduced regulations grounding anyone coming back to SWORD after being ‘Blipped’.",
    "Monica reluctantly accepted an assignment to the small New Jersey town of Westview, where the FBI had requested assistance with a very strange missing persons case…",
    "SWORD’s efforts to locate and extract Monica from Westview are one of the key plotlines of WandaVision.",
    "While Monica’s brief was essentially to chaperone a SWORD drone as it investigated a town cut off from the rest of the world, she found herself sucked into the case – literally. When the drone vanished, she decided to take a closer look and realized a mysterious energy field surrounded the town. When she touched the field, she was pulled inside – leaving FBI agent Jimmy Woo to add Monica to his growing list of missing persons.",
    "For some – as yet unexplained – reason, Monica became Geraldine, a character in a vintage sitcom, dressed in era-appropriate clothing. The only evidence of her SWORD connections was the necklace that’s part of her ’70s ensemble.",
    "But having befriended Wanda Maximoff – initially as an ally standing up to the domineering Dottie – Monica/Geraldine helped out at the birth of Wanda and Vision’s twin sons, Billy and Tommy.",
    "That relationship went pear-shaped, however, when Monica/Geraldine inadvertently let slip that she knew Wanda’s twin brother, Pietro, had been killed by Ultron (at the Battle of Sokovia in Avengers: Age of Ultron). Wanda instantly realized that Monica/Geraldine is “a stranger and an outsider, and right now you are trespassing here”, and banished the intruder from her idyllic sitcom existence.",
    "When Monica woke up she was outside the energy field (though still wearing her ’70s clothes), and immediately told Woo and astrophysicist Darcy Lewis that, “It’s Wanda! It’s all Wanda!” – alluding to the fact that Wanda seems in control of what’s happening to Westview.",
    "But how much did Monica’s presence affect Westview? In episode 3, ‘Now in Color’, Wanda and Vision’s neighbors Agnes and Herb were suspicious that she was brand new in town, with no family, no husband and no home – Herb also tried to add that “she came here because we’re all…” but never managed to complete his sentence.",
    "Now that we know the residents of Westview are real people somehow given a sitcom character makeover, could Monica’s brief presence in the town be the catalyst that makes them aware of their bizarre, vintage TV prison?",
    "And as the only person on the outside with experience of living in sitcom-world, she's sure to have a major role to play in working out why Wanda's seemingly taken over the town – and how SWORD and the FBI can rescue the locals from their laughter-tracked existence.",
    "The MCU has a long history of playing around with the origins of comic book characters when taking them to the big screen, and the Rambeaus are no exception. In fact, Monica’s backstory is radically different – though the character’s history in Marvel comic books may provide a hint of things to come.",
    "New Orleans resident Maria wasn’t a pilot in the comics – instead, she was a seamstress who met Monica’s firefighter dad, Frank, when both served in the military. In fact, her most important role was arguably being Monica’s mom…",
    "Monica made her first appearance in 1982, in the Amazing Spider-Man Annual. She was a New Orleans Harbor Patrol officer who gained various superpowers involving the ability to turn herself into X-rays, ultraviolet, infrared and other wavelengths of the electromagnetic spectrum.",
    "Among her lengthy roster of powers, she can bend light to change her appearance, effectively giving her the ability to shape shift; she can pass through solid matter; make herself invisible; and, of course, fly.",
    "A skill set like that is unlikely to go unnoticed, so – having initially been dubbed Captain Marvel – she became a member of the Avengers for a while. Over subsequent years she’s gone under a variety of names including Pulsar, Spectrum and Photon – her mother’s callsign in the Captain Marvel movie.",
    "Monica’s clearly going to live to fight another day after WandaVision, as Teyonah Parris is lined up to return in the upcoming (as-yet untitled) Captain Marvel 2. The question is, will she still be an ordinary human – or will she have picked up the superpowers to become Pulsar, Spectrum or Photon?",
    "Sorry Monica, Captain Marvel’s already taken…",
    "New episodes of WandaVision are available every Friday on Disney Plus."
  ],
  "headers": {
    "5": "Where have we seen Monica Rambeau before WandaVision?",
    "8": "What’s happened to Monica Rambeau between Captain Marvel and WandaVision?",
    "14": "Why is Monica Rambeau important to WandaVision?",
    "23": "How does Monica Rambeau feature in Marvel comics?",
    "28": "What’s next for Monica Rambeau in the MCU?"
  },
  "links": {
    "SWORD": "https://www.techradar.com/news/sword-in-wandavision-explained",
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Lashana Lynch": "https://www.techradar.com/news/no-time-to-dies-lashana-lynch-discusses-her-key-role-in-the-new-bond-movie"
  }
}