{
  "source": "https://www.techradar.com/news/wix-crowns-users-experience-with-mobile-app-launch",
  "title": "Website builder Wix has a clever new trick up its sleeve",
  "category": "computing",
  "updated": "2021-04-20T13:02:15Z",
  "author": "abigail-opiah",
  "summary": "The first of many new Wix apps",
  "article": [
    "Popular website builder Wix has launched a new mobile app that gives businesses the ability to showcase their online stores with greater ease.",
    "Spaces by Wix, the mobile app, has all the elements of a social media and ecommerce platform combined. It allows businesses to design their own page and create custom tabs, and the app has a live feed that lets customers contact businesses directly.",
    "The new feature will be available to every business that creates an online presence on Wix. These businesses can then invite customers to join as community members.",
    "So far, over 5 million customers have downloaded the app, allowing them to engage with hundreds of thousands of businesses built on Wix. The announcement comes alongside new Wix data that suggests 70% of customers interact with businesses through mobile channels, at least in the US.",
    "For Wix users, the app offers almost all the same functions as the website, including Wix Stores, Wix Bookings, Wix Events, Wix Pricing Plans, Wix Blogs and more.",
    "A Wix spokesperson told TechRadar Pro the app will be altered over time as more businesses join and the need for sub-category tabs becomes more prevalent.",
    "Speaking on the new launch, Ronny Elkayam, SVP of Mobile, App Market & Strategic Products at Wix said: “We’re constantly building tools to serve our users and their customers’ needs.\"",
    "\"Spaces by Wix provides a convenient way for customers, readers, loyal members and fans to communicate and transact with Wix business owners and other community members.\"",
    "\"Businesses that offer a native application capability for their customers are gaining more engagement and activity, which is proven to lead to higher customer satisfaction, loyalty and ultimately increased sales and revenue.”",
    "He added that Wix saw huge demand from its users’ customers for a native app experience to communicate with businesses.",
    "The new feature is free for Wix users and represents the first in a chain of mobile apps the website builder will be releasing over time."
  ],
  "headers": {
    "3": "Website builder app"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "ecommerce": "https://www.techradar.com/news/best-ecommerce-hosting",
    "Wix": "https://www.techradar.com/reviews/wix"
  }
}