{
  "source": "https://www.techradar.com/news/is-the-gopro-hero-10-black-a-relic-in-the-age-of-the-iphone-13s-cinematic-video",
  "title": "Is the GoPro Hero 10 Black a relic in the age of the iPhone 13's cinematic video?",
  "category": "cameras",
  "updated": "2021-09-19T08:00:00Z",
  "author": "mark-wilson",
  "summary": "GoPros are tough, but will they survive computational video?",
  "article": [
    "It’s been a biggest week of the year, and possibly last few years, for pocket video cameras. On Tuesday Apple announced the iPhone 13’s promising ‘Cinematic mode’ feature – and, two days later, the GoPro Hero 10 Black skydived into our lives with its powerful new GP2 chip.",
    "But with Apple’s new feature, which we haven't yet tried in the real world, potentially bringing shallow depth-of-field video to the mainstream, is GoPro about to look out of step with the kind of movies we’ll be able to create with our phones?",
    "After all, despite its powerful new GP2 processor, the single-lens GoPro Hero 10 Black isn’t able to produce the kind of depth maps and computational wizardry seen in Apple’s keynote.",
    "Yet the tough, waterproof GoPro Hero line has already weathered the storms of 4K camera phones – and as we discovered in our GoPro Hero 10 Black review, it’s still the undisputed master of action videos where background blur is usually a disadvantage, and stabilization is everything.",
    "There’s no doubt, though, that while we’ve seen pro video modes on phones before, the iPhone’s 'Cinematic mode' feature and ability to shoot in Apple ProRes are the starting whistle for GoPro's biggest challenge so far…",
    "The GoPro Hero 10 Black and Apple iPhone 13 Pro are two very different pocket cameras, but they have the same overarching aim – to help people (mainly amateurs, but increasingly professionals) shoot high-quality video and stills with little fuss.",
    "The Hero 10 Black will always be able to go to places (and be mounted in unusual spots) that smartphones will never reach. But the issue it could increasingly face is the style of video we become accustomed to shooting on our phones – namely, video with shallow, adjustable depth-of-field.",
    "The name of Apple's 'Cinematic mode' has riled many videographers, who see it as hyperbole to rank alongside its 'Retina' displays and 'Lightning' ports. This is because there's a lot more to being 'cinematic' than blurring out backgrounds to bring something to the viewer's attention. Filmmakers agonize over color palettes to build an overall mood (follow Cinema Palettes on Twitter for a good insight), and that's before you even get into lighting, location scouting, storyboarding and audio.",
    "But despite the name, there's no doubt 'Cinematic mode' has huge promise for everyday filmmaking and vlogging. Convincing shallow depth-of-field for video hasn't been a story-telling tool we've had on our phones, because their small sensors and lenses don't produce the kind of 'natural' bokeh you'd get from combining a full-frame camera with a bright prime lens.",
    "Phones began solving this issue for photos with the HTC One M8 back in 2014, which led to the compelling simulated bokeh we see in today's Portrait modes. We've also already seen some phones (the Huawei Mate 20 Pro and Samsung Galaxy S10) attempt to do the same for video. But Apple's keynote revealed that there is likely more going on under the hood of 'Cinematic mode' than we've seen in any comparable tech before.",
    "For one, it has a predictive focusing system that attempts to automatically choose what kind of 'focus rack' you need for your scene – for example, focusing on someone's face as they enter the scene, or as switching focus as they look over to another person in the background. But arguably the bigger news is its ability to create depth maps for video.",
    "These are created using the varying viewpoints of the iPhone 13 series' lenses, rather than LiDAR tech, because 'Cinematic mode' is available on the iPhone 13 Mini and iPhone 13, which lack LiDAR scanners. The result is that editing software like the Photos and iMovie apps, and soon desktop apps, will let you change the focus point (or at least simulate this happening) after you've shot a video. Interestingly, an Apple software engineer also said the mode will let you do the same for photos.",
    "This kind of computational video tech, which we've also seen previously on apps like Focos, is simply well beyond the GoPro Hero 10 Black.",
    "The closest thing GoPro has to it is the GoPro Max, which instead lets you decide where to point the camera in the spherical, 360-degree video it shoots in post. Its two lenses could also theoretically create depth maps. But the Hero 10 Black is a more traditional action camera – and it feels distinctly old-school compared to the depth-of-field trickery that's about to explode on phones.",
    "Small cameras that can shoot pro-looking video are a booming market – that's why Sony launched the Sony ZV-1 (above) last year, which we reckon is currently the best vlogging camera. But the clock is surely ticking on its time at the top. One of the ZV-1's YouTuber-friendly tricks, called 'Product Showcase' mode, lets the camera quickly pull focus from a person's face to a product held up to the camera, then back to the presenter's face. 'Cinematic mode', far from helping us become home-based Tarantinos, looks perfect for these more everyday purposes.",
    "So where does that leave the GoPro Hero 10 Black? It lives in a world removed from true computational video, but it's very likely that its world will continue to co-exist with 'cinematic' smartphone trickery. After all, not every still photo we take is in 'portrait' mode. Also, early attempts at portrait-style video, including Apple's, will continue to have practical limitations – Cinematic mode is, for example, limited to a maximum resolution of 1080/30p. Apple's demo conveniently lacked speech, too.",
    "The Hero 10 Black might only have one lens, but that super wide-angle lens (plus a lot of software trickery) is the key to what is still GoPro's best trick – HyperSmooth stabilization. This is able to reduce judder in virtually any situation, and thanks to the Hero 10 Black's GP2 processor its strongest forms now work in its highest video settings (for example 5K/30p and 4K/60p).",
    "HyperSmooth has recently been joined by an increasingly useful 'horizon leveling' tool. This keeps your horizon steady, even if your camera's turned from side-to-side – and on the Hero 10 Black it can now correct turns of up to 45 degrees. It works really well and, along with HyperSmooth, lets you capture video that simply isn't possible with a phone.",
    "The Hero 10 Black's advantages over phones are also strengthened by the limitations of the latter. Phones are simply too fragile and important to risk in dangerous situations, too awkward to fit in tight spots, and your video shoots can be interrupted by phone calls and notifications. Still, the question remains – if GoPros want to be our phones' waterproof stunt doubles, do they need to learn new video tricks like 'Cinematic mode' to stay relevant?",
    "For GoPro's traditional shooting diet, probably not. In sports videos, you generally want to keep everything in focus, because it's hard to predict exactly where the action will be at any given second, or who will be the right person to focus on.",
    "This is partly why GoPro's have a fixed-focus lens with deep, non-adjustable focus that stretches off into the distance. While Apple's 'Cinematic mode' can apparently predict where the focus needs to head next, it's unlikely to be able to cope with a fast-moving action scene.",
    "Interestingly, though, we have started to see an equivalent to Apple's new mode start to sweep across live sports coverage. If you've watched the NFL or La Liga game recently, you'll probably have seen an on-pitch camera with movie-like bokeh infiltrate the players' celebrations after a touchdown or goal (like the one below). This comes from a gimbal-stabilized mirrorless camera that naturally produces the effect that Apple's 'Cinematic mode' is striving for.",
    "Still, while that's a relatively niche use case, the GoPro Hero 10 Black (or perhaps its successors) are in more of a bind when it comes to an area they've increasingly been flirting with: vlogging. The Hero 9 Black introduced a front LCD screen for this purpose, which dramatically improved its appeal among YouTubers looking for a tough b-cam to use out in the field.",
    "If smartphone modes like 'Cinematic mode' let you shoot videos with convincingly rendered bokeh, and also create the effect of letting you tweak focus afterwards, then GoPros could become less appealing in these less action-based scenarios. Unless, of course, the Hero 10 Black's successors learn to create their own video depth maps using additional lenses or sensors, with a setup like the 360-degree Max.",
    "For now, the reality is the video powers of the GoPro Hero 10 Black and phones like the Apple iPhone 13 will dovetail quite nicely. Both offer powerful software modes, whether that's HyperSmooth 4.0 or 'Cinematic mode', to help us create pro-looking videos in situations that would have previously required expensive, back-breaking camera setups.",
    "We also don't yet know how good 'Cinematic mode' is going to be. Apple's demo was far from perfect, and that was with professional lighting, actors and directors behind the phone. It'll likely be flawed and limited to specific situations to begin with. But the kernel of promise is there and, given the rising importance of video as a camera feature, it'll no doubt be refined very quickly over the next couple of years.",
    "The days of GoPros striving to be our generalist cameras were over well before the Hero 10 Black arrived, but it has the features and power to continue being everyone's favorite b-cam and a handy tool for professionals who need to get a specific shot in demanding conditions.",
    "Ultimately, the winners of all of this fierce competition are us. Over the next few years, we’ll all have the chance to have a hugely versatile camera rig in our pockets for virtually any shooting situation or video style. The exciting question is what everyone will do with that power."
  ],
  "headers": {
    "5": "Cinéma vérité",
    "12": "Smooth operator",
    "19": "Focus group",
    "24": "Pocket rockets"
  },
  "links": {
    "Cinematic mode": "https://www.techradar.com/news/what-is-cinematic-mode-the-iphone-13s-new-video-focusing-trick-explained",
    "GoPro Hero 10 Black": "https://www.techradar.com/reviews/gopro-hero-10-black",
    "GoPro Hero 10 Black review": "https://www.techradar.com/reviews/gopro-hero-10-black",
    "Cinema Palettes": "https://twitter.com/CINEMAPALETTES",
    "HTC One M8": "https://www.techradar.com/reviews/phones/mobile-phones/htc-one-m8-1235307/review",
    "Huawei Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "LiDAR": "https://www.techradar.com/news/what-is-a-lidar-scanner-the-iphone-12-pros-rumored-camera-upgrade-anyway",
    "let you do the same for photos": "https://twitter.com/vasarhelyia/status/1437842780064075777",
    "GoPro Max": "https://www.techradar.com/reviews/gopro-max",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "best vlogging camera": "https://www.techradar.com/news/best-vlogging-camera"
  }
}