{
  "source": "https://www.techradar.com/news/hbo-maxs-those-who-wish-me-dead-is-aggressively-disposable-and-thats-okay",
  "title": "HBO Max's Those Who Wish Me Dead offers modest thrills, and not much more",
  "category": "entertainment",
  "updated": "2021-05-19T14:47:33Z",
  "author": "stephen-lambrechts",
  "summary": "Taylor Sheridan's latest directorial effort is slight, but fun",
  "article": [
    "Unlike many of his peers in Hollywood, Taylor Sheridan is one of the few creators working today who's almost entirely committed to telling stories set within the American heartland.",
    "Whether it's his criminally underrated Montana-set series Yellowstone, or the brilliant neo-Western Wind River, which takes place on a Native American reservation in Wyoming, Sheridan seems intent on giving voice to those who are often overlooked in American television and cinema.",
    "That said, his latest effort, Those Who Wish Me Dead, plays in stark contrast to the titles listed above in that it really has nothing to say about America or its people, opting instead to present a by-the-numbers thriller that's effective if utterly disposable.",
    "Arriving in theaters and on HBO Max on May 14, Those Who Wish Me Dead sees teenage murder witness Connor (Finn Little) pursued through the Montana wilderness by a pair of ruthless assassins (Aiden Gillen and Nicholas Hoult) who will stop at nothing to tie up loose ends for their employer (Tyler Perry).",
    "Along the way, Connor teams up with Hannah (Angelina Jolie), a potty-mouthed smokejumper with PTSD who has taken her first steps back to work after witnessing the death of three children during a particularly devastating forest fire.",
    "Together, the pair must fight to stay alive as they flee from the killers on their trail, and from the raging forest fire their pursuers have started. Thankfully, Hannah knows a thing or two about survival in extreme conditions.",
    "In theory, a film set in the high-stakes world of smokejumpers plays right to Sheridan's strengths, in that the concept inherently deals with an elite group of characters who must undertake an emotional journey in a modern day Western setting.",
    "However, the film's firefighting angle is presented entirely as an afterthought, only really coming into play when the film's villains start a forest fire as a distraction roughly halfway through the film.",
    "Which brings us to another issue – though Sheridan's work usually deals in shades of gray, leaving it up to the audience to decide whose side it's on, Those Who Wish Me Dead's morals are as black and white as they come. The film really wants you to hate its bad guys and root for its good guys, which feels very un-Sheridan in its approach.",
    "This is likely due to the film not originating with Sheridan – the sought-after screenwriter was initially brought in to rewrite an existing script, which was already an adaptation of novel, eventually telling the studio he would be willing to also direct if they could secure Jolie as his star.",
    "What's most surprising, however, is that Jolie and Little's fight for survival is quickly overshadowed by the film's B-plot, which sees the heavily pregnant Alison (Medina Senghore), wife of Sheriff Ethan (Jon Bernthal), set out to hunt the killers from afar.",
    "The scenes featuring the bad-ass mother-to-be Alison offer by far the most intense and suspenseful moments of Those Who Wish Me Dead, making us wish the film had centered on her character instead.",
    "The resulting film, while well-acted, confidently directed and undeniably thrilling, ends up feeling very slight for a major studio release with A-list stars – especially coming after Sheridan's excellent previous directorial effort, Wind River.",
    "Of course, that isn't to say that Those Who Wish Me Dead is unworthy of your time. On the contrary – the film works very well as a throwback to the '90s thriller heyday, where all you needed was a big bag of popcorn and a few heart-racing set pieces for a good night at the movies.",
    "While the film falls short of Sheridan's previous work, which includes the Oscar-nominated Hell or High Water and both Sicario films, it does sit nicely alongside the '90s action thrillers that inspired it, such as The River Wild.",
    "In other words, Those Who Wish Me Dead is the perfect flick for a cosy night in or for a date night out – just don't expect it to linger in the memory for long afterwards.",
    "Those Who Wish Me Dead will arrive in theaters and on HBO Max in the US on May 14, in UK theaters on May 17 and in Australian theaters on May 13."
  ],
  "headers": {
    "6": "The heat is on",
    "13": "Fire it up"
  },
  "links": {}
}