{
  "source": "https://www.techradar.com/news/lords-mobile-is-the-mobile-strategy-game-your-phone-needs",
  "title": "Lords Mobile is the mobile strategy game your phone needs",
  "category": "gaming",
  "updated": "2021-02-11T13:54:46Z",
  "author": "sponsored",
  "summary": "",
  "article": [
    "Mobile games have helped us get through the last year. They're fun, you can dip into them for three minutes or an hour, and you can get started in seconds.",
    "Lords Mobile is one of our phone games of the moment. It's one of the most popular strategy titles in the world, and has racked up in excess of 340 million downloads since its original release in 2016. That is a download for every person in the US, plus around 10 million more.",
    "And like the best mobile games it has developed massively since it first came out.",
    "Lords Mobile sees you build up a kingdom, from a small patch of land to a sprawling empire.",
    "Build a barracks to train troops and take them into battle, to conquer lands and expand your kingdom. Scout out each skirmish before sending in your forces, to discover the tactics you'll need, and bolster your ranks with the right units to give your side the best chance.",
    "Ballistas, archers or infantry? Make the right decisions to flatten the enemy.",
    "Each battle is rendered in gorgeous cartoony 3D, bringing the action to life in a fun and fresh way.",
    "One of the aspects of Lords Mobile we enjoy the most is that you don't have to play for hours at a time. You can dip in once or twice a day, and each session sees you do a bunch of different things.",
    "You might upgrade a building or two, choose some new unit types to train and have a crack at taking down a new enemy. And there's a whole other side to Lords Mobile too: Heroes' Assault.",
    "One side of Lords Mobile is a mix of kingdom building and epic-scale battles. The other is a Heroes' Assault, a more intimate role-playing adventure.",
    "You control up to five heroes, directing their special attacks by hand to take down boss characters and their minions. It's a refreshing, more hands-on gameplay style after spending some time tinkering with your army.",
    "These three elements: building, epic battles and the arcade style of Heroes' Assault, stop you getting bored of Lords Mobile even weeks and months after you first install it.",
    "Lords Mobile is a massively multiplayer game that connects you to countless other people online. This is not a mobile game that leaves you watching timers count down half the time.",
    "There's more to discover once you get truly stuck into Lords Mobile too. You can join a guild, chat to the other real-world players and team-up to take on epic enemies out in the wilds.",
    "Once you've built up a healthy kingdom, send out adventuring parties of your troops to gather resources and attack fearsome creatures in the far reaches of the game's world. Or why not try invading another real player's kingdom?",
    "Lords Mobile's creator IGG Mobile also keeps play fresh with regular community events, like the recent Ultimate Guild competition. This offered unique in-game prizes for the top guilds, and Medals of Honour for all the runners-up guilds.",
    "If that doesn't give you the warm and fuzzies, how about a little story of how IGG Mobile supports its staff? It recently gave 1500 of its employees an $800 bonus to help them get through the Coronavirus pandemic, and has supplied everyone on its team with care packages including face masks and hand sanitizer from the beginning.",
    "Fancy something a little different? Why not try IGG Mobile's latest game, Dress Up! Time Princess?",
    "It swaps Lords Mobile's large-scale battles for story-driven fun, where you have to design an outfit to suit each scene of the narrative. This game really makes use of the power of today's phones, each dress animated in full 3D with amazing fabric physics.",
    "Dress Up! Time Princess and Lords Mobile are available for download on Android and iOS, for free, today."
  ],
  "headers": {
    "7": "A tasty mobile snack",
    "12": "Lords Mobile's pro treats",
    "15": "A sense of community"
  },
  "links": {}
}