{
  "source": "https://www.techradar.com/news/this-android-phones-under-display-selfie-camera-isnt-great-but-its-a-sign-of-the-future",
  "title": "This Android's under-display selfie camera isn’t great, but it's a sign for future phones",
  "category": "phones",
  "updated": "2021-02-21T10:00:12Z",
  "author": "james-peckham",
  "summary": "Under-display selfie cameras are now a reality",
  "article": [
    "Does your smartphone feature a notch, a punch-hole or even a pop-up camera? Selfie cameras are one of the most divisive elements of modern smartphones, and it may be that one day these are dropped with the introduction of under-display selfie shooters.",
    "The ZTE Axon 20 5G is the first commercially available smartphone to feature an under-display selfie camera, and we can confirm it works.",
    "We’ve been using the ZTE Axon 20 5G for a few weeks, and the selfie camera works well but it isn’t without its issues. Below, we’ll show you some of the selfie shots it’s capable of taking and talk you through our first impressions of the camera itself.",
    "For more on the phone in general, you can read our ZTE Axon 20 5G review. Here, we'll be talking you through what has happened with the selfie camera and how this is possible.",
    "This isn’t something ZTE has revealed itself, but an insightful teardown video from JerryRigEverything that you can see below gives us a bit of a glimpse of how ZTE has made this possible.",
    "Essentially, the company has used two displays here. You won't notice that there are two screens though.",
    "There’s the standard 6.92-inch OLED panel that works like a normal smartphone screen, and then there’s a smaller square screen that sits on top of the selfie camera itself to allow the shooter to peer through.",
    "There’s likely to be more to it than that, but this is the best information we have until ZTE clarifies specifics. This will likely be the way that companies incorporate this tech on upcoming phones that we expect to include under-display selfie cameras.",
    "For example, we've seen patents from Samsung that suggest it's experimenting with similar technology. That may mean we see it on future phones from the company such as the Galaxy Note 21 or Galaxy Z Fold 3.",
    "So what do selfie shots look like on the ZTE Axon 20 5G? They're okay, but the camera quality isn't phenomenal. This phone uses a 32MP front-facing camera with an f/2.0 aperture.",
    "Overall, the Axon 20 5G's camera takes soft photos that at best have weak colors but at worst can be blown out. We found that when most phone selfie cameras would perform well in good lighting, this camera felt hazy at best.",
    "In darker conditions, we found the Axon 20 5G's selfie camera would lose detail and couldn't compete with most other smartphones with similar specs on their front-facing shooters.",
    "Overall, it isn't great and that seems to be partly down to the fact that it's covered over with a screen on top of the selfie camera. That said, this is the first implementation of this technology, so we hope to see this improve on future smartphones.",
    "No-one knows for certain whether under-display selfie cameras will become the norm, but we’re expecting to see the technology debut on more brands' smartphones throughout 2021.",
    "It’s likely to become an alternative to the notch and punch-hole selfie cameras in the years to come, but there’s no guarantee this will completely wipe out the technology seen from other manufacturers.",
    "That's especially true as the under-display selfie camera on ZTE's phone isn't seamless. You can see the selfie camera when you're using the smartphone, and that's not helpful when the whole point of the tech is to hide the camera.",
    "This is likely to be something we see improve in the future, but at this moment in time it doesn't hide well under the phone's screen, especially when you're using that part of the display.",
    "This is a big step though for the under-display tech to be available on a phone you can buy, and we’re hoping to see major improvements in this technology in the coming months and years."
  ],
  "headers": {
    "4": "How does an under-display selfie camera work?",
    "9": "How do the selfies look?",
    "13": "Will it ever replace the notch?"
  },
  "links": {
    "ZTE Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "ZTE Axon 20 5G review": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "upcoming phones": "https://www.techradar.com/news/upcoming-phones",
    "patents from Samsung": "https://www.techradar.com/news/a-future-samsung-phone-could-have-an-under-display-camera-based-on-this-patent",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review"
  }
}