{
  "source": "https://www.techradar.com/news/xbox-has-never-been-in-a-better-position-according-to-microsoft",
  "title": "Microsoft reiterates it isn't bothered about selling Xbox Series X consoles",
  "category": "gaming",
  "updated": "2021-06-30T14:43:14Z",
  "author": "adam-vjestica",
  "summary": "The number one metric is player engagement",
  "article": [
    "Xbox has “never been in a better position than we are right now”, according to Microsoft’s Phil Spencer, who also reiterated that Microsoft doesn't judge the Xbox division's success on retail sales or review scores.",
    "Speaking on the 500th episode of IGN’s Podcast Unlocked, which also served as a celebration of Xbox’s 20 year anniversary, head of Xbox Phil Spencer candidly answered a number of questions, including what his favorite year in Xbox history was, what the team’s plans are for the future, as well as whether Xbox Game Pass is actually economically viable.",
    "When asked to pick his favorite year in Xbox’s 20 year history, Spencer told Unlocked: “I’m always going to pick this year, because I’m always looking forward. When I think about the vision that the team has – we just came out of an amazing Xbox Bethesda Showcase – I just really love how the brand is showing up right now.",
    "“...I honestly can’t remember a time when I think we’ve been in a better position than we are now, with the studio capability that we have right now, where our hardware sits – with the two great consoles [Xbox Series X and Xbox Series S] – and our services continue to grow. I honestly believe we’ve never been in a better position with Xbox than we are right now.”",
    "However, Spencer also touched on how the Xbox One launch was a key moment in Xbox history. As challenging as it was for Microsoft, it helped pave the way for where the team is now.",
    "“It was such a seminal moment for the team in checking, ‘what did we stand for? What did we want to be as we went forward?’” Spencer said. “For the brand, it was a challenging year, there was a lot for us to learn.”",
    "The Xbox One launch was seen as disastrous by many gamers and analysts. Not only was the console more expensive than the PlayStation 4, it was also technologically inferior and shrouded in controversy due to the way it handled game ownership. Sony infamously made a video showing how to share used games, which only made Microsoft’s stance look all the more foolish.",
    "Microsoft also focused on positioning the Xbox One as an entertainment hub first and foremost instead of a gaming focused machine. Thankfully, those missteps helped the company learn, the fruits of which we’re seeing today.",
    "“So much of what we are today is from that first year of the Xbox One where we got a real cold dose of reality in focusing on not what the customers wanted but what we thought we needed,” Spencer said.",
    "Spencer was also pressed on whether Xbox Game Pass is economically viable, and how Microsoft sees its subscription service moving forward.",
    "“First of all, the goal around Game Pass has always been to make more games more accessible to more people. That is the goal,” Spencer said. “It’s not to turn everyone into a subscriber. We wanted to be an option to people on our platform. We think a content-based subscription has a place in our industry, and I’m proud of the work the team has done.”",
    "But is Xbox Game Pass profitable for Microsoft? According to Spencer, it's not as simple as that.",
    "“When we look at the economics of Game Pass, it’s not just ‘How many games is this subscriber playing in this subscription, and if they would have purchased these games, what’s the trade off in purchase versus subscriber revenue?’” Spencer said. “We never really look at it that way. What we do is say ‘are we growing the number of players on our platform, and are they playing more often. From that activity we see the business grow.”",
    "According to Spencer, engagement is the most important metric for judging success on Xbox platforms.",
    "“The number one metric that we can look at to see if our business is actually growing is, 'are people playing more on the platform?' There’s nothing about review scores, there’s nothing about retail sales of consoles, or retail sale of games; the number one sign that our platform is healthy and growing is actually engagement on the platform,” Spencer says.",
    "While it's hard to deny that the Xbox Series X and Xbox Series S aren't appealing consoles, the biggest criticism Microsoft has faced since the systems launched on November 10 is a lack of games.",
    "That's set to change, however, as six titles are arriving on Microsoft's platforms in the next six months, all of which launch on Xbox Game Pass on day one. Flight Simulator, Psychonauts 2, Back 4 Blood, Age of Empires 4, Forza Horizon 5 and Halo Infinite all launch this year, and should give Xbox owners plenty to play for the rest of the year."
  ],
  "headers": {
    "9": "An insight into Xbox Game Pass",
    "15": "Here come the games"
  },
  "links": {
    "IGN’s Podcast Unlocked": "https://www.ign.com/articles/phil-spencer-interview-20-years-of-xbox-unlocked-500",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Bethesda Showcase": "https://www.techradar.com/news/xbox-series-xs-biggest-problem-has-finally-been-addressed-at-e3-2021",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/reviews/original-2013-xbox-one",
    "PlayStation 4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Back 4 Blood": "https://www.techradar.com/news/back-4-blood-release-date-cross-play-beta-trailers-and-characters",
    "Age of Empires 4": "https://www.techradar.com/news/age-of-empires-4-release-date-trailers-and-features",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite"
  }
}