{
  "source": "https://www.techradar.com/news/users-can-now-sell-unused-domain-names-for-cash-with-godaddy",
  "title": "Users can now sell unused domain names for cash with GoDaddy",
  "category": "computing",
  "updated": "2021-07-08T08:43:18Z",
  "author": "anthony-spadafora",
  "summary": "Use your old business ideas to fund new ones",
  "article": [
    "Getting rid of your old, unused domain names is about to get a whole lot easier for GoDaddy customers as the web hosting company has launched a new service called List for Sale.",
    "When entrepreneurs come up with business ideas, one of their first instincts is to buy a domain name or even multiple domain names for their new ventures. However, not every business idea ends up working out and sometimes these purchased domain names go unused.",
    "With the launch of List for Sale, GoDaddy customers can now easily list and sell their unused domain names for free in order to earn extra cash. If you domain name does end up selling, you'll only have to pay a small commission.",
    "To make things easier for entrepreneurs and others who have purchased domain names they no longer need, List for Sale uses a three-step process to take the hassle out of selling a domain name online.",
    "To get started, GoDaddy domain owners simply need to click the “List for Sale” button in their domain control center. From there, they can set a sales price and also use GoDaddy's GoValue for an estimated appraisal and to create a “For Sale” landing page to let others know their domain is for sale. The domain is the listed on the domain marketplace and domain registrar Afternic which is owned by GoDaddy.",
    "Since releasing in beta back in January, GoDaddy customers have used List for Sale to help sell off their old domains with the highest domain name sold using the service so far bringing in $57,500.",
    "If you're a GoDaddy customer with unused domain names, then List for Sale may be worth a try especially as the service is free to use and could help with earning some extra cash for a new business venture."
  ],
  "headers": {
    "3": "List for Sale"
  },
  "links": {
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "domain name": "https://www.techradar.com/how-to/buy-a-domain-name",
    "List for Sale": "https://www.anrdoezrs.net/click-6361382-11774111?url=https://www.godaddy.com/help/what-is-list-for-sale-27761&sid=trd-us-1288814366471168500",
    "landing page": "https://www.techradar.com/best/landing-page-creator",
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars"
  }
}