{
  "source": "https://www.techradar.com/news/nordvpn-reveals-rebrand-for-its-b2b-offering",
  "title": "NordVPN reveals rebrand for its B2B offering",
  "category": "computing",
  "updated": "2021-09-14T17:30:24Z",
  "author": "anthony-spadafora",
  "summary": "NordVPN Teams is now NordLayer",
  "article": [
    "NordVPN has announced that it will rebrand its cybersecurity solution for businesses NordVPN Teams as NordLayer.",
    "The reason for the rebranding is to facilitate the company's move towards the Secure Access Service Edge (SASE) framework which is the industry-standard in cybersecurity for organizations.",
    "Now as NordLayer, the company's state-of-the-art platform will continue to help enterprise businesses that are scaling fast, have ad-hoc cybersecurity needs and require a solution that is easy to combine with their existing tools. The new name also signifies an adaptive security layer capable of protecting businesses against ever-evolving cyber threats.",
    "Managing director at NordLayer, Donatas Tamelis explained in a press release how the company has outgrown its original name as VPN is now just one of the many tools in its arsenal, saying:",
    "“Our business model has outgrown the name since VPN is now just one of the components in our full-fledged cybersecurity solution. Our approach to cybersecurity for the digital enterprise, however, remains the same - we will continue to offer a solution based on cutting-edge technologies and adaptable to the changing business needs.”",
    "NordLayer's decision to accelerate its push towards SASE was determined by the direction of the cybersecurity industry which is increasingly cloud-based.",
    "According to estimates from the global research and advisory firm Gartner, the SASE industry is expected to grow at a compound annual growth rate (CAGR) of 36 percent until 2025. At that time, cybersecurity firms unable to deliver a SASE offering will likely be forced to settle for niche market opportunities.",
    "NordLayer's cybersecurity solution includes AES 256-bit traffic encryption, next-generation site-to-site tunneling, network access control aligned with Zero Trust principles, two-factor (2FA) and biometric authentication, virtual LAN between company devices and servers, dedicated server functionality, custom private gateway creation, Single-Sign-On (SSO), rooted device detection, threat-block malware protection including DNS filtering and more.",
    "The company has also introduced a revamped logo as well as updated its existing app and website. Its repositioning campaign from NordVPN Teams to NordLayer is set to be fully complete by the end of this year."
  ],
  "headers": {
    "5": "SASE push"
  },
  "links": {
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "NordVPN Teams": "https://www.techradar.com/reviews/nordvpn-teams",
    "SASE": "https://www.techradar.com/news/sase-101-the-threat-aware-network-for-the-cloud-era",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Gartner": "https://www.techradar.com/news/now-could-be-a-great-time-to-snap-up-a-new-desktop-pc",
    "Zero Trust": "https://www.techradar.com/news/businesses-are-replacing-vpns-with-zero-trust-network-access",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "SSO": "https://www.techradar.com/best/best-identity-management-software",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "DNS": "https://www.techradar.com/news/best-dns-server"
  }
}