{
  "source": "https://www.techradar.com/news/rocket-league-on-ps5-is-finally-getting-the-next-gen-update-it-deserves",
  "title": "Rocket League on PS5 is finally getting the next-gen update it deserves",
  "category": "gaming",
  "updated": "2021-08-30T01:53:27Z",
  "author": "axel-metz",
  "summary": "Smoother Soccar",
  "article": [
    "Rocket League, the mega-popular vehicular soccer game from developer Psyonix, is set to receive a long overdue facelift on PS5 as part of a new update.",
    "On August 18, the now-free-to-play multiplayer title will finally take advantage of the PS5’s next-gen bells and whistles thanks to two new enhanced visual settings: Quality mode and Performance mode.",
    "The former will see Rocket League utilize full 4K resolution at 60 fps with HDR, while the latter will allow the game to run at 120fps with a resolution of 2688 x 1512 (around 70% of 4K), also alongside HDR.",
    "Naturally, players will need a compatible 4K TV (check out our guide to the best 4K TVs) to take advantage of the game’s new visual modes, but the update nonetheless marks a major step towards bringing Rocket League in line with the improved capabilities of Sony’s new hardware.",
    "Alongside these visual enhancements come some new skins and decals, too, which arrive as part of a themed update inspired by Sony’s iconic duo, Ratchet & Clank. To claim these aesthetic goodies, players will simply need to log into the game before January 3, 2022. As you’d expect, they will remain exclusive to the PlayStation version of Rocket League.",
    "These performance updates finally bring the PS5 version of Rocket League up to speed with the equivalent Xbox Series X title, which received the same visual enhancements back in November 2020.",
    "In the nine months since the launch of the PS5, Rocket League has been running via backwards compatibility on Sony’s new system, meaning players were essentially experiencing the same visual settings as those on the PS4 Pro.",
    "Performance enhancements matter for games like Rocket League because split-second actions can make all the difference. Running a title at 120fps means the experience for the player is generally much smoother, not to mention the reduced risk of motion sickness – which is always a possibility when performing mid-air somersaults in a jet-powered car.",
    "We’ve put together a handy guide for all the other games on PS5 and Xbox Series X with 120fps support, which includes a deeper dive into why 120fps is better than 60fps, as well as the difference between 120Hz vs 120fps.",
    "As far as Rocket League is concerned, though, the (virtual) playing field is finally level for players on either side of the console fence."
  ],
  "headers": {
    "5": "Analysis: In the same league… finally"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "now-free-to-play": "https://www.techradar.com/news/rocket-league-is-free-from-the-epic-games-store-and-youll-get-a-dollar10-voucher-just-for-downloading-it",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "best 4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "the same visual enhancements": "https://www.techradar.com/news/rocket-leagues-ps5-and-xbox-series-x-update-is-puzzling",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "games on PS5 and Xbox Series X with 120fps support": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support"
  }
}