{
  "source": "https://www.techradar.com/news/dell-xps-13-deals",
  "title": "The best Dell XPS 13 and 15 deals and prices for December 2021",
  "category": "computing",
  "updated": "2021-12-01T13:57:13Z",
  "author": "mackenzie-frazier",
  "summary": "Save on Dell’s leading laptops with these XPS deals",
  "article": [
    "If you're wondering what the best Dell XPS deals are or where to find the cheapest prices you've come to the right place. No matter what size or configuration you're after, you'll find options here from all the big retailers as well as our top tips for scoring a good deal right here.",
    "Thanks to the latest 2021 releases in the XPS range it's also a great time to be looking right now. Not only have you got the option of these gorgeous new bezel-less ultrabooks, but prices on the older models are now lower than ever. We're close to the yearly Black Friday and Cyber Monday sales events (when prices tend to be the cheapest) so things are really starting to heat up now.",
    "If you're undecided on which Dell XPS deal is for you, don't worry, we've got a direct comparison just down below. Scroll down to see a full list of available specs, as well as a price comparison.",
    "The very latest model in the range is the 'Dell XPS 13 9310' - an essentially refreshed version of the excellent early 2020 Dell XPS 13 model. In a sensible move, Dell has kept the absolutely stunning near bezel-less ‘Infinity Edge’ display and overall design while focusing on packing these gorgeous machines with the latest components from Intel.",
    "All 2021 models feature 11th generation Intel Core chips with Thunderbolt 4 compatibility, 8 to 16GB of RAM, and between 256GB to 2TB of SSD capacity. These are right in line with what you'd expect from an up-to-date Windows ultrabook and will have no problem with any task you throw at them - save intensive gaming applications.",
    "As with most brand new XPS 13 models upon release, the latest 2021 XPS 13 debuts at around $1,000 to £1,000 on the baseline Core i3 / 8GB RAM model. It is, however, well worth waiting for big sales events like Dell's July sale, Black Friday, or Cyber Monday as we've seen prices drop dramatically - especially in the US where the record is around $799.",
    "Debuting in early 2020 was the refreshed new-look Dell XPS 13 for that year - the first model to feature the new (at the time) brand new bezel-less ‘Infinity Edge’ display, which remains pretty much untouched on subsequent models.",
    "As you'd expect, this one looks still looks stunning in 2021, with the only main differences being internal specifications. So, if you don't mind getting your hands on a machine with a slightly older 10th generation Intel processor, or perhaps smaller SSD capacities, then this slightly older model is still a fantastic choice.",
    "You may find these particular machines a little hard to get a hold of now Dell has mostly discontinued them or repurposed the chassis for 2021 models with updated components. If you do spot one, however, then you can expect them to be a good £100 to $100 cheaper than the 2021 entries, with savings even reaching the £200 to $300 mark on big sales events like Black Friday and Cyber Monday.",
    "Read the full review: Dell XPS 13 2020",
    "Interestingly, Dell didn't simply retire its older pre-2020 design, it actually turned it into a slightly more budget-orientated model alongside the flagships you see above. We've designated this the '2019' model, but it's technically an older design with upgraded internals. It's not uncommon to see this older chassis with 11th gen Intel Core i5 chips and other up-to-date components in fact.",
    "While it's still sporting the thicker bottom bevels, the 2019 Dell XPS 13's screen is essentially the same quality as the new entry, making it more of an aesthetic upgrade rather than a purely functional one. You're still getting 10th to 11th generation Intel Core i5 / i7 processors here as well and often for around $100 / £100 cheaper than a similarly equipped 2020 model.",
    "Altogether you can pick up a 2019 XPS 13 deal for as little as $700 / £800 if you're lucky and we definitely recommend checking out this great ultrabook - especially around Black Friday and Cyber Monday, where you can often pick up a steal.",
    "Read the full review: Dell XPS 13",
    "The new 2020 Dell XPS 15 debuted as TechRadar's best laptop of 2020 when it launched and it's easy to see why. Not only is it now sporting the same beautiful bezel-less design as its smaller 13-inch sibling, but it stands tall amongst the competition in regards to outright performance and premium design appointments.",
    "Unfortunately being the best comes with a hefty asking price - $1,200 / £1,200 on the base models in this case, which very much puts them above the XPS 13 in the price leagues.",
    "That said, we're sure that these beautiful 15-inch ultrabooks will be receiving some tasty price cuts in the near future, possibly over Black Friday and Cyber Monday in November. Make sure you bookmark this page for the latest, as we'll be updating it with the best Dell XPS prices daily.",
    "Read the full review: Dell XPS 15 (2020)",
    "The 2019 XPS 15 is essentially just an upscaled XPS 13 variant, so subsequently you can expect the same design appointments - and in this case that chunkier bottom bezel.",
    "As such the 2019 XPS 15 very much looks like 'last years model' but don't let that put you off this awesome ultrabook - it's still packing some seriously powerful up-to-date processors from Intel.",
    "What's more, these 2019 models start at an asking price of $1,050 / £1,050 - much cheaper than the brand new entries. Being the older model as well means that Dell is much more likely to throw in the odd discount, which means you can sometimes pick these up for well under a grand - especially around Black Friday and Cyber Monday.",
    "Read the full review: Dell XPS 15",
    "Another fantastic option for those looking for the versatility of a 2-in-1 notebook, the newest Dell XPS 13 2-in-1 manages to not only boast a gorgeous display, but also still packs in some of the latest components from Intel.",
    "Interestingly enough, right now it's also one of the cheapest Dell XPS laptops you can buy, coming in at around $900 / £900 - albeit for a stripped-down Core i3 / 4GB RAM variant.",
    "For plenty of users, those specs will still do the business so it's a great buy for those who want a premium ultrabook but can't afford the heady heights of the XPS 15. What's more, it's one of the older XPS's in the range so Dell is also willing to serve up some great XPS deals - especially around Black Friday and Cyber Monday, which we expect could be up to $150 / £150 off the standard asking price.",
    "Read the full review: Dell XPS 13 2-in-1"
  ],
  "headers": {},
  "links": {
    "Dell XPS 13 2020": "https://www.techradar.com/reviews/dell-xps-13-2020",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "Dell XPS 15 (2020)": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "Dell XPS 15": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-15-1306282/review",
    "Dell XPS 13 2-in-1": "https://www.techradar.com/reviews/dell-xps-13-2-in-1-2019"
  }
}