{
  "source": "https://www.techradar.com/news/cybercriminals-could-be-watching-your-home-security-footage",
  "title": "Cybercriminals could be watching your home security footage",
  "category": "computing",
  "updated": "2021-04-02T16:23:01Z",
  "author": "sead-fadilpasic",
  "summary": "Criminals are selling hundreds of hours of footage online at cheap prices",
  "article": [
    "Chinese hackers are selling thousands of hours of video footage from security cameras installed inside houses, hotels, beauty salons and other locations.",
    "As reported by the South China Morning Post, hackers are both breaking into existing home security feeds and installing new cameras themselves. There are said to be teams of people moving across China, booking into hotels and motels around the country with the sole purpose of installing hidden cameras.",
    "The footage is then either put up for purchase online or streamed live to a paying audience. The recordings cost as little as $3 (for “normal” videos of people doing nothing in particular), with the prices going up if nudity is involved.",
    "Besides clips, people can also buy access to live feeds. Access to cameras in ten households is said to cost $11, while ten hotels and ten households combined costs $23.",
    "According to multiple reports, the architect of this operation has tens of thousands of clips for sale, sharing more than 8,000 in February alone. Speaking to potential buyers, he allegedly said he has so many clips that it would take more than six months to watch them all",
    "He even has a referral program, allowing interested parties to buy his videos in bulk, at a discounted price, and then resell them for a profit.",
    "Perhaps surprisingly, the “ordinary” videos are no less popular than those involving nudity or other explicit content. In fact, videos in which people are performing mundane activities are selling rather well.",
    "“Such videos are primitive. Many people like such kind of stuff nowadays, watching people’s privacy, what they’re doing at the moment … You know what, I have sold this video several hundred times,” the operator is alleged to have said.",
    "Via South China Morning Post"
  ],
  "headers": {
    "4": "Hundreds of hours"
  },
  "links": {
    "security cameras": "https://www.techradar.com/best/business-security-systems",
    "cameras": "https://www.techradar.com/best/best-home-video-surveillance",
    "South China Morning Post": "https://www.scmp.com/news/people-culture/article/3127659/hackers-are-stealing-videos-private-security-cameras-and"
  }
}