{
  "source": "https://www.techradar.com/news/how-pc-grew-into-the-best-couch-multiplayer-platform",
  "title": "How PC grew into the best couch multiplayer platform",
  "category": "gaming",
  "updated": "2021-09-02T10:00:08Z",
  "author": "robert-zak",
  "summary": "It took a lot of time, technology, indie games, and a bit of Resident Evil 6...",
  "article": [
    "PC gaming used to be a lonely experience. Throughout the 90s, the PC’s plentiful storage space and keyboard-mouse combo turned it into the perfect platform for deep single-player genres like strategy, point-and-click adventures and RPGs. We were absorbed in the rich worlds of Fallout and Baldur’s Gate, pored over endless stats in season after season of Championship Manager, and spent dozens of hours leading humanity from the stone age to the space age in Civilization.",
    "With so much on our PC plates, there was no time - nor infrastructure - for other non-NPC humans to play with us unless they were content to stay quiet and watch over our shoulders.",
    "Today, as split-screen adventure It Takes Two continues to dominate the Steam sales charts, it’s fair to say that PC is an established local multiplayer platform. In fact, thanks to the universality of plug-and-play controllers, myriad multiplayer indie games, and tools like Nucleus Co-op, it’s arguably the best couch multiplayer platform around.",
    "The PC’s journey out of its dark closet into the living room - from keyboards to controllers - was not an easy one. It would take several tech breakthroughs, the arrival of indie games and - of all things - the much-hated Resident Evil 6, to get there.",
    "But first, let’s offer some perspective on what multiplayer gaming on PC looked like in the 90s. At the same time that SNES owners were seamlessly playing Super Mario Kart together on one screen, we on PC would have to use adapters or screw some third-party controller into our rig via a DA-15 ‘Game Port’, get a splitter box like the one below for it to accommodate two controllers, calibrate each controller, pray that a given game supports gamepads, then manually configure the keybindings for that game.",
    "All that effort just to play with one other person.",
    "Given that Game Ports had been around since the 80s and were designed for analog joysticks rather than digital gamepads, they struggled with digital inputs - anything with more than two buttons was a technical problem. Controllers like the Gravis PC GamePad (1991) and later the Microsoft Sidewinder found ways to work with the Game Port - the latter even let you daisy-chain two controllers to one port - but for the most part hooking up more than one controller was an ordeal until USB replaced Game Port as the industry standard in the late 90s.",
    "Alternatively, you could just assign two players to separate corners of the keyboard. And while there was a cozy kind of fun to playing four-player Liero or two-player Super Street Fighter II Turbo and getting territorial about other players’ pinkies encroaching onto your side of the keyboard, the PC clearly wasn’t fit for multiplayer purpose.",
    "And it wouldn’t really need to be, because in the latter half of the 90s the PC pulled off its greatest multiplayer trick - online gaming. Games like Quake (1996) and Ultima Online (1997) suddenly made the idea of chopping your screen up into quarters to play with a few friends look a little primitive when you could play alongside dozens or even thousands simultaneously.",
    "Of course, we know now that online play can’t possibly recreate the joy and immediacy of playing alongside friends, but at the time this was trailblazing stuff. Online gaming felt like the future, and given that PC came pre-baked with all the requisite hardware for it (i.e. online access), it was a no-brainer for developers to explore this mysterious new realm.",
    "As we tipped into the new millennium, even on consoles the momentum was shifting towards online multiplayer. Tentative early efforts on the Sega Dreamcast, PlayStation 2 and Xbox would pave the way for the first fully-fledged online consoles, Xbox 360 and PlayStation 3 in 2005 and 2006. Even though these consoles could accommodate more local players than ever thanks to the miracle of wireless Bluetooth controllers, publishers and developers were deprioritizing local play in favor of online.",
    "For a brief moment, it not only looked like local multiplayer wouldn't come to PC, but that it might be ousted from consoles too.",
    "But at the same time that the big publishers had their eyes online, indie developers were taking advantage of the fast-growing digital storefronts - PlayStation Network, Xbox Live and Steam - to release games without the hefty overheads previously required for physical releases. Because of their cost-efficiency, pixel and hand-drawn graphics were coming back into fashion, and the low technical demands of these games would eventually make them a great fit for local multiplayer (not to mention the fact it was cheaper to develop local multiplayer modes than online).",
    "Xbox Live and PlayStation Network rode this new multiplayer wave more than Steam. In the mid-late 2000s, hits like Bomberman Live, Castle Crashers, even re-releases of the original Dooms and Duke Nukem 3D, all supported local play on consoles, while the PC was being left behind. It was the same story with bigger games too, where titles with split-screen support on console - Borderlands, Minecraft, Left 4 Dead, Call of Duty and Resident Evil 5, to name a few - would cut the feature from their PC iterations.",
    "Why was this? First of all: controllers. While the USB connectivity of PS3 and Xbox 360 gamepads made connecting them to PC that bit easier than in previous generations, you’d still need dongles or dodgy third-party software to get them working wirelessly. It certainly helped that in 2005, Microsoft introduced the Xinput API, which meant that Xbox 360 controllers got USB plug-and-play support with PC. But neither gamers nor game-makers were taking advantage on a big scale. The PC was still very much seen as a keyboard-and-mouse platform, and its games reflected that.",
    "It also took PCs a while to catch up to TV when it came to HDMI support. Even around 2008 and 2009, HDMI still was far from ubiquitous on PC, while it was widely used on consoles and TVs. As HDMI became a more standardized feature on PCs and laptops around the end of the decade, it not only allowed for PCs to be more easily connected to TVs, but the average size of PC screens grew too, making the prospect of living-room PC gaming - and sharing a screen - more palatable.",
    "Once HDMI bridged the gap between PC and TV, the next big leap came in 2012. On the indie scene, couch co-op hit Castle Crashers finally came to Windows, but more notably the much-maligned Resident Evil 6 was one of the first big-budget franchises to offer split-screen support on PC.",
    "Capcom got a lot of things wrong with the sixth entry in their revered horror franchise, but that didn’t stop Resident Evil 6 from becoming the fastest-selling series game to date, shifting 4.5 million copies in two days (it’s sold between one and two million copies on Steam). Given that it was heavily marketed as a co-op game, its commercial success became a vindication of sorts for co-op gaming, while promoting the image of PC as a viable platform for it.",
    "Just months later, Valve launched Big Picture mode for Steam - a console-like interface that lets you navigate Steam entirely using a gamepad. It was designed to facilitate living room and gamepad gaming - key ingredients to couch multiplayer. At the time, there were only 41 games with full controller support on Steam, though notably in December 2012 Valve patched Portal 2 to include split-screen co-op like its console counterparts.",
    "Even if Resident Evil 6 wasn’t directly responsible for Valve’s local multiplayer-minded decisions, it certainly presaged them.",
    "The PC’s age-old controller compatibility headaches were all but solved in the subsequent console generation. In 2013, both PlayStation 4 and Xbox One controllers offered seamless plug-and-play connectivity via Bluetooth and USB. It’s interesting to note that Steam wouldn’t officially support PS4 controllers until three years later in 2016, but with the recent launch of the PS5 it took Steam just a month to support its DualSense controller - a sign of how much more of a priority controller support on PC has become over the years.",
    "From 2013 it’s been full Steam ahead. Today, over 48 million players use controllers on Steam. The platform is brimming with thousands of local multiplayer and party games, while over 24,000 games offer full controller support (up from 41 less than a decade ago). Many of Steam’s local multiplayer games can now be played online via Remote Play, streaming them to your friends even if they don’t own it, while the Steam Link app - widely available on Smart TVs - can beam Steam from PC to TV in 4K. Then there’s Xbox Game Pass for PC, which is fast gaining a reputation as a treasure trove of couch co-op beat-em-ups, roguelikes, and other titles best enjoyed when rubbing shoulders with a buddy.",
    "Some series - like Call of Duty and Borderlands - continue to overlook local multiplayer on PC, but where developers dare not (or can’t be bothered to) go, modders almost always will. The popularity enjoyed by the tool Nucleus Co-op [link to Nucleus Co-op guide?], which adds remarkably smooth split-screen functionality to hundreds of PC games, speaks to the continuing player demand for this venerable gaming feature. The whole Borderlands series and a couple of Call of Duties are included, though you can find the full list of games that work with Nucleus on the Nucleus Co-op subreddit.",
    "So grab your console controller of choice (they all work), grab some friends, boot up Steam Big Picture and gather round, because the PC is not only a viable local multiplayer platform - it’s the most versatile one around."
  ],
  "headers": {
    "6": "At least we had Quake",
    "9": "A lonesome time for PC gaming",
    "14": "No split screen for PC",
    "16": "The times are changing",
    "20": "The unsung hero of couch co-op on PC?"
  },
  "links": {
    "It Takes Two": "https://www.techradar.com/news/josef-fares-it-take-two-handles-divorce-in-the-sweetest-way-possible",
    "Big Picture mode for Steam": "https://www.techradar.com/news/steam-big-picture-mode-is-getting-an-overhaul-thanks-to-steam-deck",
    "48 million players use controllers on Steam": "https://www.pcgamer.com/48-million-players-use-controllers-on-steam/",
    "local multiplayer and party games": "https://store.steampowered.com/category/multiplayer_local_party/",
    "over 24,000 games offer full controller support": "https://store.steampowered.com/search/?category2=28",
    "the Nucleus Co-op subreddit": "https://www.reddit.com/r/nucleuscoop/comments/fjdqid/list_of_new_supported_games_and_faq/"
  }
}