{
  "source": "https://www.techradar.com/news/sony-state-of-play-october-2021-10-game-trailers-you-have-to-watch",
  "title": "Sony State of Play October 2021: 10 game trailers you have to watch",
  "category": "gaming",
  "updated": "2021-10-28T11:10:17Z",
  "author": "david-lumb",
  "summary": "Here are all the best trailers from Sony's October State of Play event",
  "article": [
    "The latest Sony State of Play had plenty of indie game trailers and updates on titles we’ve been hearing about for years, but few updates on the big PS5 games we’re expecting to see over the Christmas holiday season.",
    "The biggest news is a trailer for the first Bugsnax DLC, which brings bigger bugs to the island in early 2022 for the appealing price of absolutely free. A new Star Ocean game was revealed (Star Ocean: The Divine Force), which will come exclusively to PS5 (and PS4) sometime in 2022. And we got our first look at King of Fighters XV, the first new game in the storied franchise in five years – and though it’s not coming until February 2022, a beta test will give players the chance to try it out for a late November weekend.",
    "But we especially missed updates on bigger upcoming titles, which we thought could include Call of Duty: Vanguard, Battlefield 2042, Stray, Final Fantasy 14: Endwalker expansion or maybe even GTA 5 on PS5. Still, if you were eager for deeper looks at upcoming indies like Little Devil Inside, Five Nights at Freddy’s Security Breach, or other newly-announced indies, check out the trailers below.",
    "Deathverse: Let It Die is the latest “survival battle arena” title to come out in recent years, with this one set in a dystopian future hundreds of years after the events in Grasshopper Manufacture’s Let It Die.",
    "In addition to traditional PvPvE combat, the game will feature various customization options as you climb the leaderboards in various matches.The game is set for a 2022 release, but we’ll let you know more when we hear anything else.",
    "We Are OFK is a new five-part visual novel-esque game featuring four 20-somethings trying to break into the music industry in Los Angeles while falling in love, breaking up, and generally trying to make it in the world.",
    "Each part will culminate with the making of an interactive music video for one of the virtual band’s singles, and while we can’t say for sure how interesting the music will end up being, at least it isn’t another battle royale that no one needs or wants.",
    "Five Nights at Freddy’s will return before the end of the year on PS4 and PS5 to offer some frightening new jumpscares for fans of the horror genre. The trailer shown off at Sony’s latest State of Play event showed off a new wearable costume that will help protect you from the incoming mechanical monstrosities haunting the complex, but only for a limited time.",
    "With four mascots on the hunt at all times, surviving the night will be a challenge – but one that fans will be eager to take on for themselves when the game launches on December 16, 2021.",
    "One the PS5’s first big indie hits, Bugnsax, will be getting its first piece of DLC in early 2022. Called Bugsnax: The Isle of Bigsnax, the free update will open up a new area of the world that’s full of, well, Bigsnax. These monster-sized Bugsnax will need to be caught for observation (and dinner) which will put even seasoned hunters to the test. They also wear hats… for some reason.",
    "In addition to going toe-to-toe with the Bigsnax, players will also be able to upgrade their huts with some fun new customization options as well. It looks like a fair amount of content, especially for the zero-dollar sticker price.",
    "Death’s Door is an action-adventure game from developer Acid Nerve that blends fast-paced combat and a hand-drawn art style for a unique twist on the genre. Think the Souls games meets the aesthetic of Beetlegeuse and you’ll be on the right track.",
    "The game made its debut on Xbox and PC back in July of this year, and now it's PlayStation gamers’ turn to take on the role of the corvine protagonist starting on November 23 when it launches on PlayStation consoles.",
    "Kartrider: Drift is the latest entry into the free-to-play online multiplayer Kartrider racing franchise, which has seen over 300 million get behind the wheel for some race-track, arcade-style mayhem.",
    "Originally released on the Xbox One and Xbox Series X|S, this popular title is now making its way to PlayStation 4 and PlayStation 5 and includes crossplay, so you can have fun with your friends regardless of which platform you’re on.",
    "Originally expected to release in June 2021, we got another look at the PlayStation-exclusive Little Devil Inside and its lovely (yet deadly) world. When players take on jobs, they travel overland on a picturesque world map, lush and reminiscent of seeing the English countryside from above – but when they get to their destination, they must fight against monsters, weather, and perhaps an animated boiler or two.",
    "Little Devil Inside for PS5 and PS4 has been pushed back to 2022, and we don’t have a release date yet.",
    "The latest game in the King of Fighters franchise since King of Fighter XIV in 2016, the upcoming King of Fighters XV will be the first in Unreal Engine 4, and it looks gorgeous with slightly cell-shaded style that’s less cartoony than Street Fighter V.",
    "KOF XV, as it will undoubtedly be referred to, has a release date of February 17, 2022 – but fans can get an early look with a brief open beta test on November 19, 2021 from 7pm PT to November 22nd at 7am PT, and will be live in the US, Japan, and Europe.",
    "Following the success of Among Us, it’s no surprise that we’re getting another flavor of the ‘social dedication game’ genre – studio Invisible Walls’ First Class Trouble. This time, players are passengers on a retro-styled space cruise ship pitting the many ‘residents’ against the deceptive ‘personoids’ trying to sabotage and kill.",
    "The atomic age trappings and customizable player costumes in a 3D world could give players another shot at ruining friendships when First Class Trouble comes to PS4 and PS5 on November 2, 2021.",
    "The storied JRPG franchise Star Ocean will officially make its debut on PS5 with Star Ocean: The Divine Force sometime in 2022. The game, which will also be available on PS4, follows the crew of a downed starship as they struggle with the planet’s alien inhabitants. Gameplay looks and feels like the Monster Hunter franchise, but the space-age aesthetic and unique weapon options help set the two apart.",
    "Interestingly, the Star Ocean franchise has been on every PlayStation home console since the very beginning so it’s great to see that trend continue with the latest and greatest PlayStation hardware."
  ],
  "headers": {
    "3": "Deathverse: Let it Die",
    "5": "We Are OFK",
    "7": "Five Nights at Freddy’s Security Breach",
    "9": "Bugsnax: The Isle of Bigsnax DLC",
    "11": "Death’s Door",
    "13": "Kartrider: Drift",
    "15": "Little Devil Inside",
    "17": "The King of Fighters XV",
    "19": "First Class Trouble",
    "21": "Star Ocean: The Divine Force"
  },
  "links": {
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Final Fantasy 14": "https://www.techradar.com/news/live/final-fantasy-14-endwalker-live-blog-come-and-experience-the-launch-with-us",
    "GTA 5 on PS5": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x"
  }
}