{
  "source": "https://www.techradar.com/news/twitter-is-about-to-launch-super-follows-but-what-is-it",
  "title": "Twitter is about to launch Super Follows - but what is it?",
  "category": "computing",
  "updated": "2021-06-07T14:35:51Z",
  "author": "daryl-baxter",
  "summary": "It’s a bird, it’s a tweet, it’s.. Super Follows",
  "article": [
    "As noted by a prolific tester, Twitter looks to be launching yet another feature for its users in the form of Super Follows, its take on Patreon and Ko-Fi.",
    "Twitter is firing on all cylinders as of late in seeing what features stick for its users so that it can depend less on the ad revenue that’s kept it going since its launch in 2007.",
    "With Ticketed Spaces about to roll out, alongside the subscription service Twitter Blue soft-launching in Australia and Canada, smaller features look to be released to a wider audience very soon.",
    "With this in mind, Super Follows looks to be the next small feature to be announced to the masses.",
    "Think of it like a Patreon. Unlike the TipJar feature they soft-launched last month, this allows a ‘Super Follower’ to access perks such as exclusive tweets and content that regular followers can’t access or see in exchange for a paid subscription.",
    "Users can set the monthly price and the content will be shown at the top of the subscriber’s feed.",
    "The requirements for someone to set this up is easily achievable:",
    "From Jane’s tweet, it looks as though the feature is almost ready to be rolled out. Twitter Blue was in the same circumstances a month ago before it was rolled out to Canada and Australia soon after.",
    "With the subscription service rumored to be arriving in more countries very soon, alongside Spaces to be rolled out to more devices such as the iPad even sooner, it looks like we may see a summer rollout of Super Follows to arrive sooner rather than later."
  ],
  "headers": {
    "4": "What are Super Follows?",
    "7": "When is it available?"
  },
  "links": {
    "Ticketed Spaces": "https://www.techradar.com/news/twitter-announces-ticketed-spaces-what-is-it-and-when-can-you-use-it",
    "Twitter Blue": "https://www.techradar.com/news/twitter-blue-subscription-service-unveiled-but-its-missing-a-crucial-feature",
    "TipJar feature": "https://www.techradar.com/news/twitter-starts-testing-tip-jar-for-some-users-but-what-is-it"
  }
}