{
  "source": "https://www.techradar.com/news/nintendo-switch-success-not-a-surprise-says-former-nintendo-president",
  "title": "Nintendo Switch success ‘not a surprise,’ says former Nintendo president",
  "category": "gaming",
  "updated": "2021-02-17T17:11:38Z",
  "author": "rhys-wood",
  "summary": "The Regginator has weighed in",
  "article": [
    "It’s no secret that the Nintendo Switch has been a huge comeback success for Nintendo, and one person who apparently had complete faith in the device from the start is Reggie Fils-Aime, former president of Nintendo of America, who shared his thoughts about the Switch in an interview.",
    "In the interview with Gamertag Radio, Fils-Aime recalled how when he first saw the Switch, “I knew it was going to be magical.” He cited how the company was able to identify a gap in the market, that gap being the lack of portability of most gaming devices.",
    "As summarized by Nintendo Everything, Reggie elaborated on the importance of the portable nature of the Switch, saying: “...I’m playing my game, and now I need to stop because I got to go to work, or I gotta go to school, and I can’t take my game with me. I can’t continue playing that game. So Switch, with the opportunity to play on that big screen TV, then take it out of the dock and go play in handheld mode, it met a fundamental consumer desire.”",
    "To the casual observer, Reggie’s comments might seem a bit boastful, but it’s important to remember the state Nintendo was in prior to the Switch’s launch. The company had found success with the handheld 3DS, though its flagship console at the time, the Wii U, fell far short of expectations largely due to its confusing name and poor marketing.",
    "The Wii U began to move away from the appeal of the Wii’s motion-based controller, and wasn’t quite as powerful or portable as the Switch is today. The Wii U, then, found itself stuck between a rock and a hard place as its competitors left it in the dust.",
    "Since the Switch’s launch almost four years ago, Nintendo has sold over 70 million units. For comparison’s sake, the Wii U’s lifetime sales totaled only 13.56 million units. The Wii U had its share of great games, but its own portability tech wasn’t quite as robust and compact as we now see with the Switch – the Wii U could be played remotely via the Gamepad controller, but it had to remain close to the console itself in order to function properly.",
    "Now the Switch has largely cannibalized the Wii U’s library with no shortage of enhanced ports and sequels. Nintendo has also continued to emphasize portability as a selling point, with the Nintendo Switch Lite – the portable-only version of the console – offering a cheaper option for those who prefer gaming on the go."
  ],
  "headers": {
    "3": "Taking names"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "the interview": "https://youtu.be/IpzM3oIZOQE",
    "Nintendo Everything": "https://nintendoeverything.com/reggie-not-surprised-that-switch-has-become-a-huge-success-made-his-retirement-decision-easier/",
    "over 70 million units": "https://www.statista.com/statistics/687059/nintendo-switch-unit-sales-worldwide/#:~:text=Since%20its%20launch%20on%20March,over%2070%20million%20consoles%20worldwide."
  }
}