{
  "source": "https://www.techradar.com/news/apple-watch-7-is-likely-to-be-big-but-that-might-not-be-a-good-thing",
  "title": "Apple Watch 7 is likely to be big, but that might not be a good thing",
  "category": "wearables",
  "updated": "2021-08-26T09:49:09Z",
  "author": "james-rogerson",
  "summary": "One more millimeter",
  "article": [
    "A leak recently suggested that the Apple Watch 7 could be bigger than any previous model, and now a new leak again points in this direction.",
    "DuanRui, a Twitter user who mostly reposts leaks from Chinese social media, has done just that, sharing an image of what appears to be a leather watch strap with the text ‘45mm’ on it. This strap is supposedly intended for the Apple Watch 7.",
    "For reference, the Apple Watch 6 comes in 40mm and 44mm sizes, so this would be slightly bigger than the largest Apple Watch 6 version. If other sizing leaks are accurate then we could also see a 41mm Apple Watch 7, which again would be an increase in size over the previous model.",
    "That said, we’d take this latest leak with a large helping of salt. The strap shown might not be intended for an Apple Watch, or the 45mm text on it could have been Photoshopped.",
    "We’d be especially cautious about it because it’s not clear who the initial leaker was, or whether they have much of a track record. DuanRui for their part is keen to emphasize that they have no inside information and aren’t themselves a leaker – they just repost Chinese leaks that western audiences might otherwise miss.",
    "Still, we now have at least two sources pointing to a 45mm size, and only one previous leak that seems to contradict this (suggesting a 44mm size again), so based on the available evidence we’d say a size increase is looking fairly likely.",
    "While the trend with smartphones is for them to get ever bigger, we’re not sure smartwatches should follow the same trajectory. Most people probably don’t want a chunky object on their wrist – that adds size and weight, when a watch should be more of an accessory that you can forget you’re wearing.",
    "The smart functionality requires a screen that you can interact with of course, but minimally so – you’ll mostly just be glancing at notifications, and with things like voice controls and a Digital Crown there’s not too much tapping and swiping required even when users do interact with it, so a small size needn’t be an issue.",
    "Of course, we’re sure some people will relish a size increase, if one is indeed coming, and an extra millimeter probably won’t make much of a difference to those who don’t want a weightier wearable.",
    "But this wouldn’t be the first time Apple has increased the size of its smartwatches, and it’s a trend that we’re not sure we want to continue – at least not unless smaller options continue to be offered too.",
    "Via 9to5Mac"
  ],
  "headers": {
    "6": "Opinion: bigger isn’t always better"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "bigger than any previous model": "https://www.techradar.com/news/apple-watch-7-could-be-the-biggest-apple-watch-yet",
    "DuanRui": "https://twitter.com/duanrui1205/status/1430698847450189824",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "suggesting a 44mm size again": "https://www.techradar.com/news/apple-watch-7-renders-show-that-it-might-be-inspired-by-the-iphone-12",
    "9to5Mac": "https://9to5mac.com/2021/08/25/another-leaker-corroborates-apple-watch-series-7-coming-in-new-45mm-size/"
  }
}