{
  "source": "https://www.techradar.com/news/spoke-and-qualcomm-launch-new-road-safety-system-for-cyclists",
  "title": "Spoke and Qualcomm launch new road safety system for cyclists",
  "category": "fitness",
  "updated": "2021-08-13T16:42:17Z",
  "author": "tom-may",
  "summary": "Exchange safety data with other users, up to 1km apart",
  "article": [
    "Anyone who switches to a bike or e-bike after years of not cycling may find it slightly unnerving, especially if you've become used to the level of protection and advanced safety features of a modern car. At the most basic level, it's quite weird that you can't see what's behind you, like you can in a car mirror.",
    "But where there's a need unmet, the tech world is usually working away to fix it. And so Spoke, a mobility platform for safety, connectivity and rider experiences, has just announced a new partnership with semiconductors and wireless comms giant Qualcomm, to improve road safety for cyclists, e-scooter users and pedestrians.",
    "As part of this relationship, they've unveiled a smartphone-sized C-V2X (Cellular vehicle-to-everything) device, which can be paired with a bike computer and help improve your awareness of upcoming hazards and vulnerable road users.",
    "The device will both advertise its position to, and receive messages from, other C-V2X-equipped vehicles, to alert riders to hazards around them. The system is capable of anonymously sharing data between devices up to around 1km apart.",
    "These messages, which can be displayed on a smartphone, will convey useful safety information to drivers such as upcoming hazards, or the presence of vulnerable road users, such as cyclists, pedestrians, or e-scooter riders on the road. The ultimate aim is to reduce congestion and crashes.",
    "Spoke's new portfolio of products, which will also include modem-based communications, will be launching in 2022.",
    "“This is game-changing connectivity for both safety and for the mobility experience overall,” says Jarrett Wendt, Spoke CEO. “For the first time, Spoke will provide dedicated hardware and software, what we refer to as vulnerable road user-to-everything (VRU2X), to unlock V2X communication to the most vulnerable users.”",
    "C-V2X is is based on low-latency direct communication between VRUs, vehicles and roadside infrastructure in the 5.9 GHz ITS spectrum, and should work pretty much anywhere, as it doesn't rely on cellular networks. It is, however, compatible with 5G networks, as well cloud-based APIs, providing potential for AI/machine learning to enhance safety features.",
    "“Spoke was born from a passion to reduce rider vulnerability, prevent crashes and save lives using an innovative adaption of technology that is available today,\" adds Wendt. \"There is tremendous opportunity to deliver a safer, richer, more dynamic trip experience.",
    "“We are confident that through our work with various stakeholders, including Qualcomm Technologies, we will be able to reach our goal of including the most vulnerable road users in the intelligent transportation ecosystem equation.”"
  ],
  "headers": {},
  "links": {
    "e-bike": "https://www.techradar.com/best/electric-bike"
  }
}