{
  "source": "https://www.techradar.com/news/i-thought-minecraft-rtx-was-a-gimmick-and-then-i-played-the-damn-thing",
  "title": "I thought Minecraft RTX was a gimmick, until I played the damn thing",
  "category": "gaming",
  "updated": "2021-04-03T13:37:06Z",
  "author": "jess-weatherbed",
  "summary": "Breathtakingly beautiful Bedrock",
  "article": [
    "I've been a huge fan of Minecraft almost as far back as its initial release – over a decade ago if anyone else needs to feel older than they should – and though I haven't played it consistently over the last few years, it's always been something I crawl back to when I need a few chill evenings away from competitive gaming environments. When the beta for Minecraft with RTX was announced, I was actually rather confused. A large reason I loved the game was because of its ridiculously low system requirements. You can almost run it on a toaster if needed, but its accessibility was a great selling point. Whether it was my beaten-up laptop or the old family desktop computer, it was always a game that my siblings and I could play. The friends I had back then that could afford dedicated gaming computers could run beautiful games that demanded beefier components, even when the graphics in games like Skyrim or Crysis 2 reduced down to the lowest playable settings. Minecraft was an equal playing field, not in a unique sense, but the popularity of a game that made zero effort to look 'pretty' was truly impressive. At the end of the day, a block was a block.",
    "Only, it isn't anymore. I was skeptical of putting ray tracing into a game like Minecraft because to me, it didn't make sense. RTX was for games like Cyberpunk 2077 or Metro Exodus, graphically demanding titles that seduced your eyeballs with buckets of atmosphere and semi-realistic environments. RTX Minecraft felt like adding sparkles to Lego.",
    "Having been lucky enough to get my hands on an Nvidia GeForce RTX 3060 graphics card, I finally have access to ray tracing in games and now that I've played through a few old favorites that have been enhanced by the fancy lighting effects, I'll admit that Minecraft was the game that truly knocked my socks off.",
    "This could be because the game was so simple to begin with – I went in not expecting to be as blown away as I was, so the results took me completely by surprise. I was previously struggling to imagine how a lump of pixelated blocks would be enhanced enough to justify the low hardware requirements being sacrificed.",
    "The original version of Minecraft obviously isn't going anywhere so I'll still be happily running around on java for many years to come, but looking back, I think a great deal of my initial skepticism was actually FOMO due to the older gaming PC I was rocking at the time. Minecraft RTX was in beta before the launch of the Ampere GPU series, so the only folk who could play it at the time were those who had the cash for the pricey Nvidia Turing hardware.",
    "While the Nvidia Ampere cards are sadly harder to find than Ender Pearls, they are more affordable (if found at MSRP), and with the way games are heading, it's important that features like DLSS and RTX become more accessible. An Nvidia GeForce RTX 3060 retails for around $329 (about £240, AU$430) depending on what version you buy, or the more powerful Nvidia GeForce RTX 3060 Ti can be found for $399 (about £299, AU$540). The minimum requirements for Minecraft RTX right now are as follows:",
    "You'll also need to be running the Bedrock version of the game rather than Java, so check what game edition you have before you get frustrated over missing features. If you're wanting to create your own world then you should check out guides that go through creating your own Physically Based Rendering (PBR) textures or upgrading existing texture packs for the full ray tracing experience. As you may have already seen from the images, I also chose to dive into a premade world, mostly because I'm a massive Lord of the Rings dork and couldn't pass up the opportunity to explore Minas Tirith. You can download it for yourself here if you too want to reenact scenes from Return of the King with your friends.",
    "Naturally, the lighting is utterly incredible when you step into any RTX-enabled world. The initial beta appeared to give a plastic-like sheen to just about everything, but this seems to have been fixed in the official release. During sunrise and sundown, the foliage and buildings are beautifully illuminated with warm light, and it's really surreal how such blocky game can look this good. In traditional Minecraft Bedrock, texture files only use base color and opacity maps to create the now iconic look that helped to popularize simple graphics in sandbox games again. The new PBR system adds additional textures to this to really help the surfaces pop with realistic lighting. These are Metallic, Emissive (or 'glowy'), Roughness, and Height. When used in combined situations like base building you really get to see some breathtaking results. The torches in your cubic cabins will shine on metal surfaces like a mirror, while carpeted or other textured surfaces like wood will have nicely contrasting shadows and grooves. The water effects nearly caused me to have some sort of anxiety attack, being accustomed to the original Minecraft diving in which underwater just resembles a slightly bubbly (but otherwise perfectly clear) version of the rest of the land. Not the case with ray tracing though – when I dove under for the first time my real-life fear of the water (or thalassophobia, if you feel fancy) was triggered hard. What had originally been complete visibility was now reactive to how much light was available, creating a murky aquatic hellscape. If you don't share my fear then you'll likely love how strangely accurate it is being underwater, a trippy effect for a game that was never intended to emulate realism. Fish and other marine life swim out of the murk towards you, light shines through in beams from the surface and in shallow water even I found myself muttering \"gosh, this is lovely\" despite myself.",
    "The combined effect is almost like an entirely new game. If someone had slapped 'Minecraft 2' onto this I'd have believed them given the drastic difference in the graphics. The dungeons are creepier, the jungles feel more alive and I feel I'll have a hard time going back to the organic graphics of the base game having experienced such luxury. Speaking of which, you'll need to make sure DLSS is activated in Nvidia GPUs to enjoy RTX at its best, given how much of a frame rate sacrifice is required to crank up the visuals for these effects. With everything cranked up to full on performance mode I was getting a comfortable average of 50fps on an EVGA GeForce RTX 3060, but without that lovely AI framerate booster it was slugging along at around 15fps. If you have the compatible hardware to actually try Minecraft RTX for yourself then I'd really recommend giving it a go, especially if you're an established fan of the game. I had initially dismissed it based on my own snobbish belief around ray tracing, and having a play around in Mojang's pixel sandbox certainly opened my eyes to the possibilities of how it can be applied outside of already demanding AAA titles. If it works this well on such a simple game then what else can we do with it? My eyes have been opened to the possibilities. I also initially snubbed it being used in games like Fortnite, but from the footage I've seen streamed of the game it really does look wonderful. I could probably even be sold by RTX Sims at this point.",
    "There is a fair bit of discussion surrounding how technology like DLSS and raytracing could be the 'new normal' for future releases, a thought that initially scared me given how much of the PC gaming community uses older hardware. The Steam Hardware Survey at the time of writing has the GTX 1060, GTX 1050 Ti and GTX 1650 graphics cards taking up the top 20% of all current GPUs, so RTX and DLSS will still be unachievable for many. I'm keeping all my fingers crossed that something gives to end the current graphics cards shortage, be that the Etherium boom ending or simply providing more availability for the GPUs. If more folk get the opportunity to upgrade to the new budget RTX cards then features like ray tracing can be enjoyed across more games by the wider community."
  ],
  "headers": {
    "1": "Minecraft RTX won't run on potato machines",
    "7": "I'm a ray tracing convert"
  },
  "links": {
    "Minecraft": "https://www.techradar.com/how-to/how-to-download-minecraft-for-pc",
    "Minecraft with RTX": "https://www.techradar.com/news/minecraft-rtx",
    "Crysis 2": "https://www.techradar.com/news/computing/crysis-2-minimum-requirements-for-pc-surface-925662",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Nvidia GeForce RTX 3060 graphics card": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "Nvidia Turing": "https://www.techradar.com/news/nvidia-turing",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "Nvidia GeForce RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "download it for yourself here": "https://www.planetminecraft.com/project/minecraft-with-rtx-minas-tirith-by-minecraft-middle-earth/#update_logs"
  }
}