{
  "source": "https://www.techradar.com/news/your-android-tv-is-getting-a-free-upgrade-to-google-tv-today",
  "title": "Your Android TV is getting a free aesthetic upgrade today",
  "category": "televisions",
  "updated": "2021-02-03T17:00:12Z",
  "author": "nick-pino",
  "summary": "Android TV devices in some countries should see the new UI in the next 24 hours",
  "article": [
    "Google is rolling out a new user interface to Android TVs, starting in the US, Australia, Canada, Germany and France, with more countries to follow in the coming weeks.",
    "The update will add three new tabs – Home, Discover, and Apps – that should make content easier to find, and will make older TVs look like the new Chromecast with Google TV.",
    "So what’s changing? Well, the home screen will now have more content recommendations from the services you use the most, while the Apps tab will collect all of your installed apps.",
    "Last up, the Discover tab is more or less a better version of the existing Android TV UI that shows you what movies are trending and can recommend things for you to watch across more services. It’s there you’ll also see groups of shows and movies that share the same genre (similar to how Netflix lumps content together) which should make it easier to find, say, a new comedy after binge watching The Office again on Netflix.",
    "While it's not exactly the full-on Google TV upgrade we were expecting to see, the new user interface does have a Google TV-like aesthetic to it.",
    "That being said, you're not missing out on much as there's not a major change in functionality between the two platforms – both have Chromecast Built-in, for example – though Google TV is a bit more user-friendly than the stock version of Android TV.",
    "Despite not being very different from one another, Google TV is the more modern of the two platforms, so it might still be worth picking up a Chromecast with Google TV if Android TV is running a bit slow."
  ],
  "headers": {
    "4": "Free upgrade for your smart TV"
  },
  "links": {
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv"
  }
}