{
  "source": "https://www.techradar.com/news/graphics-cards-could-get-even-more-expensive-next-year-heres-why",
  "title": "Graphics cards could get even more expensive next year, here's why",
  "category": "computing",
  "updated": "2021-08-26T18:51:17.341Z",
  "author": "jackie-thomas",
  "summary": "More and more expensive",
  "article": [
    "Unless you've been living under a rock, you've probably noticed that most computing products like graphics cards and processors are more expensive than ever. And, well, they could be getting more expensive soon, as TSMC may be rising its semiconductor prices.",
    "According to the Wall Street Journal, TSMC (Taiwan Semiconductor Manufacturing Company) is looking to raise prices by as much as 20% in order to offset the huge spike in demand for chips. And while PC gamers are feeling it because it's hard to buy a graphics card, this global silicon shortage is affecting everything from the iPad to automotive manufacturing.",
    "Right now, it remains to be see exactly how much the prices for TSMC's product will go up, but according to WSJ's sources, prices would go up 10% for its most advanced chips and 20% for chips using older technologies. Luckily, graphics cards and desktop processors are usually using the cutting edge manufacturing processes, so should be somewhere on the lower end of the scale.",
    "We also don't know whether or not manufacturers will pass on these costs to consumers, but it's probably safe to assume they will. As for how much prices will go up on store shelves, it remains to be seen, but it's not like graphics cards are exactly affordable right now either way.",
    "Because of the hardware shortage we're going through right now, pricing is just kind of all over the place, even before taking this news into consideration. While we praised the Nvidia GeForce RTX 3080 for not being more expensive than the RTX 2080 when it launched, it didn't take long for resellers to make Nvidia's reasonable MSRP seem like a pipe dream.",
    "Now that the Nvidia GeForce RTX 3080 has been out for nearly a year, you'd be hard pressed to find any version of the graphics card that sells for the $699 that Nvidia quoted when it launched the GPU back in September 2020. Most third-party graphics card manufacturers have raised their prices, and they're still selling out the second they become available.",
    "Now, Nvidia won't necessarily be affected by TSMC's price increases, as Team Green has been using Samsung's 8nm process for its Nvidia Ampere graphics cards, but it will absolutely affect AMD Radeon cards going forward. And, it's also completely possible that Samsung will also raise the prices for its semiconductors, as well.",
    "So while it might be nice to think that graphics card prices won't go up too much in response to the increased cost of semiconductors, we wouldn't be surprised if they did – most graphics cards have already gone up in price, and it's not like AMD or Nvidia are having any problem selling through all of their stock."
  ],
  "headers": {
    "4": "Analysis: muddying the waters"
  },
  "links": {
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "processors": "https://www.techradar.com/news/best-processors",
    "Wall Street Journal": "https://www.wsj.com/articles/worlds-largest-chip-maker-to-raise-prices-threatening-costlier-electronics-11629978308",
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 2080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080"
  }
}