{
  "source": "https://www.techradar.com/news/real-or-not-a-gta-trilogy-remaster-would-be-very-welcome",
  "title": "Real or not, a GTA trilogy remaster would be very welcome",
  "category": "gaming",
  "updated": "2021-08-13T09:43:25Z",
  "author": "rhys-wood",
  "summary": "GTA trilogy remaster? Sign me up",
  "article": [
    "Update: Kotaku has reported that, according to its sources, Rockstar Games is working on remastered versions of Grand Theft Auto 3, Grand Theft Auto Vice City, and Grand Theft Auto San Andreas.",
    "According to the report, all three games are being remastered using Unreal Engine and will feature a mix of “new and old graphics.” These remastered games will reportedly also feature an updated UI, while retaining their classic style. Kotaku reports this trilogy will be released \"later this fall\" for a \"multitude of platforms\" including the Nintendo Switch. Rockstar hasn't confirmed the remasters are in development.",
    "Original: Like it or not, Grand Theft Auto is a vastly influential series. Its chaotic approach to sandbox design and twisted brand of social commentary has resonated with millions of players worldwide, as well as with developers of games like Saints Row. And with Grand Theft Auto 5 continuing to top sales charts eight years after its original release, the series shows no signs of going away anytime soon.",
    "That said, it’s likely going to be a long while before we see any official details on GTA 6. But it looks like Rockstar Games and publisher Take-Two Interactive could have something to tide us over until then, in the form of a GTA Trilogy remaster, if comments from a renowned leaker are to be believed. The trilogy would compile remasters of Grand Theft Auto 3, Vice City and San Andreas, three of the series’ most iconic titles.",
    "Leaker Yan2295 tweeted in response to a question asking if they think a GTA Trilogy remaster will see the light of day. Yan simply responded with a “yes” which usually wouldn’t be newsworthy. However, given Yan’s track record (Take-Two had once asked Yan to stop leaking GTA Online details ahead of release), there’s more credence here than what would otherwise be an offhand comment.",
    "Previously, Take-Two had also confirmed that three prominent remasters will release in 2022, which doesn’t outright confirm the existence of a Grand Theft Auto Trilogy remaster, but it’s hard to think of a better fit than three of Rockstar’s best.",
    "It also wouldn’t be the first time GTA 3, Vice City and San Andreas would see remasters on modern platforms. 2005’s Grand Theft Auto: The Trilogy saw a remaster on PS4, featuring improvements like 1080p resolution and PlayStation Trophy support.",
    "While it’s difficult to pull many players’ attention away from GTA 5 and its GTA Online counterpart, a GTA Trilogy remaster would give older fans a reason to revisit these classic games, while also introducing the series’ 3D roots to a wider audience. If they’re handled right, that is.",
    "Arguably the biggest criticisms one could levy at GTA 3, Vice City and San Andreas - even at their time of release - would be their control schemes. On-foot movement and combat often felt incredibly clunky and at times unresponsive. Both are things a remaster could address with updated control schemes to make such actions more seamless than ever.",
    "A GTA Trilogy remaster on modern systems like PS5 and Xbox Series X also grant Rockstar an opportunity to clean up the games’ muddier textures and potentially allow for 4K resolution, alongside support for achievements and trophies, and potentially even cut content from the original games.",
    "Finally, a GTA Trilogy Remaster would be a huge win for video game preservation, especially as the current generation of home consoles is still relatively young. Being able to enjoy GTA 3, Vice City and San Andreas again would make for a welcome change from the often overbearing vulgarity of GTA 5, and give fans both old and new a chance to play through the series’ best games well in advance of GTA 6’s eventual release."
  ],
  "headers": {
    "7": "GTA Trilogy remaster: Rockstar’s best games deserve another look"
  },
  "links": {
    "Kotaku": "https://kotaku.com/the-gta-remastered-trilogy-appears-to-be-real-and-comi-1847474620",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Grand Theft Auto 5": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "Yan2295 tweeted": "https://twitter.com/HunterW46280581/status/1425061332915789851?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1425069886921969677%7Ctwgr%5E%7Ctwcon%5Es2_&ref_url=https%3A%2F%2Fwccftech.com%2Fgrand-theft-auto-trilogy-remaster-coming%2F",
    "GTA Online": "https://www.techradar.com/news/is-gta-online-actually-good-in-2021",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "video game preservation": "https://www.techradar.com/news/backwards-compatibility-should-be-industry-priority-insists-xbox-boss"
  }
}