{
  "source": "https://www.techradar.com/news/these-cheap-noise-cancelling-headphones-come-with-a-class-leading-50-hour-battery-life",
  "title": "These cheap noise-cancelling headphones come with a class-leading 50-hour battery life",
  "category": "audio-visual",
  "updated": "2021-01-05T09:02:50Z",
  "author": "olivia-tambini",
  "summary": "The Urbanista Miami are wireless headphones that can last",
  "article": [
    "If you want a pair of noise-cancelling headphones that sound great and offer plenty of listening time, as well as effectively shutting out unwanted sound, you generally have to pay quite a bit for the privilege, with the best models often costing upwards of $300 / £300 / AU$400.",
    "However, the latest wireless headphones from Swedish audio brand Urbanista prove that you don't have to break the bank to get cans that can block out your surroundings without sacrificing battery life.",
    "The Urbanista Miami wireless over-ear headphones boast active noise cancellation, as well as a class-leading battery life of 50 hours. While that figure does drop to 40 hours with ANC turned on, the Urbanista Miami still easily surpass the expensive Apple AirPods Max and our favorite pair, the Sony WH-1000XM4.",
    "In spite of that impressive battery life, the Urbanista Miami are far cheaper than those popular noise-cancelling headphones, coming in at $149 / £129 – that works out at about AU$190, though global pricing is yet to be confirmed.",
    "Like all of the brand's headphones, the Urbanista Miami are inspired by their namesake, with a design that, the brand says, draws on \"the vibrant pulse of the city\". They come in a choice of four colors, including Pearl White, Midnight Black, Ruby Red, and Real Green.",
    "The headband is adjustable for a custom fit, and the headphones feature cushioned shells, which should feel comfortable during long listening sessions.",
    "For seamless use on the go, they come with on-ear detection technology, which automatically pauses your music when sensors detect that you've removed the headphones from your head – a feature we've seen on the AirPods Max and the Sony WH-1000XM4.",
    "Bluetooth 5 connectivity means the Urbanista Miami should pair easily with your device, though you can listen with a wired connection if you prefer, as they come with an AUX cable, as well as an airline adapter for use during long-haul flights.",
    "Active noise cancellation is controllable via a button, which also allows you to switch to an Ambient Sound Mode – this mode allows environmental sound to pass through the headphones, so you can tune into your surroundings without skipping a beat of your music.",
    "As for that all-important sound quality, Axel Grell, the Acoustical Engineer who developed the sound design for Urbanista Miami, says the headphones provide \"warm contoured bass that extends to ultra low frequencies\" as well as clean mids and highs for a \"crisp\" sound experience.",
    "We'll have to try them out for ourselves to see if that's the case, but if the Urbanista Miami can provide excellent sound as well as decent noise cancellation and that long battery life, they could prove to be a great cheaper alternative to the best noise-cancelling headphones on the market today."
  ],
  "headers": {
    "4": "Vibrant pulse"
  },
  "links": {
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Apple AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490"
  }
}