{
  "source": "https://www.techradar.com/news/squid-game-creator-talks-season-2-possibilities-after-its-huge-success",
  "title": "Squid Game creator talks season 2 possibilities after its huge success",
  "category": "entertainment",
  "updated": "2021-10-14T09:34:55Z",
  "author": "samuel-roberts",
  "summary": "\"So many people loved season 1 and are expecting good things for season 2\"",
  "article": [
    "If you've reached the ending of Squid Game by now, know that you're one of 111 million viewers (and counting) who's checked out one of the best shows on Netflix. While the series doesn't necessarily demand a follow-up based on how it ends, aside from a few lingering threads that could be addressed later on, the popularity of the South Korean Netflix original would seemingly make a second season a dead cert.",
    "The thing is, creator Hwang Dong-hyuk has seemed reluctant to commit to working on a follow-up, citing the years of work it took to make season 1 – not to mention stress that he says led to losing six teeth during filming.",
    "Now, though, in the wake of the series' unprecedented success, the writer and director sounds a little more open to the possibility than he previously did – though he's still stopped short of committing to Squid Game season 2.",
    "\"The pressure on me is huge now, with such a big audience waiting for a season 2,\" Hwang told THR in an interview following its explosion in popularity. Because of all that pressure, I haven’t decided yet whether or not I should do another season. But if you look at it in a positive way, because so many people loved season 1 and are expecting good things for season 2, there are people everywhere in the world offering their opinions about where the show should go.\"",
    "That feedback from audiences could creatively shape what the creator comes with for Squid Game season 2 – if it even happens at all.",
    "\"I could actually pull ideas from fans all around the world to create the next season. I think that’s what I’m wrestling with right now – that I shouldn’t just view it as a huge amount of pressure, but think of all of this love and support I’m receiving as a big box of inspiration that I can leverage for season 2.\"",
    "That, at least, makes it sound like he's seriously considering a second season.",
    "Netflix just last week weighed in on how a second season might work for the writer and director. \"He [Hwang] has a film and other things he’s working on,\" said the streamer's Head of Global Productions Bela Bajaria. \"[He's looking to] collaborate with other writers. We're trying to figure out the right structure for him.\"",
    "Squid Game is now Netflix's biggest original TV show launch ever – beating Bridgerton's 82 million viewers. That criteria, though, only counts viewers that have watched two minutes of a show.",
    "Netflix's global audience exploded during the pandemic – in 2019, the streamer had 169 million subscribers. As of July 2021, it had 209 million subscribers, with much of that growth coming from international markets.",
    "That means around half of all subscribers have watched Squid Game, which is incredible, considering just what a broad sweep of different audience types across many countries that 111 million household numbers is certain to include.",
    "It's a sign of the future that a non-English language show like Squid Game can become Netflix's biggest hit ever. In recent years, Lupin Part 1 (76 million households) and Money Heist part 4 (65 million users) both crashed Netflix's top 10 most popular series ever.",
    "Squid Game, then, shows that Netflix's next hit really could come from anywhere – illustrating just how much its worldwide approach to programming has changed the TV landscape."
  ],
  "headers": {
    "9": "Analysis: Squid Game is astonishingly popular"
  },
  "links": {
    "ending of Squid Game": "https://www.techradar.com/news/squid-game-ending-explained-what-happens-next",
    "best shows on Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "THR": "https://www.hollywoodreporter.com/tv/tv-news/squid-game-creator-season-2-meaning-1235030617/",
    "Netflix just last week": "https://www.techradar.com/news/squid-game-season-2-may-happen-but-not-any-time-soon"
  }
}