{
  "source": "https://www.techradar.com/news/use-samsung-messaging-app-to-send-text-messages-from-a-windows-10-pc",
  "title": "Samsung Messaging app lets you send text messages from a Windows 10 PC",
  "category": "computing",
  "updated": "2021-03-03T09:53:01Z",
  "author": "jitendra-soni",
  "summary": "But, how many of us would use it?",
  "article": [
    "Even though you can use the Your Phone app on Windows to access and send text messages from your smartphone, Samsung is bringing its proprietary messaging app to Windows 10 platform.",
    "The app was recently spotted under the Utilities & tools category on the Microsoft Store and as per the app description, it allows users to send and receive texts from their phone in Windows.",
    "According to Sammobile, the app still seems to be in a limited beta testing phase and is not available in all regions.",
    "It looks like Samsung is further limiting the usage of this application to select users who have been invited to download it. The Microsoft Store listing is accompanied by a ‘Redeem a code’ button in most areas that allows users with this specific code to download and test the application.",
    "While there is a very limited amount of information available around this app and its availability, its description suggests that the application is compatible with \"devices capable of using mobile data (5G and 4G LTE).\" If you have one of Samsung’s always-connected devices running on windows, you may still not be able to use the app as the current compatibility list includes a handful of devices like Galaxy TabPro S, the Galaxy Book 10.6 LTE, Galaxy Book 12 LTE, Galaxy Book 2, and the Galaxy Book Flex 2 5G.",
    "Both the above limitations may change once the app is ready for a wider roll-out. However, you may still need a Samsung smartphone to make use of this application.",
    "That said, Microsoft is already offering the Your Phone app which lets you do way more than just sending a message from your phone. And in case you have one of the few Galaxy devices, you can even stream and pin your Android apps on Windows PC.",
    "Furthermore, Google is offering similar features on the desktop client of Google Messages, hence it makes us wonder what exactly is behind Samsung releasing a custom solution for a problem that, some may argue, doesn’t exist. But then it was Samsung that came up with Bixby as well!",
    "Get up close with consumer tech news that you can use, latest reviews and buying guides. Follow TechRadar India on Twitter, Facebook and Instagram!"
  ],
  "headers": {},
  "links": {
    "Your Phone": "https://www.techradar.com/news/microsofts-your-phone-app-to-let-you-control-your-phone-from-windows-device",
    "Samsung": "https://www.techradar.com/news/best-samsung-phones",
    "Windows 10 platform": "https://www.techradar.com/news/windows-10-could-get-a-killer-feature-thanks-to-samsung",
    "Microsoft Store": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4794393480157943000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fsamsung-messaging%2F9mxtcw3001tv%3FranMID%3D24542%26ranEAID%3DTnL5HPStwNw%26ranSiteID%3DTnL5HPStwNw-gIZlRx5RdOW0YymeCQhPmg%26epi%3DTnL5HPStwNw-gIZlRx5RdOW0YymeCQhPmg%26irgwc%3D1%26OCID%3DAID2000142_aff_7593_1243925%26tduid%3D%2528ir__qf9omub1zwkfqhspkk0sohzzzm2xppyilslroj1100%2529%25287593%2529%25281243925%2529%2528TnL5HPStwNw-gIZlRx5RdOW0YymeCQhPmg%2529%2528%2529%26irclickid%3D_qf9omub1zwkfqhspkk0sohzzzm2xppyilslroj1100%26activetab%3Dpivot%3Aoverviewtab",
    "Sammobile": "https://www.sammobile.com/news/samsung-messaging-app-is-coming-to-windows-10-pc/",
    "stream and pin your Android apps": "https://www.techradar.com/news/windows-10-now-runs-multiple-android-apps-with-your-phone",
    "similar features": "https://www.techradar.com/news/google-to-begin-rolling-out-android-messages-for-the-web-from-today",
    "Twitter": "https://twitter.com/TechRadarIndia",
    "Facebook": "https://www.facebook.com/TechRadarIndia",
    "Instagram": "https://www.instagram.com/techradarindia/"
  }
}