{
  "source": "https://www.techradar.com/news/ahead-of-captain-america-4-see-the-first-official-images-of-anthony-mackies-cap",
  "title": "Ahead of Captain America 4, see the first official images of Anthony Mackie's Cap",
  "category": "entertainment",
  "updated": "2021-04-26T16:33:58Z",
  "author": "samuel-roberts",
  "summary": "See your new Captain America in action",
  "article": [
    "Spoilers for The Falcon and the Winter Soldier follow.",
    "Marvel has released the first official images of Anthony Mackie's Sam Wilson as Captain America, following last week's The Falcon and the Winter Soldier finale. They show the brand new Cap in his comics-inspired costume – a gift from Wakanda – just days after it was reported that Captain America 4 is going into production on the big-screen.",
    "The fourth Captain America movie is in development now, according to THR, and will be written by The Falcon and the Winter Soldier's head writer Malcolm Spellman, alongside episode 5 writer Dalan Musson. Deadline also reported that it's separate to a previously rumored Cap movie that could feature original star Chris Evans, which the actor had seemingly shot down in a tweet in January.",
    "Check out the official poster of Mackie as Cap below:",
    "Meanwhile, Marvel and Disney Plus have also released official stills of Mackie in-costume directly from the show. Check those out below:",
    "The Falcon and the Winter Soldier season 1 is available in its entirety now on Disney Plus. Next up in the MCU is Loki, which begins a six-episode run on June 11, giving you just over a month to either catch up on the Marvel movies in order, or enjoy some well-deserved time off from the whole thing.",
    "The Falcon and the Winter Soldier sets up a few plot threads that could pay off down the line – specifically, we learn that the show's villain, the Power Broker, is Sharon Carter, who's back working for American intelligence after being pardoned at the end of the series.",
    "The show's mid-credits scene makes it clear that she has no intention of going back to the good side, however, and we could see her being a potential villain in a follow-up story.",
    "More than that, though, it would be refreshing to see Sam Wilson's Captain America face different villains – and get something of a clean slate as the character, rather than being surrounded by characters who are deeply mired in Marvel lore. That said, surely Sebastian Stan's Bucky Barnes would be in the frame for another team-up?",
    "It's unclear when a fourth Captain America movie will be released – Marvel hasn't even confirmed it exists yet."
  ],
  "headers": {
    "6": "What could Captain America 4 be about?"
  },
  "links": {
    "The Falcon and the Winter Soldier finale": "https://www.techradar.com/news/falcon-and-the-winter-soldier-finale-mid-credits-scene-and-power-broker-explained",
    "THR": "https://www.hollywoodreporter.com/heat-vision/captain-america-4-in-the-works-with-falcon-and-the-winter-soldier-showrunner-malcolm-spellman-exclusive",
    "Deadline": "https://deadline.com/2021/04/captain-america-4-in-development-with-falcon-and-the-winter-soldier-ep-malcolm-spellman-writing-1234742675/",
    "Cap movie that could feature original star Chris Evans": "https://www.techradar.com/news/chris-evans-could-play-captain-america-again-but-in-which-marvel-movie",
    "tweet": "https://twitter.com/ChrisEvans/status/1349835808497229824",
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Marvel movies in order": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "mid-credits scene": "https://www.techradar.com/news/wandavision-episode-9-mid-credits-scene-explained/news/falcon-and-the-winter-soldier-finale-mid-credits-scene-and-power-broker-explained"
  }
}