{
  "source": "https://www.techradar.com/news/spacex-will-accept-dogecoin-for-space-flights",
  "title": "Dogecoin price may finally go to the moon thanks to SpaceX",
  "category": "computing",
  "updated": "2021-05-10T16:24:11Z",
  "author": "mike-moore",
  "summary": "Dogecoin gets major SpaceX backing",
  "article": [
    "Meme cryptocurrency Dogecoin (DOGE) could achieve its aim of getting \"to the moon\" following a significant announcement from SpaceX.",
    "Headed up by crypto fan Elon Musk, the firm is launching a lunar satellite next year themed around dogecoin, with the mission paid for in the cryptocurrency.",
    "\"SpaceX launching satellite Doge-1 to the moon next year – Mission paid for in Doge – 1st crypto in space – 1st meme in space\", Musk tweeted.",
    "The mission, set for Q1 2022, is being managed by Geometric Energy Corporation (GEC), and will involve the launch of a 40kg cubesat as a rideshare on a SpaceX Falcon 9 lunar payload.",
    "\"This mission will demonstrate the application of cryptocurrency beyond Earth orbit and set the foundation for interplanetary commerce\", SpaceX Vice President of Commercial Sales Tom Ochinero said in GEC's statement.",
    "GEC added that the mission will prove that dogecoin is, \"a fast, reliable, and cryptographically secure digital currency that operates when traditional banks cannot and is sophisticated enough to finance a commercial Moon mission in full.\"",
    "\"Having officially transacted with DOGE for a deal of this magnitude, Geometric Energy Corporation and SpaceX have solidified DOGE as a unit of account for lunar business in the space sector,\" said Geometric Energy's Chief Executive Officer Samuel Reid.",
    "However DOGE itself suffered a major fall in price following Musk's appearance on popular US comedy show Saturday Night Live, where he dismissed the coin as a \"hustle\".",
    "Musk, who tweeted in April 2021 that SpaceX was going to put a \"literal Dogecoin on the literal moon\", appeared not to get the entire message during his appearance as guest host on SNL.",
    "The cryptocurrency lost more than a third of its price after Musk appeared to denigrate it during a sketch. When asked \"what is dogecoin?\", Musk replied, \"It's the future of currency. It's an unstoppable financial vehicle that’s going to take over the world.\"",
    "But when challenged by SNL cast member Michael Che, \"So, it's a hustle?\", a laughing Musk replied, \"Yeah, it's a hustle.\"",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies.",
    "Via Reuters"
  ],
  "headers": {
    "3": "Dogecoin SpaceX"
  },
  "links": {
    "Dogecoin": "https://www.techradar.com/news/what-is-dogecoin-all-you-need-to-know-about-the-meme-cryptocurrency-explained",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "tweeted": "https://twitter.com/elonmusk/status/1391523807148527620",
    "SpaceX": "https://www.techradar.com/news/everything-you-need-to-know-about-spacexs-starlink-plans-for-space-internet",
    "statement": "https://www.prnewswire.com/news-releases/spacex-to-launch-doge-1-to-the-moon-301287016.html",
    "a major fall in price": "https://www.techradar.com/news/dogecoin-leapfrogs-xrp-to-become-fourth-largest-cryptocurrency-in-the-world",
    "Reuters": "https://www.reuters.com/technology/dogecoin-spotlight-cryptocurrency-backer-musk-makes-snl-appearance-2021-05-07/"
  }
}