{
  "source": "https://www.techradar.com/news/baldurs-gate-3-gets-druid-class-loaded-dice-and-more-in-latest-patch",
  "title": "Baldur's Gate 3 gets druid class, loaded dice and more in latest patch",
  "category": "gaming",
  "updated": "2021-02-18T11:21:26Z",
  "author": "jess-weatherbed",
  "summary": "We can bearly wait",
  "article": [
    "The world of Baldur's Gate 3 is set to get a huge patch that will include a host of new features and improvements to the early access game. The biggest announcement made via the studio's second Panel From Hell event was to introduce the druid class, along with eight animal forms that the characters can transform into. Larian CEO Swen Vincke accidentally stated that the patch 4 updates would be \"releasing today\" at the beginning of the live stream (that featured D&D legend Jeremy Crawford and, for some reason, a live cow), however this was revealed to be an error. This patch, like previous large updates, will wipe all existing save data – a fair warning for all those who are jumping into this early access experience for the first time.",
    "Druids are a well-known and beloved class in Dungeons and Dragons that cast powerful spells inspired by nature, and can shapeshift into different beasts thanks to their 'Wildshape' ability. The eight animal forms we can expect to see will include a polar bear, a monstrous spider, a dire wolf, and an alarmingly large badger. Shifting into one of these forms will carry through to cinematics and allow for different interactions in game. The rest of the patch also includes some substantial changes, including improved cinematics and improved game systems that will allow you to select a party member or enemy by selecting their portrait images and the ability to view your friends' character sheets (as well as their inventory and spells) when in multiplayer mode.",
    "Bug fixes will also be included in the update, as well as some optional 'loaded dice' to switch up your gameplay a little. This will allow for an increased likelihood of either good or bad rolls depending on your requirements, which could be a blessing for anyone on an unlucky streak. Like the Dungeons and Dragons 5th edition tabletop RPG, Baldur's Gate uses dice rolls to decide gameplay outcomes, and while these loaded dice can be seen as a tad game-breaking if used, they will only apply to dialogue roleplay or actions outside of combat. Full update notes for Patch 4 are still to come and the official release is currently unknown, with a promise that it will arrive \"very soon, when it's ready\". Baldur's Gate 3 is currently in early access and more improvements will be made to the game before its full official release. You can download the game via Steam to be a part of the experience yourself, or for a fully completed RPG experience check out the Divinity game series."
  ],
  "headers": {
    "2": "Cause mayhem as a giant badger"
  },
  "links": {
    "Baldur's Gate 3": "https://www.techradar.com/news/baldurs-gate-iii-may-just-be-the-future-of-pc-rpgs-and-im-so-here-for-it",
    "live stream": "https://www.youtube.com/watch?v=tAr-fvEPgA8&feature=emb_logo",
    "Dungeons and Dragons": "https://www.techradar.com/news/my-5-favorite-online-dd-resources-ideas-and-education-for-dms-and-players-alike",
    "dice rolls": "https://www.techradar.com/best/best-dice-roller-apps-and-simulators-for-playing-dnd-online",
    "Steam": "https://store.steampowered.com/agecheck/app/1086940/",
    "Divinity game": "https://www.techradar.com/news/games-of-the-generation-divinity-original-sin-2-a-future-gazing-old-school-rpg-masterpiece"
  }
}