{
  "source": "https://www.techradar.com/news/three-ways-5g-is-leading-the-fight-against-climate-change",
  "title": "Three ways 5G is leading the fight against climate change",
  "category": "computing",
  "updated": "2021-08-29T08:43:44Z",
  "author": "peters-suh",
  "summary": "The threefold impact of 5G in combating climate change",
  "article": [
    "Increasingly, climate change is one of the leading concerns confronting societies and economies around the world. The effects are expected to cause enormous disruption and harm, with the Intergovernmental Panel on Climate Change (IPCC) predicting that 1.5°C of warming could cause sea levels to rise 0.4 meters in 2100, with up to 69 million people exposed to flooding.",
    "Current global emissions targets will only be achieved through the acceleration of innovative technologies, enabling industries to pivot their organizations towards sustainable operations. Digital technology may be the most powerful, scalable tool the world has to tackle climate change and 5G is at the forefront of this effort.",
    "Operators of wireless networks have already taken numerous steps to limit emissions, such as reducing energy consumption, switching to more efficient network equipment, and sourcing renewable energy. However, offsetting the growth in data volumes over mobile networks will require more than improvements to current networks.",
    "The impact of 5G is threefold in its potential to combat the effects of climate change: 5G, with its substantially greater energy efficiency, will reduce greenhouse gases, abate the emissions of other industries, and enable more precise monitoring of our environment to help meet broader climate change commitments.",
    "5G promises substantial improvements on current wireless technologies in terms of latency, throughput, and device connectivity and, as a result, data demand per device and the number of devices is set to rise.",
    "However, despite the increased demand, 5G allows network operators to be more energy efficient on a per unit of output level. According to STL Partners, 5G offers the potential to allow a 98% reduction in energy consumption per bit of data transmitted. This, in turn, translates to cumulatively saving the world over 1bn ton of CO2 between 2020 and 2030 – more than one year of greenhouse gas emissions from all maritime shipping or all aviation globally.",
    "This theory comes to life as innovative equipment manufacturers release hardware which combines multiple radio technologies in a single piece of equipment, leading to energy efficiencies on a per site basis. Technologies like network function virtualization (NFV), software defined networking (SDN) and network slicing will allow operators to gain a higher degree of control over their networks which will enable them to monitor their energy consumption, scaling up or down to meet demand.",
    "5G’s improvements in latency and bandwidth, combined with new technological functions like mobile edge computing (MEC) will also enable new use cases that will drive significant abatement of emissions from most industry verticals. This will change the way we live and work, resulting in substantial reductions of greenhouse gases.",
    "In a 5G-enabled smart city, data, sensors and connected devices help improve government services and residents’ quality of life through analytics, artificial intelligence and automation which will enable a new generation of platforms and services.",
    "5G is unique in its ability to serve as a platform for other disruptive technologies including XR, IoT and AI. The deployment of these technologies across different industries can significantly reduce energy usage and help to accelerate climate saving initiatives, such as driving down the need for travel through remote working.",
    "Other potential use cases include implementing 5G in connected transportation to reduce commuter time and improve traffic management, or to enhance virtual conferences and trade shows, driving reductions in hotel room stays and travel emissions.",
    "Beyond carbon abatement, 5G will extend to create entire connected infrastructures which require the transmission of huge amounts of data at very high speeds across a dense network of devices. The implications for this are numerous, spanning connected transportation, agriculture, cities, buildings, industry, energy, health, living, working as well as physical to digital networks.",
    "For example, in farming, precision agriculture technology using 5G can increase crop yields and simultaneously reduce the emissions produced by growing crops, using data gathering technologies, big data analytics, and precision application controls to guide and optimize farm management practices.",
    "These techniques will allow for more precise monitoring of our environment, combatting other forms of environmental degradation such as reduction of pesticide usage, improved irrigation systems or water quality testing for drinking water consumption.",
    "We used 3G to send texts and emails. With 4G we can download video and begin connecting machines. 5G, will allow for a totally connected society. As a result, it plays a key role in the effort to meet emission commitments and underpins our fight against climate change, both within the telecommunications systems and throughout society in general."
  ],
  "headers": {
    "4": "A fast and effective deployment of 5G creates more efficient wireless networks",
    "7": "5G enables high-emitting industries to abate their own emissions",
    "11": "A more connected society is more energy efficient"
  },
  "links": {
    "5G": "https://www.techradar.com/best/best-5g-phones",
    "network": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "wireless": "https://www.techradar.com/news/best-wireless-drives",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "trade shows": "https://www.techradar.com/best/best-trade-show-display-providers",
    "emails": "https://www.techradar.com/news/best-email-provider"
  }
}