{
  "source": "https://www.techradar.com/news/msi-finally-updated-its-gaming-pc-lineup-with-the-rtx-3080",
  "title": "MSI finally updated its gaming PC lineup with the RTX 3080",
  "category": "computing",
  "updated": "2021-01-06T18:50:49Z",
  "author": "carly-page",
  "summary": "Trident, Infinite, Aegis and Codex gaming desktops get an upgrade",
  "article": [
    "Ahead of CES 2021, MSI has announced that its Trident, Infinite, Aegis and Codex gaming desktops are now available with Nvidia Ampere GPUs.",
    "If you’re after a machine with a top-end GPU, both the MSI Infinite RS and Aegis RS 10th are now being offered with Nvidia’s top-end RTX 3090 graphics card – which many have been struggling to get hold off. Both desktops pair the Ampere GPU with up to an Intel Core i9-10900K CPU and up to 32GB DDR4 RAM.",
    "Unsurprisingly, these gaming desktops don’t come cheap. The Infinite RS with RTX 3090 is available for $3,599 (£2,640, AU$4,615), while the Aegis RS 10th with RTX 3090 is available from $3,999 (£2,935, AU$5,130).",
    "The equally hard-to-get-hold-of Nvidia RTX 3080 is also being offered in the MSI Meg Trident X 10th. This model, which also packs up to an Intel Core i9-10900K processor, 32GB RAM, and 1TB SSD + 1TB HDD storage is available from $2,799 (£2,055, AU$3,590), while an RTX 3070 variant is also on sale for $2,499 (£1,835, AU$3,205).",
    "MSI is also offering a number of gaming desktops with up to an Nvidia RTX 3070, for those looking for a less expensive machine.",
    "The MSI Trident AS, Codex R 10th, Aegis R 10th and Ryzen-powered Aegis ZS are all being offered with Nvidia’s mid-range Ampere GPU, with each model available from $1,899 (£1,400, AU$2,435), $1,299 (£955, AU$1,660), $1,549 (£1,340, AU$2,000) and $1,999 (£1,470, AU$2,560), respectively.",
    "The arrival of MSI’s upgraded gaming laptops comes just days ahead of CES, where Nvidia is expected to add more mid-range options to its RTX 30-series lineup in the form of the RTX 3050, RTX 3050 Ti and RTX 3060.",
    "MSI is also set to unveil the Trident S during next week’s all-digital conference, which it’s teasing as a gaming machine that “revolutionizes conventional thinking of what a PC gaming system is to bring the world of Triple-A PC gaming into any household.”"
  ],
  "headers": {},
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "which many have been struggling to get hold off": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3090-find-stock-here",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Nvidia RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "CES": "https://www.techradar.com/news/ces-2021-highlights",
    "in the form of the RTX 3050, RTX 3050 Ti and RTX 3060": "https://www.techradar.com/news/nvidia-rtx-3050-rtx-3050-ti-and-rtx-3060-might-debut-at-ces-next-week"
  }
}