{
  "source": "https://www.techradar.com/news/battlefield-6-could-add-robot-dogs-to-your-arsenal",
  "title": "Battlefield 6 could add robot dogs to your arsenal",
  "category": "gaming",
  "updated": "2021-06-11T16:58:53Z",
  "author": "stephen-lambrechts",
  "summary": "Robotic attack dogs? That's a bingo",
  "article": [
    "With the development of EA Dice's next Battlefield title (now confirmed to be Battlefield 2042) well underway, rumors about the upcoming war shooter have been flying thick and fast of late.",
    "The latest rumor, once again tweeted by noted Battlefield leaker Tom Henderson and picked up by TweakTown, claims that the next game in the series will feature robotic attack dogs as part of your arsenal.",
    "Henderson tweeted that your robot attack dog will be \"more like Boston Dynamics Mule that can run really fast and potentially has a weapon on it,\" and that \"it looks like it could be a new vehicle type instead of a gadget.\"",
    "The leaker recently made headlines with claims that Battlefield 6 is cross-gen and will feature 128-player maps, will be set in the near-future and that it will be coming to Xbox Game Pass on day one.",
    "Like with any rumor, we advise you to definitely take these leaks with a pinch of salt. That said, if any of this information does prove to be accurate, we could be looking at the most exciting instalment of Battlefield in years.",
    "At present, it's believed that Battlefield 6 will be officially revealed in May and is on track for a release in late 2021."
  ],
  "headers": {},
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "tweeted": "https://twitter.com/_Tom_Henderson_/status/1380781957051727873",
    "TweakTown": "https://www.tweaktown.com/news/78679/the-next-gen-battlefield-rumored-to-have-robotic-dog-you-can-control/index.html",
    "Battlefield 6 is cross-gen and will feature 128-player maps": "https://www.techradar.com/news/battlefield-6-is-cross-gen-and-will-feature-128-player-maps-according-to-leak",
    "will be set in the near-future": "https://www.tomsguide.com/news/battlefield-6-leak-just-revealed-setting-were-going-to-the-future",
    "coming to Xbox Game Pass on day one": "https://www.gamesradar.com/battlefield-6-rumour-claims-the-game-is-coming-to-xbox-game-pass-on-day-one/",
    "officially revealed in May": "https://www.techradar.com/news/battlefield-6-tipped-for-may-reveal"
  }
}