{
  "source": "https://www.techradar.com/news/no-steam-deck-wont-be-limited-to-30hz-thats-just-a-targeted-minimum",
  "title": "No, Steam Deck won't be limited to 30Hz – that's just a targeted minimum",
  "category": "gaming",
  "updated": "2021-07-26T03:53:41Z",
  "author": "harry-domanski",
  "summary": "Valve clarifies new FPS goals for the handheld gaming PC",
  "article": [
    "A few days ago, Valve claimed its upcoming Steam Deck console could handle any game you could throw at it, with the info coming via a tech breakdown in an interview with IGN.",
    "Today, one of the Valve employees that conducted the interview, developer Pierre-Loup Griffais, has tweeted a clarification of one of the key points of concern raised in the video – a capped refresh rate of 30Hz.",
    "Griffais has made it clear that the \"30Hz target\" that he mentioned in the video isn't an upper limit for the refresh rate of games running on the Steam Deck, but rather an 'acceptable' minimum goal. In actuality, the games the team have tested so far have \"consistently met and exceeded\" this target.",
    "This means that we should be looking to see games run anywhere between 30fps and 60fps on the console's 800p, 60Hz display when it does launch, even current AAA titles, if Valve's testing proves accurate.",
    "On top of this clarification, Griffais' tweet also sheds light on some user-customization when it comes to FPS rates, allowing the player to enable a limiter to eke out longer battery life or better performance if a game is struggling.",
    "In a tweet reply from Digital Foundry, it's also been confirmed that the Steam Deck's display doesn't support variable refresh rate (VRR). Unless V-sync is enabled, this means that if a game's framerate fluctuates significantly, it may result in some tearing on the display's 60Hz refresh rate. At lower framerates, it can also result in issues with frame pacing, which can make any onscreen movement look decidedly stilted and unpleasant.",
    "A lot of the language used to describe the performance capabilities of Valve's Steam Deck revolve around current (or at least recent) games, and for good reason – it's tricky to test games that haven't been made yet.",
    "While it's hard to judge, if we assume that some of the current PC titles will push the Steam Deck to its limits, we expect it won't be too long before AAA titles releasing for PC will have to undergo some major performance or visual cutbacks in order to run smoothly on Valve's handheld console.",
    "While hardware optimization can help, as can the reduction of certain demanding attributes (like limiting the game to outputting an 800p resolution rather than 4K), some games are likely to play ball better than others.",
    "At this point, will the games still be enjoyable? When you look at the success of the Nintendo Switch port of The Witcher 3, it's clear that good games can still be plenty worthwhile even with some severe concessions to graphical prowess, so we suspect the Steam Deck to have a healthy future regardless of its fixed place in time."
  ],
  "headers": {
    "6": "To infinity?"
  },
  "links": {
    "Steam Deck console could handle any game you could throw at it": "https://www.techradar.com/news/valve-claims-the-steam-deck-can-handle-any-game-you-throw-at-it-including-aaas",
    "interview with IGN": "https://www.youtube.com/watch?v=e3HnDR7A8yE",
    "tweeted": "https://twitter.com/Plagman2/status/1419087956535513093",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Digital Foundry": "https://twitter.com/digitalfoundry/status/1419294155994456073",
    "variable refresh rate (VRR)": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "Nintendo Switch port of The Witcher 3": "https://www.techradar.com/news/the-witcher-3-on-nintendo-switch-may-mean-i-finally-play-the-dlc"
  }
}