{
  "source": "https://www.techradar.com/news/samsung-galaxy-buds-2-suffer-their-second-leak-in-two-days",
  "title": "Samsung Galaxy Buds 2 suffer their second leak in two days",
  "category": "audio-visual",
  "updated": "2021-07-07T15:35:25Z",
  "author": "nick-pino",
  "summary": "The latest leak shows off the Galaxy Buds 2’s three new colors",
  "article": [
    "Last month Apple couldn’t keep its new Beats Studio Buds a secret – and now, Samsung is having the same problem with the next Samsung Galaxy Buds 2.",
    "Over the weekend, the Samsung Galaxy Buds 2’s price leaked – pointing to a EUR 180 and EUR 200 price range (around $225 / £160 / AU$300) – and now-prominent leaker Evan Blass has posted three 360-degree GIFs of the buds on Twitter. (Update: The tweets have since been taken down removing the GIFs.)",
    "What the tweets showed, importantly, was that the Samsung Galaxy Buds 2 will come in four colors: black, white, purple and green.",
    "The inside of the case will match whatever color you’ve chosen, but no matter which hue you choose, the outside will still be plain white.",
    "In terms of new design features, the Galaxy Buds 2 look like they have two sets of microphones on the outside and a proximity sensor on the inside for automatic play/pause. The exterior microphones indicate that the next earbuds will offer true active noise cancellation instead of active noise reduction found on the original Samsung Galaxy Buds – however, we can’t confirm that to be the case just based on yesterday's GIFs.",
    "As of right now, Samsung's Galaxy Buds 2 are looking like proper AirPods Pro rivals – especially if they indeed offer active noise cancellation. The price point aligns with what Apple charges for its true wireless earbuds, and they’re a bit more… er, standard-looking than the bean-shaped Samsung Galaxy Buds Live that dropped last year.",
    "Where Apple may still hold the advantage over Samsung is in its use of Spatial Audio with Dolby Atmos, something we’ve yet to see on Samsung’s Galaxy Buds. Samsung has usually combated Apple on the sound quality front by using its proprietary Samsung Scalable Codec that offers higher bitrate streaming over Bluetooth than the standard SBC codec, but that might not be enough now that Apple and Sony have moved into the spatial audio space.",
    "It’s also unclear what’s going to happen to Samsung’s other earbuds when the Samsung Galaxy Buds 2 come out. As of right now, it looks like they’ll sit on top of the lineup above the Samsung Galaxy Buds Pro, Galaxy Buds Live, Samsung Galaxy Buds Plus and the original Galaxy Buds – but that’s a lot of true wireless earbuds to have under one roof.",
    "Of course, we’ll find out all the details on the buds at the next Samsung Galaxy Unpacked event that will take place on August 11 at 10 am ET / 7 am PT / 3 pm GMT."
  ],
  "headers": {
    "5": "Are these Samsung’s AirPods Pro rivals?"
  },
  "links": {
    "Beats Studio Buds": "https://www.techradar.com/reviews/beats-studio-buds-review",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Samsung Galaxy Buds 2’s price leaked": "https://www.techradar.com/news/samsung-galaxy-buds-2-price-leaks-and-they-could-be-cheaper-than-the-airpods-pro",
    "Twitter": "https://twitter.com/evleaks/status/1412314667242987520",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Samsung Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Samsung Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus"
  }
}