{
  "source": "https://www.techradar.com/news/the-oneplus-nord-n10-5g-brings-great-value-at-a-small-price",
  "title": "The OnePlus Nord N10 5G Brings Great Value at a Small Price",
  "category": "phones",
  "updated": "2021-04-13T15:14:14Z",
  "author": "sponsored",
  "summary": "The most affordable 5G enabled smartphone with a 64mp camera!",
  "article": [
    "The new OnePlus Nord N10 5G smartphone is finally here and is the most affordable 5G enabled smartphone available right now.",
    "For only $299, you get next-gen features found in top-of-the-line devices like the buttery smooth 90hz display at an impressive 6.49-inch screen size.",
    "The OnePlus signature Warp Charge 30T, included in the box, gets you a day's charge in just 30 minutes. That’s in addition to the 4,300 mAh battery that will last you all day.",
    "And the OnePlus comes with a quad-camera setup, so you can shoot the best pictures wherever, whenever. First up, you have a 64mp main camera, which gives you nice and sharp images, full of detail! Then you have an ultra-wide lens to grab those sweeping landscapes and dramatic angles.",
    "Want extreme closeups? You’ve got a macro lens for that, and with a monochrome lens, you'll capture the finest details in all your shots, and even take to black and white images.",
    "4K video recording? Check!",
    "Worried about storage? You'll be able to shoot all day with the 128GB internal memory. Plus you can expand the storage with a microSD card!",
    "The OnePlus Nord N10 5G is the most affordable 5G-enabled smartphone in the market and can be yours through OnePlus or Metro by T-Mobile, for only $299."
  ],
  "headers": {},
  "links": {
    "OnePlus Nord N10 5G smartphone": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-9280579346353283000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-n10-5g",
    "OnePlus": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-1316695318850052000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-n10-5g"
  }
}