{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-on-sale-date-and-free-gift-offers-leak-out",
  "title": "Samsung Galaxy S21 on sale date and free gift offers leak out",
  "category": "phones",
  "updated": "2021-12-03T07:44:06Z",
  "author": "david-nield",
  "summary": "Arriving early this year",
  "article": [
    "Considering the Samsung Galaxy S21 family of phones is expected to be unveiled this coming Thursday, January 14, it's no surprise that the leaks are flooding in now – and we've got a couple more to report to you here.",
    "First up is a tweet from reputable tipster Roland Quandt, who says that the Galaxy S21 phones are going to go on sale on Friday, January 29 after the January 14 unveiling – or at least that's going to be the case in Europe.",
    "That matches up rather neatly with the other rumors we've heard up to this point, so it seems likely that January 29 is the day when you're going to buy a Galaxy S21 that ships the same day (preorders will most likely open up earlier).",
    "Samsung has already confirmed that it has an event scheduled for January 14, and while it hasn't explicitly mentioned the Galaxy S21 flagship phones, it has been dropping a lot of hints that suggest we are indeed about to see the new handsets revealed.",
    "Another well-known leaker Evan Blass has also taken to Twitter to reveal a promo image showing off the back of the Galaxy S21 Ultra 5G – you see see the wraparound camera module that has been revealed in numerous earlier renders of the phone.",
    "What's interesting about this particular image is that it suggests preorders of the phone will come with a free gift: some Galaxy Buds Pro wireless earbuds and a Galaxy SmartTag device tracker. Neither of those pieces of hardware are official at the moment, but they're both heavily rumored to be on the way.",
    "It therefore looks very probable that we'll see the Galaxy Buds Pro and the Galaxy SmartTags on January 14 as well, and that they'll be bundled into preorder offers. That might make up for the lack of a charger in the box.",
    "We're expecting a whole host of upgrades with the Galaxy S21, including the inclusion of the new Snapdragon 888 processor in some markets, as well as an upgrade in the rear camera capabilities and stylus support for the Ultra model.",
    "Via Android Police, XDA Developers"
  ],
  "headers": {
    "4": "Freebies for you"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Roland Quandt": "https://twitter.com/rquandt/status/1347478396994015233",
    "other rumors": "https://www.techradar.com/news/was-the-samsung-galaxy-s21-release-date-just-teased-by-samsung-itself",
    "already confirmed": "https://www.techradar.com/news/samsung-galaxy-s21-launch-date",
    "Evan Blass": "https://twitter.com/evleaks/status/1347616671960338435",
    "Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Galaxy SmartTag": "https://www.techradar.com/news/samsung-galaxy-smarttag-release-date-price-design-and-features",
    "the lack of a charger in the box": "https://www.techradar.com/news/new-samsung-galaxy-s21-leak-could-be-bad-news-for-a-lot-of-people",
    "new Snapdragon 888 processor": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Android Police": "https://www.androidpolice.com/2021/01/08/samsung-galaxy-s21-leak-reveals-availability-date/",
    "XDA Developers": "https://www.xda-developers.com/galaxy-s21-ultra-preorder-galaxy-buds-pro-smart-tag/"
  }
}