{
  "source": "https://www.techradar.com/news/hdd-drives-could-be-all-set-to-finally-take-on-ssds-once-more-thanks-to-this-upgrade",
  "title": "HDD drives could be all set to finally take on SSDs once more thanks to this upgrade",
  "category": "computing",
  "updated": "2021-06-08T13:09:57Z",
  "author": "mayank-sharma",
  "summary": "Graphene helps make HDDs more roomy and reliable than SSDs",
  "article": [
    "Researchers from Cambridge University have found a novel way to not just increase the storage capacities of traditional hard disk drives (HDD), but also make them more reliable.",
    "The breakthrough was achieved by the Cambridge Graphene Center together with researchers from the University of Exeter, India, Switzerland, Singapore, and the US, using graphene, often touted as a miracle material for its unique properties.",
    "The researchers replaced the carbon-based overcoat (COC) on several hard drives that helps protect drive platters from mechanical damages and corrosion with layers of graphene.",
    "Additionally, the team also leveraged graphene's heat resistance properties together with the Heat-Assisted Magnetic Recording (HAMR) technology that enables disk platters to hold more data when heated.",
    "“Demonstrating that graphene can serve as protective coating for conventional hard disk drives and that it is able to withstand HAMR conditions is a very important result. This will further push the development of novel high areal density hard disk drives,” said Dr Anna Ott from the Cambridge Graphene Centre, one of the co-authors of this study.",
    "The researchers note that COC occupies a significant part of the spacing in the disks, and even as the data density of HDDs has quadrupled since 1990, the thickness of the COC has reduced from 12.5nm to around 3nm.",
    "Based on their calculations, the researchers believe that this translates to storage densities of about one terabyte per square inch.",
    "Using graphene together with HAMR allows the team to push this figure by a factor of ten. In their research they were able to achieve storage densities between four and ten terabytes per square inch.",
    "The research also showed another advantage of using the graphene coating, as the material offered better corrosion protection, and wear resistance than the current state-of-the-art solutions. In fact, the researchers found a single layer of the wonder material reduced corrosion by 2.5 times.",
    "“Considering that in 2020, around 1 billion terabytes of fresh HDD storage was produced, these results indicate a route for mass application of graphene in cutting-edge technologies,” noted Professor Andrea C. Ferrari, Director of the Cambridge Graphene Centre.",
    "Via Engadget"
  ],
  "headers": {
    "5": "Significantly spacious"
  },
  "links": {
    "HDD": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "graphene": "https://www.techradar.com/news/dummy-40-ways-graphene-is-about-to-change-your-life",
    "Engadget": "https://www.engadget.com/graphene-hard-drive-university-of-cambridge-234912178.html"
  }
}