{
  "source": "https://www.techradar.com/news/netflix-is-turning-zack-snyders-reworked-star-wars-pitch-into-a-movie",
  "title": "Netflix is turning Zack Snyder's reworked Star Wars pitch into a movie",
  "category": "entertainment",
  "updated": "2021-07-07T05:22:58.674Z",
  "author": "stephen-lambrechts",
  "summary": "Rebel Moon could kick off an all-new sci-fi universe at Netflix",
  "article": [
    "Following almost immediately after the 2012 sale of Lucasfilm to Disney, Hollywood was flooded with Star Wars-related pitches from the industry's leading writers and filmmakers – all of whom wanted to take the expansive franchise in bold new directions.",
    "Zack Snyder, however, had his own Star Wars pitch that predated the sale – one which promised a \"more mature\" Star Wars story that was heavily inspired by Akira Kurosawa's 1954 masterpiece, Seven Samurai. There was even talk of turning his idea into a series.",
    "While that pitch regrettably failed to move forward following Disney's acquisition of the franchise, it appears that we will finally get to see what Snyder had in mind all those years ago.",
    "In an exclusive announcement via The Hollywood Reporter, Snyder has revealed that his Star Wars pitch has been reworked into Rebel Moon, an original sci-fi adventure film that he will co-write and direct for Netflix.",
    "Set in an entirely different galaxy that's also far, far away, Rebel Moon's story kicks off when \"a peaceful colony on the edge of the galaxy is threatened by the armies of a tyrannical regent named Balisarius.\"",
    "In true Seven Samurai fashion, this leads the desperate colony to \"dispatch a young woman with a mysterious past to seek out warriors from neighboring planets to help them make a stand.\"",
    "\"This is me growing up as an Akira Kurosawa fan, a Star Wars fan,\" said Snyder in his announcement. “It’s my love of sci-fi and a giant adventure. My hope is that this also becomes a massive IP and a universe that can be built out.”",
    "Rebel Moon is being co-written with Shay Hatten and Kurt Johnstad, both of whom worked with Snyder on 300 and Army of the Dead. Hatten, who is responsible for fleshing out the John Wick universe, has been hired to do the same for Rebel Moon.",
    "\"I’ve spent the last two or three years building out this universe. Every corner has to be painted in. I’ve been doing designs, constantly drawing and really cultivating its fertile ground to make this world fully realized,\" said Hatten.",
    "It's no secret that Netflix is looking to develop potential franchise-starters in a bid to compete with Disney Plus, which is already off to a running start thanks to its Star Wars and Marvel exclusivity.",
    "Netflix's previous collaboration with Snyder, Army of the Dead, is already in the process of being spun out into its own cinematic universe, with a prequel film (Army of Thieves) and spin-off anime series (Army of the Dead: Lost Vegas) currently in the works.",
    "It's also easy to see why Netflix is keen to stay in the Zack Snyder business – Army of the Dead was reportedly viewed by 72 million households in its first four weeks, making it one of the streamer's most popular films to date.",
    "The idea of a more grown-up take on a Star Wars-like story sounds tantalising to say the least. Thankfully, we shouldn't have to wait too long to see it – Snyder says he's \"been working on this on the side for so long, it’s pretty far along,\" and that he hopes to begin production on Rebel Moon in early 2022."
  ],
  "headers": {
    "4": "Rebel Moon: what's the story",
    "9": "Why Netflix is the perfect place for Rebel Moon"
  },
  "links": {
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/zack-snyder-sets-next-movie-sci-fi-adventure-rebel-moon-at-netflix-exclusive-1234978201/"
  }
}