{
  "source": "https://www.techradar.com/news/motorola-edge-30-ultra-leak-reveals-the-design-and-specs-of-this-flagship-phone",
  "title": "Motorola Edge 30 Ultra leak reveals the design and specs of this flagship phone",
  "category": "phones",
  "updated": "2021-11-12T10:37:45Z",
  "author": "james-rogerson",
  "summary": "Ultra in name only",
  "article": [
    "Not long ago we heard that Motorola could have a new high-end handset in the works dubbed the Motorola Edge 30 Ultra, and now we’ve had our first look at the possible design of this phone.",
    "Leaker @OnLeaks has shared renders of the handset with 91Mobiles, some of which you can see below, and they show a flat screen with a punch-hole camera, and a fairly plain back with a triple-lens camera.",
    "The Motorola Edge 30 Ultra is shown here in blue and grey shades, but the source doesn’t rule out the possibility of other colors. Its dimensions meanwhile are apparently 163.1 x 76.5 x 8.8mm (or 10mm including the rear camera bump).",
    "That’s about it on the design front, but this source also shares some specs – though they largely line up with an earlier leak.",
    "Apparently the Motorola Edge 30 Ultra has a Snapdragon 898 chipset, a 6.6-inch screen, a 50MP main camera, a 50MP secondary (probably ultra-wide) one, a 2MP depth sensor, a 60MP front-facing camera, and a 5,000mAh battery.",
    "Those specs paint the picture of a high-end phone, with the selfie camera possibly being a highlight, given that 60MP is a far higher megapixel could than most front-facing cameras have.",
    "We’d take all of this with a pinch of salt, but these claims come from a reputable source, and since they also match an earlier leak they may well be accurate.",
    "The picture painted here is fairly promising, with a top-end chipset, a big battery and some high-spec cameras all included, but the presence of a 2MP depth sensor and just a triple-lens configuration suggests the Motorola Edge 30 Ultra might not match the best phones for camera performance.",
    "Beyond that, the earlier leak we mentioned detailed additional specs, suggesting that the Edge 30 Ultra has a Full HD+ display, so it might not be as high resolution as some phones – though it does apparently have a high 144Hz refresh rate.",
    "Additionally, it’s said to have a choice of 8GB or 12GB of RAM (when some top phones have up to 16GB currently), and either 128GB or 256GB of storage – which is also less than you can get elsewhere.",
    "So despite the Ultra in the name, this will probably be more of a rival for the Samsung Galaxy S22 than the Samsung Galaxy S22 Ultra. We should find out for sure soon though, as the Motorola Edge 30 Ultra is rumored to land in January – though it may get an even earlier December launch in China under the Motorola Edge X name."
  ],
  "headers": {
    "7": "Analysis: a high-end phone, not a top-end one"
  },
  "links": {
    "could have a new high-end handset in the works": "https://www.techradar.com/news/motorola-edge-30-ultra-may-launch-in-january-with-top-snapdragon-898-chipset",
    "91Mobiles": "https://www.91mobiles.com/hub/motorola-edge-30-ultra-renders-specifications-exclusive/",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22"
  }
}