{
  "source": "https://www.techradar.com/news/6-things-we-want-to-see-from-the-apple-airpods-3",
  "title": "6 things we want to see from the Apple AirPods 3",
  "category": "audio-visual",
  "updated": "2021-10-18T14:41:49Z",
  "author": "olivia-tambini",
  "summary": "From Spatial Audio to shorter stems",
  "article": [
    "With the next Apple event taking place later today (October 18), the hot product on everyone’s minds are the AirPods 3.",
    "Rumors around the successors to Apple’s popular true wireless earbuds have been circulating for quite some time, and previous events have left us disappointed. However, with everything pointing to a 2021 release date, today’s Unleashed event is probably our last chance to see the AirPods 3 before the year is out – and recent leaks have all but confirmed that Apple will announce its next wireless earbuds today.",
    "While we can’t say for sure that the AirPods 3 will be announced today, we feel fairly confident that Apple is ready to finally upgrade the 2019 AirPods. After all, with all the advancements in Bluetooth technology, spatial audio, and hi-res streaming that have taken place over the last two years, the old AirPods are starting to look a little outdated. Not to mention their divisive design, which we think is well overdue an AirPods Pro-style upgrade.",
    "We’ll be tuning into the event at 10am PDT / 6pm BST (or 4am AEDT on October 19, depending on your time zone), and you can follow our Apple event live blog for all the latest updates – but in the meantime, we’ve dreamed up an AirPods 3 wishlist of all the new specs we’re hoping to see.",
    "The AirPods (2019) may be among the most popular wireless earbuds on the planet, but they certainly don’t offer the best audio performance. Their lively presentation works well for casual listening, but harsh trebles and underwhelming bass frequencies means that they aren’t the best true wireless earbuds for listening to music.",
    "Apple has proven that its true wireless earbuds can sound very good indeed - the AirPods Pro are far more sonically impressive than their predecessors. And, we know from models such as the Cambridge Audio Melomania 1 Plus, that high-quality sound doesn’t have to come with a huge price tag – so an entry level pair of AirPods have no excuse for coming with poor sound. There’s no reason why Apple couldn’t take a cue from companies like Cambridge Audio (as well as Sony, Sennheiser, and Bose), and release a pair of AirPods with more accurately tuned drivers for a more powerful bass response and pleasingly rolled-off trebles.",
    "As with any next-gen pair of headphones or earbuds, we’ll be disappointed if Apple hasn’t made any changes to the audio performance of the AirPods.",
    "The original AirPods launched back in 2016, and while they were upgraded in 2019, the design has remained the same: long, protruding stems and no silicone / memory foam eartips.",
    "While this design has served Apple well – after all, the AirPods are probably the most easily-recognizable true wireless earbuds on the market – we think it’s time for a change.",
    "We’d love to see Apple move away from the one-size-fits-all approach, and allow people to choose from a selection of different eartips. As well as making the AirPods feel more comfortable and secure, the improved sound isolation afforded by a good fit should deliver a more powerful bass response.",
    "It’s something that’s worked really well for the AirPods Pro, Apple’s noise-cancelling wireless earbuds. In fact, we’ve heard plenty of rumors that the AirPods 3 will take a few design cues from the AirPods Pro, and that includes smaller stems.",
    "While the long stems of the original AirPods means they can comfortably fit in touch-sensitive controls, the AirPods Pro have proven that these controls don’t require such a large amount of space to work. On the AirPods Pro's far shorter stems is a capacitive force sensor; squeeze this and you can activate noise cancellation or Transparency mode, as well as skipping and pausing your music.",
    "Apple’s Spatial Audio technology takes 5.1, 7.1, and Dolby Atmos content and applies directional audio filters, placing sound in a 3D sphere and making it feel more immersive, as if the audio is coming at you from every angle.",
    "Right now, this technology only works with the AirPods Pro and the AirPods Max, as it relies on their built-in accelerometers and gyroscopes to track the position of your head and ensure the sound is coming from the right direction.",
    "We’d love to see this feature implemented in the (presumably) cheaper AirPods 3, especially now that Apple Music users can listen to some music tracks using the immersive format. Why not bring the entry-level earbuds in line with the rest of the AirPods family?",
    "A less likely (but equally desirable) feature we’d like to see from the AirPods 3 is support for hi-res audio codecs. Now that Apple Music offers hi-res audio at no extra cost to subscribers, we'd like to see Apple update its own hardware so that it’s capable of delivering lossless audio – and it could start with the AirPods 3.",
    "Right now, all AirPods models only support the AAC codec when connected to an iOS or iPadOS device, whereas the new lossless Apple Music format is encoded in ALAC. In short, without ALAC support built into the headphones, the AirPods, AirPods Pro, and AirPods Max aren't capable of transmitting hi-res audio.",
    "In fairness, the necessary bit-rate to deliver truly lossless audio over Bluetooth hasn’t been available until very recently. In September, Qualcomm announced aptX Lossless, a new feature of it’s Snapdragon Sound technology, which the company claims is capable of delivering 16-bit / 44.1kHz audio over a Bluetooth connection.",
    "aptX Lossless is expected to start showing up in new headphones and earbuds between now and the end of the year – and the AirPods 3 could well be the first buds to deliver mathematically bit-for-bit exact audio via Bluetooth.",
    "So, why do we think this is less likely than Spatial Audio? For starters, we’re expecting the AirPods 3 to be an entry-level pair of earbuds to replace the current AirPods. As the technology is quite new, truly lossless Bluetooth audio will probably be a premium feature for the time being – perhaps better suited to any future AirPods Max models, which will have the powerful drivers and accuracy needed for you to really appreciate the difference in sound quality.",
    "Still, there’s no reason why not-entirely-lossless hi-res audio support couldn’t be implemented in the AirPods 3. All Apple needs to do is add in support for codecs like aptX HD and ALAC, and the AirPods 3 will have an edge over many of their less high-spec competitors.",
    "Speaking of Bluetooth, its high-time Apple updated the AirPods’ wireless transmission standard to the latest version.",
    "Lots of true wireless earbuds on the market come with Bluetooth 5.2 connectivity, whereas the 2019 AirPods only support Bluetooth 4.2. That means the current AirPods are missing out on faster data speeds and more stable pairing, as well as a wireless range of about 780 feet.",
    "For comparison the wireless range of the 2019 AirPods is about four times shorter than this – not the end of the world, but it would be great to be able to leave your iPhone in your kitchen while you potter around in the garden, without the fear of losing the connection.",
    "Last, but certainly not least, we’re hoping that Apple has made some serious improvements to the battery life of the AirPods, which currently comes in at a rather meagre 24 hours.",
    "Many true wireless earbuds on the market easily surpass this playtime, with models like the Lypertek PurePlay Z3 2.0 delivering an outrageous 80-hour battery life. Sure, we’re not expecting numbers anywhere near that for the AirPods 3, but we think 30 hours is very doable based on the competition. Recent rumors have suggested that the AirPods 3 will come with a longer battery life than their predecessors - but the changes will be coming to the charging case, rather than the buds themselves. In a tweet, reliable leaker Max Weinbach said that the charging case will have “a 20% larger battery”, and will come with support for wireless charging as standard.",
    "At the moment, you have to pay extra for the AirPods with a wireless charging case, which costs $199 / £199 / AU$319 as opposed to $159 / £159 / AU$249 for the standard charging case (though these prices are routinely discounted now that the AirPods (2019) are fairly old).",
    "While wireless charging without the extra cost does sound appealing, we’ll be a little disappointed if the onboard battery life of the AirPods isn’t improved. Right now, the 2019 AirPods can handle five hours of playback before needing a rest in their charging case – which isn’t much compared to many rival earbuds."
  ],
  "headers": {
    "4": "1. Improved audio",
    "7": "2. A new design",
    "12": "3. Spatial Audio with dynamic head tracking",
    "15": "4. Hi-res and lossless audio support",
    "21": "5. Bluetooth 5.2",
    "24": "6. Longer battery life"
  },
  "links": {
    "next Apple event": "https://www.techradar.com/news/live/apple-event-october-2021-live-blog",
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "2019 AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Apple event live blog": "https://www.techradar.com/news/live/apple-event-october-2021-live-blog",
    "Cambridge Audio Melomania 1 Plus": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple’s Spatial Audio": "https://www.techradar.com/how-to/apple-music-spatial-audio-and-lossless-guide-heres-how-to-turn-them-on",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "AirPods Max": "https://www.techradar.com/news/airpods-max-airpods-pro-wont-support-new-apple-music-lossless-audio-but-theres-a-silver-lining",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Qualcomm announced aptX Lossless": "https://www.techradar.com/news/qualcomms-aptx-lossless-could-transform-the-way-wireless-headphones-sound",
    "iPhone": "https://www.techradar.com/reviews/iphone-13",
    "Lypertek PurePlay Z3 2.0": "https://www.techradar.com/reviews/lypertek-pureplay-z3-20-review",
    "In a tweet": "https://www.techradar.com/news/airpods-3-tipped-to-launch-in-a-few-days-with-longer-battery-and-bigger-bass"
  }
}