{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-compatible-s-pen-pro-could-finally-use-bluetooth",
  "title": "Samsung Galaxy Z Fold 3-compatible S Pen Pro could launch with Bluetooth",
  "category": "phones",
  "updated": "2021-08-03T19:07:51Z",
  "author": "david-lumb",
  "summary": "Details leak on S Pen Pro, a stylus that won’t damage the Z Fold 3’s display",
  "article": [
    "Details have finally leaked about a new, more advanced Samsung stylus, the S Pen Pro, which could be compatible with the display on the Samsung Galaxy Z Fold 3, expected to launch at Samsung Unpacked on August 11.",
    "The S Pen Pro isn’t a secret – Samsung itself revealed the stylus, suggesting it would launch with the Samsung Galaxy S21 Ultra. While that premium phone didn’t launch with the S Pen Pro, we hadn’t heard anything about it until earlier in July when a rumor linked it with the Z Fold 3.",
    "But the new information, tweeted out by leaker Chun (@chunvn8888), includes some crucial info that’s big if true: unlike the ‘dumb’ analog S Pen that launched with the S21 Ultra, the S Pen Pro could pack Bluetooth functionality like that in the S Pens that come with the Samsung Galaxy Note 20 and Samsung Galaxy Tab S7 Plus. Presumably, that means gesture controls and remote functionality.",
    "Per Chun’s tweet, the S Pen Pro will have the same 0.7mm tip and 4,096 pressure points as the S21 Ultra’s S Pen stylus, but it will also be usable on the Z Fold 3’s foldable display, manually charge via USB-C, and attach magnetically to the back of certain phone cases. Presumably, that won’t also mean wireless charging akin to the way the S Pen charges when clipped to the Tab S7 tablet, but we can hope.",
    "It’ll also be priced at “around 70 bucks in the UK,” which could mean either $70 (around £50) or £70 ( around $97). Either way, it’ll cost more than the standard S Pen’s $39.99 / £34 (roughly AU$50) price tag.",
    "While we’d heard that the Samsung Galaxy Z Fold 3 would launch with S Pen stylus support, suggesting Samsung was positioning the foldable as a replacement of sorts for the Samsung Galaxy Note 21, a company executive recently confirmed the Z Fold 3 had officially replaced the stylus-packing phone, at least for the 2021 lineup.",
    "That may not have comforted Note fans, who probably aren’t looking forward to paying potentially twice the launch price of a Note 20 Plus to get stylus functionality in a foldable Z Fold 3 – not for a device that likely won’t have an S Pen slot, and especially to have a ‘dumb’ stylus like the one that came with the S21 Ultra.",
    "But an S Pen Pro could sweeten that deal somewhat. When Samsung introduced it earlier this year, the Pro stylus looked larger and easier to handle, with what could be multiple buttons on it. Combined with the leaked perks, like Bluetooth and magnetic attachment to phone cases, the S Pen Pro might make the Z Fold 3 a bit more palatable to the productivity-minded Note fans – and maybe getting to use the foldable’s extensive screen as an S Pen canvas might make it more enticing, too."
  ],
  "headers": {
    "5": "Analysis: Could the S Pen Pro make up for the Note 21’s cancellation?"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Unpacked": "https://www.techradar.com/news/rip-galaxy-note-21-samsung-galaxy-z-fold-3-to-launch-in-august-hints-unpacked-invite",
    "revealed": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-works-with-an-s-pen-pro-but-what-does-it-do-differently",
    "linked": "https://www.techradar.com/news/s-pen-pro-support-for-samsung-galaxy-z-fold-3-confirmed-in-fcc-listing",
    "Chun (@chunvn8888": "https://twitter.com/chunvn8888/status/1419827925747068930",
    "heard": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-is-almost-certain-to-get-s-pen-support-heres-why",
    "confirmed": "https://www.techradar.com/news/samsung-confirms-skipping-galaxy-note-21-but-teases-galaxy-z-fold-3-and-flip-3",
    "introduced": "http://v/"
  }
}