{
  "source": "https://www.techradar.com/news/how-to-watch-bloodlands-online-stream-the-new-bbc-crime-drama-from-anywhere",
  "title": "How to watch Bloodlands online: stream the new BBC crime drama from anywhere",
  "category": "computing",
  "updated": "2021-02-21T19:02:34Z",
  "author": "aatif-sulleyman",
  "summary": "DCI Tom Brannick reopens a cold case linked to the Troubles",
  "article": [
    "Veteran detective Tom Brannick (James Nesbitt) is forced to reopen deep wounds and confront a demon from the past after a car is pulled from Strangford Lough, bearing the calling card of the man who murdered his wife two decades ago. We detail below how you can watch Bloodlands online, and enjoy all four episodes from anywhere in the world - including for free in the UK courtesy of the BBC and its iPlayer streaming service.",
    "Written by Chris Brandon and produced by Jed Mercurio, who wrote the magnificent Line of Duty, the cat-and-mouse crime thriller sees Tom and his partner DS Niamh McGovern (Charlene McKenna) re-examine the notorious cold case of a legendary serial killer known as Goliath, who evaded capture during the Troubles.",
    "But it soon becomes clear that the pursuit of justice will come at a heavy cost.",
    "It doesn't take long for Tom and Niamh to find holes in the original investigation, opening up a Pandora's box that implicates colleagues, endangers the lives of their families, and threatens the fragile peace process, 23 years after the signing of the Good Friday Agreement.",
    "Was Goliath a serving police officer? Was he protected by the force? Despite threats to the life of his daughter and the warnings of old friend DCS Jackie Twomey (Lorcan Cranitch), Tom will not walk away. He's hell-bent on conducting the investigation properly, even if it means paying the ultimate price.",
    "The shadow cast by the Troubles makes this more than your average a police thriller, so can read on as we explain how to watch Bloodlands online from anywhere – and completely FREE on the BBC for those located in the UK.",
    "For anyone abroad right now wanting to watch Bloodlands, you’ll likely be unable to watch the miniseries due to annoying regional restrictions.",
    "Fortunately, there’s a simple solution. Downloading a VPN will allow you to stream Bloodlands online no matter where you are. The simple bit of software changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home."
  ],
  "headers": {
    "6": "How to watch Bloodlands online from outside your country"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}