{
  "source": "https://www.techradar.com/news/wandavision-episode-9-release-date-on-disney-plus-when-is-the-season-finale",
  "title": "WandaVision episode 9 release date on Disney Plus: what time is the finale?",
  "category": "entertainment",
  "updated": "2021-03-04T20:48:00Z",
  "author": "samuel-roberts",
  "summary": "Here's when you can watch WandaVision episode 9 on Disney Plus",
  "article": [
    "What time is WandaVision episode 9 released on Disney Plus tomorrow? The next episode in the experimental MCU TV show – and the season finale – goes live on Friday, March 5, at midnight PT / 3AM ET / 8AM GMT. This is the final episode of the run – no second season of WandaVision is currently planned. It's not been entirely ruled out by Marvel, but this series will tie directly in to Doctor Strange in the Multiverse of Madness, which is where the story will continue for now.",
    "WandaVision is the first of the Disney Plus MCU shows, and its weekly release pattern is identical to past originals like The Mandalorian. It'll be followed by another Marvel series, The Falcon and the Winter Soldier, which kicks off on March 19. That one will be just six episodes long, next to WandaVision's nine, but they'll be lengthier instalments.",
    "Some spoilers follow as we discuss what's been happening in WandaVision so far.",
    "In WandaVision episode 8, we saw Wanda being made to relive her life story by Agatha Harkness, including her childhood – which revealed that the Maximoff twin has possessed magic powers since before she was experimented on by Baron von Strucker and Hydra with the Mind Stone. The episode ended with Agatha holding Wanda and Vision's children, Tommy and Billy, hostage – with a throwdown surely set to occur between Wanda and her witch rival.",
    "Below, we'll discuss when WandaVision launches its next episode on Disney Plus, including a full release schedule of episodes as they've been rolling out.",
    "WandaVision episode 9, the season finale, is going to release on Friday, March 5 2021, streaming on Disney Plus from midnight PT / 3AM ET / 8AM GMT. Depending on where you live, this might mean staying up late to avoid spoilers.",
    "Want a full list of WandaVision episode release dates? We've got you covered on that below, all the way up to this week's finale.",
    "There will be a two-week gap between WandaVision's final episode and the start of the second Marvel TV show, The Falcon and the Winter Soldier. You'll have a little time to catch your breath before we catch up with Sam and Bucky, then."
  ],
  "headers": {
    "5": "When is WandaVision episode 9 released on Disney Plus?",
    "6": "WandaVision release schedule",
    "7": "Will WandaVision lead straight into The Falcon and the Winter Soldier?"
  },
  "links": {
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "WandaVision episode 8": "https://www.techradar.com/news/wandavision-episode-8-recap-review",
    "Agatha Harkness": "https://www.techradar.com/news/wandavision-episode-7-ending-explained"
  }
}