{
  "source": "https://www.techradar.com/news/why-you-should-get-an-rtx-2070-or-rtx-2080-gaming-laptop-on-amazon-prime-day",
  "title": "Why you should get an RTX 2070 or RTX 2080 gaming laptop on Amazon Prime Day",
  "category": "computing",
  "updated": "2021-06-21T20:54:39Z",
  "author": "john-loeffler",
  "summary": "Don't think of it as settling",
  "article": [
    "Now that Amazon Prime Day is here, this is a great time to get some fantastic deals on gaming laptops – especially those with Nvidia RTX 2070 and RTX 2080 mobile GPUs.",
    "With everyone falling all over themselves trying to find RTX 3070 and RTX 3080 graphics cards and laptops, we can definitely sympathize with the sentiment that going for a last-gen GPU in your new gaming laptop is a bit like winning a participation trophy for missing out on the best gaming laptops on the market right now.",
    "We definitely get it, but we heartily disagree. You are definitely not settling for an also-ran gaming laptop just because its not running an RTX 3080. The last-gen GPUs are seriously powerful when it comes to on-the-go gaming performance and there are some Prime Day gaming laptop deals that are an absolute steal right now.",
    "While the latest RTX 3070 and RTX 3080 laptop GPUs are definitely impressive, the RTX 2070 and RTX 2080 didn't suddenly start sputtering and fall apart when the new RTX GPUs were released earlier this year.",
    "In terms of pure benchmark performance, the RTX 3070 and RTX 3080 absolutely outclass their predecessors, and not by a small margin either. The RTX 2070 in last year's Gigabyte Aorus 17G scored a 13,950 in 3DMark's Fire Strike benchmark and 5,872 in Time Spy. The RTX 3070 in the Lenovo Legion 5 Pro put up a score of 22,031 and 9,583 in Fire Strike and Time Spy, respectively.",
    "On these results alone, the RTX 3070 is close to doubling the scores of its predecessor. But you don't buy a gaming laptop to run graphics benchmarks all day – you buy them to game. While the Legion 5 Pro averaged 74 fps in our Total War: Three Kingdoms benchmark and 71 fps in Metro: Exodus at 1080p on Ultra (no ray tracing), the Aorus 17G put out 58 fps and 50 fps in those same tests.",
    "These aren't bad framerates in the least bit, and depending on the game, you can definitely approach, if not achieve, 60 fps on some major AAA titles. Heck, even the RTX 2060 mobile GPU in last year's Asus Tuf A15 averaged 45 fps in Metro: Exodus at 1080p on Ultra. It was just last year that this kind of performance was winning awards and blowing gamers' minds that gaming laptops could look this good. That hasn't changed just because gaming laptops with even better GPUs are technically available.",
    "Every year, manufacturers and retailers start clearing out old inventory to make room for the current year's stock, and gaming laptops aren't exempt. While the past year has obviously been weird and all kinds of supply chain issues and chip shortages have disturbed the well-ordered flow of products onto and off the shelves, it hasn't completely upended it.",
    "Space still needs to be made for newer laptops with RTX 3060, RTX 3070, and RTX 3080 GPUs, so you're going to see some pretty sizeable price cuts on last year's RTX 2060, RTX 2070, and RTX 2080 laptops.",
    "While you shouldn't expect every price to get cut in half on Prime Day, you can bet that a lot of RTX 2070 and RTX 2080 gaming laptops are going to get a sizeable discount. That wasn't the case last Prime Day, when these laptops still sold for full price.",
    "If you couldn't afford an RTX 2080 laptop last year, you might start seeing some dropping into your price range starting next week, with even better deals on RTX 2070 and RTX 2060 laptops.",
    "And finally, we get to the big ol' cryptomining rig in the room: you might actually be able to find RTX 2070 and RTX 2080 laptops that you can buy. Really.",
    "Meanwhile, Elon Musk took some of the shine off Bitcoin and Ethereum, so miners aren't as GPU hungry as they were just two months ago. The graphics card shortage has gotten so bad that miners were resorting to buying up laptops with the new RTX cards in bulk to mine cryptocurrencies.",
    "Add the ongoing semiconductor shortage to the mix and you're stuck with very little actual stock of the new RTX 3070 and RTX 3080 laptops that you can buy. Unfortunately, that isn't likely to change any time soon.",
    "You know what has a lot of available stock? RTX 2070 and RTX 2080 gaming laptops, that's what. These laptops were rolling off the assembly line just fine before the pandemic hit and disrupted the global supply chain, and with everyone trying to buy RTX 3070 and RTX 3080 laptops, the supply of these laptops probably exceeds demand right now.",
    "That's good news for you, since that means you are far more likely to actually find stock of these laptops and even see some great Prime Day deals while everyone else is off chasing the dream of finding RTX 3070 and RTX 3080 laptops online that they will probably never find.",
    "Since you can't miss out on what you were never going to be able to buy anyway, go ahead and buy a laptop with a last-gen GPU on Amazon Prime Day, save some money, and get back to gaming."
  ],
  "headers": {
    "3": "RTX 2080 and RTX 2070 laptop GPUs are still plenty powerful",
    "7": "Prices for last year's RTX 2070 and RTX 2080 laptops are set to drop",
    "11": "You might actually be able to buy one",
    "17": "Amazon deals available now: quick links"
  },
  "links": {
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Prime Day gaming laptop deals": "https://www.techradar.com/news/these-prime-day-gaming-laptop-deals-can-save-you-up-to-dollar300-on-razer-asus-and-more-right-now",
    "Gigabyte Aorus 17G": "https://www.techradar.com/reviews/gigabyte-aorus-17g",
    "Asus Tuf A15": "https://www.techradar.com/reviews/asus-tuf-a15",
    "Elon Musk took some of the shine off": "https://www.techradar.com/news/heres-hoping-elon-musk-tanks-crypto-so-miners-will-leave-our-rtx-3080s-alone",
    "buying up laptops": "https://www.techradar.com/news/cryptominers-bulk-buying-rtx-3000-laptops-in-china-to-mine-ethereum"
  }
}