{
  "source": "https://www.techradar.com/news/powerful-new-m1-macbook-pro-models-expected-to-feature-mini-led-display",
  "title": "Powerful new M1 MacBook Pro models expected to feature mini-LED display",
  "category": "computing",
  "updated": "2021-05-04T13:56:44Z",
  "author": "jess-weatherbed",
  "summary": "Apple production highs and lows",
  "article": [
    "A key part of Apple's production chain has given additional weight to the long-standing rumors of both a 14-inch and 16-inch MacBook Pro. The M1 iPad Pro announced at the Apple Spring Loaded event is expected to launch with limited initial availability due to mini-LED production issues, a problem that has reportedly been solved by a key third-party vendor. Taiwan Surface Mounting Technology (TSMT) previously encountered technical issues with mounting mini-LED backlights and printed circuit boards which may explain the low stock availability expected for the iPad Pro launch.",
    "TSMT has since announced that the issues have been rectified and production yield has been successfully increased by over 95% “for the two upcoming mini-LED-backlit MacBook models.” As reported by Digitimes, TSMT is the exclusive provider for mini-LED backlights used not only in the 12.9-inch M1 iPad Pro, but also “for the two upcoming mini-LED-backlit MacBook models\". The 16-inch MacBook Pro, one of Apple's best-selling products, has been waiting for an update for around two years after its last major redesign in 2019. It's likely that these two MacBook Pro models will be refreshed with Apple's silicon rather than 11th-gen Intel processors, but the delay on the launch has also given way for rumors that a more powerful M1X chip could be on the horizon for both the 14-inch and 16-inch Pro devices. Despite only being rumors, this actually makes a lot of sense – the current M1 chip, despite all its well-deserved praise, simply isn't powerful enough for industry professionals such as video editors and VFX artists. Blender and 4k editing require greater multi-core CPU performance than the M1 chip can currently provide. The inclusion of mini-LED would also greatly benefit artists and folk working in graphically demanding careers, and the building evidence and rumors is giving a lot of weight to what we can expect from the relaunched MacBook Pro models, but it's important to not get lost in the sauce. We simply won't know for sure until Apple makes an official announcement, which we currently estimate may happen in late 2021.",
    "Via WCCFTech"
  ],
  "headers": {
    "1": "Bright screen, brighter potential"
  },
  "links": {
    "14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "16-inch MacBook Pro": "https://www.techradar.com/news/macbook-pro-16-inch-2021/reviews/macbook-pro-16-inch-2019-review",
    "M1 iPad Pro": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "Apple Spring Loaded": "https://www.techradar.com/news/6-things-you-may-have-missed-from-apples-spring-loaded-event",
    "mini-LED": "https://www.techradar.com/news/mini-led-tv",
    "Digitimes": "https://www.digitimes.com/news/a20210503PD203.html",
    "12.9-inch M1 iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "M1X chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "WCCFTech": "https://wccftech.com/mini-led-macbook-pro-not-delayed/"
  }
}