{
  "source": "https://www.techradar.com/news/microsoft-edge-finally-fixes-its-youtube-problem",
  "title": "Microsoft Edge finally fixes its YouTube problem",
  "category": "computing",
  "updated": "2021-08-26T14:40:08Z",
  "author": "daryl-baxter",
  "summary": "No more freezing issues on YouTube... for now",
  "article": [
    "Microsoft has finally fixed a long-standing issue in its Edge browser, where it would freeze at random moments when a video was playing in YouTube.",
    "Even though the browser runs through Google’s Chromium engine, Microsoft has developed its own version for Edge, which is why some bugs, such as this one, appear here and not in Google’s Chrome browser as well.",
    "This issue has been prevalent over the past month, with only YouTube being affected, not other video sites such as Vimeo, or even Netflix and BBC iPlayer.",
    "According to a Reddit post, the whole browser would freeze as soon as a video in YouTube would either begin to play, or it was changed to a full screen view.",
    "At worst this would crash the Edge browser, requiring you to close it through Task Manager and having to restore your tabs.",
    "This issue is in the official build version of 90.0.818.46, released on April 22, 2021.",
    "Even though the latest release is version 90.0.818.62, it doesn’t fix the YouTube issue. A representative from the Edge team recommended updating to the Canary channel, the pre-release version of the browser from Microsoft’s Insider site if you’re experiencing constant issues when trying to watch a video.",
    "The official version of Edge is usually released every six weeks, so the fix will likely arrive there by the end of this month.",
    "Via Laptop Mag"
  ],
  "headers": {
    "3": "What was the issue?",
    "6": "How to update"
  },
  "links": {
    "Reddit post": "https://www.reddit.com/r/edge/comments/mxls7w/edge_chromium_crashes_when_i_have_two_youtube/",
    "Insider site": "https://www.microsoftedgeinsider.com/en-us/download",
    "Laptop Mag": "https://www.laptopmag.com/news/microsoft-edge-update-addresses-youtube-streaming-issues"
  }
}