{
  "source": "https://www.techradar.com/news/gen-z-is-behaving-recklessly-online-and-will-live-to-regret-it",
  "title": "Gen Z is behaving recklessly online - and will live to regret it",
  "category": "pro",
  "updated": "2021-11-15T15:46:53Z",
  "author": "desire-athow",
  "summary": "Handing out personal information could be a slippery slope",
  "article": [
    "Members of Generation Z, the cohort of people born in the first decade of the 21st century, care about digital privacy, but their desire for online fame and popularity is greater, a new study from ExpressVPN suggests.",
    "The VPN provider surveyed 1,500 young adults from the US to evaluate their online habits and attitudes towards social media, and identified a troubling pattern that could have dire consequences.",
    "The survey found that Generation Z isn’t trusting of the social media platforms they frequent, expressing concern that platforms may be using their images for facial recognition (67%) and wariness about oversharing personal information (66%).",
    "They also typically use at least one privacy and security setting on their social media accounts, such as two-factor authentication (64%) and disabling contact syncing (50%).",
    "Yet, paradoxically, 78% of Generation Z said they would be willing to give up more personal data in exchange for social media fame, and 40% would do so in exchange for early access to new features on their favorite platforms.",
    "About a third of members of Generation Z also admitted to purchasing followers on social media, even though half of them knew it posed a potential security risk and there was a high likelihood of the followers being automated bots.",
    "Yet, those who purchase followers are willing to take this risk for the potential of getting a verified profile (40%) and/or the prospect of attracting brand collaborations (36%).",
    "“One of the most surprising findings is that even though the Gen Z knows how social media corporations are mining personal data and selling it to third parties, they are still willing to disclose their most personally identifiable details in exchange for social media fame. An Instagram post or TikTok video might grant a few days of fame, but a third-party company's access to your personal information can last forever,” commented Harold Li, Vice President, ExpressVPN.",
    "The willingness to hand out personal information in exchange for short-term gains could be a slippery slope for Gen Z. Bad habits are hard to change, after all.",
    "ExpressVPN has been in the news of late due to concerns about one of its executives and its proposed acquisition by Kape Technologies, the impact of which is still unclear.",
    "News of the acquisition led to the resurfacing of earlier claims that Kape predecessor, Crossrider, was previously responsible for developing and distributing adware or malware.",
    "Such claims appear to be erroneous; the Crossrider development platform had simply been misused by some third parties.",
    "There still remain questions about how the acquisition will impact ExpressVPN’s service going forward, though the company has said ExpressVPN will continue to be run as an independent service."
  ],
  "headers": {
    "5": "Risky behavior",
    "9": "ExpressVPN latest"
  },
  "links": {
    "privacy": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "new study": "https://xvtelink.com/blog/gen-z-social-media-survey/?a_fid=744&data1=trd-us-7469735880835391000",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "VPN": "https://www.techradar.com/best-vpn",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "concerns about one of its executives": "https://www.techradar.com/news/expressvpn-and-project-raven-everything-we-know-so-far",
    "acquisition by Kape Technologies": "https://www.techradar.com/news/expressvpn-to-join-kape-in-largest-deal-ever-in-vpn-industry",
    "appear to be erroneous": "https://restoreprivacy.com/kape-technologies-crossrider-malware/"
  }
}