{
  "source": "https://www.techradar.com/news/microsoft-cloud-for-retail-wants-to-make-it-easier-to-run-a-business-online",
  "title": "Microsoft Cloud for Retail wants to make it easier to run a business online",
  "category": "computing",
  "updated": "2021-01-14T13:38:41Z",
  "author": "barclay-ballard",
  "summary": "It's Microsoft's second industry-specific cloud vertical",
  "article": [
    "Microsoft has announced a new industry-specific cloud solution that will provide an end-to-end shopper journey to help businesses in the retail sector. Microsoft Cloud for Retail will bring together disparate data sources across the retail value chain and provide intelligent capabilities utilizing Microsoft Azure, Microsoft Power Platform, Microsoft 365, Dynamics 365 and Microsoft Advertising.",
    "Specific details surrounding Cloud for Retail are thin on the ground at the moment but the platform does promise retail-specific solutions to some of the industry’s biggest challenges.",
    "Leveraging Microsoft’s extensive partner ecosystem, the platform hopes to offer users the chance to know their customers better, empower their employees and create an intelligent supply chain.",
    "Cloud for Retail is Microsoft’s second industry-specific vertical cloud offering after the firm launched Cloud for Healthcare last year. That service is priced at $95 per month, which should provide some idea of how much the new retail offering will cost.",
    "Microsoft announced a number of other retail-specific updates in addition to the Cloud for Retail news. Dynamic 365 has been updated to include a preview of B2B ecommerce functionality, and the firm also revealed that daily active Teams users in the retail space had increased by more than 280% since the start of the coronavirus pandemic.",
    "Microsoft announced Cloud for Retail at the NRF 2021 retail show. The Redmond-based firm has confirmed that the preview version of the platform is now available, with general availability yet to be announced.",
    "“Microsoft Cloud for Retail aims to connect experiences across the end-to-end shopper journey with integrated and intelligent capabilities,” Shelley Bransten, Corporate Vice President of Global Consumer Goods & Retail Industries at Microsoft, said.",
    "“By bringing together disparate data sources across the retail value chain, we will enable retailers to realize the true value of their data by enriching core business processes and turning data into actionable insights.”",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Cloud commerce"
  },
  "links": {
    "Microsoft Cloud for Retail": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2483412156752387000&xs=1&url=https%3A%2F%2Finfo.microsoft.com%2Fww-landing-cloud-for-retail-stay-updated.html&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-cloud-for-retail-wants-to-make-it-easier-to-run-a-business-online",
    "NRF 2021": "https://virtualbigshow.nrf.com/",
    "ZDNet": "https://www.zdnet.com/article/microsoft-debuts-its-second-vertical-cloud-microsoft-cloud-for-retail/"
  }
}