{
  "source": "https://www.techradar.com/news/microsoft-flight-simulators-uk-focused-world-update-has-finally-landed",
  "title": "Microsoft Flight Simulator’s UK-focused World Update has finally landed",
  "category": "computing",
  "updated": "2021-02-16T19:46:23Z",
  "author": "carly-page",
  "summary": "After delays, World Update 3 is now available to download",
  "article": [
    "Microsoft is rolling out a massive update to Flight Simulator today that will bring a host of UK cities and airports to the PC game.",
    "Flight Simulator’s World Update 3 was originally supposed to arrive in mid-January, but the release was pushed back after developer Asobo Studios ran into issues incorporating the new scenery.",
    "Just hours after the developer confirmed that the update was in its \"final polish phase\", Microsoft has announced that World Update 3 is available for users to download now.",
    "The update is focused on the UK and Ireland, and boasts improved aerial and elevation details, five new hand-crafted airports - Barra, Land's End, Liverpool, Manchester-Barton and Out Skerries, along with five brand-new photogrammetry cities: Birmingham, Bristol, Cambridge, London and Oxford.",
    "The long-awaited World Update 3 also adds almost 80 new points of interest, a list which includes Land's End, the Eden Project, Stonehenge, Salisbury Cathedral, the Spinnaker Tower, Brighton Palace Pier and the Cliffs of Dover.",
    "Microsoft notes that, in addition, the update adds “compelling architectural elements throughout the region, ranging from British manors and Victorian homes to countryside stone structures, castles and churches – and even some drive-thru restaurants.”",
    "Also included with the update are a trio of new activities: an Iconic Flight in the Northern Isles and two diverse Landing Challenges, an epic one up north on the Shetland archipelago, and a fierce one far south in the turbulent skies over Southeast England.",
    "World Update 3: United Kingdom & Ireland is available today as a free download for all Microsoft Flight Simulator users.",
    "The next major update, World Update 4, looks set to arrive in March, and will focus on improving Flight Simulator's rendition of France and Benelux."
  ],
  "headers": {},
  "links": {
    "Flight Simulator": "https://www.techradar.com/reviews/microsoft-flight-simulator",
    "PC game": "https://www.techradar.com/news/the-best-gaming-pc",
    "announced": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-5163505123715413000&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F02%2F16%2Fmicrosoft-flight-simulator-world-update-iii-uk-ireland-now-available-for-free%2F"
  }
}