{
  "source": "https://www.techradar.com/news/over-half-of-employees-using-own-devices-and-software-to-work-from-home",
  "title": "Over half of employees using own devices and software to work from home",
  "category": "computing",
  "updated": "2021-04-27T10:32:56.172Z",
  "author": "mike-moore",
  "summary": "Pandemic has led many workers to become tech experts, Gartner finds",
  "article": [
    "The majority of employees are still using personal devices to work from home during the pandemic, despite possible security risks, new research has found.",
    "A global survey of over ten thousands workers by analyst firm Gartner found that 55% of those surveyed are using personally owned smartphone or laptop devices for their work at least some of the time.",
    "This change in becoming more sel-reliant has led a growing number of workers to consider themselves to now be experts in using digital technology, with 18% of those surveyed by Gartner claiming to be so.",
    "The survey also noted a change in the type of devices being used by home workers, with portable devices becoming more important during 2020. Overall, workers reported an 11% increase in the time spent using laptops, smartphones or tablets - with the amount of time spent on desktops declining by 8%.",
    "More than half (55%) also said that they were now using applications or web services that they had personally obtained and set up in order to collaborate better with co-workers. Althoug most of these services were employer-sanctioned, this may raise questions over security and safety whilst working outside of the controlled office IT environment.",
    "However many workers reported that they were much more productive when working from home, with the flexibility of remote working a boost for many. Over a third (36%) of those employees who saw an increase in the amount they worked at home since January 2020 reported an increase in productivity, while 35% reported no change.",
    "“Workers seized on the crisis to improve their mastery of a wide range of technologies and applications in the space of a few months,” said Whit Andrews, distinguished research vice president at Gartner. “Today’s workplace is vastly different from 2019’s, and CIOs must prepare their technology stacks, office spaces, IT teams and mindsets to embrace the new future of the digital workplace.”",
    "“When organisations were forced to go remote in early 2020, workers started to rely on their own devices or programmes they discovered themselves to make up for their employers’ technology shortcomings,” Andrews added. “In 2021, organisations can embrace this trend by expanding the choice of devices and software programmes that workers can use with little or no friction.”"
  ],
  "headers": {
    "3": "Expert level"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "laptop": "https://www.techradar.com/news/best-business-laptops"
  }
}