{
  "source": "https://www.techradar.com/news/lg-rollable",
  "title": "LG Rollable phone price, news, leaks and why it won't be released",
  "category": "phones",
  "updated": "2021-05-04T14:42:10.287Z",
  "author": "james-rogerson",
  "summary": "LG's first rollable phone",
  "article": [
    "Pour one out for the LG Rollable - its January unveiling kicked off 2021 with excitement and curiosity, and everyone was anticipating its launch... until April when LG announced it was leaving the smartphone business.",
    "We're sorry to say, then, that the LG Rollable almost certainly won't go on sale ever. While this hasn't been explicitly confirmed, it's all but guaranteed seeing as the rollable smartphone's creators don't exist anymore.",
    "Sure, there are a few other rollable phones that might launch - the Oppo X 2021 might get a follow-up, and TCL has explicitly confirmed it's launching a rolling or folding smartphone in 2021. So it's not the end for this kind of form factor, just a sad occurrence for the LG Rollable.",
    "Below you'll find all the leaks, news and rumors that we'd heard about the LG Rollable prior to its likely cancellation, so while it will probably never launch, you can get a clear idea of what might have been.",
    "Sadly, it looks like the LG Rollable has died with LG's smartphone business. The company has confirmed that it's no longer making phones, which presumably includes the LG Rollable.",
    "The only slight hope we have that it might launch stems from rumors that the LG Rollable was set to be announced sometime in early 2021 - in other words, that it's very nearly finished, so wouldn't take much work for LG to send it out into the world.",
    "It had even recently been spotted in a Bluetooth SIG certification, which typically happens close to launch.",
    "But even before LG officially exited the smartphone market, there had been whispers of it abandoning the project.",
    "Indeed, sources previously claimed that LG had told its suppliers that the Rollable has been put on hold, though LG responded to this saying that it hasn't finalized any decision about the project. Not being 'finalized' though leaves the possibility of cancellation open.",
    "As for the price - if it ever launches - a source claims that the LG Rollable will cost $2,359 (roughly £1,775, AU$3,130), which would make it even more expensive than the likes of the Samsung Galaxy Z Fold 2. But then this is an entirely new type of phone, so whether or not this price is right, it’s sure to cost a lot.",
    "Still, there might soon be a bunch of rollable phones, as both TCL and Oppo are also working on rollable handsets. These more seem to be in the concept stages right now so probably aren’t as far along as LG’s, but once there’s competition in the market, prices could quickly drop.",
    "The biggest LG Rollable news comes from LG itself, which has shown how the phone looks from the front – along with how it looks when it’s changing size. You can see all of that in the GIF above.",
    "In short, it starts out looking like an ordinary smartphone, but the top (when held in landscape) can extend upwards to create a small tablet. There doesn’t appear to be a visible front-facing camera, which could be because this isn’t the finished form of the device, or might perhaps mean it’s built into the screen.",
    "We’ve previously seen a very similar design in an LG patent, an image of which can be seen above, but in the patent, two sides of the phone could extend and retract, whereas in LG’s teaser we only see one side do this. That might mean only one side will on the finished phone, but it’s equally possible that both will and that LG simply chose to only show one.",
    "As for the specs, one report suggests that the LG Rollable will have a 7.4-inch screen when fully extended, and a 6.8-inch one when not.",
    "A South Korean forum post spotted by LetsGoDigital says the same, but also includes the images you can see below (which are similar to what LG has now shown) and an additional detail – that the resolution at 7.4 inches will apparently be 1600 x 2428, while at 6.8 inches it will apparently be 1080 x 2428.",
    "Another source similarly claims that the LG Rollable will have a 7.4-inch screen, along with a top-end Snapdragon 888 chipset, 16GB of RAM, and a 4,200mAh battery.",
    "With all these leaks pointing to the same screen size, we’d say that aspect is likely accurate, and a Snapdragon 888 chipset is very likely too, as that’s expected to be the main flagship phone chipset of 2021."
  ],
  "headers": {
    "4": "LG Rollable release date and price",
    "11": "LG Rollable news, leaks and rumors"
  },
  "links": {
    "LG announced it was leaving the smartphone business": "https://www.techradar.com/news/why-lg-is-leaving-the-mobile-phone-business",
    "Oppo X 2021": "https://www.techradar.com/news/ive-used-the-oppo-x-2021-rollable-smartphone-what-i-like-and-what-i-dont",
    "explicitly confirmed it's launching a rolling or folding smartphone": "https://www.techradar.com/news/tcl-confirms-it-will-launch-a-rollable-or-foldable-phone-this-year",
    "confirmed that it's no longer making phones": "https://www.techradar.com/news/lg-has-officially-quit-making-phones-heres-whats-next",
    "set to be announced sometime in early 2021": "https://www.techradar.com/news/lg-rollable-could-launch-earlier-than-we-expected-heres-why",
    "Bluetooth SIG certification": "https://www.techradar.com/news/lg-rollable-smartphone-is-one-step-closer-to-reality",
    "abandoning the project": "https://www.techradar.com/news/we-might-not-see-the-lg-rollable-go-on-sale-after-all",
    "has been put on hold": "https://www.techradar.com/news/lg-rollable-may-be-delayed-or-even-cancelled-suggests-supply-chain-intel",
    "source claims": "https://www.techradar.com/news/lg-rollable-price-leak-suggests-it-could-be-the-most-expensive-foldable-phone",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "TCL": "https://www.techradar.com/news/video-leak-shows-off-tcls-rollable-smartphone-screen-tech",
    "Oppo": "https://www.techradar.com/news/oppos-next-foldable-phone-will-have-a-rollable-oled-display-but-you-cant-buy-it",
    "comes from LG itself": "https://www.techradar.com/news/lg-rollable-teased-as-the-first-phone-with-a-rollable-screen",
    "an LG patent": "https://www.techradar.com/news/lg-rollable-phone-could-have-foldable-phones-beat-based-on-this-patent",
    "one report": "https://www.techradar.com/news/lg-rollable-could-launch-earlier-than-we-expected-heres-why",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/lg-rollable-oprolbare-telefoon/",
    "similarly claims": "https://www.techradar.com/news/lg-rollable-price-leak-suggests-it-could-be-the-most-expensive-foldable-phone"
  }
}