{
  "source": "https://www.techradar.com/news/pentagon-may-cancel-jedi-contract-and-start-over",
  "title": "Pentagon may cancel JEDI contract and 'start over'",
  "category": "computing",
  "updated": "2021-02-04T22:01:23Z",
  "author": "barclay-ballard",
  "summary": "The Pentagon is growing frustrated by the ongoing legal battle",
  "article": [
    "The Pentagon could be set to cancel the $10 billion Joint Enterprise Defense Infrastructure (JEDI) contract it awarded to Microsoft in 2019, as a legal battle with Amazon rages on. The cancellation, should it occur, could provide significant financial benefits for AWS, with the cloud provider ready to swoop in.",
    "A new memo has revealed the extent of the Pentagon’s frustration with the legal wrangling. In particular, the memo states that, should Amazon’s complaint be upheld, the entire JEDI contract may be abandoned.",
    "“Regardless of the JEDI Cloud litigation outcome, the Department [of Defense] continues to have an urgent, unmet requirement,” the memo read. “Specifically, the Department’s need for an enterprise-wide, commercial cloud services for all three classification levels, extending from the homefront to the tactical edge, at scale. We remain fully committed to meeting this requirement—we hope through JEDI—but this requirement transcends any one procurement, and we will be prepared to ensure it is met one way or another.”",
    "The legal battle over which cloud provider is awarded the JEDI deal is long-running, starting even before Microsoft won the contract, with Oracle launching a legal challenge in July 2019. Amazon then filed its own challenge in November of that year, around a month after Microsoft became the sole recipient of the cloud contract.",
    "Amazon has managed to secure an injunction preventing Microsoft from beginning work on the JEDI work, leaving the Pentagon without an essential cloud resource. Given that the US Department of Defense would rather avoid a lengthy court battle and the sensitive information that it could bring to light, the new memo is preparing the way for the JEDI contract to be dropped entirely.",
    "An exciting possibility, from Amazon’s point of view anyway, is one where the Pentagon switches to a multi-cloud approach. In addition, AWS just recently became the commercial cloud provider for defense agencies through a separate contract, which would also stand it in good stead should it attempt to claim further work with the Pentagon.",
    "Via Business Insider"
  ],
  "headers": {
    "3": "Cloud contracts"
  },
  "links": {
    "JEDI": "https://www.techradar.com/news/amazon-demands-cancellation-of-dollar10bn-jedi-cloud-contract-awarded-to-microsoft",
    "read": "https://assets.documentcloud.org/documents/20467925/dod-info-paper-jedi-cloud-litigation-milestone-jan-2021.pdf",
    "Business Insider": "https://www.businessinsider.com/pentagon-jedi-microsoft-amazon-has-opportunity-2021-2?r=US&IR=T"
  }
}