{
  "source": "https://www.techradar.com/news/microsoft-reiterates-carbon-negativity-pledge-with-a-recycled-mouse",
  "title": "Microsoft reiterates carbon negativity pledge with a recycled mouse",
  "category": "computing",
  "updated": "2021-09-23T10:14:09Z",
  "author": "rhys-wood",
  "summary": "Made from recycled ocean plastic",
  "article": [
    "During Microsoft's latest Surface event, we saw many products that we were expecting to be announced... and some we didn't. Case in point, a new computer mouse partly constructed from recycled ocean-bound plastics.",
    "As reported by CNET, the mouse is made from roughly 20% recycled ocean plastic and stored in completely recyclable packaging. The objective of developing such a peripheral seems to lie in Microsoft showing its seriousness in pledging carbon negativity by 2030.",
    "If you're interested, the mouse can even be pre-ordered on Microsoft's US store for $24.99 and will launch on October 5, 2021. It'll also be available worldwide on October 10 but we don't have confirmed global prices yet.",
    "Microsoft CEO Satya Nadella added some context during the Surface event, stating: \"If you're serious about innovation, you must also be serious about accessibility for everyone, and the sustainability of our most finite resource - our planet.\"",
    "Microsoft also plans to make company-wide changes to materials used in the manufacturing of its products and packaging, so it's highly likely that its new mouse is just the first of many devices to be made from recycled materials.",
    "Microsoft's endeavor to go carbon negative by 2030 is an ambitious, but admirable one. And its goals line up with several other large companies aiming for at least carbon neutrality in the next decade, including Apple, Google and Sky.",
    "It might even sound a little strange at face value, but over the next few years, we may start seeing more and more products from Microsoft and other hardware manufacturers be made from recycled materials. We say it's only a matter of time before the likes of Xbox consoles and Surface tablets are made from recycled plastics and components.",
    "It would be a huge selling point for many, not least of all among the most environmentally conscious of us. It would ultimately mean that less non-recycled materials are being manufactured to create our favorite products, lowering the carbon footprint of participating companies.",
    "Just how much of a positive impact this will have on the environment in ten years' time is hard to say. A 2017 study found that 100 companies were responsible for the majority of the planet's greenhouse gas emissions, including oil giants like ExxonMobil, BP and Shell.",
    "Projects like Microsoft's recycled mouse seem almost cute in comparison, but it is a statement of intent regardless. Here's hoping that carbon negativity becomes more of a reality for corporations other than Microsoft, as we're likely going to need all the help we can get to push back against the very worst offenders."
  ],
  "headers": {
    "5": "Analysis: a recyclable future?"
  },
  "links": {
    "Surface event": "https://www.techradar.com/news/what-to-expect-from-microsofts-surface-event",
    "CNET": "https://www.cnet.com/news/microsoft-unveils-new-mouse-made-from-ocean-bound-trash-pledges-to-go-zero-waste-water-positive-by-2030/#ftag=CAD590a51e",
    "pledging carbon negativity by 2030": "https://www.techradar.com/news/microsoft-pledges-to-go-carbon-negative-by-2030",
    "Microsoft's US store": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4807593949931926000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fd%2Fmicrosoft-ocean-plastic-mouse%2F8xh06gbzm3nd",
    "Apple": "https://www.techradar.com/news/apple-pledges-to-be-carbon-neutral-by-2030",
    "2017 study": "https://www.theguardian.com/sustainable-business/2017/jul/10/100-fossil-fuel-companies-investors-responsible-71-global-emissions-cdp-study-climate-change"
  }
}