{
  "source": "https://www.techradar.com/news/the-steam-deck-could-finally-get-me-into-pc-gaming",
  "title": "The Steam Deck could finally get me into PC gaming",
  "category": "gaming",
  "updated": "2021-07-25T11:00:05Z",
  "author": "vic-hood",
  "summary": "Opinion: Hassle-free Civ on my couch",
  "article": [
    "The prospect of PC Gaming has always intimidated me. What type of setup do I need? Which GPU is best? Which motherboard do I need? If I spend a chunk of money on a setup, will it soon be out-of-date? So, I’m ashamed to say, I’ve shied away from it, opting to play games on console whenever possible.",
    "When I eventually did bite the bullet and get myself a decent gaming setup, Covid-19 hit. Like many others, the TechRadar team began working from home and my new setup became a workspace rather than the gaming kingdom I had imagined. Where the thought of PC Gaming had previously intimidated me, it now nauseates me. The last thing I want to do at the end of the day is to return to the desk I’ve already spent hours hunched over. My poor back needs a break and my mind needs some detachment.",
    "As a result, there are a multitude of PC games gathering dust in my Steam library. Fantastic games that I would love to play - but from the comfort of my couch rather than my workspace. The Steam Deck may finally offer me that opportunity and could make a PC gamer of me yet.",
    "I’m well aware that there are other options available to let desktop-avoidant gamers such as myself play games away from my workspace. But, let’s be honest, it’s a right faff to set up remote play and then a controller on top of that.",
    "The Steam Deck means that I will simply be able to pick up and play PC games from the comfort of my couch - allowing for a separation between work and play (something which is often difficult in my job). Sure, they may not always look as good or perform as well as they would on a high-end PC, but it’s not something I’m precious about, especially given that the main draw of the Steam Store for me is its hidden indie gems which don’t require a lot of horsepower.",
    "While my Switch Lite already offers portable gaming, frankly I begrudge having to repurchase games I already own on one platform on another, especially when so many lack cross-progression. Which has meant that if I want a cheeky five-hour long game of Civ 6 then I do need to drag myself back to my PC to avoid losing my treasured ongoing annihilation by Gandhi.",
    "With Steam Deck, that won’t be an issue as I will be able to play my PC games pretty much anywhere I please, without having to shell out for another, more portable version of these games for the commute. What’s more, I will have the option to play PC games I’ve gathered up on other stores and launchers. In comparison, the Nintendo eShop feels restricted and awkward to navigate.",
    "Perhaps the biggest obstacle to PC Gaming that the Steam Deck should reduce is the price. For a decent gaming PC setup, that you don’t need to upgrade again within a few years, you’re easily looking at upwards of $1200/£1200 - while a gaming laptop could set you back around $750/£750. Not everyone has that kind of money. In comparison, while still not cheap, the Steam Deck’s highest tier option costs $649 / £569 - with cheaper options available.",
    "While spending money on a Steam Deck rather than simply rebuying a game seems like a sledgehammer approach, it also has more longtail value than my Switch Lite would. The Steam Deck is considerably more powerful than the Nintendo Switch, Switch Light and the Switch OLED, meaning that it’s likely to enjoy a longer lifespan as more hardware-intensive titles are released.",
    "If you consider that the Switch OLED is Nintendo’s newest machine, and is still significantly less powerful than the Steam Deck, it makes more sense for me to simply cut my losses with the Switch Lite and jump ship to the Steam Deck. Sorry, Mario.",
    "It’s an act of defiance I never thought I would commit, ousting a beloved Nintendo handheld for a temptress of a Steam handheld. But Nintendo seriously dropped the ball and Valve is now offering what the Nintendo Switch Pro could have been. And, as someone who isn’t enticed by Nintendo’s first-party offerings, there’s little left keeping me on Switch.",
    "The Steam Deck looks to finally make PC gaming both more practical and accessible, unlocking a door that was previously locked to many and hopefully encouraging gamers of all ages and abilities to give PC games a try.",
    "I personally am looking forward to finishing work, putting my feet up on the couch, booting up Civ 6 in my Steam Deck and continuing to get walloped by Gandhi."
  ],
  "headers": {
    "3": "PC gaming on the go",
    "7": "Lite-ening the load",
    "11": "Opening up PC Gaming"
  },
  "links": {
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Switch Light": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2"
  }
}