{
  "source": "https://www.techradar.com/news/ericsson-predicts-580m-5g-subscriptions-by-end-of-2021",
  "title": "Ericsson predicts 580m 5G subscriptions by end of 2021",
  "category": "phones",
  "updated": "2021-06-16T10:10:45Z",
  "author": "steve-mccaskill",
  "summary": "Ericsson optimism remains a post-pandemic recovery continues",
  "article": [
    "Ericsson continues to be predictably optimistic about the pace of 5G adoption, declaring that there will be 580 million subscriptions by the end of 2021.",
    "There had been some concerns last year that Covid-19 would delay rollouts of 5G networks and dampen demand among consumers who may decide they have other priorities given the wider economic situation.",
    "However, the latest Ericsson Mobility Report says strong support from the Chinese government, the greater availability and affordability of commercial devices, and the potential role of 5G in the post-pandemic recovery means 5G is still on track to be the fastest adopted mobile generation in history.",
    "It says operators are adding subscribers at a rate of one million every day and predicts there will be 3.5 billion subscription and 60% population coverage by the end of 2026. Northeast Asia will account for 1.4 billion of these, while North America will have a penetration rate of 84%. Take up in Europe, where 4G networks have traditionally been stronger, will be slower.",
    "In the UK, which was one of the first major European nations to launch 5G, all four major mobile operators have now launched next-generation services.",
    "“This landmark twentieth edition of the Ericsson Mobility Report shows that we are in the next phase of 5G, with accelerating roll-outs and coverage expansion in pioneer markets such as China, the USA and South Korea,” declared Fredrik Jejdling, Executive Vice President and Head of Networks, Ericsson. “Now is the time for advanced use cases to start materializing and deliver on the promise of 5G. Businesses and societies are also preparing for a post-pandemic world, with 5G-powered digitalization playing a critical role.”",
    "More efficient 5G networks will increase capacity to support growing demand for data and lower operators’ expenses. Which is just as well, as bandwidth-hungry applications will see global mobile data traffic increase from 49 exabytes at the end of 2020 to 237 exabytes by 2026. Meanwhile, the average data consumption per user will rise from 10GB to 35GB during the same period.",
    "The report also offers an insight into the IoT opportunity for operators, with the adoption of Massive IoT technology to increase by four fifths in 2021, accounting for 330 million connections. By 2026, Massive IoT standards like NB-IoT will account for 46% of all cellular IoT connections."
  ],
  "headers": {
    "3": "Ericsson 5G subscriptions"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}