{
  "source": "https://www.techradar.com/news/this-hgtv-homer-by-sherwin-williams-paint-and-primer-is-the-one-step-way-to-ensure-your-curb-appeal-updates-last-part-of-lowes-list-for-innovation",
  "title": "This HGTV Home® by Sherwin-Williams paint and primer is the one-step way to ensure your curb appeal updates last: part of Lowe’s List for Innovation",
  "category": "smart-home",
  "updated": "2021-05-17T16:02:34Z",
  "author": "sponsored",
  "summary": "An innovative exterior paint and primer that repels water",
  "article": [
    "Painting the outside of your home is stressful enough. From choosing the color to buying the equipment, you don’t need the added burden of hours of research to figure out which paint will last the longest and hold up against the elements.",
    "Lowe’s has done the work for you with their Lowe’s List for Innovation badge. The designation is a simple way for DIYers and homeowners to know that a product has been thoroughly vetted by Lowe’s as a high-quality and innovative product. The list includes tools, appliances, washing machines – and yes, even paint.",
    "Lowe’s has awarded the Lowe’s List for Innovation badge to a groundbreaking paint and primer, the HGTV Home® by Sherwin-Williams Everlast™ Exterior Paint and Primer. Trust us: it’s going to change your DIY projects forever.",
    "Every DIY enthusiast knows that it’s best to choose a top-quality product that will get the job done and last for years to come. The Everlast paint and primer offers just that. The exterior paint and primer was released in 2020 in three different sheens – flat, satin, and semi-gloss. While most exterior paints cost between $40-$70, Everlast is $48.98-$53.98 per gallon. That’s incredibly cost-effective.",
    "Not only is the Everlast exterior paint and primer made with 100% acrylic enamel (meaning it’s durable and has extreme-all weather protection), but with a weather tight finish, the paint adjusts to various temperatures. That’s important because it means that the paint won’t crack, peel, or blister on your siding or trim due to the changing of the seasons.",
    "However, the true innovative feature of this paint is the water beading technology. Moisture is a big concern for homeowners. It can creep and crawl into spaces you didn’t know existed and create long-term and costly damage. The water beading technology in the paint repels water. In fact, it only takes an hour from application for the paint’s technology to start working – even against a rainstorm! You won’t have to worry about blisters, water marks, or the paint running when droplets rain down.",
    "Everlast is a paint and primer in one and grips to unprimed, glossy, or difficult surfaces. Better yet, it blocks stains from occurring and keeps old stains from being visible.",
    "And since DIY paint jobs shouldn’t be limited to one or two seasons out of the year, you’ll be happy to know that you can use this paint and primer in temperatures as low as 35 degrees and as high as ninety.",
    "Grab the Everlast paint and primer from Lowe’s, get your DIY projects done in a weekend, and sit back and watch this high-quality paint hold up for years to come.",
    "We wanted to see if the hype surrounding the HGTV Home® by Sherwin-Williams Everlast™ Exterior Paint and Primer was true. After pre-ordering brushes and the paint on Lowes.com, it was ready for pick up two hours later from the store’s contactless lockers.",
    "The DIY projects for the weekend were two-fold. The first: paint an old black side table white. It would find a new home outdoors under the shade of a tree in the front yard between two chairs. The second and more important project: apply a new coat on the top trim of a wraparound porch baluster. The previous owners of the home had painted it white about a year and a half earlier, but it was already showing some wear, cracking, and yellowish stains.",
    "After preparing the baluster trim and then opening the paint and primer, mixing it up, and pouring it into the tray, we took a roller and painted the top flat trim. A brush was used to paint the trim along the edges of the flat board. It only took one coat of the Everlast exterior paint and primer to cover the old paint and cracked spots. In 30 minutes, the paint had dried. We poured water on the trim and it swiftly rolled off.",
    "The black side table took two coats to fully cover. The previous paint was chalky, but the Everlast paint and primer gripped to it, and in no time, the old black paint was not to be seen. It took about an hour to dry on a day where the temperature was 60 degrees fahrenheit. Like the baluster trim, the side table held up against a water test – and didn’t stain when droplets of an evening chamomile tea spilled on its newly-painted surface.",
    "We didn’t use the full gallon of the Everlast paint and primer, but we’re keeping it close by and our eye out for other outdoor DIY projects that could use a weather and waterproof coat of the most technologically innovative paint and primer on the market."
  ],
  "headers": {
    "3": "The Paint of the Future",
    "9": "Taking the paint for a spin"
  },
  "links": {
    "Lowe’s List for Innovation badge": "https://ad.doubleclick.net/ddm/trackclk/N481402.129694FUTUREUSINC/B25827033.302438583;dc_trk_aid=495497339;dc_trk_cid=150403736;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;gdpr=%24%7BGDPR%7D;gdpr_consent=%24%7BGDPR_CONSENT_755%7D;ltd=",
    "HGTV Home® by Sherwin-Williams Everlast™ Exterior Paint and Primer": "https://ad.doubleclick.net/ddm/trackclk/N481402.129694FUTUREUSINC/B25827033.302438583;dc_trk_aid=495497339;dc_trk_cid=150428632;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;gdpr=%24%7BGDPR%7D;gdpr_consent=%24%7BGDPR_CONSENT_755%7D;ltd="
  }
}