{
  "source": "https://www.techradar.com/news/ransomware-hackers-now-bigger-threat-than-nation-state-actors",
  "title": "Ransomware hackers now 'bigger threat' than nation state actors",
  "category": "computing",
  "updated": "2021-06-14T09:25:22Z",
  "author": "mayank-sharma",
  "summary": "Cybercriminals are getting more professional, warns GCHQ head",
  "article": [
    "Ransomware now represents the largest threat to online security for the UK, the head of GCHQ’s cybersecurity arm has warned.",
    "Lindy Cameron, chief executive of the National Cyber Security Centre, has said that ransomware incidents against individuals and businesses around the world are escalating and becoming more professional in their approach.",
    "Speaking to London’s Royal United Services Institute, Cameron said that while online spying from hostile nations remains a “malicious strategic threat”, it is the rising threat of ransomware attacks that must be addressed with utmost urgency.",
    "“For the vast majority of UK citizens and businesses, and indeed for the vast majority of critical national infrastructure providers and government service providers, the primary key threat is not state actors but cybercriminals,” Cameron said, according to the Guardian.",
    "Cameron’s assessment of the increasing professionalism of ransomware operators is in line with a recent study by cybersecurity vendor Trend Micro, which concluded that the cybercriminals are specifically going after billion dollar corporations, who can ill afford to suffer any down time.",
    "This has been witnessed in the recent attacks on the US’ Colonial Pipeline and major meat processing company JBS. Both of the victims were quick to pay the ransom to wrest back control of their network and data, which also helped highlight the risk of such attacks on critical infrastructure and supply chains.",
    "Quoting figures from SonicWall, Financial Times reports that the number of ransomware incidents rose by more than 60 percent to a total of 305 million in 2020.",
    "Many of the ransomware gangs are thought to operate out of Russia and other former Soviet states, which experts suggest turn a blind eye to their activities as long as they don’t target victims within their borders.",
    "While Cameron did not name Russia in her speech, she did say that the cybercriminals, “don’t exist in a vacuum. They are often enabled and facilitated by states acting with impunity.”"
  ],
  "headers": {
    "4": "Growing threat"
  },
  "links": {
    "Ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "Guardian": "https://www.theguardian.com/technology/2021/jun/14/ransomware-is-biggest-online-threat-to-people-in-uk-spy-agency-chief-to-warn",
    "recent study": "https://www.techradar.com/news/ransomware-is-now-going-after-billion-dollar-targets",
    "Trend Micro": "https://www.techradar.com/reviews/trend-micro-2020-antivirus-solutions",
    "Colonial Pipeline": "https://www.techradar.com/news/colonial-pipeline-paid-dollar5m-ransom-to-hackers",
    "JBS": "https://www.techradar.com/news/jbs-paid-dollar11-million-bitcoin-ransom-to-restore-systems-avoid-further-attacks",
    "Financial Times": "https://www.ft.com/content/aa03cbf6-0750-4bce-8c50-ccf87f3fcd18",
    "Russia and other former Soviet states": "https://www.techradar.com/news/this-weird-hack-might-help-keep-your-pc-safe-from-russian-hackers"
  }
}