{
  "source": "https://www.techradar.com/news/blink-vs-ring-what-are-the-differences-between-amazons-cams",
  "title": "Blink vs Ring: How do Amazon’s home security cameras differ?",
  "category": "smart-home",
  "updated": "2021-12-01T17:44:42Z",
  "author": "simon-hill",
  "summary": "Should you choose Blink or Ring to keep an eye on your home?",
  "article": [
    "Protecting your home with a network of security devices, which let you check your property is safe and sound even when you’re not around, is easier and more affordable than ever before. Previously you would have needed a full-on CCTV system professionally fitted, which comes with a hefty price tag and not to mention the wires trailing all-around your home to connect the cameras to a computer where the footage was stored.",
    "However, now you can choose from some of the best home security cameras on the market, which usually require very little installation and are more affordable than CCTV. They store video clips either online or locally, which thanks to a Wi-Fi connection can be viewed from your smartphone at any time of day or night.",
    "If you're looking to set up your own home security camera system, you'll have probably come across the Blink and Ring ranges before. Both of these brands are owned by Amazon, but just how do they compare when it comes to price and capabilities? It's likely that one system will suit you better than the other, so we’ve tested a range of devices from both brands to give you the low-down.",
    "Read on to discover how these two home security camera systems compare – or, if you’ve already decided which of the two you wish to buy, check out the best prices right now for home security cameras and video doorbells:",
    "Blink has a much smaller offering than Ring when it comes to home security cameras. It’s also worth noting that while Ring’s cameras and video doorbells are available worldwide, Blink products are currently only on sale in the US and UK.",
    "The Blink Mini is the brand’s entry-level home security camera. This compact device is mains-powered so can only be used inside and is priced at $34.99 / £34.99. If you’re looking for a battery-powered camera that offers more flexibility about where it can be placed, then the Blink Indoor is worth considering. Not quite as compact as the Blink Indoor, but considerably smaller than most of Ring's offerings, it has the same square-shaped monochrome design and will set you back $79.99 / £79.99. However, it's a battery-operated camera, rather than mains-powered, and uses two AA batteries that Blink claims will last for up to two years before they need changing.",
    "Blink’s third and final home security camera is a weatherproof version of the Blink Indoor, which is unsurprisingly called the Blink Outdoor. This home security camera features a glossy black design and costs $99.99 / £99.99. However, unlike Ring, the brand doesn’t offer any video doorbells.",
    "Ring is most well-known for producing some of the best video doorbells, so its range of doorbells is understandably wider than its line of home security cameras.",
    "However, In terms of security cameras; Ring offers the entry-level Indoor Cam, which is mains-powered and costs $59.99 / £49 / AU$99, while you can pick up an outdoor camera, the Ring Stick-Up Cam, which comes in battery- or mains-powered versions for $99.99 / £89 / AU$179.",
    "Ring Spotlight Cam is another outdoor security camera that comes in both battery- and mains-powered variants. It features a spotlight that illuminates when motion is detected and is priced at $199.99 / £179.99 / AU$289.99, while the Ring Floodlight Cam Pro has two 1,000 lumen floodlights (the average ceiling light is around 800 lumens) instead of a single spotlight and will set you back $249.99 / £219 / AU$379. It is a mains-powered camera, however.",
    "All of Ring's battery-powered security cameras last between three and six months before they need recharging, although this will depend upon how often motion is detected, how many times the camera's feed is viewed in real-time, and for those with lights, how frequently the LEDs are illuminated. The batteries are swappable too, so providing you purchase additional batteries, the cameras won't be out of action when the batteries need replacing.",
    "Ring offers five video doorbells in total ranging from its most affordable option; the Ring Video Doorbell Wired, which is priced at $59.99 / £49 / AU$119, through to the battery-powered Ring Video Doorbell 4 for $199.99 / £179 / AU$329 and the top-of-the-range Ring Video Doorbell Pro 2, which will set you back $249.99 / £219 / AU$399.99.",
    "Something else Ring offers that Blink doesn’t is a smart alarm system that includes door/window sensors, motion-detection PIRs, and even an optional outdoor siren and an assisted monitoring that will automatically call three emergency contacts if the alarm is triggered. This costs $199.99 / £219 but isn’t available in Australia.",
    "PS: Checkout our list of the best DVR for CCTV",
    "When it comes to storing video so it can be reviewed after it’s been captured, Blink is the more cost-effective option as it offers the ability to store footage locally, so there’s no on-going cost to use the security cameras.",
    "To do this, you’ll need the Blink Sync module 2, which comes bundled with the Blink Indoor and Blink Outdoor. Unfortunately, it’s not included with the Blink Mini, but it is available to purchase on its own for $34.99 / £34.99. You’ll also need a 256 GB USB flash drive, which you can pick up for around $25 / £25, if you don’t have a spare knocking around.",
    "Using this method means you won’t have a record of any occasions that live view (when the camera’s feed is viewed through the app in real-time) was activated and the clips may take longer to play as they need to be uploaded to Blink’s servers first.",
    "To combat this, the Blink Subscription Plan, which is priced at $3 / £2.50 per month for a single camera, and $10 / £8 for unlimited cameras, is also available. All Blink devices come with a free trial of the service.",
    "Ring, however, doesn’t have an option for local storage. Instead, you’ll need to subscribe to Ring Protect, which costs from $3 / £2.50 /AU$4 per month for one camera or $10 / £8 / AU$15 for an unlimited number of cameras - both of which ensure video clips are saved for 30 days after they’ve been recorded. Most new Ring devices come with a 30-day free trial of Ring Protect.",
    "Blink and Ring’s security cameras are generally evenly matched when it comes to video and audio quality.",
    "We’ve reviewed the majority of the products offered by both brands, and in our tests the video has always been clear and detailed, while the audio has always been extremely coherent.",
    "All of Blink and Ring’s cameras record Full HD footage when motion is detected, which is in color during the day. Some Ring home security cameras - namely those with built-in lights - are also able to record color video at night, providing the light has been set to illuminate when motion is detected. Unfortunately, this isn’t available on any of Blink’s offerings.",
    "There’s a couple of other areas where Ring’s cameras trump Blink’s devices. The first being the field of view - all of Blink’s cameras have a narrow 110-degree field of view, whereas while Ring’s indoor cameras have a similar field of view, the outdoor cameras offer a wider 140-degree field of view. This means a wider area is covered by the cameras, ensuring you don’t suffer from blind spots.",
    "Secondly, Ring’s cameras have a People Only mode, designed to reduce unwanted alerts by only notifying you when the motion it detects is caused by a person. This isn’t something Blink’s security cameras can do.",
    "Both the Ring and Blink apps are easy-to-use and offer a way to view the camera’s feed in real-time, while also review previously captured footage, in Ring’s case providing you have subscribed to Ring Protect.",
    "Both platforms also provide rich notifications with a snapshot of an activity detected to your smartphone too - so you can quickly see if it’s an alert you need to worry about or not.",
    "The two brands are owned by Amazon so it’s no surprise they offer Alexa integration. Alexa-enabled smart speakers can be set to play a sound when either of the camera’s detect motion or used to converse with anyone in the camera’s field of view, while if you have one of Amazon’s smart displays, such as the Amazon Echo Show 5, in your home - the feed from both cameras can be viewed on the device’s screen. However, unsurprisingly, there’s no support for Google Assistant or HomeKit.",
    "Both Blink and Ring have proved to be effective and easy-to-use home security camera systems during our testing. Blink is more affordable and offers more compact devices, and the addition of local storage will be music to the ears of anyone looking for a security camera without on-going costs.",
    "Meanwhile, Ring’s cameras have features that can distinguish people from other sources of motion, reducing the number of unwanted alerts you receive, while some also have built-in LEDs that ensure footage recorded at night is in color, too. They’re more expensive and bulkier than Blink’s offerings, and they do rely on a cloud-based storage service if you want to review videos in the app, which means there’s an on-going cost.",
    "If you already use a Ring Video Doorbell, it makes sense to expand your security system with Ring cameras, but for those starting their home security journey or on a tight budget, Blink might be a better option."
  ],
  "headers": {
    "3": "Best Blink and Ring deals",
    "4": "Range and price",
    "14": "Subscription costs",
    "19": "Video and audio",
    "24": "App and smart integrations",
    "27": "Verdict"
  },
  "links": {
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Blink Mini": "https://www.techradar.com/reviews/blink-mini",
    "Blink Indoor": "https://www.techradar.com/reviews/blink-indoor",
    "Blink Outdoor": "https://www.techradar.com/reviews/blink-outdoor",
    "Indoor Cam": "https://www.techradar.com/reviews/ring-indoor-cam-review",
    "Ring Stick-Up Cam": "https://www.techradar.com/reviews/ring-stick-up-cam",
    "Ring Spotlight Cam": "https://www.techradar.com/reviews/ring-spotlight-cam",
    "Ring Video Doorbell Wired": "https://www.techradar.com/reviews/ring-video-doorbell-wired-review",
    "Ring Video Doorbell 4": "https://www.techradar.com/news/ring-video-doorbell-4",
    "Ring Video Doorbell Pro 2": "https://www.techradar.com/reviews/ring-video-doorbell-pro-2-review",
    "PS: Checkout our list of the best DVR for CCTV": "https://www.techradar.com/best/best-dvr-for-cctv",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "smart displays": "https://www.techradar.com/best/best-smart-displays",
    "Amazon Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5"
  }
}