{
  "source": "https://www.techradar.com/news/nvidia-will-let-you-rent-its-mini-supercomputers",
  "title": "Nvidia will let you rent its mini supercomputers",
  "category": "computing",
  "updated": "2021-04-13T13:01:11Z",
  "author": "mayank-sharma",
  "summary": "Subscription-based rental scheme is part of Nvidia’s plans to “democratize AI”",
  "article": [
    "Since not everyone can afford the DGX Station A100 supercomputer, Nvidia will instead now rent one for a low monthly price.",
    "The DGX Workstation A100 is the desk-bound workstation version of Nvidia’s A100 supercomputer. Announced in November 2020, it is already being used by major customers including BMW, Lockheed Martin, and Japan’s mobile operator NTT Docomo.",
    "While you can plug the DGX Station A100 into a regular power socket, its sticker price of $149,000 puts its impressive ability to take on all sorts of Artificial Intelligence (AI) workloads out of reach of many businesses - which the new rental scheme is designed to overcome.",
    "“You can think of us progressing in two directions, one with constant innovation to raise the bar. But the other is to really democratize AI to put it in the hands of as many companies and scientists as we possibly can,” said Manuvir Das, head of enterprise computing at Nvidia.",
    "The A100 GPU accelerator debuted in May 2020 as the first Ampere GPU and is built using TSMC’s 7nm process. It’s made up of 54 billion transistors that serves up 6912 CUDA cores and packs 40GB of VRAM. The A100 GPUs were first packed inside five petaflop oozing supercomputers.",
    "A few months down the line, Nvidia announced a relatively more portable version of the supercomputer, the DGX Station A100 that’s equipped with four of the A100 GPU along with 512GB of system memory, a 7.68TB U.2 NVMe SSD, and a single 64-core AMD EPYC 7742 CPU.",
    "Nvidia hopes that with the subscription program, businesses and labs of all sizes will now be able to utilize the compute of their impressive workstation form factor supercomputer, though it hasn’t yet shared any pricing details.",
    "Via: VentureBeat"
  ],
  "headers": {
    "4": "Supercomputers for all"
  },
  "links": {
    "DGX Station A100": "https://www.techradar.com/news/nvidia-launches-its-first-workstation-with-amd-inside",
    "Nvidia": "https://www.techradar.com/news/nvidia-geforce",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "Nvidia’s A100 supercomputer": "https://www.techradar.com/news/nvidia-reveals-most-powerful-ai-system-ever",
    "GPU": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "system memory": "https://www.techradar.com/news/best-ram",
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "VentureBeat": "https://venturebeat.com/2021/04/12/nvidia-unveils-rental-model-for-dgx-superpod-mini-supercomputers/"
  }
}