{
  "source": "https://www.techradar.com/news/how-future-android-updates-for-samsung-phones-will-work",
  "title": "How future Android updates for Samsung phones will work",
  "category": "phones",
  "updated": "2021-04-13T15:12:33Z",
  "author": "axel-metz",
  "summary": "Forget planned obsolescence",
  "article": [
    "Samsung has announced it plans to offer four years of software support to most of its Galaxy phones and tablets, in an unprecedented move for the company’s Android-powered devices.",
    "Typically, Samsung’s Galaxy range receives two years worth of Android OS upgrades with security updates being provided for three years – but the manufacturer has committed to increasing both the pace and frequency with which it distributes updates.",
    "Now, it’s Galaxy devices will receive up to three major OS updates alongside four years worth of security patches, suggesting those who decide to buy products like the Samsung Galaxy S21 will be covered, in software terms, until at least 2025.",
    "The news doesn’t just apply to Samsung’s newest phones and tablets, either. While its latest devices will receive monthly patches, its mid-range phones will get quarterly updates for the foreseeable future. That means devices like the Samsung Galaxy A51 will still receive continued software maintenance, even if not as frequently as newer Galaxy models.",
    "It’s unclear how far back the promise goes, but it seems as though any device released prior to 2019 won’t benefit from the new pledge. The company’s official security update page has been updated to clarify that devices in their fourth year of life would only receive security patches biannually, meaning they’d get no more than two security patches in a year. T",
    "hat suggests devices which launched in back 2017 – like the Galaxy J5, Galaxy J7, Galaxy Tab A and others – are coming to the end of their maintenance period.",
    "In a refreshing move away from the planned obsolescence we’ve come to expect from premium smartphone manufacturers, it looks as though Samsung has turned its attention to encouraging consumers to stick with its devices, rather than upgrading as frequently as they might have.",
    "By extending software support, there’s one less reason to trade in your old Galaxy device for a new one – which in turn makes those coming to the Samsung Galaxy product line for the first time more inclined to make a purchase. In that way, then, this looks a shrewd business decision from Samsung as well as a positive move towards more sustainable consumption.",
    "Via SamMobile"
  ],
  "headers": {
    "6": "Planned permanence"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy A51": "https://www.techradar.com/reviews/samsung-galaxy-a51-review",
    "company’s official security update page": "https://security.samsungmobile.com/workScope.smsb",
    "Galaxy Tab A": "https://www.techradar.com/news/samsung-galaxy-tab-a-deals",
    "SamMobile": "https://www.sammobile.com/news/samsung-galaxy-4-year-software-update-policy-explains/"
  }
}