{
  "source": "https://www.techradar.com/news/google-explains-how-the-new-google-photos-locked-folder-works",
  "title": "Google Photos locked folder rolls out to Pixel phones – here's how it works",
  "category": "cameras",
  "updated": "2021-06-08T12:05:11Z",
  "author": "mark-wilson",
  "summary": "It's exclusive to Pixel phones, for now",
  "article": [
    "A few weeks ago Google announced a handy new 'Locked Folder' feature for Google Photos – and now it's explained a little more about how it's going to work, as it starts to roll out on Pixel phones.",
    "The 'Locked Folder' feature lets you save snaps into a passcode-protected space, where they can rest safe from the prying eyes of anyone who's flicking through your Google Photos feed.",
    "To start with, the feature will be exclusive to Google Pixel phones, but Google has said it will be coming to \"more Android devices throughout the year\". So how easy will it be to add snaps to the Locked Folder?",
    "The gif below shows it in action for the first time. Slightly counterintuitively, you'll need to choose to save a photo to the Locked Folder before you've taken it – to do this, you can just tap the 'folder' icon in the top right-hand corner of Android's Camera app, then choose 'Locked Folder'.",
    "Once you've taken the photo, you can then preview it in order to apply any edits, move it or delete it. But once you've pre-selected its location, it'll automatically get stashed away in Google Photos' private folder.",
    "How do you then look at it alongside all the other photos in your Locked Folder? Just tap the 'Gallery' icon in the top right-hand corner, then go to 'Library', followed by 'Utilities'. In here, you'll find the new 'Locked Folder' option – once you've hit that, just enter your phone's passcode and you can see the rest of your private snaps.",
    "While we're not sure what the dog above has done to deserve being stashed in the Locked Folder, it certainly looks like a handy new feature – albeit one with some limitations.",
    "As Google confirmed in its new post on the feature, all Locked Folder photos are saved locally on your phone and aren't backed up. On the plus side, this means it's not possible for them to show up in Google Photos Memories, shared albums, or any other apps.",
    "But unfortunately for those who were hoping for a cloud-based private folder for Google Photos, those photos won't be backed up anywhere – so if anything happens to your phone, you may well lose them.",
    "Also, if you move existing photos or videos to the Locked Folder, Google says that \"cloud backups of these items will be deleted\". This makes sense from a privacy perspective, as cloud backups always have an element of vulnerability, but it's worth bearing in mind if you're hoping to keep those private snaps secure.",
    "On the flip side, moving specific snaps to the Locked Folder will only affect that particular file – so if you've made any copies of it previously, you'll need to make sure there aren't any other versions of it lurking in your Google Photos library that could spoil that engagement ring surprise."
  ],
  "headers": {
    "6": "Locked and loaded"
  },
  "links": {
    "Locked Folder": "https://www.techradar.com/news/google-photos-locked-folder-what-is-it-and-how-do-you-use-it",
    "Google Photos": "https://www.techradar.com/reviews/google-photos"
  }
}