{
  "source": "https://www.techradar.com/news/ps5-in-stock-august-2021",
  "title": "Analysis: PS5 is going to be much harder to find in stock soon – here's why",
  "category": "gaming",
  "updated": "2021-08-30T01:59:18Z",
  "author": "matt-swider",
  "summary": "There's an 'October deadline' to buy the PlayStation 5 console, as our analysis shows that demand will skyrocket at the end of 2021.",
  "article": [
    "A PS5 restock is going to be nearly impossible to find soon, according to our long-held expert analysis, even though today, in the second half of 2021, the PlayStation 5 console is easier (read: not easy) to buy. We also predicted this dip in PS5 demand that would offer a false sense of security, but now we're seeing that millions of consumers around the world are still trying to buy the Sony console and there's an 'October deadline' looming.",
    "The solution? Our 24/7 PS5 restock tracker Twitter Matt Swider will send you in-stock PS5 alerts – if you follow his Twitter account and turn on notifications. The alerts have helped 63,000 people find a next-gen console since mid-February 2021.",
    "It'll get much harder soon, according to our latest projections that show an increase in PS5 demand come October. People are putting off buying the Sony console, thinking it'll be easier to get soon, or appear on store shelves in 2021. On the contrary. Even if Sony were to ramp up the supply of PS5 Disc and PS5 Digital consoles, demand will skyrocket right before Black Friday and Cyber Monday.",
    "► When will PS5 restock? Follow our PS5 restock tracker Matt Swider and turn on notifications for PS5 restock alerts. It's the fastest way to get updates.",
    "► Warning: don't buy from other Twitter users. They're all scams. Only buy from the US stores Matt alerts you about. No one will sell a PS5 for just $550.",
    "► Why trust TechRadar? We don't point you to a bunch of US retailer links, which are always dead ends. Others do that – not us. Matt Swider will send you a push notification when there's actual PS5 stock through his 24/7 tracking efforts.",
    "Directions: Click on this image of an example of this Best Buy PS5 restock alert from Matt Swider and turn on notifications (that little bell icon) for instant alerts.",
    "Not to sound ominous, but you have until October 2021 to find a PS5 restock, which is when we predict PlayStation 5 demand will soar worldwide, despite PS5 console sales reaching 10 million, according to Sony.",
    "Millions of parents will want to buy their children a PS5 in the weeks leading up to the Christmas holiday, and they haven't been added to the pool of consumers who are actively looking to buy a PS5 console. That's a scary thought.",
    "That's why you have just two months until the ramp-up to holiday shopping kicks off at most retailers. The little Timmy's of the world haven't asked for the PS5 yet, or even if they have, many parents haven't gone searching for the console. As soon as that switch is flipped, we are going to see PS5 demand skyrocket beyond what Sony can supply, and analysts we talked to agree.",
    "\"I honestly don't see this shortage getting better until next year,\" Anshel Sag, Senior Analyst at Moor Insights & Strategy, told TechRadar. He noted that Sony isn't the only manufacturer in the hunt for PC components to make its PS5 consoles.",
    "\"With Qualcomm and Apple taking up vast swaths of 5nm, there isn't very much capacity left for vast jumps in demand even with process node optimizations, said Sag. \"There still appears to be a lot of pent-up demand in the PC gaming segment which is still red hot and suffering from the worst GPU shortage I think I've ever seen in my 15-plus-year career.\"",
    "This is the question that keeps coming our way, and the truth is that we're unlikely to see major retailers stock the PS5 in stores in 2021. There are two reasons to keep the Sony console off of store shelves, and both have to do with consumer safety.",
    "First, American retailers have told TechRadar that they don't want crowds rushing to their stores, only to be frustrated and milling about with no intention of buying any other product except a non-existent PS5. That's a strain on customer service and a social distancing hazard.",
    "Second, consumers willing to do anything to grab ahold of the PS5 present security concerns. We saw this first hand when Best Buy tried to sell RTX graphics cards in stores. Fights nearly broke out and yelling by both line-jumping consumers and Best Buy employees went on for nearly an hour.",
    "We wouldn't put it past some retailers to tease PS5 stock to lure consumers to brick-and-mortar locations for other deals come Black Friday (at a point when there are other tempting deals to sway people who can't get a PlayStation 5). But, for now, online PS5 purchases and distribution methods remain much safer, according to PS5-carrying retailers we spoke to recently.",
    "PS5 demand is dipping ever-so-slightly worldwide, and more people have been able to check out of online stores in the US and UK, according to our analysis. One of the secret reasons is that some – not all – stores are becoming better at reigning in resellers and bots.",
    "We'll continue to offer expert advice on how to buy the PS5 between now and the end of 2021, but we're giving everyone fair warning: between now and the start of October is your best chance to purchase the Sony console.",
    "In two months' time, it's going to become much harder when parents wake up to the fact that they need this console to fulfill their child's Christmas wish list. It's at that point PS5 will become Jingle All the Way's Turbo Man and you may be duking it out with a crazed Arnold Schwarzenegger-like parent during the holiday rush."
  ],
  "headers": {
    "7": "Why there's an 'October deadline' to find PS5 in stock",
    "12": "When will PS5 restock in stores in 2021?",
    "16": "How to buy the PS5 in the next two months"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock tracker Twitter Matt Swider": "https://twitter.com/mattswider",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Follow our PS5 restock tracker Matt Swider": "https://www.twitter.com/mattswider",
    "Best Buy PS5": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 console sales": "https://www.techradar.com/news/sony-sold-10-million-ps5-consoles-analysis",
    "buy a PS5": "https://www.techradar.com/news/where-to-buy-ps5"
  }
}