{
  "source": "https://www.techradar.com/news/these-are-the-most-anticipated-games-of-e3-2021-according-to-yougov",
  "title": "These are the most anticipated games of E3 2021, according to YouGov",
  "category": "gaming",
  "updated": "2021-06-11T12:32:58Z",
  "author": "adam-vjestica",
  "summary": "The votes are in",
  "article": [
    "What are the most anticipated games of E3 2021? TechRadar teamed up with YouGov to ask 1,000 US adults exactly that, and the results might surprise you.",
    "The most anticipated game of E3 2021 is The Legend of Zelda: Breath of the Wild 2 on Nintendo Switch, which garnered 17% of the vote. Out of the 498 respondents who play games on consoles or PC, Breath of the Wild 2 was a clear favorite, with 32% choosing Link’s next adventure as their number one pick.",
    "It’s unclear when Breath of the Wild 2 will be released, or whether it will launch alongside Nintendo’s widely-rumored Nintendo Switch Pro, but we’re hoping to find out more about the sequel to Breath of the Wild on June 15 when Nintendo hosts it’s E3 Direct presentation.",
    "In a close second with 12% of the vote is God of Ragnarok, a PS5 and PS4 exclusive that’s set to arrive sometime in 2022. God of War (2018) on PS4 remains one of the most beloved games of the generation, so it’s easy to see why the return of Kratos would excite fans.",
    "Two first-person shooters take up the third spot, with 11% of all US adults choosing Battlefield 2042 and Halo Infinite as their picks for the most anticipated games of E3. When it comes to those who own a console or PC, though, Battlefield 2042 edged out Halo Infinite with 20% of the vote as opposed to 18%. Battlefield 2042 will feature 128 players for the first time on PS5, Xbox Series X and PC, while Halo Infinite promises free-to-play multiplayer with 120fps support.",
    "Surprisingly, FromSoftware’s next title, Elden Ring, didn’t fare too well with voters. Even though it was arguably the biggest reveal from the Summer Game Fest Kickoff Live show, the open-world Soulsborne game finished dead last, with only 4% of all US adults choosing Elden Ring. You can view the full survey results below.",
    "E3 2021 begins on June 12 and we should get more information about most of the games included in this survey, including Far Cry 6, Starfield and Dying Light 2. You can keep up with all the announcements on TechRadar, so stay tuned for more E3 coverage.",
    "What games are you looking forward to most at E3? Let us know on Twitter. The data is from YouGov Direct and based on the interviews of 1,000 US adults including 498 US adults who say they play console games, PC games, or both. The survey was fielded online on June 10, 2021 between 2:49pm and 6:14pm EST. Results are weighted according to age, gender, region, political affiliation, and race. The margin of error on the full sample is 4.2%."
  ],
  "headers": {},
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "YouGov": "https://yougov.co.uk/",
    "The Legend of Zelda: Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "God of Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "120fps support": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support",
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "Summer Game Fest Kickoff Live show": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors",
    "Twitter": "https://twitter.com/TechRadarGaming"
  }
}