{
  "source": "https://www.techradar.com/news/whatsapp-starts-to-roll-out-new-features-and-notifications",
  "title": "WhatsApp starts to roll out new features and notifications",
  "category": "computing",
  "updated": "2021-07-12T10:11:16Z",
  "author": "sofia-wycislik-wilson",
  "summary": "New notifications for iOS users are on the way",
  "article": [
    "WhatsApp are working on even more features for its users, with archiving and new view options for media now available for even more users before they're fully rolled out.",
    "As we keep a constant eye on the beta versions of many major apps, we get to see many new features and options before they hit the mainstream. Sometimes previews come well ahead of a wider release and it can be difficult to keep track of everything that's in the pipeline.",
    "But when it comes to the View Once feature and the New Archive option that we've been looking at recently, the time is now. WhatsApp has started the process of rolling these new tools and elements to more users, and while there is no guarantee that you'll see things immediately, you certainly should do soon.",
    "The View Once feature is a disappearing message option that's specific to images and video. If you are sharing sensitive media files, you can opt to have them be automatically deleted after the recipient has seen them. This is not, as WABetaInfo points out, completely reliable as there is nothing to stop a recipient from screen grabbing an image – so keep this in mind.",
    "The second new option changes the way archived chats work. With the new implementation that is rolling out, any chats you archive will remain archive – and quiet – even new messages are received to that chat. In order to see notification and new messages, you will need to manually check the archive.",
    "The latest beta of WhatsApp for iOS also includes a new style of notification that is sure to be well-received.",
    "The redesigned in-app notifications can be seen in version 2.21.140.9 of the app, and it brings additional details to the notification banner. With the new look, it is not only possible to view attached images and videos, but also peek at messages without sending a read receipt.",
    "It is possible to expand the notification and then scroll up and down through that chat, but the read receipt will not be sent until the chat is viewed within the app itself.",
    "As previous features for WhatsApp have gone, it wouldn't be much of a stretch to expect these to be available in the coming weeks, now that they're in heavy testing with a larger pool of users. Both of the above features are also rolling out to users on both Android and iOS, but iOS users have something extra with new notifications to look forward to soon.",
    "Via WABetaInfo"
  ],
  "headers": {
    "5": "When will these be available?"
  },
  "links": {
    "WABetaInfo points out": "https://wabetainfo.com/whatsapp-web-2-2126-11-whats-new/",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-finally-redesigns-in-app-notifications-on-ios/"
  }
}