{
  "source": "https://www.techradar.com/news/the-apple-m1-chip-can-now-mine-ethereum-but-is-it-worth-it",
  "title": "The Apple M1 chip can now mine Ethereum – but is it worth it?",
  "category": "computing",
  "updated": "2021-03-01T19:27:54Z",
  "author": "john-loeffler",
  "summary": "Are miners coming for the new MacBooks?",
  "article": [
    "A software engineer just figured out how to harness the GPU in the Apple M1 chip to mine the cryptocurrency ethereum, though whether it’s worth the effort is an open question.",
    "Yifan Gu, a software engineer with Zensors, wrote on their blog: “I’ve had my M1 MacBook Air for a bit of time now, and I also recently started mining Ethereum. I can’t help asking myself: What’s Ethereum mining performance like on a M1 Mac?”",
    "They explain the process they took to get the Ethminer software used to mine Ether working on an Apple M1 chip, since it takes some work to port the software to Apple silicon.",
    "The challenge starts with getting Ethminer to recognize the M1 chip’s GPU, and only gets more complicated from there. You’ll need some C/C++ coding skills if you want to follow along with Gu’s process, but it isn’t all that complicated if you know what you’re doing. In the end, Gu was able to get it working, but as TechPowerUp points out, it’s not exactly the most effective mining GPU out there.",
    "Cryptomining has taken off recently thanks to the soaring price of ethereum, helping to exacerbate the supply issues around Nvidia’s RTX 3060 Ti, RTX 3070, RTX 3080, and RTX 3090 graphics cards – so much so that Nvidia itself is taking steps to combat it by making them less efficient to mine cryptocurrency.",
    "It’s understandable that some might be concerned about an M1 chip being used to mine the trendy cryptocurrency, but in this case, the relatively underpowered GPU in the M1 makes it a poor candidate for cryptominers.",
    "With a hashrate of 2 MH/s, the M1’s profit per day is only about $0.14. At that rate, it’d take just under 20 years to break even at current prices."
  ],
  "headers": {
    "4": "MacBooks aren’t going to be the next RTX cards, don’t worry"
  },
  "links": {
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "their blog": "https://blog.yifangu.com/2021/02/26/mining-ethereum-on-a-m1-mac-gpu/",
    "TechPowerUp": "https://www.techpowerup.com/279142/apple-m1-processor-manages-to-mine-ethereum",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "taking steps to combat it": "https://www.techradar.com/news/how-nvidia-is-tackling-cryptomining-so-more-gamers-can-get-rtx-cards",
    "poor candidate": "https://www.techradar.com/news/how-cryptomining-is-making-it-harder-to-find-the-graphics-cards-you-want"
  }
}