{
  "source": "https://www.techradar.com/news/iphone-13-followed-by-iphone-se-5g",
  "title": "After iPhone 13, Apple could launch a new iPhone SE with 5G",
  "category": "phones",
  "updated": "2021-04-02T00:07:00Z",
  "author": "david-lumb",
  "summary": "Yes, it’s poised to keep the aging iPhone 6-era display.",
  "article": [
    "After the rumored early 2021 launch window came and went for the iPhone SE 3, a new report suggests it could land in 2022 – and add sub-6 5G support.",
    "The bad news: the third-generation iPhone SE could pack the same 4.7-inch LCD screen as the iPhone SE 2020 that Apple first used in the iPhone 6 in 2014, according to a tweet by display analyst and founder of DisplaySearch Ross Young:",
    "That last line does offer a ray of hope for mid-range iPhone fans: another version (and potentially fourth generation) iPhone SE could come in 2023 with a 6.1-inch display packing a punch-hole instead of the notch that remains on higher-end iPhones.",
    "That size is important: the 6.1-inch screen format debuted in the iPhone XR in 2018 and was inherited by successor iPhone 11, though those were LCD displays. On the other hand, the iPhone 12 and iPhone 12 Pro have 6.1-inch screens, and both are OLED, establishing a new middleground flagship screen spec.",
    "That suggests the iPhone SE 4 (or whatever model comes in 2023) could pack the same 6.1-inch OLED display – we know Apple is bullish about keeping the same display tech around, so it would be strange if the company made an LCD version and OLED version of the same-size screen. Finally, the lowest-spec iPhone could leave LCD behind.",
    "Perhaps more interestingly, it would mean another iPhone is rumored to transition to a punch-hole. We’ve been hearing that flagship iPhones would introduce them for years, but even the iPhone 12 series stubbornly retains the notch. The iPhone SE 2023 could have an edge-to-edge display without the huge top and bottom bezel bars.",
    "Whether that means flagship phones will finally ditch the notch is another story. Face ID relies on a suite of sensors, and we wouldn’t expect Apple to ditch them wholesale when it’s invested so much in this security and financial authentication system. But by 2023, we could see Apple transition to different systems entirely… or just put an in-screen fingerprint sensor like the rest of the phones world.",
    "Via AppleInsider"
  ],
  "headers": {
    "3": "The fourth-generation iPhone SE 2023… goes OLED?"
  },
  "links": {
    "rumored": "https://www.techradar.com/news/why-iphone-se-3-is-very-unlikely-to-appear-at-apples-ipad-pro-2021-event",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "iPhone SE 2020": "https://www.techradar.com/reviews/iphone-se",
    "tweet": "https://twitter.com/DSCCRoss/status/1377677792402403328",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "AppleInsider": "https://appleinsider.com/articles/21/04/01/2022-iphone-se-has-47-inch-lcd-display-low-band-5g-says-analyst"
  }
}