{
  "source": "https://www.techradar.com/news/fake-online-amazon-reviews-can-reportedly-be-bought-in-bulk",
  "title": "Fake Amazon reviews can reportedly be bought in bulk online",
  "category": "computing",
  "updated": "2021-02-17T11:04:53Z",
  "author": "barclay-ballard",
  "summary": "Fake reviews are available from just £5 each",
  "article": [
    "Consumer choice brand Which? has discovered that fake Amazon reviews can be bought in bulk online in order to mislead shoppers. The discovery suggests that visitors to e-commerce websites should be on the lookout for anything that looks suspicious when checking customer feedback and recommendations.",
    "Which?'s report claims there are numerous websites selling fake reviews starting from £5 each or offering to place favorable reviews in exchange for free products. Although Amazon takes a dim view of misleading consumers in this way, it appears that the technology giant has a tough battle on its hand to wheedle out all the misleading reviews on its platform.",
    "Although products distributed by Amazon should be trustworthy, Amazon Marketplace allows other sellers to offer their goods through the Amazon website. Which? identified services offering to post fake reviews on Amazon Marketplace, despite this being an infringement of Amazon’s terms of service.",
    "It would appear that the use of fake reviews is relatively widespread, with Which? discovering five businesses that had more than 702,000 “product reviewers” working for them. These individuals typically receive small payments, discounted products, or offers to join loyalty schemes in exchange for placing positive reviews.",
    "In addition, it appears that many of these sites offering product reviews for sale are well aware of Amazon’s attempts to block their influence. For example, some of the sites provided advice on how to write reviews that would not arouse the suspicions of Amazon moderators.",
    "Although Amazon does regularly remove fraudulent reviews, the sheer number being posted makes it difficult to ensure that every review is legitimate. As well as giving greater powers to consumer regulators, a larger degree of customer skepticism may also be needed to thwart the growth of misleading online reviews.",
    "Via BBC"
  ],
  "headers": {
    "3": "Looks suspicious"
  },
  "links": {
    "Amazon": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "e-commerce websites": "https://www.techradar.com/best/best-e-commerce-website-design-services",
    "customer feedback": "https://www.techradar.com/best/best-customer-feedback-tools",
    "website": "https://www.techradar.com/news/the-best-website-builder",
    "payments": "https://www.techradar.com/best/best-credit-card-processing-service",
    "BBC": "https://www.bbc.co.uk/news/business-56069472"
  }
}