{
  "source": "https://www.techradar.com/news/apple-employees-threaten-to-leave-if-forced-back-to-the-office",
  "title": "Apple employees threaten to leave if forced back to the office",
  "category": "computing",
  "updated": "2021-07-05T21:00:53Z",
  "author": "anthony-spadafora",
  "summary": "Some employees don't want to give up working from home",
  "article": [
    "Being able to work from home indefinitely is quite important to Apple employees according to a new internal survey at the company which also revealed that some would consider leaving their positions if forced back to the office.",
    "As reported by The Verge, when the survey was sent out in June, almost 90 percent of the 1,749 respondents strongly agreed with the statement “location-flexible working options are a very important issue to me”.",
    "Unlike with previous surveys created by Apple's executives, this survey was sent out in a Slack channel so that employees could discuss remote work on their own. While its results show that some employees want to continue being able to work from home, only a fraction of the iPhone maker's 147,000-person workforce participated.",
    "When asked for their opinions on the statement “I am worried that some of my colleagues will have to leave Apple due to lack of location-flexible work options”, over half (58.5%) of survey respondents said they strongly agree while 36.7 percent said they are worried that they will have to resign due to the lack of flexibility.",
    "Once the survey was complete, Apple employees then sent the results to CEO Tim Cook and SVP of retail and people Deirdre O'Brien along with a video that included personal testimonies from 24 staff on why they believed remote working options are important to them.",
    "Like Microsoft though, Apple sees the future of work as truly hybrid and the company sent out a video on hybrid working to its employees two weeks after it had received the survey results. In its video, Apple stated that it believes “in-person collaboration is essential” to both its culture and future. This makes sense though as the company spent a total of $5bn to purchase the land and build its new Apple Park headquarters in Cupertino, California.",
    "While back in December of last year Apple said that its employees won't return to the office until this summer, the company has since updated its plans. Beginning in September of this year, employees will return to the company's offices three days a week on Mondays, Tuesdays and Thursdays though they will be allowed to work remotely on Wednesdays and Fridays.",
    "We'll have to wait and see if Apple gives into the demands of some of its employees or if it decides to go forward with introducing a hybrid working model.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Work from home or bust"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Apple": "https://www.techradar.com/news/the-new-apple-vpn-wont-be-available-in-china-other-restrictive-countries",
    "reported": "https://www.theverge.com/2021/7/2/22560586/apple-hybrid-work-internal-survey-tim-cook",
    "Slack": "https://www.techradar.com/news/slack-is-getting-a-major-overhaul-for-the-hybrid-working-future",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "future of work as truly hybrid": "https://www.techradar.com/news/microsoft-sees-the-future-of-work-as-truly-hybrid",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Apple Park": "https://www.techradar.com/news/apple-park-opens-in-april-new-hq-comes-complete-with-sweet-steve-jobs-homage",
    "won't return to the office until this summer": "https://www.techradar.com/news/apple-staff-wont-return-to-the-office-until-summer-2021",
    "The Verge": "https://www.theverge.com/2021/7/2/22560586/apple-hybrid-work-internal-survey-tim-cook"
  }
}