{
  "source": "https://www.techradar.com/news/windows-10-gets-a-fix-for-annoying-stuttering-in-some-games",
  "title": "Windows 10 gets a fix for annoying stuttering in some games",
  "category": "computing",
  "updated": "2021-02-28T10:06:31Z",
  "author": "darren-allan",
  "summary": "Patch KB4601382 is a preview update, though, with the usual caveats",
  "article": [
    "Windows 10 has received a preview version of a cumulative update, and it’s one that gamers might want to apply if they’ve been having any kind of trouble with stuttering or flickering (or indeed other rendering issues) when playing certain games.",
    "As Microsoft states, patch KB4601382 (for Windows 10 May 2020 Update and October 2020 Update) applies the following fix: “Updates an issue with screen rendering after opening games with certain hardware configurations.”",
    "As it’s in preview, you’ll have to manually find and install this bunch of fixes via Windows Update (this patch will be next month’s cumulative update when it lands on March 9 – but folks who are exasperated with the bugs that it cures may just want to grab it now to save them from another week of pulling their hair out).",
    "As mentioned, as well as the problems with games, there are other fixes here. These include several display-related bugbears like an “issue that might cause video playback to flicker when rendering on certain low-latency capable monitors”, and incorrect refresh rates showing under advanced display settings when it comes to HDR-capable monitors.",
    "KB4601382 also delivers a solution for unexpected screens popping up in the Windows 10 setup experience (initial out of box installation process, that is).",
    "If you’re not affected by any of these issues, or at least not bothered by them to any pressing degree, it’s best to steer clear of a preview update – because as the name suggests, these are still in testing, so may be rough around the edges or have unintended consequences in one form or another.",
    "Strictly speaking, it’s best to wait for the finalized patch (indeed, as we’ve seen many times in the past, even the finished version can mistakenly introduce fresh bugs – so preview updates need to be treated with some caution).",
    "Via Windows Latest"
  ],
  "headers": {
    "5": "Caution first"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "states": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-7019292182868176000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Ftopic%2Ffebruary-24-2021-kb4601382-os-builds-19041-844-and-19042-844-preview-1a7ed2b4-017d-2644-a1e8-dd6bf14cba76",
    "Windows 10 May 2020 Update": "https://www.techradar.com/how-to/windows-10-may-2020-update-problems-how-to-fix-them",
    "games": "https://www.techradar.com/news/the-most-exciting-pc-games-coming-in-2021",
    "past": "https://www.techradar.com/news/windows-10-problems-are-ruining-microsofts-reputation-and-the-damage-cant-be-underestimated",
    "Windows Latest": "https://www.windowslatest.com/2021/02/26/windows-10-kb4601382-update-fixes-app-crashes-game-rendering-issue/"
  }
}