{
  "source": "https://www.techradar.com/news/iphone-13-mockup-shows-changes-that-might-be-coming-to-the-notch",
  "title": "iPhone 13 mockup shows changes that might be coming to the notch",
  "category": "phones",
  "updated": "2021-04-05T08:08:06Z",
  "author": "david-nield",
  "summary": "It's shrinking, apparently",
  "article": [
    "A lot of the rumors we've heard around the iPhone 13 have been about the phone's display notch – and thanks to a 3D-printed mockup, supposedly matching the dimensions of the upcoming handset, we might have our best look at the notch yet.",
    "Posted by Japanese site Mac Otakara, the images are said to be based on the 6.1-inch version of the iPhone 13 – and as you can see below, they show the notch is about to get a little bit smaller. It's also being reconfigured, with the selfie camera moved from the right to the left.",
    "It looks as though the phone's earpiece is going to get pushed up into the bezel of the iPhone 13, which is where Apple is going to save some of the space it needs to put a more compact notch on the front of its next batch of handsets.",
    "Mac Otakara has also shared specific dimensions indicating how much the notch might shrink by: it'll be 26.8 mm wide compared with its current width of 34.83 mm, while the height will increase slightly from 5.3 mm to 5.35 mm.",
    "The rest of the mockup doesn't show any other significant design changes on the iPhone 13, either on the front or the back, but for the time being it's difficult to verify just how close to the real handset this 3D dummy unit is.",
    "What we can say for sure is that the redesigned notch is something that's been mentioned by a lot of other sources too: it would seem that getting a little bit of extra screen space up at the top of the phone display is one of Apple's key objectives this year.",
    "There has also been talk that the notch might get ditched entirely, with the display bezels getting thicker to compensate. At this stage though, it looks as though a smaller notch is more likely – a notch-free iPhone will have to wait until 2022.",
    "If Apple sticks to its usual schedule, then the iPhone 13 should make an official appearance in September. As well as tweaks to the design, we're also expecting 120Hz refresh rate screens and improvements in battery life.",
    "Via MacRumors"
  ],
  "headers": {},
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Mac Otakara": "http://www.macotakara.jp/blog/rumor/entry-41091.html",
    "other sources": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "been talk": "https://www.techradar.com/news/iphone-13-could-opt-for-thicker-bezels-so-it-can-ditch-the-notch",
    "expecting 120Hz refresh rate screens": "https://www.techradar.com/news/iphone-13-leaks-point-again-to-smaller-notch-and-120hz-screen",
    "improvements in battery life": "https://www.techradar.com/news/iphone-13-leak-says-battery-life-will-be-better",
    "MacRumors": "https://www.macrumors.com/2021/04/04/iphone-13-pro-mockup-smaller-notch/"
  }
}