{
  "source": "https://www.techradar.com/news/black-ps5-finally-becomes-a-reality-as-faceplates-go-on-sale-but-not-from-sony",
  "title": "Black PS5 finally becomes a reality as faceplates go on sale, but not from Sony",
  "category": "gaming",
  "updated": "2021-07-09T12:48:10Z",
  "author": "john-mccann",
  "summary": "Make your white PS5 a matte black console",
  "article": [
    "If you've been dreaming of an all-black PS5, then dream no more. Black faceplates for Sony's next-gen console are now on sale - but not from the Japanese manufacturer.",
    "Instead, Canadian brand dbrand has put its black PS5 'Darkplates' on sale, although at the time of writing there's at least a three month wait on shipping as the firm has already sold out its February, March and April stock. May is currently the estimated shipping date for orders placed now.",
    "The sheets of plastic for your PS5 don't come cheap, though. dbrand is currently running an offer which takes the price of the Disc Edition 'Darkplates' to $49 (around £35 / AU$60) for the disc edition console, down from $59.",
    "If you have the Digital Edition PS5, Darkplates stock for the cheaper, disc-free console are \"coming soon\" with no word on their price - so you'll have to be patient if you're eager to skin this console.",
    "Sony made it clear in a pre-release teardown of the PS5 that the stock white faceplates on its new console were easy to remove - sparking internet chatter on the possibility of custom plates in the future.",
    "Back in October 2020 we saw one firm attempt to sell a series of colorful custom faceplates for the PS5 for $39.99, but weeks later the operation had been shut down by Sony's lawyers with all orders cancelled.",
    "So can we expect the same fate for dbrand's 'Darkplates'? The company is bullish, with the website for the plates featuring the slogan \"PS5 Darkplates. Go ahead, sue us.\"",
    "It goes further into the potential legalities of its offering too - albeit in an extremely tongue-in-cheek way - with the product page stating: \"When you look at this microscopic texture inside the Darkplates, what do you see? If your answer is \"a familiar-but-legally-distinct apocalyptic spin on the classic PlayStation button shapes,\" you might be one of our lawyers.\"",
    "Whether this distinction between its own plates and Sony's is enough to keep the lawyers at bay remains to be seen, and those who have already pre-ordered their Darkplates will be hoping Sony lets this one slide.",
    "While the Darkplates that allow you to finally have a black PS5 under your TV will likely be the main attraction, dbrand is also offering the option of a 'middle skin' for the console too.",
    "This sticker - priced at $19.95, but currently reduced to $11.95 - will allow you to change the look of the glossy black plastic central section of your PS5.",
    "It comes in a number of colors and patterns, with a matte black option (which matches the Darkplates) joined by neon yellow, matte white and then a quartet of patterns; robot camo, triple black, redcode and silicon."
  ],
  "headers": {
    "4": "Are black PS5 faceplates legal?",
    "9": "It's not just faceplates though"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "in a pre-release teardown of the PS5": "https://www.techradar.com/news/ps5-hardware-is-finally-revealed-in-this-sony-teardown-video",
    "in October 2020": "https://www.techradar.com/news/these-custom-ps5-faceplates-let-you-change-the-look-of-sonys-console",
    "shut down by Sony's lawyers": "https://www.techradar.com/news/ps5-custom-faceplate-orders-cancelled-as-sony-takes-legal-action"
  }
}