{
  "source": "https://www.techradar.com/news/no-elon-musk-doesnt-want-to-give-you-crypto-its-a-scam",
  "title": "No, Elon Musk doesn't want to give you crypto - it's a scam",
  "category": "computing",
  "updated": "2021-09-20T19:30:30Z",
  "author": "anthony-spadafora",
  "summary": "Be on the lookout for emails asking you to join the “Elon Musk Club”",
  "article": [
    "A series of spam email campaigns have appeared online over the past few weeks which are being used to promote the latest Elon Musk-themed cryptocurrency giveaway.",
    "As reported by BleepingComputer, this new cryptocurrency giveaway scam is being referred to as either the “Elon Musk Mutual Aid Fund” or the “Elon Musk Club”. While these types of scam are easy to spot for those with a trained eye, many users continue to fall for them as the allure of free Bitcoin is just too high.",
    "Although the majority of cryptocurrency scams use social media to target potential victims, fraudsters have turned to email spam to promote this latest Elon Musk-themed giveaway scam.",
    "The phishing emails sent out to potential victims for this scam are low effort with non-descriptive subjects and messages but they do include an HTML attachment which reads either “Get Free Bitcoin” or “Elon Musk Club”. The HTML attachment itself contains a single line of code that uses JavaScript to redirect a user's browser to a site pretending to be an “Elon Musk – Mutual aid fund” with the promise of sending 0.001 (around $43) to 0.055 (around $2,395) Bitcoin to all users who participate.",
    "When a users who has navigated to the Elon Musk – Mutual aid fund website clicks on the “Accept an invitation” button, they are then redirected to another site called “Bitcoin Donate”.",
    "On this site, users are prompted to enter a Bitcoin address in order to receive free cryptocurrency along with their name and an optional picture. After clicking the “Accept donate” button, users are redirected again through a series of pages which pretend to be other users donating .001Bitcoin to their accounts.",
    "Once a user's account has a balance of 0.055 Bitcoin, they are sent to a final page which says they need to donate 0.001 Bitcoin to another user in order to withdraw all of their funds. However, instead of unlocking a user's funds, the fraudsters behind the scam end up pocketing the 0.001 Bitcoin.",
    "According to BleepingComputer, so far two Bitcoin addresses associated with these scams have only earned $2,661 but there are likely additional addresses being used by similar scams.",
    "When it comes to emails about Bitcoin in your inbox, it's always a good idea to keep the adage 'if something seems too good to be true it probably is' in mind. In addition to swindling you out of your hard-earned money, these scams can also be used to commit identity theft especially when you provide personal details such as your name, email or photo to those behind them.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "The Elon Musk Club"
  },
  "links": {
    "Elon Musk-themed cryptocurrency giveaway": "https://www.techradar.com/news/no-elon-musk-isnt-emailing-you-about-cryptocurrency-its-a-scam",
    "reported": "https://www.bleepingcomputer.com/news/security/new-elon-musk-club-crypto-giveaway-scam-promoted-via-email/",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "email spam": "https://www.techradar.com/news/nasty-new-scam-tricks-victims-into-calling-the-fraudsters",
    "browser": "https://www.techradar.com/best/browser",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/new-elon-musk-club-crypto-giveaway-scam-promoted-via-email/"
  }
}