{
  "source": "https://www.techradar.com/news/fifa-22-already-has-the-best-career-mode-thanks-to-custom-teams",
  "title": "FIFA 22 already has the best career mode, thanks to custom teams",
  "category": "gaming",
  "updated": "2021-08-06T09:15:48Z",
  "author": "rhys-wood",
  "summary": "Opinion: This long-awaited feature can only be a good thing",
  "article": [
    "It’s happening. FIFA 22’s career mode will feature the ability to create our very own custom teams. It’s something that sounds so trivial on the surface, but what this does, in essence, is allow us to play as a near-infinite number of clubs based entirely on our imagination.",
    "As long as you choose to play the Manager career mode, FIFA 22 players will be able to create their own squad (of course, all the other rubbish, real-life clubs are still playable), and the customization options sound delightfully robust. You of course get to name your team and individual players, but you’ll also get to customize your crest, home and away kits, and even your home stadium.",
    "So if you’ve ever wanted to see how AFC Richmond would actually perform against real-life teams, or you want to try your hand at recreating the dysfunctional England squad from Mike Bassett: England Manager, FIFA 22 will let you do that, and I couldn’t be happier as a result.",
    "Another exciting aspect of FIFA 22’s custom teams is that you’ll be able to set your squad’s initial star rating. This sounds like it acts as a secondary difficulty option. Your star rating (out of five) will determine the overall quality of your players. Your club board’s priorities will adjust accordingly, too, meaning that a 5-star team will most likely be tasked with winning the league while a 1-2 star might just be asked to avoid relegation.",
    "According to senior game designer Alex Constantinescu, the players initially generated for your team will reflect the league they’re in. Constantinescu explained: \"let’s assume that 7% of the players in the English Premier League have French nationality. Each time a player is generated for your squad in the English Premier League, there’s a 7% chance that they could be French.\"",
    "Customization in FIFA 22’s career mode goes even deeper than that. You’ll have full control over your team, including your initial team’s average age, control over scouting and youth team development and even your starting transfer budget if you want to mix in some famous players alongside your custom misfits.",
    "But if you’re a FIFA outsider reading this, or have simply never touched the series’ career mode, you might be wondering why this even matters at all? Put simply, custom teams have been a heavily requested feature for career mode for some time.",
    "Prior FIFA titles have allowed players to customize existing squads in casual play (slotting Gareth Bale into the Charlton Athletic starting eleven always provided some chaotic delight), but we’ve certainly never had this much control over a team built from the ground up.",
    "Custom squads also have the potential to spin dynamic stories through a combination of the game’s threadbare narrative and your own imagination. I’ve written previously about how FIFA career modes can have weirdly compelling narratives, if you let your imagination take hold. The same can be said for other customization-heavy games like XCOM 2, wherein each thrilling mission could be your created squad’s last.",
    "I’m very interested in seeing how much custom teams will be allowed to grow. Will the initially generated roster come with their own traits, strengths and weaknesses? Will those be able to be customized individually, too? And will an underdog striker be able to blossom into a 92-rated wunderkind? In any case, I’m certainly excited to see just how far I can take my custom squads, and the impact they can have on other, far less cool teams."
  ],
  "headers": {
    "5": "Down the customization rabbit hole"
  },
  "links": {
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "AFC Richmond": "https://www.techradar.com/news/ted-lasso-season-2s-humor-and-heart-will-cure-your-soccer-blues",
    "weirdly compelling narratives": "https://www.techradar.com/news/why-do-sports-games-like-fifa-21-have-surprisingly-good-stories"
  }
}