{
  "source": "https://www.techradar.com/news/microsoft-365-clippy-is-making-a-triumphant-return",
  "title": "Microsoft 365: Clippy is making a triumphant return",
  "category": "computing",
  "updated": "2021-07-15T11:30:32Z",
  "author": "joel-khalili",
  "summary": "A Clippy emoji coming to Microsoft 365",
  "article": [
    "By popular demand, Microsoft will soon bring infamous virtual assistant Clippy back to the Microsoft 365 suite.",
    "The company published polls on both Twitter and Instagram, promising that Clippy would be reintroduced to Microsoft 365 in emoji form if the post received 20,000 likes or more.",
    "At the time of writing, the tweet has more than 128,000 likes and the Instagram post circa 200,000, well beyond the threshold specified.",
    "It’s not yet clear precisely when Clippy will replace the paperclip emoji in Microsoft 365, but here’s hoping it's not given the ability to talk.",
    "Clippy made its debut as virtual assistant in Office 97 and quickly became notorious for its overly-frequent, if well-meaning, interjections. The purpose of Clippy was to help users navigate the Office UI and offer tips to improve the quality of their writing.",
    "In light of criticism from users, Clippy was turned off by default in 2001 and eventually removed completely in Office 2007 for Windows and Office 2008 for Mac. In promo materials, Microsoft claimed its new versions of Office were so simple to use they put Clippy out of a job.",
    "With more than a decade having passed since the demise of Clippy, it appears long-time Office users are now able to look back on the virtual assistant fondly, through rose-tinted goggles.",
    "This isn’t the first time Microsoft has attempted to play on the nostalgia of its users. Last week, the company published a new set of backgrounds for Microsoft Teams that pay homage to a number of fan-favorite products and features, Clippy included.",
    "“Because a little trip down memory lane can be good for the soul, and because after well over a year of remote and hybrid work we could all use some excitement on video call, we asked our designers a few memorable Microsoft moments their debut as Teams backgrounds,” wrote Microsoft.",
    "“Whether you love or loathe Clippy, it’s hard to not smile - just admit it - when you see it pop up in a meme somewhere. You may think Clippy was too persistent, too eager, perhaps even too polite. We like to think that Clippy, the true OG virtual assistant, was just a bit ahead of its time.”"
  ],
  "headers": {
    "4": "Clippy returns to Microsoft 365"
  },
  "links": {
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "new set of backgrounds": "https://www.techradar.com/news/clippy-solitaire-paint-microsoft-teams-gets-a-bunch-of-iconic-new-backgrounds",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives"
  }
}