{
  "source": "https://www.techradar.com/news/amazons-home-security-sale-slashes-the-price-on-the-all-new-blink-camera",
  "title": "Amazon's home security sale slashes the price on the all-new Blink camera",
  "category": "cameras",
  "updated": "2021-02-18T16:40:48Z",
  "author": "mackenzie-frazier",
  "summary": "Home security savings on Blink's new cameras at Amazon",
  "article": [
    "Beef up your home security and save money with Amazon's home security sale on Blink cameras. Today's security camera deals include the all-new Blink Mini on sale for $27.99(was $34.99) and the Blink outdoor camera on sale for $74.99 (was $99.99).",
    "The Blink Mini security camera provides security to your home day and night with built-in infrared night vision, two-way audio, customizable motion detection, and live view recording. You'll get alerts sent to your smartphone when motion is detected so you can monitor your home from anywhere. The all-new Blink outdoor security camera is battery-powered and includes two AA lithium batteries that offer an impressive two-year battery life. The weatherproof security camera is designed for outdoor use and features infrared night vision so you can monitor your home in the dark. The Blink camera also features two-way audio and includes a built-in motion sensor that sends alerts to your smartphone or tablet when motion is detected. Discounts on the Blink security cameras are rare, and we don't know how long Amazon will have these on sale, so we recommend taking advantage of now before it's too late.",
    "You can find more home security sales with the best cheap home security camera deals that are currently available. You can also shop more smart home deals with the best cheap smart home devices and gadget deals."
  ],
  "headers": {
    "1": "Amazon home security sale"
  },
  "links": {
    "on sale for $27.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBlink-Mini-plug-security-detection%2Fdp%2FB07X6C9RMF%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8039640587936289000-20",
    "on sale for $74.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBlink-Outdoor-Wireless-Security-Camera-3cam%2Fdp%2FB086DKSYTS%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1396233750512385000-20",
    "best cheap home security camera deals": "https://www.techradar.com/deals/the-best-home-security-camera-deals",
    "best cheap smart home devices and gadget deals": "https://www.techradar.com/news/the-best-cheap-smart-home-gadgets-of-2019"
  }
}