{
  "source": "https://www.techradar.com/news/grab-horizon-zero-dawn-for-free-on-ps4-and-ps5-right-now",
  "title": "Grab Horizon Zero Dawn for free on PS4 and PS5 right now",
  "category": "gaming",
  "updated": "2021-04-20T11:35:34Z",
  "author": "vic-hood",
  "summary": "For a limited time",
  "article": [
    "PlayStation players can pick up Horizon Zero Dawn for free right now, as part of Sony's latest Play at Home offering.",
    "The Horizon Zero Dawn Complete Edition, which includes both the base game and the Frozen Wild DLC, is available to download completely free for both PS4 and PS5 players. While the game is technically the PS4 version, with no next-gen upgrade available, PS5 players can play the title thanks to backwards compatibility.",
    "This offer is only available for a limited time, running from April 19 at 11pm EDT / 8pm PDT (or April 20 at 4am BST / 2pm AEST) through May 14 at 11pm EDT / 8pm PDT (or May 15 at 4am BST / 2pm AEST).",
    "It's a great time to jump into Horizon Zero Dawn, or revisit it, ahead of the release of Horizon Forbidden West later this year.",
    "It's also worth noting that time is running out to grab Sony's other free game offerings. PlayStation players can still grab Abzu, Enter the Gungeon, Rez Infinite, Subnautica, The Witness, plus PSVR games Astro Bot Rescue Mission, Moss, Thumper and Paper Beast until April 22 at 11pm ET / 8pm PT (or April 23 at 4am BST / 2pm AEST).",
    "While all these games are PS4 versions, bar the PSVR titles, they're all playable on PS5 via backwards compatibility.",
    "What's more, Funimation is now offering extended access for new subscribers to Funimation or Wakanim until April 22 (subject to country availability).",
    "This free games offering is part of Sony's Play at Home initiative. Sony previously ran the Play At Home initiative in April 2020, offering PlayStation players Uncharted: The Nathan Drake Collection and Journey for free. However, these offers only lasted until May.",
    "However, this time, Sony has said that the offering will be even bigger than before, with PlayStation boss Jim Ryan Ryan explaining that the return of the initiative will see Sony offering a series of free games and entertainment offers to the PlayStation community \"to make the next few months a little more fun and enjoyable.\"",
    "\"In these historic times, the team at PlayStation wanted to thank the community by giving something back,\" Ryan wrote in a PlayStation blog post in February. \"These days, we could all use something to look forward to and another reason to stay safely socially distanced, so we are happy to be able to offer a free selection of great games and some entertainment offers.\"",
    "To download these games, all you need to do is go to their store pages on the PlayStation Store and hit download.",
    "What's nice about the offer is that you don't need to be a PlayStation Plus member to take advantage of the Play at Home program – it's available to anyone or everyone with a PSN account. (This is different from PS Plus' monthly 'free' games, which are only accessible so long as you keep up your PS Plus subscription.)",
    "That said, if you are a PlayStation Plus member with a PS5, you can access the PlayStation Plus Collection, which already has over a dozen PS4 classics to check out. Horizon Zero Dawn isn't among the mix, however, so this is a great opportunity to grab one of the last generation's best games."
  ],
  "headers": {
    "7": "Play at Home",
    "10": "How do you claim the free games?"
  },
  "links": {
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PSVR games": "https://www.techradar.com/best/best-playstation-vr-games",
    "Astro Bot Rescue Mission": "https://www.techradar.com/news/games-of-the-generation-astro-bot-rescue-mission-does-for-vr-what-mario-64-did-for-3d",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "Uncharted: The Nathan Drake Collection and Journey for free": "https://www.techradar.com/news/sony-is-encouraging-social-distancing-by-gifting-two-free-ps4-games",
    "PlayStation blog post": "https://blog.playstation.com/2021/02/23/play-at-home-returns-four-months-of-offers-for-playstation-games-and-entertainment-begin-march-1/#sf243317373",
    "PS Plus' monthly 'free' games": "https://www.techradar.com/news/playstation-plus-free-games",
    "PlayStation Plus Collection": "https://www.techradar.com/news/ps-plus-collection-for-ps5-gives-you-16-top-ps4-games-for-free-with-your-subscription"
  }
}