{
  "source": "https://www.techradar.com/news/raspberry-pi-nets-major-funding-as-pc-demand-grows-during-lockdowns",
  "title": "Raspberry Pi nets major funding as PC demand grows during lockdowns",
  "category": "computing",
  "updated": "2021-09-21T14:38:06Z",
  "author": "mayank-sharma",
  "summary": "New investment values Raspberry Pi trading company at around $500 million",
  "article": [
    "The organization behind the Raspberry Pi has managed to secure a $45 million (£33 million) investment riding on the success of its recent devices, including the Raspberry Pi 400 and the Raspberry Pi Pico.",
    "The Raspberry Pi was originally conceptualized as an affordable computer to lower the barrier of entry for computer education. However, it has also reinvigorated interest in do-it-yourself (DIY) computing and ushered in a whole generation of single-board computers (SBC).",
    "Eben Upton, inventor of the Raspberry Pi, doubles up as the founder of the Raspberry Pi Foundation and CEO of its commercial subsidiary, Raspberry Pi (Trading), that was spun in 2013 as a for-profit fully-owned subsidiary to pump back profits to fund the work of the foundation.",
    "There has been no official word from Raspberry Pi (Trading) on how it intends to use the infused capital.",
    "Earlier this year, there were reports of the organization gearing up for listing on the London Stock Exchange with a valuation of £300 million.",
    "However, Upton quickly shot down news of the listing saying the move isn’t something they were actively pursuing, and that the organization routinely speaks to advisors to figure out avenues for funding the future growth of the business.",
    "The latest move, first reported by The Telegraph, seems to be part of such a planned expansion, which sees Raspberry Pi (Trading) offload an unspecified amount of stake in the business to Lansdowne Partners and the Ezrah Charitable Trust, in a move that values the operation at around $500 million.",
    "\"The commercial and human impact [Raspberry Pi] has achieved in its first decade has been extraordinary and we look forward to assisting the company to expand this even further in coming years as new capital is deployed,\" Peter Davies, Lansdowne partner and head of developed markets strategy, claimed in a statement to press on the investment.",
    "Via The Telegraph"
  ],
  "headers": {
    "4": "Business is good"
  },
  "links": {
    "Raspberry Pi": "https://www.techradar.com/reviews/raspberry-pi-4-model-b",
    "Raspberry Pi 400": "https://www.techradar.com/news/raspberry-pi-400-is-a-computer-inside-a-keyboard",
    "Raspberry Pi Pico": "https://www.techradar.com/news/the-latest-board-from-raspberry-pi-costs-just-dollar4",
    "education": "https://www.techradar.com/best/best-linux-distros-for-education",
    "shot down news": "https://www.techradar.com/news/raspberry-pi-founder-dismisses-talk-of-public-float",
    "The Telegraph": "https://www.telegraph.co.uk/technology/2021/09/20/raspberry-pi-attracts-45m-lockdowns-fuel-demand-personal-computers/"
  }
}