{
  "source": "https://www.techradar.com/news/spotify-premium-hits-new-subscriber-milestone-as-podcasts-grow",
  "title": "Spotify Premium hits new subscriber milestone as podcasts grow",
  "category": "audio-visual",
  "updated": "2021-07-28T13:34:53Z",
  "author": "becca-caddy",
  "summary": "165 million people now pay for Spotify",
  "article": [
    "Spotify now has 365 million users with 165 million of them paying for Spotify Premium and 210 million sticking with the free, ad-supported version, according to a recent earnings report.",
    "Those numbers aren’t just big, but show paying users have increased by seven million in one quarter and overall users have grown by more than 20 percent since 2020.",
    "As well as getting more users and paying subscribers on board, the report also revealed that Spotify’s podcasts have been growing in popularity, with active user listening hitting an all-time high. This is no surprise given the streaming service has been heavily investing in podcast shows, talent and tech over the past few years.",
    "The report also revealed that Spotify’s goal is to add another 40 million users in order to hit 400 million in total by the end of the year – but does it have enough to offer when competition is mounting?",
    "Spotify is the most popular music streaming service today, but it’s often difficult to benchmark how well it’s doing in comparison to its competitors, as they don’t publicly publish such transparent numbers.",
    "The last official stats from Apple Music revealed 60 million paying subscribers in 2019 – although that number could have increased to more than 80 million by now. Similarly, there are no recent figures from Amazon Music, but in 2020 an announcement revealed it had 55 million subscribers.",
    "Even if subscribers have increased significantly, Spotify is still the clear winner here. However, with several of its competitors offering more choice when it comes to audio quality – like Lossless and Spatial Audio now in Apple Music and Tidal HiFi – could those who are serious about their music be tempted away?",
    "That’s difficult to predict. Sure the lure of audiophile-approved sound elsewhere could convince some users, but we're not sure millions would trade one service for another over the promise of an improved sound that many might not even notice without high-end audio set-ups to match.",
    "Spotify is certainly doing what it can to stay ahead of the rest. We can see that with its own upcoming Spotify HiFi offering – a similar lossless, CD-quality audio service, like Tidal HiFi – as well as its push into podcasts. Many streaming services are fast setting themselves up as one-stop destinations for all things audio and entertainment – like Apple Music’s huge selection of videos, radio shows and behind-the-scenes content.",
    "Podcasts are also a great way to make more money from ad revenue and by acquiring exclusive rights to certain podcasts and offering paid shows on its platform, it’s considered an attractive proposition for both advertisers and creators."
  ],
  "headers": {
    "4": "Analysis: can Spotify hang onto the music streaming top spot?"
  },
  "links": {
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "recent earnings report": "https://investors.spotify.com/financials/press-release-details/2021/Spotify-Technology-S.A.-Announces-Financial-Results-for-Second-Quarter-2021/default.aspx",
    "60 million paying subscribers": "https://www.numerama.com/tech/529295-60-millions-dabonnes-deal-avec-pnl-fin-ditunes-rencontre-avec-eddy-cue-boss-dapple-music.html",
    "an announcement revealed": "https://www.aboutamazon.com/news/entertainment/amazon-music-has-more-than-55-million-customers-worldwide",
    "Lossless and Spatial Audio now in Apple Music": "https://www.techradar.com/how-to/apple-music-spatial-audio-and-lossless-guide-heres-how-to-turn-them-on",
    "Tidal HiF": "https://www.techradar.com/reviews/tidal",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-is-apparently-available-for-some-users-but-only-for-a-few-seconds-at-a-time"
  }
}