{
  "source": "https://www.techradar.com/news/nordpass-introduces-web-vault-and-third-party-logins",
  "title": "NordPass introduces Web Vault and third-party logins",
  "category": "computing",
  "updated": "2021-09-16T04:00:11Z",
  "author": "anthony-spadafora",
  "summary": "New features make it easier to access NordPass' password manager",
  "article": [
    "NordPass has announced that users of its password manager will now be able to access their encrypted vault from any browser.",
    "While the company's new Web Vault isn't a replacement for the NordPass app, it's an additional feature that makes accessing your stored passwords easier and more accessible.",
    "Still though, the NordPass Web Vault contains the majority of features and functionality available on the NordPass desktop app without having to install the application on every device a user wants to access their passwords from. At the same time, the introduction of Web Vault will finally allow NordPass users to access their passwords on a Chromebook.",
    "NordPass' Web Vault will also likely be a welcome addition for professionals who work with corporate devices on which they are not authorized to install third-party apps.",
    "NordPass also recently introduced optional third-party logins so that users can log in to the company's services using their Google Account.",
    "With third-party logins, users can log in or even sign up for the company's password manager using existing information from another service without having to create a new login. Third-party logins not only make the sign-in process easier but also more secure.",
    "This new feature will be particularly useful for those who use Google to sign into their NordPass accounts since it lowers the risk of their passwords being brute-forced. However, it's worth noting that if you use your Google Account to log in to NordPass, it's not advisable to store your Google password using the service as forgetting it would lock you out of your NordPass account.",
    "As students are now heading back to school, NordPass is currently running a promotion where users can save up to 70 percent when subscribing to Premium NordPass features as long as they do so before September 30."
  ],
  "headers": {
    "4": "Third-party logins"
  },
  "links": {
    "password manager": "https://www.techradar.com/best/password-manager",
    "browser": "https://www.techradar.com/best/browser",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "NordPass": "https://www.techradar.com/reviews/nordpass",
    "passwords being brute-forced": "https://www.techradar.com/news/millions-of-remote-desktop-accounts-are-being-attacked-every-week",
    "back to school": "https://www.techradar.com/news/best-back-to-school-sales-2020",
    "running a promotion": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4302814137783224000&xs=1&url=https%3A%2F%2Fnordpass.com%2Fblog%2Fback-to-school-sale%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnordpass-introduces-web-vault-and-third-party-logins"
  }
}