{
  "source": "https://www.techradar.com/news/iphone-13-sounds-even-more-disappointing-in-the-face-of-the-pixel-6-redesign",
  "title": "iPhone 13 sounds even more disappointing in the face of the Pixel 6 redesign",
  "category": "phones",
  "updated": "2021-05-16T08:00:04Z",
  "author": "james-rogerson",
  "summary": "The iPhone 13 could be the most skippable iPhone in years",
  "article": [
    "If you’re looking to buy an iPhone this might not be a very good year for it, because based on rumors it looks a lot like the iPhone 13 will be a minor update over the iPhone 12. If so then it could struggle to stand out in the face of some of the other phones we’re seeing this year – most notably the Google Pixel 6.",
    "Of course, this is an iPhone we’re talking about, so it’s sure to be a massive success regardless. Apple could upgrade the chipset and call it a day, and the iPhone 13 would still sell by the millions. But unless you’re desperate for a new iPhone it might be worth either holding out for another year or looking towards the world of Android for your next phone.",
    "It’s still early days for iPhone 13 rumors, but from what we’ve heard so far this could be the iPhone 12S in all but name (or perhaps even in name too).",
    "Leaks point to an iterative update with the same selection of handsets as last year (meaning you can expect an iPhone 13 mini, iPhone 13 Pro, and iPhone 13 Pro Max too), the same screen sizes, and the same resolutions.",
    "The design of the iPhone 13 range is also likely to be similar to that of the iPhone 12 range if rumors are anything to go by. We’re expecting slight tweaks to the dimensions, but not much more than that.",
    "The cameras could be improved a little more, but still not by much from what we’ve heard so far. Expect changed apertures and slight improvements to the hardware, but no drastic upgrades.",
    "Even the chipset, which can usually be relied upon to get a big boost in each new model, might be a fairly modest upgrade, with reports suggesting it’s the same size as the iPhone 12’s chipset, which is likely to mean it won’t be a huge improvement.",
    "So far the only big upgrade that’s looking likely on the iPhone 13 range is a move to 120Hz refresh rate screens, but this is so far only rumored for the Pro models, and is something Android has offered for years – with a number of Android phones sporting even higher refresh rates.",
    "Speaking of Android phones, while Apple appears to be treading water with the iPhone 13, Google seems like it might finally have broken out of its slumber and built an exciting handset.",
    "We don’t want to be down on past Pixels – they’re slick, sleek smartphones with great software, great cameras, and usually reasonable prices. But they’re not exactly the most ambitious or inspiring of devices in general, though the Google Pixel 6 might be.",
    "We say ‘might’ because nothing is confirmed just yet, but a leak has revealed the possible design, and it’s very different not just from past Pixels, but from pretty much any other handset too. A black camera block runs from one edge to the other and is framed by orange above and white or peach below for a striking appearance.",
    "Yes, it looks a bit like Geordie La Forge in phone form, and it’s bound to be divisive, but it’s a long way from being boring or bland.",
    "Coupled with the Pixel 6’s rumored Google-made chipset, the phone could be a lot more than just a solid way to get stock Android – it could be a real rival to the likes of the Samsung Galaxy S21, and it could make the iPhone 13 look boring.",
    "But while the Pixel 6 comparison won’t do the iPhone 13 any favors (especially with them both likely landing at the tail end of the year), it won’t be the only exciting handset to have landed – or be landing – in 2021.",
    "From the Xiaomi Mi 11 Ultra with its enormous camera block and rear display, to the Samsung Galaxy S21 Ultra with its S-Pen support and endless cameras, and the upcoming Samsung Galaxy Fold 3 and Huawei P50 (which looks to have a mad camera design of its own and will likely run HarmonyOS), there’s a lot of exciting stuff happening in Android land and beyond, both in terms of design and features.",
    "That’s not to say there’s nothing to get excited about on Apple’s phones, it’s just you might have to wait until 2022 or later for that excitement to pay off.",
    "For one thing, we’ve heard rumors that the iPhone 14 might have a 48MP main camera (up from just 12MP on the iPhone 12 range). This camera would also apparently be capable of 8K video recording (up from 4K on current models).",
    "The iPhone 15 meanwhile could get a periscope camera. This would potentially allow for 5x or even 10x optical zoom.",
    "There’s also talk of Apple finally ditching the notch on its phones, and while some reports suggest that could happen this year, it looks more likely that we’ll be waiting until at least 2022.",
    "Getting rid of the notch would allow for an all-screen design and a fundamentally different look, and hopefully Apple would use the opportunity to redesign the rest of the phone too, as visually there haven’t been too many changes since the iPhone X first introduced the notch to Apple’s range.",
    "At some point in the next two to three years we might even see the foldable iPhone Flip launch.",
    "So there are likely big changes planned in the iPhone’s future, just not its immediate future, and in the face of the competition above that means the iPhone 13 might be one of the most forgettable iPhones yet."
  ],
  "headers": {
    "2": "iPhone 13? More like iPhone 12S",
    "8": "Pick up a Pixel 6",
    "15": "The future’s bright(er)"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "or perhaps even in name too": "https://www.techradar.com/news/iphone-12s-or-iphone-13",
    "reports suggesting": "https://www.techradar.com/news/iphone-13s-a15-chip-production-could-start-soon-but-the-upgrades-might-be-small",
    "rumored Google-made chipset": "https://www.techradar.com/news/heres-more-evidence-the-google-pixel-6-will-run-on-a-custom-chipset",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "a 48MP main camera": "https://www.techradar.com/news/iphone-14-could-have-a-massive-camera-upgrade",
    "could get a periscope camera": "https://www.techradar.com/news/iphone-periscope-cameras-could-be-years-away",
    "Apple finally ditching the notch": "https://www.techradar.com/news/iphone-13-could-opt-for-thicker-bezels-so-it-can-ditch-the-notch",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "iPhone Flip": "https://www.techradar.com/news/foldable-iphone"
  }
}