{
  "source": "https://www.techradar.com/news/cd-projekt-reds-new-studio-is-working-on-an-ambitious-project",
  "title": "CD Projekt Red’s new studio is working on an ‘ambitious project’",
  "category": "gaming",
  "updated": "2021-10-23T10:49:30Z",
  "author": "emma-boyle",
  "summary": "Building on an existing IP",
  "article": [
    "CD Projekt Red has announced its acquisition of The Molasses Flood, a US studio best known for its survival titles such as The Flame in the Flood. As part of the CD Projekt group, The Molasses Flood will work on an “ambitious project” that’s “based on one of CD Projekt’s IPs.”",
    "In a statement published as part of the acquisition announcement, President and joint CEO of CD Projekt Red, Adam Kiciński, said, “We’re always on the lookout for teams who make games with heart. The Molasses Flood share our passion for video game development, they’re experienced, quality-oriented, and have great technological insight. I’m convinced they will bring a lot of talent and determination to the Group.”",
    "This is CD Projekt Red’s second acquisition this year, after it acquired multiplayer specialist studio and long-standing development partner, Digital Scapes, back in March. The arrangement seems to be quite different, though. Unlike Digital Scapes, The Molasses Flood will keep its name and while it will work in “close cooperation” with CD Projekt Red, it will keep its “current identity” and not be merged with existing teams.",
    "In its own statement, The Molasses Flood echoed this message, saying that CD Projekt “made it clear that they weren’t looking to simply absorb us” and that they’ll “get to keep making games based on the same principles that have always guided us: making games with heart built on rich gameplay systems”.",
    "Forrest Dowling, Studio Head at The Molasses Flood, said that the studio sees the acquisition as “an incredible opportunity to reach a much wider audience through a collaboration with a company we love, creating games in worlds we love.”",
    "CD Projekt Red and The Molasses Flood didn’t reveal what exactly it is that the studio will be working on, only that it’s “a completely new game in the universe of an existing CD Projekt IP”. Really, that likely means that the “ambitious project” is going to be a spin-off of either The Witcher series or Cyberpunk 2077.",
    "The emphasis in both statements on The Molasses Flood keeping its existing identity and its freedom to make games “based on the same principles that have always guided us” does seem to suggest that while the studio will be working in the world of one of CD Projekt Red’s IPs, it’s not going to abandon the spirit and mechanics of its previous games and could integrate them.",
    "The Molasses Flood is hiring for the project and there are several postings on the developer’s site at the moment. It’s hard, however, to glean all that much from them with regards to what the game will be. A listing for a Lead Narrative Designer favors “experience with big, unwieldy, high word count, endless side content type games”, while calls for Lead Gameplay and Engine Programmers say that experience of shipping a multiplayer game would be a “nice to have”.",
    "This is all just speculation at the moment, of course. We’ll have to wait a little while before hearing more details about the game, with both studios saying that more news can be expected in the future.",
    "As it’s working on its own project, this means that The Molasses Flood isn’t being brought in to contribute to the ongoing work on Cyberpunk 2077. Only a few days ago, CD Projekt Red announced that the game’s next-gen upgrade has been pushed to early 2022 rather than launching in late 2021 as planned. The next-gen upgrade of The Witcher 3 has also been pushed and is now expected in Q2 2022."
  ],
  "headers": {
    "5": "Analysis: What’s in the works?"
  },
  "links": {
    "statement": "https://www.cdprojekt.com/en/media/news/the-molasses-flood-video-games-development-studio-joins-cd-projekt-group/",
    "back in March": "https://www.cdprojekt.com/en/media/news/cd-projekt-acquires-the-canadian-digital-scapes-game-development-studio/",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Lead Narrative Designer": "https://jobs.smartrecruiters.com/CDPROJEKTRED/743999781128320-lead-narrative-designer",
    "Lead Gameplay": "https://jobs.smartrecruiters.com/CDPROJEKTRED/743999781128490-lead-engine-programmer",
    "Engine Programmers": "https://jobs.smartrecruiters.com/CDPROJEKTRED/743999781128490-lead-engine-programmer",
    "announced": "https://www.techradar.com/news/cyberpunk-2077-stumbles-at-last-hurdle-with-ps5-and-xbox-series-x-upgrade-delay"
  }
}