{
  "source": "https://www.techradar.com/news/psvr-2-games-will-include-familiar-franchises-synonymous-with-playstation",
  "title": "PSVR 2 games will include familiar franchises 'synonymous with PlayStation'",
  "category": "gaming",
  "updated": "2021-06-01T09:57:40Z",
  "author": "gerald-lynch",
  "summary": "Exclusives galore coming to PS5's PSVR 2",
  "article": [
    "We're still yet to see what the PS5's new virtual reality headset, the PSVR 2, looks like. But along with its orb-like controllers, we're starting to get a picture of what Sony has in store in terms of the PlayStation VR 2's software and games offering.",
    "Revealed within an investor catch-up document, Sony discusses \"New Growth Vectors\", with its upcoming VR hardware accessory taking a prime position in a related slide show. In an area which talks about the \"New Levels of Immersion\" that PSVR 2 will offer, it states that the headset will deliver to gamers \"unique experiences that are synonymous with PlayStation.\"",
    "Elsewhere the document reiterates what we already know about the PSVR 2 – including its single-cable connection the PS5 console, and the fact its wireless motion controllers will feature similar haptic feedback as seen in the DualSense PS5 gamepad.",
    "But there are certain things that can definitely be inferred from what Sony lays out here. \"Unique\" almost certainly can be read as \"exclusive\", meaning PSVR 2 gamers will be treated to titles that their Oculus Quest 2 and Steam VR compatriots will miss out on. As for \"experiences synonymous with PlayStation\", that suggests titles that lean into Sony's back catalogue of exclusive franchises – such as, but not limited to, Horizon Forbidden West and The Last of Us.",
    "Focusing on exclusives makes a lot of sense, and aligns with Sony's existing PS5 strategy.",
    "When the original PlayStation VR launched, the format was something of a novelty. Both gamers and developers were finding their feet with VR, and were willing to give any fresh new idea a go. Likewise, some developers may have been reticent to put their cash-cow franchises out in an untested format, and potentially sully the brand.",
    "But a few years later, with VR gaming well established and the latest console war for Sony more dependent on exclusive titles than ever before, familiar, big ticket franchises will be important to PSVR 2. Support for VR is a key differentiator for Sony's console compared to its Xbox Series X rival, and the ability to attach recognizable blockbuster exclusives to the platform will set it apart from the third-party dependent Oculus VR catalogue.",
    "Via Upload VR"
  ],
  "headers": {
    "4": "A solid strategy"
  },
  "links": {
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Steam VR": "https://www.techradar.com/news/steam-vrs-latest-trick-boosts-quality-for-lower-power-windows-10-pcs",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "The Last of Us": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Upload VR": "https://uploadvr.com/ps5-vr-synonymous-games/"
  }
}