{
  "source": "https://www.techradar.com/news/dark-souls-3-now-runs-at-60fps-on-xbox-series-x-but-its-still-held-back-by-xbox-one",
  "title": "Dark Souls 3 now runs at 60fps on Xbox Series X, but it's still held back by Xbox One",
  "category": "gaming",
  "updated": "2021-07-08T09:37:26Z",
  "author": "hamish-hector",
  "summary": "FPS Boost doubles Dark Souls 3's framerate",
  "article": [
    "You read that right, Dark Souls 3 now runs at 60fps on Xbox Series X and Series S consoles. The FromSoftware classic previously topped out at just 30fps on Xbox One hardware but has now had its framerate doubled, bringing in line with what’s available on PS5 thanks to FPS Boost.",
    "Annoyingly for Microsoft fans, though, is that even with FPS Boost, the best console Dark Souls experience remains on Sony hardware. The Xbox Series X and Series S versions max out at 900p at 60fps, just shy of the full HD resolution PS5 owners can enjoy at 60fps.",
    "The 900p resolution remains thanks to how FPS Boost typically works. Because the technology often doesn’t require developer input and is instead created by Xbox engineers, it means what’s happening inside the game (the textures and models) aren't changed. So, the graphics quality is limited by the game’s last-gen capabilities, and unlike on PS4 Pro, Dark Souls 3 was never enhanced on Xbox One X.",
    "Interestingly though, according to director of program management Jason Ronald, a “new technique” had to be created for Dark Souls 3 using help from FromSoftware to achieve this jump in framerate. If that’s the case, it could mean FromSoftware will be incentivized to boost the resolution too and give Xbox Series X players a cleaner looking experience like what’s on PS5.",
    "There are too many games to copy them out here, but you can check out our dedicated list of every game with FPS Boost instead to get the full scoop.",
    "FPS Boost also means some games have had their framerate quadrupled, which means many titles run at silky-smooth 120fps. Games like Battlefield 5, Mad Max, Overcooked 2 and Star Wars: Battlefront 2 all hit 120fps.",
    "There are plenty of other games you can enjoy with FPS Boost too, so be sure to check out the full list to see what other older games can take advantage of your next-gen gaming hardware."
  ],
  "headers": {
    "4": "What other games work with FPS Boost?"
  },
  "links": {
    "Dark Souls 3": "https://www.techradar.com/news/gaming/dark-souls-3-review-1318262",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "FPS Boost": "https://www.techradar.com/news/list-of-xbox-fps-boost-games-on-xbox-series-x-and-xbox-series-s",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "new technique": "https://twitter.com/jronald/status/1412940012530724864?s=20",
    "every game with FPS Boost": "https://www.techradar.com/news/list-of-xbox-fps-boost-games-on-xbox-series-x-and-xbox-series-s",
    "Battlefield 5": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter"
  }
}