{
  "source": "https://www.techradar.com/news/tesla-model-s-plaid-plus-cancelled-days-before-launch-as-theres-no-need-for-it",
  "title": "Tesla Model S Plaid Plus cancelled days before launch as there's 'no need' for it",
  "category": "car-tech",
  "updated": "2021-06-07T09:46:28Z",
  "author": "axel-metz",
  "summary": "Elon Musk is feeling confident",
  "article": [
    "Elon Musk and Tesla have cancelled plans to produce the Model S Plaid Plus, just days before the car was due to be unveiled at an official delivery event for its standard sibling, the Model S Plaid.",
    "The Model S Plaid Plus was set to become the most expensive variant of the company's flagship sedan and the quickest vehicle in the Tesla lineup, before mysteriously disappearing from Tesla's official website a few weeks ago.",
    "Clarifying the last-minute U-turn, CEO Musk said in a tweet that there is simply \"no need\" for the Plaid Plus, as the standard Plaid variant is \"just so good.\" Talk about confidence.",
    "Tesla had promised a Plaid Plus version of the Model S would deliver 520 miles of range, and accelerate from 0 to 60 mph in less than two seconds. Those specs would have put the model at the front of the electric vehicle (EV) pack, but the non-Plus Model S Plaid – scheduled for delivery on June 10 – is certainly no slouch, either.",
    "Only just shy of its now-canned premium brother, the remaining high-end version of the Model S Plaid will pack a 390-mile range battery, 1,020 horsepower, boast a 0-60mph acceleration of just two seconds and a top speed of 200 mph (~320 kmph).",
    "That will make the regular Tesla Model S Plaid the quickest production car ever made, so it seems Musk's confidence is justified. In fact, the Tesla boss followed up confirmation of the Plaid Plus' cancellation with a further tweet affirming that the Model S Plaid \"has to be felt to be believed,\" adding to previous comments suggesting the car \"feels like a spaceship.\"",
    "High praise from a man who does indeed build spaceships.",
    "Naturally, it's not going to be cheap. The Tesla Model S Plaid has a list price of $119,990 (around £90,000 / AU$150,000), making it the most expensive Tesla so far (ahead of the Model X).",
    "The Model S is already the most premium offering currently available in the Tesla lineup. In 2019, Elon Musk confirmed that a Plaid (a reference to Mel Brook's 1987 film Spaceballs) variant was in development and would be available in a few years.",
    "Soon after, it was revealed that an even more powerful Tesla Model Plaid Plus would be available at a price of $149,990, with greater performance specs (as detailed above) – achieved by using the company's new 4680 cells.",
    "Tesla's move to axe the Plaid Plus therefore suggests that those 4680 cells – and the performance gains brought by them – will likely be reserved for the Tesla Roadster, which is set to dethrone the Model S Plaid in 2022 with even quicker acceleration, a top speed of more than 250mph and a range of over 620 miles.",
    "Perhaps Tesla wants to have some differentiation between its top two models – which the Tesla Model S Plaid Plus would have blurred. In any case, the standard Model S Plaid is one serious car."
  ],
  "headers": {
    "8": "Even bigger fish"
  },
  "links": {
    "Model S Plaid": "https://www.tesla.com/models",
    "Tesla Roadster": "https://www.techradar.com/news/tesla-roadster"
  }
}