{
  "source": "https://www.techradar.com/news/your-roku-smart-tv-may-lose-the-youtube-app-heres-why",
  "title": "Roku TVs could lose a key streaming app in YouTube tussle",
  "category": "televisions",
  "updated": "2021-04-27T09:29:22Z",
  "author": "henry-st-leger",
  "summary": "Roku and Google are falling out, it seems",
  "article": [
    "Your Roku TV or Roku streaming stick may be about to lose access to both YouTube and YouTube TV, it seems, after the popular smart TV platform pulled back the curtains on its latest spat with Google (which owns the YouTube streaming service).",
    "Roku calls Google's terms for the app's continued presence \"unfair\", reportedly including favorable weighting towards YouTube-hosted music in results for voice search, more prominent placement of YouTube search results, and even the removal of competing search results while the YouTube app is open on a Roku device.",
    "Roku, it seems, is refusing, arguing that \"Google is attempting to use its YouTube monopoly position to force Roku into accepting predatory, anti-competitive and discriminatory terms that will directly harm Roku and our users\" (via Axios).",
    "Roku has gone so far as to directly email Roku customers about the issue, warning of the \"possibility that Google may take away your access to the YouTube TV channel on Roku,\" due to negotiations about the app's continued support having \"broken down.\"",
    "The Roku platform is found on huge swathes of streaming devices today, from the Roku Express and Roku Streaming Stick+ to Hisense Roku TVs and the TCL 6-Series smart TV – meaning that any disagreement could affect millions of devices and their users.",
    "We have reached out to Roku to discern whether this affects US users only, or the platform worldwide – but it certainly doesn't bode well for the two companies, and points to the uneasy alliances made between technology partners that remain rivals in many ways.",
    "While the apparent demands of Google may surprise some, it does fit into quite an established market trend of streaming services pushing for more prominent placement than their peers.",
    "On Amazon's range of Fire TV sticks, for instance, you'll find Amazon Prime Video content most aggressively showcased, while certain Hisense TVs with the Vidaa U platform feature Netflix at the top of its app list – without the option to remove or rearrange it.",
    "What else are the dedicated shortcut buttons found on so many remotes these days – including the Roku remote – but streaming services paying for key real estate?",
    "However, paying for special treatment is very different from pressuring a platform holder to do it, and this latest negotiation fall-through aligns with ongoing antitrust investigations into Google's practices in the US (also via Axios).",
    "You can read the letter from Roku in full below:",
    "\"We are sending this email to update you on the possibility that Google may take away your access to the YouTube TV channel on Roku. Recent negotiations with Google to carry YouTube TV have broken down because Roku cannot accept Google's unfair terms as we believe they could harm our users.",
    "\"Ensuring a great streaming experience at an exceptional value is the core of our business. We will always stand up for our users, which is why we cannot accept Google's unfair and anticompetitive requirements to manipulate your search results, impact the usage of your data and ultimately cost you more.",
    "\"While we are deeply disappointed in Google's decision to use their monopoly power to try and force terms that will directly harm streamers, we remain committed to reaching an agreement with Google that preserves your access to YouTube TV, protects your data and ensures a level playing field for companies to compete. We encourage you to contact Google and urge them to reach an agreement to continue offering YouTube TV on Roku and to follow standard industry practices pledging not to require access to sensitive search data or to manipulate your search results.\"",
    "It's rare that we see these tech companies pull their contract negotiations into the limelight like this – aside from some notable examples, like Fortnite developer Epic taking on Apple's App Store pricing practices – but any heavy YouTube users and Roku streaming device owners should certainly take note."
  ],
  "headers": {
    "6": "Playing favorites"
  },
  "links": {
    "Roku streaming stick": "https://www.techradar.com/reviews/roku-streaming-stick",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Axios": "https://www.axios.com/justice-ready-to-charge-google-with-monopoly-search-practices-c533707a-8132-460f-85c5-6c7ffeaa1e46.html",
    "Roku Express": "https://www.techradar.com/reviews/roku-express",
    "Roku Streaming Stick+": "https://www.techradar.com/reviews/roku-streaming-stick",
    "Hisense Roku TV": "https://www.techradar.com/reviews/hisense-roku-tv-r50b7120uk",
    "TCL 6-Series": "https://www.techradar.com/reviews/tcl-6-series-r615-r617",
    "Amazon Prime Video": "https://www.techradar.com/reviews/amazon-prime-review",
    "Hisense TVs": "https://www.techradar.com/news/should-i-buy-a-hisense-television",
    "dedicated shortcut buttons": "https://www.techradar.com/news/the-new-fire-tv-stick-remote-goes-all-in-on-netflix-hulu-and-disney-plus",
    "Fortnite developer Epic taking on Apple's App Store pricing practices": "https://www.techradar.com/news/fortnites-endgame-why-an-epic-fight-with-apple-and-google-could-lead-to-major-changes"
  }
}