{
  "source": "https://www.techradar.com/news/oculus-quest-3-could-be-cheaper-than-earlier-vr-headsets",
  "title": "Oculus Quest 3 could be cheaper than earlier VR headsets",
  "category": "gaming",
  "updated": "2021-06-03T09:48:07Z",
  "author": "hamish-hector",
  "summary": "Will Facebook’s VR plan work, though?",
  "article": [
    "The rumored Oculus Quest 3 headset might be even cheaper than we imagine when it launches according to new statements from Mark Zuckerberg, the head of Oculus parent company Facebook. And it’s all thanks to a trick that traditional game consoles have been using for years.",
    "During an Instagram Live AMA, Zuckerberg revealed that he believes making VR accessible requires two main things: A great wireless experience and low costs for consumers. Facebook is already dedicated to the wireless VR market and it sounds like it might start subsidizing the cost of new headsets.",
    "While no direct promises were made, Zuckerberg said “[console makers] subsidize [consoles] a little bit upfront with the hope and expectation that they'll make that up with app sales and other experiences”.",
    "He then followed up with “That's going to be more of our plan in VR and AR. We're coming at this from the perspective of ‘how do we get this in as many people as possible hands [sic]?’”",
    "If this is Facebook’s tactic for its upcoming headsets then we might not see much of a price rise for Oculus’ next wireless headset - which is rumored to be a more powerful ‘Oculus Quest Pro’-style device. As with all comments like this we’ll have to see how they shape up in the real world but we’re definitely excited to hear that VR might get even cheaper than it currently is.",
    "If you look back at comments from people wanting to jump into the VR space there’s often been one consistent concern: price. Your headset can cost hundreds and the PC you’d need to power it runs the total cost into the thousands. If you throw in needing to find space to be able to play the thing, as well as the price of games, then it’s easy to see why VR has felt like a niche product.",
    "Undoubtedly then, making the tech cheaper will mean more people will want to get involved. But subsidies have their risks; if you don’t sell enough consoles you then won’t sell enough games to be able to make your money back. So will cheaper VR become mainstream enough to justify this strategy from Facebook?",
    "Well, Oculus Quest 2 has already proven that Facebook’s tactics are ones that can work in practice. It’s a great bargain at just £299 / $299 / AU$479 and that’s probably why in just over five months on the market the Quest 2 had sold more units than all other Oculus headsets combined over a span of five years. If VR headsets can get better and stay at a similar price (or even cheaper) then we could see them sell even better than they already are.",
    "With all big-tech financial discussions we can never know for certain how they’ll turn out until we see the price tags on shelves. But given the direction the industry is headed, and how consumers have reacted so far, it seems like the future of VR could be more accessible than it ever has been before."
  ],
  "headers": {
    "5": "Analysis: Can VR afford to be subsidized?"
  },
  "links": {
    "Oculus Quest 3 headset": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "Oculus Quest Pro": "https://www.techradar.com/news/oculus-quest-pro-will-arrive-long-before-any-oculus-quest-3-vr-headset"
  }
}