{
  "source": "https://www.techradar.com/news/mammoth-or-monterey-apple-registers-both-names-for-a-future-macos-release",
  "title": "Mammoth or Monterey? Apple registers both names for a future macOS release",
  "category": "computing",
  "updated": "2021-06-03T10:50:44Z",
  "author": "daryl-baxter",
  "summary": "Departing Big Sur",
  "article": [
    "On the eve of Apple’s WWDC event, two names have been registered by the company for a future macOS version, to be announced as soon as next week.",
    "Apple’s operating system on the Mac has seen its fair share of names since its debut in 2000. It began with a series of big cat names such as Panther, Tiger, Leopard and many more, before switching to California landmarks with El Capitan.",
    "There was a slight name change last year, with the version number finally leaping from 10 to 11, after previous updates would be a x.1 increment. Now it looks as though there’s going to be a macOS 12 announced at next week’s WWDC developer event.",
    "There’s always murmurs as to what the next macOS version will be called, and it looks as though it's down to two names, with one most likely being a red herring.",
    "Apple wants to give each macOS release its time to shine, starting with the name. With the previous release of Big Sur, it was a huge update that brought a refreshed user interface, alongside support for its M1 Macs.",
    "There’s usually a huge update followed by a smaller one the following year. We’ve seen it before with Sierra and High Sierra in 2016, and as far back as Leopard and Snow Leopard in 2009.",
    "This year's update looks to follow the same path, with refinements and bug fixes for macOS 12. Apple is in the midst of a two-year transition for all Mac products to run on the M1 chips which ends in 2022, so it makes sense for the next mammoth update to occur when the whole line isn’t just running on Intel chips.",
    "Which is why we don’t think macOS 12 will be called Mammoth. It has connotations that make the new release sound as if it will be very substantial, so this could be a name for next year instead.",
    "Apple trademarks a bunch of names years in advance, and some are never even used. However Monterey has also been trademarked and renewed as recently as December, which gives credence that it could be the name for macOS 12.",
    "Another factor is that the coastline of Big Sur is very close to the county of Monterey in California. It’s almost unavoidable to be in both areas, especially if you’re driving down the coast. With Apple’s naming scheme focused on the areas of California in recent years, such as Catalina, High Sierra and Yosemite, it makes a lot of sense for Monterey to be the name of macOS 12.",
    "We don’t have long to wait, with the keynote now confirmed to start at 6PM BST on Monday, where it’s expected Apple will announce iOS 15, iPadOS 15, watchOS 8, alongside macOS 12.",
    "Via 9to5Mac"
  ],
  "headers": {
    "4": "What features could appear in macOS 12?",
    "7": "Analysis: Our survey says - Monterey"
  },
  "links": {
    "WWDC event": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "trademarked and renewed": "https://trademarks.justia.com/861/36/monterey-86136631.html",
    "both areas": "https://www.myscenicdrives.com/drives/california/big-sur-coast",
    "9to5Mac": "https://9to5mac.com/2021/06/01/apple-trademarks-hint-that-macos-12-could-be-called-mammoth-or-monterey/"
  }
}