{
  "source": "https://www.techradar.com/news/steam-deck-shouldnt-suffer-from-nintendo-switchs-biggest-problem-says-valve",
  "title": "Steam Deck shouldn’t suffer from Nintendo Switch’s biggest problem, says Valve",
  "category": "gaming",
  "updated": "2021-07-19T08:58:17Z",
  "author": "adam-vjestica",
  "summary": "Stick it to the drift",
  "article": [
    "Valve’s Steam Deck is set to go head-to-head against the Nintendo Switch in the handheld space when it launches in December 2021. And while we’ll have to wait a while before we can go hands-on with Valve’s new hardware, there’s potentially good news for those who are worried that the Steam Deck might develop stick drift – something which has plagued Switch owners.",
    "In an interview with IGN, Valve hardware engineer Yazan Aldehayyat said that the team has “done a ton of testing on reliability,” in terms of the handheld’s inputs and that they chose hardware that had well-known performance records. “We didn’t want to take a risk on that, right?” Aldehayyat told IGN. “As I’m sure our customers don’t want us to take a risk on that either.”",
    "Aldehayyat is also confident that consumers will enjoy how the Steam Deck feels overall in terms of build quality and performance. “I think we feel that this will perform really well. And I think people will be super happy with it,” said Aldehayyat. “I think that it’s going to be a great buy. I mean, obviously every part will fail at some point, but we think people will be very satisfied and happy with this.”",
    "It’s a relief to hear that Valve has seemingly taken steps to avoid stick drift from developing on the Steam Deck, an issue which has affected countless Nintendo Switch owners and has been dubbed “Joy-Con drift”.",
    "If you’re not familiar with the effects of stick drift, it’s a phenomenon that occurs when an analog stick registers ghost inputs, which results in your onscreen character or crosshair moving on its own. It can result in making some games unplayable at its worst, and is annoying at best.",
    "Joy-Con drift has continually been a source of pain for Switch owners. The company has faced multiple lawsuits and has publicly apologized for the problem in the past. Unfortunately, it appears that Nintendo hasn’t come up with a fix yet, and recently confirmed that the Nintendo Switch OLED will use the same Joy-Con controllers that we’ve seen since the system’s launch.",
    "What makes the problem more frustrating is that a permanent solution may have been found by a diligent YouTuber, and it involves using a piece of paper. YouTube VK’s Channel discovered that Joy-Con drift can be fixed by applying pressure to the outside of the controllers, which suggests that the contact point between the thumb stick sensor gradually becomes loose. This creates a space between the metal prongs and the contact pads, which results in drift and erroneous inputs.",
    "VK’s fix involved adding a piece of paper (or cardboard) that is 1mm tall inside the Joy-Con, which appears to have completely solved his stick drift woes.",
    "Of course, Nintendo aren’t the only company to have faced criticism over stick drift issues. Both Sony and Microsoft have faced the wrath of consumers for stick drift on the PS5 DualSense controller and Xbox One pad. Thankfully, it seems Valve isn’t underestimating just how frustrating, expensive and time-consuming this problem can be.",
    "The Steam Deck is set to release in December 2021, and pre-orders went live on July 16. Not everything went to plan, though, as hundreds of users encountered pre-order issues, which means some Steam Deck orders won’t arrive until Q2 2022."
  ],
  "headers": {
    "5": "Joyless experience"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "IGN": "https://www.ign.com/articles/steam-deck-stick-drift-controller-joystick",
    "Joy-Con drift": "https://www.techradar.com/how-to/how-to-fix-joy-con-drift-on-nintendo-switch",
    "apologized for the problem": "https://www.techradar.com/news/nintendo-finally-apologizes-for-joy-con-drift-amid-lawsuit",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "a piece of paper": "https://www.techradar.com/news/someone-might-have-finally-fixed-nintendo-switch-joy-con-drift-using-a-piece-of-paper",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Xbox One pad": "https://www.techradar.com/news/an-angry-gamer-is-suing-microsoft-over-xbox-one-controller-stick-drift-issue",
    "encountered pre-order issues": "https://www.techradar.com/news/steam-deck-pre-orders-flood-in-and-512gb-model-now-isnt-shipping-for-a-year"
  }
}