{
  "source": "https://www.techradar.com/news/cloud-will-continue-to-evolve-the-workplace-in-2021",
  "title": "Cloud will continue to evolve the workplace in 2021",
  "category": "computing",
  "updated": "2021-01-13T11:19:35Z",
  "author": "pip-white",
  "summary": "Trends on the horizon for the cloud",
  "article": [
    "Enterprise spending on cloud computing infrastructure was up by 33% between July and September, from the same period in 2019. Businesses across all industries have looked to improve digital operations and collaboration amongst distributed teams in the face of COVID-19. It’s no surprise then that 2020 has driven more organizations to the cloud than ever before, and there’s no sign of this slowing down as we head towards 2021.",
    "As we come to the end of an unprecedented year, we look forward to the trends on the horizon for next year and beyond.",
    "Having had to shift to a new work environment overnight, COVID-19 has provided a unique opportunity for each sector to re-evaluate how they operate. The result has been the opening up of new and perhaps less obvious use cases in industries that have until recently been dominated by legacy systems and old technology systems, but which are now recognizing the cloud’s potential. Brit Insurance recently collaborated with Google Cloud on Ki, a fully digital and algorithmically-driven syndicate, to improve efficiency, responsiveness and competitiveness in the insurance industry.",
    "Elsewhere, in the public sector, the National Institute of Health Research (NIHR) has built a digital hub on Google Workspace to transform its processes and efficiently coordinate employees and partners across multiple locations and organizations. At the same time, the NIHR has accelerated the rate of biomedical research, placing search functions at the heart of its new hub to make vital information discoverable within seconds.",
    "If there's one thing that we’ve learnt from 2020, it's that agility is key to survival. As we head into the new year, and businesses establish their new “normal”, it's likely we’ll continue to see employees working remotely. As such, businesses will continue to have distinct cloud needs, and they won’t be afraid to demand a more bespoke cloud service. More businesses will opt for an “open” cloud approach to avoid vendor lock-in and remain flexible.",
    "As we enter a post-pandemic era, companies will also be looking to stabilize. Increasing the efficiency of operations, boosting revenue and improving the experiences of customers will be critical. Here, we’ll see the open source community increase investments in container and serverless function projects to support a growing demand for an “open” cloud, where businesses can build new environments and modernize old ones.",
    "In the past, a business’ IT management team has mainly opted for the cloud with infrastructure in mind - to change the way business devices and information systems interact. However, as we head into 2021, a bi-product of the pandemic will be that conversations around migration to the cloud will also include company culture and how this technology can be used to infuse innovation into it.",
    "According to McKinsey, the average worker spends 20% of their time looking for information. But the cloud has the power to alter the way employees interact with information. Labor-intensive and repetitive administrative tasks can be crossed off an employee’s to-do list, thereby freeing up time to work on innovative projects, or focus on more complex tasks. Savvy businesses who are already adopting cloud for this reason will be able to keep pace with change through continuous innovation and new ways of working that will emerge.",
    "The businesses who emerge successful into a post COVID-19 area will be those that understand their customer journey and can easily adapt to and predict changing habits. Collecting, storing and utilizing customer data effectively will be central to this. With this in mind, next year we’ll see innovative technologies like artificial intelligence (AI) and machine learning (ML) gain traction as the need for organizations to extract meaningful insights from stored data and better understand how their customers grow.",
    "In the retail industry, we’re seeing major players like IKEA, working on better fulfilling customer needs by providing relevant AI-powered product recommendations online, and introducing chatbots for simpler and better customer service.",
    "Over the past few years we’ve seen a paradigm shift in corporate responsibility. Sustainability is no longer just a nice-to-have but rather a business imperative. In 2021, sustainability will be central to every company decision, from the supply chain through to the office. Google Cloud recently pledged to operate on carbon-free energy by 2030 - and more and more businesses are following suit. The pressure will be on for businesses to meet these targets as we head into the new year.",
    "We’ll also see more strategic collaborations between cloud providers and end-user companies as they look to do more for the planet. Google Cloud recently collaborated with the WWF to enable fashion brand Stella McCartney a comprehensive view into the impact of their supply chains. Companies will increasingly leverage cloud capabilities as a means of improving the eco-friendly operations.",
    "2020 has undoubtedly been a year of accelerated digital transformation. Next year, businesses will continue to build on their cloud strategies, incorporating next-generation technologies like AI and ML, and those who haven’t established them will do so in the face of the ‘new normal.’ But importantly, businesses will need to ensure sustainability stays front and center of their 2020 planning."
  ],
  "headers": {
    "2": "More industries will migrate to cloud",
    "4": "More businesses will opt for an “open” cloud in 2021",
    "6": "Cloud will become part and parcel of a company’s culture",
    "8": "AI and ML will be imperative to remain competitive",
    "10": "Next year, sustainability will take center stage"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "employees": "https://www.techradar.com/best/best-employee-monitoring-software",
    "cloud service": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "IT management": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data": "https://www.techradar.com/best/best-data-migration-tools",
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning"
  }
}