{
  "source": "https://www.techradar.com/news/supreme-court-asks-us-government-to-step-in-on-amazon-cloud-case",
  "title": "Supreme Court asks US government to step in on Amazon cloud case",
  "category": "computing",
  "updated": "2021-10-06T14:19:22Z",
  "author": "abigail-opiah",
  "summary": "PersonalWeb told it could not file follow-up lawsuits against Amazon",
  "article": [
    "The US government has been asked to weigh in on a previous infringement case brought by a PersonalWeb Technologies against Amazon and other brands that use its AWS hosting services.",
    "The US Supreme Court has sought the federal government's views on PersonalWeb's appeal seeking to throw out a rule that restricts patent owners from filing follow-up suits after it initially lost its case involving Amazon cloud customers such as BuzzFeed and Patreon.",
    "Following PersonalWeb’s petition in April 2021, the Supreme Court's 1907 ruling in Kessler v. Eldred was cited - a case where a patent owner tried to sue a manufacturer for patent infringement and was subsequently barred from suing another customer on the basis of the same product.",
    "The issue began back in December 2011, when PersonalWeb sued Amazon and its customer Dropbox in the Eastern District of Texas on the grounds that Amazon S3 infringed patents from the “True Name” family.",
    "PersonalWeb alleged infringement by Amazon S3 and later by another Amazon service called CloudFront, as well as the website of Amazon’s subsidiary Twitch Interactive.",
    "The company accused each of these services based on their use of the HTTP standard, the protocol that governs how all web browsers and web servers communicate and transmit resources, such as HTML pages and images, for the worldwide web.",
    "Amazon told TechRadar Pro it declined to comment on the US Supreme Court’s decision.",
    "Via Reuters"
  ],
  "headers": {
    "3": "PersonalWeb vs. Amazon's cloud customers"
  },
  "links": {
    "cloud": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "PersonalWeb’s petition": "https://fingfx.thomsonreuters.com/gfx/legaldocs/mypmnoekbvr/IP%20PERSONALWEB%20PATENTS%20SUPREMECOURT%20response.pdf",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "Amazon S3": "https://www.techradar.com/news/what-is-amazon-s3",
    "CloudFront": "https://www.techradar.com/reviews/amazon-cloudfront",
    "Reuters": "https://www.reuters.com/legal/government/scotus-asks-govt-views-amazon-web-hosting-patent-case-2021-10-04/"
  }
}