{
  "source": "https://www.techradar.com/news/dont-worry-your-free-microsoft-teams-account-isnt-being-deleted",
  "title": "No, your Microsoft Teams free account isn't about to be deleted",
  "category": "computing",
  "updated": "2021-05-06T16:32:08Z",
  "author": "mike-moore",
  "summary": "Email claiming free Microsoft Teams accounts would be removed was a mistake",
  "article": [
    "The makers of Microsoft Teams have moved to assure users of its free service that their accounts won't be deleted, despite a recent email from the company claiming this would be the case.",
    "Some Microsoft Teams Free admins reported receiving emails last month from the company stating that they had reached the end of a trial period, and that their accounts would be deleted if they did not now pay for a full subscription.",
    "But Microsoft has now said that the email was sent in error, and no users will have their video conferencing accounts deleted.",
    "\"If you don't purchase a new subscription by May 3, 2021, your trial data will be available to all people in your organization for about 30 days. At that time, the subscription status changes to Disabled, and only admins will have access to trial data for about another 90 days. After that, your trial is permanently deleted,\" the email stated.",
    "However Microsoft was quick to respond, with a senior Microsoft Teams project manager taking to the company's Tech Community forum to straighten out the issue.",
    "Sam Cosby from the Customer Experience & Obsession side for Teams Free Organizations within the Teams Engineering Team at Microsoft, noted that the issue began back in January of 2021, when the company implemented a new method to help reduce the number of Teams Free organizations that go unused over a 90-day period of inactivity by deleting them.",
    "This new policy should only have affected organizations that did not have any sign-ins either during that period, as well as the grace period after the 90 days (120 days in total), before eventually being deleted.",
    "\"Unfortunately, there was a bug that sent out notification emails to Teams Free Admins even if their organization was in use during the past 90 days,\" Cosby noted.",
    "\"We’ve since fixed this bug and expect that we shouldn’t see any additional emails be sent out to organizations that have been recently used.\"",
    "Via Bleeping Computer"
  ],
  "headers": {
    "3": "Microsoft Teams Free"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "noted": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1220390900678905600&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-teams%2Faccidental-teams-free-deletion-email-sent-out-explanation-and%2Fm-p%2F2322945%23M91770&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fdont-worry-your-free-microsoft-teams-account-isnt-being-deleted",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/microsoft/no-active-microsoft-teams-free-organizations-will-not-be-deleted/"
  }
}