{
  "source": "https://www.techradar.com/news/google-pixel-fold-launch-rumored-for-2021-but-whats-the-google-pixel-roll",
  "title": "Google Pixel Fold launch rumored for 2021, but what's the Google Pixel Roll?",
  "category": "phones",
  "updated": "2021-06-09T11:35:55Z",
  "author": "hamish-hector",
  "summary": "Is Google on a Roll with its smartphones?",
  "article": [
    "Given the number of leaks and rumors we’ve seen at this point, a foldable Google Pixel phone announcement seems almost a certainty, though a reliable tipster has suggested that won’t be all. Now there are indications that a Google Pixel Roll could be announced at some point in the future, though we shouldn’t expect to see it before 2022.",
    "Ross Young, user @DSCCRoss on Twitter, put out two comments earlier this week. One which suggests that a Pixel Roll could be on the cards (but that we shouldn’t expect it in the next 12 months) and another confirming that the Pixel Fold is a separate device that should come at the end of 2021.",
    "As with all leaks, we’ll have to take them with a grain of salt, but if this is true we could see Google expand its smartphone lineup considerably over the coming years.",
    "This is the first we’ve heard of a Google Pixel Roll so we don’t have a concrete idea of what it will look like. But, based on previous rollable phones, we can explain how the tech-giant is likely going to pull off a rollable design and where the design could differ from the Pixel Fold.",
    "Unlike other foldables, rollable phones aim to deliver the large screen experience without any noticeable bumps, creases, or ridges that might distract from your experience. The video above shows what this looks like in practice, explaining how the Oppo X 2021 expands from its smaller size to the larger screen and then back again.",
    "This enhanced experience can be pricey though. While the Oppo X 2021 hasn’t got a price yet, the unlaunched LG Rollable was supposedly set to cost $2,359 (roughly £1,775, AU$3,130). Given Google’s more affordable approach to smartphones, we wonder if it has a trick up its sleeves to deliver a cheaper rollable or if it’s instead starting to target a more upscale market?",
    "We’ll have to wait and see what the Google Pixel Roll looks like to know any of this for sure, that is if it exists at all. As we learn more about the latest smartphone news we’ll be sure to keep you updated."
  ],
  "headers": {
    "3": "How would a Pixel Roll work?"
  },
  "links": {
    "foldable Google Pixel": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "@DSCCRoss on Twitter": "https://twitter.com/DSCCRoss",
    "Pixel Roll could be on the cards": "https://twitter.com/DSCCRoss/status/1402021463511638016?s=20",
    "another confirming that the Pixel Fold is a separate device": "https://twitter.com/DSCCRoss/status/1402022022662672385?s=20",
    "Oppo X 2021": "https://www.techradar.com/news/ive-used-the-oppo-x-2021-rollable-smartphone-what-i-like-and-what-i-dont",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable"
  }
}