{
  "source": "https://www.techradar.com/news/aws-wants-to-tempt-customers-into-switching-to-linux",
  "title": "AWS wants to tempt customers into switching to Linux",
  "category": "computing",
  "updated": "2021-01-19T13:13:53Z",
  "author": "mayank-sharma",
  "summary": "Move is part of what AWS describes as its new open source design system",
  "article": [
    "Another tech giant has thrown its weight behind Linux partnerships after Amazon Web Services (AWS) praised the system when launching the source code for its latest open source tool on GitHub.",
    "The open source Porting Assistant for .NET is designed to scan .NET apps and list the things that need to be fixed in order to port the app to Linux. This, AWS argues, will help customers “take advantage of the performance, cost savings, and robust ecosystem of Linux.”",
    "This choice of words has to be taken in context with the release of the AWS UI, which the company describes as “just the first step in a larger process of creating a new open source design system.”",
    "As per reports, these recent releases are part of a larger move in the company to switch to JavaScript/TypeScript and React in order to build “cross-platform user interface components, getting the benefit of being able to share libraries between web and desktop.”",
    "The basis for this assumption is two-pronged. First is the fact that the user interface for the Porting Assistant for .NET is written in React, although it could have just as easily been developed in .NET.",
    "It is seconded by the release of AWS UI, which the company describes as “a collection of React components that help create intuitive, responsive, and accessible user experiences for web applications.\"",
    "While AWS doesn’t create client applications, its embrace of React and this move towards what it describes as a “new open source design system” is perhaps done with the purpose of easing access to its services.",
    "It’s argued that switching to a new open source, platform-agnostic design methodology will surely make AWS services easier to consume and increase their adoption.",
    "Via: The Register"
  ],
  "headers": {
    "3": "Good Reaction"
  },
  "links": {
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Amazon Web Services (AWS)": "https://www.techradar.com/news/aws-cloudshell-gives-command-line-access-to-the-cloud-from-the-web-browser",
    "GitHub": "https://www.techradar.com/news/github-gets-a-dark-mode-option-heres-how-to-enable-it",
    "JavaScript/TypeScript": "https://www.techradar.com/news/bloomberg-improves-javascript-with-an-open-source-project-from-microsoft",
    "The Register": "https://www.theregister.com/2021/01/18/aws_creating_new_open_source/"
  }
}