{
  "source": "https://www.techradar.com/news/google-cloud-will-let-you-pick-its-greenest-region-to-work-with",
  "title": "Google Cloud will let you pick its greenest region to work with",
  "category": "computing",
  "updated": "2021-07-13T20:09:10Z",
  "author": "abigail-opiah",
  "summary": "Go green or go home with your Google Cloud region",
  "article": [
    "Google Cloud has signalled a major green push with a new initiative aimed at highlighting the regions with the lowest carbon impact inside its Cloud Console location selectors.",
    "Earlier this year, the cloud computing giant launched a tool to help business that rely upon its virtual networking services to pick a cloud region, with the ability to filter variables such as price, latency and sustainability.",
    "The launch forms part of Google Cloud's sustainability goal to operate on carbon-free energy by 2030.",
    "Google says the focal point of the Cloud Console location selector update is to help steer its customers to make more sustainable decisions.",
    "The option to pick a green cloud region on the Cloud Console location selector is currently available for Cloud Run and Datastream, but the company is planning to expand the rollout soon.",
    "\"Before releasing this feature, we ran experiments to measure its impact: Users who were exposed to the enhanced region picker were 19% more likely to select a 'low carbon' region for their Cloud Run service - a significant lift,\" Google Cloud said.",
    "\"These results show that by displaying carbon information in context of when you make the decision of picking a region, we are helping you make more sustainable decisions.",
    "“By sharing and displaying carbon information of Google Cloud regions, together we’re making tangible progress towards our goal of a carbon-free future.”",
    "Google first achieved carbon neutrality in 2007, and has been purchasing enough solar and wind energy to match 100% of its global electricity consumption since 2017.",
    "The company said it will continue to invest in technologies to help its partners and customers all over the world make sustainable choices.",
    "In September 2020, Google Cloud estimated that its continued sustainability commitments would directly generate more than 20,000 new jobs in clean energy and associated industries, in America and around the world, by 2025."
  ],
  "headers": {
    "3": "Sustainability push"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}