{
  "source": "https://www.techradar.com/news/gta-3-deserved-better-than-this-messy-definitive-trilogy-remastering",
  "title": "GTA 3 deserved better than this messy Definitive Trilogy remastering",
  "category": "gaming",
  "updated": "2021-11-12T12:01:18Z",
  "author": "gerald-lynch",
  "summary": "Poor frame rate, compressed audio and visual issues abound",
  "article": [
    "Grand Theft Auto 3 is a seminal, foundational open-world game, a true classic. But its remastering for the new Grand Theft Auto: The Trilogy – Definitive Edition leaves something to be desired.",
    "Now, the Definitive Edition does get quite a lot right – it’s a smartly-updated visual aesthetic and, for the most part, its controls are far more friendly to the modern gamer, and its lighting and texture updates look great.",
    "But there are also many missed opportunities, areas where more care could have gone into this version to fix long-existing issues, or generally just go further than the minimal effort that seems to have been exhibited in some areas.",
    "These issues are obvious from the rainy opening moments of GTA 3. Rockstar promised dynamic weather for the new releases of the Grand Theft Auto games, but the rain effect is frankly laughable. Raindrops fall on a visible grid on the ground, making it appear as if rain falls in uniform line patterns on the floor.",
    "To make matters worse in-game, there seems to be a filter or overlay layer that appears when it starts raining, sitting in front of the action to heighten the rain effect. The trouble is, real water is transparent – this is matte white. And so it becomes near impossible to safely navigate when rain falls.",
    "For 20 years, GTA 3 has suffered from highly-compressed dialogue during some missions. Modern audio upscaling techniques could have improved the clarity of these conversations, but instead, it sounds exactly as it did decades ago, when DVD storage limitations likely forced the hand of the developers to compress the audio drastically. It feels cheap and breaks immersion in a release of this expected caliber.",
    "Modern lighting techniques have been applied and, in some well-lit areas, they look great, with more defined shadows and eye-catching reflections. But there’s something a bit off about the default contrast levels, with everything looking so dark at times as to go beyond the ‘grimy’ intention of Liberty City’s original designers, and to verge towards unreadable. Detail gets lost severely unless you’re willing to play with the contrast and brightness sliders in the options.",
    "But perhaps the most glaring and frustrating element of all is the frame rate. I’ve been playing on the PS5, and whether you go for the “Fidelity” or “Performance” setting, it’s seemingly impossible for the game to lock in a stable frame rate. There are judders and dips throughout the experience – nowhere near the 60fps / 4K standards you’d expect from a modern release, let alone a remastering of a 20-year-old game that would be considered rather basic by today’s standards.",
    "That an open-world game as visually complex as Microsoft’s Forza Horizon 5 can run buttery smooth on the latest hardware, and a GTA 3 remaster is a choppy challenge is a huge disappointment.",
    "I’ve always had a soft spot for GTA 3. I remember sneaking a day off school and getting my naive mum to buy me the original PS2 release on the exact day it came out, and being blown away all day with its revolutionary open world.",
    "This Definitive Edition should be a cause for celebration of a title that changed the direction of the gaming industry for good. Instead, I’m sitting here hoping that Rockstar and remaster team Grove Street Studios are still working on post-release patch content to improve the performance of the game. It deserves so much more."
  ],
  "headers": {
    "3": "Raindrops keep falling on Claude's head",
    "7": "Choppy frame rate"
  },
  "links": {
    "Grand Theft Auto: The Trilogy – Definitive Edition": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5"
  }
}