{
  "source": "https://www.techradar.com/news/pac-man-99-is-a-new-battle-royale-exclusive-to-nintendo-switch-online",
  "title": "There's a new battle royale game just for Nintendo Switch Online subscribers",
  "category": "gaming",
  "updated": "2021-04-07T18:29:09Z",
  "author": "emma-boyle",
  "summary": "Pac-Man 99 is coming",
  "article": [
    "Nintendo has announced a new game that’s exclusive to Nintendo Switch Online subscribers: Pac-Man 99.",
    "In the vein of previously launched Nintendo Switch Online exclusives like Tetris 99 and the now-removed Super Mario 35, Pac-Man 99 takes an arcade classic and puts a battle royale twist on it. As though the original game isn't stressful enough on its own.",
    "It’s a pretty does-what-it-says-on-the-tin title, really; in Pac-Man 99, 99 players play as Pac-Man, each on their own screen, and the last player standing is the winner. The ultimate Pac-Man.",
    "As in the other Nintendo Switch Online battle royale games, just being good at the original game isn't enough. It’s also possible to disrupt your competitors and doing this well is actually a fairly essential part of winning. By eating ghosts, for instance, you can send a \"Jammer Pac-Man\" over to your opponents, creating a chance of slowing them down.",
    "You can even be tactical about which opponents you target, so if you want to knock out players who are already close to losing, or make an enemy of the last person who targeted you, go right ahead. You can see more about the game in its announcement trailer below:",
    "As with Tetris 99, Nintendo Switch Online subscribers get access to the Pac-Man 99 base game at no further cost but there are also DLC packs that can be purchased. These are completely optional and include cosmetic themes and offline modes.",
    "Pac-Man 99 is a game that’s exclusive to Nintendo Switch Online subscribers and Nintendo has confirmed that it’ll go live on April 7 at 6pm PST/ 9pm EST, which is 2am BST on April 8."
  ],
  "headers": {},
  "links": {
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer"
  }
}