{
  "source": "https://www.techradar.com/news/the-matrix-resurrections-trailer-remembers-what-we-loved-about-the-first-movie",
  "title": "The Matrix Resurrections trailer remembers what we loved about the first movie",
  "category": "entertainment",
  "updated": "2021-09-12T09:34:46Z",
  "author": "richard-edwards",
  "summary": "Opinion: The Matrix is at its best when it embraces its digital world – and plenty of mystery",
  "article": [
    "Across the entirety of the first two Terminator movies (AKA the good ones), James Cameron spent less than 10 minutes showing us the future war between humans and machines. With powerful images of robot caterpillar tracks crushing skulls, and Terminator endoskeletons shorn of their skins, they’re scenes that linger in the mind. Yet – as Terminator: Salvation would later prove beyond any doubt – we never needed to see more of the conflict.",
    "Because The Terminator movies are not about the future. Yes, protecting the one-day savior of mankind is high on their list of priorities, but the battle is not supposed to be fought in the future – it should be fought here, in our present. All those post-apocalyptic scenes are a framing device, the catalyst for a modern-day action thriller.",
    "The same is true of The Matrix, where the similarities with the Terminator saga stretch way beyond being a cautionary tale about artificial intelligence. All those scenes set in the “desert of the real” – and those creepy towers where babies are harvested – are integral to the original movie’s plot, but they’re not the reason for its success. The Matrix was a hit because of what the Wachowskis imagined inside a computer simulation, the way they pushed the laws of physics, and mixed tropes from other movies, graphic novels and philosophy.",
    "Thankfully, it’s a formula the new The Matrix Resurrections trailer seems to have, well, resurrected.",
    "Like the Star Wars prequel trilogy, the previous Matrix sequels – 2003’s Reloaded and Revolutions – have a much worse reputation than they deserve. Indeed, for all their flaws, they’re stuffed full of ideas, and feature some genuinely exciting action sequences.",
    "But somewhere along the way, Reloaded and Revolutions shift the balance too far towards the real world. They assume we care about the last human city of Zion (and its hedonistic raves) more than we do, and the resulting battles are the sort of CG carnage we could see in any other blockbuster. Instead of creating something as universally imitated as bullet-time, the Wachowskis became the imitators – apparently Ellen Ripley wants her Power Loader back…",
    "The new Resurrections trailer, however, leans so heavily into the original Matrix that it almost feels like the sequels never happened. Whether it’s white rabbit tattoos, red and blue pills, or the sight of a sharp-suited Agent, the iconography is lifted directly from the 1999 classic. But more importantly, the teaser taps into the mystery element that was part of The Matrix’s mystique by twisting the familiar on its head. In fact, (the original) Morpheus’s famous remark that, “No one can be told what the Matrix is – you have to see it for yourself,” has rarely felt so pertinent.",
    "The trailer throws up plenty of burning questions. If we saw Neo and Trinity die in Revolutions, how are they both (seemingly) alive and well in Resurrections? Why do they have no recollection of what happened before? And if Yahya Abdul-Mateen II is indeed playing a new-look Morpheus – as he’s seemingly confirmed on Instagram – does this mean that your in-Matrix avatar no longer has to look like your human self? Perhaps this explains why Neo sees a very different reflection in the mirror...",
    "Crucially, these are mysteries that only apply in The Matrix's digital space, the place where it can go places and do things that other blockbuster franchises can’t.",
    "It’s also important to note that The Matrix Resurrections can be The Matrix Rebooted without turning its back on existing continuity. With several nods to the existing sequels in the trailer, there’s no reason to suspect the new movie is going to follow in the footsteps of the recent Halloween sequel, and expunge everything but the original instalment from canon.",
    "But, thanks to the much-ridiculed Architect speech from The Matrix Reloaded, the writing team on Resurrections have a backdoor to start things afresh – after all, the Architect explicitly states that the One and the destruction of Zion are a recurring phenomenon, so the route to Neo’s return is baked into continuity like one of the Oracle’s cookies.",
    "While we’ve been bitten by pre-Matrix hype before, this trailer suggests that a franchise which limped to a conclusion 18 years ago could be about to get a spectacular infusion of life by harking back to its origins. Hopefully, come December, we’ll all be joining Keanu Reeves in a celebratory, “Woah…”",
    "The Matrix Resurrections is in theaters and on HBO Max (in the US) from December 22."
  ],
  "headers": {
    "4": "Rave new world",
    "9": "The back door"
  },
  "links": {
    "The Matrix Resurrections trailer": "https://www.techradar.com/news/the-matrix-4-trailer-breakdown-11-things-we-noticed-in-the-resurrections-teaser",
    "Instagram": "https://www.instagram.com/p/CTm3V-LgW7V/"
  }
}