{
  "source": "https://www.techradar.com/news/roidmi-s1e-should-i-buy-one",
  "title": "Roidmi S1E - should I buy one?",
  "category": "appliances",
  "updated": "2021-04-29T08:00:14Z",
  "author": "sophie-bird",
  "summary": "Is the Roidmi S1E vacuum any good? Here we find out",
  "article": [
    "The Roidmi S1E is a stick vacuum that’s designed to make cleaning up your floors a breeze - but is it any good and is it worth your money? We’ll be exploring the pros, cons, and the things you need to know before you purchase.",
    "Buying one of the best vacuum cleaners is a fairly big investment which is why it’s well worth considering all of your options before you part with any money. While some vacuums can set you back as much as $800/ £700 / AU$1200, the Roidmi S1E sits at the more affordable end of the vacuum cleaner price scale. The brand also has older versions of the S1E (the S1 and S1 Special) and a more expensive version too, the Roidmi X20. In Australia, the Roidmi S1E Elite is a very similar model that's also available.",
    "We’ve used the Roidmi S1E and will be including our take on how it performed, however, we didn’t put it through the extensive testing that forms our reviews.",
    "The bottom line: The Roidmi S1E is a cordless stick vacuum that has a white finish. It operates as a two-in-one vacuum because you can remove the stick and use the vacuum as a handheld cleaner. There are two speed settings and you can use this vacuum on all types of flooring. The battery life on the S1E is 40 minutes after a full charge, but if you’re using the high power function, it’ll last around 10 minutes.",
    "Pros: The Roidmi S1E is very light and weighs 1.5kg/ 3.3 lbs when you’re using it as a handheld device, and 2.2kg/ 4.8 lbs when it’s fully built as a stick vacuum. The brush head can rotate 270 degrees which allows you to easily navigate around your floors and any obstacles that might get in your way. The brush head also is designed so that hair doesn’t build up and affect the cleaning power, and the triple filter captures 99% of dust, dirt, and allergens.",
    "Cons: The Roidmi S1E only offers 10 minutes of cleaning time when it’s on high-power mode, which won’t be long enough to clean most homes. While the S1E does have a light on its main brush head, it doesn’t have one on the mattress cleaning attachment, which is disappointing. Some users also found the dust bin to be very small and had to empty it before finishing one vacuuming session.",
    "The Roidmi S1E is an affordable stick vacuum that can be used on carpets as well as hard floors. The stick is removable so that you can use the S1E as a handheld vacuum for cleaning stairs, cars or upholstery.",
    "Battery life: The Roidmi S1E provides 40 minutes of power when it’s fully charged, but that’s only if you use it on the standard speed setting. If you use the high-speed setting, the cleaning time is reduced to just 10 minutes of battery life. This is disappointing when you compare it to the Dyson V11 outsize, which offers 60 minutes on its Eco Mode and 19 minutes on the Boost Mode. However, when you consider that the V11 is Dyson’s most expensive model and is almost four times as expensive as the Roidmi S1E, this seems like a fair compromise.",
    "Design: The Roidmi S1E vacuum is only available in white (with grey and blue detailing) but it’s not uncommon for vacuum cleaners to only be available in one color. Sitting at the cheaper end of vacuum cleaners, the S1E doesn’t ooze expense but it has been designed to be really lightweight and make maneuvering easier. The entire vacuum weighs 2.2kg/ 4.8 lbs and is very easy to carry. It’s lighter than the Miele Triflex HX1 - and its brush head swivels round so that you can reach around table legs and anything that’s in your way.",
    "The brush head on the Roidmi S1E has a light on it which will help you see any dust and dirt particles that are tricky to spot otherwise. When you want to tackle other areas in your home, you can simply press a button to unclick the main brush head and stick and slot in another attachment.",
    "A smaller electric mattress brush is one of the attachments and it has been designed to suck up dust mites that can settle on your mattress - although it can still be used on other upholstery too. This brush head doesn’t have a light on it as the main brush head does. There’s also a flexible hose and a brush tool. Some retailers sell this vacuum without the attachments though, so if they are important to you, make sure they’re included in what you’re paying for.",
    "The Roidmi S1E comes with a magnetic wall charging dock so that you can hang up the vacuum when you’ve finished using it. Charging takes around 2.5 hours.",
    "To make sure your floors are as clean as possible, the Roidmi S1E uses a triple filter to collect dust, dirt, pet dander, and allergens - claiming to collect 99% of these in the process.",
    "In our tests, we found the Roidmi S1E is lacking a bit when you’re trying to deep clean carpets. Some of the best robot vacuums have stronger suction power, so if you want to make life even easier, consider one of those instead.",
    "Sound: The S1E produces noise that’s 83 decibels (on a par with a traditional alarm clock sounding) when it’s operating. That’s quite loud for a vacuum as you’d expect most to operate around 75 decibels, however, we found the noise had a softer tone which wasn’t too disruptive. Compared to other cordless models, this is still loud though as the Miele Triflex we mentioned earlier reaches a maximum of 70 decibels, for example.",
    "Reviews: The Roidmi S1E scores an average of 3.9 out of five stars on Amazon (UK version). 55% of reviews are five-stars and mention how light the vacuum is and how easy it is to maneuver. One user said they ‘used it on and off for over an hour before it [the battery] died’. Some criticisms include that the dust bin on this vacuum is ‘tiny’ and has to be emptied mid-clean. Some users also found that the S1E didn’t work as well on its standard mode and only the powerful suction option was suitable for cleaning properly. Some users were disappointed that this vacuum didn’t come with all the attachments as standard from some retailers.",
    "Conclusion: The Roidmi S1E is a good choice if you want a lightweight vacuum that won’t cost you the earth. Its brush head is flexible and helps you reach into tight spaces and the triple filter does a good job of collecting dust and allergens. What lets the S1E down is the short battery life and the small dust bin, so if you have lots of rooms to vacuum at once, you’ll be better off with an alternative option. Check out the best cordless vacuum cleaners for a range of models that we’ve tested."
  ],
  "headers": {
    "6": "Roidmi S1E: everything you need to know"
  },
  "links": {
    "best vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners",
    "Dyson V11 outsize": "https://www.techradar.com/reviews/dyson-v11-outsize",
    "Miele Triflex HX1": "https://www.techradar.com/reviews/miele-triflex-hx1-cat-and-dog-review",
    "best robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "best cordless vacuum cleaners": "https://www.techradar.com/news/best-cordless-vacuum-cleaner"
  }
}