{
  "source": "https://www.techradar.com/news/apple-discontinues-the-homepod-goes-all-in-on-the-homepod-mini-instead",
  "title": "Apple discontinues the HomePod, goes all in on the HomePod Mini instead",
  "category": "smart-home",
  "updated": "2021-03-13T12:30:46Z",
  "author": "david-nield",
  "summary": "The end of the HomePod road",
  "article": [
    "Having first gone on sale at the start of 2018, the Apple HomePod smart speaker is now being discontinued, it's been confirmed – with Apple turning all of its attention to the smaller (and cheaper) HomePod Mini instead.",
    "After the space gray HomePod was noted to be out of stock in the US, Apple confirmed to TechCrunch that the model was being discontinued. Once stocks have been exhausted, that will be that for the original Siri-controlled speaker.",
    "\"HomePod Mini has been a hit since its debut last fall, offering customers amazing sound, an intelligent assistant, and smart home control all for just $99. We are focusing our efforts on HomePod Mini,\" Apple said in a statement to TechCrunch.",
    "Apple also confirmed that it would continue to offer software updates, service and support for the original HomePod, so if you've bought one it's not suddenly going to turn into a really nicely designed paperweight anytime soon.",
    "While Apple didn't go into any great detail about why the HomePod's run is now over, presumably sales of the Mini model were so much stronger that it didn't make much sense to keep on making the larger and more expensive model.",
    "Rivals such as Google and Amazon also make smart speakers in two main sizes: small and a bit bigger. Judging from Apple's move, customers would rather pay less for something that's smaller and that offers slightly less oomph in the audio department: if you're mainly using it as a smart speaker rather than a music player, it's the obvious choice.",
    "That said, last September Google launched the Nest Audio, a bigger and better-sounding speaker to go alongside the Nest Mini, while in the same month we got new versions of both the Amazon Echo and the Amazon Echo Dot – so it would seem there is still a market for the more advanced and more expensive models.",
    "Something we haven't seen from Apple yet is a smart display like the Amazon Echo Show or the Google Nest Hub. We'll have to wait and see whether one shows up in the future, but for now its smart speaker range is now made up of just one model."
  ],
  "headers": {
    "4": "Peak smart speaker"
  },
  "links": {
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "HomePod Mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "TechCrunch": "https://techcrunch.com/2021/03/12/apple-discontinues-original-homepod-will-focus-on-mini/",
    "Nest Audio": "https://www.techradar.com/reviews/google-nest-audio",
    "Nest Mini": "https://www.techradar.com/reviews/google-nest-mini",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Amazon Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Amazon Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Google Nest Hub": "https://www.techradar.com/reviews/google-nest-hub-max"
  }
}