{
  "source": "https://www.techradar.com/news/apple-apologizes-for-slow-reply-to-ios-15-zero-days",
  "title": "Apple apologizes for slow reply to iOS 15 zero-days",
  "category": "computing",
  "updated": "2021-09-28T15:15:39Z",
  "author": "mayank-sharma",
  "summary": "Looks more like a face-saving exercise, researchers say",
  "article": [
    "Apple has apparently apologized to the cybersecurity researcher who recently shared three iOS zero-day vulnerabilities, after being let down by the lethargy of Apple’s bug bounty initiative.",
    "According to the researcher, who has been identified as Denis Tokarev by Motherboard, the three vulnerabilities have made their way into the recently released iOS 15 update as well, even though he had reported them to Apple months before.",
    "After Tokarev published details about the vulnerabilities, along with proof-of-concept exploits, Apple has reached out to assure him that they are still in their ToDo list.",
    "\"We saw your blog post regarding this issue and your other reports. We apologize for the delay in responding to you,\" an Apple employee wrote in an email Tokarev shared with Motherboard.",
    "In their email Apple claims that they are still investigating the issues and how best to address them, before issuing a boilerplate greeting thanking Tokarev for reporting them.",
    "\"While I’m glad Apple appears to be taking this particular situation more seriously now, it comes across as more of a reaction to bad press than anything else,\" security researcher Nicholas Ptacek told Motherboard.",
    "Tokarev has admitted that the vulnerabilities aren’t exactly critical, and were only shared to highlight the frustrations of working with the bug bounty program of such a valuable company.",
    "Apple’s apparent red tapism was further underlined by the fact that while it took months for the company to even acknowledge the issues, another developer claimed to have fixed them all, barely a day after Tokarev shared them publicly.",
    "Via Motherboard"
  ],
  "headers": {
    "4": "Avoiding bad press"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "recently shared": "https://www.techradar.com/news/another-disgruntled-analyst-discloses-zero-day-ios-15-bugs",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "claimed to have fixed": "https://www.reddit.com/r/jailbreak/comments/pvaztb/free_release_entitlementfix_workaround_for_the_3/",
    "Motherboard": "https://www.vice.com/en/article/g5gan4/apple-still-investigating-unpatched-and-public-iphone-vulnerabilities"
  }
}