{
  "source": "https://www.techradar.com/news/new-flagship-nokia-phone-could-before-november-11",
  "title": "New flagship Nokia phone could land before November 11",
  "category": "phones",
  "updated": "2021-07-06T09:28:42Z",
  "author": "james-rogerson",
  "summary": "Name unknown",
  "article": [
    "We can barely remember a time when we weren’t waiting for a successor to the Nokia 9 PureView, but that wait might finally almost be over, as a report suggests the company’s next flagship (possibly called the Nokia 10) will land before November 11.",
    "That’s according to IT Home (a Chinese technology site), which claims to have heard this from an executive at HMD Global (the company that makes Nokia phones). So that’s pretty close to an official confirmation.",
    "That November 11 date makes sense too, as it’s a huge shopping day in China, and the company would understandably want the phone on the shelves before then.",
    "That said, this still leaves us with a lot of questions, not least what this flagship will actually be called. Nokia 9.2, Nokia 9.3 and Nokia 10 have all been put forward at various points, with the most recent leaks pointing to the Nokia X60 or perhaps the Nokia X60 Pro.",
    "Saying that it will land before November 11 also gives around a four month window for the phone to launch in, so we’re still not very clear on the release date, and with that release seemingly being focused on a Chinese shopping day, it’s possible that the launch will initially just be for China.",
    "Hopefully we’re not waiting too much longer to get the Nokia 10 – or whatever it’s called – in the rest of the world though, as rumors point to a penta-lens camera, a 108MP or possibly even 200MP primary sensor, a 6,000mAh battery and a 144Hz refresh rate. So if that all pans out then this could be one of the most exciting handsets of the year.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "What's it even called?"
  },
  "links": {
    "Nokia 9 PureView": "https://www.techradar.com/reviews/nokia-9-pureview",
    "Nokia 10": "https://www.techradar.com/news/nokia-10",
    "IT Home": "https://www.ithome.com/0/560/885.htm",
    "the Nokia X60": "https://www.techradar.com/news/is-nokia-looking-to-ditch-android-for-huaweis-harmonyos",
    "a penta-lens camera": "https://www.techradar.com/news/nokias-next-premium-phone-could-have-a-108mp-camera-and-launch-on-april-8",
    "Phone Arena": "https://www.phonearena.com/news/nokia-5g-android-flagship-smartphone-coming-soon-november-11_id133362"
  }
}