{
  "source": "https://www.techradar.com/news/carl-peis-nothing-oneplus-co-founder-teases-wireless-earbuds-and-smart-home-devices",
  "title": "Carl Pei's Nothing: OnePlus co-founder teases wireless earbuds and smart home devices",
  "category": "audio-visual",
  "updated": "2021-02-10T10:02:21Z",
  "author": "jitendra-soni",
  "summary": "In-ear headphones and smart home devices are in the pipeline",
  "article": [
    "Pei Yu or Carl Pei, as he is popularly known outside China, left OnePlus almost a year ago. Since then he's constantly been making news, before recently announcing Nothing as his new company – and now, we know the company is planning to make wireless earbuds like the Apple AirPods and the Sony WF-1000XM3.",
    "The company has already raised $22 million in investment, out of which $15 million came from Google Ventures. Interestingly, all he has revealed until now is that, after his amicable departure from the Chinese smartphone brand OnePlus, he will focus on audio products, primarily.",
    "Now Pei has provided a few more hints around the company’s plans. In an interview with Bloomberg, Pei said that the company will start with simpler products like wireless earbuds.",
    "The London-based startup has bigger plans with Pei stating that, “we’re building an ecosystem of smart devices.” He further added, “we’re going to have multiple products throughout the year, not just audio products, and eventually we want to build it so these devices talk to each other.”",
    "Google's investment in Nothing could be an indication that its smart home devices will work with it's own suite of Google Nest smart speakers and smart displays. These smart devices form a major share of Google’s hardware business that has not seen as much success as it does with its Pixel phones.",
    "With its first product set to be a pair of true wireless earbuds, Nothing may just be playing it safe at this early stage. The wireless earbuds market is thriving, and it's projected to keep growing rapidly over the next few years.",
    "OnePlus, the company that Pei founded, has its own range of wireless earbuds, including the fantastic OnePlus Bullets Wireless 2. However, this doesn't mean that Nothing's wireless earbuds will be a carbon copy of the company's in-ear headphones.",
    "In an interview with The Verge, Pei said that “Nothing won't just re-label somebody else's products,” though he conceded that there may be some similarities. “There's a reason why a lot of products on the market look quite similar. It's because they share a lot of the same components and the same building blocks”.",
    "These could well be perceived as remarks about his ex-employers, though there is also a parallel perception that Carl Pei could continue the OnePlus connection – and the new company's entry into the high-demand hearing accessories market could well reinforce this perception.",
    "At this stage, we can only guess as to what Nothing's first wireless earbuds might be like, but the one thing we know for sure is that Carl Pei has a knack for building hype around new products. In any case, we can't wait to see what Nothing brings to the table."
  ],
  "headers": {
    "6": "The OnePlus connection"
  },
  "links": {
    "left OnePlus almost a year ago": "https://www.techradar.com/news/carl-pei-quits-oneplus",
    "announcing Nothing": "https://www.techradar.com/news/carl-peis-nothing-oneplus-co-founder-teases-wireless-earbuds-and-smart-home-devices",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "came from Google Ventures": "https://www.techradar.com/news/carl-peis-nothing-raises-dollar15-million-from-alphabets-gv",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-02-09/alphabet-s-vc-arm-backs-oneplus-co-founder-s-nothing-company",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "Pixel phones": "https://www.techradar.com/news/best-pixel-phones",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "OnePlus Bullets Wireless 2": "https://www.techradar.com/reviews/oneplus-bullets-wireless-2-review",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "The Verge": "https://www.theverge.com/2021/1/27/22250653/nothing-brand-oneplus-carl-pei-announcement-consumer-technology-smart-devices"
  }
}