{
  "source": "https://www.techradar.com/news/cruella-is-the-best-disney-movie-reboot-for-years",
  "title": "Cruella is the best Disney movie reboot in years",
  "category": "entertainment",
  "updated": "2021-06-03T18:03:09Z",
  "author": "henry-st-leger",
  "summary": "A premake that does the cartoon classic justice",
  "article": [
    "First things first: Cruella has no business being as good as it is. It’s a testament to the imaginative backstory that the Disney team concocted for one of the most cackling, dastardly villains in its back catalogue, and the excellent performances from its leads, that Cruella is such an enjoyable watch on Disney Plus (if you're prepared to pay extra for it).",
    "Cruella takes place long before the events of One Hundred and One Dalmatians, the 1961 animated classic based on the Dodie Smith novel of the same name, in which the fashion-conscious Cruella de Vil schemes to kidnap a litter of Dalmations in order to make a fabulous (if unethical) coat.",
    "This prequel fudges timelines a little and sets Cruella’s origin story in the 1970s, at the height of the punk fashion movement, with a young Cruella – or Estella, to start – thieving her way through 1970s London with the help of two criminal acquaintances, Jasper and Horace, and their pickpocketing puppies.",
    "It’s not long into the film’s runtime, though, that Estella (played by Emma Stone, of La La Land and The Favourite fame) gets her chance at her true calling: designing dresses for an established fashion house run by the haughty Baroness von Hellman.",
    "The ‘70s setting is a masterstroke, allowing the film’s costume department to run utterly wild, as ballroom couture clashes with grunge and punk, and gowns mix with chains and leather. A series of increasingly outlandish dresses lead towards the final showdown between Estella and Baroness. (There’s not much exploration of the political background to the punk movement, other than a vague sense of rebellion against the powers that be, but this is a Disney movie after all.)",
    "There’s a heist-like thrill to many of the film’s sequences, which are all the more entertaining for taking place in fashion shows and across catwalks – it's like a mashup of Ocean’s 8 and The Devil Wears Prada.",
    "While Cruella isn’t quite live-action in the sense of a Marvel movie punch-up, it settles comfortably into choreographed chaos, whether exterminators are falling into cakes or vans are crashing into police stations. The action here is messy, uncontrolled, and thoroughly enjoyable.",
    "It’s hard to stress how perfect the casting is for this movie too. Emma Stone is in excellent form here, with all the sharp comedic timing, scowls and grimaces, and convincing self-absorption to turn a 2D villain into a vibrant, unpredictable force. While Stone is clearly comfortable being silly, her emotional range is one of the film’s great strengths, veering into tragedy as the weight of her actions flickers across her face, before settling back into the controlled veneer of a villain with much to do.",
    "But the real magic is in the tussle between Stone’s Cruella and the Baroness, played with indulgent narcissism by Emma Thompson – so much so that Disney could have subtitled this film ‘Emma vs Emma’.",
    "Their verbal sparring is a highlight of the movie, allowing them to take center stage while some of the foreshadowing for One Hundred and One Dalmatians occurs in the background – in the form of Cruella’s schoolfriend Anita Darling (Kirby Howell-Baptiste, of The Good Place and Killing Eve fame) and the hapless Roger (Kayvan Novak, of Four Lions and Fonejacker), or the Dalmations that make their way into their care.",
    "The supporting cast aren’t always as gripping to watch, with some hammy, exaggerated caricatures that can’t match the precision of the film’s lead performances. Others, though, like Joey Akubeze’s bewildered security guard, or Joel Fry’s grounded take on the criminal Jasper, act as strong palate cleansers between the more outrageous plot points of the film.",
    "Disney’s live-action remakes don’t always get good press. While they serve as perfectly fine entry points for those coming to the franchises anew, those of us who grew up watching the cartoon classics can’t help but mourn the lack of creativity that goes into these re-releases, often resulting in shot-for-shot remakes burdened with expectations of hyper-realistic CGI (The Lion King, we’re looking at you).",
    "Last year’s Mulan remake, too, lost the charm and fun of the original by eschewing its musical interludes – and the necessary character development that happened within them.",
    "Cruella is truly notable as a ‘premake’ that does a notorious Disney villain justice, while coming packed with fresh and outlandish ideas to prevent it feeling like a box-ticking origin story – aside from the requisite explanation of how Cruella de Vil got her surname, as we saw in the Han Solo spin-off Star Wars movie.",
    "With tentative rumors of a Cruella TV show off the back of the Disney Plus movie, there are plenty of places that this premake could lead. As Cruella herself says, “I’ve got a few ideas…”",
    "Cruella is currently streaming on Disney Plus with Premiere Access for $29.99 / £19.99 / AU$34.99 – and is expected to land for all subscribers later in the year."
  ],
  "headers": {
    "4": "You got the punk",
    "11": "Cruella de Vil, Cruella de Vil..."
  },
  "links": {
    "Star Wars movie": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "tentative rumors of a Cruella TV show": "https://insidethemagic.net/2021/06/cruella-horace-jasper-spinoff-kc1/"
  }
}