{
  "source": "https://www.techradar.com/news/what-time-is-the-suicide-squad-released-on-hbo-max",
  "title": "What time is The Suicide Squad released on HBO Max today?",
  "category": "entertainment",
  "updated": "2021-08-06T09:08:32Z",
  "author": "samuel-roberts",
  "summary": "Here's when you can watch The Suicide Squad on the streamer today",
  "article": [
    "Wondering what time The Suicide Squad on HBO Max today? The Suicide Squad releases on HBO Max (exclusively for those subscribed to the $14.99 ad-free tier) on Thursday, August 5 – and you can watch it this evening in the US. Just scroll down a little for exact times.",
    "This is one of the most hotly anticipated day-and-date movie releases landing on Warner's streaming service in 2021, and it's the first entry in the DC Extended Universe since 2020's Birds of Prey. Coming from James Gunn, the director of Guardians of the Galaxy, The Suicide Squad sees the world's most dangerous and ridiculous supervillains being set to the island of Corto Maltese on a mission to destroy a significant target – and as the name of the movie suggests, not everyone is coming out of this adventure alive.",
    "Returning characters from the original movie include Amanda Waller (Viola Davis), Harley Quinn (Margot Robbie) and Rick Flag (Joel Kinnaman). But they're joined by a new, vast supporting cast of obscure faces from DC Comics history – including Bloodsport (Idris Elba), Peacemaker (John Cena), King Shark (Sylvester Stallone), and The Thinker (Peter Capaldi).",
    "Since the movie has been released in theaters outside the US already, we'd advise staying off social media until you've seen it in case any of its bigger surprises get spoiled for you. Here's when you can watch The Suicide Squad where you are.",
    "The Suicide Squad will be released on HBO Max on Thursday, August 5 at 4PM PT/7PM ET, which a spokesperson has confirmed to us. Those are actually pretty sociable hours for a new release on a streaming service – so US subscribers will be able to enjoy watching the movie during the evening this week.",
    "Remember, you can only watch The Suicide Squad on HBO Max's ad-free plan – the $14.99 monthly tier. It'll be available for 31 days, before disappearing from the service.",
    "If you'd prefer to see the movie on the big screen, you have that option this weekend too. The Suicide Squad also releases theatrically in the US starting on August 5 – so you've got the choice of how you enjoy it over the next few days.",
    "If you weren't a fan of the original Suicide Squad and you're worried this will be more of the same, don't be – we described it as \"refreshingly ridiculous\" in our review of the movie. It's worth a watch, even if you're just casually acquainted with the villains of the DC Universe. Gunn puts his distinctive stamp on this world, and has made something that's much closer to what we wanted from the original 2016 movie."
  ],
  "headers": {
    "4": "What time is The Suicide Squad released on HBO Max?",
    "6": "The Suicide Squad is also available in theaters",
    "7": "Check out our review of The Suicide Squad"
  },
  "links": {
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-3414805865033527300&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhat-time-is-the-suicide-squad-released-on-hbo-max",
    "DC Extended Universe": "https://www.techradar.com/how-to/how-to-watch-the-dceu-movies-in-order",
    "Birds of Prey": "https://www.techradar.com/reviews/birds-of-prey",
    "review": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good"
  }
}