{
  "source": "https://www.techradar.com/news/new-oculus-vr-headset-officially-teased-at-facebook-connect-2021",
  "title": "It's official: we're getting a new Oculus VR headset – but it's not the Quest 3",
  "category": "vr",
  "updated": "2021-10-28T20:16:55Z",
  "author": "axel-metz",
  "summary": "It's called Project Cambria",
  "article": [
    "Mark Zuckerberg finally lifted the lid on Oculus' next VR headset at Facebook Connect 2021 – and it's called Project Cambria.",
    "Coming at some point next year, Project Cambria isn't a Quest device (so neither the Oculus Quest 3 nor a direct successor to the Oculus Quest 2), but will be compatible with Quest devices, so says the company.",
    "It will arrive as part of Facebook's push to introduce multiple new mixed reality products \"advancing the state of the art\" in years to come.",
    "Details about Project Cambria are few and far between at this point – we only caught a brief glimpse of the product itself in a short teaser video – but Zuckerberg confirmed that it'll boast cutting-edge features that Facebook can’t yet include in its existing Oculus Quest lineup.",
    "As such, it'll be priced at the higher end of the VR hardware spectrum, though the company hasn't disclosed specific figures on that front.",
    "In terms of what those cutting-edge features will be, we know Project Cambria will be capable of real-time face and eye tracking, and sport cameras that pass high-resolution video to its internal screens.",
    "This technology will allow the headset to reflect people's facial emotions in avatars – in keeping with the company's new push towards a 'metaverse' – and also permit Project Cambria a much slimmer form factor compared to even the best VR headsets on the market right now.",
    "Elsewhere at the event, Facebook announced that it's officially changing its name to Meta.",
    "It's not yet clear whether this mysterious Project Cambria is in fact the long-rumored 'Oculus Pro' headset, but judging by the similarities between recent leaked information surrounding a new Oculus headset and what was shown at Facebook Connect, we're fairly confident that it is.",
    "Dubbed a showcase for 'Seacliff firmware,' the above video seems to include a device similar in design to Project Cambria, one being used to try on different outfits for a player's avatar.",
    "Given the general push towards the increased use of avatars in the company's ambitious 'metaverse' project at Facebook Connect, too, we're confident that this video – leaked in advance of the event but not actually shown – is indeed making reference to Project Cambria.",
    "We'll have to wait for more details on the company's brand new VR headset, but it's clear that Facebook's unexpectedly-named Project Cambria aims to push the boundaries for mixed reality technology."
  ],
  "headers": {
    "8": "Analysis: Is this the 'Oculus Pro'?"
  },
  "links": {
    "Facebook Connect 2021": "https://www.techradar.com/how-to/how-to-watch-facebook-connect-and-what-we-want-to-see-at-the-oculus-event",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "push towards a 'metaverse'": "https://www.techradar.com/news/facebooks-whole-metaverse-thing-its-simply-ridiculous-and-we-have-questions",
    "best VR headsets": "https://www.techradar.com/news/the-best-vr-headset",
    "officially changing its name to Meta": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
    "leaked information": "https://www.techradar.com/news/new-oculus-quest-vr-leaks-ahead-of-this-weeks-facebook-connect"
  }
}