{
  "source": "https://www.techradar.com/news/far-cry-6-dlc-might-bring-back-fan-favorite-villains",
  "title": "Far Cry 6 DLC will bring back fan-favorite villains",
  "category": "gaming",
  "updated": "2021-06-12T21:03:17Z",
  "author": "adam-vjestica",
  "summary": "Ubisoft is bringing back its bad guys",
  "article": [
    "Far Cry 6 players will have more than just Anton Castillo to contend with, thanks to the game’s post-release content.",
    "As part of the game's Season Pass, players can look forward to welcoming back Vaas Montenegro from Far Cry 3, Pagan Min from Far Cry 4 and Joseph Seed from Far Cry 5) as playable characters.",
    "The footage shows that the content will take place from the perspective of a dream sequence, as you step into the shoes of the three dangerous individuals. What sort of sinister things you'll get up to, though, remains to be seen.",
    "You can watch the rather trippy trailer below:",
    "Ubisoft also showed off more of Far Cry 6’s villain, Anton Castillo, at its Ubisoft Forward event. Played by Breaking Bad’s Giancarlo Esposito, Castillo is “a hero”, according to Esposito, which players might find surprising.",
    "Speaking to Geoff Keighley at Summer Game Fest, Esposito said: “No, I’m not a villain. This guy loves his country. He wants to empower you to stand up and speak your truth.",
    "\"There is good and bad about all people, but this guy, out of his love and passion for his people, even if they're faceless to him at certain points in time, allow him to be an absolute hero.\"",
    "Ubisoft Forward, which took place on June 12, showcased some world premieres, such as a gameplay trailer for Rainbow Six Extraction and the announcement of Mario + Rabbids Sparks of Hope. Ubisoft also provided updates on Apple TV Plus series, Mythic Quest, and the soon-to-release movie Werewolves Within.",
    "Far Cry 6 will be released on October 7, 2021 for PS5, PS4, Xbox Series X/S, PC and Stadia."
  ],
  "headers": {
    "7": "What happened at Ubisoft Forward?"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "a hero": "https://www.techradar.com/news/far-cry-6-villain-is-a-hero-says-giancarlo-esposito",
    "Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know",
    "Ubisoft Forward": "https://www.techradar.com/news/how-to-watch-the-ubisoft-forward-livestream",
    "Rainbow Six Extraction": "https://www.techradar.com/news/rainbow-six-extraction",
    "Mario + Rabbids Sparks of Hope": "https://www.techradar.com/news/ubisoft-and-nintendo-are-teaming-up-for-another-mario-rabbids-game",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}