{
  "source": "https://www.techradar.com/news/resident-evil-village-proves-the-series-is-correctly-headed-into-the-unknown",
  "title": "Resident Evil Village proves the series is correctly headed into the unknown",
  "category": "gaming",
  "updated": "2021-05-21T11:00:47Z",
  "author": "samuel-tolbert",
  "summary": "Opinion: changing things up is the right path forward",
  "article": [
    "Resident Evil Village might be my favorite game in the franchise.",
    "Those are bold words and there's the obvious human nature of recency bias to fight, so I won't be able to be sure for a while yet. But that's definitely my feeling right now though.",
    "I've played through multiple times already, with more to come. It's one of the rare games that I find myself thinking about constantly even when I'm not playing it. A lot of that comes back to how well-designed the game is, taking the strong pacing of Resident Evil 4 and marrying it to the tense, first-person horror of Resident Evil 7: Biohazard.",
    "The setting has a lot to do with that, no question, as the Gothic overtone smartly evolves into different iconic bits of horror. From the castle of the iconic Lady Dimitrescu to the Silent Hill-esque house of Beneviento, from the waterfront of Moreau to the mechanical factory of Heisenberg, it makes each section of the game a love letter of sorts to Dracula, Creature from the Black Lagoon, Frankenstein and more. There's no doubt Resident Evil 9 will opt for a new settings but regardless of where the series goes, it can't turn back from the foundation laid by Resident Evil Village.",
    "I really don't think I'm alone in this excitement either. Things are still early but so far, this seems to have paid off commercially as a sales success, with Capcom sharing that over 3 million copies of the game have been shipped less than a week after its release. The predecessor to Village, Resident Evil 7: Biohazard, has crossed 9 million copies shipped in three years.",
    "Between the sales and overall positive reviews, it's clear that the crowd buying horror games are interested in these kinds of fresh ideas. Resident Evil 7 reinvented the series with a first-person perspective and ditched the city streets for a rural, Southern Gothic grindhouse presentation. Still, the DNA remained Resident Evil, which meant managing different items and fighting off horrific creatures while solving puzzles. Resident Evil Village only doubled down on this, keeping tight pacing and laying more bricks on the building blocks of the prior game.",
    "I previously argued pre-launch that the franchise has grown beyond the days of shuffling zombies and sterile labs. With Resident Evil Village, I feel confident saying I was correct. Certainly, I don't envy Capcom figuring out how to do drastically different bosses, enemies and locations for the next go-around but it's clearly working.",
    "If I had to sum how I and many other players think of Resident Evil Village in a single word, I'd say \"personality.\" Memes and thirst aside, Lady Dimitrescu has far more personality than the majority of villainous characters I can think of over the past couple of years. You remember when she's stalking you throughout the castle, or the subtle ways her arguments with the other Lords reveal what's coming in the plot.",
    "The locations have personality, with the titular Village opening up at the correct pace, hiding secrets around every corner and encouraging players to backtrack and find all the hidden weapons, treasures and other secrets.",
    "There's a contingent of players who want the third-person perspective of the recent remakes to continue, and it's seems like they'll also be catered to in the near future. Rumors and leaks indicate Resident Evil 4 Remake is happening at some point in the next couple of years, which should easily ensure everyone remains satisfied.",
    "For the mainline games however, it's proven to me that strange, interesting new settings are the way to go. There's a lot of wild stuff implied by the ending of Resident Evil Village, but regardless of who the player character(s) end up being, I'm excited to see what Capcom has up its sleeve."
  ],
  "headers": {
    "4": "Building something players will remember"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Lady Dimitrescu": "https://www.techradar.com/news/lady-dimistrecu-explained-what-to-know-about-resident-evil-villages-mistress",
    "3 million copies": "https://www.windowscentral.com/resident-evil-village-ships-over-3-million-copies",
    "previously argued": "https://www.techradar.com/news/resident-evil-village-is-allowing-the-franchise-to-explore-the-bizarre"
  }
}