{
  "source": "https://www.techradar.com/news/linux-511-could-arrive-next-week-as-linus-torvalds-slams-the-superbowl",
  "title": "Linux 5.11 could arrive next week, as Linus Torvalds slams the Superbowl",
  "category": "computing",
  "updated": "2021-02-08T15:10:06Z",
  "author": "mayank-sharma",
  "summary": "The new kernel that could end up in Ubuntu 21.04 might drop next week",
  "article": [
    "As he announced the latest update of the Linux 5.11 release, Linus Torvalds, the head-honcho of the Linux kernel, took a swipe at the Superbowl.",
    "In his characteristic style, Torvalds called the annual championship game of the National Football League a juiced up version of the kids egg-and-spoon race, while expressing his inability to wrap his head around its rules despite being in the U.S. for over two decades.",
    "“So it's the biggest sporting day of the year here in the US, when everybody is getting ready to watch the yearly top TV commercials, occasionally interrupted by some odd handegg carrying competition that I still haven't figured out the rules for after twenty-odd years here. It's kind of a more violent and hands-on team-oriented version of the traditional egg-and-spoon race, and involves a lot of standing around, apparently waiting for the next commercial to come on,” wrote Torvalds.",
    "As he issued the seventh release candidate of the 5.11 series, Torvalds noted that there’s “nothing hugely scary” in this release, adding that documentation and self-tests make up about a quarter of the recent additions.",
    "He also hinted that this could be the last developmental release of the 5.11 series, “unless some surprise comes along and makes a travesty of our carefully laid plans,” wrote Torvalds.",
    "If all goes well, Torvalds could announce a new version of the Linux kernel next week, which could end up being used in the upcoming Ubuntu 21.04 release.",
    "“Go forth and test,” he concluded, adding “unless you're glued to the TV, of course.”"
  ],
  "headers": {
    "3": "Times we live in"
  },
  "links": {
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Linus Torvalds": "https://www.techradar.com/news/linus-torvalds-slamshimself-over-latest-linux-build",
    "Torvalds noted": "http://lkml.iu.edu/hypermail/linux/kernel/2102.0/08975.html",
    "Ubuntu 21.04 release": "https://www.techradar.com/news/ubuntu-2104-will-finally-fix-this-long-time-security-concern"
  }
}