{
  "source": "https://www.techradar.com/news/ring-floodlight-cam-wired-pro",
  "title": "Ring Floodlight Cam Wired Pro price, release date and everything you should know",
  "category": "smart-home",
  "updated": "2021-05-19T08:09:03Z",
  "author": "carrie-ann-skinner",
  "summary": "Just exactly how does the Ring Floodlight Cam Wired Pro improve on the current Ring Floodlight Cam?",
  "article": [
    "Ring’s latest security camera, the Ring Floodlight Cam Wired Pro, has a new-look compared to its predecessor, the Ring Floodlight Cam, and has also comes with some new handy features that aims to reduce unwanted motions alerts, as the brand continues its bid to become the name on everyone’s lips when it comes home security cameras.",
    "As before the security camera is capable of detecting motion up to 30ft away from the camera and triggering the floodlights to illuminate, hopefully scaring away any intruders. However, now with the Ring Floodlight Wired Pro, a built-in radar will ensure you’re only alerted about motion when the activity happens past a specified threshold (3D Motion).",
    "This means you’ll get less unwanted alerts about motion caused by things such as birds, the wind or even a passer-by on the pavement. So is this the key feature that makes the Floodlight Wired Pro the best home security camera?",
    "The 3D Motion feature is already available on the recently launched Ring Video Doorbell Pro 2, but this is the first time it’s been available on an outdoor security camera.",
    "The Ring Floodlight Cam Wired Pro costs $249 / £219 / AU$379, which is cheaper than its predecessor in some territories. The Ring Floodlight Cam was priced at $249 / £249.99 / AU$399 when it launched. However Ring has now reduced the price of the Ring Floodlight Cam to $199.99 / £179/ AU$299",
    "Can't wait for the Ring Floodlight Cam Wired Pro to arrive? Then check out the best prices for other Ring security cameras below:",
    "The Ring Floodlight Cam Wired Pro is available to pre-order in the US now, and will ship at the start of June. In Australia, the Ring Floodlight Cam Wired Pro will go on sale on June 10, while UK availability is still to be confirmed. We’ll update this article when we have more detailed information.",
    "The Ring Floodlight Cam Wired Pro has given a stylish redesign, compared to its predecessor. Gone are the circular floodlights with a ridged casing, in favor of oval-shaped LEDS capable of 1,000 lumens each (this is almost three times the brightness of the average side lamp) encased in a smooth plastic exterior.",
    "The body of the floodlight has also been made more compact, but it still comes in both black and white. Ring says the floodlights are adjustable but hasn’t gone into further detail.",
    "We hope that adjustable means the brightness of the floodlights can be adjusted in the app, just like the rival Arlo Pro 3 Floodlight camera.",
    "The Ring Floodlight Cam Wired Pro is mains powered, although Ring says “the installation must be done according to local electrical regulations” so it’s worth considering whether you can reach this standard if installing it yourself.",
    "The camera has a 140-degree field of view and records Full HD footage during the day, and - if you have the floodlights set to illuminate when motion is detected - at night too.",
    "On top of this, it also boasts a microphone array, rather than one single microphone, which Ring says provides clear, crisp audio when using the two-way talk feature to converse with anyone in the camera’s field of view.",
    "It also comes with a 110db (at a 10cm distance) siren, which is as loud as listening to a live rock concert, that can be manually or automatically triggered.",
    "Finally, the Ring Floodlight Cam Wired Pro supports both 2.4GHz and 5GHz Wi-Fi, rather than just 2.4GHz.",
    "Having two different Wi-Fi frequencies ensures the security camera can create a stable connection with a variety of routers, which should put an end to connection issues that have plagued some users, in particular those with slower broadband.",
    "The main upgrade in the Ring Floodlight Cam Wired Pro is the addition of a built-in radar. As we’ve mentioned already this radar enables 3D Motion and Bird's Eye view - two handy features designed to reduce unwanted activity alerts and provide a better understanding of what triggered the activity alert.",
    "3D Motion allows you to set a specific threshold, and the camera will only alert you and start recording when the radar senses that a person or object has passed the threshold.",
    "Meanwhile, the ‘Bird’s Eye View’ feature uses the radar to plot the exact path the object or person took on an aerial map, giving you a clear understanding of why the activity alert was triggered.",
    "On top of this, the security camera has also advanced pre-roll feature, which stores four seconds of color video captured before motion detection was activated.",
    "Also found on the Ring Video Doorbell 4 and the Ring Video Doorbell Wired, it’s worth noting pre-roll video isn’t captured at the same quality as motion videos, with Ring stating it has ‘less than 1080p video capture’ but didn’t define the exact resolution.",
    "However, you will need to subscribe to Ring Protect (from £2.50 / $3 / AU$4 per month) if you want to access these handy new features, as well review footage from the camera for up to 30 days after it was recorded."
  ],
  "headers": {
    "4": "Ring Floodlight Cam Wired Pro price and release date",
    "7": "Ring Floodlight Cam Wired Pro design",
    "16": "Ring Floodlight Cam Wired Pro features"
  },
  "links": {
    "best home security camera": "https://www.techradar.com/news/best-home-security-camera",
    "Ring Video Doorbell Pro 2": "https://www.techradar.com/reviews/ring-video-doorbell-pro-2-review",
    "Arlo Pro 3 Floodlight camera": "https://www.techradar.com/reviews/arlo-pro-3-floodlight",
    "Ring Video Doorbell 4": "https://www.techradar.com/news/ring-video-doorbell-4",
    "Ring Video Doorbell Wired": "https://www.techradar.com/reviews/ring-video-doorbell-wired-review"
  }
}