{
  "source": "https://www.techradar.com/news/accessible-5g-making-it-a-reality",
  "title": "Accessible 5G: Making it a reality",
  "category": "computing",
  "updated": "2021-01-11T11:57:42Z",
  "author": "pascal-lemasson",
  "summary": "How 5G connectivity will accelerate innovation",
  "article": [
    "In 2016, the UN declared that internet access, due to its impact on health, education and work, should be considered a human right. With 5G, the mobile internet has reached the latest stage of its evolution: high-speed, low-latency connectivity with the potential to enrich every aspect of our lives and not just for the few.",
    "5G connectivity will accelerate business innovation from mobile operators and developers to manufacturers, and in doing so, create a more accessible world for consumers. Pascal Lemasson, MediaTek’s AVP and Head of Business Development in Europe, discusses just how this will be achieved.",
    "2020 has seen a rise in 5G-powered smartphones making their way into the world – something that was previously staggered because of premium price tags that meant only a few could truly enjoy the benefits.",
    "According to CCS Insights, we now have around 100 commercial 5G networks and this is set to accelerate as 5G smartphones become more prevalent. A significant factor is that 5G devices are costing less than they did a year ago.",
    "A new wave of 5G capable chipsets with an integrated modem can ensure everyone can benefit from essential 5G connectivity features such as 5G carrier aggregation (2CC 5G-CA), 5G dual SIM dual standby (DSDS) and Voice over New Radio (VoNR). This means consumers can tap into 5G, with higher quality sound and picture quality – making for better video and phone calls – wherever they may be.",
    "These feature benefits are not just limited to the consumer. Research firm, Omdia, expects global 5G enterprise mobile subscriptions to rise from 500,000 in 2019 to 175 million by 2024. As consumer-friendly 5G smartphone devices continue to be used in industries including enterprise and healthcare, more use cases are being realized to share, communicate and collaborate to digitally transform organizations.",
    "By the end of 2020, we are expected to have nearly a quarter of a billion 5G connections worldwide, and that number is going to only triple in 2021 as smartphone manufacturers diversify their portfolio of products.",
    "To make 5G truly accessible to businesses, customers and consumers, we need to improve connectivity for all by eventually converging cellular and satellite networks to provide coverage both on land and via geo-satellite. While 3G and 4G were primarily created to improve mobile services for mobile device users, 5G is expected to support a much wider scope of IoT applications. With more intelligence being packed into smart, connected devices – we’ll need seamless connectivity and coverage.",
    "The hybrid network will enable all types of industries, from education and healthcare to construction and manufacturing, to not only use IoT technology to improve services and efficiencies but remove operational complexities, such as in-building coverage for more remote locations and black spots in connectivity when laying foundations – think basement renovations and housing developments in remote landscapes.",
    "As 5G-enabled smart devices and IoT applications increase, so too will the volume of data transactions between devices in the home: Smartphones, tablets, TVs, voice-assistance, and white goods like refrigerators and smart ovens. The sheer volume of applications transferring data to communicate with each other, for example, using voice assistance to dim the lights and select a film to watch for a night in, will require robust and seamless connectivity for the perfect experience.",
    "For all homes to enjoy the benefits of connected devices, access to 5G routers with support for sub-6GHz frequencies bring a more affordable broadband alternative to areas with limited DSL, cable or fiber services. Having access to super-fast connectivity will be a game-changer for suburban, rural and less developed areas that struggle with access to current wireless services and signals.",
    "Additionally, as low latency-dependent gaming, live streaming and other online applications continue to grow, 5G fixed wireless access (FWA) will gain momentum, particularly as consumers can now self-install compact devices and avoid costly and lengthy installations associated with fixed-line services. Teamed with various dual-band Wi-Fi 6 chipsets, such devices will enable consumers to enjoy distributed and fast 5G internet to a plethora of technology without suffering any lag.",
    "While 5G aims to deliver a multitude of economical and societal benefits, both consumer devices and connectivity need to be accessible to everyone and not just a few. This means removing complexity in adoption and deployment: cost and availability of 5G technologies.",
    "Device manufacturers who proactively partner with chipset providers to understand consumer pain points and provide tangible solutions through intelligent, power-efficient chip technology, at a variety of price points, can only be a step in the right direction."
  ],
  "headers": {
    "2": "5G smartphones for all",
    "7": "Improving connectivity",
    "9": "Powering the connected home"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "5G smartphones": "https://www.techradar.com/best/best-5g-phones",
    "video": "https://www.techradar.com/best/best-video-conferencing-software",
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "tablets": "https://www.techradar.com/news/best-business-tablets",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "wireless": "https://www.techradar.com/best/best-wap"
  }
}