{
  "source": "https://www.techradar.com/news/many-employees-would-take-a-pay-cut-in-exchange-for-better-work-devices",
  "title": "Many employees would take a pay cut in exchange for better work devices",
  "category": "computing",
  "updated": "2021-09-24T11:05:44Z",
  "author": "sead-fadilpasic",
  "summary": "More freedom is needed, report finds",
  "article": [
    "If you’re looking for ways to retain your employees and keep them engaged within the company, you might want to consider allowing them to choose their own devices for work.",
    "A new report from Jamf found that for almost all employees (87%), choosing their own work devices was important. What’s more, of that number, 89% would gladly sacrifice a portion of their salary in exchange.",
    "To uncover these sentiments, Jamf polled 2,000 employees and 500 IT decision-makers, looking to support its belief that during this time of “mass exodus”, businesses could use any and all ways to retain their talent.",
    "“Establishing a choice program with the right technology partners can help employers attract and retain talent, while boosting employee creativity and productivity,” commented Dean Hager, CEO, Jamf. “Giving employees the choice of what technology they work on has incredible value, not only to workers, but to their organizations as well.",
    "It’s not just about retaining talent, Jamf further explains, but also about - attracting it. In the study, it was said that 70% of respondents would be more likely to join a company in which they could choose their own devices. Almost all said an employee-choice program was beneficial for them, reporting increased productivity, positivity, and feeling more valued.",
    "At the same time, 66% of respondents said being forced to use a device that wasn’t to their liking would negatively impact how they felt about the company.",
    "Finally, an employee-choice program would help companies stand out from the masses, as less than half (40%) reported their firms offering such a thing. For ITDMs, however, it would make device management a lot harder, more time-consuming, and more expensive.",
    "Still, for those interested in setting up an employee-choice program should keep in mind that most employees are looking for high-performing devices with plenty of battery life, and up-to-date operating systems."
  ],
  "headers": {
    "4": "Attracting talent"
  },
  "links": {}
}