{
  "source": "https://www.techradar.com/news/microsoft-users-can-now-ditch-their-password-for-good",
  "title": "Microsoft is letting users say goodbye to passwords",
  "category": "computing",
  "updated": "2021-09-19T15:10:21Z",
  "author": "anthony-spadafora",
  "summary": "Your Microsoft account will no longer need a traditional password",
  "article": [
    "Microsoft has announced a significant security policy change that will mean users no longer need to enter traditional passwords to use its services.",
    "The company says it has delivered on a pledge to kill off passwords for good, with users now able to log in to their accounts without needing to remember complicated sign-in details.",
    "According to a blog post from the company, 579 password attacks occur every second, adding up to 18 billion such attacks every year. While you can create strong, complex passwords using a password generator and store them securely using a password manager, many users would prefer to forgo using them entirely and now they can with Microsoft's help.",
    "Interested users can now completely remove the password from their Microsoft accounts. Instead of using a password to sign in to Outlook, OneDrive and the software giant's other apps and services, they can now use the Microsoft Authenticator app, Windows Hello, a security key or a verification code sent to their phone or email.",
    "To get started, users will first need to have the Microsoft Authenticator app installed on their devices and linked to their personal Microsoft account.",
    "From here, you'll need to sign in to your Microsoft account, choose “Advanced Security Options” from the settings menu and under “Additional Security Options”, you'll see “Passwordless account”. This feature needs to be toggled on to proceed to the next step. It's worth noting that you can also enable two-step verification from this menu for additional security.",
    "Once Passwordless account has been toggled on, you'll need to follow the on-screen prompts and then approve the notification from your Authenticator app. However, if you end up deciding that you still want to use a password to access your Microsoft account, you can always add it back.",
    "This feature will be rolled out over the coming weeks so if it's not available yet, wait a bit and check your Microsoft account again."
  ],
  "headers": {
    "4": "Going passwordless"
  },
  "links": {
    "kill off passwords": "https://www.techradar.com/news/microsoft-aims-to-kill-off-passwords-in-2021",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2857783206984266000&xs=1&url=https%3A%2F%2Fwww.microsoft.com%2Fsecurity%2Fblog%2F2021%2F09%2F15%2Fthe-passwordless-future-is-here-for-your-microsoft-account%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-users-can-now-ditch-their-password-for-good",
    "password generator": "https://www.techradar.com/best/password-generator",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "Microsoft Authenticator": "https://www.techradar.com/news/microsoft-authenticator-is-getting-its-own-password-manager",
    "Windows Hello": "https://www.techradar.com/how-to/software/how-to-use-windows-hello-1301455",
    "security key": "https://www.techradar.com/best/best-security-key",
    "Microsoft account": "https://www.techradar.com/how-to/computing/create-a-microsoft-account-1306767",
    "two-step verification": "https://www.techradar.com/news/what-is-2fa"
  }
}