{
  "source": "https://www.techradar.com/news/5-reasons-why-data-backups-are-critical-for-your-website",
  "title": "5 reasons why data backups are critical for your website",
  "category": "computing",
  "updated": "2021-04-30T12:30:31Z",
  "author": "desire-athow",
  "summary": "Site owners should regularly backup their data for safekeeping",
  "article": [
    "Building a website in 2021 is not such a big deal with the right tools and partners. Keeping a website safe in 2021 - now that's a whole different ball game. As individuals and businesses are progressively expanding their online presence - so are the lurking hackers and attackers who want to exploit their data.",
    "So what can we do about it? There are many precautions you can take - system and app firewalls, restricted user access, security plugins.",
    "One thing should always be present in your checklist, though - data backups!",
    "Data Backups are exactly what the name suggests - a copy of a part or your entire online project. This does not only include your website files, but its associated databases, add-ons, themes, and everything you might have stored on your hosting account.",
    "Let's say your site is created with WordPress, the world's most popular content management system (CMS).",
    "WP websites are based on PHP and MySQL. One handles the correlation between files - the other manages the database that stores your essential site information. When backing up your data, you can choose to only archive the files, the database, the media, or the entire content of your account.",
    "Website backups bring about more than a few benefits for webmasters. Here are some of the most notable...",
    "Even though this seems like a no-brainer, a surprising number of site owners seem to neglect the task of regularly backing up their data. Many seem to think that if their project is small and simple enough - they are somehow immune to the online threats that many others suffer from.",
    "Here are the raw facts - data backups can be a real business-saver.",
    "1. Minimize downtime",
    "When browsing websites, no one likes to wait for a page to load. Most will actually never return to the site if that load time exceeds just a few seconds. Imagine being on the other side of that equation - you are a business owner, your site has gone down, and unhappy visitors are leaving, never to come back again. This can be really devastating if you don't have a backup plan...literally, a Backup Plan. If you notice something has gone wrong - you can simply restore a copy of your working website and give yourself enough time to locate the problem.",
    "2. Overcome human errors",
    "As much as we don't like to admit it - we are humans and we all make errors. Even the slightest change to your website may lead to compatibility issues and the whole system going down. You can lose days, even weeks of your work. Avoid making any edits before making a complete site backup to save yourself the headaches from starting over.",
    "The number of websites is exponentially growing, but so are the threats to our cybersecurity. Hackers are getting increasingly inventive when they want to breach physical and virtual servers and sites hosted on them. DDoS attacks, brute force attacks, malware, viruses and spam should always be on the back of a webmaster's mind when building their website. Even if you think your project is not significant enough to attract the attention of pesky hackers - you have to be prepared for the worst.",
    "Website backups can be useful in other ways as well. Creating and managing a testing environment with a copy of your data will allow you to safely make updates and add plugins without compromising your live site. This is especially handy if you're using CMS solutions like WordPress, Joomla, or Magento, which heavily rely on add-ons to optimize the look and feel of your website.",
    "Site owners may decide to switch their web hosting provider for a number of reasons - better price rates, more powerful servers, friendlier support, to name a few. Data backups allow you to simplify that process and save valuable time and effort. Migrating to your new host becomes as easy as moving your backup archives from one location to another.",
    "The simple answer to the question of how often to back up our site data is \"the more - the better\".",
    "When you think about it - you cannot overdo such a good security practice. Sure, you can always argue that data backups take server space, but that's the thing - you don't need hundreds of backups files - just your more recent ones.",
    "What's more, it's never a good idea to keep your site copies on your hosting account. Keeping everything in a safe, offsite location will allow you to have a working version of your website even if a hacker gets control of your server.",
    "Providers like ScalaHosting even go a step further - they employ not only remote servers but entire offsite datacenters for backups alone. This way, even if the extreme happens, like the recent fire incidents at OVH, the host can still supply a working site archive.",
    "We recommend doing your backups daily, even several times a day if you're actively making changes. Keep at least 4-5 restore points so you can avoid the risks of a damaged or corrupted site archive.",
    "Creating a data backup is not such a big deal if your hosting provider supplies you with the right tools.",
    "For example, if your hosting account comes with cPanel, you can just log into the platform, go to Backups and follow the steps in the setup wizard. This includes instructions on the extent of the backup and its destination folder. Depending on the size of your files, the system might take some minutes to complete the operation.",
    "But why do backups yourself when you can leave this to the professionals?",
    "All major hosting providers offer clients a range of free and premium backup solutions. Some are completely automated and others require a little tweaking from the user's side. There are even hosts that include a custom backup tool in their control panel of choice.",
    "Whatever the case - always ensure you have such an option in place and start using it as soon as you begin your online journey.",
    "Hopefully, this guide has given you a better perspective on the importance of data backups and how to best integrate them in your everyday task checklist.",
    "Already have a backup solution? What's your weapon of choice when archiving site content?"
  ],
  "headers": {
    "3": "What are data backups?",
    "7": "Why do you need website backups?",
    "16": "How often should you back up your data?",
    "21": "How can your web host help?",
    "26": "The importance of data backups"
  },
  "links": {
    "firewalls": "https://www.techradar.com/best/firewall",
    "security plugins": "https://www.techradar.com/best/wordpress-security-plugins",
    "data backups": "https://www.techradar.com/best/best-backup-software",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "CMS": "https://www.techradar.com/best/cms",
    "exceeds just a few seconds": "https://www.techradar.com/how-to/20-ways-to-speed-up-a-website",
    "threats to our cybersecurity": "https://www.techradar.com/news/cybersecurity-in-a-5g-post-covid-future",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "ScalaHosting": "https://www.techradar.com/reviews/scalahosting",
    "recent fire incidents at OVH": "https://www.techradar.com/news/ovh-services-still-havent-been-fully-restored-following-fire",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "backup solutions": "https://www.techradar.com/best/best-backup-software"
  }
}