{
  "source": "https://www.techradar.com/news/openwifi-project-adopts-openroaming-standard-for-vision-of-global-wi-fi-network",
  "title": "OpenWiFi project adopts OpenRoaming standard for vision of 'global Wi-Fi network'",
  "category": "phones",
  "updated": "2021-05-10T11:05:34Z",
  "author": "steve-mccaskill",
  "summary": "OpenWiFi wants the world to be one big Wi-Fi network",
  "article": [
    "The Telecom Infra Project’s (TIP) OpenWiFi project has adopted the Wireless Broadband Alliance’s (WBA) OpenRoaming standard, paving the way for users to seamlessly move between hotspots without the need to reconnect or enter security credentials.",
    "OpenWiFi wants to reimagine the way that wireless networks are built and managed by solving the issue of fragmentation.",
    "The idea is that a user will have a common identity that can be used across multiple networks with no additional interaction as handoffs between access points are managed in the same way that mobile operators move subscribers from cell to cell.",
    "The project will leverage open-source development and automated testing so that Wi-Fi providers can use equipment and software, such as cloud controllers and smart analytics, from multiple vendors, safe in the knowledge that they will be compatible.",
    "“WBA OpenRoaming is a strong complement to OpenWiFi as both projects are designed to remove barriers to connectivity,” said Tiago Rodrigues, WBA CEO. “The WBA and TIP are both envisioning a world, hopefully not too far away, where digital connectivity becomes simpler and more streamlined for the entire ecosystem of communications service providers, OEMs, enterprises and consumers.”",
    "The grand vision is to make the world a “single, giant Wi-Fi network” that allows billions of people to connect automatically and securely in any location, complementing cellular connectivity in converged network architectures. The use of Wi-Fi has other advantages in certain scenarios, such as more reliable connections and faster speeds in areas with poor mobile coverage, and lower battery consumption.",
    "OpenRoaming technology has been successfully trialled in Orkney by Cisco and has been rolled out commercially in London’s Canary Wharf. Cisco transferred the management of OpenRoaming to the WBA last year, hoping to foster cross-industry collaboration and support.",
    "Other supporters include of AT&T, Boingo, Broadcom, Commscope, Deutsche Telekom, Facebook, Google, Intel, Net Experience and Samsung."
  ],
  "headers": {
    "3": "Wi-Fi 6 OpenRoaming"
  },
  "links": {}
}