{
  "source": "https://www.techradar.com/news/ibm-unveils-next-gen-version-of-its-data-center-operating-system",
  "title": "IBM unveils next gen version of its data center operating system",
  "category": "computing",
  "updated": "2021-02-24T15:02:45Z",
  "author": "mayank-sharma",
  "summary": "Next version of AIX is expected this year, but there's no specific release date yet",
  "article": [
    "As it re-focusses on moving to hybrid cloud, IBM has announced the next version of its AIX operating system for servers - the first release since 2015.",
    "The release of AIX 7.3 is further testament to IBMs new focus on hybrid cloud, which was recently emphasised by incoming CEO Arvind Krishna during his first keynote at the company’s virtual Think Digital event.",
    "“IBM plans to bring new capability and enhancements to AIX with a new release, AIX 7.3, which is designed to help enterprises on their hybrid cloud journey,” notes a Statement of Direction document accessed by The Register.",
    "AIX is a family of proprietary operating systems developed by IBM for its POWER-based servers.",
    "The document doesn’t mention details about the specific enhancements in the release that will allow it to take on its new role as the facilitator of the IBM-powered hybrid cloud.",
    "However, IBM now owns Red Hat, whose OpenShift containerization platform has helped propel the open source company as a serious hybrid cloud player. It shouldn’t be a surprise if OpenStack finds itself coupled with the upcoming AIX release",
    "In fact, OpenStack does get a shoutout in IBMs blog post where it shows off its new hybrid cloud capabilities.",
    "Importantly, the post notes that AIX 7.3 will debut sometime in 2021 and will deliver “enhanced capabilities that deliver resiliency, security and scale needed to get your IT environment ready for hybrid cloud.\"",
    "Via: The Register"
  ],
  "headers": {
    "3": "Hybrid push"
  },
  "links": {
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "incoming CEO Arvind Krishna": "https://www.techradar.com/news/ibm-ceo-every-company-will-become-an-ai-company",
    "new hybrid cloud": "https://www.ibm.com/blogs/systems/ibm-power-systems-new-hybrid-cloud-capabilities/",
    "The Register": "https://www.theregister.com/2021/02/24/aix_7_3_announced/"
  }
}