{
  "source": "https://www.techradar.com/news/star-wars-jedi-fallen-order-is-getting-a-proper-ps5-and-xbox-series-x-upgrade",
  "title": "Star Wars Jedi: Fallen Order is getting a proper PS5 and Xbox Series X upgrade",
  "category": "gaming",
  "updated": "2021-06-28T14:55:49Z",
  "author": "samuel-tolbert",
  "summary": "Upgrade against the Dark Side",
  "article": [
    "Respawn Entertainment's lightsaber-wielding adventure Star Wars Jedi: Fallen Order is getting a proper Xbox Series X, Xbox Series S and PS5 patch.",
    "The announcement detailed how the game runs at 4K 30 FPS or 1440p 60 FPS on Xbox Series X and PS5, while the Xbox Series S version runs at 1080p 60 FPS. Best of all, this upgrade is available right now.",
    "All versions of the game include higher-quality textures and faster loading times. This upgrade is completely free if you already own the game on Xbox One or PS4. Even better, publisher Electronic Arts is providing an option for owners of a physical copy to get a digital upgrade, if they intend to play on Xbox Series S or the PS5 Digital Edition.",
    "Do note that in the case of the above, you'll need to contact Electronic Arts and provide proof of purchase to get your upgrade.",
    "Accompanying the details for this news, Respawn Entertainment also revealed that Star Wars Jedi: Fallen Order has crossed over 20 million players since it launched in 2019. According to rumors, Respawn is working on a sequel to the game, though nothing has been officially announced yet.",
    "Looking ahead, Electronic Arts' next big game this year is Battlefield 2042, which is set to launch on October 22, 2021. Eschewing a campaign, the game features 128-player multiplayer and the largest maps ever for the series on the newest lineup of consoles and PC.",
    "Further out are the next Dragon Age and Mass Effect games from veteran role-playing studio BioWare, though neither of these games have release windows at this time."
  ],
  "headers": {
    "4": "More and more Jedi"
  },
  "links": {
    "Star Wars Jedi: Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "announcement": "https://www.ea.com/games/starwars/jedi-fallen-order/news/next-gen-release-details",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "contact Electronic Arts": "https://help.ea.com/en/contact-us/?product=star-wars-jedi-fallen-order",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "next Dragon Age": "https://www.techradar.com/news/dragon-age-4-release-date-news-and-rumors",
    "Mass Effect": "https://www.windowscentral.com/mass-effect-next"
  }
}