{
  "source": "https://www.techradar.com/news/no-galaxy-s21-fe-or-z-flip-3-samsung-puts-another-nail-in-mwc-2021s-coffin",
  "title": "No Galaxy S21 FE or Z Flip 3: Samsung puts another nail in MWC 2021's coffin",
  "category": "phones",
  "updated": "2021-05-11T09:05:42Z",
  "author": "tom-bedford",
  "summary": "It's not over 'til the Sam has sung",
  "article": [
    "Pour one out for annual tech event Mobile World Congress (MWC) 2021 - after the 2020 event was canceled for Covid-19 reasons, the organizers pushed the 2021 iteration from the usual late February slot to late June, but that hasn't stopped tech companies dropping out left, right and center.",
    "MWC 2021 just got its biggest blow yet, though, because Samsung - yep, biggest phone company in the world Samsung - has announced it won't have a physical presence at the big tech conference, though it will play a part in any web conferences.",
    "Samsung follows Sony, Ericsson, Nokia (the infrastructure company, not HMD Global, which puts out smartphones under the Nokia name) and several other companies in dropping out of the physical MWC 2021 event - though it's definitely the biggest phone brand to pull out.",
    "In a statement to TechRadar, Samsung said 'The health and safety of our employees, partners and customers is our number one priority, so we have made the decision to withdraw from exhibiting in-person at this year’s Mobile World Congress. We look forward to participating virtually and continuing to work with GSMA and industry partners to advance new mobile experiences.'",
    "The wording implies the company would be interested in participating in MWC 2022, but with one cancelled and one downsized conference, we'll need to see if there will be a 2022 event.",
    "Samsung is no stranger to MWC - at the 2019 event, the last one that actually went ahead as planned, it had loads of devices on display. Not only did it show off the Galaxy S10, S10e and S10 Plus, unveiled at a separate event the week before, but it debuted a few Galaxy A series phones and teased more of the then-new Galaxy Fold.",
    "That clearly won't happen this year though, despite there being loads of phones we're expecting to see soon. The Samsung Galaxy S21 FE, a mid-range version of the Galaxy S21, is an anticipated device, and we're hoping to see the Galaxy Z Fold 3 and Z Flip 3 soon too - beyond the phones world, the Galaxy Tab S7 Lite and Galaxy Watch Active 4 could be coming as well.",
    "We were expecting to see all those devices before August, when we're expecting the Galaxy Note 21 and Galaxy Watch 4, which would make a late-June MWC the perfect timing.",
    "This news makes a little more sense when you consider recent news that Samsung reportedly has a big launch event planned in August, where we could see its foldable phones and more - perhaps that's the event where we'll see everything that would have come at MWC.",
    "MWC was always a big event for phone fans, as plenty of new and exciting smartphones are unveiled in a short space of time. It's sounding increasingly like that won't happen in 2021, but perhaps 2022 will be different."
  ],
  "headers": {
    "5": "No Z Flip 3, S21 FE, Z Fold 3?"
  },
  "links": {
    "Mobile World Congress (MWC) 2021": "https://www.techradar.com/news/mwc-2021-news",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "S10e": "https://www.techradar.com/reviews/samsung-galaxy-s10e",
    "S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Z Flip 3": "https://www.techradar.com/news/the-samsung-galaxy-z-flip-3-could-cost-less-than-we-thought",
    "Galaxy Tab S7 Lite": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-fe",
    "Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung reportedly has a big launch event planned in August": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-and-z-fold-3-foldables-tipped-to-launch-in-august"
  }
}