{
  "source": "https://www.techradar.com/news/the-official-lego-black-friday-free-sets-and-deals-start-time-have-been-unveiled",
  "title": "The official Lego Black Friday free sets and deals start time have been unveiled",
  "category": "appliances",
  "updated": "2021-11-23T17:31:19Z",
  "author": "tom-bedford",
  "summary": "Free kits if you spend enough",
  "article": [
    "While loads of Lego Black Friday deals have been pushed live by shops and online retailers already, the official Lego ones haven't started yet. The Danish company only offers its official discounts for a limited time, so the official Lego sale begins on November 26, which is Black Friday itself.",
    "However, we know a little bit about what to expect, as the brand has unveiled which free sets you'll be able to pick up in the Black Friday sales.",
    "Lego frequently offers free kits on its website, which you can get if you spend enough or buy a certain set during the promotion, to encourage Lego fans to buy their bricks direct from the source.",
    "There are three kits you can pick up over Black Friday this year:",
    "So if any of those sets catch your eye, it might be worth waiting for the Black Friday Lego sales to pick them",
    "up along with whatever else you're buying. You're going to have to spend a lot, though, or travel to a bricks-and-mortar store (no pun intended), so it's not for everyone.",
    "Loads of deals are live now though, and it might be worth perusing them to see if anything catches your eye. We've picked out the best ones we've found below, but scroll down for some quick links to retailers."
  ],
  "headers": {
    "7": "More Black Friday Lego deals - UK"
  },
  "links": {
    "Lego Black Friday deals": "https://www.techradar.com/black-friday/black-friday-lego-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "which free sets": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-3467918060192550000&murl=https%3A%2F%2Fwww.lego.com%2Fen-us%2Fpage%2Fblack-friday-cyber-monday-toy-deals"
  }
}