{
  "source": "https://www.techradar.com/news/gopro-hero-9-black-update-brings-new-gopro-labs-tricks-heres-how-to-install-it",
  "title": "GoPro Labs update brings new tricks to the GoPro Hero 9 Black – here's how to get it",
  "category": "cameras",
  "updated": "2021-01-13T14:00:21Z",
  "author": "mark-wilson",
  "summary": "Turn your GoPro into a dash cam and more",
  "article": [
    "GoPro Labs is a new platform that lets you test-drive unreleased software features –and a fresh update has just unlocked some extra tricks for the GoPro Hero 9 Black, along with the GoPro Hero 8 Black, GoPro Hero 7 Black and GoPro Max.",
    "The firmware update, which you can load into your compatible camera via a microSD card using the process below, adds some extra features to the dozen or so tricks that GoPro Labs delivered when it launched for the Hero 8 Black in June 2020.",
    "These include enhancements to the motion detection function, which is now supported in all video modes, including the 360-degree one on the GoPro Max.",
    "Another couple of new features could help you, for example, turn your GoPro into a dash cam. 'USB power triggers' mean you can get your supported GoPro to start/stop when it's plugged into USB power, while 'camera motion triggers' can do the same when the camera's accelerometer or gyroscope detect that it's moving.",
    "While some of these features may seem quite minor, the benefit is that they let you get creative with your GoPro in ways that haven't been possible before. For example, a new live streaming feature lets you program your GoPro to start live streaming within seconds of being connected to a designated Wi-Fi network, which could be handy for YouTubers or Twitch streamers.",
    "Alternatively, a new 'one-button mode' lets you simplify your GoPro Hero 9 Black (or other supported GoPro) and avoid accidentally changing modes. Enable that feature, and you'll only be able to start/stop capture on the action cam, with all other features disabled.",
    "GoPro Labs is an optional platform for those who fancy tinkering with experimental features before they're fully released. That means you need to use the old-school method of updating your firmware, rather than doing it via the GoPro app.",
    "Fortunately, it's pretty straightforward. Just download the Zip file for your compatible action camera from the GoPro Labs page – again, only the GoPro Hero 9 Black, GoPro Hero 8 Black, GoPro Hero 7 Black and GoPro Max are supported right now.",
    "From there, it's just a case of inserting your microSD card into your laptop or computer (using an adaptor if needed), opening the Zip file and dragging the 'update' folder onto your card. When you plug the card into your GoPro (with the power off), it'll automatically start the update and give you a check mark to confirm the update was successful.",
    "GoPro says you won't lose any pre-existing modes or features. This new update's features join the previously released Lab tricks that included handy modes like a wake-up timer for remote recording, which is particularly useful for shooting timelapses.",
    "Collectively, these bring some pretty useful versatility to the Hero 9 Black, which we've argued is secretly a big evolution for action cameras. With the ability to create custom QR code triggers and more, it's becoming something of a Swiss Army knife for action cams, and garnering appeal that elevates it above the best cheap action cameras."
  ],
  "headers": {
    "6": "How to get the GoPro Labs update"
  },
  "links": {
    "GoPro Hero 9 Black": "https://www.techradar.com/reviews/gopro-hero-9-black",
    "GoPro Hero 8 Black": "https://www.techradar.com/reviews/gopro-hero-8-black",
    "GoPro Hero 7 Black": "https://www.techradar.com/reviews/gopro-hero7-black-review",
    "GoPro Max": "https://www.techradar.com/reviews/gopro-max",
    "GoPro Labs": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2868622147259552000/https://community.gopro.com/t5/GoPro-Labs/ct-p/GoProLabs",
    "secretly a big evolution for action cameras": "https://www.techradar.com/news/why-the-gopro-hero-9-black-is-the-next-evolution-of-action-cameras",
    "best cheap action cameras": "https://www.techradar.com/best/best-cheap-action-camera"
  }
}