{
  "source": "https://www.techradar.com/news/you-can-use-the-new-samsung-galaxy-s21-as-a-car-key",
  "title": "You can use the new Samsung Galaxy S21 Ultra as a car key",
  "category": "car-tech",
  "updated": "2021-01-14T17:13:07.526Z",
  "author": "john-mccann",
  "summary": "Samsung brings digital key smarts to the S21 Plus and S21 Ultra",
  "article": [
    "You'll be able to use the new Samsung Galaxy S21 Plus and Galaxy S21 Ultra as your car key with the inclusion of ultra-wideband capabilities (UWB) embedded into the handsets.",
    "If that sounds familiar, it's because Apple rolled out the same thing for iPhones in 2020. The secure digital key will see you car unlock as you approach it, making it a seamless hands-free experience.",
    "Samsung has partnered with Audi, BMW, Ford and Genesis so far for its digital key integration, but we're yet to learn exactly which models, and in which countries, the technology will be supported.",
    "There may be a little wait for compatible vehicles to become available, as Samsung says the system will work with \"select future 2022 car models\".",
    "Digital key support is also supported on the Galaxy Note 20 Ultra and Galaxy Z Fold 2.",
    "While you'll need a recent Galaxy handset to setup a digital key for your compatible car, you will be able to share access to the vehicle with anyone, no matter the smartphone they have.",
    "This allows you to loan your car to friends or family (who you deeply trust) when you're not using it - setting the digital key to be active during specific dates and times.",
    "Samsung has also partnered with Google to provide greater integration between your smartphone and your car.",
    "You'll be able to add your compatible vehicle to the SmartThings apps - just as you would any other smart home device. This will allow you to control key car functions, such as locking and unlocking the doors, starting the engine and managing the climate controls - all remotely, via your phone.",
    "It's also worked on its Android Auto offering - a mobile-friendly user interface supported my an ever-increasing number of vehicles around the world which lets you connect your phone to your car and gain access to core apps via the latter's display.",
    "The Samsung SmartThings app is now one of the supported applications on Android Auto, which means you'll be able to control your smartphone from your vehicle's touchscreen - be that switching on the lights, activating your robot vacuum, turning up the heating, locking the front door or opening the garage as your arrive home."
  ],
  "headers": {
    "7": "Samsung and your car become more connected"
  },
  "links": {
    "Samsung Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review"
  }
}