{
  "source": "https://www.techradar.com/news/soothing-sounds-are-coming-to-windows-11-in-dark-mode",
  "title": "Soothing sounds are coming to Windows 11 in dark mode",
  "category": "computing",
  "updated": "2021-09-06T10:21:02Z",
  "author": "daryl-baxter",
  "summary": "Windows sounds at twice the picking",
  "article": [
    "As we approach the release of Windows 11 on October 5, Microsoft is starting to chat about the thoughts behind creating some of the new features of the upgrade, this time being new sounds for the dark mode theme in a new interview.",
    "Applying themes to your Windows PC is an incredibly common attribute that used to require third-party applications in order to install that unique appearance to your desktop. However, newer trends such as dark mode and ever-changing wallpapers based on the time of day have made Microsoft aware that themes in Windows need more attention compared to its previous efforts.",
    "This is why we’re about to see separate sounds in both Light and Dark mode themes for Windows 11, to better set apart the overall feel for when you decide to customize your desktop.",
    "When switching between light and dark modes, the sounds should reflect the appearance of your desktop, such as the taskbar and wallpaper having darker colors. If a high-pitched tone was played when moving files into different folders for example, there are users who may think it doesn’t fit the overall theme.",
    "\"We introduced light and dark sound options so that people who may have low visibility or no vision can still experience light and dark themes audibly.” a Microsoft spokesperson explained. “Themed sounds improve productivity by matching your working style through your theme. Dark Sounds help you stay in focus while Light Sounds ensure you’re always engaged.”",
    "Microsoft has created ten different sounds for its Light mode and Dark mode in Windows 11, each with its own unique tone to be different from both modes.",
    "You can listen to the differences at BleepingComputer to help you decide which sounds you prefer when you’re able to upgrade to Windows 11 on October 5.",
    "A big part of a Windows upgrade is its new sounds and how users will be able to tell what a certain sound means for a certain function. If you used Windows XP in its heyday, you would most likely think back to this sound when the topic is mentioned.",
    "It gives you familiarity with Windows, and to another point, its brand recognition. Apple rarely changes its sounds unless it's for a big redesign, which happened with macOS 11 Big Sur, but Microsoft always makes sure to change its sounds with every major Windows upgrade.",
    "This is the next step in a long line of sound changes in Windows releases, and while the Light and Dark mode sounds seem different only in pitch and volume, it’s an encouraging effort so far to make every theme unique in Windows 11.",
    "Via BleepingComputer"
  ],
  "headers": {
    "3": "How many sounds?",
    "7": "Analysis: a nostalgia for Windows sounds"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "a new interview": "https://www.bleepingcomputer.com/news/microsoft/windows-11-dark-mode-has-quieter-more-soothing-sounds-listen-now/",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/microsoft/windows-11-dark-mode-has-quieter-more-soothing-sounds-listen-now/",
    "macOS 11 Big Sur": "https://www.techradar.com/news/macos-11-big-sur"
  }
}