{
  "source": "https://www.techradar.com/news/microsoft-reveals-its-vision-of-the-future-of-meetings",
  "title": "Microsoft reveals its vision of the future of meetings",
  "category": "computing",
  "updated": "2021-05-22T12:00:53Z",
  "author": "anthony-spadafora",
  "summary": "Meetings will need to adapt to our hybrid working future",
  "article": [
    "As employees are now beginning to return to the office after working from home during the pandemic, Microsoft believes that hybrid working will be the future of work.",
    "In a post on LinkedIn, Microsoft CEO Satya Nadella explained how the shift to hybrid work will require a new operational model that will span “people, places and processes”. Nadella provided further details on what he calls the hybrid work paradox, saying:",
    "“Every organization’s approach will need to be different to meet the unique needs of their people. According to our research, the vast majority of employees say they want more flexible remote work options, but at the same time also say they want more in-person collaboration, post-pandemic. This is the hybrid work paradox.”",
    "The software giant has also released a 33-page hybrid work playbook to share all of the data, research and best practices it has designed with other organizations to help them adapt to what it believes will be the future of work.",
    "In addition to sharing its hybrid work guide, Microsoft has also released a new video showcasing how it believes meeting spaces in offices will need to be transformed to support a hybrid working model. Now that workers around the world have grown comfortable using Microsoft Teams and other video conferencing software, video calls will be an essential part of hybrid work as both in-person and remote employees will be able to participate.",
    "The company's concept video (which you can watch here) builds on its Teams Room devices that were introduced last year with larger screens, cameras placed at eye level and speakers with spatial audio. The idea behind this is that these tweaks will make video conferencing fell more like having a face-to-face meeting.",
    "While Microsoft's Together Mode puts participants together in a virtual space in Teams, the company has reimagined this idea somewhat and now remote workers will appear at the bottom of the screen with shared documents above them. This way those seated in a meeting room will have an easier time making eye contact with their remote counterparts. Spatial audio will have a similar effect as it will make it feel like remote workers on a video call are present in a meeting room with in-person attendees.",
    "Given that Microsoft also recently released guidance on how organizations can secure their hybrid working environments, it appears that the company is going all in on hybrid work which makes a great deal of sense as this way, businesses and workers will be able to put the skills they learned during the pandemic to good use."
  ],
  "headers": {
    "4": "The future of meetings"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9335799656537324000&xs=1&url=https%3A%2F%2Fwww.linkedin.com%2Fpulse%2Fhybrid-work-paradox-satya-nadella%2F%3FtrackingId%3DqSsWl2a1RnCj0dHpJqE19A%253D%253D&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-reveals-its-vision-of-the-future-of-meetings",
    "Satya Nadella": "https://www.techradar.com/news/satya-nadella-isnt-a-big-fan-of-remote-working",
    "hybrid work playbook": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4049613528700777000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fresilience%2Fhybrid-work-solutions%3Frtc%3D1",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "which you can watch here": "https://www.youtube.com/watch?v=ljh7xlj0WjQ",
    "Teams Room devices": "https://www.techradar.com/news/new-microsoft-teams-integration-makes-for-even-more-elaborate-video-conferencing",
    "Together Mode": "https://www.techradar.com/news/microsoft-teams-calls-are-getting-bigger-than-ever",
    "Spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "secure their hybrid working environments": "https://www.techradar.com/news/microsoft-lays-out-how-to-secure-your-hybrid-working"
  }
}