{
  "source": "https://www.techradar.com/news/close-encounters-elite-creator-surveys-the-gaming-galaxy-and-talks-starfield",
  "title": "Close encounters: Elite creator surveys the gaming galaxy and talks Starfield",
  "category": "gaming",
  "updated": "2021-09-07T08:53:55Z",
  "author": "ben-gilbert",
  "summary": "Interview: 'All I would ask is for people to be ambitious'",
  "article": [
    "Reportedly set “300-ish years in the future\", official news of Starfield’s release at E3 2021 provided the shot of hype craved by industry figures and players alike. \"And now man is living amongst the stars: what does that mean?\", pondered Bethesda’s Todd Howard in an accompanying video interview to launch the title. But until Elite came out way back in September 1984, there were no stars. At least not on home computers. It was this game that first ventured into the final frontier.",
    "Imitating the questing, but disarmingly amateur, training phase of Ryan Gosling’s Neil Armstrong in First Man, David Braben and Elite co-creator Ian Bell devised a game founded on raw invention. They built a primitive vessel soldered together with fizzing sparks of ambition, powered by BBC Basic machine code and streamlined via straight-edged vector aerodynamics to open a portal into a new world.",
    "From a back-alley office behind a British Gas showroom in Cambridge, Braben and Bell lifted off into a cosmic vacuum now, some 40 years later, overpopulated by competing titles from across the gaming galaxy. As the latest, Starfield enters the space race with the weight of expectation already bearing down on the makers of Skyrim and Fallout. Now owned by Microsoft, Bethesda has promised a “Han Solo simulator”, striking an Xbox exclusive with a release date itself set quite far in the future: November 11, 2022.",
    "Braben, who was awarded the 2015 video game BAFTA Academy Fellowship in recognition of his contribution to the industry, remains a key commentator here. After all, Elite “changed the world”. Arguably, it spawned the concept of open-world games, acting as a direct prompt for Grand Theft Auto, which Rockstar North founder Dave Jones reportedly described as “Elite in the city”. The release of Elite Dangerous in 2012 compounded Braben’s influential position, providing the platform for a unique perspective on the new generation of titles set in space.",
    "Speaking to TechRadar online from a Greek island, we ask Braben if he had tuned in to E3’s Starfield launch?",
    "“I did. It’s interesting. I’ve always been a fan of Bethesda’s games. Starfield looks very much like the sort of story-based adventure that we might associate with the men-in-tights games,” he jokes, before elaborating: “I hope they do it right. I’m sure they will. I think in terms of the way the story-based expedition works, it’s probably a pretty good setting. The trailer actually didn’t tell me very much about the game, which is often the case with early trailers. It’s probably true of some of ours too. But it was a lovely teaser. Let’s see where it goes from there.”",
    "To really understand the future of this genre, it’s important to examine the past. Braben and Bell met at Jesus College, Cambridge, finding a shared interest in early home computers and the programming techniques that would lead them to cram a 22K game into the BBC Micro’s 32K capacity. Elite went on to shift more than one million copies, becoming the first non-American best seller in the US. But Braben’s fascination with the worlds beyond our world had taken hold some years earlier.",
    "“I was very interested in astronomy, the planets and how the solar system formed. But I also had a huge interest in science fiction. I avidly read the likes of Larry Niven, Jerry Pournelle and Isaac Asimov. There was a huge range of people who wrote very creatively, very interestingly, presenting very different worlds. I was thoroughly engaged with it, entirely in books.",
    "“There were almost no science fiction films that captured the same spirit. It was all either camp and laughable or didn’t really engage with what you might consider hard science fiction that you got from the books. Star Wars was the first one that presented a world that was plausible. That was an amazing film. For the first time, the world that I had read about in books actually made it to the screen.”",
    "While Braben enjoyed the “art-house conceptual” vision of Space Invaders and 2-D design of Asteroids, comparable games set in the outer cosmos proved to be both a source of frustration and inspiration.",
    "“It’s the exploration side,\" he comments. \"That’s one of the things that drive it. Ian (Bell) and I had both become a bit sick of the fact that all the games out there were rather samey. There were three lives, extra life at 10,000, typical playtime of less than 10 mins. They were so regimented. I think that was very much driven by the arcades and trying to go for the next coin drop. I thought ‘if you had a home computer, why follow that structure?’”",
    "Looking back, Braben compares the first phase of Elite’s success to a quote from the 2018 Queen biopic, Bohemian Rhapsody: “We’re four misfits, writing music for misfits”.",
    "“I’m immensely proud of Elite and also that we stood our ground,” he explains, recounting a meeting with Thorn EMI, who turned it down because of the absence of these ubiquitous and “regimented” gaming tropes. “We were writing for people with interests like us and I don’t think there’s any shame in that. It might be a niche audience but at least it is an audience,” he says.",
    "In 1994, following the collapse of his partnership with Bell, Braben established Frontier Developments, a video game company that released Frontier: Elite II and Frontier: First Encounters. In 2014, after an extended hiatus and funded by a spectacularly successful Kickstarter campaign, which raised approximately £1.7m, Elite Dangerous was released. But how had Braben’s ambitions changed?",
    "“There are so many different aspects of it to be hugely proud of,” he explains. “The fact that every single object in the night sky is in the game and a whole lot more that is just slightly further away than we can see. That is the joy of exploration. Going beyond the horizon and finding something new.”",
    "In fact, Braben points out that just “0.04% of our galaxy has been explored by players” so far and Elite Dangerous, with revenues of £100m, continues to expand. May’s Odyssey extension added a range of new features centering on more immersive first-person gameplay. While admitting frustration at the technical issues that beset its launch, Braben remains thrilled by Elite’s evolution and the hardwired community experience. “It’s that real incredible richness and dynamic range. You just don’t see that in games,” he says.",
    "However, the last decade has seen a tangible renaissance in this realm. A recent Wireframe feature chronicled the genre and suggested Elite Dangerous was the point when “space became cool again”. In 2019, Outer Wilds claimed the Best Game BAFTA, EA has confirmed a remake of Dead Space, while No Man’s Sky has been proclaimed as “one of the all-time biggest turnarounds in industry history”.",
    "Braben congratulated No Man’s Sky developer Hello Games for its continued commitment to the title, which celebrates its fifth anniversary this month.",
    "“I’ve played No Man’s Sky a little and it’s a very different experience,\" Braben tells us. “I think they have put a lot of work in since release to improve the game and I applaud that,” he says, before addressing a broader question about the genre’s rejuvenation. “I don’t think it’s technological. I think it’s much more social. People have seen the success of Elite Dangerous. They’ve seen the money raised for Star Citizen. The focus has changed and people have realized what an interesting genre this is.",
    "“I don’t really see Dead Space in quite the same way. It’s a very good game and I did love playing it but if you’d have asked me to list space games, I probably would have put it in a different category. But I love to see things that spark people’s imagination and challenge ideas. That’s really important. Dead Space does that as does Elite Dangerous. To get you to look up at the night sky and realize how tiny and fragile the Earth is. There are so many things culturally that we need to be looking at, as Sir David Attenborough has been drawing attention to. It’s another way of showing just how small we are in the vastness of space.”",
    "Returning to Starfield and Braben feels it’s important that Bethesda recognizes the challenges that exist in the modern digital world and learn from the recent releases – including No Man’s Sky and Cyberpunk 2077 – which have become targets of social media vilification because of missed deadlines or lackluster content.",
    "“It is a risk,” he explains. “Some games can very much become all things to all people. We have this with Elite Odyssey as well, where people expect every ship interior to be different. Let’s see how Bethesda does. I don’t want to be criticizing them. I think they’re a very good company but I do think they’ve gone live so early that they’ve got their work cut out. That’s the truth of it.”",
    "With games like Starfield garnering so much attention, does Braben feel a sense of achievement at being the first to plant a flag into the ground?",
    "“I think there is an element of right time, right place but I’m pleased we stuck to our guns,” Braben says. “People don’t realize because we were so different. We held onto that difference. All I would ask is for people to be ambitious. Go a long way further if you can. I applaud game companies that do that and I think Starfield has a very good chance of doing that.”"
  ],
  "headers": {
    "4": "‘I’ve always been a fan of Bethesda’s games’",
    "9": "Elite: A space odyssey",
    "13": "Elite Dangerous Kickstarter campaign raised £1.7m",
    "17": "Space games show ‘how tiny and fragile the Earth is’"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "an accompanying video interview": "https://www.washingtonpost.com/video-games/2021/06/13/starfield-bethesda/",
    "training phase": "https://www.youtube.com/watch?v=w4GtJB5WAlQ",
    "Elite “changed the world”": "https://web.archive.org/web/20140825111235/http:/www.telegraph.co.uk/games/11051122/Elite-the-game-that-changed-the-world.html",
    "technical issues that beset its launch": "https://www.polygon.com/22454762/elite-dangerous-odyssey-launch-bugs-david-braben-apology%20",
    "A recent Wireframe feature": "https://wireframe.raspberrypi.org/articles/the-history-of-space-games-part-2-2000-20xx",
    "“one of the all-time biggest turnarounds in industry history”": "https://www.forbes.com/sites/paultassi/2020/09/29/no-mans-sky-doesnt-even-look-like-the-same-game-anymore/?sh=361e97a04ebe%20"
  }
}