{
  "source": "https://www.techradar.com/news/xbox-game-pass-cloud-gaming-is-about-to-look-better-than-ever",
  "title": "Xbox Game Pass cloud gaming is about to look better than ever",
  "category": "gaming",
  "updated": "2021-03-01T14:42:24.965Z",
  "author": "rhys-wood",
  "summary": "Say hello to 1080p cloud gaming on Xbox",
  "article": [
    "Xbox has begun testing 1080p streaming via its Xbox Game Pass cloud gaming streaming service. Cloud gaming on Xbox has so far proven to be something of a success, but it’s so far been lacking something its competitors have enjoyed for a while: higher image quality.",
    "As of right now, Xbox cloud gaming peaks at a 720p resolution. That’s not the worst thing ever considering 720p is much easier on both performance and bandwidth, but it’s far from ideal for current generations of phones, tablets and other streamable devices.",
    "In tandem with this 1080p upgrade comes news that Microsoft is preparing Xbox Game Pass cloud gaming for PC, as well, allowing another avenue for comfortable 1080p cloud streaming, skipping download times and providing an alternative for those who might not want to pick up an extra controller for play on their smartphones or tablets.",
    "The move looks to be a concerted effort on Xbox’s part to catch up to its competitors in the cloud gaming field, namely, NVIDIA GeForce NOW and Google Stadia, both of which already offer 1080p as an option.",
    "Google Stadia, though, has been in hot water recently due to its closing of numerous first-party developers, something that Xbox might be looking to capitalize on with its cloud gaming developments.",
    "Xbox Game Pass cloud gaming’s 1080p support has been a long time coming, with its previous maximum resolution of 720p being a very noticeable downgrade to image quality offered by its competitors.",
    "We can see this being an enormous boon for Xbox in the future. Its cloud gaming service is tied directly to Xbox Game Pass, meaning that soon, potentially hundreds of games on the Xbox Game Pass platform will benefit from 1080p cloud streaming."
  ],
  "headers": {
    "3": "Head in the xClouds"
  },
  "links": {
    "something of a success": "https://www.techradar.com/news/samsung-galaxy-note-20-xbox-games-pass",
    "NVIDIA GeForce NOW": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "numerous first-party developers": "https://www.techradar.com/news/google-closes-game-development-studios-but-promises-stadia-will-go-on"
  }
}