{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-flip-5g-now-the-cheapest-foldable-alongside-motorola-razr",
  "title": "Samsung Galaxy Z Flip 5G is now cheaper than ever in US, costs same as S21 Ultra",
  "category": "phones",
  "updated": "2021-02-03T09:08:35Z",
  "author": "david-lumb",
  "summary": "Now the same price as the Motorola Razr 2020 and Samsung Galaxy S21 Ultra",
  "article": [
    "The Samsung Galaxy Z Flip 5G price has dropped down to $1,200 in the US, making the clamshell foldable cost as much as the brand’s premium traditional smartphone Samsung Galaxy S21 Ultra.",
    "This makes the Z Flip 5G one of the cheapest foldable phones on the market, and on par with the Motorola Razr 2020 in the regions it's been discounted.",
    "This price drop cuts $250 off of the Z Flip 5G’s launch price of $1,449 / £1,399 / AU$2,599, which makes it a bit more feasible for premium phone buyers... or at least more feasible for consumers who will pay a premium for novelty rather than superior specs: the Z Flip 5G packs a Snapdragon 865 Plus chipset, 8GB of RAM, 256GB of storage, and a 3,300mAh battery.",
    "The novelty, of course, is the clamshell-folding center screen, which allows the Z Flip 5G to clamp shut to a footprint half the size of most smartphones (at the cost of, obviously, more than doubling its thickness from 7.2 mm unfolded to 17.3 mm folded closed). Its pair of rear cameras (main, ultra-wide) can also take selfies when the phone is folded using the 1.1-inch front screen to preview – and thanks to the firm hinge, you can keep the Z Flip open and use the internal 10MP camera to video chat at any angle.",
    "Sadly, this price drop down to $1,200 (around £878 / AU$1,575) hasn’t reached all regions yet – the Z Flip 5G is still £1,399 on the Samsung UK site. While the Australian price is now AU$1,749 on the Samsung Australia site, a major discount compared to the Z Flip 5G’s AU$2,599 launch price, it’s not quite down on par with the US price. Though, that isn’t a surprise with Samsung, which rarely sets global prices at parity with exchange rates.",
    "What's odd, however, is that Samsung hasn’t commensurately dropped the 4G-only Samsung Z Flip’s price, which remains at $1,300 in the US, as Input pointed out. That could possibly follow, but lowering the Z Flip 5G’s price has us wondering if Samsung is gearing up to launch the Samsung Galaxy Z Flip 2, which rumor has it had been pushed back to a 2021 release.",
    "The S21 Ultra just launched with the best specs in mainstream smartphones and two rear telephoto cameras (3x optical and 10x optical), which allow it to take the most impressive distance photos we’ve ever shot, period. So would the Z Flip 5G compete with the S21 Ultra now that, in the US at least, they’re priced identically?",
    "Yes, for a certain type of consumer. While both now cost half again as much as a baseline Samsung Galaxy S21, these premium phones both turn heads for different reasons. They’re certainly prizes in their own right – one for having the best array of cameras we’ve ever seen on a phone, another for the most flexible handset on the market. If you’re paying to flex on other phone owners but don’t want to pay upwards for a Samsung Galaxy Z Fold 2, either of these are good options.",
    "On the other hand, if you wanted more dynamic phone capabilities – like better rear cameras or a more pristine display than the crease-prone Z Flip 5G – you can get one for notably cheaper than the clamshell foldable’s pricetag, even after its reduction."
  ],
  "headers": {
    "6": "The S21 Ultra’s competition...is the Z Flip 5G?"
  },
  "links": {
    "Samsung Galaxy Z Flip 5G": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review/reviews/samsung-galaxy-s21-ultra-review",
    "Motorola Razr 2020": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "UK site": "https://www.awin1.com/awclick.php?awinmid=17946&awinaffid=103504&clickref=trd-us-1133995957810023300&p=https%3A%2F%2Fwww.samsung.com%2Fuk%2Fsmartphones%2Fgalaxy-z-flip%2Fbuy%2F",
    "Australia site": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1438756965098896400&xs=1&url=https%3A%2F%2Fwww.samsung.com%2Fau%2Fsmartphones%2Fgalaxy-z-flip%2Fbuy%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-galaxy-z-flip-5g-now-the-cheapest-foldable-alongside-motorola-razr",
    "I": "https://www.inputmag.com/tech/samsung-permanently-drops-galaxy-z-flip-5g-to-1200-dollars",
    "nput": "https://www.inputmag.com/tech/samsung-permanently-drops-galaxy-z-flip-5g-to-1200-dollars",
    "Samsung Galaxy Z Flip 2": "https://www.techradar.com/news/samsung-galaxy-z-flip-2-release-date-may-get-pushed-to-late-2021-analyst-predicts",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review"
  }
}