{
  "source": "https://www.techradar.com/news/apple-wants-to-make-sure-you-never-forget-your-icloud-passwords-again",
  "title": "Chrome will now make sure you never forget your iCloud passwords again",
  "category": "computing",
  "updated": "2021-02-01T16:05:08Z",
  "author": "barclay-ballard",
  "summary": "iCloud Passwords extension that will sync credentials between Safari and Chrome",
  "article": [
    "Chrome users will now be able to sync passwords between the Safari and Chrome web browsers thanks to a new launch from Apple.",
    "“iCloud Passwords is a Chrome extension for Windows users that allows you to use the same strong Safari passwords you create on your iPhone, iPad or Mac when visiting websites in Chrome on your Windows PC,” the Chrome web store explains. “iCloud Passwords also saves any new passwords you create in Chrome to your iCloud Keychain so that they are also available on your Apple devices.”",
    "Users of iCloud for Windows will now see a new “Passwords” section under the list of available services (providing they have updated to version 12.0). By then clicking “Apply,” they will be redirected to download the new Chrome extension.",
    "Once the iCloud Passwords extension is running, Chrome users will gain access to the passwords that they have created, had automatically generated, or saved in Safari for macOS or iOS. The feature also works reciprocally, with any passwords stored in Chrome also becoming available on iPhone, iPad, and other Apple devices.",
    "The new extension becomes part of a relatively small group of tools that Apple offers on the Windows ecosystem. Before the launch of iCloud Passwords, Apple’s only Windows solutions of note, besides iTunes, were iCloud Bookmarks for older PCs, and Apple TV+ for Xbox users.",
    "Password management remains a hot topic in the security sector, however, particularly as a huge number of data leaks still occur due to inadequate password protection. The new iCloud sync tool should help prevent password fatigue for Chrome users, encouraging them to use stronger credentials.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "Password protected"
  },
  "links": {
    "explains": "https://chrome.google.com/webstore/detail/icloud-passwords/pejdijmoenmkgeppbflobdenhhabjlaj",
    "9to5Google": "https://9to5google.com/2021/01/31/apple-icloud-passwords-chrome-windows/"
  }
}