{
  "source": "https://www.techradar.com/news/snipping-tool-is-now-snipping-tool-in-windows-11-as-it-merges-with-snip-and-sketch",
  "title": "Snipping Tool is now... Snipping Tool in Windows 11, as it merges with Snip and Sketch",
  "category": "computing",
  "updated": "2021-08-16T14:32:38Z",
  "author": "daryl-baxter",
  "summary": "The best of both worlds",
  "article": [
    "Microsoft has released a new update to Windows 11 for Insider users, where many apps have seen a redesign – but Snipping Tool has been given some bigger changes.",
    "There’s been many ways of taking screenshots in Windows over the years, with Paint and the Print Screen key being commonly used for sharing screen grabs of apps to message to a friend or a co-worker. But the Snipping Tool has risen in popularity since its appearance in Windows Vista, making it much easier to take images of apps.",
    "Users had been given notice that Snipping Tool was being abandoned in 2018, with another app called Snip and Sketch aiming to replace it. However, Microsoft reversed this stance and is now merging both apps into a redesigned Snipping Tool that’s tailor-made for Windows 11.",
    "In build 22000.132 Microsoft has made a new Teams app called Chat available to users, which looks to further phase out Skype from its line of communication apps. There are also fixes to the Microsoft Store, with rating and reviews now part of every app that’s currently available, so you can find out just how well an app runs on other Windows 11 machines.",
    "There are also many fixes across the operating system due to the feedback that Microsoft has been receiving since Windows 11 was made available to testers in June, with the new taskbar and the Fluent design being refined.",
    "However, it’s Calculator, Calendar, Mail and Snipping Tool that are the main selling points for this build, all seeing a refreshed design that further matches the Fluent design language of Windows 11.",
    "In a blogpost, Microsoft laid out the changes to these apps, where there are more rounded corners alongside a color scheme that can match the theme that you’ve picked for Windows 11.",
    "Snipping Tool is the focus in this post, with a new shortcut of Windows + Shift + S that now takes a screenshot of the whole desktop and saves it into a folder.",
    "Windows users were up in arms over the fact that the simpler Snip and Sketch app would replace Snipping Tool. It had far fewer features and didn’t give enough customization options when you would take a screenshot.",
    "Fortunately, Microsoft is clearly listening to its users as development on Windows 11 ramps up, with more cohesion for which app does what, alongside how it looks for the new Fluent design that’s also coming to the new upgrade.",
    "With the new Snipping Tool and the useful shortcut in taking a screenshot, there are now many more apps that look as though they’re part of Windows 11.",
    "However, if you go further in the weeds and open apps like Device Manager and Disk Management, you’re brought to a user interface that’s from 2001, and it’s these applications that deserve the same attention as Snipping Tool and Calculator and that power users can also appreciate.",
    "As we head closer to the rumored release date of October, it’s going to be up to users who are testing Windows 11 to keep sending this feedback to Microsoft, as the company is clearly listening, and giving us confidence that Windows and its apps are long overdue for a makeover."
  ],
  "headers": {
    "3": "What’s new in the latest Windows 11 build?",
    "8": "Analysis: two apps become one"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "taking screenshots in Windows": "https://www.techradar.com/how-to/how-to-take-a-screenshot-in-windows-11",
    "build 22000.132": "https://blogs.windows.com/windows-insider/2021/08/12/announcing-windows-11-insider-preview-build-22000-132/",
    "blogpost": "https://blogs.windows.com/windows-insider/2021/08/12/first-set-of-windows-app-updates-rolling-out-to-windows-insiders-for-windows-11/"
  }
}