{
  "source": "https://www.techradar.com/news/iphone-autocorrect-could-get-a-lot-smarter-or-more-annoying",
  "title": "iPhone autocorrect could get a lot smarter - or more annoying",
  "category": "phones",
  "updated": "2021-04-16T08:56:16Z",
  "author": "tom-bedford",
  "summary": "Giving you more control",
  "article": [
    "Currently, iOS autocorrect on iPhone and iPad can be somewhat of a wild beast you can struggle to keep under control - for every actual error it removes, it can feel like it also nixes loads of slang words and intentional non-standard spellings.",
    "That could change, though, because Apple has just been granted a patent for its auto-correction intelligence. As spotted by PhoneArena, this was filed in 2017 and recently granted by the US' USPTO.",
    "This patent details a change to how autocorrect works. Basically, instead of totally changing a misspelled word to something that's similar and correctly spelled, this patent describes how autocorrect would instead only edit the part that's spelled wrong.",
    "In addition, the change would move the cursor to the spot where the error occurred, so you can easily re-write whatever you were trying to say.",
    "Could the moving of the cursor be a little annoying? Possibly, especially given it could break your flow of writing, and autocorrect in its current form changes words without requiring your input. But for people who find Apple's autocorrect a little goofy and inaccurate, it could be a useful change.",
    "Plus, it's possible this change would be optional, so you could toggle it in an options menu. That's important since any change to autocorrect could negatively affect users who are used to the common system.",
    "It's not clear when, or if, this autocorrect feature could come to iPhones or iPads. Patents only indicate a company is experimenting with tech, not that it has plans to roll the patented invention out to devices, so don't hold your breath. However at the very least, this shows us Apple is re-considering how autocorrect works on its devices."
  ],
  "headers": {
    "4": "Smart or annoying?"
  },
  "links": {
    "PhoneArena": "https://www.phonearena.com/news/apple-patents-method-to-fix-typos_id131488",
    "USPTO": "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.htm&r=39&p=1&f=G&l=50&d=PTXT&S1=(apple.ASNM.+AND+20210406.PD.)&OS=an/apple+and+isd/4/6/2021&RS=(AN/apple+AND+ISD/20210406)"
  }
}