{
  "source": "https://www.techradar.com/news/steam-sets-new-record-for-concurrent-players-thanks-to-black-friday-and-cyberpunk-2077",
  "title": "Steam sets new record for concurrent players thanks to Black Friday and Cyberpunk 2077",
  "category": "gaming",
  "updated": "2021-12-02T11:15:07Z",
  "author": "darren-allan",
  "summary": "Autumn Sale and Thanksgiving weekend drove record numbers of gamers to Steam",
  "article": [
    "Steam has broken its record for the most concurrent players, with numbers of PC gamers logged into the platform hitting 27,384,959, easily beating the previous all-time peak of 26.9 million (set in April 2021).",
    "The new record was reached yesterday going by figures from SteamDB, and of those folks, 7.8 million were actually in-game at the time – which is a little bit shy of the previous record which is 8.1 million in-game back in March 2020.",
    "Part of the reason for the droves of gamers taking to Steam was, of course, the Thanksgiving weekend, with Steam’s Autumn Sale for Black Friday driving plenty of visiting, purchasing, and playing of new games as you might imagine – there are some seriously tasty discounts on the boil, after all.",
    "One of the juiciest price cuts is Cyberpunk 2077, which has been reduced by 50% – the lowest price the open world RPG has ever seen – and this has been selling fast. Indeed, it has been the top-selling game on Steam for some time now, and still remains at the top of the chart right now.",
    "The Steam reviews for Cyberpunk 2077 tell a story, as PC Gamer points out. On November 23 the game had just 78 thumbs-ups, whereas the next day, that shot up to 2,882, and on November 25, no fewer than 5,589 positive reviews were posted.",
    "Now, Cyberpunk 2077 has witnessed a colossal 23,015 recent reviews (at the time of writing), and the vast majority of those – 84% in fact – are positive.",
    "Clearly there’s something of a snowball effect happening with Cyberpunk 2077, whereby people are seeing the game with its biggest discount ever, and then seeing the growing number of positive reviews which confirm the sci-fi RPG is in way, way better shape now it’s all patched up. It was, of course, something of a buggy debacle at launch.",
    "The fact that gamers are noticing it holding fast at the top of the bestseller chart is also doubtless causing folks to think again about the game, perhaps look into how the patching has gone, and seen more positive feedback on that front.",
    "A typical Steam user review helping to create this positive feedback loop – the first one we came across in fact– reads like this: “I waited almost a full year before attempting to play this game. I am aware that the launch was sketchy and the game was packed full of bugs / glitches. As of patch 1.31 Cyberpunk was a worthwhile game purchase for me. I did enjoy the almost 180 hours of playtime I put in.”",
    "We’d agree with that sentiment, even though we were brave (or foolish) enough to play at launch on PC – there were lots and lots of minor bugs, but we were fortunate enough not to hit any show-stoppers (only one that required a reload to cure). That said, we played through at a slow pace, and some of the major game derailing glitches were fixed by the time we got there. We don’t doubt that anyone playing fanatically at launch would have had a pretty rough time one way or another.",
    "At any rate, what’s happening with Cyberpunk 2077 now is a far cry from what we witnessed at launch on Steam, where the game quickly hit a million concurrent players initially, but then four weeks after release, not much more than 200,000 gamers were still playing. You’d expect the popularity of a single-player game to drop considerably after a month, naturally, but not nearly that precipitously (for example, The Witcher 3 took three months for its initial player base to decrease by a similar amount).",
    "Via PC Gamer"
  ],
  "headers": {
    "6": "Analysis: Looks like the long wait to take the plunge with Cyberpunk 2077 has ended"
  },
  "links": {
    "Steam": "https://www.techradar.com/news/the-best-steam-games",
    "PC gamers": "https://www.techradar.com/news/best-pc-games",
    "SteamDB": "https://steamdb.info/app/753/graphs/",
    "previous record which is 8.1 million in-game": "https://www.techradar.com/news/steam-games-hit-a-record-high-for-concurrent-users-last-year-heres-why",
    "Black Friday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021#section-cyber-monday-deals-gaming-and-consoles",
    "seriously tasty discounts on the boil, after all": "https://www.techradar.com/news/steam-autumn-sale-is-live-with-50-off-deathloop-resident-evil-village-and-more",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "PC Gamer": "https://www.pcgamer.com/uk/steam-passes-27m-concurrent-users-to-set-a-new-high/",
    "not much more than 200,000 gamers were still playing": "https://www.techradar.com/news/cyberpunk-2077-loses-over-75-of-players-on-steam"
  }
}