{
  "source": "https://www.techradar.com/news/instagram-will-finally-let-you-post-a-photo-or-video-on-the-web",
  "title": "Instagram will finally let you post a photo or video on the web",
  "category": "computing",
  "updated": "2021-10-20T10:33:14Z",
  "author": "daryl-baxter",
  "summary": "An insta improvement",
  "article": [
    "While Instagram is introducing a few features this week to appeal to those who want to collaborate on photos and videos, the company is finally allowing posts to be created on the desktop.",
    "After making its mark with Instagram Stories, its take on Snapchat Stories, the company wants to refine other aspects of its app. The Reels feature is the company’s take on TikTok, enabling users to create and share videos which is being updated this week, but there’s more room for improvement that’s about to be brought out.",
    "If you’re a heavy user of Instagram, this looks to be a significant update that’s going to benefit in a number of ways.",
    "One feature is already rolling out, where the company is testing a way of allowing two accounts to co-author a post or a Reel, called Collabs.",
    "Sharing in this way will display the post in the Feed or Reels header to both sets of followers.",
    "You can start a Fundraiser directly from the ‘+’ button in the app, and attribute it to a post. This is set to go live later today across all platforms.",
    "Reels are also seeing two new effects called Superbeat and Dynamic Lyrics. Inspired by TikTok, this allows a Reel post to have special effects and lyrics automatically generated based on the song chosen. This can save you time in making sure the effects sync up with the song you’ve picked.",
    "The last feature has been long requested, where you will be able to create a post or a video in under one minute within a web browser. This launches on October 21, so anyone with an iPad or a Surface will be able to post to their feed on Safari or Microsoft Edge.",
    "While improvements to Reels and better fundraising prompts are welcome, the big takeaway is being able to post a photo or video from within a web browser. It’s something that users have been wanting to do for years.",
    "iPad users have had to use an enlarged version of Instagram through the iPhone app, but now it’ll be a matter of using a web browser to not only view, but also to post.",
    "This is a smart move from Instagram, as it saves the company from creating a dedicated app for iPadOS, Windows 11 and even Linux if you check your feed from there.",
    "While it’s only limited to photos and videos of up to one minute, that’s still going to please a lot of users who don’t use Reels or the Live features that the app brings.",
    "Instagram is already setting itself up to be the video app of choice compared to Snapchat and TikTok, but time will tell if these companies will follow suit and allow posts to be created and edited on the web as well."
  ],
  "headers": {
    "3": "What are the new features coming up?",
    "8": "Analysis: posting on an iPad is about to be much easier"
  },
  "links": {}
}