{
  "source": "https://www.techradar.com/news/the-sony-xperia-1-iii-pro-could-be-unveiled-on-october-25",
  "title": "The Sony Xperia 1 III Pro could be unveiled on October 25",
  "category": "phones",
  "updated": "2021-10-13T10:08:15Z",
  "author": "james-rogerson",
  "summary": "A pro phone at a premium price",
  "article": [
    "Sony has already launched two high-end phones this year, in the form of the Sony Xperia 1 III and the Sony Xperia 5 III, but an even more premium handset could be about to land.",
    "The company has revealed that it will be announcing a new Xperia product on October 25 at 11pm EDT. That’s 8pm PDT, while for those in the UK it’s 4am on October 26, and it’s 2PM on October 26 in Australia (AEDT).",
    "So not the most convenient of times for the US or the UK, but that’s because this launch seems focused on Japan. Though both Japanese and US timings are listed by Sony, suggesting that the device could land in both regions.",
    "But what device will it be? Well, the teasers don’t say, but they do specify that it’s a product, and some of the imagery on a teaser shared on Weibo (a Chinese social network) looks a little like a camera lens.",
    "Given that it’s the Xperia division we’re expecting a phone, but it could be a camera focused one, and that coupled with the timing suggests that it might be the Sony Xperia 1 III Pro, or possibly the Sony Xperia Pro 2.",
    "Sony is rumored (via AndroidNext) to be working on either a pro version of the Xperia 1 III or a follow-up to the Sony Xperia Pro, with the rumors being slightly unclear on which, and with the company having launched new models in most of its phone ranges recently, there aren’t any other obvious options.",
    "However, if it's the latter it likely won’t be of interest to most people, as the Xperia Pro was a specialist device aimed mainly at videographers, and with a price of $2500 (around £1,830 / AU$3,245) it was even more expensive than a foldable phone. Still, if you want Sony’s real top handset of 2021, the Xperia 1 III Pro might end up being it.",
    "Leaks suggest the Sony Xperia 1 III Pro will have even more power than the standard Xperia 1 III, with a Snapdragon 888 Plus chipset and 16GB of RAM, both of which would be an improvement.",
    "It may also have improved cameras if leaks are to be believed – which would fit with one of the teasers we’ve seen – but with a design that’s very similar to the Xperia 1 III. So based on that it sounds like a typical ‘Pro’ or ‘Ultra’ model – a phone that could compete with the likes of the Samsung Galaxy S21 Ultra.",
    "Yet, if this ends up being a successor to the Sony Xperia Pro it will probably also be kitted out with things like a mini-HDMI port, to make it more useful for videographers. And as noted above it would also likely have a very high price.",
    "There’s a fair chance that rather than being a specialist phone this is instead just a more high-end version of the Xperia 1 III, in which case it could have more mass appeal. But given that Sony charges $1,299.99 / £1,199 (around AU$2,200) for even the standard Xperia 1 III, it’s likely to be prohibitively expensive either way.",
    "Of course, we don’t know for sure that the Xperia 1 III Pro is what Sony will unveil on October 25, so it’s worth tuning in to find out – or just reading all about it on TechRadar at a more sociable time.",
    "Via NotebookCheck"
  ],
  "headers": {
    "7": "Analysis: you probably shouldn’t buy this"
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Sony Xperia 5 III": "https://www.techradar.com/reviews/sony-xperia-5-iii",
    "has revealed": "https://twitter.com/sonyxperia/status/1447834885436198912",
    "Weibo": "https://weibo.com/1658388965/KCp4mhokN?type=comment#_rnd1634116011172",
    "AndroidNext": "https://androidnext.info/?p=11268",
    "Sony Xperia Pro": "https://www.techradar.com/news/sony-xperia-pro-is-a-5g-uploading-second-screen-for-professional-content-streamers",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "NotebookCheck": "https://www.notebookcheck.net/Sony-whets-appetites-with-new-Xperia-product-launch-date.571762.0.html"
  }
}