{
  "source": "https://www.techradar.com/news/heres-why-you-should-really-think-twice-before-lettings-apps-access-your-webcam",
  "title": "Here's why you should really think twice before lettings apps access your webcam",
  "category": "computing",
  "updated": "2021-03-29T12:58:02Z",
  "author": "sead-fadilpasic",
  "summary": "Many people would allow access to any component the app asks of them",
  "article": [
    "Many users, especially younger people, are more than happy to give apps access to their cameras and microphones, potentially allowing cybercriminals an easy way into their lives and into their data.",
    "A report from cybersecurity experts Kaspersky based on a global poll of 15,000 people found that almost a quarter (23%) of users always gave apps permission to access these components.",
    "Among those aged 25 - 34, more than a quarter (27%) behave this way, dropping down to 9% among those aged 55 and up. The older generations seem to be more mindful of the privacy risks that come with allowing access to microphones and cameras, as 38% of this age group said they never give apps and services such access, compared to 9% among the younger ones.",
    "Overall awareness about the risks associated with granting access to communications components appears to be growing, with almost six in ten (59%) adults worry about being watched through the webcam without their knowledge, fearing it could be done via malicious software.",
    "The only “silver bullet” for this problem is common sense, the report concluded. Communication and collaboration applications have become an important part of people’s lives, even more so since the Covid-19, the lockdowns, and the move towards remote working. As a matter of fact, Kaspersky added, as of June 2020, Microsoft Teams grew by 894%, compared with its base usage in February 2020.",
    "So, simply declining access to each and every app isn’t going to cut it. Instead, people need to pay attention to the apps they’re using, and the permissions those apps are asking for. An app that allows for video calls will definitely ask for permission to use the camera, and it probably should be granted.",
    "However a calculator, for example, has no need for the microphone, and if such an app is asking to use it - extra investigation is recommended.",
    "“For sure, many people aren’t instantly familiar with security protocols related to webcam usage and cybersecurity processes,” said Marina Titova, head of consumer product marketing at Kaspersky.",
    "“However, what we are observing now is a strong positive trend of increased awareness around online safety and potential threats. This leads to more proactive consumer behavior like taking preventive actions and checking permissions before allowing video and microphone access. We also expect that the rise in cybersecurity consciousness will be supported by security awareness training arranged by businesses for their employees – especially as audio and video devices are now widely used for remote work.\""
  ],
  "headers": {
    "4": "Using common sense"
  },
  "links": {
    "malicious software": "https://www.techradar.com/best/best-malware-removal"
  }
}