{
  "source": "https://www.techradar.com/news/nvidia-dlss-has-arrived-on-linux-will-this-tempt-gamers-to-switch-from-windows-10",
  "title": "Nvidia DLSS has arrived on Linux – will this tempt gamers to switch from Windows 10?",
  "category": "computing",
  "updated": "2021-06-22T13:00:35Z",
  "author": "darren-allan",
  "summary": "DLSS is now supported on Linux, at least with Windows 10 games via Proton",
  "article": [
    "Nvidia has brought DLSS to Linux, or rather, Team Green has made it available on Proton for Vulkan titles with its latest graphics driver, which further introduces DLSS support for a trio of games including Doom Eternal.",
    "The new Game Ready driver means that those gamers running Linux rigs with GeForce RTX graphics cards will be able to benefit from DLSS when using Proton to play Windows 10 games.",
    "Proton is Steam’s compatibility tool for running Windows 10 games on Linux with a minimal overhead, and that performance hit should be further lessened by DLSS, which is Nvidia’s clever upscaling tech that can seriously speed up frame rates (it certainly does on Windows – by huge percentages in many cases, with not too much difference in image quality).",
    "Of course, DLSS isn’t a universal thing and game developers have to support it within their titles, but the introduction of the tech for Proton will mean the likes of No Man’s Sky, Wolfenstein: Youngblood and Doom Eternal should benefit from much slicker performance levels.",
    "Initially, Vulkan-powered games are supported as mentioned, but broader support for DirectX is going to be introduced at some point in the second half of 2021.",
    "Speaking of Doom Eternal, Nvidia’s new Game Ready driver introduces the double whammy of ray tracing and DLSS to the shooter, although it won’t officially be live until the game gets its incoming big update delivered on June 29.",
    "Rust has also been announced as getting DLSS on July 1 – the survival game already has support for Nvidia Reflex – and Lego Builder’s Journey launches on PC today with both ray tracing and DLSS, with the latter promising up to 92% frame rate boosts."
  ],
  "headers": {
    "5": "Doom, Rust and Lego"
  },
  "links": {
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-brings-faster-frame-rates-to-more-games-thanks-to-unreal-engine-plug-in",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "gamers running Linux rigs": "https://www.techradar.com/news/steam-has-never-been-more-popular-and-valve-promises-big-things-for-linux-gamers",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Nvidia Reflex": "https://www.techradar.com/news/nvidia-reflex-now-gives-you-sharper-reactions-in-rainbow-six-siege"
  }
}