{
  "source": "https://www.techradar.com/news/what-is-realme-a-guide-to-the-company-and-its-smartphones",
  "title": "What are Realme phones? A guide to the company and its smartphones",
  "category": "phones",
  "updated": "2021-03-15T09:44:32Z",
  "author": "tom-bedford",
  "summary": "Get your head around the Chinese tech company",
  "article": [
    "While you've probably heard of big tech companies like Samsung, Huawei and Apple, there are plenty of smaller smartphone brands out there doing exciting things that it’s worth knowing about too - that’s why we’ve written this guide on Realme, one such company.",
    "Realme originated in China but it’s an up-and-comer in the rest of the world, especially in India and Europe, where its low-cost smartphones are making waves in the budget and mid-range price brackets. The company isn’t averse to premium models though, especially with its Realme Race top-end line slated for an early-2021 release.",
    "Below we’ll run you through a brief history of the company as well as the types of products it puts out, and everything else you need to know about the brand.",
    "Realme was founded in 2010 as a sub-brand to another smartphone company - Oppo, but gained independence in 2018, when it started producing its own smartphones.",
    "Since then the company has put out phones at an impressive rate, and it’s also expanded from selling phones in India and China to many other parts of the globe too.",
    "Realme joins other smartphone brands Oppo, OnePlus and Vivo as belonging to a tech conglomerate called BBK Electronics. The exact relationship between BBK’s smartphone companies has never been specified, but we sometimes see tech and innovations shared between the companies, especially Oppo and OnePlus.",
    "Realme has two main smartphone lines, though that could change soon, as we’ll get into. In some regions the company has many more lines of smartphones like the Narzo, Q, C and V-prefix devices, but they’re not globally available, so we won’t go into detail on them.",
    "The first of the two main lines is Realme's numbered line, with handsets like the Realme 7 and Realme 7 Pro. These are affordable and low-mid-range devices that rival Motorola’s Moto G or Xiaomi’s Redmi line, with cheap and cheery phones designed for people who need dependable devices without top specs.",
    "Sitting above that is the company’s ‘X’ line, of low-mid-range devices like the Realme X2 Pro, Realme X3 Superzoom, or Realme X50 (though reports from the company suggest this double-figure range isn’t getting another handset). These have improved specs from the numbered line, and sometimes a premium feature or two, but still have low costs.",
    "At time of writing, Realme has confirmed, but not launched, another series of smartphones, called the Realme Race. Judging by the specs the company has unveiled, these are expected to be upper-mid-range or straight-up premium devices with top specs and high costs.",
    "As Realme is fairly new, and has put out loads of smartphones since its debut, it’s hard to discern any particular patterns in its release schedule. Unlike many other phone brands, the company doesn’t seem to adhere to a yearly launch plan.",
    "Regarding availability, Realme currently sells smartphones in most parts of the world, though the US is one exception. However, in an interview with TechRadar, Madhav Sheth, Realme’s CEO, suggested the brand could bring its devices to the US before too long as well. This could be a few years off though.",
    "Like most tech companies, Realme has a product ecosystem of non-smartphone devices, though it’s rolling out its devices slowly. The company calls this its 1+4+N strategy where the ‘1’ is your smartphone which controls gadgets in 4 key areas including audio and wearables, which are helped by ‘N’ which denotes smart home and Internet of Things (IoT) devices.",
    "The non-smartphone gadgets include wireless headphones like the Realme Buds Air, smartwatches like the Realme Watch and fitness trackers like the Realme Band. In some regions the brand also has smart home appliances and TVs.",
    "The company has pledged to rapidly expand its portfolio through 2021 though so we could see routers, tablets and more coming, though we don’t have clarity on exactly what."
  ],
  "headers": {
    "3": "A brief history of Realme",
    "6": "What phones does Realme make?",
    "10": "Realme phone availability information",
    "12": "Other tech Realme sells"
  },
  "links": {
    "Realme Race": "https://www.techradar.com/news/realme-race-pro-specs-confirmed-and-it-beats-the-samsung-galaxy-s21-ultra",
    "in an interview with TechRadar": "https://www.techradar.com/news/you-might-be-able-to-buy-realmes-affordable-phones-in-the-us-very-soon",
    "Realme Buds Air": "https://www.techradar.com/reviews/realme-buds-air-review",
    "Realme Watch": "https://www.techradar.com/reviews/realme-watch"
  }
}