{
  "source": "https://www.techradar.com/news/hurry-the-apple-watch-6-hits-lowest-sale-price-ever-at-amazon",
  "title": "The Apple Watch 6 drops to its lowest price ever in epic deal at Amazon",
  "category": "wearables",
  "updated": "2021-06-02T13:36:14Z",
  "author": "mackenzie-frazier",
  "summary": "Hurry - Apple's latest smartwatch is on sale for $319.99",
  "article": [
    "Amazon has just dropped the latest Apple Watch down to a new record-low price - but it won't last for long. Right now, you can get the Apple Watch 6 on sale for $319.99 when you apply the additional $64.99 coupon at checkout. That's the best deal we've found for the Series 6 smartwatch and $10 less than the Black Friday all-time low price. Not in the US? See the best Apple Watch deals in your region below.",
    "The feature-rich Apple Watch 6 tracks activity, workouts, and calories and now includes a sleep app that helps you establish a regular bedtime routine to get a better night's rest. The Series 6 includes new health features such as blood oxygen monitoring and an ECG app that alerts you when an irregular heart rate is detected. The waterproof smartwatch also helps you stay connected with the ability to take calls and reply to texts directly from your wrist. As we mentioned above, this is not only a fantastic deal but the lowest price we've seen for the Series 6 smartwatch. Amazon's Apple Watch deal is for the Product Red sport band, but you can also find the White, Pink, and Navy sport band on sale for $384.99. This is a limited-time offer from Amazon, so we recommend snagging this epic bargain now before it's too late.",
    "Shop more offers with our roundup of the best cheap Apple Watch deals and sales that are happening now."
  ],
  "headers": {
    "1": "Apple Watch 6 deal",
    "2": "More Apple Watch deals"
  },
  "links": {
    "on sale for $319.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNew-Apple-Watch-GPS-40mm-Aluminum%2Fdp%2FB08J5QC43Q%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5166567645247953000-20",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "on sale for $384.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNew-Apple-Watch-GPS-40mm-Aluminum%2Fdp%2FB08J5W4WXX%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7717488293310558000-20",
    "cheap Apple Watch deals and sales": "https://www.techradar.com/news/cheap-apple-watch-deals"
  }
}