{
  "source": "https://www.techradar.com/news/gaming-laptop-deals-new-razer-blade-stealth-13-gets-first-price-cut-plus-more",
  "title": "Gaming laptop deals: new Razer Blade Stealth 13 gets first price cut, plus more",
  "category": "computing",
  "updated": "2021-03-02T12:38:17Z",
  "author": "alex-whitelock",
  "summary": "Save on this stunning gaming ultrabook",
  "article": [
    "Amazon's latest gaming laptop deals this week have just yielded the first-ever price cut we've seen on the 2021 Razer Blade Stealth - a top gaming ultrabook - which can be picked up for $1,699.99 (was $1,799.99) currently.",
    "This latest version comes with an upgraded 120Hz screen, 11th Gen Intel Core i7-1165G7 processor, 16GB of RAM, a 512GB SSD, and a GTX 1650 Ti graphics card - great all-around specs for portable gaming and intensive applications.",
    "The Razer Blade Stealth 13 operates in a somewhat unique place in the wider gaming laptop deals market. It's essentially an ultrabook, like the Dell XPS 13 or HP Spectre, but with enough grunt under the hood to handle a bit of gaming wherever you go. That means you don't get quite the same kind of gaming performance that you'd get with most 15.6-inch machines, but when it comes to actual portability, not many gaming laptops come close.",
    "Speaking of 15.6-inch machines, however, those who do want a larger machine with a bit more power should check out the latest gaming laptop deals on the 2020 Razer Blade 15. Now it's no longer the latest model you can snag the RTX 2060 version for just $1,450 (was $1,799) at Amazon and the RTX 2070 version for just $1,599 (was $1,999) at Razer. Both these stunning machines feature a 144Hz display, Intel Core i7-10750H, 16GB of RAM, and a 512GB SSD, giving them plenty of power even though they aren't the latest models on the market anymore. For comparison, the latest RTX 3060 machine is retailing for $1,699, so you are getting quite a lot of bang for the buck here - well, for a Razer gaming laptop that is.",
    "Outside the US or looking for something cheaper? See today's best gaming laptop deals in your region just down below.",
    "Want to do a bit more research? See our main Razer Blade gaming laptop deals page for more details on these awesome machines. Alternatively, head on over to our cheap gaming laptop deals page to see plenty more budget-friendly options."
  ],
  "headers": {
    "5": "Razer Blade gaming laptop deals"
  },
  "links": {
    "for $1,699.99 (was $1,799.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FRazer-Stealth-Ultrabook-Gaming-Laptop%2Fdp%2FB08JSLM9K5%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7281410202891681000-20",
    "just $1,450 (was $1,799)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB086MGYM49%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3794760822453064700-20",
    "just $1,599 (was $1,999)": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-1136705093350898700&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fgaming-laptops%2FRazer-Blade-15%2FRZ09-03287E22-R3U1",
    "for $1,699": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-8853037921416298000&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fgaming-laptops%2FRazer-Blade-15%2FRZ09-0369AE22-R3U1",
    "Razer Blade gaming laptop deals": "https://www.techradar.com/deals/razer-blade-laptop-deals-sales-price",
    "cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000"
  }
}