{
  "source": "https://www.techradar.com/news/halo-infinite-beta-is-finally-up-and-running-and-the-bots-are-hilarious",
  "title": "Halo Infinite beta is finally up and running – and the bots are hilarious",
  "category": "gaming",
  "updated": "2021-07-30T09:37:50Z",
  "author": "axel-metz",
  "summary": "Suit up, Spartan",
  "article": [
    "The Halo Infinite beta has finally arrived – and despite its release having been delayed several hours by a slew of technical hiccups, reactions are largely positive so far.",
    "That doesn’t mean everything is running smoothly, though, with several players reporting framerate drops, audio issues and some pretty darn hilarious bot hijinks.",
    "Still, this is strictly speaking a tech preview, as opposed to a bona fide beta, and 343 reiterated that fact via Brian Jarrad, Halo Infinite’s community director, who tweeted that there there are still “many steps to navigate” before the Xbox Series X game’s release come the end of the year.",
    "That hasn’t stopped players poking fun at the test’s unpredictable AI, though – but not for the usual reasons you might think. Being a tech preview, the Halo Infinite beta pits gamers against bots, exclusively, rather than online multiplayer opponents, and that means these automated Spartans are, for many, really difficult to fight.",
    "So difficult, in fact, that some have reported bots moving in packs and making beelines for power weapons.",
    "Players have also shared clips of bots preferring to throw punches over using their guns, and others absorbing bullets while furiously jumping around the map.",
    "Not everyone is finding the bots a challenge, of course, but most have praised the Halo Infinite beta for its “vicious AI” and the refreshingly-competent difficulty of what is merely a technical test, at this stage.",
    "Brian Jarrad also confirmed the bots would get harder as the beta continues, too, tweeting that players can expect “ODST difficulty” and a new map to play on in the coming days.",
    "As mentioned, this isn’t a fully-fledged beta for Halo Infinite – that’s expected to come later down the line – but it does represent a chance for players to get a hands-on glimpse of a hotly-anticipated game, and gives developers the opportunity to gauge feedback and implement improvements before release.",
    "Technical previews aren’t something we see all too often when it comes to AAA titles like Halo Infinite, and players have expressed their appreciation to 343 for dry-running Halo Infinite to ensure the best possible release come the end of 2021.",
    "This won’t be the last test, either. Future previews for Halo Infinite – and indeed a full-blown beta – are expected to introduce PvP multiplayer functionality alongside more maps and modes.",
    "There’s no word yet on when those future tests will arrive, but in the meantime, stay tuned to TechRadar for all the latest updates on Halo Infinite."
  ],
  "headers": {
    "8": "Analysis: The right way to test?"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "reiterated": "https://twitter.com/ske7ch/status/1420855926542639105",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "praised": "https://twitter.com/PyneeApple/status/1421014611449417728",
    "tweeting": "https://twitter.com/ske7ch/status/1421005093839593479",
    "latest updates": "https://www.techradar.com/reviews/halo-infinite"
  }
}