{
  "source": "https://www.techradar.com/news/doom-eternal-could-be-getting-a-vr-port-after-listing-leaks-new-2021-game",
  "title": "Doom Eternal VR game seems likely as new Bethesda title gets leaked",
  "category": "gaming",
  "updated": "2021-01-26T13:43:29Z",
  "author": "henry-st-leger",
  "summary": "Project 2021A is coming, whatever it is",
  "article": [
    "The hell-razing FPS game Doom Eternal could be getting a VR port this year, after an online listing on an Australian government website appeared to leak the news.",
    "Australia's media classification board has confirmed the existence of a VR game coming from Bethesda, developed by the team at id Software. The working title is currently just \"Project 2021A\", suggesting the game is set to release this year – but there are plenty of reasons to assume that the game could be Doom Eternal.",
    "The listing appeared on January 22, and is clearly for a \"computer game\" played in \"virtual reality\"; it's also rated as an 18+ title with \"high impact\" violence.",
    "Bethesda famously brought its 2016 reboot of Doom to virtual reality headsets with the Doom VFR port – no hints on what the 'F' in that stands for – allowing players a way to run, gun, and chainsaw through demonic entities with more immersion than ever before.",
    "Doom Eternal, its direct sequel, launched in early 2020, and now would be a great time to announce a VR port – especially as the game came to Nintendo Switch in December, nine months after landing on consoles and PC. VR is the final destination for this game, and we'd be very shocked if Doom Eternal VR wasn't the subject of this listing.",
    "We could always be surprised with a new IP or port of another id Software title, such as Wolfenstein: Youngblood, which launched in 2019 on consoles and PC.",
    "With Bethesda committing to more VR ports, Valve getting back into single-player games after the landmark Half-Life: Alyx, and the Oculus Quest 2 offering standalone VR that doesn't compromise on performance for the price, the medium is steadily becoming more ambitious, more rewarding, and more affordable.",
    "Of course, we're still at a point when VR doesn't make up too much of the gaming space, and flagship ports like Doom Eternal do a lot of work in building bridges between PC/console gaming and VR. As much as VR needs exclusive titles to make it feel necessary, and show what only VR games can do – Half-Life: Alyx, for example – collaboration with big studios on tentpole games can make sure existing fan bases pay attention."
  ],
  "headers": {
    "6": "We're all doomed..."
  },
  "links": {
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "VR game": "https://www.techradar.com/best/the-best-vr-games",
    "listing": "https://www.classification.gov.au/titles/project-2021a",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "nine months after landing on consoles and PC": "https://www.techradar.com/news/doom-eternal-blasts-onto-nintendo-switch-with-motion-controls-included",
    "Valve getting back into single-player games": "https://www.techradar.com/news/half-life-alyx-could-be-just-the-start-as-valve-confirms-more-single-player-games",
    "Half-Life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}