{
  "source": "https://www.techradar.com/news/what-is-dogecoin-all-you-need-to-know-about-the-meme-cryptocurrency-explained",
  "title": "What is Dogecoin? All you need to know about the meme cryptocurrency, explained",
  "category": "computing",
  "updated": "2021-02-08T12:15:42Z",
  "author": "joel-khalili",
  "summary": "Dogecoin cryptocurrency is soaring in value, but why?",
  "article": [
    "The value of meme cryptocurrency Dogecoin (DOGE) soared to new heights over the weekend, fuelled by social media posts from Tesla founder Elon Musk and rapper Snoop Dogg.",
    "The digital currency is currently priced at $0.077 per coin, down slightly from highs of $0.087, making it the 10th largest cryptocurrency in the world by market capitalization.",
    "Despite the fact Dogecoin was created as a joke, the altcoin has made gains of more than 1,250% since the turn of the year, outperforming both Bitcoin and Ether (the currency of the Ethereum network).",
    "As per the official website, “Dogecoin is a decentralized, peer-to-peer digital currency that enables you to easily send money online”.",
    "It was created jointly by IBM developer Billy Markus and Adobe data scientist Jackson Palmer, who launched the cryptocurrency in 2013 as a “fun” and “friendly” alternative to Bitcoin, satirizing the online frenzy around cryptocurrencies.",
    "The name has its origins in the Doge meme that rose to prominence on Tumblr and Reddit in 2012-13. For anyone unfamiliar, a meme can be described as any form of viral content, typically humorous in nature, that is edited and reposted by a large number of people online. Famous examples include, Trollface, Distracted Boyfriend and Success Kid.",
    "According to meme database Know Your Meme, the Doge meme is characterized by captioned images of the now famous Japanese Shiba Inu, designed to represent the dog’s inner monologue. In order to qualify as an authentic Doge meme, the image must be captioned in Comic Sans font and contain at least one “wow”, but editing of the source image is encouraged.",
    "Dogecoin is based on the Luckycoin protocol, itself built on Litecoin, and can be “mined” in the same way as many other digital currencies. While the supply of most popular cryptocurrencies is limited (a mechanism designed to simulate scarcity and safeguard against inflation), the supply of Dogecoin is effectively limitless.",
    "To date, Dogecoin has largely been used to tip small amounts of money to content creators on social media platforms.",
    "Since November, the value of cryptocurrencies across the board have been on an upward trend, with Bitcoin reaching heights of $41,940 per coin.",
    "As the price of Bitcoin rises, a groundswell effect typically sees the value of other cryptocurrencies spike as well, as investors who fear they have missed the boat seek alternative avenues to cash in.",
    "The recent Gamestop short squeeze may also have played a part in the rise in the price of Dogecoin, by driving interest in trading and investment among amateur investors.",
    "However, the soaring value of Dogecoin can be attributed in large part to the social media activity of a handful of high-profile figures. On February 4, the price of Dogecoin rose by 50% after Elon Musk posted a message to Twitter, asserting that “Dogecoin is the people’s crypto”.",
    "Since then, KISS frontman Gene Simmons has declared himself the “God of Dogecoin” and encouraged people to “HODL” (or hold onto the cryptocurrency), while American rapper Snoop Dogg has published an edited version of a piece of cover art, with an image of Doge pasted over his own face.",
    "The social media frenzy caused by the trio sent the price of Dogecoin shooting up again last night. The unofficial goal is to push the joke cryptocurrency to a valuation of $1 per coin, which would represent a further 1,230% gain on its current position.",
    "Unfortunately, not all cryptocurrency exchanges support Dogecoin transactions, so your choice of platform is limited. Binance and Kraken are the two largest exchanges to offer Dogecoin, but the currency can be purchased via a handful of smaller providers too.",
    "However, anyone considering investing significant sums in Dogecoin should do so with caution. Cryptocurrencies are notoriously volatile, which makes for a risky investment for anyone that cannot absorb considerable losses. Further, the satirical nature of the Dogecoin project means price gains are not tied to underlying fundamentals, meaning there is little intrinsic value to prop up the price."
  ],
  "headers": {
    "3": "What is Dogecoin?",
    "9": "Why is the Dogecoin price rising?",
    "15": "Where to buy Dogecoin"
  },
  "links": {
    "altcoin": "https://www.techradar.com/news/what-are-altcoins-everything-you-need-to-know",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Ethereum": "https://www.techradar.com/news/ethereum-20-goes-live-next-month-heres-why-thats-a-huge-deal",
    "official website": "https://dogecoin.com/",
    "Trollface": "https://knowyourmeme.com/memes/trollface",
    "Distracted Boyfriend": "https://knowyourmeme.com/memes/distracted-boyfriend",
    "Success Kid": "https://knowyourmeme.com/memes/success-kid-i-hate-sandcastles",
    "Know Your Meme": "https://knowyourmeme.com/memes/doge",
    "mined": "https://www.techradar.com/best/mining-rigs",
    "Gamestop short squeeze": "https://www.techradar.com/news/gamestop-fever-rwallstreetbets-and-the-stock-trading-frenzy-explained",
    "declared himself": "https://twitter.com/genesimmons/status/1357944161849151488",
    "pasted over his own face": "https://twitter.com/SnoopDogg/status/1358141965930426368",
    "cryptocurrency exchanges": "https://www.techradar.com/best/mining-rigs"
  }
}