{
  "source": "https://www.techradar.com/news/vauxhalls-latest-electrified-grandland-suv-is-full-of-fancy-tech",
  "title": "Vauxhall’s latest electrified Grandland SUV is full of fancy tech",
  "category": "car-tech",
  "updated": "2021-06-09T09:49:08Z",
  "author": "axel-metz",
  "summary": "Practical gadgetry",
  "article": [
    "Vauxhall has announced the latest plug-in hybrid (PHEV) version of its sporty Grandland SUV – and it’s packed to the rafters with gadgets.",
    "We haven’t yet seen details of its performance specs, but the new plug-in hybrid Grandland – which is arriving alongside a traditional combustion engine model – boasts impressive new hardware that Vauxhall says represents “benchmark technologies” for the automotive industry.",
    "Among this hardware is tech related to infotainment, driver assistance and on-board comfort systems, which complement the Grandland’s striking design language – similar to that which we’ve seen in the new Mokka-e.",
    "Let’s start with its cockpit. The new Vauxhall Grandland sports a fully digital cockpit made up of two widescreen displays (10 and 12 inches, respectively) where drivers will be able to control functions like the new adaptive IntelliLux LED Pixel Light system – that’s adaptive headlights, basically – and Night Vision, which detects pedestrians and animals in darkness at a distance of up to 100m.",
    "The new Grandland is the first Vauxhall model to benefit from this technology, while the IntelliLux headlight system has been carried over from the company’s flagship saloon, the Vauxhall Insignia.",
    "From the cockpit, drivers will also be able to control the new semi-adaptive Highway Integration Assistance system, which keeps the car in the middle of its lane and maintains distance to the vehicle in front. The system will allow for “stop & go” progress in traffic, too – though the new Mokka-e also has this feature.",
    "Vauxhall says the Grandland boasts a 360-degree panoramic camera intended to make manoeuvring easier for the driver via a front and rear camera, with the central infotainment display able to display a bird's eye view of the car’s surroundings.",
    "Automatic parking assistance is also available in the new Grandland, too, with the system able to identify longitudinal and transverse parking spaces and steer the car in and out automatically. Meanwhile, a blind spot warning system will prevent potential collisions when turning or changing lanes.",
    "As standard, though, the Grandland will come with several gadgets and gizmos that won’t demand you fork out any extra bucks. For example, every PHEV model will arrive with the emergency braking and pedestrian detection system, lane departure warnings, traffic sign recognition, drowsiness detection and cruise control.",
    "It’s also got some award-winning front seats, too, which Vauxhall says have been certified by back health professionals to help support good posture. They’ll feature electric seat tilt functionality and electro-pneumatic lumbar support, though heating and ventilation options will cost extra.",
    "All in all, then, the new Vauxhall Grandland is aiming to deliver high-tech gadgetry in an affordable SUV package. Pricing for the car is yet to be announced, but we do know deliveries are scheduled to begin in the UK in Autumn."
  ],
  "headers": {
    "8": "Standard fare"
  },
  "links": {
    "Mokka-e": "https://www.techradar.com/news/vauxhall-mokka-e-review"
  }
}