{
  "source": "https://www.techradar.com/news/prime-day-shows-ps5-game-prices-will-fall-its-just-going-to-take-a-while",
  "title": "Prime Day shows PS5 game prices will fall – it's just going to take a while",
  "category": "gaming",
  "updated": "2021-06-23T03:14:59Z",
  "author": "samuel-roberts",
  "summary": "Saving $20 on Returnal is a good start",
  "article": [
    "In the UK, one of the most contentious things about the PS5 is the price of the games. They're £69.99, and while you can go digging at smaller retailers to find single figure discounts on that, there's no getting around how pricey that is.",
    "Imagine my mild envy, then, when I saw that Amazon US had cut the prices of PS5 games like Returnal and Demon's Souls to just $49.99 across the Prime Day deals period – that's a little over £35 in the UK, though that doesn't include any sales tax. Still, the difference is pretty big, even if we saw comparable UK prices on some of these games during the Days of Play event last month (though not on Returnal, which is a newer title).",
    "The PS5's roaring success, combined with the constant challenges with finding stock of the console, did make me wonder Sony's willingness to drop the prices of its exclusive games would be affected. After all, while the console's user base is small, these games probably need to keep their value while they sell enough copies to recoup their costs.",
    "That tends to be why console manufacturers aren't generally in a rush to drop the prices of games, at least in the early part of each generation. That's one of the reasons budget re-releases happen much deeper into the console's lifespan.",
    "Still, big discounts like this are encouraging – though I still think they'll be few and far between for the time being. Here they are for US readers, if you still want to get them:",
    "While the US definitely had better PS5 game deals to enjoy than the UK over Prime Day, it wasn't a total waste of time. Ubisoft games like Watch Dogs Legion and Immortals Fenyx Rising took big price cuts for next-gen consoles on Amazon UK – meaning customers could pick up full-fat next-gen versions of these blockbusters for relatively small prices.",
    "These deals make more sense. Since Ubisoft is a third-party publisher, it relies on multiformat sales across existing consoles like the PS4 and Xbox One, as well as PC – it's partially dependent on game sales from PS5 owners, but not fully like Sony is with its new generation exclusives.",
    "That's why over the coming months, the deeper discounts you'll see on next-gen games are more likely to come from third-party publishers than console manufacturers. We'd love to be proven wrong, and see Sony slice those high prices down some more, but ultimately it's hard to see what the incentive is for the company to drop those any further than it is now.",
    "After all, many of the people who want to buy these games are still waiting for the opportunity to get the console that actually plays them. That's why Spider-Man: Miles Morales has been a mainstay of the top 10 best-selling games in the UK for more than six months.",
    "Compared to $70 games on PS5, Microsoft's commitment to Xbox Game Pass demonstrated by its lineup at E3 looks pretty great. You pay a flat monthly fee, and get access to all the games above, even if Sony still has the hotter exclusives on paper – something I don't expect to change soon.",
    "That's Xbox making the most of Microsoft's deep pockets. But Game Pass does also encourage its subscribers to think hard on the value of games – players will have a different relationship to something they can download and play for two hours as part of a subscription fee, compared to a traditional full-priced game.",
    "That's potentially a sign of where things are going, in terms of consumer behavior. But what I think is interesting about Sony's strategy is that it's essentially stopped games from being an impulse purchase – £70 is a price point I have to genuinely think about. I've taken the plunge a few times, most recently on Ratchet and Clank: Rift Apart, but not before sourcing PSN credit from cheaper (though legal, I will add) sources.",
    "Don't get me wrong, games that cost £50 required me to sit and think about whether they were worth it, too. But this generation, retailer discounts and even the used game market might matter more than ever for PS5 owners – after all, Sony fully controls its ecosystem with digital sales, even if more and more people are happy to buy their games in that way. In a world where new games cost more than they did five years ago, though, I'll happily take physical copies when I know they're more likely to drop in price faster.",
    "Hell, Demon's Souls is a game I bought off some dude on eBay at the end of last year – and I'm sure it won't be the last time that happens. Anything I can do to avoid paying £70 for a game is worth it."
  ],
  "headers": {
    "5": "Why third-party publisher games are cheaper on PS5",
    "9": "Is Xbox Game Pass shifting our perception of game prices?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "stock": "https://www.techradar.com/news/where-to-buy-ps5",
    "top 10 best-selling games": "https://www.gamesindustry.biz/articles/2021-06-20-ratchet-and-clank-rift-apart-sells-more-in-its-second-week-than-its-first-uk-boxed-charts",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart"
  }
}