{
  "source": "https://www.techradar.com/news/the-airpods-3-are-already-in-production-according-to-a-new-report",
  "title": "The AirPods 3 are already in production, according to a new report",
  "category": "audio-visual",
  "updated": "2021-09-17T21:59:06Z",
  "author": "nick-pino",
  "summary": "An AirPods 3 release date could be before the end of 2021",
  "article": [
    "After months of rumors, it came as a surprise to some that Apple didn’t unveil the AirPods 3 at this week’s California Streaming iPhone 13 launch event.",
    "However, a new report says that there’s no need for concern – they’re in production and could be here before the end of the year.",
    "The report comes by way of Digitimes, and claims that the next true wireless earbuds have a finalized design and are in production. The report stops short of giving us an exact release date or price for the earbuds, but seems to suggest that they’ll be available before the end of the year and only cost slightly more than the AirPods’ current $159 / £159 / AU$229 sticker price.",
    "Apple, of course, has yet to corroborate or even acknowledge the rumor – but it does seem to be plausible given how much we’ve already heard about the forthcoming earbuds.",
    "According to Bloomberg, which spoke with people familiar with the plans, the AirPods 3 could include motion sensors for fitness tracking and integration with Apple Fitness Plus, along with noise reduction.",
    "We’re also expecting to see support for spatial audio and better battery life, as well as a design similar to the AirPods Pro with shorter stems.",
    "We’re also hoping there’s a chance that the AirPods 3 will have outright active noise cancellation similar to the AirPods Pro – but unfortunately that hasn’t shown up in any of the reports we’ve seen so far.",
    "At this point, we’re still waiting to see what the final model will look like – but if it truly is out in production now, it’s only a matter of time before it pops up and you can bet we’ll be covering it when it does."
  ],
  "headers": {
    "4": "How will the AirPods 3 be different?"
  },
  "links": {
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Digitimes": "https://www.digitimes.com/backgrounders/features/snapshots.asp",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-28/apple-plans-redesigned-airpods-for-2021-new-airpods-pro-in-2022?sref=10lNAhZ9",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review"
  }
}