{
  "source": "https://www.techradar.com/news/resident-evil-4-vr-will-release-next-month-exclusively-on-oculus-quest-2",
  "title": "Resident Evil 4 VR will release next month, exclusively on Oculus Quest 2",
  "category": "gaming",
  "updated": "2021-09-28T09:16:24Z",
  "author": "jamel-smith",
  "summary": "Now you can actually be Leon",
  "article": [
    "The survival horror classic, Resident Evil 4 launches exclusively on the Oculus Quest 2 on October 21 in an all-new format – VR.",
    "Resident Evil 4 VR gives the 2005 classic a fresh coat of paint, with various aspects of RE4 totally reworked for VR. As well as taking place from a first-person viewpoint, RE4 VR supports full-motion movement and teleportation travel. While teleportation will take some time to get used to for old-school players, RE4 VR does provide the player with different locomotion options for different comfort levels. Players can also play sat down or stood up, or if players don’t like teleporting around a rural village in Spain, they can use analog sticks to move around instead. Players can also utilize turn snapping and quick turning options.",
    "Additional interactivity has been added to gameplay to enhance the gameplay experience. Players will be able to draw weapons and items from their virtual bodies, plus players will now need to virtually reload their weapons if they want to keep those monsters away, using an in-game gesture. Puzzles have been reworked to be more interactive, and even the typewriter you use to save with has been reworked for VR.",
    "From IGN’s hands-on preview, there’s some clunkiness present with RE4 VR. The teleportation movement coupled with the virtual reloading can be hard to handle, especially in moments with multiple mobs coming at Leon, as you’d have to be on the move and attacking at the same time. The jump from Leon’s first-person view to him being on a ladder in third-person is also a bit jarring. This new VR experience will take some time for players to get used to, it seems, but we’ll have our own full impressions of Resident Evil 4 VR as the game draws closer to release.",
    "Via IGN"
  ],
  "headers": {
    "3": "VR quirks"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "IGN’s hands-on preview": "https://www.ign.com/articles/resident-evil-4-vr-hands-on-preview-oculus-quest",
    "IGN": "https://www.ign.com/articles/resident-evil-4-vr-release-date-oculus-quest-2"
  }
}