{
  "source": "https://www.techradar.com/news/dead-space-remakes-new-necromorph-tech-is-really-a-peeling",
  "title": "Dead Space remake’s new necromorph tech is really a-peeling",
  "category": "gaming",
  "updated": "2021-09-01T09:18:05Z",
  "author": "adam-vjestica",
  "summary": "A little off the top, please",
  "article": [
    "Developer Motive Studio shared new details about the upcoming Dead Space remake in an almost hour-long Twitch stream on August 31, including how the game’s story, combat, and gameplay mechanics have been tweaked for the PS5, Xbox Series X|S, and PC reboot.",
    "One particularly gruesome new mechanic that caught the eye is how you can expose the innards of necromorphs via a new technique called ‘peeling’ – which is exactly what it sounds like.",
    "Previously, players could dismember the limbs of encroaching necromorphs using Isaac Clarke’s plasma cutter and various other weaponry. But in the remake, you’ll need to peel back the flesh of Isaac’s sinewy adversaries and expose the bone before you can lop off a leg or flailing arm like some sort of deranged surgeon.",
    "The ‘dynamic flesh peeling system’ also acts as a damage indicator for when you’re using weapons that don’t revolve around amputation, like the pulse rifle, so it should be more obvious when you’re about to finish off your foe – handy with ammo being so scarce.",
    "It’s clear that the peeling mechanic will impact how Dead Space plays, then, and creative director Roman Campos-Oriola said it should encourage players to use different weapons to get the job done.",
    "“For us what is interesting is this opens a whole new layer of shooting and combat loop, where you can have some weapons that are better at carving through the enemies and some that are better at cleaning them and removing their flesh,” said Campos-Oriola.",
    "The Dead Space remake incorporates two quality of life changes from Dead Space 2 as well. Isaac will now have a voice and will speak during conversations with other characters and when appropriate. Changes have also been made to the zero-g simulation sections that make the game feel more realistic and easier to navigate.",
    "“Now you can interact as you fly around, go into tighter corridors and it allows us to revisit some of the old content and introduce new ways to navigate,” Campos-Oriola explained. “It allows us to create new environments with new challenges to surprise the people who know the game.”",
    "Even though it’s early in development, the Dead Space remake looks like it’s shaping up nicely. By sticking to the core foundation of what made the original so great, Motive Studio appears to be focusing on making careful and considered changes.",
    "This will also be reflected in the remake’s story, which Campos-Oriola said will stay faithful to the original, but will be enriched with new elements and additional content – none of which will be hidden behind microtransactions (as in Dead Space 3).",
    "While remakes can sometimes be a poisoned chalice due to nostalgia masking many of the game’s flaws, we’ve seen some fantastic revivals in recent years including Resident Evil 2 and the sublime Final Fantasy VII Remake. If Dead Space can come close to matching either of those, we’re in for a treat."
  ],
  "headers": {
    "8": "Analysis: A faithful remake with pleasing additions"
  },
  "links": {
    "Dead Space": "https://www.techradar.com/news/dead-space-remake/news/dead-space-remake",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Resident Evil 2": "https://www.techradar.com/reviews/resident-evil-2-remake-review",
    "Final Fantasy VII Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake"
  }
}