{
  "source": "https://www.techradar.com/news/siri-is-yet-to-regain-crucial-accessibility-features-that-disappeared-with-ios-15",
  "title": "Crucial accessibility features are returning to Siri in iOS 15.2",
  "category": "phones",
  "updated": "2021-12-08T10:15:59Z",
  "author": "darren-allan",
  "summary": "Some good news for those who rely on these capabilities",
  "article": [
    "Update: After contacting Apple, we heard back from the company that these important Siri features will be reinstated with the iOS 15.2 update, which is great news.",
    "Original story follows...",
    "Apple is still yet to reinstate functionality which was removed in iOS 15, where Siri could perform various tasks such as checking and playing voicemails.",
    "The commands in question are valuable on the accessibility front, with the visually impaired or legally blind – or indeed other Apple device owners – are able to use them to keep on top of their voicemail as mentioned, or to instruct Siri to send an email, check recent calls, or call history.",
    "MacRumors highlighted the functionality which went missing back in September, just after iOS 15 was released, and the site reminds us that these features haven’t been restored to Siri, despite growing complaints around this.",
    "One reader told MacRumors: “For many fully blind people (like my blind mom) this makes their phone almost unusable, because they can’t ask Siri who has called, and they can’t ask Siri if they have voicemail. (Their official ‘workaround’ for voicemail, in fact, is calling the old-school carrier voicemail number, to check your voicemail over the phone.)”",
    "Another message on Apple’s support forum reads: “My cousin who is legally blind is also experiencing this issue. He uses the read missed call and open voicemail when doctors call and leave messages. It allows him the opportunity to hear who called and he can call back. It has been a wonderful feature for him and I’m hoping that a fix will happen so that he can be able to use the feature again.”",
    "There are also complaints on Reddit like this: “My dad is blind and uses Siri to operate a lot of his iPhone. This week we’ve noticed when he asks Siri to play voicemail or missed calls she says she can’t help with that.”",
    "We've reached out to Apple for comment and will update this story once we hear back.",
    "It’s unclear whether Apple intentionally removed the support for these features with iOS 15 – and if so, why that was done – or if it’s wrapped up in some bug – and if it’s the latter, whether a fix is coming soon. But whatever the case, this represents a worrying step backwards in terms of accessibility for iOS devices, to say the least.",
    "While Apple itself hasn’t commented directly, as MacRumors notes – we’ve also reached out to the company to try and ascertain what’s going on here, and will update this story if we hear back – one message on the Apple help forum claims to have had a reply from the Accessibility Support team. They were advised to again contact Accessibility Support and “have your Apple ID added to the official engineering issue as an ‘affected user’ so that you receive the mass emails about the status of this fix”.",
    "Further advice was to submit feedback on the missing features, as the more of that feedback which is gathered “does affect engineering’s prioritization of this issue”.",
    "There may be hope yet, then, for some kind of return of these capabilities to Siri in the near future. Fingers crossed."
  ],
  "headers": {
    "5": "An inaccessible Siri for some",
    "9": "Analysis: Reasons why are unclear – but keep the feedback flowing on this"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/how-to/how-to-get-ios-15-developer-beta-on-your-iphone",
    "MacRumors": "https://www.macrumors.com/2021/12/06/apple-no-siri-fix-low-vision-features/",
    "Siri": "https://www.techradar.com/news/siri-10-year-anniversary",
    "Apple’s support forum": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1095456824984515600&sharedId=trd-us&u=https%3A%2F%2Fdiscussions.apple.com%2Fthread%2F253163465%3FanswerId%3D256431658022",
    "Reddit": "https://www.reddit.com/r/Blind/comments/pvk6hi/siri_not_playing_missed_calls_or_voicemails/",
    "iPhone": "https://www.techradar.com/deals/iphone-deals",
    "Apple help forum": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8719879989959017000&sharedId=trd-us&u=https%3A%2F%2Fdiscussions.apple.com%2Fthread%2F253163465%3FanswerId%3D256431658022"
  }
}