{
  "source": "https://www.techradar.com/news/halo-infinites-next-multiplayer-preview-includes-big-team-battle-and-arena-modes",
  "title": "Halo Infinite's next multiplayer preview includes Big Team Battle and Arena modes",
  "category": "gaming",
  "updated": "2021-09-21T10:15:47Z",
  "author": "vic-hood",
  "summary": "Halo Infinite's PvP-focused preview kicks off this weekend",
  "article": [
    "343 Industries has confirmed it will hold two Halo Infinite PvP-focused, multiplayer previews, one this weekend and another next - allowing some players to try out the game's upcoming Big Team Battle and Arena modes.",
    "The first multiplayer preview is set to run from September 23 to September 26 , and will be open to Halo Insiders who signed up before September 13. The second preview will take place from September 30 to October 3 and will grant access to more eligible Halo Insiders. If you've been selected, you'll receive an email letting you know - but there's still time to sign up for the second preview weekend.",
    "It's also worth noting those who are selected won't have access to the multiplayer preview the entire weekend. Instead multiplayer will only be available during both periods from 10am PT / 6pm BST / 1pm ET (the next day at 3am AEST) to 2pm PT / 10pm BST / 5pm ET (7am the next day AEST) and from 5pm PT / 8pm ET (1am BST and 10am AEST the next day) to 9pm PT / 12am ET (5am BST and 2pm AEST the next day) throughout both weekends. However, players will have access to Weapon Drills, Battle Pass, Training Mode and Customization throughout the whole weekend.",
    "Another thing to note is that players won't have access to Big Team Battle both weekends. Instead, this coming weekend will grant access to 4v4 Arena mode and next weekend's preview will grant access to both Arena mode and 12v12 Big Team Battle mode.",
    "In a Halo Waypoint post, 343 Industries' community manager John Junyszek explained the reason behind these set multiplayer matchmaking times.",
    "\"Our primary goal for these two tech previews will be to test our online services at a larger scale than ever before,\" Junyszek wrote.",
    "\"To help focus our population and test our servers even more, matchmaking will be limited to set periods of time each day.\"",
    "\"Jumping on during these play sessions will help us prepare our on online services ahead of launch. We will also be expanding our audience ahead of the second weekend, so you and your friends (who may have forgotten to register as Halo Insiders in time) can join us for some Big Team Battle and push the servers even further. Stay tuned for more information on that within the next week.\"",
    "Halo Infinite will live or die by its player-versus-player multiplayer, so these PvP-focused multiplayer previews are important to both fans and 343 Industries alike.",
    "The first Halo Infinite preview allowed players to try out the new Halo's multiplayer in a game of 4v4 Slayer. However, while players played alongside humans, they were battling against bots rather than real players.",
    "While the first Halo Infinite multiplayer beta was generally well-received, these PvP previews will allow players to try out one of the series' cornerstones and could be the decider for many on whether they want to pick up Master Chief's next outing, though it's worth noting that Halo Infinite's multiplayer will be free-to-play.",
    "What's more, these previews will grant access to the next generation of two fan-favorite modes: Arena and Big Team Battle. Big Team Battle, which wasn't available in the previous preview, is even bigger in Infinite, allowing for a whopping 12 players per team. While Arena, which was well-received in the first preview, will finally let players take on human adversaries rather than bots.",
    "There's not much longer to go until Halo Infinite releases on December 8, 2021, but we've still heard very little about the game's campaign mode. Hopefully, in the coming months, we'll get a closer look at what Master Chief's next adventure will involve."
  ],
  "headers": {
    "8": "Analysis: the real test"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "sign up": "https://t.co/FpliK6rSHS?amp=1",
    "Halo Waypoint post": "https://www.halowaypoint.com/en-us/news/inside-infinite-september-2021"
  }
}