{
  "source": "https://www.techradar.com/news/heres-why-paying-ransomware-hackers-might-actually-not-be-that-bad",
  "title": "Here's why paying ransomware hackers might actually not be that bad",
  "category": "computing",
  "updated": "2021-06-21T11:29:07Z",
  "author": "mayank-sharma",
  "summary": "Insurance and tax breaks could encourage victims to pay attackers",
  "article": [
    "Even as the FBI is actively discouraging ransomware victims to not pay cyber tormentors, the US government may indirectly be incentivizing the payments by treating them as tax deductible.",
    "Several tax lawyers and accountants told the Associated Press that while the US’ Internal Revenue Service (IRS) doesn’t have separate guidance on ransomware, victims can claim these as “ordinary and necessary” business expenses.",
    "“I would counsel a client to take a deduction for it,” a corporate tax attorney with Alston & Bird, Scott Harty, told the Associated Press.",
    "Don Williamson, a tax professor at the Kogod School of Business at American University, wrote a paper about the tax consequences of ransomware payments in 2017, and agrees that the growing number of ransomware attacks have indeed helped businesses claim the payments as ordinary business expenses.",
    "FBI Director Christopher Wray recently testified before Congress, reaffirming the agency’s position that businesses should not give in to the demands of their attackers.",
    "Despite this, Neustar recently discovered that over half of attacked businesses would simply pay their attackers and regain control of their networks, instead of prolonging the downtime, which could have a detrimental effect down the supply chain depending on the nature of their business.",
    "Furthermore, in addition to the guidance from law enforcement agencies, a section of cybersecurity experts have long discouraged the payments, arguing that these only embolden the criminals and lead to more ransomware attacks.",
    "This was underlined by a recent Cybereason survey, which revealed that over 80% of victims who pay a ransom are targeted again - often by the same ransomware operators.",
    "But the tax deduction now emerges as another incentive, which although not very well-known, nor regularly exercised, indirectly neutralizes the guidance and recommendations of law enforcement agencies and security experts."
  ],
  "headers": {
    "4": "Not a solution"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "tax": "https://www.techradar.com/best/best-tax-software",
    "told the Associated Press": "https://apnews.com/article/technology-business-government-and-politics-d8c1e9958ad1e89eab83f44e6ca70a94",
    "growing number of ransomware attacks": "https://www.techradar.com/news/ransomware-attacks-are-becoming-more-dangerous-than-ever",
    "simply pay their attackers": "https://www.techradar.com/news/most-businesses-would-consider-paying-in-the-event-of-a-ransomware-attack",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "ransom are targeted again": "https://www.techradar.com/news/most-ransomware-victims-who-pay-up-just-get-attacked-again"
  }
}