{
  "source": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
  "title": "Paramount Plus: apps, devices, free trial, launch time, shows and what we know",
  "category": "entertainment",
  "updated": "2021-10-07T13:14:43Z",
  "author": "samuel-roberts",
  "summary": "New streaming service on the block - Paramount Plus",
  "article": [
    "Paramount Plus is holding its own in the streaming wars in the US. The rebranding of CBS All Access launched in March and the streaming service’s library is building nicely. This is the home of originals such as RuPaul’s Drag Race All Stars and the reboot of Rugrats as well as classic titles like Titanic and Grease.",
    "Alongside the big-budget originals like the Halo TV series and Star Trek: Strange New Worlds, Paramount Plus will give you access to CBS sports, including the NFL and UEFA soccer matches. Or you can catch up on the latest events in the world with the 24 hour streaming news on CBSN.",
    "If you’re looking for something for the family, Paramount Plus is the home to The SpongeBob Movie: Sponge on the Run, the PAW Patrol movie and The Fairly OddParents. Not to mention the reboot of Nickelodeon classic, iCarly.",
    "The Paramount Plus app also features dedicated hubs to ViacomCBS’ various owned content arms - Nickelodeon, Comedy Central, MTV, BET and The Smithsonian Channel",
    "With over 30,000 hours of content available to watch, Paramount Plus has only grown since its launch at the start of the year. In the future, the streaming service is aiming to become a more global platform, aiming to hit 45 markets by the end of 2022 - including the UK via Sky platforms.",
    "But is it the streaming service for you? Below we’ll tell you everything we know about Paramount Plus, including whether it has a free trial, which shows are coming to the service and which devices are compatible with the service’s app.",
    "It's here! Paramount Plus launched in the US on March 4, 2021, along with parts of Latin America. The Nordics received the streaming service on March 25, while Paramount Plus landed in Australia in August. On March 4, the CBS All Access service in Canada also switched names to Paramount Plus.",
    "The streaming service will be coming to the UK in 2022 via Sky platforms and is aiming to be available in 45 markets by the end of next year.",
    "Yes. Paramount Plus has a 7-day free trial, which you can get here. That should be just enough time check out what is available on the streaming service and decide if it's the one for you.",
    "Paramount Plus is both a new video streaming service made for a global audience, and a rebranding of the existing CBS All Access service. Outside the US, most countries don't have CBS All Access, meaning ViacomCBS has little in the way of a streaming footprint. So, while the rebranding part is important for US customers, the global ambition is what matters here on a wider level.",
    "The aim is to draw on a deeper well of content from the parent company's portfolio, with a library of older shows and movies alongside a selection of originals. CBS All Access already features news and sports content, like UEFA matches – whatever you're already enjoying on CBS All Access will form a key part of Paramount Plus, too.",
    "Paramount Plus features over 30,000 episodes of TV shows and 2,500 movies, as well as a whole host of original shows to get stuck into.",
    "Internationally, the content will vary depending on current licensing deals. For example, Amazon has the rights to show Star Trek: Picard outside the US as it stands – so don't expect to see an identical library globally, at least at first.",
    "The Paramount Plus price is $9.99 per month without ads, or $4.99 with ads. Both tiers will feature the same selection of on-demand originals and library content, but the difference is access to local CBS stations – that's exclusive to the higher tier. You also get live CBS TV and more sports through the higher tier option. The image above breaks it all down.",
    "Or sign up for an annual plan to save 16%, making the essential plan $4.17 a month and the premium $8.33.",
    "Paramount Plus is available on the following supported devices, according to this help page:",
    "Like any major streaming service, Paramount Plus features a host of new originals, complementing the CBS All Access shows already available. At launch, the original shows include docuseries For Heaven's Sake, Tooning Out the News from Stephen Colbert, a reboot of MTV's The Real World Homecoming and SpongeBob prequel series Kamp Koral.",
    "Originals that were on CBS All Access like Star Trek: Discovery, Star Trek: Picard, Star Trek: Lower Decks, The Good Fight and Why Women Kill are now on Paramount Plus and future seasons will be Paramount Plus originals. You can also find The Twilight Zone reboot on the service, which has ended after two seasons.",
    "In addition, CBS shows can be found on the service after they air. These include The Equalizer and Young Sheldon.",
    "So, what's coming up in the future? That's the most exciting part of the service – a lot of new originals are planned.",
    "Behind the Music is back - a new version of the MTV show is on Paramount Plus. The show features interviews with both new and legacy artists to find out the moments they'll never forget.",
    "TV shows based on the movies The Italian Job, The Parallax View, Love Story and Flashdance are confirmed, too, while the TV series Criminal Minds is being revived for a 10-episode serialized run.",
    "Oil drama Land Man is also coming, along with Michigan-based incarceration industry drama Mayor of Kingstown. A TV version of The Man Who Fell to Earth, starring Chiwetel Ejiofor (Doctor Strange, 12 Years a Slave) is in the works, too.",
    "Halo, launching in early 2022, and based on the popular games of the same name, feels like the closest the service has to a massive The Mandalorian-type show in the making – outside of the Star Trek series, anyway. Rugrats has also been revived as a CGI series with the original cast, while a revival of Frasier starring Kelsey Grammer is also in the library. Comedy series Inside Amy Schumer has also been revived on the service, as well as Reno 911!, while Beavis and Butt-Head have returned in a new original movie.",
    "Live-action versions of animated series Dora the Explorer and The Fairly OddParents are also coming to the service, while Nickelodeon series iCarly has been given a revival. A new production house called Avatar Studios has been set up to produce new series, movies, spin-offs and short-form content based on the Avatar: The Last Airbender universe.",
    "You'll also find true crime docuseries on Paramount Plus including Catching Killers. A reboot of BET sitcom The Game is also on the service.",
    "A prequel series to popular cable show Yellowstone – which actually streams on Peacock right now – is also on the way. Y: 1883 is set to premiere on December 19 2021, and focuses on the main show's Dutton family during frontier times. Another Yellowstone spin-off with the working title 6666 is also going to be made.",
    "Star Trek: Brave New Worlds and CG series Star Trek: Prodigy will join the other series on the platform.",
    "Sports on the service will include UEFA soccer, PGA golf, NFL, NCAA basketball, The Masters and National Women's Soccer League. Expect a whole bunch of news-related programming, too.",
    "Paramount Plus is going big on films – but the results might take a little while to emerge. That said, the existing CBS All Access library of movies has a few highlights that are worth checking out at launch, like the Star Trek movies and Indiana Jones films.",
    "The SpongeBob Movie: Sponge on the Run is also a streaming exclusive from launch.",
    "Paramount Plus says it'll stream a host of popular movies, including flicks from the James Bond and Hunger Games series, as well as already hosting The Addams Family and The Avengers, with the library growing to more than 2,500 movies.",
    "Paramount Plus has also made a deal to be the streaming home of MGM's new movies, like No Time To Die, House of Gucci and Creed 3, after they've made their paid TV debut.",
    "Paramount's own movies will obviously play a key part, here, and this is where things start to get really interesting. A Quiet Place Part 2, Paw Patrol: The Movie and Mission: Impossible 7 will immediately debut on the streaming service 30-45 days after they release in theaters.",
    "Other future movies, meanwhile, will arrive after their theatrical runs or pay TV runs, like Snake Eyes, Clifford the Big Red Dog, Top Gun: Maverick, Sonic the Hedgehog 2, Transformers 7, Dungeons and Dragons and Scream, among others.",
    "Existing Paramount films like Dora the Explorer, Sonic the Hedgehog, Rocketman and Bumblebee are all on the service.",
    "Meanwhile, the service is making its own original movies – including new takes on Paranormal Activity and Pet Sematary, and a supernatural movie called The In Between.",
    "As ever, content is king with streaming services. For US customers, CBS All Access already established itself with a number of solid originals, even if it was far from the winner when it came to volume. It's harder to get excited about a new streaming service in 2021 than it used to be, honestly, but if it results in more great big-budget TV shows, it's surely worth the effort.",
    "The likes of Halo show that Paramount Plus means business – and the fast turnaround of movies like Mission: Impossible 7 on the service will help drive subscription growth. It feels like we might be waiting a little while to see the service reach its full potential, however, with many of these new originals seeming far off release.",
    "Still, now it's out in the wild, we'll see what kind of impact it makes with customers."
  ],
  "headers": {
    "6": "Paramount Plus launch time: when is the release date?",
    "8": "Paramount Plus free trial: is there one?",
    "9": "What is Paramount Plus?",
    "13": "What does Paramount Plus cost?",
    "15": "Paramount Plus apps: which devices are compatible?",
    "16": "Paramount Plus shows and originals",
    "29": "Paramount Plus movies",
    "37": "Will Paramount Plus stand out?"
  },
  "links": {
    "RuPaul’s Drag Race All Stars": "https://www.techradar.com/news/how-to-watch-rupauls-drag-race-all-stars-online-stream-season-6-episodes-from-anywhere",
    "Halo TV series": "https://www.techradar.com/news/the-halo-tv-show-finally-has-a-tentative-release-date-and-a-new-streaming-home",
    "Star Trek: Strange New Worlds": "https://www.techradar.com/news/star-trek-strange-new-worlds",
    "NFL": "https://www.techradar.com/news/watch-nfl-live-stream-2021-22",
    "UEFA": "https://www.techradar.com/news/uefa-nations-league-live-stream-2020-how-to-watch-every-match-online-from-anywhere",
    "iCarly": "https://www.techradar.com/news/how-to-watch-icarly-online-stream-the-2021-revival-on-paramount-plus-from-anywhere",
    "which you can get here": "https://paramountplus.qflm.net/c/221109/175360/3065?subId1=trd-us-2072335115084603400&sharedId=trd-us&u=https%3A%2F%2Fwww.paramountplus.com%2F",
    "Star Trek: Picard": "https://www.techradar.com/news/star-trek-picard-season-2",
    "sign up for an annual plan": "https://paramountplus.qflm.net/c/221109/175360/3065?subId1=trd-us-1180196479434363100&sharedId=trd-us&u=https%3A%2F%2Fwww.paramountplus.com%2Faccount%2Fsignup%2Fpickplan%2F",
    "according to this help page": "https://paramountplus.qflm.net/c/221109/175360/3065?subId1=trd-us-1456667328880321500&sharedId=trd-us&u=https%3A%2F%2Fhelp.paramountplus.com%2Fs%2Farticle%2FPD-Supported-Devices",
    "Star Trek: Brave New Worlds": "https://www.techradar.com/news/star-trek-strange-new-worlds"
  }
}