{
  "source": "https://www.techradar.com/news/is-amd-zen-5-coming-to-bury-intels-alder-lake",
  "title": "Is AMD Zen 5 coming to bury Intel's Alder Lake?",
  "category": "computing",
  "updated": "2021-04-30T23:30:54.115Z",
  "author": "john-loeffler",
  "summary": "It's just one rumor, but it's a really bad one for Intel",
  "article": [
    "It's no surprise that Intel is working on a new big.LITTLE design for its upcoming Alder Lake processors, due later this year. After its breakup with Apple following the introduction of the Apple M1 chip and the announcement of Nvidia Grace last month, Intel is facing increasing competition in market segments where it had long held a dominant position.",
    "This is especially true with one of the largest growing parts of the computer market: laptops. Here, at least according to PassMark Software's CPU benchmark analysis, Intel enjoys nearly 80% of the non-Apple mobile computing market to itself, with AMD struggling to make the kinds of inroads here that it has with desktop CPU market share.",
    "MacBooks make up a relatively small part of the overall mobile computing market, so losing Apple's business is a blow, but not a major one – at least not in a business sense, Intel's ego is another matter.",
    "What would be a major threat to Intel's bottom line is losing a sizeable chunk of laptop PCs to AMD the way it's been hemorrhaging desktop PC installs to AMD's increasingly powerful Ryzen processors. The desktop CPU might be a more prestige, flagship product, but with households needing more than one computer for work and school having several desktop systems can get cumbersome pretty quickly, especially when laptops don't have a mobility premium baked into their price the way they once did.",
    "That's what makes a rumored AMD Zen 5 APU a much bigger deal for Intel than an Apple MX chip could ever be, especially if the chip's rumored specs pan out.",
    "There were mixed reviews for Intel's most recent Rocket Lake-S processors. The Intel Core i9-11900k actually underperformed the previous generation Core i9-10900k in our tests, while the Core i5-11600k is one of the best processors you can get right now for gaming, so overall, the release of Intel's latest desktop processors did not go over as well as AMD's launch of its Zen 3, 5000-series CPUs.",
    "That's not to say Intel has lost the desktop CPU battle for good, especially when it still has the majority of the market by any measure. But AMD is closing in fast and unless something dramatically changes, the two will be going blow for blow for the foreseeable future.",
    "It's simply not the same with laptops, where AMD processors are notable because you can occasionally see them on the shelves at all. The laptop sections of retail floors everywhere are awash in Blue, as are online retailers' stock. While laptop OEMs are working to include more mobile Ryzen processors, they are few and far between. We would know, we review laptops for a living.",
    "Intel's Alder Lake and its successor generations are a solid strategy for locking down the laptop market for the next decade in that they will feature Arm's big.LITTLE architecture, which has a mix of performance and so-called efficiency cores, the first of which are reserved for high-demand apps like Photoshop and gaming, while the latter are designed to handle background tasks that don't need the kind of processing power that current Intel Core processors provide when these tasks get their scheduled processor cycles.",
    "This is one of the key innovations that allows devices running on an Arm processor to have outstanding battery life, which is why your smartphone and tablet run on Arm and not Intel or AMD. When Arm is used in a laptop – which has a much larger battery than your phone – getting battery life of more than 24-hours is not uncommon. The drawback has always been that those performance cores haven't been up to the challenge of running heavy duty, desktop-class software.",
    "That is changing, and fast. Apple's initial performance claims for the M1 might have been off-base, but not by much. The new Apple MacBook Air, 13-inch Apple MacBook Pro, and Apple Mac Mini are still pretty powerful machines capable of running a full-service macOS 11 Big Sur and all the apps that come along with it, with developers like Adobe releasing the latest versions of their products with Apple's new processor in mind.",
    "So it's not a matter of if, but when, Windows 10 can effectively run on a big.LITTLE processor. Even though Windows 10 on Arm has been around for some time, Alder Lake is a different matter altogether. It promises to bring the same kind of power you'd find with an Intel Core processor and marry it to the efficiency of an Arm-based chip.",
    "Intel Evo certification for laptop OEMs requires at least nine hours of battery life under Intel's test conditions, but it wouldn't be out of the question to see the next generation of Intel Evo-like certification require 15 hours, or even more, of battery life on Alder Lake chips. When one of the biggest selling points for a customer is a laptop's battery life, this is the kind of advantage that could lock down 80-90% laptop market share for years to come.",
    "Considering that as recently as six months ago archrival AMD was dismissing the idea of moving towards implementing big.LITTLE architecture in its chips, Alder Lake looked like an ace up Intel's sleeve the way Nvidia's RTX and ray-tracing caught Team Red flat-footed when it was released several years ago.",
    "If a recent rumor pans out though, Intel's advantage could vanish much sooner than expected, and they could even end up on the losing end before the decade is out.",
    "This week, a rumor surfaced online that AMD was preparing a new hybrid APU running a big.LITTLE design that could be introduced as early as 2024, which would give Intel only about two to three years head start over its rival. Worse still, the new Zen 5 APU is rumored to be using a 3nm node from TSMC, much like what Apple will probably be using for its latest silicon around the same time.",
    "There is some debate about Intel's leaked 2019 roadmap that had the company producing a 3nm node around 2025, so it's not at all certain when and if Intel will be able to hit that production target.",
    "Even if all goes well for Team Blue, TSMC will still be providing 3nm nodes years ahead of Intel, which means an AMD Zen 5 APU could seriously outperform Intel's chips in mobile devices while matching it's power efficiency, putting Intel's laptop chips at a serious disadvantage.",
    "Intel could always just go with TSMC the way Apple and AMD have, but it's unlikely to do so (for \"reasons,\" we guess), so it's possible that by 2030, Intel could be in a knock-out-drag-out fight with AMD across its entire semiconductor portfolio.",
    "And that doesn't even consider whatever the heck it is Nvidia's up to with the Arm acquisition."
  ],
  "headers": {
    "5": "Why Alder Lake matters so much to Intel's future",
    "15": "Is AMD's Zen 5 the Alder Lake killer?"
  },
  "links": {
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "announcement of Nvidia Grace": "https://www.techradar.com/news/nvidia-grace-processor-vs-intel",
    "PassMark Software's CPU benchmark": "https://www.cpubenchmark.net/market_share.html",
    "desktop CPU market share": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years",
    "another matter": "https://www.techradar.com/news/intel-continues-to-take-apple-break-up-badly-with-launch-of-im-a-mac-ad-campaign",
    "Apple MX chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "Rocket Lake-S": "https://www.techradar.com/news/intel-rocket-lake",
    "Intel Core i9-11900k": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "Core i9-10900k": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "Core i5-11600k": "https://www.techradar.com/reviews/intel-core-i5-11600k",
    "Apple MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Apple MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Apple Mac Mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "macOS 11 Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "Windows 10 on Arm": "https://www.techradar.com/news/qualcomms-new-chip-for-windows-10-tries-and-fails-to-beat-the-apple-m1-in-leaked-benchmark",
    "recently as six months ago": "https://www.techradar.com/news/amd-has-a-subtle-dig-at-intel-suggesting-alder-lake-cpus-dont-make-sense",
    "rumor surfaced online": "https://www.techradar.com/news/amd-ryzen-8000-processors-could-look-like-a-turbo-charged-apple-m1",
    "Intel's leaked 2019 roadmap": "https://www.anandtech.com/show/15217/intels-manufacturing-roadmap-from-2019-to-2029"
  }
}