{
  "source": "https://www.techradar.com/news/samsung-s21-fe-a-cheaper-galaxy-phone-is-reportedly-on-the-way",
  "title": "Samsung S21 FE, a cheaper Galaxy phone, is reportedly on the way",
  "category": "phones",
  "updated": "2021-02-12T09:59:04Z",
  "author": "james-rogerson",
  "summary": "But we don't know anything about it",
  "article": [
    "If you like the look of the Samsung Galaxy S21 range but find the prices a bit steep, then Samsung could soon launch the phone for you, as the Samsung Galaxy S21 FE (or Samsung Galaxy S21 Fan Edition as it might be called) is reportedly in the works.",
    "That’s according to sources speaking to SamMobile, who claim that a Samsung phone with the model number SM-G990B is in development, and that it might be the Samsung Galaxy S21 FE.",
    "It doesn’t sound like they’re certain that it’s the Galaxy S21 FE, but given that the Samsung Galaxy S21 has the model number SM-G991B, this upcoming phone is presumably at least part of the same range, assuming these sources are right. We’ve also previously heard that the Samsung Galaxy S21 FE is in the works, so there’s a good chance it really is.",
    "Unfortunately, this latest leak doesn’t tell us anything about the phone, and nor do any previous leaks. It’s in an interesting position too, because the Samsung Galaxy S20 FE was a cheaper alternative to the Samsung Galaxy S20, but many of its downgrades (like a plastic back and a lower screen resolution) are already found on the standard Galaxy S21.",
    "Samsung also made the Galaxy S21 cheaper than the S20, so for the Samsung Galaxy S21 FE to be a further downgrade it might end up in true mid-range territory – and at that point it could be in competition with the Galaxy A range.",
    "That said, it might not be a downgrade in all ways. For example, the Samsung Galaxy S20 FE actually has a bigger battery than the standard Galaxy S20.",
    "For now we can only guess how Samsung might position the Galaxy S21 FE, but hopefully we’ll have a clearer idea soon, as with multiple sources now saying it’s in the works, we’d expect specs and other details to start leaking before long."
  ],
  "headers": {
    "3": "Mystery mobile"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "SamMobile": "https://www.sammobile.com/news/samsung-sm-g990b-incoming-could-be-the-galaxy-s21-fan-edition/",
    "previously heard": "https://www.techradar.com/news/samsung-galaxy-s21-fe-and-galaxy-z-fold-fe-appear-in-leaked-samsung-2021-lineup",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review"
  }
}