{
  "source": "https://www.techradar.com/news/amazons-the-wheel-of-time-season-1-release-date-cast-plot-trailer-and-more",
  "title": "The Wheel of Time season 1: release date, trailer, cast, plot and more",
  "category": "entertainment",
  "updated": "2021-12-02T16:20:23Z",
  "author": "tom-power",
  "summary": "The Wheel of Time has landed on Amazon Prime Video",
  "article": [
    "The Wheel of Time is arrived. Amazon's big-budget high fantasy show, which is based on Robert Jordan's complex but beloved book series, launched on Prime Video on November 19, with its first three episodes available to watch on release day.",
    "The latest blockbuster fantasy series, The Wheel of Time is Amazon's answer to Netflix's Witcher adaptation and HBO's Game of Thrones (which returns in 2022 as House of the Dragon, by the way). The Wheel of Time also provides Amazon with a better idea of whether there's an audience for fantasy shows on its streamer – an intriguing prospect, given that its Lord of the Rings prequel series is still in development.",
    "So what do you need to know about The Wheel of Time if you're considering watching it?",
    "Below, we've compiled everything but the popcorn on The Wheel of Time season 1, including the series' two official trailers and some early looks at the series. You'll also find more information on its cast, potential plot points (based on the novels), other Wheel of Time projects that are in the works outside of Amazon, and more.",
    "We’re entering spoiler territory for The Wheel of Time’s book series from this point on. If you want to go in with little to no knowledge of the series, turn back now. If you're happy to proceed, though, let's dive in.",
    "As we mentioned above, Amazon's adaptation of The Wheel of Time premiered on Prime Video on November 19.",
    "The first three episodes launched on the streaming platform on this date, so you won't be made to wait for new instalments. Well, that is until you finish that batch of episodes. The others, which we detail below, arrive weekly after this date.",
    "Amazon Studios released a new teaser trailer on Wednesday, October 27. And the footage took a deeper dive into what the show's plot will be about, Moiraine's origins story, a better glimpse at its combat, and comes packed with some horror infused moments.",
    "Check out the series' official trailer above, and then read on to view the first teaser that landed in September:",
    "Additionally, a 90-second bonus video, which explains the mission undertaken by Moiraine (Rosamund Pike) in more detail, was released on the Amazon Prime Video YouTube channel ahead of the second trailer's arrival. You can view that below if you want to find out more:",
    "And, if that wasn't enough, Amazon released a video of one of episode 1's scenes to whet our appetite at New York Comic-Con, too. Here, we see Moiraine and Lan Mandragoran (Daniel Henney) rock up at the Two Rivers' Whispering Inn, which leads to a tense stand-off between the duo and the village's population:",
    "Spoilers for The Wheel of Time book series follow.",
    "The Wheel of Time is a convoluted, intricate story. The book series, which was completed by fellow fantasy author and Wheel of Time fan Brandon Sanderson after Jordan’s death in 2007, comprises 14 mainline novels. Much like Game of Thrones, it also has a stacked list of characters (almost 3,000 named individuals) and locations, as well as multiple plot threads to follow, across its 11,308 pages.",
    "If its story is a fantasy epic that will span multiple seasons (more on this later), then, what do we know about season 1's plot specifically?",
    "Set in an unnamed world (fans call it The Randlands or The World of the Wheel), The Wheel of Time follows Rand al’Thor, a humble boy who lives in a small village known as the Two Rivers.",
    "After Rand’s home is attacked by the forces of the Dark One, an evil entity who wants to destroy the world, he’s rescued by Moiraine, a powerful sorceress and member of a secret all-female organization called the Aes Sedai, and her Warder guardian Lan Mandragoran.",
    "Believing that the Dark One was seeking out the Dragon Reborn – a prophesied champion who can defeat the lord of evil – Moiraine leads Rand on a dangerous, continent-spanning journey that will decide the fate of the world.",
    "Rand, though, isn’t the only character who could be the so-called Dragon Reborn. His male and female friends – Matrim ‘Mat’ Cauthon, Perrin Aybara, Nynaeve al'Meara and Egwene al'Vere – may also be the reincarnated hero that Moiraine seeks.",
    "Together, the group hope to defeat the Dark One for good, but their journey will be far from straightforward. The Dragon Reborn also has the ability to destroy humanity instead of liberating it, so the fate of the world rests on their shoulders. No pressure, then.",
    "That synopsis aside, most viewers won't know anything about The Wheel of Time's plot. Diehard fans of the novels will, but the show does diverge from the source material in some instances. Those who adore Jordan's works, then, will have some new things to look out for when Amazon's adaptation arrives.",
    "Season 1 won't only focus on the series’ first book – The Eye of the World – either. Responding to fans during an Instagram Live Q&A, showrunner Rafe Judkins revealed that season 1 is “adapting the whole series, not just Eye of the World”, so we'll be seeing some creative liberties taken with its interweaving narratives.",
    "The decision to incorporate more books into a single season came down to the fact that Jordan's novels were, according to season 1 writer Amanda Kate Shuman (per GQ), about “a lot of characters go for a lot of walks to a lot of inns.” So some of this unnecessary fluff has been cut for the TV adaptation.",
    "Elaborating on what was cut from the TV show, Judkins told Den of Geek: “We’ll never be able to achieve everything that’s in the books. What are the iconic places that we need to do, and do we need to shift things around in physical space in order to hit them? … I don’t want to waste all my production money putting town after town on screen.”",
    "One element from The Eye of the World that is included in season 1 is the ruby-hilted dagger. In the novels, this is an artefact of Shadar Logoth, an ancient city that fell to ruin after its citizens locked themselves away during a past war that was decimating the world.",
    "The dagger is possessed by evil forces and manipulates whoever comes into its possession, which spells danger for one of the series’ most prominent characters. In February, Amazon released a teaser trailer that showed one individual coming across the dagger. We won’t reveal which character that is due to spoilers but, if you want to find out who it’ll be, check out the tweet below:",
    "Speaking to Entertainment Weekly, Judkins explained that the city of Shadar Logoth was \"built from scratch for just 15 minutes of airtime\", such is its importance to the plot. That might sound excessive, but it's necessary to provide genuine authenticity to the show.",
    "Shadar Logoth wasn't the only giant set that was built for the series. In a lengthy GQ piece that explores how Amazon adapted The Wheel of Time, it's revealed that the series' Two Rivers set was erected, used for its filming purposes, and then burned to the ground for another sequence. So Amazon Studios has gone full out in order to make The Wheel of Time as epic as possible.",
    "We’ll also see the Heron Mark Blade included in season 1. In the book series, blademasters may decorate their swords with a heron mark, particularly if they have mastered the art of sword-to-sword combat.",
    "Again, this weapon has a fairly prominent role in proceedings (no spoilers again), so its inclusion isn’t a surprise. In December 2020, Amazon released a teaser of how its creative team had crafted the blade for the show:",
    "Initially, we thought that season 1 would comprise six episodes. This was seemingly confirmed on the Writers’ Guild of America West website in December 2020, alongside the titles for each entry.",
    "However, having spoken directly to actress Rosamund Pike, who plays Moiraine in the show, we can confirm that The Wheel of Time season 1 will have eight episodes. That takes us up to Christmas Eve, which is the perfect stopping point for a show before the busy Holiday TV season truly kicks off.",
    "All eight episodic titles have been revealed now, too, and you can see them all below:",
    "In a separate social media post, Judkins also revealed that season 1’s entries will clock in between 50 and 65 minutes. Having seen the first six episodes, we can confirm that this is the case, too.",
    "As for who is directing the episodes, Uta Briesewitz (Stranger Things, Westworld) helmed the first two entries. Wayne Yip (Hunter, Lord of the Rings) has directed episodes three and four, while Salli Richardson-Whitfield (NCIS, Altered Carbon) has overseen episodes five and six.",
    "Judkins has written the script for the pilot, while episodes two through five have been penned by Amanda Kate Shuman (The Blacklist), Mike and Paul Clarkson (The Haunting of Bly Manor), Dave Hill (Game of Thrones), Celine Song (in her TV writer’s debut) and Justine Juel Gillmer (The 100) respectively.",
    "There's no word on who has written the final two episodes, but we imagine that Judkins will have written the season 1 finale, at the very least. Ciaran Donnelly (Vikings, Altered Carbon) has directed season 1's last two entries.",
    "As we mentioned, there are lots of characters in The Wheel of Time. It’s unsurprising, then, that season 1’s cast is a sizable one.",
    "Below, we’ve listed the main (and most prominent supporting) characters who will appear in season 1:",
    "Rosamund Pike (Gone Girl, I Care a Lot) is the biggest name attached to the series. The actress will play Moiraine, the Aes Sedai who leads Rand and his friends on their journey. She’s also known as “Alys” in the book series, while her surname (we won't spoil it here for story reasons) alludes to her past.",
    "Josha Stradowski (Gewoon Vrienden) will portray Rand in his first major TV role. The Dutch actor is joined by Marcus Rutherford (Bulletproof), Zoë Robins (Black Christmas), Barney Harris (The Hollow Crown) and Madeleine Madden (Picnic at Hanging Rock) as Perrin, Nynaeve, Mat and Egwene respectively.",
    "Daniel Henney (Criminal Minds) will play Lan Mandragoran, the uncrowned king (and sole survivor) of Malkier and Moiraine’s Warder. In the books, Warders are bonded to Aes Sedai through Saidar – the female component of the One Power, the source of the Aes Sedai’s magic – to be their bodyguards.",
    "Sophie Okonedo (His Dark Materials, Ratched) will play another Aes Sedai in Siuan Sanche, who also goes by pseudonyms “Suki” and “Mara” in the novels. Siuan doesn’t appear in the books until the second instalment – The Great Hunt – which means that season 1 will adapt multiple novels, as we discussed earlier on this page. Her role in proceedings is, however, significant, particularly at the White Tower i.e. the headquarters of the Aes Sedai.",
    "Finally, Alvaro Morte (Money Heist) plays called Logain Albar. In the novels, Logain is an Asha’man of the Black Tower, the stronghold of men who can wield the One Power. He also claims to be the Dragon Reborn (a False Dragon, as the Aes Sedai call him), and plots to destroy them so he can be the savior of the world.",
    "There are plenty of other cast members in The Wheel of Time season 1. However, we've listed the biggest supporting cast members below, based on what we know from the books.",
    "Alexandre Willaume (Deep State) has been cast as Thom Merrilin, a bard who accompanies Moiraine’s group in the novels. Expect his role to change slightly in the TV adaptation. Meanwhile, Johann Myers (Snatch) will feature as Padan Fain, a secondary antagonist in the books, and someone who has eyes on the ruby dagger.",
    "Kate Fleetwood (Fate: The Winx Saga) plays another Aes Sedai called Liandrin, who acts as an antagonist to Moiraine in particular. Priyanka Bose (The Good Karma Hospital) plays Alanna Mosvani, another Aes Sedai and close ally of Moiraine's.",
    "Abdul Salis (Eastenders) plays Eamon Valda, one of the more prominent Whitecloaks – a group who hunt the Aes Sedai – in the series, Hammed Animashaun (Black Mirror) portrays Loial, an Ogier and apparent master builder. Finally, Kae Alexander (Fleabag, Infinite) has been cast Min Farshaw, a potential love interest of Rand.",
    "There’s no word on who will star as the villainous Dark One yet but, given the series’ antagonist is a sentient, cosmic force, it’s likely that the show will only require a voice actor to portray them in Amazon’s adaptation.",
    "Yes. In July, The Wheel of Time's official social media channels revealed that filming had begun on season 2:",
    "The first episode in season 2 will be titled \"A Taste of Solitude\", with Shuman returning to pen the screenplay after she wrote season 1's second entry.",
    "We've also received word of which characters (or, rather actors) will be joining The Wheel of Time season 2.",
    "Ceara Coveney will make her TV series debut as fan favorite Elayne Trakand, who is the Queen of Andor and Cairhien in the novels. Natasha O'Keeffe (Peaky Blinders) and Meera Syal (Yesterday, Goodness Gracious Me) have also joined the cast in undisclosed roles.",
    "The trio join Danish actress Salle Salée, who has been brought on board in an unknown role. Start speculating on who she, Syal and O'Keeffe will play, then.",
    "As for how many seasons there will be, there won’t be 14. Like we said earlier, Judkins confirmed that each season would combine books from Jordan’s literary works as, given how complicated the story is, it would takes a long time to finish the TV series:",
    "How many seasons could we see then? The Wheel of Time spans 14 volumes in total, but there’s also a prequel novel and two companion books to take into consideration.",
    "With 17 books to draw from across this fantasy epic, we wouldn’t be surprised if two or three novels are used per season. If we’re right, Amazon’s Wheel of Time could take seven seasons to reach its conclusion.",
    "That sounds about right, based on what Judkins told Deadline. Asked how long he could see the series running for, Judkins said it would be eight seasons, adding: “I think Wheel of Time lends itself better to a television series. That’s why I think now is the right moment for it to finally exist because people who know that books know it’s just a story about the characters and the journeys each of them is on. The amount you’d have to compress it to turn it into a series of movies is too much. It would take away the heart of what’s good about it.”",
    "Next, as claimed by The Hollywood Reporter, a Wheel of Time movie trilogy is also in the works. According to THR's July 13 article, Zack Stentz (X-Men: First Class, Thor) is penning a three-movie story based on Jordan's 'Age of Legends' novels from his Wheel of Time series.",
    "The Age of Legends trilogy will be set several millennia before the events of the TV show. Also dubbed the Second Age, it'll follow the Aes Sedai (and their male counterparts) more closely and focus on the One Power, which is the source of all magic in the Wheel of Time universe.",
    "When an unspeakable evil is unleashed across the land, male channelers (the Wheel of Time's magic wielders) are driven insane and use the One Power to try and destroy the world. It'll up to a small band of women, who unite under the White Tower, to stop them.",
    "It's unclear how Rosamund Pike's Moiraine will factor into this (if at all) or whether Amazon will buy the rights to the movie trilogy. It's possible that the movie trilogy may include aspects from New Spring, The Wheel of Time prequel novel that sees Moiraine first set out on her adventure to find the Dragon Reborn. Given that the film trilogy's events precede her arrival, though, she may not be part of its cast.",
    "Right now, no studio partner or distributor is associated with the Age of Legends films, but they will complement Amazon's TV adaptation and expand upon The Wheel of Time's world. Once we learn more, we'll update this page.",
    "Finally, Rosamund Pike has narrated an audiobook recording of The Wheel of Time's first novel, i.e. The Eye of the World. The audiobook is already available on Audible so, if you want to get a leg up on The Wheel of Time before you dive into Amazon's version, check that out first."
  ],
  "headers": {
    "5": "The Wheel of Time season 1 release date: November 19",
    "7": "The Wheel of Time season 1 trailer: check out the latest teaser",
    "11": "The Wheel of Time season 1 plot: what’s it about?",
    "29": "The Wheel of Time season 1 episodes: how many are there?",
    "36": "The Wheel of Time season 1 cast: who is playing who?",
    "48": "The Wheel of Time season 1 sequels: will there be more seasons and potential movies?"
  },
  "links": {
    "Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "House of the Dragon": "https://www.techradar.com/news/house-of-the-dragon",
    "Lord of the Rings prequel series": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "GQ": "https://www.gq.com/story/inside-amazons-wheel-of-time?mbid=social_twitter&utm_source=twitter&utm_brand=gq&utm_social-type=owned&utm_medium=social",
    "Den of Geek": "https://www.denofgeek.com/tv/the-wheel-of-time-rafe-judkins-interview/",
    "Entertainment Weekly": "https://ew.com/tv/the-wheel-of-time-amazon-series-adaptation-exclusive-first-look/",
    "GQ piece": "https://www.gq.com/story/inside-amazons-wheel-of-time?mbid=social_twitter&utm_source=twitter&utm_brand=gq&utm_social-type=owned&utm_medium=social",
    "Writers’ Guild of America West website": "https://directories.wga.org/project/1199189/the-wheel-of-time",
    "has been brought on board": "https://www.instagram.com/p/CSiEuYVjwAF/?hl=en",
    "Deadline": "https://deadline.com/2021/11/the-wheel-of-time-mat-cauthon-role-donal-finn-rafe-jenkins-plans-amazon-series-1234870995/",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/zack-stentz-to-pen-script-for-wheel-of-time-film-adaptation-1234981098/",
    "narrated an audiobook recording": "https://apnews.com/article/entertainment-arts-and-entertainment-new-york-rosamund-pike-robert-jordan-1cec7e68714bcae38ec80dc9d768b683"
  }
}