{
  "source": "https://www.techradar.com/news/iphone-se-2020-vs-iphone-xr",
  "title": "iPhone SE (2020) vs iPhone XR: which of the cheaper Apple iPhones is for you?",
  "category": "phones",
  "updated": "2021-02-14T08:00:27Z",
  "author": "jon-mundy",
  "summary": "Which affordable iPhone is made for you?",
  "article": [
    "While the sprawling iPhone 12 family has garnered all the attention of late, Apple has quietly assembled its most comprehensive range of affordable smartphones yet.",
    "The second generation iPhone SE launched the very same year as the iPhone 12, while the highly capable iPhone XR continues to be sold as new on the Apple website. And we’re not even considering the still-available iPhone 11 here.",
    "More choice can mean more confusion, of course. So which of Apple’s two price-conscious phones is the better buy? Let’s take a closer look at what both have to offer.",
    "The iPhone SE is the newer phone of the two, having landed in shops on April 24, 2020. The 64GB model starts from $399 / £399 / AU$679, but you can upgrade to 128GB for $449 / £449 / AU$759 and 256GB for $549 / £549 / AU$929.",
    "While the iPhone XR was released way back on October 26, 2018, it’s still being sold as new on the Apple website - albeit at a reduced price. You can currently buy the 64GB model for $499 / £499 / AU$849 and the 128GB model for £549 / $549 / AU$929.",
    "As you can see, the iPhone XR is a full $100 / £100 more expensive than its iPhone SE equivalent. Interestingly, however, it doesn’t offer you more for your money in every respect.",
    "Neither of these phones sports the freshest design on the block, and there’s a fair amount of shared DNA between them. Glance at the two phones separately from behind and you might struggle to tell which was which. They have the same rounded aluminum edges, singular camera modules, and shiny glass backs.",
    "You could argue that both phones owe their looks to Apple’s 2017 vintage - the iPhone XR to the iPhone X and the iPhone SE to the iPhone 8. But while the iPhone X was a brand new design at the time, the iPhone 8 was drawing from the 2014 iPhone 6 template.",
    "Flip these two phones over to view their front surfaces, and the distinction is plain to see. The iPhone SE has a squat display, large bezels, and a huge forehead and chin for a 65.4% screen-to-body ratio. That chin houses a Touch ID sensor, which is something of a relic of Apple’s biometric past.",
    "Conversely, the iPhone XR pushes those bezels back with a front-filling display and a 79% screen-to-body ratio. Its display is cut into at the top by Apple’s signature notch, which houses the company’s slick Face ID facial recognition system.",
    "Of course, if you were to hold a phone in either hand, the difference would be obvious without having to open your eyes. The iPhone XR is significantly larger than the iPhone SE (2020).",
    "The XR’s dimensions of 150.9 x 75.7 x 8.3mm dwarf the SE’s 138.4 x 67.3 x 7.3mm in every respect, while the larger phone weighs 194g versus the iPhone SE’s 148g.",
    "Both phones are rated IP67 dust/water resistant, however. Also, while we’re tying up loose ends, both pack stereo sound and neither has a 3.5mm headphone jack.",
    "As we’ve already covered, there’s a considerable size difference between these two phones. That extends to the displays, where the iPhone XR enjoys a sizeable 6.1-inch canvass as opposed to the iPhone SE’s tiny 4.7-inch offering.",
    "The XR screen is longer, too, with a stretched-out aspect ratio of 19.5:9. You get a stumpier 16:9 view with the iPhone SE, which is another telltale sign that it’s a recycled design. Again, though, we should point out that the iPhone XR suffers from that intrusive notch, whereas the SE’s screen is unblemished.",
    "Beyond these fundamental dimensional differences, however, the two screens are surprisingly similar. Both use IPS LCD panels rather than the superior OLED technology of the iPhone 11 Pro and iPhone 12, so contrast and black levels are inferior. Both can hit the same typical 625 nits of brightness, too.",
    "Another similarity is that both of these screens reach an identical pixel density of 326 ppi. In the iPhone XR’s case, that comes about from a 828 x 1792 resolution, while the iPhone SE hits 750 x 1334. Neither is what you’d call particularly sharp by modern standards.",
    "Qualitatively, then, there’s nothing between these two displays. Any choice you make is more a matter of size and shape.",
    "A look at the camera specs of these two phones reveals a superficially similar setup. Both give you a single 12-megapixel wide sensor with an f/1.8 aperture.",
    "Interestingly, given that the iPhone SE is 18 months younger than the iPhone XR, it actually utilizes older camera hardware. Its image sensor and optics are essentially lifted directly from the iPhone 8.",
    "The iPhone XR’s newer sensor captures larger 1.4µm pixels versus the iPhone SE’s 1.19µm pixels. Because of this it’s able to make use of focus pixels, which enables the XR to collect better depth information in the absence of a secondary camera.",
    "The iPhone SE has to utilize machine learning techniques to achieve something approximately similar. Counterbalancing its camera hardware shortfall, however, is the iPhone SE’s A13 Bionic CPU, which contains a superior image signal processor to the iPhone XR’s A12.",
    "As a result, the iPhone SE is smarter about choosing and calibrating its shots. Sometimes the phone can overcompensate for its limited hardware, overexposing certain shots. But in other scenarios, we found that the SE could hold its own against the iPhone 11 family.",
    "That said, neither of these phones benefits from Apple’s brilliant Night Mode, so low light shots aren’t a strength in either case.",
    "Another example of the iPhone SE’s greater camera smarts comes with video capture. While both phones can capture 4K video up to 60 fps, the iPhone SE has extended dynamic range.",
    "All in all, while the iPhone SE is smarter, the difference in image quality between these two cameras isn’t all that great. Certainly not to the extent that it should be the determining factor in an either/or purchase decision, at any rate.",
    "As we’ve discussed, in purely visual terms, the iPhone SE would seem to belong to an older vintage than the iPhone XR. When it comes to performance, however, the iPhone SE leapfrogs its brother.",
    "Apple’s crucial move with the iPhone SE was fitting it out with the A13 Bionic CPU, which it shares with the iPhone 11 family. The iPhone XR runs on the previous generation A12 Bionic.",
    "While both the A13 and A12 are built using a similar 7nm standard, the A13 is 20% larger and packs in 23% more transistors for a 20% speed boost.",
    "In one feel swoop this makes the iPhone SE relevant to a modern audience, with a degree of performance that will keep it feeling fresh and fast for at least another couple of years to come. It’s a startling amount of performance in a $400 / £400 phone, even with the advent of the A14 Bionic in the iPhone 12.",
    "By contrast, the iPhone XR’s A12 Bionic is a whole generation behind. Apple’s advantage in the processor game, as well as its ongoing support, mean that the phone will still feel snappy, and there’s no app or game available on the App Store that won’t run well here.",
    "Still, the iPhone SE is simply the faster and more capable device. You’ll particularly notice this with intensive tasks like exporting iMovie videos, not to mention 3D gaming. But more pertinently, you’ll find that the iPhone SE remains speedy and supported for longer.",
    "You also get more storage options with the iPhone SE. Besides the 64GB and 128GB models, which the iPhone XR also offers, there’s a sizeable 256GB model on the market.",
    "Neither phone benefits from 5G network support, so buying either will mean settling for 4G at a time when we’re on the cusp of an exponential increase in download speeds. Still, that time isn’t quite here yet for most of us.",
    "If there’s one resounding victory for the older iPhone XR, it comes from battery life. The phone packs in a 2,942 mAh battery, which is significantly larger than the 1,821 mAh unit in the iPhone SE.",
    "While it’s true that the display is also much larger in the XR, that doesn’t offset such a huge capacity advantage. Rather tellingly, we listed battery life in the ‘For’ column in our iPhone XR review, but listed it in the ‘Against’ column in our iPhone SE review.",
    "At the time of its release, the iPhone XR’s stamina blew all previous and contemporary iPhones away. Anecdotally our reviewer managed to clear a full intensive day of usage amounting to six hours of screen on time with 22% left in the tank.",
    "With the iPhone SE, by contrast we found that a day of light usage would leave us with around 30%. Attempting a similarly intensive day to the one mentioned above would leave us needing to recharge before bed time.",
    "While judging battery life isn’t a precise art, it’s fair to say that the iPhone SE’s stamina isn’t even in the same ballpark as the impressive iPhone XR. Recharging is a doddle whichever phone you choose. Both phones support Qi wireless charging, courtesy of those glass rear panels.",
    "While Apple’s pricing would suggest a linear upgrade path from the iPhone SE to the iPhone XR, the reality isn’t quite so straight forward.",
    "In the iPhone XR’s favor it has a larger display, a more modern design (from the front at least), and massively superior battery. On the other hand, the iPhone SE gains much better performance thanks to a newer processor, which lends it an extra dose of future proofing.",
    "The SE’s A13 Bionic chip and its superior ISP arguably gives it the slight edge in the camera stakes too, with Apple’s formidable algorithms coming to the fore. That said, the the iPhone XR camera’s newer image sensor balances things out somewhat.",
    "Ultimately, the iPhone XR’s all-round performance shortfall and subsequently lesser future proofing makes us lean towards its younger brother - especially given the iPhone SE’s lower price tag. There isn’t a great deal between these two distinctly retro phones in the hand, but the iPhone SE represents a smarter buy."
  ],
  "headers": {
    "3": "iPhone SE (2020) vs iPhone XR price and availability",
    "6": "Design",
    "13": "Display",
    "18": "Camera",
    "26": "Specs and performance",
    "34": "Battery life",
    "39": "Takeaway"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "iPhone 6": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6-1264565/review",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}