{
  "source": "https://www.techradar.com/news/netgear-might-have-revealed-its-most-secure-router-software-yet",
  "title": "Netgear might have revealed its most secure router software yet",
  "category": "computing",
  "updated": "2021-08-10T20:22:58.164Z",
  "author": "anthony-spadafora",
  "summary": "Netgear's Armor security service offers set-it-and-forget-it protection for connected devices",
  "article": [
    "Netgear is giving its Armor security service which ships with many of its wireless routers a major boost with new capabilities designed to protect all of the connected devices in a user's smart home.",
    "The company's Armor security service is built into most of its Orbi and Nighthawk routers and provides a protective bubble for connected devices on a home network to help consumers stay safe from hackers, malware and viruses.",
    "Cyberthreats that were once only found on PCs are now present in nearly all connected devices including Smart TVs, smart thermostats, light switches, home theater systems, security cameras, game consoles, smart speakers, streaming players, tablets, smartphones and other smart home gadgets.",
    "In fact, according to Bitdefender's 2020 Consumer Threat Landscape Report, the number of vulnerabilities in Smart TVs has ballooned by 335 percent while the number of vulnerabilities in IP cameras almost doubled between 2019 and 2020.",
    "Having connected devices from different manufacturers installed in one's home not only increases the chance of incoming attacks but also outgoing threats such as a home security camera attempting to send data to a rouge site. In order to prevent these threats, Netgear has added new capabilities to its Armor security offering to provide simple and comprehensive network and device protection.",
    "Unlike traditional endpoint protection software, Netgear Armor is built into a router to monitor activity going to and from the internet so that it can protect the devices on one's network while also eliminating both the need and cost for multiple security software solutions.",
    "In addition to its existing features, the company has added sensitive data protection to block attempts to send sensitive data such as banking info, SSNs and more over unencrypted connections, anomaly detection which uses machine learning algorithms to learn the usual behavior of connected devices and block any abnormal activity, brute force protection to prevent bots from trying to compromise a user's passwords, DDoS protection to protect a user's network from denial-of-service attacks and exploit prevention/IDS to protect a user's data and devices from malicious intrusions.",
    "At the same time, the latest generation of Netgear Armor will also still include internet threat protection software that users can install on their computers, smartphones and tablets at no extra cost. Netgear Armor is currently available on supported Wi-Fi 6 routers and while there is a 30-day trial period, a yearly subscription to the security service costs $99.",
    "President and GM of Netgear's connected home products and services division, David Henry explained in a press release why the company has decided to release a new version of Armor, saying:",
    "“With the explosion of connected devices in the home from baby monitors to smart TVs, all of which can be compromised, we understand how overwhelming it can be for individuals and families to know what to do to keep themselves and their information safe. We realized that a new type of security solution was needed and with this version of NETGEAR Armor, we take worry out of the equation by providing a comprehensive ‘set-it-and-forget-it’ service.”"
  ],
  "headers": {
    "5": "Netgear Armor revamped"
  },
  "links": {
    "Armor security service": "https://www.techradar.com/news/netgear-adds-armor-to-its-routers-to-seriously-boost-their-security-levels",
    "wireless routers": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523",
    "Orbi": "https://www.techradar.com/news/new-netgear-orbi-packs-the-latest-wi-fi-tech-for-super-fast-home-internet",
    "Nighthawk": "https://www.techradar.com/news/netgear-unveils-the-nighthawk-raxe500-its-first-ever-wifi-6e-router-at-ces-2021",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "2020 Consumer Threat Landscape Report": "https://bitdefender.evyy.net/c/221109/278689/4466?subId1=trd-us-8011738444511320000&sharedId=trd-us&u=https%3A%2F%2Fwww.bitdefender.com%2Ffiles%2FNews%2FCaseStudies%2Fstudy%2F395%2FBitdefender-2020-Consumer-Threat-Landscape-Report.pdf",
    "home security camera": "https://www.techradar.com/news/best-home-security-camera",
    "endpoint protection software": "https://www.techradar.com/news/best-endpoint-security-software",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "DDoS protection": "https://www.techradar.com/news/best-ddos-protection",
    "Wi-Fi 6 routers": "https://www.techradar.com/news/wi-fi-6-routers-the-best-wi-fi-6-routers-you-can-buy-in-2019",
    "press release": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1427423430342871000&xs=1&url=https%3A%2F%2Fwww.netgear.com%2Fabout%2Fpress-releases%2F2021%2Fnewly_enhanced_netgear_armor_helps_deliver_next-generation_protection_for_connected_devices_in_the_home%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnetgear-might-have-revealed-its-most-secure-router-software-yet"
  }
}