{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leak-shows-off-all-the-phones-color-options",
  "title": "Samsung Galaxy S21 FE leak shows off all the phone's color options",
  "category": "phones",
  "updated": "2021-12-01T09:55:47Z",
  "author": "david-nield",
  "summary": "Four colors at launch?",
  "article": [
    "The Samsung Galaxy S21 FE has traveled a long and winding road on its journey to being launched, but it seems that it's now very close to being officially unveiled – and in the meantime, we've got a sneak preview of all the colors it's going to arrive in.",
    "These images – which look like official renders – come courtesy of the ever-reliable WinFuture, and show the Galaxy S21 FE in black, white, pink and green. It's possible that other colors might appear in the months after the initial launch as well.",
    "The colors in these pictures match up with what we've seen from previous leaks, so it looks very much as though these will be the options for you to buy on launch day. We have come across a navy blue-ish model too, not detailed in this current leak, which might be exclusive for a particular region or for the Samsung website.",
    "Another little interesting nugget of information from the same source: pricing in Europe is apparently going to start at €649 (that's the equivalent of $735 / £550 / AU$1,030, though Samsung won't use a straight currency conversion when setting its prices).",
    "That's the same starting price as the Galaxy S20 FE launched at – in euros, at least – and it hints that maybe Samsung has managed to hit the same mark with the successor. Internationally, the Galaxy S20 FE originally retailed for $699 / £699 / AU$1,149.",
    "As well as the colors, WinFuture also recaps some of the specs that we've seen before: the phone is expected to come with a 6.4-inch display, with 8GB of RAM on board and the option of either 128GB or 256GB of internal storage.",
    "It seems a long time ago that the likes of Samsung and Apple launched just one flagship phone a year – that was before the industry as a whole realized that offering multiple models of the Galaxy S21 or the iPhone 13 across various price points was a better strategy for pulling in more buyers.",
    "With the Galaxy S21 FE, Samsung is adding yet another option if you're after a top-tier Galaxy handset in 2022. It won't have quite the power or the camera quality of the Galaxy S22 of course, but it will give you specs that are close to flagship level for a price that looks like it will be distinctly mid-range.",
    "It's a smart approach, because it appeals to the people – and there are a lot of them – who are happy to miss out on the very best specs and the very latest silicon if it means big savings in terms of price. The mid-range Google Pixel series, most recently represented by the Pixel 5a, follows the same sort of idea.",
    "Pricing for the Samsung Galaxy S21 FE is going to be crucial to its success, especially with the Galaxy S22 arriving the month after (if the rumors are correct). Expect Samsung to offer it as cheaply as it possibly can as it looks to get 2022 off to a strong start."
  ],
  "headers": {
    "3": "The price is right?",
    "6": "Analysis: the affordable Samsung flagship of 2022"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "WinFuture": "https://winfuture.de/news,126755.html",
    "previous leaks": "https://www.techradar.com/news/samsung-galaxy-s21-fe-5g-leak-suggests-pastel-colors-are-in-for-the-cheap-flagship",
    "come across": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leak-reveals-full-design-in-a-range-of-colors",
    "Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "arriving the month after": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leaked-launch-date-risks-it-getting-lost-next-to-galaxy-s22"
  }
}