{
  "source": "https://www.techradar.com/news/you-can-play-stadia-on-xbox-series-x-soon-but-should-you-bother",
  "title": "Stadia might work on Xbox soon",
  "category": "gaming",
  "updated": "2021-03-08T19:34:25Z",
  "author": "adam-vjestica",
  "summary": "Google Stadia is coming to Xbox Series X",
  "article": [
    "Google’s maligned Stadia streaming service will soon be playable on Xbox Series X and Xbox Series S via the consoles’ Edge browser, which is being upgraded to the Chromium-powered version soon.",
    "Testers in Xbox’s Alpha Skip-Ahead group can now access this far superior version of Edge (thanks, The Verge), and despite not having full mouse and keyboard support yet, it’s still a considerably more capable browser than the version its replacing.",
    "One benefit of Edge being updated to the Chromium-based version on Xbox means that you'll be able to play Google Stadia through it. However, there’s a case to be made that Microsoft is already making its own game streaming service a far more tempting proposition.",
    "Subscribers to Xbox Game Pass Ultimate get access to Xbox cloud gaming on Android devices, and the service will soon be coming to Windows 10 PCs and iPhones via browser support. This means you’ll soon be able to play Microsoft's cloud gaming service on Xbox via the new version of Edge once it's available.",
    "One big advantage of playing on Stadia, of course, is that games will run higher than 720p, which is the max resolution on Xbox game streaming right now. Microsoft is reportedly testing 1080p streaming, but Google Stadia has the ability to output at 4K resolution for some titles, provided you pay for Stadia Pro. However, Google is being sued for supposedly failing to keep that promise.",
    "Where Stadia really suffers, though, is that you don’t have to purchase games separately with Microsoft's Xbox cloud gaming, and the library on offer is arguably more enticing than what you’ll find on Google’s service. A number of games have also been updated to support touchscreen controls, which means you won’t need to connect an Xbox controller via Bluetooth to play.",
    "If you do find yourself switching between your Xbox console and a mobile or PC, check out this handy hidden feature that makes syncing a breeze."
  ],
  "headers": {
    "5": "Value play"
  },
  "links": {
    "Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Edge browser": "https://www.techradar.com/news/microsoft-officially-launches-chromium-based-edge-browser-for-all-platforms",
    "The Verge": "https://www.theverge.com/2021/3/7/22318050/microsoft-edge-xbox-chromium-browser-testing",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "service will soon be coming to Windows 10 PCs": "https://www.techradar.com/news/heres-how-xbox-cloud-gaming-looks-on-pc",
    "iPhones via browser support": "https://www.techradar.com/news/microsoft-reportedly-trying-to-get-xcloud-on-ios-through-a-web-app",
    "Stadia Pro": "https://www.techradar.com/deals/the-best-google-stadia-prices-and-sales-in-november-2019",
    "Google is being sued": "https://www.techradar.com/news/google-sued-over-greatly-exaggerated-claims-about-streaming-service-stadia",
    "Xbox controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "handy hidden feature": "https://www.techradar.com/news/the-xbox-series-x-controller-has-a-handy-hidden-feature-you-might-not-know-about"
  }
}