{
  "source": "https://www.techradar.com/news/the-galaxy-s21-fe-will-come-in-two-variants-according-to-the-latest-leak",
  "title": "The Galaxy S21 FE will come in two variants, according to the latest leak",
  "category": "phones",
  "updated": "2021-08-31T09:25:16Z",
  "author": "david-nield",
  "summary": "And mass production is about to start",
  "article": [
    "It's fair to say that the Samsung Galaxy S21 FE hasn't had the easiest route to market, but it should be with us soon. The latest S21 FE leak to catch our attention would appear to confirm that a version with an Exynos 2100 chipset is going to be available.",
    "As spotted by SamMobile, a new benchmark listing on the Geekbench website shows a device with the right model number for the Galaxy S21 FE, the Samsung Exynos 2100 processor, and 8GB of RAM – and the scores are pretty decent too.",
    "Many Samsung phones (including the 4G version of the Galaxy S20 FE) come with Qualcomm Snapdragon processors installed in the US and China, and Exynos processors everywhere else, but there has been some debate about whether the Galaxy S21 FE would follow suit.",
    "A separate report from South Korean outlet The Elec (via XDA Developers) claims that the Galaxy S21 FE is due to go into mass production in September, although the article doesn't offer any suggestions about when it might actually be unveiled.",
    "Only yesterday we heard that September 8 could be the day for the big Galaxy S21 FE unveiling. The source on that was one that's usually reliable, although the date seems unlikely if Samsung's suppliers are only just starting to manufacture the handsets.",
    "Other rumors have pointed towards an October launch for the Galaxy S21 FE, which makes a bit more sense considering this new information (if it's accurate, of course). Whenever the phone officially sees the light of day, we'll let you know right away.",
    "Samsung's tendency to release two different configurations of its mid-range and high-end phones (including the Galaxy S21) can be confusing for consumers – and it can also lead to discrepancies in terms of performance between the Snapdragon models and the Exynos models.",
    "The good news is that the new Geekbench listing shows the Exynos 2100 holding up well against the Snapdragon 888, at least in terms of the processing performance that these benchmark tests measure. With the Galaxy S21, the general consensus has been that the Qualcomm chip is the better performer, so Samsung may have made some tweaks.",
    "The majority of the earlier leaks we've seen have pointed to a top-end Snapdragon 888 chipset running inside the Galaxy S21 FE – but there have also been rumors that the entire Galaxy S21 FE series would switch to the Exynos line, which Samsung develops itself, in order to ease the production pressure caused by the global chip shortage.",
    "Indeed, there has been talk that Samsung could limit the Galaxy S21 FE to certain markets because of these external production pressures. Based on the information we have now, it seems we'll get the two variations as normal (though hopefully without the performance differences), which suggests a wider release."
  ],
  "headers": {
    "3": "Mass production begins?",
    "6": "Analysis: a tale of two CPUs"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "SamMobile": "https://www.sammobile.com/news/galaxy-s21-fe-exynos-pops-up-make-everyone-sad/",
    "Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "The Elec": "http://www.thelec.kr/news/articleView.html?idxno=14046",
    "XDA Developers": "https://www.xda-developers.com/samsung-galaxy-s21-mass-production-september/",
    "we heard that": "https://www.techradar.com/news/samsung-galaxy-s21-fe-might-finally-make-an-appearance-on-september-8",
    "pointed towards": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-may-be-way-way-later-than-we-expected",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "earlier leaks": "https://www.techradar.com/news/samsung-galaxy-s21-fe-listing-reveals-the-specs-in-full",
    "pointed to": "https://www.techradar.com/news/key-samsung-galaxy-s21-fe-specs-may-have-been-revealed-by-google",
    "been rumors": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-might-not-be-delayed-by-much-but-at-a-big-cost",
    "been talk": "https://www.techradar.com/news/heres-an-early-look-at-all-the-devices-samsung-is-launching-on-august-11"
  }
}