{
  "source": "https://www.techradar.com/news/why-should-you-care-about-5g-you-can-watch-episode-5-of-seriously-right-now",
  "title": "Why should you care about 5G? You can watch episode 5 of Seriously? right now",
  "category": "phones",
  "updated": "2021-05-07T10:02:08Z",
  "author": "john-mccann",
  "summary": "Explaining why 5G is worth getting excited about",
  "article": [
    "Seriously? What do you think? We gather some of the best tech journalists from all over the internet to argue about the biggest tech topics for your enjoyment.",
    "This week TechRadar's Global Managing Editor, John McCann, Android Central's Executive Editor, Alex Dobie, and Mr Mobile himself Michael Fisher all try to convince Matt that 5G is indeed the future and he should be excited.",
    "Confused and unexcited about 5G, Matt gets three tech experts to try and convince him that he really should care.",
    "Topics covered include misleading marketing, conspiracy theories, where we'll be in five to ten years, how faster uploads will allow tech journalists to drink more and perhaps most important of all - is it possible to make rural infrastructure sound sexy?",
    "John McCann muses a re-brand, saying \"if 5G is forever going to be related to Corona and Bill Gates controlling people... then the sooner 6G comes round the better for publicity\", as Mr Mobile is fearful of the future as 5G may only get good \"right in time for holographic communications to eat up all that bandwidth.\"",
    "Meanwhile Alex Dobie asks the big question; \"are you excited about rural infrastructure?\"",
    "You can watch Seriously? episode 5 above and find our what our experts think. New episodes of Seriously? roll out every two weeks on a Wednesday, and you can catch-up on the entire series via the links below.",
    "Is Apple Truly Innovative? | Should AAA games cost $70? | How scared should we be of smart tech? | Video games don't make good movies"
  ],
  "headers": {
    "2": "Confused and unexcited"
  },
  "links": {
    "John McCann": "https://www.techradar.com/author/john-mccann",
    "Android Central": "https://www.androidcentral.com/",
    "Alex Dobie": "https://www.androidcentral.com/author/Alex%20Dobie",
    "Mr Mobile": "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw",
    "Michael Fisher": "https://twitter.com/theMrMobile",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Is Apple Truly Innovative?": "https://www.youtube.com/watch?v=RH1Roqctank",
    "Should AAA games cost $70?": "https://www.youtube.com/watch?v=g0J4Z1yOc-4",
    "How scared should we be of smart tech?": "https://www.youtube.com/watch?v=0PGmc4eoh-Y",
    "Video games don't make good movies": "https://www.youtube.com/watch?v=TNzF-NRIK0I"
  }
}