{
  "source": "https://www.techradar.com/news/ovh-has-had-to-can-a-second-data-centre-following-fire",
  "title": "OVH has had to can a second data centre following fire",
  "category": "computing",
  "updated": "2021-03-22T11:45:38Z",
  "author": "mayank-sharma",
  "summary": "Things seem to be going from bad to worse, but OVH says it will bounce back",
  "article": [
    "Europe’s largest web hosting provider OVH has lost another data center in its fire-ravaged facility in Strasbourg, France, in addition to the one that had already been destroyed.",
    "Earlier this month a major fire at the OVH facility immediately destroyed one of its data centers, while crippling the other three. The company, which provides cloud hosting services to several major clients all over the world, has been working since to assess the damage and restart the unharmed units.",
    "Its attempts to restart one of the data centers (SBG1) hit a major roadblock when the facility started emitting smoke. Although there was no fire, OVH has now decided to write off this facility as well, along with SBG2, which has already been written off, according to OVH’s CEO Octave Klaba",
    "Klaba has been regularly posting updates about the recovery efforts via Twitter, along with details about the on-going investigations to determine the cause of the fire.",
    "The company has already announced plans to offer a comprehensive free backup service to all its clients, following news that it can’t recover data from the backups of some of its customers, who hadn’t contracted the company for keeping them in the first place.",
    "The team’s restoration efforts seems to be bearing fruit and OVH last week posted a tentative ETA for getting a majority of its cloud computing services back up and running, as it slowly bought the data centers back online.",
    "However, last week a smoke in a room in SBG1 that housed unused batteries led to a complete shutdown. Klaba confirmed that while there was no fire, it appears the batteries were damaged by the earlier fire. Though what led to the unused batteries emitting smoke ten days after the fire is anyone’s guess.",
    "OVH has now decided not to attempt another restart of SBG1. Instead they’ll move the undamaged servers to the data center that the team has already managed to restart once without any issues (SBG4). It was shutdown following last week’s smoke in SBG1, but is expected to come back online later this week.",
    "Via: The Register"
  ],
  "headers": {
    "3": "Damaged beyond repair"
  },
  "links": {
    "OVH": "https://www.techradar.com/reviews/ovh",
    "a major fire": "https://www.techradar.com/news/europes-large-web-hosting-provider-knocked-offline-following-fire",
    "cloud hosting services": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "free backup": "https://www.techradar.com/best/best-free-backup-software",
    "can’t recover data": "https://www.techradar.com/news/ovh-says-it-doesnt-hold-backups-for-some-systems-affected-by-data-center-fire",
    "cloud computing services": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "The Register": "https://www.theregister.com/2021/03/22/ovh_sbg1_written_off_restoration_update/"
  }
}