{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-3-now-dollar150-off-in-amazons-latest-smartwatch-deals",
  "title": "Samsung Galaxy Watch 3 now $150 off in Amazon's latest smartwatch deals",
  "category": "wearables",
  "updated": "2021-04-27T14:54:43Z",
  "author": "tabitha-baker",
  "summary": "A return to a record low price",
  "article": [
    "Samsung Galaxy Watch deals are returning to their lowest prices yet this week, and considering it's only the second time we've seen discounts of this level these are some truly excellent savings for anyone after a cheap smartwatch.",
    "The 41mm Bluetooth Samsung Galaxy Watch is now available at a record low $249.99 (was $399.99), however, if you want to ditch your phone you'll also find the LTE model available for as little as $299.99 (was $449). That's $150 off in both cases, which means excellent value over the premium regular price.",
    "It's true, these smartwatches haven't seen their MSRPs for a while now. However recent sales have only been dropping them down to around $300. In fact, we've only seen these sub-$250 prices once before, during a speedy sale in late February. This is a limited-time deal, though, and we don't know how long Amazon will hold these prices for.",
    "Not in the US? Scroll down for more Samsung Galaxy Watch prices in your region.",
    "The original Samsung Galaxy Watch is around $100 cheaper than this discounted Watch 3 price. However, this original model is showing its age considerably now, and you're getting far better value from the 2020 release. That said, if you're looking to spend as little as possible on a simple fitness tracker, we'd recommend taking a look at the older generation, or the Samsung Galaxy Watch Active.",
    "You'll find all the latest Samsung Galaxy Watch deals on these models just below.",
    "These Samsung Galaxy Watch sales are offering a particularly good price if you're after both a smartwatch and activity monitor. However, if you're just interested in workout specs and don't need such strong smartphone integration, you'll find plenty of cheap Fitbit deals available for less right now. Or, if you're looking for something to play nice with an iPhone, take a look at the best Apple Watch prices on the market right now."
  ],
  "headers": {
    "4": "More Samsung Galaxy Watch deals"
  },
  "links": {
    "record low $249.99 (was $399.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB089DPMDNM%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6424155162897209000-20",
    "as little as $299.99 (was $449)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB089DMR9LD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1180940441977172500-20",
    "Samsung Galaxy Watch prices": "https://www.techradar.com/news/the-best-samsung-galaxy-watch-active-prices-and-sales",
    "cheap Fitbit deals": "https://www.techradar.com/news/cheap-fitbit",
    "best Apple Watch prices": "https://www.techradar.com/news/cheap-apple-watch-deals"
  }
}