{
  "source": "https://www.techradar.com/news/canon-expected-to-launch-100mp-rival-to-fujifilm-gfx100s",
  "title": "Canon expected to launch 100MP rival to Fujifilm GFX100S",
  "category": "cameras",
  "updated": "2021-03-24T17:24:53Z",
  "author": "mark-wilson",
  "summary": "A high-megapixel EOS R is apparently in the pipeline",
  "article": [
    "Just a few weeks after the arrival of some big Canon EOS R1 rumors, fresh Canon speculation has revealed that the camera giant is also likely working on a 100MP EOS R camera.",
    "The reliable Canon Rumors, which rates the leak as \"good information from a known source\", has suggested that the goal of the incoming high-megapixel RF mount camera \"is to be north of 100MP, to provide even more separation between the EOS R5's 45MP and the new high-megapixel sensor\".",
    "The Canon EOS R5's 45MP sensor is ideal for a hybrid camera that can shoot a mix of stills and video, as it gives photographers a mix of resolution and shooting speed. But it seems Canon is working on a model for landscape shooters, tipped to be released \"next year\", that will give them the resolution they demand in a body that could undercut the medium format Fujifilm GFX100S in both size and price.",
    "If the rumors are true, the new 100MP model would be the spiritual mirrorless successor to the Canon EOS 5DS, a camera that we gave a five-star rating when it arrived back in 2015.",
    "Canon Rumors suggests that it will indeed replace that model and also won't simply be a retooled Canon EOS R5. According to the site's source, the incoming high-resolution model isn't \"simply going to be an EOS R5 body with a higher resolution sensor, but a camera geared towards landscape and studio photographers\".",
    "That suggests it will be a different model to the rumored Canon EOS R1, which we're expecting to be a sports and action camera that will take the baton from the Canon EOS 1D X Mark III DSLR.",
    "It's certainly an exciting time to be in the market for a high-resolution camera. We've recently seen the arrival of the medium format Fujifilm GFX100S, a camera that breaks boundaries for the format in terms of its combination of size, resolution and price.",
    "There are already rumors that the Fujifilm GFX100S could soon be getting an even more affordable 50MP sibling, while the Nikon Z9 has been given a development announcement (although we don't yet know what its resolution will be).",
    "Medium format cameras like the GFX100S would still hold a sensor size advantage over a 100MP EOS R camera, because Canon's pro mirrorless cameras all have smaller full-frame sensors.",
    "But an EOS R series camera with that kind of resolution could still bring advantages in areas like autofocus, size, lens choice and price that would make it a compelling option for landscape and studio shooters – particularly those who have already bought into the RF lens system.",
    "On the other hand, the whole concept of high-resolution cameras is arguably becoming a little dated in a world where the latest software can do a compelling job of upsizing your lower-res photos.",
    "The likes of Gigapixel AI and Adobe Photoshop CC 2021's 'Super Resolution' mode are able to enlarge your photos by four times using some nifty algorithms, which means some photographers could instead be tempted by lower-resolution cameras that are better all-rounders and give them shooting advantages in other areas.",
    "Still, we certainly wouldn't turn down the added option of a 100MP version of the Canon EOS R5 and will be keeping our eyes peeled for more leaks and credible rumors."
  ],
  "headers": {
    "6": "New year's resolutions"
  },
  "links": {
    "Canon EOS R1": "https://www.techradar.com/news/canon-eos-r1-release-date-price-rumors-and-leaks",
    "Canon Rumors": "https://www.canonrumors.com/canon-to-release-a-100mp-eos-r-system-camera-next-year-cr2/",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Fujifilm GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Canon EOS 5DS": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/canon-eos-5ds-1283846/review",
    "Canon EOS 1D X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "already rumors": "https://www.techradar.com/news/fujifilm-gfx100s-could-be-getting-an-even-more-affordable-sibling",
    "Adobe Photoshop CC 2021": "https://www.techradar.com/reviews/adobe-photoshop-cc-2021"
  }
}