{
  "source": "https://www.techradar.com/news/nvidias-rtx-4000-gpus-promise-a-huge-performance-leap-but-amd-rdna-3-might-outdo-them",
  "title": "Nvidia’s RTX 4000 GPUs promise a huge performance leap – but AMD RDNA 3 might outdo them",
  "category": "computing",
  "updated": "2021-08-02T09:54:00.315Z",
  "author": "darren-allan",
  "summary": "Rumored performance gains akin to that witnessed with Pascal",
  "article": [
    "Nvidia’s ‘Lovelace’ next-gen graphics cards, which will presumably end up being the RTX 4000 range, could represent a massive generational leap in performance, similar to what we saw from Maxwell to Pascal.",
    "In other words, we could be looking at a performance increase along the lines of that ushered in by the GTX 1080 Ti (and Pascal siblings), a card that we called “crazy-powerful” at the time, and for that matter, one which has stood the test of time well as a result (this GPU still holds up reasonably well today, in fact, as long as you’re not looking to push too hard).",
    "We need to be extra cautious about this prediction for RTX 4000 graphics cards, though, given that the hardware leaker (spotted by Wccftech), a certain Ulysses, isn’t one of the known denizens of Twitter that we commonly see hardware rumors filtering down from (the account is relatively new).",
    "At any rate, bucketful of salt in hand, there are several pieces of speculation here aside from the Maxwell to Pascal performance jump comparison, including that Lovelace boost clocks will hit around the 2.2GHz to 2.5GHz mark, a big hike compared to the current RTX 3000 series.",
    "Furthermore, Nvidia’s Lovelace cards – which we’ve already heard could be due at the end of 2022 – are supposedly likely to arrive at the very close of next year, meaning December, or they could possibly even slip to the first quarter of 2023.",
    "Given that, this makes another tweet that Ulysses just aired even more potentially interesting, namely that “navi31 maybe beat ad102”, or in other words, AMD’s next-gen (possibly RX 7900) flagship will outdo Nvidia’s Lovelace top dog. Although the ‘maybe’ is obviously quite telling, and unsurprising at this point, as we are still in the relatively early stages of development for both AMD and Nvidia here.",
    "We have to be extra skeptical here, as mentioned, but a generational leap akin to that made with Pascal graphics cards is clearly a potential prospect that will get gamers excited. It hints at a Lovelace flagship with a considerably cranked clock speed and blazing performance, which is in line with other recent nuggets from the grapevine suggesting that Nvidia might use an enhanced 5nm process (TSMC) with cards packing up to 18,432 CUDA cores.",
    "The further suggestion that AMD’s next-generation could best this, though, is likely to cause even more of a stir, although that tweet sounds very tentative. With Team Red purportedly looking at an MCM or multi-chip module design, meaning the flagship of the RX 7000 range could use a pair of GPUs, again a big step up in performance wouldn’t be a surprise – and these graphics cards could sneak in at the end of 2022, possibly getting the jump on the RTX 4000 series if Ulysses is right on the ‘early 2023 for Lovelace’ front.",
    "Note that we’ve even heard whispers that Nvidia may adopt an MCM design itself, of course. Realistically, we’re still very early in the rumor peddling here, but there are signals starting to come through regarding some seriously powerful next-gen graphics cards from both major players (with Intel waiting in the wings too).",
    "That’s the good news from a raw grunt perspective, but the slightly more worrying aspect is what kind of price tags we might be looking at for these GPUs, particularly when it comes to higher-end models – and also how much power they might demand. Because if the rumor mill is right on the latter score, both Lovelace and RDNA 3 could be serious Watt guzzlers indeed, which again makes some sense looking at these predicted performance gains. In short, there may be a stiff price to pay for these monster GPUs (and that could even include a power supply upgrade)."
  ],
  "headers": {
    "6": "Analysis: It’s looking like a heated next-gen GPU race"
  },
  "links": {
    "Nvidia’s": "https://www.techradar.com/news/nvidia-geforce",
    "called “crazy-powerful” at the time": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1080-ti",
    "Wccftech": "https://wccftech.com/nvidia-ada-lovelace-gpus-geforce-rtx-40-series-to-bring-same-generational-jump-as-maxwell-to-pascal/",
    "we’ve already heard could": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-finalized-could-arrive-end-2022",
    "meaning December": "https://twitter.com/TtLexington/status/1421858042568531968",
    "namely": "https://twitter.com/TtLexington/status/1421859633916911618",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Nvidia might use an enhanced 5nm process": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-finalized-could-arrive-end-2022",
    "Team Red purportedly looking at an MCM or multi-chip module design": "https://www.techradar.com/news/amd-patent-points-to-new-mcm-gpu-chiplet-technology",
    "could sneak in at the end of 2022": "https://www.techradar.com/news/amds-next-gen-ryzen-cpus-and-rdna-3-gpus-could-launch-together-at-end-of-2022",
    "Nvidia may adopt an MCM design": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-finalized-could-arrive-end-2022",
    "Lovelace and RDNA 3 could be serious Watt guzzlers indeed": "https://www.techradar.com/news/amd-and-nvidia-next-gen-flagship-gpus-could-force-you-into-a-psu-upgrade"
  }
}