{
  "source": "https://www.techradar.com/news/mass-effect-is-perfect-for-a-tv-adaptation-and-it-may-finally-happen",
  "title": "Mass Effect is perfect for a TV adaptation – and it may finally happen",
  "category": "gaming",
  "updated": "2021-11-24T11:35:18Z",
  "author": "gerald-lynch",
  "summary": "Amazon is setting its sights on a Mass Effect TV show",
  "article": [
    "With its space opera vibe and clear influence being drawn from classic sci-fi TV shows like Star Trek, the Mass Effect games have always felt perfect for a TV adaptation. Now, a new report suggests that may finally happen.",
    "Sources speaking to Deadline have revealed that Amazon is looking to bolster its Prime Video streaming service with an adaptation of the Mass Effect video game series.",
    "“Amazon Studios is nearing a deal to develop a series based on the best-selling sci-fi video game franchise from Electronic Arts,” says the report, which cites Amazon’s continuing TV adaptation successes as the impetus behind the studio chasing the franchise rights. Amazon has picked up a strong audience for comic book adaptation The Boys, has seen a solid reception to its new The Wheel of Time novel series adaptation, and is currently working on a much-anticipated Lord of the Rings prequel series.",
    "“You will see us continuing to invest in fantasy genre of all kinds, we have a genre-focused team on the ground in Studios who work tirelessly with our creative partners on those slates, and you can look forward to more,” Amazon Studios head Jennifer Salke told Deadline when asked about future plans.",
    "There’s no better game series out there than Mass Effect when it comes to TV potential. A galaxy-spanning saga with four games’ worth of lore and world-building to draw upon, its core series focuses on one Commander Shepard and their fight to save the galaxy from the re-emergence of an ancient machine race hellbent on destroying all organic life.",
    "With an incredible cast of characters, locations and technologies, and a multi-threaded storyline that has already provided gamers with engrossing sub-plots, twists and character motivations, there’s enough in Mass Effect to easily draw out multiple series of Star Trek-like content from. It’d require a substantial budget to do its space-age universe justice, but would easily pick up an initial audience with a vested interest, and pique the interest of a generation raised on Star Wars and the aforementioned Trek.",
    "Amazon would also be approaching the games adaptation genre with the audience groundwork already established for it. Netflix has had some success with its Castlevania TV series, and HBO’s big-budget adaptation of The Last of Us games is hugely anticipated. Not only is the source material of Mass Effect ripe for serialization, but there’s a huge and dedicated fanbase that enjoy the series primarily for its storytelling.",
    "But which Commander Shepard would the series focus on? Players can make the interstellar hero any gender of their choosing, in their own image, and align their morality to side with the forces of good or evil. Casting a commander for the TV show would canonize one version of the character – so perhaps the series should focus on the world-building of Mass Effect, rather than the game series’ heroes, for fear of treading too closely to the cherished images of a viewer’s personal Shep?",
    "Elsewhere in Mass Effect news, game developers Bioware have hinted that work is progressing on the next video game entry into the series."
  ],
  "headers": {
    "4": "Ripe for adaptation"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/11/the-wheel-of-time-premiere-ratings-amazon-prime-video-mass-effect-lort-of-the-rings-jennifer-salke-qa-1234879517/",
    "Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "The Boys": "https://www.techradar.com/news/the-boys-season-3",
    "The Wheel of Time": "https://www.techradar.com/news/amazons-the-wheel-of-time-season-1-release-date-cast-plot-trailer-and-more",
    "Lord of the Rings prequel series": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "Castlevania TV series": "https://www.techradar.com/news/castlevania-season-4-will-be-its-last-but-could-there-be-a-sequel",
    "big-budget adaptation of The Last of Us": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show"
  }
}