{
  "source": "https://www.techradar.com/news/one-of-the-first-psvr-2-games-may-have-just-been-revealed",
  "title": "One of the first PSVR 2 games may have just been revealed",
  "category": "gaming",
  "updated": "2021-03-03T10:04:01Z",
  "author": "gerald-lynch",
  "summary": "Farpoint developers are making a return",
  "article": [
    "With the PSVR 2 virtual reality headset officially announced by Sony for the PS5 (if not yet fully revealed), could we now be seeing the first PlayStation VR 2 games starting to rear their heads?",
    "That's what's possibly being teased by developer Impulse Gear, the developer behind blockbuster PSVR exclusive Farpoint (pictured above). It's revealed that it's working on a new VR game – it's first fresh title since Farpoint's launch three and a half years ago.",
    "Could this be Farpoint 2? And could it be one of the first games to launch with PSVR 2? Being one of the PSVR's biggest exclusive hits, it's likely Impulse Games would like to replicate the success on any successor – but the developer has also stated that this new title is expected to launch in 2021.",
    "We're expecting PSVR 2 to be at least a couple of years away from launch, and while that doesn't rule out this game's appearance on Sony's headset, it makes it more likely that this new title will be a multiplatform VR game, possibly including support for the Oculus Quest 2, HTC Vive family and Valve Index headsets. Perhaps then it will be a spiritual successor to Farpoint, seeing as though those on other platforms will likely not be familiar enough with the existing storyline to warrant investment in a sequel.",
    "Little is known about the new game from Impulse Gear just yet, though the developers have created a fun teaser trail for fans to follow.",
    "The studio has revealed the following image:",
    "... which links to a distorted 'Decrypted Message\" SoundCloud audio file.",
    "It's not easy to discern exactly what's said, but the alien-sounding voice appears to be saying something about using \"violence to bring peace.\"",
    "There's definitely a sci-fi angle then, in keeping with Farpoint's setting. It saw you stranded on an alien, Mars-like planet, being attacked by giant insects and robots, making excellent use of the PSVR Aim gun to put you in middle of heated shootouts that were reminiscent of the Starship Troopers film.",
    "Impulse Gear says it will be making a \"full reveal and announcement soon,\" so there won't be long to wait to find out. We'll keep you posted."
  ],
  "headers": {
    "4": "So, is this Farpoint 2?"
  },
  "links": {
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Farpoint": "https://www.techradar.com/news/farpoint-for-playstation-vr-gave-me-virtual-reality-shellshock-and-i-loved-it",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "HTC Vive": "https://www.techradar.com/reviews/htc-vive-pro",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "'Decrypted Message\" SoundCloud audio file": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1270548883115032600&xs=1&url=https%3A%2F%2Fsoundcloud.com%2Fimpulsegear%2Fdecrypted-message&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fone-of-the-first-psvr-2-games-may-have-just-been-revealed"
  }
}