{
  "source": "https://www.techradar.com/news/apple-macs-with-m1-chip-finally-get-bluetooth-fix-with-macos-big-sur-112",
  "title": "Apple Macs with M1 chip finally get Bluetooth fix with macOS Big Sur 11.2",
  "category": "computing",
  "updated": "2021-02-02T17:26:04Z",
  "author": "darren-allan",
  "summary": "But reported screensaver problem hasn’t been cured, seemingly",
  "article": [
    "Apple Macs with the new M1 chip have received an important fix for Bluetooth gremlins which have proved seriously disruptive, thanks to a fresh update for macOS Big Sur.",
    "Version 11.2 of Apple’s operating system isn’t a big update, but it does provide some important fixes including the (recently promised) solution to those wireless woes, with Apple noting that Bluetooth reliability is “improved” in v11.2.",
    "Big Sur 11.2 also delivers a cure for those who have been experiencing problems with an external monitor getting a black screen, when hooking it up to a Mac mini (M1, 2020) while using an HDMI to DVI converter.",
    "Issues with saving edits to ProRAW format images in the Photos app have been solved, too, and iCloud Drive sync flaws as well, plus Apple has resolved a problem whereby System Preferences would fail to unlock when entering the correct admin password.",
    "Speaking of System Preferences, head here and click on Software Update to grab version 11.2 for yourself. Those with affected MacBook or Mac mini M1 machines will doubtless want to do so quickly if they are suffering at the hands of that Bluetooth bug.",
    "Unfortunately, there’s no mention of a solution for the other annoying bug we’ve seen reported by some users in recent times, namely the screensaver randomly popping up on M1-powered Macs. So presumably that’s a fix for another day, even though from what we heard on the grapevine, the 11.2 beta supposedly provided a cure.",
    "Via Wccftech"
  ],
  "headers": {
    "3": "Password problem"
  },
  "links": {
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Bluetooth gremlins which have proved seriously disruptive": "https://www.techradar.com/news/mac-mini-m1-2020-is-reportedly-having-problems-with-bluetooth-connectivity",
    "recently promised": "https://www.techradar.com/news/apple-macs-with-m1-chip-could-soon-get-a-fix-for-reported-bluetooth-issues",
    "Big Sur 11.2": "https://www.techradar.com/how-to/how-to-download-and-install-macos-11-big-sur",
    "screensaver randomly popping up": "https://www.techradar.com/news/apple-macs-with-m1-chip-reportedly-hit-by-annoying-screensaver-bug",
    "11.2 beta supposedly provided a cure": "https://www.techradar.com/news/apple-macs-with-m1-chip-reportedly-hit-by-annoying-screensaver-bug",
    "Wccftech": "https://wccftech.com/macos-big-sur-11-2-final-version-released-for-intel-and-m1-macs/"
  }
}