{
  "source": "https://www.techradar.com/news/fujifilm-gfx100s-vs-sony-a1-which-is-the-best-mirrorless-powerhouse",
  "title": "Fujifilm GFX100S vs Sony A1: which is the best mirrorless powerhouse?",
  "category": "cameras",
  "updated": "2021-02-05T16:20:42Z",
  "author": "andrew-williams",
  "summary": "How do these two new mirrorless megastars compare?",
  "article": [
    "The Fujifilm GFX100S and Sony A1 are already two of the biggest camera launches of the year – and despite sharing similarly eye-watering price tags, they don't technically belong in the same camera category.",
    "While the Sony A1 (also known as the Sony Alpha 1) has a full-frame sensor, the GFX100S has an even bigger medium format chip that's around 67% larger than full-frame.",
    "It's these very different sensors that results in some big differences between these two cameras, including their relative designs, shooting skills and strengths.",
    "Of course, the big thing these cameras do have in common is their huge price tags.",
    "The Sony A1 costs $6,500 / £6,500 / AU$10,499, while the Fujifilm GFX100S will set you back $5,999 / £5,499 / AU$9,499. So assuming you had that amount of money to spend on a camera, which should you go for?",
    "Broadly speaking, the Fujifilm GFX100S’s ultra-large sensor will retain greater detail and dynamic range at very high ISOs than a full-frame camera. But the Sony A1 can shoot 8K video, impressive slo-mo video and offers radically better burst performance is radically better.",
    "As you'd expect, it's a little more complicated than that though – so read on to find out how these ultra-premium cameras compare across the board.",
    "The Sony A1 is likely to command more attention than the Fujifilm GFX100S, but the Fujifilm stands out in an important way.",
    "It’s a medium format camera that's not much larger than some full-frame models. Carrying it around as a casual-use camera is not off the cards, and that's pretty incredible for a format that, until recently, only lived in studios.",
    "Unsurprisingly, it is a little larger than the Sony Alpha 1 in each dimension. The Fujifilm GFX100S is 87.2mm thick, to the Sony’s 80.8mm. It’s also 150mm wide, to the Sony’s 128.9mm, and 104mm tall. By comparison, the A1 stands at 96.9mm.",
    "You only have to look at the older Fujfilm GFX100 to appreciate what we get here, though. That camera is 102.9mm deep and 163.6mm tall, because it has a battery grip built-in and a gigantic EVF (electronic viewfinder) module.",
    "For some, the GFX100S’s larger sensor will justify the extra bulk. Its medium format chip has a 43.8 x 32.9mm light gathering surface, to the Alpha A1’s 35.9 x 24.0mm. Here’s a side-by-side comparison diagram.",
    "Some eyes will head straight to their megapixel counts. The 102MP Fujifilm GFX100S has twice the resolution of the 50.5MP Sony A1. And that resolution will come in handy for controlled situations where you can use base ISO and a solid tripod. But the larger sensor should, in theory, let the Fuji hold onto its detail and dynamic range at higher sensitivities better than the Sony.",
    "To a certain breed of big-handed photographer, this may appeal for night-time street photography. But don’t forget these cameras’ relative weights.",
    "The Fujifilm GFX100S weighs 900g without a lens. It’s enough to make you miss 1-inch sensor compacts (to be fair, we generally do when not using one). Sony’s A1 is not exactly light at 737g, but we can picture walking around town with it and a low-weight prime. The Fuji, despite it manageable size, may just be that bit too heavy for many.",
    "The Fujifilm GFX100S’s rear display is also fairly flexible. It has a three-direction hinge – this means you can tilt it 90 degrees so it points upwards, 45 degrees the other way and 60 degrees to the right. It’s a touchscreen too.",
    "By comparison, the Sony A1's slightly retro screen only tilts in two directions, up and down. This is probably because this style is often favored by stills photographers, who the A1 is mainly aimed at, despite its hybrid skills.",
    "The resolution of the Fujifilm GFX100S screen is also higher, at 2.36-million dots (1024 x 768 pixels) and larger at 3.2 inches. The Sony A1’s 3-inch screen clocks in at just 1.44-million dots (800 x 600 pixels), which again seems slightly strange considering how premium the rest of its features are.",
    "Still, Sony’s focus is very much on the A1's incredible EVF. It’s a 0.64-inch OLED panel with good 0.9x magnification and a very high resolution of 9.4-million dots. That is 2048 × 1536 pixels, which is above Full HD.",
    "Fujifilm’s EVF is much more ordinary, with 0.77x magnification and resolution of 3.69-million dots or 1280 x 960 pixels. This is the 4:3 aspect ratio take on 720p.",
    "Fuji hits back with an unusually large and useful additional display on the top plate. It’s a monochrome mode/status OLED, so will be visible in dark conditions.",
    "Most top displays like this rely on ambient light to be seen. Fujifilm has played around with this area of camera tech in previous GFX-series cameras, and it's a useful addition for many pro photographers.",
    "The Fujifilm GFX100S is an impressive and unusual camera in several respects. But medium format models are still a poor choice if you need fast burst shooting.",
    "Its top speed is 5fps, and the buffer runs out after 42 JPEGs or 16 raws. That means you can only burst-shoot for three seconds when capturing raw files.",
    "The Sony A1 shoots compressed files at up to 30fps, or 10fps using its mechanical shutter. And the buffer is fit for 238 raws for 192 raw+JPEG frames. For any kind of action scenario, the Sony is the clear choice.",
    "Sony’s speed advantage continues with autofocus. Its full-frame cameras already had excellent AF for mirrorless cameras but the Sony A1 improves upon things like face and eye tracking. The early reports so far are positive.",
    "Expect autofocus you can truly rely on, because it’s geared to match the pro sport photographer aspect of the Alpha 1’s burst speed.",
    "Want the numbers? The Alpha A1 has 759 phase detection points and covers 93% of the frame.",
    "The Fujifilm GFX100S’s AF system is a little closer to that of its cheaper T-series cameras, even though they use on-sensor phase detection pixels and this camera has radically more pixels to play with. You get up to 425 phase detection points, along with eye- and face-detection.",
    "Buy a Fujifilm GFX100S and you can expect good AF performance for a medium format camera. But it is not realistic to expect it to compete with a smaller format camera made, in part, for pro sports/action photographers.",
    "The Fujifilm GFX100S also falls behind in video modes. No surprise there.",
    "Sony claws at the limits of full-frame mirrorless camera video modes, with 8K/30 capture, 4K/60p and 120fps slo-mo at 4K resolution. It is supremely capable, and can output a 16-bit 4K feed over HDMI to an external recorder.",
    "The Fujifilm GFX100S’s video modes are more ordinary. It can shoot 4K, but only up to 30fps. Its 1080p mode is capped at 60fps, and there’s no slo-mo mode.",
    "The GFX100S is not really made for video, but it's certainly no write-off here. It shoots 4K with 4:2:0 chroma subsampling, has digital image stabilization, and don’t forget the six-stop in-body image stabilization (IBIS). There’s also a flat F-log shooting profile and 4:2:2/12-bit RAW capture when using an external recorder.",
    "It's fair to say you wouldn't buy a Fujifilm GFX100S for video, but absolutely isn't a traditional medium format stills camera either. With those video credentials, plus the ability to record continuous 4K videos for up to two hours, it should be a great tool for capturing pro-quality footage, as long as you don't need the option of slo-mo.",
    "Neither of these cameras has a baked-in battery grip, so you don’t get enough juice for a full, heavy day of shooting. But the numbers aren’t bad.",
    "The Fujifilm GFX100S can shoot 460 stills, 95 minutes of continuous 4K video or 110 minutes at 1080p, rated by the CIPA standard (which is usually a little conservative). The Sony A1 fares even better – it’s rated for 530 stills (430 using the EVF), and up to 150 minutes of video.",
    "The capacities of the two batteries, the Sony NP-FZ100 and Fujifilm NP-W235, are almost identical at 16.4Wh and 16Wh a piece, so it's understandable that the battery lives are so comparable.",
    "Both of these cameras have a wide array of connectors. The ones they share include a 3.5mm headphone socket, 3.5mm mic socket and USB-C.",
    "But beyond this, they diverge. The GFX100S sadly has a microHDMI, which is generally a little more prone to breakages than the Sony A1's full-size HDMI – the latter is a more robust connector, primed for years of abuse.",
    "The Fuji also has a 2.5mm remote release, but Sony goes further with a microUSB-shaped multi connector, which is used for remotes and other accessories.",
    "The A1 also has Bluetooth 5.0 compared to the GFX100S’s Bluetooth 4.2 and there’s a full-size Ethernet port on the Sony, handy for FTP’ing images in certain on-site professional scenarios. For most of us, USB-C will do the trick just fine.",
    "It's pretty clear why some photographers will choose the Fujifilm GFX100S over the Sony A1, and vice versa.",
    "Fujifilm makes medium format photography more accessible than ever in the GFX100S, which will appeal to those shooting landscapes, still life photos and most subjects aside from action and sports. Its body is relatively small, it has good IBIS and the autofocus is comparable with its mirrorless rivals.",
    "The Sony A1 doesn’t have the same resolution and won’t offer the same native dynamic range or high ISO performance as the GFX100S. But its AF is superior, its burst shooting is from another galaxy, and it is far more accomplished for video capture.",
    "Overall, Sony’s camera is more versatile – but for stills shooting where your subject isn’t moving at 50mph, the Fujifilm's medium format star promises to be something very special."
  ],
  "headers": {
    "7": "Sensor and body size: Fujifilm breaks new ground",
    "15": "Screen and EVF: Fuji wins on screen tech, Sony on EVF",
    "22": "Burst performance: it's a clean sweep for Sony",
    "25": "Autofocus: the Sony A1 is the clear AF winner",
    "30": "Video: The Sony A1 is a next-level video shooter",
    "35": "Battery: Similar longevity, but Sony pips it",
    "38": "Connectivity: Sony plays to the pro audience",
    "42": "Takeaway"
  },
  "links": {
    "Fujifilm GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1"
  }
}