{
  "source": "https://www.techradar.com/news/google-pixel-6-update-brings-fitness-features-unavailable-on-most-android-phones",
  "title": "Google Pixel 6 update brings fitness features unavailable on most Android phones",
  "category": "phones",
  "updated": "2021-11-12T09:59:20Z",
  "author": "james-peckham",
  "summary": "Heart rate and respiratory tracking on the Pixel 6",
  "article": [
    "The Google Pixel 6 and Pixel 6 Pro are receiving a new update that brings heart rate tracking and respiratory tracking features, tools that, for smartphones at least, are currently exclusive to the Pixel line of smartphones.",
    "These features were first introduced to the Pixel line in March 2021, but they weren't available in the Google Fit app on the Pixel 6 or Pixel 6 Pro at launch.",
    "Some Pixel 6 owners have said these features still aren't available on their phones, but TechRadar can confirm the features are available on our versions of the Pixel 6 and Pixel 6 Pro.",
    "It seems the feature may be in early access for some users, but there doesn't seem to be a clear reason why some can use it and others can't.",
    "This new feature is within the Google Fit app, and you'll likely need to update the app to ensure you've got the features available.",
    "Google has said this feature will one day be coming to other Android phones, but we've yet to get a clear date from the company on when this will stop being exclusive to the Pixel line.",
    "If you own a Google Pixel 3, or a more recent smartphone from the company, you'll likely have access to these features as well.",
    "The Pixel's new feature features can be found in the Google Fit app. The first tab called Home will offer you the option to do these if you have a compatible device.",
    "There isn't a dedicated heart rate or respiratory tracker on the Pixel 6 or Pixel 6 Pro, unlike most smartwatches and fitness trackers, so the feature uses a combination of the camera hardware.",
    "Google's heart rate tracking uses the rear camera. It asks you to sit in a well-lit location, and to place your finger over the top of the main camera on the rear of the phone.",
    "It'll then ask you to sit still for around 30 seconds as it takes the reading. We found this to work accurately when compared to a Mobvoi TicWatch Pro 3 Ultra GPS's heart rate sensor.",
    "The respiratory tracking uses your selfie camera, and you'll be asked to prop your phone up so you can see your face and your upper body. It'll then record you sitting still, and give you a result of your breathing.",
    "Via 9To5Google"
  ],
  "headers": {
    "7": "Analysis: how does it work?"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "9To5Google": "https://9to5google.com/2021/11/11/pixel-6-google-fit-heart-camera/"
  }
}