{
  "source": "https://www.techradar.com/news/sony-xperia-1-iii-vs-iphone-12-pro-max-whos-the-real-pro-here",
  "title": "Sony Xperia 1 III vs iPhone 12 Pro Max: who’s the real pro here?",
  "category": "phones",
  "updated": "2021-07-27T11:27:15.611Z",
  "author": "jon-mundy",
  "summary": "Apple versus Sony",
  "article": [
    "The Sony Xperia 1 III joins an increasingly competitive and highly exclusive field of ultra-expensive premium smartphones.",
    "This is a relatively new elite category that was arguably established by Apple, with the iPhone 12 Pro Max standing as the current poster boy. If you want to make an impression at the top end of the smartphone market, you could do worse than giving this giant slab of glass and metal a cracked screen.",
    "So how does the Sony Xperia 1 III match up? Is it as fast, classy, and well endowed in the camera department as Apple’s champion?",
    "Let’s take a closer look.",
    "The Sony Xperia 1 III was revealed on April 14, 2021, but it’s not set to be released into the US and UK markets until August 19. Whenever it lands, it’ll cost a not inconsiderable $1,299.99 / £1,199, which will get you 256GB of storage and 12GB of RAM.",
    "Depending on your region, you might spot a 512GB capacity model out in the wild, but don’t hold your breath if you’re in the US or UK. And sorry, Australians - Sony doesn’t sell its phones in your fine country.",
    "There’s no such spotty rollout issues for any iPhone, of course. The iPhone 12 Pro Max hit most major territories on November 13, 2020, priced at $1,099 / £1,099 / AU$1,849 for the 128GB model. You’ll need to stump up $1,299 / £1,199 / AU$2,019 for 256GB, and $1,399 / £1,399 / AU$2,369 for 512GB.",
    "Like for like, then, these two phones are the same price.",
    "Both of these phones buck the smartphone design trends of the day, throwing off the curves and embracing flat surfaces. But they still don’t look much like one another.",
    "While both phones eventually concede to the curves in their corners, the Sony Xperia 1 III only does so at the last possible minute. It’s an angular beast alright, but it feels stealthy and subtle in the new Frosted Black shade. It also comes in Frosted Gray and Frosted Purple, though again regional limitations come into play.",
    "Apple’s design is slightly showier, with bold color options like Silver, Graphite, Gold, and Pacific Blue. It has a much shinier rim, too, which is formed of a more premium stainless steel (the Xperia’s is aluminum).",
    "While these are two big phones, the Sony Xperia 1 III stands much taller than the iPhone 12 Pro Max at 165 x 71mm. Apple’s phone, by contrast, is a relatively squat 160.8 x 78.1mm.",
    "The Sony is way lighter at 186g versus the iPhone’s 228g, but Apple’s phone is skinnier at 7.4mm as opposed to 8.2mm.",
    "There are two reasons for the Sony phone’s extreme length: first, an unusually wide (or tall in portrait orientation) 21:9 display compared to the iPhone’s 19.5:9 equivalent. Second, the presence of relatively thick forehead and chin bezels.",
    "Those chunky bookends serve a couple of purposes. They enable the Xperia 1 III to pack in true front-firing stereo speakers, which is a big plus. But more notably, they enable Sony to do away with any semblance of a screen notch.",
    "This is a perfectly rectangular and unbroken display, with no disruptive selfie camera to speak of. That too is stashed away in the forehead.",
    "Apple takes a very different approach, squeezing its Face ID system into a large cut-away notch. Don’t get us wrong, Face ID is great, but that notch really interferes with widescreen video and gaming content.",
    "Sony goes the old-fashioned fingerprint sensor approach to biometric authentication, but even this is a little different to the norm. Rather than stashing its sensor behind the display, as is most Android phones do, it instead stores it behind an elongated power button on the right-hand edge.",
    "This forms part of a very busy right edge, which also contains a volume rocker, a Google Assistant button, and a dedicated two-stage shutter button. We could do without that Google button, in truth.",
    "The top of the Sony features the unusual provision of a 3.5mm jack. Together with those speakers and support for Sony’s LDAC codec, the Xperia 1 III should be considered the first stop for audiophiles.",
    "The iPhone 12 Pro Max has an extra physical control of its own, on the left-hand edge. Apple’s silent switch continues to be a useful provision, and we’re mystified that only OnePlus has followed suit on Android.",
    "Both manufacturers have gone above and beyond with their water-proofing, albeit in differing ways. Sony has added IP65 certification to the usual IP68, which means it can also withstand direct jets of water in addition to full immersion. Apple, on the other hand, has implemented a kind of ‘IP68+’, with the iPhone 12 Pro Max capable of withstanding up to 6m of water for 30 minutes, rather than the usual 1.5m.",
    "As we’ve already discussed, the Sony Xperia 1 III’s display is much taller than the iPhone 12 Pro Max’s, and it also has the benefit of being completely unbroken by bothersome notches.",
    "But that’s not where the differences end. The iPhone’s screen is the larger of the two at 6.7-inches, with the Xperia measuring in at 6.5 inches.",
    "The Sony has a much sharper 4K (3840 x 1644) output than any other non-Sony smartphone, including the iPhone 12 Pro Max. Apple’s champ is no slouch in this department, mind, with a pixel-packed 2778 x 1284 resolution yielding a sharp image.",
    "The Xperia 1 III display can also support a 120Hz refresh rate compared to the iPhone 12 Pro Max’s meager 60Hz. Not every app will work with 4K at 120Hz though, so you won't always get that experience, but it is an option for many applications.",
    "All in all, these are two vibrant, accurate OLED displays. The Sony Xperia 1 III comes up with more technical feats and is markedly better for media consumption, but the iPhone’s is more consistent and arguably preferable for general smartphone tasks.",
    "Sony and Apple seem to be in agreement over the best approach to camera hardware. Both of these phones pack in fine triple 12MP camera systems for wide, ultra-wide, and telephoto focal lengths, backed by TOF depth sensors.",
    "But they diverge over their wider camera philosophies. Sony is all about speed and pro-level fine control, placing the onus on the enthusiast shooter to get peak results. Apple is all about point-and-shoot accessibility, using its algorithmic might to generate classy shots with minimal effort.",
    "Sony’s autofocus system is the best we’ve seen, with an uncanny ability to lock onto subjects and fire quick, in-focus snaps. Its revised camera app defaults to a Basic mode, but encourages you to go hands-on with focus, ISO, shutter speed, and other Pro settings. Don’t forget it also has that physical two-stage shutter button, which gives you even more control overshooting.",
    "The iPhone 12 Pro Max isn’t without its own technical advantages, particularly with its f/1.6 aperture, sensor-shift stabilization (which is better than OIS), and a LiDAR sensor for sharp low-light autofocus.",
    "But Apple’s real strength lies with its sophisticated image processing. Smart HDR 3 and Deep Fusion provide smarter shot selection and better contrast, while ProRAW combines the full-fat RAW format with JPEG’s computational tweaking. Meanwhile, Apple’s Night mode algorithms knock Sony’s into a cocked hat, producing spookily bright and clear low light shots that the Xperia simply can’t match.",
    "The two manufacturers share a preference for a more natural brand of color science, but Sony arguably goes further with its ‘as you see it’ approach. Its shots can look a little dull and soft as a result, whereas Apple’s tend to have a little more pop and vibrancy.",
    "Both phones have 12MP ultra-wide sensors, though Sony’s is bigger (1/2.6“ vs 1/3.6”), wider (124-degrees vs 120-degrees), and brighter (f/2.2 vs f/2.4) than Apple’s.",
    "Sony has a far bigger technical advantage when it comes to the telephoto sensor - or rather, the telephoto lenses. While Apple utilizes a single 2.5x optical zoom lens, Sony goes with an innovative dual-lens system. It can swap between a 3x and a 4.4x optical zoom in an instant, giving the Xperia 1 III far more scope for zoomed-in shots.",
    "The iPhone has a better selfie camera though - a 12MP unit compared to Sony’s slightly underwhelming 8MP equivalent.",
    "On the video front, the Sony Xperia 1 III is once again the more hands-on, with a dedicated Cinematography Pro ‘powered by CineAlta’ app that provides fine control over your footage. It also supports 4K recording at up to 120fps, while the iPhone only gets to 4K video at 60fps.",
    "But Apple has built a reputation for shooting the best video in the business, and the iPhone 12 Pro Max continues that trend. If you just want something to shoot brilliantly clean, stable footage without fuss, it’s the winner.",
    "Both of these phones sit at the top of their respective platforms. The Sony Xperia 1 III is one of the fastest Android phones in the business, and the iPhone 12 Pro Max is the fastest iOS phone out there.",
    "Put simply, the A14 Bionic of the iPhone is way faster than the Snapdragon 888 of the Sony.",
    "The iPhone 12 Pro Max scores an average Geekbench 5 multi-core score of 4106, and a single-core score of 1591. Sony could only manage a (recently re-tested) 3625 multi-core score, and 1120 for single-core. That’s a difference of around 400 to 500 points on both counts.",
    "Sony has equipped its phone with double the RAM (12GB vs 6GB), but that doesn’t really have much of an impact given the differing demands of Android and iOS.",
    "Given those differences, though, does it really matter that the iPhone 12 Pro Max is more powerful than the Sony Xperia 1 III? Within their separate ecosystems, both will run the latest games and apps at maximum settings, and nothing you do in general usage will challenge either phone. They’re both super-slick.",
    "There is the matter of future-proofness, of course, and when you factor in Apple’s peerless legacy support, the iPhone 12 Pro Max will almost certainly feel faster for longer.",
    "Away from processing power, Sony gives you the option of 256GB and 512GB of internal storage. Apple gives you extra flexibility with 128GB, 256GB, or 512GB. But Sony also gives you a microSDXC slot for expansion purposes, so it’s arguably the winner on this front.",
    "In terms of software, the iPhone obviously gives you the same clean iOS that runs on every other iPhone. There are major advantages to that, including the aforementioned legacy support, not to mention greater security and a more complete App Store.",
    "But Android has its strengths too, such as greater flexibility and customization potential, superior notifications, and generally better compatibility with non-Apple apps and products. And Sony’s take on Android 11 is nice and clean, too, with none of the gaudy tweaks of Xiaomi or Samsung.",
    "We particularly appreciate Sony’s split-screen implementation, which lets you run two apps side by side. It works well on that extra-long display.",
    "The Sony Xperia 1 III’s extra thickness allows for a larger battery than the iPhone 12 Pro Max. It’s 4500 mAh as compared to the Apple phone’s 3687 mAh cell.",
    "Of course, with a sharper or more fluid display, depending on the task at hand, it arguably needs that extra capacity. Especially when you factor in Android’s more power-hungry habits compared to iOS.",
    "Indeed, we’d give the stamina prize to the iPhone here. It’s the longest-lasting phone in Apple’s range, and can last through an entire day of intensive usage.",
    "The Xperia 1 III, on the other hand, will generally find itself with around 10% left at the end of a long day of moderate usage. That’s still fine, but it doesn’t inspire the same confidence as the iPhone.",
    "Sony scores some points back with its charging provision. It bundles a 30W charger in with its expensive flagship, while Apple doesn’t. What’s more, the iPhone 12 Pro Max only supports up to 20W charging.",
    "Both phones will support wireless and reverse charging, though.",
    "Going by our original reviews, it would seem clear that we’d hand the iPhone 12 Pro Max the nod in a straight pick. We scored it 9 out of 10 to the Sony Xperia 1 III’s 8 out of 10, after all.",
    "But it’s a little more complicated than that, not least because the Sony was released into a way more competitive field than the iPhone.",
    "Sony’s latest is a dream for media enthusiasts, creative types, and pros. It’s uniform 4K 21:9 display renders movies better than the iPhone, while its front-firing speakers and 3.5mm jack make it great for audiophiles. Its camera is just about the most hands-on, not to mention plain fast we’ve ever used, so avid photographers should take note.",
    "But the iPhone is the more cohesive and accessible phone of the two. Its camera will produce effortlessly great photographs in all conditions, it’s a fair bit more powerful and future-proof of the two, and Apple’s ‘walled garden’ continues to flourish with solid apps and services.",
    "The iPhone 12 Pro Max is the better phone for most people, But ultimately it comes down to your own wants and needs. You pay your $1,299 / £1,199 and you take your choice."
  ],
  "headers": {
    "4": "Sony Xperia 1 III vs iPhone 12 Pro Max price and availability",
    "8": "Design",
    "22": "Display",
    "27": "Camera",
    "38": "Specs and performance",
    "48": "Battery",
    "54": "Takeaway"
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Android phones": "https://www.techradar.com/best/best-android-phones"
  }
}