{
  "source": "https://www.techradar.com/news/under-display-cameras-finally-return-as-zte-axon-30-launches-in-china",
  "title": "Under-display cameras finally return as ZTE Axon 30 launches in China",
  "category": "phones",
  "updated": "2021-07-27T17:24:50Z",
  "author": "david-lumb",
  "summary": "Under-screen camera phones are here!",
  "article": [
    "Notch haters and punch-hole loathers, rejoice: the ZTE Axon 30 is the latest phone with an under-display camera, and it's just launched in China with a global release planned later.",
    "The standard ZTE Axon 30 is a slightly lower-spec version of the ZTE Axon 30 Ultra and ZTE Axon 30 Pro released in April. The new phone has a Snapdragon 870 chipset and either 8GB or 12GB of RAM with 128GB or 256GB of storage, compared to the latter phones’ Snapdragon 888 chipset and, in the ZTE Axon 30 Ultra’s case, up to 16GB of RAM and 1TB of storage.",
    "But the real difference is in cameras: all three phones have 16MP front-facing cameras, but only the standard ZTE Axon 30 hides its shooter under the display (the others fit their selfie camera in a punch-hole). That’s an in-screen camera under a fairly advanced 6.9-inch display, too, with 120Hz refresh rate and 360Hz touch sampling rate.",
    "The ZTE Axon 30 has a triple rear camera array, with a 64MP f/1.8 main camera, 8MP ultrawide shooter capturing a 120-degree field of view, and 5MP macro camera as well as a 2MP depth sensor. The standard phone does miss out on the Axon 30 Ultra’s 8MP periscope lens with 5x optical and up to 60x digital zoom, though.",
    "Unfortunately, we don't have ZTE Axon 30 price or release date info just yet, though ZTE's press release does say that a \"global version is coming soon\" and will be available on ZTE's website.",
    "The ZTE Axon 30 isn’t the first phone to hide its front-facing camera beneath its front screen, but the feature is still uncommon. Its predecessor, the ZTE Axon 20, launched in 2020 as the first commercially available smartphone with an under-display camera, but given the continuing trouble of the US government’s ZTE ban, it’s unsurprising that the phone (and its innovative selfie tech) hasn’t made a big splash outside China.",
    "That could change with the Axon 30 given the FCC’s shift toward potential leniency, but regardless, under-display cameras could be the next big advance embraced by 2021’s lineup of new Android smartphones. While rumors have disagreed on whether the next flagships will get the feature (iPhone 13 is a maybe, Samsung Galaxy S22 probably not), it’s at the top of the list for perks coming in new phones like the Xiaomi Mi Mix 4. If not this year, perhaps 2022 will be the year of the under-screen selfie camera."
  ],
  "headers": {
    "5": "Analysis: are under-display cameras the future?"
  },
  "links": {
    "ZTE Axon 30 Ultra": "https://www.techradar.com/reviews/zte-axon-30-ultra-5g-review",
    "ZTE Axon 30 Pro": "https://www.techradar.com/news/upcoming-zte-axon-30-pro-smartphone-will-sport-a-whopping-200mp-camera",
    "ZTE's website": "https://ztedevices.com/en-us/",
    "ZTE Axon 20": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "continuing": "https://www.techradar.com/news/zte-may-need-to-pay-billions-to-overturn-us-ban",
    "trouble": "https://www.techradar.com/news/us-approves-dollar1bn-rip-and-replace-campaign-to-remove-huawei-and-zte-kit",
    "shift": "https://www.techradar.com/news/fcc-presses-ahead-with-plan-to-close-huawei-and-zte-loophole",
    "embraced": "https://www.techradar.com/news/expect-2021s-upcoming-android-phones-to-embrace-under-display-selfie-cameras",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "maybe": "https://www.techradar.com/news/iphone-13-notch",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "not": "https://www.techradar.com/news/samsung-galaxy-s22-probably-wont-have-an-under-display-camera",
    "Xiaomi Mi Mix 4": "https://www.techradar.com/news/the-xiaomi-mi-mix-4-could-finally-arrive-this-year-with-an-under-display-camera"
  }
}