{
  "source": "https://www.techradar.com/news/ipod-8th-gen-rumor-apple-glass-ar-headset",
  "title": "iPod 8th gen rumors just got a little more ridiculous, tying it to Apple's AR headset",
  "category": "audio-visual",
  "updated": "2021-07-15T17:15:58.432Z",
  "author": "nick-pino",
  "summary": "The iPod 8th gen may be coming, and it may have new meaning if these latest Apple rumors are to be believed",
  "article": [
    "In what is sure to be the unlikeliest Apple rumor you’ll read today, tech evangelist and industry insider Robert Scoble says that a new iPod 8th gen will be unveiled alongside the Apple Glasses at WWDC 2022 that will be held in June of next year.",
    "The two will apparently have some form of connectivity to one another – though Scoble doesn’t explain how or why – but goes on to say that they’ll be available to buy before December 25, 2022 (Christmas of next year).",
    "As wild as this all sounds - and boy does it sound wild - we have heard rumblings of a new iPod Touch in development at Apple from MacRumors contributor Steve Moser and Twitter tipster @AppleLe257, so there’s some precedent for today’s rumor.",
    "That said, no one up to this point has claimed that it would be unveiled alongside Apple’s still fabled AR headset – and I don’t think there was anyone out there in the world who thought the two products would work together somehow. And yet, here we are.",
    "Apple hasn't released a new iPod Touch since 2019 and for the last few years hasn’t really discussed refreshing the iPod. While the company hasn't said it publicly, it seems to have replaced the iPod Touch with the cheapest iPhone series, the iPhone SE.",
    "Still, there are some good arguments to be made for a standalone MP3 player. For one, it would have a headphone jack, something that’s entirely disappeared from Apple’s main iPhone lineup. For another, it could be an option for parents looking for an iOS device for kids who aren’t ready for the responsibility of a phone with a cell phone contract and the ability to call anyone they’d like.",
    "How an iPod would power or enhance an AR headset, however, is beyond me.",
    "Maybe the iPod Touch will slide in the headset and act like an Apple version of the Samsung Gear VR that offers VR in addition to AR. Maybe the iPod Touch will store apps or have a unique musical overlay that you can have playing alongside your music... or maybe they aren’t compatible at all and won’t ever leave Apple’s R&D lab.",
    "Our money’s on that, but we thought it was worth at least informing you of the rumor and its implications, as unlikely as they may be."
  ],
  "headers": {
    "4": "Will Apple ever make an iPod Touch 8th Gen device?"
  },
  "links": {
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses",
    "rumblings of a new iPod Touch": "https://www.techradar.com/news/the-ipod-touch-is-rumored-to-be-making-another-comeback-in-2021",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se"
  }
}