{
  "source": "https://www.techradar.com/news/amazon-buys-11-jumbo-jet-to-boost-prime-ecommerce-deliveries",
  "title": "Amazon snaps up jumbo jets to help ship your Prime deliveries faster",
  "category": "computing",
  "updated": "2021-01-06T09:42:40Z",
  "author": "anthony-spadafora",
  "summary": "Amazon has purchased 11 used jumbo jets as the company looks to build out the capacity of its Amazon Air fleet",
  "article": [
    "Amazon Prime deliveries could soon arrive faster than ever after the ecommerce giant announced plans to widen its delivery fleet even more.",
    "The company has announced that it will purchase eleven Boeing 767-300 jets in order to expand its fleet to better serve Prime customers.",
    "Of these 11 used jumbo jets, seven will come from Delta and four are from WestJet. The four WestJet planes are currently being converted to cargo jets and they will join the Amazon Air fleet later this year while the seven jets from Delta will be added to the fleet in 2022 following their conversion.",
    "VP of Amazon Global Air Sarah Rhoads explained why the company made the decision to purchase its own jets for the first time ever in a press release, saying:",
    "“Our goal is to continue delivering for customers across the U.S. in the way that they expect from Amazon, and purchasing our own aircraft is a natural next step toward that goal. Having a mix of both leased and owned aircraft in our growing fleet allows us to better manage our operations, which in turn helps us to keep pace in meeting our customer promises.”",
    "According to Amazon, its Amazon Air fleet will have more than 85 planes by the end of 2022. The 11 jets recently purchased by the company will be the first planes it owns outright while the others have all been leased.",
    "Amazon first launched its fleet back in 2016 in order to reduce its reliance on both UPS and FedEx. While the company still uses third party services for some of its deliveries, the pandemic has accelerated its plans to use its own planes to deliver packages to customers.",
    "In addition to new planes, Amazon's air hub in Kentucky which has the capacity for 100 planes is set to open this year. The hub is expected to handle an estimated 200 flights per day.",
    "Amazon's decision to purchase its own planes makes a great deal of sense especially now that many aircraft have fallen in value with less people traveling during the pandemic.",
    "Via CNBC"
  ],
  "headers": {
    "5": "Amazon Air"
  },
  "links": {
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Amazon Air": "https://www.techradar.com/news/amazon-just-bought-12-new-aircraft-to-speed-up-your-prime-deliveries",
    "press release": "https://press.aboutamazon.com/news-releases/news-release-details/amazon-continues-expand-its-transportation-fleet-purchased",
    "CNBC": "https://www.cnbc.com/2021/01/05/amazon-buys-boeing-jets-from-delta-westjet-as-aircraft-prices-drop.html"
  }
}