{
  "source": "https://www.techradar.com/news/android-11",
  "title": "Android 11 features, easter egg, release date and everything you need to know",
  "category": "phones",
  "updated": "2021-10-26T14:43:40Z",
  "author": "tom-bedford",
  "summary": "Can you update to Android 11?",
  "article": [
    "Android 11 is the previous version of Google's operating system available for smartphones - it's 2020's iteration of the Android update, and it's ready to download on a whole host of smartphones.",
    "While Google has now released Android 12, that update may not be available for certain phones until 2022.",
    "You can buy plenty of smartphones that come with Android 11 pre-installed, though the update is still rolling out to older smartphones around the world. Depending on the phone you use, you might be waiting a while yet - or may never get the update.",
    "More and more smartphones get the Android 11 update every month, bringing new features and tools to Android phone users around the world.",
    "You can see which smartphones are compatible with Android 11 below, and more companies are announcing the update is coming to their phones all the time, so this list will keep getting expanded.",
    "Below that, we've listed all the Android 11 features that are available. There are a few intriguing ones this year, like improved smart home and media controls, and built-in screen recording, but there's nothing as major as Android 10's Dark Mode.",
    "Finally, as with most Android builds, Android 11 has a cool hidden Easter egg, and we've got a guide to how you can access and use that.",
    "If you've got a low-end phone Android 11 might not come to you at all - that's why Google also designed Android 11 (Go edition) which is a lightweight version of the operating system that works on handsets with 2GB or less of RAM. Phones running this version of Android 11 should start coming out soon.",
    "Google released Android 11 on September 8, 2020 - we were expecting this date thanks to leaks from the company, but Google itself didn't build up much fanfare for the new operating system.",
    "Well, September 8 marked the release of Android 11 on Pixel phones, but if you own a handset from a company other than Google, you had to wait.",
    "Manufacturers with custom forks of Android will now need to build their own versions of Android 11, then roll them out to their smartphones - that could be quick, for newer flagships, but if you've got an older or mid-range handset you might be waiting a while.",
    "So while lots of new smartphones can upgrade to Android 11, and some devices even come with it pre-installed, depending on your device and country you might be waiting a while.",
    "We've listed the vast majority of globally-available smartphones that can get Android 11, although have left out a few that are only available in few regions, or haven't been announced yet. Please note, the rollout is done in a continent-by-continent or country-by-country basis, so if you have a compatible Android 11 phone but can't download the update, just be patient.",
    "Below are all the key features Google has showcased in Android 11:",
    "Android 11 brings a feature some custom Android forks already have - built-in screen recording. This lets you use easily-accessible controls within the phone to create a video of what's on your screen, similar to screenshots.",
    "You can even record the sound of your phone, or use the mic to narrate what you're doing, so this should be a great feature for creating short-form video like TikToks, or for making tutorial videos to help less tech-savvy relatives make the most of their smartphone.",
    "Related to this, the Android 11 sharing functions have seen wider rollout to apps, so you can easily copy and paste images, text and videos from one app and send them straight to another.",
    "When you swipe down from the top in Android 10, you bring down your notification bar - well, in Android 11, that's split into two sections, consisting of your notifications, and your 'conversations'.",
    "These conversations are basically just chat notifications from chat apps like WhatsApp, Facebook Messenger and Twitter, so you know they're probably more worth paying attention to than the other notifications.",
    "This way you can easily see if people need you, and reply straight away too. You can also now pin conversations to 'Bubbles' - you might have seen these for Facebook Messenger, where a floating icon appears above other apps to show you that you have a message.",
    "Now you can get messages from more apps to appear as bubbles, and you can pin them there too so the chat is always easily-accessible.",
    "A related improvement is that Gboard, the default Android keyboard, will now auto-fill forms with relevant information, similar to what Chrome currently does, which should save time if you're frequently filling out your information.",
    "The new Android 11 update brings loads of changes for people who use loads of smart home devices.",
    "From one easily-accessible menu (accessed by long-pressing the power button) you can control all the IoT (Internet of Things) devices you have connected to your phone, as well as NFC bank cards.",
    "Talking of home, there's a new Bedtime Mode in the phone which you can set to run during the night, which turns on Do Not Disturb and makes the phone screen black-and-white to protect your vision.",
    "There are new media controls too. It's now easier to make music play from other devices connected to your phone, like Bluetooth speakers or other gadgets.",
    "Plus, Android Auto now works wirelessly on your car, saving you from having to fiddle with wires to get it working. And on the topic of transport, now when you turn on Airplane mode, any headphones connected via Bluetooth will stay connected, so you won't have to reconnect them.",
    "Google has improved its Voice Access mode in Android 11, although there isn't too much information on what's changed.",
    "Apparently, the hands-free mode is now 'faster and easier to use' - a bigger change is that the mode now works offline, so you don't need to always be connected to use it. These changes should hopefully make Android 11 a lot more accessible, letting people stay connected regardless of disability.",
    "A cool new mode is the braille keyboard, so you can write braille messages without needing to buy separate software.",
    "Finally, the Lookout app now lets you scan documents and food labels, so people with limited vision can still 'read' documents and see what's in their food.",
    "Android 11 will seemingly reduce the work you need to do on your phone, by predicting your habits and patterns.",
    "One such example of this is smart folders, so you can let Android 11 automatically sort your apps into folders of similar apps, like games or productivity tools.",
    "App suggestions is also tweaked to suggest apps based on your routine - for example, if you always log onto your Fitbit app first thing in the morning to examine your sleep habits, the phone will now automatically pop that app into the Home screen in the morning so it's easily accessible.",
    "Finally, apparently the Smart Reply feature already usable in Android phones has received some tweaks. This mode suggests some automatic responses when you receive a message, letting you reply with one tap (if any of the responses are appropriate) but it's not clear what's new here.",
    "Android 11 also brings some changes to app permissions. Now, you can grant an app permission to, say, your camera or location, on a one-off basis, instead of the existing options of 'all the time' and 'only while using the app'.",
    "In addition, your phone will automatically revoke permissions for apps if you haven't used them in a while, so an app won't track your location if you forget you have it downloaded, for example.",
    "There are a few new Android 11 features which don't fit into the above categories.",
    "One of these is better 5G detection, so if you're using a 5G phone Android 11 apps will recognize this more easily, and run faster as a result.",
    "On the topic of improved innovative software, Android 11 will now detect hinge angles on foldable phones, so apps can better run when your foldable phone isn't flat.",
    "Picture-in-picture mode is a useful way of watching videos while you do other things, and now it's easier to change the size of the window so you can better fit whatever else you're doing.",
    "There's a new 'Nearby Share' mode which lets you easily send information and data to nearby devices like your tablet, Chromebook or computer using Chrome, so you can easily send a document from your phone to your PC, for example.",
    "Finally, you can now see older notifications in settings, in case you accidentally swiped one away or ignored it for too long.",
    "The last part of our Android 11 guide will explore the Easter egg - new versions of Android always have one of these, and this one was discovered by users almost as soon as the beta rolled out.",
    "This Easter egg is very similar to the one in Android 7, in that it gives you a pet cat to look after. If that sounds weird, it is, but it's pretty fun too. If you want to find out more for yourself, follow our guide below on how to enable the Android 11 Easter Egg.",
    "Firstly, head into the Settings app, then click About Phone, then Android Version, then repeatedly click where it says 'Android Version: 11'. If you do this right, the Android 11 logo should pop up, which is a green dial.",
    "Turn this dial clockwise from its default position to 11. This won't work straight away, you need to turn it around a good few times - if you can't go beyond 10, turn the dial back to 1, and then turn it back to 11 again.",
    "Some users report this working after three tries, but if it still doesn't work then keep trying. When it works, a tiny cat will pop up on the bottom of the screen.",
    "Now you can head over to the smart home control menu detailed above - if you skipped over that section, you can find the menu by long-pressing the power button on the side of your phone.",
    "Here you can find options to interact with the cat, but if you've already mapped controls to this menu, the options won't be visible - instead, try to add new controls, then click 'See Other Apps' to find the cat tools.",
    "You can re-name your cat, and over time more cats might turn up too."
  ],
  "headers": {
    "8": "Android 11 release date",
    "12": "Android 11 compatible phones",
    "13": "Android 11 features",
    "14": "Built-in screen recording",
    "17": "New conversations tab",
    "22": "Smart home and media controls",
    "27": "Improved accessibility",
    "31": "Improved prediction tools",
    "35": "Security and privacy",
    "37": "Other useful features",
    "43": "Android 11 Easter egg"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Android 10": "https://www.techradar.com/news/android-q",
    "Android 11 (Go edition)": "https://www.techradar.com/news/theres-a-new-version-of-android-11-designed-to-make-cheap-phones-run-faster",
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "5G phone": "https://www.techradar.com/best/best-5g-phones",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones"
  }
}