{
  "source": "https://www.techradar.com/news/whatsapp-will-hit-you-with-serious-restrictions-if-you-dont-accept-new-privacy-policy",
  "title": "WhatsApp will hit you with serious restrictions if you don't accept new privacy policy",
  "category": "phones",
  "updated": "2021-02-22T15:16:19Z",
  "author": "sofia-wycislik-wilson",
  "summary": "The messaging app is going ahead with its controversial new policies.",
  "article": [
    "If you don't accept WhatsApp's new terms of use when they roll out, you'll find yourself unable to send and receive messages using the app.",
    "WhatsApp recently caused widespread upset by announcing changes to its privacy policy. What caused controversy was the belief that the changes would enable WhatsApp to not only share user data with Facebook and Instagram, but also to access the contents of messages – something that the company has strenuously denied and dismissed as \"misinformation\".",
    "Having confirmed that the new policies will be rolling out despite complaints from users, WhatsApp has now set out what will happen to anyone who fails to agree to the new terms. Perhaps unsurprisingly, you're not going to like what happens if you decline.",
    "WhatsApp has already confirmed that it is going to start \"gradually\" notifying users about the changes that are going to be introduced. While there are still several weeks until the new policies come into force, it's important to know about the consequences of not accepting the changes.",
    "The company has made it clear that anyone who does not agree to the new policies will not be able to enjoy the full functionality of WhatsApp. What this means in practice is that certain features will be limited. \"For a short time, you'll be able to receive calls and notifications, but won't be able to read or send messages from the app\", an online support document explains.",
    "The important date to keep in minds for the upcoming policy changes is May 15. From this date you will have to accept the new terms or suffer the consequences. If you're not happy to accept the new privacy policies, you could join the increasing numbers of people who are switching to alternative messaging services.",
    "You may, of course, change your mind. There is nothing to stop you from returning to WhatsApp at any point after May 15, accepting the updates policies and gain access to all of the features of the app – and the good news is that (assuming you do not opt to do so manually) WhatsApp will not delete your account or wipe out your message history even if you do not accept the new terms.",
    "Via Gizmodo"
  ],
  "headers": {
    "5": "Like it or lump it"
  },
  "links": {
    "changes to its privacy policy": "https://www.techradar.com/news/whatsapps-new-privacy-policy-requires-you-to-share-data-with-facebook",
    "has strenuously denied": "https://www.techradar.com/news/whatsapp-is-going-ahead-with-its-controversial-privacy-update",
    "support document": "https://faq.whatsapp.com/general/security-and-privacy/what-happens-when-our-terms-and-privacy-policy-updates-take-effect",
    "switching to alternative messaging services": "https://www.techradar.com/news/heres-why-whatsapp-users-are-fleeing-for-other-platforms",
    "Gizmodo": "https://gizmodo.com/whatsapp-users-who-don-t-accept-our-new-privacy-policy-1846321224"
  }
}