{
  "source": "https://www.techradar.com/news/resident-evil-villages-post-credits-scene-hides-a-terrifying-secret",
  "title": "Resident Evil Village’s post-credits scene hides a terrifying secret",
  "category": "gaming",
  "updated": "2021-05-17T14:51:20Z",
  "author": "rhys-wood",
  "summary": "The ramifications of which could be insane",
  "article": [
    "Spoiler Warning: this article contains major spoilers for Resident Evil Village’s ending and post-credits scene. Read on at your own risk.",
    "Resident Evil Village succeeds in telling a surprisingly personal and emotional story for its protagonist, Ethan Winters, who finds himself lost in a lycan-infested European village in search of his kidnapped newborn daughter, Rose.",
    "After Ethan defeats the Four Lords of the village and reaches the source of the chaos, Mother Miranda, Resident Evil Village’s final act kicks things into overdrive, holding nothing back when it comes to Ethan’s fate as well as painting the events of the entire series in a shocking new light.",
    "The final act of Resident Evil Village throws plot twists at the player at a breakneck pace, providing a thrilling conclusion that admittedly may have jumped the shark in a few areas, but certainly broke the curse of Resident Evil games succumbing to weak closing chapters.",
    "To recap, the closing act of Resident Evil Village doesn’t shy away from throwing major events and consequences at our lead characters. So much so that the game could be thought of as a third Resident Evil Revelations title.",
    "We learn that Ethan Winters, the player character, has actually been dead since the opening chapter of Resident Evil 7, where antagonist Jack Baker actually succeeded in murdering our hero. Ethan was reborn as one of the Molded, thus bearing the same regenerative powers as the near-immortal Baker family and the goop-like enemies that infested their household.",
    "Ethan realizes he can’t return to a normal life with his wife and daughter with this knowledge brought to light. So, he elects to sacrifice himself by detonating the bomb Chris Redfield plants in the Megamycete: the source of the Mold found deep under the village as well as the origin of inspiration for Oswell E. Spencer’s Umbrella Corporation.",
    "With Ethan’s fate sealed, Chris escapes with Rose in tow, and evacuates the village with Mia Winters and the rest of Hound Wolf Squad as the entire site is vaporized by the blast, along with Ethan, the Megamycete and Mother Miranda’s dark ambitions.",
    "After the credits, we’re treated to a teaser of sorts that potentially sets up the plot of Resident Evil 9, or maybe even future Resident Evil Village DLC. We see Rose Winters, now a young adult, laying flowers on her father’s grave. It’s a bittersweet capstone on Ethan’s story, but what happens immediately after that is pretty bizarre, and potentially quite chilling.",
    "Rose is met by a shady looking agent, who the girl has some choice words for after he makes a pretty distasteful joke at her expense (seriously, the scene has us begging for Rose to be the series’ next protagonist, if only to see what powers she might now hold). She climbs into the passenger seat of the agent’s SUV, and they drive off into the distance, but something about the scene is amiss.",
    "If you look closely, there’s a shadowy figure in the far distance, walking towards the SUV. It’s impossible to make out who - or what - this person might be. That is until you make use of Resident Evil Village’s photo mode to take a closer look.",
    "That’s right, you can use Resident Evil Village’s amazing photo mode even during cutscenes, and what did fans discover when they used the photo mode to unmask this shadowy figure? None other than Ethan Winters himself.",
    "The above video created by IGN compares the Ethan model used in-game to the one used during the post-credits scene, and they absolutely line up. The Ethan we see when using photo mode is the same as we saw during the ending, just prior to the Megamycete detonation.",
    "Now, let’s address the elephant in the room. It’s entirely possible that Capcom used Ethan’s character model (it’s important to note that it’s the same model featured in the ending cutscene, after Ethan gives his jacket to baby Rose) as a placeholder. The figure might be significant, but not in the way that the game’s photo mode might have you believe. It could just be representing a different character entirely, who currently has no assets present in-game.",
    "If that’s the case, though, why would Capcom allow this curio to be so easily discovered? As stated, Resident Evil Village’s photo mode can be used during cutscenes, and wasn’t disabled for the post-credits scene. While this could be an oversight on Capcom’s part, there’s a very real argument to be made that the developer left it in for us to discover intentionally.",
    "At the end of the scene, the SUV stops next to this mysterious person. As such, it’s clearly something that fans are deliberately having their attention drawn to. If it is indeed Ethan, as the photo mode would lead us to believe, then it could lend a hint as to what kinds of powers Rose now possesses.",
    "It’s extremely hard to believe that Ethan survived the Megamycete explosion. During the final act, both Eveline’s apparition and the Duke make it clear that Ethan’s body is already falling apart, succumbing to the same calcification effect experienced by other Molded victims when they perish. If Ethan did manage to walk away from that relatively unscathed, it would take some of the edge off of his sacrifice.",
    "Perhaps Rose, then, is able to directly conjure and/or speak with the dead. This is a power that Ethan already may have had, as witnessed in Resident Evil 7 where he talks directly to an apologetic Jack Baker during an unconscious vision. A similar scene plays out with Eveline in Resident Evil Village, who Ethan had defeated at the end of the previous title.",
    "If this is the case, then the implications this has for Resident Evil 9 could be huge. If Rose is capable of contacting the dead, she could theoretically speak to her dad, as well as the likes of Albert Wesker, Brad Vickers and other beloved Resi characters that have long since kicked the bucket.",
    "With Rose potentially inheriting powers from the Mold and Ethan, the stage has already been set for the plot moving forward. That, along with the revelation that the BSAA counter-terrorist group deployed bioweapon soldiers to the village, means we might also see fan-favorite characters like Jill Valentine, Rebecca Chambers and Barry Burton make a return in the next chunk of Resident Evil story.",
    "Whether those plot threads are explored in story DLC for Village or if Capcom is saving them for Resident Evil 9, one thing is certain: we’re incredibly excited to see where the story continues from here."
  ],
  "headers": {
    "4": "Major Resident Evil Village spoilers ahead",
    "9": "Resident ramifications",
    "15": "What would this mean for Rose?"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "closing act of Resident Evil Village": "https://www.techradar.com/news/resident-evil-village-ending-explained-a-spoiler-filled-look-at-what-it-all-means",
    "Resident Evil 7": "https://www.techradar.com/news/resident-evil-7-review"
  }
}