{
  "source": "https://www.techradar.com/news/zoom-defies-critics-with-bumper-q1-but-expects-slowdown-to-come",
  "title": "Zoom defies critics with bumper Q1, but slowdown expected",
  "category": "computing",
  "updated": "2021-06-02T12:20:43Z",
  "author": "joel-khalili",
  "summary": "Zoom revenue up 191% year-on-year",
  "article": [
    "Video conferencing darling Zoom has reported strong quarterly revenue, exceeding analyst expectations despite many businesses beginning the return to the office.",
    "In its fiscal Q1, which ended April 30, Zoom took in $956.2m in revenue, up 191% on the $328.2m achieved in the same quarter the previous year.",
    "Zoom also reported adjusted net profit of $402.1m for the first quarter, or $1.32 per share. Analysts had predicted the firm would achieve earnings of $0.99 per share, per CNBC.",
    "However, Zoom’s rate of growth slowed quarter-on-quarter (revenue was up 369% year-on-year in fiscal Q4 2021), prompting a circa 3% drop in share price in late trading.",
    "The quarter was described as “very strong” by Eric Yuan, Zoom founder and CEO, who also highlighted his company’s “strong profitability and cash flow”.",
    "“Our steadfast commitment to empowering customers to work and learn from anywhere with our expansive, innovative and frictionless video communications platform continued to drive our results,” he said.",
    "“We have also opened our technology portfolio to developers through our powerful video SDK and to businesses to expand their reach through Zoom Events.”",
    "In light of its Q1 performance, Zoom has revised its outlook for both Q2 and the full fiscal year upwards.",
    "In the second quarter, the company expects revenue to fall between $985-990 million. For fiscal 2022, meanwhile, Zoom anticipates revenue of up to $3.99 billion, which would represent a 55.2% increase on the previous year if achieved.",
    "According to Yuan, a far cry from a death knell for video conferencing and collaboration services, hybrid working will encourage the continued expansion of these industries.",
    "“Work is no longer a place, it’s a space where Zoom serves to empower your teams to connect and bring their best ideas to life,” he said. “We are energized to help lead the evolution to hybrid work that allows greater flexibility, productivity, and happiness to both in-person and virtual connections.”"
  ],
  "headers": {
    "4": "Zoom revenue and outlook"
  },
  "links": {
    "Video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "CNBC": "https://www.cnbc.com/2021/06/01/zoom-zm-earnings-q1-2022.html",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}