{
  "source": "https://www.techradar.com/news/the-green-knight-director-david-lowery-on-the-risk-and-reward-of-his-medieval-epic",
  "title": "The Green Knight director David Lowery on the risk and reward of his medieval epic",
  "category": "entertainment",
  "updated": "2021-10-03T15:09:56Z",
  "author": "axel-metz",
  "summary": "'There’s no world in which this wasn't a risky move'",
  "article": [
    "From the moment The Green Knight begins, it quickly becomes clear that director David Lowery’s take on the eponymous 14th-century poem is a very different cinematic experience to any other you’re likely to enjoy this year.",
    "Dev Patel’s Arthurian hero, Gawain, sits alone on a throne, adorned in Christ-like robes while a narrator’s husky voiceover introduces his tale. A crown slowly descends from above, landing neatly on Gawain’s head before combusting into a ball of fire, engulfing our hero’s profile in a blanket of yellow flames. Then darkness.",
    "Those hoping for a picture book medieval adventure may find themselves disappointed by The Green Knight’s more pensive approach to storytelling, but Lowery has crafted a sweeping, bewitching picture that will doubtless leave Gawain’s troubled pursuit of honor and integrity stewing long in the memory.",
    "Ahead of the movie’s belated September 24 UK release on Amazon Prime Video, TechRadar spoke with its director, and the Green Knight himself Ralph Ineson, about adapting a 14th-century poem into an art house epic fit for modern viewing.",
    "“I hope when audiences see The Green Knight, especially those who don't know the poem, they find some unexpected resonance that they might not know how to process,” Lowery tells us over Zoom. “This movie is grand and epic, but on a visual level, it’s something incredibly unique and modern, even though we're dealing with antiquity.”",
    "That antiquity dates back to the late 1300s, when the only surviving manuscript of this story was first discovered. Sir Gawain and the Green Knight has no known author, and its title was given centuries later by scholars and translators – one of whom was J. R. R. Tolkien – who sought to make sense of the Middle English chivalric romance.",
    "The basic beats of its plot are, however, largely agreed upon. Sir Gawain, a knight of King Arthur's Round Table, accepts a challenge set by a fantastical Green Knight, who permits any knight to strike him with his axe if he, too, can return the blow one year later at the mysterious Green Chapel.",
    "Lowery maintains the crux of this story in his theatrical adaptation, charting Gawain’s obstacle-laden journey from renowned knight of Camelot to isolated adventurer. Dev Patel is mesmeric as the layered protagonist, starring alongside Ineson’s imposing Green Knight and a stellar supporting cast which includes Alicia Vikander, Joel Edgerton and Sean Harris.",
    "But the director, who counts A Ghost Story, Pete's Dragon and The Old Man & the Gun among his credits, was conscious of ensuring his version of the well-trodden tale became unmistakably his own.",
    "“It’s such a rich experience to go and read the different translations and see how the story changes, how the language evolves and the choices that different translators make,” he says. “Some of them take great liberties, some of them don't. What that does for me as a filmmaker is make me feel like I'm participating in that tradition, because I'm also translating the text in my own way, trying to illuminate it from my own perspective in the same way that Tolkien or any of the other translators whose versions I studied did.”",
    "“Even the way language is used in the movie, that was my version of translating the text,” Lowery tells us, in reference to the mix of colloquial and literary dialogue used throughout The Green Knight. “I would never compare myself to a scholar who actually dedicates themselves to translating work, but I was hopefully doing both them and their great work justice by also participating in that tradition. It was a beautiful thing.”",
    "The man inside the Green Knight’s prosthetics, Ralph Ineson – whose sonorous voice is put to exceptional use here – attests to his faith in Lowery’s vision for the story and also his character in particular. “I think as an actor, my approach is to always pick the right filmmakers to work with. I was making David Lowery's version of the Knight – he’s gone through every version of this character, every way of interpreting it. You can't ever make a version that includes every reading, so I'm working with the scripts I've got in front of me and the chats I have with him.”",
    "But with good reason, Ineson is a fan of Lowery’s decision to portray the Green Knight as an imposing yet oddly enchanting figure to Patel’s Gawain. “There’s definitely a kind of paternal warmth about him, a playfulness all the way through,” he says, not forgetting to highlight his favorite moment on set: “Riding a horse in the Great Hall of Camelot was one of the coolest experiences I've ever had. I felt pretty badass.” He looks pretty badass, too.",
    "Apart from the giveaway in the film’s title, it soon becomes apparent that nature is as much a character in The Green Knight as any kings, queens or witches. Working alongside cinematographer Andrew Droz Palermo, Lowery’s shots capture an immense feeling of scope befitting Arthur’s Camelot and its misty surroundings, complete with dense woods, rocky mountains and, of course, castles – all of which were filmed in Ireland.",
    "“It’s not hard to achieve a tremendous sense of scale when you're out with a wide angle lens in a beautiful valley in the Wicklow Mountains,” he tells us. “In all of my movies, I'm always trying to find locations that have that sense of scope. I want to be down there, at the ground level looking up at these tremendous things around us, close to the actors and taking in their point of view.”",
    "“We had plenty of big sets, we had lots of visual effects, but there's no greater visual effect than Mother Nature, and it's really important to me to always go out into the world, as opposed to shooting things on blue screen. I really want to go to those locations, I want to see the effect of the weather on the actors’ faces. That's part of the joy and adventure of making movies, to be out there in these worlds and to feel them in the most tactile way possible. I also believe that tactility can cross over to the audience.”",
    "Lowery – who cites Willow, Andrei Rublev and Prospero's Books among his inspirations – is also keen to point out that his vision of a grisly 6th-century England was often at odds with Ireland’s surprisingly beautiful weather. “We had some incredibly sunny days,” he says, “we had to paint out rainbows on occasion. It was a remarkably warm spring in Ireland so the movie feels much colder than it actually was.”",
    "Like most movies due to release in the last year, the global pandemic played its part in delaying The Green Knight’s journey to screens (it landed in US theaters in July, though its UK arrival was rescheduled until September 24).",
    "But Lowery’s film also arrives as a counterweight to the big-budget, blockbuster fare of recent months. The Green Knight is about as far removed from The Suicide Squad as a filmmaker dare go, and its director is well aware of the risks involved in crafting such an unconventional picture.",
    "“I'm sure that the movie will feel very strange and weird and unusual for anyone who doesn't know this story,” Lowery tells us, “but it's not meant to be an exclusive art film experience, just a very unique version of a medieval epic.”",
    "“There’s no world in which this wasn't a risky move,” he adds. “It was a challenge on every level, in production but also in the release. Taking the pandemic out of it, this would still have been a hard movie to release in the middle of the summer, but A24 got excited about that particular challenge and thought that this was not only a fun adventure to go on, but something that would hopefully be resonant in a meaningful way within our culture.”",
    "Ineson, too, is conscious of the movie’s unique approach to storytelling. “I think audiences will realize [the weirdness]. Especially given the title, some people will walk into this thinking it’s going to be a Marvel movie. And it's far from that. But it's a wonderful coming of age story. It's a journey of self discovery. It’s about a young guy who has to come to terms with his own mortality, and learn about resisting temptation and about bravery.”",
    "A Marvel movie it is most certainly not, but The Green Knight is nonetheless an engaging and at times hypnotic deep dive into the cruel human cost of myths and legends, an exposé on the emptiness of heroism, and one anchored by a cast and crew with a clear appreciation for the power of visual imagery.",
    "“Every time I try to stop and think about this movie in a literary sense, it makes less sense, because my gut reaction is just to be mesmerized,” Ineson concludes.",
    "There’s no handbook for what makes a good film these days, but to be mesmerized seems a pretty welcome compliment.",
    "The Green Knight arrives September 24 on Amazon Prime Video UK."
  ],
  "headers": {
    "7": "Old and new",
    "13": "The great outdoors",
    "17": "Risky reception"
  },
  "links": {
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good"
  }
}