{
  "source": "https://www.techradar.com/news/sonys-new-rugged-party-speakers-are-loud-luggable-and-fully-lit-literally",
  "title": "Sony's new rugged party speakers are loud, luggable and fully lit (literally)",
  "category": "audio-visual",
  "updated": "2021-04-22T23:33:23Z",
  "author": "harry-domanski",
  "summary": "The X-Series also sports karaoke capabilities",
  "article": [
    "Sony has today announced a new line-up of party speakers – three rugged and portable units that promise to bring powerful music and other party features to the great outdoors.",
    "Sony's X-Series features the SRS-XP700 and SRS-XP500, with both taking design cues from PA speakers, and the SRS-XG500 that looks more like a modern interpretation of a boombox.",
    "In Australia, these three units will be available from June 2021, with the SRS-XP700 and SRS-XP500 costing £449 / AU$699 (about $420) and £319 / AU$499 (about $300) respectively, while the SRS-XG500 costs £379 / AU$629 (about $380). Pricing and availability for other regions is yet to be announced.",
    "All three units draw their name from the non-circular, X-Balanced speaker units which, Sony claims, offer a \"richer, clearer sound no matter what style of music you’re listening to\" due to the increased sound pressure and reduced distortion provided by the larger diaphragm.",
    "Each speaker also sports ambient lighting, similar – if not identical – in style to Sony's Extra Bass range of speakers (such as the SRS-XB33), allowing for multiple light patterns that respond to the music.",
    "Another common trait among the X-Series range is each speaker's ability to accept either a microphone or guitar input, allowing for karaoke sessions or, presumably, a makeshift guitar amp if you're desperate.",
    "As mentioned, the XP700 and XP500 have a similar form factor to PA speakers, but have integrated sensors that allow them to optimize the sound for either being laid vertically or horizontally.",
    "These two speakers also feature a variety of tweeters alongside the main drivers, with the larger of the pair having three at the front and one at the rear for an omnidirectional sound, and the smaller boasting just two at the front.",
    "All three speakers have a neat carry handle and the promise of long battery life – 30 hours for the XG500, and 25 and 20 for the XP700 and XP500 respectively. The XG500 takes the cake with outdoor capabilities thanks to its IP66 weather resistance rating and water-repellent mesh, while the XP700 and XP500 have an IPX4 rating, which should keep you out of trouble in slight inclement weather.",
    "Sony's timing with these speakers may seem ill-advised given the various lockdowns and quarantines being experienced by countries around the globe.",
    "The concept of party speakers certainly isn't new, but of the Bluetooth speakers launched in the era of the pandemic, we've seen more success in smaller, personal speakers such as the Sonos Roam, which we loved for its rugged, compact design and lush but not loud sound.",
    "The other space we've seen get more attention during Covid-19 is the smart speaker families – for households that don't necessarily invest in an expensive hi-fi system, or would prefer to have a few smaller speakers throughout the house, smart speakers like the Sonos One make a lot of sense."
  ],
  "headers": {
    "9": "Party speakers without the party"
  },
  "links": {
    "Sony's Extra Bass range of speakers": "https://www.techradar.com/news/sonys-2020-portable-bluetooth-speaker-lineup-brings-the-bass-with-side-firing-subwoofers",
    "SRS-XB33": "https://www.techradar.com/reviews/sony-srs-xb33",
    "Sonos Roam": "https://www.techradar.com/reviews/sonos-roam",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review"
  }
}