{
  "source": "https://www.techradar.com/news/lg-xboom-360-is-a-new-wireless-speaker-that-doubles-as-a-lantern",
  "title": "LG XBoom 360 is a new wireless speaker that doubles as a lantern",
  "category": "audio-visual",
  "updated": "2021-09-07T10:36:34Z",
  "author": "hamish-hector",
  "summary": "Lighten the mood with the XBoom 360",
  "article": [
    "LG has just revealed its latest wireless speaker, the LG XBoom 360. Thanks to its unique form factor, LG promises that the XBoom 360 will provide distortion-free 360-degree sound and lighting that’s great for at-home and outdoor listening.",
    "The XBoom 360 achieves its unique listening experience thanks to its conical shape. This design delivers omnidirectional audio with an impressive 120W output that should provide the power and clarity you’d expect from any other high-end speaker.",
    "You’ll also be treated to 360-degree mood lighting that can be paired with a companion app for a wide range of customization options. It should help to bring the party to life and keep it going for a while thanks to its 10-hour battery life on a single charge.",
    "The LG XBoom 360 is available now in the US on LG’s official website for just under $400 and you can buy it in either Beige, Burgundy, Charcoal Black and Peacock Green. Global pricing and availability is yet to be announced, but that works out at around £290 / AU$540.",
    "While we haven’t been able to test this speaker out for ourselves yet, we’re optimistic it will perform well. We’ll have to get hands-on with the XBoom 360 to know for sure, but our previous experience with LG’s XBoom range has been positive.",
    "We gave the LG XBoom Go PL7 Bluetooth speaker four stars out of five and most importantly thought that its audio quality was good with trebles that are punchy and sharp - though it was a little lacking in the bass department. Given that LG highlights a new 5.25-inch glass fiber woofer in the XBoom 360, we hope the bass is more impressive in its newest speaker but we’ll have to wait and see.",
    "Design-wise we’re intrigued by the XBoom 360’s lantern-like shape, especially its light that promises to bring you a personal disco or provide the perfect mood for a romantic night under the stars. It certainly looks chic enough to not look out of place in any modern home, and thanks to the handle it looks like a fun tool to take with you on your next outdoor excursion.",
    "The only downsides we can see so far are the battery life and the price. While 10-hours is most likely going to be more than enough charge to keep the music going through any social gathering we suspect the 10-hour limit will require a few optimizations. With the lighting turned on and any advanced features enabled, we hope the LG XBoom 360 won’t bring the party to an early end.",
    "In addition, the $400 (around £290 / AU$540) price tag will price out a lot of consumers. There’s no way to know if the speaker is worth that amount without trying it out, so you might want to keep an eye out for reviews from people who have tested it before making a purchase."
  ],
  "headers": {
    "4": "Opinion: our first thoughts of the LG XBoom 360"
  },
  "links": {
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "LG’s official website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1053205144961625600&xs=1&url=https%3A%2F%2Fwww.lg.com%2Fus%2Fhome-audio%2Flg-rp4-portable-bluetooth-speaker&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Flg-xboom-360-is-a-new-wireless-speaker-that-doubles-as-a-lantern",
    "LG XBoom Go PL7 Bluetooth speaker": "https://www.techradar.com/reviews/lg-xboom-go-pl7-bluetooth-speaker"
  }
}