{
  "source": "https://www.techradar.com/news/ps5-restock-sony-direct-virtual-queue-explainer",
  "title": "Why the PS5 restock at Sony Direct hasn't happened – and when to buy PS5 next",
  "category": "gaming",
  "updated": "2021-08-30T09:13:20Z",
  "author": "matt-swider",
  "summary": "The Sony Direct restock has a pattern, according to our PS5 restock Twitter tracker Matt Swider, who has personally helped nearly 37,300 get a next-gen console.",
  "article": [
    "The Sony Direct PS5 restock virtual queue didn't happen this week or in the last 15 days, and there's a reason, according to our PS5 restock Twitter tracker Matt Swider. Matt has helped more than 37,300 people find a next-gen console in stock in the US through his Twitter alerts; he's become an expert in noticing patterns and getting early PS5 restock news from retailers, then sending alerts to you before resellers are able to use underhanded tactics to scoop up Sony consoles for sale.",
    "When tracking PS5, Matt has noticed that whenever followers reply to his restock Twitter account to say Sony Direct has suddenly delayed their PS5 shipment (this is rare, as Sony Direct sends PS5 very quickly otherwise), we're always met with a three-week delay for the next Sony Direct restock. This has happened three times in 2021 (between February and today) and, most recently, after the May 20 restock. On the bright side? There's hope Sony Direct is stacking PS5 inventory to open up the virtual queue after this (so far) two-week hiatus.",
    "Click this example of the last Sony Direct PS5 restock virtual queue to get alerts from Matt Swider. You can follow his Twitter account and turn on notifications, as he very tirelessly tracks 'PS5 drops'.",
    "As we first reported earlier in the week, the PS5 restock news would be light, and we were right. The short week saw a brief Best Buy restock yesterday and there was a PS5 bundle as part of the Newegg Shuffle this morning.",
    "There were hopes for a Sony Direct PS5 restock yesterday, June 4, with several Twitter tracker followers of Matt Swider's account boldly insisting it was going to happen (maybe they get their \"news\" from other websites, we don't know). But it wasn't going to be the case this week given the fact that Sony Direct delayed some PS5 consoles from its last virtual queue shipments on May 20.",
    "Next week, the PS5 restock dates look brighter, according to our sources. While it's too early to tell when the next restock will happen (what people don't understand is that the decision to turn on the add-to-cart button isn't made too far in advance at most retailers and there's always room for them to call an audible), we should see PS5 for sale at multiple retailers. A Walmart PS5 restock hasn't taken place in two weeks, so it's overdue and the date should be either next Thursday.",
    "Specifically, in the US, Matt Swider – and his 600,000-strong Twitter following – is tracking Sony Direct, Walmart, GameStop, Antonline, Best Buy and Target – with the likelihood of a PlayStation 5 restock happening in that order.",
    "We're also overdue to see Costco and Sam's Club, but news out of those club-based retailers is scant, so we can't really rank them fairly.",
    "Notice who else is missing? We also don't know when the next Amazon PS5 restock will happen simply because, according to our in-depth analysis, we've seen Amazon restock the PS5 between 15 and 54 days. In other words, it can happen at any time, and the fact that Amazon has had an occasional 3am EDT restock time twice in 2021 literally keeps us up at night.",
    "Here's another pattern to explain the Sony Direct restock dates: every time there's a new PS5 game, Sony Direct has a console restock during the same time frame. We saw this with the Returnal release date bookended by two restocks.",
    "What's next on the PS5 game roster that may trigger a restock? It's an even bigger Sony PlayStation-published game: Ratchet & Clank: A Rift Apart on June 11. This is a PS5-exclusive, meaning you won't be able to get it on the older PS4.",
    "This means Sony needs to ship PS5 consoles in order for people to buy its software (and software is always more lucrative than hardware). But, as you can expect given the hype around the new Ratchet & Clank PS5 game, it's going to make even more people realize they need a PS5 and the next restock may be even harder to get.",
    "That's where our PS5 restock Twitter tracker is going to give you the edge of course, as Matt Swider pushes toward 40,000 people having gotten a next-gen console through his PS5 restock alerts."
  ],
  "headers": {
    "3": "PS5 restock news for June 5: Sony Direct explainer",
    "5": "PS5 restock: dates and times next week",
    "9": "New PS5 game timed with the Sony Direct restock?"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock Twitter tracker Matt Swider": "http://www.twitter.com/mattswider",
    "Walmart PS5 restock": "https://www.techradar.com/news/ps5-restock-walmart-june",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Ratchet & Clank: A Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart"
  }
}