{
  "source": "https://www.techradar.com/news/libreoffice-vs-openoffice",
  "title": "Libreoffice vs OpenOffice",
  "category": "computing",
  "updated": "2021-03-19T19:46:31Z",
  "author": "daryl-baxter",
  "summary": "How to make the right choice for you",
  "article": [
    "OpenOffice and LibreOffice are the two main options if you’re looking for free office software. And, you might not be sure which one is the best for your needs.",
    "You need to consider a few things, starting with whether you actually need desktop office software. After all, anyone with an internet connection can get access to Google Docs, Sheets and Slides, which provide a lot of the same productivity without having to download anything. Not to mention, they save everything to the cloud automatically. You don’t have to worry about losing a document, backing it up, or emailing it to yourself.",
    "But, if you regularly make presentations and spreadsheets and need more advanced features to fine tune your work, desktop software is the only way to go. And, if that describes you, you’ll find that LibreOffice and OpenOffice are among the best options available. Additionally, they’re open source software, meaning their code is publicly available, and are free to download and use.",
    "It’s difficult to choose between OpenOffice and LibreOffice since they share a lot of similarities. But, they do have some distinct differences, which we’ll explain in this article.",
    "One of the biggest differences between Apache OpenOffice and LibreOffice is the frequency of releases. LibreOffice is updated much more frequently than Apache OpenOffice, which means you'll receive new features and bug fixes more quickly.",
    "The frequency of updates means there's also more potential for bugs in LibreOffice, but any that do appear are likely to be resolved quickly.",
    "Both LibreOffice and Apache OpenOffice offer essentially the same set of apps (Writer, Calc, Impress, Draw, Base and Math), but LibreOffice also includes a tool called Charts. As its name implies, this is a small application specifically for creating charts and graphs, ready to be imported into other documents. Handy for presentations.",
    "If you're multilingual, it's worth noting that Apache OpenOffice offers more in terms of flexibility when it comes to languages, letting you download additional language patches as plugins. If you choose LibreOffice, you'll need to pick one language at the start and stick with it.",
    "If you often need to make presentations, LibreOffice has the edge in terms of the number (and quality) of slide templates available. Both software suites offer plenty of user-made designs to download, but LibreOffice's selection of pre-installed options is far superior to OpenOffice's.",
    "LibreOffice and Apache OpenOffice are almost identical. The functional differences are very minor; for example, the sidebar in OpenOffice Writer is open by default, whereas in LibreOffice it's closed.",
    "LibreOffice does look a little more modern thanks to its larger icons and leaning towards subtle pastel hues, but it's nothing that'll affect your everyday work.",
    "This is likely to be the biggest deciding factor for many people. Although both LibreOffice and Apache OpenOffice can open and edit native Microsoft formats DOCX and XLSX, only LibreOffice is able to save to these formats.",
    "If you're going to be sharing documents with people using Microsoft Office, LibreOffice might therefore be the better choice."
  ],
  "headers": {
    "4": "Updates",
    "6": "Tools",
    "7": "Language support",
    "8": "Templates",
    "9": "Design",
    "11": "Supported file types"
  },
  "links": {
    "Charts": "https://www.libreoffice.org/discover/charts/"
  }
}