{
  "source": "https://www.techradar.com/news/if-youre-still-using-aol-watch-out-for-this-phishing-scam",
  "title": "If you're still using AOL, watch out for this phishing scam",
  "category": "computing",
  "updated": "2021-03-01T14:21:35Z",
  "author": "mayank-sharma",
  "summary": "Scam employs one of the oldest trick in the books",
  "article": [
    "A not-so-novel phishing scam is targeting AOL users into submitting their authentication information in the garb of keeping their account active.",
    "Details about the scam were revealed by BleepingComputer after an email received by a couple of their relatives who were long-time AOL users, raised red flags.",
    "“Unless you verify this account, it will be closed in 72 hrs,\" warns the unimaginative phishing email, which features official-looking AOL imagery and language.",
    "Playing on the emotions of unsuspecting users, the scam email begins with the words, \"We don't want to say goodbye!\"",
    "One of the most mundane phishing attempts, the scam banks on the fact that most users who haven’t switched away from AOL will lack the technical chops to decipher its true intentions.",
    "The email reportedly contains a link to an AOL phishing landing page that wouldn’t hold up under scrutiny by an alert user. The page displays a form asking users to enter their login details, before redirecting them to the standard AOL login page as the credentials make their way to the scammers.",
    "As always, we suggest you to independently verify the authenticity of all emails asking for your usernames or password by contacting the support channel of the respective service.",
    "While this AOL scam seems to be an exception for both its approach and target, phishing scams meanwhile have been employing innovative means to trick users into handing out their login credentials, including the user of morse code.",
    "As many modern email clients ship with safeguards to detect and flag suspect URLs, some phishing attacks have started bundling phishing links as attachments to avoid detection.",
    "Via: BleepingComputer"
  ],
  "headers": {
    "3": "Age-old trick"
  },
  "links": {
    "phishing scam": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "morse code": "https://www.techradar.com/news/this-phishing-attack-uses-some-very-retro-technology-to-hide-its-payload",
    "bundling phishing links as attachments": "https://www.techradar.com/news/this-new-linkless-phishing-scam-is-even-tricking-tech-experts",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/beware-aol-phishing-email-states-your-account-will-be-closed/"
  }
}