{
  "source": "https://www.techradar.com/news/acer-is-juicing-up-the-geforce-rtx-30-series-gpu-in-its-gaming-laptops",
  "title": "Acer is juicing up the GeForce RTX 30 series GPU in its gaming laptops",
  "category": "computing",
  "updated": "2021-07-02T10:22:42Z",
  "author": "jess-weatherbed",
  "summary": "A small, but welcome power boost",
  "article": [
    "Nvidia has been pretty relaxed with laptop makers, giving them the freedom to make alterations to the standard mobile graphics card design used in their devices. It looks like we may be seeing the beneficial fruits of this decision soon as a new firmware update is being rolled out for a healthy chunk of Acer's GeForce RTX 3000 series gaming laptops that will increase total graphics power (often abbreviated to TGP). This comes a few weeks after Alienware, another popular manufacturer of computing hardware decided to use this freedom to manually disable some of the CUDA cores in its m15 gaming laptop. While this was a more perplexing decision, Acer's choice to juice up the wattage for the GPUs could see some benefits to gamers with an expected performance boost. We have reached out to Acer for additional information.",
    "So far Acer has confirmed that its Nitro 5, Helios 300, Triton 300, and Triton 300 SE gaming laptops will receive the new BIOS update. Some are still currently in development, but updates are available to download now over on the Acer website for a select handful of devices. Nvidia stipulated that any changes to TGP would need to be made publically available, so we've compiled a list below of the planned increases for each model. It's a fairly mixed bag that varies from a meager 5W increase up to 30W in some instances, though we have yet to see how this will actually affect things like battery life and in-game performance.",
    "An important distinction here is to not correlate the percentage increase of TGP to the increase you will see in the performance. While TGP is important, it isn't solely responsible for your framerates or overall graphics quality, though the increases are expected to result in a noticeable improvement. We won't know until benchmark comparisons emerge, and it's worth remembering that a performance boost may come at the expense of thermals or battery longevity. Ultimately only time will tell, but given the recent months of GPU shortages, there has never been a better time to buy a gaming laptop. Features from Nvidia like DLSS enable gamers to play demanding titles without being restricted by hardware (provided you're getting a product equipped with an RTX card), and many of these devices have been easy to buy due to cryptominers focusing on dedicated graphics cards. If this TGP increase yields positive results, things are only looking up for mobile PC gaming.",
    "Via NoteBook Check"
  ],
  "headers": {
    "1": "Lets up the voltage on this"
  },
  "links": {
    "GeForce RTX 3000 series gaming laptops": "https://www.techradar.com/news/nvidia-rtx-3000-graphics-cards-are-finally-coming-to-laptops",
    "disable some of the CUDA cores in its m15 gaming laptop": "https://www.techradar.com/news/new-alienware-m15-gaming-laptop-has-been-crippling-its-own-rtx-3070-gpu",
    "download now over on the Acer website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9324480180381358000&xs=1&url=https%3A%2F%2Fwww.acer.com%2Fac%2Fen%2FUS%2Fcontent%2Fdrivers&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Facer-is-juicing-up-the-geforce-rtx-30-series-gpu-in-its-gaming-laptops",
    "made publically available": "https://www.techradar.com/news/nvidia-is-making-it-less-confusing-to-buy-an-rtx-30-series-gaming-laptop",
    "GPU shortages": "https://www.techradar.com/news/it-might-soon-be-easier-to-buy-a-gpu-thanks-to-ethereum",
    "buy a gaming laptop": "https://www.techradar.com/news/thinking-about-building-your-first-pc-dont-buy-a-gaming-laptop-instead",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "NoteBook Check": "https://www.notebookcheck.net/Acer-increases-the-TGP-of-multiple-NVIDIA-GeForce-RTX-30-series-gaming-laptops-by-up-to-30-W.548549.0.html"
  }
}