{
  "source": "https://www.techradar.com/news/new-uncharted-movie-images-tease-tom-hollands-first-adventure",
  "title": "New Uncharted movie images tease Tom Holland’s first adventure",
  "category": "entertainment",
  "updated": "2021-01-04T15:20:49Z",
  "author": "axel-metz",
  "summary": "The puzzle is coming together",
  "article": [
    "Sony has released four stills from the upcoming Uncharted movie, shedding new light on Tom Holland’s first adventure as the live-action Nathan Drake.",
    "A recent tweet – with a caption reading \"A new year. A new adventure awaits.\" – includes photos from the movie’s set which detail Nathan Drake’s pursuit of (we assume) treasure somewhere in Africa. The four images reveal a golden crucifix, a cobweb-ridden sculpture, a map of the world and a carefully-cropped still of (presumably) Holland using the crucifix as a key to unlock a chest.",
    "Although the new photos don’t reveal a whole lot in terms of plot or character, it’s the first real look fans have had at the upcoming Uncharted movie beyond a select few press images and cast list; it’s been a project shrouded in relative mystery ever since development began back in 2008.",
    "Naughty Dog’s immensely popular video game franchise has been the subject of Hollywood mutterings for over a decade, but it’s a movie that didn’t gain much momentum until Spider-Man: Homecoming star Tom Holland joined the cast in 2017. A coming and going of directors followed – including the appointment and departure of David O. Russell, Neil Burger and Travis Knight – before Venom director Ruben Fleischer finally began work on the project in 2020.",
    "Though plot details are limited at this stage, Sony has confirmed that the movie will adopt an original story focusing on a younger Nathan Drake, rather than adapting any one of the character’s famous video game adventures. Mark Wahlberg has also been confirmed as playing Victor \"Sully\" Sullivan, a fellow fortune hunter who acts as Drake’s mentor and father figure. Interestingly, Wahlberg was originally set to play the lead role when he joined the project in 2010, before the decision was made to reorient the plot around a younger Nathan Drake.",
    "Despite production wrapping on the movie at the end of 2020, much has been kept under wraps, much like the buried treasure likely to form the basis of its plot.",
    "As yet, there’s been no trailer, but fans have been drip-fed information by means of official images (like the above tweet), cast leaks and the ever-reliable Hollywood rumour mill. Holland recently shared an image on Instagram with the caption, “It’s nice to meet you, I’m Nate.”",
    "Speaking of the movie’s script in February, Holland said it was \"one of the best [he's] ever read\". \"I think what [the Uncharted movie] offers that most video game films don't is that it's an origin story to the games,\" Holland said at the time. \"So if you played the games, you haven't seen what's going to happen in the film,\" he said. \"And if you haven't played the games, you're going to enjoy the film because it's information that everyone else is getting at the same time. But I'm super excited to make that movie and it's been a long time coming.\"",
    "Fans may have also been given a first look at Mark Wahlberg’s Sully; the actor revealed an adventurer-esque moustache in a recent Instagram post, and eagle-eyed social media users were quick to draw the connection.",
    "Given that the movie’s cast details and general premise are all-but confirmed, it seems likely that Sony will continue to release more information about Uncharted as we head towards its release date, currently slated for July 2021."
  ],
  "headers": {
    "5": "Buried details"
  },
  "links": {}
}