{
  "source": "https://www.techradar.com/news/official-samsung-galaxy-s21-ringtone-has-leaked-and-you-can-hear-it-here",
  "title": "Official Samsung Galaxy S21 ringtone has leaked, and you can hear it here",
  "category": "phones",
  "updated": "2021-01-05T12:00:44Z",
  "author": "tom-bedford",
  "summary": "A three-minute ringtone",
  "article": [
    "For each of its Galaxy S phones, Samsung re-imagines the iconic 'Over The Horizon' sound that comes in their music libraries, intended for people to use as alarms and ringtones. The new interpretation of the theme that is expected to be on the Samsung Galaxy S21 has now leaked.",
    "First leaked on Korean site Naver, then shared from there by Twitter leaker @FrontTron to YouTube, this three-and-a-half-minute audio clip is out in the open for all to hear. It's always worth taking leaks with a pinch of salt, but given the musical similarities we'll get to, it seems likely this is the Galaxy S21 version of Over The Horizon.",
    "So when you boot up your Samsung Galaxy S21 for the first time, it's likely this is the song you'll find in the music gallery.",
    "The 2021 version of Over The Horizon is a solo piano rendition of the theme, eschewing the more complex arrangements of the past, though bearing a strong resemblance to the nature-inspired 2020 version. It's arguably less upbeat as a result, without the crescendos and builds of other versions.",
    "The core Over The Horizon motif is still buried in there though, playing briefly at 0:16 and 0:33, with variations on it appearing later. This is the longest Over The Horizon as far as we're aware, but not by much.",
    "Whether you like this version of the song or prefer others is completely down to your taste in music, though we feel fewer people might choose this as an alarm, simply because it's not as shockingly loud or vibrant as you might need to wake up.",
    "If this is definitely the version of Over The Horizon we'll see on the Samsung Galaxy S21, we'll have to wait for the phone's release to set it as an alarm or ringtone. The phone launch is on January 14, and we'll likely find out a release date then.",
    "Via LetsGoDigital"
  ],
  "headers": {
    "3": "What's it like?"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Naver": "https://cafe.naver.com/develoid/951821",
    "@FrontTron": "https://twitter.com/FrontTron/status/1346261654573518848",
    "YouTube": "https://www.youtube.com/watch?v=IEaifbzjfFI&feature=youtu.be",
    "nature-inspired 2020 version": "https://www.youtube.com/watch?v=NOgbHu2PzT4",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/samsung-galaxy-s21-ringtone/"
  }
}