{
  "source": "https://www.techradar.com/news/how-to-watch-muppet-christmas-carol-online-stream-the-full-movie-anywhere",
  "title": "How to watch Muppet Christmas Carol online: stream the full movie on Disney Plus",
  "category": "computing",
  "updated": "2021-12-10T16:38:43Z",
  "author": "daniel-pateman",
  "summary": "Here comes Mr Humbug!",
  "article": [
    "Charles Dickens’ 1843 novella basically invented Christmas. But, of the dozens of screen adaptations, few of them were known for being much fun before Brian Henson reimagined A Christmas Carol with his beloved band of muppets – Miss Piggy, Kermit, Fozzie and co. – and made a family-friendly favorite in the process. So, huddle up together on the sofa and we’ll detail how to watch Muppet Christmas Carol online from anywhere.",
    "It’s a familiar story, narrated here by Gonzo the Great and Rizzo the Rat as they follow Ebenezer Scrooge (Michael Caine) around the cobbled streets of Victorian London.",
    "After an ominous appearance from his deceased business partners (“we’re Marley and Marley, whooooo!”), the miserly money-lender subsequently receives three spirits: the child-like Ghost of Christmas Past, the rambunctious Ghost of Christmas Present, and the foreboding Ghost of Christmas Future. Mortifying him with the consequences of his penny-pinching ways, he wakes up on December 25 a changed man, having learnt the true meaning of the holiday.",
    "Henson stays faithful to Dicken’s original story, but it’s leavened with delightfully zany humor – most memorably involving Rizzo being set on fire (“light the lamp, not the rat!”) and Miss Piggy struggling to differentiate between her two daughters (“No, I’m Belinda!” / “And I’m Betina!”). Meanwhile, Michael Caine is terrific as Scrooge, playing it straight despite being surrounded by muppets, and there are some enchanting tunes to sing along to, too (The Love We Found, One More Sleep ‘til Christmas).",
    "Want that cosy Christmas feeling all year round? Then read on as we explain how to watch A Muppet Christmas Carol online now - or check out how to watch The Muppet Show online and see how the legendary vaudeville puppets got their big break!",
    "Disney Plus is already cheaper than competing streaming services like Netflix but you can save even more when you sign up for an annual subscription which gives you 15% off the monthly price. While that means paying one lump sum initially, with so much content to get stuck in to we doubt you'll run out of things to watch before the 12 months are up. You're looking at $79.99/£79.90/AU$119.99 for the year.",
    "Or, if you have broader viewing tastes (and you're in the US), then we'd really recommend you look at the fantastic value bundle package. It adds Hulu and ESPN+ to your subscription price. The Hulu element opens up a world of Hulu Originals such as The Great, Upload, Monsterland and Normal People. While ESPN+ brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $12.99 a month.",
    "Disney Plus is home to so much feel-good entertainment. In addition to classics like The Muppet Christmas Carol, subscribers can also watch the latetst titles from the MCU, including Hawkeye and Black Widow, as well as other more festive movies like The Muppets Christmas Carol, including the new Home Sweet Home Alone.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "And finally, there's the new Star on Disney Plus payload that most global markets get to enjoy and sees the amount of content available through Disney Plus more than double, with a particular eye to shows grown-ups are going to enjoy. It costs a tiny bit more, but is worth it based on our initial impressions - and you can still save big by going with an annual subscription.",
    "Read more:"
  ],
  "headers": {
    "5": "How to save money on Disney+ right now",
    "7": "What else should I know about Disney+?"
  },
  "links": {
    "watch The Muppet Show online": "https://www.techradar.com/news/how-to-watch-the-muppet-show-online-disney-plus",
    "$79.99/£79.90/AU$119.99 for the year": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-6405207083541583000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN+": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $12.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1384386450682624800&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Hawkeye": "https://www.techradar.com/news/how-to-watch-hawkeye-online-on-disney-plus-from-anywhere-now",
    "Black Widow": "https://www.techradar.com/news/how-to-watch-black-widow-online-on-disney-plus-today-from-anywhere",
    "Home Sweet Home Alone": "https://www.techradar.com/news/how-to-watch-home-sweet-home-alone-online-on-disney-plus-today",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained"
  }
}