{
  "source": "https://www.techradar.com/news/apparently-even-samsung-doesnt-know-if-the-galaxy-s21-fe-is-coming-out",
  "title": "Apparently even Samsung doesn't know if the Galaxy S21 FE is coming out",
  "category": "phones",
  "updated": "2021-09-27T09:06:14Z",
  "author": "tom-bedford",
  "summary": "With a launch canceled",
  "article": [
    "There's been a lot of to-ing and fro-ing about the Samsung Galaxy S21 FE - it didn't come in August like we expected, but sources are repeatedly careering between 'it's not coming' and 'it's coming, but later in the year' then back again. In short, we've no idea if or when it's coming.",
    "Just days after we heard it's coming in late October, another source has stated it might not come at all. This newest information comes from Korean news site Digital Daily, which apparently got an official comment from Samsung to say \"we canceled the Galaxy S21FE online unpack, which was planned for mid-October,\" and \"we are reviewing the smartphone launch itself\".",
    "It's a little curious for Samsung to provide the former comment, given it had never confirmed an October Unpacked event was happening in the first place. We've asked Samsung for further comment on the matter, and will update this article when we hear back.",
    "The latter comment is the really interesting one - it sounds like even Samsung is unsure as to whether its beleaguered lower-cost Galaxy S21 model will ever hit the market.",
    "With a hundred reports pointing this way and that, no-one's quite sure what's happening with the Galaxy S21 FE - which could work perfectly in Samsung's favor.",
    "Rumors suggest the ongoing silicon shortage is the reason an S21 FE might not come along, and we've seen many other late-2021 phones like the OnePlus 9T and Galaxy Note 21 canceled for similar reasons. Apparently, the company is struggling to get enough chipsets for the phones.",
    "If Samsung is counting its metaphorical pennies - or processors, in this case - the myriad rumors about the phone's cancelation give the company the perfect excuse to not put out a device.",
    "Instead, Samsung could keep a hold of its processors for 2022, and perhaps use them on an FE version of the Galaxy S22 or maybe even a mid-range phone.",
    "As there's only been one true Fan Edition phone so far, there's no expectation on Samsung to release a new version of it every single year.",
    "There have already been plenty of smartphones launched this year, and it's pretty late in the season for more - Black Friday is coming up, and the Google Pixel 6 will probably steal headlines until then anyway.",
    "The market segment the Galaxy S21 FE would aim for has already just been dominated by the recent Xiaomi 11T Pro - we don't need another mid-range flagship, especially one that would likely struggle to compete with Xiaomi's newest.",
    "So Samsung - give yourself a break. Have a long Christmas, and come back next year ready to wow us with the S22 line."
  ],
  "headers": {
    "4": "Analysis: enough phones already"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "it's coming in late October": "https://www.techradar.com/news/black-friday-could-spell-disaster-for-the-samsung-galaxy-s21-fe-launch",
    "Digital Daily": "http://www.ddaily.co.kr/news/article/?no=222428",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Xiaomi 11T Pro": "https://www.techradar.com/reviews/xiaomi-11t-pro"
  }
}