{
  "source": "https://www.techradar.com/news/microsoft-support-scams-skyrocketed-over-the-past-year-heres-what-you-need-to-know",
  "title": "Microsoft support scams skyrocketed over the past year - here's what you need to know",
  "category": "computing",
  "updated": "2021-07-23T14:00:18Z",
  "author": "mayank-sharma",
  "summary": "And tech-savvy users fall victim more often",
  "article": [
    "A Microsoft investigastion has revealed a growing number of tech support scams and its impact on consumers across the world.",
    "The survey covered over 16,000 adults in 16 countries, finding that at least three out of five were targeted in the last one year - and surprisingly, it was the supposedly more tech savvy millennials and Gen Z that often fell prey to the scams, with one out of every ten that were targeted losing money.",
    "Extrapolating these figures to gauge the impact of the scams, the survey estimates at least 60% of UK adults were exposed to a tech support scam in the last 12 months. Furthermore, one out of six consumers was tricked into continuing with the scam, and often ended up losing large amounts of money to the fraudsters.",
    "Interestingly, compared to the previous edition of the survey in 2018, there has actually been a drop in the number of consumers that have been exposed to tech support scams, due to increased consumer awareness.",
    "“However, those people who continued with the interaction were more likely to have lost money to the scammers than we saw in our previous survey,” says Mary Jo Schrade, Assistant General Counsel, Regional Lead, Microsoft Digital Crimes Unit Asia in a blog post.",
    "“Tech support fraud has evolved from pure cold calling to a more sophisticated infrastructure that leverages affiliate marketers to deliver professional-looking pop-ups to consumers, prompting them to contact fraudulent call centers,” Schrade added.",
    "She adds that scammers are adept at combining electronic tools such as email, and search engine optimization (SEO) together with social engineering tactics to successfully con victims.",
    "Schrade also shares that the scammers these days operate at an enterprise level and aren’t averse to sharing resources with each other, including referrals to call centers, leads and payment processors.",
    "Sensitive financial information continues to be at risk, with an increasing number of victims being asked for their government-issued identification number, or asked to log into their banking website during the fraudulent engagement.",
    "“Not surprisingly, there was an increase in the number of consumers reporting fraudulent use of credit/debit cards, accounting for the increase in money lost,” noted Schrade, hoping the survey will help increase awareness and educate users about the scams."
  ],
  "headers": {
    "5": "Fully-fledged industry"
  },
  "links": {
    "Microsoft": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "scams": "https://www.techradar.com/news/google-chrome-update-makes-it-even-better-at-spotting-phishing-scams",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1271490293954617000&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fon-the-issues%2F2021%2F07%2F21%2Ftech-support-scams-adapt-2021-microsoft-study%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-support-scams-skyrocketed-over-the-past-year-heres-what-you-need-to-know",
    "email": "https://www.techradar.com/news/best-email-provider",
    "search engine optimization (SEO)": "https://www.techradar.com/news/best-seo-tool",
    "payment processors": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}