{
  "source": "https://www.techradar.com/news/sigma-fp-l-leaks-reveal-its-sensor-and-attractive-price-tag",
  "title": "Sigma FP L leak suggests surprisingly attractive price",
  "category": "cameras",
  "updated": "2021-03-23T11:08:35Z",
  "author": "mark-wilson",
  "summary": "Modular full-frame camera is nearly here",
  "article": [
    "Some new Sigma FP L leaks appear to have revealed two crucial details about the imminent full-frame camera – its sensor and likely price tag.",
    "Earlier rumors had predicted that the intriguing camera, which will be compatible with L Mount lenses and sport a modular design like the Sigma FP, would pack a new 60MP sensor. And those predictions appear to have been correct, thanks to some detective work in a post from L Rumors.",
    "One of the site's readers noticed a folder containing FP L images on Sigma's server, and the EXIF data (which is effectively a photo's metadata) reveals that the camera will indeed have a new 60.2MP full-frame sensor.",
    "This is interesting because the Sigma FP only had a 24.6MP sensor, so that's a significant bump in resolution – and one that can potentially bring additional issues for video like rolling shutter (a warping effect during fast panning movements), due to the amount of extra data being read from the sensor.",
    "This suggests that the Sigma FP L could potentially have more of a stills focus, with the Sigma FP retaining its role as pretty unique little video camera that can output 12-bit raw video to an external recorder.",
    "Leaked photos of the FP L show that it'll have the same modular design as the FP, which means a lightweight 370g body that can be bolstered with accessories like an electronic viewfinder (EVF) and grip. But it looks like the camera will also arrive with new add-ons, like an intriguing side-mounted EVF.",
    "Along with news of the new sensor, a separate leak from the Nokishita suggests that the Sigma FP L will cost $2,499 (around £1,810 / AU$3,250) when it arrives, with the full launch expected sometime today.",
    "That's a small bump in price compared to the Sigma FP, which arrived for $1,899 / £1,999 in October 2019, but would still represent pretty good value for a 60MP full-frame camera.",
    "Of course, you have to factor in that doesn't include extras like an EVF, which are standard on other cameras. But the appeal of the Sigma FP and imminent FP L are that they're bare-bones cameras that can effectively be customized and built to suit your shooting needs, rather than coming with one-size-fits-all compromises.",
    "According to that Nokishita post, though, there will also be an 'EVF kit' bundle for the FP L that costs $2,999 (around £2,170, AU$3,900) which will give you a small saving on buying the EVF-11 (pictured above) separately.",
    "Overall, this makes the Sigma FP L an interesting proposition and one that would offer something different from the current crop of the best full-frame cameras. If you're all in on the L Mount, which is also used by Panasonic and Leica cameras, and want more resolution than the current FP offers, then it could be versatile new option. We'll bring you the official news as soon as it breaks."
  ],
  "headers": {
    "6": "The price is right"
  },
  "links": {
    "Sigma FP": "https://www.techradar.com/reviews/sigma-fp",
    "L Rumors": "https://www.l-rumors.com/leaked-first-image-samples-shot-with-the-sigma-fp-l-show-it-has-60-2mp-sensor/",
    "Nokishita": "https://twitter.com/nokishita_c/status/1374115208843554819",
    "best full-frame cameras": "https://www.techradar.com/news/best-full-frame-camera"
  }
}