{
  "source": "https://www.techradar.com/news/china-blocks-signal-heres-what-you-need-to-know",
  "title": "China blocks Signal - here's what you need to know",
  "category": "computing",
  "updated": "2021-03-17T17:04:23Z",
  "author": "anthony-spadafora",
  "summary": "Signal is the latest foreign service to be blocked in China",
  "article": [
    "The popular encrypted messaging app Signal is the latest online service to be blocked in China with users across the country reporting that they are no longer able to access it.",
    "The news comes a month after censors in Iran began blocking the app's traffic as countries around the world look to crack down on their citizens using encrypted messaging apps to privately communicate.",
    "As with other online services such as Facebook, Google and Twitter which have been blocked for years in China, Signal users can circumvent the country's Great Firewall by using a VPN. This is because VPNs allow you to change your IP address to one in another country where the app or service you're trying to use isn't blocked.",
    "Signal uses end-to-end encryption for both its messaging and calling services and this prevents third parties from viewing users' chats or listening in on their phone calls.",
    "Signal users in China recently began reporting that they were unable to get the app to connect without using a VPN. Those who tried to use it without one said that their messages failed to send and that their calls did not go through.",
    "During a daily news briefing though, spokesperson for China's ministry of foreign affairs Zhao Lijian explained that he was unaware of the situation and that the country's internet is open, saying:",
    "“What I can tell you is that as a principle, China’s internet is open, and the Chinese government manages internet-related affairs according to law and regulations.”",
    "Signal recently became popular among Chinese users concerned about their privacy online though the app is nowhere close to overtaking China's WeChat which has over a billion users and is not only used to communicate but also to make online payments. However, politically sensitive messages and content on WeChat is often censored and Chinese authorities have detained citizens for messages sent via the service.",
    "We'll likely find out more on the situation as it develops but until then, users in China can grab one of the best China VPNs to continue using Signal in the country.",
    "Via The Guardian"
  ],
  "headers": {
    "4": "Blocked in China"
  },
  "links": {
    "Signal": "https://www.techradar.com/news/signal-and-other-video-chat-apps-found-to-have-some-major-security-flaws",
    "blocking the app's traffic": "https://signal.org/blog/help-iran-reconnect/",
    "encrypted messaging apps": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "Great Firewall": "https://www.techradar.com/news/this-app-helped-bypass-chinas-great-firewall-but-has-vanished-into-thin-air",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "end-to-end encryption": "https://www.techradar.com/news/eu-dangerously-drifting-towards-banning-end-to-end-encryption",
    "WeChat": "https://www.techradar.com/news/signal-aims-to-tempt-whatsapp-users-by-borrowing-some-of-its-best-features",
    "online payments": "https://www.techradar.com/best/best-payment-gateways",
    "best China VPNs": "https://www.techradar.com/news/best-vpn-for-china-our-5-top-choices",
    "The Guardian": "https://www.theguardian.com/world/2021/mar/16/signal-blocked-china-encrypted-messaging-app"
  }
}