{
  "source": "https://www.techradar.com/news/spider-man-no-way-home-lego-sets-suggest-peter-parker-might-lose-his-powers",
  "title": "Spider-Man: No Way Home merchandise reveals the new Spidey suits",
  "category": "entertainment",
  "updated": "2021-07-02T15:42:06Z",
  "author": "hamish-hector",
  "summary": "Could Peter Parker lose his powers?",
  "article": [
    "Update: Marvel has released an official image of merchandise for the upcoming film, offering a more detailed look at the suits coming up in No Way Home:",
    "Original story: New details about this year’s upcoming MCU film Spider-Man: No Way Home could have just been leaked by its official Lego sets. Images of the three models, which are listed as releasing on October 1, reveal a few potential details including some surprise villains and new Spider-Man suits.",
    "The black and gold outfit is particularly interesting as it seems reminiscent of a suit in the comics from when Spider-Man lost his iconic Spider-Sense superpower. Could we see something similar in Spider-Man: No Way Home later this year?",
    "Just remember that it’s still worth taking these leaks with a grain of salt. Even though the Lego sets are officially licensed, Marvel and Lego know that they could give away spoilers, so these pre-release sets often aren’t 100% accurate to the actual movie.",
    "Let’s start with the set that feels like it actually gives us the most information. Priced at $39.99 / £34.99 / AU$59.99, Spider-Man at the Sanctum Workshop confirms that Doctor Strange will be in this movie (a detail we already knew). However, it also appears to show off Spider-Man’s new costume. It looks like a blend between his suit from Far From Home and his Iron Spider outfit, with black accents and a large gold spider emblazoned on the front. The same suit also appears on the box art for all three sets:",
    "Interestingly, Spider-Man’s Drone Duel (priced at $19.99 / £17.99 / AU$32.99) gives away another possible new suit design, with interesting consequences. The black and gold outfit is reminiscent of the character’s MK. II Armor suit that first appeared in issue #656 of the Amazing Spider-Man comics.",
    "At the time, Peter had lost his Spider-Sense abilities and needed something to protect himself. This kind of depowering is a common Spider-Man story trope that we’re yet to see in the MCU, so maybe it’ll appear in No Way Home.",
    "Both suits have also received additional confirmation thanks to two newly unveiled Funko Pop figures. Pictured below we can see Spider-Man in both the 'Black and Gold suit' and in the 'Integrated Suit' (which seems to incorporate holograms and mystical symbols that suggest Doctor Strange might be lending Peter Parker some magic).",
    "Another Funko Pop shows Doctor Strange carrying a snow shovel and wearing wintery clothing. What this means for the plot is yet to be seen, but a trip to somewhere cold seems like it might be on the cards.",
    "With the new suit design indicating that the Spider-Man’s Drone Duel Lego set could indeed be based on No Way Home, the inclusion of a Vulture Minifigure has some interesting consequences.",
    "The last time we saw Michael Keaton’s character in Spider-Man: Homecoming, he seemed to be on the wall crawler's side by choosing to keep his identity a secret. Perhaps he’s had a change of heart and is out for revenge.",
    "If this is true, it could tie into the final announced set, Spider-Man vs. Mysterio’s Drone Attack (also priced at $19.99 / £17.99 / AU$32.99). This is the one we’re least confident is reliable. It shows Spider-Man (in his Far From Home suit) battling Mysterio alongside Nick Fury. While it is promoting Spider-Man: No Way Home, this feels a lot more like a scene from the previous film.",
    "A return of Mysterio isn’t completely impossible, though. If Vulture is making a comeback, alongside the already announced inclusion of Doc Ock and Electro, then that means we could finally be seeing the Sinister Six team up we’ve been waiting for. Now to work out who the last two could be..."
  ],
  "headers": {
    "4": "Glimpses from the Eye of Agamotto",
    "9": "Things are getting Sinister"
  },
  "links": {
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "official Lego sets": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-1267032539936182000&murl=https%3A%2F%2Fwww.lego.com%2Fen-us",
    "Spider-Man at the Sanctum Workshop": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-7845949764986863000&murl=https%3A%2F%2Fwww.lego.com%2Fen-us%2Fproduct%2Fspider-man-at-the-sanctum-workshop-76185",
    "Spider-Man’s Drone Duel": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-1169499501426706400&murl=https%3A%2F%2Fwww.lego.com%2Fen-us%2Fproduct%2Fspider-man-s-drone-duel-76195",
    "Spider-Man vs. Mysterio’s Drone Attack": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-7874624636152674000&murl=https%3A%2F%2Fwww.lego.com%2Fen-us%2Fproduct%2Fspider-man-vs-mysterio-s-drone-attack-76184"
  }
}