{
  "source": "https://www.techradar.com/news/stranger-things-4s-new-trailer-teases-the-shows-spookiest-entry-yet",
  "title": "Stranger Things 4's new trailer teases the show's spookiest entry yet",
  "category": "entertainment",
  "updated": "2021-09-25T16:24:12Z",
  "author": "tom-power",
  "summary": "Stranger Things 4 could be the scariest so far",
  "article": [
    "Stranger Things season 4's third teaser has arrived – and it's certainly suggesting that the TV show's next instalment will be the scariest yet.",
    "The brief trailer debuted during Tudum, Netflix's first-ever global fan event. And, while it didn't give too much away about the forthcoming season's plot, it hints at spookier and supernatural events to come when Stranger Things 4 does arrive.",
    "Check out the trailer via the official Netflix Twitter account below:",
    "The teaser opens on an unknown family moving into their new home, which is called Creel House. However, things soon take a supernatural turn, with rabbit carcasses found outside, the house's electricity cutting out and the aftermath of what appears to be the father murdering his two children.",
    "Fast forward to present day, and we see Steve, Dustin, Lucas and Max entering the rundown property. After Dustin makes a reference to Sherlock Holmes, which the rest of the group are non-plussed about, the quartet head upstairs – and it seems that a grandfather clock in the attic could be key to part of season 4's plot.",
    "Unfortunately, there's still no confirmed release date for Stranger Things season 4, outside of the fact that it's coming in 2022. Fans had been hoping that an announcement would be made during Tudum, but Netflix and the series' showrunners are holding onto that reveal for now.",
    "It's possible that an official launch date will be made alongside the fourth and final teaser. We're unsure about when that'll arrive but, hopefully, it'll be sometime before the end of 2021."
  ],
  "headers": {},
  "links": {
    "Stranger Things season 4": "https://www.techradar.com/news/stranger-things-season-4"
  }
}