{
  "source": "https://www.techradar.com/news/microsoft-azure-is-now-smarter-and-more-powerful-than-ever",
  "title": "Microsoft Azure is now smarter and more powerful than ever",
  "category": "computing",
  "updated": "2021-05-25T15:10:22Z",
  "author": "joel-khalili",
  "summary": "Microsoft adds a host of new AI-powered services to the Azure roster",
  "article": [
    "Microsoft has unveiled a raft of additions to its Azure cloud suite, geared towards helping developers streamline and modernize business processes.",
    "The company used its annual Build conference as a launchpad for the upgrades, which fall under a new Azure category called Applied AI Services.",
    "“These services build on the cognitive APIs from Azure Cognitive Services and Azure Machine Learning, accelerating development of AI solutions by providing additional task-specific AI and built-in business logic,” Microsoft explained.",
    "The first of the new products is called Azure Bot Service, described as a “new integrated development experience” that helps developers build bots that can be deployed across multiple channels with few code alterations. The platform is said to ease the process of testing and debugging, and simplify the integration of speech and telephony functionality.",
    "Azure Metrics Advisor, meanwhile, harnesses machine learning to identify anomalies and generate diagnostic insights based on data drawn from various sensors and software. The service provides a centralized hub from which customers can “monitor the performance of growth engines”.",
    "Microsoft has also rolled out Azure Video Analyzer in preview, bringing existing Live Video Analytics and Video Indexer functionality under one roof. This AI-powered video analytics tool can be applied to video footage held on file and media streamed live.",
    "In addition to the Azure Applied AI Services category, Microsoft took the opportunity to share information about two new machine learning capabilities designed to “help customers accelerate deployment of AI models”.",
    "The first, Azure Machine Learning managed endpoints, streamlines this process by automating the creation and management of the underlying compute infrastructure.",
    "The company also confirmed that PyTorch, an open source deep learning framework, is coming to Azure. As part of the integration, select Microsoft customers will receive benefits, including hands-on support, hotfixes and priority requests.",
    "With these new additions, Microsoft hopes Azure will be better positioned to help developers expand upon the crucial work put in during the pandemic.",
    "“Developers have been critical to helping businesses remain resilient and agile over the past year,” said Frank X. Shaw, Corporate VP Communications at Microsoft.",
    "“As we look across our customers and partners, we’re seeing the business impact of developers increasing as the world begins to rebuild. Developers are no longer simply building apps; they’re building digital products that drive us forward and solve the world’s most challenging problems.”"
  ],
  "headers": {
    "3": "Microsoft Azure updates"
  },
  "links": {
    "Azure": "https://www.techradar.com/reviews/microsoft-azure"
  }
}