{
  "source": "https://www.techradar.com/news/the-suicide-squad-ending-and-post-credits-scene-explained",
  "title": "The Suicide Squad ending and post-credits scene explained",
  "category": "entertainment",
  "updated": "2021-08-06T14:17:07Z",
  "author": "tom-power",
  "summary": "Spoilers follow for The Suicide Squad",
  "article": [
    "Spoilers follow for The Suicide Squad on HBO Max.",
    "The Suicide Squad, Warner Bros’ latest DC Extended Universe (DCEU) movie, has arrived on HBO Max – and there’s a fair bit to unpack from James Gunn’s R-rated superhero (or should that be supervillain?) film.",
    "Now that the credits have rolled, we imagine you have questions, including who lived and died, and what went down in the movie's post-credits scene.",
    "Below, we’ll break down how The Suicide Squad ends, as well as cover how its final few scenes will affect at least one DCEU project. It’s obvious to say, but we’re about to dive into major spoiler territory for The Suicide Squad, so turn back now if you haven’t watched it in its entirety.",
    "It would be easier to list those who actually survived. Ahead of the film’s release, director James Gunn continually stated that there would be major casualties among the movie’s sizable cast – and he wasn’t joking.",
    "The majority of the film’s ensemble cast didn’t make it past the Saving Private Ryan-inspired beach assault in the first act. Of that number, the demise of Captain Boomerang (Jai Courtney) was the most shocking, given that he had featured prominently in the 2016 movie adaptation of Suicide Squad.",
    "Of those who made it into the heart of Corto Maltese, though, two characters' journeys wouldn’t progress much further.",
    "Colonel Rick Flag (Joel Kinnaman) is murdered by Peacemaker (John Cena) after the pair fought over a vital piece of evidence. The item in question – a hard drive – contained evidence of the US government’s involvement in funding experiments surrounding Starro, with Flag and Peacemaker divided over what to do with it.",
    "Feeling betrayed by the very people he conducted these missions for, Flag wants to upload the drive to the internet and reveal the US government’s secret to the world. As a loyal patriot, however, Peacemaker has other ideas. He wants to give the evidence to Task Force X’s leader Amanda Waller (Viola Davis) to ensure that the footage never sees the light of day.",
    "After a brutal, hand-to-hand battle, it’s Peacemaker who comes out on top. As Flag tries to suffocates him with a lead pipe, Peacemaker grabs a nearby piece of broken porcelain and stabs Flag in the heart, thereby killing him.",
    "Polka-Dot Man (David Dastmalchian) is the other major casualty of the movie’s third act. Helping his fellow supervillains to halt Starro’s rampage across the island, he’s crushed by one of the starfish kaiju’s five limbs – but not before he heroically shouts “I’m finally a superhero!” for doing something good with his life. It’s a semi-honorable death and one that, ironically, he’d asked for earlier in the film.",
    "So, who did survive to the very end? Of the 15 supervillains who made up this version of Task Force X, only six lived to tell the tale.",
    "Bloodsport (Idris Elba), Harley Quinn (Margo Robbie), Ratcatcher 2 (Daniela Melchior), King Shark (Steve Agee/Sylvester Stallone), Weasel (Sean Gunn) and, surprisingly, Peacemaker are the sextet who make it out alive.",
    "It’s the latter two of that group, though, who have the biggest questions surrounding them, and this is where The Suicide Squad’s post-credits scenes come into play.",
    "Yes. In fact, there are two – one immediately after The Suicide Squad’s title card appears, and one once the credits have rolled.",
    "The first concerns Weasel. Presumed dead after it seemingly drowned before the beach assault, Weasel coughs up some sea water and awakens to find itself alone on the shore. Unaware of the events that have just played out, and with no way of getting off the island, Weasel heads into the nearby jungle – presumably to live out its days as a Corto Maltese urban myth.",
    "If The Suicide Squad’s first end credits scene is meant to be slightly humorous, its second could set up an intriguing future for one DCEU production.",
    "John Economos (Steve Agee) and Emilia Harcourt (Jennifer Holland), two of Waller’s aides, arrive at an unknown hospital and are led to a particular patient’s room by a doctor. The camera pans around to show who is in the room’s hospital bed – and it’s none other than Peacemaker.",
    "It’s a surprise to see Peacemaker alive. Having killed Flag, Peacemaker realizes that Ratcatcher 2 watched him murder their former teammate in cold blood. The hard drive, meanwhile, was tossed to the ground in the ensuing melee – and Ratcatcher 2 now has it in her possession.",
    "A chase ensues as Peacemaker tries to retrieve the evidence and he eventually corners his prey. Despite her pleas not to shoot, Peacemaker draws his weapon to kill Ratcatcher 2, but Bloodsport shows up in the nick of time.",
    "The duo exchange fire, but it’s Bloodsport that lands a telling long-range blow and seemingly kills Peacemaker. Fast-forward to the after credits scene, however, and Peacemaker clearly isn’t dead.",
    "So how does this set up the DCEU’s future? For one, it’s likely that The Suicide Squad’s post-credits scene is setting up events for Peacemaker’s forthcoming TV show, which is due to launch on HBO Max in January 2022.",
    "Billed as a series that will “explore the origins” of Peacemaker, many fans had been led to believe that the show will be a prequel to The Suicide Squad. While that may still be the case – we may get flashbacks to how Cena’s character becomes Peacemaker in the first place – it’s also possible that the TV series will be set after The Suicide Squad.",
    "Given that Agee’s Economos and Holland’s Harcourt will be supporting characters in the show, The Suicide Squad’s post-credits scene is clearly a setup for Peacemaker’s TV show.",
    "The eight-part series has been written and directed by Gunn, too, so it’ll be closely tied to The Suicide Squad regardless of whether it’s a prequel, sequel or a combination of the two.",
    "If Peacemaker survives his next ordeal, we may see him appear in future DCEU movies – especially any that may star Bloodsport. He’ll want revenge, after all, and that could even set up events for a Suicide Squad sequel. Here’s hoping we get one."
  ],
  "headers": {
    "4": "The Suicide Squad ending explained: who died during the Corto Maltese mission?",
    "14": "The Suicide Squad ending explained: is there an end credits scene?"
  },
  "links": {
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "DC Extended Universe (DCEU) movie": "https://www.techradar.com/how-to/how-to-watch-the-dceu-movies-in-order",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "continually stated": "https://www.techradar.com/news/the-suicide-squad-cast-knew-who-would-die-before-filming-began",
    "Peacemaker’s forthcoming TV show": "https://www.techradar.com/news/heres-how-the-suicide-squad-tv-spin-off-will-differ-from-the-movie"
  }
}