{
  "source": "https://www.techradar.com/news/nvidia-has-quietly-released-a-surprise-new-gpu-but-its-not-what-you-think",
  "title": "Nvidia has quietly released a surprise new GPU – but it's not what you think",
  "category": "computing",
  "updated": "2021-01-19T11:20:39Z",
  "author": "jess-weatherbed",
  "summary": "Powered by Pascal",
  "article": [
    "Chances are the Nvidia GeForce GT 1010 announcement may have slipped under your radar, what with all the recent buzz surrounding the latest generation of powerful new Ampere-powered graphics processing units (or GPUs). Or rather, it would have slipped past us if an announcement had been made at all - but instead the new GeForce GT 1010 was silently listed on the Nvidia driver download page with no fanfare or fuss, only bought to public attention thanks to Videocardz with the help of YouTuber Dapz and TechPowerUp.",
    "The GeForce GT 1010 is based on the two-year-old Pascal architecture, and will succeed the Keplar-based GeForce GT 710, replacing it as the most entry-level graphics card available from Nvidia. There is no official mention of price, however the GeForce GT 710 retails for around $60 (around £45, AU$80) so we expect to see the GT 1010 fall into a similar price bracket. With so little power behind it, it goes without saying that this isn't designed as a gaming GPU, and would be more suitable as a display adapter for home-theatre PCs (known as HTPCs). You could also use this video card for other builds that do not require heavy graphic rendering, such as a basic office PC. This might come as a disappointment for anyone hoping Nvidia would drop another addition to its new generation of gaming GPUs. If you’re wondering when it might become easier to buy one of the latest Nvidia RTX 3000 series cards, the answer is – sadly – not any time soon.",
    "The GeForce GT 1010 was listed over at Nvidia's Driver webpage under the GeForce 10 series family, sharing the Pascal architecture with other 10 series GPUs.",
    "Apparently the card will feature a TDP of 30W and as such won't rely on any external power connectors to work. It also features a GP108 chip that rocks 256 CUDA cores (for context, the RTX 3090 features 10,496 CUDA cores), and is clocked at a base frequency of 1,228 MHz and a boost clock of 1,468 MHz. The card also features 2GB GDDR5 VRAM which runs across a 64-bit bus interface. The specifications are hardly mind-blowing, but this isn't designed to knock anyone's socks off for raw power. The card will feature two DVI ports and a single mini HDMI output, which is great for a legacy build using older hardware, but not so much for anyone hoping to connect to a new 4K OLED TV.",
    "You can of course stream the content from the HTPC or use an adapter, so this shouldn't be a deal-breaker, but the GeForce GT 1010 GPU is likely more suited for setups that don't feature display outputs or simply require some additional power for video playback and streaming.",
    "In the meantime, if you were hoping for another Nvidia 3000 series graphics card announcement, we’ve got some handy where to buy guides for the RTX 3060 Ti, RTX 3070 and RTX 3080, articles that are worth keeping an eye on as we regularly update them to flag up when stock arrives.",
    "Via WCCFTech"
  ],
  "headers": {
    "2": "It gets the job done"
  },
  "links": {
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "Videocardz": "https://videocardz.com/newz/nvidia-answer-to-gpu-shortage-geforce-gt-1010",
    "Dapz": "https://www.youtube.com/watch?v=SDqiaVeN9mo",
    "TechPowerUp": "https://www.techpowerup.com/gpu-specs/geforce-gt-1010.c3762",
    "Nvidia RTX 3000": "https://www.techradar.com/news/nvidia-ampere",
    "Driver webpage": "https://www.nvidia.co.uk/Download/index.aspx?lang=en-uk",
    "4K OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "RTX 3060 Ti": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-ti-find-stock-here",
    "RTX 3070": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3070-find-stock-here",
    "RTX 3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "WCCFTech": "https://wccftech.com/nvidia-geforce-gt-1010-entry-level-successor-to-the-geforce-710-finally-here/"
  }
}