{
  "source": "https://www.techradar.com/news/psvr-2-specs-sound-even-better-than-whats-been-leaked",
  "title": "PSVR 2 specs sound ‘even better’ than what’s been leaked",
  "category": "gaming",
  "updated": "2021-08-04T08:37:34Z",
  "author": "adam-vjestica",
  "summary": "The new PS5 VR headset could be a beast",
  "article": [
    "Sony’s PSVR 2 headset for PS5 could have “even better” specs than what we’ve previously heard, according to Digital Foundry.",
    "In a new episode of Digital Foundry Weekly, host and technology editor Richard Leadbetter said “we’ve seen some leaked [PSVR 2] specs and it looks good,” but went on to add that “we’ve seen some other specs which haven’t been leaked which make it look even better.”",
    "Sony’s new virtual reality headset specs are still firmly underwraps, but it’s rumored to boast a higher resolution screen than the Oculus Quest 2, a dial for lens adjustment, gaze tracking, and a motor within the headset itself that might be used for haptic feedback. It could also use OLED panels for each eye as opposed to LCD.",
    "Sony Interactive Entertainment CEO Jim Ryan previously told GQ that Sony “believes in VR” and that specs would be revealed “over the course of this year”, so we should find out more soon.",
    "The PSVR 2 will let you use the DualSense PS5 controller for games, but will also include its own dedicated VR controllers that include haptic feedback and finger touch detection. Sony said the new controls “enables you to make more natural gestures with your hands during gameplay” and they look far more advanced than the PS Move controllers that were used in combination with the original PlayStation VR headset.",
    "Sony’s second stab at virtual reality looks like it will deliver a more premium and high-end experience. The power of the PS5 and dedicated controllers will certainly help, but we still don’t know enough about the PSVR 2 headset to determine what it will truly be capable of.",
    "Some may be surprised that Sony is still bothering with VR at all, considering how the medium hasn’t reached widespread adoption yet. However, PSVR was clearly enough of a success for PlayStation that Sony decided it was worth the gamble. And, with Microsoft ignoring virtual reality on Xbox for now, it gives the PS5 an advantage over the competition, especially since it can power VR experiences far above the Nintendo Labo VR Kit on Nintendo Switch.",
    "In terms of a release date, Sony has previously admitted that “there’s still a lot of development underway for our new VR system,” though a recent report from Bloomberg suggested it could launch by Christmas 2022. It's worth noting that if you're still on the fence about VR in general, the original PlayStation VR headset does work on PS5, though you'll need to contact Sony for a free PSVR adaptor."
  ],
  "headers": {
    "5": "Analysis: what can we expect from PSVR 2?"
  },
  "links": {
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Digital Foundry Weekly": "https://www.youtube.com/watch?v=67jeWba0a9E",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "GQ": "https://www.gq-magazine.co.uk/culture/article/playstation-vr-jim-ryan-interview-2021",
    "DualSense PS5 controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "PS Move controllers": "https://www.techradar.com/reviews/gaming/gaming-accessories/playstation-move-713638/review",
    "PlayStation VR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "Microsoft ignoring virtual reality on Xbox": "https://www.techradar.com/news/xbox-series-x-vr-hopes-dashed-by-microsoft",
    "Nintendo Labo VR Kit": "https://www.techradar.com/reviews/nintendo-labo-vr-kit-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-06-16/fading-iphone-lcd-screen-maker-pivots-to-virtual-reality",
    "Sony for a free PSVR adaptor": "https://www.techradar.com/how-to/how-to-claim-a-free-ps5-playstation-vr-adapter-for-your-new-console"
  }
}