{
  "source": "https://www.techradar.com/news/the-sims-4-is-hosting-its-first-in-game-musical-festival-featuring-real-life-artists",
  "title": "The Sims 4 is hosting its first in-game musical festival featuring real-life artists",
  "category": "computing",
  "updated": "2021-06-25T09:07:38Z",
  "author": "vic-hood",
  "summary": "Roam the campsite, pick up exclusive merch and even perform",
  "article": [
    "The Sims 4 is set to host its first in-game music festival, starting next week, EA and Maxis have announced.",
    "Sims Sessions will be an exclusive in-game music festival, featuring performances from real-life artists (in Sims form) Bebe Rexha, Glass Animals and Joy Oladokun – who will sing part of their set in Simlish. After the main show is over, your Sim will be able to get up on the main stage themselves and belt out some Simlish classics.",
    "But there's not just the music to look forward to, attendees will also be able to explore the festival site: grabbing a bite to eat, creating festival fashions, selling crafts at their own craft table, camping out and even shopping exclusive band merch. Who needs Glastonbury?",
    "Outside of the game, players can also take part in the virtual #SimlishSessions karaoke challenge on TikTok, where you'll be able to test your Simlish in side-to-side duets with Bebe Rexha.",
    "This is the first time we've seen The Sims series host an in-game music festival, with Steve Schnur, Worldwide Executive and President of Music at EA, calling Sims Sessions \"the next evolution of music in The Sims\".",
    "Since the veteran series began we've seen over 500 artists teaming up with EA and Maxis to record their songs in Simlish, including Katy Perry, The Black Eyed Peas, Lily Allen, Jason Derulo and The Pussycat Dolls. Katy Perry even had her own expansion pack.",
    "Sims Sessions will be free to attend for all The Sims 4 players though exact details of how you get to the festival site haven't been shared yet. Sims Sessions takes place from June 29 through July 7."
  ],
  "headers": {
    "4": "Music to our ears"
  },
  "links": {}
}