{
  "source": "https://www.techradar.com/news/what-is-oled",
  "title": "What is OLED? Black levels, burn-in, and the Nintendo Switch explained",
  "category": "televisions",
  "updated": "2021-11-23T12:56:51Z",
  "author": "nick-pino",
  "summary": "You'll find OLED panels in TVs, smartphones, and the new Nintendo Switch – but what exactly is it?",
  "article": [
    "What is OLED? If you’ve spent time looking for a new TV, eyeing up the latest laptops, or reading about the new Nintendo Switch OLED, then you’ll have heard the term OLED before. But just because it’s everywhere right now, doesn’t mean it’s easy to define. So what is OLED TV tech? And, importantly, do you need to upgrade to an OLED TV?",
    "OLED stands for ‘Organic Light Emitting Diode’. Simply put, this refers to the panel that’s used inside an OLED TV. This panel displays all of the things that you can see on the screen, that’s the images, colors and light that make up your favorite movies, TV shows and games.",
    "It’s this OLED panel that makes OLED TVs stand out in comparison to all of the other types of TV technologies on the market right now, which includes CRT (cathode ray tube), LED (light-emitting diode), LCD (liquid crystal display), or QLED (quantum dot).",
    "The difference is in the organic material that OLED TVs use, which is more expensive to produce. Importantly, it also has less of a shelf life, but many argue that the benefits of OLED outweigh the expiration date.",
    "And there are many benefits. OLED TVs bring you better image quality (think blacker blacks and brighter whites), faster response times and reduced power consumption. The super fast response times are good news if you’re on the hunt for a new gaming TV.",
    "So if you’re looking to buy one of the best TVs (or any other screen-based gadget), you need to learn more about OLED because you’ll probably want to consider an OLED TV. In fact, only Samsung’s QLED TVs offer a rival to OLED – while Micro LED is promising but still has a way to go before it can compete.",
    "This guide is an OLED TV explainer, helping you to figure out how OLED works, what sets an OLED TV apart from other types and, importantly, if this TV tech is right for you.",
    "UPDATE: Black Friday 2021 kicks off on November 26 this year, but many great tech deals are already live. We expect deals to continue until at least Cyber Monday on November 29 – and possibly into early December, but don’t wait around if you find a good bargain.",
    "We’ll be hunting for all the deals on the best OLED TVs. Keep checking our Black Friday TV deals 2021 page if you want to see our pick of the best OLED TVs that have been discounted this sale season to help you figure out which to buy.",
    "This all started a few years back when engineers at companies like Samsung and Sony introduced an array of LEDs as a backlight, which meant that if a certain part of the screen was black then those LEDs behind that portion could be turned off to make it appear blacker.",
    "This is a better solution than a CCFL backlight, but it still has its problems. Since it's a light behind the LCD producing the illumination rather than the LCD layer itself, the illumination is not entirely in-sync with the pixel in front of it. The result is an effect called 'blooming', whereby LED light from bright portions of the image bleeds over into areas of blackness.",
    "This is what separates OLEDs from LCD/LED displays. In an OLED TV display, the pixels themselves are the things producing the light, and so when they need to be black they are able to turn off completely, rather than relying on a backlight to turn off on their behalf.",
    "Its OLED's self-emissive nature that helps in this regard, ensuring that 'off' pixels are actually off, creating a real black rather than a semi-convincing gray. This also means the level of contrast between bright and dark areas of the screen is massive, even 'infinite'.",
    "It's telling that Nintendo has opted for OLED for a premium step-up model of its console, even increasing the size of the screen so that you can better appreciate the new Switch's self-emissive pixels.",
    "Those pixels can also instantaneously switch between states, meaning that response times are very fast – ideal for responsive play, or for getting the edge in competitive gaming.",
    "Read more: Nintendo Switch OLED release date, price, and specs",
    "LG's rollable OLED – which unfurls out of a box, either on the floor or ceiling – has now released in South Korea, with a wider release seeming likely in 2021. New form factors like these, including even transparent panels, are forever in the works, though not all of these experimental ideas end up making it to market.",
    "There are also prototype OLED TV designs out there that have thinner, scroll-like form factors, or can be installed at the foot of a bed.",
    "Samsung is one of several TV makers looking to develop what's called QD-OLED: a new type of OLED panel that uses quantum dot emitters to improve brightness. The tech is very much in development, but when it arrives, it could meld the competing QLED and OLED technologies and render previous methods of production obsolete.",
    "Many companies and researchers are also actively working to make OLED even better and brighter. OLED TVs are notorious for their dim output, but there's promising news from researchers at the University of Michigan.",
    "A team has developed a new electrode that can 'liberate' 20% more light from respective screens at the same time as increasing energy efficiency and improving the battery life of OLED displays. Right now this only applies to portable displays – smartphones and the like – but it's a good step for TVs too.",
    "Original reporting in this article was by Jamie Carter."
  ],
  "headers": {
    "12": "What about the Nintendo Switch OLED?"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "gaming TV": "https://www.techradar.com/news/best-gaming-tv",
    "best TVs": "https://www.techradar.com/news/best-tv",
    "Micro LED": "https://www.techradar.com/news/microled-isnt-a-threat-to-oled-tvs-heres-why",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "best OLED TVs.": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Black Friday TV deals 2021": "https://www.techradar.com/black-friday/tv-deals",
    "Nintendo Switch OLED release date, price, and specs": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "transparent panels": "https://www.techradar.com/news/first-look-panasonic-transparent-oled-tv",
    "thinner, scroll-like form factors": "https://www.techradar.com/news/this-new-oled-tv-design-lets-you-watch-tv-on-the-ceiling",
    "installed at the foot of a bed": "https://www.techradar.com/news/lg-brings-its-transparent-oled-tv-to-beds-restaurants-and-public-transit-windows",
    "Samsung is one of several TV makers looking to develop what's called QD-OLED": "https://www.techradar.com/news/samsungs-take-on-oled-tvs-wont-be-here-anytime-soon",
    "a new electrode": "https://www.techradar.com/news/the-best-oled-tvs-could-get-even-brighter-heres-how",
    "smartphones": "https://www.techradar.com/news/best-phone"
  }
}