{
  "source": "https://www.techradar.com/news/best-ps-now-games",
  "title": "Best PlayStation Now games: the top PS Now games to stream or download today",
  "category": "gaming",
  "updated": "2021-04-12T15:01:22Z",
  "author": "matthew-forde",
  "summary": "The best of PS Now, right now",
  "article": [
    "Looking for the best PS Now games? Then you’ve landed on the right page. Streaming subscriptions are now in abundance, as Netflix helped pioneer the idea and sell it to households globally, making the term instantly recognizable in the mainstream populace.",
    "In the games space, though, we're still in a period of transition as developers and platform holders work out all the kinks of what works and what doesn't. Sony, for instance, has been tinkering with the idea since the beginning of 2014 via its own cloud game subscription service, PlayStation Now.",
    "While not having the immediate effect that many had hoped for, the concept of gaming on-demand or the \"Netflix of games\" is still one that millions dream of. In the meantime, though, Sony has been carefully curating a catalogue of great PS Now games to entice users to its service. With over 650 games available on PS Now, we thought it was the right time to put together a list of the best games on offer today.",
    "It's worth noting that subscribers can stream and download all PS4 and PS2 titles, however, you can only stream PS3 games at this point.",
    "Marvel’s Avengers might not have blown us away when it launched, but if you’re looking to get your Marvel fix in between episodes of Falcon and the Winter Soldier, this could be one to try on PS Now.",
    "Set in a world separate to the comics and the MCU, Marvel’s Avengers sees the team fractured after a devastating attack on San Francisco. It’s up to Kamala Khan, aka Ms. Marvel, to bring Earth’s Mightiest Heroes back together and help them defeat the evil organization known as AIM.",
    "With free DLC featuring Kate Bishop and Hawkeye now available, what better chance is there to play this Destiny-like action brawler? You have until July 5, 2021, to give it a go on PS Now.",
    "Apart from having one of the best subtitles ever, Red Faction: Guerrilla is one of the most commonly overlooked games of the PlayStation 3 era. Launched originally in 2009, the third-person shooter follows Alex Mason in the year 2125 as he attempts to overthrow the tyrannical Earth Defense Force on (you guessed it) the planet Mars.",
    "What makes the third installment in the Red Faction series so special is its focused narrative and satisfying demolition mechanics. Better still, the wastelands of Mars really emphasize that feeling of isolation and commitment that you really are on another world.",
    "Injustice 2 is the critically acclaimed sequel to Injustice: Gods Among Us, and takes everything you loved about the original and dials it up. The fighting mechanics are superb - as you would expect from genre veterans NetherRealm - and pair excellently with the cast of DC superheroes and villains.",
    "Even if you aren’t the biggest fighting game fan, the story is a blast to play through and you might find yourself gelling with one of the many characters included in the game. You’ll have a chance to live out your dreams and become famous heroes like Batman, Wonder Woman, and Flash, or you could fight as more surprising choices including Gorilla Grodd, Dr Fate, and even the Teenage Mutant Ninja Turtles.",
    "Hideo Kojima's unexpected final swansong with Metal Gear saw the creator leave in fine fashion. The Phantom Pain's refined stealth implementation makes it a joy to behold, while the freedom given allows players the chance to really think tactically about how to approach a mission.",
    "Released globally on September 1, 2015, the game shifted over five million copies before the end of the month, with many arguing it to be Kojima's best work to-date. Plus, it's pretty cool to hear Jack Bauer as the voice of Snake.",
    "OK, we're cheating here a little bit. However, it can't be understated how much of a triumph Rocksteady's Batman trilogy is, with all three titles - Arkham Asylum, Arkham City and Arkham Knight - telling an overarching story, while still solely focusing on their own comic book adventures. Each is incredible and does justice to The Dark Knight himself.",
    "But if one must be selected: the original outing - Arkham Asylum - is the perfect choice for superhero fanatics, both introducing novices to the treasure trove of Batman mythology, alongside paying homage to those that have adored the Caped Crusader for decades. Additionally, WB Games Montréal's entry into the Arkham-verse (Batman: Arkham Origins) is equally worth your time and is too available on the service.",
    "One of the newest games to PS Now, Overcooked 2 puts teamwork to the test as players must fulfill an ever-growing list of restaurant orders under increasingly farcical conditions. To add further chaos, random items can fall from the sky and platforms can move of their own accord, all while a countdown looms over Hell's Kitchen.",
    "Team17's co-op cooking simulator lets groups of up to four don the chef's hats, either via local or online play. Due to the sheer madness and hilarity that can ensue, it's highly recommended experiencing the mayhem in person.",
    "There are numerous types of people that play games, from the thrill-seekers and the RPG advocates to the trophy hunters and the social butterflies. Then you have the glutton for punishment types. Those who love a challenge and revel in being crushed only to rise and overcome anything thrown their way. Enter FromSoftware's critically heralded Bloodborne.",
    "Designed flawlessly from the ground up, the gothic world of Yharnam is brimming with dark secrets to discover and intricate combat for those willing to commit. Similar to a Dark Souls game, Bloodborne takes several traits but does more than enough to carve out its own sector. Atmospherically, it's jarring, stunning and unrivalled.",
    "The third mainline installment in the classic looter shooter series is available on PS Now until September 29, 2021. It doesn’t matter if you’ve played the games that came before or not, Borderlands 3 is still a great opportunity to see what the franchise has to offer.",
    "Set in the futuristic world of Pandora, players must fight in a cartoony, Mad Max-esque wasteland to defeat the Calypso Twins - the game’s intergalactic superstar antagonists.",
    "Filled with over-the-top weapons to obliterate your foes and a healthy serving of comedy, this game is the definition of a popcorn title - it won’t blow you away but is sure to keep you entertained for many hours.",
    "Detroit Become Human won’t be for everyone, but if you like science fiction and Life is Strange gameplay then this choose your own adventure-style game from Quantic Dream is definitely one to give a go on PS Now.",
    "Set in 2038, the advent of artificial intelligence has seen androids incorporated into many aspects of life. Playing as different robotic characters (Markus, Connor and Kara) your decisions will shape the outcome of the story and the events you see play out.",
    "Naughty Dog's crowning achievement has had every possible accolade thrust upon it at this point – and for good reason. The hopeless story of Joel and Ellie travelling across a post-apocalyptic US features an unforgettable cast, a narrative like no other, and performances from Troy Baker and Ashley Johnson at the top of their game, rounding out an experience that will be discussed about for generations to come.",
    "With The Last of Us 2 just around the corner, what better time is there than now to be introduced to two of PlayStation's biggest mascots?"
  ],
  "headers": {
    "4": "Marvel’s Avengers (available until July 5)",
    "7": "Red Faction: Guerrilla Re-Mars-tered",
    "9": "Injustice 2",
    "11": "Metal Gear Solid V: The Phantom Pain",
    "13": "Batman: Arkham Trilogy",
    "15": "Overcooked 2",
    "17": "Bloodborne",
    "19": "Borderlands 3 (available until September 29)",
    "22": "Detroit Become Human",
    "24": "The Last of Us"
  },
  "links": {
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "Marvel’s Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "glutton for punishment types": "https://www.techradar.com/best/12-cruel-unforgiving-games-to-punish-yourself-with",
    "Borderlands 3": "https://www.techradar.com/reviews/borderlands-3-review",
    "Detroit Become Human": "https://www.techradar.com/news/detroit-become-human-review-brilliant-and-flawed#:~:text=It's%20both%20brilliant%20and%20flawed,we've%20seen%20thus%20far.",
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review"
  }
}