{
  "source": "https://www.techradar.com/news/how-to-watch-the-undoing-online-stream-the-new-hbo-series-from-anywhere",
  "title": "How to watch The Undoing online: stream every episode of the miniseries anywhere now",
  "category": "computing",
  "updated": "2021-03-10T12:39:33Z",
  "author": "daniel-pateman",
  "summary": "Nicole Kidman and Hugh Grant star in explosive miniseries",
  "article": [
    "Award-winning Big Little Lies writer David E. Kelley is back with another whopping dose of deception in the form of 6-part miniseries The Undoing. Oscar-winning filmmaker Susanne Bier directs Hollywood stars Nicole Kidman and Hugh Grant - together on-screen for the first time - in one of the most, most nail-biting dramas of out right now - so read on as we explain how to watch The Undoing online and stream every episode wherever you are right now.",
    "Based on the 2014 novel by Jean Hanff Korelitz, The Undoing introduces us to Jonathan and Grace Frazer: a happily married couple living a privileged life in Manhattan with their son Henry. Grace is a thriving therapist, about to publish a self-help book entitled “You Should Have Known Better”, while Jonathan is an esteemed paediatric oncologist and devoted father.",
    "So, when the mother of a fourth grader is found bludgeoned to death and Jonathan mysteriously disappears, Grace finds herself caught up in a very public scandal, devastated to realize she may not have heeded her own advice.",
    "In addition to superstars Kidman and Grant, the cast includes Edgar Ramirez as Detective Joe Mendoza, American Horror Story’s Lily Rabe as Sylvia Steinetz, Noma Dumezweni as defence attorney Haley Fitzgerald, and Hollywood legend Donald Sutherland, playing a retired financier and Grace’s protective father.",
    "Being described like “a Scandi-Noir thriller with a massive whodunnit element”, you won’t want to miss this top-drawer drama, packed with grade-A performances and ‘I didn’t see that coming’ twists. Read on as we explain how to watch The Undoing online from anywhere.",
    "Going abroad on vacation or having to travel for work? If so, you won’t be able to access country-specific streaming services like HBO Max – or any equivalent platform – whilst you're away, due to annoying geo-blocking restrictions.",
    "Luckily, there's a simple solution. Just download a VPN to alter your IP address and connect to any VOD services you’re already paying for. This means you can bypass geo-blocks, and don’t have to worry about missing a single episode of The Undoing, wherever you are right now.",
    "Use a VPN to watch The Undoing from anywhere"
  ],
  "headers": {
    "5": "How to watch The Undoing online from outside your country",
    "8": "How to watch The Undoing online: stream every episode in Australia"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}