{
  "source": "https://www.techradar.com/news/microsoft-outlook-users-report-frustrating-search-security-keys-bugs",
  "title": "Microsoft Outlook users report frustrating search, security keys bugs",
  "category": "computing",
  "updated": "2021-09-21T15:07:17Z",
  "author": "mayank-sharma",
  "summary": "Some issues have workarounds, while others face further investigation",
  "article": [
    "Microsoft is investigating several issues with Outlook for PC that have resulted in unexpected behavior, and even causing breakage in the app’s user experience.",
    "According to the software giant, the issues are related to security keys, search results, and other aspects of the popular email client.",
    "As the company explains, some users are unable to add Gmail accounts if they rely on security keys for authentication, while others are reporting inaccurate results from Outlook Suggested Searches feature.",
    "The company has published details about the issues plaguing Outlook for PC, along with workarounds for a couple of problems, even as it investigates them along with the other issues.",
    "As Microsoft investigates the issues, it suggests users who are facing issues adding a Gmail account to Outlook while using a security key for two-step verification (2FA), can work around the issue by selecting a different multi-factor authentication mechanism.",
    "Along with the issues in search results, the second issue Microsoft has no workarounds for as of now, involves some sent messages incorrectly displaying follow-up flag status, or the app clearing a set flag without user interaction.",
    "“The Outlook team is investigating the issue and will update this article when more information is available,” reports Microsoft for both the search and the follow-up flag issues.",
    "BleepingComputer adds that Microsoft has dealt with issues related to Outlook’s search feature earlier as well.",
    "Earlier this year in July, Microsoft rolled out a fix for Outlook for Microsoft 365 that tackled issues that caused the client to crash on systems where users tried using the Search bar or Search Suggestions features.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Ongoing investigation"
  },
  "links": {
    "several issues": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4825698473659363000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Foffice%2Ffixes-or-workarounds-for-recent-issues-in-outlook-for-pc-ecf61305-f84f-4e13-bb73-95a214ac1230",
    "Outlook for PC": "https://www.techradar.com/reviews/microsoft-outlook",
    "security keys": "https://www.techradar.com/best/best-security-key",
    "email client": "https://www.techradar.com/best/best-email-clients",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-outlook-issues-with-security-keys-search/"
  }
}