{
  "source": "https://www.techradar.com/news/what-xiaomi-phones-could-we-expect-at-its-september-15-launch-event",
  "title": "What Xiaomi phones could we expect at its September 15 launch event?",
  "category": "phones",
  "updated": "2021-08-23T12:00:32Z",
  "author": "tom-bedford",
  "summary": "Mi 11T? Mi Note 11? Even Mi 12?",
  "article": [
    "Xiaomi is one of the most prolific tech companies on the world, and just weeks after it hosted a big launch event in China for some new devices, it's confirmed the date of a global unveiling event.",
    "The date to mark in your calendars is September 15, with the event happening at 5am PT / 8am ET / 1pm BST / 8pm ACT. It's curious that the date format of the above poster heavily skews towards the US region when Xiaomi's phones don't sell there.",
    "So what do we expect at this September 15 event? There are loads of Xiaomi phones and devices that it could be, but unless we're looking at a 15-hour live stream (which we're not - the company has confirmed it's 70 minutes long), it probably won't be all of them. In fact, we can narrow the list quite easily.",
    "Below, we've drawn up a list of everything Xiaomi could show off, ranked in order of how likely it is we'll see the device at the event.",
    "The Xiaomi Mi 11T is the next big phone we're expecting from the company, and it'd serve both as a successor to the Mi 10T, and as a mid-year mid-range entry to the Mi 11 family.",
    "We've heard quite a few Xiaomi Mi 11T rumors at this point, making it seem very possible the phone is coming soon - a September launch event would be almost exactly a year after the Mi 10T's unveiling so it makes sense.",
    "Rumors suggest the phone will have an under-display front camera, the Mi 11's telemacro camera, and a Pro-tier sibling too.",
    "The US date format on the Xiaomi September launch event suggests smart home appliances could be coming. Why? Because, while the company doesn't sell its mobile gadgets in the country, it actually does sell connected IoT tech.",
    "Xiaomi's US website sells things like TV sticks, air purifiers, colorful light bulbs, electric scooters, earbuds and robot toys. And while there's a lot, the company has plenty more smart gadgets on sale in other countries, which it could bring to the US.",
    "Maybe we'll see Mi TVs, fitness trackers, smartwatches, night lights or something else.",
    "Unveiled at an August event for those in China, the Xiaomi Mi Pad 5 is the company's latest Android tablet - and its first since 2018 too.",
    "While a phone which launched alongside the Mi Pad was confirmed to not be launching globally, no such comment was made about the tablet, leading people to think it could go on sale in other regions. This September event would be the perfect opportunity for Xiaomi to re-debut it, then.",
    "The tablets - there's a Pro version too - have big, high-res screens, long-lasting batteries and software tailored for the tablet experience. In China, the price is very low suggesting it could be an affordable iPad rival.",
    "The Xiaomi Mi Note 11 was expected in November 2020, and since it was a no-show, most people expected the Mi Note 10's successor to be just vaporware. But maybe not.",
    "Popular Chinese leaker Digital Chat Station recently shared information on the Mi Note 11, putting it back on the map. They say the phone has a Qualcomm Snapdragon 778G chipset, 50MP main , 13MP ultra-wide , 12MP portrait and 8MP periscope cameras, and a higher display refresh rate than the 60Hz Note 10.",
    "One rumor - even from a source like DCS - isn't much though, so while it's possible the handset will come, we're not totally sold.",
    "A curious rumor we heard recently is that the Xiaomi Mi 11 Lite, which launched in early 2021 in two distinctly different versions, could be re-released in even more editions.",
    "Only one source has said this, and if true, this would take the total number of Mi 11 Lite phones up to four. That's not the only curious thing about the leak; it also suggests that one of the cheap phones would get an under-display selfie camera.",
    "Take this all with a pinch of salt, hence the Mi 11 Lite being lowest on the list of possibilities.",
    "The Xiaomi Mi Mix 4 launched at the August event in China, alongside the Mi Pad 5. However, unlike the tablet, we don't expect it to come to other regions, a fact Xiaomi itself alluded to.",
    "The phone has an under-display front camera, a high-res main camera and a top chipset, making it sound like a solid mid-range phone.",
    "However, it's possible under-display camera tech isn't mass producible yet, or the company doesn't want competition between the medium-priced Mi Mix and anything else that launches soon in that price category, like the Mi 11T or Mi Note 11.",
    "The next premium phone we expect from the company is the Xiaomi Mi 12, and while we've started to hear rumors about the device, we wouldn't expect it in September.",
    "Xiaomi launched the Mi 11 in December 2020, with a global launch in February 2021; previously, it's unveiled the device in all regions in February of each year. So don't expect the new handset for about six more months."
  ],
  "headers": {
    "4": "Xiaomi Mi 11T",
    "7": "Xiaomi smart home gadgets",
    "10": "Xiaomi Mi Pad 5",
    "13": "Xiaomi Mi Note 11",
    "16": "Xiaomi Mi 11 Lite - again",
    "19": "Things we probably won't see",
    "22": "Xiaomi Mi 12"
  },
  "links": {
    "Xiaomi phones": "https://www.techradar.com/news/best-xiaomi-phones",
    "Xiaomi Mi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "Mi 10T": "https://www.techradar.com/reviews/xiaomi-mi-10t-pro-review",
    "Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "under-display front camera": "https://www.techradar.com/news/the-xiaomi-mi-11t-could-boast-two-innovative-upgrades-to-beat-the-iphone-13",
    "Mi 11's telemacro camera": "https://www.techradar.com/news/sounds-like-the-xiaomi-mi-11t-could-get-the-mi-11s-best-camera-feature",
    "Pro-tier sibling": "https://www.techradar.com/news/xiaomi-mi-11t-pro-edges-closer-to-launch-with-regulatory-approval",
    "Xiaomi Mi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "Xiaomi Mi Note 11": "https://www.techradar.com/news/xiaomi-mi-note-11",
    "Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review",
    "Digital Chat Station": "https://share.api.weibo.cn/share/245596107.html?weibo_id=4670764819157093",
    "Xiaomi Mi 11 Lite": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "one source has said this": "https://www.techradar.com/news/samsung-galaxy-z-fold-3s-flagship-feature-could-come-to-a-cheap-xiaomi-phone",
    "Xiaomi Mi 12": "https://www.techradar.com/news/xiaomi-mi-12"
  }
}