{
  "source": "https://www.techradar.com/news/nintendo-switch-online-app-will-lose-one-of-its-few-features-in-july",
  "title": "Nintendo Switch Online app will lose one of its few features in July",
  "category": "gaming",
  "updated": "2021-06-23T13:05:58Z",
  "author": "adam-vjestica",
  "summary": "Soon the Nintendo Switch Online app will do even less",
  "article": [
    "The Nintendo Switch Online app is set to lose one of its few features in July, which means there’s even less use for it than before.",
    "Nintendo has announced that it will discontinue the Splatoon 2 Online Lounge feature from the maligned smartphone app on July 28, 2021, which makes sense with Splatoon 3 on the horizon.",
    "However, the Online Lounge lets you send invites to friends via a URL so they can join you in private or ranked matches. Your friends would receive a notification through the Nintendo Switch Online app so they could join and use voice chat, which is still supported.",
    "Nintendo’s support page says that no other changes to game-specific services will be made to the app at this time, which means you should still be able to check your Splatoon 2 match results and make purchases from the game’s clothing and equipment stores.",
    "Still, the removal of a feature that lets you easily play with friends is disappointing, especially as Splatoon 2 makes it needlessly difficult to match up with friends.",
    "The Nintendo Switch doesn’t include a native game invite or messaging feature, either, so the Nintendo Online app was supposed to help bring the Switch’s online suite up to the standard of its competitors. Sadly, that hasn’t been the case.",
    "Only a few games have received software-specific support since the app was released. Along with Splatoon 2, the only other games that have any additional functionality through the app are Super Smash Bros. Ultimate, Mario Kart 8 Deluxe, Animal Crossing: New Horizons and the Nintendo Switch Online NES library, with the majority simply serving as a place for voice chat.",
    "Speaking of which, we’ve never found the Nintendo Switch Online app’s voice chat to be all that great, especially compared to the likes of Discord and Xbox Live.",
    "The Nintendo Switch Online app unfortunately represents another example of Nintendo dropping the ball when it comes to building a robust online infrastructure, which for a paying service in 2021 simply isn’t good enough.",
    "It’s clear that Nintendo could have made the app into something far superior to what we have today, with support all but non-existent on an app which has been downloaded millions of times. We’ll have to see if Nintendo does anything special with the app when Splatoon 3 comes out, but somehow we doubt it."
  ],
  "headers": {
    "8": "Splatted"
  },
  "links": {
    "Nintendo Switch Online app": "https://www.techradar.com/news/the-nintendo-switchs-online-app-is-now-available-on-the-ios-app-store",
    "Splatoon 2": "https://www.techradar.com/how-to/splatoon-2-tips-and-tricks",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
    "support page": "https://en-americas-support.nintendo.com/app/answers/detail/a_id/55604",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Super Smash Bros. Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review",
    "Mario Kart 8 Deluxe": "https://www.techradar.com/how-to/mario-kart-8-deluxe-tips-and-tricks",
    "Animal Crossing: New Horizons": "https://www.techradar.com/reviews/animal-crossing-new-horizons",
    "Discord": "https://www.techradar.com/reviews/discord",
    "Xbox Live": "https://www.techradar.com/news/xbox-live-gold-deals"
  }
}