{
  "source": "https://www.techradar.com/news/if-honors-magic-3-phone-wasnt-on-your-radar-this-leaked-render-should-change-that",
  "title": "If Honor's Magic 3 phone wasn't on your radar, this leaked render should change that",
  "category": "phones",
  "updated": "2021-07-19T08:21:39Z",
  "author": "tom-bedford",
  "summary": "Enough to take note",
  "article": [
    "While Honor phones have dropped off the radar over the past few years, the company is gearing up for a big comeback, and we already know its Honor Magic 3 series of handsets is launching on August 12.",
    "That might not sound like an event worth tuning in to - Honor remains untested in its new phase, and the first two Magic phones didn't launch globally - but there might be a reason to pay attention.",
    "A user of Chinese social media platform Weibo (via MyDrivers) recently leaked some information about the Honor Magic 3 and 3 Pro, including a big image of one of the phones, and it's got us sitting up in our seats.",
    "Let's start with the image, the real head-turner - apparently this is for the Honor Magic 3 Pro, and above three regular-looking camera lenses, there's one absolutely huge one. What does this cyclops' eye do? We're not certain, but the leak says the handset has a periscope lens for long-distance zooming, so it's probably that.",
    "We also see on one edge of the phone, a big volume rocker and power button... with another button on the opposite edge. This could be a Google Assistant button, notification slider, camera shutter or something else entirely.",
    "According to the leaker, both the Honor Magic 3 and Pro will come with the Snapdragon 888 Plus chipset, a processor we haven't seen in a smartphone at the time of writing.",
    "Apparently the 'standard' model will have 12GB RAM, 66W charging (both wired and wireless), two front-facing cameras as well as four rear ones and a 'waterfall' screen which curves dramatically at the edges.",
    "Then, the Pro is said to have an under-display selfie camera, 100W charging and 50W wireless powering, a 48MP main camera and a Full HD+ display, as well as the vanilla phone's chipset and RAM.",
    "Those specs make the Honor Magic 3 series sound like very impressive Android phones, especially if the specs we haven't heard are just as premium as those we have. We only have to wait until August 12 to find out the validity of this leak, so check back to TechRadar then for everything you need to know about the devices."
  ],
  "headers": {
    "5": "Honor Magic 3 specs"
  },
  "links": {
    "Honor phones": "https://www.techradar.com/news/honor-phones",
    "MyDrivers": "https://news.mydrivers.com/1/770/770220.htm",
    "with the image": "https://img1.mydrivers.com/img/20210717/6728e96f49e2438f8bb1ca17268d50b8.jpg",
    "Android phones": "https://www.techradar.com/best/best-android-phones"
  }
}