{
  "source": "https://www.techradar.com/news/gpu-voodoo-could-3dfx-really-be-coming-back-from-the-dead",
  "title": "GPU voodoo: could 3dfx really be coming back from the dead?",
  "category": "computing",
  "updated": "2021-08-05T12:12:01Z",
  "author": "matt-hanson",
  "summary": "How likely is it?",
  "article": [
    "It looks like 3dfx, or at least the people who now own the name of the retro GPU maker, is insisting that it’s coming back from the dead, releasing an ‘official’ statement that claims it is returning with “new graphics cards.”",
    "We first heard about the rumored return of 3dfx a few days ago, and we were pretty skeptical. Back in the 1990s, 3dfx was a force to be reckoned with thanks to its Voodoo graphics cards that every PC gamer wanted to have. However, by the 2000s, 3dfx’s popularity was on the wane, while competitors like Nvidia and AMD began hitting their stride.",
    "So, when a 3dfx twitter account announced that the company was coming back after 20 years, there was a lot of surprise. However, the account seems adamant that not only is the company back, but it will be releasing several devices as well, so either this is all an elaborate wind-up, or Nvidia and AMD may be facing a new competitor in the GPU market very soon.",
    "In a series of tweets, the 3dfx Interactive account explains that Jansen Products has acquired the assets of 3dfx and is “in the process of trademarking the name,” which “could take a few weeks.”",
    "It went on to say it will be “providing products for the newly-acquired 3dfx brand in smartphones, sound systems, graphics cards, appliances, hardware and much more.”",
    "In a slide posted above, the company claims it is working on the following products:",
    "While 3dfx looks set to be reviving its Voodoo 6 graphics cards, it’s also apparently branching out into new areas such as smartphones and TVs as well. In fact, according to another slide, it will invest 45% into smartphones and TVs, 45% into sound systems and just 10% into video cards. These products will apparently be shown off for “CEC 2022”. This rings a few alarm bells as CEC isn’t a technology event. Most results appear to be for the Council for Exceptional Children – hardly an appropriate place to launch new products.",
    "Of course, it could be a typo, and it meant to say CES 2022. This would be more realistic, but then it also suggests it’s a bit of a shoddy operation if typos like that are being released on press documents.",
    "Despite the new announcements, we’re still very wary of this. The GPU market is crowded enough at the moment with Nvidia and AMD ruling the roost, and Intel looking to muscle in on the discrete market by launching its own dedicated graphics card.",
    "So, any company that would like to compete would need to have a very slick operation and plenty of money to make a splash – and nothing we’ve seen so far has made us confident that that’s the case.",
    "Instead, what’s more likely – if the whole thing isn’t a hoax, of course – is that a company has bought the 3dfx brand name to put on some products in the hope that nostalgia may shift a few units. We’ve seen this happen before, and it means whatever company the new 3dfx will be, there may be little to no relation to the company it used to be.",
    "We’ve contacted 3dfx Interactive for comment.",
    "Via Hothardware"
  ],
  "headers": {
    "5": "New products?",
    "8": "Analysis: how likely is this?"
  },
  "links": {
    "we were pretty skeptical": "https://www.techradar.com/news/old-gpu-maker-3dfx-interactive-is-making-a-comeback-we-dont-think-so",
    "3dfx twitter account": "https://twitter.com/3dfxofficial/",
    "Hothardware": "https://hothardware.com/news/3dfxs-claims-that-its-comeback-is-real"
  }
}