{
  "source": "https://www.techradar.com/news/lg-v70-with-snapdragon-888-was-near-to-release",
  "title": "LG V70 with Snapdragon 888 was probably near to release",
  "category": "phones",
  "updated": "2021-04-06T08:31:37Z",
  "author": "aakash-jhaveri",
  "summary": "Too little too late",
  "article": [
    "Earlier this week, LG announced that it has quit making smartphones and that means it has cancelled upcoming devices like the LG Rollable. A new leak has suggested it wasn't the only device to be axed.",
    "According to a new leak, the company had been readying an LG V70 that sported a Qualcomm Snapdragon 888 chipset.",
    "As spotted by leaker Mukul Sharma, the LG V70 has now been listed on the AI-Benchmark website, which is a portal that tests a phone's AI capabilities across a multitude of tests before providing a score.",
    "The LG V70 - or whatever the phone would have been called when it was released - is the highest-ranked Snapdragon 888 smartphone on the list, sitting below the Huawei Mate 40 Pro's Kirin 9000 platform.",
    "The LG V70 listed here has 8GB of RAM and ran on Android 11 in its prototype stage. It may have been the company would have changed some specs, or included Android 12 software when the phone officially landed.",
    "Previous reports from Korea stated that the development of the LG V70, codenamed “Rainbow”, was halted abruptly in February, with the original market launch planned for March. If that is to be believed, the LG V70 launch was probably not too far away.",
    "Getting listed on benchmarking platforms usually means that a phone is close to being fully ready, even if its launch might be far. The LG V70 could have been the company’s first Snapdragon 888 smartphone, as the LG G9 was rumored to be a mid-range device this year.",
    "We had also been expecting an LG Velvet 2 and perhaps a successor to the LG Wing. This news from LG means we won't be seeing any of these smartphones in the wild in the future.",
    "The closure of LG’s entire mobile business unit doesn’t mean that its existing customers will be left stranded, as the company has promised service support and software updates for its current portfolio. Any remaining stock will still be available in stores and online."
  ],
  "headers": {},
  "links": {
    "quit making smartphones": "https://www.techradar.com/news/lg-has-officially-quit-making-phones-heres-whats-next",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "website": "https://ai-benchmark.com/ranking.html",
    "Huawei Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "reports": "http://it.chosun.com/site/data/html_dir/2021/02/26/2021022602300.html",
    "halted abruptly in February": "https://www.techradar.com/news/samsung-galaxy-s21-may-have-one-less-competitor-as-lg-reportedly-delays-its-next-phone"
  }
}