{
  "source": "https://www.techradar.com/news/ssd-revenues-set-for-massive-rise",
  "title": "SSD revenues set for massive rise",
  "category": "computing",
  "updated": "2021-06-15T14:41:34Z",
  "author": "mayank-sharma",
  "summary": "Global chip shortage doesn't appear to affect SSD sakes",
  "article": [
    "New industry predictions have claimed that the Solid State Drive (SSD) market will generate a staggering $51.5 billion in revenue by 2025.",
    "As per IDC’s new forecast, SSD unit shipments are predicted to increase at a compound annual growth rate (CAGR) of 7.8% between 2021 and 2025,",
    "IDCs positive growth figures are based on an increase in demand from all segments including end users, enterprise users and cloud computing service providers.",
    "\"The pandemic has accelerated the need for transformation, and worldwide demand for SSDs has increased because of this trend as both consumers and businesses have looked to take advantage of the technologies' benefits,\" said Jeff Janukowicz, research vice president, Solid State Drives and Enabling Technologies at IDC.",
    "In their breakdown of IDCs’ report, ZDNet lists some of the key factors that have led to such positive estimates.",
    "For starters, IDC notes that client SSDs are in higher demand as a result of the move towards permanent work from home and remote schooling all across the world. Surprisingly, this hasn’t had a negative impact on the use of SSDs in enterprises where demand continues to hold strong.",
    "IDC also notes that technological advancements in coming years in key areas such as NAND flash will help improve the price-performance ratio of SSD further increasing demand.",
    "Surprisingly, while the research does note that the current pricing of SSDs remains volatile and elevated, it pins this on increased demand, while completely ignoring the ongoing global chip shortage, which industry leaders believe could last several years.",
    "Another aspect that’s apparently hasn’t been looked into is the rising popularity of the Chia cryptocurrency, which demands more storage for its mining, rather than processing prowess, and has already started driving SSD prices to the north."
  ],
  "headers": {
    "4": "Growth factors"
  },
  "links": {
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "ZDNet": "https://www.zdnet.com/article/ssd-market-to-reach-51-5-billion-in-revenue-by-2025-idc/",
    "work from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "remote": "https://www.techradar.com/news/best-remote-desktop-software",
    "global chip shortage": "https://www.techradar.com/news/dell-hp-warn-pc-prices-could-rise-due-to-global-chip-shortage",
    "last several years": "https://www.techradar.com/news/even-intel-thinks-the-global-chip-shortage-could-last-years",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "demands more storage": "https://www.techradar.com/news/this-new-cryptocurrency-could-potentially-cause-an-ssd-or-hard-drive-shortage",
    "driving SSD prices to the north": "https://www.techradar.com/news/ssd-prices-could-rise-thanks-to-new-cryptocurrency-chia"
  }
}