{
  "source": "https://www.techradar.com/news/five-things-to-look-for-when-choosing-a-recruitment-agency",
  "title": "How to find a recruiter: Five things to look for when hiring and looking for places to post jobs",
  "category": "computing",
  "updated": "2021-11-19T21:12:30Z",
  "author": "mike-jennings",
  "summary": "Here are the five areas that need your focus if you want to select a top-notch recruitment agency",
  "article": [
    "Your staff are your company’s most important asset, so it’s crucial to hire the right people for your open positions – and so it makes sense to turn to recruitment agencies to get the job done correctly.",
    "A top-notch recruitment agency can use their expertise and existing contacts to deliver higher-quality candidates to your business, of course, and that’s not their only advantage.",
    "A good-quality agency can shorten your hiring process, and an agency is an ideal choice if you don’t have the requisite recruitment knowledge available in your business – or if you’re just too busy and want the time-consuming recruitment process taken out of your hands.",
    "There are plenty of reasons to choose a recruitment agency, but there are plenty of things to consider before you decide which agency is the one for you.",
    "We’ve rounded up the top five areas you need to consider when you’re choosing a recruitment agency. And if you want more help with recruitment, find out the five things you need to look for in a resume, or explore our picks of the best recruitment platforms and best job sites of 2021.",
    "A quick online search will unveil thousands of recruitment agencies that could help staff your business, but there are different types of agencies suitable for different roles. You need to consider what type of agency will be most appropriate.",
    "Unsurprisingly, you’ll find plenty of conventional agencies around that specialize in finding people for white-collar roles and middle-management positions. Drill down into this wide field, and you’ll be able to narrow down your options.",
    "Some large, traditional agencies have so many staff members and such a vast pool of talent that they can fill roles in a wide variety of industries and at varying experience levels. On the other side of the coin are smaller, boutique agencies that are dedicated to particular industries – ideal if you want a more focused search or if you need to fill a more specialized vacancy.",
    "Go beyond those traditional agencies, and you can find staffing companies that fill temporary vacancies – ideal if you need seasonal workers, staff to cover other people’s leaves of absence of people to fill contract roles.",
    "At the top of the market, you’ll find niche agencies that fill executive roles. Companies that seek talent for executive positions tend to head-hunt individuals who will be suitable for your role even if they’re not actively looking for a new job. They’ll pour more effort into finding a smaller pool of qualified candidates for crucial, high-value jobs.",
    "You don’t just need to know what kind of agency you’d like to employ – you should start the process with a clear image of what you need from an agency and your new hire.",
    "You need to have a clear picture of the job description, its roles and responsibilities, your working environment, and the salary you’re prepared to offer. You should know your positions on office and remote working, relocation costs, your organizational structure, and the kind of candidate you want to hire.",
    "Ultimately, if you can provide more pertinent information to an agency, you’ll have an easier time and better results.",
    "Once you’ve figured out what kind of agency you need then you’ve got to find the best agency for the job, and that usually means you should create a shortlist of potential candidates.",
    "Head to agency’s websites and you’ll get an instant feel for the way they work and their company culture – and that should indicate if your company can work with the agency. On an agency’s website you should also see case studies, testimonials, and evidence of previous clients, which is useful if you want to know if the agency has a good track record. Any agency you choose should also be part of professional bodies, like REC or APSCo in the UK or AFA or ARC in the US.",
    "Elsewhere, check an agency’s social media profiles to see if they’ve got a positive and active presence in the wider world.",
    "It’s not enough to head online and find out a bit more about the agencies you’re considering for your open vacancies – before you make any decision you need to talk to them, too.",
    "Interview agencies like you’d interview job candidates. By having proper conversations, you’ll get a better impression of how an agency works and if they’ll work well with your business, and you can figure out their story, background, and approach.",
    "This approach means you can get more information about how long the process should take, and if they’re flexible enough to work around your needs.",
    "At this stage you can also ask about the guarantees provided by potential agencies. Most good agencies guarantee that a new hire will stay with your company for a certain period – usually three or six months. If the new hire leaves during that period, make sure that the agency will supply a new candidate or give your company a full refund.",
    "Recruitment agencies can supply your business with the perfect candidates, but they do cost money, so consider the financial implications.",
    "Recruitment agencies tend to work on two different payment plans. Most work on a contingency basis, which means that you only pay if you hire the candidates. That gives you more control over the process, removes initial costs, and eliminates some risk – but be aware that agencies can offer candidates to other companies, too.",
    "Generally, you’ll have to pay an agency a percentage of the candidate’s salary if you make the hire. These fees tend to range from 15% to 30% of the salary, with that figure increasing with the vacancy’s seniority. Don’t be surprised if you’re asked to pay 50% for high-end roles.",
    "You can hire some agencies on a retainer. This is more expensive, because some of the recruitment cost must be paid immediately, which introduces risk. Positively, though, it means you’ll get a dedicated service from the agency. This approach is usually reserved for executive positions.",
    "Whether you want to use an agency on a contingency or retained basis, be sure of your hiring budget before you start your search.",
    "We've also featured the best HR software, best HR outsourcing services and best free job boards"
  ],
  "headers": {
    "5": "What kind of agency do you need?",
    "10": "Know what you’re looking for",
    "13": "Research the agencies",
    "16": "Interview the agencies",
    "20": "Be sure about budgets"
  },
  "links": {
    "five things you need to look for in a resume": "https://www.techradar.com/news/five-things-to-look-for-in-a-resume",
    "best recruitment platforms": "https://www.techradar.com/best/recruitment-platforms",
    "best job sites": "https://www.techradar.com/best/us-job-sites",
    "job description": "https://www.techradar.com/features/30-resources-to-find-job-description-examples",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "best HR software": "https://www.techradar.com/best/best-hr-software",
    "best HR outsourcing services": "https://www.techradar.com/best/best-hr-outsourcing",
    "best free job boards": "https://www.techradar.com/best/free-job-boards"
  }
}