{
  "source": "https://www.techradar.com/news/developers-can-now-easily-sell-their-tools-on-github-marketplace",
  "title": "Developers can now easily sell their tools on GitHub Marketplace",
  "category": "computing",
  "updated": "2021-02-05T21:32:12Z",
  "author": "anthony-spadafora",
  "summary": "GitHub is giving developers a bigger cut and simplifying the app verification process",
  "article": [
    "GitHub has announced that it has made new changes to GitHub Marketplace which will make it easier for developers to discover, share and even sell tools and solutions to help simplify and improve the process of building software.",
    "First launched back in 2017, GitHub Marketplace is home to the world's largest DevOps ecosystem and developers can use it to finds all sorts of tools, integrations and apps to make their work easier.",
    "Up until now though, developers only received 75 percent of the revenue when their apps were sold in the marketplace. To help developers thrive and profit on its platform, GitHub has announced that it will increase the take-home pay for apps sold in the marketplace to 95 percent. This means that the company will now only keep a five percent transaction fee while developers will be able to keep the rest of the money made selling their tools.",
    "In the past, before an app could be added to GitHub Marketplace, it first needed to receive a deep review of its security and functionality. However, this process can be time consuming and even stressful for developers.",
    "Now GitHub will verify an organization's identity and common-sense security precautions by validating a developer's domain with a simple DNS TXT record, validating the email address on record and requiring two-factor authentication for their GitHub organization. Developers will even be able to track an app submission's progress from their organization's profile settings in order to fix issues faster.",
    "GitHub also plans to move all of its “verified apps” to the validated publisher model and the company will update the the check mark verification badge to indicate that publishers and not apps are scrutinized.",
    "Finally, the company has made some updates to its Technology Partner Program which teaches users how to build integrations on its platform, co-market with GitHub or learn about other partner events and opportunities by creating a new resources section with helpful tips."
  ],
  "headers": {
    "3": "Simplified app verification"
  },
  "links": {
    "GitHub Marketplace": "https://www.techradar.com/news/github-can-now-squash-even-more-code-bugs-before-release",
    "DevOps": "https://www.techradar.com/news/what-is-devops",
    "GitHub": "https://www.techradar.com/news/github-super-linter-will-clean-up-all-your-code-for-good",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "resources section": "https://partner.github.com/resources"
  }
}