{
  "source": "https://www.techradar.com/news/canons-new-smb-printers-want-to-help-you-save-big-on-ink",
  "title": "Canon's new SMB printers want to help you save big on ink",
  "category": "computing",
  "updated": "2021-07-12T11:10:17Z",
  "author": "sead-fadilpasic",
  "summary": "New Canon printers reportedly capable of producing up to 3,800 sheets on 4x6’’ photo papers",
  "article": [
    "Tech giant Canon has announced several new printers oriented towards home-workers and small and medium-sized businesses (SMB).",
    "The PIXMA G670 and G570, as well as the MAXIFY GX7070 and GX607, offer high-quality color images at a low cost, while at the same time being easy to maintain and connect to other office and home electronic equipment.",
    "Canon says the PIXMA G670 and G570 are capable of producing up to 3,800 sheets on 4x6’’ photo papers, adding that they’re capable of producing a wide range of documents in a single printer.",
    "Canon also promises low-cost ink replacements and “unique power-saving” features that automatically turn the printer off after periods of inactivity. The six-ink cartridge system, instead of the usual four-color CMYK set offers high-quality photo prints that the company says can resist fading up to 200 years.",
    "Support for wireless and mobile printing, smart speakers, as well as Google Assistant and Amazon, also means that Canon promises increased productivity and less downtime for homeworkers and SMBs alike.",
    "Since the start of the pandemic, and the subsequent rush towards remote working, employees forced to stay at home to work faced a unique challenge - having access to all the tools and devices they usually used at work. Unlike computers and mobile devices, which most households nowadays have, printers are not that common.",
    "Still, very few businesses have gone fully paperless and still rely heavily on the use of printers.",
    "According to a recent report by Scanse, the average worker prints 34 pages every day. After payroll and rent, printing can be the third-highest business expense, as well. Still, Quocirca has found that more than 70 percent of 18-34-year-olds and IT decision-makers think office print is essential today and will continue to be important in the next four years."
  ],
  "headers": {
    "5": "Home office printers"
  },
  "links": {
    "new printers": "https://www.techradar.com/best/best-small-business-printers"
  }
}