{
  "source": "https://www.techradar.com/news/borderlands-tiny-tina-is-finally-getting-her-own-game-with-a-star-studded-cast",
  "title": "Borderland's Tiny Tina is finally getting her own game – with a star-studded cast",
  "category": "gaming",
  "updated": "2021-06-10T18:22:13Z",
  "author": "adam-vjestica",
  "summary": "And Butt Stallion returns",
  "article": [
    "Gearbox Software has revealed a new game during Summer Game Fest Kickoff Live! called Tiny Tina’s Wonderlands, and it’s coming in 2022.",
    "The game is an all-new fantasy-fueled adventure set in a spin-off world of the Borderlands series. The game is an epic high fantasy take on the looter shooter genre, and inspired by Borderlands 2 DLC - Assault on Dragon’s Keep. It's a full standalone experience, though, and includes four-player co-op and endgame content.",
    "For starters, there will be spell-casting, and then you’ll be able to customize your character. The game will also feature a star-studded voice cast, including Andy Samberg (Brooklyn 99) as Captain Valentine, Wanda Sykes (Monster-in-Law) as Frette the robot, Ashly Burch as Tiny Tina, and Will Arnett (BoJack Horseman) as the Dragon Lord.",
    "You'll be tasked with defeating the tyrannical Dragon Lord, as you loot, shoot, slash and cast your way through treasure-filled dungeons full of menacing monsters. Tiny Tina plays as the world's dungeon master, and will change the rules of the game on the fly and guides players on their journey.",
    "Gearbox founder Randy Pitchford said Tiny Tina’s Wonderlands has been in and out of development for over 10 years. “For me, bringing actual Borderlands guns to fight dragons, skeletons, goblins, and more in an original fantasy world imagined by the galaxy’s deadliest thirteen-year-old, Tiny Tina, as a new, full-featured AAA video game is a dream come true,” said Pitchford.",
    "Tiny Tina's Wonderlands is coming to PS4, PS5, Xbox One, Xbox Series X/S and PC in 2022."
  ],
  "headers": {},
  "links": {
    "Summer Game Fest Kickoff Live!": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know",
    "Borderlands": "https://www.techradar.com/news/borderlands-movie-cast-likely-release-date-and-what-we-know-so-far",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}