{
  "source": "https://www.techradar.com/news/foldable-phones-may-soon-have-their-biggest-issue-solved",
  "title": "Foldable phones may soon have their biggest issue solved",
  "category": "phones",
  "updated": "2021-09-08T09:55:02Z",
  "author": "james-rogerson",
  "summary": "No more creases",
  "article": [
    "Foldable phones have come a long way in the few years they’ve been around, with the Samsung Galaxy Z Fold 3 being a truly great handset. But they still face two significant issues: price, and the dreaded crease, the latter of which may soon be solved.",
    "LG Chem has unveiled a ‘Real Folding Window’ material which is designed for foldable screens. This would sit on top of the pixels, in much the same way as Samsung’s Ultra-Thin Glass (UTG) does on its current foldables.",
    "But while Samsung’s solution is designed with strength in mind, LG’s could apparently eliminate the crease in the screen where it folds.",
    "But it doesn’t sound like the company has sacrificed durability to achieve this, as it claims that there might not even be a need for polyethylene terephthalate (PET) on top – this is a material that’s used on other foldables to protect the screen.",
    "So it sounds like LG Chem’s Real Folding Window is the best of both worlds, with the company promising that it’s as hard as glass but as flexible as plastic. And if this material really can eliminate creases in the center of foldable screens too, then it should be a huge step up from what we’re seeing now.",
    "The crease in foldable phones is something that can largely be ignored or even forgotten about, fading into the background of your mind much like punch-hole cameras do after you’ve used a phone with one for a while, but it’s still not ideal. In fact it’s quite a lot more noticeable than a punch-hole camera, as it runs down the length of the fold.",
    "So while it’s something most people can live with, avoiding it could make a big difference to the attractiveness of the screen, and remove a potential source of distraction, which isn’t something anyone wants with their expensive smartphone purchase.",
    "After that, it’s really just the price that needs addressing, and Samsung already seems to be working on that, with prices gradually dropping.",
    "Of course, it remains to be seen how soon we’ll see LG’s tech in a foldable phone, especially as Samsung – the biggest player in the space – might be reluctant to switch from its own display tech, but hopefully this upgrade will happen sooner rather than later.",
    "Via SlashGear"
  ],
  "headers": {
    "5": "Analysis: no crease is a big deal"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "unveiled a ‘Real Folding Window’": "https://www.lgchem.com/company/information-center/press-release/news-detail-8713?lang=en_GLOBAL",
    "SlashGear": "https://www.slashgear.com/lg-real-folding-window-display-cover-promises-to-make-creases-disappear-07689978/"
  }
}