{
  "source": "https://www.techradar.com/news/hellblade-2-sounds-like-it-wont-be-coming-to-xbox-series-x-for-a-while-heres-why",
  "title": "Hellblade 2 sounds like it won’t be coming to Xbox Series X for a while – here's why",
  "category": "gaming",
  "updated": "2021-06-18T09:55:07Z",
  "author": "hamish-hector",
  "summary": "Are we looking at a 2023 release?",
  "article": [
    "Hellblade 2 could still be in development for a while longer according to new comments from its studio Ninja Theory. While no release date has been announced, some were hoping we may see the game in 2022. Unfortunately, those hopes may have just been dashed.",
    "The comments were made in a development update released on Ninja Theory’s YouTube channel. In it, Tameem Antoniades, Ninja Theory founder and chief design director, said the team is currently building \"a good chunky slice of the game before we then move into full production to build out the rest.\"",
    "While the video did go on to show snippets of what Ninja Theory has been working on (and it's a lot), the idea that even a slice of the game hasn’t yet been completed indicates that a full release for the Xbox and PC exclusive is still some time away. What this means in terms of a release date for Hellblade 2 is yet to be seen, but we wouldn’t expect to play anything before late 2022, if not 2023 and beyond.",
    "Hellblade 2 was announced back in December 2019, and it seems like development is a little on the slow side if Ninja Theory is still working on the first slice of the game. So why might development be taking so long?",
    "For one, the announcement of Hellblade 2 came not too long before the UK (the country where Ninja Theory is based) started to feel the impact of Covid-19 restrictions. As with many other studios, work-from-home orders have likely caused delays at Ninja Theory as the team shifted its approach to fit the new working environment.",
    "Another factor to remember is that Ninja Theory has two other games in development too, Project Mara and The Insight Project. The team’s size is only 120 people (according to numbers released back in 2020) and while more people have likely joined since then, that still isn’t a lot of people to work on all those titles. Because of that, we can expect development may take a little longer than a typical AAA studio, where 100s of people can be devoted to just one project at a time.",
    "Finally, development could be taking a while because Ninja Theory likely wants to make sure Hellblade 2 is done right. Hellblade: Senua’s Sacrifice was a hit because of how well crafted the experience was, and how excellently its tough subject matter was handled. Fans will expect a lot from the sequel and Ninja Theory won’t want to disappoint.",
    "If we have to wait until 2023 or beyond for Hellblade 2 to release that won’t be the end of the world. Ninja Theory should take all the time they need – we’d definitely prefer that to another Cyberpunk 2077-esque fiasco."
  ],
  "headers": {
    "3": "Analysis: Why is Hellblade 2 taking so long?"
  },
  "links": {
    "Hellblade 2": "https://www.techradar.com/news/senuas-saga-hellblade-2-release-date-trailers-news-and-rumors",
    "Ninja Theory’s YouTube channel": "https://www.youtube.com/watch?v=rWoySrKxPlI",
    "Hellblade: Senua’s Sacrifice": "https://www.techradar.com/news/hellblade-senuas-sacrifice-is-coming-to-xbox-with-one-x-enhancements",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}