{
  "source": "https://www.techradar.com/news/dashlane-launches-new-free-service-to-help-smbs-identify-security-risks",
  "title": "Dashlane launches new free service to help SMBs identify security risks",
  "category": "computing",
  "updated": "2021-09-21T17:38:13Z",
  "author": "anthony-spadafora",
  "summary": "Easily see if company data has been exposed or compromised",
  "article": [
    "Dashlane has launched a new website designed to help businesses of all sizes identify cybersecurity issues, avoid costly security mistakes and quickly take action to address them.",
    "The password management company's new site is called BusinessBreachReport.com and organizations can easily use it to gain instant visibility into their cybersecurity posture.",
    "To get started, interested users simply need to enter an email address with a company domain and follow the verification process. From here, Dashlane's new site then produces an executive summary which shows the organizations security report card that includes the number of emails, breached passwords and additional vulnerabilities associated with that email address.",
    "However, the company is also sweetening the deal by giving anyone who uses BusinessBreachReport.com a free trial of Dashlane Team or Dashlane Business.",
    "Gaining additional visibility into a company's cybersecurity practices can be the key to preventing cyberattacks and data breaches. At the same time, 80 percent of breaches are caused by weak, reused or stolen employee passwords, according to a report from Verizon.",
    "With the launch of BusinessBreachReport.com, Dashlane now makes it simple for organizations to take preventative action regardless of whether or not they have an internal security lead.",
    "Dashlane CEO, JD Sherman provided further insight on why the company decided to launch its new security tool in a press release, saying:",
    "\"SaaS companies are overwhelmingly focused on providing complex tools for the enterprise, but breaches have a much bigger impact on small- and medium-sized businesses. The launch of BusinessBreachReport.com is a continuation of our efforts to educate and encourage individuals and businesses alike to secure their data and take actionable next steps to improve their online security. Unfortunately, it's likely not long until we see the next headline about a data breach or hack. We hope businesses turn to BusinessBreachReport.com for trusted information on the security of their accounts.\""
  ],
  "headers": {
    "4": "Gaining visibility for free"
  },
  "links": {
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "password management": "https://www.techradar.com/best/business-password-management-software",
    "breached passwords": "https://www.techradar.com/news/data-breach-victims-arent-changing-their-passwords",
    "Dashlane Team or Dashlane Business": "https://www.techradar.com/news/dashlane-targets-businesses-with-new-password-manager-features",
    "data breaches": "https://www.techradar.com/news/90-percent-of-data-breaches-are-caused-by-human-error",
    "a report": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1861135547956667400/https://www.verizon.com/business/resources/reports/dbir/",
    "Verizon": "https://www.techradar.com/news/verizon-claims-its-new-vpn-can-withstand-attacks-from-quantum-computers",
    "press release": "https://www.prnewswire.com/news-releases/dashlane-launches-businessbreachreportcom-to-help-businesses-identify-security-issues-and-take-action-301381277.html"
  }
}