{
  "source": "https://www.techradar.com/news/microsoft-office-365-is-getting-a-handy-upgrade-that-will-streamline-your-workflow",
  "title": "Microsoft Office 365 is getting a handy upgrade that will streamline your workflow",
  "category": "computing",
  "updated": "2021-05-07T21:04:03Z",
  "author": "anthony-spadafora",
  "summary": "Office apps will soon display a list of recommended files as a set of cards",
  "article": [
    "Keeping track of your files in Microsoft Office 365 is about to get a whole lot easier as the software giant is currently working on a new upgrade for the service which will arrive later this year.",
    "The days of storing files locally on your Windows 10 PC have come and gone as more businesses have moved their workloads to the cloud. At the same time though, Microsoft and other organizations have moved to a SaaS business model to distribute their software.",
    "While being able to share documents using online collaboration software has led to increased productivity, it's often difficult keeping track of who shared what with who and when a particular file was shared. Thankfully, Microsoft is planning to add a new list of recommended files to the start page of its office software to place files, comments, mentions and edits front and center during your workday.",
    "Beginning in June of this year, Microsoft Office 365 will display a list of recommended files on the File tab, or start page, of Word, Excel and PowerPoint on Windows according to a new update on the company's Microsoft 365 Roadmap.",
    "This list will allow users to keep track of their work and the work of others so that they can quickly access the edits, mentions and comments of their co-workers on shared files.",
    "If you're wondering how Microsoft Office 365 will populate this list, Microsoft revealed that it will use machine learning to predict which files you're most likely to want to work on next. These files will then be presented as a set of cards that you can choose from. For each recommended file, Office 365 users will see a card with a thumbnail of the file, information about what kind of activity has recently happened with that file and when that activity occurred.",
    "This upgrade is currently in development but it is scheduled to roll out worldwide beginning in June at which time Microsoft will likely provide more information on this feature and how it works."
  ],
  "headers": {
    "3": "Recommended files"
  },
  "links": {
    "Microsoft Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "online collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "office software": "https://www.techradar.com/best/free-office-software",
    "new update": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1009584626227290500&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D72233",
    "Microsoft 365 Roadmap": "https://www.techradar.com/news/microsoft-exchange-follows-in-gmails-footsteps-with-important-phishing-protection-feature",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning"
  }
}