{
  "source": "https://www.techradar.com/news/cheap-garmin-deal-get-dollar100-off-the-super-tough-garmin-instinct",
  "title": "Cheap Garmin deal: get $100 off the super-tough Garmin Instinct",
  "category": "fitness",
  "updated": "2021-03-18T09:49:57Z",
  "author": "cat-ellis",
  "summary": "Grab the Garmin Instinct for under $200 at Amazon",
  "article": [
    "The Garmin Instinct Solar is just $194.94 at Amazon right now – a saving of over $100 off the regular asking price. We rarely see the Instinct drop below $200, so this is a great opportunity to grab one of the best running watches around.",
    "This deal applies to the light gray Tundra colorway. The other designs are discounted too, but not as steeply.",
    "If you're not in the US, scroll down for the best Garmin Instinct deals near you.",
    "The Instinct is one of the best Garmin watches around, with on-board GPS, a wide range of activity tracking modes, all-day stress monitoring, and a cleverly designed dual-screen interface that makes finding and tweaking its many options a piece of cake, even on the move.",
    "When we reviewed the Solar edition, we were also impressed by its accurate heart rate monitoring, sleep tracking metrics, and tough build. This standard Garmin Instinct doesn't have the Power Glass that helps keep the Instinct Solar's battery topped up, but its screen is made from tougher Gorilla Glass that's more resistant to scratches.",
    "If you're outside the US, we've rounded up the best Garmin Instinct deals for you, right here."
  ],
  "headers": {},
  "links": {
    "The Garmin Instinct Solar is just $194.94 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07H56PBHG%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6416542739706991000-20",
    "best running watches": "https://www.techradar.com/best/running-watches",
    "best Garmin watches": "https://www.techradar.com/best/garmin-watch",
    "When we reviewed the Solar edition": "https://www.techradar.com/reviews/garmin-instinct-solar"
  }
}