{
  "source": "https://www.techradar.com/news/thinking-about-building-your-first-pc-dont-buy-a-gaming-laptop-instead",
  "title": "Thinking about building your first PC? Don't – buy a gaming laptop instead",
  "category": "computing",
  "updated": "2021-04-17T17:00:59Z",
  "author": "jess-weatherbed",
  "summary": "Pay and play now rather than waiting",
  "article": [
    "If you're present on any online computing or gaming forums then I'll bet you've seen messages from newcomers to the hobby asking for advice on their first PC build. Historically this would result in a slew of advice from all sides on the best components for every budget, where to look for some great deals and general installation tips, and being a part of that felt usually felt like being a part of a welcome community (excluding the weird elitists). Over the past six months those usually helpful responses will have likely changed to something more along the lines of \"good luck\". For anyone unaware, we're currently experiencing a stock shortage of graphics cards and high-end processors that have made it almost impossible for everyday folk to get their hands on the hardware needed to build or upgrade their computers. For whatever reason though, in these forums and social media threads full of frustration surrounding unavailable inventory I never see people discussing gaming laptops as an alternative option. Yes, it isn't the best choice for everyone but as someone who frequently gets to put both laptops and desktops through their paces, anyone dismissing gaming laptops in 2021 is missing a beat. Given AMD hasn't yet released its Radeon 6000 series as mobile GPUs yet, I'll focus on the tech I've actually used and tested out. I look forward to getting my hands on some of Team Red's offerings in the future, but the recent releases by Nvidia with the latest RTX 3000 Ampere hardware have, frankly, blown me away and washed away some previous stigma I had about purchasing a gaming laptop.",
    "I'm not trying to erase that the desktop vs laptop argument will have a clear winner depending on your circumstances, but a lot of this is made with the assumption that you can simply head out to the store and buy what you need with little difficulty, and at the manufacturer's recommended price at that. We live in a weird world right now, and the argument to \"wait for the next generation of hardware before you upgrade\" has been going for years. Due to a combination of the global silicon shortage reducing production, scalpers using bots to buy up available stock to resell and massively inflated prices and the ongoing cryptocurrency boom motivating cryptominers to buy up gaming cards to build huge mining farms, people have been unsuccessfully trying to buy hardware for months and this doesn't look like it's going to get easier any time soon. Meanwhile, I've found the mobile versions of this highly sought-after tech readily available in various branded gaming laptops across sites like Amazon, Best Buy and other regional stores for the UK and Australia. There is the argument that a desktop is a better choice given how easy it is to upgrade the components at a later date, which is presumably fine when stock appears on the shelves again. This is completely valid, and given how difficult it can be to make upgrades to a gaming laptop this is potentially a better 'future-proofing' choice. A gaming laptop is also an expensive purchase, so I do appreciate its easy for me to say \"buy this for $2,000 instead of a GeForce RTX 3070 GPU with a suggested retail price of $500\", but the current climate doesn't actually make that choice very clear right now. Due to scalpers and retailers inflating prices due to demand, it's highly unlikely you'll find your desired graphics card at the price Nvidia set as guidance. If you're looking to make major upgrades on your desktop system beyond just the GPU, or just getting started in the world of PC gaming then you may be happier buying a new Nvidia Ampere gaming laptop now than waiting around for the parts to build a computer – and the cost will likely be negligible, especially counting in the cost of a monitor and keyboard.",
    "Without beating around the bush, yes. But in practice it's not going to make a huge amount of difference unless you're looking to build something outrageous like a GeForce RTX 3090 with the most powerful Intel or AMD Ryzen CPU available for your system, especially if you mostly play online titles that prioritize framerates over breathtaking graphics. We frequently review and test gaming hardware and devices, and we're rarely disappointed by the high-end laptop offerings. Products like the Gigabyte Aorus 17G or the Alienware m17 R4 handled literally everything we threw at them with satisfying framerates and great performance in everything from competitive FPS titles like Apex Legends and Fortnite to graphically intense behemoths like Cyberpunk 2077 and Assasins Creed Valhalla. And yes, those devices are expensive, but even the cheaper offering such as the Asus TUF Dash F15 (available for as little as $1,099 / £999, around AU$1,400) comes with features like ray tracing, a 144Hz display and next-gen hardware. This makes gaming laptops the perfect choice for students or commuting workers who are frequently on the move and may not have the spare cash to splurge on a separate machine for work and play. Many of the releases we saw announced at this year's CES 2021 have adopted a 'hybrid' aesthetic that looks sleek and professional, incorporating some blingy gamer RGB lights that can be switched off during working hours.",
    "Yes, these features are still included in GeForce RTX graphics cards across desktop and mobile, so you're not missing out on anything if you do choose to go the laptop route. For the unfamiliar, DLSS stands for 'deep learning super sampling' and is Nvidias AI-powered framerate booster. That's massively simplifying what it is, but this feature has been hailed as a way to 'futureproof' hardware that would typically struggle with demanding tasks such as graphics upscaling. A demanding game may manage medium settings at a playable framerate, but when you enable the DLSS feature you can scale up the graphics to high without sacrificing any precious FPS. This makes it the perfect companion for RTX games given the criticisms around ray tracing. The results can be breathtaking – as I found myself when playing Minecraft RTX – but often at the cost of sacrificing framerate. With DLSS, you can simply scale this back up and enjoy the best of both worlds. And that's not all the help from artificial intelligence you'd be getting to help optimize your games if you use Nvidia-powered gaming laptops. Dynamic Boost 2.0 detects where power needs to be prioritized between your GPU and CPU, shifting the demand between them as required, which not only also helps to improve overall performance in your games, but also ensures you're getting optimal power efficiency too. Another AI-based tech is Whisper Mode 2.0 that helps to communicate your chosen minimum framerate to the laptop's hardware, matching the temperature and fan speeds. In short, the device will only ever be as loud as it needs to be, rather than switching between 'fans off' and 'small jet taking off when you open Steam'. The result is usually a surprisingly quiet device outside of running very demanding programs, so if fan noise was going to be an issue for anyone living in a shared space then you could certainly benefit from this.",
    "Yup, that too. You get some of these laptops with up to a 300Hz display, and 144Hz is common across the board, so anyone who mostly plays ranked esports games will appreciate that you can take a laptop to local events (remember those?) without cramming your desktop setup into a vehicle or train. On the topic of esports, there's also Nvidia Reflex – a feature that reduces latency in games like Rust, Valorant and Fortnite to make the period between you clicking a mouse button or tapping a keyboard, to the game on your screen responding as fast as it can possibly be. This will make very little difference to anyone who isn't an absolute boss at competitive online titles like the above, but the pros optimize this stuff for a reason. Even a few microseconds can be the difference between winning or losing. I'm far from a diamond rank in anything, being the typical runt who has to be carried through most FPS titles (my comforts lay in MMO and RPG titles), but even I can see the difference in all of these features, especially compared to older hardware. My personal desktop PC until recently had an Intel i7-7700K CPU and a GeForce GTX 1070 Ti GPU, still a respectable build even by today's demanding AAA standards. But every new gaming laptop I've tested against that rig completely wiped the floor with it. Loading times were cut in half, games look beautifully crisp and shiny running RTX and DLSS, and the 144Hz / 300Hz displays were a clear difference against my own 60Hz display. A few even had built-in mechanical keyboards that were a significant improvement over the usual designs, so all you'd need is a decent gaming mouse and you're good to go. If you're looking to make some serious upgrades to your own system, or starting from scratch then I'd heartily suggest looking into gaming laptops rather than racing against others to buy desktop hardware in the current shortage. Desktop PC's will always have their place at the top of the food chain, but until people can actually get their hands on components at a reasonable price, you'll have just as much fun playing games on a powerful gaming laptop."
  ],
  "headers": {
    "1": "But a desktop PC is cheaper/upgradable/etc...",
    "2": "Okay, but laptops are less powerful right?",
    "3": "Will I still have ray tracing and DLSS?",
    "4": "Anything that'll give me the edge?"
  },
  "links": {
    "PC build": "https://www.techradar.com/how-to/how-to-build-a-pc",
    "stock shortage": "https://www.techradar.com/news/even-nvidia-doesnt-think-youll-get-an-rtx-3080-this-year",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "processors": "https://www.techradar.com/news/best-processors",
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Radeon 6000 series as mobile GPU": "https://www.techradar.com/news/powerful-all-amd-gaming-laptops-are-on-the-horizon",
    "RTX 3000 Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "global silicon shortage": "https://www.techradar.com/news/the-global-chip-shortage-could-finally-be-coming-to-an-end",
    "scalpers using bots to buy up available stock": "https://www.techradar.com/news/whats-the-point-of-releasing-new-gpus-if-nobody-can-actually-buy-them",
    "cryptominers to buy up gaming cards": "https://www.techradar.com/news/sorry-cryptominers-new-geforce-rtx-3080s-rtx-3090s-may-get-mining-limiters",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fs%3Fk%3Drtx%2B3070%2Blaptop%26rh%3Dn%253A565108%252Cp_n_feature_seven_browse-bin%253A18107822011%26dc%26crid%3D34CD8OJT6CAH5%26qid%3D1618658044%26rnid%3D3012494011%26sprefix%3Drtx%2B3070%252Caps%252C237%26ref%3Dsr_nr_p_n_feature_seven_browse-bin_4%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9953440164122980000-20",
    "Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-6962653466130332000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fpc-gaming%2Fgaming-laptops%2Fpcmcat287600050003.c%3Fid%3Dpcmcat287600050003%26qp%3Dgraphicscardsv_facet%253DVideo%2520Card~NVIDIA%2520GeForce%2520RTX%25203060%255Egraphicscardsv_facet%253DVideo%2520Card~NVIDIA%2520GeForce%2520RTX%25203070%255Egraphicscardsv_facet%253DVideo%2520Card~NVIDIA%2520GeForce%2520RTX%25203080&article_name=Thinking%20about%20building%20your%20first%20PC%3F%20Don't%20%E2%80%93%20buy%20a%20gaming%20laptop%20instead&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthinking-about-building-your-first-pc-dont-buy-a-gaming-laptop-instead",
    "inflating prices due to demand": "https://www.techradar.com/news/current-nvidia-rtx-3000-gpu-prices-are-so-much-worse-than-we-thought",
    "GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Intel or AMD Ryzen": "https://www.techradar.com/news/amd-vs-intel",
    "Gigabyte Aorus 17G": "https://www.techradar.com/reviews/gigabyte-aorus-17g-2021",
    "Alienware m17 R4": "https://www.techradar.com/reviews/alienware-m17-r4-2021",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Assasins Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "Asus TUF Dash F15": "https://www.techradar.com/reviews/asus-tuf-dash-f15",
    "CES 2021": "https://www.techradar.com/news/the-best-gaming-laptops-of-ces-2021",
    "GeForce RTX graphics cards": "https://www.techradar.com/news/ray-tracing",
    "playing Minecraft RTX": "https://www.techradar.com/news/i-thought-minecraft-rtx-was-a-gimmick-and-then-i-played-the-damn-thing",
    "Valorant": "https://www.techradar.com/how-to/how-to-get-a-valorant-beta-key",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "mechanical keyboards": "https://www.techradar.com/news/best-mechanical-keyboards",
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse"
  }
}