{
  "source": "https://www.techradar.com/news/aws-still-leads-global-cloud-market-despite-azure-surge",
  "title": "AWS still leads global cloud market despite Azure surge",
  "category": "computing",
  "updated": "2021-05-04T20:07:24Z",
  "author": "anthony-spadafora",
  "summary": "Azure grew by 50 percent for the third consecutive quarter during Q1",
  "article": [
    "Amazon's cloud computing unit AWS remained the leading cloud service provider during the first quarter of this year despite the continued growth of Microsoft Azure according to a new report from Canalys.",
    "The market analyst firm revealed that cloud infrastructure services spending grew by 35 percent to reach $41.8bn during Q1, marking the first time ever that customer spending on cloud computing services exceeded $40bn a quarter.",
    "In its new report, Canalys explained that the acceleration of digital transformation efforts over the last 12 months combined with the rebound in some economies led to this massive increase in spending as enterprise customers became more confident in committing to multi-year contracts.",
    "AWS grew by 32 percent on an annual basis to account for 32 percent of all spending on cloud services during the first quarter. So far this year, the cloud giant announced new CloudFront edge locations in Croatia and Indonesia, extended its Wavelength Zones for 5G networks to Japan and across the US and launched new EX2 X2gd instances based on its Graviton 2 CPU designed for memory-intensive workloads.",
    "Although AWS is still the leading cloud service provider, Microsoft Azure grew by 50 percent for the third consecutive quarter taking 19 percent of the total cloud market share in the first quarter of 2021.",
    "Azure's continued growth was boosted by cloud consumption and longer-term customer commitments enabled by investments in Azure Arc for hybrid-IT control plane management, Azure Synapse for data analytics and AI as a platform, according to Canalys. Microsoft also introduced new industry clouds for financial services, manufacturing and non-profit organizations during Q1.",
    "Google Cloud on the other hand came in third place during the first quarter and its business grew by 56 percent to account for a seven percent market share.",
    "Research analyst at Canalys, Blake Murray explained in a press release why cloud spending has continued to increase among organizations so far this year, saying:",
    "“Cloud emerged as a winner across all sectors over the last year, basically since the start of the COVID-19 pandemic and the implementation of lockdowns. Organizations depended on digital services and being online to maintain operations and adapt to the unfolding situation. Though 2020 saw large-scale cloud infrastructure spending, most enterprise workloads have not yet transitioned to the cloud. Migration and cloud spend will continue as customer confidence rises during 2021. Large projects that were postponed last year will resurface, while new use cases will expand the addressable market.”",
    "Via MSPoweruser"
  ],
  "headers": {
    "4": "Azure surge"
  },
  "links": {
    "AWS": "https://www.techradar.com/news/aws",
    "Canalys": "https://www.techradar.com/news/more-files-were-hacked-in-2020-than-the-previous-15-years-combined",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation",
    "CloudFront": "https://www.techradar.com/reviews/amazon-cloudfront",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "EX2 X2gd instances": "https://www.techradar.com/news/aws-launches-new-graviton2-powered-ec2-instances",
    "Microsoft Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "Azure Arc": "https://www.techradar.com/news/azure-arc-lets-microsoft-cloud-run-on-aws-and-google-cloud",
    "Azure Synapse": "https://www.techradar.com/news/microsofts-new-analytics-tools-help-you-keep-track-of-all-your-business-data",
    "industry clouds": "https://www.techradar.com/news/microsoft-unveils-new-cloud-platforms-focused-on-industry",
    "Google Cloud": "https://www.techradar.com/news/google-cloud-is-majorly-upping-its-security-game",
    "press release": "https://www.canalys.com/newsroom/global-cloud-market-Q121",
    "MSPoweruser": "https://mspoweruser.com/microsoft-azure-amazon-aws-cloud-market-share/"
  }
}