{
  "source": "https://www.techradar.com/news/xbox-live-gets-renamed-by-microsoft-heres-the-confusing-change",
  "title": "Xbox Live gets renamed by Microsoft – but it isn't going away",
  "category": "gaming",
  "updated": "2021-03-23T11:29:22Z",
  "author": "david-lumb",
  "summary": "Update: Xbox Live isn't going away just yet",
  "article": [
    "Update: In a statement to Eurogamer, Microsoft has clarified the future of Xbox Live and why the new Xbox network name came about. It said that \"Xbox Live isn't going away\" and that the change was made to \"create a simpler, more descriptive messaging system for Xbox in different areas\". Microsoft also said that \"none of these experiences or features will changes as part of these updates\", which means Xbox Live might not be going anywhere after all.",
    "18 years after launching Xbox Live, Microsoft has officially renamed it to Xbox network. Apparently, this is a careful rebranding of the actual service to further separate it from the similarly-named memberships.",
    "“’Xbox network’ refers to the underlying Xbox online service, which was updated in the Microsoft Services Agreement,” a Microsoft spokesperson told The Verge in a statement . “The update from ‘Xbox Live’ to ‘Xbox network’ is intended to distinguish the underlying service from Xbox Live Gold memberships.”",
    "In other words, nothing is expected to change with how players use the now-named Xbox network – it's just going forward with a different name, which is reflected in console menus. If you were going to save screenshots or footage on Xbox Live, it'll be saved to Xbox network instead. This change was quietly rolled out, leading to a bit of confusion, as tweeted by The Verge's Tom Warren – but mechanically, nothing should change.",
    "There were whispers back in August that Microsoft was rebranding Xbox Live and potentially make changes to the Xbox Live Gold membership, per The Verge. The company denied it at the time despite curious alterations in the Microsoft services agreement renaming it to 'Xbox online service.'",
    "Then Microsoft surprise-hiked the price of Xbox Live Gold in January, but after backlash immediately abandoned the plan a day later. In an even greater mea culpa, Microsoft promised that free-to-play games like Fortnite would be made free in the coming months – no Xbox Live Gold membership required."
  ],
  "headers": {
    "4": "A smaller change than expected"
  },
  "links": {
    "Eurogamer": "https://www.eurogamer.net/articles/2021-03-22-xbox-live-officially-rebranded-to-xbox-network",
    "Microsoft Services Agreement": "https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fservicesagreement&data=04%7C01%7Calexis.crofts%40assemblyinc.com%7C094de9662ca64e088b0208d8ed5e29c2%7Cb824bfb3918e43c2bb1cdcc1ba40a82b%7C0%7C0%7C637520336003048746%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=Bp37ZUQU5G%2BIyqTGXisJA%2BfmuchnPzK%2F31zNfvmSTmE%3D&reserved=0",
    "The Verge": "https://www.theverge.com/2020/8/5/21355756/microsoft-xbox-live-rename-gold-free-rumors",
    "services agreement": "https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fservicesagreement&data=04%7C01%7Calexis.crofts%40assemblyinc.com%7C094de9662ca64e088b0208d8ed5e29c2%7Cb824bfb3918e43c2bb1cdcc1ba40a82b%7C0%7C0%7C637520336003048746%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=Bp37ZUQU5G%2BIyqTGXisJA%2BfmuchnPzK%2F31zNfvmSTmE%3D&reserved=0",
    "price": "https://www.techradar.com/news/xbox-live-gold-just-got-a-lot-more-expensive-heres-what-you-need-to-know",
    "abandoned": "https://www.techradar.com/news/that-xbox-live-gold-subscription-price-hike-isnt-happening-after-all"
  }
}