{
  "source": "https://www.techradar.com/news/apple-is-bringing-shareable-health-reports-to-ios-15-but-how-will-they-work",
  "title": "Apple is bringing shareable health reports to iOS 15 – but how will they work?",
  "category": "fitness",
  "updated": "2021-06-08T16:01:44Z",
  "author": "cat-ellis",
  "summary": "Sharing is caring",
  "article": [
    "At WWDC 2021, Apple revealed its plans to shake up the Health app. Some of these updates will be small, like the addition of new profiles for t'ai chi and pilates, but there's also one big change on the horizon: the ability to share key health data with other people.",
    "The Health app is a one-stop shop for all your fitness and wellbeing data, including heart rate, step counts, sleep data, and much more. When iOS 15 rolls out later this year, you'll see that it has a new tab specifically for sharing that data with anyone in your contacts – whether that's a relative, a friend, a personal trainer, or a doctor – provided they have an iPhone 8 or later, and have upgraded to iOS 15.",
    "Apple is keen to point out that it's totally up to you what data you do and don't share (you can pick and mix which figures to share using a series of toggles), and all data is encrypted end-to-end.",
    "You can even choose to share data from the new Walking Steadiness tool (also being introduced with iOS 15) which assesses changes to your gait and determines whether you're likely to have a fall. If your steadiness decreases, it can recommend exercises to help improve balance and strength, with videos demonstrated by Apple Fitness Plus instructors.",
    "None of this data is intended for diagnostic purposes, but it can be a good starting point for a conversation with your doctor, a way for your personal trainer to check in on your progress, or simply peace of mind for a relative.",
    "When someone shares their health data with you, you can choose whether to receive notifications about certain aspects (if their walking steadiness decreases, for example), which will be particularly helpful for anyone who wants to check on a friend or family member who's older, or has limited mobility.",
    "Apple Health isn't the only app that lets you share data about your wellbeing, though. Fitbit already offers a tool that performs a similar job, but in a different way.",
    "The Fitbit app creates a custom Wellness Report that you can share with a family, member, personal trainer, doctor, or anyone else you choose. As with Apple's Health Sharing, you can pick and choose which data to include, with options including sleep, heart rate, and weight trend (depending on whether you own a Fitbit fitness tracker, smart scale, or both), but this data will be exported as a PDF rather than sent directly through the app.",
    "Only Fitbit Premium subscribers can create a printable Wellness Report, but all Fitbit users can export 31 days worth of data for weight, activity and sleep data in a more basic format.",
    "By contrast, all of Apple's data-sharing takes place within the Health app, and is free for everyone. There's no need to print a report or send files manually (with all the security implications that might entail). This means that it's easier to share with a contact and data is encrypted end-to-end, but only if they have an iPhone 8 or later.",
    "We've yet to see whether Apple will also offer an 'offline' method of sharing health data, but for now it looks like Fitbit's method will more convenient if your contact has an older handset or an Android device."
  ],
  "headers": {
    "6": "Other ways to share"
  },
  "links": {
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "Health app": "https://www.techradar.com/how-to/phone-and-communications/mobile-phones/how-to-use-apples-health-app-1305634",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "smart scale": "https://www.techradar.com/best/best-smart-scales",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "Android": "https://www.techradar.com/best/best-android-phones"
  }
}