{
  "source": "https://www.techradar.com/news/simple-websites-are-vital-for-small-ecommerce-businesses-heres-why",
  "title": "Simple websites are vital for small ecommerce businesses - here's why",
  "category": "computing",
  "updated": "2021-07-15T10:41:30Z",
  "author": "sead-fadilpasic",
  "summary": "Intuitive sign-up and login forms are crucial to minimizing cart abandonment",
  "article": [
    "Slow and complex login forms are one of the main causes of cart abandonment, but many small businesses are oblivious to the importance of simple user interfaces.",
    "This is according to a report from identity management firm Auth0 based on its survey of more than 1,200 business leaders and 8,000 customers around the world.",
    "The report states that roughly half of all consumers (49%) are frustrated by long login and sign-up forms. On a similar proportion of ecommerce websites (45%), the sign-up process takes up to a minute, while a fifth (21%) of respondents said logging in is too time-consuming.",
    "Ultimately, 83% of potential customers will abandon their shopping cart or registration page due to a complex login process.",
    "On the other hand, businesses seem to be in the dark about it. While 85% admit potential customers often abandon their cart or sign-up process, just 25% think it’s due to a cumbersome sign-up process. A third (35%) think it’s “unlikely” the customers abandoned the cart because of frustrations with the login process.",
    "Customers everywhere seem to be more interested in convenience than security. Nearly nine in ten (85%) admit to reusing passwords for multiple accounts, and their biggest frustration with the sign-up process is related to passwords.",
    "Instead of having to think of a complex password that is difficult to remember, consumers would rather a passwordless alternative, such as biometrics. However, most businesses “fall short” of consumer expectations in that respect, Auth0 added.",
    "Cybersecurity experts have long warned against creating simple passwords and reusing them across the internet. Criminals who manage to breach a service and obtain customer passwords will often sell these datasets on the dark web, with other criminals then trying out those login combinations across various online services.",
    "Consequently, a single data breach could result in multiple instances of account hijacking and the theft of financial or personally identifiable information."
  ],
  "headers": {
    "5": "Passwordless alternatives"
  },
  "links": {
    "login forms": "https://www.techradar.com/best/password-manager",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "passwords": "https://www.techradar.com/best/business-password-management-software"
  }
}