{
  "source": "https://www.techradar.com/news/why-amazon-prime-day-is-the-perfect-time-to-buy-a-fitbit",
  "title": "Why Amazon Prime Day is the perfect time to buy a Fitbit",
  "category": "fitness",
  "updated": "2021-12-04T15:00:21Z",
  "author": "cat-ellis",
  "summary": "Get in shape with a cheap Fitbit",
  "article": [
    "Amazon Prime Day is fast approaching, and is due to run from June 21 to 22. Fitness tech has always been steeply discounted in the sales, and if you've been thinking of picking up a new Fitbit, it's the ideal time to take the plunge.",
    "To avoid overspending during sales events it's a good idea to plan your purchases in advance",
    "It's important to bear in mind, however, that not all the deals are quite what they appear at first glance. To find out how to avoid being disappointed, check out our guide: how to avoid buying a 'fake' Fitbit on Amazon Prime Day.",
    "We'll be hand-picking all the best deals on Fitbits, as well as other fitness trackers, running watches and smartwatches, so stick with TechRadar to make sure you don't miss out.",
    "On Black Friday 2020, we saw that Amazon has no qualms about cutting the prices of brand new fitness trackers. In November, the Fitbit Sense was only a few weeks old, but Amazon knocked £30.99 off its price in the UK anyway. The Sense also hit its lowest price in the US on Black Friday, and has been hovering around the $250 mark ever since, so it's about due for another price chop.",
    "The Fitbit Versa 3 saw a modest price cut for Black Friday, despite also being brand new, as did the Fitbit Inspire 2. Now that both devices are more established, and generally available for less than the RRP, we're anticipating some more generous deals for Prime Day 2021.",
    "The Fitbit Ace 3 kids' fitness tracker (with new games to keep your little ones active) was released back in March, and Amazon has already started nibbling a little bit off its sticker price, so we reckon it's likely to get its first big discount on Prime Day too.",
    "The only device we're not expecting to see a price cut is the new Fitbit Luxe, which is available to pre-order now, but won't begin shipping until July. Still, we wouldn't rule it out completely in case Amazon wants to snag the lion's share of pre-orders.",
    "Fitbit's previous-gen devices, including the Fitbit Versa 2, Fitbit Inspire HR, and Fitbit Ace 2 are all still great fitness trackers that are supported by the Fitbit app, and are a good investment if you don't need all the latest bells and whistles.",
    "Although its warehouses are vast, Amazon does still need to clear out stock of older devices (for example, it has almost no stock of the Fitbit Versa Lite remaining in the US or UK). It may well decide it's time to start shifting the older models with some urgency, so you may be able to score a great deal.",
    "On Black Friday 2020, Amazon knocked a huge £70 off the Versa 2 in the UK, and took £30 off the Inspire and Inspire HR – and the prices could be even lower this time around.",
    "Just bear in mind the limitations of these previous-gen models. For example, the Versa 2 doesn't have on-board GPS, which means you'll need to carry your phone to track your route on runs, walks and cycles. The Fitbit Inspire and Inspire HR don't have the stress-tracking tools you'll find in the Inspire 2, and don't offer guided breathing sessions.",
    "Now that Fitbit is owned by Google, it's possible that we might see some interesting bundle deals containing both a fitness tracker and a Google smart speaker, saving you a big chunk of cash compared to buying the two separately.",
    "In the UK, Currys is already offering a Fitbit Inspire 2 bundled together with a Google Nest Mini, and there's a chance that Amazon might follow the same route, pairing Fitbits with a suitable speaker.",
    "Over the years, Prime Day has evolved into something of a mini Black Friday, so it might be possible to snag a great deal on a Fitbit on a competitor's website.",
    "Prime Day is a bit of an unusual situation when it comes to price matching, as the special deals are only available to subscribers, which means other stores that usually match its prices may not feel obligated to do so. However, that doesn't stop some competing stores from running their own deals to coincide with Amazon's offers.",
    "For example, Walmart is holding a Deals for Days event from June 20-23, which overlaps with Prime Day. It stocks the full range of Fitbits, so we'll be keeping a close eye out for bargains that undercut Amazon's offerings.",
    "Similarly, the Target Deal Days event is scheduled to run from June 20-22. It also stocks the full Fitbit range, and its prices are already similar to Amazon's, so it'll be another one to watch when the deals begin.",
    "We don't yet know which UK retailers will be holding their own competing sales, but Currys has been known to take the initiative in previous years. It has a good range of Fitbit devices in stock (plus the Fitbit Luxe for pre-order), so we'll be keeping a close eye on its prices.",
    "We've asked Fitbit itself whether it's planning to offer any discounts in its online store to coincide with Prime Day, but have to far had no response. We'll keep you updated if we learn more."
  ],
  "headers": {
    "4": "Even new Fitbits get a discount",
    "8": "Older devices get even deeper price cuts",
    "12": "Watch out for bundles",
    "14": "Competitors have their own events"
  },
  "links": {
    "how to avoid buying a 'fake' Fitbit on Amazon Prime Day": "https://www.techradar.com/news/how-to-avoid-buying-a-fake-fitbit-on-amazon-prime-day",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "running watches": "https://www.techradar.com/best/running-watches",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Fitbit Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "Fitbit Ace 3": "https://www.techradar.com/reviews/fitbit-ace-3",
    "Fitbit Luxe": "https://www.techradar.com/reviews/fitbit-luxe",
    "Fitbit Versa 2": "https://www.techradar.com/reviews/fitbit-versa-2-review",
    "Fitbit Inspire HR": "https://www.techradar.com/reviews/fitbit-inspire-hr-review",
    "Fitbit Ace 2": "https://www.techradar.com/reviews/fitbit-ace-2",
    "Fitbit Versa Lite": "https://www.techradar.com/reviews/fitbit-versa-lite-review",
    "Versa 2": "https://www.techradar.com/news/fitbit-versa-2-vs-fitbit-versa-3",
    "Fitbit is owned by Google": "https://www.techradar.com/news/5-likely-reasons-why-google-just-bought-fitbit",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "a Fitbit Inspire 2 bundled together with a Google Nest Mini": "https://www.awin1.com/awclick.php?awinmid=1599&awinaffid=103504&clickref=trd-us-2996744773129926700&p=https%3A%2F%2Fwww.currys.co.uk%2Fgbuk%2Fsmart-tech%2Fsmart-tech%2Fsmart-watches-and-fitness%2Ffitness-trackers%2Ffitbit-inspire-2-nest-mini-2nd-gen-bundle-desert-rose-coral-10217194-pdt.html",
    "It stocks the full range of Fitbits": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-2809029694524841000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fbrowse%2Fsports-outdoors%2Ffitbit%2F4125_4134_1229723_5635313",
    "It also stocks the full Fitbit range": "https://goto.target.com/c/221109/81938/2092?subId1=trd-us-4303183075463681000&sharedId=trd-us&u=https%3A%2F%2Fwww.target.com%2Fb%2Ffitbit%2F-%2FN-55xlp",
    "It has a good range of Fitbit devices in stock": "https://www.awin1.com/awclick.php?awinmid=1599&awinaffid=103504&clickref=trd-us-3625928755729335300&p=https%3A%2F%2Fwww.currys.co.uk%2Fgbuk%2Ffitbit-smart-tech%2Fsmart-tech%2Fsmart-watches-and-fitness%2Ffitness-trackers%2F551_4338_31988_850_xx%2Fxx-criteria.html"
  }
}