{
  "source": "https://www.techradar.com/news/windows-11-is-on-the-way-noise-cancelling-podcast-episode-71",
  "title": "Windows 11 is on the way: Noise Cancelling podcast episode 71",
  "category": "phones",
  "updated": "2021-07-02T12:53:09Z",
  "author": "adam-vjestica",
  "summary": "Episode 71 of our tech podcast is out now",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "The show is presented by Gareth Beavis, Global Editor in Chief of TechRadar, and Sherri L. Smith, Editor in Chief of Laptop Mag.",
    "This week our guest is Daryl Baxter, Software & Downloads Writer at TechRadar, and Zac Bowden, Senior Editor at Windows Central, who join us (remotely, of course) to talk about the last seven days in tech.",
    "We begin this week's episode by pitching better names for Windows 11, and why people should be excited for Microsoft's new operating system.",
    "We also talk about the joy of owning a Microsoft Surface tablet, Windows 7 parties and why is Windows 10 so broken? Finally, we discuss Microsoft Teams integration, the Windows 11 leak in general and touch on the ultimate grudge match: Windows vs Mac.",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple Podcasts, or find us wherever you get your pods. New episodes land every Friday. Nice."
  ],
  "headers": {
    "3": "Week 71"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/uk",
    "Tom's Guide": "https://www.tomsguide.com/uk",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple Podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3869460144113154600&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}