{
  "source": "https://www.techradar.com/news/xiaomi-mi-mix-4-leak-hints-at-seriously-speedy-wireless-charging",
  "title": "Xiaomi Mi Mix 4 leak hints at seriously speedy wireless charging",
  "category": "phones",
  "updated": "2021-06-27T15:30:19Z",
  "author": "david-nield",
  "summary": "Up to 80W without wires, apparently",
  "article": [
    "The Xiaomi Mi Mix 3 came out all the way back in 2018, but there have been recent rumors that Xiaomi is about to bring the branding back – and a new leak suggests that the Xiaomi Mi Mix 4 could offer some seriously impressive wired and wireless charging speeds.",
    "According to a report from MyDrivers in China (via Notebookcheck), the Xiaomi Mi Mix 4 will not only offer 120W wired charging but also 80W wireless charging, the highest rate we've seen yet on a consumer smartphone.",
    "Last October Xiaomi showed off 80W wireless charging speeds, but at that time it wasn't ready for release in an actual handset. In a phone with a 4,000mAh battery, it would take just 19 minutes to go from zero to full.",
    "Now the indications are that the Xiaomi Mi Mix 4 is going to be the first smartphone to get the benefit of the ultra-fast, cable-free charging speed. It'll most likely be delivered through some kind of proprietary charger developed by Xiaomi itself.",
    "We had just about given up hope of seeing the Xiaomi Mi Mix 4 appear – and we thought the Mi Mix Fold had replaced it – but rumors of the phone launching this year have been swirling for a few months at this point.",
    "One of the innovations the phone is supposedly coming with is an under-display selfie camera, which will mean no need for a notch. Handsets with this technology are already on the market, but at this stage the image quality you get from them isn't great.",
    "Other specs that have been mentioned for the Xiaomi Mi Mix 4 include a 1080p screen, a top-end Snapdragon 888 processor, and a 4,500mAh battery – offering the 120W wired and 80W wireless charging speeds that we've already mentioned.",
    "Add all of that together, and this looks like being a flagship Xiaomi phone built to take on anything that launches during 2021. As for when we'll see it, the phone is being tipped to arrive this year, and it will probably show up sooner rather than later."
  ],
  "headers": {
    "4": "Key features"
  },
  "links": {
    "Xiaomi Mi Mix 3": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
    "recent rumors": "https://www.techradar.com/news/the-xiaomi-mi-mix-4-could-finally-arrive-this-year-with-an-under-display-camera",
    "MyDrivers": "https://news.mydrivers.com/1/765/765346.htm",
    "Notebookcheck": "https://www.notebookcheck.net/The-Xiaomi-Mi-Mix-4-s-battery-could-support-80W-wireless-charging.547494.0.html",
    "showed off": "https://www.youtube.com/watch?v=6DPqcAwCnoc",
    "Mi Mix Fold": "https://www.techradar.com/news/xiaomi-mi-mix-fold-release-date-price-features-and-everything-you-need-to-know",
    "for a few months": "https://www.techradar.com/news/xiaomi-mi-mix-4-leaks-with-under-display-selfie-camera",
    "already on the market": "https://www.techradar.com/reviews/zte-axon-20-5g-review"
  }
}