{
  "source": "https://www.techradar.com/news/microsoft-is-finally-dumping-one-of-windows-10s-most-useless-features",
  "title": "Microsoft is finally dumping one of Windows 10’s most useless features",
  "category": "computing",
  "updated": "2021-02-25T12:46:02Z",
  "author": "matt-hanson",
  "summary": "Bye bye 3D objects",
  "article": [
    "If you’ve always wondered what the 3D Objects folder is for in Windows 10, you’ll soon never have to see it again, as Microsoft is finally getting rid of it.",
    "A few years ago, 3D seemed to be all the rage, and Microsoft littered Windows 10 with all sorts of 3D apps and features, such as Paint 3D, and adding 3D effects to the Photos app.",
    "However, Microsoft’s enthusiasm for all things 3D wasn’t reciprocated by its users, and the company has been quietly removing them from Windows 10. However, the 3D Objects folder, once used by these unloved features, stubbornly remained.",
    "Not only was it useless, it’s hard to ignore as well. Whenever you open up File Explorer, you’re greeted with a shortcut to it. It also appears in the Quick Access bar I",
    "If you like to keep your PC clutter free, having a folder that you don’t use – but can’t easily remove – is extremely annoying.",
    "Thankfully, with the upcoming Windows 10 21H2 update, which is expected towards the end of the year, the 3D Objects folder will no longer appear.",
    "Weirdly, Microsoft isn’t completely getting rid of the folder – it’ll be hidden, and can still be accessed through File Explorer. It’ll reside in your Users folder.",
    "It seems Microsoft can’t quite bring itself to get rid of 3D Objects completely, even though it is hardly used. The good news is that as an empty folder, it won’t take up any space on your hard drive, and by hiding it, it will stop bugging users.",
    "Via HowToGeek"
  ],
  "headers": {
    "5": "Good riddance"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 10 21H2 update": "https://www.techradar.com/news/this-is-when-windows-10s-brand-new-look-could-land",
    "HowToGeek": "https://www.howtogeek.com/715362/microsoft-is-removing-windows-10s-3d-objects-folder/"
  }
}