{
  "source": "https://www.techradar.com/news/bitdefender-box-explained",
  "title": "What is Bitdefender Box and what can it do?",
  "category": "computing",
  "updated": "2021-06-18T11:39:33Z",
  "author": "darren-allan",
  "summary": "Could this little Box help secure your home network?",
  "article": [
    "Bitdefender Box is a mysterious looking, er, box, and on first catching sight of it, you might well wonder what on earth it’s for. How does it help with your antivirus needs? Is it a router of some kind?",
    "Well actually it's more than that, and looking at the product blurb, you’ll quickly understand that Bitdefender Box delivers extra security for the devices in your home – but how exactly?",
    "In this article, we’ll discuss how Bitdefender Box bolsters the defense of your home network, and exactly what security features the product offers – plus what it’s bundled with for online protection on the Bitdefender software side – and what all this could do for you.",
    "Bitdefender Box is a hardware security solution designed to give you a better level of overall protection for your home network - especially if you've invested into a network of IoT products.",
    "It’s literally a small box, as the name suggests, that acts as a hardware firewall.",
    "Just think of it as a beefed-up router – which works alongside your existing router, or replaces it in certain scenarios – with all sorts of extra security features helping to guard you from malware or the attention of hackers. It comes with a 1-year subscription to Bitdefender Total Security, the firm’s flagship suite.",
    "There are three different ways you can set up Bitdefender Box, but whichever way you do it, Box will provide protection for all of the devices connected to your home network. That means anything from PCs and mobiles through to smart TVs or other smart home gadgets, consoles and so on – and this flexibility is one of the main strengths of Box.",
    "As to the setup methods, Box can be hooked up directly to your ISP modem, acting as your sole standalone router. Or more commonly Bitdefender Box is run alongside your existing router, replacing it by turning off the router’s Wi-Fi network and using Box’s Wi-Fi capabilities instead. The third method is to use Box with your existing router in Bridge mode, meaning you’re still using the router’s Wi-Fi network, but with Box’s added protective measures on top.",
    "Note that for initially setting up Box, you’ll need to have a smartphone running at least Android 5.0 or iOS 9 (or better).",
    "Bitdefender Box comes bundled with a Bitdefender Total Security subscription - one of the best internet security suites available right now. It provides on-device software security – on top of the hardware defenses – and you can use this with Windows, Mac, iOS or Android devices.",
    "Having this installed means these devices stay secure even when you leave home and are out and about, away from the protection of Bitdefender Box.",
    "So what capabilities does Bitdefender's Box of tricks actually possess? Let’s look at some highlights when it comes to the main features of Bitdefender Box:",
    "Core defenses for everything",
    "Bitdefender Box acts as a hardware firewall overseeing all your network traffic. It watches for inbound traffic – defending your network from possible hacks or intrusions – and indeed outgoing traffic, moving to block things like requests to known malicious sites, or sending sensitive data (like a password) over an insecure connection. In short, Box constantly monitors your home network for any suspicious activity, and covers any device that you have connected to your home Wi-Fi. That makes it a great security option in the IoT age.",
    "Bitdefender Total Security",
    "As we’ve already mentioned, the above hardware defenses are backed up by software in the form of Bitdefender Total Security. Yes, Box comes with a subscription to Bitdefender’s flagship security suite which provides excellent protection for Windows, Mac, Android and iOS devices. This gives you an extra layer of security, and protection when you’re away from home, too.",
    "App management",
    "The Bitdefender Central app provides a convenient web portal which you can use to oversee the status of the devices on your home network, and any threats that may have been dealt with. It also allows you to remotely manage devices and do nifty things like trigger a remote installation of Bitdefender Total Security on any device connected to your network.",
    "Parental controls",
    "Bitdefender Box offers a system of parental controls that facilitates setting time restrictions on internet usage for your kids’ devices, or blocking certain content – or indeed you can remotely pull the plug on internet connectivity for any device whenever you want. It’s a relatively basic functionality here, but still useful.",
    "Guest network",
    "Box enables the easy and quick setup of a separate Guest Wi-Fi network for when you have visitors, so they can go online without ever getting access to your full home network.",
    "Private Mode",
    "When turned on, this mode instantly blocks the internet connections of smart speakers like Alexa or Google Assistant. So if you’re worried about stories of accidental eavesdropping with these kind of devices, Private Mode could come in handy.",
    "Bitdefender antivirus has an excellent reputation in the security field, and its antivirus products are consistently rated highly by the main independent test labs. Remember that as well as Bitdefender Box’s hardware defenses, you also get Bitdefender Total Security bundled to install on your various devices, which seriously adds to the value proposition here.",
    "Also, you receive free setup assistance on the phone (or live chat) if you have any trouble getting up and running with Box, which is a welcome touch for those who might feel intimidated at the prospect of setting up a new piece of hardware.",
    "The extra protection granted by Bitdefender Box is certainly worthwhile in terms of considerably toughening up your network. While the initial recommended asking price may look a little steep, it’s actually decent value with the typical discounts applied by Bitdefender (of around 30%). And even better value when you consider that renewing your yearly subscription doesn’t cost much more than a Bitdefender Total Security plan on its own.",
    "As an ongoing subscription, for someone with plenty of devices to protect – particularly those with a big family, or a load of smart gadgets – the value proposition here ends up pretty tempting, and Bitdefender Box could be a very smart choice for really tightening the security on a home network."
  ],
  "headers": {
    "3": "What is Bitdefender Box?",
    "6": "How to use Bitdefender Box",
    "11": "Bitdefender Box: what features does it have?",
    "24": "How good is Bitdefender?"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Bitdefender": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "Bitdefender Total Security": "https://www.techradar.com/news/bitdefender-total-security",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "internet security suites": "https://www.techradar.com/news/best-internet-security-suites",
    "Bitdefender Central": "https://www.techradar.com/news/bitdefender-central",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "stories of accidental eavesdropping with these kind of devices": "https://www.techradar.com/news/your-smart-speaker-could-be-accidentally-listening-in-on-your-conversations",
    "Bitdefender antivirus": "https://www.techradar.com/reviews/bitdefender-antivirus"
  }
}