{
  "source": "https://www.techradar.com/news/apples-magsafe-iphone-battery-pack-could-support-reverse-charging",
  "title": "Apple's MagSafe iPhone battery pack could support reverse charging",
  "category": "phones",
  "updated": "2021-03-02T14:19:55Z",
  "author": "axel-metz",
  "summary": "Could you soon use your iPhone to charge your AirPods?",
  "article": [
    "Apple is said to be working on a MagSafe battery pack for the iPhone 12 which supports reverse charging – meaning you might soon be juicing up your AirPods on the back of your smartphone.",
    "In a recent episode of the Genius Bar podcast, serial Apple leaker Jon Prosser suggested the Cupertino company is developing two variants of the MagSafe battery pack, a clippable charging block integrated with Apple’s magnetic technology.",
    "According to Prosser, one of the variants, a “premium” battery pack option, will integrate reverse wireless charging, giving an iPhone the ability to charge other gadgets as well as be charged wirelessly itself.",
    "Shortly after the iPhone 12 family debuted last year, a Federal Communications Commission filing revealed Apple’s MagSafe tech supports bilateral charging. That’s the scientific term for reverse charging.",
    "We’ve heard reports since 2019 that suggested we may see reverse charging arrive on the then-unannounced iPhone 11 models. But the feature is still a no-show on MagSafe accessories for the iPhone 12 family, so it’d be a big surprise if it does arrive before the iPhone 13 comes later in 2021.",
    "It’s worth noting that Prosser has something of a mixed track record when it comes to Apple leaks, and he provides no further details on the company’s plans for the reverse charging-enabled MagSafe battery pack other than it being in the development phase.",
    "His suggestion hints at a technology we've heard rumors of Apple trying to crack in the past. So there’s hope, at least.",
    "Naturally, Apple itself has remained quiet on the speculation, with no official word on the company’s plans to introduce a reverse charging-enabled battery pack.",
    "That said, code discovered in the latest iOS 14.5 beta does make reference to a ‘battery pack’ of some sort, and while it’s likely a nod to an imminent MagSafe-compatible charging device rather than a reverse charging-enabled battery pack, it seems Apple may be pressing ahead with development on the technology.",
    "Even so, the company has encountered roadblocks in the development stages of a regular wireless charger, let alone a fancier version, so we don’t expect a MagSafe battery pack with reverse charging functionality to arrive anytime soon (sorry, expectant iPhone 12 users).",
    "Via AppleInsider"
  ],
  "headers": {
    "7": "iOS hints"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-13",
    "Genius Bar": "https://geniusbarpodcast.com/episodes/exclusive-m1-mac-deets-who-will-replace-tim-cook-0KdSJGOM",
    "MagSafe battery pack": "https://www.techradar.com/news/apple-rumored-to-be-working-on-a-magsafe-battery-pack-for-the-iphone-12",
    "reports": "https://www.techradar.com/news/new-report-predicts-reversible-charging-and-camera-upgrades-for-the-2019-iphones",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "MagSafe accessories": "https://www.techradar.com/best/best-magsafe-accessories",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iOS 14.5 beta": "https://www.techradar.com/news/ios-145-beta-2-is-here-for-developers-heres-how-it-changes-your-iphone",
    "AppleInsider": "https://appleinsider.com/articles/21/03/01/rumor-apples-magsafe-battery-pack-for-iphone-could-support-reverse-charging"
  }
}