{
  "source": "https://www.techradar.com/news/sennheisers-most-popular-true-wireless-earbuds-are-getting-active-noise-cancellation",
  "title": "Sennheiser's most popular true wireless earbuds are getting active noise cancellation",
  "category": "audio-visual",
  "updated": "2021-09-13T22:00:15Z",
  "author": "nick-pino",
  "summary": "The Sennheiser CX Plus add ANC and aptX Adaptive compatibility in a small, sleek package",
  "article": [
    "Sennheiser is revamping one of its most popular true wireless earbuds, the Sennheiser CX, by adding a number of new features like active noise cancellation and AptX Adaptive codec compatibility.",
    "When they’re released on September 28, the Sennheiser CX Plus will be available in two colors – traditional white and black – and will cost £129/ $179 (around AU$240).",
    "According to Sennheiser, the CX Plus will still keep a number of features from the original CX like their IPX4 water-resistance, 24 hours of battery life with the case, and TrueResponse transducers that it says help give the CX its distinct sound.",
    "As far as we can tell, both earbuds will still be available in the future, providing a full-on active noise cancellation model for those who want it and a passive noise reduction model for those who don't.",
    "Prior to the explosion of noise cancelling earbuds, it was rare that you heard companies tout ‘noise reduction’ as a feature. In essence, all passive noise reduction means is that the earbuds’ natural fit in the ear canal dampens external noise.",
    "On the opposite side of things, active noise cancelling is a technology that relies on a pair of inner and outer microphones to monitor outside noise and provide counter frequencies that effectively ‘cancel out’ any incoming sounds. It requires a processor capable of making those calculations, and better noise cancelling algorithms often require better processors.",
    "The result? Earbuds (and headphones) with noise cancellation are typically more expensive than non-noise cancelling earbuds. Putting noise reduction as a feature is basically just giving potential buyers reassurance that you’ll get some level of sound reduction – even if it can’t touch the power or effectiveness of active noise cancellation.",
    "We typically therefore recommend noise cancelling headphones to our readers, but you can make the case for noise reduction if you’re on a tight budget."
  ],
  "headers": {
    "4": "Analysis: noise reduction vs noise cancellation – which one do you want?"
  },
  "links": {
    "Sennheiser CX": "https://www.techradar.com/reviews/sennheiser-cx-true-wireless-review",
    "noise cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490"
  }
}