{
  "source": "https://www.techradar.com/news/the-next-google-nest-hub-is-tipped-to-keep-the-current-design",
  "title": "The next Google Nest Hub is tipped to keep the current design",
  "category": "smart-home",
  "updated": "2021-02-27T12:00:45Z",
  "author": "david-nield",
  "summary": "Audio improvements will be included",
  "article": [
    "A new Google Nest Hub is apparently on the way, and while it's rumored to be bringing one major feature upgrade with it, the latest leaks suggest not much is going to be changing in terms of the smart display's design.",
    "Inside sources speaking to 9to5Google have revealed that the next Nest Hub is going to keep \"the same design language\" as the current models: a floating, angled screen fixed to a chunky, fabric-colored base underneath.",
    "There will be a new color though, to tempt you into a purchase – alongside the existing gray, black and pink we'll also get a light blue apparently, which matches the aqua shade that the original hub came in and one of the colors offered with the Nest Audio speaker.",
    "Other improvements arriving with the new Google Nest Hub include better audio output quality, and three rather than two far-field microphones – which should ensure that your \"hey Google\" voice commands don't go unnoticed by the smart home device.",
    "There's absolutely nothing wrong with the current design of the Nest Hub and the Nest Hub Max of course, so it's perhaps no surprise that Google is sticking to what it knows even if the latest Amazon Echo Show 10 features a fancy swivelling display.",
    "The big upgrade this time around is one that we've reported on previously: a sleep tracking system based on the Soli radar technology that Google has developed (the same technology found in the Pixel 4 phones and apparently coming to the Nest thermostat).",
    "The idea is that the radar tech would monitor your movements while you sleep, add in a bit of analysis from the sounds you make overnight, and produce a sleep rating for you that you can check in Google Fit. The Soli feature might also enable gesture controls on the Nest Hub too.",
    "According to the sources speaking to 9to5Google, the new Nest Hub is arriving \"sooner rather than later\" and we will of course bring you all the news of the updated device as soon as we hear anything. Pricing is set to stay the same as the current model (the Nest Hub Max currently retails for $229 / £219 / AU$349)."
  ],
  "headers": {
    "4": "Now with sleep tracking"
  },
  "links": {
    "Google Nest Hub": "https://www.techradar.com/reviews/google-home-hub",
    "9to5Google": "https://9to5google.com/2021/02/26/new-google-nest-hub/",
    "Nest Hub": "https://www.techradar.com/reviews/google-nest-hub-max",
    "Nest Audio": "https://www.techradar.com/reviews/google-nest-audio",
    "Amazon Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "reported on previously": "https://www.techradar.com/news/googles-new-nest-hub-may-come-with-soli-radar-based-gesture-support",
    "Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "coming to the Nest thermostat": "https://www.techradar.com/news/pixel-5-lacks-motion-sense-tech-but-it-will-return-google-says"
  }
}