{
  "source": "https://www.techradar.com/news/the-role-of-digital-in-small-business-recovery-post-pandemic",
  "title": "The role of digital in small business’ recovery post-pandemic",
  "category": "computing",
  "updated": "2021-07-22T14:11:53Z",
  "author": "donna-torres",
  "summary": "SMEs forced to adapt and innovate using technology",
  "article": [
    "The challenges faced by small businesses over the past year have had a profound impact on global economies. This is unsurprising given that they account for more than two-thirds of global employment and contribute up to half of national global GDP.",
    "Fortunately for small businesses, public goodwill and loyalty towards them has grown. According to Xero’s Future of Small Business report, more than half (52 per cent) of UK consumers surveyed planned to support SMEs more after the pandemic. And with £18.5bn of accumulated household savings in January alone, the country is set for a dramatic period of spending.",
    "Small businesses also have the edge over enterprises when it comes to customer loyalty. Over half of UK small businesses (53 per cent) said their customers are looking for personal interaction and customer acquaintance. This puts them in a strong position to win business over their larger counterparts.",
    "This view extends to the rest of Europe and beyond. According to research by Mastercard, 61 per cent of post-lockdown European shoppers say they are actively trying to spend money in their local communities to help independent stores bounce back. And further research by Xero and Forrester found that 69 per cent of global consumers feel proud of the small businesses in their communities and would feel a personal loss if those businesses were to close.",
    "Small businesses need to be able to rise to this occasion, which is where the role of technology is critical. Digital adoption has been key to helping firms get, sell and operate online. This won’t go away anytime soon.",
    "According to a Deloitte study, technology leaders spent a little less than 20 per cent of their technology budgets on innovation before the pandemic. This must change as the economy recovers, as organizations experiment with new markets and new ways of working in a rapidly changing landscape.",
    "But small businesses should know they are not alone. Many software providers are implementing initiatives to help smaller firms to adapt to the rapidly developing digitally-led world. Fees are being waived for mobile payments to help increase digital transactions for example, particularly useful in many African countries where mobile payments are relied on in commerce. And online advertising credits are available from businesses like Google for small businesses to offset advertising payments that will increase their online customer bases.",
    "According to McKinsey, European SME productivity is currently well below that of larger companies in Europe and technology is critical in improving this. But governments have a vital role to play in creating the right economic and political environment to spark growth. In fact, research indicates that if the UK’s 1.1m micro-businesses doubled their uptake of key digital technologies, the economy could get a £16.6bn boost.",
    "The UK government has recently demonstrated recognition of the role of technology in recovery by launching a Help To Grow Scheme initiative, focused on increasing technology use to optimize operations and services.",
    "This is also happening elsewhere. Smart Africa - an alliance of 30 countries aiming to establish Africa as a knowledge economy - is the first implementing partner of a new collaboration between the International Telecommunication Union, Estonian and German governments and the Digital Impact Alliance. The partnership aims to help low-resource nations to drive digital services without needing to heavily invest in building their own backend systems.",
    "Existing support is clearly playing an important role, but governments must ultimately go even further in supporting SMEs to adopt the digital tools and skills they’ll need to prosper. As businesses come in all shapes and sizes, their needs vary - from the fundamentals of electricity and hardware through to specialized software and cloud-based insights - and all must be considered if we are to close the digital divide.",
    "As a result, in the next few years we should expect to see much more collaboration between governments and private businesses to ensure businesses in every country have access to the right technology-based foundations to build from.",
    "There’s no doubt that life beyond COVID-19 will never be the same again. But our shared experience of the last year has demonstrated just how important technology is in bringing businesses and communities together."
  ],
  "headers": {
    "4": "With this power comes responsibility",
    "8": "Government support"
  },
  "links": {
    "small businesses": "https://www.techradar.com/best/best-small-business-software",
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools",
    "customers": "https://www.techradar.com/best/cx-tools",
    "mobile payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}