{
  "source": "https://www.techradar.com/news/halloween-kills-box-office-success-shows-that-day-one-streaming-isnt-always-a-bad-thing",
  "title": "Halloween Kills' box office success shows that day-one streaming isn't always a bad thing",
  "category": "entertainment",
  "updated": "2021-10-18T13:56:57Z",
  "author": "henry-st-leger",
  "summary": "Day one streaming didn't hurt this horror flick",
  "article": [
    "Day one streaming didn't hurt Halloween Kills, which has boasted an impressive opening box office weekend, despite launching on the Peacock streaming service on the same day.",
    "The latest entry in the long-running Halloween franchise may not have appeased the critics, but it does seem to have found some love from horror fans going to see the flick in theaters, earning a whopping $50.4 million in its opening weekend across the US (around £35m / AU$70m).",
    "That figure is comfortably on a par with the opening weekend of the latest James Bond movie, No Time To Die, despite the latter currently only playing in theaters – suggesting the usual criticism of day-one streaming eating into ticket sales might no hold water in today's market.",
    "Halloween Kills's simultaneous launch in theaters and on the Peacock streaming service is an increasingly common move after the onset of the pandemic, in which many theaters have been making do with reduced audiences, if not total chain closures at times – forcing distributors to either heavily delay tentpole films or prioritize online channels.",
    "Directors have been in uproar at their blockbuster films launching on streaming services at the same time as they open in theaters – notably Dune director Denis Villeneuve criticising Warner Brothers' decision to same-day launch its entire annual slate of films on HBO Max.",
    "But Halloween Kills' success show that the picture is more complicated than merely theaters vs streaming, and that it doesn't necessarily mean a box office flop if people have the option of watching a film in their homes.",
    "For one, not everyone who wants to see a film will necessarily want to sign up to a streaming service they don't already have. While a theater ticket (and travel expenses) will likely be more than a month's signup to Netflix or Peacock – especially if there's a free trial involved – the potential price barrier to streaming at home can mean that costs of a full cinema experience aren't as hard to swallow.",
    "Halloween Kills is also the enviable position of releasing after the swing of vaccine rollouts over the past year, meaning many are feeling more comfortable attending in person to see a film, or have at least gotten back in the habit after several 2021 films started drawing audiences in to theaters.",
    "At the same time, there's often a clear divide between those willing to attend entertainment events in person, and those keen (or desperate) to stay at home to ensure their safety. Especially in those circumstances, there's a very strong case for same-day launches, catering to those willing and able to visit movie theaters, as well as those who aren't.",
    "Netflix had been leading calls for ending or reducing the launch window for films coming to streaming platforms for some time – and the peculiar situation we find ourselves in today has likely only accelerated that change. But it's important to note that streaming doesn't necessarily sound the death knell for traditional movie-going experiences, even if the best experience may always be on the big screen.",
    "Via The Hollywood Reporter"
  ],
  "headers": {
    "6": "Home is where the heart is"
  },
  "links": {
    "Peacock": "https://www.techradar.com/reviews/peacock-tv",
    "streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "criticising Warner Brothers' decision": "https://www.techradar.com/news/hbo-max-could-kill-the-dune-franchise-says-director",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/halloween-kills-box-office-opening-last-duel-1235032467/"
  }
}