{
  "source": "https://www.techradar.com/news/4k-vs-8k-is-it-worth-upgrading-to-full-uhd",
  "title": "4K vs 8K: Is it worth upgrading to 'Full' UHD?",
  "category": "televisions",
  "updated": "2021-03-18T12:12:49Z",
  "author": "stephen-lambrechts",
  "summary": "We compared Samsung's top QLED flagships to find out",
  "article": [
    "It's difficult to keep up with TV tech. Anyone who has bought a new TV over the past few years will likely know the feeling. You've saved money for a new, high-endTV and, shortly after you've set it up, a new wave of next-generation TVs is announced, which promises to outperform your new set in absolutely every way. All by the same brand that just promised you had the latest and greatest.",
    "That's where we currently are in the battle between 4K vs 8K TVs. Although having widespread access to true 8K UHD content is a long way off, many TV manufacturers are hoping that the impressive upscaling and greater clarity offered by the newest wave of 8K sets will be enough to convince enthusiasts that it's worth upgrading from 4K TVs for good.",
    "In an effort to demonstrate the difference in visual fidelity between its top 4K and 8K TV models, we were invited to Samsung's Australian headquarters back in 2019 to spend a few hours viewing both sets side-by-side.",
    "Here's what we took away from our time comparing Samsung's Q9F 4K QLED TV from 2018 to its Q900R 8K QLED TV flagship, along with some more recent news and updates about which TV tech is best.",
    "The first thing to clear up is that, unless you live in Japan, you're not going to have native 8K content any time soon. That means, just because you have an 8K TV it doesn't mean any of the things you want to watch – TV shows, streaming content, movies, even most YouTube videos – come in an 8K resolution.",
    "Right now, there are a handful of 8K videos on YouTube, which is likely going to be your best bet for watching true 8K content in the near future. However, YouTube's TV app is still limited to a maximum resolution of 4K for the time being, and it probably won't be updated until 8K TVs become more mainstream.",
    "That said, having spent some time with Samsung's Q900R 8K QLED TV, it became clear to us that a lack of native 8K content isn't the deal-breaker you might imagine it could be – in fact, we've come away convinced that upscaling technology will end up defining the 8K era for the foreseeable future.",
    "What we mean by upscaling is that content – movies, TV shows, documentaries – that's of a lower resolution and not shot in 8K can be converted by your 8K TV thanks to the advanced image processing inside. Sure this isn't as impressive as watching 8K content on your 8K TV, but it's a start and what we'll have to make do with for now.",
    "After all, the majority of Hollywood's most expensive blockbusters are still only finished at 2K (and yes, that includes Avengers: Endgame), so the idea that we'll be getting a wealth of native 8K content in the near future is unrealistic.",
    "Instead, it makes more sense for TV manufacturers to focus on how they can improve the content that's already available, which is precisely what Samsung is doing with its 8K approach.",
    "We know that 8K displays offer four times as many pixels as 4K panels over the same amount of screen real estate. What this means is that 8K displays boast a far higher pixels-per-inch (PPI) count, resulting in pixels that both smaller and much closer together and thus harder to individually discern.",
    "Ever look at a 4K television up close? Even with 8 million pixels on a display, you may start to notice a mesh-like \"screen door effect\" if your eye is positioned close enough to the screen. On 8K televisions, this effect is almost non-existent, and having looked at the Q900R 8K QLED TV up very close, it wasn't until our faces were only two or three inches away from the screen that we noticed any kind of screen door effect, and then only because we were actively looking for it.",
    "Of course, extra pixels don’t count for much if they’re just being used to unintelligently stretch a low-resolution image out, so this is why smart upscaling technology is key. Using an AI-powered Quantum Processor, Samsung’s Q900R 8K QLED TV is able to intelligently upscale 4K content (and even 1080p content) and even seamlessly add in detail that wasn’t there in the first place.",
    "In order to test the 8K TV's upscaling prowess, we watched a number of 4K Ultra HD Blu-rays on Samsung's 4K and 8K sets simultaneously. In each instance, we found that the Q900R 8K QLED TV definitely revealed more detail and clarity, even if that seems like it should be impossible.",
    "On a viewing of Aquaman, we were struck by the additional detail found in Jason Momoa's beard and face, with individual hairs and pores more readily viewable on the 8K television thanks to the absence of that aforementioned screen door effect.",
    "The same can be said of Pacific Rim: Uprising, which revealed more tiny details during the film's large-scale robot battle in the middle of Sydney Harbour. Things like water, fire and smoke all appeared more defined and unobstructed by visible pixel separation.",
    "Next, we skipped directly to the IMAX sequences in Mission: Impossible – Fallout, finding them to look extraordinary on both sets. With that said, the 8K TV did win out overall by showing increased clarity during the film's climactic helicopter chase sequence – mountains and cliff faces revealed slightly more detail, and fast moving scenery viewed through the helicopter cockpit appeared moderately less frenzied and a little easier to distinguish.",
    "While we aren't going to say that the difference in visual fidelity between the 4K and 8K sets was enormous, it is noticeable if you're paying attention.",
    "While it's clear that easy access to 8K content is still a while off, it's also important to remember that even 4K content is still in its infancy – most digital video, especially on broadcast television, still falls somewhere between 480p and 1080p.",
    "We know that upscaled 4K content looks amazing on both sets, but what about the other end of the video spectrum? Starting at the bottom of the barrel with a standard definition overseas news broadcast, it was immediately apparent that all the upscaling grunt in the world still can't make low quality source material look beautiful.",
    "That said, the Q900R 8K TV's AI-powered Quantum Processor did provide a number of subtle improvements to the quality of the low-resolution source image, the most noticeable being increased legibility of on-screen text, followed by a smoother image overall.",
    "Moving into the HD portion of our comparison, we viewed at a scene from the latest season of Game of Thrones which saw two characters having a conversation in a dark room.",
    "Immediately, it was clear that this year's 8K TV had received improvements to its Direct Full Array backlighting system, which uses hundreds of backlights along the panel in order to target specific areas of the display.",
    "Perhaps due to the 8K set's AI smarts and the increased resolution on offer, the newer TV's black levels were far more precise than last year's top 4K set. Banding, which is usually a product of poor color transition and contouring on many TV sets, was greatly reduced on the Q900R 8K.",
    "A close up of Sansa Stark's face revealed a much more natural transition from light to dark along the jawline, with shade gradations offering increased subtlety and shadow detail – something that even last year's 4K Q9F struggled to pull off as convincingly.",
    "We also noticed that Samsung's 2018 4K QLED actually offered a brighter image than its new 8K telly. With that in mind, we found the colors on its new 8K TV appeared more true to life and less over-saturated than on the 4K Q9F.",
    "Future-proofing is a common phrase that tends to crop up whenever a new television technology makes its way to market, and you're likely to hear it often in regards to 8K. However, it's this writer's opinion that there's no real way to predict where TV technology is going to take us in the near future.",
    "Only a couple of years ago, early adopters of 4K TVs used the same 'future-proofing' rationale when making the leap into the Ultra HD generation, but that eagerness has proved to be a double-edged sword in the long run.",
    "For instance, many first-generation 4K TV owners were unaware that HDR10 and Dolby Vision integration would be just around the corner, leaving them with televisions that were ill-equipped to display the best that Ultra HD had to offer.",
    "Having said that, the 8K TVs of today really do offer some of the most exciting and next-gen technologies on the market. If you have the capacity and the budget for a larger screen will certainly get some benefit from all those added pixels (four times the number of pixels of 4K TVs).",
    "Vastly improved upscaling makes even HD sources look exceptional on 8K screens, while the gradual implementation of HDMI 2.1 ports paves the way for 8K gaming on next-gen consoles like the PS5 and Xbox Series X.",
    "So if you do decide to make the leap into 8K Full UHD, our advice is to make sure you do it for the upscaling features already on offer – which are admittedly exceptional – and not because you're expecting 8K content to arrive soon."
  ],
  "headers": {
    "4": "Native 8K content isn't necessary",
    "10": "It's all about upscaling",
    "13": "The difference is slight, but noticeable",
    "18": "It's still hard to make SD content look good",
    "21": "HD content looks great",
    "26": "Buy for today, not tomorrow"
  },
  "links": {
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Q9F 4K QLED TV": "https://www.techradar.com/reviews/samsung-q9f-qled-tv",
    "Q900R 8K QLED TV": "https://www.techradar.com/reviews/hands-on-samsung-q900r-8k-qled-tv",
    "HDR10": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}