{
  "source": "https://www.techradar.com/news/this-prime-day-ps-plus-bundle-will-finally-let-me-play-ps2-games-with-ease",
  "title": "This Prime Day PS Plus bundle will finally let me play PS2 games with ease",
  "category": "gaming",
  "updated": "2021-06-22T11:37:08Z",
  "author": "vic-hood",
  "summary": "Pick up some nostalgia this Prime Day",
  "article": [
    "Looking to pick up a bit of gaming nostalgia this Prime Day? I know I am. After all, who doesn't want to revisit some stone-cold classics? Fortunately, Amazon is offering a PS Plus bundle deal this Prime Day that packs in three months of PlayStation Plus and three months of PS Now - so I'll finally be able to revisit my favorite PS2 games with ease. (Not in the UK or US? Scroll down for deals in your region).",
    "I pride myself on having kept most of the gaming consoles I grew up with: my Xbox, Xbox 360, PS1, Wii, Xbox One, PS3 all sit snugly somewhere in my home (either in a dusty box or on proud display). But the one classic home console from yesteryear that I do not still own is my PlayStation 2.",
    "I did have a PlayStation 2 Slim, which has seen a frankly outlandish amount of use throughout my pre and early teens: Guitar Hero, Grant Theft Auto Vice City, Fatal Frame and The Simpsons: Hit and Run were among the games in consistent rotation. But that use took its toll and one day the lid decided it just wouldn't close anymore. A book precariously placed on top of the machine helped to mitigate the issue for a bit, but it wasn't enough and my PS2 Slim now sits in my mother's house unused and gathering dust.",
    "I did, for a while, consider tracking down a new PS2, but life got in the way. And the prospect of hooking up my chunky PS3, inherited when my partner and I moved in together, seems like a chore. That task would involve me having to reconfigure my living room gaming setup to make room each time I wanted to play a PS2 game via backwards compatibility on the console. Yes, I'm lazy.",
    "This is why this Prime Day bundle is so appealing to me. The bundle allows you access to two great PlayStation features for three months for less than $35/£30.",
    "Firstly, you get PS Plus, allowing you access to online play and pick up free PS4 and PS5 games each month - within that three-month period you'll get roughly nine free games in total, plus you'll be able to play them online with your friends.",
    "But the kicker is the three months of PS Now that's packed in, which allows you to download or stream hundreds of PS4, PS3 and PS2 titles to your PS5, PS4 or PC. No hooking up old hardware, you can simply jump into an array of PS2 and PS3 classics from your PS4 and PS4. Check it out below:",
    "US",
    "UK",
    "It's worth noting that not all PS2 and PS3 games are available on PS Now (though you can't download PS3 games). But I will once again be able to revisit favorites such as Grand Theft Auto: Vice City, Fatal Frame and Fatal Frame 2: Crimson Butterfly, Ape Escape 2 and the Bloodrayne games. Though, a few other classics I hoped to revisit are noticeable absent from the available games.",
    "Considering a PS Now membership is usually quite expensive, getting three months of it plus PS Plus is a pretty good deal. Plus, if I don't find PS Now is for me, then I at least have three months of PS Plus I'll definitely be using regardless.",
    "PS Now may not be on par quite yet with Xbox Game Pass Ultimate, nor does it offer the same breadth of titles, but I'm expecting it to become a more enticing prospect in the coming year - with Sony working with Microsoft on Cloud gaming. So picking up this bundle isn't simply a nostalgia purchase, but a hopeful investment that PS Now will pick up in the near future.",
    "No matter where you live, you'll find all the lowest prices for PS Plus and PS Now from around the web right here, with offers available in your region."
  ],
  "headers": {
    "7": "Today's best PS Plus + PS Now bundle deals on Prime Day",
    "12": "More PS Plus and PS Now deals",
    "13": "More Amazon Prime Day deals in the UK"
  },
  "links": {
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "PS Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate"
  }
}