{
  "source": "https://www.techradar.com/news/this-new-super-cheap-android-phone-is-absolutely-tiny",
  "title": "This new super-cheap Android phone is absolutely tiny",
  "category": "phones",
  "updated": "2021-06-24T14:00:54Z",
  "author": "tom-bedford",
  "summary": "Alcatel 1 with a 5-inch display",
  "article": [
    "If you look for a new Android phone to buy, you're generally going to be bumping heads with a big problem - most modern phones are big. You'll be hard-pressed to find a device with a display less than 6 inches across, with most hitting 6.7-inches or more.",
    "TCL's new phone, the Alcatel 1, is far from that. With a display of only 5 inches diagonally, it's more of an iPhone SE than a Samsung Galaxy S21 Ultra. It's just been launched as TCL's only smartphone unveiled at annual tech event MWC 2021.",
    "The Alcatel 1 is a super-budget phone, costing only €59 (roughly $70, £50, AU$90) - it's launching in Europe in August (presumably that includes the UK too, but we don't have a price for it yet).",
    "We don't actually know too much about this phone just yet, as Alcatel has only provided limited information on it. It'll run Android 11 Go, a stripped-back version of Android 11, and you can see the design in the above images.",
    "So we don't know the processor, cameras or battery capacity, three of the key specs of the device, but judging by other Alcatel phones and the general budget device market, we'd expect the chipset to be pretty weak, the camera to have an 8MP or 12MP resolution, and the battery to be around 4,000mAh.",
    "Since we haven't tested this budget smartphone, we can't say if it's worth the money or not - but at such a low price, it'd be to be pretty awful to not get a thumbs up. Stay tuned for more coverage on Alcatel's newest phone, and everything else out of MWC 2021."
  ],
  "headers": {
    "3": "What's the Alcatel 1 like?"
  },
  "links": {
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}