{
  "source": "https://www.techradar.com/news/skrill-joins-forces-with-wix-to-offer-online-payments-for-businesses",
  "title": "Skrill joins forces with Wix to offer online payments for businesses",
  "category": "computing",
  "updated": "2021-06-01T11:00:58Z",
  "author": "rob-clymo",
  "summary": "New feature should help Wix customers boost online selling potential",
  "article": [
    "Digital payments specialist Skrill is teaming up with website builder Wix in a bid to make it easier for businesses to accept online payments.",
    "The multi-country move will enable businesses selling online to use Skrill’s fully integrated payment solution within the Wix environment, which can be set up and running within a few hours.",
    "Adding appeal is the way that Skrill’s payment gateway allows businesses to accept payments in over 40 different currencies via credit cards, debit cards, local payment methods and carry out transactions through more than 80 banks around the globe.",
    "The service also aims to offer alternative payment options too, such as the Skrill digital wallet and other products from the portfolio of parent company Paysafe. For example, Paysafe has an online bank transfer solution called Rapid Transfer along with an online cash solution in the shape of Paysafecash.",
    "Timing for the collaboration will be ideal for business owners, with many re-evaluating the way they conduct transactions online. Research carried out by Paysafe in October of last year revealed that approximately 84% of small to medium-sized businesses had been forced to move in a more digitally-oriented direction.",
    "Paysafe’s data found that, of the businesses that had made changes, 78% had altered their range of payment options for customers. This resulted in a 66% increase in sales for those that taken a more innovative approach to e-commerce solutions.",
    "Lorenzo Pellegrino, CEO of Skrill, NETELLER and Income Access at Paysafe, said: “The last year has been a pivotal one for many businesses or sole traders who may not have considered growing their online presence before, and the checkout has proved to be a vital consideration as part of this.",
    "By integrating Skrill and strengthening and diversifying their checkout, businesses looking to make the leap online or grow their ecommerce presence with Wix will have a competitive advantage. We are truly excited at the prospect of what our online partners can achieve as a result of this new collaboration.”",
    "Wix is already well-known for its website building platform that allows anyone to create an e-commerce outlet for boosting business online. The latest enhancement should help its users, which number over 200 million worldwide, to improve their sales capability without the need for any major investment or technical knowledge."
  ],
  "headers": {
    "4": "Online transactions"
  },
  "links": {
    "Skrill": "https://www.techradar.com/news/skrill-offers-fiat-to-crypto-withdrawals-for-its-digital-wallet-service",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "online payments": "https://www.techradar.com/best/best-payment-gateways/best/best-credit-card-processing-service",
    "payment solution": "https://www.techradar.com/best/best-payment-gateways",
    "Wix": "https://www.techradar.com/reviews/wix",
    "accept payments": "https://www.techradar.com/best/best-merchant-services",
    "digital wallet": "https://www.techradar.com/news/digital-wallet-spending-to-skyrocket-in-the-next-five-years-study-suggests",
    "bank transfer": "https://www.techradar.com/best/best-money-transfer-apps",
    "e-commerce solutions": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "e-commerce outlet": "https://www.techradar.com/news/the-best-ecommerce-platform"
  }
}