{
  "source": "https://www.techradar.com/news/microsoft-could-finally-make-its-windows-10-store-app-worth-using",
  "title": "Microsoft could finally make its Windows 10 store app worth using",
  "category": "computing",
  "updated": "2021-04-21T10:38:55Z",
  "author": "jess-weatherbed",
  "summary": "Built from the ground up",
  "article": [
    "Microsoft is allegedly working on a brand-new Windows 10 Store app that will include new policies for developers and add a fresh new look and userface. This will reportedly be introduced alongside the upcoming Sun Valley update, which will be bringing other changes to the look and feel of Windows 10 apps. The current Store app leaves a lot to be desired with slow, clunky functionality and an outdated look that is difficult for users to navigate, so Microsoft wanting to rebuild the store will certainly be welcome.",
    "The new Windows 10 Store should offer better stability for larger game downloads such as Microsoft Flight Simulator and Forza Horizon 4, and give developers more freedom to submit a wider variety of apps. Not only that, but Microsoft will allow developers to use their own in-app revenue streams, without demanding a slice. This is big news that could attract more devs to the platform given the fight between Google and Apple regarding Fortnite. Epic's popular Battle Royal game was removed from both the iOS App Store and Google Play store after it introduced an in-app purchase system for V-bucks (Fortnite's game currency) to skirt around the fact both Apple and Google take a 30% fee. Windows Central reported that three big changes are planned with the rebuild:",
    "We don't yet have a date when the new Store will make an appearance, but we're currently expecting Sun Valley to launch around October 2021. If the Store update is being released at the same time, then Windows 10 users could be seeing a dramatic overhaul towards the end of 2021.",
    "Via CNET"
  ],
  "headers": {},
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Sun Valley": "https://www.techradar.com/news/windows-10-21h2-update",
    "Microsoft Flight Simulator": "https://www.techradar.com/reviews/microsoft-flight-simulator",
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review",
    "Google and Apple regarding Fortnite": "https://www.techradar.com/news/fortnite-has-suddenly-vanished-from-the-app-store-heres-why",
    "Windows Central": "https://www.windowscentral.com/windows-10-big-changes-coming-app-store",
    "CNET": "https://www.cnet.com/news/microsoft-is-reportedly-working-on-new-windows-10-store-app/"
  }
}