{
  "source": "https://www.techradar.com/news/wi-fi-6-demand-surges-thanks-to-harmonisation-and-device-availability",
  "title": "Wi-Fi 6 demand surges thanks to harmonisation and device availability",
  "category": "computing",
  "updated": "2021-10-06T10:45:15Z",
  "author": "steve-mccaskill",
  "summary": "83% of organisations plan to adopt Wi-Fi 6/E",
  "article": [
    "As many as 83% of service providers, equipment manufacturers, and enterprises will have adopted Wi-Fi 6 technology by the end of 2022, according to a new study by the Wireless Broadband Association (WBA).",
    "Wi-Fi 6 is a generational shift in wireless communications and is viewed as a complementary technology to 5G, boosting speeds, enhancing capacity, and lowering latency. This guarantees a higher degree of performance and reliability, especially in networks where multiple devices are competing for bandwidth.",
    "In the telecoms sector, providers will be able to improve Wi-Fi speeds at home and offer converged networking services that combine fixed and mobile technologies for consumers and businesses.",
    "Wi-Fi 6E extends and builds on the capabilities of Wi-Fi 6 through the use of high-level spectrum in the 6GHz band. Tests have so far achieved 2Gps and consistent two-millisecond low latency. These characteristics make wireless suitable for mission critical business applications as well as use cases that require high data rates such as Virtual and Augmented Reality (VR and AR).",
    "The WBA says global standardisation and the development of the device ecosystem are key factors behind adoption. Three fifths (58%) or organisations say Wi-Fi 6 will be critical or very important to their strategy, while 41% of countries have authorised the 6Hz spectrum band for Wi-Fi.",
    "As many as 338 million Wi-Fi 6E devices will enter the market this year and nearly 20% of all Wi-Fi 6 shipments will support 6GHz by 2022.",
    "OpenRoaming, which allows the seamless and secure connection to public Wi-Fi hotspots, will also see increased adoption, while attention is already turning to the next major iteration of Wi-Fi – Wi-Fi 7 (802.11ac).",
    "The WBA expects the first commercial Wi-Fi 7 devices to be released in 2025.",
    "“Despite all of the uncertainty due to the pandemic, 56% of respondents said they were more confident about investing in Wi-Fi than they were a year ago,” declared Tiago Rodrigues, WBA CEO. “This confidence also shows up in the number of WBA members participating in various projects – an increase of 15% compared to 2020 — and the record 20 projects in development or already in progress.",
    "“One example is their strong interest in the convergence of 5G and Wi-Fi 6, including how mobile operators can leverage Wi-Fi as part of their 5G strategy in terms of maximizing coverage and capacity.”"
  ],
  "headers": {
    "3": "Wi-Fi 6E spectrum"
  },
  "links": {}
}