{
  "source": "https://www.techradar.com/news/intel-12th-gen-details-leak-ahead-of-11th-gen",
  "title": "Intel 12th gen details leak ahead of 11th gen",
  "category": "computing",
  "updated": "2021-03-22T18:39:04Z",
  "author": "john-loeffler",
  "summary": "The leak claim some solid performance gains",
  "article": [
    "A number of internal slides detailing Intel's upcoming 12th-generation Alder Lake desktop processor architecture appear to have leaked online - and the details are certainly raising some eyebrows.",
    "The slides, obtained by Videocardz, make bold claims about the new silicon, including up to 20% better single core performance and as much as double the multi thread performance over the previous generation. It isn't specified whether that previous generation is 11th-gen Rocket Lake or Tiger Lake.",
    "Intel's Alder Lake processors are based on the big.LITTLE architecture design pioneered by Arm Ltd. Like the Apple M1 chip, which is also based on Arm's design, Alder Lake will feature a combination of smaller high-efficiency and larger high-performance cores.",
    "By delegating low-level processes that don't require a lot of power to the efficiency cores, the high performance cores are freed up to tackle the heavy duty processing needed by apps like gaming, web browsing, and video.",
    "Earlier this year, AMD surpassed Intel for desktop PC market share for the first time in more than 15 years thanks to the popularity and performance of its Ryzen-series of processors.",
    "While Intel still maintains dominance in mobile and server processor market share, there are indications that AMD is definitely moving to challenge Intel in the mobile computing space at least - especially with their Pro-series mobile CPUs. So, it wouldn't be surprising that Intel might want to shake things up a bit and Alder Lake could definitely be a big part of that effort.",
    "With the success of Apple's M1, Intel is making a smart move by adopting the big.LITTLE architecture for their next generation of CPUs. AMD has scoffed at the move, saying it's far too soon for big.LITTLE to be a truly viable platform, but with the Apple M1, it's hard to argue that the performance gains aren't real - even without software that takes full advantage of the architecture.",
    "But getting into the big.LITTLE game early - can you call it early when you're the third chipmaker to adopt the design after Arm and Apple? - Intel is making an important differentiation between its processors and AMD's. If big.LITTLE takes off in the next few years, Intel could very easily reclaim the CPU crown from AMD the way it did 15 years ago with it's Intel Core processors."
  ],
  "headers": {
    "4": "Can Intel take back the CPU crown from AMD with big.LITTLE?"
  },
  "links": {
    "Videocardz": "https://videocardz.com/newz/exclusive-intel-12th-gen-core-alder-lake-s-platform-detailed",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "AMD surpassed Intel": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years",
    "success of Apple's M1": "https://www.techradar.com/news/is-the-apple-m1-really-the-best-mobile-processor-we-put-it-to-the-test",
    "has scoffed at the move": "https://www.techradar.com/news/amd-has-a-subtle-dig-at-intel-suggesting-alder-lake-cpus-dont-make-sense"
  }
}