{
  "source": "https://www.techradar.com/news/xiaomis-new-wireless-charging-can-charge-a-phone-from-the-other-side-of-the-room",
  "title": "New Xiaomi wireless charging tech charges phones from the other side of the room",
  "category": "phones",
  "updated": "2021-01-29T09:30:03Z",
  "author": "aakash-jhaveri",
  "summary": "You’ll just need to be in the Mi Air Charger’s vicinity",
  "article": [
    "Wireless charging on phones has finally started picking up pace in recent years, but all solutions are still tethered in some way or another. Aiming to address that, Xiaomi has unveiled the new Mi Air Charge technology that can remotely charge your devices without cables or pads.",
    "Xiaomi's new remote charging technology uses two core ways to be able to charge your phone from anywhere in the same room as its charging base; space positioning and energy transmission.",
    "The in-house developed charging tech has five phase interference antennas built in to accurately detect and latch onto a smartphone. Then, 144 antennas transmit concentrated millimetre waves directly to the phone to charge the device.",
    "While Xiaomi has officially unveiled the Mi Air Charge, there's currently no details on when it'll be available or what devices will be compatible with the tech. It's likely you'll need to have a specific smartphone to work with this technology when it is on sale.",
    "The phone will have to be fitted with a similar but miniaturized system, consisting of a beacon antenna to broadcast positioning information with low power consumption, and a receiving array of 14 antennas.",
    "That will then convert the mmWave signal emitted by the charger into electrical energy through a technology called a rectifier circuit.",
    "In its current form, the Mi Air Charge technology is capable of 5W remote charging over a distance of what Xiaomi says is “several metres”. Interestingly, the company claims that the charging speed will not be affected by physical obstacles in the line-of-sight or the number of devices being charged simultaneously.",
    "In practice, this means that you’ll be able to charge your devices – phones, speakers, wearables, and other smart home devices – without having to do anything except be in the room.",
    "Soon after this technology was unveiled, Motorola showed off a similar functionality with its own technology. In the video below, you can see two modified Motorola Edge phones placed away from the charger (80cm and 100cm each) and each are being wireless charged.",
    "Little is known about how this technology works, but Motorola says when this technology is a reality it will be able to charge up to seven phones at one time. It seems this technology is further from release than the Mi Air Charge from Xiaomi, but there's little detail about when either will be released to the public.",
    "Some recent phones now support wireless charging that is almost as fast as wired charging. For instance, the Xiaomi Mi 11 supports 50W wireless charging, which is faster than most of the competition.",
    "However, wireless charging is almost never as elegant as its wired counterparts – there are byproducts such as heat, energy loss and limited functionality. Worst of all, they need to be placed very precisely on a charging pad, making it even more difficult to use while charging than a regular cabled approach.",
    "Apart from the obvious questions around price and availability of these upcoming technologies, both raise a few questions too.",
    "Will the wireless power supply components take up a lot of space within products? What will be the long term repercussions on the battery health? Will it ever reach a speed to match wired solutions? Are there any health hazards of having concentrated energy waves going around all of us? Will it be interoperable with devices from other manufacturers?",
    "Only time will tell how user-friendly this entire approach is. Perhaps we will learn more about about Xiaomi's Mi Air Charge at the upcoming global launch of the Xiaomi Mi 11 series."
  ],
  "headers": {
    "12": "What comes next?"
  },
  "links": {
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review"
  }
}