{
  "source": "https://www.techradar.com/news/nvidia-might-throttle-crypto-performance-of-the-rumored-rtx-3080-ti",
  "title": "Nvidia might throttle crypto performance of the rumored RTX 3080 Ti",
  "category": "computing",
  "updated": "2021-03-04T16:19:45Z",
  "author": "carly-page",
  "summary": "The GPU may use the same hash rate limiter as the RTX 3060",
  "article": [
    "Nvidia will reportedly throttle the cryptomining performance of the upcoming RTX 3080 Ti in order to ensure the graphics card ends up in the hands of gamers.",
    "That’s according to a tweet posted by @kopite7kimi, which claims Nvidia will be implementing the same hash rate limiter that debuted with GeForce RTX 3060 for its next Ampere GPU, the RTX 3080 Ti.",
    "This means that the GPU’s firmware will be able to detect the kind of mathematical hashing operations used to mine Ethereum and throttle the graphic card's performance and cut the mining efficiency go the GPU in half.",
    "According to Videocardz, this mining limiter will also be coming to the rumored Nvidia RTX 3070 Ti, likely a sign this technology will ship with all future Nvidia GPUs - other than the firm’s dedicated cryptomining processors (CMPs).",
    "This reported move is hardly surprising, as Nvidia previously hinted that future RTX 30-series release may have this technology build into the software. The company has the change to ensure its GPUs end up with gamers, who have been trying and failing to get their hands on graphics cards for months.",
    "According to Videocardz’ report, the Nvidia RTX 3080 Ti is now rumored to launch with a GA102 GPU with 10,240 CUDA cores and 12GB of GDDR6X memory, down from the previously reported 20GB of video memory.",
    "The report also suggests that the RTX 3080 Ti will become Nvidia’s flagship model once it debuts, noting that while it won’t replace the Nvidia RTX 3080, it will becoming the company’s main focus as it expects the mining limiter will discourage cryptominers from buying-up this model.",
    "The Nvidia RTX 3080 Ti is expected to launch in April, although it’s worth noting that this date has changed three times already. The GPU was originally scheduled to launch in December, before this was pushed back until January."
  ],
  "headers": {},
  "links": {
    "@kopite7kimi": "https://twitter.com/kopite7kimi/status/1367494156432637954?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1367494156432637954%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fvideocardz.com%2Fnewz%2Fnvidia-geforce-rtx-3080-ti-to-feature-cryptocurrency-mining-limiter",
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "mathematical hashing operations": "https://www.techradar.com/news/how-cryptomining-is-making-it-harder-to-find-the-graphics-cards-you-want",
    "Videocardz": "https://videocardz.com/newz/nvidia-geforce-rtx-3080-ti-to-feature-cryptocurrency-mining-limiter",
    "Nvidia RTX 3070 Ti": "https://www.techradar.com/news/the-nvidia-rtx-3070-ti-might-actually-release-after-cancellation-rumor",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}