{
  "source": "https://www.techradar.com/news/powerful-new-usb-c-charging-for-macbooks-laptops-and-more-could-mean-its-time-to-ditch-the-brick",
  "title": "Powerful new USB-C charging for MacBooks, laptops and more could mean its time to ditch the brick",
  "category": "computing",
  "updated": "2021-05-26T12:10:28Z",
  "author": "jess-weatherbed",
  "summary": "Simple single cable charging",
  "article": [
    "USB-C charging for devices like the 16-inch Macbook Pro or the Microsoft Surface laptop 4 isn't new technology, but its previous 100 watts limitation created the need for different power bricks to be used across different devices. This is annoying for anyone that wanted to charge their device without the specific cable, or anyone simply wanting some consistency across their devices given that most mobile phones on the market are now charged with a USB-C. All that could be about to change, however, as a new specification is in development that will enable up to 240 watts of power to flow through a USB-C cable without the need of a power brick. The future is looking bright for anyone who wants a single charger to be used across every gadget we own.",
    "The USB-IF website states this new USB-C 2.1 will be called 'Extended Power Range', allowing MacBooks and laptops to sufficiently top up their batteries without the need for a power brick, something that is used to compensate for the battery drain caused by a USB-C plug being unable to keep up with a device during power-hungry tasks.",
    "In fact, we could see this tech powering a wide range of products outside of portable computers that demand a higher wattage than the current generation of USB-C can supply, such as office printers, 4K monitors, and beasty gaming laptops.",
    "WCCFTech also points out that this could solve previous bottlenecks on products like the new M1-powered MacBook line, which could result in improvements made to internal components like graphics cards if heavy load tasks life video editing and 3D rendering will no longer cause the battery to drain while being charged.",
    "It's currently reported that these new USB-C products will be visually differentiated in some way from existing ones currently available on the market to avoid any mistaken purchases (required due to the higher risk of arcing while unplugging a live cable), though it's also possible that the cables themselves may need to be thicker to accommodate the full 240 watts of charge. There's no official word on when we will see these new EPR supported cables hit the market, but given USB-IF works closely with almost every major tech manufacturer, such as Apple, AMD, Intel, Dell, Google, and much, much more, it's likely we will see this widely implemented across new hardware when it starts to replace the current standard."
  ],
  "headers": {
    "1": "That's a lot of power"
  },
  "links": {
    "16-inch Macbook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "Microsoft Surface laptop 4": "https://www.techradar.com/reviews/surface-laptop-4",
    "USB-IF website": "https://usb.org/document-library/usb-type-cr-cable-and-connector-specification-revision-21",
    "office printers": "https://www.techradar.com/news/best-all-in-one-printer",
    "4K monitors": "https://www.techradar.com/news/best-4k-monitors",
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "WCCFTech": "https://wccftech.com/usb-c-charging-to-reach-240w-new-specification/",
    "M1-powered MacBook": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020"
  }
}