{
  "source": "https://www.techradar.com/news/tiktok-parent-company-is-hiring-for-a-push-into-semiconductors",
  "title": "TikTok parent company is hiring for a push into semiconductors",
  "category": "computing",
  "updated": "2021-03-16T14:58:09Z",
  "author": "mayank-sharma",
  "summary": "ByteDance confirms news of its diversification into hardware",
  "article": [
    "The owner of the popular video-sharing platform TikTok is now apparently diversifying into manufacturing Arm-based processors.",
    "ByteDance’s move into chips comes on the heels of the news that the Chinese government, following its tech-centered tensions with the US, is looking to bolster spending in key sectors including artificial intelligence, quantum computing, and semiconductors.",
    "Bloomberg caught wind of over a dozen job postings by the company related to semiconductors in multiple Chinese cities including Shanghai and Beijing. A ByteDance spokesperson affirmed that it’s looking to hire talent as it diversified into the field and hopes to build server chips based on the Arm architecture.",
    "TikTok has been ByteDance’s most popular endeavor since it came into existence in 2012. Despite recent hiccups in two of its biggest markets, US and India, ByteDance is reportedly gearing up to go public, and could do so as the most valuable private company to date, with a potential valuation of $180 billion.",
    "ByteDance’s move into semiconductors is also important as according to reports, Chinese search engine giant, Baidu, has also recently raised $230 million for its AI chip division amidst plans to carve a separate subsidiary for its hardware business.",
    "Major silicon valley companies such as Google and Apple have taken advantage of Arm’s license-based model to create optimized semiconductors for use in their products.",
    "Given ByteDance’s specialization in social media and AI recommendation engines, it wouldn’t be surprising if the company decides to create customized chips tailored for these workloads.",
    "Via: Bloomberg"
  ],
  "headers": {
    "3": "Following the experts"
  },
  "links": {
    "video-sharing": "https://www.techradar.com/best/best-ways-to-share-big-files",
    "processors": "https://www.techradar.com/news/best-processors",
    "bolster spending in key sectors": "https://www.techradar.com/news/china-five-year-plan-aims-for-ai-and-quantum-supremacy",
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "server": "https://www.techradar.com/news/best-small-business-servers",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-03-16/bytedance-begins-hiring-for-possible-push-into-semiconductors?srnd=technology-vp"
  }
}