{
  "source": "https://www.techradar.com/news/ps5-six-months-on-sonys-console-is-off-to-a-strong-start-but-concerns-remain",
  "title": "PS5 six months on: a strong start, but concerns remain",
  "category": "gaming",
  "updated": "2021-05-30T14:00:25Z",
  "author": "adam-vjestica",
  "summary": "Opinion: The PS5 is still the number one contender... for now",
  "article": [
    "Has it really been six months since the PlayStation 5 launched? Wow, I guess time flies when you’re trying to find a PS5 in stock.",
    "Even though the PS5 has reached its first major milestone, it would be wrong to dismiss the fact that millions of people are still searching for Sony’s elusive white and black two-toned machine. It’s slightly mind-boggling to think that after being on sale for over half a year, some people are yet to experience what Sony’s new console has to offer. And that’s a shame, regardless of where your gaming allegiance lies.",
    "While this isn’t exactly an ideal situation for consumers – or indeed Sony – the upside is that the PS5 has already improved in a number of pleasing ways since it went on sale on November 2020. Annoying kinks have been ironed out, new quality-of-life features have arrived, and more compelling PlayStation exclusives are on the way. The wait might be excruciating for some, but you can at least take comfort knowing that when you do manage to secure a PS5, you’ll be getting a better console as a result.",
    "But what has it been like owning Sony’s next-gen console from the very beginning? And do you really need to get a PS5 right now? Well, it hasn't been completely smooth sailing, if I’m honest, but it’s clear that the PS5 is still the number one next-gen console to beat right now.",
    "My opinion of the PS5 has tended to ebb and flow both positively and negatively, often changing with each passing month.",
    "I played the PS5 religiously at the start and couldn’t wait to hear that familiar “beep” every time I turned it on. Exclusive games like Demon’s Souls, Marvel’s Spider-Man: Miles Morales and Sackboy: A Big Adventure were all extremely enjoyable, and I also spent some time revisiting PS4 games that I missed out on like Ghost of Tsushima, which is now playable at a gloriously silky-smooth 60fps. (I’ll be picking up The Last of Part 2 for the very same reason.)",
    "However, it’s the PS5’s pack-in game, Astro’s Playroom, that has left the biggest impression on me. It’s a genuinely magical experience and easily the most fun I’ve had on the PlayStation 5 to date, partly due to the way it shows off the PS5 DualSense controller.",
    "The first night I played Astro’s Playroom, my partner and I gleefully passed the controller to one another and said things like, “Oh wow, you need to feel this. It actually feels like you’re jumping into water.” That’s a precious gaming memory that I will cherish for the rest of my life, so I thank the PS5 for that.",
    "In fact, I attribute a lot of my goodwill towards the PS5 because of its clever new pad. It almost reminds me of when I first played the Wii; I just wanted to run out and tell people about how damn cool it was and how they had to try it for themselves. I just hope that developers continue to utilize it (like in Returnal, which uses the haptic feedback to mimic the sensation of rainfall in your hands), as some of the implementations by third-parties, and even Sony, have been rather lackluster.",
    "I still love the PS5’s DualSense controller, then, and the majority of Sony’s exclusive games have been truly exceptional (apart from, Destruction AllStars). But the PS5 has some frustrating flaws that continue to grind my gears.",
    "Even though Sony’s new system has been sitting proudly on my shelf since November, I still absolutely hate the space-age look of the console. I can’t believe how big the bloody thing is, even now, and it only just fits into my entertainment center. It looks stupidly awkward when placed horizontally, too.",
    "It might sound like I’m being overdramatic, but I disliked the look of the PS5 so much that I immediately bought dbrand’s Dark Plates when they went on sale. And let me tell you: the PS5 looks so much better in black. I’ve already pre-ordered the Midnight Black PS5 DualSense controller to complete the look.",
    "The PS5 isn’t quite as silent as I first thought, either. My particular unit exhibits some noticeable coil whine when playing certain games. I almost exclusively play games wearing headphones, but whenever I take them off, there have been times where I can hear a high-pitched electrical buzzing noise coming from the console. It’s not a deal breaker, but it’s annoying nonetheless and at odds with the Xbox Series X, which barely musters a whisper.",
    "And then there are the PS5 games themselves. While I’ve compared the PlayStation 5 to Microsoft’s Xbox Series X numerous times in the past when it comes to features, there’s no doubt that the PS5 isn't as good value, and requires much more of an investment to enjoy to its fullest. The big hitters cost $70 / £70 to play, and it almost feels like Sony is holding its player base to ransom with that price point.",
    "Paying $70 for a game is still a big point of contention for me, and feels needlessly restrictive when the PS5’s closest competitor has an ever-growing buffet of gaming delicacies to gorge on. Yes, those games aren’t of the caliber of Sony’s offering, at least not yet. But there’s a reason why McDonald’s hasn’t been run out of business by a gourmet burger chain.",
    "Sony’s internal storage solution is also a concern. The PlayStation only has 667GB of internal storage for PS5 games, which is a paltry amount when most demand at least 50GB of space. Yes, the PS5 SSD’s compression tech can help, but we should be able to expand the PS5’s internal storage by now, or at least know how much it will cost to do so. The fact that you can expand the storage capacity on both Xbox Series X and Xbox Series S since launch makes this problem seem all the more ridiculous.",
    "The PS5 also lags behind the Xbox Series X when it comes to features that – feasibly – it really should have. There’s no variable refresh rate support for compatible displays, and you can’t output at 1440p for some frankly unknown reason. The lack of Dolby Vision and Dolby Atmos support also seems short-sighted, as though Sony simply wants to push its 3D audio on consumers, even if I personally consider it to be an inferior option to Atmos and DTS Headphone:X. Games that support 120fps on PS5 haven’t even reached double figures yet, either, while there are currently 74 titles on Xbox Series X that do.",
    "If there’s one thing that will continue to pay dividends for Sony and drive PS5 sales, though, it’s the strength of its first-party studios. With 25 first-party titles on the way in the near future, the company will have to keep delivering on the promise of the PS5 having the best games in the business. But as we’ve seen on PS4, it can’t always hit those heady heights.",
    "There’s no doubt that Horizon Forbidden West looks phenomenal, as does Ratchet and Clank: Rift Apart, but those experiences take time to craft. And what happens if one of them is a dud? I’ve continually found myself pulled to Microsoft’s Xbox Series X simply because there’s more games to play right now, and all for the small price of a monthly subscription. FPS Boost has also made me revisit titles from years ago, much like you would after upgrading your graphics card on PC, which makes games I already own better than ever.",
    "Yes, the Xbox Series X hasn’t delivered when it comes to genuine exclusives (though it's only a matter of time until all the studios Microsoft bought begin to deliver), but even without standout titles, it continues to grab my attention. I'm aware that most of the Xbox Game Pass library isn’t going to compete with the likes of Uncharted 4 anytime soon, but I’m always looking for something new and exciting to play – alone or with friends. The service encourages me to play new games that I previously wouldn’t have touched, and makes Sony's traditional methods of delivering games look outdated.",
    "That being said, with its gorgeous new UI, compelling future games lineup and wonderful controller, the PS5 still has the wow factor. However, Sony needs to continue to push forward instead of waiting for the competition to kick it into gear, something which has been far too guilty of in the past."
  ],
  "headers": {
    "4": "The good, the bad, and the DualSense",
    "9": "Reality check",
    "13": "Cash for gold",
    "17": "Uncharted future"
  },
  "links": {
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "PS5 in stock": "https://www.techradar.com/news/where-to-buy-ps5",
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Marvel’s Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Sackboy: A Big Adventure": "https://www.techradar.com/reviews/sackboy-a-big-adventure-review",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "The Last of Part 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Astro’s Playroom": "https://www.techradar.com/news/astros-playroom-will-make-you-fall-in-love-with-the-ps5-dualsense-controller",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Destruction AllStars": "https://www.techradar.com/news/destruction-allstars-is-worth-a-spin-but-lacks-longevity",
    "dbrand’s Dark Plates": "https://www.techradar.com/news/okay-so-i-kind-of-love-the-darkplates-that-have-given-me-a-black-ps5",
    "Midnight Black PS5 DualSense controller": "https://www.techradar.com/news/ps5s-dualsense-gets-two-new-color-options-and-you-can-pre-order-them-now",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5 isn't as good value": "https://www.techradar.com/news/ps5-isnt-good-value-compared-to-xbox-series-x-and-im-sick-of-it",
    "internal storage solution is also a concern": "https://www.techradar.com/news/why-sonys-ps5-internal-storage-solution-has-me-concerned",
    "PS5 SSD’s compression tech": "https://www.techradar.com/news/more-ps5-games-are-benefitting-from-sonys-ssd-compression-tech-and-its-impressive",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "can’t output at 1440p": "https://www.techradar.com/news/ps5-1440p-support-how-much-longer-do-we-have-to-wait",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Games that support 120fps on PS5": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support",
    "25 first-party titles on the way": "https://www.techradar.com/news/over-25-first-party-ps5-games-are-in-development-right-now",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "FPS Boost": "https://www.techradar.com/news/list-of-xbox-fps-boost-games-on-xbox-series-x-and-xbox-series-s",
    "graphics card on PC": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Uncharted 4": "https://www.techradar.com/news/ps4-hit-uncharted-4-could-be-headed-to-pc"
  }
}