{
  "source": "https://www.techradar.com/news/diablo-4s-rogue-class-unveiled-with-its-very-own-trailer-at-blizzcon-2021",
  "title": "Diablo 4’s Rogue class unveiled with its very own trailer during BlizzCon 2021",
  "category": "gaming",
  "updated": "2021-02-20T08:43:31Z",
  "author": "emma-boyle",
  "summary": "Cover your ears",
  "article": [
    "BlizzCon 2021 is now underway and, as part of it, Blizzard has revealed Diablo 4’s fourth character class: the Rogue.",
    "Joining the already-revealed Sorceress, Barbarian and Druid classes, the Rogue is a character that hasn’t been seen since the original Diablo, though as a Dexterity class it bears some similarities to Assassin and Demon Hunter from Diablo 2 and 3.",
    "In an accompanying announcement trailer, the Rogue is shown to be fast, ruthless, armed with a plethora of weapons and out to steal some ears. You can watch the trailer for yourself below:",
    "Blizzard itself has described her as “an adaptable, agile warrior who can specialize in ranged or close quarters combat. She can best any foe with her imbued weapons, perform powerful combo attacks, and can augment her arsenal with deadly poisons and shadow magic to slay demons with impunity.”",
    "In an interview with Polygon, Diablo 4 game director Luis Barriga and art director John Mueller have said that the character of the Rogue “actually feels really fresh” for Diablo 4. Though the team has taken the Rogue from the original Diablo “as an aesthetic and fantasy starting point” and there are elements of of the Assassin and Demon Hunter classes in there, there are also “some new ideas that we felt specifically appropriate for the Diablo rogue.”",
    "The Rogue’s more unique features will include a weapon imbuing system and the options to choose between three different specializations for different styles of play: Combo Points, Shadow Realm, and Exploit Weakness. This makes the Rogue a more flexible character class in a way that the others aren’t and it seems that there will be customization freedom to create the Rogue you want.",
    "Now that the Rogue has been revealed, we’re still waiting for the reveal of Diablo 4’s fifth character class but we have no idea when that’ll be coming.",
    "BlizzCon 2021 hasn’t brought us a release date for Diablo 4 but Activision Blizzard has recently said that it doesn’t expect the game to launch in 2021, so we’re looking at 2022 at the earliest before we get to commit to the Rogue class.",
    "Before then, though, Blizzard has finally confirmed the long-rumoured Diablo 2 remake. Expected to release in 2021, this is the perfect way to fill in the time and re-visit a classic in 4K and, for the first time, on consoles."
  ],
  "headers": {
    "4": "Flexibility"
  },
  "links": {
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "Polygon": "https://www.polygon.com/2021/2/19/22290230/diablo-4-rogue-class-reveal-blizzard-blizzcon",
    "has recently said": "https://www.techradar.com/news/overwatch-2-and-diablo-4-release-dates-slip-beyond-2021",
    "finally confirmed the long-rumoured Diablo 2 remake": "https://www.techradar.com/news/diablo-2-resurrected-is-a-4k144hz-remaster-of-diablo-2-for-pc-and-consoles"
  }
}