{
  "source": "https://www.techradar.com/news/google-offers-new-timeline-for-the-death-of-browser-cookies",
  "title": "Google offers new timeline for the death of browser cookies",
  "category": "computing",
  "updated": "2021-07-27T11:26:46Z",
  "author": "joel-khalili",
  "summary": "Google is working to address concerns with FLoC and other new web technologies",
  "article": [
    "Google has published an updated timeline for Privacy Sandbox, an initiative designed to improve user privacy on the web without meddling with the economics of digital advertising.",
    "Updated monthly, the timeline divides the technology proposals into subsections, such as “fight spam and fraud on the web” and “show relevant content and ads”. It also provides a sense of when Google expects to be able to roll out each technology in full.",
    "Currently, Google hopes to be able to phase out third-party web cookies by Q3 2023, thanks to the combined effect of a number of the Privacy Sandbox proposals. Individual elements, such as the controversial FLoC, will transition from “discussion” to “testing” phase imminently.",
    "However, these dates could be subject to change and Google has stressed its commitment to a rigorous testing and feedback process.",
    "“It’s difficult to forecast how long the open, public process for developing a new web technology might take, as the new APIs may receive a lot of feedback or require multiple testing cycles,” explained Google.",
    "“These extended discussions and testing stages often produce better, more complete solutions, and the timeline for testing and ready for adoption of use cases might change accordingly.”",
    "The most hotly debated element of Privacy Sandbox is FLoC (short for Federated Learning of Cohorts), an alternative to third-party cookies designed to anonymize individual web users.",
    "Instead of creating profiles for individual users, FLoC groups thousands of people with similar browsing habits into so-called cohorts, which give advertisers a less-specific but still valuable target to aim at.",
    "Within the last year or so, major browsers such as Safari have moved to block cookies outright, but Google has taken much less of a hard line. According to the search giant, it is crucial that a viable alternative is established before cookies are consigned to the dustbin once and for all.",
    "“When other browsers started blocking third-party cookies by default, we were excited about the direction, but worried about the immediate impact,” wrote Marshall Vale, Product Manager for Privacy Sandbox.",
    "“Excited because we absolutely need a more private web, and we know third-party cookies aren’t the long-term answer. Worried because today many publishers rely on cookie-based advertising to support their content efforts, and we had seen that cookie blocking was already spawning invasive workarounds even worse for user privacy.”",
    "However, not everyone shares Google’s perspective. A drive to preserve the ability of advertisers to target users, even if only in aggregate, was bound to raise eyebrows, given advertising makes up for the 80% of Google revenue each year.",
    "Privacy advocates at the Electronic Frontier Foundation (EFF) have suggested FLoC will create a new privacy problem for every issue it solves, essentially providing advertisers with a different arsenal of tools to play with.",
    "Concerns have also been expressed by members of the browser, search and social media industries (such as Brave, Edge and DuckDuckGo), who have moved to disable FLoC in its current form.",
    "Despite criticism, though, Google appears to have every intention of forging ahead with FLoC. The “origin trial” for the technology came to an end on July 13 and Google is currently making tweaks based on feedback.",
    "Discussions about the various elements of Google’s Privacy Sandbox will also be conducted by the W3C Web Incubator Community Group (WICG), which will have some say in the direction Google takes.",
    "Via The Register"
  ],
  "headers": {
    "6": "Google FLoC"
  },
  "links": {
    "updated timeline": "https://www.privacysandbox.com/timeline/",
    "digital advertising": "https://www.techradar.com/best/best-online-marketing-services",
    "FLoC": "https://www.techradar.com/news/what-the-floc-a-look-at-googles-alternative-to-cookies",
    "browsers": "https://www.techradar.com/best/browser",
    "The Register": "https://www.theregister.com/2021/07/26/google_privacy_sandbox_roadmap/"
  }
}