{
  "source": "https://www.techradar.com/news/fitbit-rolls-out-new-health-and-fitness-tools-but-only-for-some-users",
  "title": "Your Fitbit could get an important update today – with a bonus for some lucky users",
  "category": "fitness",
  "updated": "2021-06-02T08:40:40Z",
  "author": "cat-ellis",
  "summary": "New tools for Fitbit Versa 3 and Sense",
  "article": [
    "Fitbit is rolling out a major update for its two premium fitness trackers. Starting June 2, Fitbit OS 5.2 will begin rolling out to the Fitbit Sense and Fitbit Versa 3, adding a range of new health and fitness features.",
    "Once your device receives the update, you'll be able to check your blood oxygen saturation (SpO2) levels on your wrist, without opening the Fitbit app on your phone. Your Fitbit will show you your nightly average SpO2 value, plus the ranges from your previous night's sleep so you can check for patterns and anomalies.",
    "Fitbit Sense owners can already create their own personalized high and low heart rate alerts, and this tool is now coming to the Versa 3 as well. If your watch detects a heart rate above or below your set threshold, you will receive notifications on your wrist and phone, with the option to take a survey in the app that you can share with your doctor if you're concerned.",
    "The update will also make the most of the Sense and Versa 3's large color screens, introducing new goal celebrations when you hit targets such as activity minutes and steps, plus the ability to switch watch faces by long-pressing the clock face rather than delving into the settings.",
    "Voice assistants are getting an upgrade too, with new tools for Google Assistant and Amazon Alexa. Alexa voice commands are now available in 10 extra countries, and Sense and Versa 3 owners will soon be able to receive real-time audible responses from Google Assistant. It's already possible to use Google Assistant voice commands to control smart home devices, ask questions, and set reminders and alarms, but now you'll also receive spoken responses in addition to text on the watch's screen.",
    "A small sample of Fitbit Premium users will also gain access to a new tool that detects snoring and other noise at night.",
    "The snore detection feature was discovered in installation files for the Fitbit Android app last week. At the time we suggested that it would likely only be available to Fitbit Sense and Versa users, as these are the only devices with microphones to pick up nocturnal noise, and that is indeed the case.",
    "If you're part of the trial group, you'll receive an invitation to join; the tool won't be mandatory or activated by default. If not, don't worry; we anticipate it will be rolled out more widely soon.",
    "As voice assistant tech becomes more affordable, hopefully, we'll see microphones integrated into future Fitbit Charge and Inspire devices, bringing snore detection and its associated features to a wider range of users."
  ],
  "headers": {
    "5": "Sleep soundly"
  },
  "links": {
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Google Assistant": "https://www.techradar.com/news/9-things-google-assistant-can-do-that-you-may-not-know-about",
    "Amazon Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "was discovered in installation files": "https://www.techradar.com/news/fitbit-devices-are-getting-a-big-sleep-tracking-update-but-not-for-everyone"
  }
}