{
  "source": "https://www.techradar.com/news/sony-a9s-48-inch-oled-price-specs-and-features",
  "title": "Sony A9S 48-inch OLED price, specs and features",
  "category": "televisions",
  "updated": "2021-03-05T11:39:58Z",
  "author": "henry-st-leger",
  "summary": "What you need to know",
  "article": [
    "After a Sony 48-inch OLED? The Sony A9S may be what you need.",
    "You can’t fault Sony for getting the most out of one of its most impressive televisions. The 2019 Sony A9G/AG9 was an excellent OLED TV, and it got a new lease of life with a 48-inch size, a year after its initial release, at a lower-than-ever price point.",
    "Called the A9S in the US, or more simply as the A9 in the UK and Ireland, the smaller model packs in everything we loved about its larger iterations.",
    "The (relatively) compact 48-inch size makes it a bit of an outlier in today's OLED market, given only a small handful of televisions feature the new panel measurement.",
    "But with only a single size to recommend it, and plenty of other 2021 Sony TVs on the way, you may be wondering whether the Sony A9S is the right choice for you. This guide will run through the pricing, specs, and capabilities of this Sony OLED, as well as its similarities and differences with other televisions in the manufacturer's range.",
    "The Sony A9S/A9 comes in a single 48-inch size, which retails for $1,799 / £1,799, and is available in the US and UK.",
    "It is technically a resize of the 2019 A9G/AG9 OLED, which came in 55-inch, 65-inch and 77-inch sizes. The A9G was always pretty pricey, making the smaller size very welcome in theory, though it's worth noting that the 55-inch model is currently cheaper than the 48-inch at just £1,599 in the UK.",
    "It's still $2,299 in the US, though, making the 48-inch A9S alternative a smarter buy in North America. Australian availability is yet to be confirmed.",
    "While the Sony A8H OLED also repackages a lot of the A9G's specs and capabilities at a more affordable price, you won't find it at a 48-inch size – though the A8H is probably a better bet for those wanting a new Sony 4K TV at 55 inches or above.",
    "So, what's so exciting about the Sony A9S? Well, its 48-inch size makes it a great bet for those wanting a high-spec OLED TV without the expected massive screen.",
    "The TV's dimensions come in at 1,069 x 624 x 58mm without the stand, and weighs around 13.9kg, according to Sony. It also makes use of a central TV stand, rather than the adjustable feet and positions of the A90J or A80J models for 2021.",
    "As a 4K HDR television, you're getting state-of-the-art streaming resolution and an expanded dynamic range for enhanced color and contrast. You'll get Sony's X-Motion Clarity feature for smooth, judder-free movement, as well as Acoustic Surface Audio to literally vibrate audio out of the OLED panel itself. The total sound output is 25W, divided across two 10W actuators and one 5W subwoofer, with Dolby Atmos support for a heightened surround sound effect.",
    "As an OLED TV, of course, you can expect very deep blacks and that fabled 'infinite' contrast ratio to really make images pop, and Sony has very good form here.",
    "Google Assistant and Alexa are naturally both here, and you'll be using an Android smart TV platform that largely improves on its past iterations. Apple AirPlay, Apple HomeKit, and Bluetooth 4.2 (not 5.0) are supported too.",
    "Inputs include three USB ports and four HDMI ports – though at the 2.0 standard rather than HDMI 2.1. That means 4K can only be transmitted at 60Hz over a cable, though you can still get 120Hz playback at Full HD and below.",
    "It's worth noting that HDR10+ isn't supported, unlike on new Samsung TVs – though you will get the Dolby Vision dynamic HDR standard favored by Netflix and many 4K Blu-rays. IMAX Enhanced and Netflix Calibrated Mode are supported too.",
    "The Sony A9S/A9 is currently the only 48-inch OLED put out by Sony, making it your best bet for an OLED at that size.",
    "There are, however, some new high-spec Sony TVs worth keeping an eye on for this year. The 4K flagship is the A90J OLED, and there's a step-down A80J OLED model too.",
    "Both feature the upgraded Cognitive Processor XR, new for 2021, rather than the X1 Ultimate chip found in the A9S and 2020's top Sony models.",
    "Sony tells us that the XR utilizes a “completely new processing method designed to replicate the ways humans see and hear”, detecting a so-called “focal point” in the TV’s picture to focus processing around the more important parts of the image.",
    "“While conventional Artificial Intelligence (AI) can only detect and analyze picture elements like color, contrast and detail individually, the new processor can cross-analyze an array of elements at once, just as our brains do,” Sony says.",
    "The A90J will also make use of a Google TV smart platform, rather than the Android TV software usually seen on high-end Sony TVs (like the A9S), which is expected to be something of an improvement.",
    "For those with narrow counters or media cabinets, too, the A90J and A80J will come with adjustable feet for customizable placement, including the option of a \"hero position to eliminate distractions and a sound bar position to elevate the TV and integrate a soundbar system.\"",
    "There are a few things these newer models have over the A9S, a 2020 iteration of a 2019 TV, so those wanting the latest model may want to hold fire. And we do expect Sony to eventually release another 48-inch OLED, possibly in late 2021. However, if you want an OLED screen at 48 inches, and you're not enticed by the LG CX OLED or UK's Philips OLED+935, the A9S/A9 is still your best bet."
  ],
  "headers": {
    "5": "Sony A9S OLED pricing and sizes",
    "9": "Sony A9S OLED specs and features",
    "16": "Sony TV 2021: should you buy a newer TV?"
  },
  "links": {
    "48-inch OLED": "https://www.techradar.com/best/48-inch-oled-tv",
    "Sony A9G/AG9": "https://www.techradar.com/reviews/sony-bravia-a9g-ag9-oled",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "2021 Sony TV": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "Sony A8H OLED": "https://www.techradar.com/reviews/sony-bravia-a8h-oled-tv",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Acoustic Surface Audio": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "smart TV platform": "https://www.techradar.com/news/best-tv",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "4K Blu-rays": "https://www.techradar.com/news/video/blu-ray/the-best-4k-ultra-hd-blu-ray-movies-1329414",
    "A90J OLED": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "A80J OLED": "https://www.techradar.com/news/sony-a80j-oled-price-specs-release-date",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "LG CX OLED": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Philips OLED+935": "https://www.techradar.com/reviews/philips-oled935-tv"
  }
}