{
  "source": "https://www.techradar.com/news/battlenet-introduces-global-friends-list-hinting-at-bigger-things-to-come",
  "title": "Battle.net introduces global friends list, hinting at bigger things to come?",
  "category": "computing",
  "updated": "2021-06-11T14:53:50Z",
  "author": "darren-allan",
  "summary": "Will we eventually see cross-region play?",
  "article": [
    "Battle.net has been updated to implement a global friends list, meaning gamers will be able to add friends from different regions other than their home turf, and chat with them.",
    "As spotted by Wowhead, this happened a few days back, with Blizzard stating: “Battle.net is a place for players to engage with their games and connect with each other. Now, we’re taking those connections global!",
    "“Starting June 8, 2021, your friends in Europe, Americas, and Asia will be merged into a global friends list.",
    "“You can chat, create groups, and see what your friends are playing – all in one place.”",
    "This is obviously a useful update on the sociability front, but the real hope is that the introduction of chat with friends on a global basis might indicate that eventually, you’ll be able to seamlessly play with folks from any region in Blizzard’s big games like World of Warcraft.",
    "Of course, there’s been no official suggestion that this might be the case, but this move is the first step down that potential road, perhaps.",
    "Speaking of World of Warcraft, Burning Crusade Classic was just unleashed at the start of June. Also, World of Warcraft: Shadowlands, the most recent expansion for the main game, is due a big update called ‘Chains of Domination’ which will land later in 2021. That’ll introduce a new zone and a fresh 10-boss raid, the Sanctum of Domination.",
    "Via VG247"
  ],
  "headers": {
    "4": "Leading to bigger things?"
  },
  "links": {
    "Wowhead": "https://www.wowhead.com/news/global-cross-region-friends-lists-coming-to-battle-net-322733",
    "World of Warcraft: Shadowlands": "https://www.techradar.com/reviews/world-of-warcraft",
    "Chains of Domination": "https://www.techradar.com/news/world-of-warcraft-shadowlands-to-get-a-huge-update-with-chains-of-domination",
    "VG247": "https://www.vg247.com/2021/06/11/battle-net-now-allows-make-friends-around-world-games-still-region-locked/"
  }
}