{
  "source": "https://www.techradar.com/news/movie-firms-want-vpn-firms-to-log-pirates",
  "title": "Movie firms want VPN firms to log pirates",
  "category": "computing",
  "updated": "2021-09-03T20:33:50Z",
  "author": "anthony-spadafora",
  "summary": "Movie companies want to hold VPN providers liable for their users pirating online content",
  "article": [
    "The fight against online piracy continues and now several large movie companies are taking a number of VPN providers to court due to how their services can be used to illegally download films and bypass other online restrictions.",
    "As reported by TorrentFreak, the new lawsuit, which was recently filed at a federal court in Virginia, targets Surfshark, VPN Unlimited, Zenmate and ExpressVPN while accusing the companies of being involved in widespread copyright infringement.",
    "In addition to using VPNs for torrenting, the movie companies have taken issue with the fact that these services can be used to bypass geographic restrictions and access the catalogs of streaming services that are only available in other countries.",
    "In their lawsuit, the movie companies also highlight the promotional pages found on the websites of many VPN providers in which they claim that their services can bypass blocking efforts and other restrictive measures.",
    "In the same way that internet service providers (ISPs) log and notify their customers after they've been caught torrenting films online, the movie companies in the lawsuit want VPN providers to adopt a similar approach.",
    "According to the lawsuit, the rightsholders of pirated films have sent thousands of copyright infringement notices to web hosting companies that were reportedly forwarded to the VPN companies involved. However, the VPN providers can't pinpoint individual subscribers and many offer no-log VPNs that are almost impossible to trace.",
    "As few VPN users opt for more expensive plans with a dedicated IP address, the majority of users are connected to shared IP addresses that can't be directly tied to a single user. As a result, VPN companies don't know which of their subscribers are flagged by copyright infringement notices.",
    "The movie companies are arguing that based on these claims, the VPN services in question are liable for copyright infringement and have requested compensation for the alleged damage. However, they also want VPN services to begin blocking known torrenting sites such as The Pirate Bay, RARBG and YTS. The movie companies are also going a step further though by requesting an order that requires VPN providers to terminate the accounts of subscribers that receive three unique copyright notices within 72 hours.",
    "We'll likely hear more as the lawsuit progresses but until then, while using a VPN can be an excellent way to protect your privacy online, torrenting films isn't only illegal but can also infect your devices with malware and other viruses and could potentially even lead to identity theft.",
    "Via TorrentFreak"
  ],
  "headers": {
    "4": "Logging pirates"
  },
  "links": {
    "online piracy": "https://www.techradar.com/news/a-crackdown-on-piracy-and-illegal-streaming-is-coming",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "reported": "https://torrentfreak.com/movie-companies-want-vpns-to-log-user-data-and-disconnect-pirates-210830/",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "VPN Unlimited": "https://www.techradar.com/reviews/pc-mac/software/utilities/keepsolid-vpn-unlimited-1325618/review",
    "Zenmate": "https://www.techradar.com/reviews/zenmate",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "VPNs for torrenting": "https://www.techradar.com/vpn/best-vpn-for-torrenting",
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "ISPs": "https://www.techradar.com/news/fewer-americans-trust-isps-to-look-out-for-their-best-interests",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "no-log VPNs": "https://www.techradar.com/vpn/private-vpn-no-log-anonymous",
    "dedicated IP address": "https://www.techradar.com/news/cyberghost-boosts-vpn-privacy-with-anonymous-dedicated-ip",
    "shared IP addresses": "https://www.techradar.com/news/should-you-set-up-your-own-vpn-server",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "TorrentFreak": "https://torrentfreak.com/movie-companies-want-vpns-to-log-user-data-and-disconnect-pirates-210830/"
  }
}