{
  "source": "https://www.techradar.com/news/google-pixel-foldable-phone-may-come-in-2021-but-dont-expect-it-to-replace-pixel-6",
  "title": "Google Pixel foldable phone may come in 2021, but don't expect it to replace Pixel 6",
  "category": "phones",
  "updated": "2021-02-24T09:55:27Z",
  "author": "james-peckham",
  "summary": "Expect many more foldable phones this year",
  "article": [
    "Could Google be the next big name in foldable phones? According to a new report, the company is working on a bending device and it may be ready for markets before the end of 2021.",
    "The report comes from a Korean source called The Elec that says Oppo, Xiaomi and Google are all making orders with Samsung Display - that's a separate company to the one that makes consumer technology like Samsung phones - to buy foldable screen tech.",
    "This isn't the first time we've heard the Google name in the foldable phone conversation, but the report says the company is planning to purchase 7.6-inch screens for an upcoming phone.",
    "The Elec report says that smartphones using this display technology are set to be revealed this year, but it's not entirely clear whether we'll see devices from all three manufacturers or just one or two of the names.",
    "We can't yet determine if this Google handset will be a clamshell foldable, or something that more resembles the Huawei Mate X2 or the Samsung Galaxy Z Fold 2.",
    "According to the report, Oppo is looking for a clamshell-appropriate 7.7-inch screen while Xiaomi's order includes an 8.03-inch that would be used for the inside of a phone that folds out like a book.",
    "It's thought this foldable Pixel would be available as an alternative to the Google Pixel 6, so this is unlikely to be a replacement for the company's flagship handset. We don't yet know when the Google Pixel 6 is set to land, but we're expecting it to be toward the end of 2021.",
    "Take this with a pinch of salt as Google may change its plans for a closing phone in the coming months, but this is our best sign yet that the company is experimenting with a foldable Pixel.",
    "We've heard in the last few days that Google may be resurrecting its Google Pixel XL line for its next smartphones, as well as a leak around the Google Pixel 5a that shows a remarkably similar device to 2020's handsets.",
    "Via BGR"
  ],
  "headers": {
    "5": "What about Xiaomi and Oppo?"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "The Elec": "http://www.thelec.net/news/articleView.html?idxno=2413",
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones",
    "Huawei Mate X2": "https://www.techradar.com/news/huawei-mate-x2",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Pixel XL line": "https://www.techradar.com/news/google-pixel-6-could-revive-the-xl-sized-pixel-phone-and-bring-another-new-feature",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "shows a remarkably similar": "https://www.techradar.com/news/leaked-google-pixel-5a-renders-show-a-suspiciously-familiar-design",
    "BGR": "https://bgr.com/2021/02/23/foldable-pixel-6-rumor-samsung-display-screen/"
  }
}