{
  "source": "https://www.techradar.com/news/technics-new-true-wireless-earphones-cut-out-ambient-noise-to-focus-on-your-voice",
  "title": "Technics' new true wireless earphones cut out ambient noise to focus on your voice",
  "category": "audio-visual",
  "updated": "2021-09-29T21:34:55Z",
  "author": "nick-pino",
  "summary": "Are these the best true wireless earbuds for phone calls?",
  "article": [
    "While Technics might have a reputation for pristine audio replication, its latest true wireless earphones focus instead on the sound of your voice when you’re on a phone call.",
    "The two new earphones are called the EAH-AZ60 and the EAH-AZ40, both of which feature the company’s new JustMyVoice technology to detect voices when speaking and eliminate background noise during phone calls.",
    "Both pairs of buds release in October, and have near-identical designs with the same IPX4 rating and multipoint pairing.",
    "The difference between the two models is that the AZ60 will offer active noise cancellation on top of the JustMyVoice technology, while the AZ40 model will not. In addition, the AZ60 supports the LDAC audio codec and has 8mm drivers versus the 6mm drivers on the AZ40. That said, you’re looking at $229 / £199 (around AU$300) for the AZ60 and $149 / £129 (around AU$200) for the AZ40.",
    "It’s interesting that Technics is targeting call quality with its latest true wireless earphones – it’s an area that certainly doesn’t get enough attention from headphone makers.",
    "The reason why call quality is less-than-ideal on most true wireless earbuds is because they use a beamforming microphone array that should, in theory, only pick up noise coming from in front of your face, but instead seems to pick up all the ambient noise in the area.",
    "Companies like Technics are trying to fix that by adding in more microphones to pick up your voice and software that can eliminate background noise on the fly. That’s something we’ve seen in some of the best true wireless earbuds like the Sony WF-1000XM4 in the past, and it’s good to see other brands doubling down on the technology.",
    "We’ll have to hear them – and have others hear us – before we can pass any sort of judgment on Technics’ new true wireless earphones, but the direction is encouraging and could be incredibly helpful – as these days we use earbuds for much more than just our favorite music."
  ],
  "headers": {
    "4": "Analysis: why is call quality so bad in true wireless earbuds?"
  },
  "links": {
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds"
  }
}