{
  "source": "https://www.techradar.com/news/resident-evil-village-ending-explained-a-spoiler-filled-look-at-what-it-all-means",
  "title": "Resident Evil Village ending explained: a spoiler-filled look at what it all means",
  "category": "gaming",
  "updated": "2021-05-08T16:00:47Z",
  "author": "vic-hood",
  "summary": "Major Resident Evil Village spoilers ahead",
  "article": [
    "Resident Evil Village is one of the best modern-day Resident Evil entries, and its story is a big part of that. Despite Village only having a run-time of around 10 hours, it manages to pack in a bunch of story twists, turns and misdirections, resulting in a game that’s as compelling in its storytelling as it is action-packed.",
    "Capcom has smartly blended the overarching Resident Evil lore into the story of protagonist Ethan Winters. But with Resident Evil Village serving as the eighth mainline entry in the veteran series, knowing how these narrative threads tie together can be a bit confusing at times - particularly when it comes to the ending. So we're going to take a look at how Village ended, what it means for the characters involved and the questions that have gone unanswered.",
    "Be warned, there are major spoilers ahead for Resident Evil Village - and previous Resident Evil titles - ahead. So proceed with caution.",
    "The ending sequence of Resident Evil Village really begins after Ethan meets Chris Redfield in Heisenberg’s factory deep into the game. Understandably, Ethan is angry at Chris, as their last meeting saw the BSAA captain storming the Winters household, gunning down Ethan’s wife Mia and kidnapping their baby, Rose - setting off the unfortunate series of events that followed.",
    "Chris explains to Ethan that the person he killed wasn’t Mia at all. Instead, it was the Village’s elusive Mother Miranda - who has the ability to change into anyone by injecting herself with Megamycete (that's the mold we saw in Resident Evil 7). Chris claims he stole Rose in an effort to protect her, as the BSAA was unsure if Ethan too was infected. But during transport, in the BSAA truck, Miranda (as Mia) resurrected herself, crashed the truck and stole Rose.",
    "After jumping in a large polymer/metal composite armored vehicle (a material that the metal-wielding Heisenberg can’t control), Ethan goes head-to-head with Miranda’s rebellious child who has turned into a Transformer-looking, metallic monstrosity. Following Ethan’s victory over Heisenberg, Miranda finally makes an appearance - in her true form.",
    "Miranda reveals that she was the elderly woman in the village earlier in the game all along and - of course - Mia, as we saw her at the start of this game. Mother Miranda then rips out Ethan’s heart and leaves him for dead.",
    "Following Ethan’s death, we then step into the shoes of Chris Redfield, who is on a mission to destroy the Megamycete source and kill Miranda. Having battled his way through the Village, and placed explosives on the Megamycete, Chris comes across Miranda’s lab - where most of Village’s loose ends are tied up. As",
    "Photographs and journals reveal that Miranda was a research scientist who found the Megamycete in a cave during an expedition. Realizing that the Megamycete was capable of transforming humans, Miranda decided to perform experiments with the organism in hopes that it would allow her to bring back her deceased daughter - who died of Spanish Flu - back to life.",
    "Miranda began experimenting with the Megamycete in the Village, implanting villagers with mold from the organism in order which allowed her to control them - in hopes of finding the “perfect vessel” for her daughter Eva to be reborn into. The four Lords: Heisenberg, Lady Dimistreceu, Moreau and Donna were the four main contenders.",
    "To try to increase efficiency, Miranda even created a parasite called Cadou from the Megamycete - but most of these experiments turned into Lycans.",
    "According to Miranda’s notes, she was approached by an “organization”, which offered to help with her research. Miranda gave the organization some mold and some of Eva’s DNA.",
    "Chris finds the real Mia in a cell within the lab and breaks the bad news to her that Ethan is dead. Well, we thought he was. We then cut to a “dream” sequence that sees Ethan visited by Eveline, the bioweapon from Resident Evil 7, Eveline reveals to Ethan that he’s been dead all along - having been killed by Jack in the Baker residence. The only reason Ethan is functioning is that he’s mostly made of mold now - we did wonder why he was able to reattach his hand so easily...",
    "Following the revelation, Ethan - without a heart - resurrects himself and kills Mother Miranda. Following the battle, he hands baby Rose to Chris and tells the captain to leave the Village so that Ethan can set off the detonator on the Megamycete - which will destroy himself and the roots of Miranda’s evil. Chris, Mia and baby Rose escape, though it turns out that a BSAA agent had been turned into a bioweapon too. In the final scene, Chris vows revenge on The Connections, the crime syndicate that creates and sells bioweapons.",
    "But that’s not all. In a post-credits scene, we see a teenage Rose laying flowers on her father’s grave, before getting back into a black SUV being driven by a BSAA agent. The following words appear on the screen: “the father’s story is now done”.",
    "There’s a lot to dissect and, if you aren’t up to date on your Resident Evil lore, you could be left wondering how all this information ties into the other Resident Evil games.",
    "Let’s start with Miranda and the mold. We now know that Miranda used to be a scientist and she was the one who discovered Megamycete in a cave during an expedition. Megamycete is the organism that the mold - which transformed the Baker family and much of the village - comes from. This mold has the ability to break down and absorb the consciousness of those who have died, hence why Miranda wanted to utilize it for her daughter.",
    "During a research expedition, Miranda shared her findings with a young virologist called Oswell E. Spencer, who you may know as the founder of Umbrella Pharmaceuticals and one of the overarching antagonists of the Resident Evil series - but that’s jumping ahead quite a bit. Miranda even invited Oswell to see the village where she conducted her experiments. But, while Miranda wished to utilize the mold for her own gain, Oswell disagreed with her method and instead felt that an organism such as Megamycete would be able to benefit the whole world if utilized as a virus.",
    "So Oswell conducted his own research, inspired by Miranda, and found the Progenitor Virus in Africa - which would eventually become the T-Virus - eventually setting up Umbrella Pharmaceuticals, named after the umbrella-shaped symbol Miranda seen in the cave that housed the mold.",
    "Meanwhile, back at the village, following unsuccessful experiment attempts, Miranda was approached by an organization to help with her research. The organization, The Connections, took a sample of Eva’s DNA and some mold, later creating bioweapon Eveline - who we saw in Resident Evil 7.",
    "Thanks to Eveline’s shenanigans in Resident Evil 7, and Mia’s former work with The Connections, Mother Miranda became aware of Eveline’s existence and, subsequently, became aware of the existence of Rose Winters. Seeing Rose as a perfect vessel for Eva, Miranda planned to invade the Winters home and over time gain control over Rose - but Chris ruined those plans.",
    "Village ends Chris vowing vengeance on The Connections, who seem to be the key instigator in all this. The organization’s connection to Umbrella? It was set up by Oswell’s right-hand man, Brandon Bailey.",
    "The post-credit sequence of Village suggests that any further installments will focus on Rose Winters, who is being supervised by the BSAA and appears to be a bioweapon herself. Maybe that’s why Miranda wanted her?",
    "While most of Resident Evil Village’s key threads are tied up, we do have a few unanswered questions. Firstly, how did a BSAA agent become a bioweapon? Is the BSAA now purchasing bioweapon agents from The Connections? It looks like the next game may see us finally going head-to-head with the crime syndicate to uncover all this.",
    "Which brings us to our next question: will Rose be the main playable protagonist from now on? This seems like it’s the case given that post-credits scene, but does that mean we’ll be playing as a bioweapon rather than a human? If that’s the plan, then we expect the next Resident Evil to be even more experimental again and could lean more into supernatural powers than run-of-the-mill weapons.",
    "Also, if Rose is a teenager, then does that mean that the next game will take place in at least ten years time - depending on her exact age? If that’s true, then it could mean the whole game series would move at least ten years ahead and we would maybe even see an older - likely grizzled - Chris Redfield, and maybe even older versions of other Resident Evil fan favorites.",
    "What we know for sure is that the Ethan Winters chapter of Resident Evil is now closed and it looks like Rose will be taking center stage - in some shape or another - from here on."
  ],
  "headers": {
    "3": "Resident Evil Village ending: what happened",
    "15": "Resident Evil Village ending: what does it have to do with Umbrella?",
    "23": "Resident Evil Village ending: unanswered questions"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village"
  }
}