{
  "source": "https://www.techradar.com/news/samsung-galaxy-a72-may-inherit-the-samsung-s21s-game-changing-camera-feature",
  "title": "Samsung Galaxy A72 may inherit the Samsung S21’s game-changing camera feature",
  "category": "phones",
  "updated": "2021-03-09T11:54:39Z",
  "author": "david-lumb",
  "summary": "The Samsung Galaxy S21’s ‘Space Zoom’ could be headed to mid-range Samsung phones",
  "article": [
    "The upcoming Samsung Galaxy A72 may inherit a game-changing camera feature that’s only been seen in the brand’s flagship phones like the Samsung S21. Called Space Zoom, this feature offers a reach reach of up to 30x of digital magnification.",
    "That’s just one detail in a large specs leak by YouTuber TechTalkTV, who shared the information via a series of tweets. Most of these echo the specs we’ve seen rumored previously, but this is the first we’ve heard that one of the Samsung Galaxy S21 range’s best features is trickling down to the brand’s mid-range phones.",
    "Space Zoom debuted in the Samsung Galaxy S20 line, managing the same 30x digital magnification on the current flagships, but it’s much crisper at that maximum in the S21 range.",
    "Trickling this feature down to the Galaxy A72 is a great boon for folks who don’t want to pay flagship phone prices for Samsung quality – but it’s also very impressive given its predecessor, the Samsung Galaxy A71, didn’t have a telephoto lens at all (just a 5MP depth sensor).",
    "We’ve heard plenty of rumors about the Samsung Galaxy A72 that paint a pretty clear picture of what kind of phone we’re likely to get.",
    "The aforementioned specs leaks, along with this one, suggest a 4G-only phone powered by a Snapdragon 720G chipset, 6GB or 8GB of RAM, and 128GB or 256GB of storage, though that’s expandable via microSD (up to 1TB, the new leak suggests). Leaks suggest it will have a 6.7-inch Full HD Plus (2400 x 1080) AMOLED display with in-screen fingerprint scanner and 90Hz refresh rate.",
    "With a 5,000mAh battery, Android 11, and a 3.5mm headphone jack, we’re expecting a solid mid-range device much like its predecessor and a price far below Samsung Galaxy S21 deals.",
    "It’s the cameras that could differentiate the A72 from last year’s Samsung A71: while we’d heard about a 32MP selfie, 64MP main shooter, 12MP ultra-wide, and 2MP macro shooter, we’d only heard about an 8MP camera that could be telephoto. The new leak suggests that latter shooter will indeed be an 8MP telephoto with 3x optical zoom.",
    "While that’s below the 64MP 3x optical telephoto lens on the Samsung Galaxy S21 – which could mean the A72’s 8MP lens will take blurrier photos at maximum magnification – Space Zoom is still a neat feature that broadens the mid-range phone’s photographic capabilities.",
    "[Via Android Central]"
  ],
  "headers": {
    "4": "Space Zoom rounds out an impressive-sounding A72"
  },
  "links": {
    "Samsung S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "TechTalkTV": "https://twitter.com/Mr_TechTalkTV/status/1368573589461504001",
    "rumored": "https://www.techradar.com/news/samsung-galaxy-a72-leaked-in-full-and-apparently-lacks-5g",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy S21 deals": "https://www.techradar.com/deals/best-samsung-galaxy-s21-deals",
    "Samsung A71": "https://www.techradar.com/reviews/samsung-galaxy-a71-hands-on",
    "Android Central": "https://www.androidcentral.com/samsung-galaxy-a72-will-borrow-one-galaxy-s21s-best-camera-features"
  }
}