{
  "source": "https://www.techradar.com/news/venom-2s-runtime-is-shorter-than-any-mcu-movie",
  "title": "Venom 2's runtime is shorter than any MCU movie",
  "category": "entertainment",
  "updated": "2021-09-24T08:50:00Z",
  "author": "tom-power",
  "summary": "Venom 2 isn't wasting any time",
  "article": [
    "Venom: Let There be Carnage's runtime has been revealed – and it's set to be one of the shortest comic book movies ever made.",
    "The Sony Pictures anti-hero flick is due to arrive in theaters soon but, until now, we didn't know how long it would be.",
    "Taking to his personal Twitter account on Thursday, September 23, film critic Erik Davis confirmed that Venom 2's runtime clocks in at a somewhat meagre 97 minutes:",
    "We don't know if this includes its credits and any post-credit scenes, but it's likely that Venom: Let There be Carnage will be done and dusted within one hour and 37 minutes. That makes it one of the shortest comic book movies of all-time and pales in comparison to any MCU movie to date.",
    "For context, the award for \"shortest MCU film ever\" is held by two Marvel flicks: The Incredible Hulk and Thor: The Dark World. Those movies clocked in at 112 minutes each, which means that they're 15 minutes longer than Venom 2 will be.",
    "Of course, Venom: Let There be Carnage exists outside of the MCU in a separate universe – well, for now at least. Tom Hardy has heavily suggested that Venom could be part of the wider MCU at some point, which is why we've compared Venom 2's runtime to those movies.",
    "It remains to be seen if Venom will cross over into the MCU. Regardless of whether the anti-hero does, though, it's still intriguing to see how its runtime shapes up against the MCU's many movies.",
    "It's difficult to say. On the surface, it appears that it is. Dig a little deeper, though, and things aren't as clear cut.",
    "Some may view Venom 2's runtime as being too short for a comic book movie – especially one that's a sequel. 2018's Venom clocked in at 112 minutes (the same runtime as The Incredible Hulk and Thor 2), so it's highly unusual for a follow-up movie to be shorter than its predecessor.",
    "Given that Venom 2 also introduces plenty of new characters and fleshes out the 'Venom-Verse', as Hardy has called it, it's even stranger that Let There be Carnage won't run as long as 2018's Venom did. You would expect that the flick would need more time for character development, CGI-heavy fight sequences and potentially amusing moments between Hardy's Eddie Brock and his symbiote buddy.",
    "However, Venom 2's 97-minute runtime doesn't mean that it won't have time to fit all of that in. It's more likely that, during the editing process, any filler material has been removed to make for a more cohesive movie.",
    "Films aren't necessarily better just because they have longer runtimes. There have been countless examples of movies that have been 20 or 30 minutes longer than they need to be, or flicks that have included scenes that haven't added anything to the overall plot.",
    "Venom 2 might be one of those movies that doesn't need any extra scenes to pad it out. At 97 minutes, it might be a leaner and tighter movie than Venom was, which is no bad thing in our book.",
    "Of course, time will tell if one hour and 37 minutes is enough time to tell Let There be Carnage's story. As one Twitter user put it: \"If it [Venom 2] is all killer and no filler, [that's] fine by me\", and we agree. Providing Venom: Let There be Carnage is a fun, action-packed comic book movie that you can switch your brain off to, most fans won't worry about its runtime.",
    "Venom: Let There be Carnage arrives in theaters on October 1 in the US, and October 15 in the UK."
  ],
  "headers": {
    "7": "Analysis: is Venom 2's runtime too short?"
  },
  "links": {
    "heavily suggested": "https://www.techradar.com/news/venom-2s-tom-hardy-keeps-teasing-spider-man-crossover-but-will-the-credits-scene-deliver",
    "one Twitter user": "https://twitter.com/Plagasx/status/1441092756944818182"
  }
}