{
  "source": "https://www.techradar.com/news/top-web-hosting-provider-shuts-down-following-cyberattack",
  "title": "Top web hosting provider shuts down following cyberattack",
  "category": "computing",
  "updated": "2021-02-10T18:16:59Z",
  "author": "anthony-spadafora",
  "summary": "Cybercriminals have started targeting web hosting providers",
  "article": [
    "Cybercriminals often attack websites in order to extort a ransom from their victims but a recent cyberattack against the web hosting company No Support Linux Hosting took quite a different turn.",
    "After a hacker managed to breach the company's internal systems and compromise its entire operation, No Support Linux Hosting has announced that it is shutting down. The company alerted its customers to the situation before shutting down its website in a message, which reads:",
    "“On February 8, 2021, a hacker successfully compromised all the servers we use to operate our business including the No Support Linux Hosting web site, Admin section, and our customer database. We can no longer operate the No Support Linux Hosting business.”",
    "No Support Linux Hosting then urged users to download backups of their websites and databases through cPanel. At this time though, it is still unclear as to whether the company decided to shut down after having its database and backups wiped or if it was hit with ransomware and was unable to meet the attacker's demands.",
    "Surprisingly, No Support Linux Hosting isn't' the only web hosting provider that decided to close up shop after falling victim to a cyberattack. As reported by TorrentFreak, two UK hosting companies that provide IPTV services to pirate streaming sites also suffered similar attacks.",
    "Web hosting providers SapphireSecure and KS-Hosting both displayed a message on the front pages of their websites from the hacker believed to be behind their respective cyberattacks. SapphireSecure was taken down first and its website showed a “Down for Maintenance” error alongside a message, which reads:",
    "“Your IPTV provider from [redacted] in the United Kingdom has not secured your details and put you at huge risk. All the databases will be shared with the police and copyright protection agencies and posted online shortly [Name redacted] has the option to still protect his customers and himself and stop this and there are two ways of him doing this, this is his choice and likely depends on how much he cares about his customers data.”",
    "The message on KS-Hosting's site went a step further by naming the person behind both platforms and providing his personal information including his current address, former address and his ISP.",
    "However, the attacker behind the SapphireSecure and KS-Hosting hacks could be the same threat actor given how close both attacks were to one another and due to the fact that both companies provide IPTV services.",
    "Via ZDNet"
  ],
  "headers": {
    "4": "Targeting web hosting providers"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "a message": "https://web.archive.org/web/20210209114036/https://www.nosupportlinuxhosting.com/",
    "cPanel": "https://www.techradar.com/news/web-hosting-prices-could-be-set-for-a-major-rise",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "TorrentFreak": "https://torrentfreak.com/hacker-blackmails-pirate-iptv-services-threatens-to-send-user-data-to-police-210209/",
    "UK hosting": "https://www.techradar.com/best/uk-web-hosting",
    "ZDNet": "https://www.zdnet.com/article/web-hosting-provider-shuts-down-after-cyber-attack/"
  }
}