{
  "source": "https://www.techradar.com/news/xiaomis-next-phone-the-redmi-note-10-will-arrive-early-next-month",
  "title": "Xiaomi's next phone - the Redmi Note 10 - will arrive early next month",
  "category": "phones",
  "updated": "2021-02-16T09:30:13Z",
  "author": "aakash-jhaveri",
  "summary": "A global debut for the Redmi Note 10",
  "article": [
    "The Redmi Note 10 finally has a launch date, and it's March 4. Just like previous Redmi launches, the series of smartphones will make a debut in India, before being available in other countries.",
    "Earlier this month, Xiaomi’s Manu Kumar Jain announced that the Redmi Note 10 will launch in India in the coming weeks and that kickstarted a month-long hype campaign.",
    "Official details around the exact products to be unveiled are still scarce, and we've yet to hear when the handsets launched will be coming to other countries like the UK.",
    "The Xiaomi Redmi Note 9 was available in the UK eventually, but it never made its way to the US or Australia. We'd expect it to be a similar situation for whatever phones come in the Redmi Note 10 series.",
    "The Redmi Note 10 will also mark the longest refresh cycle for the family in recent years, launching a year after the Redmi Note 9 Pro from March 2020. We also expect to see similarly significant upgrades this year, to take on the competition from other Android brands like Realme and Samsung.",
    "There is rumored to be multiple devices in the Redmi Note 10 range, with the top-of-the-line model expected to sport a 108MP primary camera, along with a high refresh rate AMOLED display, a large battery with fast charging and 5G capabilities with a MediaTek Dimensity processor. We expect it to be called the Redmi Note 10 Pro 5G, and be priced close to the Rs 20,000 (around £200 / $280 / AU$350) mark.",
    "There is also rumored to be a cheaper phone in the series too with a more modest camera array, a 4G chipset and an LCD screen.",
    "For context, the Redmi Note 9 Pro Max was powered by the Qualcomm Snapdragon 720G chipset with up to 8GB of RAM and 128GB of expandable storage. The display spanned 6.67-inches and had a refresh rate of 60Hz. It housed a large 5,020mAh battery with support for 33W fast charging. Lastly, it had a 64MP quad-camera on the back and a 32MP selfie shooter on the front."
  ],
  "headers": {},
  "links": {
    "Redmi Note 10": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro-max-india",
    "Manu Kumar Jain announced": "https://www.techradar.com/news/redmi-note-10-series-launch-in-india-set-for-early-march",
    "top-of-the-line model": "https://www.techradar.com/news/the-new-redmi-note-9-pro-5g-boasts-of-a-108mp-camera-and-a-120hz-display",
    "Redmi Note 9 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-9s"
  }
}