{
  "source": "https://www.techradar.com/news/dlss-games-top-titles-that-support-nvidias-exciting-tech",
  "title": "DLSS games: top titles that support Nvidia's exciting tech",
  "category": "computing",
  "updated": "2021-01-20T11:37:00Z",
  "author": "alex-blake",
  "summary": "Gaming graphical goodness",
  "article": [
    "Looking for the best DLSS games? We have you covered. If you've been following gaming news in recent years, you're probably aware of Nvidia’s ray tracing tech. What you may be less aware of is DLSS, or Deep Learning Super Sampling, available in the RTX line of GPUs.",
    "Like ray tracing, DLSS is a technology developed by Nvidia. It uses artificial intelligence and machine learning to scale up a game’s resolution without hogging GPU resources.",
    "The result is that your game looks like it is playing at a higher resolution than it really is, giving you better output without tanking your frame rate. With plenty of DLSS games on offer, we have picked out the best 10 to add to your library.",
    "Control is one of those rare games that combines stunning visuals and art direction with brilliant gameplay and an engrossing story, which all combine to make it almost impossible to put down. It is cinematic in every sense of the word, feeling almost more like an interactive movie than a game, albeit a deeply surreal and fantastical one at that.",
    "The attention to detail throughout is stunning. The open-world begs to be explored and tempts you to do so through scattered notes that fill out the back story, hidden secrets tucked away for you to discover, and locked-off areas of the world that become accessible as you develop. And with the wonderfully fluid combat – bolstered by levitation and other skills – you will have as much fun fighting as you will exploring.",
    "There are many post-apocalyptic games out there, but none quite like Death Stranding. The brainchild of Metal Gear creator Hideo Kojima, Death Stranding is set in an America decimated by a mysterious phenomenon that caused near-total societal collapse.",
    "Your character, a delivery driver linking the disparate human settlements that struggle to eke out an existence, is part of the effort to rebuild what is left but faces increasing obstacles along the way.",
    "Graphically, Death Stranding is deeply gorgeous in a way no other game quite manages. This transcends mere prettiness or realism – although it has both in spades. The game is highly cinematic, leading you to ponder on loneliness, isolation, and hope. As you traverse its wide, rugged landscapes, alone on your solitary journey, you ponder these ideas, reflecting on your character’s place in the world – and, perhaps, your own.",
    "Few games have become a global phenomenon in quite the same way as Fortnite. The king of battle royale games has a legion of adoring fans, reinvented the free-to-play model amid a sea of competition, and spawned a veritable trove of memes and dance moves.",
    "Whether you are playing solo or rolling out with a team of friends, its fun, moreish gameplay and competitive edge make it a ton of fun for casual and serious players alike.",
    "Fortnite’s cartoonish graphical style, long its signature look, gets a hearty boost from DLSS, improving its frame rates while keeping the vibrant, popping visuals the game is known for. You can play it on nearly any device, but PC is where it feels most at home, and where you will enjoy the benefits of DLSS to the full.",
    "Wolfenstein: Youngblood takes the essential Wolfenstein experience (brutally killing Nazis with no mercy), throws in open-world exploration, co-op gameplay, and a dash of 80s nostalgia, then shakes it all together to create a mashed-up shooter medley like no other.",
    "It may not land all its blows, but the number of new ideas it brings to the table makes it hard to ignore.",
    "Killing Nazis, though, is no simple matter. Enemies are tough and challenging but the gunplay retains that classic Wolfenstein free-flowing fun, and you can choose between a stealthy sniper approach or going in with a shotgun in hand, barrels blasting.",
    "Whichever you opt for, the incredibly rich graphics make it a sight to behold, with remarkable attention to detail and stunning particle effects helping it linger long in the memory.",
    "As the name of the series suggests, the Metro games are set underground, with the remnants of humanity struggling to survive amid a world destroyed by catastrophic radioactive fallout.",
    "Metro Exodus, though, takes the series in a new direction, taking you above ground and letting you explore the outside world as you attempt to reach the last few bastions of life in a scorched and mutated world.",
    "Gameplay is deep and often desperate. Each self-contained world zone presents often overwhelming odds against your character, Artyom, whether that takes the form of well-armed human enemies or monstrous creatures scarred and savaged by radiation.",
    "That requires a tactical approach to each objective, encouraging you to plan ahead, bring the right weapons and equipment, and pick your moments. Combined with a fantastic gun modification system and strikingly bleak environmental graphics, it is a worthy addition to the Metro franchise.",
    "The final entry in the rebooted Tomb Raider trilogy, Shadow of the Tomb Raider is a fitting end to Lara Croft’s story arc. Fusing classic puzzle-solving with action-packed combat and stunning, sweeping vistas, this game is a showpiece in terms of both gameplay and graphics.",
    "You can tweak various aspects of the difficulty to your liking – keeping the puzzles tough while giving you a break on the fighting, for example – letting you set the game up to amplify your enjoyment.",
    "There are also extensive graphical settings to maximise your visual satisfaction, and with DLSS support on-hand, you will be able to have more settings pushed high and enabled without losing frames.",
    "Black Ops Cold War retreads old Call of Duty ground, and that is a great thing. The campaign is not much to write home about, but the essentials of a great Call of Duty game – multiplayer and zombies – are both absolutely on form here.",
    "Both are utterly addictive, flooding your brain with the dopamine hits that come with a satisfying revenge kill or earning a new weapon unlock. It is familiar, but we do not mind at all.",
    "Graphically, Cold War is stunning, with the best of Nvidia’s ray tracing tech on show. DLSS helps it along, too, keeping your frame rates high despite the on-screen visual flair.",
    "With a game franchise as long-lived as Final Fantasy, it can be hard to keep new entries feeling fresh and exciting. Yet that is exactly what you get with Final Fantasy XV, which proves to be a stark modernization of the series that is enticing for die-hard fans and series newbies alike.",
    "There is no more turn-based combat but there are smartphones and selfies galore, yet the whole package still feels resolutely Final Fantasy. There are chocobos, oversized magical weapons, corny dialogue lines and characters coming of age. It is all tied up in a game world that is dazzling to look at and a blast to play through. Engaging from start to finish, it shows how to update a franchise while keeping sight of its roots.",
    "Battlefield V often gets used as a showcase for ray tracing and DLSS, and it's not hard to see why. It's a game of huge scale, with enormous set pieces and maps to play through, and a sense of the monumental conflict in which it is set. Whether you are desperately fighting in close quarters or parachuting in from the skies above, Battlefield V is a visual treat.",
    "Multiplayer is superb, its destructible environments and scattered vehicles offering new options that constantly keep you on your toes – and your enemies on theirs. As we have come to expect from a DICE game, visually Battlefield V is breath-taking, with its volumetric lighting and particle effects making each level a feast for the eyes. Just do not gawp for too long lest you find yourself shot to pieces.",
    "Developed by CD Projekt Red as the follow up to The Witcher 3, Cyberpunk 2077 is an open world game set in the sprawling Night City. Your character, V, must explore the futuristic, tech-infused city teeming with gang wars, rampant crime, and omnipotent corporations vying for control.",
    "Cybernetic implants are common across the spectrum of society, giving you upgraded abilities and an edge in your quest.",
    "Before its release, the game was without a doubt one of the most hyped ever, but its launch was marred by poor performance issues. That said, the PC version performs better than its console equivalents, and PC is where you will get to enjoy DLSS to the fullest.",
    "In fact, due to the performance issues, this is possibly the game where DLSS is essential, as it can make for a much better experience.",
    "CD Projekt Red is actively working on improving Cyberpunk 2077’s performance and helping it reach its undoubted potential, and it is still worth experiencing for its dystopian, sci-fi aesthetic and vast, dark world."
  ],
  "headers": {
    "3": "1. Control",
    "5": "2. Death Stranding",
    "8": "3. Fortnite",
    "11": "4. Wolfenstein: Youngblood",
    "15": "5. Metro Exodus",
    "19": "6. Shadow of the Tomb Raider",
    "22": "7. Call of Duty: Black Ops Cold War",
    "25": "8. Final Fantasy XV",
    "27": "9. Battlefield V",
    "29": "10. Cyberpunk 2077"
  },
  "links": {
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Control": "https://www.techradar.com/reviews/control-review",
    "Death Stranding": "https://www.techradar.com/reviews/death-stranding-directors-cut-review",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "battle royale games": "https://www.techradar.com/best/best-battle-royale-games",
    "Final Fantasy XV": "https://www.techradar.com/news/final-fantasy-xv-review",
    "Battlefield V": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}