{
  "source": "https://www.techradar.com/news/playstation-hat-ein-neues-studio-erworben-und-stellt-mitarbeiter-fur-mehrere-projekte-ein",
  "title": "PlayStation hat ein neues Studio erworben und stellt Mitarbeiter für mehrere Projekte ein",
  "category": "gaming",
  "updated": "2021-09-09T08:45:05Z",
  "author": "emma-boyle",
  "summary": "Stellenausschreibungen bieten einige interessante Einblicke",
  "article": [
    "Sony hat die Übernahme von Firesprite bekannt gegeben, einem in Großbritannien ansässigen Entwicklerstudio, das für Titel wie den Survival-Horror The Persistence verantwortlich ist.",
    "In einem neuen Beitrag auf dem offiziellen PlayStation-Blog heißt Hermen Hulst, Leiter der PlayStation Studios, Firesprite in der PlayStation Studios-Familie willkommen und erklärt, dass \"die technischen und kreativen Fähigkeiten des Teams für die Erweiterung unseres hervorragenden Katalogs exklusiver Spiele von größter Bedeutung sein werden.",
    "Firesprite ist nun das 14. Studio, das sich den PlayStation Studios anschließt, und damit die dritte Akquisition von Sony in diesem Jahr: Housemarque und Nixxes haben sich in den letzten Monaten ebenfalls den PlayStation Studios angeschlossen.",
    "Wie die anderen jüngsten Übernahmen von Sony hat auch Firesprite eine bestehende Beziehung zu PlayStation, da es zuvor mit Team Asobi an The PlayRoom-Titeln für PS4 und PSVR zusammengearbeitet hat.",
    "Es sieht jedoch so aus, als ob das Studio in Zukunft die Freiheit haben wird, an mehr eigenen Projekten zu arbeiten. Graeme Ankers, Geschäftsführer von Firesprite, sagte in einem Statement auf dem PlayStation Blog: \"PlayStation hat uns auch die Möglichkeit gegeben, unsere eigene IP, The Persistence, zu entwickeln, und uns wurde die kreative Freiheit gegeben, ein Survival-Horror-Spiel zu erforschen, zu innovieren und zu veröffentlichen, auf das wir sehr stolz sind. Jetzt, als First-Party-Studio, wissen wir, dass wir die volle Unterstützung von PlayStation haben, um unser Erbe der Kombination von Kreativität und technischer Innovation weiterzuführen und den PlayStation-Fans einzigartige Erlebnisse zu bieten.",
    "Was genau Firesprite auf die PlayStation-Plattform zu bringen gedenkt, ist im Moment noch unklar. Ein Blick auf die Firesprite-Website zeigt jedoch, dass das Studio mehrere Stellen für anscheinend drei Projekte anbietet.",
    "Es gibt Stellenanzeigen für \"ein AAA-Adventure mit verzweigter Erzählung\", ein \"bahnbrechendes PvP-Shooter-Projekt der nächsten Generation mit Fokus auf Games as a Service\" und ein sehr interessantes \"VR-Action-Adventure-Projekt, das auf einem der originellsten und erfolgreichsten Konsolen-IP-Titel der letzten 10 Jahre basiert\".",
    "Mit mehr als 250 Mitarbeitern ist Firesprite kein kleines Studio, und die Auswahl an Spielen deutet auf echte Ambitionen hin.",
    "Diese Übernahme scheint ein kluger Schachzug für PlayStation zu sein, vor allem, weil die Palette der Projekte, die Firesprite in Arbeit hat, dazu beitragen könnte, die Spielebibliothek der PS5 zu erweitern und zu diversifizieren.",
    "In einem Interview mit GamesIndustry.biz sagte Hermen Hulst von PlayStation, dass die Erfahrungen, die Firesprite für die Plattform entwickeln wird, \"ganz anders sein werden als die Teams, die du von den PlayStation Studios kennst\", und das scheint keine schlechte Sache zu sein. Ein Studio, das offen für Experimente mit den Möglichkeiten der Plattform ist - etwas, das Firesprite laut Hulst liebt - ist wahrscheinlich der beste Weg, um innovativ zu sein und Erlebnisse zu schaffen, die man sonst nirgendwo bekommt.",
    "Zum jetzigen Zeitpunkt können wir trotz dieser Stellenausschreibungen nicht wissen, was genau Firesprite einbringen wird, aber PlayStation ist eindeutig von der Übernahme überzeugt.",
    "Es ist allerdings wahrscheinlich, dass wir uns noch ein wenig gedulden müssen, bevor wir einen wirklichen Eindruck davon bekommen, was Firesprite zu bieten hat. Wenn man sich die Stellenausschreibungen auf der Firesprite-Website ansieht, werden sowohl das erzählerische Abenteuerspiel als auch der PvP-Shooter als in einem frühen Entwicklungsstadium befindlich beschrieben, wobei sich insbesondere letzterer \"in der Anfangsphase einer mehrjährigen Entwicklung\" befindet.",
    "Aber, hey, was lange währt, wird endlich gut, sagt das Sprichwort. Glücklicherweise können sich PlayStation-Fans dank eines PS5-Showcase, der am Donnerstag, den 9. September um 22:00 Uhr stattfindet, ein Bild von der Zukunft der Plattform machen. Der Showcase wird etwa 40 Minuten dauern und soll sich auf Spiele konzentrieren, die \"in diesem Jahr und darüber hinaus\" erscheinen."
  ],
  "headers": {
    "8": "Analyse: Und jetzt warten wir"
  },
  "links": {
    "In einem neuen Beitrag auf dem offiziellen PlayStation-Blog": "https://blog.playstation.com/2021/09/08/welcoming-firesprite-to-the-playstation-studios-family/",
    "PlayStation Blog": "https://blog.playstation.com/2021/09/08/welcoming-firesprite-to-the-playstation-studios-family/",
    "ein AAA-Adventure": "https://www.firesprite.com/careers/job/3A5C6DEEDD",
    "PvP-Shooter-Projekt": "https://www.firesprite.com/careers/job/51CC5BF7DF",
    "VR-Action-Adventure-Projekt": "https://www.firesprite.com/careers/job/9CF3243AD2",
    "GamesIndustry.biz": "https://www.gamesindustry.biz/articles/2021-09-08-why-playstation-is-buying-firesprite-one-of-the-uks-fastest-growing-games-studios",
    "frühen Entwicklungsstadium befindlich beschrieben": "https://www.firesprite.com/careers/job/3A5C6DEEDD",
    "befindet": "https://www.firesprite.com/careers/job/51CC5BF7DF"
  }
}