{
  "source": "https://www.techradar.com/news/these-amazing-echo-dot-prime-day-deals-will-make-your-home-smarter-than-ever",
  "title": "These amazing Echo Dot Prime Day deals will make your home smarter than ever",
  "category": "news",
  "updated": "2021-06-22T13:28:59.569Z",
  "author": "matt-hanson",
  "summary": "Two Echo Dots and a TP-Link smart plug for just £50",
  "article": [
    "Turn your house into a smart home with this brilliant Prime Day deal, which gives you two Echo Dot (4th generation) Alexa smartspeakers and a TP-Link Tapo P100 Smart Plug for just £49.98.",
    "Not in the UK or US? Scroll down for Amazon Echo Dot deals in your region.",
    "This kit, which saves you over £60, allows you to control compatible smart home devices with just your voice. You could position the Echo Dots in two different rooms in your home for better coverage.",
    "Meanwhile, the TP-Link Tapo P100 Smart Plug lets you turn off anything plugged into it using your voice (or a smartphone app). So, you could plug in an old lamp, for example, name the smart plug as 'lamp', and then say 'Alexa, turn on lamp'. Hey presto – your old lamp is now a smart one!",
    "In the US, there's a decent offer that bundles an Echo Dot (4th Gen) with a Sengled Bluetooth Color bulb for just $24.99, which is another very affordable way expand your smarthome.",
    "These are both handy kits that can help you get started with controlling your home using the Alexa voice assistant (or via the Alexa smartphone app).",
    "No matter where you live, you'll find all the lowest prices for Echo Dots right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best Echo smart home deals",
    "6": "More Echo Dot deals",
    "7": "More Amazon Prime Day UK deals"
  },
  "links": {
    "Prime Day deal": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "for just £49.98": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB097NLPJGR%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-2186127301916505300-21",
    "for just $24.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSmart-speaker-Charcoal-Sengled-Bluetooth%2Fdp%2FB08YT2N5SX%3Fgeniuslink%3Dtrue%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1199376205783936500-20"
  }
}