{
  "source": "https://www.techradar.com/news/ovhcloud-releases-new-advance-bare-metal-servers-for-smes",
  "title": "OVHcloud releases new Advance Bare Metal Servers for SMEs",
  "category": "computing",
  "updated": "2021-10-26T00:00:41Z",
  "author": "anthony-spadafora",
  "summary": "Reliability and performance at a predictable price",
  "article": [
    "OVHcloud has announced a new lineup of mid-range dedicated servers aimed at SMEs which are equipped with the latest generation of components.",
    "As part of this new offering, the European web hosting giant has merged its Advance and Infrastructure product lines to maintain the best features while covering a wide range of use cases including web hosting, ecommerce, databases, CRM or ERP, containerization or virtualization, confidential computing and cloud storage.",
    "OVHcloud's new range of servers meet the most demanding security regulations and are in compliance with the ISO/IEC 27001 standard though they can also meet the needs of healthcare organizations as they carry the Health Data Hosting (HDS) certification.",
    "Just like with the rest of the company's solutions, DDoS protection is included for 24/7 protection against all types of DDoS attacks with no restrictions on size or duration. OVHcloud has also ensured that user data is protected and accessible in either the European or Canadian data center chosen by customers and is in compliance with GDPR.",
    "In a press release, OVHcloud explained that its new range of next-gen Bare Metal servers consist of seven servers equipped with the latest Intel Rocket Lake-E CPUs as well as AMD's EPYC Milan CPUs at pricing ranging from $109.99 per month to $829.99 per month.",
    "As the company has included a significantly improved IPC compared to previous ranges, these new Advance machines offer increased performance while limiting power consumption. OVHcloud's new Advance range also includes two servers for data storage with up to 112TB by using multiple HDD, SSD, NVMe and hybrid storage options as well as hard RAID choices.",
    "Another benefit of the range is the fact that incoming and outgoing traffic is unlimited and free with a default bandwidth of up to 1 Gbps. However, additional bandwidth subscription options allow SME customers to increase the public bandwidth to 5 Gbps and the private bandwidth to 6 Gbps.",
    "Uptime has also seen a boost and the Advance range has an SLA off 99.95 percent and incorporates OVHcloud Link Aggregation (OLA) technology which aggregates the network interfaces of each server to increase availability while isolating them from public networks and potential threats.",
    "OVHcloud's new Advance line of Bare Metal servers are available now and interested users can find out more about them here."
  ],
  "headers": {
    "4": "Advance Bare Metal servers"
  },
  "links": {
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "DDoS protection": "https://www.techradar.com/news/best-ddos-protection",
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know",
    "press release": "https://corporate.ovhcloud.com/en/newsroom/ovhcloud-new-generation-advance-bare-metal-servers/",
    "Bare Metal servers": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "HDD": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "here": "https://us.ovhcloud.com/bare-metal/advance/"
  }
}