{
  "source": "https://www.techradar.com/news/looking-for-wireless-headphones-these-philips-ph805-deals-could-save-you-loads-of-money",
  "title": "Looking for wireless headphones? These Philips PH805 deals could save you loads of money",
  "category": "audio-visual",
  "updated": "2021-07-14T08:50:06Z",
  "author": "olivia-tambini",
  "summary": "Wireless headphones don't have to break the bank",
  "article": [
    "A decent pair of wireless headphones is a great investment, but these excellent deals on the Philips PH805 from Amazon prove that you don't have to break the bank if you're looking for excellent sound quality and noise cancellation.",
    "In the US, Amazon has slashed the price of the Philips PH805 from $169 to just $99, saving you $60 on these impressive over-ear headphones, and bringing them within $10 of the lowest price we've ever seen.",
    "There are big savings to be had if you're in the UK, too, with Amazon reducing the headphones from £159.99 to £95.36 – a reduction of nearly £65. (Not in the US or UK? Scroll down for the best Philips PH805 prices in your region.)",
    "In our Philips PH805 review, we awarded the headphones 4.5 out of 5 stars for their excellent sound quality and value for money – and with these deals, you're getting a real bargain.",
    "In spite of their low price compared to other noise-cancelling headphones, the PH805 offer an impressive build quality and great audio performance. The battery life is decent too, coming in at 30 hours with ANC turned off.",
    "They're let down slightly by the active noise cancellation, which isn't as strong as that provided by the Sony WH-1000XM4 Wireless Headphones, but the PH805 are still capable of reducing environmental sound – they just might not be the best choice if blocking out the world is your number one concern.",
    "However, if you're all about sound quality, you won't be disappointed by these great-value wireless headphones, and at these prices, you really can't go wrong.",
    "Not in the US or UK? We've scoured the web for the best Philips PH805 prices in every region:"
  ],
  "headers": {
    "3": "Today's best wireless headphones deals"
  },
  "links": {
    "to just $99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FPhilips-Performance-PH805-Headphones-Audio%2Fdp%2FB08232DXKL%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1391062413416694000-20",
    "to £95.36": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB07Z89CGS5%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-3609708473682449400-21",
    "Philips PH805 review": "https://www.techradar.com/reviews/philips-ph805",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Sony WH-1000XM4 Wireless Headphones": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344"
  }
}