{
  "source": "https://www.techradar.com/news/oneplus-9-wireless-charging-speed-matches-xiaomi-mi-11",
  "title": "OnePlus 9 wireless charging speed matches Xiaomi Mi 11",
  "category": "phones",
  "updated": "2021-03-18T14:19:40Z",
  "author": "tom-bedford",
  "summary": "A smooth 50W wireless",
  "article": [
    "The OnePlus 9 is set to get 50W wireless charging, OnePlus has confirmed, adding yet another thing to the growing list of specs we know about the upcoming phone.",
    "As part of its ongoing strategy to tease out specific details, OnePlus has been revealing loads about the phone from its camera to screen specs, and the company's CEO Pete Lau took to Twitter to unveil this latest detail.",
    "Lau confirmed a few things about the phone: it'll definitely have a 4,500mAh battery, and it'll support 50W fast wireless charging. That's a high speed that matches the Xiaomi Mi 11 and Huawei Mate 40 Pro.",
    "Apparently, the battery will take 43 minutes to power up to 100% wirelessly, and just 29 minutes with a cable, though no actual wired charging speed is cited.",
    "It's worth pointing out that manufacturers' estimations on powering speeds are often a little off, especially since they don't factor in what the phone is doing when it's powering.",
    "The lack of a wired charging speed is no coincidence, and it's likely not been announced so OnePlus has something to reveal later. But we can take a good guess at the powering speed.",
    "OnePlus' sister companies like Oppo and Realme have been pioneering fast-charging solutions, with quite a few 65W charging phones. The Oppo Find X3 Pro powers at this speed, and has a 4,500mAh battery, but we found it took about 40 minutes to power to full, not 29. So perhaps the OnePlus 9 is even faster.",
    "Some phones have 90W fast charging, but from phones we've tested with this, it seems it wouldn't take 29 minutes to power up a 4,500mAh battery, so it seems likely the OnePlus 9 isn't this fast.",
    "It seems most likely, then, that the OnePlus 9 charging speed is somewhere between 65W and 90W, though we've never seen a phone broach this gap before. We'll have to see if that's the case, or if our estimations are wrong, when the phone launches on March 23."
  ],
  "headers": {
    "5": "Taking guesses at the wired charging speed"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "upcoming phone": "https://www.techradar.com/news/upcoming-phones",
    "Twitter": "https://twitter.com/PeteLau/status/1372543685586485250",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Huawei Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro"
  }
}