{
  "source": "https://www.techradar.com/news/intel-in-talks-to-acquire-risc-v-firm-sifive-for-dollar2-billion",
  "title": "Intel in talks to acquire RISC-V firm SiFive for $2 billion",
  "category": "computing",
  "updated": "2021-06-11T13:58:18Z",
  "author": "mayank-sharma",
  "summary": "Intel isn’t the only one interested in SiFive",
  "article": [
    "Chip giant Intel has reportedly offered $2 billion to acquire SiFive, a chip startup founded in 2015 by researchers out of UC Berkeley, that designs computing cores using the RISC-V platform, which is often touted as an open source architecture.",
    "SiFive is reportedly weighing the offer from Intel, which already has an investment in the startup, shared Bloomberg citing unnamed sources familiar with the matter.",
    "Earlier this year, Intel’s CEO Pat Gelsinger counted SiFive as one of the customers of the company’s new Intel Foundry Services division and announced that the two were working together to allow RISC-V chips to be fabbed within Intel's facilities.",
    "However Intel is reportedly not the only one courting SiFive, and the company has received several other takeover interests, as well as offers of investment, which the source adds could be the “preferable route\" for SiFive.",
    "The interest in SiFive may also be influenced by Nvidia’s ongoing acquisition of Arm, which has yet not passed all its regulatory hurdles, mostly because of concerns about the future of Arm’s open licensing model.",
    "Purchasing SiFive would bring a host of hardware and software intellectual property (IP) to Intel that the company can use to fulfill its newfound desire to service external customers through its IDM 2.0 strategy, which will also see the company open its chip factories to outsiders.",
    "Phoronix is of the opinion that SiFive's RISC-V IP is perhaps the “most compelling” one at the moment, especially in light of its recent developer-friendly efforts like HiFive Unmatched.",
    "VIa Phoronix"
  ],
  "headers": {
    "4": "Open hardware"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "RISC-V": "https://www.techradar.com/news/heres-a-new-well-stocked-risc-v-raspberry-pi-challenger",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "Intel Foundry Services": "https://www.techradar.com/news/intel-says-it-will-go-after-apple-as-a-customer-for-new-chips",
    "acquisition of Arm": "https://www.techradar.com/news/nvidia-buys-arm-in-dollar40-billion-deal",
    "concerns": "https://www.techradar.com/news/google-and-microsoft-now-raise-questions-over-nvidia-arm-deal",
    "IDM 2.0 strategy": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
    "Phoronix": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Interested-In-SiFive"
  }
}