{
  "source": "https://www.techradar.com/news/nvidia-geforce-now-leak-suggests-god-of-war-and-demons-souls-inbound-for-pc",
  "title": "Nvidia GeForce Now leak suggests God of War and Demon’s Souls inbound for PC",
  "category": "computing",
  "updated": "2021-09-14T09:50:18Z",
  "author": "darren-allan",
  "summary": "Plus Returnal, Horizon Forbidden West, and Ratchet & Clank?",
  "article": [
    "Update: Nvidia has issued a statement to confirm that this leak is real – but obviously unauthorized – and clarified that the inclusion of any game on it doesn’t mean anything. Nvidia told Wccftech: “Nvidia is aware of an unauthorized published game list, with both released and/or speculative titles, used only for internal tracking and testing. Inclusion on the list is neither confirmation nor an announcement of any game.",
    "“Nvidia took immediate action to remove access to the list. No confidential game builds or personal information were exposed.”",
    "The original story follows below…",
    "A major leak has been witnessed from the Nvidia GeForce Now (game streaming service) database, and assuming it’s legitimate, the spillage highlights a number of top PlayStation games which could be coming to the PC – including God of War, Returnal and Demon’s Souls.",
    "While the leak is believed to be genuine, at least according to our sister site Windows Central, this obviously needs to be taken with a bucketful of salt (or maybe even a larger container) – and at any rate, just because a game is listed here doesn’t mean it’s eventually destined for the PC (and indeed Nvidia’s streaming service).",
    "Anyhow, the story is that Ighor July, a C++ developer, posted the list of games on Medium, as flagged up on Reddit. Apparently the dev managed to crack their way into Nvidia’s GeForce Now database as detailed in that post, and after experimenting with all sorts of stuff and leveraging intelligent code completion, they grabbed a list of games from the servers of Team Green’s streaming operation – consisting of no less than 18,000 items.",
    "Scanning through that sprawling lot revealed some seriously tantalizing findings which as we’ve already mentioned include God of War (shown to be present in the Steam store – which obviously it isn’t, not yet…), Returnal and Demon’s Souls, plus GTA 3, Vice City and San Andreas remasters, Horizon Forbidden West, and Ratchet & Clank.",
    "There are also a bunch of unannounced GeForce Now games flagged up by Ighor like Mafia: Definitive Edition, and incoming PC titles like the (imminent) Alan Wake Remastered and Uncharted Legacy of Thieves Collection for PC (the latter is due early 2022).",
    "The first point to make here is to underline the extreme caution required around this leaked list, and that just because a game is mentioned here, doesn’t mean it’s coming to the PC. There’s certainly some pretty odd stuff in the database leak such as ‘Bioshock 2022’ for example, and other unreleased or unknown projects, plus the presence of Dolphin emulator (for playing GameCube and Wii titles on the PC).",
    "All of this means that there is clearly a lot of noise with this leak, even if it does prove to be authentic. Equally, though, there are certainly things which ring true here: God of War has long been hoped for as a PC port, and seems a realistic proposition as such. Plus we’ve been hearing plenty of late about “multiple upcoming PC ports” of PlayStation exclusives – and that Bloodborne won’t be one of these. Funnily enough, Bloodborne doesn’t make the list here (although Demon’s Souls does, of course). Another disappointment for some, but not really a surprising omission, is the lack of any mention of Spider-Man for a PC port.",
    "In short, it looks like we could hope that there are some delightful nuggets of truth here, among a whole bunch of potential placeholders and non-existent ‘could-be’ projects, as well as strange and clearly bogus entries."
  ],
  "headers": {
    "8": "Analysis: Nuggets of truth among much strangeness?"
  },
  "links": {
    "Wccftech": "https://wccftech.com/nvidia-responds-to-geforce-now-database-leak-says-list-included-speculative-titles/",
    "Nvidia GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "top PlayStation games": "https://www.techradar.com/best/best-ps4-games",
    "Windows Central": "https://twitter.com/JezCorden/status/1437412970670219268",
    "Medium": "https://ighor.medium.com/i-unlocked-nvidia-geforce-now-and-stumbled-upon-pirates-dc48a3f8ff7",
    "Reddit": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/pncvo0/unlocking_geforce_now_reveals_god_of_war_2018_for/",
    "due early 2022": "https://www.techradar.com/news/uncharted-is-coming-to-ps5and-pc",
    "long been hoped for as a PC port": "https://www.techradar.com/news/god-of-war-pc",
    "multiple upcoming PC ports": "https://www.techradar.com/news/loads-of-playstation-exclusives-are-coming-to-pc-but-not-the-one-we-want",
    "Bloodborne": "https://www.techradar.com/news/games-of-the-generation-bloodborne-is-a-lovecraftian-nightmare-that-will-keep-you-coming-back-for-more"
  }
}