{
  "source": "https://www.techradar.com/news/dell-comes-out-swinging-with-a-brand-new-xps-desktop-model",
  "title": "Dell comes out swinging with a brand new XPS desktop model",
  "category": "computing",
  "updated": "2021-10-28T17:38:11Z",
  "author": "allisa-james",
  "summary": "A new entry in the popular desktop brand",
  "article": [
    "Dell's laptop XPS laptop line include some of the best laptops and Ultrabooks out there, such as the recent Dell XPS 15 OLED and Dell XPS 17 models. However, the company hasn't forgotten about the desktops that made it a household name, and it's back with its latest entry into its popular XPS desktop series, just in time for Black Friday.",
    "This XPS desktop is nearly 42% larger than its predecessor and will come in two colors: Night Sky and Platinum Silver. There’s even a “Creator Edition” which comes with pre-selected configurations that work best for creative endeavors such as photography, graphic design, music production, and more.",
    "This version will be available later this year at a starting price of $919.99, and will ship with Windows 11.",
    "The new XPS desktop uses 12th-Gen Intel Core desktop processors, up to the Core i9. It will also feature some of the best graphics cards as well, ranging from either the Nvidia GeForce RTX 30 Series GPUs (up to an RTX 3090) or the AMD Radeon RX GPUs (up to an RX 6900 XT). The desktops all have DDR5 memory and will support PCIe Gen5 graphics.",
    "This is also the first XPS Desktop that has liquid cooling as well as fans, which will give the PC improved airflow. It’s up to 21% cooler under load (with a 125W cooling solution), or up to 18% cooler under load with liquid cooling. Meanwhile, the included fans operate up to 5,000 RPM.",
    "This latest entry in the XPS Desktop series is a great deal price-wise for those who want a PC with solid specs off the bat, with options to fully customize and upgrade with individual parts later down the line.",
    "And, considering the difficulty of purchasing higher-end graphics cards and even some CPUs, pre-built PCs are definitely going to be some of the most sought after Black Friday PC deals this year, and we expect that Cyber Monday will also have some great sales."
  ],
  "headers": {
    "3": "Analysis: Breakdown of specs"
  },
  "links": {
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Dell XPS 15 OLED": "https://www.techradar.com/reviews/dell-xps-15-oled-2021",
    "Dell XPS 17": "https://www.techradar.com/reviews/dell-xps-17-2021",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "RX 6900 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6900-xt-find-stock-here",
    "Black Friday PC deals": "https://www.techradar.com/black-friday/black-friday-computer-deals-2020-top-deals-we-expect-to-see-and-early-offers-live-now",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}