{
  "source": "https://www.techradar.com/news/google-sheets-update-promises-to-cure-your-formula-phobia",
  "title": "Google Sheets update promises to cure your formula phobia",
  "category": "computing",
  "updated": "2021-08-26T10:39:55Z",
  "author": "joel-khalili",
  "summary": "Google Sheets will do most of the heavy lifting for you",
  "article": [
    "Google has lifted the lid on a new feature for spreadsheet software Sheets that should make deploying formulas and functions simpler for less advanced users.",
    "According to a new blog post, Sheets will now make intelligent formula suggestions based on the data in question and the user’s initial input.",
    "“You’ll now see in-line, sequential, context-aware suggestions for formulas and functions when working with data in Sheets,” explained Google.",
    "“Formula suggestions will make it easier to write new formulas accurately and help make data analysis quicker and easier.”",
    "The new feature will roll out to Google account holders in increments over the next couple of weeks, but will be enabled by default once it lands.",
    "Spreadsheet software is a foundational aspect of many office-based professions, but the sight of the formula box is enough to provoke a shudder in less mathematically-inclined users, this writer included.",
    "However, Google is hoping to eliminate (or at least alleviate) formula phobia by shouldering as much of the burden as possible, making it “easier and faster to work with and analyze data”.",
    "To access the new functionality, users should simply begin to insert a formula. Sheets will then automatically generate suggestions, which will be displayed in a dropdown menu and adapt as the user continues to type.",
    "In a similar fashion to the auto-complete function available in Google Docs, suggested formulas can be incorporated into a spreadsheet with a press of the Tab key.",
    "In theory, as well as helping less advanced users access the full depth of Sheets functionality, the new feature should also allow spreadsheet aficionados to optimize their workflows.",
    "Intelligent formula suggestions could also prove particularly valuable for small businesses, many of whom still rely on spreadsheets for accounting functions and other tasks now automated by larger companies."
  ],
  "headers": {
    "5": "Formula phobia"
  },
  "links": {
    "spreadsheet software": "https://www.techradar.com/best/spreadsheet-software",
    "blog post": "https://workspaceupdates.googleblog.com/2021/08/intelligent-formula-and-function-suggestions-in-google-sheets.html",
    "Sheets": "https://www.techradar.com/reviews/google-sheets",
    "accounting": "https://www.techradar.com/best/accounting-software-small-business"
  }
}