{
  "source": "https://www.techradar.com/news/google-pixel-6-camera-leak-hints-at-some-photoshop-esque-features",
  "title": "Google Pixel 6 camera leak hints at some Photoshop-esque features",
  "category": "phones",
  "updated": "2021-09-24T09:11:05Z",
  "author": "tom-bedford",
  "summary": "Lots of smart camera features",
  "article": [
    "We're still waiting to hear about most of the Google Pixel 6 camera features, despite many other parts of the phone being officially confirmed or teased by Google - however a leak has possibly detailed lots of the camera features coming to the new device and its Pro sibling.",
    "This comes from XDA Developers, as the website was apparently provided early code for the Pixel 6 Pro camera app by a source. This code provides references to lots of possible software features in name, though there's little in the way of actual details.",
    "While the actual camera specs for the Pixel 6 phones still aren't clear - we don't have official news on the megapixel count, aperture or lenses in particular - this news suggests that Google is working on software features as a priority.",
    "Pixel devices have always stood out as great camera phones due to their AI optimizations and software tricks, which turn good-looking shots into fantastic-looking pictures, and this news promises a return to form.",
    "Some of the features XDA Developers found reference to include 'magic eraser', 'face deblur' and 'scene lock'. Other than the middle feature, which we know takes multiple pictures to ensure a face is high-res and unblurred, we don't know what these features do.",
    "Judging by the name, it sounds like magic eraser can 'fix' parts of a shot - perhaps if someone photobombs, or there's a finger in the corner of a frame, or you're trying to take a picture through an opaque surface, the feature can clean up the shot. Likewise scene lock sounds like a way of shooting a video where certain parts of a frame are frozen, to create a curious effect.",
    "We've seen other companies use similar features, with Huawei for the former and Xiaomi for the latter, and both functions provide Photoshop-grade image correction on your smartphone.",
    "There are a few other features listed which sound like things we've seen on other phones. A tool called 'portrait spotlight' sounds like Huawei phones' 'stage lighting' portrait mode, which darkens the background to look like the subject is on a dark stage. Similarly 'front torch' will likely illuminate selfies in dark areas by brightening the phone's display, which many devices already do.",
    "There are some unique features listed too. There's mention of baby mode, which has been leaked before, though we can't even guess as to what it does. Something called 'nima aesthetic' is listed, which is apparently linked to the Pixels' 'top shot' function that takes loads of pictures and selects the best each time. And apparently, the Pixel 6 series will offer support for Bluetooth microphones, which will be really useful for mobile journalists.",
    "There are two more features that XDA Developers discusses which we haven't mentioned. The first is a 'timer light' - apparently when you take a photo with a countdown, the rear flash will display some effect so you can tell it's ticking down.",
    "Finally, the Pixel 4's 'frequent faces' mode is said to get a big improvement - that's a feature in which the phone recognizes, and focuses on, faces in selfies that it's seen before. Great for selfies with your favorite people, less good that a huge tech company has software that can automatically detect your friends.",
    "Given most of these references in the Pixel 6 Pro camera app are just that, references to names, it's hard to know for sure what these functions do. We've given our best guesses, but we'll have to wait until the Pixel 6 launch - whenever that is - to know for sure."
  ],
  "headers": {
    "4": "Google Pixel 6 camera features"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "XDA Developers": "https://www.xda-developers.com/google-pixel-6-camera-features-revealed/",
    "which has been leaked before": "https://www.techradar.com/news/google-pixel-6-pro-detailed-in-extensive-leak",
    "Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review"
  }
}