{
  "source": "https://www.techradar.com/news/best-games-consoles-xbox-360-bringing-online-multiplayer-to-the-living-room",
  "title": "Is the Xbox 360 the best games console of all time, ever?",
  "category": "gaming",
  "updated": "2021-11-12T12:13:47Z",
  "author": "emma-boyle",
  "summary": "Running rings around the competition",
  "article": [
    "It had a production run of more than ten years and in that time it became one of the top ten highest selling consoles of all time.",
    "It’s safe to say that the Xbox 360 is one of the brightest stars in Microsoft’s sky. Not least because it’s outlined by a big red ring of death.",
    "Though the red ring of death nightmare will no doubt always cast a shadow over the Xbox 360’s historical reputation (both in gamers’ personal memories and generally) it’s an incredibly important console both for Microsoft and the wider gaming world.",
    "In the era where online gaming was beginning to flourish, the 360 was at the forefront, pushing it mass market with an excellently redesigned Xbox Live infrastructure. In addition, its introduction of Achievement Points and Gamerscores added a new competitive dimension to games that helped players extract as much as possible from their games.",
    "As well as building on and massively improving the online infrastructure of the original Xbox, the 360 offered a much more attractive and streamlined design. A design that only improved with the Elite version of the console.",
    "Not only did the console itself look good, its controller was a joy to use and was a massive improvement in terms of ergonomics over the original. Large enough to feel substantial in your hands but with buttons close enough together that you weren’t forced to stretch, it was comfortable to use for long periods and didn’t require any thought to get to grips with.",
    "It was for the best it had a comfortable controller, too, since the Xbox 360 collated an excellent library of games, both exclusive and non-exclusive. It was the only place you could play the Halo, Gears of War, and Forza franchises and arguably they've helped define its identity as a console.",
    "Halo 3 in particular is a game that's inextricably tied to the Xbox 360 and in a time of increasing cross-platform development and decreasing console mascots this is an achievement.",
    "In 2007, it was the biggest selling game in the US which is incredible considering it was only available on one console but it's a testament to the influence of the franchise. Not only did it raise the bar for first person console shooters, it showed just how good mass online multiplayer gameplay could be.",
    "In fact, the Xbox 360 had many games that made the most of its power and made it worth buying.",
    "The knowledge that this game was in development was one of the main reasons I picked up an Xbox 360. Though the Fable franchise has always promised more than it’s capable of delivering it’s an excellent series and the second installment is arguably the best. It has a distinct sense of humour and visuals, an atmospheric soundtrack, and a genuinely imaginative and enjoyable world to explore.",
    "Though Fable 3 was a relative disappointment, I still cherish my Fable 2 memories.",
    "Banjo Kazooie: Nuts & Bolts was another title that made the Xbox 360 worth buying. The third title in the Banjo Kazooie franchise, it focussed on vehicle construction. Though this was divisive it was enormous amounts of fun.",
    "To be honest, though this is a standout title, there are many games developed by Rare exclusively for Xbox that would convince us it’s a console worth owning including, but definitely not limited to, Kameo: Elements of Power and Viva Pinata.",
    "Last but certainly not least: Alan Wake. This was the game that brought psychological horror elements similar to those of the hugely enjoyable Fatal Frame series and so innately tied to PlayStation over to Xbox and it definitely worked.",
    "The game was intense and cinematic, pushing the Xbox 360’s HD visuals and processing power to show exactly how good it was. Not only that, it was a different kind of title for Xbox showing that it was a console for much more than just sci-fi shooters and driving games.",
    "For me, the Xbox 360 was the console that signaled Microsoft was serious about becoming a success in console gaming. It was a huge step up from the original Xbox in terms of power and design, with solid online services and an attractive library of games that made the most of its power. We just won’t talk about the Kinect, okay?"
  ],
  "headers": {
    "4": "Great games, great controller, great times",
    "10": "Fable 2",
    "12": "Banjo Kazooie: Nuts & Bolts",
    "14": "Alan Wake"
  },
  "links": {}
}