{
  "source": "https://www.techradar.com/news/samsung-remains-the-top-smartphone-company-globally-ships-77-million-units",
  "title": "Samsung remains the top smartphone company globally - Ships 77 million units",
  "category": "phones",
  "updated": "2021-04-21T01:24:57Z",
  "author": "balakumar-k",
  "summary": "Impressive first quarter performance",
  "article": [
    "Samsung remains the largest smartphone company shipping 77 million units globally in the first quarter of this year, growing 32% YoY from 58 million units in Q1 2020.",
    "According to the latest research report from Strategy Analytics, Samsung’s newly launched more affordable A series 4G and 5G phones, and the earlier launched Galaxy S21 series combined drove solid performance in the quarter.",
    "Samsung's principal rival, Apple shipped 57 million units iPhones worldwide, capturing the second place with a 17% volume market share. The strong momentum behind the 5G iPhone 12 series continued across multiple markets.",
    "In all, global smartphone shipments were 340 million units in Q1 2021, up 24% YoY representing the highest growth since 2015.",
    "China’s Xiaomi Corp came in third place with a 15% market share after shipping 49 million smartphones in the first quarter. Other Chinese brands Oppo and Vivo took the fourth and fifth spots, respectively.",
    "Oppo (not including Realme and OnePlus) won 11% market share and remained the fourth largest smartphone vendor in the first quarter, followed by vivo, which grew an impressive 85% YOY in Q1 2021.",
    "In all, the China smartphone market had a remarkable quarter driven by 5G product success across multiple price segments.",
    "China smartphone shipments were up +35% YoY reaching 94 million units in Q1 2021.",
    "Globally, the top five companies combined took a 76% market share in Q1 2021, up from 71% one year ago.",
    "Chip shortages and supply side constraints did not have a significant impact in Q1 among the top 5 brands but was and will be a concern for smaller vendors over the next few quarters in our view."
  ],
  "headers": {
    "4": "Impressive show from Chinese companies"
  },
  "links": {
    "Samsung": "https://www.techradar.com/news/samsung-to-pip-apple-in-global-smartphone-production-in-first-quarter"
  }
}