{
  "source": "https://www.techradar.com/news/australias-controversial-media-code-that-targets-google-and-facebook-is-now-law",
  "title": "Australia's controversial media code that targets Google and Facebook is now law",
  "category": "computing",
  "updated": "2021-02-26T01:11:56Z",
  "author": "jasmine-gearie",
  "summary": "Online giants now required to negotiate fees with media orgs",
  "article": [
    "Australia’s parliament has passed a controversial new law that will require Google and Facebook to pay Australian media for linking to and sharing any news content they publish.",
    "Australia’s treasurer, Josh Frydenberg, said the passing of the news media bargaining code was “a significant milestone” and that “this legislation will help level the playing field and see Australian news media businesses paid for generating original content.”",
    "A joint statement between Frydenberg and Australia’s communications minister, Paul Fletcher, said that the code “provides a framework for good faith negotiations between the parties and a fair and balanced arbitration process to resolve outstanding disputes.”",
    "The media bargaining code has been strongly opposed by both Google and Facebook, with Google threatening to remove its search engine from Australia entirely if the law was passed, while Facebook went ahead and removed all news for its Australian users – as well as posts from some critical government pages and not-for-profit organizations in the process.",
    "Facebook soon reversed its ban after significant backlash, and came to the table to negotiate with the government, which resulted in a handful of last-minute amendments to the then proposed law.",
    "One of the introduced changes now gives news publishers and tech companies two months to negotiate on the amount to be paid before an independent arbitrator must step in as a last resort.",
    "Meanwhile, Google has been striking independent deals with large Australian news organizations for the rights to use their content. In response, Frydenberg said, “none of these deals would be happening if we didn’t have the legislation before the Parliament.”",
    "As of yet, the brokered deals have largely been between Australia’s major news outlets, including News Corp, Seven West Media and Nine Entertainment Co. There have not been any reports of deals between the tech giants and smaller regional news organizations – some of the hardest hit by the rise of Facebook and Google – though the government remains confident deals will be inked.",
    "“We do expect there to be arrangements with small and regional publishers as well as the larger ones, albeit through a more efficient mode of engagement through a default offer,\" said Fletcher.",
    "The new law was drawn up by the Australian Competition and Consumer Commission (ACCC), a consumer watchdog, and primarily wants to address what the ACCC calls a \"significant bargaining power imbalance\" between Australian news businesses and the tech giants.",
    "At least one tech giant is pleased to see the media code passing through Australia’s parliament – President of Microsoft, Brad Smith, tweeted that the new law is “a big step forward.”",
    "“It helps ensure publishers and journalists get paid a fairer share for their work. Australia has shown what’s possible and other democracies around the world can build on their ideas,” he said.",
    "The code is said to be up for review in one year, to ensure the policy has been effective."
  ],
  "headers": {
    "3": "The story so far"
  },
  "links": {
    "Google threatening to remove its search engine": "https://www.techradar.com/news/google-threatens-to-block-search-in-australia-if-pay-for-news-law-is-passed",
    "removed all news": "https://www.techradar.com/news/facebook-has-banned-news-in-australia",
    "Facebook soon reversed its ban": "https://www.techradar.com/news/facebook-backtracks-on-australian-news-ban-after-government-negotiations",
    "tweeted": "https://twitter.com/BradSmi/status/1364765328555835392"
  }
}