{
  "source": "https://www.techradar.com/news/duckduckgo-reaches-a-major-milestone-in-its-fight-to-topple-google",
  "title": "DuckDuckGo reaches a major milestone in its fight to topple Google",
  "category": "computing",
  "updated": "2021-01-18T11:12:47Z",
  "author": "barclay-ballard",
  "summary": "Privacy-centric search engine continues to grow",
  "article": [
    "The privacy-centric search engine DuckDuckGo has announced that it has reached a major milestone, confirming that it handled more than 100 million user search queries in a single day for the first time ever. The landmark figure represents a significant moment for the search engine, which was founded back in 2008.",
    "Since the company’s founding, it has experienced sustained growth, even if its traffic continues to lag some way behind that of industry leader Google. Nevertheless, since August 2020, DuckDuckGo has been regularly managing more than 2 billion search queries a month, which is pretty impressive considering it is not the default search platform for any devices unlike Google’s own search engine or Bing.",
    "In fact, in spite of its recent growth, DuckDuckGo has not stopped making the case for fairer competitive practices in the search engine space. In a blog post written late last year, the company argued that the fact that a 15-step process is required to set DuckDuckGo as an individual’s default browser is bad for consumer choice.",
    "It would seem that more and more tech firms are starting to take privacy more seriously, however, no doubt aware that many customers are becoming concerned by the huge quantities of data that they hand over on a daily basis.",
    "In addition to DuckDuckGo’s growing popularity, the privacy-focused apps Telegram and Signal have both also recorded surges in their user figures, and even tech’s biggest players are starting to take privacy more seriously. Google is currently working on its own Privacy Sandbox initiative, while Apple recently required all developers to add privacy labels to their App Store offerings.",
    "Given that privacy is becoming more and more important for online users, it would be no surprise to see DuckDuckGo continue its upward growth trajectory.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Privacy policies"
  },
  "links": {
    "DuckDuckGo": "https://www.techradar.com/news/google-adds-duckduckgo-as-search-option",
    "blog post": "https://spreadprivacy.com/one-click-away/",
    "Privacy Sandbox": "https://www.techradar.com/news/uk-investigating-google-chrome-privacy-plan",
    "labels": "https://www.techradar.com/news/whatsapp-is-kicking-up-a-stink-about-apples-app-store-privacy-labels",
    "ZDNet": "https://www.zdnet.com/article/duckduckgo-surpasses-100-million-daily-search-queries-for-the-first-time/"
  }
}