{
  "source": "https://www.techradar.com/news/the-grand-tour-is-filming-a-new-episode-for-amazon-prime-video-now",
  "title": "The Grand Tour is filming a new episode for Amazon Prime Video now",
  "category": "entertainment",
  "updated": "2021-04-27T14:32:37Z",
  "author": "samuel-roberts",
  "summary": "The gang heads to Wales",
  "article": [
    "Amazon Prime Video's The Grand Tour Presents has begun filming a new episode in Wales and parts of England, according to fans near the production and local news reports. Co-hosts Richard Hammond, Jeremy Clarkson and James May have been spotted filming in locations like Leamington, Crickhowell and Llandrindod Wells.",
    "While the theme of the special is unknown, fans have reported that the group were spotted driving classic French cars in Wales. Coventry Live, meanwhile, says the trio were filming at a roundabout near a retail park on April 24 – leading to some complaints from local residents. Clarkson had previously confirmed the show was filming again in late April.",
    "The Grand Tour is currently partway into a series of themed specials on Amazon Prime Video under the 'Presents' banner – the latest episode, 'A Massive Hunt', was released in December 2020. The episode before that, 'Seamen', was released in December 2019.",
    "While a new episode of the Amazon Prime Video series completed filming in Scotland back in 2020 – it's due to release this year at an unspecified time – the UK focus of these episodes hopefully means The Grand Tour Presents specials will start landing more regularly.",
    "Last month, Clarkson told Drivetribe that he'd seen a cut of the Scotland episode – so hopefully fans won't have to wait until the end of the year to see it this time.",
    "The reason The Grand Tour has swapped locations like Madagascar for areas local to the hosts is obvious: the pandemic basically made it impossible to pull off. The original plan was for the hosts to travel to Russia for a new special – instead, Scotland took its place in the episode order.",
    "That said, the plan is still for the trio to film in Russia once the danger of the pandemic has passed – whenever that might be.",
    "\"The Russia plan is simply postponed until we don’t know when, but we haven’t cancelled it,\" co-host James May told BT last year. \"We’re just having to put it in the cupboard at the moment but we will get it out one day and finish it off.\""
  ],
  "headers": {
    "5": "Why The Grand Tour is UK-bound (for now)"
  },
  "links": {
    "Amazon Prime Video": "https://www.techradar.com/reviews/amazon-prime-review",
    "fans": "https://www.youtube.com/watch?v=P2LPcKtSsN0&t=1s&ab_channel=TheGrandTourFans",
    "Coventry Live": "https://www.coventrytelegraph.net/news/local-news/jeremy-clarkson-james-richard-hammond-20468655",
    "Drivetribe": "https://www.youtube.com/watch?v=nxnZe6wjjqU&ab_channel=DRIVETRIBE",
    "BT": "https://www.awin1.com/awclick.php?awinmid=3041&awinaffid=103504&clickref=trd-us-1439289930678181600&p=https%3A%2F%2Fwww.bt.com%2Ftv%2Fentertainment%2Fgrand-tour-scotland-special-outer-hebrides-release-date-cars-clarkson-hammond-may"
  }
}