{
  "source": "https://www.techradar.com/news/dark-mode-is-coming-to-paint-for-windows-11-in-new-redesign",
  "title": "Dark mode is coming to Paint for Windows 11 in new redesign",
  "category": "computing",
  "updated": "2021-08-19T10:50:33Z",
  "author": "daryl-baxter",
  "summary": "Does it come in black?",
  "article": [
    "Having been hinted at through a post on Unsplash, the redesigned Paint for Windows 11 has been unveiled by Chief Product Officer at Microsoft, Pinos Panay.",
    "It’s the latest effort by the company to make apps that have long been part of Windows fit in with the new design of Windows 11. Thanks to the new Fluent design language, it’s already resulted in some apps having their biggest update in years.",
    "And now, the iconic Paint app is finally seeing a significant redesign with a simplified toolbar, along with a long-awaited dark mode.",
    "In a quick 18-second video, Panay showcased the new design of Paint with better tools to change the type of brush, alongside better color options and menus that finally make the Ribbon interface feel irrelevant in this new version.",
    "However, the big feature is dark mode finally appearing for Paint. While Windows has had its own dark mode theme since Windows 10, the app has never seen a shade of black, instead showing in a consistent white color that didn’t adapt to the theme you set your PC to.",
    "With Calculator and the Snipping Tool having also seen similar redesigns in previous builds, this new version is appearing in an upcoming version for Windows Insider users according to Panay.",
    "Whether you remember using it during your college years or as a way of practicing your creative craft for a future career, Paint feels like it has always been around.",
    "So, to see any update to the app in 2021 is very significant, especially as it’s been in Windows since the very first version back in 1985.",
    "After Microsoft announced in 2017 that Paint was to be replaced by Paint3D, the outcry prompted the company to roll back on that decision, and it looks as though this redesigned version for Windows 11 will allay any fears that it’s disappearing again.",
    "With dark mode and a new user interface with this version, it finally brings Paint into the modern age, with a design that’s more in line with the latest version of Windows, while getting rid of the Ribbon interface that the company incessantly tried to implement into every app back in 2012.",
    "As this new version looks to be appearing exclusively in Windows 11, Paint could now be even more accessible to new and existing users thanks to this redesign, while dark mode is something that users have long requested.",
    "Microsoft is clearly listening to its users’ requests, however small, so it will be an interesting time as to whether the team will look to refresh the look of other apps that haven't seen an update since 2001, such as Device Manager.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "A fresh coat of paint",
    "6": "Analysis: the return of MSPaint"
  },
  "links": {
    "post on Unsplash": "https://www.techradar.com/news/rejoice-paint-has-a-new-look-for-windows-11",
    ",": "https://www.techradar.com/news/rejoice-paint-has-a-new-look-for-windows-11",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "to roll back": "https://blogs.windows.com/windowsexperience/2017/07/24/ms-paint-stay/#PzlGpp3WmTXhFwEV.97",
    "Windows Latest": "https://www.windowslatest.com/2021/08/19/ms-paint-is-getting-a-new-design-and-dark-mode-on-windows-11/"
  }
}