{
  "source": "https://www.techradar.com/news/microsoft-teams-is-getting-a-bumper-update-for-the-hybrid-working-future",
  "title": "Microsoft Teams is getting a bumper update for the hybrid working future",
  "category": "computing",
  "updated": "2021-06-18T05:00:18Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams will let users collaborate in entirely new ways",
  "article": [
    "Microsoft has lifted the lid on a series of upgrades for collaboration platform Teams designed specifically to support the transition to hybrid working.",
    "Under a hybrid system, employees split their time between the home, office and any other location on a flexible basis, but commentators expect this model to throw up a number of logistical and practical challenges.",
    "In anticipation of these issues, Microsoft is bringing in new functionality to improve both synchronous and asynchronous working, with the goal of making Teams into a “canvas that creates and maintains context before, during and after meetings”.",
    "For example, new Fluid components will allow users to create dynamic widgets (e.g. tables and task lists) within Teams channels that co-workers can contribute to in real-time. These components can be copied over to other chat threads or the Outlook calendar board, without desynchronizing the data.",
    "At long last, Microsoft will also introduce the ability to pin specific messages to prevent them getting lost in the churn, as well as the option to quote messages in replies for additional context.",
    "Teams meetings will benefit from the new changes too, with attendees able to co-author meeting notes and actions lists during a session, which means the burden needn’t fall on the shoulders of just one person.",
    "After the meeting ends, any minutes and tasks will be automatically imported into OneNote, where additions and any necessary pruning can be made.",
    "According to Microsoft, its core ambition is to address what it sees as the most significant hybrid working challenge: ensuring collaboration remains equitable when employees are split between the home and the office.",
    "“We believe that hybrid work is the future of work,” said Jared Spataro, Corporate Vice President for Microsoft 365. “To empower their people to succeed in hybrid, business leaders will need to reimagine their organizations with a new operating model for people, places and processes.”",
    "“Many of the new features are based on the principle that effective hybrid meetings start by designing for people who aren’t in the room. [We want to] give remote participants a greater sense of physical presence in the meeting room so they can more easily be seen and heard.”",
    "To this end, the company is making a number of changes to Teams Rooms, the version of its collaboration platform designed for in-office meeting spaces.",
    "Later this year, Teams Rooms will receive a new front row layout that enlarges the video feeds of remote attendees, minimizing the sense that anyone not present in the room is peripheral to the meeting. If the meeting room is equipped with two screens, meanwhile, the video gallery will be split across both, giving each attendee more screen real estate.",
    "With compatible hardware from EPOS and Yealink, meanwhile, Teams Rooms will be able to utilize voice recognition technology to identify which attendee is speaking at any given time, This information will then be reflected in the meeting transcript, minimizing potential confusion.",
    "Finally, Microsoft has given its underutilized Whiteboard application a “hybrid-focused” facelift. Once the update becomes available later in the summer, Teams users will be able to work on a shared digital canvas, which will mimic the dynamics of in-person collaboration.",
    "“Hybrid work represents the biggest shift to how we work in our generation. I believe we have the opportunity to create a new world of work that can be better for everyone,” added Spataro.",
    "“When business leaders listen to their employees and what they want, and make thoughtful, conscious decisions about how they move forward and embrace flexibility, then we can pull forward the best of both worlds.”"
  ],
  "headers": {
    "7": "Hybrid collaboration in Teams"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Fluid components": "https://www.techradar.com/news/microsoft-fluid-took-office-collaboration-to-the-next-level-at-build-2020",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "OneNote": "https://www.techradar.com/reviews/microsoft-onenote",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review"
  }
}