{
  "source": "https://www.techradar.com/news/facebook-shops-is-coming-to-whatsapp-and-instagram",
  "title": "Facebook Shops is coming to WhatsApp and Instagram",
  "category": "computing",
  "updated": "2021-06-23T09:17:45Z",
  "author": "rob-clymo",
  "summary": "Facebook ramps up its mobile e-commerce masterplan",
  "article": [
    "Facebook is boosting its focus on e-commerce by adding Shops to WhatsApp along with Shop Ads listings within Facebook Marketplace. A new Visual Search product option for Instagram completes the trio of latest developments.",
    "The announcements were unveiled via livestream by Facebook CEO Mark Zuckerberg, who highlighted how Facebook and Instagram Shops now enjoy over 300 million visitors per month.",
    "Across its social media platforms Zuckerberg reported that there are more than 1.2 million monthly active Shops plying their wares through its social outlets. The number is impressive given that Facebook only launched its Shops venture twelve months ago.",
    "Small business owners stand to benefit hugely from the three new e-commerce developments. Shops on WhatsApp looks to be the most useful of the features because it will allow businesses to showcase their entire Shop from within the messaging app. “We're bringing Shops to WhatsApp, and we're bringing them to Marketplace on Facebook, which will make it easier for people to find the products or brands that they want to engage with,” said Zuckerberg.",
    "Facebook could also stand to benefit with the latest push towards offering increased e-commerce options. Allowing businesses to sell directly to the huge user base on WhatsApp could certainly help boost its revenues, given that WhatsApp has 500 million users in India alone.",
    "Adding to the appeal for small business owners is the fact that they only need to configure their shop once. The end result will then work across Facebook, Instagram and WhatsApp too, allowing quick and easy access to customers, especially seeing as they can also chat with a business before making a purchase.",
    "Facebook has already boosted the appeal of its WhatsApp for Business profile having made it much easier for businesses to get signed up. What used to take weeks in order for businesses to get up and running can now be achieved in minutes. While Shops in WhatsApp is a 'coming soon' feature, the Shops inventory in Marketplace is already available for Shops running in the US that have on-site checkout.",
    "Meanwhile, Shops Ads looks to focus on consumer shopping habits, with a more tailored experience based on an individual’s own product interests. It comes with the bonus of AR Dynamic Ads, which offer a more immersive experience for customers by allowing shoppers, for example, to test out different shades of lipstick. “We're launching the ability for a business to send shoppers to where you're going to be most likely to make a purchase based on your shopping behavior,” commented Zuckerberg. Rounding out the latest e-commerce developments, the AI-based Visual Search will let people upload their own photos in order to track down similar items. While the format isn't entirely new, the way that Facebook is bringing it to the masses could be influential, especially when it comes to shaping the way we shop online in the future. Of the new Instagram Visual Search development, Zuckerberg added: “A lot of shopping discovery begins with visual discovery, right, so you see something that you think is awesome. And then, you know, maybe you want to see other products that are like that, or you want to figure out how to get that product. This is the type of problem that AI can really help out with.”"
  ],
  "headers": {
    "4": "Shops for WhatsApp"
  },
  "links": {
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Instagram": "https://www.techradar.com/news/instagram-launches-professional-dashboard-to-help-run-business-accounts",
    "Shops": "https://www.techradar.com/news/facebook-adds-new-shop-feature-to-its-app",
    "Small business": "https://www.techradar.com/best/best-small-business-software",
    "messaging app": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "e-commerce options": "https://www.techradar.com/news/best-ecommerce-hosting",
    "small business owners": "https://www.techradar.com/best/small-business-tax-software",
    "WhatsApp for Business": "https://www.techradar.com/news/whatsapp-for-business-is-now-in-india",
    "on-site checkout": "https://www.techradar.com/news/facebook-extends-shops-to-whatsapp-marketplace-major-e-commerce-push",
    "shopping habits": "https://www.techradar.com/news/many-online-shoppers-are-using-guest-checkout-over-data-privacy-fears",
    "e-commerce developments": "https://www.techradar.com/best/best-payment-gateways",
    "shop online": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know"
  }
}