{
  "source": "https://www.techradar.com/news/court-rules-european-isps-must-hand-over-user-ip-addresses-if-piracy-suspected",
  "title": "Court rules European ISPs must hand over user IP addresses if piracy suspected",
  "category": "computing",
  "updated": "2021-06-22T13:49:58Z",
  "author": "mayank-sharma",
  "summary": "However, the ruling imposes certain conditions",
  "article": [
    "In a landmark judgement, the Court of Justice of the European Union (CJEU) has ruled Internet Service Providers (ISPs) can be forced to hand over the details of customers who are alleged to have downloaded copyrighted material illegally.",
    "However, in its 14000 word judgement, the CJEU has set out certain conditions that must be met before the details can be handed over, leaving a wide room for interpretation.",
    "Writing on the development, The Register reports that CJEU’s opinion was sought by the Companies Court in Belgium, which is presiding over a case between Cyprus-based Mircom International Content Management Consulting, and Belgian ISP Telenet.",
    "The case was filed by Mircom in 2019 after Telenet refused to hand over customer details linked to IP addresses that Mircom alleged had been used to “share films in the Mircom catalogue.”",
    "The Register says the case puts the Companies Court in Belgium in a tough spot as it is asked to find the balance between the enforcement of IP rights and the data protection rights of individuals that infringe them.",
    "To help make up its mind, the Companies Court passed the case to the CJEU to seek its opinion on three pertinent points, including the decentralized nature of the Bittorrent protocol and Mircom’s conduct in collecting the IP addresses of the alleged infringers.",
    "While the CJEU has ruled that the details can be handed over, it has added certain conditions by stressing that the transfer should be done in a way that is \"justified, proportionate and not abusive.\"",
    "The case now heads back to the Companies Court where lawyers for both Mircom and Telenet will try to spin arguments to mold the CJEUs ruling in their favor."
  ],
  "headers": {
    "4": "Checks and balances"
  },
  "links": {
    "downloaded": "https://www.techradar.com/best/free-download-manager",
    "The Register reports": "https://www.theregister.com/2021/06/21/court_of_justice_telenet_bittorrent_ruling/",
    "Bittorrent": "https://www.techradar.com/best/torrent-client"
  }
}