{
  "source": "https://www.techradar.com/news/sony-wh-1000xm4-vs-sony-wh-1000xm3-is-it-worth-upgrading",
  "title": "Sony WH-1000XM4 vs Sony WH-1000XM3: is it worth upgrading?",
  "category": "audio-visual",
  "updated": "2021-08-03T20:33:25Z",
  "author": "nick-pino",
  "summary": "Should you shell out for the more expensive Sony WH-1000XM4? We think so",
  "article": [
    "With no sign of the Sony WH-1000XM5 in sight, the Sony WH-1000XM4 are the clear winners as the best all-around noise cancelling headphones and are a significant step up from their predecessors, the Sony WH-1000XM3.",
    "Since their debut toward the end of 2020, the Sony WH-1000XM4 have offered class-leading noise cancellation thanks to an upgraded algorithm and new Bluetooth SoC, as well as improved call quality and music upscaling thanks to DSEE Extreme. The new headphones also have Bluetooth 5.0, multi-point Bluetooth pairing and a built-in sensor that can automatically pause the music when you take the headphones off – all valuable extra features you should be looking for when buying your next pair of wireless headphones.",
    "Perhaps the biggest reason to buy the Sony WH-1000XM4 is for their price: they cost as much as the Sony WH-1000XM3 did at launch and can sometimes be found at a steep discount during major shopping holidays like Black Friday and Cyber Monday.",
    "While the scale tips heavily in the WH-1000XM4's favor there's a lot to like about the WH-1000XM3 – they were, after all, the best noise cancelling headphones for over a year before the WH-1000XM4 came out. Still can't decide between the two? Let's break down all the differences below.",
    "Well, the obvious difference is that the Sony WH-1000XM4 is newer. It became available on August 6 2020 while the Sony WH-1000XM3 came out in 2018. But, beyond just being newer, the Sony WH-1000XM4 do have a number of new features that you won’t find on the previous generation WH-1000XM3 or WH-1000XM2.",
    "In short, here’s why you’d pick up the Sony WH-1000XM4:",
    "Better noise cancellation: If you’re buying a pair of noise-cancelling headphones you want something that really blocks out everything, right? Well, the Sony WH-1000XM4 does it. That’s because Sony retooled the noise-cancelling algorithm and now offers a new Bluetooth SoC to block more noise in the mid-range and higher frequencies. The benefit? Say goodbye to air conditioning noise, barking dogs and constantly ringing doorbells.",
    "Edge AI audio upscaling: This one’s a bit harder to hear, but Sony says it’s put a lot of work into implementing an audio upscaling system called DSEE Extreme that takes compressed audio formats like MP3/MP4 and fills in the gaps. The benefit there is that you can have a whole library of MP4s that don’t take up much space on your phone and they’ll sound like a library full of lossless FLACs. If you don’t store music at all, songs played off YouTube that were compressed should sound better, too.",
    "Precise Voice Pick Up: One of the biggest complaints about the Sony WH-1000XM3 is that they weren’t the best for business calls. Sony is hoping to change that stigma with the Sony WH-1000XM4 that uses a new technology called Precise Voice Pick Up to help your voice come through loud and clear. It works by using the four microphones on each earcup to hone in your voice while talking and reduce the amount of ambient noise that it picks up.",
    "Wearing detection for auto-play/pause: If you’re someone who constantly leaves their headphones on playing music only to find them out of juice a few hours later, the Sony WH-1000XM4 could have a killer feature for you: auto-play/pause. New for the 2020 model, Sony has embedded a sensor that can determine when the headphones are on or off and will automatically pause/resume the music. Take them off and leave them off for 15 minutes and the headphones will automatically turn off, preserving battery life.",
    "Admittedly, Sony has pretty much improved every aspect of its flagship headphones – even making small tweaks like the trimmed down padding on the bridge and additional padding around the earcups to reduce pressure. That said, a lot of them are little tweaks instead of massive overhauls.",
    "Here’s why you’d want to pick up the Sony WH-1000XM3 instead:",
    "Cheaper, especially if you buy them used: When we asked Sony what would happen to the Sony WH-1000XM3 after the new 1000XM4 hit shelves, the answer was that they’d pretty much go into retirement by disappearing completely. That said, there are loads of these headphones sitting on store shelves all over the world, which means you’re bound to see a few sales pop up over the next few months. You’ll also find a slew of sellers getting rid of their old 1000XM3 headphones at half-price, which could be a great way to snag a pair without breaking the bank.",
    "Equivalent battery life: The battery life isn’t better on the Sony WH-1000XM3 but it isn’t any worse, either. Both headphones are rated for around 30 hours of playback, so you won’t see any big changes in battery life by shelling out more for the 1000XM4.",
    "No surprise there. The Sony WH-1000XM4 is the better pair of headphones. They don’t improve in every single area, but they have enough improvements over their predecessors that they’re worth the extra cost if this is your first pair.",
    "Now, if you already have a pair of the WH-1000XM3 that you like and work well, don't feel like you need to drop everything this very second to buy the 1000XM4 at full price. Wait for a deal, then snag them at a discount."
  ],
  "headers": {
    "4": "What’s better about the Sony WH-1000XM4?",
    "10": "What’s better about the Sony WH-1000XM3?",
    "14": "Winner: Sony WH-1000XM4"
  },
  "links": {
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "noise cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}