{
  "source": "https://www.techradar.com/news/chip-maker-for-apple-qualcomm-amd-warns-chip-shortage-to-last-through-2022",
  "title": "Chip maker for Apple, Qualcomm, AMD warns chip shortage to last through 2022",
  "category": "computing",
  "updated": "2021-10-14T19:39:12Z",
  "author": "john-loeffler",
  "summary": "High performance computing and 5G fueling high demand",
  "article": [
    "The semiconductor shortage will definitely extend well into 2022 after the chip provider for some of the largest tech companies in the world said that production will struggle to meet the soaring demand for its products.",
    "In an online conference this week, TSMC CEO Dr. C.C. Wei said that TSMC foundry production capacity was still insufficient to satisfy the demand for its chips, especially orders for components used for high-performance computing (HPC) systems and 5G devices using the company's 5nm process node.",
    "The company's other process nodes, which are heavily used in automobiles, IoT, and server equipment, are also stretched thin according to the Taiwanese news outlet United Daily News. While TSMC is not nearly as large as Intel in terms of revenue, it has a much more diverse customer base since its chips are used by companies like Apple, AMD, Qualcomm to make everything from networking equipment to iPhones and graphics cards.",
    "If TSMC is stretched thin across its most important process nodes, then a far greater number of industries are going to be impacted by the constrained capacity than if Intel were facing the same production constraints which impacts the more \"traditional\" computing market more than anything else.",
    "In fact, even Intel is starting to contract with TSMC to make various chips and is itself starting to make chips for other companies like Amazon and Qualcomm to try and meet the global demand for semiconductor components.",
    "The only way the chip shortage will ever be addressed, though, will be to build more foundries to increase capacity, since demand for this most essential component of modern technology is only going to increase in the future as more of everyday life becomes digitized, from smartphones to smart cities.",
    "Dr. Wei also said during the conference that the company expects to begin mass production on its 2nm process node in 2025, and the company broke ground earlier this year on a new foundry in Arizona based on its 5nm process, which is expected to be completed in 2024.",
    "Rival semiconductor fabricator Samsung, meanwhile, is in negotiations to invest $17 billion into a second semiconductor foundry in Texas, in addition to increasing investment in its current plant in Austin to boost capacity.",
    "Intel is set to spend around $20 billion to build two new foundries in Arizona and recently contracted with the US Department of Defense to build capacity for the company's most advanced node, 18A, which it expects to begin use in production starting in 2025.",
    "While most industry professionals will tell you that they expect the chip shortage will last into 2022, this might leave the impression that sometime in 2022, the chip shortage is going to end and that you'll be able to finally buy a PS5 or the best graphics cards that are all but vaporware right now.",
    "That's not quite what they're saying, though, since businesses project conditions out to a certain point in time to plan their business strategies, production, and inventories. Given the number of variables involved in such financial modeling, you can only really take it so far before your numbers become unreliable. That's what CEOs and such actually mean when they say the chip shortage will last through 2022.",
    "That means, in 2022, they could all show up at conferences to say that the chip shortage will last through 2023 or 2024, and honestly, that is what's going to happen unless the new reality that this chip shortage isn't a shortage at all, but a systemic deficit settles in.",
    "Chip foundries take years to build, so a number of new plants that come online in four years are going to do anything to meet the demand for chips as it currently exists. And as anyone with a cellphone that starts to degrade in performance after a couple of years can tell you, just because TSMC or Samsung fabricated the chip that runs your phone today doesn't mean that they've satisfied your demand, at least not permanently.",
    "Every couple of years, those foundries are going to have to fab all new chips to power your next phone, and the one after that. On top of that, they now also have to fab the chips that run your new Wi-Fi 6 router, and your Nest Hello doorbell, and your car.",
    "They're also going to have to build the chips to meet the demands of all the new customers they're picking up in parts of the world that had been neglected for the past twenty years in the Global South and many parts of Asia that are starting to see a booming consumer market for these goods.",
    "And that's just consumer electronics, we're not talking about all the new networking infrastructure we're going to need for the delayed 5G rollout, and then 6G when that comes around down the road.",
    "Demand is only increasing, and its growth is likely to be closer to exponential rather than linear. Adding to the number of fabrication plants isn't going to be enough to keep up when we need to be multiplying the number of plants.",
    "On top of all that, you have a physical supply chain that can disrupt production capacity at any number of points along the way, something we're seeing even with the recent port crisis in the US. All the while, demand might slow or even flatten out a bit, for a while, but it will never suddenly start declining in a way that could allow production to catch up."
  ],
  "headers": {
    "9": "The chip shortage will never go away, here's why"
  },
  "links": {
    "United Daily News": "https://udn.com/news/story/7240/5816535",
    "make chips for other companies like Amazon and Qualcomm": "https://www.reuters.com/technology/intel-build-qualcomm-chips-aims-catch-foundry-rivals-by-2025-2021-07-26/",
    "company broke ground earlier this year": "https://www.reuters.com/technology/tsmc-says-construction-has-started-arizona-chip-factory-2021-06-01/",
    "invest $17 billion into a second semiconductor foundry in Texas": "https://www.reuters.com/technology/samsung-electronics-close-finalising-17-bln-texas-chip-plant-sources-2021-09-29/",
    "build two new foundries in Arizona": "https://www.intel.com/content/www/us/en/newsroom/news/idm-manufacturing-innovation-product-leadership.html#gs.dpdrpv",
    "recently contracted with the US Department of Defense": "https://www.techradar.com/news/intel-qualcomm-will-design-advanced-chips-for-us-military",
    "PS5": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Wi-Fi 6 router": "https://www.techradar.com/news/wi-fi-6-routers-the-best-wi-fi-6-routers-you-can-buy-in-2019",
    "Nest Hello": "https://www.techradar.com/reviews/nest-hello"
  }
}