{
  "source": "https://www.techradar.com/news/pokemon-go-adds-gen-8-but-some-users-are-too-angry-to-play-the-game",
  "title": "Pokémon Go adds Gen 8, but some users are too angry to play the game",
  "category": "gaming",
  "updated": "2021-08-06T14:30:24Z",
  "author": "henry-st-leger",
  "summary": "U-turn from Niantic has Pokémon Go players up in arms",
  "article": [
    "UPDATE: Pokémon Go developer Niantic has responded to discontented fans, saying it is \"assembling an internal cross-functional team\" to look into possible solutions or changes it could implement around \"interaction distance\", with findings to be shared by September 1. Its statement also says Niantic will be \"reaching out to community leaders in the coming days to join us in this dialogue.\" To see what all the fuss is about, read the original story below...",
    "Pokémon Go developer Niantic has revealed that Gen 8 Pokémon – from the region of Galar in the Pokémon Sword and Shield games – will be landing in the hugely popular AR mobile game this month, but there's an issue.",
    "The official Pokémon Go Twitter account made the announcement, revealing that the \"Skwovet, Wooloo, Falinks, Zacian, and Zamazenta\" Pokémon would all be arriving in the game soon, as part of the upcoming Ultra Unlock event beginning August 20.",
    "Ultra Unlock is a recurring global event that tasks trainers with completing set challenges every hour, with new Pokémon being added alongside higher spawn rates for thematically linked Pokémon – such as prehistoric Pokémon in the first Ultra Unlock back in July.",
    "It's not all sunshine and Jigglypuffs, though, as players are still smarting from the reversal of so-called 'Covid bonuses', which increased the distance players could be at when coming across Pokémon in the app.",
    "The increased distance allowed players to more easily access Pokémon on their travels, without having to stand in a specific spot that could be crowded by other trainers, or simply be a bit out of reach.",
    "The reversal has many players calling for the temporary distance buff to be brought back, with some even trying to get #BoycottNiantic trending on Twitter or posting screenshots of their low usage metrics – while others express disappointment that Gen 8 creatures are being added before earlier generations get a look in.",
    "Player unrest is nothing new, especially around big game updates. Some will always be disappointed or confused by what's been added or removed, and it usually means that a developer is catering to some players while overlooking others. With a massive player base like that enjoyed by Niantic, that's somewhat inevitable.",
    "However, the distance increases seemed to have helped a lot of players feel safer, especially for events with large gatherings of users – while those in rural areas were more able to find Pokémon in hard-to-reach players, given that country roads and landscapes aren't as easily accessed as densely-packed city streets.",
    "One of the largest community blogs, Pokémon Go Hub, has even taken to releasing a post around how best to voice discontent to Niantic, noting that \"With no communication at all from Niantic, to anyone in the community, it is time for us to raise our voices in other ways.\"",
    "Fan pressure can beget change, of course, though it's often the case that larger developers and publishers can be slower to move or less flexible in their roadmaps. And, ultimately, given the scale of Pokémon Go, we don't see even a loud minority of players managing to overturn a decision from up high – though we'd love to be surprised."
  ],
  "headers": {
    "7": "Analysis: Lay out your unrest"
  },
  "links": {
    "statement": "https://nianticlabs.com/blog/pgo-exploration-bonus-response/?hl=en",
    "Pokémon Go": "https://www.techradar.com/news/gaming/pokemon-go-updates-everything-you-need-to-know-about-what-s-coming-next-1330140",
    "Pokémon Sword and Shield": "https://www.techradar.com/reviews/pokemon-sword-and-shield-review",
    "Covid bonuses": "https://pokemongohub.net/post/news/niantic-removes-special-pandemic-bonuses/",
    "calling for the temporary distance buff to be brought back": "https://twitter.com/ComicallyTim/status/1422639015212109828",
    "some even trying to get #BoycottNiantic trending on Twitter": "https://twitter.com/Masterful_27/status/1422637734410309638",
    "before earlier generations get a look in": "https://twitter.com/AquaAzeem/status/1422650585380179972",
    "how best to voice discontent to Niantic": "https://pokemongohub.net/post/article/how-we-as-a-community-can-voice-our-concerns-to-niantic/"
  }
}