{
  "source": "https://www.techradar.com/news/best-google-stadia-games",
  "title": "Best Google Stadia games: Hitman 3, Cyberpunk 2077 and more",
  "category": "gaming",
  "updated": "2021-01-20T21:08:48Z",
  "author": "gerald-lynch",
  "summary": "Our pick of the best Google Stadia games you can play right now.",
  "article": [
    "While Google Stadia doesn't see every game that the PS5 and Xbox Series X do, it does get most of its console rivals' best games.",
    "From Cyberpunk 2077 to Red Dead Redemption 2, from Hitman 3 to Assassin's Creed Valhalla, Stadia may get a bad rap for its walled garden approach to game streaming but you can't say the streaming service is lacking in new AAA releases.",
    "Google Stadia's main appeal is without a doubt the ability to immediately play the latest and greatest games on the go without the need for downloading anything or owning expensive physical hardware like an Nvidia GeForce 3090. It's available on most laptops and PCs, Chromecast Ultra and soon, LG smart TVs.",
    "But how do you get started? And what should be your first port of call in this brave new world of game streaming? From Baldur’s Gate 3 to SteamWorld Heist, we've picked out the best Google Stadia games, in alphabetical order, below.",
    "Assassin’s Creed Odyssey",
    "A Greek odyssey of epic proportions, Ubisoft’s Assassin’s Creed Odyssey makes even its lavish earlier historical adventure efforts look miniscule by comparison. Finally fully embracing the RPG mechanics that have sat that the fringes of the series for years now, Odyssey is a grand game, absolutely gigantic in size, with assassination missions to uncover, beautiful landscapes to explore and a surprisingly well imagined cast to interact with. It’s sheer size makes it a great match for Stadia – should you plan on being able to finish it in this lifetime, you’re going to want instant access to it on as many devices as possible, which Stadia offers.",
    "Assassin's Creed Valhalla",
    "Once you're done murdering your way through the sunny climes of Assassin's Creed Odyssey, wrap up warm for a viking raid through dark ages Britain in Assassin's Creed Valhalla, the latest in Ubisoft's premier open-world series.",
    "A further evolution of the historical assassination series, it's another beautiful game with lushly rendered countryside, and an ever-so-slightly more succinct world to enjoy. Side quests are weaved more intricately into the core game, combat takes precedent over stealthiness, and UI options allow for more natural and organic exploration. It's one of the best in the long-running franchise, which is no mean feat.",
    "Baldur's Gate 3",
    "Baldur’s Gate 3 might be in Early Access, but there is plenty to love in this new RPG epic from Larian Studios, the devs behind Divinity: Original Sin. BG3 thrusts you into the fantasy world of Faerûn in this new title set in the lavish world of Dungeons and Dragons; using the tabletop’s 5th edition ruleset to form the basis of gameplay. Create your own character, form and break bonds with companions, shove people off cliffs, and throw pretty much anything you find on the floor as an improvised weapon at friends and foes alike.",
    "From its turn-based combat to the cinematic and engaging story, Larian has expertly translated the player agency and rules of D&D into a truly gorgeous game and, even in its Early Access build, the result is extremely fun. Since the game is in Early Access, this means you won’t be getting the full experience – just the first of what is expected to be a three chapter story. Even so, that represents some 30+ hours of gameplay, and that's before considering how hugely replayable this chunk of game is, playing wildly differently based on player choices and character builds.",
    "This is a way for fans to play early and give feedback to the developers as it continues to evolve and update the game based on feedback. You can also play the whole game in four-player co-op, so what are you waiting for? Gather your party and venture forth.",
    "Borderlands 3",
    "A bombastic shooter, Borderlands 3 is the most colorful game on Stadia, and up there with its most addictive, too. You probably know the score by now – it’s a sci-fi blast-em-up, with a loot-collecting twist, and this third installment really does go out of its way to throw the kitchen sink of ideas out there. Fancy shooting a gun that turns into an explosive brain on metal spider legs when you toss it away? Borderlands 3 is ready to answer that call.",
    "Cyberpunk 2077",
    "Look, Cyberpunk 2077 isn't perfect, but the Stadia version of the game is miles ahead of the janky PS4 and Xbox One versions that absolutely slowed to a crawl when they were released. The Stadia version of Cyberpunk 2077 allows you to soak up the scenic vistas of Night City without taxing your GPU and walk through crowds without decimating your VRAM. No, the game doesn't look quite as stunning as it does on a high-end gaming PC with everything set to Ultra, but if you want the Cyberpunk experience without the Cyberpunk console experience, the Stadia version is the cheapest ticket in town.",
    "Darksiders Genesis",
    "There’s a distinct lack of Diablo-like action-RPGs on Stadia at the moment, but Darksiders Genesis proves a worthy entry into the genre – somewhat surprisingly, in fact. For a series that was born as a God-of-War-meets-Zelda-in-Hell affair, it’s translated incredibly well into a click-and-loot fest, with a greater emphasis on direct action than most Diablo clones offer. It’s not particularly punishing with a bit of latency introduced by streaming either, making it an enjoyable play on Stadia.",
    "Destiny 2",
    "In a similar vein to Borderlands, but with more of an MMO-like end-game grind to enjoy, Destiny 2 does a fantastic job of fusing the Halo-style shooting mechanics that developer Bungie is known for with an enigmatic and addictive looter-shooter loop. Get a good team of mates to play this with, and the chunky, hard-hitting gunplay here will have you constantly coming back for more.",
    "Football Manager 2020",
    "Just as addictive as Destiny 2, but far more grounded in our world, comes the eternally moreish Football Manager. It’s never been much to look at (though this year’s soccer management sim has its most detailed match view to date), being essentially a giant gamified spreadsheet. But if you’ve ever fancied being a top manager in charge of the beautiful game, there’s nothing like it. We’d go as far as to say Stadia is actually the BEST way to play Football Manager. It doesn’t require lightning reflexes, so latency isn’t an issue, but it does require an investment in time. Stadia’s servers are able to do the hardcore number crunching the game relies in incredibly quickly, and being able to take one of the most addictive games ever onto whatever computer or phone you have to hand makes that ‘one more game’ loop even more appealing.",
    "Gylt",
    "The only Google Stadia exclusive on our list. It may not be Resident Evil, but don’t let Gylt’s cutesy art-style fool you – there are scares galore to be had here. Linear and at times predictable if you’re a horror gaming veteran, it does manage to squeeze in some clever puzzles and genuinely breathless stealth sequences. One to play with the lights on.",
    "Hitman 3",
    "Now Hitman 3 is an interesting one - not just because it's the end of IO Interactive's Hitman trilogy that started a few years ago, but because it's the first to support State Share on Stadia. State Share is a new Stadia feature that allows you to share your in-game contracts with other players to try for themselves. Taking a screenshot or video capture embeds your specific game state, which saves key info about your contract that others can play using a link. Best of all, playing a game state won’t disrupt your game progression. It's a neat way to show someone a particularly awful situation you've put yourself in, or simply share your favorite parts of the game.",
    "Immortals Fenyx Rising",
    "Want the open-world fun of an Assassin's Creed game, but less of the violence and po-faced historical philosophising? Immortals Fenyx Rising is like the toy-box version of the Creed series, taking its historical influences (in this case, Greek mythology) and open world mechanics, and wrapping it up in a cartoon-like storyline.",
    "With elements of Zelda: Breath of the Wild thrown in (quite liberally), it's a mish-mash of open world greats, but comes together with humor and heart aplenty. If you want a breezier open world game, and one that won't take an entire lifetime to complete, Immortals Fenyx Rising should be on your list.",
    "Kine",
    "A musical puzzler with a lot of heart, Kine is a mind-bending brain scratcher. Playing as different musical instruments moving around grid-shaped levels as they attempt to form a band, Kine is quite unlike any other puzzle game you’ll have played. What’s particularly good is the way it’s levels slowly reveal hidden themes through the game – it’s not just a puzzler about the joy of music, but of love and life, too.",
    "Metro Exodus",
    "In terms of sheer graphical bells and whistles, Metro Exodus is THE Stadia game to play. Of all the Stadia ports we’ve tried so far, it’s clear that its developers have put the most care and attention into Metro Exodus. It’s a real showcase for the potential power of Stadia, with it being the port most closely resembling a real top-end PC experience. The post-apocalyptic survival shooter is eerie at the best of times, but this Stadia version really tries to push the envelope with graphical settings. Locked, by developer’s choice, to 30fps, it’s a more methodical than twitch-focussed shooter, making the inherent latency of a streamed experience more manageable too.",
    "Rage 2",
    "If Metro Exodus is the apocalypse in muted tones, Rage 2 is the ‘Mad Max Fury Road’ reimagining. A barmy open-world shooter that loves to lean in on the excess, it has great gunplay and wild power ups that make the end of the world seem fun, all painted in garish neon hues. Do note however that, being quite a twitchy game, you might find that Stadia’s latency levels will make pinpoint targeting tricky. We’d encourage you to play with the analogue stick sensitivity levels to counteract any perceived delay.",
    "Red Dead Redemption 2",
    "Much like Assassin’s Creed Odyssey, Red Dead Redemption 2 is a game to get lost in. It’s vast American wilderness is one of the best-realised in all of gaming, with secrets to uncover, gangs to do battle with and a truly cinematic story wrapping it all together. It’s a mammoth download on consoles and PC, with the PC version being particularly resource hungry to get it running at its best. Like Creed, being able to access it instantly on whatever screen you’re using will make it a far more accessible experience.",
    "SteamWorld Heist",
    "In SteamWorld Heist, you’re in charge of a rag-tag team of steam-driven pirate robots which you must see to safety and riches in a series of epic tactical shootouts. From its music, setting and excellent gameplay, you’ll have hours of fun boarding, looting and shooting your way through enemy spaceships, all the while sporting some fancy hats for your crew to wear. Considering this is also a Nintendo Switch title, the somewhat simplistic nature of the game lends itself incredible well to on-the-go gaming, for those using Stadia on a smartphone or tablet.",
    "If you’re familiar with the SteamWorld games, you’ll immediately notice all the charm and flavor from previous titles, like Steamworld Dig, present here. Heist is something of a unique title, even in terms of its gameplay. It has turn-based combat like the X-Com series, but it’s 2D and has an extremely fun bullet ricochet feature when in combat. This sees you manually aim your gun to fire at enemies, but instead of just simply shooting forward, you have the option to take into account all your surroundings so you can pull off the most elaborate and needlessly cool trick shots at any given time."
  ],
  "headers": {
    "4": "The best Google Stadia games"
  },
  "links": {
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nvidia GeForce 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Chromecast Ultra": "https://www.techradar.com/reviews/chromecast-ultra",
    "LG smart TVs": "https://www.techradar.com/news/lg-oled-tvs-embrace-cloud-gaming-with-google-stadia-and-geforce-now-support",
    "Baldur’s Gate 3": "https://www.techradar.com/news/baldurs-gate-iii-may-just-be-the-future-of-pc-rpgs-and-im-so-here-for-it",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}