{
  "source": "https://www.techradar.com/news/apple-watch-6-black-unity-edition-is-now-on-sale-but-only-until-the-end-of-february",
  "title": "Apple Watch 6 Black Unity edition is now on sale, but only until the end of February",
  "category": "wearables",
  "updated": "2021-02-02T09:55:44Z",
  "author": "james-peckham",
  "summary": "Made for Black History Month",
  "article": [
    "Announced at the end of January, the Apple Watch 6 is now available in a new Black Unity variant that's a limited-edition model designed by the company to celebrate Black History Month.",
    "You can now buy the Apple Watch 6 Black Unity variant directly from Apple in either 40mm or 44mm sizes, plus you'll have the choice of GPS-only or GPS and cellular variants as well.",
    "The GPS variant starts at $399 / £379 / AU$599 while those who want cellular connectivity will find the price starts at $499 / £479 / AU$749. It's available now in the US, UK and Australia, as well as some other countries around the world.",
    "What is different here? It's mostly the design, which has been modeled on the Pan-African flag with a strap design showing those colors of red, black and green and a watch face that is designed to match.",
    "The rear of the fastening pin on the strap also has the phrase 'Truth. Power. Solidarity.' laser-engraved on its rear as well.",
    "If you don't want to buy this smartwatch outright, you'll find the watch face is available to download onto your Apple Watch as part of the watchOS 7.3 update that landed at the end of January.",
    "The Black Unity watch technology isn't different from the Apple Watch 6, so you should expect to see a similar experience as we had in our review from this product. This is just a new design of the existing product.",
    "Apple previously said that this Watch 6 variant will only be available during Black History Month, so you'll want to buy this before the end of February to ensure you get the smartwatch.",
    "If you miss out, you can download the watch face to any existing Apple Watch and the company will continue selling the Black Unity strap for the remainder of this year at $49 / £49 / AU$69.",
    "Apple says it supports Black Lives Matter, the European Network Against Racism, the International Institute on Race, Equality and Human Rights, the Leadership Conference Education Fund, the NAACP Legal Defense and Education Fund, and Souls Grown Deep.",
    "Exactly how much the company is donating from sales of these smartwatches is currently unclear though. The company says that is supports the organizations listed above and that this is \"only a small part of Apple's commitment to challenge systemic barriers that exist for communities of color, and particularly for the Black community.\""
  ],
  "headers": {
    "7": "A limited time only"
  },
  "links": {
    "at the end of January": "https://www.techradar.com/news/apple-watch-6-is-getting-a-limited-black-unity-edition",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "variant directly from Apple": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1924150044788153300&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fshop%2Fbuy-watch%2Fapple-watch%2F40-mm-gps-black-unity-aluminium-black-unity-special-edition-sport-regular",
    "review": "https://www.techradar.com/reviews/apple-watch-6-review"
  }
}