{
  "source": "https://www.techradar.com/news/the-ram-and-ssd-storage-of-apple-m1-macs-can-be-upgraded-but-its-a-terrible-idea",
  "title": "The RAM and SSD storage of Apple M1 Macs can be upgraded - but it's a terrible idea",
  "category": "computing",
  "updated": "2021-04-07T09:53:16Z",
  "author": "jess-weatherbed",
  "summary": "Seriously, don't do this",
  "article": [
    "The Apple M1 chip has been demolishing the competition in many areas since it hit the market in late 2020, with incredible performance and speed benefits over competitor products even outside of the ARM race. However, one of the caveats for choosing a Mac device is the general lack of upgradability, with the RAM even being soldered onto the motherboard of certain MacBooks. Some determined tech enthusiasts over in China hasn't let that deter them, having upgraded a base model M1 MacBook Air with 8GB of RAM to 16GB, and upped its 256GB of storage to 1TB.",
    "Of course, in the words of Ian Malcom from Jurassic Park, 'they were so preoccupied with whether or not they could, they didn’t stop to think If they should'. The work involved to make these upgrades is extremely invasive and reportedly carries a high risk of failure. The exact process for the upgrade hasn't been released, but it did involve adding new components by de-soldering the existing RAM and SSD, and no changes were made to existing firmware.",
    "We can't stress enough that this is a bad idea to try yourself, not only because of the high risk of it not working (and the obvious voided warranty), but the work required also simply isn't worth the payoff. The DRAM and NAND memory (a type of nonvolatile flash) are extremely hard to come by for everyday consumers, usually being purchased by large manufacturing companies. You'd also need to be very proficient in soldering – given that one mistake will leave you with a very expensive paperweight – and have all the suitable equipment to hand, which doesn't make this a cheap upgrade for the average Joe. The discovery itself that this can be achieved is of course commendable, but the practical applications are fairly nonexistent. It's far better to pay upfront for a MacBook Air or MacBook Pro with larger storage if you're worried about the specs than it is to try and Frankenstein an upgrade to the machine yourself. Given time though, there may be potential for MacBooks and other hard-to-upgrade products to have an approved process for futureproofing by swapping internal components, so while this is certainly a non-recommended enthusiast project, it does add weight to potential life-extending methods that could be implemented for devices.",
    "Via MacRumors"
  ],
  "headers": {
    "2": "Perfectly impractical in every way"
  },
  "links": {
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "ARM": "https://www.techradar.com/news/windows-on-arm-could-finally-compete-with-apples-m1-chips-thanks-to-x64-emulation",
    "M1 MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "MacRumors": "https://www.macrumors.com/2021/04/06/m1-mac-ram-and-ssd-upgrades-possible/"
  }
}