{
  "source": "https://www.techradar.com/news/total-war-warhammer-3-preview-taking-on-the-dark-gods-has-never-been-more-satisfying",
  "title": "Total War: Warhammer 3 preview — Taking on the dark gods has never been more satisfying",
  "category": "gaming",
  "updated": "2021-05-14T15:08:53Z",
  "author": "samuel-tolbert",
  "summary": "Kislev",
  "article": [
    "Total War: Warhammer 3 is a really big game. Not just in its strategic scope — the game brings six factions to the table, including the forces of the Chaos Gods and the previously-unseen empire of Cathay — but in the tactical layer as well. A grand finale requires equally grand action, which is why Creative Assembly is introducing something called Survival Battles.",
    "I had the chance to see these Survival Battles in action, then go hands-on and try one myself through a cloud streaming setup. I also got a chance to speak with Lead Battle Designer Jim Whitston and Game Designer James Martin about how the studio is going about crafting this experience.",
    "To set the icy stage, Survival Battles are rare, only occurring at “significant points” in the narrative where a dramatic showdown is taking place. For Kislev, this means invading the realm of a Chaos God, no mean feat by any stretch of the imagination. This meant increasing the number of enemies involved in the battle, with numerous waves of foes to crush as you advance into a dark citadel. Early on, these enemies are much weaker than normal, in order to facilitate an epic feeling as you kill wave after wave of Daemons.",
    "The difficulty increases as you advance however, taking key positions and holding out as more enemy reinforcements pour in, culminating in a boss battle against a champion of the Dark Gods, one of the Greater Daemons: an Exalted Bloodthirster.",
    "In order to increase the options players have at their disposal, the developers have added a \"toolbox\" of sorts to these battles. You'll earn points for taking objectives and killing daemons, which can be spent on upgrading your troops, summoning new troops entirely or even building a variety of walls and towers to slow any further waves of Daemons that pour in after you.",
    "\"We're very interested to see [players] enjoy the new game modes,\" Whitston and Martin say. \"Having something now like Survival Battles [is something] we've always been able to do but never had the opportunity and Warhammer 3 has been the best fit so far. It's allowed us, with all of these Daemons, to get this mode in and really show off a vast amount of enemies against you to give players a good challenge.",
    "That challenge is certainly present. While the early stages of the Survival Battle didn't give me any trouble, both times I played I was ended up unable to beat the Greater Daemon at the end. Certainly part of that is unfamiliarity with Kislev's awesome roster but it's a challenging balance of figuring out where to use your resources and how to preserve your troops throughout these lengthy fights.",
    "Choosing between pulling in additional cavalry and archers, replenishing the health of your existing soldiers, or raising towers and barricades to harass the Daemons chasing you isn't easy.",
    "While I definitely need more time hands-on with the faction to get a better idea of its ins and outs, I can also say that Kislev makes an excellent first impression. Strong line infantry and archers are accompanied by winged hussars perfect for wheeling charges, while Bear Riders and a Great Bear Elemental (embodiment of the Kislevite God, Ursun) make up the heavy-hitters. The latter in particular is no joke, repeatedly holding the line on his own even when my other forces were routed.",
    "The new Lore of Ice wielded by Tzarina Katarin also feels appropriately powerful, strengthening your lines while blasting away dozens of Daemons at a time. It’s tough to get an in-depth read at a glance but the “swinging pendulum of balancing” that Whitson and Martin refer to seems to have worked out, with the stated intention being that all six factions in at launch live up to the best of what the team has done before. Overall, Kislev feels impressive as a faction, something Creative Assembly seems proud of.",
    "\"We've got Kislev and Cathay, who are two factions that have been present in the Games Workshop Warhammer lore for donkey's years but have never been fully realized as factions. We're really fortunate that Games Workshop have decided to fully flesh those two factions out and it's been interesting to peer over the shoulders of their designers as they work on that content, to see that coming together and then work out how we're going to transpose that into our game in a fully authentic and fun way.\"",
    "While I didn’t get to control them directly, Khorne’s forces are likewise impressive and the entire map feels ripped right out of a lore book. I’m told the team has taken care getting the “flavor” of each dark god right, something critical given the bold decision to split one tabletop army book into four distinct factions.",
    "What about the other forces of Chaos though, the Beastmen and Warriors of Chaos already in the prior games? These factions are found lackluster by most players for their limited roster and playstyle but Whitston and Martin are tightlipped on what, if any, changes will be coming for these factions in the future.",
    "I've poured hundreds of hours into various campaigns across the first two Total War: Warhammer games and this is unlike anything I've encountered before. It felt well-paced and intense, like I was at an epic culmination that would no doubt feel even more meaningful during a long campaign. I also appreciated the lack of walls and siege equipment, meaning Survival Battles don't have the struggles of the series oft-hated siege battles.",
    "Speaking of siege battles, I asked if we can expect any changes and improvements in the final game. Creative Assembly is evasive, but yes, some changes have been made, which we’ll be seeing at a later date. Similar changes (with similarly evasive answers) are coming for the diplomacy system, with the designers noting that “Diplomacy is a problem we’ve run into already” but even more work was needed for this third game.",
    "\"There's a possible temptation to play it safe and phone this one in. It's the third in a series that's been so successful so far but we decided that we wanted to just keep pushing the series, breaking new ground with it, going 'Bigger, Badder, Better,'\" Whitston and Martin say.",
    "I have a lot of questions left unanswered regarding other elements of the game. I'm curious how the larger campaign as a whole will play out and especially just how this will all be connected in one grand mega-campaign for all three games. Overall though? I'm even more excited than before. I'm eager to see just how this clash between the forces of order and the dark gods plays out.",
    "Total War: Warhammer 3 is currently slated to be released sometime in Late 2021 for PC via Steam and the Epic Games Store."
  ],
  "headers": {},
  "links": {
    "Total War: Warhammer 3": "https://www.techradar.com/news/total-war-warhammer-3-everything-you-need-to-know"
  }
}