{
  "source": "https://www.techradar.com/news/the-role-of-data-in-building-resiliency-for-the-worlds-hotels",
  "title": "The role of data in building resiliency for the world’s hotels",
  "category": "computing",
  "updated": "2021-08-27T10:21:48Z",
  "author": "joseph-beaumont",
  "summary": "The hospitality industry implementing data and tech",
  "article": [
    "The pandemic hit all corners of the world, forcing countries to shut their borders to control the spread of the virus and its mutations. This greatly affected the hospitality and travel industry, which had to continuously reconsider how it serviced its customers, so as to meet the changing rules and government regulations. This has remained paramount to guaranteeing the safety and loyalty of both the industry’s guests and employees.",
    "As with many of the sectors hard hit by the pandemic, digital transformation has helped hospitality quickly adapt outdated processes and alleviate new and increasing pressures with the aid of new digital tools. Many hotels, for example, have started using data in new and innovative ways on a global scale. This is particularly true as technologies, such as IoT, which rely on data to perform, have become vital to managing the spread of COVID in public areas.",
    "The availability of and access to data collected during digital interactions has helped hotels and the wider hospitality industry transform how they operate, manage and improve their offerings, including providing guests with a seamless and personalized experience that can help drive customer loyalty.",
    "Using data also comes with high risk, however, so the hospitality industry needs to consider and understand data best practices to be successful in using it to its full potential, which could contribute to the speedy revival of hotels around the world.",
    "Anyone working in the sector understands the importance of first impressions. That’s why many hotels have moved to digital-first check-in processes via phones or through downloadable apps to guarantee a stress-free arrival and booking process for their guests.",
    "This way, hotels can communicate more seamlessly with their guests and provide them with all the information they might need ahead of their trip. They can even offer them the opportunity to amend their booking details to align with their preferences, such as their room type, dietary requirements, or arrival needs.",
    "Once guests have safely checked-in, hotels can use these applications to ensure and maintain high-quality service for the duration of the guest’s stay. Guests will enjoy automatic log-in to the hotel Wi-Fi for example, control the temperature and television in their room, as well as book restaurants as if liaising directly with the concierge, or simply contact reception staff, housekeeping or leisure facilities via instant messaging for other queries. If allowed, guests’ preferences can be retained for future bookings, such as their preferred room temperature, which could then be pre-set prior to the guests’ arrival. In addition, staff can personalize messages or offers to guests during their stay, or provide real-time assistance with aspects such as directions to the pool.",
    "IoT technologies are also being used with greater regularity to improve customer experience in various industries. In the hospitality sector, they can aid staff with tasks such as locating equipment like smart luggage racks and cleaning carts via asset-tracking technology. Maintenance staff can also benefit from the ability to review performance data collected by specific devices located around a property, and troubleshoot any repairs required should conditions drop below appropriate levels. When implemented alongside 5G, IoT devices may even support hotel restaurants in improving food tracking and waste disposal.",
    "These technologies make it easier for those working in the leisure industry to improve the quality of guests' stays, track the delivery of services and gather feedback, just as they would pre-COVID, all while removing all physical touchpoints and complying with government health and safety regulations.",
    "Even after a guest’s departure, engagement can continue in the form of feedback requests. Combining modernized applications with data and information gathered during their stay can help paint a clear picture of the quality of experience guests are receiving and pin-point areas of improvement.",
    "From a business stand-point, data collection from applications and IoT sensors have the potential to play a vital role in helping management to reduce energy costs and guide sensible planning resourcing decisions, including when it comes to capacity and personnel. For example, when New York’s Chatwal Hotel upgraded to a smart lighting system throughout the hotel, it reduced its lighting energy consumption by 90%.",
    "Safeguarding customer loyalty and attracting new clientele is essential to a successful hospitality industry, which relies on a good reputation. But over the years another factor has started to contribute to a business’ reputation: its ability to handle consumers’ data. Data is now considered the most valuable asset to an organization and protecting it is of paramount importance. The consequences can be severe, with Marriott Hotels previously facing a fine of £18.4m for a data breach that hit millions of their guests.",
    "Data management can prove time-consuming and challenging, though. It requires individuals with the skills to manage multiple databases and servers, and ensure compliance and security. This is tricky in a pandemic-stricken world, where many hospitality firms have had to cut their staffing levels by half, meaning fewer employees are available to monitor certain aspects of IT operations, such as cybersecurity. Data management is, however, a strategic imperative – especially as hotels begin to implement data collecting technologies like those discussed above.",
    "IT teams should consider bringing a third-party cyber security expert on board to help overcome these challenges. They can help to ensure peace of mind by helping firms co-develop sophisticated data management strategies, which will set the platform for more a connected hospitality sector in future.",
    "The introduction of data management in response to the pandemic will undoubtedly benefit the experience hotels can deliver. Entering the digital age with 5-star data management will allow hotels to deliver personalized experiences which boost their reputation and future revenue, and convert one-off guests into loyal, returning customers."
  ],
  "headers": {
    "4": "Incorporate data to drive a digital-first approach",
    "7": "How IoT can streamline operations",
    "9": "A new era of data-driven hotels",
    "11": "Data management is imperative"
  },
  "links": {
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "apps": "https://www.techradar.com/best/best-android-apps-2021",
    "applications": "https://www.techradar.com/news/software/applications/30-best-mac-apps-for-just-about-everything-712511",
    "customer experience": "https://www.techradar.com/best/cx-tools",
    "5G": "https://www.techradar.com/best/best-5g-phones",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses"
  }
}