{
  "source": "https://www.techradar.com/news/dont-let-black-friday-distract-you-from-security-protection",
  "title": "Don't let Black Friday distract you from security protection",
  "category": "computing",
  "updated": "2021-11-25T11:40:32Z",
  "author": "techradar-pro",
  "summary": "Stay safe when hunting for bargains with our top security tips",
  "article": [
    "With Christmas now only a matter of weeks away, the upcoming Black Friday and Cyber Monday events offer the usual ocean of deals and offers to get shoppers to splash the cash.",
    "But while you can probably trust most major online retailers, some offers really could be too good to be true, so you'll need to keep your guard up when hunting for bargains.",
    "So if you're hitting the (online) high street this year, here's some security tips to make sure you don't get caught out this Black Friday.",
    "Unless you're constantly refreshing sites, the most common way to hear about the latest deals is often through email messages. However this does mean that hackers often target victims using legitimate-looking emails hiding malicious links - sometimes even using the real branding and images to fool users into a click.",
    "Keeping safe online has never been more important, and Bitdefender Total Security comes with a range of tools to make you stay protected from all the latest threats and make sure you don't get tricked.",
    "This includes an advanced filtering system that warns you whenever you visit websites that may try to scam you, and advanced anti-phishing protection that helps sniff out and block any malicious websites in order to steal your financial data, passwords or credit card numbers.",
    "Whether Black Friday or not, making sure your identity stays protected online is vital, so always ensure an email or a website asking for personal data is legitimate, so that you aren’t giving away valuable data without knowing it.",
    "Bitdefender Total Security comes with a range of tools to make sure you don’t fall victim to ID theft, including a strong privacy firewall alongside specialised social network protection. That's not all though, as it also offers high-end threat detection systems to stop sophisticated malware, alongside technologies to protect against zero-day attacks and multi-layer ransomware protection to keep your files safe.",
    "We're all well aware of the benefits using a Virtual Private Network, or VPN, can bring - and this is even more true on Black Friday, where you can compare prices from shops and sellers around the world.",
    "But the service can also be a vital security tool, disguising your IP address and connection to hide your real location, meaning hackers or stalking software shouldn’t be able to track your internet activity or find out where you are.",
    "Bitdefender Total Security comes packaged with an improved Secure VPN service that offers complete online privacy alongside a 200MB/day per device allowance, meaning you can ensure your shopping isn't compromised in any way.",
    "With many of us now working from home at least some of the time, it's never been more important to make sure all your smart devices are secure.",
    "Although many of us are well aware of needing to make sure our laptops or desktops are secure, other devices in the home office often get forgotten. Tablets and smartphones, as well as other devices such as printers and even internet routers, can be easy targets for cybercriminals looking to hack into your network, and need the same level of protection.",
    "Bitdefender Total Security works across multiple platforms and software versions, and can be used across up to 15 devices per household, whether Windows, macOS, Android and iOS protection - meaning you can be sure all your devices are protected. It also offers vulnerability assessment which will scan for security holes and vulnerabilities such as missing Windows security patches and potentially unsafe system settings, then indicates the best fix."
  ],
  "headers": {
    "3": "Beware phishing emails",
    "6": "Keep your ID safe",
    "8": "Shop around with a VPN",
    "11": "Secure all your devices"
  },
  "links": {
    "Bitdefender Total Security": "https://www.bitdefender.co.uk/solutions/total-security.html"
  }
}