{
  "source": "https://www.techradar.com/news/samsung-merges-mobile-and-consumer-divisons-in-latest-restructuring",
  "title": "Samsung merges mobile and consumer divisons in latest restructuring",
  "category": "phones",
  "updated": "2021-12-07T16:47:50Z",
  "author": "raj-narayan",
  "summary": "It's getting two new CEOs",
  "article": [
    "Samsung has announced an internal reorganization that sees the South Korean giant merging its smartphone division into its consumer electronics business.",
    "The new SET division will sit alongside a seperate entity representing Samsung's semiconductor unit, with both businesses gaining a new CEO.",
    "The move seems to indicate the company's plans to maintain focus across a wide range of interests and technology, whilst still keeping a tab on both internal and overall hardware, particularly its Samsung phones.",
    "The announcement was part of a detailed statement from the South Korean giant revealing several changes at the leadership level.",
    "The news means Samsung will now have two CEOs overseeing two divisions (instead of the previous three), effectively reversing an earlier decision made in 2017 when the company appointed three business leaders.",
    "Jong-Hee Han, who was credited with making Samsung the leading television brand as global head of TV sales, now becomes the co-CEO of the new SET division.",
    "The company says that in his new role, Jong-Hee Han is, \"expected to strengthen the synergies among the different businesses in the SET Division and help drive new businesses and technologies.\"",
    "The semiconductor division will be headed by Kyehyun Kyung, previously head of Samsung's electro-mechanics division, who is credited with success at the company's flash memory product team and the DRAM (dynamic random access memory) design team.",
    "Samsung has long been engaged in keeping track of the competition in the lucrative semiconductor business against the likes of Intel and TSMC.",
    "Following the recent launch of the Snapdragon 8 Gen 1 chipset, Qualcomm indicated it would continue its association with Samsung foundry for its flagship processors.",
    "Samsung announced in 2019 that it had set aside $115 billion to take on Intel and Qualcomm in the advanced semiconductor business, with the aim of becoming the world leader in the logic chip market by 2030.",
    "The company noted in today's statement that Kyehyun Kyung will be expected to \"maintain the company’s semiconductor leadership and lead innovation in the components business.\""
  ],
  "headers": {
    "3": "Reorganization"
  },
  "links": {
    "Samsung": "https://www.techradar.com/news/best-samsung-phones",
    "Samsung phones": "https://www.techradar.com/deals/samsung-mobile-phone-deals",
    "detailed statement": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1027725035753450600&xs=1&url=https%3A%2F%2Fnews.samsung.com%2Fglobal%2Fsamsung-electronics-announces-new-leadership-2%3Fnrtv_cid%3D318c9b9f1409b7be093c28441d13a031ebefa7e3cdece30eb3199cffc34dce5a%26cid%3Dopmc-ecomm-nrtiv-pc-042720-142005-verge-9667082%26utm_source%3Dverge%26utm_medium%3Dnarrativ%26utm_campaign%3D9667082%26utm_content%3Dpc%26nrtv_as_src%3D1&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-merges-mobile-and-consumer-divisons-in-latest-restructuring",
    "Snapdragon 8 Gen 1 chipset": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "indicated": "https://www.techradar.com/news/qualcomms-snapdragon-8-gen-1-chipset-is-exclusively-manufactured-by-samsung"
  }
}