{
  "source": "https://www.techradar.com/news/volvo-xc60-recharge-review",
  "title": "Volvo XC60 Recharge review: plug-in hybrid is great for space, comfort and family",
  "category": "car-tech",
  "updated": "2021-05-12T14:33:12Z",
  "author": "john-mccann",
  "summary": "Safe, comfortable, (and at times) electric",
  "article": [
    "Safe, comfortable, electric – well, electric at least some of the time. The former two, the Volvo XC60 Recharge always is.",
    "While the popular mid-sized SUV is available with traditional gasoline engines, it’s now also available as a Recharge model – which, in the XC60’s case, sees a traditional combustion engine married with a small battery that can be topped up by plugging it into a charging station, providing the option to drive as a full electric car.",
    "The standard XC60 price starts at $41,700 / £40,460 (around AU$53,000), but prices for the plug-in hybrid Volvo XC60 Recharge start at a loftier $53,500 / £58,850 (around AU$68,000). The spec we drove, including options, came to a sizable $72,840 / £64,950 (around AU$92,000).",
    "We got behind the wheel of the Volvo XC60 Recharge T8 AWD Inscription Pro – to give it its full name – to find out how it handles the hybrid lifestyle.",
    "Aside from the Recharge badge on its rear, you wouldn't know about the XC60's plug-in capabilities: it stays true to the design of the rest of its namesakes.",
    "It features the iconic Volvo design cues, from the sizable grille and light blocks to the familiar roofline and stance. Sitting in between Volvo's XC40 and XC90 SUVs, the XC60 Recharge provides an elevated stance and plenty of room without being overpowering in its size.",
    "Open the driver's door to climb inside and you'll find a spacious and comfortable cabin, with plenty of head- and legroom. The seats are accommodating, and in the XC60 Recharge we drove both heated and ventilated, ensuring you're at the perfect temperature, whatever the weather. Oh, and the steering wheel is heated too.",
    "You'll find a couple of cup holders in between the front seats, along with a wireless phone charger and a smaller covered compartment at the base of the center console that provides storage for items such as keys and coins. There are also sizable door pockets, plus more storage in the front, under the central armrest.",
    "Rear-seat passengers are also well catered for, with heated outer seats, enough head- and legroom for adults to comfortably sit for long journeys, and an enjoyable view of the sky out of the large sunroof.",
    "The door pockets in the rear of the car are smaller, but passengers do have access to magazine pockets on the rear of the front seats, plus a small tray between those two front seats, which is perfect for keys or phones.",
    "The good space story continues into the trunk, with the XC60 Recharge offering ample room for luggage and groceries.",
    "The Volvo XC60 Recharge is an all-wheel drive (AWD) vehicle, providing power to all four wheels for greater traction – but much of the time it will only power two wheels to improve fuel efficiency. Under the hood sits a 4-cylinder petrol engine with a max output of 303hp, but this isn't the only power unit inside the car.",
    "Since the XC60 Recharge is a plug-in hybrid, you also get a battery that can drive motors, allowing you to move along without using the combustion engine at all when in EV mode – or in tandem with it when in Hybrid mode.",
    "In its sportiest mode – which Volvo calls 'Power' – the XC60 Recharge can deliver a 0-62mph time of 5.5 seconds and reach a top speed of 112mph.",
    "It feels powerful enough from behind the wheel, and while we did notice a slight lag between putting our foot down and the engine responding, we were able to achieve decent acceleration. The handle on the XC60 Recharge is good enough, allowing you to roll into corners at a reasonable pace, while overall it offered us a relatively smooth, quiet ride.",
    "An eye-catching design feature is the glass drive-select knob, allowing for easy transition between forward and reverse (as well as neutral and parked), and just below you'll find the ignition switch – which itself is a touch unusual, if you're not familiar with Volvo.",
    "The XC60 Recharge offers keyless ignition, but instead of the traditional start/stop, here you'll need to twist the switch 90 degrees to bring the car to life. It takes a few days to learn just how firm of a twist is required to start the engine, but you'll adapt soon enough.",
    "Something else drivers will also want to play with is the drive mode scroll wheel, which sits below the start/stop switch.",
    "There are five modes to choose from, with 'Hybrid' being the default, allowing the XC60 Recharge to automatically switch between battery and petrol power. If you want to get the best performance from the XC60 then switch to 'Power', while 'Off-Road' places a focus on traction and suspension when driving on rough roads.",
    "If you want to force four-wheel drive (for example, if conditions are icy), you can opt for 'Constant AWD', while those looking to be a little kinder to the planet can opt for the fully electric mode, 'Pure'.",
    "Volvo says the XC60 Recharge can offer an all-electric range of up to 33 miles on a single charge of the battery, although in reality we were getting between 20 and 23 miles of pure EV range.",
    "The smaller battery inside the XC60 Recharge means it doesn't take all-night to charge (unless you're plugging it directly into a traditional socket in your home). Using our at-home 22kW charger, we could fully refill the battery in around two hours.",
    "The Volvo XC60 Recharge comes well equipped with technology. There are automatic lights and wipers, climate control, blind-spot indicators on the mirrors, and our vehicle also came with a premium Bowers & Wilkins sound system offering powerful bass and great clarity for our tunes.",
    "There are cameras all the way round the XC60 Recharge, providing you with a 360-degree, bird's-eye view of your vehicle when reversing and parking, along with parking sensors, too, ensuring you don't knock into anything.",
    "You get cruise control and lane assist as well, two features that can work together for Pilot Assist, where the XC60 Recharge takes over more of the control when driving on long stretches of road.",
    "Here, the car automatically accelerates and decelerates, while also keeping you in lane and steering as the road bends. You're required to keep your hands on the steering wheel and provide some resistance, so the vehicle knows you're still paying attention. However, on long journeys on fast-moving stretches of road, the feature makes the experience less taxing.",
    "Pilot Assist works reasonably well, maintaining speed well, but we found the XC60 Recharge did prefer to hug one side of a lane, rather than plant itself in the middle. This led to some nervous moments if vehicles in other lanes were also traveling close to the markings.",
    "The infotainment system centers around a 9-inch touchscreen, its portrait orientation giving it a smartphone-like appearance. It's one of the more modestly sized displays we've seen in new cars, with a number of manufacturers opting for larger screens, but some may find the smaller offering here more to their liking.",
    "The built-in navigation is serviceable, but it isn't the best we've used: it struggled with postcode input. On the plus side, directions are displayed in the 12.3-inch TFT digital instrument cluster behind the wheel, and also in the useful heads-up display (HUD), which beams key information (including current speed, speed limit, cruise control status and nav directions) into your eye line on the windshield.",
    "A quick word on that cluster display. It's bright and clear, but there's little in the way of customization, which may frustrate those who like a little more control over what’s displayed here.",
    "Bluetooth support allows you to wirelessly connect your smartphone to the system, which in turn provides the ability to make hands-free calls and stream audio from your handset through the XC60's powerful Bowers & Wilkins speakers. There are controls on the steering wheel to easily adjust volume, skip tracks and pick up / hang up calls.",
    "Deeper smartphone control is available, too, with support for Android Auto and Apple CarPlay when you plug your phone into one of the two USB-A ports hidden in the storage area under the central armrest.",
    "We used Android Auto during our time with the XC60. With access to Google Maps, navigation is approved, although directions aren't mirrored in the digital cluster or HUD as is the native navigation, so there's still some benefit to using the built-in option.",
    "Also slightly frustrating is the fact that the smartphone system takes up less than half of the 9-inch display, which means text is on the small side. Had the screen been positioned in landscape orientation it would have allowed Android Auto to fill more of it, and thus make it more legible.",
    "We can't hold Volvo solely responsible here – Apple and Google could also work on portrait layouts for their CarPlay and Auto systems, which would allow for more seamless integration across a wider range of vehicles.",
    "And don't fear, rear-seat passengers aren't totally forgotten about; they have access to two USB-C ports (yes, USB-C rather than the USB-A ports in front – so ensure everyone is carrying the correct cables).",
    "Volvo recently upgraded the infotainment system in its new XC60 range, but sadly, this was after our review and thus we haven't been able to test it. With Google Maps, Assistant and the Play Store for apps now built into the car's system, it should offer an enhanced experience.",
    "The Volvo XC60 Recharge offers plenty of space and comfort for passengers, there's enough grunt under the hood to keep you moving, plus a range of tech to keep you safe and make driving easier.",
    "While there's a premium to pay, the plug-in hybrid gives you the option to drive in a fully electric mode, saving on petrol use and vastly reducing the XC60 Recharge's emissions.",
    "You're unlikely to hit Volvo's quote of up to 33 miles of EV driving on a single charge, but you can comfortably expect to get over 20 miles at a time, which will cover most journeys in and around town."
  ],
  "headers": {
    "4": "Volvo XC60 Recharge design",
    "11": "Volvo XC60 Recharge drive, range and charging",
    "22": "Volvo XC60 Recharge specs and tech",
    "37": "Verdict"
  },
  "links": {}
}