{
  "source": "https://www.techradar.com/news/macbook-pro-16-inch-2021-and-14-inch-models-hit-mass-production-according-to-rumor",
  "title": "MacBook Pro 16-inch (2021) and 14-inch models hit mass production according to rumor",
  "category": "computing",
  "updated": "2021-08-09T12:57:07Z",
  "author": "darren-allan",
  "summary": "Up to 800,000 units predicted to be ready to go for the end of November",
  "article": [
    "Apple has kicked off mass production of its redesigned MacBook Pro 14-inch and 16-inch models, or at least that’s what we’re hearing on the grapevine.",
    "This comes from a paywalled DigiTimes report (spotted by MacRumors) which observes that shipments of the new MacBook Pros are expected to reach 600,000 to 800,000 units by the time the end of November rolls around. Exercise the usual skepticism around this prediction, naturally.",
    "Apple is expected to reveal the new laptops either in October or November, so this theoretically shows that everything is still on track with getting the revamped MacBook Pros out and on shelves late this year, with the launch event soon followed by availability of the machines – in good quantities.",
    "When these new portables arrive, they are expected to bring in a number of innovations, and some of the bigger rumored changes include an improved processor (purportedly the M1X, but it could be called something else), plus a fancy Mini LED screen.",
    "Apple is also thought to be bringing back MagSafe charging, and employing a flat-edged design as opposed to curves, with other trimmings expected to include an upgrade for the webcam to 1080p (finally). We might also see the Touch Bar ditched (at least from some models, potentially), and there may even be an option for 64GB of RAM (although rumor peddlers can’t seem to agree on that one).",
    "In recent times, we’ve heard worrying noises from the rumor mill that the MacBook Pro models might not make the purportedly planned late 2021 launch, but now the chatter from the grapevine appears to have turned pretty positive that Apple will make this happen.",
    "This fresh DigiTimes report backs up respected Apple leaker Ming-Chi Kuo’s speculation of a Q3 start for mass production, and the new models still being on track for a late 2021 release (and October or November launch). A very recent EEC (Eurasian Economic Commission) filing is more potential evidence that a pair of new Apple laptops are being readied, which is surely likely to be the two MacBook Pro offerings (no other possibility fits as well, that’s for sure).",
    "In short, the balance of evidence appears to be very much tipping towards the MacBook Pro models debuting late on this year, despite some of the other tales about fears of delays and whispers of worries around Mini LED panel production capacity (something Apple has in hand according to another DigiTimes report MacRumors flagged up last month).",
    "Due to the innovations on board, and particularly that new screen, these MacBook Pros are expected to be in much demand, so it’s good to hear that at least going by the shipment figures mentioned here, there should be plenty of machines ready for launch time."
  ],
  "headers": {
    "5": "Analysis: Weighing up the evidence"
  },
  "links": {
    "MacBook Pro 14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "DigiTimes": "https://www.digitimes.com/news/a20210713PD206.html",
    "MacRumors": "https://www.macrumors.com/2021/07/13/apple-gains-extra-mini-led-supplier/",
    "October or November": "https://www.techradar.com/news/new-macbook-pro-14-inch-and-16-inch-could-arrive-disappointingly-late-in-2021",
    "M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "bringing back MagSafe charging": "https://www.techradar.com/news/apple-could-be-killing-off-one-of-the-macbook-pro-16-inchs-most-controversial-features",
    "flat-edged design as opposed to curves": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "upgrade for the webcam to 1080p": "https://www.techradar.com/news/the-next-macbook-pros-are-rumored-to-be-getting-a-1080p-webcam-upgrade",
    "Touch Bar ditched": "https://www.techradar.com/news/new-macbook-pro-could-kill-off-touch-bar-rumors-suggest",
    "option for 64GB of RAM": "https://www.techradar.com/news/macbook-pro-16-inch-could-be-cooler-than-ever-even-with-more-powerful-gpu",
    "can’t seem to agree on that one": "https://www.techradar.com/news/new-macbook-pro-2021-rumor-delivers-both-good-and-bad-news",
    "Apple leaker Ming-Chi Kuo’s speculation": "https://www.techradar.com/news/new-macbook-pros-still-on-target-for-later-in-2021-rumor-claims",
    "recent EEC (Eurasian Economic Commission) filing": "https://www.techradar.com/news/m1x-macbook-pro-may-still-be-on-track-for-2021-as-new-clues-emerge",
    "tales about fears of delays": "https://www.techradar.com/news/tsmc-gas-contamination-incident-sparks-fears-of-delays-for-macbook-pro-2021-and-iphone-13"
  }
}