{
  "source": "https://www.techradar.com/news/iphone-13-pros-ultra-wide-camera-could-get-two-big-upgrades",
  "title": "iPhone 13 Pro’s ultra-wide camera could get two big upgrades",
  "category": "phones",
  "updated": "2021-06-28T08:52:54Z",
  "author": "james-rogerson",
  "summary": "Autofocus and more",
  "article": [
    "While we’re not expecting major changes to the camera specs for the iPhone 13 range compared to the iPhone 12, we have heard about a number of possible tweaks, and it sounds like the ultra-wide lens could be in for at least two improvements.",
    "That’s according to Ming-Chi Kuo (an analyst with a great track record for Apple information), who in a research note seen by 9to5Mac claims that the ultra-wide camera on the iPhone 13 Pro and iPhone 13 Pro Max will include autofocus.",
    "You might have assumed the ultra-wide lens on the iPhone 12 range already had autofocus, but in fact it uses fixed focus, meaning that you can’t focus on a specific object. This isn’t actually a huge problem, since ultra-wide shots tend to be of landscapes, where the details are distant enough to all be in focus anyway, but adding an autofocus will help with shorter range ultra-wide photos.",
    "Kuo additionally claims that the iPhone 13 Pro and Pro Max will have a six-element ultra-wide lens, up from five elements on the iPhone 12 range. That’s a change which could lead to better quality images.",
    "While Kuo claims that only the iPhone 13 Pro models will get these upgrades, he adds that all four iPhone 14 models will feature these improvements. So if you want an upgraded ultra-wide snapper and don’t want to spend big on a Pro model, you might need to wait until 2022.",
    "It’s worth noting that these aren’t new claims. Kuo said the same many months ago, but back then it was early days for iPhone 13 rumors, and any claim should have been taken with a healthy helping of salt, since things could have changed during development. That he’s standing by these claims suggests they’re more likely to be true – though we’d still take them with a pinch of salt.",
    "We should find out in September, as that’s when we’re expecting Apple to unveil the iPhone 13 range. In the meantime, stick with TechRadar for all the news and leaks."
  ],
  "headers": {
    "3": "Extra elements"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "9to5Mac": "https://9to5mac.com/2021/06/27/iphone-13-pro-to-feature-ultra-wide-lens-with-autofocus-coming-to-regular-models-next-year/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+9To5Mac-MacAllDay+%289+to+5+Mac+-+Apple+Intelligence%29",
    "said the same many months ago": "https://www.techradar.com/news/iphone-13-tipped-to-feature-a-major-camera-upgrade"
  }
}