{
  "source": "https://www.techradar.com/news/plenty-of-people-care-about-windows-11-but-not-enough-to-pay-for-it",
  "title": "Windows 11 has people excited, but few will actually pay for it",
  "category": "computing",
  "updated": "2021-10-16T19:05:11Z",
  "author": "joel-khalili",
  "summary": "Most people won't rush to buy a new PC for Windows 11, survey suggests",
  "article": [
    "The majority of people are not willing to purchase a new device in order to make the switch to Windows 11, despite the performance improvements and new features on offer, new data suggests.",
    "According to a survey of 1,000 people by poll platform OnePulse, conducted on behalf of TechRadar Pro, just 14.6% of people in the US will purchase a Windows 11 device before the end of the year. And this figure is even lower in the UK, at 12.4%.",
    "A slightly larger proportion of those surveyed (22.6%) expect to buy a Windows 11 laptop, PC or tablet at some point in 2022, but by far the largest section of respondents (roughly 42%) plan to keep their current device and update it to Windows 11 at a later date.",
    "Although our data shows that people are excited about the performance improvements on offer with Windows 11, as well as the superior tools for working, the consensus among experts has been that it is sensible to wait before upgrading.",
    "In addition to the bugs already appearing in the first public builds, and the performance issues affecting users running certain AMD CPUs, early adopters of Windows 11 face a number of potential challenges.",
    "For example, as analyst firm Gartner explains, many applications have not yet been fully optimized for the new operating system and users are bound to face unexpected issues relating to hardware compatibility, even if their devices adhere to the strict new hardware requirements.",
    "Over the next year, Microsoft is also likely to make a number of tweaks to the Windows 11 user experience based on feedback, which means diving straight into the new OS will also mean “potentially experiencing two learning curves”, Gartner says.",
    "The survey data suggests many people are heeding these warnings. Asked to provide a first impression of Windows 11, many more people said they look upon the new OS favorably (51.6%) than said they feel negatively about it (8.1%). However, the most sizable proportion in both the UK and US (at roughly 40%) said their stance is neutral, suggesting many people are reserving judgement until Windows 11 matures.",
    "Whether or not Windows 11 can be deemed a success won’t be clear until the dust settles and Microsoft has delivered the first few rounds of updates. The early signs suggest people are willing to give Windows 11 time to fulfil its potential, but patience may soon wear thin if early issues persist into 2022 and beyond."
  ],
  "headers": {
    "3": "Windows 11 early adopters"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "PC": "https://www.techradar.com/news/best-business-desktop-pcs",
    "tablet": "https://www.techradar.com/news/best-business-tablets",
    "number of potential challenges": "https://www.techradar.com/news/three-more-reasons-to-delay-your-windows-11-upgrade"
  }
}