{
  "source": "https://www.techradar.com/news/this-xbox-series-x-charging-kit-means-your-controllers-might-never-run-out-of-battery",
  "title": "This Xbox Series X charging kit means your controllers might never run out of battery",
  "category": "gaming",
  "updated": "2021-06-10T15:00:00Z",
  "author": "rhys-wood",
  "summary": "All swap, no drop?",
  "article": [
    "OtterBox is set to launch the Power Swap Controller Batteries for Xbox Series X, Xbox Series S and Xbox One console controllers soon. What it calls an “industry-first power solution,” the Power Swap Controller Batteries aim to deliver a hot-swapping charging solution that doesn’t interrupt the player’s gaming experience.",
    "That’s right – power for your controllers at all times, even when swapping batteries.",
    "The Power Swap Controller Batteries from OtterBox are set to release on June 15, 2021 and will cost $59.95 (around £42 / AU$78). The device will be purchasable from OtterBox’s official website, as well as Amazon. As the Power Swap Controller Batteries are part of the Designed for Xbox program, the device will also be available for purchase from Microsoft’s online store.",
    "But how does it work? The quick-release battery attaches to the back of your Xbox One or Xbox Series X/S controller, and supposedly can deliver upwards of 10 hours on a single charge. When the battery is low, though, a low-battery light illuminates the player’s hands, indicating it’s time to hot-swap the battery.",
    "The hot-swap is achieved by using the quick release feature on the battery. Then, the user can pick up the second battery from the charging dock and place that back into the controller, potentially allowing for uninterrupted play even when you’re changing the battery.",
    "But wait, you might say, how does the controller still function while you’re swapping batteries? Doesn’t it at least need a battery or power source to be present to keep working? It seems OtterBox has thought of that, as a reserve cell on the unit remains attached to the controller, providing ancillary power while you perform the hot swap.",
    "It sounds like a neat idea, but how practical are the Power Swap Controller Batteries, really? Honestly, we can see the product coming in handy during more heated gameplay moments. Say you’re in the final 10 on a PUBG match. While hot-swapping your batteries, you at least won’t be left disconnected while that final circle approaches, potentially giving you a fighting chance.",
    "While we like the sound of the OtterBox Power Swap Controller Batteries’ potential to save us a lot of battery swapping headaches, we still have to put the device through its paces. We’ll be testing the product to see how it ranks among the best Xbox Series X/S accessories you can buy, so keep an eye on TechRadar for our official verdict."
  ],
  "headers": {
    "4": "Too good to be true?"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Series X/S controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
    "best Xbox Series X/S accessories": "https://www.techradar.com/best/xbox-series-x-and-series-s-accessories"
  }
}