{
  "source": "https://www.techradar.com/news/sea-of-thieves-a-pirates-life-is-the-biggest-most-impactful-update-ever",
  "title": "Sea of Thieves: A Pirate’s Life is the ‘biggest, most impactful update ever’",
  "category": "gaming",
  "updated": "2021-06-20T18:45:00Z",
  "author": "adam-vjestica",
  "summary": "It’s a pirate’s life for me",
  "article": [
    "Rare’s swashbuckling online pirate adventure game, Sea of Thieves, certainly has the wind in its sails at the moment. After three years of substantial updates – which have added new gameplay mechanics, islands, emergent events, pets and countless cosmetics – it’s hard to remember what the game looked like when it was released in March 2018.",
    "And that’s a good thing, because Sea of Thieves launched in a rather barebones state. The foundations were obviously there, but the game was severely lacking in content and enough variety to keep all but the most dedicated players engaged.",
    "Now, though, Sea of Thieves’ unpredictable nature is where the game truly shines. A simple voyage can often turn into something completely unexpected, which can lead to some unforgettable stories full of spectacular highs and lows. It’s no wonder, then, that the game has amassed over 20 million players.",
    "However, on June 22, Sea of Thieves is set to get even better thanks to the upcoming Sea of Thieves: A Pirate’s Life update. Creative director Mike Chapman describes it as the game’s “biggest, most impactful ever”, and after attending a sneak peek at what awaits players in this ambitious crossover with Disney’s Pirates of the Caribbean franchise – which won’t cost a single doubloon to experience – the open seas have never looked so inviting.",
    "Sea of Thieves: A Pirate’s Life takes inspiration not just from the films, but also from the historic attraction at Disneyland. Eagle-eyed fans will spot many nods and creative twists that resemble moments from the classic ride, and those who were hoping to meet more than just Jack Sparrow from the crew of the Black Pearl will also be delighted to hear that more Pirates of the Caribbean characters will be in the game. The films’ famous soundtrack will also be present.",
    "Players will get to experience five Tall Tales that tell an epic original story where you team up with the trickster Captain Jack Sparrow. Unlike with previous Tall Tales, however, you won’t be interrupted by other players. It means that Rare has been able to craft “the most cinematic Tall Tales we’ve ever done”, said Chapman, and include more set pieces and mechanics that might not have been included due to the possibility of intervening players. Checkpoints are also available, which means you won’t have to rush through the eight to 12-hour core story in one go.",
    "But how did the world’s most recognizable pirate end up in the Sea of Thieves? Well, Jack has stolen the greatest treasure of all time – a golden key to other worlds. Upon entering the Sea of Thieves, he discovers that it's a paradise for pirates, where death is only a formality before you’re back in the land of the living, ready to set sail again.",
    "That’s not the case in Jack’s world, of course, as Davy Jones has dominion over the seas. However, unfortunately for Jack, the tentacled terror Davy Jones has followed Jack into the new world, and the world of Sea of Thieves is now under threat.",
    "Players will visit all-new locations such as the supernatural world of the Damned and the Sunken Kingdom in this Sea of Thieves: A Pirate’s Life, and there are countless secrets and Easter eggs to find. You’ll dive deeper than you ever have before, wield a new weapon called the Trident of Dark Tides, use Jack Sparrow’s famous compass that points to the thing you want most in the world, and encounter brand new enemies such as sirens, phantoms, and ocean crawlers – all of which will also be available in the game’s main sandbox.",
    "Captain Jack Sparrow will be on hand to help, of course. He’ll man the cannons when you’re fighting Davy Jones’ Flying Dutchman, and when he’s not in combat, you can find him hanging around the ship for the odd selfie. It’s clear that the utmost care and attention went into making Sparrow as convincing as possible, too, as Rare hired actor Johnny Depp’s stunt double from the film (complete in costume) to play out key cinematics. Sparrow is also voiced by Jared Butler, who voiced the legendary Captain in the Pirates of the Caribbean: At World’s End video game.",
    "This has clearly been a dream project for so many at Rare, and both Chapman and Sea of Thieves’ executive producer Joe Neate could barely contain their excitement as they spoke about how the partnership between Disney and Rare’s seafaring adventure came to be.",
    "Apparently, Disney recognized the tone, humor and fantastical nature of Sea of Thieves, and Rare has worked hard to try to tap into the feeling of what it means to be a pirate, and the enduring appeal of what makes pirates such a fascinating part of history.",
    "The overriding message that seemed to be integral to Rare and Disney’s partnership coming to fruition, though, was one of respect – both for Sea of Thieves’ and Pirates of the Caribbean’s lore and universe. And, from what we’ve seen so far, it appears that Rare has achieved that balance with aplomb.",
    "“There’s never been a better time to play Sea of Thieves,” said Chapman, and it’s honestly hard to disagree. To paraphrase Captain Jack Sparrow: if you were waiting for the opportune moment to play Sea of Thieves, this is it.",
    "Sea of Thieves: A Pirate’s Life is available on June 22 as a free update for Xbox One, Xbox Series X, Xbox Series S and PC players. The game is also available on Xbox Game Pass."
  ],
  "headers": {
    "4": "Bring me that horizon",
    "8": "Skull and crossbones",
    "10": "X marks the love"
  },
  "links": {
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-release-date-news-and-features",
    "Sea of Thieves: A Pirate’s Life": "https://www.techradar.com/news/sea-of-thieves-a-pirates-life-is-a-crossover-with-disneys-pirates-of-the-caribbean",
    "Disney": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}