{
  "source": "https://www.techradar.com/news/trend-micro-uncovers-dangerous-new-hackers-for-hire-void-balaur",
  "title": "Trend Micro uncovers dangerous new 'hackers for hire' Void Balaur",
  "category": "computing",
  "updated": "2021-11-11T10:12:07Z",
  "author": "mayank-sharma",
  "summary": "Gang has already taken victims all over the world",
  "article": [
    "Cybersecurity researchers have shared comprehensive insight into a prolific hacker-for-hire group that have targeted at least 3,500 individuals and organizations and have been operational since 2015.",
    "The cybercriminals, uncovered by Trend Micro, which named the group Void Balaur, are said to advertise their services under the Rockethack moniker on Russian-language forums.",
    "According to the researchers, Void Balaur’s services include cracking email and social media accounts, and selling sensitive personal and financial information about targets.",
    "“Cyber mercenaries [are] an unfortunate consequence of today's vast cybercrime economy. Given the insatiable demand for their services and harboring of some actors by nation-states, they're unlikely to go away anytime soon,” opined Feike Hacquebord, senior threat researcher for Trend Micro.",
    "According to the researchers, the cyber mercenaries charge anywhere between $20 for a stolen credit card history to over $800 for phone call records with cell tower locations.",
    "Perusing through their targets, which span the globe, the researchers note that the gang has targeted organizations known to store highly sensitive and potentially lucrative information, such as telecommunications companies, ATM machine vendors, financial services companies, medical insurers, and even IVF clinics.",
    "Besides organizations, the group has also been observed to attack individuals such as journalists, human rights activists, politicians, scientists, doctors, telco engineers, and cryptocurrency users.",
    "Commenting on their tactics, the researchers note that Void Balaur often relies on email phishing along with info-stealing malware such as Z*Stealer or DroidWatcher, to achieve its nefarious goals.",
    "Trend Micro believes that comprehensive reports such as the one it has collated is the best form of defense against threat actors such as Void Balaur.",
    "Defend yourself against threat actors like Void Balaur by protecting your accounts with security keys, and encrypting all your data and communications."
  ],
  "headers": {
    "4": "Cyber thugs"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "Trend Micro": "https://www.techradar.com/reviews/trend-micro-2020-antivirus-solutions",
    "Void Balaur": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1480696086882793200/https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/the-far-reaching-attacks-of-the-void-balaur-cybermercenary-group",
    "email": "https://www.techradar.com/news/best-email-provider",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "security keys": "https://www.techradar.com/best/best-security-key",
    "encrypting": "https://www.techradar.com/best/best-encryption-software"
  }
}