{
  "source": "https://www.techradar.com/news/i-tried-nvidia-geforce-now-on-everything-i-own-could-it-replace-my-gaming-pc",
  "title": "I tried Nvidia GeForce Now on everything I own – could it replace my gaming PC?",
  "category": "computing",
  "updated": "2021-04-21T17:27:37Z",
  "author": "jess-weatherbed",
  "summary": "How close are we to 'the future of gaming'?",
  "article": [
    "*Update* I have since tweaked a few bits of my hardware and seen differing results, so updates will be added to various sections. A few weeks ago I was on a call that celebrated Google Chromebook's 10th birthday, and during the usual slides and feature announcements I noticed something a bit off. While a segment of the presentation was dedicated to how Chromebooks can be used as a gaming device alongside cloud streaming, not a single mention was made regarding Google Stadia. Instead, Nvidia's GeForce Now service was mentioned exclusively throughout the session as a fantastic option for folk wanting to play some games without the usually-required hardware. I've actually used the GeForce Now service before during the launch of Cyberpunk 2077 as my own gaming PC at the time didn't meet the required specifications to play. As a huge fan of the Witcher series, I stayed up till 4am attempting to get the game to run at something even remotely playable, to absolutely no avail. The following day I was suggested by colleagues that Nvidia's cloud gaming offering could be a viable alternative, and honestly, I'm glad I took their advice. I'm not going to sit here and pretend that streaming games has been perfected, because there's a lot of development that still needs to happen to make this a 'console killing' technology, but I did manage to sign into the game and actually play it with far fewer issues than I had anticipated. In fact, I really enjoyed myself. The fact that I enjoyed myself made me want to re-evaluate how I was looking at cloud gaming, given how I had previously felt about the somewhat tragic launch of Stadia, so I checked some hardware requirements and grabbed everything in my house that can supposedly support GeForce Now for some testing.",
    "Before I got my hands on a GeForce RTX 3060 graphics card I was still rocking a GTX 1070 Ti in my personal gaming rig – a perfectly respectable build if you glimpsed into my Steam library, mostly comprising of games from before 2018. However much I loved my 1070 Ti though, modern games didn't share that feeling, and the hardware demands of newer releases were usually simply too much for me to play anything without low framerates or with all the shiny graphics turned down to the lowest setting. The desktop was by far the best experience I had using the GeForce Now service, giving me the promised 1080p 60fps with lower latency than I expected. For those who aren't familiar with the term, latency, in this case, refers to the time it took from me using controls on my mouse, keyboard or gamepad (with the accessories depending on hardware restrictions) to register on the display. For single-player titles like The Witcher 3 and Cyberpunk 2077 it was certainly noticeable, but not to the extent that it interfered with gameplay. The graphics had a couple of issues, with motion blur during camera movement being slightly smeared, but that only became a pain when using rapid mouse movement. I also gave Outriders a spin given its recent release to see how well the game would perform, and it's a similar tale. The latency was noticeable and would certainly put you at a disadvantage in a firefight against pro players, but in single-player campaign mode I managed just fine and still had a blast.",
    "I also tried GeForce now alongside an Nvidia Shield Pro, hoping that the AI Upscaling feature on the Shield would help with the fact I was trying to stream on a Sony KD-49XE8396 4K TV. I sadly didn't notice any difference between having the upscaling enabled or not in games, but as the Shield was connected by Ethernet I got the same fast connection and negligible latency that I did when trying to stream on my desktop PC. And just because the upscaling didn't make a noticeable difference doesn't mean the overall result was terrible – Outriders only had a few issues with subtitle text appearing grainy (but still completely readable) and the same motion blurring that was seen when the camera swings around. The overall graphics were still 1080p, despite being on a 4K display of course, so I had to reign in my expectations, but for anyone using a native 1080P display, you'll find a much better result. *Update* After resetting my TV back to the factory settings I did see a slight improvement in the sharpness and contrast in Cyberpunk 2077, so please disregard the previous statement as user error. It did leave graphics looking crisper and more details could be made out on everything from the environment to clothing. I did not see an improvement in Outriders.",
    "Coming away from a wired internet connection had me a little nervous, even despite my Wi-Fi test results coming in at an average download speed of 99+ Mbps.",
    "Moving from my relatively capable desktop, I wanted to try GeForce Now on some of the older, janky tech devices rather than installing the service onto a new, shiny gaming laptop I had in for review. And that meant relying on Wi-Fi. My old university laptop, a Lenovo B50-80 from 2014, had served me well for numerous years, but was starting to show its age. I tested all three games again and immediately noticed a rise in latency, despite my alleged high wireless speed. The result still wasn't unplayable for the CD Project Red games, and actual load times didn't appear to be affected, given that any loading screens were almost non-existent. The latency rise did affect performance in Outriders though. The delay resulted in escalated frustration with me being unable to react to threats on the screen that I knew I would have deftly handled on a non-streamed game. The counter to this was that the smaller display meant that the games actually looked much better than they did blown up to the much larger 27-inch computer monitor or 50-inch TV I had previously tried. I also installed it onto an old 2013 MacBook Air, and that actually fared better, having aged a little more gracefully. The condition of the devices does seem to have an impact beyond how fast your wireless connections are, as the latency for all games was similar on the MacBook Air as on the desktop PC, so the age or quality of the Wi-Fi chip is absolutely going to make a difference. If I was restricted to using Apple hardware though, it seems like cloud streaming is going to become a very suitable alternative for anyone who is stuck between the old Windows vs Mac argument. It's far from feeling like a native gaming experience yet, though with more development I can see this becoming a gateway for Mac users to enter the PC gaming space in the coming years.",
    "I had two iPads laying around to try out, an iPad Pro 12.9 (3rd gen) and an older iPad (5th gen). Given the iPad Pro is barely two years old and still works like new I had high expectations, but this ended in disappointment. Despite the website stating my device was compatible, GeForce Now refused to cooperate. When using an Android or iOS device you should be able to visit play.geforcenow.com and save the webpage to your device home screen. In the case of my iPad Pro, this page displayed a \"your device is not compatible\" message and no amount of troubleshooting would get the service to work, so I swiftly abandoned the newer Apple tech. The older 5th-generation iPad did work however, and I was pleasantly surprised by its perfomance. You need to pair a Bluetooth gamepad with your iOS or Android device of choice to actually play anything, but it was easy enough to set up with a PS4 controller. The smaller screen made it very difficult to play Outriders, but I won't hold that against the streaming software – it's your decision what titles you play after all. The latency was around the same as I saw on the Lenovo laptop, so playing anything competitive would likely cause some misery, but I was content to play some less demanding titles such as Don't Starve, and older titles like The Witcher 2 felt like the game had been ported to a Nintendo Switch. I sadly live in an iPhone-free household, so I installed Nvidia's streaming service on my Huawei Mate 20 Pro and an old Samsung Galaxy S8 to test how it would cope with mobile gaming and this is sadly where cloud gaming started to lose its charm again. Both devices used a Wi-Fi connection, and the drop in quality was stark. Game loading screens were laggy, audio dropped out and the latency was unbearable. In some cases I was waiting almost a full second before I saw my gamepad actions carried out on the screen, which doesn't sound like much, but the delay resulted in every game being completely unplayable. I managed around 10 minutes of swearing and system tinkering before I gave up on the mobiles. I did also try with a 4G cellular connection to see how well it would fare, and that was also a laggy mess. That's to be expected though as Nvidia recommends using wired-in internet where possible and Wi-Fi if that's not feasible. A 5Ghz connection is required for a stable stream and it's very unlikely you'd get that over a cellular connection. Now, given both the Android phones I used were on the older side, this might not be the case for some newer devices, so this isn't a warning to not try using the GeForce Now service with the hardware available to you. You may find it fares better, and I remain hopeful that we can all soon be gaming on our mobiles or tablet devices over 5G connections as if we were playing natively installed games.",
    "While the Founders tier was priced at $4.99, the new Priority membership for Nvidia's GeForce Now cloud gaming service will cost twice as much at $9.99 per month, with plans to introduce a yearly paid option for $99.99. Anyone who signed into the original Founders tier will still only have to pay $4.99 for as long as their account remains active.",
    "This isn't small change for some, but is around the same as TV streaming services like Netflix or Amazon Prime. It does open up possibilities for anyone who is currently trying to purchase a new graphics card in the ongoing shortage, or perhaps folk deep into the Apple ecosystem who want to play PC games. I do still think that this is far from a perfect solution, but I found the games I played on anything with a wired internet connection to be very playable, with very few issues in regards to latency or graphical interference. Laptops weren't too far behind, and the internet speeds and age of your hardware does seem to have some impact on how strong your connection will be to the cloud server, so if you're rocking some fairly new tech then this may see better results for you. When it worked, GeForce Now performed admirably, and I'd wholly suggest giving it a try for yourself, especially as it has a free tier in the membership lineup. The free option is really best used as a trial than for frequent use, given you have to queue for a server and are restricted to an hour of gameplay, but this will at least allow you to test to see if your hardware is well suited to use the system. It certainly seems to be the best of the available cloud gaming options available right now, and there are a lot of ongoing updates and features coming to help improve the GeForce Now experience."
  ],
  "headers": {
    "1": "On an ageing desktop",
    "3": "Using an old MacBook Air (2013) and Lenovo laptop",
    "5": "iPads & Android phones",
    "6": "Final thoughts"
  },
  "links": {
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Nvidia's GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "GTX 1070 Ti": "https://www.techradar.com/reviews/nvidia-gtx-1070-ti",
    "Outriders": "https://www.techradar.com/reviews/outriders-review",
    "Nvidia Shield Pro": "https://www.techradar.com/reviews/nvidia-shield-tv-pro",
    "play.geforcenow.com": "https://play.geforcenow.com/",
    "Huawei Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review",
    "Samsung Galaxy S8": "https://www.techradar.com/reviews/samsung-galaxy-s8-review",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Amazon Prime": "https://www.techradar.com/best/best-amazon-prime-shows/reviews/amazon-prime-review"
  }
}