{
  "source": "https://www.techradar.com/news/best-black-friday-standing-desk-deals",
  "title": "Best Black Friday standing desk deals 2021: big savings on now",
  "category": "computing",
  "updated": "2021-11-27T14:16:56Z",
  "author": "mike-jennings",
  "summary": "Want a cheap standing desk on Black Friday? Look no further",
  "article": [
    "Black Friday may be over, but the standing desk deals are continuing, and we're rounding up all the cheapest deals throughout the weekend and into Cyber Monday. Prices have plummeted at all the biggest stores throughout the US and UK, including Amazon, Best Buy, Walmart, John Lewis, and Newegg to name just a handful.",
    "If you need a furniture upgrade, then there’s never been a better time to consider switching to a standing desk. We’re keeping our eyes on all of the top retailers for the entire Black Friday deals to make sure you don’t miss anything.",
    "There are huge savings on pre-assembled standing desks, but it's also worth considering looking at desk frames and tops sold separately. They're easy to assemble (in fact, you'll often have to attach the top yourself if you buy a complete desk) and picking them up separately often results in a cheaper price overall.",
    "We'll be keeping this page updated with all the best offers as soon as they land, so bookmark it and come back often if you don't see the standing desk of your dreams just yet.",
    "There are some good rules of thumb to follow if you want to make sure you get the best deals on Black Friday - whether you’re shopping for a new standing desk, a new laptop, or anything else.",
    "The best way to ensure you’re on top of things? Do your research before the best deals start to appear. When it comes to standing desks, that means you’ll have to spend some time to figure out exactly what features you need on your new bit of furniture, and which attributes you’re willing to leave behind to secure the best price possible. We’ve explained exactly what to look for below.",
    "Beyond the desks themselves, make sure you’re ready for the moment you sit down to buy your new product - because you’ll be better off if you’re prepared to shop around. While it’s true that all of the big retailers tend to match their prices, they also try to get an edge over their rivals by offering free gifts and bundles. It’s those incentives that can make the difference when you’re ready to place an order.",
    "We’re going to stay on top of the best standing desk deals on Black Friday and beyond, so keep this page bookmarked if you want to make sure you’re getting the best discounts and offers. But if you want to strike out on your own, check all of the big retailers before you splash the cash.",
    "It’s also worth casting your net wide in terms of dates, especially if you want to make sure that you get the best deal. The top Black Friday discounts do tend to arrive on the week of the event, but it’s common to see other good deals pop up throughout all of November and sometimes as early as the end of October.",
    "If you do decide to pounce on an earlier deal, consider keeping your standing desk boxed up until all of the best Black Friday deals have emerged. You could easily see your desk reduced even further, and you could buy the cheaper model and return the earlier purchase for a refund - saving yourself even more cash.",
    "A standing desk is a specialist bit of kit that plenty of people have embraced over the past couple of years, and it pays to examine the specifications before you shell out on a Black Friday deal.",
    "The first thing you need to consider is the desk’s height. It’s no good buying a standing desk if its maximum height isn’t going to be tall enough for you to stand and work comfortably. Similarly, consider the minimum height - you’ll want to sit down sometimes too.",
    "Make sure the desk is big enough for your working environment and that it’ll fit into its intended space, and check the weight capacity: you don’t want to load it up with monitors and find out that it can’t take the strain.",
    "Standing desks use electric, manual or pneumatic adjustment systems. Think about which will be easiest for you to use, and make sure you’ve got a spare plug if you go down the electric route.",
    "It’s important to think about the environment around your desk. If you use monitor arms, make sure they can easily attach to your desk. If you need a keyboard tray, add one to your order - and think about a footrest, too. And if you’re going to buy a new standing desk, maybe it’s worth upgrading to a new office chair too: you won’t be standing all of the time, and it’s vital to get ergonomic support no matter how you choose to work.",
    "When you're shopping for a standing desk, it pays to have an idea of the best models and brands beforehand. These are three of the best standing desks we've tested, so any Black Friday deals on them are well worth investigating.",
    "The Uplift V2 is one of the best standing desks that benefits from top-notch build quality and impressive stability. Dual motors mean the desk can change heights quickly, with a smooth and quiet action, and anti-collision tech is also in the mix. There are lots of size and color options, and plenty of mounting points for accessories, with some pretty nifty extras (including an under desk hammock).",
    "What impressed us most about this desk was how much thought Vari put into the assembly process. The frame comes pre-attached and customers only need to assemble the legs. A control panel resides in the middle of the frame and the cords for both motors as well as the keypad at the front of the desk plug into it. The keypad allows you easily and quickly adjust the height of the desk, and there are four memory presets for storing your preferred sitting and standing heights.",
    "The ApexDesk Elite is a superbly built standing desk with a dual-motor lifting system, featuring a smooth lifting mechanism and a controller with the ability to set four preset heights. The lifting capacity is just over 100kg to ensure you can indeed fit plenty of hefty bits of hardware on top of this desk. The Elite is sturdily built with the center beam providing greater stability (without having to have a crossbar underneath)."
  ],
  "headers": {
    "4": "Standing desk Black Friday deals: our predictions",
    "10": "How to choose the right standing desk"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361"
  }
}