{
  "source": "https://www.techradar.com/news/the-apple-watch-7-doesnt-track-blood-pressure-but-huaweis-next-watch-might",
  "title": "The Apple Watch 7 doesn't track blood pressure – but Huawei's next watch might",
  "category": "fitness",
  "updated": "2021-09-20T09:29:36Z",
  "author": "cat-ellis",
  "summary": "The Huawei Watch D could be a game-changer for hypertension",
  "article": [
    "Huawei may soon launch a new smartwatch that can accurately measure arterial blood pressure – beating Apple to the punch. Let's Go Digital spotted a recently filed trademark document for a new device called the Huawei Watch D, which will include \"arterial blood pressure monitoring apparatus\" and \"blood pressure monitors\".",
    "Some smartwatches, such as the Samsung Galaxy Watch Active 2, already offer a form of blood pressure monitoring that uses the same optical sensor used to track your heart rate, but it's quite limited. An LED shines on your wrist, the sensor detects changes in the light reflected back from your skin, and an algorithm uses this data to estimate changes in your blood pressure.",
    "The fact that the Huawei Watch D will have specific hardware for monitoring blood pressure suggests it's taking a different approach that should yield more accurate and useful results – something Apple is aiming to achieve as well.",
    "Before this month's Apple event, rumors suggested that the Apple Watch 7 might be able to monitor blood pressure using actuators embedded in the strap to apply pressure to the wearer's wrist (with the buckle serving as an electric contact to confirm that the watch is fastened correctly).",
    "It was even suggested that this new tech was so complex, it had delayed production while Apple and its suppliers resolved engineering problems.",
    "As we learned, however, the new Apple Watch has relatively few health and fitness upgrades – fall detection while cycling and improved calorie tracking for e-bike riders being the main ones. Certainly nothing as game-changing as the technology described in a patent registered by Apple in January 2021.",
    "Hypertension (high blood pressure) often shows no symptoms early on, but puts you at increased risk of conditions such as stroke, heart disease, and heart failure. However, as Dr Steven LeBoeuf, co-founder and president of biometrics company Valencell, told TechRadar in a recent interview, conventional blood pressure monitors are a real nuisance.",
    "“First of all, who's going to carry that thing around with them?\" Dr LeBoeuf said. \"The wrist inflation cuffs look weird enough as it is, much less the ones that actually work with the armbands.",
    "“Another thing is, if you measure your blood pressure as often as the American Heart Association says you should, you're supposed to send that cuff to the factory for recalibration every six months. Who the hell is going to do that?\"",
    "Although it would almost certainly still need to be configured using an inflatable cuff to ensure it was accurate, a smartwatch capable of measuring blood pressure would be far more convenient and help people take responsibility for their health."
  ],
  "headers": {
    "6": "The silent killer"
  },
  "links": {
    "Let's Go Digital": "https://nl.letsgodigital.org/wearables-smartwatches/huawei-watch-d",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Apple event": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "it had delayed production": "https://9to5mac.com/2021/08/31/apple-watch-series-7-reportedly-facing-production-delays-due-to-complex-redesign/",
    "a patent registered by Apple": "https://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&r=1&f=G&l=50&s1=10,881,307.PN.&OS=PN/10,881,307&RS=PN/10,881,307",
    "Valencell": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "in a recent interview": "https://www.techradar.com/news/could-the-apple-watch-7-really-measure-blood-pressure-and-why-is-it-so-important"
  }
}