{
  "source": "https://www.techradar.com/news/microsoft-edge-update-will-make-android-users-sit-up-and-take-notice",
  "title": "Microsoft Edge update will make Android users sit up and take notice",
  "category": "computing",
  "updated": "2021-08-03T10:30:30Z",
  "author": "joel-khalili",
  "summary": "Microsoft Edge for Android now benefits from handy tab-sharing facility",
  "article": [
    "Microsoft has rolled out an update for its web browser Edge that should make transitioning between different devices much simpler.",
    "The latest version of Edge for Android is built atop the latest Chromium build, opening the door for the introduction of a number of new features, including tab-sharing.",
    "Previously available only on desktop, the tab-sharing facility lets Edge users fire web pages between any of their devices (whether running on Windows, macOS or Android), thereby avoiding the hassle of wading through browsing history or sharing links via a third-party service.",
    "The new Edge build is available to devices running Android 5.0 or newer, and tab-sharing relies on the user logging into the same Microsoft account across all browser installations.",
    "With the shift towards SaaS and web applications in recent years, the browser has perhaps become the most critical tool in a worker’s arsenal. Therefore, optimizations at a browser level are likely to have a significant impact on overall productivity.",
    "Meanwhile, the rise of hybrid working will mean the ability to switch between and work across multiple devices with ease will become ever more important for workers.",
    "The ability to send tabs between devices via Edge will help users pick up where they left off, minimizing disruption when switching between devices or moving from the office to home, or any other working location.",
    "The new feature can be found under the three dots menu in Edge for Android. From here, select Share and Send to devices, which will bring up a menu containing all devices connected to the same Microsoft account. The process is almost identical on desktop, but the feature is located under the right-click dropdown menu.",
    "Predictably, data from Statcounter shows that the majority of Android users opt for Google Chrome, which holds 63% of the browser market across all major mobile operating systems. However, the new-look Edge has consistently been gaining momentum since launch in early 2020 and the latest update could provide the perfect excuse for Android users to take the leap.",
    "Via Windows Latest"
  ],
  "headers": {
    "4": "Microsoft Edge on Android"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "hybrid working": "https://www.techradar.com/news/hybrid-working-closing-the-digital-divide",
    "data from Statcounter": "https://gs.statcounter.com/browser-market-share/mobile/worldwide",
    "Windows Latest": "https://www.windowslatest.com/2021/07/31/microsoft-edge-92-released-for-android-with-windows-10-tabs-share-and-more/"
  }
}