{
  "source": "https://www.techradar.com/news/podcastones-free-podcast-hosting-service-now-includes-ads",
  "title": "PodcastOne's free podcast hosting service now includes ads",
  "category": "computing",
  "updated": "2021-07-09T23:25:40Z",
  "author": "anthony-spadafora",
  "summary": "Even free hosting comes at a cost",
  "article": [
    "The popular podcast network PodcastOne has rebranded its free podcast hosting service which is now known as Launchpad One in an effort to entice indie podcasters.",
    "The company, whose network is home to The Adam Corolla Show, The Steve Austin Show and many other popular podcasts, has rebranded LauchpadDM as LaunchPad One according to a new report from The Verge.",
    "PodcastOne's free hosting platform is used by many podcasters to host their shows but as part of the rebrand they'll now be able to accept PayPal donations in addition to being able to distribute their shows across platforms and insert their own ads. What sets the company's platform apart from the competition is the fact that PodcastOne also markets the shows which use its platform.",
    "However, there is one big change that has been introduced with the rebrand that many podcasters may not like, the company can now insert two ads into any show hosted on its platform.",
    "In order to keep its podcast hosting service free, PodcastOne's team will retain 100 percent of the revenue generated from ads sold by its team that will be inserted into all free podcasts hosted on its platform.",
    "According to The Verge, podcasters are automatically opted into the company's new monetization scheme. However, they will still be able to keep the revenue from any ads they sell, record or embed into their own podcasts. When it comes to the new PayPal donations feature though, PodcastOne will retain a four percent service fee while what's left of donations will go to podcasters.",
    "It's hard to argue with any form of free hosting but these two ads could end up turning listeners away from podcasters' shows especially if they already have their own ads. Listeners could potentially end up hearing three or more ads per show which could make the experience of listening to a podcast on PodcastOne's platform a bit more like watching a program on cable TV.",
    "If you're currently using PodcastOne to host your podcast and are concerned by these new ads, it might be worth checking out our complete list of the best podcast hosting providers which includes several free options.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Free podcast hosting with a catch"
  },
  "links": {
    "free podcast hosting service": "https://www.techradar.com/best/podcast-hosting",
    "new report": "https://www.theverge.com/2021/7/8/22568221/podcastone-launchpadone-hosting-service-free-podcast-monetize",
    "PayPal": "https://www.techradar.com/reviews/paypal-commerce-platform",
    "free hosting": "https://www.techradar.com/web-hosting/best-free-web-hosting",
    "best podcast hosting providers": "https://www.techradar.com/best/podcast-hosting",
    "The Verge": "https://www.theverge.com/2021/7/8/22568221/podcastone-launchpadone-hosting-service-free-podcast-monetize"
  }
}