{
  "source": "https://www.techradar.com/news/the-best-gaming-tvs-get-better-as-geforce-now-comes-to-lg",
  "title": "The best gaming TVs get better as GeForce Now comes to LG",
  "category": "televisions",
  "updated": "2021-11-18T15:58:47Z",
  "author": "henry-st-leger",
  "summary": "These LG TVs now support GeForce NOW",
  "article": [
    "New LG TVs now support the cloud gaming service GeForce NOW, a move destined to make LG's already gamer-friendly screens even more appealing.",
    "The game-streaming service is coming to the webOS platform used on 2021 LG TVs on November 19, the company announced Thursday. The app is technically in beta, but should be fully \"functional\" and available through the LG content store on recent LG 4K OLED, QNED Mini LED and NanoCell TVs.",
    "If you have an LG TV that fits that description, we'd recommend looking for the app after that date, though LG is yet to share a complete list of screens getting support. We expect new LG TVs will be prioritized, particularly the LG C1 OLED and LG G1, though the budget LG A1 and LG B1 models should get in on the action too.",
    "Owners of compatible TVs will find it in the LG Content Store, once the app is rolled out in your region. It will give you access to more than 35 free-to-play games with no additional hardware required. (Meaning it's a BYO situation: Bring your own compatible controller).",
    "“LG customers are expecting the best when it comes to gaming on a large screen,” said Lee Sang-woo, senior vice president of corporate business strategy at LG Electronics Home Entertainment Company. “Partnering with NVIDIA to bring GeForce NOW to LG TV owners is a sign of our commitment to deliver the best gaming experience on LG TVs running webOS.”",
    "GeForce NOW has been a key selling point of the Nvidia Shield TV streaming device, being the only TV-adjacent device to support the platform until now.",
    "GeForce NOW has been available on Windows, macOS, iOS, and Android for many years now, but it's been notably absent from built-in smart TV platforms. This announcement should certainly raise the service's profile.",
    "It's worth noting that GeForce NOW isn't, technically, a game marketplace in the same way as Google Stadia, where you have to buy the Stadia version of a title to play it through the service. With GeForce NOW, you sign in to your Steam, Epic Games Store, GOG or Uplay account to lift games you've bought there, streaming them through the service – if GeForce NOW supports them.",
    "The service has a growing roster of great games, such as Apex Legends, the Assassin's Creed and Hitman franchises, and more. It recently got support for Dragon Age: Inquisition, Battlefield 1 Revolution, and Mirror’s Edge Catalyst from publisher EA too – alongside Crysis Remastered given to subscribers for free.",
    "But it's also a huge feather in LG's hat – offering another key gaming portal over the likes of Sony, Panasonic and Samsung. LG's support for Nvidia G-Sync and FreeSync had already made it a smart choice for PC gamers, while its TV ranges have offered extensive HDMI 2.1, VRR, and ALLM support before much of the competition.",
    "Not to mention LG's support for Dolby Vision gaming, making LG TVs a shoe-in for those pairing their screen with an Xbox Series X.",
    "For anyone looking for the best gaming TVs then, especially in the Black Friday TV deals going on this month, LG looks to offer not just capable gaming screens, but a platform that's being continually updated to service players and their platforms."
  ],
  "headers": {
    "5": "Nvidia is on a roll"
  },
  "links": {
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "OLED,": "https://www.techradar.com/news/what-is-oled",
    "QNED": "https://www.techradar.com/news/what-is-qned",
    "LG C1 OLED": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "LG G1": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "LG A1": "https://www.techradar.com/news/lg-a1-oled-price-release-date-specs-sizes",
    "LG B1": "https://www.techradar.com/news/lg-b1-oled-price-release-date-specs",
    "growing roster of great games": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-1062453271482797600&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-gb%2Fgeforce-now%2Fgames%2F",
    "alongside Crysis Remastered": "https://www.techradar.com/news/nvidia-geforce-now-service-is-offering-crysis-remastered-for-free-starting-this-week",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "LG's support for Dolby Vision gaming": "https://www.techradar.com/news/the-lg-cx-oled-is-now-undoubtedly-the-best-gaming-tv-for-xbox-series-x",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "best gaming TVs": "https://www.techradar.com/news/best-gaming-tv",
    "Black Friday TV deals": "https://www.techradar.com/black-friday/tv-deals"
  }
}