{
  "source": "https://www.techradar.com/news/iphone-13-face-id-leak-backs-up-smaller-notch-rumors",
  "title": "iPhone 13 Face ID leak backs up smaller notch rumors",
  "category": "phones",
  "updated": "2021-05-14T16:51:57Z",
  "author": "david-nield",
  "summary": "Some shrinkage reported",
  "article": [
    "Rumors around a smaller notch on the iPhone 13 have been swirling for months now, and we just got some more evidence that backs up the speculation: news that Apple will be making the Face ID sensor chip much smaller in iPhones and iPads released later this year.",
    "That's according to Taiwan outlet DigiTimes, which usually has good connections to the Apple supply chain. The new sensor could be up to half the size of the old one apparently, which gives Apple much more room to play with in terms of the notch.",
    "We're assuming that Apple wouldn't make the component smaller if there was any loss in accuracy or speed, so expect Face ID to work the same as it always has. As well as meaning scope for a smaller notch, it should also help Apple to reduce production costs.",
    "Something else alluded to in the article is the possibility that the updated, more compact sensor might be able to offer more in the way of features and scanning options – but at the moment it's not clear what those features and options might be.",
    "Based on the leaked pictures and the industry reports that we've seen to date, it looks as though the iPhone 13 notch will indeed get smaller: the general consensus seems to be that Apple might move the earpiece slightly higher into the bezel to help enable this.",
    "The advantage of a smaller notch is of course more screen space at the status bar level – and the status bar can often get busy with icons and numbers, depending on how you're using your iPhone. Any extra pixels are going to be welcome, and it should add some extra elegance to what is an already iconic design.",
    "The notch first showed up on the iPhone X in 2017 and has since been adopted by just about every smartphone maker out there. It looks as though its days are numbered, with under-display selfie cameras now nearing mass adoption, but it's going to be a while before the cut-out is gone completely.",
    "We've also heard that the iPhone 13 is going to come with a 120Hz refresh rate screen and an upgrade in the ultra-wide camera department, as well as various other improvements. If Apple sticks to its usual schedule, we should see the new models in September.",
    "Via MacRumors"
  ],
  "headers": {
    "4": "Top notch"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "DigiTimes": "https://www.digitimes.com/news/a20210514PD202.html",
    "leaked pictures": "https://www.techradar.com/news/iphone-13-mockup-shows-changes-that-might-be-coming-to-the-notch",
    "industry reports": "https://www.techradar.com/news/iphone-13-tipped-to-have-a-smaller-notch-and-a-thicker-design",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "nearing mass adoption": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-camera-leak-includes-details-of-an-under-display-lens",
    "with a 120Hz refresh rate screen": "https://www.techradar.com/news/iphone-13-could-have-a-big-feature-we-originally-expected-on-the-iphone-12",
    "in the ultra-wide camera department": "https://www.techradar.com/news/iphone-13-camera-upgrades-are-looking-ever-more-likely",
    "MacRumors": "https://www.macrumors.com/2021/05/14/apple-making-face-id-sensor-chip-smaller/"
  }
}