{
  "source": "https://www.techradar.com/news/one-of-the-best-nintendo-switch-cyber-monday-deals-is-still-live-and-ripe-for-christmas-shopping",
  "title": "One of the best Nintendo Switch Cyber Monday deals is still live and ripe for Christmas shopping",
  "category": "gaming",
  "updated": "2021-12-03T16:15:36Z",
  "author": "rhys-wood",
  "summary": "Buy two, get one free on Switch games",
  "article": [
    "Cyber Monday is over, but we're still seeing some excellent deals alive and kicking across the internet. Take this superb Nintendo Switch Cyber Monday deal hosted right now at Best Buy.",
    "In the deal, buying two Nintendo Switch games at Best Buy will net you a third at no extra cost. Great news if you're looking to bulk up your Nintendo Switch collection in time for the holidays, or still searching for the perfect gaming gift.",
    "The eligible games are as follows:",
    "Super Mario Odyssey Mario Kart 8 Deluxe Donkey Kong Country: Tropical Freeze Super Mario Party The Legend of Zelda: Breath of the Wild Pokémon: Let's Go, Pikachu! Pokémon: Let's Go, Eevee! New Super Mario Bros. U Deluxe Mario Tennis Aces Xenoblade Chronicles Definitive Edition Fire Emblem: Three Houses",
    "Arguably the best thing about this Nintendo Switch Cyber Monday deal is that these aren't just any old bargain bin shovelware titles. They include some of the best Nintendo Switch games you can buy, including Super Mario Odyssey, Mario Kart 8 Deluxe, and Fire Emblem: Three Houses.",
    "As Nintendo Switch games hold their price incredibly well, and rarely receive top-notch discounts individually, we'd say this Best Buy offer is well worth jumping on, especially if you're doing a spot of early Christmas shopping.",
    "No matter where you live, you'll find all the lowest prices for the Nintendo Switch from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Nintendo Switch Cyber Monday deals",
    "6": "More Nintendo Switch deals",
    "7": "More Cyber Monday deals"
  },
  "links": {
    "Super Mario Odyssey": "https://www.techradar.com/news/super-mario-odyssey-review",
    "Mario Kart 8 Deluxe": "https://www.techradar.com/how-to/mario-kart-8-deluxe-tips-and-tricks",
    "Super Mario Party": "https://www.techradar.com/news/super-mario-party-review-the-most-tactical-mario-party-game-yet",
    "The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "Pokémon: Let's Go, Pikachu!": "https://www.techradar.com/news/pokemon-lets-go-review",
    "New Super Mario Bros. U Deluxe": "https://www.techradar.com/news/new-super-mario-bros-u-deluxe-review",
    "Mario Tennis Aces": "https://www.techradar.com/news/mario-tennis-aces-review",
    "best Nintendo Switch games": "https://www.techradar.com/best/best-nintendo-switch-games"
  }
}