{
  "source": "https://www.techradar.com/news/what-is-ram",
  "title": "What is RAM and how much do I need?",
  "category": "computing",
  "updated": "2021-10-21T17:50:20Z",
  "author": "robert-zak",
  "summary": "Short-term-memory",
  "article": [
    "What is RAM? In simpler terms, it’s your device’s short term memory, which temporarily stores all the data that the processor needs quick access to when performing tasks. Short for random-access memory and also known as your device’s memory, RAM essentially acts as the middle-man between your device’s CPU - or processor - and the data stored on its hard drive.",
    "When you access that data, whether you’re running a program or accessing a file, the RAM is there to serve it up to the CPU. And, it is a core part of computers, games consoles, smartphones, servers and just about any piece of computerised tech.",
    "If you’re just here to answer the question “how much RAM do I need?,” you could be going about it wrong. Choosing the ideal RAM for your device, whether it's a gaming PC that’s expected to run more intensive tasks or a laptop for general productivity tasks, is a tad more complex than that. Especially because there’s a whole lot more to know about RAM, including the different generations of DDR.",
    "But, that’s what we’re here for. To help you better understand all this memory stuff, we’ve covered all the RAM fundamentals here, including helping you figure out exactly how much RAM you need.",
    "Let’s go into a little more detail on what RAM actually is. All your documents, videos, games and programs are stored on your hard drive or SSD - the ‘long-term’ memory of your computer where things permanently reside until you delete them.",
    "When you open a program or boot your computer, the data temporarily goes from your hard drive to your RAM, which then holds the data out for your CPU (or processor) to process. The processed data then returns to the RAM, where it stays until you close the program or your PC.",
    "RAM is a temporary and ‘volatile’ storage location for your data as and when you need it, like a workbench for your PC. The more RAM you have, the bigger that workbench. When you shut your PC down, everything on the workbench gets cleared and packed away.",
    "What we colloquially know as RAM is actually called DRAM (Dynamic Random Access Memory). There are other kinds of RAM, such as VRAM which performs an equivalent function on graphics cards, but that’s not our focus for today.",
    "Theoretically, a computer could actually run without RAM, it would just run much slower because the CPU would have to read it straight from the hard drive (even a modern NVMe SSD has a far slower response time than DDR4 RAM). These days, however, the motherboard BIOS utilises the RAM too, which means that the operating system won’t start without it.",
    "When buying RAM, the main features you’ll see after the RAM size (8GB, 16GB and so on) are DDR and a frequency shown in MHz.",
    "DDR stands for Double Data Rate, and has been the standard form of RAM for decades now. Most motherboards you’d buy today use DDR4 RAM. If you have a slightly older motherboard with DDR3 RAM in it, then you’ll need to upgrade your motherboard if you want DDR4 RAM.",
    "DDR4 came out in 2014, and is more modern and advanced than DDR3, which first appeared in 2007. DDR4 RAM has a higher base frequency of 2133MHz (which is very high-end for DDR3), as well as a higher peak bandwidth. DDR4 also runs at a lower voltage, which means it better preserves battery life on devices like laptops and phones.",
    "Performance-wise, it’s the frequency and bandwidth that makes more of a difference than the actual DDR number, but seeing as DDR4 has more capacity for both, then you’re generally better off buying that.",
    "However, if you currently have, say, 16GB of DDR3 2133MHz RAM, it will run at much the same speed as 16GB DDR 4 2133MHz RAM. You’ll want to get higher frequency RAM to see any performance difference, and even then it can be subtle.",
    "Again, it’s vital to remember that if your RAM is DDR3 then you can’t just swap it out for shiny new DDR4 RAM, you’ll need to get a DDR4-compatible motherboard. If, however, you’re building a new PC or upgrading to a more modern processor (which may also require a new motherboard), then it makes sense to get DDR4 RAM.",
    "DDR5 RAM also now exists, bringing even bigger frequencies and under-the-hood improvements, but it isn’t yet available commercially.",
    "When DDR4 first appeared, there was a lot of excitement about how it could technically have modules as big as 512GB. In reality, unless you’re running servers, you’re not going to need more than 16GB RAM in total, or 32GB at a push.",
    "How much RAM you need largely depends on what your PC’s daily workload is like. No games come close to using that much RAM, and 16GB should be more than enough. Even with the most demanding games, performance is likely to be very similar on 8GB RAM as 32GB RAM if the CPU and GPU are identical.",
    "If you work in high-intensity video production and work with extremely large files and very demanding programs – not to mention having a myriad of apps and browser windows open at once, then you’d be wise to invest in 32GB RAM at the very least.",
    "Most motherboards have four RAM slots, so when you buy RAM you can spread it across two to four slots. But is, say, 4 x 4GB RAM faster than 2 x 8GB?",
    "For the most part, no, but given that most modern motherboards only support dual-channel memory you’re probably better off opting for using just two slots. Actual performance benchmarks show very little difference between using two and four RAM sticks if you’re using the same capacity and frequency of RAM.",
    "From a stability perspective, the less parts there are the less there is to go wrong, and also using just two RAM slots means you can fill the other two in the future (though you need to use exactly the same RAM across all slots)."
  ],
  "headers": {
    "4": "RAM explained",
    "9": "DDR and Frequency",
    "16": "How much RAM do I need?"
  },
  "links": {
    "RAM": "https://www.techradar.com/news/best-ram",
    "processor": "https://www.techradar.com/news/best-processors",
    "hard drive": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "computers": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "games consoles": "https://www.techradar.com/news/best-consoles",
    "smartphones": "https://www.techradar.com/news/best-phone",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "DDR5": "https://www.techradar.com/news/full-speed-ahead-with-ddr5-faster-system-ram-is-on-the-horizon"
  }
}