{
  "source": "https://www.techradar.com/news/heres-your-first-look-at-amazon-prime-videos-next-big-movie-starring-chris-pratt",
  "title": "First look at Amazon Prime Video's next big sci-fi movie, starring Chris Pratt",
  "category": "entertainment",
  "updated": "2021-04-28T13:17:30Z",
  "author": "tom-power",
  "summary": "The Tomorrow War has arrived today",
  "article": [
    "The Tomorrow War is going all out to be Amazon Prime Video's next major movie, by the looks of it. The Chris Pratt-starring sci-fi flick will hope to follow in the footsteps of Coming 2 America and Sound of Metal in being the streamer's next big hitter, and Amazon has begun its marketing campaign with the hope that it'll be one of this summer's biggest blockbusters.",
    "Following Tuesday's first-look images drop, which you can see below, Amazon released the first official tease for its upcoming movie. The video is only 30 seconds in length, but it gives a solid look at what the plot entails and the amount of action that will occur.",
    "The first-look tease doesn't reveal the look of the alien antagonists, though, which is to be expected. We wouldn't want their design or aesthetic to be ruined so early into the movie's marketing, after all.",
    "Check out the teaser trailer below:",
    "As we mentioned, Amazon also unveiled a bunch of official images on Tuesday as the studio begins to ramp up interest in its upcoming sci-fi film.",
    "You can check out all five images in the gallery below:",
    "It's possible. With Pratt joined by other big names including J.K. Simmons, Betty Gilpin and Yvonne Strahovski, The Tomorrow War should have the star power to interest audiences. Add in its intriguing sci-fi action plot (which you can read below), and The Tomorrow War may have enough about it to continue Amazon Prime Video's hotstreak.",
    "The streaming platform has been on a bit of a roll recently with its exclusive movies. Borat 2 and Sound of Metal have both won big awards at prestigious ceremonies, including the Oscars and BAFTAs, in the past couple of months. Coming 2 America and Borat's sequel, meanwhile, also drew in big viewing figures for Amazon Prime Video upon release, according to different Variety reports, after the streamer secured exclusive distribution rights to both films amid the Covid-19 pandemic.",
    "Like its counterparts, The Tomorrow War will only be released on Amazon Prime Video. Although theaters and cinema chains are beginning to open their doors globally - thanks to the success of multiple nations' Covid-19 vaccine programs - there are still reservations about how long it'll take for fans to flock back to the big screen to watch movies.",
    "While that uncertainty continues, The Tomorrow War could benefit from film goers staying at home to consume their movie content. The film launches worldwide on July 2, so Amazon and Paramount Pictures will hope that film aficionados enjoy The Tomorrow War from the comfort of their homes and give them another major movie win.",
    "The Tomorrow War stars Pratt as Dan Forrester, a high school teacher who is suddenly recruited by a group of time traveling army personnel to fight a war against an alien species in the year 2051. With humanity losing the fight against their invaders, the world's only hope of survival is to enrol civilians and soldiers from 2021, Forrester travels to the future to save the world - and give his daughter the prospect of a life in doing so.",
    "The Tomorrow War is released exclusively on Amazon Prime Video on July 2."
  ],
  "headers": {
    "6": "Will The Tomorrow War continue Amazon Prime Video's recent movie success?"
  },
  "links": {
    "The Tomorrow War": "https://www.techradar.com/news/amazon-prime-video-just-landed-another-big-new-movie",
    "Amazon Prime Video": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FAmazon-Video%2Fb%3Fie%3DUTF8%26node%3D3010085031%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8268579542392396000-21",
    "Coming 2 America": "https://www.techradar.com/news/how-to-watch-coming-2-america-online-stream-eddie-murphy-sequel-anywhere",
    "Sound of Metal": "https://www.techradar.com/news/how-to-watch-sound-of-metal-online-stream-the-award-winning-movie-from-anywhere",
    "Borat 2": "https://www.techradar.com/news/how-to-watch-borat-2-online-stream-borats-subsequent-moviefilm-anywhere",
    "Variety": "https://variety.com/2020/digital/news/borat-2-viewership-numbers-amazon-opening-weekend-mulan-1234816491/",
    "reports": "https://variety.com/2021/digital/news/coming-2-america-most-viewed-metrics-nielsen-rankings-1234942469/"
  }
}