{
  "source": "https://www.techradar.com/news/wix-slams-wordpress-in-bizarre-marketing-campaign",
  "title": "Wix slams WordPress in bizarre marketing campaign",
  "category": "computing",
  "updated": "2021-04-09T00:24:40Z",
  "author": "anthony-spadafora",
  "summary": "Negative ads won't likely get WordPress users to switch to Wix",
  "article": [
    "There are memorable marketing campaigns and there are those that fall flat as is the case with the latest campaign from the website builder and web hosting company Wix.",
    "In its new cryptic marketing campaign titled “You Deserve Better”, the company takes direct aim at the hugely popular content management system (CMS) WordPress.",
    "Wix's campaign began with the company sending out noise-canceling headphones from Bose to prominent WordPress users and influencers. The boxes these headphones arrived in featured a QR code that recipients could scan to view a short video in which a man in a brown blazer personified WordPress.",
    "In the video itself, the man warns WordPress users in a top secret message that Wix is launching a campaign trashing WordPress but that they shouldn't worry as this is just fake news. The recipients of the headphones were left even more confused by the fact that the box was signed “Yours, WP” which made it appear that the gift was coming from WordPress as opposed to Wix.",
    "Following the release of the first video sent to WordPress influencers, Wix has now released an additional six videos that all take aim at common WordPress problems.",
    "These videos touch on some of the downsides of using the world's most popular CMS such as hackers, the update button, conflicting WordPress plugins, constant updates, the White Screen of Death and having to turn to self-help tutorials for support.",
    "Unlike the first video though, the rest of the videos feature both a WordPress developer and the man personifying the CMS. The pair appear to be in a therapy session in which the developer is having a hard time dealing with WordPress issues. In one video, the developer even makes a reference to Apple's old PC vs Mac ads and explains that WordPress vs Wix is nothing like it.",
    "So far Wix's negative ads have been met with disapproval from both developers and even WordPress' founder Matt Mullenweg who took to his personal blog to respond to the campaign, saying:",
    "\"I have a lot of empathy for whoever was forced to work on these ads, including the actors, it must have felt bad working on something that’s like Encyclopedia Britannica attacking Wikipedia. WordPress is a global movement of hundreds of thousands of volunteers and community members, coming together to make the web a better place. The code, and everything you put into it, belongs to you, and its open source license ensures that you’re in complete control, now and forever.\"",
    "Via WP Tavern"
  ],
  "headers": {
    "4": "You Deserve Better"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Wix": "https://www.techradar.com/reviews/wix",
    "CMS": "https://www.techradar.com/best/cms",
    "noise-canceling headphone": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "world's most popular CMS": "https://www.techradar.com/news/wordpress-is-the-worlds-most-popular-cms",
    "WordPress plugins": "https://www.techradar.com/best/best-wordpress-plugins",
    "PC vs Mac ads": "https://www.techradar.com/news/computing/apple/apple-kills-smug-mac-user-cool-pc-dude-215251",
    "WordPress vs Wix": "https://www.techradar.com/news/wix-or-wordpress-google-seo-expert-weighs-in-on-website-builder-battle",
    "personal blog": "https://ma.tt/2021/04/wix-dirty-tricks/",
    "WP Tavern": "https://wptavern.com/wix-takes-a-jab-at-wordpress-with-bewildering-new-marketing-campaign"
  }
}