{
  "source": "https://www.techradar.com/news/google-says-e-commerce-hasnt-destroyed-bricks-and-mortar-for-good",
  "title": "Google says e-commerce hasn't destroyed bricks-and-mortar for good",
  "category": "computing",
  "updated": "2021-10-27T10:26:46Z",
  "author": "sead-fadilpasic",
  "summary": "Omnichannel is starting to take precedence though",
  "article": [
    "Retail has been forced to go all-in on digital during the pandemic, but bricks-and-mortar stores still have an important role to play. As a matter of fact, as stores slowly begin to reopen, people are returning to in-store shopping as an omnichannel approach takes precedence.",
    "That's according to a new report from Google's parent company Alphabet. In its recent Q3 2021 financial results, Chief Business Officer Philipp Schindler said ad sales in the digital sector experienced “explosive growth” over the last 20-something months.",
    "“But, as the world begins to reopen, shoppers are returning to stores,\" he said. \"Brick-and-mortar isn't dead. Instead, omnichannel is in full force.\"",
    "One of the key pieces of evidence supporting this claim can be found in Google search queries. Compared to last year, queries “stores open now near me” are up four times.",
    "\"As a result, we've seen more advertisers include in-store sales alongside e-commerce goals to drive omnichannel growth,\" Schindler added. \"Adoption has nearly doubled over the past year.\"",
    "During the earnings call, Schindler took Kohl’s as an example. A fortnight after it was forced to close more than 1,000 of its stores, the retailer launched curbside pickup. Soon after that, it tested local inventory ads and went “all in” on omnichannel bidding across its paid search portfolio. As a result, Q2 net sales went up by almost a third (31%) year-on-year.",
    "Overall, Alphabet’s Q3 results beat analyst estimates, as its revenues went up 41%. Most of the revenue (around $59.88 billion) came from Google Services and its advertising business, as ad revenues hit $53.13 billion, up from $37.01 billion a year ago.",
    "Most of the revenue was contributed by retail, followed by media and entertainment, finance, and travel."
  ],
  "headers": {
    "3": "Retail driving omnichannel growth"
  },
  "links": {
    "in-store shopping": "https://www.techradar.com/best/best-shopping-cart-software",
    "Brick-and-mortar": "https://www.techradar.com/best/best-payment-gateways",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "omnichannel": "https://www.techradar.com/news/best-ecommerce-hosting"
  }
}