{
  "source": "https://www.techradar.com/news/windows-10-brings-a-game-changing-feature-to-edge-to-beat-chrome",
  "title": "Windows 10 brings a game-changing feature to Edge to beat Chrome",
  "category": "computing",
  "updated": "2021-04-19T10:44:28Z",
  "author": "jess-weatherbed",
  "summary": "Edging out the competition",
  "article": [
    "Microsoft's Edge browser has been gaining a dedicated following in recent months thanks to an ever-increasing list of features that its users seem to favor over offerings from rivals such as Google Chrome or Mozilla Firefox, and we're getting word that yet another feature is in development that could give it the 'edge' over the competition. \"Performance Mode\" will allow you to optimize web browsing speed and responsiveness, as well as reduce CPU, RAM, and battery usage. This will be of benefit to anyone who runs browser tabs alongside other applications or even games, freeing up space to be used where you need the best results.",
    "This is seemingly in conjunction with the \"Sleeping Tabs\" feature that Edge introduced back in 2020, which allows browser tabs to freeze when not actively in use, reducing RAM and CPU usage. This was shown to be more advanced than the Chrome equivalent and more efficient at reducing memory usage. Performance mode is currently only available in Microsoft Edge Canary 91 (a browser test build) for select users but should roll out to the standard Edge platform in late 2021.",
    "Windows Latest ran some tests and noted the differences, with Edge forcing tabs into sleep mode if they're unused for five minutes when \"Performance Mode\" was enabled, as opposed to the usual two hours of inactivity using just \"Sleeping Tabs\" alone. You can still reactivate the tabs by selecting onto them, so they won't disappear from your screen. You should also see an improvement in CPU and battery usage when enabled, as well as other performance tweaks such as the feature automatically detecting overly demanding activity occurring in the background (such as video or audio that you may be listening to), and prevent those tabs from being forcefully put to sleep – so you won't have to keep clicking onto a YouTube tab to keep your music playing. Given the running gag on how demanding Google Chrome is, other browsers could see these Edge features as a serious threat. Anyone who works with RAM-hungry software or even gamers will know how frustrating it can be to sacrifice memory usage when surfing the web.",
    "This feature could also help gamers and streamers who typically have numerous applications open and juggle performance on their systems. Performance Mode doesn't affect how other Edge features either, so we may see more people making the jump over to Microsoft's browser to take advantage of the optimization options themselves."
  ],
  "headers": {
    "2": "Will you make the switch?"
  },
  "links": {
    "Microsoft's Edge browser": "https://www.techradar.com/how-to/computing/how-to-use-microsoft-edge-1312585",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Mozilla Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "\"Sleeping Tabs\"": "https://www.techradar.com/news/microsoft-edge-will-now-hog-much-less-of-your-computers-processing-power",
    "Windows Latest": "https://www.windowslatest.com/2021/04/19/microsoft-edge-is-getting-a-performance-mode-on-windows-10/",
    "how demanding Google Chrome is": "https://www.techradar.com/news/im-sick-of-chrome-eating-all-my-ram-its-time-for-me-to-ditch-it-for-firefox-or-even-edge"
  }
}