{
  "source": "https://www.techradar.com/news/sony-wf-1000xm4-could-get-dethroned-by-these-new-true-wireless-earbuds",
  "title": "Sony WF-1000XM4 could get dethroned by these new true wireless earbuds",
  "category": "audio-visual",
  "updated": "2021-08-02T19:26:21Z",
  "author": "nick-pino",
  "summary": "The Klipsch T5 II is ready to take on the Sony WF-1000XM4",
  "article": [
    "Legacy audio brand Klipsch has unveiled a new set of true wireless earbuds called the Klipsch T5 II True Wireless ANC which don't just offer active noise cancellation – they let you pause and play your audio by tracking your head movements.",
    "Klipsch’s new earbuds are set to rival the Sony WF-1000XM4 and Bose QuietComfort Earbuds in price and performance when they drop in September for £299 / €349 / $299 (around AU$400), but the head-tracking playback controls could be an added edge.",
    "On top of the Bragi Moves AI system that Klipsch says will continue to offer new functionality over the lifetime of the earbuds, the T5 II will also offer Qi-compatible wireless charging with up to 7 hours of battery life with ANC turned off and 5 with it on, plus another 21 hours of battery life in case (15 hours with ANC turned on).",
    "Klipsch says it will be the first company to offer Dirac HD Sound in a pair of true wireless earbuds to drive its 5.8mm dynamic driver earbuds to deliver clear sound with a wide soundstage – potentially rivaling Sony’s DSEE Extreme audio upscaling tech – and two sets of microphones for exceptional noise cancellation.",
    "Given Klipsch’s 60-plus year heritage in crafting audio products, you’d think it’d absolutely dominate the true wireless earbuds space – and yet, thanks to Apple’s marketing and ubiquity, climbing to the top of the sales charts has been a real struggle for brands like Klipsch.",
    "According to Statista's metrics, Apple led Samsung, Xiaomi, Sony and others with 41% of all total true wireless earbud sales last year. All other manufacturers combined only accounted for around 30% of sales.",
    "But unlike the new Nothing Ear 1 or Raycon earbuds, Klipsch isn’t trying to take on the Apple AirPods directly. Rather, it’s trying to take on the established players in the high-end true wireless space like Bose and Sony. Those companies have recently found a lot of success with their Sony WF-1000XM4 earbuds and Bose QuietComfort Buds, both of which rank really well on our list of the best true wireless earbuds.",
    "With its strong audio tuning skills and interesting embedded AI system, the Klipsch T5 II True Wireless ANC could pose a real threat to Sony and Bose, but we’ll have to wait until September to see how they fare when they’re released to the public."
  ],
  "headers": {
    "4": "Analysis: Can Klipsch clinch the high-end true wireless market?"
  },
  "links": {
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "metrics": "https://www.statista.com/statistics/1105407/leading-tws-vendors/",
    "Nothing Ear 1": "https://www.techradar.com/reviews/nothing-ear-1",
    "Raycon earbuds": "https://www.techradar.com/news/raycon-earbuds",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around"
  }
}