{
  "source": "https://www.techradar.com/news/i-finally-get-huaweis-harmonyos-but-its-definitely-not-for-everyone",
  "title": "I finally 'get' Huawei's HarmonyOS - but it's definitely not for everyone",
  "category": "phones",
  "updated": "2021-06-07T11:32:40Z",
  "author": "tom-bedford",
  "summary": "There’s a cost investment",
  "article": [
    "When Huawei’s HarmonyOS was being shown off at its launch event on June 2, I was getting a live demo of the new jack of all trades operating system in a fancy 5-star hotel, where prices for one night start at over £200 and go up to nearly £1,000.",
    "I was shown HarmonyOS running on a tablet, on a smartwatch, on earbuds and more. One demonstration showed a YouTube video on a laptop pausing when the connected smartphone received a call, which was then sent to some paired headphones via the smartwatch. Another use case was a picture being taken of the nearby St Pancras station, which was seamlessly dropped onto a nearby PC for easy editing.",
    "My favorite showcase was when a smartphone was paired with an action camera to record 4K footage, which had the heart rate from a worn smartwatch imposed over the top. This both looked cool, and is probably super useful for adventurers who love to record action footage.",
    "Up until this demonstration, I hadn’t totally understood HarmonyOS - it didn’t seem like Huawei had much to gain in building its own Android rival, because it didn’t solve Huawei phones’ one major problem.",
    "Ever since the Huawei ban, the company’s phones haven’t been allowed to use Google Mobile Services apps, including the Play Store and the massive library it provides access to.",
    "Now, I think I get it. Huawei’s focus isn’t in building killer new software, but it’s providing you with a reason to buy into its ecosystem of gadgets. Huawei wants you to buy more than just a smartphone.",
    "I was under the impression HarmonyOS was an attempt by Huawei to make its own software because of the restrictions imposed by the Huawei ban. Maybe it was, but what I was shown at the HarmonyOS demo gave me a different idea of its purpose.",
    "HarmonyOS’ whole schtick is that the same operating system works between gadgets. Your smartphone will run the same software, and therefore apps and systems, as your watch or tablet or headphones. It lets all your gadgets work synchronized.",
    "Sure, this is comparable to Apple’s ecosystem of devices, or even Google’s various softwares, plus the Bluetooth connectivity standard makes it easy for most kinds of device to work together. But different Apple products, or Google gadgets, all run varying operating systems, and since HarmonyOS devices all run literally the same operating system, it should make it easier for developers to design apps that work in tandem between platforms.",
    "Take, for example, the demonstration I described of a smartphone pulling video from an action cam, stats from a smartwatch and recording it all in 4K - that seems like something Apple or Android devices would struggle with. For HarmonyOS, that was seamless.",
    "Huawei is one of many companies to have a 1+X+N strategy, where the ‘1’ is your smartphone which controls ‘X’ number of close products like smartwatches and headphones (in Huawei’s case it’s 8), then ‘N’ represents a wide ecosystem of other smart products like printers, games consoles and so forth.",
    "What does that really mean? It means your smartphone is the center of a big web of connected devices.",
    "Having used Android phones along with Wear OS, Google Chromecast and more, which often have connection problems and issues which make them frustrating to use, I really appreciate the seamless form of connectivity that HarmonyOS offers.",
    "Huawei clearly pictures you using all its products - having a Huawei Watch 3 on your wrist, Mate 40 Pro in your pocket, MatePad Pro 12.6 in your bag, Vision 4K TV on your wall, MateBook X Pro on your desk and FreeBuds 4 in your ears. The list of its products goes on, and once all are on HarmonyOS, they should work in beautiful… well, harmony.",
    "But while this Huawei-centric future sounds lovely, it’s also too exclusive.",
    "If HarmonyOS is the ‘strength-in-numbers’ type of operating system, which becomes truly useful when you’ve got loads of gadgets, then it logically follows that you’ll only make the most of it when you’ve spent loads of money on Huawei’s tech.",
    "But when you look at the price tags on lots of Huawei’s output - bear in mind that it’s generally a premium-priced company - you’ll soon realize the problem with this. HarmonyOS is only accessible if you’ve got plenty of money, especially since it banks on you owning not just a few core smart gadgets, but a wide web of peripheral ones.",
    "In the UK, where I live, we’re less than a year on from a recession, and because of Covid-19 the vast majority of people globally have had their finances hit hard. The number of people who can afford Huawei’s (or any other company’s) expensive phones, tablets, TVs, monitors, smartwatches and more is pretty low.",
    "This echoes a general problem with internet of things gadgets, which are smart connected homes and gadgets that all talk to each other. It only really works if you can afford home hubs for every room, intelligent kitchen appliances, wrist-mounted powerhouses, color-changing lighting and so on, and each of those gadgets comes with a high price compared to their non-smart counterparts (or just not owning them at all).",
    "Standing in that London hotel, marveling at the displays and demonstrations, the thought of ‘wow, this is cool’ jostled elbows with the knowledge that this kind of tech will forever be out of reach for people like me.",
    "I won’t ever own a smart home, and I’m okay with that. My TV will never ‘speak’ to my computer, mainly because I don’t own either of those things. Tech isn’t for everyone - lots of companies thrive by putting out high-priced gadgets that few can afford - but some of us have to settle for cheaper tools.",
    "That’s HarmonyOS, then - like the hotel I was standing in when I saw it, it’s not for everyone. It’s undoubtedly cool, and flashy, with loads of uses if you’re really invested. But the sheer cost of entry makes it unattainable for lots of people out there, myself included."
  ],
  "headers": {
    "6": "HarmonyOS isn’t an Android copy",
    "15": "Harmony on your phone, chaos at the bank"
  },
  "links": {
    "HarmonyOS": "https://www.techradar.com/news/harmonyos-2",
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "Huawei Watch 3": "https://www.techradar.com/reviews/huawei-watch-3",
    "Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "MatePad Pro 12.6": "https://www.techradar.com/reviews/huawei-matepad-pro-126-2021",
    "Vision 4K TV": "https://www.techradar.com/news/huawei-announces-huawei-vision-4k-tv-with-pop-up-camera",
    "MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro-2021",
    "FreeBuds 4": "https://www.techradar.com/reviews/huawei-freebuds-4i"
  }
}