{
  "source": "https://www.techradar.com/news/motorola-edge-30-ultra-specs-and-design-virtually-confirmed",
  "title": "Motorola Edge 30 Ultra specs and design virtually confirmed",
  "category": "phones",
  "updated": "2021-11-17T10:15:59Z",
  "author": "james-rogerson",
  "summary": "Along with the Edge S30",
  "article": [
    "Motorola hasn’t yet unveiled the rumored Motorola Edge 30 Ultra, but that hasn’t stopped specs and images of the phone being revealed in a somewhat official capacity, as they’ve appeared on TENAA – a Chinese certification agency.",
    "Typically, data held by TENAA (and other certification organizations) is accurate and official, so while we still can’t quite be 100% sure of anything, it’s very likely that the details here are accurate.",
    "The listing – spotted by Weibo user @WhyLab – shows a phone that matches up with previous unofficial renders, complete with a triple-lens camera on the back and a punch-hole camera on the front.",
    "Specs meanwhile apparently include a 6.67-inch 1080 x 2400 OLED screen with a 144Hz refresh rate and HDR10+, a Snapdragon 898 chipset, 8GB or 12GB of RAM, 128GB or 256GB of storage, and a triple-lens rear camera with two 50MP lenses and one 2MP one.",
    "There’s also said to be a 60MP front-facing camera, an 8.4mm thickness, a 201g weight, and a 4,700mAh battery which can be juiced to 50% in 15 minutes or to full in 35 minutes. Less impressively, the Motorola Edge 30 Ultra reportedly has just an IP52 rating, meaning water resistance is minimal.",
    "Alongside that, a listing for a Motorola Edge S30 has also been spotted. This is seemingly a lower-end model in the range, some images of which can be seen below.",
    "This apparently has a 6.78-inch 1080 x 2460 LCD screen with a 120Hz refresh rate, a Snapdragon 888 Plus chipset, a 4,700mAh battery, a side-mounted fingerprint scanner, a thickness of 7.7mm, a weight of 202g, and a triple-lens camera, with a 108MP main sensor and a secondary lens offering 10x optical zoom.",
    "From the sounds of things, these will both be fairly high-end phones, but while the specs of the Motorola Edge 30 Ultra generally sound better, it might in some ways be a less exciting handset than the Motorola Edge S30.",
    "We say this mainly because of the apparent presence of a 10x optical zoom on the Edge S30. Such a long-distance zoom is fairly rare on smartphones. Some super-premium Samsung phones like the Samsung Galaxy S21 Ultra have this, as do a couple of phones from other brands, such as the similarly expensive Huawei P40 Pro Plus.",
    "But it’s a rare feature and usually expensive to get. Given the rest of the rumored specs of the Motorola Edge S30 though, it’s likely that this won’t be a top-price phone.",
    "Of course, this latest leak doesn’t rule out a 10x optical zoom on the Motorola Edge 30 Ultra, but previous leaks suggest that has 50MP main and ultra-wide cameras, with the 2MP one presumably being a depth sensor or macro snapper.",
    "And there’s more to a camera than zoom, so the Edge 30 Ultra’s might be more well-rounded overall, but we’d hazard a guess that the 108MP sensor in the Motorola Edge 30 is the same one as we’ve seen in the likes of the Motorola Edge 20 Pro, and that moderately impressed us there.",
    "We should know exactly what these phones can offer soon, as they’re rumored to be landing in either December or January.",
    "Via MyFixGuide and GSMArena"
  ],
  "headers": {
    "7": "Analysis: the Motorola Edge S30 could be the more exciting of the two"
  },
  "links": {
    "rumored Motorola Edge 30 Ultra": "https://www.techradar.com/news/motorola-edge-30-ultra-leak-reveals-the-design-and-specs-of-this-flagship-phone",
    "@WhyLab": "https://weibo.com/n/WHYLAB?from=feed&loc=at",
    "Snapdragon 898": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Huawei P40 Pro Plus": "https://www.techradar.com/reviews/huawei-p40-pro-plus",
    "previous leaks": "https://www.techradar.com/news/motorola-edge-30-ultra-may-launch-in-january-with-top-snapdragon-898-chipset",
    "Motorola Edge 20 Pro": "https://www.techradar.com/reviews/motorola-edge-20-pro-review",
    "MyFixGuide": "https://www.myfixguide.com/moto-edge-x-edge-s30-tenaa/",
    "GSMArena": "https://www.gsmarena.com/motorola_edge_30_ultra_and_edge_s30_pass_through_tenaa-news-51867.php"
  }
}