{
  "source": "https://www.techradar.com/news/pokemon-snap-returns-returnal-destroys-us-on-this-weeks-totally-rated-show",
  "title": "Pokémon Snap returns, Returnal destroys us on this week's Totally Rated show",
  "category": "appliances",
  "updated": "2021-05-07T14:08:40Z",
  "author": "rhys-wood",
  "summary": "Totally Rated both rages and reminisces this week",
  "article": [
    "In this week’s episode of Totally Rated, New Pokémon Snap harkens to an N64 classic, Android Central and T3 test the ultimate gaming desk and on PS5, Returnal’s difficulty casts us into the depths of space.",
    "You might be able to catch ‘em all, but can you snap ‘em all, too? That’s the question posited by New Pokémon Snap, a new Nintendo Switch release and the long-awaited sequel to the N64 classic.",
    "With so many fans of the Pokémon universe out there, the hype for this re-release is pretty high, as Sara Gitkos from iMore explains; “If you are a fan of relaxing games like Animal Crossing: New Horizons and Pokémon, this low-key photography sim should be right up your alley.”",
    "If you’re a longtime Pokémon fan, then, New Pokémon Snap should offer you plenty to enjoy. Others, meanwhile, might find this safari a little dated, as TechRadar’s Adam Vjestica explains; “New Pokémon Snap feels antiquated by today’s standards.",
    "“Your enjoyment of the game will ultimately come down to whether you enjoy taking hundreds of pictures of virtual creatures, as you slowly chug along predetermined paths multiple times in the hopes of spotting something new.",
    "“It’ll probably pass muster with Pokémon-loving kids, who will delight in seeing Pikachu scamper across the screen for perhaps the very first time.",
    "“But for anyone aged 10 or above, this eclectic safari park isn’t worth the price of admission.”",
    "Whether you prefer gaming or office chairs, what’s certain is that you still need a quality desk for your PC setup. In this case, Secretlab’s Magnus desk didn’t disappoint.",
    "T3 and Windows Central got their hands on SecretLab’s new Magnus desk and Robert Jones of T3, was a fan: “SecretLab has already covered itself in glory with its elite-tier gaming chairs, and the Magnus sees the firm triumphantly expand its offering in a genuinely pioneering and exciting way.",
    "“This gaming desk exudes premium in every detail, and its all-metal construction imbues it with a quality no other rival can match.",
    "“Throw in simply superb cable management features, a smart selection of magnetised accessories, and a thoroughly thought through setup procedure, and the end result is the ultimate gaming table for PC and console gamers.”",
    "Daniel Thorpe-Lancaster of Windows Central was quick to join praising the desk’s construction, but believes that you should take a raincheck if you’re after something bigger: “For anyone who is already a fan of Secretlab's gaming seats, you're likely to love the Magnus desk.",
    "“Even if you haven't tried one of the company's chairs before, the Magnus desk makes a great, low-profile space to get work done and dive into game night.",
    "“If you want something other than black, need a much larger desk, or prefer the variety of standing desks out there, then you may be better served elsewhere.”",
    "Back over to gaming, this time on the PS5, Housemarque’s sci-fi roguelike shooter Returnal has been impressing and frustrating us in equal measure.",
    "Vic Hood of TechRadar gave the release a thumbs up: “It’s hard to deny that Housemarque has done something different with Returnal, blending a roguelike with a blockbuster third-person shooter – and creating an arcade bullet hell that’s different to anything we’ve seen from Sony before.",
    "“Returnal is a PS5 exclusive that emphatically meets the standards of what we’ve been crying out for from the new console, and it’s a fantastic showcase for what this new hardware is actually capable of.”",
    "While Returnal’s high level of difficulty will be a deterrent for some, Ben Tyrer of GamesRadar explains that it ultimately doesn’t take anything away from the core experience: “Returnal can be messy, tough, and perhaps a little too uncompromising for a $70 game.",
    "“And yet, despite the moments of pad-clenching exasperation, it remains a moreish experience even after you’ve plumbed its depths.”",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every Thursday."
  ],
  "headers": {
    "1": "New Pokémon Snap could use more film",
    "7": "Secretlab's Magnus desk wows with RGB goodness",
    "14": "Returnal shines on the PS5"
  },
  "links": {
    "as TechRadar’s Adam Vjestica explains": "https://www.techradar.com/reviews/new-pokemon-snap-review",
    "Returnal": "https://www.techradar.com/reviews/returnal-review"
  }
}