{
  "source": "https://www.techradar.com/news/ps5-3d-audio-is-being-unleashed-on-gaming-tvs-but-will-it-matter",
  "title": "PS5 3D Audio is being unleashed on gaming TVs – but will it matter?",
  "category": "gaming",
  "updated": "2021-08-30T02:00:46Z",
  "author": "henry-st-leger",
  "summary": "Sound the alarm",
  "article": [
    "If you have a PS5, you may have been disappointed to learn that Tempest 3D Audio – a standout feature of the console detailed at length by Sony's various operatives and spokespersons – wasn't compatible with a TV's built-in speakers, requiring players to opt for quality over-ear headphones to get a sense of the scope and scale of surround sound audio formats.",
    "But no longer. The latest PS5 firmware update has – albeit in beta – brought in a number of new changes, including UI improvements and a hesitant method for expanding internal storage with an M.2 SSD (while washing its hands of approving particular models so far).",
    "These changes are available to those who've signed up to PlayStation’s Beta testing program in US, Canada, Japan, UK, Germany and France – though they're set to roll out to the general player base in the near future.",
    "While the M.2 SSD changes may be making the most headlines, it's the change to the 3D Audio format that's most worth dwelling on – especially since it's unclear how much benefit the average gamer will get out it.",
    "Tempest 3D audio is PlayStation's answer to Dolby Atmos, the surround sound audio format supported by the Xbox Series X and Xbox Series S.",
    "Like Atmos, Tempest 3D Audio is designed to recreate the feeling of surround sound speaker setup, even if you have a simpler arrangement (say, a single soundbar, or only front-facing speakers and subwoofers).",
    "TechRadar's Gaming Editor, Vic Hood, gives us a good outline: \"First revealed by PS5 lead architect Mark Cerny back in early 2020, PS5 3D audio makes use of Sony’s innovative Tempest 3D audio engine to make PS5 in-game audio spatial.",
    "\"What that means is that, rather than a player hearing sound as one stereo block, like with the PS4, each sound is delivered to players as though it’s coming from the source itself. The aim is ultimately to create a more immersive, realistic in-game audio experience – and Sony seems to be delivering.\"",
    "The format has previously only been compatible with headphones, such as the PS5 Pulse 3D Wireless Headset – with TechRadar’s senior gaming writer, Adam Vjestica, telling us that “you can use any wired or USB wireless gaming headset to experience the effects of 3D Audio.”",
    "However, the new beta firmware update brings the audio format to your TV speakers as well.",
    "Well, that's the idea – but the realities of TV manufacturing make things a little bit uncertain.",
    "For one, it's worth mentioning that Tempest 3D Audio isn't quite as impressive as Dolby Atmos can be. In our review of the PS5 Pulse 3D Wireless Headset, we wrote that “Unfortunately, none of the games we tried with the headphones so far sounded as immersive as, say, a Dolby Atmos film due to the limited nature of the 3D sound, but getting a taste of the 3D AudioTech was preferable to not hearing it at all.\"",
    "So, still worthwhile, but possibly limited for those who are used to listening to Dolby Atmos sound with their TV shows and movies.",
    "It's likely those with Atmos-quality speakers, though, that stand to benefit from this change most. With a decent audio setup, you'll likely get a good sense of what the Tempest 3D Audio format is designed to go: giving a sense of scale and immersion, placing the sounds of enemies and environmental effects around you rather than simply in front of you.",
    "Those of you with a cheap TV that makes do with 10-20W speakers, or rear-firing audio drivers that throw sound onto walls rather than towards the player, maybe less so.",
    "Sound quality is hugely variable between gaming TVs. Screens designed for gaming will likely fare better than most, but high-end televisions are often intended to be used in tandem with equally high-spec audio hardware, such as a plug-in soundbar or speaker setup, or even a pair of over-ear headphones.",
    "Many TVs only support Dolby Atmos audio indirectly, too – being able to pass an Atmos signal into Atmos-ready hardware, but not having the capabilities to output Atmos audio from the TV itself.",
    "That means that, just as with Atmos, PS5 players wanting to crank out Tempest 3D Audio will be at the mercy of their TV's audio prowess, however impressive or unimpressive that is.",
    "This won't be an issue if you have a quality gaming headset or headphones, or have a decent audio setup ready to go – and we are glad to see this come to all TVs, rather than remaining a Sony TV exclusive, as this wouldn't be great for those who've just splashed out on a gaming TV made by someone other than PlayStation's parent organization.",
    "But we'd ask you to temper your excitement if you're expecting an Atmos-level experience, or for your gaming TV to improve its audio chops overnight."
  ],
  "headers": {
    "4": "What is Tempest 3D Audio?",
    "10": "Great! So my TV audio will sound better?"
  },
  "links": {
    "detailed at length by Sony's various operatives and spokespersons": "https://www.techradar.com/news/how-ps5-3d-audio-took-returnal-and-resident-evil-village-to-the-next-level",
    "expanding internal storage": "https://www.techradar.com/best/best-ssd-for-ps5",
    "M.2 SSD": "https://www.techradar.com/best/best-m2-ssd",
    "PlayStation’s Beta testing program": "https://www.techradar.com/news/this-ps5-beta-program-will-let-you-test-new-console-features-before-anyone-else",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "gives us a good outline": "https://www.techradar.com/news/how-ps5-3d-audio-took-returnal-and-resident-evil-village-to-the-next-level",
    "PS5 Pulse 3D Wireless Headset": "https://www.techradar.com/reviews/ps5-pulse-3d-wireless-headset",
    "gaming TVs": "https://www.techradar.com/news/best-gaming-tv",
    "Sony TV": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far"
  }
}