{
  "source": "https://www.techradar.com/news/nasa-is-giving-employees-fitbits-to-help-slow-the-spread-of-covid-19-but-will-it-work",
  "title": "NASA is giving employees Fitbits to help slow the spread of Covid-19, but will it work?",
  "category": "wearables",
  "updated": "2021-02-11T12:40:32Z",
  "author": "hamish-hector",
  "summary": "To boldly stay at home",
  "article": [
    "NASA is giving Fitbit Charge 4s to 1,000 of its employees to help reduce the risk of infectious disease spread in its space missions. If this pilot plan is successful, NASA may expand the scope of its program beyond mission-critical teams to all staff.",
    "Using wearable technology, NASA hopes its employees will be better equipped to track their health and detect any potential disease symptoms as quickly as possible. Fitbit’s Daily Check-in feature will provide regular Covid-19 guidance, allowing wearers to better decide if they are fit to work or not.",
    "Depending on NASA’s results, perhaps wearing a Fitbit or similar device could become another part of the new norm. But just how effective can these devices be at detecting if we are sick?",
    "Unfortunately, wearable tech like the Fitbit isn’t yet at the point where it can replace a Covid-19 test, but similar devices have been shown to be able to pick up the signs of flu-like illnesses.",
    "A study published on Nature in November 2020 showed that by tracking heart rate and other metrics with a wearable device, scientists were able to see a change in a person’s physiology before they showed other symptoms of being sick.",
    "A lack of detectable symptoms doesn’t mean a person is necessarily healthy, but readings from a wearable device like a Fitbit can inform them that they could be sick and should stay at home. In a press release, Fitbit announced that they are working with the Feinstein Institutes for Medical Research to develop and improve their early detection algorithms."
  ],
  "headers": {
    "3": "How effective are Fitbits at tracking flu-symptoms?"
  },
  "links": {
    "Fitbit Charge 4s": "https://www.techradar.com/reviews/fitbit-charge-4",
    "A study": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9846021119946189000&xs=1&url=https%3A%2F%2Fwww.nature.com%2Farticles%2Fs41746-020-00363-7&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnasa-is-giving-employees-fitbits-to-help-slow-the-spread-of-covid-19-but-will-it-work",
    "press release": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9656464602757145000/https://investor.fitbit.com/press/press-releases/press-release-details/2021/NASA-Makes-Fitbit-Ready-for-Work-Solution-Available-to-Support-Health-and-Safety-of-Astronauts-and-Other-Mission-Critical-Employees-During-COVID-19-Pandemic/default.aspx",
    "Feinstein Institutes for Medical Research": "https://feinstein.northwell.edu/"
  }
}