{
  "source": "https://www.techradar.com/news/faster-spin-on-intels-flagship-comet-lake-cpu-could-arrive-soon-to-pressure-amd",
  "title": "Faster spin on Intel’s flagship Comet Lake CPU could arrive soon to pressure AMD",
  "category": "computing",
  "updated": "2021-02-14T09:20:58Z",
  "author": "darren-allan",
  "summary": "Intel appears to be trying to capitalize on AMD’s Ryzen stock woes, and 10900KS could be part of this",
  "article": [
    "Intel could have a new top dog Comet Lake processor waiting in the wings, namely a fresh variant of the flagship 10900K, according to a new report.",
    "Tom’s Hardware spotted a Core i9-10900KS processor mentioned in an Intel Software Advantage Program document listing qualifying CPUs for a Crysis Remastered game bundle.",
    "The 10900KS is listed alongside the existing 10900K (vanilla unlocked model) and 10900KF (with no integrated graphics) versions of Intel’s top-tier Comet Lake chip, suggesting that this is a new variant that might be launched soon. Remember that Rocket Lake is set to take off in March, and if Intel does have a new spin on the 10900K, it’ll very likely be coming out before the next-gen chips.",
    "The theory is that this will be a special edition of the 10900K CPU, a specially binned model – meaning Intel will select the choicest silicon for the chips – which means it can be pushed with slightly higher clocks, much like the 9900KS before it (that offered an all-core 5GHz boost – it remains to be seen what avenue Intel might take with the 10900KS).",
    "Of course, just because it has popped up in a document, doesn’t mean this processor is inbound – the listing could be some kind of a mistake (maybe Intel previously planned to deploy the CPU, but has changed its mind since). A number of scenarios could apply here, so we certainly can’t take anything for granted – but that said, it’s definitely a possibility that there is a 10900KS on the horizon.",
    "If it does eventually emerge, the 10900KS will seemingly come bundled with a copy of Crysis Remastered, as per the aforementioned Intel document.",
    "Intel appears to be on a big counter-attack against Ryzen processors at the moment, with Comet Lake prices being cut substantially at retailers, and this could represent another offensive against AMD which is currently struggling with stock issues and supply of new Ryzen 5000 CPUs."
  ],
  "headers": {
    "3": "Prime CPUs"
  },
  "links": {
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/10900ks-spotted",
    "document": "https://softwareoffer.intel.com/Campaign/Terms/5C497E4A-3BA0-4F9F-9B40-BD5DEC8F593D",
    "Rocket Lake is set to take off in March": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "much like the 9900KS before it": "https://www.techradar.com/news/intel-announces-core-i9-9900ks-october-launch-with-a-swipe-at-amd-over-boost-clocks",
    "offered an all-core 5GHz boost": "https://www.techradar.com/reviews/intel-core-i9-9900ks",
    "Comet Lake prices being cut substantially at retailers": "https://www.techradar.com/news/intel-could-have-a-new-tactic-to-undermine-amd-slashing-prices-on-comet-lake-cpus",
    "struggling with stock issues": "https://www.techradar.com/news/amd-ryzen-cpus-help-drive-record-breaking-revenue-but-the-news-isnt-all-good",
    "Ryzen 5000 CPUs": "https://www.techradar.com/news/amd-ryzen-5000"
  }
}