{
  "source": "https://www.techradar.com/news/how-to-watch-what-if-online-stream-the-new-disney-plus-original-series-now",
  "title": "How to watch What if…? online: stream the new Disney Plus Original series now",
  "category": "computing",
  "updated": "2021-08-11T05:01:18Z",
  "author": "daniel-pateman",
  "summary": "Explore an infinity of possibilities in Marvel’s new series",
  "article": [
    "The creation of the multiverse at the conclusion of Loki provided the perfect segue for Marvel Studio’s first animated series, What If…? Created by A.C. Bradley (Trollhunters: Tales of Arcadia), this new anthology show alters pivotal moments from the acclaimed Infinity Saga to explore thrilling alternative realities. Below we detail how to watch What If…? now with a Disney Plus subscription.",
    "Each episode is the stuff of heady fanboy speculation. Imagine that Peggy Carter took the Super Soldier Serum instead of Steve Rodgers? What if Loki wielded Mjolnir, Thor’s hammer? And – an example of multiple films converging – what would the MCU look like if T’Challa became Star Lord and joined the Guardians of the Galaxy?",
    "These are delightful hypotheticals to entertain the Marvel Massive. Plus, every instalment is inspired by a different genre. Expect a tragic love story starring Doctor Strange, a political thriller, and an Agatha Christie-style murder mystery. But the fresh take that has us the most psyched? A horror-themed episode in which Captain America and Iron Man are brain-munching zombies!",
    "Jeffrey Wright narrates the series as omnipotent being The Watcher, while dozens of A-listers return to voice their superhero surrogates, among them Michael B. Jordan, Paul Bettany, Chris Hemsworth, Samuel L. Jackson, Tilda Swinton, and the late, great Chadwick Boseman.",
    "Offering up an infinite space for divergent storytelling, exploding with A-list talent and stunningly animated, What If…? might be Marvel Studio’s best TV show yet. Read on to find out how to watch What If…? online with Disney Plus.",
    "Disney Plus is already cheaper than competing streaming services like Netflix but you can save even more when you sign up for an annual subscription which gives you 15% off the monthly price. Obviously you have to splash the cash at the start, but with so much content to get stuck in to we very much doubt you'll run out of things to watch before the 12 months are up. You're looking at $79.99/£79.90/AU$119.99 for the year.",
    "Or if your interests are farther reaching (and you're in the US), then we'd seriously suggest looking at the fantastic value bundle package. It adds Hulu and ESPN+ to your subscription price. The Hulu element opens up a world of Hulu Originals such as The Great, Upload, Love Victor and Helstrom. While ESPN+ brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $13.99 a month.",
    "What If...? is just the latest in a string of highly-anticipated releases exclusive to the platform, including Loki, Monsters at Work, Soul, Mulan, Hamilton, The Falcon and the Winter Soldier and much more.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "In addition, now that Disney has set the precedent of releasing movies like its live-action Mulan remake on the service instead of in theaters through its Disney Plus Premier Access program, expect the company to keep bringing more blockbuster films that were originally intended to be shown on the big screen to Disney Plus in 2021. It's currently an excellent way to watch Jungle Cruise online, starring Emily Blunt and Dwayne 'The Rock' Johnson.",
    "Finally, there's Star on Disney Plus that most global markets get to enjoy and sees the amount of content available through Disney Plus more than double, with a particular eye to shows grown-ups are going to enjoy.",
    "It's available in the UK, most of Europe, and other select markets like Australia and New Zealand - but not in the US, where the media giant's Hulu service already has very similar ground covered.",
    "Read more:"
  ],
  "headers": {
    "5": "How to save money on Disney+",
    "7": "What else should I know about Disney+?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "$79.99/£79.90/AU$119.99 for the year": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1029024482420701700&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN+": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $13.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-7161130748333790000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "watch Jungle Cruise online": "https://www.techradar.com/news/how-to-watch-jungle-cruise-online-stream-new-dwayne-the-rock-johnson-movie-on-disney-plus",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained"
  }
}