{
  "source": "https://www.techradar.com/news/ps5-might-be-getting-an-xbox-series-xs-exclusive-game-soon",
  "title": "PS5 might be getting an Xbox Series X/S exclusive game soon",
  "category": "gaming",
  "updated": "2021-06-07T09:09:24Z",
  "author": "gerald-lynch",
  "summary": "A spooky signing for Sony's PS5",
  "article": [
    "Is the Xbox Series X / S about to lose its only true next-gen exclusive? It seems that way, as a rating listing points to Bloober Team's The Medium making its way to Sony's PS5 console.",
    "Gematsu notes that the Entertainment Software Rating Board (more commonly known as the ESRB) has filed a rating for the game, not only on 'Xbox Series' consoles but on PlayStation 5, too.",
    "The psychological horror game, which sees a super-naturally sensitive protagonist tap into both the real world and its shadowy, spooky mirror image, launched as a digital exclusive on the latest Xbox consoles and PC back in January. But this physical retail listing points to a PS5 debut too.",
    "If The Medium does come to PS5, it'll be a bit of a blow to the Xbox's line-up of exclusives. Yes, the console family has many exclusive franchises, from Forza Motorsport to Halo. But The Medium was (and currently still is) the only title exclusively built to take advantage of the latest console's processing power and speedy SSD – all other titles are still playable in a lesser form on the older Xbox One, Xbox One X, and Xbox One S.",
    "It highlights a growing theme with the current console generation, one that suggests not only are there that many titles exclusive to each rival machine, but that too few are taking advantage of the inherent power of the new consoles in favour of supporting versions for their ageing predecessors too. The Medium was the Xbox Series X and S's only current way to truly show off all that's possible with a next-gen targeted Xbox title – and is likely now one that PS5 players can claim, too.",
    "As for the game itself, it was a generally well received fright fest. In our The Medium review, we said:",
    "\"Bloober Team has crafted an unnerving psychological horror bolstered by its unsettling characters, tailor-made score and often unpredictable story. However, pacing issues in the latter part of the game makes it difficult at times to keep up with the narrative and at times it felt like the game was too linear.\"",
    "The Medium is available as part of Xbox Game Pass if you'd like to give it a spin."
  ],
  "headers": {
    "4": "Exclusive entropy"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "The Medium": "https://www.techradar.com/reviews/the-medium",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Gematsu": "https://www.gematsu.com/2021/06/esrb-rates-the-medium-for-ps5",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "Halo": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox One X": "https://www.techradar.com/news/xbox-one-x-deals-price-bundles",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "The Medium review": "https://www.techradar.com/reviews/the-medium",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}