{
  "source": "https://www.techradar.com/news/powerful-botnet-found-to-be-launching-ddos-attacks",
  "title": "Powerful botnet found to be launching some of the biggest DDoS attacks ever",
  "category": "computing",
  "updated": "2021-09-15T16:49:41Z",
  "author": "abigail-opiah",
  "summary": "Gaming industry hit the hardest",
  "article": [
    "Some of the most powerful DDoS attacks ever detected have been revealed by cybersecurity company StormWall.",
    "This specific botnet, which enabled DDoS attacks of up to 2TB/s, sets a new record over the entire life of the internet as we know it so far.",
    "Originating from Spain, the botnet, which consisted of 49,000 thousand servers, was openly available to hire online, costing from $2,500 for two days usage.",
    "Botnets are networks of hijacked computer devices used to carry out various scams and cyberattacks.",
    "According to Stormwall, most of the detected DDoS attacks were directed at the gaming industry.",
    "\"The attacks carried out by the new botnet are quite standard and it can launch attacks using the UDP, TCP, and HTTP protocols (at layer seven of the OSI model) with browser emulation,\" the company said.",
    "\"Attacks of such power affect not only the victim but also the entire chain of its providers and can cause problems with access to the Internet at the same time for hundreds of thousands of users and online resources.\"",
    "Hackers have had access to the new tool for around a month, with StormWall adding that only cloud DDoS protection services with sufficient filtering network capacity will be able to cope with the scale of the attacks caused by the botnet.",
    "Earlier this year, the company reported 25.4% more attacks on its customers during its Q1 2021 than it saw in the fourth quarter of 2020, with companies in the e-commerce, construction, entertainment, telecommunications, as well as the financial sector, all hit hard."
  ],
  "headers": {
    "3": "Botnet uncovered"
  },
  "links": {
    "DDoS": "https://www.techradar.com/news/best-ddos-protection",
    "cyberattacks": "https://www.techradar.com/news/five-common-misperceptions-about-business-cyberattacks",
    "25.4% more attacks on its customers": "https://themerkle.com/ddos-attacks-report-for-q1-2021-by-stormwall/"
  }
}