{
  "source": "https://www.techradar.com/news/xbox-series-x-restock-woes-are-set-to-continue-microsoft-admits",
  "title": "Xbox Series X restock woes are set to continue, Microsoft admits",
  "category": "gaming",
  "updated": "2021-04-29T09:02:11Z",
  "author": "adam-vjestica",
  "summary": "‘Xbox Series X and S will continue to be constrained by supply’",
  "article": [
    "Xbox Series X restock woes are set to drag on until at least June 2021, Microsoft has revealed.",
    "During the company’s third quarter earnings call, Microsoft chief financial officer Amy Hood reiterated an earlier prediction from Microsoft’s head of investor relations, Mike Spencer, who said that Xbox Series X stock will continue to be hard to find until at least June back in February.",
    "Hood provided a prediction on Microsoft’s gaming business for the fourth quarter (thanks, VGC), which ends on June 30, 2021.",
    "“In gaming, we expect revenue growth in the mid to high single digits,\" Hood said. \"Significant demand for the Xbox Series X and S will continue to be constrained by supply.”",
    "The news isn’t too surprising, especially as AMD, which makes the custom chips inside the Xbox Series X and Xbox Series S, has previously admitted that supply issues would continue to be “constrained” in the future.",
    "Microsoft posted impressive results from its latest earnings call. Xbox hardware revenue was up 232%, which was “driven by continued demand for Xbox Series X/S”. Meanwhile, Xbox content and services revenue also increased by 34% thanks to “strength from third-party titles, Xbox Game Pass subscriptions, and first-party titles”.",
    "Microsoft didn’t reveal the total number of Xbox Game Pass subscribers, but we know that it has amassed 18 million subscribers as of February 2021.",
    "Xbox Series X and Xbox Series S aren't the only consoles that are hard to find at the moment. The PS5 has arguably seen even higher levels of demand, but that hasn't stopped Sony from selling 7.8 million units since it's November 19, 2020 release. The PS5 is currently outpacing the PS4, which sold 7.6 million during the same time frame.",
    "As more big games arrive for the current-gen consoles, such as Halo: Infinite and Ratchet and Clank: Rift Apart, demand is likely to increase further, as players get to experience more games that are specifically designed to tap into the raw horsepower of the new consoles."
  ],
  "headers": {
    "7": "Strong sales despite low stock"
  },
  "links": {
    "Xbox Series X restock": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "third quarter earnings call": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-2861484474128163300&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2FInvestor%2Fearnings%2FFY-21-Q3%2Fpress-release-webcast",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "until at least June": "https://www.techradar.com/news/xbox-series-x-stock-shortages-could-last-until-june-or-later-microsoft-admits",
    "VGC": "https://www.videogameschronicle.com/news/microsoft-expects-xbox-series-x-s-supply-issues-to-continue-until-at-least-june-2021/",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "7.8 million units": "https://www.techradar.com/news/sony-has-sold-a-heck-of-a-lot-of-ps5-consoles-since-launch",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Halo: Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart"
  }
}