{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-features-are-coming-to-the-s20-note-20-and-more",
  "title": "Samsung Galaxy S21 features are coming to the S20, Note 20 and more",
  "category": "phones",
  "updated": "2021-02-18T10:09:15Z",
  "author": "james-rogerson",
  "summary": "Thanks to One UI 3.1",
  "article": [
    "You don’t have to buy a Samsung Galaxy S21 to get some of the new features offered by the phone, as a number of them are coming to older Samsung handsets wirh One UI 3.1, which has started rolling out to select devices.",
    "The Samsung Galaxy S20 range, Samsung Galaxy Note 20 range, Samsung Galaxy Z Fold 2, and Samsung Galaxy Z Flip are all getting these features, which include Enhanced Single Take – a feature that lets you capture a variety of photos and videos with one tap.",
    "Other features coming with the update include Object Eraser, which lets you remove unwanted elements from photos, and Multi Mic Recording, which lets you use both the phone’s mic and an external Bluetooth microphone at the same time to record audio.",
    "Then there’s Private Share, a feature that lets you send files to people with an expiration date on them – after which they’ll be deleted, and Eye Comfort Shield, which automatically adjusts the amount of blue light your phone outputs based on the time of day.",
    "Other features that are coming as part of the One UI 3.1 update include improved touch-autofocus and autoexposure controls for the camera, and an updated Gallery app, which is designed to group photos and videos into an easy-to-navigate feed.",
    "Finally, there’s an Auto Switch feature, which allows you to seamlessly switch between Galaxy devices when you’re listening to audio if you’re using Galaxy Buds Pro, Buds Live or Buds Plus.",
    "So this is quite a significant update, and if you have a phone that’s set to get it you shouldn’t have long to wait. Samsung has started the rollout already, but hasn’t confirmed which regions are getting it first, so keep an eye out for it over the next few days.",
    "That said, the announcement can be seen on the Samsung US newsroom, so presumably the US will be one of the first places in line.",
    "Via Engadget"
  ],
  "headers": {
    "3": "Camera, audio, privacy and more"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "Samsung US newsroom": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1401847697102425300&url=https%3A%2F%2Fnews.samsung.com%2Fus%2Fsamsung-one-ui-3-1-update-powerful-features-galaxy-s21-galaxy-s20-galaxy-note20-galaxy-z-series%2F&article_name=Samsung%20Galaxy%20S21%20features%20are%20coming%20to%20the%20S20%2C%20Note%2020%20and%20more&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-galaxy-s21-features-are-coming-to-the-s20-note-20-and-more",
    "Engadget": "https://www.engadget.com/samsung-one-ui-3-1-update-030025770.html"
  }
}