{
  "source": "https://www.techradar.com/news/the-new-roku-express-4k-could-be-a-threat-to-the-amazon-fire-tv-stick-4k",
  "title": "The new Roku Express 4K+ could be a threat to the Amazon Fire TV Stick 4K",
  "category": "televisions",
  "updated": "2021-12-03T09:25:23Z",
  "author": "nick-pino",
  "summary": "4K HDR streaming with HDR10+ for around $40 (around £29, AU$50)",
  "article": [
    "Roku has announced a new player today that will offer 4K HDR streaming with HDR10+ support for a super reasonable price of $40 (around £29, AU$50) – making it around $10 cheaper than the new Amazon Fire TV Stick 4K.",
    "The new player is called the Roku Express 4K+ and it replaces the now two-year-old Roku Premiere that sat between the HD Roku Express and Roku Streaming Stick+.",
    "The difference, according to Roku, is that the Express 4K+ will have improved hardware over the old Premiere that should make it faster and more responsive, and the Express 4K+ will use the new Roku OS that’s compatible with AirPlay 2.",
    "The Express 4K+ comes with the Roku Voice Remote, and will be available starting mid-May in the US with global availability to be determined at a later point.",
    "Alongside the Roku Express 4K+, Roku has also announced the new Voice Remote Pro that no longer requires batteries.",
    "We had heard rumors about the new Roku Remote Pro a few months ago when it was leaked on Reddit, and now it’s available to the public.",
    "The new remote is set to cost $30 (around £22, AU$39) and it should be compatible with any newer Roku device that the company has made since 2017. (Sorry, Roku 3 and Roku 4 owners.)",
    "According to Roku, the remote has both a physical microphone button and can be enabled to listen for the wake word “Hey Roku”. That said, if you don’t want the remote always listening, you can always flip a switch on the side of the remote to disable the microphone.",
    "The remote is available starting today on Roku’s website and will be coming to store shelves in May alongside the Express 4K+ in the US with global availability TBD.",
    "You might also want to check out Roku vs Fire Stick: which streaming video devices are better?"
  ],
  "headers": {
    "4": "Speaking of remotes…"
  },
  "links": {
    "Amazon Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Roku Premiere": "https://www.techradar.com/reviews/roku-premiere-2018",
    "Roku Express": "https://www.techradar.com/reviews/roku-express",
    "Roku Streaming Stick+": "https://www.techradar.com/reviews/roku-streaming-stick",
    "Roku 3": "https://www.techradar.com/reviews/audio-visual/av-accessories/roku-3-1217759/review",
    "Roku 4": "https://www.techradar.com/reviews/audio-visual/av-accessories/roku-4-1307683/review",
    "Roku vs Fire Stick": "https://www.techradar.com/news/fire-tv-vs-roku-which-streaming-video-platform-is-better"
  }
}