{
  "source": "https://www.techradar.com/news/you-might-get-google-chrome-updates-a-lot-faster-in-future",
  "title": "You might get Google Chrome updates a lot faster in future",
  "category": "computing",
  "updated": "2021-03-05T22:36:06Z",
  "author": "anthony-spadafora",
  "summary": "Google is moving to a four week release cycle for updates beginning with Chrome 94",
  "article": [
    "Google has announced that it will soon be moving to a faster release cycle for Chrome updates as the company now plans to ship a new milestone every four weeks.",
    "For more than a decade, the search giant has shipped a new milestone every six weeks in an effort to improve the security, stability, speed and simplicity of its browser.",
    "However, as Google has improved its testing and release processes for Chrome and began deploying bi-weekly security updates to improve its patch gap, the Chrome team realized that it could shorten its release cycle and deliver new features even more quickly.",
    "As a result, Google will begin releasing a new milestone every four weeks beginning with the launch of Chrome 94 in the third quarter of this year.",
    "While consumers will benefit from a faster release schedule, Google's enterprise customers will likely find it more difficult to update all of their Chrome installations as often.",
    "For this reason, the search giant plans to add a new Extended Stable option with milestone updates every eight weeks. Security updates on Extended Sable will be released every two weeks to fix important issues but these updates won't contain any new features or all of the security fixes that the four week option will receive.",
    "When it comes to Chrome OS, Google plans to support multiple stable release options as well and the company will be sharing additional details with Chrome OS administrators in the coming months.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "Extended Stable"
  },
  "links": {
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "browser": "https://www.techradar.com/best/browser",
    "security updates": "https://www.techradar.com/news/google-will-get-faster-at-releasing-chrome-security-patches",
    "Extended Stable": "https://chromium.googlesource.com/chromium/src/+/master/docs/process/release_cycle_new.md",
    "Chrome OS": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/google-chrome-os-1082513/review",
    "TechCrunch": "https://techcrunch.com/2021/03/04/google-speeds-up-its-release-cycle-for-chrome/"
  }
}