{
  "source": "https://www.techradar.com/news/microsofts-grammarly-rival-is-coming-to-word-for-mac",
  "title": "Microsoft's Grammarly rival is coming to Word for Mac",
  "category": "computing",
  "updated": "2021-12-06T00:25:16Z",
  "author": "anthony-spadafora",
  "summary": "Microsoft Editor comes with a Microsoft 365 subscription to help improve your writing",
  "article": [
    "First released in March of last year, Microsoft Editor can help anyone improve their writing in Microsoft Word and Outlook on Windows 10.",
    "However, the Grammarly rival will soon be available in Word for Mac according to a new post in the Microsoft 365 Roadmap.",
    "For those unfamiliar with Microsoft Editor, the writing tool uses AI to check your writing and offers advanced suggestions based on the clarity, formality, inclusiveness and more of your work. In addition to helping you improve your writing, it also includes a plagiarism checker to make sure your work is original and properly cited.",
    "Although a free version of Microsoft Editor is available that offers spelling and basic grammar checking only, you'll need to upgrade to Microsoft 365 to access the tool's advanced grammar, clarity, conciseness, formal language, vocabulary and punctuation features.",
    "Based on a new update to the Microsoft 365 Roadmap, Microsoft Editor for Word for Mac is currently in development and will release in July of this year.",
    "Just like in Windows 10, the tool will allow Mac users to review their writing and it will offer suggestions on their grammar, word choices and more.",
    "While you can purchase Word for Mac as a standalone product from Microsoft for $139.99, you'll need to subscribe to Microsoft 365 for $6.99 per month for one person or $9.99 per month for up to six people in order to use all of Microsoft Editor's advanced features.",
    "We'll likely hear more once Microsoft Editor releases for Mac next month but until then, you can always test it out for yourself using Word for the Web.",
    "You might also want to check out how to download and use Microsoft Word for free."
  ],
  "headers": {
    "4": "Microsoft Editor in Word for Mac"
  },
  "links": {
    "Microsoft Editor": "https://www.techradar.com/news/microsoft-word-in-windows-10-will-now-use-ai-to-make-you-a-better-writer",
    "Grammarly": "https://www.techradar.com/news/download-of-the-day-grammarly",
    "writing tool": "https://www.techradar.com/best/free-writing-software",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "plagiarism checker": "https://www.techradar.com/best/plagiarism-checkers",
    "Microsoft 365": "https://www.techradar.com/news/microsoft-365-is-getting-a-significant-security-boost",
    "new update": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1436275493519594000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D83788",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Word for the Web": "https://www.techradar.com/how-to/how-to-download-and-use-microsoft-word-for-free",
    "how to download and use Microsoft Word for free": "https://www.techradar.com/how-to/how-to-download-and-use-microsoft-word-for-free"
  }
}