{
  "source": "https://www.techradar.com/news/apple-self-service-repair-explained",
  "title": "Apple Self Service Repair explained: you'll soon be able to repair your own iPhone",
  "category": "phones",
  "updated": "2021-11-20T14:00:04Z",
  "author": "james-o-malley",
  "summary": "iPhone 13, iPhone 12 and more to come",
  "article": [
    "It turns out that the biggest Apple announcement this year wasn’t the iPhone 13 - or even the new supercharged MacBook Pro line-up. It was that in the not too distant future, Apple is deigning to let you repair your own iPhone - if you dare.",
    "That’s right - instead of having to take a phone with a cracked screen or a flat battery to an expensive “Apple Authorised Service Provider”, or the dodgy kiosk in the market, if you’ve got the technical skills, Apple will allow you to get your hands on the same parts, tools and instruction manuals as the professionals, for you to do it yourself.",
    "So what does it all mean? And why has Apple done it? Read on to find out.",
    "The “Self-Service Repair” programme will initially kick off with support for the iPhones 12 and iPhone 13 series, and will let us buy the same tools and parts that Apple uses to fix some of the most common problems iPhones encounter, such as broken displays, batteries and cameras.",
    "The new store will apparently feature over 200 of the most common tools and parts used to fix iPhones.",
    "Apple also says that the plan is to further expand the programme “later next year” to cover other common repairs - and to expand to cover other Apple products, such as M1-powered MacBooks.",
    "This isn’t to say that fixing your phone will be easy. You’ll still need to be technically skilled, and Apple still recommends using the traditional repair service for non-expert users.",
    "And finally, the self-service programme will only initially be available in the US - Apple says that it plans to expand it further. 2022 is when we'll start seeing it appear in other regions.",
    "The announcement of the self-service repair programme is so surprising because it seems to run counter to all of Apple’s behavior up until this point.",
    "For years, the company has received criticism from people who like to tinker with their gadgets that Apple devices are locked down and made difficult to repair. These criticisms are not without merit.",
    "Successive generations of devices have become more difficult to repair because Apple has opted to build more of its devices as fully integrated lumps of silicon, metal and plastic, instead of optimising them to allow the removal of individual components.",
    "Incidentally, the most recent MacBook Pros are slightly more repairable, but we still think they’re well behind the curve.",
    "And it isn’t just a matter of design. Apple has also vigorously lobbied governments around the world against passing laws that might require them to make the devices easier to repair. According to one Bloomberg report from earlier this year, Apple has made its way around a couple of dozen American states, urging legislators not to pass repair-friendly laws.",
    "Instead, the company has insisted that repairs be carried out by authorised dealers, who pay money to Apple for official parts and instructional guides for professionals carrying out the repairs. Apple’s argument was that unauthorised repairs can result in broken or dangerous devices, but these restrictions also mean that it is harder and more expensive to get an Apple device repaired.",
    "One particularly notorious example of Apple’s control-freakery is the infamous “Error 53” error which afflicted iPhones with fingerprint sensors. If you cracked your screen and got it replaced by a non-authorised Apple service provider, your TouchID would stop working.",
    "Essentially, it appears that Apple is scared, and has jumped before it was pushed.",
    "The company has been under pressure over its practices for some time. For a start, it is a PR headache, as making devices hard to repair appears to run counter to all of the company’s sustainability efforts, which aim to have a fully carbon neutral supply chain by 2030.",
    "Another factor that may have caused Apple to take it seriously is that even the shareholders are revolting over the issue. One shareholder, the Green Century Index Fund, even filed a shareholder proposal, aiming to force Tim Cook’s hand in improving repairability.",
    "But Apple also faces troubling headwinds more broadly, as regulators on both sides of the Atlantic are increasingly advocating for a right to repair.",
    "In the US for example, President Biden appointed Lina Khan to oversee the Federal Trade Commission. She’s a known sceptic of the power of big tech and has formally committed the agency to take on “right to repair” cases with “vigor”.",
    "And in Europe, the EU has been similarly active at pursuing the right to repair. Earlier this year, a new law came into force across Europe (including Britain as it had not left the EU when it was passed) which forces manufacturers to do things like make spare parts and instructional manuals available.",
    "As things currently stand, the European law only applies to white goods like washing machines and boilers - but the expectation is that this will eventually expand to encompass other gadgets, like, say, mobile phones and computers.",
    "So the tide is clearly starting to turn on repairs. And on top of this issue, regulators in both the US, Europe and around the world have a laundry list of other concerns about Apple’s behaviour.",
    "For example, the fact that Apple scrapes 30% off the top of every transaction in the App Store - which is much more critical to the company’s bottom line than repairs. So ultimately, perhaps this is a case of Apple trying to pick it’s battles wisely.",
    "For most of us, the new repair programme probably won’t change very much. If your phone stops working, the easiest thing to do will still be to make an appointment with the Genius Bar.",
    "But if there’s no appointments available for a week or two and you really need a working phone? Then perhaps if you’re feeling brave enough, you might just have a new option."
  ],
  "headers": {
    "3": "What's happening with Self Service Repair?",
    "8": "Why is self-service repair such a surprising announcement?",
    "15": "So why the change of heart?",
    "24": "Will I notice anything different? How will it affect me?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro",
    "iPhones 12": "https://www.techradar.com/reviews/iphone-12",
    "M1-powered MacBooks": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "they’re well behind the curve": "https://www.techradar.com/news/macbook-pro-2021-is-easier-to-repair-but-apples-still-lagging-behind-microsoft",
    "Bloomberg report": "https://www.bloomberg.com/news/articles/2021-05-20/microsoft-and-apple-wage-war-on-gadget-right-to-repair-laws",
    "Error 53": "https://www.techradar.com/news/phone-and-communications/mobile-phones/iphone-bricked-due-to-error-53-apple-has-a-fix-for-that-1315247",
    "Green Century Index Fund": "https://www.greencentury.com/green-century-shareholder-proposal-presses-apple-to-expand-access-to-repair/",
    "formally committed": "https://www.theverge.com/2021/7/21/22587331/right-to-repair-apple-iphone-ftc-lina-khan-open-meeting"
  }
}