{
  "source": "https://www.techradar.com/news/bitcoin-price-in-free-fall-billions-wiped-off-the-market",
  "title": "Bitcoin price in free fall, billions wiped off the market",
  "category": "computing",
  "updated": "2021-01-11T17:10:04Z",
  "author": "joel-khalili",
  "summary": "Has the latest Bitcoin bubble burst?",
  "article": [
    "After a period of steep growth, the price of the world’s largest and most famous cryptocurrency is in free fall.",
    "Bitcoin, which is renowned for its extreme volatility, reached new heights of $41,962 only three days ago, but has now fallen to just above the $30,000 threshold.",
    "At the time of writing, the digital currency has recorded losses of more than 20% in the last 24 hours alone, wiping circa $130 billion off the market capitalization, per CoinMarketCap data.",
    "The fall in price comes hot on the heels of a statement published by the UK Financial Conduct Authority, warning crypto investors that they could \"lose all their money\".",
    "\"Significant price volatility in cryptoassets, combined with inherent difficulties of valuing cryptoassets reliably, places consumers at high risk of losses,\" wrote the watchdog.",
    "Ever since Bitcoin arrived on the scene, a debate has raged about whether its meteoric rises in price constitute market bubbles (when the value of an asset becomes wildly over-inflated) or are actually representative of the role crypto could play in the financial ecosystem of the future.",
    "Some will speculate that today’s events demonstrate the latest Bitcoin bubble has burst. Others, however, contend that these fluctuations in price are natural and will occur frequently en route to Bitcoin’s eventual valuation.",
    "“Bitcoin often exhibits large upside swings that tend to be followed by corrections. This is a normal behaviour for a new technology in the early stage of its adoption curve,” said Antoly Crachilov, CEO of asset management firm Nickel Digital.",
    "“Only professional investors with a long-term view on the underlying technology should have exposure to this asset class. They also need high-risk tolerance levels and, importantly, never lose sight of the forest for the trees.”",
    "The issue, however, is that the volatility of cryptocurrencies such as Bitcoin is bound to pique the interest of retail investors too, whose ability to absorb considerable losses pales in comparison to their institutional counterparts.",
    "Most famously, after reaching highs of $19,783.21 in December 2017, Bitcoin plummeted to below $8,000 within just two months. Investors that came in at the peak saw 60% of the value of their investment wiped out.",
    "The same will likely have happened to many investors that believed the $40,000+ milestone of a few days prior was just the next stop on the road to much loftier valuations."
  ],
  "headers": {
    "5": "Bitcoin price"
  },
  "links": {
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "new heights": "https://www.techradar.com/news/bitcoin-price-breaks-dollar40000-for-the-first-time-doubles-in-a-month",
    "CoinMarketCap data": "https://coinmarketcap.com/currencies/bitcoin/",
    "wrote the watchdog": "https://www.fca.org.uk/news/news-stories/fca-warns-consumers-risks-investments-advertising-high-returns-based-cryptoassets"
  }
}