{
  "source": "https://www.techradar.com/news/sony-takes-on-dolby-atmos-with-live-spatial-audio-concerts-for-your-smartphone",
  "title": "Sony takes on Dolby Atmos with live spatial audio concerts for your smartphone",
  "category": "audio-visual",
  "updated": "2021-07-15T11:36:35Z",
  "author": "nick-pino",
  "summary": "Artist Connection will offer 360 Reality Audio videos on iOS and Android",
  "article": [
    "Sony wants to help the concert-going crowd cope with Covid-19 by expanding its 360 Reality Audio support with live concerts and music videos.",
    "Hosting the content is an app called Artist Connection that has been out for a few years now but Sony has only just begun to use it as a video streaming service for live performances.",
    "The first 360 Reality Audio act to go live will be a performance by Zara Larsson that will release on January 11 at 5:00 PM EST - the same time as Sony’s CES 2021 keynote. The event will be free for viewers but if you can't wait that long Artist Connection is currently offering a free playlist of other 360 Reality Audio tracks for you to test out how it sounds with your headphones or Bluetooth speaker.",
    "Sony says it’s working with other major music labels and service providers to begin streaming this new video content later this year - but for now the Zara Larsson performance will be the only 360 Reality Audio video on there.",
    "While the audio community has largely adopted spatial audio - especially Dolby Atmos - it hasn’t quite taken to Sony’s 360 Reality Audio platform with as much enthusiasm.",
    "That’s a shame considering that the format is compatible with one of the best headphones from last year, the Sony WH-1000XM4, but makes sense considering how little marketing it has behind it.",
    "There’s no doubt that 360 Reality Audio is going to need to go on more platforms before it catches on with the audio community, but any additional streaming service is a good step forward for the service that has, thus far, has remained in Atmos’ shadow."
  ],
  "headers": {
    "4": "360 Reality Audio really, really needs this"
  },
  "links": {
    "360 Reality Audio": "https://www.techradar.com/news/first-look-sony-360-reality-audio",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Dolby Atmos": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones"
  }
}