{
  "source": "https://www.techradar.com/news/heres-how-disneys-rumored-retractable-star-wars-lightsaber-could-work",
  "title": "Here's how Disney's rumored retractable Star Wars lightsaber could work",
  "category": "entertainment",
  "updated": "2021-04-14T09:24:18Z",
  "author": "tom-power",
  "summary": "Don't expect this Star Wars lightsaber to cut through metal though",
  "article": [
    "Ask any Star Wars fan if they'd love to own a functional lightsaber one day, and you'll be greeted by an emphatic \"yes!\" straight away.",
    "Yes, wielding a weapon that can cut through any material, apart from another lightsaber, would be dangerous, but it seems that we've moved a step closer to this reality. Not from a 'cutting everything in your path' perspective, but from a real, functioning lightsaber.",
    "If you haven't kept up with the latest Star Wars news, fans of a galaxy far, far away collectively lost their mind last week after Disney reportedly showed off a working lightsaber. According to multiple reports, including Collider and IGN, Disney showed off its new creation during a \"Special Look Inside Disney Parks\" press conference.",
    "Attendees at that press conference, such as Carlye Wisel, Disney Parks chairman Josh D'Amaro, revealed the functioning lightsaber in the final moments of the presentation and confirmed that \"it's real\".",
    "Check out Wisel's tweet below:",
    "Later that day, Nexstar employee Scott Gustin took to Twitter to post images of the lightsaber's supposed patent. The images seem to show how Disney has managed to create a retractable lightsaber using a drive train – made up of cogs and a metallic chain – as well as a motor, tensioner and blade spools inside the lightsaber's handle. The result looks like the closest thing yet to the lightsabers wielded in those many, many Star Wars movies.",
    "Check out Gustin's tweet below:",
    "Still with us? Good. In the latest functioning lightsaber news, another Star Wars fan has created some mock animations of how the device could actually work. Ben Ridout, a VR and AR developer, posted some brief animation videos of how Disney's retractable Star Wars lightsaber may work in practice.",
    "In a long Twitter thread, Ridout explained that Disney's plan might have been based on the concept of a tape measure. By using two tape measures that are revealed in unison, Ridout claims, each will support the other when extended and prevent them from bending one way or another. Ridout says that by increasing the curvature of each tape measure, they can wrap around each other in a circular fashion and create the illusion of a lightsaber blade.",
    "Ridout's whole thread is a fascinating example of how a retractable lightsaber could function. Check out his first tweet below and, if you're interested, you can read the entire thing:",
    "It's almost a certainty at this point that safe, retractable lightsabers will be sold by Disney in the not-too-distant future. If D'Amaro has shown off a working version of the iconic Star Wars weapon, you can bet that they'll be mass produced once the design is refined and works every single time it's activated.",
    "Disney already sells novelty lightsabers at its theme parks, in Disney stores and online, and they're big money makers as you'd expect. Visitors to Star Wars: Galaxy's Edge, either at Walt Disney World Resort or Disneyland Resort in the US, can even build their own lightsaber. However, these collectibles don't feature retractable blades, which is clearly the next step in producing convincing lightsaber replicas.",
    "If Disney has already made such a device, we know that they'll sell extremely well whenever they're made available to the public. As we said earlier, Star Wars fans – us included – would love nothing more than to own a lightsaber that actually has a retractable blade.",
    "Press conference attendees were told not to release any photograph or video evidence of the working lightsaber when D'Amaro showed it off. Hopefully, though, it won't be long before Disney reveals this device to the public."
  ],
  "headers": {
    "10": "Disney's retractable Star Wars lightsaber would be a money maker"
  },
  "links": {
    "Collider": "https://collider.com/disney-star-wars-working-lightsaber/",
    "IGN": "https://www.ign.com/articles/disney-parks-chairman-has-teased-a-realistic-retractable-lightsaber",
    "Star Wars movies": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order"
  }
}