{
  "source": "https://www.techradar.com/news/nintendo-rules-out-releasing-a-nintendo-switch-pro-at-least-for-now",
  "title": "Nintendo rules out releasing a Nintendo Switch Pro, at least for now",
  "category": "gaming",
  "updated": "2021-07-19T11:29:59Z",
  "author": "adam-vjestica",
  "summary": "A rare public comment from the company addresses some rumors",
  "article": [
    "To many people’s surprise, Nintendo has taken to Twitter to publicly reiterate that it has \"no plans\" to release another Switch model at this time, as rumors of a Nintendo Switch Pro refuse to fade away.",
    "The conversation around whether Nintendo will ever release a more capable version of its popular hybrid console reignited recently due to Valve’s announcement of the Steam Deck. A portable PC with a Switch-like form factor, the Steam Deck is technically superior to Nintendo’s console in practically every department, which has led to more speculation, and demand, that Nintendo release a more powerful Switch console.",
    "Nintendo, who rarely comments on rumors, first addressed Bloomberg’s report that suggested that the Nintendo Switch OLED costs Nintendo around $10 more to manufacture, which would result in a higher profit margin on every unit sold. Nintendo’s investor relations Twitter account said: \"A news report on July 15, 2021(JST) claimed that the profit margin of the Nintendo Switch (OLED Model) would increase compared to the Nintendo Switch. To ensure correct understanding among our investors and customers, we want to make clear that the claim is incorrect.\"",
    "In regards to the Nintendo Switch Pro, Nintendo also took the opportunity to pour cold water over speculation that it still has plans to release a new Switch model. However, it does caveat its statement by saying \"at this time.\"",
    "\"We also want to clarify that we just announced that Nintendo Switch (OLED Model) will launch in October, 2021, and have no plans for launching any other model at this time,\" Nintendo said.",
    "Bloomberg previously consulted Tokyo-based games industry analyst Serkan Toto regarding the new Switch OLED, and whether it means a Switch Pro now would no longer be released. Toto’s assessment of Nintendo’s new console was an interesting one, as he believes the Switch OLED might just be a \"dummy upgrade.\"",
    "\"This new Switch looks more like an interim model than a real upgrade to me,\" Toto told Bloomberg. \"This might just be a dummy upgrade until Breath Of The Wild 2 is ready and the component shortage is over next year.\" Nintendo, it seems, has moved to quash this idea.",
    "The Nintendo Switch OLED announcement was met with disappointment by a large number of gamers due to the fact it isn’t capable of displaying 4K resolution when docked. Nintendo also chose not to make any improvements to the system’s core components, which means performance remains the same, as does battery life.",
    "While the addition of a larger, OLED display is certainly welcome, the benefits of the Switch OLED will only be apparent in handheld mode. The redesigned kickstand, enhanced speakers and OLED screen won’t be accessible when docked, but at least the system doubles the internal storage of the original Switch.",
    "Nintendo Switch OLED releases on October 9, 2021, while the Steam Deck will arrive sometime in December 2021 for those who managed to get their reservations in early."
  ],
  "headers": {
    "7": "Bit of OLED down"
  },
  "links": {
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Nintendo Switch OLED": "https://www.techradar.com/news/nintendo-switch-oled-release-date-price-specs-and-everything-you-need-to-know/news/nintendo-switch-oled-release-date-price-specs-and-everything-you-need-to-know",
    "Nintendo around $10 more to manufacture": "https://www.techradar.com/news/nintendo-switch-oled-reportedly-costs-nintendo-dollar10-more-to-make-but-costs-you-dollar50-more-to-buy",
    "Nintendo’s investor relations Twitter account": "https://twitter.com/NintendoCoLtd",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-07-06/nintendo-unveils-new-switch-with-oled-screen-for-350",
    "Breath Of The Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd"
  }
}