{
  "source": "https://www.techradar.com/news/star-wars-andor-series-reportedly-casts-two-more-rogue-one-stars",
  "title": "Star Wars: Andor series reportedly casts two more Rogue One stars",
  "category": "entertainment",
  "updated": "2021-06-11T09:19:10Z",
  "author": "samuel-roberts",
  "summary": "Will Forest Whitaker appear?",
  "article": [
    "While the production timeline of The Mandalorian season 3 seems slightly hard to nail down at the moment, two more Star Wars shows are in the thick of production – Andor and Obi-Wan Kenobi, the former of which is confirmed for 2022, and the latter of which is expected then too.",
    "Now, actor Stellan Skarsgård has apparently told Swedish radio that he's played scenes opposite Rogue One actor Forest Whitaker – known in the Star Wars universe as Saw Gerrera, who has not been officially confirmed to be part of this show's cast. That's per r/StarWarsLeaks, where user 'aprentize' says that Skarsgård mentions he's had at least two very good scenes with Whitaker, though most of his scenes are with Diego Luna's titular character.",
    "Confession time: we don't speak Swedish, so we're taking their word for it, but the actor does indeed discuss Whitaker at the 12-minute mark, after mentioning Luna – this is in response to a question about working on the Andor series.",
    "This casting would make sense. Andor is set five years before the events of Rogue One, and Gerrera has a long history in the Rebel Alliance, that's been depicted in the likes of Star Wars: Rebels and the video game Jedi Fallen Order. Whitaker even reprised his role as the character for that last project.",
    "Elsewhere, The Direct says its sources have confirmed that Rogue One villain Orson Krennic (played by actor Ben Mendelsohn) will also appear in the show. That doesn't seem out of the realms of possibility either – Mendelsohn is preparing to play Skrull leader Talos again in Marvel's Secret Invasion, another future Disney Plus series.",
    "Still, treat that one as rumor for now.",
    "A few other Rogue One cast members have been rumored to show up in this new series, but the only confirmed returning co-star so far is Genevieve O’Reilly – she played Mon Mothma in both that film, and appeared briefly in Revenge of the Sith.",
    "Here's a behind-the-scenes video on Andor from last year, if you need a refresher of what's going on in the show."
  ],
  "headers": {
    "4": "Who else could be joining the Andor cast?"
  },
  "links": {
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Obi-Wan Kenobi": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "Swedish radio": "https://sverigesradio.se/avsnitt/1744726",
    "r/StarWarsLeaks": "https://www.reddit.com/r/StarWarsLeaks/comments/nwo4sl/stellan_skarsg%C3%A5rd_shares_juicy_scene_with_forrest/",
    "Jedi Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "The Direct": "https://thedirect.com/article/star-wars-rogue-one-ben-mendelsohn-cassian-andor-disney-plus-exclusive"
  }
}