{
  "source": "https://www.techradar.com/news/vpn-usage-saw-major-spike-last-year-heres-why",
  "title": "VPN usage saw major spike last year - here's why",
  "category": "computing",
  "updated": "2021-02-08T17:50:11Z",
  "author": "anthony-spadafora",
  "summary": "Lockdowns and the proposed TikTok ban caused consumer interest in VPNs to surge",
  "article": [
    "Consumer interest in VPN services saw a huge spike last year as users grew increasingly concerned about apps like TikTok being banned as well as securing their data while working from home during lockdown.",
    "While people use VPNs in order to bypass government restrictions, secure their home networks and hide their online activities from ISPs, new research from Security.org has revealed major news events from 2020 had a direct correlation with interest in VPN services.",
    "The data on consumer interest levels used in the report came from NordVPN while the findings on US consumer usage data came from a study from Security.org. To measure increased consumer demand for VPNs, the organization looked at web traffic for a particular day and then compared this data to the average of a week prior to that date.",
    "One example of a news story that led to a spike in searches for VPNs occurred when it was announced that the 2020 Tokyo Olympics would be postponed. At that time, there was a 78 percent increase in consumer VPN interest as users began securing their home networks ahead of the possibility of stay-at-home orders.",
    "Digital privacy expert at NordVPN, Daniel Marksuon provided further insight on how news events influenced VPN adoption in a blog post, saying:",
    "“When the Olympics were canceled and the cruise ship got quarantined, people must have realized that the virus began to spread. They saw how cities in China got locked down and rushed to acquire protection tools that would help them to continue with their life and work at home in the most secure way possible.”",
    "Another event that piqued consumer interest in VPNs occurred last August when President Trump announced that the social media app TikTok would be banned by the US government. This announcement led to a 74 percent increase in interest in VPNs and then on September 20 when the ban was scheduled to go into effect, VPN interest further surged by 34 percent.",
    "Although were only a month into 2021, consumer interest in VPN services is likely to remain high as the pandemic continues and governments around the world look to crack down on certain sites and services.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Increased interest in VPNs"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "study": "https://www.security.org/resources/vpn-consumer-report-annual/",
    "2020 Tokyo Olympics": "https://www.techradar.com/news/tokyo-olympics-dates-delayed",
    "blog post": "https://www.security.org/vpn/vpn-usage-spiked/",
    "TikTok would be banned": "https://www.techradar.com/news/tiktok-will-be-banned-from-the-us-app-store-and-play-store-this-weekend",
    "ZDNet": "https://www.zdnet.com/article/government-censorship-threats-over-tiktok-spiked-interest-in-vpns/"
  }
}