{
  "source": "https://www.techradar.com/news/how-to-watch-american-music-awards-2021-and-stream-amas-online-from-anywhere",
  "title": "How to watch American Music Awards 2021 and stream AMAs online from anywhere",
  "category": "computing",
  "updated": "2021-11-21T21:39:26Z",
  "author": "aatif-sulleyman",
  "summary": "Cardi B on hosting duties promises pure pandemonium",
  "article": [
    "As if the American Music Awards weren't enough of a draw already, they've only gone and put Cardi B on hosting duties! It's going to be anything but an okurrr evening, so read on as we explain how to watch a 2021 American Music Awards stream from anywhere in the world you are - including absolutely free.",
    "The five-time AMAs award-winning rapper is as famous for her outrageous persona as she is for her music, and to describe her hosting debut as must-watch would be an understatement.",
    "This is going to get weird and wild and we wouldn't be surprised if the awards took a fairly distant back seat.",
    "The winners are decided by the public, which means the AMAs always give the truest reflection of what ordinary people are listening to. In the running for the night's top honor - the artist of the year award - are megastars Ariana Grande, BTS, Drake, Olivia Rodrigo, Taylor Swift and The Weeknd, some of who will also be performing at the ceremony in LA.",
    "It's shaping up to be a night that will live long in the memory, so scroll down for all the ways to watch an American Music Awards stream.",
    "Keep scrolling if you want to know your viewing options in the Canada and Australia - it's absolutely FREE Down Under - but we're afraid there's worse news in the UK...",
    "But it's worth noting that if you're abroad right now and were hoping to watch your home coverage on your laptop or mobile, it will inevitably be geo-blocked. Annoying but this is easily fixed, with a VPN you can change your IP address to a location back in your own hometown or country that will then allow you to stream the event as if you were sat back at home.",
    "Using a VPN is as easy as one-two-three...",
    "1. Download and install a VPN - as we say, our top choice is ExpressVPN",
    "2. Connect to the appropriate server location - open the VPN app, hit 'choose location' and select the appropriate location",
    "3. Go to the broadcaster's stream - head to your home broadcaster's site or app and watch as if you were at home - so that's ABC if you're from the US and 10Play for Aussies",
    "We've trawled through the TV listings in the UK, and unfortunately it doesn't look like the 2021 American Music Awards are being shown in Blighty.",
    "That means that the only way we can think of to live stream 2021 AMAs in the UK is to grab the best streaming VPN you can and head to the site of a broadcaster from another country that is showing it."
  ],
  "headers": {
    "5": "How to watch AMAs stream from outside your country",
    "11": "Can you watch 2021 American Music Awards in the UK?"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "so that's ABC": "https://abc.go.com/watch-live",
    "10Play for Aussies": "https://tenplay.com.au/",
    "best streaming VPN": "https://www.techradar.com/vpn/the-best-vpn-for-streaming"
  }
}