{
  "source": "https://www.techradar.com/news/this-high-tech-swimsuit-boosts-speed-by-replicating-the-texture-of-a-whales-belly",
  "title": "This high-tech swimsuit boosts speed by replicating the texture of a whale's belly",
  "category": "fitness",
  "updated": "2021-06-29T08:53:34Z",
  "author": "cat-ellis",
  "summary": "The Speedo Fastskin 4.0 is unusual, to say the least",
  "article": [
    "Speedo has revealed an 'intelligent' swimsuit that's custom 3D-printed for the wearer, and uses customizable compression, adaptive buoyancy, and even textures inspired by the underbelly of a whale to help improve times in the water.",
    "The Fastskin 4.0 is only a concept for now (and a pretty outlandish one at that), but some of its individual design components could definitely become part of competition swimwear in the future.",
    "Some of the suit's more extreme features include AI to monitor athletes' vital statistics and provide coaching mid-race, plus an exoskeleton to enhance muscular power in the pool.",
    "Speedo suggests that together, the suit's technologies could help the men's freestyle record break the 20 second barrier, and the women's 100m breaststroke time drop below 60 seconds.",
    "That isn't likely to happen at this year's Tokyo Olympics, though. The rules for Olympic level swimwear are pretty strict. For pool swimming at temperatures above 18C, swimsuits for men must not extend above the navel or below the knee, and women's suits must not cover the neck, or go past the shoulder or knee. The material must be 'regular and flat' (which might rule out whale bellies) and must not have a buoyancy effect above 0.5 Newtons.",
    "Exoskeletons aren't mentioned specifically, but it seems safe to say that they wouldn't get the seal of approval, either.",
    "However, custom 3D printing is a definite possibility for competitive swimwear, as is the use of recycled material. The Olympic Games has been making a push for sustainability in recent years; medals for the Tokyo Games have been made using scrap smartphones, and Asics released a line of official sportswear for the Games that includes running shoes made from tons of waste clothing gathered in Japan.",
    "For the time being, Speedo's LZR Pure Intent and LZR Pure Valor racing swimsuits do offer one feature from the Fastskin 4.0: fabric based on research into shark scales. The suits are due to be worn by some of the world's best swimmers at the Tokyo Olympics, so perhaps the whale belly idea isn't so far fetched after all."
  ],
  "headers": {
    "4": "Taking the plunge"
  },
  "links": {
    "The rules for Olympic level swimwear": "https://www.fina.org/swimming/approved-swimwear",
    "medals for the Tokyo Games": "https://www.techradar.com/news/the-2020-olympic-medals-will-be-made-using-old-smartphones",
    "running shoes": "https://www.techradar.com/best/best-running-shoes",
    "tons of waste clothing": "https://www.techradar.com/news/asics-turns-5-tons-of-waste-clothing-into-new-shoes"
  }
}