{
  "source": "https://www.techradar.com/news/microsoft-edge-extensions-have-been-hiding-retro-nintendo-games",
  "title": "Microsoft Edge extensions have been hiding retro Nintendo games",
  "category": "computing",
  "updated": "2021-02-15T10:58:50Z",
  "author": "jess-weatherbed",
  "summary": "Naughty web Bowser",
  "article": [
    "A selection of illegal ROMs for classic Nintendo games was discovered in a variety of Microsoft Edge extensions, with the games playable within the browser itself.",
    "Games from other publishers such as Minecraft and Pac-Man were also discovered, with evidence that these pirated titles may have been secretly concealed within Edge add-ons since October 2020.",
    "It should be noted that these games were not listed by their titles, rather, they were hidden within other extensions to presumably evade being removed. Many game emulators or publicly hosted classics are legally frowned upon (and Nintendo is especially known for being protective over its property), so the attempt to hide the pirated games isn't surprising. It hasn't been established how these games came to be concealed within hosted extensions, but they appear to have been deleted. Game Rant notes that despite the confusing legality behind these hidden classics, the official Microsoft Edge Dev Twitter account actually promoted these extensions in a now-deleted message with links to the offending extensions.",
    "\"Calling all Pac-Man, Tetris, and Mario Kart lovers,\" the tweet read. \"Did you know Microsoft Edge has these plus more vintage games on the extensions site?\"",
    "While it would have been naughty to play these concealed ROMs, there are still legal means to scratch that itch for classic games. If you own a Nintendo Switch and an active Nintendo Switch Online membership then you can download an ever-growing list of NES and SNES titles. This is a feature exclusive to online membership but the cost might be worth it for any fans of retro gaming. If you don't already own a Switch console then you can invest in an NES Classic or SNES Classic, a miniaturized version of the original console that's been preloaded with 30 classic Nintendo games. This thankfully works with an HDMI cable, so you won't need to scramble through your attic looking for an old CRT TV - but Nintendo has included a filter to provide that grainy, scan line feeling of authenticity. However you want to enjoy some Nintendo gaming classic, remain cautious with anything that isn't an officially approved product. There are many websites out there that offer emulations and ROM downloads, and you never know what viruses or malware might be concealed in these files, looking to take advantage of folk just looking to relive a childhood game.",
    "Via PC Mag"
  ],
  "headers": {
    "4": "Got that retro craving?"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "legally frowned upon": "https://www.techradar.com/news/gaming/are-game-emulators-legal-1329264",
    "Microsoft Edge Dev Twitter account": "https://twitter.com/MSEdgeDev",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "list of NES and SNES titles": "https://www.nintendo.co.uk/Nintendo-Switch-Family/Nintendo-Switch-Online/NES-Super-NES-Nintendo-Switch-Online-1374626.html",
    "NES Classic": "https://www.nintendo.com/nes-classic/",
    "SNES Classic": "https://www.nintendo.com/super-nes-classic/",
    "PC Mag": "https://uk.pcmag.com/browsers/131740/retro-nintendo-games-found-hidden-in-microsoft-edge-extensions"
  }
}