{
  "source": "https://www.techradar.com/news/wix-reports-better-than-expected-third-quarter-financials",
  "title": "Wix reports better than expected third-quarter financials",
  "category": "computing",
  "updated": "2021-11-12T04:00:44Z",
  "author": "anthony-spadafora",
  "summary": "Collections and revenue growth exceeded Wix's expectations during Q3",
  "article": [
    "Wix has managed to report better than expected financial results for the third quarter due to an increase in both collections and revenue growth.",
    "The company behind the popular website builder brought in $321m in revenue (up 26% year-over-year) as well as $373m in collections (up 33 percent year-over-year) during the third quarter that ended on September 30.",
    "Co-founder and CEO of Wix, Avishai Abrahami provided further insight in a press release on how the company was able to outperform its expectations despite a great deal of uncertainty, saying:",
    "\"Our business outperformed our expectations this quarter as we saw improvements in the business environment. Our users are still navigating a great deal of uncertainty, but we believe the impacts have lessened. Despite this volatility, we delivered outstanding results. We continue to layer on new monetization opportunities, and I have never been more excited about what we have coming down the pipeline.\"",
    "President and COO of Wix, Nir Zohar also pointed out that Wix recorded collections from several of its new B2B partnerships with the most notable being its alliance with Vistaprint announced back in August.",
    "According to Zohar, companies such as Vistaprint are increasingly approaching Wix because they know that its brand and technology platform can bring massive value to their users. The company believes that these types of B2B partnerships will deliver sustainable growth for years to come due to the “ongoing financial benefits of renewals, additional new subscriptions above and beyond the agreement, and new business solutions such as Ascend or Wix Payments”.",
    "As a result of its strong third-quarter financial results, Wix is increasing is revenue and collections guidance for the 2021 fiscal year. The company will also increase its investment in marketing during the fourth quarter due to the business improvements it has experienced.",
    "We've also featured the best web hosting, best website builder and best small business website builder"
  ],
  "headers": {
    "4": "B2B partnerships"
  },
  "links": {
    "Wix": "https://www.techradar.com/reviews/wix",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "press release": "https://www.prnewswire.com/news-releases/wix-reports-third-quarter-2021-results-301421873.html",
    "Vistaprint": "https://www.techradar.com/reviews/vistaprint-website-builder",
    "Ascend": "https://www.techradar.com/news/wix-launches-new-software-platform-for-entrepreneurs-and-smbs",
    "marketing": "https://www.techradar.com/best/best-online-marketing-services",
    "best web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "best website builder": "https://www.techradar.com/news/the-best-website-builder",
    "best small business website builder": "https://www.techradar.com/news/best-small-business-website-builders-in-2020-for-smb-sme-and-gig-operators"
  }
}