{
  "source": "https://www.techradar.com/news/the-next-5g-gaming-phone-could-come-from-a-company-you-wouldnt-expect",
  "title": "The next 5G gaming phone could come from a company you wouldn't expect",
  "category": "phones",
  "updated": "2021-07-07T08:39:12Z",
  "author": "tom-bedford",
  "summary": "Oppo's first gaming phone",
  "article": [
    "With gaming-focused smartphones being a growing niche, it makes sense that more companies would want to get in on the action, but new information suggests that the next company to get involved is one you wouldn't expect (well, unless you read the strapline of this story).",
    "As spotted by 91mobiles, Chinese phone company Oppo has had a new gaming phone certified on the website of the European Union Intellectual Property Office, and the listing also has renders of the smartphone attached.",
    "While many companies that make gaming phones, like Xiaomi or Asus, are known for their phones' emphasis on performance speeds, Oppo devices tend to be stylish camera-focused devices, so it's a bit odd that they're making a gaming handset.",
    "There's no way of knowing when this phone is coming out, or even what it'll be called, so stay tuned for more information when we get it.",
    "We can tell a few things about the phone by the renders included in the certification.",
    "The handset has four rear cameras, a USB-C port, a 3.5mm headphone jack, volume rockers and the power button on opposite edges of the device and, curiously, no visible front-facing camera.",
    "There's no indication of a pop-up camera, so it's possible this phone is meant to have an under-display snapper - or no selfie camera at all.",
    "The very fact it's a gaming phone also means some specs are all but guaranteed. It'll likely have a Qualcomm Snapdragon 888 chipset, and if not the Snapdragon 870 instead. It'll probably have a 1080p resolution display with a 120Hz or 144Hz refresh rate, a battery capacity of at least 4,500mAh, and fast charging.",
    "For solid information on the phone, we'll have to wait until it's officially announced - and we've no idea when that could be."
  ],
  "headers": {
    "4": "What do the gaming phone renders tell us?"
  },
  "links": {
    "gaming-focused smartphones": "https://www.techradar.com/news/best-phone-for-gaming",
    "91mobiles": "https://www.91mobiles.com/hub/oppo-gaming-smartphone-design-euipo/"
  }
}