{
  "source": "https://www.techradar.com/news/its-a-sin-is-the-must-watch-tv-show-for-our-times",
  "title": "It’s A Sin is the must-watch TV show for our times",
  "category": "entertainment",
  "updated": "2021-03-04T09:27:26Z",
  "author": "henry-st-leger",
  "summary": "This 80s drama is warm, frank, and exactly what we need right now",
  "article": [
    "Choosing the right TV shows to watch can be hard in the best of times – and many of us are not experiencing that right now.",
    "Especially in times of such frustration, fear, and paralysis, it can be difficult to know whether we need entertainment to comfort us, or to give us focus on the problems outside our doors.",
    "It’s a Sin is a TV show that does both.",
    "The All 4 television drama – currently dropping episodes in the UK and Australia, though also available to watch on HBO Max, as of February 18 – charts the lives of a group of friends in 80s London, at the onset of the AIDS pandemic, and how the arrival of this mystery illness slowly turns from hearsay into something all too real.",
    "You’re reading Download This, TechRadar’s new weekly guide to the must-have downloads to fill your phones, tablets, consoles and computers with. Games, eBooks, albums, apps or movies – we’ve got you covered.",
    "Starring Years & Years’ lead singer Olly Alexander as aspiring actor Ritchie Tozer, with cameos from the likes of Neil Patrick Harris and Stephen Fry, and exceptional ensemble performances, it’s a star-studded drama that still never takes attention away from the matter at hand. It’s created by Russell T Davies, the one-time showrunner of Doctor Who, and creator of Queer as Folk, Cucumber, and the hit drama Years & Years (sharing the name of Olly Alexander’s pop group, in what feels like a wonderful coincidence).",
    "It’s A Sin shows the laughter and excitement of forging a life away from home – especially homes not altogether accepting of queer youths – while never flinching from the brutality of losing a friend to an illness no-one yet understands. In-jokes and endearing nicknames carry through both good times and bad, and It's A Sin manages to display an utterly believable community, in the ways it comes together and the ways it find itself torn apart.",
    "The show’s great strength is its sense of progression, moving from care-free scenes of love and lust, to bubbling concerns about a ‘gay cancer’ – so easily dismissed by Ritchie, who memorably argues that “it’s Americans you shouldn’t sleep with. Londoners are fine!” – before reality sets in hard, as cast members become afflicted by the HIV virus.",
    "Denial is part and parcel of this reality, whether that’s young men too scared to find out their test results, lovers who feel invincible, or parents unable to accept their children for what they are. Still, the charm and heart of this drama keeps it far from misery porn territory, and you’ll find yourselves laughing, rooting, and smiling despite it all. Davies has a deft hand for diffusing tension delicately, and showing trauma openly without it feeling all-consuming.",
    "Parallels to our Covid-19 years are inevitable, given the time of release, even if there are some obvious distinctions – HIV being a sexually-transmitted disease, for one, and so notoriously moving through the gay community to the extent that AIDS (acquired immune deficiency syndrome) was initially labelled GRID (gay related immune deficiency). Covid-19, too, has been relatively free of the kind of moral panic or torrid discrimination seen in the 80s, if not free from its fair share of denial, and misinformation.",
    "Watching a TV show about another pandemic (or epidemic, as the World Health Organization technically classifies HIV as the latter), may feel like too close to home for some. But It’s A Sin is a drama that shows the realities of living, and dying, in a time of fear and uncertainty, while never losing hope – and for that, it feels absolutely necessary."
  ],
  "headers": {
    "8": "Living in uncertainty"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained"
  }
}