{
  "source": "https://www.techradar.com/news/the-next-cheap-samsung-tab-could-be-a-5g-tablet",
  "title": "The next cheap Samsung Tab could be a 5G tablet",
  "category": "phones",
  "updated": "2021-01-22T23:51:34Z",
  "author": "david-lumb",
  "summary": "Will the Samsung Tab S7 Lite have 5G?",
  "article": [
    "The next affordable Samsung Tab-series tablet could support 5G connectivity, according to a new rumor. Which model and when it will come out are still unclear, but if true, it would be one of the the first cheap 5G-capable tablets to hit the market.",
    "The tablet could be the Samsung Galaxy Tab S7 Lite or the Samsung Galaxy Tab S8e. The affordable tablet should launch in three models: WiFi-only, LTE, and 5G variants under the respective model numbers SM-T730, SM-T735, and SM-T736B / SM-T736N, according to SamMobile.",
    "There may even be another model, conceivably larger in size, which would be named the Plus or XL version, according to SamMobile. It’s unclear what kind of connectivity it would have.",
    "Samsung revealed its first 5G tablet shortly after CES 2020 – the Samsung Galaxy Tab S6 5G – before releasing the 5G-ready Samsung Galaxy Tab S7 later in the year. But the race is on for an affordable 5G tablet, and it’s unclear which affordable will be the first to market in 2021.",
    "Other contenders include an unnamed TCL 5G tablet which the brand announced at CES 2021, but didn’t reveal any details, like price or release date. Given the brand’s penchant for affordability – the TCL Tab 10s tablet introduced at the same time costs €249 (around $306 / £225 / AU$393) for its 4G LTE version – we wouldn’t expect the 5G tablet to be pricey.",
    "That leaves us wondering what other affordable Android tablets could come this year that support 5G. Given we haven’t seen an iPad that connects to the next-gen networks, we wouldn’t expect that feature to become broadly available in the more affordable tiers of Apple’s tablets; if anything, we’d anticipate the pricier iPad Air or iPad Pro slates to get 5G connectivity first. But we’ll have to wait and see what 2021 brings.",
    "Via Android Police"
  ],
  "headers": {
    "3": "The first cheap 5G tablet in 2021?"
  },
  "links": {
    "SamMobile": "https://www.sammobile.com/news/samsung-working-on-galaxy-tab-s7-lite-evidence-suggests/",
    "revealed": "https://www.techradar.com/news/sorry-ipad-samsung-galaxy-tab-s6-5g-is-the-first-5g-tablet",
    "unnamed": "https://www.techradar.com/news/tcls-color-e-ink-like-tablet-heads-mobile-push-during-ces-2021",
    "Android Police": "https://www.androidpolice.com/2021/01/22/samsungs-next-lite-tablet-could-have-5g-and-come-in-two-sizes/"
  }
}