{
  "source": "https://www.techradar.com/news/ratchet-and-clank-was-brilliant-but-whats-next-for-ps5",
  "title": "Ratchet and Clank was brilliant but what's next for PS5?",
  "category": "gaming",
  "updated": "2021-06-26T21:28:59Z",
  "author": "samuel-tolbert",
  "summary": "Opinion: Insomniac Games delivered, so who is next?",
  "article": [
    "With E3 2021 firmly in the rearview mirror, I recently finished Insomniac Games' sleek Ratchet and Clank: Rift Apart. It's a great game, one I can easily see myself replaying and a great new bar for the series to be held to. It's also left me wondering what's next for the PS5.",
    "Right now, Sony has three big titles currently announced from PlayStation Studios, including the next God of War game, widely referred to as (but not yet officially titled) God of War Ragnarok, alongside Polyphony Digital's Gran Turismo 7 and Guerrilla Games' Horizon Forbidden West. All three of these games are coming to the PS4 as well as the PS5, with a planned release window of sometime in 2022.",
    "Sony has also inked a couple of timed exclusive deals, with PS5 console exclusives in the form of Deathloop, Ghostwire: Tokyo, Forspoken and Final Fantasy XVI all seemingly slated for the next year and some change.",
    "Before I continue, I want to make it very clear: I've got faith in the teams at Guerrilla Games and Sony Santa Monica. Horizon Zero Dawn was a great game and such a change from the studio's prior works, while the 2018 God of War is one of my favorite experiences of all time and I played it through beginning to end on a base PS4. No matter what the hardware is, I know these teams can deliver more incredible games.",
    "So yes, I'm sure these next few titles will be great but I don't think it's unfair to mourn what could have been. Horizon Forbidden West is tentatively releasing this holiday but could slip to next year. Meanwhile, the next God of War has officially been delayed to 2022. Assuming for a moment that both games hit next year, the PS5 will be under two years old, while the PS4 will be over nine years old. At some point, on some technical level, these games are going to be held back.",
    "A major part of travel in God of War is how Kratos and Atreus navigate through some of the iconic Nine Realms straight from Norse myth, such as Muspelheim, Alfheim and at last, Jotunheim. Traversing between these realms is a slow, deliberate action that fits the pacing of the story.",
    "Glancing over at Ratchet and Clank: Rift Apart, which uses the speed of the PS5's SSD to allow instant transportation between dimensions, loading entirely new areas in a second or two, I simply can't help but wonder what these new adventures could've been if they wasn't tethered to the older hardware.",
    "That's not to say they won't take advantage of the PS5. I'm sure the load times will be borderline nonexistent on the current-generation versions, while the different weapons like the Leviathan Axe and Aloy's bow can use the DualSense haptic feedback and adaptive triggers in unique ways.",
    "Imagine having Kratos fighting other gods such Thor or Odin, a fight that sprawls out into multiple powerful beings punching each other between realms and across vast distances. The scale or distance traversed through fights are no longer a technical issue, allowing the developers to be fully unleashed. Even on a much more simple level, load times of long hallways and slowly climbing up rocks crags could be removed entirely. Meanwhile, we could've seen Horizon Forbidden West incorporate flying or co-op play, features Guerrilla explicitly stated were cut from the original game due to hardware limitations.",
    "So just when will we see these teams fully let loose with the PS5? Time will tell but big, expensive games generally take at least three years to develop, if not more with the lingering effects of the pandemic. Even with the credible rumors of second teams at Guerrilla and Santa Monica working on new projects, realistically we'll probably be waiting until 2024 to see just what these hallmark studios can do when they aren't shackled to the PS4. That wait could extend into 2026 specifically for whatever is in store for God of War and Horizon after these two upcoming entries.",
    "Who, realistically, is providing the next big PS5-only title? Insomniac Games has a proven track record of efficiency. Maybe we'll see Marvel's Spider-Man 2 at some point in 2023, arriving only on the PS5?",
    "London Studio is quietly chugging away at a PS5 game and Sucker Punch Productions will absolutely be making a sequel to the hit Ghost of Tsushima, though if recent rumors are true, that latter game might be further out then expected, with a smaller standalone adventure returning us to the islands of Japan in the near future. Naughty Dog's next singleplayer adventure is years off, though the long-anticipated Factions and recently-rumored remake of The Last Of Us should both be arriving soon.",
    "Time will tell and I hope we find out quite soon."
  ],
  "headers": {},
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "PlayStation Studios": "https://www.androidcentral.com/everything-sony-worldwide-studios-working",
    "God of War Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense haptic feedback and adaptive triggers": "https://www.androidcentral.com/list-ps5-games-dualsense-haptic-feedback-adaptive-triggers"
  }
}