{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-7-big-differences-that-improve-the-movie",
  "title": "Zack Snyder's Justice League: 7 big differences that improve the movie",
  "category": "entertainment",
  "updated": "2021-03-19T16:33:08Z",
  "author": "samuel-roberts",
  "summary": "Big spoilers follow",
  "article": [
    "Spoilers for Zack Snyder's Justice League follow.",
    "No one will look at Zack Snyder's Justice League and argue it doesn't feel like his film. This four-hour movie definitely feels like one for the director's fans, first and foremost – and watching it as a regular viewer can be hard work. You even suspect that, had Snyder tried to slice an hour out of his film, he might've come up with something that better balances Justice League's long-winded and pretentious character work with its more entertaining set pieces.",
    "Anyway, even if you only vaguely remember the original, terrible cut, there are some clear ways in which it's been improved. Ultimately, the Snyder Cut has been a net gain for one of the weirdest and most disappointing superhero movies of the past five years – even if it's not a slam dunk by itself. This is a true sequel to Batman v Superman, for better and worse.",
    "Here are seven differences in the film that actually make it a better viewing experience overall. Spoilers for Zack Snyder's Justice League follow.",
    "Zack Snyder's greater attention afforded to Cyborg is a big positive for the new cut. He's still a dour figure, but his transformation and strained relationship with his father gets way more attention in this cut. Indeed, Silas Stone, his father, is subjected to a different fate in Snyder's edition – which is a wise choice that gives the film a nice injection of character drama. Ray Fisher gets a lot more screen time, which he'll no doubt be happy with.",
    "Danny Elfman's typically jaunty score is one of the many tonally jarring issues with the theatrical cut of Justice League. It's an issue alleviated by having Batman v Superman's Tom Holkenborg score Snyder's version of the film – in essence making it feel more like a true sequel to the 2016 movie. In some scenes, you really notice it: particularly when Diana stops a group of terrorists in London near the start of the film. Clearly, Elfman's score combined with the reshoots felt like they were fighting Snyder's vision for the movie rather than helping it. This cut fixes that.",
    "The end set piece to this film where the Justice League stops Steppenwolf actually feels like a set piece – it felt like a truncated, hastily thrown together last battle in the theatrical version. Here, we'd argue it's the greatest addition to Snyder's movie by a long way.",
    "As well as trading the red color palette of the theatrical cut for a nicer-looking dark sky, it actually manages to end the film with the kind of big hero moment the original cut desperately needed: Barry Allen travels back in time to undo Steppenwolf's effort to complete the Unity, where he merged the three Mother Boxes to ravage the Earth. That said, the appearance of a badly-rendered Darkseid in the background through a portal didn't do much for us.",
    "You can tell that the reshoots for Justice League were designed to put a jolly edge on Superman's return – putting him in his original red-and-blue suit, rather than the shots in the black suit that Snyder had filmed, and having him crack wise with the other characters. But there was really nothing wrong with Snyder's version of the Man of Steel's return, based on what we see here: he comes back to life, hugs Lois Lane and his mom then beats the crap out of Steppenwolf in his cool new costume. What's not to like?",
    "One of the most noticeable changes in this cut comes in the film's flashback scene, which establishes the lore of the Mother Boxes that are at the center of the film's plot. Instead of Steppenwolf coming to Earth in search of them as was the case in the theatrical cut, in Snyder's version it's the DC villain Darkseid performing the same role.",
    "There are numerous small edits to this scene that make the pace of it feel different – but a massive change comes in the wraparound scenes, where Diana is telling the Bruce the story of the Mother Boxes. The theatrical cut featured a fairly ugly-looking and badly-written scene by a lake, clearly a reshoot designed to speed the story along. That, combined with many other scenes, is restored to its original version here, which is most welcome. Generally speaking, Snyder has made a gorgeous-looking movie, and a noticeably better-looking one than the 2017 version – barring a few disappointing visual effects.",
    "One of the bizarre casualties of the 2017 version, Ezra Miller's Flash gets introduced in this version with a scene that shows Barry Allen applying for a job at a pet store. Mid-interview, Barry saves Iris West (Kiersey Clemons) from a car accident – Clemons will reappear with Miller in the Flashpoint movie. This scene does so much to give you a sense of Barry Allen's humanity, that you'll wonder why Warner Bros ever thought it was a good idea to cut it. You also get one of the funniest Flash moments in the film within this sequence.",
    "That said, if there was one major strength to Joss Whedon's reshoots for this film, it's that his lines for The Flash were generally pretty funny – something we're certain Snyder's diehard fans would contest. Barry's line about pushing people then running away is gone, obviously. We quite liked it.",
    "Is there a plot reason that JK Simmons' Jim Gordon needed to be in Zack Snyder's Justice League? Not really. But if you ever felt a little bereft that you missed out on Ben Affleck's self-directed version of The Batman, which was eventually swapped out for an entirely different film featuring Robert Pattinson, the amount of extra Batfleck-themed content in this cut is something of a treat.",
    "Alongside two scenes of Simmons' Gordon, you get more of Jeremy Irons' excellent Alfred than you did before – an extremely talky, different take on the character to Michael Caine's version in the Dark Knight.",
    "Then, of course, you have the epilogue to this film, which references Harley Quinn, Robin and features the first face-to-face meeting of Jared Leto's Joker and Ben Affleck's Batman on-screen. While this scene didn't exactly dazzle us, mostly because of the clunky dialogue, it's certainly a missing piece in the DC Extended Universe that Snyder has worked hard to give you."
  ],
  "headers": {
    "4": "1. More Cyborg",
    "5": "2. A far better soundtrack",
    "6": "3. A stronger final battle",
    "8": "4. The return of Superman is tons better",
    "9": "5. It's a much nicer-looking film",
    "11": "6. The restored Flash scene is essential",
    "13": "7. You get much more of Batman's universe"
  },
  "links": {
    "Zack Snyder's Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "a fairly ugly-looking and badly-written scene": "https://www.youtube.com/watch?v=59pGuEURNMo&ab_channel=FlashbackFM",
    "Barry's line about pushing people then running away": "https://www.youtube.com/watch?v=sC-WzFHN2b0&ab_channel=MukeshNegi"
  }
}