{
  "source": "https://www.techradar.com/news/friends-the-reunion-is-little-more-than-a-fancy-dvd-extra-but-maybe-thats-enough",
  "title": "Friends: The Reunion is little more than a fancy DVD extra – but maybe that's enough",
  "category": "entertainment",
  "updated": "2021-05-27T11:33:41Z",
  "author": "samuel-roberts",
  "summary": "Opinion: It's not much, but it might be enough for Friends fans",
  "article": [
    "What's your relationship with Friends? When I was a teenager growing up in the UK, it was the show that everyone watched. It aired on Fridays, and on the following Monday, everyone at school talked about what just happened right up until its final episode in 2004. It was then repeated every single day, non-stop, for years afterwards in Britain (and still is). No US TV import has ever had the same pervasive cultural impact.",
    "Years later, it remains a hot property on streaming services, despite a volley of op-eds pointing out how much Ross sucked, or how certain creative choices don't stand the test of time. I still know people who watch Friends pretty much constantly, even if I've personally done my best to avoid the show over the past decade, simply because I wasted so many hours of my teenage years rewatching it over and over again.",
    "The fact is, Friends was a monocultural event, the likes of which we don't really see any more in an age of splintered viewing habits. Friends: The Reunion, despite being delayed a year from its intended release date with HBO Max's launch back in May 2020, is a big deal – but it's possibly been overhyped. HBO Max always made it clear that this was going to be an unscripted reunion in the run-up to its production, and not a revival of the show. But if you didn't know that, this slight package of cast interviews and other assorted ephemera might feel a little disappointing.",
    "The special is hosted by talk show man James Corden, and mixes footage of the six main actors in the present day hanging out on the set, interspersed with new on-the-couch interviews and celebrity cameos. Some of these guests like Tom Selleck and Reese Witherspoon appeared in the show, so they're pretty welcome, but others are way more frivolous and unnecessary.",
    "On top of that, you get a brief quiz hosted by David Schwimmer for the other cast members, and see snippets of the actors reenacting old episodes in the present day. The cast is probed about on-set romances behind the scenes, Lady Gaga plays 'Smelly Cat' on guitar with Lisa Kudrow, and we even learn about the time Matt LeBlanc dislocated his shoulder midway through filming a scene, with dramatic music to try and make it seem like a big deal decades later.",
    "The Friends Reunion is a lot closer to being a clip show than it probably should be, but it is mostly enjoyable to watch. Some parts, like the cast discussing whether they've actually seen every episode or not, are actually insightful and tell you a little bit about how they see themselves as performers. Other sections mostly amount to someone going, 'remember how funny this moment was?'",
    "For a series like Friends, which is a comfort food-style sitcom that was a memorable but superficial pop culture phenomenon, this reunion is arguably as in-depth as it needs to be. If your relationship with Friends is fairly transient and you just enjoy it without thinking about it that much, this is perfectly adequate background fodder. Still, the idea of subscribing to HBO Max just for this, for $14.99, is a little ludicrous. It's what would've counted for a DVD extra about 17 years ago, only with higher production values.",
    "The problem is, the special has around an hour of stuff you actually want to see involving the cast, interspersed with filler you could live without. That bulks it out to an overly long 104 minutes, which feels unnecessary.",
    "One particularly pointless section features fans from around the world telling viewers what the show meant to them. Hey, it's nice that you like Friends so much, and that it's affected you profoundly – but can't you just keep that to Twitter or your blog like everyone else? The same goes for some of the show's celebrity fans. Astonishingly handsome though David Beckham remains, watching the retired soccer player discuss his favorite Friends episodes is far from the most compelling part of this special.",
    "It's worth keeping your expectations in check, basically. In this special, Lisa Kudrow makes the point that the show tied things up very neatly with its season 10 finale in 2004, and that telling any further stories would only unravel that – which is arguably a fair point that the creators stand by.",
    "But when you compare this Friends reunion to more recent sitcom revivals, like Will and Grace or Roseanne, it's as lean an offering as they could really get away with. Even compared to the elaborate DVD extras that fellow '90s sitcom hit Seinfeld had, which offered insights on every episode from the cast and creators, this is pretty paper-thin.",
    "Again, though, maybe for Friends fans, the bar doesn't need to be set that high. Perhaps some talking heads recalling how the show was created, and watching the cast relive the most well-remembered episodes and scenes is actually enough. The Friends reunion might seem slight in an age of recap podcasts, deep pop culture analysis and granular offerings like Spotify's fantastic An Oral History of The Office series, but Friends wasn't as dense a show. It's a product of its time – maybe this says everything that needs to be said about it.",
    "Now: when's the Joey reunion happening?",
    "Friends: The Reunion is streaming on HBO Max in the US now, and is available on Sky and Now in the UK."
  ],
  "headers": {
    "3": "The One With Pointless Celebrity Cameos",
    "9": "Is this what Friends fans deserve?"
  },
  "links": {
    "An Oral History of The Office": "https://www.techradar.com/news/why-the-office-is-still-a-massive-netflix-hit-15-years-after-it-started"
  }
}