{
  "source": "https://www.techradar.com/news/iphone-12-in-purple",
  "title": "Purple iPhone 12: we've got the new color phone, and here's what it looks like",
  "category": "phones",
  "updated": "2021-04-22T15:32:30Z",
  "author": "james-peckham",
  "summary": "We've got the new purple iPhone 12",
  "article": [
    "Apple surprised us at the iPad Pro 2021 launch with a brand new color for the iPhone 12 and iPhone 12 mini. That handset may now be six months old, but it doesn't mean we can't see a new color option introduced.",
    "You're able to pre-order the new purple shade of the handset now with it landing on April 23. But you'll want to see what it looks like before you part with any of your money, right?",
    "Apple has released a variety of photos through its website, but we've now got the new iPhone 12 in purple in our test labs so we wanted to show you how it looks in a real life environment. Take a look at some of the photos below:",
    "The shade is a touch lighter than some of the press shots we've seen previously, and our writer who has the handset describes it as a lavender look rather than a bold purple color associated with the start of the FedEx logo and Cadbury chocolate.",
    "The new shade joins white, black, blue, green and red from the initial launch of the two iPhone 12 models. This won't be a color option on either the iPhone 12 Pro or iPhone 12 Pro Max, or at least Apple hasn't revealed it for those models yet.",
    "This isn't a bold shade like the red iPhone 12 or the colors we saw on the iPhone 5C back in 2013, but instead it's a more pastel look similar to the green and blue shades we've seen on the other iPhone 12 models.",
    "You'll get a purple lock screen by default if you opt for this handset as well. Otherwise, the look and feel of the handset is the same as other models you've been able to previously buy.",
    "You can pre-order the new purple iPhone 12 and iPhone 12 mini on Apple's official website, and we expect to see other retailers begin to offer the handset in the coming days."
  ],
  "headers": {},
  "links": {
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 5C": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-5c-1179311/review"
  }
}