{
  "source": "https://www.techradar.com/news/nikon-z9-makes-a-highly-revealing-appearance-at-the-olympics",
  "title": "Nikon Z9 makes a highly revealing appearance at the Olympics",
  "category": "cameras",
  "updated": "2021-08-02T10:11:07Z",
  "author": "mark-wilson",
  "summary": "Our first proper glimpse of the Nikon Z9 in the sporting wild",
  "article": [
    "Not to be outdone by its big full-frame rival, the Canon EOS R3, the incoming Nikon Z9 has just made a fleeting appearance at the Olympics, giving us a proper glimpse of what the camera looks like for the first time.",
    "Until now, we've only seen a single front-on press shot of Nikon's incoming mirrorless sports camera. But a Tweet from the Spanish website Photolari has given us a good look at the back of the Nikon Z9 – and it's quite a big shake-up (at least for a pro sports camera) compared to the current Nikon D6 DSLR.",
    "In the photos, which you can see below, the Nikon Z9 appears to mix the familiar (two joysticks, a circular eyepiece) with a rejig of the controls in order to accommodate what looks like an articulating screen.",
    "The tell-tale sign that the Nikon Z9 could have an articulating screen, rather than the fixed display seen on all of Nikon's previous sports DSLRs, is that the photos show the screen surrounded by black gaffer tape.",
    "Pro sports photographers tend to largely use the viewfinder to compose shots, so are generally happier to keep the rear screen fixed in place. It may also be a case of Nikon looking to keep some aspects of the camera under wraps.",
    "But the theory is backed up by the lack of any buttons on the left-hand side of the Nikon Z9's back panel. The Nikon D6 has six buttons, including the menu and zoom, on the left of its rear screen, but on the Nikon Z9 these have been moved underneath the d-pad on the right-hand side.",
    "This seems to have created space for an articulating screen, which would really mark the Nikon Z9 out as a professional hybrid camera for both stills and movies. The current Nikon D6 is great for sports photography, but was something of a letdown when it came to video.",
    "These new Nikon Z9 photos certainly don't point to a radical change for the camera giant's sports cameras – after all, it's still a chunky body with more buttons than you'd find in an airplane cockpit.",
    "But the Z9 does appear to have several big tweaks that mark it out as a hybrid camera for high-quality video, alongside the traditional stills. Chief among those is what looks like a fully articulating screen, along with some controls that have been significantly rejigged compared to the Nikon D6.",
    "This is significant because pro sports photographers will have their muscle memory trained on a particular button layout that's barely changed since the Nikon D2X landed in 2004. Still, the Nikon Z9 is otherwise hardly a complete rethink – particularly when you compare its design to the more modern Sony A1 – and the changes are likely to largely positive.",
    "One of the few features that Nikon has officially confirmed is that the Z9 will have a newly-developed stacked FX (full-frame) sensor. This stacked design promises faster read-out-speeds when compared to previous Nikon cameras, which could not only support fast burst shooting (speeds of 20fps have been rumored) but also much-improved autofocus, which might be significant for its video powers.",
    "We'll have to wait for more official details from Nikon on the Z9's specs – the rumors suggest a full launch sometime between September and November – but it's certainly shaping up to be a strong rival to the Canon EOS R3 and Sony A1. For Nikon fans, it might also prove to be the mirrorless leap forward they've been waiting for since the Nikon Z6 arrived in 2018."
  ],
  "headers": {
    "7": "Analysis: A promising evolution for Nikon's sports cameras"
  },
  "links": {
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "Photolari": "https://twitter.com/Photolari/status/1421084920768835587"
  }
}