{
  "source": "https://www.techradar.com/news/your-iphone-12-pro-will-soon-3d-scan-your-foot-to-perfect-online-shoe-shopping",
  "title": "Your iPhone 12 Pro will soon 3D scan your foot to perfect online shoe shopping",
  "category": "phones",
  "updated": "2021-06-13T21:00:31Z",
  "author": "david-lumb",
  "summary": "Use your iPhone 12 Pro to get your exact shoe size to help shop online",
  "article": [
    "Online shopping has skyrocketed during the pandemic, highlighting its usefulness – and shortcomings. Ordering goods is incredibly convenient until you need to know your size, for clothes and shoes. But Volumental is aiming to solve the latter problem by releasing a mobile app soon for iPhone 12 Pro owners to 3D scan their feet to recommend the right shoe size every time.",
    "And while the Volumental mobile app is only going to be compatible with the iPhone 12 Pro and Pro Max when it launches in the coming months, it's heading to older iPhones by the end of the year.",
    "The app isn’t only aimed at consumers – it’s essentially a mobile version of the proprietary foot scanner Volumental has sold to high-end footwear retailers like Adidas, Allbirds, Bauer, Fleet Feet, Road Runner, The Athlete’s Foot, and others to install in their stores. Employees use the scanner – a bathmat-sized gray slate with four sets of cameras and sensors pointed at the center – to take detailed measurements of customers' feet, typically as a consultation to sell form-fitting insoles and the right shoes for their physiology and movement patterns.",
    "And we wouldn’t have the new mobile app without all the data generated by the retail scanners.",
    "“One of our strengths, and what sets us apart, is that we have so far scanned close to 10 million people around the world with our retail scanners, and we are in like 42 countries around the world,” Volumental co-founder and CTO Alper Aydemir told TechRadar, explaining that connecting all that data to consumer purchases “allows us to understand really how each shoe fits and what kind of shape fits each shoe the best.”",
    "And not just types of shoes but the differences in shoe sizes, which can get larger or smaller in irregular intervals – perhaps going from a Men’s US 9 to a 9.5 is a smaller jump than going from a 9.5 to a 10, which is an inconsistency you wouldn’t catch unless you had such a big data set.",
    "Consumers will benefit from all that data and scan their feet with their own phones when Volumental’s mobile app launches in the coming months (planned for ‘summer’ or later in Q2 2021). To start, only owners of the latest iPhone 12 Pro and Pro Max phones will be able to make use of the app thanks to their cutting-edge LiDar and other sensors, but compatibility will open up to older iOS devices toward the end of 2021 – and an Android version will follow after that, potentially by early 2022.",
    "The Volumental mobile app uses advances in mobile phones’ augmented reality software to add AR markers to scans of a user’s foot, then constructs a 3D model to compare to their database. Eventually, the app will be open to all models, but they’re starting with the most powerful iPhone on the market to perfect the scanning software.",
    "“It has the best CPU, it’s the fastest-running, so it makes sense to start from there and get everything working really nice before you tackle everything else,” Aydemir said. “That’s what I’ve seen in my career is the best strategy: you make one thing work really really well before you try to depend on different things at the same time.”",
    "Before co-founding Volumental, Aydemir worked on Google’s 3D-mapping team for Project Tango, and also worked at NASA on its 3D scanning app for mobile phones. His experience contributed to Volumental’s decision to have its mobile app harness, but not rely on, the iPhone 12 Pro’s LiDar sensor – which makes the phone’s ARKit software find a surface for depth scanning much faster, but isn’t a common feature among older and less premium phones.",
    "In fact, Volumental had to develop its own version of ARKit (which really isn’t built for scanning body parts) to stitch together images the iPhone takes down to sub-millimeter accuracy into a 3D model of a foot – because if those camera positions are off even a little bit, Aydemir said, the model isn’t usable.",
    "Volumental’s proprietary retail scanners generate a ton of data, including measurements for foot size, instep height, heel width, arch height, and more, but the mobile app will focus on shoe size – which is the biggest measurement consumers care about anyway. Currently, the mobile app is capable of taking scans that are accurate within 5mm of error, or half a US shoe size, for 90% of the people using the app.",
    "That may sound like noticeable variance, but it’s far better than consumers guessing their shoe size across different brands, which contributes to dissatisfaction and returned merchandise. In today’s ecommerce, return rates can be up to 50%, Aydemir said. The mobile app is designed to take out the guesswork by harnessing Volumental’s dataset and continuing to expand it as consumers scan more new shoes and add it to the collective.",
    "“In our system, it only takes 10 to 12 purchases for us to get to the best level of recommendation,” Aydemir said; until they reach that threshold of scans, they have a few other tricks to suggest sizing for the first consumers looking to buy that shoe, like comparing the new footwear to similar models from the same brand.",
    "Volumental was already in the process of developing a mobile app version of its retail scanning tech when the pandemic hit, so it would be inaccurate to say they’re releasing it to capitalize on the rise in online shopping.",
    "In fact, their B2B focus means the app, while available to consumers, will likely be pitched more to retailers. Volumental already has companies testing out the mobile app – and while Aydemir declined to name any, the company’s history with footwear retailers and brands hints at which big names might become official partners.",
    "But the mobile app still has a lot of promise for consumers, especially those who aren’t ready or don’t have the opportunity to shop in-person as in-store shopping starts opening up. And seeing as few (if any) apps have offered to help consumers find out their shoe sizes across many brands, Volumental could help a lot of shoppers.",
    "“We’re almost in this MySpace era of e-commerce. You just get the same brand product page no matter what it is. But when it comes to running shoes or shoes in general and apparel, it has to fit you,” Aydemir said. “Our goal is to make people love their fit.”",
    "That ‘fit’ might include other body parts as Volumental considers expanding to other apparel niches, which Aydemir sees as fertile territory as FitTech expands. Perhaps that means the Volumental foot-scanning mobile app will someday let you scan your wrist for watches, head for hats and helmets, legs for pants and torso for shirts and jackets – or maybe the company’s back-end tech will empower somebody else’s app to do the same.",
    "What is clear is that your phone will soon help you better shop for shoes, and someday later, the rest of your wardrobe."
  ],
  "headers": {
    "7": "Scanning feet with the latest iPhone tech",
    "14": "The future of body scanning"
  },
  "links": {
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review"
  }
}