{
  "source": "https://www.techradar.com/news/this-shark-hair-dryer-is-a-game-changer-for-curly-hair",
  "title": "This Shark hair dryer is a game-changer for curly hair",
  "category": "appliances",
  "updated": "2021-09-21T12:44:29Z",
  "author": "carrie-ann-skinner",
  "summary": "Extendable prongs on the diffuser mean you can dry the roots as well as the ends",
  "article": [
    "Blow drying your hair is something many of us do on a regular basis, and on the surface appears to be a relatively easy task. All you have to do is blast hot air at your hair until it’s dry.",
    "However, in reality, creating a style you’re happy with can often be fiddly and complicated. While one of the best hair dryers can speed up drying times, and even ensure your locks are shiny, selecting the right attachment and using it properly to create a salon-worthy style without damaging your hair can seem like an unachievable feat sometimes.",
    "Shark hopes to route an end to this with the Style iQ hair dryer. Yes, you heard that right, Shark - a brand known for producing some of the best vacuum cleaners, has entered the haircare market.",
    "The Shark Style iQ, which is known as the Shark HyperAIR in the US, comes with two attachments, including a diffuser that has extendable prongs, which means the roots, as well as the ends of curly hair, can be dried quickly, while still boosting the volume - not something traditional diffusers can do. It is priced at $229.99 / £229.99 (about AU$400) and will go on sale in October. In the US, customers can join a wait list, but there's no option for this in the UK yet.",
    "Almost half of all American women wash and blow dry their hair every single day, according to research by beauty retailer Lookfantastic. However, once keratin - the protein that your hair is made from - is heated past 160C, it will become damaged. This not only causes the hair to break more easily, but it makes it harder to style. The more you blow-dry your hair, the more heat damage you’re subjecting your locks to.",
    "Traditional diffusers contribute heavily to heat damage when drying curly hair because the short prongs mean heat is concentrated on the ends rather than being spread across the length of the hair shaft. The Style iQ diffuser has a built-in lever that can extend or retract the prongs so those with longer hair don’t find the heat is only being projected at the ends of their hair.",
    "It’s not just the extendable prongs on the diffuser that are a game-changer. When any of Shark’s attachments are connected to the hair dryer, they will automatically adjust the temperature and air flow settings required for creating that type of style. For example, when using the diffuser, the speed is automatically reduced to the lowest setting to ensure the curl pattern of the hair isn’t disrupted by the airflow. Similarly, when taming thick tresses into a sleek smooth style with the concentrator nozzle, the hair dryer will switch to the highest temperature to ensure the heat can penetrate the strands of hair.",
    "While Shark entering the hair care market might seem odd, it's not the first brand that cut its teeth on the floor cleaning market to turn its attention to hair care. Dyson did just this in 2016 when the brand launched its Supersonic hair dryer.",
    "At the time, James Dyson said the brand wanted to create a hair dryer that was quieter, lighter, and crucially caused less heat damage to hair than those already on the market.",
    "While Shark hasn’t confirmed reducing heat damage was also its motivation, or at least some of the reason for creating the Style IQ, the fact that it will automatically adjust the temperature depending on the attachment used certainly indicates it's something the company was considering.",
    "We’re impressed that both brands are focusing on this fact, as to whether you dry your hair every day or just a couple of times a week, any way that heat damage can be minimized is certainly a bonus. However, at $229.99 / £229.99 (about AU$400) the Shark Style iQ is still an expensive haircare appliance. While brands such as Remington do offer more affordable hair dryers that protect against heat damage, they have yet to reach the sub $100 / £100 / AU$150 mark. We’d like some more affordable hair care names to pick up this gauntlet, ensuring reducing heat damage is something everyone can enjoy."
  ],
  "headers": {
    "4": "Reducing heat damage",
    "7": "Doing a Dyson"
  },
  "links": {
    "best hair dryers": "https://www.techradar.com/best/best-hair-dryer-5-hair-dryers-for-smooth-and-shiny-styles",
    "best vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners",
    "Supersonic hair dryer": "https://www.techradar.com/reviews/dyson-supersonic-uk"
  }
}