{
  "source": "https://www.techradar.com/news/satya-nadella-how-microsoft-can-be-every-developers-best-friend",
  "title": "Satya Nadella: How Microsoft can be every developer's best friend",
  "category": "computing",
  "updated": "2021-05-25T16:56:28Z",
  "author": "mike-moore",
  "summary": "Microsoft CEO lays out how it wants to power the future of development",
  "article": [
    "Microsoft CEO Satya Nadella has re-affirmed the company’s aim to support developers around the world.",
    "In his keynote kicking off the company’s Microsoft Build 2021 event, Nadella highlighted the vital role developers around the world have played in the past 12 months, and how important this will be going forward.",
    "\"Digital transformation that was projected to happen over the next 10 years is happening today,” Nadella noted. “As computing becomes embedded in every aspect of our lives, there will no longer be such a thing as the “tech sector.” The world will be transformed through tech intensity, at scale.\"",
    "Nadella said that Microsoft had seen a surge in developer numbers across many industries, with the agriculture, energy, finance and consumer goods sectors seeing particularly high growth.",
    "“We're experiencing massive technological and societal shifts,” he noted. “As the physical and digital world converge, every industry will require more ubiquitous and decentralized power.”",
    "\"In a digital-first company, the developer workflow influences how the entire company works,” Nadella added. “Fusion teams of pro developers and domain experts will be integrated across all functions and all disciplines.\"",
    "Microsoft is announcing over a hundred new services and updates for developers during Build 2021, with upgrades to the likes of Azure, Microsoft Teams and Microsoft Edge among the headline news.",
    "\"The opportunity is clear,” declared Nadella, “the next generation of applications will not be reactive, but proactive because of their ability to harness the power of data to drive that next level of intelligence.\"",
    "With its acquisition of GitHub placing the company firmly at the forefront of developer relations and the community as a whole, Microsoft will now look to continue its leading role in helping support devs across the world in the increasingly digital world.",
    "“We want to empower you to seize these opportunities and build what comes next,” Nadella said. “Our ambition is to be the platform for platform developers...we want to help you help the world.\"",
    "“You are the ones doing the hard work to shape this new reality, and we are here to help.”"
  ],
  "headers": {
    "3": "Developer opportunity"
  },
  "links": {
    "Azure": "https://www.techradar.com/news/microsoft-azure-is-now-smarter-and-more-powerful-than-ever",
    "Microsoft Edge": "https://www.techradar.com/news/microsoft-edge-is-getting-a-mega-speed-boost-to-help-it-topple-google-chrome"
  }
}