{
  "source": "https://www.techradar.com/news/this-tiny-fanless-lenovo-server-packs-more-memory-than-apples-m1-macbook-pro",
  "title": "This tiny fanless Lenovo server packs more memory than Apple's M1 MacBook Pro",
  "category": "computing",
  "updated": "2021-03-02T15:21:31Z",
  "author": "abhishek-jadhav",
  "summary": "Lenovo ThinkEdge SE30 and SE50 provide a secure and efficient way for companies to start data processing at the edge",
  "article": [
    "Lenovo has unveiled two new additions to its edge computing portfolio as it looks to help enable digital transformation and cloud computing across a range of industries.",
    "The new ThinkEdge SE30 and ThinkEdge SE50 embedded computers feature some of the latest hardware around, with the former built around the powerful 11th Generation Intel Core i5 vPro processor, while the latter has the option of either the 11th Generation Intel Core i7 or i5 vPro processors.",
    "According to recent research by Lenovo, more than 55% of data is expected to come from IoT devices by 2025, meaning these latest releases can greatly aid businesses looking for the fast processing of such valuable information, with the healthcare, retail, and manufacturing industries among Lenovo’s target markets.",
    "The features and performance shown by these embedded computers should mean they can outperform popular laptops such as Apple’s MacBook Pro or even the Microsoft Surface Pro 7.",
    "Offering several advantages for embedded systems, the ThinkEdge SE30 is able boost performance thanks to its up to 16GB of memory and 1TB SSD storage. For IoT-ready platforms, the ThinkEdge SE30 supports Wi-Fi, Bluetooth, 4G LTE, and 5G wireless connectivity to provide highly secure and low-latency data transfer.",
    "For security protection, the hardware includes Lenovo ThinkShield’s 360-degree protection suite, also previously deployed in the company’s ThinkPads and ThinkCentre, and designed to help secure and protect the system and data throughout their lifecycle.",
    "The SE30 IO box also looks to reduce the work needed to integrate an embedded PC into the IoT ecosystem through the enhanced capabilities of two PoE, digital input/output connectors, and serial port.",
    "For more data processing at the edge, the SE50 embedded PC comes with 32GB of memory and up to 2TB of storage space. Both units are small and rugged, meaning they can be deployed in the field, giving customers more opportunities to gather data from the world around them.",
    "“Edge computing is a critical infrastructure for intelligent transformation within the enterprise,” said Jon Pershke, vice president of Strategy and Emerging Business for Lenovo’s Intelligent Devices Group. “The new products in the ThinkEdge portfolio are purpose-built devices designed to be networked on-premise or embedded in solutions to give Lenovo’s customers an advantage in performance, security, and scalability.”",
    "Both the Lenovo ThinkEdge embedded computers will be available by mid-2021, although there’s no pricing information available yet."
  ],
  "headers": {
    "4": "Everything in a small package"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "MacBook Pro": "https://www.techradar.com/news/the-best-cheap-macbook-pro-deals",
    "Microsoft Surface Pro 7": "https://www.techradar.com/deals/surface-pro-deals-bundles"
  }
}