{
  "source": "https://www.techradar.com/news/the-entry-level-intel-arc-alchemist-gpu-could-actually-be-affordable",
  "title": "The entry-level Intel Arc Alchemist GPU could actually be affordable",
  "category": "computing",
  "updated": "2021-11-22T12:29:13Z",
  "author": "jess-weatherbed",
  "summary": "At least, according to these fresh leaks",
  "article": [
    "The Intel Arc Alchemist graphics cards are still a few months away, but we already have an idea of what to expect from the entry-level GPU, including pricing, according to YouTuber Moore's Law Is Dead.",
    "According to his video, the Intel Xe-HPG Alchemist entry-level graphics cards will be based on the 128 EU SKU with an expected clock speed between 2.2-2.5 GHz. We previously reported on rumors that this will rock 6GB of memory, and that's something that's been mentioned again in Moore's Law Is Dead's report.",
    "Additionally, the YouTuber is confident that given the build of the GPU is so affordable that its retail price will be around the region of $179 (around £130 / AU$250), though this is marked as \"mostly confident\" in his video and sources have not been disclosed.",
    "According to WCCFTech, we can expect the entry-level ARC graphics card to compete directly against the GeForce GTX 1650 and GTX 1650 Super, but with several advantages that could finally make those older cards disappear from the market.",
    "For one, the entry-level Intel GPU will have raytracing capabilities and a much lower power requirement, but also if that price estimation proves to be accurate then we might finally see the return of truly 'budget' GPUs, with the Intel Arc Alchemist being the first of this generation to hit the market at under $200.",
    "Running on Xe-HPG GPU architecture, the as-yet unnamed card isn't expected to get a full launch announcement until Q1 2022 (likely around CES 2022), and it's anticipated that laptops will be the first to launch, with a desktop line to follow in Q2 2022. Until we get this information confirmed from Intel itself, take everything with a hefty pinch of salt.",
    "If this GPU can achieve performance in the range of an Nvidia GTX 1660 Super for under $200 then we might finally see a comeback for budget-friendly gaming PC builds that have new features like raytracing.",
    "The market has been devastated for over a year thanks to supply issues, scalpers and Cryptofarming which has resulted in the current generation of 'affordable' cards rocketing in price. As such, a GPU that should cost in the region of $300 has been selling for between $800-$1,000 (£700-£900 / AU$1,100-AU$ 1,600), forcing many to either buy gaming laptops or stick to their aging systems.",
    "Matching the performance of older Nvidia Turing GPUs might seem a tad boring, but they're still the most popular GPUs currently in use, and still commonly purchased in budget-friendly gaming laptops. Similarly though, if rumors are proved to be false and the card retails for a much higher price, that performance is going to put most people off buying one as they can get enhanced performance from the Ampere and Navi 23 GPUs.",
    "Given most people don't have buckets of cash to drop on gaming hardware, affordability is king right now. If Intel can pull this off then it has a decent chance of giving both AMD and Nvidia a hard time in the coming years."
  ],
  "headers": {
    "6": "Analysis: Is this the budget hero we needed?"
  },
  "links": {
    "Intel Arc Alchemist graphics cards": "https://www.techradar.com/news/intel-arc",
    "Moore's Law Is Dead": "https://www.youtube.com/watch?v=v1LlF905RYg",
    "previously reported on rumors that this will rock 6GB of memory": "https://www.techradar.com/news/budget-intel-arc-alchemist-gpu-may-come-with-6gb-memory",
    "WCCFTech": "https://wccftech.com/intel-entry-level-arc-alchemist-gaming-graphics-cards-to-feature-up-to-8-xe-hpg-gpu-cores-6-gb-gddr6-memory-179-us-pricing/",
    "GTX 1660 Super": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1660-super"
  }
}