{
  "source": "https://www.techradar.com/news/your-next-smartwatch-could-come-with-not-one-but-two-cameras-on-board",
  "title": "Your next smartwatch could come with not one, but two cameras on board",
  "category": "wearables",
  "updated": "2021-09-02T11:14:00Z",
  "author": "david-nield",
  "summary": "Here's what's in the pipeline",
  "article": [
    "With the launch of the Galaxy Watch 4 and the arrival of Wear OS 3, there's more buzz around non-Apple smartwatches than there has been for years – and more improvements to the hardware offered by these wearables are on the way.",
    "WinFuture (via 9to5Google) reports that Qualcomm is busy working on a new chipset for wearable devices, which it's assumed is called the Snapdragon 5100 – the follow-up to the Snapdragon 4100 Plus processor currently in the Fossil Gen 6.",
    "It's a chip that will apparently enable support for two cameras on a smartwatch. That's something we haven't seen much of on wearables so far in the US and Europe, but it's a more popular feature in the Chinese market.",
    "Digging deeper into the specs of the Snapdragon 5100 (if that's what it ends up being called), it looks to have four ARM Cortex-A53 cores, which would suggest a modest upgrade over the Snapdragon 4100 Plus in terms of performance.",
    "That's something of a disappointment after it was previously reported that the Snapdragon 5100 might offer four ARM Cortex-A73 cores, a more substantial jump that would enable smoother performance for wrist-based devices.",
    "At the moment, we just don't know for sure, but we shouldn't have long to wait to find out: it's a year since Qualcomm's current flagship wearable chipset appeared, so it's about time that we heard official updates on a new one.",
    "It's been encouraging to see plenty of movement in the smartwatch space this year, with new software and new devices appearing on the scene – and that's before the eagerly awaited Apple Watch 7 makes its debut sometime in the next month or so.",
    "If Wear OS-powered watches are going to take on the mighty Apple wearable though, then they need the right components inside them. That's where Qualcomm and its series of Snapdragon chipsets for wearables comes in.",
    "Part of the appeal of the Apple Watch is the slick and responsive software interface, which is of course powered by some top-tier silicon underneath. To date, the Wear OS equivalents haven't offered quite the same user experience in terms of quality.",
    "Even with the latest leak that we've reported on above, it's perhaps too early to start speculating how powerful future Wear OS smartwatches are going to be – but manufacturers need to offer hardware that's as high-end as possible, even if it results in increased costs."
  ],
  "headers": {
    "3": "Core issues",
    "6": "Opinion: Wear OS needs to be supported by hardware"
  },
  "links": {
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Wear OS 3": "https://www.techradar.com/news/wear-os-3-name-announced",
    "WinFuture": "https://winfuture.de/news,124932.html",
    "9to5Google": "https://9to5google.com/2021/09/01/qualcomm-wear-os-snapdragon-5100-details/",
    "Fossil Gen 6": "https://www.techradar.com/news/fossil-gen-6-smartwatch-unveiled-with-fast-charging-more-sensors-and-wear-os-3",
    "previously reported": "https://www.xda-developers.com/qualcomm-snapdragon-wear-5100-rumor/",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news"
  }
}