{
  "source": "https://www.techradar.com/news/exclusive-gamestop-ps5-restock-july-27",
  "title": "Exclusive: GameStop PS5 restock sold out quickly – but we reported on it in advance",
  "category": "gaming",
  "updated": "2021-09-09T08:33:26Z",
  "author": "matt-swider",
  "summary": "Our exclusive news about the PS5 restock at GameStop helped a lot of people – as many as 800 – buy the PS5 Disc and PS5 Digital bundles on July 27. Here's what happened.",
  "article": [
    "Final update: The GameStop PS5 restock news on Tuesday, July 27, was exclusively reported well in advance by our PS5 restock tracker Matt Swider, who confirmed that the Sony console would be in stock several hours before it actually happened. As many as 800 of his followers were able to find the PS5 in stock and you can too for the next PS5 restock – if you follow Matt Swider's Twitter account and turn on notifications. Not everyone who tried was able to get it, but Matt did host a PS5 restock live stream to help coach people through the complicated process. The Target PS5 restock may be next, according to Matt's sources.",
    "► When is the next PS5 restock? Follow our PS5 restock Twitter tracker Matt Swider and turn on notifications for instant restock news. It's the fastest way to get PS5 stock updates.",
    "► Don't buy from other Twitter users – ever. They're all scams. Only buy from the US stores Matt alerts you about. No one will sell a PS5 for just $550.",
    "Directions: Click on this image of an example of a GameStop PS5 restock alert from Matt Swider and turn on notifications (that little bell icon) for instant alerts.",
    "The GameStop PS5 restock today, July 27, sold out in about 40 minutes, though the add-to-cart button remained live shortly after that time. That was hardly the worst glitch we saw from the US retailer. While we were able to exclusively report on the PS5 restock date, no one could have foreseen the issues people faced at checkout with the Sony console. Many customers reported that GameStop wouldn't accept their address (even using offering multiple addresses). It was another PS5 restock disaster, this time at GameStop.",
    "We did see some others (between 600 and 700, according to our stats), checkout with the console using our Twitter tracker links. There's a good reason GameStop is favored, despite the fact and also due to the fact it throws up roadblocks.",
    "Matt host an hour-long PS5 restock live stream when GameStop had the PS5 for sale. He walked people through the process of buying the PS5 from the US retailer.",
    "The GameStop restock time for today. GameStop usually gives about a 90-minute heads-up before the add-to-cart button turns on and slowly populates console bundles, and that's exactly what happened this monring. It'll be at 11am EDT / 10am CDT / 8am PDT, according to GameStop.",
    "There's no in-store GameStop restock expected today. Please don't go to the store asking about the PS5 because our sources indicated that this PS5 restock – like all others in 2021 – is being sold online. It takes three to five days to ship to your home address.",
    "GameStop has become the easiest to order the console from – as long as you're a PowerUp Pro Rewards member and don't hesitate and buying into a bundle. But here's some extra guidance from our experts.",
    "The Target PS5 restock date is shaping up to be this week – as early as Wednesday, July 28 – as we can confirm through our sources that Target stores in the US have as many as 22 PS5 Disc consoles on hand in the backroom (no, they can't sell them yet and you have to buy it online, not in stores). Our reporting shows that another store we recently checked in with currently has 11 PS5 consoles (also all PS5 Disc).",
    "That's good news because our reporting one week ago uncovered the fact that most Target stores had just three consoles on hand. Is between 11 and 22 enough? Our sources know the inventory count and, from that, we can figure out how many consoles are consistent with a PS5 restock at Target. The answer? We're right on the cusp of that add-to-cart button going live this week. But we've also seen Target wait until it has 40 consoles on hand in most of its large stores.",
    "There have been PS5 Digital Edition consoles available at certain Target stores that you could purchase online every morning. But having searched through all of the zip codes in the United States where there are Target stores, it's a few PS5 consoles at a handful of locations. This isn't the restock you're looking for.",
    "What's the Target PS5 restock time? The time is between 7am and 8am EDT – that's always been the restock time window in 2021. The most popular time is 7:40am EDT, but you don't want to miss it by a couple of minutes in case it's at 7:06am EDT like it was for the last PS5 restock time three weeks ago.",
    "Target typically settles on a restock date that falls on a Wednesday or Thursday. It has only once chosen a Friday (likely due to it being a holiday a few days prior).",
    "Without knowing for sure the PS5 restock date, it's tough to tell people on the West Coast of the United States to wake up at 4am PDT, but it's always easier to buy the PS5 at Target due to the fact that you're buying online but selecting a local store, thus you're competing with fewer people as your neighbors are asleep."
  ],
  "headers": {
    "4": "GameStop PS5 restock date: sold out to success",
    "7": "GameStop PS5 restock time: when will PS5 be for sale",
    "9": "GameStop PS5 restock guide",
    "10": "Other stores in the US will have it besides GameStop"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock tracker Matt Swider": "https://twitter.com/mattswider",
    "PS5 restock live stream": "https://youtu.be/5mKIhhUVLQA",
    "Target PS5 restock": "https://www.techradar.com/news/target-ps5-restock-time-july-28",
    "Follow our PS5 restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "PS5 restock disaster": "https://www.techradar.com/news/ps5-restock-in-the-us-walmart"
  }
}