{
  "source": "https://www.techradar.com/news/netflix-games-have-begun-rolling-out-on-android-but-its-still-early-days",
  "title": "Netflix games have begun rolling out on Android – but it's still 'early days'",
  "category": "entertainment",
  "updated": "2021-08-26T15:24:32Z",
  "author": "samuel-roberts",
  "summary": "Poland is first up",
  "article": [
    "Netflix has rolled out the first of its games to users in Poland, letting users try Stranger Things: 1984 and Stranger Things 3 on Android within the app.",
    "The streaming service cautions that this is a first step, calling the move \"early days\" – but it clarified that its games will be included with your Netflix subscription, and that they won't feature ads or in-app purchases. Like Netflix's movies and TV shows, then, it's all part of one single monthly cost.",
    "Netflix says it's starting to \"explore what gaming looks like on Netflix\", so it's possible that how they're presented or distributed will change. The above image gives you an idea of what they look like – games come up with an 'install game' button, and are displayed as part of the rows of tiles in the streaming app.",
    "Both Stranger Things games are pre-existing titles. Stranger Things 3: The Game, for example, costs $9.99/£7.19 on Steam – so getting it for free is a small benefit. More interesting, of course, would be seeing original games appear on the platform.",
    "Based on the timeline of this rollout, we expect that anything more elaborate on the Netflix gaming front is some time away. But it's an intriguing first step.",
    "Enjoy it, Poland.",
    "Netflix becoming Xbox Game Pass overnight was never a likely scenario. Tentative steps into mobile gaming – albeit with full games, and not microtransactions – gives us an idea of what the streamer has in mind. Netflix's plan was never to make expensive console-style games, and you can expect to see it roll out a variety of tie-in games as part of this initiative.",
    "What's in it for Netflix? Well, it's yet another way to attract subscriber dollars, and it's something its competitors have no equivalent for. Netflix also has a lot of crossover with people play games, and in a pre-smart TV age, consoles were arguably among the most convenient way to enjoy streamers. There's bound to be some crossover, there.",
    "But mobile game users are arguably a different part of the market. It's possible Netflix could try and target both hardcore and casual players at the same time – perhaps Apple Arcade is a more apt comparison than Game Pass – but these are obviously early days. There's surely a limit to how much Netflix can learn from offering two games that already exist."
  ],
  "headers": {
    "6": "Analysis: Baby steps"
  },
  "links": {}
}