{
  "source": "https://www.techradar.com/news/studio-ghiblis-next-film-has-a-release-date-on-hbo-max-and-its-soon",
  "title": "Studio Ghibli’s next film has a release date on HBO Max - and it’s soon",
  "category": "entertainment",
  "updated": "2021-03-09T13:34:41.419Z",
  "author": "emma-boyle",
  "summary": "Earwig and the Witch is coming to HBO Max next month",
  "article": [
    "Studio Ghibli’s next feature film, Earwig and the Witch, now has a US release plan and it involves HBO Max.",
    "According to The Hollywood Reporter, both English-dubbed and subtitled versions of the animated film will have a limited release in cinemas on February 3 2021 before coming to HBO Max only two days later on February 5. You can sign up to the service on its website.",
    "Given HBO Max is currently the home of the whole Studio Ghibli catalog in the US, from Spirited Away to Porco Rosso, it’s not entirely surprising that the studio’s new film will also be available to stream there.",
    "It is a pretty big boon for the streaming service, though, which recently announced it’s adding also adding two Ghibli documentaries, Never-Ending Man: Hayao Miyazaki and The Kingdom of Dreams and Madness, to its library.",
    "Earwig and the Witch is Studio Ghibli’s first feature film since When Marnie Was There was released in 2014 and it's the studio’s first full 3D CG film ever. Gorō Miyazaki, the son of studio co-founder Hayao Miyazaki and the director of From Up on Poppy Hill and Tales From Earthsea, is the director of the film.",
    "Like Ghibli’s Howl’s Moving Castle, Earwig and the Witch is based on a novel by Diana Wynne Jones and will follow Earwig, a 10-year-old girl who grew up in an orphanage without knowing her mother had strange powers. Her life begins to change when she's taken in by a strange couple and has to live with a selfish witch.",
    "Unfortunately, the UK release plan for the film isn’t known just yet, though Deadline reported back in December of last year that it has been picked up by Elysian Film Group. Hopefully we’ll hear more on that front soon."
  ],
  "headers": {
    "4": "A film of firsts"
  },
  "links": {
    "Studio Ghibli": "https://www.techradar.com/best/studio-ghibli-movies",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/news/studio-ghiblis-earwig-and-the-witch-gets-theatrical-hbo-max-release-dates",
    "sign up to the service on its website": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-3313675988114839600&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fstudio-ghiblis-next-film-has-a-release-date-on-hbo-max-and-its-soon",
    "announced": "https://www.techradar.com/news/hbo-max-boosts-its-anime-library-in-fight-against-netflix",
    "Deadline": "https://deadline.com/2020/12/studio-ghibli-earwig-witch-elysian-film-group-nick-mckay-1234637073/"
  }
}