{
  "source": "https://www.techradar.com/news/nintendo-watch-tag-heuer-is-unveiling-a-mario-themed-timepiece-soon",
  "title": "Nintendo Watch? Tag Heuer is unveiling a Mario-themed timepiece soon",
  "category": "phones",
  "updated": "2021-07-09T18:11:02Z",
  "author": "david-lumb",
  "summary": "Goodbye Labo imaginative cardboard, hello luxury watches",
  "article": [
    "We’re guessing the last Nintendo Watch you wore came in a cereal box or with a fast-food kids meal. But on July 13, luxury watchmaker Tag Heuer will reveal a Super Mario-themed timepiece for the grown-ups who want to flex their fandom.",
    "The watchmaker tweeted out a super star-worthy hyper-colorful teaser introducing the Tag Heuer x Super Mario limited edition watch, but didn’t offer any details or peek at the design – presumably, we’ll get a look on July 13.",
    "The watch will be available on Tag Heuer's site and select boutiques starting July 15 according to the product’s official site, where you can sign up to get more info sent by email.",
    "Given Tag Heuer puts out luxury watches with four-figure pricetags – last March, the Tag Heuer Connected launched with a $2,300 asking price – it’s curious that Nintendo would choose such an expensive brand to release its gamer merch.",
    "Of course, there are certainly adults in the world who have grown from doe-eyed youths clutching NES controllers to working folks willing to spend money recapturing their fond formative gaming moments. And hey, what better way to flex on your friends than by wearing a pricey on-brand watch while you leave them in the dust in Mario Kart?",
    "There's plenty of gaming merch in the world, but gaming-themed watches are pretty rare. There just doesn't seem to be a lot of overlap between players and timepiece fans, and collaborations like the OnePlus Watch Cyberpunk 2077 Edition feel like the exception that proves the rule.",
    "Part of the reason may be that the best smartwatches like the Apple Watch 6 and the Samsung Galaxy Watch 3 are advanced enough already, and fulfill all the Get Smart-esque fantasies bandied around decades ago. Of course, that's just led gamers to use these devices as their own creative sandbox, and you can download watch faces from Facer and other apps to show your Metal Gear Solid or Pokemon pride, if that's how you want to flex.",
    "Via The Verge"
  ],
  "headers": {
    "5": "Game watches? In this economy?"
  },
  "links": {
    "official site": "https://www.tagheuer.com/us/en/announcement/coming-soon.html?",
    "launched": "https://www.techradar.com/news/who-is-this-dollar2300-luxury-fitness-watch-really-for",
    "OnePlus Watch Cyberpunk 2077 Edition": "https://www.techradar.com/news/this-new-oneplus-watch-just-reminded-us-cyberpunk-2077-existed",
    "best smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Metal Gear Solid": "https://www.techradar.com/news/this-new-oneplus-watch-just-reminded-us-cyberpunk-2077-existed",
    "Pokemon": "https://www.facer.io/watchface/qLcYk3TcKm?watchModel=moto360sport",
    "The Verge": "https://www.theverge.com/2021/7/9/22570322/tag-heuer-nintendo-super-mario-watch-tease-collaboration"
  }
}