{
  "source": "https://www.techradar.com/news/twitter-could-soon-launch-reactions-and-downvotes-hidden-code-suggests",
  "title": "Twitter could soon launch reactions and downvotes, hidden code suggests",
  "category": "computing",
  "updated": "2021-11-28T14:30:34Z",
  "author": "david-nield",
  "summary": "Borrowing from Facebook, Reddit",
  "article": [
    "Twitter could soon start offering a whole set of different ways to respond to tweets, based on hidden code spotted in the iOS version of the app – the long-rumored ability to react with emojis and downvotes now seems to be closer to launch than ever.",
    "That's as per reverse engineering tipster @nima_owji (via 9to5Mac), who has done some digging into the Twitter app code. These features aren't actually live yet for users, but it looks as though the software is laying the groundwork for them.",
    "Rumors about reactions coming to Twitter have been swirling for months now. When they appear, they should work in a similar way to the equivalent feature on Facebook: you'll be able to add a thinking face, a sad face, a laughing face, a clap or a heart to any tweet that you come across on the platform.",
    "As for the downvotes feature, this is something else we've heard about before, this time through official channels. With more of the Twitter app code now geared up for downvote support, it would appear it's going to roll out more widely soon.",
    "From what we know so far, it looks as though Twitter is going to use downvotes to filter out spammy and abusive replies. The author of a tweet that gets downvoted won't be notified, and downvotes won't appear publicly on the timeline, but there will be an option to hide tweets and replies that have been marked in this way.",
    "There's still no official word from Twitter on when these features might roll out properly, but as they've been in the works for months, it shouldn't be too long now – keep your eyes on the Twitter app on your phone.",
    "There's no doubt that Twitter can be an incredibly entertaining, educational and fun digital place to be – but it's also true that abusive and negative comments are widespread on the platform as well, especially when it comes to certain topics.",
    "With emoji reactions and downvotes, Twitter is giving itself a whole host of new ways to collect data about the quality of a tweet – whether or not it's worthy to be viewed by the wider public – and that's going to come in useful in regards to automatic moderation.",
    "The reactions also add something that Twitter doesn't necessarily have a lot of at the moment: nuance. The options to like and reply are of course very useful, but sometimes you do want to show empathy, or start a round of applause, and so on.",
    "While any change to Twitter is likely to rile some of its userbase, these two incoming changes look like well thought-out, helpful additions to the functionality of the social media platform – and we're looking forward to being able to try them out."
  ],
  "headers": {
    "3": "Down with the tweets",
    "6": "Analysis: Twitter adds more context to replies"
  },
  "links": {
    "@nima_owji": "https://twitter.com/nima_owji/status/1463227578907512838",
    "9to5Mac": "https://9to5mac.com/2021/11/27/twitter-for-ios-readying-reactions-downvotes-and-sorted-replies/",
    "swirling for months": "https://www.techradar.com/news/twitter-is-working-on-tweet-reactions-so-it-can-be-more-like-facebook",
    "through official channels": "https://www.techradar.com/news/twitter-begins-testing-reddit-like-downvote-button"
  }
}