{
  "source": "https://www.techradar.com/news/starfield-could-release-on-xbox-series-x-in-2021-but-what-about-ps5",
  "title": "Starfield could release on Xbox Series X in 2021, but what about PS5?",
  "category": "gaming",
  "updated": "2021-04-30T10:26:27Z",
  "author": "rhys-wood",
  "summary": "Starfield could be lightyears away from PS5",
  "article": [
    "Starfield, Bethesda’s highly anticipated space-based RPG, could release in 2021 and skip the PS5 entirely, according to rumors sourced by the Xbox Two Podcast.",
    "Reported by KitGuru, Xbox Two Podcast host Rand Al Thor 19 stated: “I’ve been told, by very reliable people, that Starfield was 100% an Xbox exclusive. I’ve even made bets about it, and I don’t bet unless I know I’m willing to bet. So I’m really, really confident that Starfield is only releasing on Xbox when it does.”",
    "As well as the rumors surrounding Starfield’s Xbox exclusivity, rumors of a 2021 release are still circulating, thanks to a Starfield trademark spotted on Zenimax’s (Bethesda’s parent company) official website.",
    "Starfield was first announced way back in 2018 during Bethesda’s E3 press conference, and little has been known about the game since then, aside from some leaked footage that surfaced last year that allegedly came from an early build of Starfield.",
    "There’s currently no confirmation on Bethesda or Zenimax’s part that Starfield will miss out on a PS5 release. But given that both companies were acquired by Microsoft, it’s entirely possible that Starfield will remain exclusive to Xbox consoles as well as PC, with a potential day-one Xbox Game Pass release being a strong possibility.",
    "Bethesda releasing a game soon after a big reveal isn’t unheard of, either. Fallout 4 was announced in June 2015, and ended up releasing just five months later in November that year. A similar announcement-to-release window could be on the cards for Starfield, especially if Bethesda chooses to showcase the game at this year’s E3 in June.",
    "Microsoft and Nintendo will both be present at the Electronic Entertainment Expo, but Sony, who missed last year’s online-only conference, will not be present once again."
  ],
  "headers": {
    "3": "Getting starry-eyed"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Two Podcast": "https://www.youtube.com/watch?v=X8qY8vpACyM&t=5650s",
    "KitGuru": "https://www.kitguru.net/gaming/mustafa-mahmoud/starfield-reportedly-targeting-2021-release-will-be-xbox-exclusive/",
    "leaked footage": "https://gamingroute.com/more-starfield-footage-has-been-leaked-online/",
    "acquired by Microsoft": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Fallout 4": "https://www.techradar.com/news/gaming/fallout-4-the-good-the-bad-and-the-ugly-of-the-boston-wastelands-1308511"
  }
}