{
  "source": "https://www.techradar.com/news/apple-arcades-best-game-is-coming-to-pc-this-week",
  "title": "Apple Arcade's best game is coming to PC this week",
  "category": "gaming",
  "updated": "2021-05-17T10:05:18Z",
  "author": "rhys-wood",
  "summary": "Grindstone tears up PC in May",
  "article": [
    "Grindstone, the cartoonishly bloody match-3 puzzle game from Capybara Games, is seeing a release on PC via the Epic Games Store, after enjoying a couple years’ support on Apple Arcade and Nintendo Switch.",
    "Grindstone will release on May 20 on the Epic Games Store, and while no price has been announced as of yet, the game costs $19.99 / £15.09 / around AU$26 on Nintendo Switch, which will likely apply to the Epic Games Store barring any launch window discount that might be featured.",
    "In Grindstone, you play as a beefed up warrior named Jorj, who’s tasked with violently slaying cutesy cartoon creatures to collect treasure. What starts out as a regular match-3 style puzzle game similar to more casual affairs like Bejeweled turns into more of an RPG with various abilities, items and roguelike gameplay elements to mix the formula up.",
    "In addition to the base game, Grindstone on the Epic Games Store will launch with the Fortune Grind update, which adds a random roulette wheel to Daily Grind runs that offers a variety of effects. There’s also 10 new levels being added to add even more variety to the existing 200 plus levels.",
    "Grindstone was well received when it launched for iOS and Apple Arcade back in 2019, and it’s easy to see why. Match-3 style puzzle games have always been dopamine goldmines, and Grindstone spices things up with various RPG elements and a charming Saturday morning cartoon aesthetic.",
    "Capybara Games has been on something of a roll for the better part of a decade, with its previous games, including the arcadey Super Time Force Ultra and moody explore-a-thon Below, also sharing critical praise."
  ],
  "headers": {
    "3": "Grinding up a storm"
  },
  "links": {
    "Capybara Games": "https://www.capybaragames.com/",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Apple Arcade": "https://www.techradar.com/reviews/apple-arcade",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}