{
  "source": "https://www.techradar.com/news/your-geforce-rtx-3060-gpu-might-contain-faulty-rtx-3070-ti-silicon",
  "title": "Your GeForce RTX 3060 GPU might contain faulty RTX 3070 Ti silicon",
  "category": "computing",
  "updated": "2021-09-20T10:22:10Z",
  "author": "jess-weatherbed",
  "summary": "It's not as strange as you may think",
  "article": [
    "If you're lucky enough to have your hands on a highly coveted Nvidia GeForce RTX 3060 graphics card then we certainly wouldn't advise cracking it open (as you'll void the warranty) but if you did then you might find something you're not expecting.",
    "TechPowerUp discovered that defective dies from a much beefier card (allocated as GA104, a die used in the GeForce RTX 3060 Ti, RTX 3070 and RTX 3070 Ti GPUs) are being used in an RTX 3060 variant, though one with the same SKU. The original GeForce RTX 3060 uses a GA106 die, but it's unlikely that this new RTX 3060 model will get a dedicated model name.",
    "Word's like 'defective' might concern you, but there's nothing to worry about. As Tom's Hardware reports, you'll likely find that these cards perform as expected for an RTX 3060, which is why they were recycled into the less powerful GPU rather than being scrapped. Given we're in the midst of a global shortage of silicon, it's important to try and preserve as many operational semiconductors as possible, and as they say, waste-not, want-not.",
    "This isn't the first time we've seen Nvidia reusing hardware from other SKUs, and it certainly won't be the last. Production of silicon has its issues as much as any other industry, and recycling unsatisfactory components into a usable product is hitting two birds with one stone.",
    "Manufacturing and supply issues plaguing the graphics card market won't be solved overnight, and with the RTX 3060 being the most affordable GPU in the desktop Ampere lineup, available inventory for one of the best graphics cards can increase without the precious silicon going to waste.",
    "Availability of the RTX 3060 is stiff iffy, and while we've seen some regional improvements on the astonishingly inflated prices, it's almost impossible to find one near MSRP (with the same issues also affecting other Ampere models). Recycling underpowered hardware into a more appropriate card isn't going to solve much of anything, especially as the global chip shortage could keep its grip on the industry into and throughout 2022.",
    "You might find yourself slightly peeved that these GPUs are being sold without a separate SKU to distinguish them from models using their intended dies, but given the impact on performance is negligible, you probably won't notice unless you did actually crack open your hardware.",
    "In fact, if history teaches us any lessons, you might actually be getting a better deal out of this situation. A similar die switch occurred with the EVGA GeForce RTX 2060 KO Gaming, upgrading from a smaller TU106 die to a larger TU104 die.",
    "While gaming benchmarks didn't reveal any difference, the 'upgraded' die performed better at rendering in applications like Blender, so there's always the chance you could squeeze a little extra out of a larger defective die. We won't know for sure until some benchmarks appear online though."
  ],
  "headers": {
    "2": "Reduce, reuse, recycle.",
    "5": "Analysis: Look on the bright side"
  },
  "links": {
    "Nvidia GeForce RTX 3060 graphics card": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "GeForce RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "Tom's Hardware": "https://www.tomshardware.com/uk/news/faulty-rtx-3070-ti-dies-in-rtx-3060",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3060": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-find-stock-here",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "global chip shortage could keep its grip on the industry": "https://www.techradar.com/news/global-chip-shortage-could-drag-on-until-2023"
  }
}