{
  "source": "https://www.techradar.com/news/super-fast-480hz-gaming-monitors-could-be-here-by-2023-but-do-you-need-one",
  "title": "Super-fast 480Hz gaming monitors could be here by 2023, but do you need one?",
  "category": "computing",
  "updated": "2021-07-26T10:35:55Z",
  "author": "darren-allan",
  "summary": "These kind of displays do have a point, but will be a very niche proposition",
  "article": [
    "Ridiculously fast 480Hz refresh rate monitors are expected to arrive in 2023, giving competitive gamers more options in high-end panels to get the absolutely smoothest frame rates – at a price, naturally.",
    "TFT Central reports that both AU Optronics and LG Display have LCD panels with a 480Hz refresh rate in the pipeline, with lower latency and a 2.1ms frame time. That far outpaces the best gaming monitors available today, with high-end models that currently top out at 360Hz and a 2.8ms frame time.",
    "LG is developing this tech now with a view to supposedly producing these panels late in 2022, so they won’t turn up in actual monitors on shelves until 2023. The displays will be 1080p, unsurprisingly – we’ll come onto why in a moment – and reportedly the first monitor will be a 24.5-inch affair (with HDR 400 support).",
    "The AU Optronics panel running at 480Hz will be 1080p, too, and it’s apparently also scheduled for production in 2022 at some point, so again we are likely looking at a 2023 release date for monitors with this panel. A 1440p at 360Hz panel is also planned, as is a 4K product running at 240Hz, so advancements are coming down the line, not just to Full HD resolution gaming monitors. AU Optronics will use AHVA panels, in other words, IPS-like efforts rather than the TN screens which most current 360Hz gaming monitors favor.",
    "360Hz panels which are well-established are blisteringly fast, and already difficult to drive to their full potential. 360Hz means that the screen is capable of displaying 360 frames per second (fps), for seriously super-smooth gameplay, but of course, you also need a PC and beefy graphics card that’s capable of running the game you’re playing at 360 fps – and a solid 360 fps at that.",
    "No mean feat, particularly with some contemporary games which can be very demanding on your hardware. Now, these monitors are 1080p, but even at that resolution, it’s difficult to run a game at 360 fps – let alone 480 fps, which the new breed of ultra-fast refresh rate monitors will require.",
    "The other thorny issue is whether there’s any realistic gain to be had from pushing to 480Hz, in terms of this kind of huge fps count even being perceptible. While the human eye may not be able to perceive hugely high refresh rates as such, there is a benefit in terms of eliminating motion blur (and strobing nastiness) to produce an effect and motion which feels more akin to real life, as it were, as Blurbusters discussed when looking at future potential 1000Hz displays (yes, 1000Hz).",
    "So, there is a benefit to pushing harder and harder with refresh rates, then, and reaching 480Hz in two years, but these monitors will doubtless be very pricey at launch and will need super-powerful PCs (with equally weighty price tags) to drive them. In other words, they will remain a more niche proposition and the province of serious competitive gamers (or those with a ton of cash).",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "4": "Analysis: Do you really need this?"
  },
  "links": {
    "AU Optronics": "https://tftcentral.co.uk/news/au-optronics-latest-panel-development-plans-july-2021",
    "LG Display": "https://tftcentral.co.uk/news/lg-display-latest-panel-development-plans-july-2021",
    "best gaming monitors": "https://www.techradar.com/news/best-gaming-monitor",
    "currently top out at 360Hz": "https://www.techradar.com/news/nvidias-new-360hz-monitors-are-going-to-have-a-must-have-feature-for-esports-enthusiasts",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Blurbusters": "https://blurbusters.com/blur-busters-law-amazing-journey-to-future-1000hz-displays-with-blurfree-sample-and-hold/",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/lg-auo-developing-480hz-display-panels"
  }
}