{
  "source": "https://www.techradar.com/news/microsoft-teams-update-will-make-it-much-easier-to-find-what-youre-looking-for",
  "title": "Microsoft Teams update will make it much easier to find what you're actually looking for",
  "category": "computing",
  "updated": "2021-08-05T10:27:39Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams search functionality is about to become more intelligent",
  "article": [
    "Microsoft is working on an update for its collaboration platform Teams that will help users navigate more quickly to the information they are looking for.",
    "As per a new entry in the company’s product roadmap, the Microsoft Teams search feature will soon benefit from a new component, called Top hits.",
    "“Top hits is a new section at the top of the autosuggest results in search where users will see the most relevant results across people, chats, files and more,” explained Microsoft.",
    "Although still currently under development, the new feature is set to roll out in a public Teams build by the end of the month.",
    "Since the start of the pandemic, Microsoft has been transparent about its ambitions to turn Teams into a central hub for working. By this, the company means it wants to bring together all the functionality professionals need under one roof, from messaging and video conferencing to file-sharing, project management and more.",
    "As the range of Teams features expands, however, the search functionality becomes all the more important, allowing users to surface specific information, files and chat items more easily.",
    "Currently, autosuggest provides a handful of possible results broken down by type and users can narrow down results by applying a range of different filters. There are also a few in-built hacks, such as using an asterisk at the end of a search term to bring up all content with a common prefix (e.g. searching “serv*” will yield results relating to service, servers etc.).",
    "However, the Top hits section should add another layer of intelligence to existing search functionality, improving the likelihood users are able to find what they are looking for first time round. According to Microsoft, the addition will help “improve discovery and reduce search times” and, in turn, provide a boost to productivity."
  ],
  "headers": {
    "4": "Search in Microsoft Teams"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1100632317222999700&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D83576",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "file-sharing": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "project management": "https://www.techradar.com/best/best-project-management-software"
  }
}