{
  "source": "https://www.techradar.com/news/back-4-blood-might-miss-out-on-one-of-left-4-dead-2s-best-features",
  "title": "Back 4 Blood might miss out on one of Left 4 Dead 2’s best features",
  "category": "gaming",
  "updated": "2021-08-05T19:15:00Z",
  "author": "adam-vjestica",
  "summary": "‘I’d love to if we can’",
  "article": [
    "Back 4 Blood is shaping up to be a worthy successor to Left 4 Dead 2, but one key feature of Valve’s decade-old series might be missing.",
    "In an upcoming interview on TechRadar, we quizzed Turtle Rock Studios co-founder and design director Chris Ashton about mod support in Back 4 Blood, and his answer was, perhaps understandably, rather cautious.",
    "“Unknown at this point in time,” said Ashton. “It’s certainly more challenging these days than it used to be, but you know I love mods, I love modding, it’s where I got my start in games. I’d love to do it if we can but it’s definitely a big challenge. I’d love to see it.”",
    "Ashton’s reply is somewhat encouraging, then, as the door hasn’t been closed on mod support entirely. However, we wouldn’t expect to see mods appear anytime soon as other priorities such as balancing, new content and implementing feedback from the community will surely take precedence for the foreseeable.",
    "Despite being released in 2009, one of the reasons why Left 4 Dead 2 continued to be popular for many years is due to mod support, which allows players to manipulate a game in numerous ways.",
    "Some of Left 4 Dead 2's greatest mods range from graphical improvements, like better blood textures, to the ridiculous, like changing the Tank enemy in Left 4 Dead 2 into Shrek.",
    "As Ashton admits, many game developers and designers cut their teeth making mods, and modding can even lead to full-blown titles being developed. PUBG was originally an ARMA 3 mod, after all, though not every game is suitable for tinkering by the community.",
    "While mods are still easier to implement on PC and far more commonplace, mods have slowly made their way to console in games like Fallout 4 and The Elder Scrolls V: Skyrim. It would be great to see mods come to Back 4 Blood, particularly as we’d love to see what players could do with different game types, new zombie variants and a bit of imagination.",
    "Back 4 Blood will be release on October 12 on PS5, PS4, Xbox Series X/S, Xbox One and PC. It will also launch on day one for Xbox Game Pass subscribers."
  ],
  "headers": {
    "4": "Analysis: why mods are still important"
  },
  "links": {
    "Back 4 Blood": "https://www.techradar.com/news/back-4-blood-release-date-cross-play-beta-trailers-and-characters",
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
    "Fallout 4": "https://www.techradar.com/news/gaming/fallout-4-the-good-the-bad-and-the-ugly-of-the-boston-wastelands-1308511",
    "The Elder Scrolls V: Skyrim": "https://www.techradar.com/news/skyrim-comes-to-xbox-game-pass",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}