{
  "source": "https://www.techradar.com/news/how-smaller-businesses-can-thrive-during-covid-19",
  "title": "How smaller businesses can thrive during COVID-19",
  "category": "computing",
  "updated": "2021-01-21T11:40:40Z",
  "author": "aisling-keegan",
  "summary": "SMEs putting inherent agility and flexibility to action",
  "article": [
    "As the ‘new normal’ settles into our lexicon, inciting a mixture of excitement and dread, small businesses and savvy entrepreneurs need not be as phased as their larger counterparts. In fact, for many smaller businesses with disruption and adaptation built into their DNA, it is business as normal – with those that are digitally native and intuitively agile likely to come out on top.",
    "This is certainly a positive lens, through which to view the impact of the pandemic – but amid the trials of these times, it is important to take stock and take heart where possible. What has been a major workforce transformation for larger scale businesses has been a pivot for many micro-businesses, entrepreneurs and small businesses. Due to their nimble nature, innovation throughout the pandemic so far has happened at pace – keeping up with the shift in demands from homebound consumers. Pubs, cafés and restaurants turned to food deliveries, personal trainers went online and bakeries provided sourdough starter kits. Of course, this has been easier in some industries, compared to others.",
    "No industry was left out when it came to shouldering the shock of the initial lockdowns – and recovery across industry has been influenced by regional approaches throughout Europe. In the UK, the latest ONS figures show that monthly GDP in July 2020 was 11.7 per cent below the level of February 2020, having risen by 6.6 per cent compared with June 2020. This monthly rise reflects widespread growth across construction, manufacturing and services. For example, services saw widespread improvement in July 2020, with over half of the growth coming from industries where continued easing of lockdown restrictions had a significant impact, namely education, motor trades, pubs and restaurants, personal services, and hotels and accommodation.",
    "As we look ahead, rebuilding, recovering and boosting resilience, that start-up sparkle is needed. Larger businesses have long been inspired by start-up dynamics, with flexible and millennial-centric cultures. Indeed, those businesses that had already started to act upon these notions, instigating a remote workforce and prioritizing digital transformation, were served well during the initial shock of the pandemic. Never has business agility been so critical.",
    "This is not to underestimate the stress placed upon smaller businesses as the impact of COVID-19 rumbles on, exposing the vulnerabilities in resiliency due to tighter margins. In most European nations smaller businesses make up the fabric of the economy and in some of the worst hit regions, like Northern Italy, they are even more critical to local economic structures. This appreciation has led to stimulus packages from the EU and local governments – and lockdowners buying local where possible.",
    "Supporting smaller businesses with liquidity formed a key part of national rescue strategies. On April 6th the European Commission made €8 billion available for small and medium businesses, while unlocking a further €1 billion from the European Fund for Strategic Investments for the European Investment Fund. This served to incentivize local banks and lenders to support at least 100,000 small businesses across the region.",
    "In the UK, the Government has announced a new £20 million package to support the recovery of smaller businesses with £1,000 and £5,000 grants. According to the Regional Growth Minister Simon Clarke this will enable smaller businesses to pay for the expertise, equipment and technology they need to adapt, recover and rebuild.",
    "Small businesses were born ready to innovate and disrupt – and with access to financial support they can thrive, even in disrupted times. A recent Capterra study, including 412 British SME employees and managers found that 51 per cent had to implement new software since the beginning of the crisis – with 76 percent having to change their business offering as a result of the pandemic. Cue: virtual events and experiences. Remote desktop software, live chat software and video conferencing software are the three most popular software purchased by SMEs. Meanwhile, the study found that 35 per cent of respondents have brought forward their annual spend in software by 6 months.",
    "Digital transformation is key to the survival of businesses as they seek increased agility, among shifting consumer demands for products and services – and small businesses are perfectly placed to seize new opportunities. As Winston Churchill once said, ‘Never waste a crisis.’ But with current pressures and cost optimizations afoot, making the right purchasing decisions is more important than ever.",
    "Ensuring a small business’s technology stack is secure, connected and agile is critical. While much of the focus was initially on the scramble for devices in order to get employees working remotely, for smaller businesses more serious pain points lie beneath the question of cybersecurity. As security breaches and phishing attacks accelerate through the pandemic, everyone is vulnerable to attack. But if we revisit Capterra’s study, we see that security does not seem to be a priority for small businesses, with only 10 percent and 11 percent respectively investing in Virtual Private Network (VPN) software and endpoint protection software.",
    "While the new normal is not so new for entrepreneurs and small businesses, already accustomed to disrupting markets and flexing to the needs of consumers, this is an opportunity for them to future-proof their operations with savvy tech investments. Just as larger businesses look to them as they evolve to meet the demands of a digital world, smaller businesses can look the other way, too. After all, they’re two sides of the same coin."
  ],
  "headers": {
    "3": "Start-up sparkle",
    "7": "Digital transformation is key",
    "10": "Opportunity to future-proof"
  },
  "links": {
    "small businesses": "https://www.techradar.com/best/best-small-business-software",
    "remote": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "Remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "live chat software": "https://www.techradar.com/best/best-live-chat-software",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "VPN": "https://www.techradar.com/vpn/best-vpn-for-business",
    "endpoint protection": "https://www.techradar.com/news/best-endpoint-security-software"
  }
}