{
  "source": "https://www.techradar.com/news/runkeeper-vs-strava",
  "title": "Runkeeper vs Strava: choose the best running app for you",
  "category": "fitness",
  "updated": "2021-01-20T14:22:58Z",
  "author": "emily-abbate",
  "summary": "How to pick the right app to achieve your goals",
  "article": [
    "We’ve become a society that craves data points. We want to know about the quality of our sleep, what’s going on with our blood oxygen levels, and when it comes to activity – specifically running – we love to know the ins and outs of every stride. Questions arise, like: Is today’s workout faster than last weeks? Was I able to go further or for longer?",
    "Of course, this data can be collected via some sort of a wearable, like a Garmin, Apple Watch, or other fitness tracker, but the connected apps are where the real gems lie.",
    "While there's no shortage of available apps to track your workout activity, two of the most popular when it comes to runners are RunKeeper and Strava. Today, we’re breaking down the ins and outs of both apps, and offering up our pick for your fitness best bet.",
    "Cost: Free, or upgrade to Strava Summit, the premium service, for $5.00 / £5.99 / (about AU$7) per month or $59.99 / £47.99 (about AU$80) per year",
    "Download: iPhone, Android",
    "Strava is essentially the social fitness app built for endurance athletes, where you’ll find everyone from your neighbor to seasoned pros like Molly Seidel and Meb Keflezighi logging their workouts.",
    "Similar to Instagram or Facebook, each athlete has a home feed. In this feed, you’ll see workouts logged by the people you follow, and there you can give them 'kudos' for a job well done or leave a comment on that particular effort. This is the basis for the app, as well as offering up users a place to share their route data. Users can also create and join clubs, in which activity readouts from members appear all in one place.",
    "When it comes to actually logging activity, individuals can choose to share their workouts with the app via smartwatch or record an effort (options range from running and cycling to more unconventional picks like kitesurfing, snowshoeing, and stand up paddleboarding) live using the 'record' feature.",
    "Of course, a smartwatch will give you certain data points you’re craving that a handheld phone cannot — including heart rate and heart rate zones — and may even be a tad less accurate on other important information pending GPS signal strength. The app will, however, let you know whether or not it has found a reliable signal before you get moving.",
    "Strava also aggregates your monthly and annual totals, including time, distance, and activities for cycling, running, and swimming.",
    "Cost: Free, or upgrade to Runkeeper Go, the premium service, for $9.99 (about £8 / AU$15) per month or $39.99 (about £30 / AU$55) per year",
    "Download: iPhone, Android",
    "Runkeeper by Asics skews more toward total beginners than Strava, guiding the user through an experience and helping them set goals. Upon signing into the app, you’ll get to articulate exactly what your aspirations might entail — from losing weight or maintaining fitness to improving your mental health or training for a race. The app then asks you a few other particulars (including 'what’s the longest run you’ve done in the past 90 days?') to be able to better recommend challenges or training plans.",
    "Once you’re in the app, you’ll have the option to start a training plan or simply start a workout (options include running, cycling, walking, hiking, skating, swimming, rowing, and a few others) with one single tap. Similar to Strava, the app will let you know once its acquired a GPS signal for optimal tracking before you click 'start'.",
    "Over time, you’ll be able to check out your stats, including total miles traveled, activities done, average paces and distances, and other achievements (including badges for 5K, 10K, half marathon, and marathon distances). Plus, using another simple survey, the app can help you to set training goals.",
    "RunKeeper also has social network capabilities, but admittedly, you may have a harder time finding your IRL friends over here. One of the biggest perks of the Runkeeper App is its integration with Asics Studio, filled with audio guided runs that can help make the miles go by faster and offer up expert-backed coaching tips on everything from form to cadence.",
    "Both apps offer users great data and encouragement, although there’s no refuting that Strava is more widely used — downloaded by 50 million people in 195 countries, and the company claims it attracts a million new users a month. Runkeeper has fostered that encouragement into the DNA of their app, while Strava empowers more and more individuals to connect with one another to boost morale and continually show up.",
    "Regardless of which one you choose, downloading one and getting out there is what’s really important: People who use exercise apps are more likely to exercise during their free time than those who do not use exercise apps, according to research published in the Journal of Medical Internet Research. And whatever motivation encourages you to be a healthier (and perhaps, happier) version of you? We’re completely on board."
  ],
  "headers": {
    "3": "What you need to know about Strava",
    "10": "What you need to know about Runkeeper",
    "16": "Which one is best for you?"
  },
  "links": {
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "Apple Watch": "https://www.techradar.com/reviews/wearables/apple-watch-1264567/review/reviews/apple-watch-6-review",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "iPhone": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1341029949856468700&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Frunkeeper-gps-running-tracker%2Fid300235330",
    "Android": "https://play.google.com/store/apps/details?id=com.fitnesskeeper.runkeeper.pro&hl=en_GB&gl=US",
    "Strava": "https://www.strava.com/dashboard",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Runkeeper": "https://runkeeper.com/"
  }
}