{
  "source": "https://www.techradar.com/news/samsung-ddr5-memory-launchcould-be-a-huge-step-forward-for-computing",
  "title": "Samsung DDR5 memory launch could be a huge step forward for computing",
  "category": "computing",
  "updated": "2021-03-25T10:28:57.454Z",
  "author": "mike-moore",
  "summary": "Aimed at advanced computing use cases",
  "article": [
    "Samsung has revealed its first 512GB DDR5 memory module based on the new High-K Metal Gate (HKMG) process.",
    "DDR5, the new standard in DRAM (Dynamic Random Access Memory), is aimed at the demands of compute-hungry, high-bandwidth workloads in supercomputing, artificial intelligence (AI) and machine learning (ML), as well as data analytics applications.",
    "As successor to the popular DDR4, DDR5 promises to double the performance at up to 7,200 megabits per second (Mbps), which is good enough speed to process two 30GB ultra-high definition movies in one second - with the new HKMG solution helping to reduce power leakage.",
    "DDR memory can send and receive data signals twice during a single clock cycle and allows for much faster transfer rates and higher capacities.",
    "HKMG technology is traditionally used in logic semiconductors, where it leverages a high dielectric material in the insulation layer to reduce the leakage of current.",
    "In DRAM structures this insulation layer is thinned, which often results in higher leakage current. But with its new DDR5, Samsung has now replaced the insulator with HKMG material to not only reduce leakage, but also use less power - making it ideal for datacenters where energy efficiency is becoming increasingly critical.",
    "The HKMG process was adopted in Samsung’s GDDR6 memory in 2018 for the first time in the industry before now being expanded to DDR5 memory. Samsung said it also applied through-silicon via (TSV) technology for the latest DDR5 memory to stack eight layers of 16-gigabit DRAM chips for the industry’s top capacity of 512GB.",
    "Besides the 512GB module, Samsung is currently sampling different variations of its DDR5 memory product family to customers for verification and certification - which includes partners such as Intel.",
    "“Intel’s engineering teams closely partner with memory leaders like Samsung to deliver fast, power-efficient DDR5 memory that is performance-optimized and compatible with our upcoming Intel Xeon Scalable processors, code-named Sapphire Rapids,” said Carolyn Duran, vice president and general manager of memory and IO technology at Intel.",
    "Samsung’s DDR5 also features an Error Correction Code (ECC) circuit to enhance reliability, with the hardware expected to assist in powering the computers needed for, among others, medical research, financial markets, autonomous driving, and smart cities.",
    "Samsung’s HKMG-based 512GB DDR5 memory is still in the verification stage, but is likely to be available on the market in the latter half of 2021."
  ],
  "headers": {
    "4": "HKMG technology"
  },
  "links": {
    "DDR5 memory": "https://www.techradar.com/news/samsungs-superfast-ddr5-ram-will-arrive-in-2021-but-dont-plan-to-upgrade-your-pc-just-yet",
    "DDR5": "https://www.techradar.com/news/samsungs-superfast-ddr5-ram-will-arrive-in-2021-but-dont-plan-to-upgrade-your-pc-just-yet"
  }
}