{
  "source": "https://www.techradar.com/news/google-pixel-6-might-not-have-under-display-camera-but-pixel-7-might",
  "title": "Google Pixel 6 might not have under-display camera, but Pixel 7 might",
  "category": "phones",
  "updated": "2021-05-17T09:32:35Z",
  "author": "james-rogerson",
  "summary": "According to a patent",
  "article": [
    "There’s evidence that a number of companies might launch phones with under-display selfie cameras soon, and it now looks like Google could be among them. While we wouldn’t expect this feature on the Google Pixel 6, a patent for such a system makes us a think it might be ready in time for the Pixel 7 or the rumored Pixel Fold.",
    "The patent – spotted by LetsGoDigital – is for a 'full-screen display with sub-display camera', but the system used is a bit different to what we’ve seen on patents from other companies, or on the ZTE Axon 20 5G, which has already launched with an under-display camera.",
    "In most cases, the selfie camera is positioned in a similar way to punch-hole selfie cameras, just with a tiny secondary display panel over the top, so it can be hidden when not in use. Here though, the selfie camera lens doesn’t actually point towards you.",
    "Instead, the display has a little ‘window’ in it, with a mirror underneath. The selfie camera is to one side of that mirror, while a tiny secondary screen is at the other side.",
    "When the selfie camera is in use, the mirror allows the lens to collect the required light, and when it’s not, the mirror rotates and reflects content from the secondary screen onto the window in the main display. It’s a complicated system to describe, but the images below may make it clearer.",
    "Both the main and secondary screens are OLED panels with the same pixel density, so they should allow for a seamless viewing experience. Yet it’s not entirely clear what this complicated setup achieves. Perhaps it makes the selfie camera truly invisible – something which the ZTE Axon 20 5G failed to do, but that’s just speculation for now.",
    "It’s worth noting that just because Google has patented this idea, it doesn’t mean the company will ever use it in a phone. But it seems like under-display cameras could be one of the next big things in smartphones, so we’d think it’s likely to.",
    "Given that we’ve seen leaked images of the Google Pixel 6 range with a visible selfie camera, it’s very unlikely that the feature will be included there, but as noted above we wouldn’t be surprised if it’s used in the Pixel 7 or the Pixel Fold."
  ],
  "headers": {},
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "rumored Pixel Fold": "https://www.techradar.com/news/the-google-pixel-fold-could-be-real-and-coming-this-year",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/google-pixel-smartphone/",
    "ZTE Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "leaked images of the Google Pixel 6": "https://www.techradar.com/news/google-pixel-6-renders-show-the-massive-redesign-the-range-needs"
  }
}