{
  "source": "https://www.techradar.com/news/could-opera-be-taking-inspiration-from-windows-11-already",
  "title": "Could Opera be taking inspiration from Windows 11 already?",
  "category": "computing",
  "updated": "2021-07-27T14:19:21Z",
  "author": "daryl-baxter",
  "summary": "Breaking down our interview",
  "article": [
    "Opera looks to be already planning the next phase of its web browser with Windows 11 on the horizon.",
    "After our chat with the team, we were assured that Opera were encouraged by the new look of Windows 11, with a more modern taskbar and context menus that look much more elegant than what’s appeared in Windows in recent years.",
    "However, web browsers are seeing something of a redesign in recent times, from their perception of what a browser should do, to what it looks like.",
    "Opera is very aware of this, and seemingly wants to make sure that it’s the best alternative to users when some want a change from Google Chrome and Microsoft Edge.",
    "Opera has been working on plenty of features to its browser lately, namely a refined design in the R5 update, and now a version that’s available on Google Chromebooks. During our chat with the team, we asked if the gaming version of the browser, Opera GX, would come to Chromebooks as well.",
    "Opera GX is Opera’s take on web browsers for gaming. From its neon-red user interface to features that help gamers check on the latest deals for games and hardware, it’s a browser that’s tailored to a specific user on both Android and PC devices. With Opera now on Chromebooks, we could see the GX variant appear soon.",
    "“Let’s see. We just launched the mobile version of Opera GX, so it’s now available on all major platforms other than Chromebook.” said Stefan Stjernelund, product manager Opera for Android and Arjan van Leeuwen, Product Engineering Lead for Opera Desktop.",
    "However, with Windows 11 on the way, we were curious as to whether the team were looking into a slight redesign of Opera’s user interface to better match the new look of Microsoft’s upcoming operating system:",
    "“We are exploring our options but our goal will be to bring Opera to the Microsoft Store as soon as possible. So far, we’ve seen a bit more user-friendliness in the new Windows 11 UI and, of course, any such changes that make our users’ lives easier on Windows are welcome.”",
    "We’ve seen some major changes in appearances to operating systems over the years. Apple’s operating system has seen redesigns in Mac OS X 10.10 Yosemite and macOS 11 Big Sur to better reflect the appearance of iOS.",
    "Meanwhile, redesigns of Windows have been a staple of major releases, with Windows XP, Windows Vista and of course Windows 8 being received with polarizing reception from its users due to their overhauled looks.",
    "With Windows 11, Microsoft is refreshing every part of the operating system, from the right-click menus to having every window be rounded, dragging Windows into the modern age.",
    "As Opera looks towards a future where more users are installing its browser, it should be a priority to make it look as though it’s at home on Windows 11, with the design language and color-scheme matching the new look that Microsoft is still refining.",
    "It looks as though now is a great opportunity to give users a choice as to what they want to use as their default web browser. The way we use our default browsers has certainly changed in the last 18 months, with many people working from home and using different browsers to separate work from pleasure.",
    "With Opera looking to double-down on making its browser available to more users across different platforms, we may see the company become one a web browser trend-setter, rather than being the one left in the dust of others."
  ],
  "headers": {
    "4": "The Opera House",
    "9": "Analysis: Could we see a Windows 11 influence for Opera?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "our chat with the team": "https://www.techradar.com/news/can-opera-finally-sing-on-googles-chromebooks-and-windows-11",
    "Opera GX": "https://www.opera.com/gx"
  }
}