{
  "source": "https://www.techradar.com/news/xiaomi-electric-car-on-the-cards-as-it-announces-ev-ambition",
  "title": "Xiaomi electric car on the cards as it announces EV ambition",
  "category": "car-tech",
  "updated": "2021-03-30T13:49:23Z",
  "author": "aakash-jhaveri",
  "summary": "Will it beat the Apple Car to market?",
  "article": [
    "Electric cars have been an intriguing space, piquing the attention of automobile and tech companies alike. The newest entrant to throw its hat in the ring is Xiaomi - yes, the Xiaomi that makes smartphones.",
    "Ahead of its Spring event in China, Xiaomi made things official, announcing a new subsidiary for smart electric vehicles. Rumors of this special department first surfaced last year, and then again a few weeks ago. In fact, the company also went on record last month to say it had no intentions of making this move.",
    "In the first phase, Xiaomi will earmark an investment of CNY 10 billion (around $1.5 billion, £1.1 billion or AU$2 billion) for the research and development of EVs. It expects the amount to be closer to $10 billion over the next ten years. As for the company structure, Xiaomi’s founder Lei Jun will concurrently serve as the CEO of the new smart electric vehicle business.",
    "Details are currently scarce, but the announcement outlines the subsidiary’s vision: “Xiaomi hopes to offer quality smart electric vehicles to let everyone in the world to enjoy smart living anytime, anywhere.”",
    "Reports suggest that Xiaomi will partner with China’s Great Wall Motors for its manufacturing prowess and tech expertise in the electric vehicle space. While it might not be a well-known brand outside of its home country, Great Wall Motors owns brands such as Haval, Wey, Ora and others, dominating a significant share of China — the world’s largest electric vehicle market.",
    "If history is anything to go by, we shouldn’t get excited about a new EV maker. Far too many companies have made tall claims and shown off fancy concepts without being able to begin shipping – let alone reach a stage of profitability. The list includes giants such as Dyson, Faraday Future, Lucid Motors, LeEco and many more.",
    "Even with somewhat controversial offerings, Tesla remains the only solely electric car company to reach operating profitability. Its lead can be attributed to heavy research and development investments, battery technology breakthroughs, manufacturing efficiencies and unmatched charging infrastructure.",
    "The closest Xiaomi has come to creating EVs has been hoverboards and alternatives to Segways via its Ninebot company. It remains to be seen if Xiaomi’s first smart electric vehicle will be a car, two-wheeler, public transport or something else entirely. It is likely to be confined to China for the initial years, with global expansion depending on its success and growth.",
    "More details on Xiaomi’s electric vehicles and future product roadmap will be revealed during its keynote, which is scheduled for later today."
  ],
  "headers": {},
  "links": {
    "no intentions of making this move": "https://www.techradar.com/news/xiaomi-says-no-electric-car-launch-for-now-but-things-may-change-in-the-future"
  }
}