{
  "source": "https://www.techradar.com/news/google-pixel-phones-forget-daylight-savings-time",
  "title": "Google Pixel phones are the latest piece of tech to mess up daylight saving",
  "category": "phones",
  "updated": "2021-03-15T15:22:08Z",
  "author": "rhys-wood",
  "summary": "Google forgot to save the daylight",
  "article": [
    "Some Google Pixel phone owners in the US appear to have been blindsided by daylight savings time, as users reported their devices didn’t update to reflect the changes where clocks are supposed to go forward by one hour.",
    "The bug seems to have affected a significant amount of users, with Google Pixel owners taking to Reddit to report the change, or lack thereof. It also seems to be an issue with various Google phones, as owners of the Google Pixel 3, Pixel 4, Pixel 5 and the budget Pixel A devices saw that their clocks didn’t reflect daylight savings time changes.",
    "The most likely culprit behind the bug seems to be the “use network-provided time” option, an automatic time feature that’s supposed to account for events where the time goes forward and back.",
    "This Google Pixel blunder isn't the first time a tech company has managed to miss the mark on reliably updating to daylight savings time. The Apple Watch 4 had issues processing the daylight savings time change, and for many users, got caught in an endless reboot loop.",
    "That was a few years ago, but it seems like even the biggest tech companies are still struggling integrating daylight savings into their devices. Either this is something the likes of Google and Apple need to work on, or alternatively, we could do with axing daylight savings as a concept altogether.",
    "If you’re in the US and own a Google Pixel phone, make sure to double check the time your phone is telling you. If the time on your phone hasn’t updated, you might be better off setting the time manually by going into your phone’s Settings menu, followed by System & updates, and then selecting the Date & Time option. A reboot of your Google Pixel device might also do the trick.",
    "Google Pixel users in the UK may want to take note: daylight savings time for you will take place on March 28. If you’re worried about being late for work or an appointment due to the bug, it could be beneficial to set a reminder to change your time manually ahead of the change.",
    "Hopefully Google already has a fix in the works, though, as keeping on top of the daylight savings time change can already be a headache without such a bug complicating things even further."
  ],
  "headers": {
    "3": "Times are changing"
  },
  "links": {
    "Google Pixel phone": "https://www.techradar.com/news/best-pixel-phones",
    "Reddit": "https://www.reddit.com/r/GooglePixel/comments/m4vkio/daylight_savings_failed_to_turn_clock_forward/",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Apple Watch 4": "https://www.techradar.com/news/daylight-saving-time-is-reportedly-causing-apple-watch-series-4-reboots"
  }
}