{
  "source": "https://www.techradar.com/news/sony-x90j-4k-tv-price-release-date-specs",
  "title": "Sony X90J 4K TV price, release date and specs",
  "category": "televisions",
  "updated": "2021-06-03T13:34:54Z",
  "author": "henry-st-leger",
  "summary": "Sony's step-down 4K TV could be a smart buy this year",
  "article": [
    "The Sony X90J could be placed to win over the hearts of many TV shoppers in the year ahead.",
    "It's not Sony's flagship model, and it doesn't feature an OLED panel like the A90J and A80J models, so why the excitement over a mid-range 4K TV like this?",
    "The answer is in the price. The Sony X90J is the successor to last year's popular XH90, which was a mid-spec television with 4K resolution, excellent HDR, and solid sound all packaged at a very reasonable price.",
    "As much as we like to fawn over the high-end televisions out there, it's the models further down the range that actually end up in more people's homes, still offering a lot of the new functionality and capability of premium sets – with a few choice compromises to bring the price down.",
    "The XH90 was one of very few Sony TVs last year to get support for HDMI 2.1, too, meaning that it acted as a forerunner to the more widespread HDMI standard in this year's range. And many will be looking to the X90J to get a 4K TV that meets their requirements – possibly for the Sony PS5 or Microsoft's Xbox Series X.",
    "But how much will the Sony X90J cost, when will it release, and will it be worth it? Read on for everything you need to know.",
    "The Sony X90J is available in a variety of sizes. The base model comes in 50-inch, 55-inch, 65-inch and 75-inch sizes, while an X92J variant comes in at 100 inches.",
    "There's no pricing as of yet, but last year's XH90/X900H started at $999 / £1,299 for a 55-inch size. Given the X90J has an even smaller 50-inch size, we would expect to see an even lower starting point.",
    "The 65-inch XH90 retailed for $1,399 / £1,499, while the 75-inch retailed for $2,499 / £2,199 (around AU$3,600) and its largest 85-inch size retailed for $2,799 / £3,299. The new 100-inch size for the X90J, then, should cost more than that.",
    "The Sony X90J is not yet available to pre-order. Higher-end Sony sets like the A80J or A90J are, however, and will be arriving with shoppers in late March / early April. We would expect the LCD 4K models in Sony's range to be available shortly after this.",
    "Sony TVs tend to come to Australia a little later (the X90J isn't even listed on Sony's AU website yet) but it should happen eventually.",
    "While the X90J doesn’t have all the fancy features like the color sensor of the Z9J or the X-Contrast Pro of the A90J OLED, the X90J has the one feature that really counts: the Cognitive XR Processor.",
    "With it, the X90J has the same XR 4K Upscaling as the other TVs, and the same XR Triluminos Pro tech to enhance colors. This is a 4K TV, as you might have guessed, with both regular HDR and the dynamic Dolby Vision HDR standard supported. You're also getting a Direct Full Array LED backlight with local fimming, rather than the basic edge-lighting found on cheaper sets.",
    "On the audio side, the X90J has Dolby Atmos passthrough as well as 3D Surround Upscaling for a detailed audio effect. The total output is 20W, split into two 10W drivers. You won't get Sony's Acoustic Surface Audio technology, which literally vibrates the screen's panel to emit sound, but that isn't a must-have feature by any means.",
    "As an Android TV, you're getting Chromecast built-in, and support for both Apple Airplay and Apple HomeKit too. Sony is starting to make us of a Google TV smart platform on its OLED sets, but it hasn't come to its LCD screens just yet.",
    "With 4K/120Hz support you'll be able to get detailed movies and fast-paced motion, with some solid HDMI 2.1 support at this price point. There are four HDMI ports, and two of them support VRR (variable refresh rate) and ALLM (auto low latency mode), both key technologies for gaming TVs. At least one HDMI port will support eARC (enhanced audio return channel) for lossless passthrough to a soundbar, too.",
    "For those with narrow counters or media cabinets, the X90J comes with adjustable feet for customizable placement."
  ],
  "headers": {
    "6": "Sony X90J price and sizes",
    "9": "Sony X90J release date",
    "11": "Sony X90J specs and features"
  },
  "links": {
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "A90J": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "A80J": "https://www.techradar.com/news/sony-a80j-oled-price-specs-release-date",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "XH90": "https://www.techradar.com/reviews/sony-xh90-kd-75xh9005-4k-tv",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Sony TVs": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "XH90/X900H": "https://www.techradar.com/reviews/sony-xh90-kd-75xh9005-4k-tv",
    "A90J OLED": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Acoustic Surface Audio": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "Chromecast": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "gaming TVs": "https://www.techradar.com/news/best-gaming-tv",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc"
  }
}