{
  "source": "https://www.techradar.com/news/totally-rated-fortnite-hosts-ariana-grande-for-the-rift-tour",
  "title": "Totally Rated: Fortnite hosts Ariana Grande for the Rift Tour",
  "category": "gaming",
  "updated": "2021-08-06T16:20:19Z",
  "author": "rhys-wood",
  "summary": "Fortnite, The Suicide Squad and Nothing earbuds feature on this week's Totally Rated",
  "article": [
    "In this week’s Totally Rated, Ariana Grande’s next gig is upon us, and it's inside Fortnite. Meanwhile, James Gunn gives the DC Extended Universe a shot in the arm with The Suicide Squad, and we review the new Nothing earbuds to see if they're a worthwhile AirPods alternative.",
    "A battle royale game might not be the first thing you think of when it comes to virtual concerts, but Fortnite continues this trend with an appearance from Ariana Grande, as part of the game's Rift Tour content.",
    "We've also got fresh reviews of James Gunn's DCEU hit, The Suicide Squad as well as the new Nothing earbuds which have Apple's AirPods in their sights.",
    "It's been a very busy week for Fortnite news, as Ariana Grande has partnered with the immensely popular battle royale to host a virtual concert as part of the game's Rift Tour content.",
    "Grande's concert takes place between August 6-8, 2021, showcasing five performances across that weekend. It follows in the footsteps of previous Fortnite concerts hosted by the likes of Travis Scott and Marshmello.",
    "Of course, one of the biggest draws of Fortnite is cosmetics. After all, what's the point of shooting if you can't look good while doing it? Thankfully, players who watch Ariana Grande's concert will get to unlock her as a playable skin alongside other Grande-themed items.",
    "It's not just popstars who are invading Fortnite, however. As two famous World Warriors will debut in the battle royale soon. Street Fighter's Cammy and Guile will be added to the ever-expanding Fortnite roster, and both will come with iconic emotes, such as Guile's Flash Kick.",
    "It seems that Capcom and Epic have an amicable relationship when it comes to Fortnite. Previously both companies worked together to bring Ryu and Chun-Li to the world of Fortnite.",
    "We wonder, then, if more iconic Street Fighter characters will arrive in Fortnite? Or better yet, will we ever see Scorpion and Sub-Zero added to the game, allowing for (sort of) the Street Fighter vs Mortal Kombat brawl we've always wanted?",
    "Nothing has released its first pair of wireless earbuds, and while it's a strong first effort, there are still improvements to be made. Yasmine Crossland from T3 explains: \"So the Nothing Ear (1) true wireless earbuds promised a lot and while they are fantastic affordable buds, they aren't quite going to be ruling the true wireless market just yet.",
    "\"Despite that, though, I do really like them. With a mostly transparent design, the Nothing Ear (1) buds look a bit different even though they’re not quite as different as I expected them to be. The app is well organised and intuitive, and the battery life will definitely be good enough for most people.",
    "\"For less than $100 they manage to pack in loads of extra features, decent sound and effective noise-cancelling tech, which makes them a very convincing buy.",
    "\"They are hardly going to kill off AirPods, yet for anyone who wants cool wire-free headphones without spending a king’s ransom on the very best you can buy, the Nothing Ear (1) buds won’t disappoint.\"",
    "The Suicide Squad finally hit theaters this week, and the reviews were scorching. Director James Gunn, who's no stranger to the superhero genre with Guardians of the Galaxy and the satirical Super under his belt, took on the the second installment of DC's most notorious supervillain team after 2016's Oscar winning original.",
    "It certainly didn't disappoint us, either, with TechRadar's Alex Metz, awarding it four out of five stars: \"Given the sanitized nature of recent superhero adventures, James Gunn’s first DC joyride is absolutely worth the ticket price.\"",
    "Critics and fans alike seem to be enjoying the latest foray into the DCEU, with early ratings giving it 96% certified fresh on Rotten Tomatoes. This is certainly a welcome change for the DCEU, and we hope the franchise can keep up the momentum with future project and director combinations.",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every week."
  ],
  "headers": {
    "3": "Fortnite and Ariana Grande form an unlikely pair",
    "9": "There's Nothing outstanding about these earbuds",
    "13": "The Suicide Squad: a shot in the arm for the DCEU?"
  },
  "links": {}
}