{
  "source": "https://www.techradar.com/news/tokyo-olympics-becomes-the-latest-victim-of-the-fujitsu-hackers",
  "title": "Tokyo Olympics becomes the latest victim of the Fujitsu hackers",
  "category": "computing",
  "updated": "2021-06-07T13:46:53Z",
  "author": "mayank-sharma",
  "summary": "Global sporting events are a favorite target among threat actors",
  "article": [
    "Hackers have made away with data from the computers of the organizing committee of the Tokyo Olympics, according to reports in the Japanese media.",
    "Kyodo News reports that the breach has affected over 150 people, all of whom had earlier participated in a cybersecurity drill ahead of next month’s Olympic Games.",
    "The leaked data included the names and affiliations of the individuals, who were linked with roughly one hundred organizations that are involved in hosting the sporting event.",
    "The breach is reported to have occurred as part of an attack earlier in May, in which threat actors gained access to Fujitsu's project management platform, called Project WEB.",
    "In a campaign similar to a supply-chain attack, hackers supposedly used the compromised collaboration software to leak data from various Japanese government offices.",
    "One of the organizations whose data was leaked was the Japanese government’s National Center of Incident Readiness and Strategy for Cybersecurity (NISC). NISC had performed the cybersecurity drill for the Olympics organizers and has now confirmed that its data was exposed in the Fujitsu attack.",
    "The Japanese report quotes NISC officials as saying that they’ve already contacted the individuals whose details have been leaked.",
    "While the extent of the incident isn’t yet clear, global sporting events have always been a favorite of threat actors, says Merritt Maxim, VP at research firm Forrester.",
    "“High-profile global sporting events such as the World Cup or Olympic Games have been and will remain very tempting targets for hackers because of the potential disruption and notoriety that can result from such attacks,” he said.",
    "Via CyberScoop"
  ],
  "headers": {
    "4": "Supply chain-like attack"
  },
  "links": {
    "Tokyo Olympics": "https://www.techradar.com/news/olympics-live-stream-how-to-watch-tokyo-2020-olympic-games-free-2021-dates-schedule-events",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "project management": "https://www.techradar.com/best/best-project-management-software",
    "collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Japanese government offices": "https://www.itpro.co.uk/security/hacking/359705/hackers-steal-japanese-government-data-in-fujitsu-hack",
    "CyberScoop": "https://www.cyberscoop.com/tokyo-olympics-fujitsu-breach-japan/"
  }
}