{
  "source": "https://www.techradar.com/news/apple-patents-hints-at-macbook-that-can-wirelessly-charge-your-iphone",
  "title": "Apple patents hint at MacBook that can wirelessly charge your iPhone",
  "category": "computing",
  "updated": "2021-01-27T14:52:48Z",
  "author": "axel-metz",
  "summary": "Could your MacBook someday wirelessly charge your other Apple devices?",
  "article": [
    "A pair of newly granted Apple patents show a MacBook wirelessly charging an iPhone, iPad, and Apple Watch, and an iPad wirelessly charging an iPhone and Apple Watch.",
    "The plans were spotted by Patently Apple, the Apple news-gathering blog, which reported the tech behemoth had filed patents for two-way charging coils that can be used to charge the MacBook itself, but which also allow the MacBook to charge other devices.",
    "Could this mean the next line of MacBooks will be able to wirelessly charge your iPhone, iPad and Apple Watch? Well, Apple is typically hazy on the details, deliberately burying the specifics of the patent in customary tech jargon to ensure the claims remain as broad as possible.",
    "The company writes: “A portable electronic device comprising [...] a transmit inductive coil being configured to wirelessly transmit power through the back surface of the enclosure to an external device that is positioned proximate to the back surface of the enclosure.”",
    "See? Not clear at all, really. Of course, patents don’t always mean production – especially when it comes to Apple.",
    "In 2019, Apple canceled its AirPower wireless charging mat project after prototype products failed to meet the company’s lofty standards. Samsung, too, famously jettisoned its plans for a foldable phone – dubbed “Project V” – in 2018, which never saw the light of day.",
    "In any case, it’s clear that MacBook-induced wireless charging is, in some capacity, in the works over at Apple. Whether that functionality arrives with the next generation of M1-powered Macs remains to be seen."
  ],
  "headers": {},
  "links": {
    "reported": "https://www.patentlyapple.com/patently-apple/2021/01/apple-has-been-granted-a-pair-of-2-way-charging-patents-for-a-future-macbook-pro-that-could-recharge-idevices-and-more.html"
  }
}