{
  "source": "https://www.techradar.com/news/wwe-2k22-release-date-news",
  "title": "WWE 2K22 release date, roster, news and what we’d like to see",
  "category": "gaming",
  "updated": "2021-10-09T22:20:30Z",
  "author": "adam-vjestica",
  "summary": "Can you smell what WWE 2K22’s cooking?",
  "article": [
    "WWE 2K22 is coming and its slogan is promising that it \"hits different\", suggesting that the series' hiatus period might have been just the thing to reinvigorate it. Fans will certainly be hoping that WWE 2K22 is a significant improvement over the disastrous WWE 2K20, which led to WWE 2K21 being canceled.",
    "But what do we know about WWE 2K22 so far? Well, thanks to SummerSlam 2021, we know the game is expected to release in March 2022, bucking the series' October release trend.",
    "We also know that when it does release, it'll feature new controls, updated graphics, and a redesigned engine. The game also uses a new facial scanning technology, and 2K claims that 85% of the in-game roster has taken part in having their likenesses scanned into the game.",
    "WWE 2K22 will also include more than 3,400 new animations but more details about the game will be detailed in January 2022 in a full reveal. In the meantime, we've gathered everything we've learned so far about the game below for your perusal.",
    "[Update: Could General Manager Mode be returning in WWE 2K22? Read on to find out more.]",
    "WWE 2K22 is definitely happening, but it won't be out this year. During SummerSlam 2021, 2K and developer Visual Concepts revealed that WWE 2K22 will release in March 2022, which goes against the game's usual October release date trend.",
    "The game's release will line up with the run up to Wrestlemania, where WWE fandom is at fever pitch, but it means that the WWE Universe will have to wait a little longer before a proper wrestling game arrives. We hope, though, that this extra time will mean that when it releases WWE 2K22 might actually be a great wrestling game.",
    "Back in April 2020, 2K released a statement explaining the sudden cancellation of WWE 2K21, and how it planned to make WWE 2K22 the best game yet.",
    "“We hear you and we know you want more from the franchise, so we are applying what we’ve learned to the next WWE 2K simulation game with a renewed focus on quality and fun,” the publisher said. “As part of that commitment, we are extending the production timeline and will not be releasing a WWE 2K simulation game in 2020. We want to ensure the development team can create a great game that will entertain grizzled WWE 2K veterans, as well as newcomers who want to climb through the ropes and step into the ring for the very first time.”",
    "There are high hopes, then, that WWE 2K22 will be a return to form for the franchise, but also that it will dramatically improve upon previous entries, which have been rather lackluster.",
    "We've rounded up all the WWE 2K22 trailers below for your viewing pleasure, including some interesting insights from the development team which show some of the game's new technology in action.",
    "WWE 2K22 SummerSlam trailer The second trailer for WWE 2K22 was unveiled at WWE SummerSlam, and showcased the game's new lighting engine. We also got a glimpse of some superstars who have been confirmed for the game, including Roman Reigns, Bobby Lashley and Kane.",
    "WWE 2K22 teaser trailer",
    "The first trailer for WWE 2K22 dropped during Wrestlemania 37 and stars a photorealistic-looking Rey Mysterio and Cesaro battling it out. We get to see Rey performing his famous \"619\" finisher, along with various close-ups of Rey's new character model.",
    "The WWE roster has changed more than in previous years, partly due to Covid-19 resulting in multiple layoffs. It means that the WWE 2K22 roster may not be nailed down just yet, and could offer a few surprises. The break in development means the roster could look quite different, which should help freshen things up.",
    "Some debutants we’re likely to see include Dominik Mysterio and Angel Garza, with popular NXT wrestlers also making the cut. We’d also expect the usual legends to make an appearance, like The Rock and Stone Cold Steve Austin, as well as prominent superstars like Asuka and AJ Styles.",
    "So far, we know these WWE superstars will be included in WWE 2K22:",
    "General manager mode?",
    "WWE 2K22 could see the return of fan favorite General Manager Mode, if a recent tease is anything to go by. The tease came from a from the official WWE 2K22 Twitter account which responded to a tweet suggesting it would be “cool if you could draft your own roster in 2K22” with a pretty teasing thinking face emoji.",
    "Admittedly, that's far from a confirmation that General Manager Mode will definitely be in the game but it’s enough to give fans hope. Especially following previous reports from SportsGamersOnline that General Manager Mode was seen as a \"top priority\" and would be in the game. It’s likely that if the mode is going to be in the game, fans probably shouldn’t expect to see anything officially confirmed before January 2022 when the full reveal is scheduled to take place.",
    "Learning more in January 2022",
    "2K games has confirmed that a full reveal will take place in January 2022 ahead of WWE 2K22's March release date. What exactly will be covered in the reveal isn't confirmed but it's likely that it'll be a chance to dive deeper into the finer details and improvements that have been made to the game in its longer development period, with 2K's announcement highlighting \"new controls\" and \"incredible graphics\" as well as \"ultra-realistic and updated character models, and more than 3,400 new animations.\"",
    "WWE 2K22 is \"looking fantastic\" WWE 2K22 is reportedly \"looking fantastic\", according to Forbes' Brian Mazique. Mazique also said the game's control are \"much cleaner\" and that WWE 2K22 \"feels like a wrestling fan's wrestling game.\" While it's hard to take too much away from Mazique's comments, it's encouraging to hear that the game sounds like it's in good shape.",
    "More WWE departures could affect final roster WWE has released a number of high-profile superstars in recent months, which could shape the game's final roster. The likes of Braun Strowman, Aleister Black and Lana have all been let go this year, and recently WWE announced that Bray Wyatt and Ric Flair have also been released.",
    "No Daniel Bryan? There are rumors that Daniel Bryan might not appear in WWE 2K22. According to ScreenRant, wrestling writer Dave Meltzer has claimed in the Wrestling Observer Newsletter that WWE has requested Bryan not appear in WWE 2K22's roster. This is amidst rumors that Bryan is considering signing with AEW. As these are only rumors at the moment, with neither WWE nor 2K confirming, they should be taken with a pinch of salt.",
    "New entrance animations revealed 2K Games has shared another behind the scenes video, which shows some of the entrance animations in WWE 2K22. According to the the tweet from the WWE 2K22 devs Twitter account, there will be over 4,800 new or updated animations in the game.",
    "A number of WWE superstars were released WWE announced that a number of notable superstars have been released from its roster, but how will this impact the game? Household names such as Braun Strowman, Lana and Ruby Riott have all been axed, so it remains to be seen whether they will be included in WWE 2K22.",
    "WWE 2K22's cover stars have been chosen... by the fans While we still don't know which WWE superstars will grace the game's cover quite yet, fans have had they say on who they'd like to see. In a poll by the WWE Fox Twitter account, fans voted for Drew McIntyre and Sasha Banks as the superstars they'd like to see on the box. Will 2K Games agree with the fans selection? We'll have to wait and see.",
    "WWE 2K22 features thousands of new animations and mo-cap studio WWE 2K22 will feature over 4,800 new animations for this year's entry, which is over a thousand more than usual. Patrick Gilmore, one of the game dev's, said that the team was continuing to add more as the game is developed.",
    "We also got to see the game's new mo-cop studio in action, and Gilmore revealed that it's two times bigger, which means the team can seamlessly capture moves, entrances and elaborate cutscenes that take place in and out of the ring.",
    "WWE 2K22 has new face-scanning technology WWE 2K22 will use an all-new face-scanning rig that’s equipped with 80 high-resolution cameras that allow Visual Concepts to create high-precision 3D sculpts of the superstars. The clip below shows WWE stars Booker T and Ric Flair enter the contraption – which looks like Darth Vader’s personal chambers – and pull various faces as they get scanned by the cameras.",
    "While many wrestling game veterans would like to see WWE 2K22 build upon the rock-solid foundations that games like WWF No Mercy established, most people are clamoring for popular modes that were axed from previous games, like GM Mode from Smackdown vs Raw 2006.",
    "GM Mode let you sign wrestlers, book shows and create feuds, and players were awarded ratings based on how exciting the matches were. In a post on the official 2K forums, which asked fans for their top three requests (which not everyone stuck to), GM Mode was a prominent request."
  ],
  "headers": {
    "5": "WWE 2K22: cut to the chase"
  },
  "links": {
    "WWE 2K21 being canceled": "https://www.techradar.com/news/wwe-2k21-has-been-cancelled-according-to-wwe",
    "We hope": "https://www.techradar.com/news/wwe-2k22s-release-date-gives-me-hope-that-we-might-finally-get-a-great-wrestling-game",
    "SportsGamersOnline": "https://www.sportsgamersonline.com/games/wrestling/wwe-2k22-major-mode-return/",
    "confirmed": "https://newsroom.2k.com/news/wwer-2k22-slated-to-hit-different-in-march-2022",
    "ScreenRant": "https://screenrant.com/wwe-2k22-removing-daniel-bryan-report/",
    "Patrick Gilmore": "https://twitter.com/MrEpilog",
    "new mo-cop studio in action": "https://twitter.com/WWE2Kdev/status/1396858538048331787?s=20",
    "2K forums": "https://forums.2k.com/showthread.php?4378603-WWE-2K20-Feedback-Project-Top-3-Requests&s=9aba1586aacf1a84d0134553cc574b46"
  }
}