{
  "source": "https://www.techradar.com/news/apple-airpods-3-release-date-leak-says-itll-be-here-in-2021-heres-what-will-change",
  "title": "Apple AirPods 3 release date leak says it’ll be here in 2021 – here’s what will change",
  "category": "audio-visual",
  "updated": "2021-05-28T17:07:05Z",
  "author": "nick-pino",
  "summary": "Expect the new AirPods later this year, and revamped AirPods Pro next year",
  "article": [
    "A new report claims that a third iteration of the Apple AirPods are in development right now as are the second generation of the Apple AirPods Pro.",
    "According to Bloomberg who spoke with people familiar with the plans, the AirPods 3 could include motion sensors for fitness tracking and integration with Apple Fitness Plus along with noise reduction, according to some recent leaks.",
    "As for the AirPods Pro, Bloomberg’s sources say we can expect even shorter stems at the bottom of the earbuds – similar to the rumored Beats Studio Buds that are rumored to be announced at WWDC 2021 – and the integration of fitness-tracking features.",
    "The sources say we can expect the AirPods to be announced before the end of 2021, while the AirPods Pro will come our way in 2022 – though the source didn’t give an exact release date or potential pricing for either of the new true wireless earbuds.",
    "While this is a great report – and something that certainly fits into Apple’s plans to integrate all its devices and services together – we always take release window rumors with a grain of salt because, historically, they haven’t always been accurate.",
    "For example, we heard rumors of the 2nd-Gen Apple AirPods' release set for dates for over a year before they eventually released, while the AirPods Pro’s release date slipped multiple times before they hit store shelves.",
    "That being said, you probably shouldn’t hold Apple to these release windows – even as wide and as nebulous as they currently are.",
    "What seems more likely – almost a definite at this point – is the imminent release of the Beats Studio Buds. We’ve seen celebrities wearing them and they've appeared on the FCC website for approval. It's unclear how soon they'll launch but, based on what we've seen this week, it seems like they could arrive any day now."
  ],
  "headers": {
    "4": "It's all up in the Air...Pods"
  },
  "links": {
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-28/apple-plans-redesigned-airpods-for-2021-new-airpods-pro-in-2022?sref=10lNAhZ9",
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "recent leaks": "http://www.52audio.com/archives/72978.html",
    "Beats Studio Buds": "techradar.com/news/beats-studio-buds-what-we-know-about-the-rumored-apple-earbuds",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "seen celebrities wearing them": "https://www.techradar.com/news/beats-studio-buds-has-lebron-james-revealed-the-rumored-wireless-earbuds"
  }
}