{
  "source": "https://www.techradar.com/news/us-ramps-up-efforts-to-establish-6g-leadership",
  "title": "US ramps up efforts to establish 6G leadership",
  "category": "phones",
  "updated": "2021-03-26T15:36:56Z",
  "author": "steve-mccaskill",
  "summary": "Industry body appoints leaders and begins work on roadmap",
  "article": [
    "Executives from AT&T and Ericsson have been elected to lead a US industry body’s effort to establish North America as a leader in 6G networks.",
    "The immediate focus in the mobile industry is the rollout of 5G phone technology but the race to be the leader in the even more nascent field of 6G has already begun.",
    "China has already started its research and development activities, while the €251 million 6Genesis programme is already well underway in Northern Finland.",
    "The Alliance for Telecommunications Industry Solutions (ATIS)’s Next G Alliance is a group of more than 45 telco and ICT companies working on 5G and 6G technologies from the development stage through to commercialisation.",
    "Its members span the entire spectrum of the mobile, telecoms and IT industries and include device manufacturers, mobile operators, and infrastructure vendors.",
    "AT&T CTO Andre Feutsch has been named chair of the Next G Alliance’s executive governing body, the Full Member Group, while Jan Soderstrom, Ericsson’s head of technology office in Silicon Valley.",
    "Both will serve a two-year term, while executives from AT&T, Nokia and VMware have been appointed to the Next G Alliance steering group.",
    "In addition, the organisation has launched a 6G Roadmap Working Group to create blueprint that will act as foundation for a common vision and goals for 6G leadership. The roadmap will influence research , technology development, service and application enablers, policies and government actions, and market priorities. A separate ‘Green G’ working group will evaluate the environmental impact of mobile networks and see how greater power efficiency and sustainability can be achieved.",
    "“While innovation frequently occurs in response to market needs, long-term technology leadership takes strategic foresight and critical stakeholders committed to reaching the desired future state,” said ATIS President Susan Miller. “With its leadership set and work on both sustainability and the 6G Roadmap launched, the Next G Alliance is well positioned to create a national vision for the next decade.”",
    "Although it is too early predict the final form the 6G standard will take and which technologies will be included, there are some plausible assumptions about its capabilities and the challenges that operators, manufacturers and researchers face.",
    "Naturally, 6G networks will deliver huge advances in speed, capacity, and low latency, while it is also expected they will be much more intelligent and reliable. This will deliver superior mobile broadband but also enable advanced services such as truly immersive extended reality (XR), high-fidelity mobile holograms and digital twins.",
    "Central to these applications will be the ability of 6G to compensate for current constraints – such as the limited processing capability of mobile devices – and the integration of intelligence into the network.",
    "If the most ambitious targets are met, then 6G will offer 100 times the capacity of 5G and will be able to support 10 million devices per square kilometre. Terabit speeds will in theory be possible.",
    "Signals would extend 10,000 metres above the surface, enabling ‘3D coverage’ in the skies, space and underwater. All these capabilities would allow for intelligent sensing, positioning, edge computing, and high-definition imaging."
  ],
  "headers": {
    "3": "6G potential"
  },
  "links": {
    "6G networks": "https://www.techradar.com/news/6g",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}