{
  "source": "https://www.techradar.com/news/google-adds-another-string-to-its-fretboard-with-built-in-guitar-tuning",
  "title": "Google adds another string to its fretboard with built-in guitar tuning",
  "category": "computing",
  "updated": "2021-10-08T11:17:03Z",
  "author": "darren-allan",
  "summary": "Easily tune your guitar right from the search engine",
  "article": [
    "Google has launched a nifty new feature to help guitarists tune their instruments in an easy and convenient way.",
    "The guitar-tuning functionality is actually directly embedded within Google Search, meaning you can just head to Google in your browser – whatever your device, on a smartphone or PC – and access the chromatic tuning function right there and then (search for ‘Google tuner’).",
    "We say any device, but naturally, it must have a microphone in order to be able to pick up the sound of your guitar string being plucked. When the string is played, Google has a meter which shows whether you need to tune up or down, and lets you know when the correct note has been reached.",
    "Feedback from users appears to indicate that the system works well enough, at least for basic tuning requirements. However, do note that the quality of the mic employed will obviously have a bearing on any results, so don’t expect much from an age-old laptop with a crappy little microphone, for example, or a low-budget phone.",
    "Android Police spotted this development, and as the website observes, there are quite a number of options for guitar tuning apps already. However, some of the popular ones can be stuffed with unwanted bits and pieces in terms of monetization, like ads or upselling attempts, and may be blighted with poor interfaces (or both of the above).",
    "At least now there’s a streamlined and simple option which works well enough, and is just right there in your browser with no fuss, and no need to install anything (or indeed install something, uninstall it when you find out how annoying it is, then install something else, and…). Kudos to Google, then.",
    "If you are looking for a more in-depth tuning app, however, then commonly recommended candidates include Fender Tune, GuitarTuna, and the Peterson iStroboSoft Tuner (on iOS for the latter anyway, the Android version lacks some features and may be a little flakier going by reviews)."
  ],
  "headers": {
    "4": "Analysis: A no-fuss solution and seriously convenient"
  },
  "links": {
    "Google": "https://www.techradar.com/news/keep-prying-eyes-off-your-google-search-history-with-this-new-account-tweak",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "PC": "https://www.techradar.com/how-to/how-to-build-a-pc",
    "Android Police": "https://www.androidpolice.com/google-search-has-an-instrument-tuner/"
  }
}