{
  "source": "https://www.techradar.com/news/iphone-12-led-a-record-breaking-dollar47-billion-in-iphone-sales-over-q2-2021",
  "title": "iPhone 12 led a record-breaking $47 billion in iPhone sales over Q2 2021",
  "category": "phones",
  "updated": "2021-04-28T22:46:51Z",
  "author": "david-lumb",
  "summary": "Apple hit $89.6 billion in sales in the last quarter, up 54% from 2020",
  "article": [
    "Apple reported record revenues of $89.6 billion for Q2 2021, an increase of 54 percent year over year, according to an official earnings report detailing results of the company’s second fiscal quarter of the year.",
    "While all categories reported growth in sales compared to the same period last year, iPhone sales unsurprisingly dominated the company’s portfolio with $47 billion in sales for Q2 2021, up from $28 billion in the same period last year, per Apple’s quarterly earnings breakdown. During the earnings call, Apple CEO Tim Cook confirmed that the standard iPhone 12 was the most popular phone sold over the quarter, though the Pro model sales were also strong.",
    "Sales grew across other product families, with Services hitting $16.9 billion (up from $13.3 billion in the same quarter last year) and similar growth for iPad and Mac. Indeed, the last three quarters have been the best sales quarters ever for Macs, which Apple admits likely owes to a realignment toward work from home for plenty of consumers, but also an increasing portfolio of Mac products.",
    "Apple sales grew at least 35 percent in every region, and while the majority was still in the Americas with $34.3 billion, growth had the greatest percentage in China up $17.7 billion in Q2 2021 from $9.4 billion in Q2 2020.",
    "While Apple didn’t reveal anything coming down the line, the company was optimistic about the new products revealed during its recent Apple Spring Loaded event, including the M1-powered iMac and iPad Pro, as well as the new object-tracking Apple AirTags accessories. We’ll see how these impact the Q3 2021 earnings numbers – but given the numbers we saw today, it’s clear that Apple sales don’t seem to have been limited by the Covid pandemic and lockdown conditions.",
    "On the other hand, company did note during the earnings call that certain product categories, like wearables and audio, sell better in Apple’s brick-and-mortar stores, which have closed in many areas to comply with regional restrictions on store openings to limit the spread of Covid. This might explain the more humble increases in the Wearables, Home and Accessories category ($7.8B up from $6.2B last year), which could go up as Apple stores reopen, Apple CEO Tim Cook suggested during the call.",
    "But the pandemic’s effects still linger in other ways: supply issues persisting throughout the tech world will also affect Apple, with constraints projected to impact expected sales in Q3 2021 by up to $4 billion. Cook reiterated that these supply effects did not affect Q2 sales, however.",
    "During the earnings call, Tim Cook doubled down on US development and production with plans to invest $430 billion in US operations over the next five years, mentioning a new campus in North Carolina and increased focus on silicon development and 5G technology innovation."
  ],
  "headers": {
    "4": "Apple: pandemic-proof?"
  },
  "links": {
    "earnings report": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1343842283400392400&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F04%2Fapple-reports-second-quarter-results%2F",
    "breakdown": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9296848401239390000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2Fpdfs%2FFY21_Q2_Consolidated_Financial_Statements.pdf",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review"
  }
}