{
  "source": "https://www.techradar.com/news/iot-attacks-are-now-becoming-more-frequent-than-ever",
  "title": "IoT attacks are now becoming more frequent than ever",
  "category": "computing",
  "updated": "2021-09-08T12:31:17Z",
  "author": "sead-fadilpasic",
  "summary": "Hackers are after your smart fridge, experts warn",
  "article": [
    "Internet of Things (IoT) devices are more popular targets for cybercriminals than ever before, a new report from Kaspersky has claimed. The company says that in the first half of 2021, the number of attacks against IoT devices doubled compared to the same period last year.",
    "Kaspersky created a number of honeypots, essentially pieces of software that imitate the behavior of a vulnerable IoT device, to build its research. During the first six months of 2021, the company detected more than 1.5 billion attacks against these honeypots, twice as many as during the same period in 2020.",
    "Most of the time, the crooks would use the telnet protocol in an attempt to establish a connection (a protocol usually used to access and manage devices remotely). Sometimes, they’d also use SSH and web, as well.",
    "One of the main reasons IoT devices grew so popular is their rising numbers. There are 127 new devices connected to the internet every second, Kaspersky claims, citing market analysts. It also said that an increasing number of exploits are being weaponized, with infected devices being used to steal personal data, mine cryptocurrencies, or take part in distributed denial of service (DDoS) attacks.",
    "Besides the growth in popularity, optimism bias also plays a major role, Kaspersky’s experts are saying. Commenting on the findings, the company’s security expert Dan Demeter said some people believed they weren’t important enough to be hacked.",
    "“But we’ve observed how attacks against smart devices intensified during the past year. Most of these attacks are preventable, that’s why we advise smart home users to install a reliable security solution, which will help them stay safe,” he concluded.",
    "Cybersecurity solutions aside, Kaspersky recommends IoT users to update their gear’s firmware as soon as an update is available, to always replace preinstalled passwords with complex, hard-to-crack credentials, and to reboot the device as soon as it starts acting strangely."
  ],
  "headers": {
    "4": "Overconfidence as a key risk"
  },
  "links": {}
}