{
  "source": "https://www.techradar.com/news/chromebooks-may-soon-get-even-better-thanks-to-your-android-phone",
  "title": "Chromebooks may soon get even better... thanks to your Android phone",
  "category": "computing",
  "updated": "2021-06-02T10:12:49Z",
  "author": "rhys-wood",
  "summary": "An overdue Chromebook update coming soon?",
  "article": [
    "If you own a Chromebook, you might soon be able to access a new, useful feature in the form of streaming apps to your computer from an Android phone, as evidenced by a string of code found in the latest Google Play Services update.",
    "Discovered by XDA Developers, the string of code explicitly describes being able to “Stream apps to your Chromebook.” This could imply that ChromeOS may finally have some degree of parity with Android, allowing users to stream their favorite apps from phones and tablets on a larger Chromebook screen.",
    "The actual feature is yet to be enabled by Google, and as is usually the case with APK discoveries, the implementation of the feature might not come to pass, at least not in the current Google Play Services update. But it is something to keep an eye on in the near future.",
    "Google hasn’t kept ChromeOS and Android entirely separate. The company’s Phone Hub suite allows users to connect their Android phones to their Chromebooks to access a range of basic features, like syncing notifications and browsing your phone’s open Chrome tabs.",
    "This also isn’t the first time an app streaming feature has been spotted for Chromebooks. Back in February, code was spotted that hinted at a feature that would let Google Pixel owners cast their phone’s screen to their Chromebook.",
    "If Google does intend to allow the streaming of apps from Android devices to Chromebooks, it would be a much-needed bridging of the gap between the two operating systems. Certain Android phones, such as devices made by Samsung, can already stream apps to Windows 10 via the Your Phone companion app, so Google has some catching up to do in this regard.",
    "The next best solution is probably the BlueStacks Android emulator, of which a version for ChromeOS is available. BlueStacks of course isn’t a streaming solution, but it does let users emulate Android on their PC, and even run apps in full screen mode. This is great for bringing mobile gaming to the big screen, for example, and actually showcases how valuable streaming apps to Chromebooks could really be."
  ],
  "headers": {
    "3": "Everything is Chrome in the future"
  },
  "links": {
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Google Play Services": "https://www.techradar.com/news/software/applications/updated-google-play-services-5-0-rolls-out-to-nearly-every-android-device-1255989",
    "XDA Developers": "https://www.xda-developers.com/google-play-services-stream-apps-to-chromebook/",
    "ChromeOS": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/google-chrome-os-1082513/review",
    "code was spotted": "https://9to5google.com/2021/02/09/chrome-os-eche-screen-mirror-pixel-android-phone-hub/",
    "Google Pixel": "https://www.techradar.com/news/best-pixel-phones",
    "Samsung": "https://www.techradar.com/news/best-samsung-phones",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "BlueStacks": "https://www.techradar.com/how-to/play-android-games-on-windows-with-bluestacks-app-player",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc"
  }
}