{
  "source": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them",
  "title": "New 42-inch OLED TVs are on the way – but which TV brands will get them?",
  "category": "televisions",
  "updated": "2021-05-07T11:56:30Z",
  "author": "henry-st-leger",
  "summary": "OLEDs get smaller than ever",
  "article": [
    "There's a new 42-inch OLED TV size coming this year, it seems, opening the way for a whole new generation of compact OLED screens.",
    "Panel manufacturer LG Display has confirmed the news, adding a seventh sizing option alongside last year's 48-inch OLED TV size, a new 83-inch size for 2021, and the existing 55-inch, 65-inch, 77-inch and 88-inch panels seen in previous years.",
    "It's only one the major announcements we expect to hear over the CES 2021 expo – sadly an online event only this year – alongside the bendable OLED monitor shown off by LG Electronics, which can switch from a flatscreen to a curved display.",
    "LG Display says that it's \"set to strengthen its lineup by producing 83-inch and 42-inch OLED TV displays starting this year, adding to the existing 88-inch, 77-inch, 65-inch, 55-inch, and 48-inch OLED TV displays.\"",
    "We're also told that LG Display will seek to \"expand its mid-range TV display lineup down to the 20-30-inch range, enhancing not only TV, but also gaming, mobility, and personal display options.\" Those 20-30 inch displays will almost certainly be LCD, rather than OLED models, but it shows that LG Display is going big on small TVs with a renewed vigour.",
    "We're still waiting on firm details of the LG TV 2021 range, but it seems an expansion of TV sizes is top of the list of priorities for LG Display.",
    "It's worth noting that LG Display merely manufactures the panels, whereas LG Electronics is the organization that markets and sells consumer TVs utilizing those panels. So there's no confirmation yet that LG Electronics has any plans for the latest panel size.",
    "We expect the rollout of the 42-inch OLED TV size to be similar to that of the 48-inch models seen in 2020. It took several months after the initial announcement of the LG CX for a 48-inch model to be unveiled, and so it's likely that flagship sizes will launch for the CX's successor first.",
    "We also saw 48-inch models of the Sony A9/A9S, Philips OLED+935 and Beovision Contour, of course, so we'd be surprised not to see the same TV brands embrace the newest 42-inch size too.",
    "Small TVs could be big business in the coming years – a trend that accelerated in the early days of the pandemic, as people rushed to grab portable monitors and second screens for their homes.",
    "LG has quite rosy predictions for OLED TVs, too: \"While 200,000 displays were shipped during the first year of OLED TV production in 2013, the number of units shipped reached 4.5 million last year, and LG Display plans to expand that to between 7 and 8 million displays this year to solidify its competitive advantage in the next-generation TV market and accelerate the OLED trend.\"",
    "As OLED TVs get smaller – and therefore cheaper – the technology's dominance in the TV market will only increase. Whether it can quite compete with the bargain-bucket LCD TVs out there, though, will depend on just how aggressively these new, small TVs are priced."
  ],
  "headers": {
    "9": "Analysis"
  },
  "links": {
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "48-inch OLED TV": "https://www.techradar.com/best/48-inch-oled-tv",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "bendable OLED monitor": "https://www.techradar.com/news/lgs-bendable-48-inch-oled-shows-the-way-forward-for-flexible-screens",
    "small TVs": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660",
    "LG TV 2021": "https://www.techradar.com/news/lg-tv-2021",
    "LG CX": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Sony A9/A9S": "https://www.techradar.com/news/sonys-first-48-inch-oled-tv-is-finally-here",
    "Philips OLED+935": "https://www.techradar.com/reviews/philips-oled935-tv",
    "Beovision Contour": "https://www.techradar.com/news/bang-and-olufsen-unveils-first-ever-48-inch-oled-tv-and-its-beautiful",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "portable monitors": "https://www.techradar.com/news/best-portable-monitor",
    "second screens": "https://www.techradar.com/how-to/should-you-buy-a-second-screen-our-guide-to-buying-a-cheap-tv-on-the-side"
  }
}