{
  "source": "https://www.techradar.com/news/this-new-oneplus-watch-just-reminded-us-cyberpunk-2077-existed",
  "title": "OnePlus Watch Cyberpunk 2077 Edition just married two things we tried to forget about",
  "category": "wearables",
  "updated": "2021-05-21T08:34:38Z",
  "author": "tom-bedford",
  "summary": "Two products with tumultuous launches",
  "article": [
    "If you think about it, the OnePlus Watch and Cyberpunk 2077 are both a little similar - both were hugely anticipated on launch, but were heavily criticized and ended up disappointing.",
    "Those two things have now combined with the OnePlus Watch Cyberpunk 2077 Edition officially being confirmed. Side note: product names also shouldn't be fourteen syllables long.",
    "OnePlus confirmed it via a post on Chinese social media network Weibo, the OPWC2077E (as we're going to 'shorten' it to) seems just to be a stylized version of the original watch, with a new color band and different watch face. There doesn't seem to be any other major differences.",
    "We saw a similar tie-in with the OnePlus 8T Cyberpunk 2077 Edition, which didn't go on sale outside China - we'd imagine, by the teasing on Weibo, that the availability will be the same this time around.",
    "It seems OnePlus is hosting a live unboxing of the new OnePlus Watch on its Weibo account on May 24 - if you're really interested in this new device, maybe it's worth taking a peek.",
    "When the OnePlus 8T Cyberpunk 2077 Edition launched, the game itself wasn't available to buy (since it was delayed a few times over 2020). But the game released six months prior to this new OnePlus Watch landing, which likely means its audience is a lot colder.",
    "The game sparked a scandal on launch with plentiful bugs, a lack of player customization and a soulless world being three of many issues. If you're reading an article like this about a tie-in product for the game, you've probably already followed lots of the furor.",
    "If this smartwatch had come out six months earlier, we'd likely have been more excited but now we've played the game it's a lot less exciting."
  ],
  "headers": {
    "5": "Don't remind us"
  },
  "links": {
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Weibo": "https://m.weibo.cn/detail/4639231328915878",
    "OnePlus 8T Cyberpunk 2077 Edition": "https://www.techradar.com/news/oneplus-8t-cyberpunk-2077-edition-hands-on-our-time-with-the-grimy-future-phone"
  }
}