{
  "source": "https://www.techradar.com/news/this-dell-xps-17-laptop-has-fallen-to-a-record-low-price-at-amazon",
  "title": "This Dell XPS 17 laptop has fallen to a record low price at Amazon",
  "category": "computing",
  "updated": "2021-09-09T12:57:29Z",
  "author": "georgia-silcox",
  "summary": "Save $300 on this seriously powerful Dell laptop",
  "article": [
    "The Dell XPS 17, a seriously powerful laptop for creative professionals, has just fallen to a new record low price of $2740.49 at Amazon - a great deal for the biggest laptop in the XPS range.",
    "With an original price of $3044.99, the Dell XPS 17 is certainly one of the more expensive laptops out there. However, this 10% price cut saves you $304.50 - one of the biggest savings in this week's Amazon sales. Not only is this the lowest price we've seen for the device, but it's the first price drop on the laptop at Amazon.",
    "The 4k touchscreen and 11th-gen Intel Core processor make for a great video editing machine that will power through any creative workload. Plus, the thin and light design makes it easy to put in your bag for the commute to work. With an impressive display and powerful processor, the Dell XPS 17 battery life isn't the best out there, but it'll last a decent 7 hours nonetheless.",
    "If you’re looking for an everyday laptop you might want to check out some other cheap laptop deals since this Dell XPS 17 comes with a big price tag. But, it's still a great option for creative professionals - especially with this discount at Amazon.",
    "Not in the US? Scroll down for more cheap Dell laptop deals in your region.",
    "For the Apple fans out there, we're rounding up all of the best Macbook deals and cheap iPhone prices available this month."
  ],
  "headers": {
    "5": "More Dell XPS 17 deals"
  },
  "links": {
    "$2740.49 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB094LSXGKL%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1332148635731327500-20",
    "Dell XPS 17": "https://www.techradar.com/reviews/dell-xps-17-2021",
    "Amazon sales": "https://www.techradar.com/deals/best-amazon-sales-deals-discounts",
    "cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "cheap Dell laptop deals": "https://www.techradar.com/news/dell-laptop-deals",
    "best Macbook deals": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699",
    "cheap iPhone prices": "https://www.techradar.com/deals/iphone-deals"
  }
}