{
  "source": "https://www.techradar.com/news/samsung-galaxy-book-pro-laptops-leaked-ahead-of-samsung-unpacked-2021-event",
  "title": "Samsung Galaxy Book Pro laptops leaked ahead of Samsung Unpacked 2021 event",
  "category": "computing",
  "updated": "2021-12-03T08:16:42Z",
  "author": "matt-hanson",
  "summary": "Samsung Galaxy Book Pro and Samsung Galaxy Book Pro 360 spotted",
  "article": [
    "The Samsung Unpacked 2021 event has recently been announced for April 28, with the cryptic invite hinting that the “most powerful Galaxy is coming”, and it looks like it could be referring to two new Samsung Galaxy Book Pro laptops which have just appeared online.",
    "As reported by 91mobiles.com, images of two new laptops from Samsung were potted on SafetyKorea certifications, and give us a good glimpse of the devices.",
    "The Samsung Galaxy Book Pro looks set to come in a silver and white color, and will feature impressively slim bezels around the screen.",
    "Meanwhile, the Samsung Galaxy Book Pro 360 looks set to come in white, and will have a 360-degree hinge and touchscreen, making it a 2-in-1 device. Earlier rumors suggest it will support the Samsung S-Pen stylus.",
    "Both laptops are pictured with keyboards with the Windows key, suggesting they will both be Windows 10 laptops, rather than Chromebooks. It also appears that both will come in 13-inch and 15-inch versions.",
    "These new leaks, coming so soon after the announcement of the Samsung Unpacked 2021 event, means it’s likely we’ll see these devices then.",
    "It would make sense, as these laptops will likely be more powerful than any smartphone or tablet that Samsung is cooking up, therefore justifying Samsung’s claim that the event will showcase the “most powerful Galaxy” device it's ever created.",
    "With the event happening on April 28, we won’t have too long to wait to find out what the company has in store."
  ],
  "headers": {
    "5": "Early unpacking"
  },
  "links": {
    "Samsung Unpacked 2021 event has recently been announced": "https://www.techradar.com/news/samsung-unpacked-2021-april-date",
    "Samsung Galaxy Book Pro": "https://www.techradar.com/reviews/samsung-galaxy-book-pro",
    "reported by 91mobiles.com": "https://www.91mobiles.com/hub/samsung-galaxy-book-pro-360-live-images-safety-korea/",
    "Windows 10 laptops": "https://www.techradar.com/news/best-windows-laptop",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook"
  }
}