{
  "source": "https://www.techradar.com/news/t-mobile-data-breach-could-be-much-worse-than-previously-thought",
  "title": "T-Mobile data breach could be much worse than previously thought",
  "category": "computing",
  "updated": "2021-08-20T21:35:32Z",
  "author": "anthony-spadafora",
  "summary": "An additional 5.3m T-Mobile customers are affected",
  "article": [
    "The recent T-Mobile data breach in which a hacker claims to have stolen the personally identifiable information (PII) of roughly 100m of the mobile carrier's customers may actually be much worse as the company has revealed new details from its investigation into the matter.",
    "Earlier this week, a hacker posted on an underground forum in an attempt to sell a pool of data on the company's customers which reportedly included their social security numbers (SSN), phone numbers, names, addresses, unique IMEI numbers and driver's license information.",
    "Now though, T-Mobile has confirmed in a new post on its site that 7.8m of its current postpaid or on contract customers did have all of the data mentioned above stolen as a result of the breach. However, the hacker was also able to acquire their IMEI (International Mobile Equipment Identity) that is assigned to every mobile device as well as their IMSI (International Mobile Subscriber Identity) that is used to identify their SIM card.",
    "While a cybercriminal could use the exposed personal information of affected T-Mobile customers to commit identity theft, their IMSI information could potentially be used in SIM swapping attacks where an attacker takes over a user's phone number to intercept two-factor authentication (2FA) codes as well as other data being sent to their smartphone.",
    "T-Mobile also revealed that an additional 5.3m of its postpaid customers are affected by the breach though apparently their driver's licenses and social security numbers weren't exposed.",
    "The accounts of 667k former T-Mobile customers were exposed as well though thankfully, former Sprint prepaid and Boost Mobile customers didn't have their information stolen during the breach. Unfortunately, the same can't be said for 52k Metro by T-Mobile customers who also had their information stolen.",
    "Both T-Mobile and he FCC are currently investigating the data breach and so far, one class-action lawsuit has been filed against the mobile carrier.",
    "Current T-Mobile customers who are concerned that their data may have been exposed can visit this page for more information on how to sign up for the company's Scam Shield which offers scam-blocking protection and other anti-scam features. The company is also offering a free two year subscription to McAfee's ID Theft Protection service to affected customers.",
    "We'll likely hear more regarding the breach and how the hacker was able to penetrate T-Mobile's systems once the company and the FFC's investigation is complete.",
    "Via The Verge"
  ],
  "headers": {
    "4": "T-Mobile data breach"
  },
  "links": {
    "T-Mobile data breach": "https://www.techradar.com/news/t-mobile-investigates-massive-potential-data-breach",
    "underground forum": "https://www.techradar.com/news/700m-linkedin-records-up-for-sale-on-underground-hacking-forum",
    "SSN": "https://www.techradar.com/how-to/top-tips-for-preventing-tax-related-id-theft",
    "new post": "https://www.t-mobile.com/news/network/additional-information-regarding-2021-cyberattack-investigation",
    "IMEI": "https://www.techradar.com/news/over-13000-vivo-phones-found-to-be-using-same-imei-number",
    "IMSI": "https://www.techradar.com/news/security-flaws-in-4g-and-5g-revealed",
    "SIM card": "https://www.techradar.com/sim-only/what-is-stored-on-a-sim-card",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "SIM swapping attacks": "https://www.techradar.com/news/behind-the-hack-how-tech-journalists-were-hacked-in-the-name-of-research",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "Metro by T-Mobile": "https://www.techradar.com/news/t-mobile-will-soon-automatically-enroll-customers-in-a-new-ad-targeting-program",
    "visit this page": "https://www.t-mobile.com/brand/data-breach-2021",
    "The Verge": "https://www.theverge.com/2021/8/20/22633853/tmobile-data-breach-imei-sim-fcc"
  }
}