{
  "source": "https://www.techradar.com/news/zack-snyder-wont-be-paid-for-his-cut-of-justice-league",
  "title": "Zack Snyder won't be paid for his cut of Justice League",
  "category": "entertainment",
  "updated": "2021-02-22T19:44:16Z",
  "author": "hamish-hector",
  "summary": "The hero we deserve?",
  "article": [
    "For completing Zack Snyder's Justice League for HBO Max, the director won't receive a paycheck. Snyder believes this bargain with Warner Bros is what has allowed him more creative freedom on the project, which has apparently cost the studio $70 million to create.",
    "Snyder, though, was of course originally paid for working on the movie back in 2016.",
    "This is one of many interesting details about Justice League’s production that have been revealed thanks to an extensive new interview with Vanity Fair. In it, the director reiterated that he has never seen Joss Whedon’s theatrical cut of Justice League - the Avengers supposedly reshot about 75% of the movie - because of advice from his wife.",
    "The piece also details how the studio allegedly lost faith in Snyder after the negative critical reception towards Batman Vs Superman, going as far as ensuring one of two executive producers, Jon Berg or Geoff Johns, were on-set to keep an eye on filming each day and suggest ideas.",
    "\"You could say babysit,\" is how Snyder describes that situation. \"It didn’t bother me too much because they weren’t that threatening. I just felt the ideas they did have, where they were trying to inject humor and stuff like that, it wasn’t anything that was too outrageous.\"",
    "Snyder's finished version of the film will be presented in 4:3 on HBO Max, because he one day hopes to release it in IMAX theaters.",
    "Zack Snyder's Justice League will release around the world on March 18.",
    "Vanity Fair’s heartfelt interview highlighted many of the instances Snyder butted heads with Warner Bros. executives during Justice League's filming.",
    "Snyder also claims that Warner Bros originally only wanted to release the Justice League cut he had saved on his laptop. But as he put it “I was like, ‘That’s a hard no.’” He believed that his rough version lacking audio and effects in places was better off as a “mythical unicorn”, as it would allow the studio to point at and say “See? It’s not that good anyway.”",
    "Thanks to the efforts of fans to have the edit released, however - which included a Times Square billboard ad, trending hashtags and a “Release the Snyder Cut” banner being flown around the Burbank Warner Bros. studio - a more complete version was eventually commissioned for HBO Max."
  ],
  "headers": {
    "7": "What it took to get Zack Snyder's Justice League"
  },
  "links": {
    "Zack Snyder's Justice League": "https://www.techradar.com/news/zack-snyders-justice-league-trailer-drops-and-shows-batman-meeting-the-joker",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Vanity Fair": "https://www.vanityfair.com/hollywood/2021/02/the-true-story-of-justice-league-snyder-cut",
    "Batman Vs Superman": "https://www.techradar.com/news/with-zack-snyders-justice-league-nearing-release-how-bad-was-batman-vs-superman",
    "Vanity Fair’s": "https://www.vanityfair.com/hollywood/2021/02/the-true-story-of-justice-league-snyder-cut"
  }
}