{
  "source": "https://www.techradar.com/news/diablo-2-resurrected-is-a-4k144hz-remaster-of-diablo-2-for-pc-and-consoles",
  "title": "Diablo 2 Resurrected is a 4K/144Hz remaster of Diablo 2 for PC and consoles",
  "category": "gaming",
  "updated": "2021-02-19T23:52:20Z",
  "author": "nick-pino",
  "summary": "The Lord of Terror returns on PC (and consoles) later this year",
  "article": [
    "Blizzard has announced that, after 20 years since its initial release, Diablo 2 and The Lord of Destruction expansion will be remastered and delivered in up to 4K/144Hz.",
    "The remaster is called Diablo 2 Resurrected (Diablo II: Resurrected if you want to follow Blizzard’s naming convention) and it will be available on both PCs and – for the first time ever – on Xbox Series X, Xbox One, PS5, PS4 and Nintendo Switch.",
    "Blizzard President J. Allen Brack also said the game will offer cross-progression, allowing you to carry character progression between the PC and console versions.",
    "It's still a bit of a mystery which engine the game was running on as Brack didn't say anything specifically, but it seems like it’s using the same system as Diablo 3, as seen by some of the particle effects and ambient lighting in the trailer.",
    "The game was announced during the Friday opening keynote address at Blizzcon 2021 and while we didn't get a ton of details on the game, Brack emphasized the fact that Blizzard was doing everything possible to keep the feel of the original games but will add updated graphics and Dolby 7.1 surround sound.",
    "That said, however, gamers who want to walk down memory lane can switch back and forth with a classic mode that uses the original games' sprite-based textures.",
    "So far we don’t have an exact release date other than 2021, but Blizzard says players can go to its Diablo 2 Resurrected website to sign up for a chance to participate in upcoming PC alpha public testing."
  ],
  "headers": {
    "4": "Looting down memory lane"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Blizzcon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "Diablo 2 Resurrected website": "https://diablo2.blizzard.com/en-us/"
  }
}