{
  "source": "https://www.techradar.com/news/star-trek-discovery-season-4-gets-a-release-date-and-more-big-news-from-star-trek-day",
  "title": "Star Trek: Discovery season 4 gets a release date and more big news from Star Trek Day",
  "category": "entertainment",
  "updated": "2021-09-09T09:47:14Z",
  "author": "samuel-roberts",
  "summary": "All the news from Star Trek Day rounded up",
  "article": [
    "Star Trek: Discovery season 4 now has an official release date, it was revealed on Star Trek Day 2021 – the show returns to Paramount Plus in the US on November 18, 2021. We'd expect it to roll out on Netflix in the UK and Australia as with previous seasons, but that hasn't been confirmed yet.",
    "With new animated series Star Trek Prodigy also beginning on October 28, this makes it the first time that two Trek series have released simultaneously on a weekly basis in over 20 years – Voyager and Deep Space Nine marked the last occasion in the latter half of the '90s. Prodigy is coming to Paramount Plus, and is expected to arrive in the UK when the service lands in 2022.",
    "That wasn't the only news that came out of Star Trek Day. Star Trek: Picard season 2 will release in February 2022, it was confirmed, with a first trailer also released for the show's return. That show will air on Amazon Prime Video outside the US. Check out a Q-filled trailer below, where Patrick Stewart's Jean-Luc explains how he's \"way too old for Q's bullshit\":",
    "Time travel, then, and more Jeri Ryan are part of the package this season. In addition, a third season was confirmed, which as previously rumored, will film back-to-back with this second one. So don't expect a two-year wait between seasons next time.",
    "Elsewhere, possibly the most intriguing new Trek show on the horizon, the Discovery spin-off Strange New Worlds, revealed that crew from the Enterprise will appear in this show. Celia Rose Gooding will play Uhura, while Jess Bush will play Nurse Chapel. Babs Olusanmokun will play Dr M'Benga, while new characters in the show will be played by Bruce Horak, Christina Chong and Melissa Navia.",
    "Here's a video introducing them all, including more footage of the incredibly handsome Anson Mount as Pike:",
    "There's no release date for that one, but we wouldn't expect it before Picard season 2. Mid-2022 seems like a good bet, and we're not sure how that one will roll out to the UK and Australia yet.",
    "All of these shows are coming to Paramount Plus in the US – underlining just how important Trek is to the streaming service.",
    "Star Trek Day was a pretty cool event, all told – they didn't skimp on the announcements, and unlike a comic-con, you could enjoy it without having to book a hotel room, travel and so forth.",
    "A couple more things from the event are worth noting. Viewers got a quick look at the restoration job being performed on the original oddball 2001-esque Star Trek: The Motion Picture, which is also only coming to Paramount Plus:",
    "In addition to the release date, we also got a proper look at Star Trek: Prodigy in a new trailer – which reintroduces us to Kate Mulgrew's Janeaway. The show looks a lot like Trek's own version of The Clone Wars, in terms of being kid-friendly but expensive-looking:",
    "That's all of the big stuff. Star Trek fans have a lot to look forward to over the next year or so – and plenty to complain about, no doubt."
  ],
  "headers": {
    "8": "But that wasn't all!"
  },
  "links": {
    "Star Trek: Discovery season 4": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "Star Trek: Picard season 2": "https://www.techradar.com/news/star-trek-picard-season-2",
    "Strange New Worlds": "https://www.techradar.com/news/star-trek-strange-new-worlds"
  }
}