{
  "source": "https://www.techradar.com/news/the-sims-5-news-multiplayer-rumors-and-everything-we-know",
  "title": "The Sims 5 news, multiplayer rumors and everything we know so far",
  "category": "gaming",
  "updated": "2021-09-01T16:27:20Z",
  "author": "jack-webb",
  "summary": "Get ready to play God (again) in The Sims 5",
  "article": [
    "If you've been thinking about The Sims 5 recently then don't worry, you’re not alone. The next chapter of EA's hugely successful life sim franchise is reportedly in development and fans are desperate to know what it might bring to the table.",
    "While EA Maxis hasn't actually officially revealed The Sims 5, the developer has teased that the “next generation” of the Sims franchise is in the works, with a possible focus on social and online experiences. Rumors have even suggested this new Sims title might be cloud-based and involve some kind of multiplayer element.",
    "The Sims 4 is, of course, still going strong, with expansions, Stuff Packs, mods and even live music festivals keeping things interesting. But, it's coming up for seven years since The Sims 4 base game was released so it's not surprising that fans are starting to get curious about what Maxis and EA could have planned for the future.",
    "Given we've not had any firm announcement from EA, it seems likely that if The Sims 5 is coming, it's still a while away. In the meantime, though, we've gathered all the latest news and rumors about the game below and we'll update regularly.",
    "As it stands, the game apparently isn't far along at all, with NME reporting that The Sims 5 is currently in its \"conceptual phase\". With that in mind, we probably shouldn't expect to see The Sims 5 for a few years yet - we would predict not until at least 2023.",
    "Bear in mind that the gap between past The Sims iterations has been typically long as well. The Sims 3 came out in 2009, after which The Sims 4 was released in 2014. This means this is the longest we've ever gone without a brand-new mainline Sims game.",
    "However, it stands to reason that The Sims 4 is still going through its lifecycle and EA isn't finished with it yet.",
    "Cottage Living is the latest expansion for The Sims 4, released in July 2021, and it's possible EA and Maxis could still release a few more content packs for the game, though it does feel like there's fewer places to go.",
    "It's worth noting, though, that EA continued to release expansions for The Sims 3 until October 2013, even after it announced The Sims 4 in May 2013 for a September 2014 release. So, while the continued release of expansions is a sign that EA isn't done with the The Sims 4 just yet, it doesn't mean it isn't thinking about The Sims 5 at all.",
    "There are currently no The Sims 5 trailers right now, so we can only speculate as to what the next generation of The Sims holds for us.",
    "In terms of gameplay, we can probably expect that The Sims 5 will play similarly to previous iterations, no matter what it ends up looking like.",
    "You have daily needs and shifting emotions to take care of, which you complete and keep in check by doing certain actions such as eating and, of course, socializing with people as soon as they happen to pass by your home.",
    "Sims gameplay has remained relatively unchanged through its lifetime, with some new additions and quality of life updates thrown in from time to time. It will be interesting to see whether The Sims 5 adds a new dimension to the game, perhaps even being able to take direct, third-person control of your Sim as opposed to the overhead view of clicking and moving.",
    "It's possible that if the game does go down an online multiplayer route as reports have suggested, we could see some more significant gameplay changes than previous releases.",
    "EA continuing to improve The Sims 4",
    "Following the release of The Sims 4: Cottage Living expansion, EA Maxis hasn't revealed exactly what its future plans for The Sims 4 look like but the developer stated in a recent blog post that its roadmap \"continues to be focused on improving content that is in the game” and didn't entirely dismiss the idea of future expansions that could involve \"werewolves, faeries, and zombies\".",
    "Unfortunately, this doesn’t bode particularly well for a Sims 5 release any time soon and we’ll probably be lucky to get our hands on it before 2023. The Sims 4 was in development for over three years, so it makes sense that EA Maxis is continuing to maintain The Sims 4 in the meantime, making improvements to the game for those who have already spent their hard-earned cash on the base game, kits, game packs and expansions.",
    "EA Play Live 2021 and Gamescom no show EA held its EA Play Live 2021 showcase on July 22, but The Sims 5 didn't make an appearance as fans hoped. Given the latest Sims 4 expansion, Cottage Living, has just released, closing out the Summer of Sims roadmap, this is perhaps not too surprising.",
    "EA also attended the all-digital Gamescom 2021 in August but the game wasn't present there, either. We imagine it could be EA Play Live 2022 before we hear more on the next generation of The Sims.",
    "Sims Sessions - a sign of things to come?",
    "Over the months of May, June and July in 2021, EA hosted a Summer of Sims, providing updates, events and a new expansion, Cottage Life, for The Sims 4. There was even an in-game music festival as a part of this summer of events called Sims Sessions, where owning The Sims 4 was all that was required to join in the fun. Though the event was something of a mixed bag, we can't help but wonder if it's a sign of things to come for The Sims franchise.",
    "It was in 2020 that Andrew Wilson mentioned elements of \"social interaction and competition\" becoming \"part of the ongoing Sims experience in the years to come\" and more recently EA's Laura Miele said EA wanted to \"build on the tools for people to play with life...together\". This communal event, with its real-life artists and out-of-game TikTok hashtag, did certainly have elements of the social connection component that EA seems keen to lean into.",
    "Teasing the future? It looks like EA has been teasing The Sims 5. While speaking with Geoff Keighley at VentureBeat's GamesBeat Summit 2021 , Chief Studios Officer at EA, Laura Miele, gave a roundabout confirmation that the “next generation” of the Sims franchise is in the works, with a seeming focus on the “fertile ground” of social and online elements.",
    "“We will build on the tools for people to play with life – that’s our brand, simulation – and the idea for people to be able to play with life together,” she said.",
    "“We had The Sims Online that came out in 2002, which I can’t believe, and I think certainly we were ahead of our time.",
    "“And I think 20 years later, we learned a lot about how players interact, what motivates players, and how players can come together co-operatively, and so as you would imagine, as we think about the next generation of The Sims, it’s super important for us to have the best tools, the most flexibility, and for players to really expand on their creativity [and] remix items and objects in the world.",
    "“And then to do that together. I think that’s one of our biggest opportunities with The Sims– the social connection component that we need to bring to this brand and this franchise. The team is hard at work on the next generation of that experience.”",
    "Multiplayer components Multiplayer being added to The Sims is being discussed on the official Reddit site and, for the most part, has been met with indifference. It could be that people are expecting to see something like The Sims 4 community online functions, which lets people share creations online in the game.",
    "Electronic Arts CEO Andrew Wilson said in January 2020 that the next game in The Sims series could feature single-player and multiplayer elements. He went on to say that there might be elements of The Sims Online added to the next title.",
    "“As Maxis continues to think about The Sims for a new generation – across platforms in a cloud-enabled world – you should imagine that, while we will always stay true to our inspiration, escape, creation, and self-improvement motivations, that this notion of social interactions and competition – like the kind of things that were actually present in The Sims Online many, many years ago – that they will start to become part of the ongoing Sims experience in the years to come,” Wilson said on the Sims Community website.",
    "He went on to say: “We are very excited. This is a game that really doesn’t have any competition in its category for delivering and fulfilling these motivations for players, and we think it's a tremendous growth opportunity for us for many, many years to come.”",
    "The Sims having multiplayer components could be a huge selling point for fans of the series. There have been many occasions when playing The Sims that we have wished to start up a new household in a game and have friends join to take on their respective characters and all play together, simultaneously living out the virtual experience in co-op.",
    "This feature was used in The Sims 2 on PS2 consoles to great effect, allowing two players to create a character each and live together in the same house, sharing the same screen; it was excellent.",
    "Will The Sims 5 come to console? As it stands, there's no concrete information about The Sims 5, but we can probably expect that it will come to the PS5 and Xbox Series X during its lifetime – which is typically long if previous Sims games are anything to go by.",
    "Historically, Sims games become available on PC and then are re-worked slightly for consoles and other systems. We would expect this to be the case for The Sims 5. The Sims 4 was released on PC in 2014, only becoming available for consoles in 2017, so be prepared for a significant gap when it comes to porting the PC version to console.",
    "What about expansion and game packs? The frequent release of expansion packs help to pad out the life of each Sims game, giving it new life. The Sims 3 enjoyed 11 expansions, all of which added new elements – such as pets or the University Life expansion – and helped to keep the game fresh and going strong.",
    "Currently, The Sims 4 has over 10 expansion packs and even more Game Packs and Stuff Packs. The point being, The Sims 5 will almost certainly get the same treatment and will be updated continuously through its expected long life."
  ],
  "headers": {
    "4": "The Sims 5: cut to the chase"
  },
  "links": {
    "involve some kind of multiplayer element": "https://www.techradar.com/news/the-sims-for-a-new-generation-could-have-multiplayer",
    "live music festivals": "https://www.techradar.com/news/bad-food-and-bands-ive-never-heard-of-the-sims-4-music-festival-is-almost-the-real-thing",
    "NME reporting": "https://www.nme.com/en_au/news/gaming-news/the-sims-5-release-date-plot-news-rumours-and-more-2649900",
    "Cottage Living": "https://www.techradar.com/news/the-sims-4-cottage-living-left-me-wishing-for-the-sweet-peck-of-death",
    "as reports have suggested": "https://www.techradar.com/news/the-sims-for-a-new-generation-could-have-multiplayer",
    "blog post": "https://www.ea.com/games/the-sims/the-sims-4/news/sims-411-recap-aug-03-2021",
    "Summer of Sims roadmap": "https://simscommunity.info/2021/05/17/the-summer-of-sims-is-coming/",
    "Gamescom 2021": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show",
    "Though the event was something of a mixed bag": "https://www.techradar.com/news/bad-food-and-bands-ive-never-heard-of-the-sims-4-music-festival-is-almost-the-real-thing",
    "mentioned": "https://www.techradar.com/news/the-sims-for-a-new-generation-could-have-multiplayer",
    "VentureBeat's GamesBeat Summit 2021": "https://venturebeat.com/2021/04/29/eas-laura-miele-making-games-is-hard-and-it-keeps-changing/",
    "official Reddit": "https://www.reddit.com/r/Sims5/comments/jlecey/question_for_those_who_want_multiplayer_in_sims_5/",
    "said": "https://www.techradar.com/news/the-sims-for-a-new-generation-could-have-multiplayer",
    "Sims Community website.": "https://simscommunity.info/2020/01/31/eas-ceo-confirms-a-next-generation-sims-game-might-have-both-single-player-and-multiplayer/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}