{
  "source": "https://www.techradar.com/news/where-are-all-the-cheap-xbox-series-x-and-ps5-friendly-4k-120hz-tvs",
  "title": "Where are all the cheap Xbox Series X and PS5-friendly 4K 120Hz TVs?",
  "category": "televisions",
  "updated": "2021-02-10T14:25:41.627Z",
  "author": "jeremy-laird",
  "summary": "Cheap high refresh PC monitors abound, but 120Hz 4K TVs with HDMI 2.1 still cost serious money",
  "article": [
    "Take one look at a rack of monitors at an electronics store and you'd probably see an even number of older 60Hz monitors and newer 120Hz, 144Hz or even 240Hz models. But head to the lower shelves of the TV department where the affordable big-screens screens are and you'd be hard-pressed to find a native 120Hz panel. So where are they?",
    "The simple answer is that there aren't any. Sure, there are a few relatively affordable options, such as the LG Nano86 and Nano85, which can be had in 49-inch format for roughly the $600 / £700 mark. But for the most part, 120Hz support on a 4K TV costs serious money with sticker prices well into four figures.",
    "As TV prices come down across the board, this sub-section continues to remain expensive – especially if you're looking for a gaming TV with HDMI 2.1 ports that have the headroom to run 4K/120 fps games – but why is that the case?",
    "If you look at the average price of a TV on Black Friday or Cyber Monday, it’s incredible how cheap entry-level 4K TVs have become. This year there were 70+ inch TVs that cost as much as some 55-inch TVs a few years ago, and that's a trend that will continue into the future.",
    "When $500 / £500 secures a large and superficially impressive specimen of the 4K 60Hz breed, bumping that to $1,000 / £1,000 or even $1,500 / £1,500 just to achieve 120Hz is a not only a tough sell, it doesn’t seem to even make sense.",
    "More discerning eyes will know that cheap 4K TVs come with compromises when it comes to image quality and won’t, for instance, deliver anything even resembling a true HDR experience (premium sets with 120Hz support are also far superior to cheap TVs in many other ways beyond mere refresh rate, obviously) and yet many gamers will rightly struggle to get their heads around the notion of doubling or tripling the price of their TV just to get a higher refresh rate.",
    "Moreover, the high price of 120Hz TVs is also suboptimal when you consider one of the main attractions of console gaming is reasonable affordability, especially compared to a gaming PC with similar horsepower. Relatively few console gamers will relish the prospect of adding as much as $1,500 or £1,500 to the $500 / £500 they just paid for their shiny new console.",
    "But when it comes to gaming, 120Hz along with related gaming-centric features including variable refresh rate and low latency undoubtedly make a huge difference. Gaming at 120Hz is just so much smoother and more responsive than the standard 60Hz experience. Our advice? It's worth the upgrade.",
    "Meanwhile, over on the PC monitors with refresh rates of 120Hz-plus can be had for as little as $150 / £150. The catch with those cheaper panels involves both size and resolution. The bottom end of the high-refresh market is dominated by smaller 24-inch panels that top out at 1080p rather than 4K or even 1440p.",
    "Move up to 27-inch and you can have the full 4K experience with high refresh in a PC monitor. Those panels have hitherto been pretty pricey affairs costing upwards of $800 / £800. But with the arrival of the latest 4K@120Hz-capable consoles, a new generation of relatively affordable high-refresh 4K monitors is becoming available from around $500 / £500.",
    "Acer, Philips and Viewsonic are among the brands plotting a stab at this new segment which centers on larger and arguably more console-friendly 32-inch panels. The likes of the new Philips Momentum 328M1R, Acer Predator XB323QK, and Viewsonic Elite XG320U will bring the 4K high-refresh experience down to a lower price point than ever before when they arrive in early 2021.",
    "That’s pretty much a necessity given, as with HDTVs, few console gamers are going to be willing to spend $1,000 / £1,000-plus on a 120Hz 4K monitor, especially when 60Hz 4K monitors can be had for one quarter the money.",
    "It's worth pointing out that one reason for the lack of adoption is that 120Hz refresh rates offer little benefit for TV, movies and other video content. Indeed, gaming aside, the question of why you’d want 120Hz refresh support in an HDTV in the first place is entirely legitimate.",
    "There’s pretty much zero 120Hz content to watch.",
    "OK, streaming platforms like YouTube support content at various refresh rates. But even there video content tends to top out at 60Hz.",
    "Similarly, HFR or high frame rate movie content that’s been released in recent years runs at just 48Hz. Even then, many observers reckon it detracts rather than adds to the cinematic experience. Peter Jackson’s Hobbit Trilogy got a pretty brutal hammering from some quarters and at least part of the problem was the subjective ‘cheapening’ of the experience thanks to the daytime-TV rather than cinematic feel of HFR film technology.",
    "It’s worth noting that we’re talking about true 120Hz support, not one of the various faux 120Hz or even 240Hz technologies that some HDTVs offer and typically involve some species of frame insertion or similar technologies, sometimes referred to as ‘motion rates’.",
    "Likewise, some 4K TVs offering 120Hz support will only actually achieve 120Hz when running lower resolutions, like 1080p or 1440p.",
    "Unfortunately, it can be difficult to identify true 120Hz capability. However, a dig down into the detailed specifications often reveals the truth.",
    "In the context of 4K TVs, a dead giveaway is the absence of HDMI 2.1 support. Previous versions of HDMI lack the 48Gbps bandwidth to support 4K at 120Hz – i.e. if the TV you’re considering doesn’t have HDMI 2.1, it’s not the real deal.",
    "The obvious solution, then, is for 120Hz to become a standard feature for most 4K TVs. Some will see that as total overkill. But for us, it's the only logical future."
  ],
  "headers": {
    "3": "Cheap 60Hz TVs vs expensive 120Hz TVs: is it worth it?",
    "8": "Why are monitors' refresh rates so much higher?",
    "12": "Is the lack of content to blame?",
    "18": "120Hz and HDMI 2.1: be sure to check the specs"
  },
  "links": {
    "gaming TV": "https://www.techradar.com/news/best-gaming-tv",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304"
  }
}