{
  "source": "https://www.techradar.com/news/nvidia-deliberately-halves-rtx-3060-hash-rate-to-put-off-crypto-miners",
  "title": "Nvidia deliberately halves RTX 3060 hash rate to put off crypto miners",
  "category": "computing",
  "updated": "2021-02-18T17:54:29Z",
  "author": "matt-hanson",
  "summary": "Launching a Cryptocurrency Mining Processor as well",
  "article": [
    "Nvidia is hoping to prevent cryptocurrency miners from bulk buying its upcoming GeForce RTX 3060 GPUs when it launches on February 25 by deliberately limiting the mining efficiency of the graphics card by around 50%.",
    "This will hopefully make it less desirable for miners, leaving more stock to be bought by gamers. Nvidia’s latest graphics cards, including the RTX 3080, RTX 3090 and RTX 3070, have been extremely difficult to buy since their launch late last year, in part due to cryptocurrency miners bulk buying the GPUs to use for mining cryptocurrencies such as Ethereum.",
    "In a bid to prevent this happening to the RTX 3060, its software drivers will detect the Ethereum cryptocurrency mining algorithm and limit the hash rate, effectively cutting the GPU’s ability to mine in half.",
    "This is promising, as many PC gamers have been left extremely frustrated when trying to buy a new GPU. Hopefully this will make a difference, but there’s still a worry that cryptocurrency miners will get around this by using unofficial drivers.",
    "However, Nvidia has another potential solution with the announcement of the Cryptocurrency Mining Processor (CMP), a new product line for miners.",
    "CMP products won’t do graphics – so will be useless for games – so there’s no display output. This will help them have better cooling solutions, and the they’ll also have a lower peak core voltage and frequency, so running costs will be lower.",
    "The idea behind these products is that miners will buy them up, leaving the RTX 3060, along with Nvidia’s other GeForce RTX 3000 gaming GPUs, to gamers. Nvidia seems confident it can produce CMP products without impacting on GeForce GPU production or availability.",
    "There’s no price or release date for CMP devices at the moment, but we’ll be sure to keep an eye out for them. Hopefully this will make getting hold of a gaming GPU much easier."
  ],
  "headers": {
    "4": "Cryptocurrency Mining Processor"
  },
  "links": {
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "mining": "https://www.techradar.com/best/mining-rigs",
    "GeForce RTX 3000": "https://www.techradar.com/news/nvidia-ampere"
  }
}