{
  "source": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
  "title": "iPhone 13 could have a smaller notch and better cameras",
  "category": "phones",
  "updated": "2021-01-22T09:56:02Z",
  "author": "james-rogerson",
  "summary": "Upgrades all round",
  "article": [
    "One rumor we’ve heard several times now is that the iPhone 13 range will have a smaller notch, and now we’re hearing that again, along with information on the camera and design.",
    "According to “industry reports” highlighted by DigiTimes, the iPhone 13 range will combine the infrared camera and dot projector into a single module on the front, thereby allowing for a smaller notch than you’ll find on the iPhone 12 range.",
    "These upcoming phones will apparently be called the iPhone 12S range (rather than iPhone 13), and will – notch aside – have a similar design to the iPhone 12 range, complete with flat edges.",
    "Additionally, all four models will apparently have a LiDAR scanner, which is a feature currently only found on the Pro models. This too is something that’s been rumored before.",
    "The site also claims that all four iPhone 13 models will get sensor-shift OIS (optical image stabilization). In the current range, only the iPhone 12 Pro Max has this, while the other models have OIS that moves the lens instead of the sensor, which is typically less effective.",
    "Finally, the size of the main lens on the iPhone 13 Pro and iPhone 13 Pro Max will apparently be increased, which should further improve their photography capabilities.",
    "We would however take all of this with a pinch of salt. It’s early for iPhone 13 rumors, and while DigiTimes has access to supply chain sources, it isn’t always accurate when it comes to Apple leaks.",
    "That said, with multiple sources saying that the notch will be shrinking and that all models will get a LiDAR scanner, those two things are looking fairly likely.",
    "Via GSMArena"
  ],
  "headers": {
    "3": "LiDAR and lenses"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "DigiTimes": "https://www.digitimes.com.tw/tech/dt/n/shwnws.asp?CnlID=1&cat=30&id=0000602991_7W9861JXLP8Y0P0MUFCB6&wpidx=3",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "rumored before": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-even-more-camera-sensors",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "multiple sources": "https://www.techradar.com/news/iphone-13-tipped-to-have-a-smaller-notch-and-a-thicker-design",
    "GSMArena": "https://www.gsmarena.com/all_2021_iphone_will_have_smaller_notches_lidar_and_sensorshift_ois-news-47338.php"
  }
}