{
  "source": "https://www.techradar.com/news/ozark-season-4",
  "title": "Ozark season 4: everything we know so far",
  "category": "entertainment",
  "updated": "2021-09-25T17:00:32Z",
  "author": "aaron-bayne",
  "summary": "What’s next for the Byrde family?",
  "article": [
    "Ozark season 4, the final run of Netflix's crime drama, is confirmed to be releasing in two halves of 7 episodes. Filming is ongoing, and a release date is now officially coming in 2022.",
    "Ozark season 4 was officially announced by Netflix back in June 2020. Season 3 of the show landed just as the pandemic was kicking off, and no doubt got a supercharged response from entertainment-hungry viewers as a result of that timing.",
    "Ozark focuses on the morally questionable Byrde family, whose patriarch, Marty Byrde (Jason Bateman), moves the family to the Ozarks in order to launder cash for a cartel. Over time, the series has taken its characters to some incredibly dark places, and has emerged as Netflix's most underrated series, in our opinion. This final season, then, is highly anticipated.",
    "Spoilers follow for seasons 1-3.",
    "Release date: Ozark season 4's release date hasn't been officially revealed by Netflix yet, just that both parts 1 and 2 will release in 2022.",
    "Cast: We expect the main cast to return, including Jason Bateman, Laura Linney, Julia Garner and Lisa Emery. Veronica Falcón has also been added to the growing ensemble cast, along with actress Ali Stroker and actor Bruce Davison – you can read about that below.",
    "Season 3 recap: After the bloody final moments of season 3, we expect season 4 to pick up and deal with the fallout – the Byrdes' choices are truly going to catch up to them this season.",
    "Ozark season 4 entered production in November 2020. The final season will comprise 14 episodes, divided into two sets of seven episodes to be released at different times.",
    "It's now been confirmed by the trailer below that Ozark season 4 will release both parts in 2022. Exact timings have not been revealed yet.",
    "Check out the first Ozark season 4 teaser trailer above, which doesn't give much away – it simply shows Marty and Wendy Byrde, covered in blood, cleaning up. A short but sweet hint at what's to come.",
    "Here's who we expect to see in the Ozark season 4 cast, though note that an official cast list hasn't been unveiled:",
    "The fourth season of Ozark will see a host of returning (and surviving) characters as the show reaches its dreaded climax. Jason Bateman, who just won the SAG Award for Male Actor in a Drama Series for his role as Marty Byrde will return, along with his onscreen wife Wendy, played by the fantastic Laura Linney. Rounding out the Byrde family are Skylar Gaertner and Sofia Hublitz as Jonah and Charlotte.",
    "Sadly, scene-stealer Tom Pelphrey won’t be returning this season as Wendy’s brother Ben after his heart-breaking exit in season 3. Additionally, we don't expect to see Janet McTeer return from the dead as Helen, who came to her shocking, bloody end in season 3’s final moments. That said, series favorite Julia Garner will return as the indomitable Ruth Langmore.",
    "With their unexpected love affair, we are sure to see more of Charlie Tahan as Wyatt Langmore and Lisa Emery as Darlene Snell, and with an increased presence last season, Felix Solis will be back as the intense cartel boss Omar Navarro – this time as a series regular.",
    "Other than the returning cast, Ozark season 4 will introduce a host of new characters. As the Byrdes squirm their way into the political realms of the Ozarks, X-Men’s Bruce Davison will appear as a powerful retired U.S. senator that can be bought for the right price, as reported by Deadline.",
    "The outlet also confirmed that Ozark season 4 will introduce actors Alfonso Herrera, Adam Rothenberg, Damian Young, Bruno Bichir, CC Castillo, and Katrina Lenk to the cast – collectively, they will make up the bulk of both the Navarro crime family and the law enforcement circling them.",
    "In June 2021 (via THR), two new recurring cast members were added to the show: Veronica Falcón and Ali Stroker, who will each appear in. Falcón, who you might know from HBO's Perry Mason, will play Camila – sister of Omar Navarro, and apparently a formidable member of the family drug business. Meanwhile, Stroker plays Charles-Ann, a friend of Ruth's mother.",
    "We already know that Ozark season 4 will start just ten minutes after the bloody conclusion of season 3, as per a Deadline panel with Jason Bateman. \"The next season, the first episode, is Laura [Linney] and I looking in the mirror just after that moment, cleaning Janet [McTeer] out of our hair. It's a nice 10 minutes later pick-up from it.\"",
    "Beyond the blood-speckled launch, however, the final season will undoubtedly explore whether the Byrdes will finally manage to wriggle their way to the top. And, as showrunner Chris Mundy asks in conversation with Entertainment Weekly, “how much karma will catch up with them if they do?”.",
    "Dropping his intermittent directing duties for Ozark season 4, Bateman says that while he doesn’t write the series, he does know where everything ends. Speaking with IndieWire, Bateman kept with Mundy’s train of thought when it comes to approaching the end of the Byrdes' story.",
    "“...I was interested in the big question he [Mundy] has the opportunity to answer: Are they going to get away with it, or are they going to pay a bill? What does he want to message to the audience about the consequences of what the Byrdes have done – or lack thereof?”",
    "After just 30 episodes, the Byrdes have left a trail of bodies behind them as they seeped their way into the Ozarks, and with the locals, FBI, cartel, and the mafia watching their every move, we're expecting an explosive finale.",
    "As cartel boss Navarro has embraced the Byrdes – with the execution of Helen in season 3 – Marty and Wendy have proved they're well and truly in too deep. The Byrdes, however, may find a way to make their newfound friends work in their favor.",
    "Outside the immediate threats to the Byrdes, season 4 will have its work cut out for it, as characters like Darlene and Wyatt – who have been around since season 1 – are steadily aiming their sights towards the money-laundering pros. However, it is Ruth that is set to cause heaps of anxiety after cutting ties with the family at the end of season 3.",
    "Speaking with EW, Mundy hinted at his plans for Ruth in Ozark season 4. “Ruth's arc is that she thought she wanted to be Byrde and realized that not only is it okay to be a Langmore, she actually prefers to be a Langmore.”",
    "It'll be sad to see the show come to an end, but we're hoping it goes out on a high. With the Ozark locals slowly starting to turn against the invasive Byrdes, it looks like we are set for a tension-ridden ride. Bateman teases that “a super-sized season means super-sized problems for the Byrdes”.",
    "We can’t wait to see how it all ends when Ozark season 4 finally lands on Netflix.",
    "Ozark season 3 literally started with a bang as we got our first glimpse of the deadly cartel war. As the riverboat casino was circled by the FBI, and the future of the Navarro cartel seemed uncertain, the Byrde family’s commitment was being tested at every turn throughout season 3. Yet it wasn’t just their commitment to the cartel being tested, as the loveless couple endured a season-long power dynamic, which saw Wendy take the reins after going all-in during the previous season.",
    "Ozark season 3 saw the introduction of Wendy’s brother Ben, who threw many spanners into the works. Ben added fuel to the fire of Marty and Wendy’s conflict, romanced Ruth, and climatically outed Helen as a cartel lawyer in front of her oblivious daughter. This final act secured his grim fate: Wendy shockingly proved her loyalty by handing her brother over to the cartel, which likely saved her family, but resulted in the previously loyal Ruth cutting her ties with the Byrdes.",
    "With family business impacting the cartel, Marty and Wendy finally realized they had to work together, as Helen turned her sights on the couple. Yet as they jetted off to Mexico at the invitation of Navarro, it all seemed too late – that is, until Helen was shot upon their arrival. With Helen’s blood splattered across their faces, Navarro offered a disturbing hug and ominously stated “this is just the beginning”, concluding season 3 with the Byrdes heading into deep trouble.",
    "Wherever Ozark season 4 takes us next, we can't wait."
  ],
  "headers": {
    "27": "Ozark season 3 recap"
  },
  "links": {
    "Netflix's most underrated series": "https://www.techradar.com/news/why-ozark-is-netflixs-most-underrated-series",
    "Release date": "#ozark-season-4-release-date",
    "Cast": "#ozark-season-4-cast",
    "Season 3 recap": "#ozark-season-3-recap",
    "production in November": "https://www.indiewire.com/2020/08/ozark-season-4-production-start-date-jason-bateman-not-directing-1234580706/",
    "SAG Award for Male Actor in a Drama Series": "https://www.sagawards.org/nominees-and-recipients/27th-annual-screen-actors-guild-awards",
    "as reported by Deadline": "https://deadline.com/2021/02/ozark-bruce-davison-season-4-netflix-series-recurring-1234701089/",
    "The outlet also confirmed": "https://deadline.com/2020/11/ozark-cast-season-4-netflix-series-felix-solis-damian-young-alfonso-herrera-adam-rothenberg-1234615331/",
    "THR": "https://www.hollywoodreporter.com/tv/tv-news/ozark-season-4-veronica-falcon-ali-stroker-1234974070/",
    "Deadline panel": "https://deadline.com/video/ozark-cast-interview-season-3-finale-all-in-deadline-virtual-screening-series/",
    "Entertainment Weekly": "https://ew.com/tv/ozark-boss-breaks-down-season-3-bloody-final-scene/",
    "IndieWire": "https://www.indiewire.com/2020/08/jason-bateman-ozark-ending-interview-1234582101/",
    "EW": "https://ew.com/tv/ozark-boss-breaks-down-season-3-bloody-final-scene/",
    "“": "https://ew.com/tv/ozark-renewed-final-season/",
    "a super-sized season means super-sized problems for the Byrdes": "https://ew.com/tv/ozark-renewed-final-season/"
  }
}