{
  "source": "https://www.techradar.com/news/xiaomis-mi-mix-foldable-phone-appears-in-more-leaked-images",
  "title": "Xiaomi's Mi Mix foldable phone appears in more leaked images",
  "category": "phones",
  "updated": "2021-03-25T11:20:40Z",
  "author": "axel-metz",
  "summary": "Bringing up the rear",
  "article": [
    "Back in January, we reported on alleged prototype images of Xiaomi’s rumored first foldable phone, expected to be called the Xiaomi Mi Mix 4 Pro Max. Now, we’ve got an even better look at the rear of the device.",
    "Thanks to leaked images obtained by GSMArena, the upcoming foldable looks almost certain to be adopting an inward-folding design, corroborating previous suggestions that the device would look similar to the Galaxy Z Fold 2 and Huawei Mate X2.",
    "These photos also hint at a triple camera setup, aligned horizontally, of the sort we’ve seen on the Samsung Galaxy S21, though it’s likely that these represent placeholders in a very early design.",
    "Of course, we don’t know for sure that the leaked images concern the Xiaomi Mi Mix 4 Pro Max, but a visible Mix logo on the rear of the phone does suggest it will mark Xiaomi’s first entry in the Mi Mix series since the Mi Mix 3 in 2019.",
    "Given that these fresh photos all-but confirm the next Xiaomi Mi Mix will adopt an inward-folding hinge design, they have in fact worsened our fears about the size of its crease.",
    "Perhaps the most important metric for judging foldable phones is how obvious the crease is, which is the point at which a device’s fold appears on the screen. Early foldables, for example, were impeded by aggressively large creases which interrupted their respective displays.",
    "Judging by these images and foldable we’ve seen previously, the next Xiaomi foldable could suffer from a huge crease that seems likely to affect the harmony of its dual displays.",
    "On Twitter, Ross Young, founder of Display Supply Chain Consultants, recently said that China Star will supply the panels for the Xiaomi Mi Mix 4 Pro Max rather than Samsung Display.",
    "This could suggest that the next Xiaomi foldable – despite borrowing design ideas from the Galaxy Z Fold 2 – might not benefit from the same crease-less integration of the latter’s dual displays.",
    "Of course, these rumors and prototype images remain just that, and should be treated as such when drawing conclusions as to what the next Mi Mix phone might look like.",
    "We’re yet to officially learn of Xiaomi’s plans for its first foldable device, and though a recent patent suggests the Chinese company is working on something for the foldable market, we've been hearing that for years.",
    "Via GSMArena"
  ],
  "headers": {
    "4": "A bold fold"
  },
  "links": {
    "prototype images": "https://www.techradar.com/news/xiaomis-foldable-phone-was-spotted-in-public-and-its-got-a-big-problem",
    "GSMArena": "https://www.gsmarena.com/foldable_xiaomi_mi_mix_appears_in_leaked_handson_photos-news-48245.php",
    "previous suggestions": "https://www.techradar.com/news/new-xiaomi-foldable-phone-may-mimic-samsung-galaxy-z-fold-2",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Huawei Mate X2": "https://www.techradar.com/news/huawei-mate-x2",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Mi Mix 3": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
    "Ross Young": "https://twitter.com/DSCCRoss/status/1366461247953072128",
    "recent patent": "https://weibo.com/2430711645/K4MVFDfMd?from=page_1005052430711645_profile&wvr=6&mod=weibotime&type=comment#_rnd1615983949640"
  }
}