{
  "source": "https://www.techradar.com/news/netflix-wants-new-shows-so-badly-its-adapting-twitter-accounts",
  "title": "Netflix wants new shows so badly, it's adapting Twitter accounts",
  "category": "entertainment",
  "updated": "2021-07-28T09:34:28Z",
  "author": "axel-metz",
  "summary": "Knee-jerk or genius?",
  "article": [
    "It’s no secret that Netflix’s output has waned of late. Shows are being canceled left, right and centre, while more and more downright bizarre projects are being signed off on every week. And with the streamer’s latest announcement, that trend looks set to continue.",
    "Netflix has confirmed its next animated adult comedy series will be based on a popular Twitter account – called Chicago Party Aunt, after which the show will also be named – and will focus on the dysfunctional life of character Diane Dunbrowski.",
    "The parody account, which belongs to Chris Witaske and boasts 45,000 followers, commentates on life in the city of Chicago, Illinois through the eyes of Dunbrowski, a hard-partying middle-aged woman.",
    "Chicago Party Aunt will debut as 16 half-hour episodes, with comedian Lauren Ash providing the voice of the titular Diane. Rory O’Malley, RuPaul Charles, Jill Talley, Ike Barinholtz, Jon Barinholtz, Da’Vine Joy Randolph and Katie Rich will all star alongside Ash, too.",
    "There’s no word yet on what ground the show will cover, but it’s a safe bet to assume we’ll see episodic recreations of Diane’s tweet-based adventures through the city – which have included trashy eatery experiences and troubled relationships.",
    "The cast list also confirms that characters including Diane's nephew (Daniel), sister (Bonnie) and rival business owner (Gideon) will all feature, while Big Mouth producer Titmouse will be behind the show’s animation.",
    "Given the decidedly left-field source of inspiration for the show, it’s easy to dismiss Chicago Party Aunt as a stab in the dark for Netflix even before its first episode airs.",
    "But while it’s true the streamer’s library has suffered of late, its collection of animated shows has always been ahead of the pack when compared to those produced by other streaming rivals like Amazon Prime Video and Apple TV Plus.",
    "The likes of BoJack Horseman, F is for Family and the aforementioned Big Mouth have all gained something of a cult following in recent years, and there’s no reason why Chicago Party Aunt couldn’t match those successes.",
    "With Witaske, original owner of the account, on hand as the show’s creator, too, it looks set to remain as faithful as possible to its already-popular source material – so existing Chicago Party Aunt fans should be happy, at least.",
    "The show is set to premiere on Netflix on September 17. Stay tuned to TechRadar for our thoughts when it lands."
  ],
  "headers": {
    "6": "Analysis: Hit or miss for Netflix?"
  },
  "links": {
    "are being canceled": "https://www.techradar.com/news/when-netflix-cancels-a-tv-show-it-can-feel-unfair-why-is-that",
    "downright bizarre projects": "https://www.techradar.com/news/netflix-is-making-a-pokemon-tv-show-but-is-it-an-anime",
    "Twitter account": "https://twitter.com/ChiPartyAunt?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1420035450752757760%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.slashgear.com%2Fnetflixs-next-cartoon-for-adults-is-based-on-a-popular-twitter-account-27684313%2F"
  }
}