{
  "source": "https://www.techradar.com/news/forget-the-lg-c1-the-a1-oled-is-an-even-better-black-friday-tv-deal",
  "title": "Forget the LG C1, the A1 OLED is an even better Black Friday TV deal",
  "category": "televisions",
  "updated": "2021-11-25T12:54:41Z",
  "author": "henry-st-leger",
  "summary": "The LG A1 is the best way to get a cheap OLED in your home",
  "article": [
    "After a good Black Friday OLED TV deal? The LG A1 may be the smartest smart TV for you to buy.",
    "This budget OLED TV is now just $899 / £799 at a 48-inch size, vastly undercutting any other OLED screens on sale for Black Friday right now. It's on a par with last year's record-beating OLED price for the Vizio H1, which went for just $899 in a Black Friday flash sale – and the price looks to be holding. The step-up 55-inch and 65-inch sizes aren't bad either, as you'll see below.",
    "While the LG C1 OLED may be a bit higher specified, packing in a superior processor and some HDMI 2.1 ports, the LG A1 makes do with simpler connections and a cheaper chipset that manages to reduce the overall list price.",
    "You may have to deal with a little more video noise in dark scenes, and you won't be able to get 4K/120Hz passthrough from a PS5 or Xbox Series X games console, due to the lack of HDMI 2.1. But the overall offering – including the OLED panel – is pretty similar to the LG C1, but at a temptingly lower price. Check out our LG A1 OLED guide for more info too.",
    "Outside the US or UK? See the best TV deals in your region just below.",
    "Looking for more discounts? Head over to our main cheap TV deals page to see a full list of recommendations from LG, Samsung, Sony, and other leading brands. Also:"
  ],
  "headers": {
    "4": "Black Friday OLED TV deal: LG C1",
    "5": "More Black Friday TV deals"
  },
  "links": {
    "Black Friday OLED TV deal": "https://www.techradar.com/black-friday/black-friday-oled-tv-deals-2021-the-best-early-oled-sales-you-can-find-today",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "LG A1 OLED": "https://www.techradar.com/news/lg-a1-oled-price-release-date-specs-sizes",
    "cheap TV deals": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales"
  }
}