{
  "source": "https://www.techradar.com/news/we-might-finally-know-why-xbox-game-pass-is-so-important-to-microsoft",
  "title": "We might finally know why Xbox Game Pass is so important to Microsoft",
  "category": "gaming",
  "updated": "2021-05-06T13:50:59.121Z",
  "author": "hamish-hector",
  "summary": "Console sales aren't making money",
  "article": [
    "The Apple vs Epic Games trial might have begun as a battle to put Fortnite back on iPhones, but now it’s become the tool to air all of gaming’s secrets. The latest revelation explains why Xbox might be so keen to push Game Pass as far as it can and not keep it exclusive to just its own console platform.",
    "Xbox vice president Lori Wright was called as a witness for the court battle. According to Protocol, when asked by Epic Games’ lawyer about the profit margin on Xbox console sales Wright replied “We sell the consoles at a loss”. Later asked if an Xbox console had ever been sold for a profit she said “No.”",
    "One of gaming’s worst kept secrets is that consoles almost always sell at a loss - and make money back on the sale of games – but it’s still surprising to hear that out loud. Though the comments might explain Microsoft’s push for Game Pass to launch on as many platforms as possible; if it can sell you the games without making a loss on the consoles then it's a win-win.",
    "Epic’s lawyer’s line of questioning might seem odd for a court battle between Epic Games and Apple, but the Fortnite developer was using Xbox’s profitability to justify why it has no issue with a 70/30 revenue split on consoles but does on mobile.",
    "Judge Yvonne Gonzalez Rogers – who will be the sole person deciding the outcome of the case – had previously stated Epic would have to convince her why Apple was specifically at fault. She feared her verdict could otherwise have too far-reaching an impact on digital storefronts in general.",
    "Consoles have been a loss leader over the past few decades, but is Xbox able to change the game with Game Pass? Is Game Pass actually making them money when consoles aren't?",
    "This is a question that a lot of people outside of Xbox want to know because the answer isn’t clear. We know that Game Pass Ultimate costs $14.99 / £10.99 / AU$15.95 a month, and based on comments earlier this year, it has around 18 million subscribers. That would be a rough $270 million per month, or $3.2 billion a year.",
    "Obviously, it isn’t that simple: Game Pass has different tiers and frequent deals selling it for way cheaper, but those numbers still aren’t something to scoff at. As more people buy Xbox Series Xs, and as XCloud – the Game Pass streaming service - comes to more platforms like Smart TVs, we’re sure to see that number grow even more.",
    "And that growth is likely what’s most important right now. Speaking to Eurogamer, analyst Daniel Ahmad said Xbox is “very much in a user acquisition stage”. He explained further that “once people have that library, they're very unlikely to unsubscribe, and they're going to keep subscribing then for years to come.”",
    "Once enough people are stuck in the ecosystem, that’s when profits start rolling in. So Xbox is just in that waiting game right now, sustaining its platform while more and more people subscribe.",
    "Unfortunately, that means we’ll have to wait too. It’ll take time before we know if Game Pass is a success or not, though given how much people love it, it seems like everyone is hoping it does well."
  ],
  "headers": {
    "3": "Why was Microsoft a witness in the Epic vs Apple court battle?",
    "5": "Is Game Pass profitable?"
  },
  "links": {
    "Apple vs Epic Games trial": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Protocol": "https://www.protocol.com/microsoft-confirms-the-xbox-hardware-business-loses-money",
    "Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "comments earlier this year": "https://www.techradar.com/news/xbox-game-pass-hits-18-million-subscribers-as-microsofts-strategy-pays-off",
    "comes to more platforms like Smart TVs": "https://www.techradar.com/news/xbox-could-be-an-app-on-your-smart-tv-within-a-year-says-phil-spencer",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-02-17-is-xbox-game-pass-too-good-to-be-true"
  }
}