{
  "source": "https://www.techradar.com/news/starfield-really-is-an-xbox-exclusive-no-seriously",
  "title": "Starfield really is still an Xbox exclusive – no, seriously",
  "category": "gaming",
  "updated": "2021-09-01T19:32:51Z",
  "author": "jamel-smith",
  "summary": "Bethesda and Xbox reps have stressed again that, yep, Starfield is an Xbox exclusive, and an Xbox exclusive only",
  "article": [
    "To once again reconfirm, Starfield is not coming to PlayStation. Sorry PS5 owners.",
    "The renewed rumors surrounding which consoles Bethesda’s star-hopping new sci-fi game is headed to were re-ignited by a misunderstanding during a Bethesda Gamescom stream, where Bethesda’s Pete Hines said he didn’t know if he would go as far to say ‘you’re done ever playing [Bethesda Games] stuff on PlayStation.’ Subsequently, PlayStation fans once again hoped Starfield would eventually make its way to the PS5.",
    "Pete Hines and Xbox’s marketing boss Aaron Greenberg had to take to Twitter to quell rumors and once again state that Starfield is an Xbox exclusive, that it remains and will not change from being an Xbox exclusive. Starfield will release, exclusively, on Xbox Series X/S, and PC on November 11th, 2022, and will also be offered up as part of the Xbox Game Pass subscription service.",
    "It’s increasingly absurd that some PlayStation fans are still holding onto hope that Starfield will eventually find its way onto PS5, even after knowing that Microsoft paid $7.5 billion to acquire Bethesda Studios. When the game was initially announced back in 2018 it was widely expected to be a multiplatform game, but things have changed and Bethesda is now becoming more and more integrated into the Xbox family. While Deathloop may have just avoided the exclusivity cut, it’s looking increasingly like the majority of Bethesda games will be Xbox exclusives in the future.",
    "But PlayStation fans shouldn’t be too dismayed – the console has an incredible lineup of exclusives of its own waiting in the wings that Xbox fans will likely be envious of, too.",
    "The highly anticipated sequel to God of War (2018): God of War: Ragnarok is set to be released next year, along with Horizon Forbidden West, Forspoken, and Ghostwire: Tokyo. The future is just as bright when it comes to third-party games headed to both consoles, too, with Elden Ring and Hogwarts Legacy top of our lists, just to name a few.",
    "With many Starfield-caliber AAA games being released for the PS5 next year, Sony’s fans will have plenty to sink their teeth into. PS5 owners will probably be fighting Thor across the five realms next year, with a decapitated head attached to their waist, exclusively. What more do you need?"
  ],
  "headers": {
    "3": "Opinion: PlayStation fans don’t be dismayed"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Pete Hines": "https://twitter.com/DCDeacon/status/1432422360922169346?s=20",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Deathloop": "https://www.techradar.com/news/deathloop-on-ps5-is-a-fun-shooter-but-a-secretly-great-detective-game",
    "God of War (2018)": "https://www.techradar.com/news/god-of-war-review",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Forspoken": "https://www.techradar.com/news/forspoken-release-date-trailers-news-and-rumors",
    "Ghostwire: Tokyo": "https://www.techradar.com/news/ghostwire-tokyo-ps5-exclusive-delayed",
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "Hogwarts Legacy": "https://www.techradar.com/news/harry-potter-rpg-everything-we-know"
  }
}