{
  "source": "https://www.techradar.com/news/the-best-sonic-game-in-years-is-going-to-be-free-on-epic-games-store-today",
  "title": "The best Sonic game in years is going to be free on Epic Games Store today",
  "category": "computing",
  "updated": "2021-06-24T10:31:37Z",
  "author": "darren-allan",
  "summary": "Sonic Mania is a nostalgic treat and a half",
  "article": [
    "Sonic is 30-years-old – well, the blue hedgehog had that milestone birthday yesterday – and the latest freebie from the Epic Games Store celebrates this in style.",
    "Sonic Mania is, in our opinion, the best outing for the franchise in recent times, and unsurprisingly it featured on our list of the best Sonic games ever, which was compiled in honor of the hedgehog’s anniversary.",
    "So, to get it free is pretty cool to say the least, and it adds more weight to the towering pile of top-notch freebies that Epic has given away in recent history (including critically aclaimed Control earlier in June).",
    "Sonic Mania is a retro platformer in classic Sonic style, starring the titular hedgehog plus two companions Tails and Knuckles. It features that classic Megadrive/Genesis look and the same iconic environments, but delivered alongside some fresh zones and featuring some excellent graphics.",
    "You even get the original sounds – with a great soundtrack – and the feel of a classic Sonic game is perfectly captured, so this truly is a nostalgia-laden treat. However, it’s also a superb platformer in its own right, so you’ll enjoy this even if you’ve never dipped a toe in Sonic waters before (unless you really detest platform games, that is).",
    "Sonic Mania will be available to grab for free on the Epic Games Store later today (it’ll soon replace Overcooked 2, so if you want that, move quickly)."
  ],
  "headers": {
    "3": "Classic formula"
  },
  "links": {
    "freebie from the Epic Games Store": "https://www.techradar.com/news/free-epic-games-store-games-this-weeks-giveaways-revealed",
    "best Sonic games ever": "https://www.techradar.com/news/sonic-30th-anniversary-the-5-best-sonic-the-hedgehog-games",
    "including critically aclaimed Control earlier in June": "https://www.techradar.com/news/epic-games-stores-next-free-game-could-be-its-biggest-giveaway-ever",
    "grab for free on the Epic Games Store later today": "https://www.epicgames.com/store/en-US/p/sonic-mania"
  }
}