{
  "source": "https://www.techradar.com/news/every-love-death-and-robots-episode-ranked",
  "title": "Every Love, Death and Robots episode ranked",
  "category": "entertainment",
  "updated": "2021-05-22T11:00:00.137Z",
  "author": "axel-metz",
  "summary": "Every episode of Netflix's sci-fi anthology, ranked",
  "article": [
    "The new season of the excellent Love, Death and Robots anthology series has arrived on Netflix, and pretty much picks up where the robot-malfunctioning, alien-shooting debut collection left off.",
    "Not all of the season 2’s whacky stories hit the heights of those in the first, but Love, Death and Robots continues to prove that less is often more when it comes to engaging TV.",
    "In this list, we rank every episode – across both seasons – from worst to best, bearing in mind their quality of animation, storytelling and ability to keep our eyes wide and mouths open. Descriptions for each will become more detailed as the list ascends – because there’s only so much to be said about sentient yoghurt overlords.",
    "And so we begin with the When the Yoghurt Took Over, an absurdist, if entirely inoffensive, tale of a society dictated by sentient yoghurt. It’s suitably bizarre, but also only four minutes long – not one that stays long in the memory, if we’re honest.",
    "Sucker of Souls throws up the question of what makes good animation. It’s pretty to look at, for sure, but doesn’t quite fit the motion-heavy sequences that fill this story of a giant Dracula-inspired monster hiding in a tunnel system. A later episode in the show, Blindspot, hits this balance more effectively.",
    "In a rare live-action outing for the series, Ice Age sees a young couple move into a home not knowing of the miniature civilization that resides inside their fridge. Topher Grace and Mary Elizabeth Winstead are a funny duo, at least, but it’s not the most original of Love, Death and Robots’ stories.",
    "Season 2’s opener seems like a sequence plucked straight from the script of Despicable Me or Cloudy with a Chance of Meatballs – which is a compliment. The problem is, Automated Customer Service doesn’t do anything we haven’t seen before, and its premise wears thin as soon as you realize where its killer-vacuum-robot plot is headed.",
    "It feels a little harsh placing Alternate Histories so far down on this list, since it deserves credit for its unique 2010-era-internet-game animation style – but it just doesn’t make much sense. It follows the alternative ways Adolf Hitler might’ve died, including one scenario where he suffocates after being encased in a giant jelly… Enough said, really.",
    "Save for its slightly unexpected ending, The Dump is a pretty bland affair. A giant garbage monster emerges from – you guessed it – a giant garbage dump, and proceeds to exist alongside an old-timer who lives among the trash. The animation is gorgeous, but that doesn’t hold much value in a series where every episode is adorned with pretty computer work. There isn’t a whole lot of love, death or robots to it, either.",
    "Fish Night packs a glorious final few minutes, but is let down by committing two thirds of its run-time to an uninspired conversation between a pair of travelers stranded in the desert. It doesn’t half look like a Borderlands game, though – and the Great White Shark reveal is awesome.",
    "Ice is probably the most anime-like of any episode in either season, and benefits from this stylistic approach. It does a great job of cultivating its dystopian, ice-ridden environment, and is a nice breather from the ultra-realistic animation of several other stories in the series. That said, it’s a little unsure of what it wants to say – genetic modification is bad, but good, but also bad?",
    "Sonnie’s Edge is a tricky one. Its monster-battling premise is thrilling to behold, and the use of bright lights and neon colors makes for hypnotic viewing, but the episode is let down by a misguided use of sexual assault as a plot device – which is problematic, to say the least. Ultimately, placing it here feels like a solid compromise.",
    "The Drowned Giant is something of a marmite episode for the series. It follows a scientist’s existential musings after a giant washes up on an English beach, and swaps the death and destruction of previous entries for a slower-paced, dialogue-heavy examination of a decaying BFG. It’s got a cool Death Stranding-esque feel to it, though.",
    "Helping Hand is best described as everyone has already described it – Gravity meets 127 Hours. The story here is simple, but it’s an effective suspense episode following the plight of a drifting astronaut. It’s also definitely not for the squeamish.",
    "The hyper-realistic extension of Automated Customer Service before it, Life Hutch sees Michael B. Jordan do battle with a malfunctioning maintenance robot. The episode is a clear win for animation – the facial effects here are some of the best ever seen – but beyond that, it isn’t anything to write home about. Still, it’s genuinely a challenge to separate the digital from the real in this one – seriously, are we sure it’s actually animated?",
    "A neat idea, well executed. Shape Shifters is a bloody and violent story of two Marines with supernatural powers which utilizes a great score and some pretty character models. As with Fish Night, though, it spends a little too long getting to its juicy parts. Soldier werewolves are bloody cool, mind.",
    "Good Hunting deserves praise for daring to be different. Its story of a shape-shifting fox is unique and beautifully realized, and its steampunk-style locales bear more than a few Studio Ghibli hallmarks. The episode is unnecessarily horny, though – multiple topless women and a cyborg sex toy is a little much, isn’t it?",
    "The Tall Grass is really cool. It follows an unnamed protagonist’s wanderings through a creature-infested field after his train breaks down, and utilizes an awesome art style designed by Dreamworks animator Simon Otto. It’s got a real Lovecraftian feel to it, we just wish it lasted a little longer.",
    "It’s a testament to the power of anthology storytelling that Lucky 13 is able to cultivate a real sense of connection between a pilot and her ship despite such a short run-time. Similar to Life Hutch, it's hard to tell whether a motion-captured Samira Wiley is indeed an animation in this one, which utilizes hyper-realistic rendering to great effect. It’s not particularly original, but the episode is an easy, enjoyable watch nonetheless.",
    "Love, Death and Robots’ answer to The Grinch, All Through the House follows the curiosity of two siblings desperate to catch a glimpse of Santa Claus on Christmas Eve. Suffice to say, St. Nick doesn’t exactly turn out to be the friendly old man they were expecting – but all's well that ends well. The stop motion animation gives this one a real homely feel, and the episode is ultimately better off for toning down the sci-fi and going somewhere unexpected.",
    "Possibly the funniest of any episode in either series, Three Robots’ (surprise!) three robots are brilliantly voice-acted and have a great chemistry between them. Their wanderings through a post-apocalyptic city throw up some clever criticisms of humanity, but this one is mostly geared towards offering some lighthearted relief from the madness of other episodes.",
    "In Blindspot, a gang of cyborg thieves stage a high-speed heist of an armored convoy, and it absolutely leaves you clamoring for a full-length series. Like the show’s best episodes, it touches on all three themes – love, death and robots – to provide a thrilling glimpse of what could so easily be an established animated franchise. To achieve that in less than seven minutes is remarkable. Once again, there’s more than a few shades of Borderlands in this one.",
    "One of the anthology’s longer episodes, Suits tells of a farming community forced to don mech-suits to fend off a horde of alien creatures. It’s got heart, humor and great set pieces, and reminds us of a top-down mobile defense game in how events play out. The art style, too, isn’t one seen elsewhere, and really works for the episode’s intense action sequences. Oh, and the last shot is really cool.",
    "The most Cyberpunk 2077 of any episode in the show, The Witness is a vibrant and colorful tale of an unsuspecting murder witness pursued by the supposed murderer. Sure, things take a turn for the seedy, but that doesn’t negate the impact of its animation style – which is, for our money, unlike anything you’ve seen before. The Witness also plays with time in interesting ways, too, and seems like one of those stories only Love, Death and Robots could tell.",
    "Snow in the Desert is a visual marvel, and pushes the capabilities of CGI to new heights. It follows a genetically-enhanced bounty hunter as he evades capture in the desert, and had us wishing for the return of The Mandalorian more than most other shows out right now. The episode merges shades of so many beloved universes – Star Wars, Dune and Guardians of the Galaxy among them – to form 15 minutes of engaging, distinctive television. The end reveal is a little trite, but Snow in the Desert is undoubtedly one of the series’ best entries.",
    "Guns! Aliens! Russians! The Secret War is as chaotic as it is beautiful, and imposes the show’s overused horde mode plot on a World War 2 setting in a way that still manages to seem unique and refreshing, even though it isn’t. Think of it as the story of Viktor Reznov leading the 300 Spartans – with about as much shouting and shooting as you’d expect from that scenario. There’s nothing particularly surprising about it, but The Secret War gets away with sticking to its guns (good, right?).",
    "Yes, Beyond the Aquila Rift has a very long sex scene. No, that’s not why it’s number three on this list. Unlike some of the gratuitous erotica elsewhere in the series, this episode uses the passion of its sexual encounter to make its suspenseful, horrifying reveal all-the-more shocking. It manages to pack the character-building depth of a feature-length movie into a fifteen-minute run-time, and tells its story of a stranded space crew with pitch-perfect pace. Also, its giant skeletal spider alien is creepy as heck.",
    "It was a welcome surprise to see a story totally lacking in sex and violence become the best episode of Love, Death and Robots’ first season. Zima Blue follows the rise of a mysterious artist who uses the color blue as a hallmark in his work, and shouldn’t be nearly as gripping as it turns out to be. It’s almost cathartic. The art style is simple, the plot unremarkable, but the episode ends up posing thoughtful questions about the nature of life and consciousness more effectively than many big-budget Hollywood flicks out there.",
    "And so we reach our pick for the best episode of Love, Death and Robots. With very little exposition, Pop Squad drops you straight into the mental struggle of a cop charged with fighting overpopulation in a dystopian city – he’s a child assassin, basically. Both the score and art style merge tropes of movies like Blade Runner to form a mightily-effective examination of humanitarian responsibility and the meaning of life, while some triple-A voice acting keeps the episode’s characters feeling as human as possible. Check out the rain effects in this one, too – talk about creating an atmosphere. Pop Squad is what Love, Death and Robots was commissioned for."
  ],
  "headers": {
    "3": "26. When the Yoghurt Took Over",
    "4": "25. Sucker of Souls",
    "5": "24. Ice Age",
    "6": "23. Automated Customer Service",
    "7": "22. Alternate Histories",
    "8": "21. The Dump",
    "9": "20. Fish Night",
    "10": "19. Ice",
    "11": "18. Sonnie’s Edge",
    "12": "17. The Drowned Giant",
    "13": "16. Helping Hand",
    "14": "15. Life Hutch",
    "15": "14. Shape Shifters",
    "16": "13. Good Hunting",
    "17": "12. The Tall Grass",
    "18": "11. Lucky 13",
    "19": "10. All Through the House",
    "20": "9. Three Robots",
    "21": "8. Blindspot",
    "22": "7. Suits",
    "23": "6. The Witness",
    "24": "5. Snow in the Desert",
    "25": "4. The Secret War",
    "26": "3. Beyond the Aquila Rift",
    "27": "2. Zima Blue",
    "28": "1. Pop Squad"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far"
  }
}