{
  "source": "https://www.techradar.com/news/htc-vive-pro-2-release-date-specs-price-and-features",
  "title": "HTC Vive Pro 2: price, specs, release date and everything else you need to know",
  "category": "gaming",
  "updated": "2021-05-17T12:00:22Z",
  "author": "gerald-lynch",
  "summary": "The HTC Vive Pro 2 is a no-compromises PC VR headset",
  "article": [
    "Looking for a high-spec VR headset? The newly-revealed HTC Vive Pro 2 will soon whisk you off to super-hi-res virtual reality worlds.",
    "The original HTC Vive put at-home virtual reality on the map, with its spot-on spatial tracking and high resolution screen. The competition has heated up since its 2016 debut, though, with the Oculus Quest 2 and Valve Index impressing VR gamers. But with the HTC Vive Pro 2, HTC is ready to re-stake its claim as the premium VR headset manufacturer to beat.",
    "And, in terms of its spec sheet, the HTC Vive Pro 2 is perhaps the most powerful, high-end VR headset out there – at least in terms of what’s readily available to the at-home consumer.",
    "Lockdown restrictions mean we’ve yet to go hands-on with the device, and were instead treated to an online briefing with HTC, spilling all the details. We’re expecting to offer some hands-on impressions in the coming weeks however, so keep checking back for that soon.",
    "In the meantime, here’s everything you need to know about the HTC Vive Pro 2.",
    "Rather than going for an all-in-one, wireless headset design for the HTC Vive Pro 2, HTC is instead targeting the high-end capabilities of virtual reality that can only be reached by hooking up to a well-specified PC.",
    "And the numbers HTC is targeting are very impressive. The Vive Pro 2 offers a 5K resolution display (2.5k to each eye), and is aiming to maintain a silky-smooth 120Hz refresh rate. That’s a much sharper display than is present with the Oculus Quest 2, which is only capable of targeting 120Hz refresh rates on selected titles.",
    "It's not just the resolution that impresses, though, but also the quality of the panels in use. The headset is packing a fast-switch LCD with RGB sub-pixels, and IPD (interpupilary distance, the space between each eye and the bridge of the nose)-adjustable goggles that support a 120-degree field of view. That’s wide enough to catch action out of the corner of your eye, thanks to a dual-stacked lens design. It’s a very advanced optics system, with the LCD display shrunk compared to previous models for improved heat management.",
    "Pushing this many pixels may make your rig rightly quiver at what’s going to be expected of your PC, and while HTC hasn’t shared recommended specs yet, it’s focussing primarily on enthusiast (and business) users here. You’re going to need a powerful machine to get the most out of the Vive Pro 2.",
    "But HTC has done what it can to take the strain off your components as best as possible, working alongside Nvidia and AMD to make Display Stream Compression optimised for the VR headset. This allows for faster compiling and recompiling of visual data between the PC and headset when crunching down the large assets needed to make the 4K screen shine.",
    "Display Port 1.2 is still supported too, even with Display Port Compression active. HTC’s Vive Wireless adapter will also be supported – though users will not be able to hit the native 4896 x 2448 / 120Hz resolution and frame rate target that the tethered set up delivers.",
    "HTC has made some adjustments to its headsets to improve upon the ergonomics for the HTC Vive Pro 2, too. As well as the fine-tuneable IPD slider, it’s ensured that its headstrap is quick to adjust and lock thanks to a dial system, while its facial interface is wide enough to accommodate glasses wearers.",
    "Weight is said to be evenly distributed to avoid strain on your neck, while 3D spacial sound speakers hover over the users ears, meaning they still have a sense of what’s going on in their real-world surroundings. The audio interface is also Hi-Res certified, meaning you can hook up audiophile-grade headphones to the headset and appreciate a more richly-detailed sound experience.",
    "If there’s one thing that may not be quite so comfortable for the budding VR gamer, that’ll be the continued reliance on base stations for tracking with the HTC Vive Pro 2. Along with the tethered connection to the PC, it’s another obstacle to a quick, hassle free with VR engagement, meaning you’re going to need to find space to house two small tracking cubes around your play space so that the Vive Pro 2 knows where you are.",
    "Along with the cable tether, that’s the trade off to get the highest-possible visual quality from a VR headset at present – though the gap is closing with inside-out tracking systems as seen with the Oculus Quest 2.",
    "Those looking for an untethered, all-in-one headset from HTC should look towards the newly-revealed HTC Vive Focus 3 – though that’s primarily being targeted at business users.",
    "Existing HTC Vive owners can find some solace in the fact that all existing HTC VR accessories will be compatible with the new HTC Vive Pro 2 however, meaning you won’t need to buy additional gear other than the headset if you’re already rocking VIVE Trackers of any generation, the VIVE Facial Tracker, Vive ‘wand’ controllers, or Steam VR accessories such as the Valve Index ‘knuckle’ controllers. Oculus controllers are not compatible, if you were wondering.",
    "If you’re upgrading from an HTC Vive and want the HTC Vive Pro 2 headset only (because you already own the rest of the kit), then you can pre-order one now.",
    "According to HTC, the brand wants to thank loyal users by not only offering the headset to pre-order, but also giving current users a discount, making the Vive Pro 2 headset available for £659 ($749).",
    "For anyone without an HTC Vive already, you’ll need the full Vive Pro 2 kit. This includes a base station and Vive controllers. This will be available from 4 June for £1299 ($1399).",
    "This price positions the HTC Vive Pro 2 as a truly high-end VR option rather than a competitor for current standalone favorite, the Oculus Quest 2, which is significantly cheaper at £299/$299 for the 64GB version and £399/$399 for the 256GB version.",
    "Instead, it’s more similar in price to our current best VR headset, the Valve Index, which costs £919/$999 for the full kit. This would make sense given the Vive Pro 2 is also a PC-powered VR headset. However, it does suggest it’s aimed more at seasoned VR pros rather than those new to the medium who might be weighing up options and would be less likely to make a $1000 commitment straight out of the gate.",
    "Though we’ve yet to try the HTC Vive Pro 2, we’re excited by the direction the company is looking to take its consumer headset in. The Vive Pro 2 is setting out to be a no-compromise virtual reality experience, directed at the most engaged members of the virtual reality community.",
    "It’s expensive, yes. And the array of accessories required to get up and running is not for the cable-adverse, especially when compared to the all-in-one Oculus Quest 2. And that’s before you factor in the need for a high-end PC to run the show.",
    "But HTC is promising something that die-hard VR fans have been calling out for – a real, next-gen-worthy, enthusiast grade PC VR set up. It won’t be for everyone, but we’ve got a good feeling that those who do invest will be getting something quite special for all that money."
  ],
  "headers": {
    "5": "HTC Vive Pro 2 features",
    "11": "Comfort and compatibility",
    "17": "HTC Vive Pro 2: Release Date and Price",
    "22": "Early impressions"
  },
  "links": {
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "HTC’s Vive Wireless adapter": "https://www.techradar.com/news/vive-wireless-adapter-launches-today-for-untethered-vr",
    "Hi-Res": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}