{
  "source": "https://www.techradar.com/news/optimizing-the-employee-experience-for-a-post-pandemic-world",
  "title": "Optimizing the employee experience for a post-pandemic world",
  "category": "computing",
  "updated": "2021-04-09T14:25:39Z",
  "author": "andrew-avanessian",
  "summary": "As we find our way out of the pandemic, businesses will need to look ahead",
  "article": [
    "At the start of 2020, we could not have predicted the impact of the pandemic and the scale at which businesses would be forced to adopt technology, embark on digital transformation projects and embrace remote working.",
    "While many organizations will have rolled out some form of remote working technology pre-pandemic, others will have been forced to act quick and adopt solutions that enabled employees across the globe to work from home almost overnight.",
    "This quick reaction has meant that businesses have been able to survive throughout the last twelve months, but as we find our way out of the pandemic and employee needs evolve rapidly, organizations need to shift from survival mode to thriving.",
    "Even before the pandemic, the average knowledge worker was using 35 business applications, and switching between these over 1,000 times a day. And research from Okta details how the number of worker applications deployed by organizations has increased by 68% over the past four years. This is no doubt down to the natural technological evolution of our workforces.",
    "While this proliferation of technologies has enabled huge business and economic success, it has also brought a layer of complexity to the employee experience, which could significantly impact how successful businesses are in the future.",
    "One of the main issues lies in context switching. Put simply, this is where users are forced to jump between different apps or windows to complete tasks, taking them out of the flow of work.",
    "Research has found that knowledge workers spend up to an hour a day navigating between their business applications, and 56% find searching for information from different apps disruptive. McKinsey reported that knowledge workers spend nearly 20% of their working week looking for information or help on tasks. For many businesses, working from home has only compounded this issue, especially where the support experience offered is sub-par.",
    "This disjointed experience of employees flitting between applications and seeking support from a multitude of places is causing a huge gap to appear in the employee experience. With hybrid working – splitting time between the office and remote working – looking increasingly likely, it’s even more important that as employees continue to work from home, organizations look to address this issue.",
    "Rolling out the necessary technologies and ensuring users have the right support is no easy feat. According to research from analyst firm Constellation Research, businesses have struggled to both support and enable workers long-term when it comes to the technologies they have rolled out. This challenge will no doubt worsen as more applications are deployed and IT estates become more disparate.",
    "To remedy this, a recent report from the analyst firm details how businesses have a historic opportunity to transform the employee experience gap. This involves adopting an employee experience platform (EXP) model that connects disparate applications and software into a more cohesive digital workplace.",
    "Disruptive technologies, such as digital adoption platforms (DAPs) are highlighted as a critical component to the EXP. DAPs help solve the issue of disparate IT estates by integrating on top of software applications and providing contextual support for users, which helps to directly address the two primary challenges organizations are facing right now, as highlighted by Constellation Research. DAPs also ensure that all employees receive the same, consistent support experience, wherever they are and whatever language they speak, to ensure that they stay in the flow of work, no matter what.",
    "There’s no doubt that remote working in some form is here to stay – it has been a broad success for most organizations, with many businesses reporting greater productivity compared to pre-pandemic times. But soon there will come a time when the way we have been doing things is no longer enough. Optimizing the employee experience and ensuring that employees are supported and enabled through technology, wherever they are, will be crucial."
  ],
  "headers": {
    "3": "Application overload",
    "5": "Is context switching impacting your bottom line?",
    "8": "The employee experience gap",
    "11": "What’s next?"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "employee experience": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}