{
  "source": "https://www.techradar.com/news/gta-5-enhanced-edition-for-ps5-has-been-delayed",
  "title": "GTA 5 Enhanced Edition for PS5 has been delayed – more bad news for GTA 6?",
  "category": "gaming",
  "updated": "2021-09-09T20:29:11Z",
  "author": "adam-vjestica",
  "summary": "You’ll have to wait a little longer to return to Los Santos",
  "article": [
    "Rockstar’s GTA 5 Enhanced Edition has been delayed to March 2022. The announcement was made during the PlayStation Showcase 2021 and means the game won’t hit its original release date of November 11, 2021, as planned.",
    "It’s unclear why a game that is over eight years old would receive such a lengthy delay, especially as this is just a remaster. A new trailer reiterated that the game will include improved graphics, enhanced gameplay, and seamless character switching.",
    "The game will also include more content for GTA Online, the game's ever-popular multiplayer mode. PlayStation Plus members will receive additional content, as part of Sony's marketing deal with Rockstar.",
    "While GTA 5 Enhanced Edition's delay might not seem like much for a game that will be making its third debut on a console (GTA 5 was released on PS3, PS4, and soon PS5), it could mean that GTA 6 is even further off than we could have ever imagined.",
    "GTA 6 is already rumored to be released no earlier than 2024/2025, and it's logical to think that GTA 5's delay will only push it back. Hopefully, that's not the case.",
    "GTA 5 Enhanced Edition will certainly be popular, even if millions have already played the game before. The game continues to top best-seller lists every year, and we'd expect nothing different when GTA 5 drops on PS5 and Xbox Series X/S in March 2022."
  ],
  "headers": {},
  "links": {
    "GTA 5 Enhanced Edition": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "PlayStation Showcase 2021": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}