{
  "source": "https://www.techradar.com/news/these-are-the-best-smart-plug-prime-day-deals-to-snap-up-now",
  "title": "These are the best smart plug Prime Day deals to snap up now",
  "category": "smart-home",
  "updated": "2021-06-22T23:20:51Z",
  "author": "sophie-bird",
  "summary": "These Prime Day smart home deals make life a whole lot easier",
  "article": [
    "Prime Day deals are everywhere right now, but if you're after something genuinely useful, these smart home deals are worth snapping up.",
    "Having a smart home will not only make life easier, but it can also be a great way of soothing that anxiety of wondering if you've left something switched on, or if you remembered to turn off those pesky hair straighteners. Plus, with the best smart plugs and switches, you'll look super fancy too.",
    "Today there's 22% off the Kasa Smart Light Switch, now $34.99 (was $44.99) at Amazon. This smart switch is ideal if you want to control your lighting from your phone, or if you want to mimic someone being at home while you're on vacation.",
    "That's not the only saving either, the Kasa Smart Plug Power Strip KP303 is reduced to $22.79 at Amazon - which is a 24% discount. This power strip works with voice commands via Alexa or Google Assistant, so you won't even need to lift a finger to control it.",
    "Not in the US? Scroll down for deals in your region.",
    "After spending so much time at home because of the coronavirus pandemic, creating a smart home seems like the only way to have the convenience of being at home to switch the crockpot on for dinner, while being out and about at the same time.",
    "All three of the smart home accessories we've included above are compatible with Amazon Alexa or Google Assistant so you'll be able to use voice commands to switch your plugs and switches on and off.",
    "Not sure why you'd need a smart light switch? These handy devices allow you to control your lights when you're not at home and want it to appear like you are for security reasons. Plus, they're very handy for those times when your hands are too full to grab the light switch or you get into bed and you've left the lights on.",
    "Whether your home is fully kitted out with smart devices or you just want to dip your toe into the smart home world, these Prime Days offer great savings right now.",
    "No matter where you live, you'll find all the lowest prices for smart plugs from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best smart home deals on Prime Day",
    "9": "More smart plug deals",
    "10": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best smart plugs and switches": "https://www.techradar.com/news/best-smart-plugs-and-switches",
    "now $34.99 (was $44.99) at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07HGW8N7R%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4116084554085471700-20",
    "Kasa Smart Plug Power Strip KP303 is reduced to $22.79 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB083JKSSR5%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1017816017936364000-20"
  }
}