{
  "source": "https://www.techradar.com/news/google-nest-audio-smart-speaker-discounted-ahead-of-prime-day-2021",
  "title": "Google Nest Audio smart speaker discounted ahead of Prime Day 2021",
  "category": "audio-visual",
  "updated": "2021-06-16T11:05:42Z",
  "author": "rhys-wood",
  "summary": "Google Nest Audio available at a tempting price",
  "article": [
    "Smart speaker deals are going to be a dime a dozen as we near Prime Day 2021, but if you want to nab one at a decent price ahead of Amazon's discounts, then this Google Nest Audio smart speaker deal over on Best Buy might be to your liking.",
    "The Google Nest Audio smart speaker, usually $99.99, has been given a 25% discount, bringing the cost down to just $74.99. That's hard to beat for a solid smart speaker ahead of the Prime Day 2021 sales.",
    "It's also available in a variety of colors including chalk, sage and sky, all at the same discounted price, so you can choose your ideal color without worrying about paying extra.",
    "The Google Nest Audio smart speaker certainly isn't the best money can buy, but it's still a great choice thanks to Best Buy's discount and if you're on a tight budget.",
    "The small form factor and smart design mean that the Google Nest Audio won't look out of place no matter where you place it. You might prefer this over more sizable smart speakers such as the Amazon Echo Studio.",
    "The Google Nest Audio also has good sound quality compared to its predecessors, though you may want to consider that audio quality can grow harsher at higher volumes.",
    "Finally, if you're the type of person who likes to ask questions to or instruct smart speakers, you'll be glad to know that the Google Nest Audio's ability to pick up on voice commands is also very good, minimizing the need to repeat yourself.",
    "Not in the US? We've been scouring the web for the best prices in your region:"
  ],
  "headers": {
    "3": "Today's best smart speaker deal"
  },
  "links": {
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Google Nest Audio": "https://www.techradar.com/reviews/google-nest-audio",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review"
  }
}