{
  "source": "https://www.techradar.com/news/samsung-galaxy-a52-5g-and-a72-5g-official-renders-leaked",
  "title": "Samsung Galaxy A52 5G and A72 5G official renders leaked",
  "category": "phones",
  "updated": "2021-01-29T09:43:02Z",
  "author": "james-rogerson",
  "summary": "These two mid-rangers are likely to land soon",
  "article": [
    "The Samsung Galaxy S21 range has only just landed, but Samsung looks to have at least two more phones on the way soon, as seemingly-official renders of the Samsung Galaxy A52 5G and Samsung Galaxy A72 5G have now leaked.",
    "Shared by Evan Blass (a leaker with an excellent track record), these images don’t really show us anything that we haven’t seen before, as they look more or less identical to previous Galaxy A52 and Galaxy A72 renders. Still, seeing the same design from multiple sources suggests it’s probably accurate.",
    "The Samsung Galaxy A52 5G as shown here also looks much like its predecessor, the Samsung Galaxy A51, complete with an all-screen front housing a punch-hole camera, and a rectangular camera block on the top left corner of the rear. The bezels are slightly bigger than on Samsung’s flagship phones, but that’s the only immediate sign that this is a more affordable model.",
    "The Samsung Galaxy A72 5G is only shown from the front, but looks very similar to the Galaxy A52 5G, with a central punch-hole camera, and a slim bezel below the screen. Based on previous leaks we’re expecting it to also look similar to the A52 5G from the back.",
    "This latest leak doesn’t include specs, but we’ve previously heard that the Samsung Galaxy A72 5G might have a 6.7-inch screen, while the Samsung Galaxy A52 5G may have a 6.5-inch screen, a Snapdragon 750G chipset, and 6GB of RAM. Both phones also look based on renders to have a quad-lens camera setup.",
    "We should know for sure soon, as with seemingly official renders in the wild it’s likely that both phones are close to launch. TechRadar will cover the announcement whenever it happens, so stay tuned for updates.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Evan Blass": "https://www.voice.com/post/@evan/samsung-galaxy-a52-5g-first-official-images-updated-1611841113-938961111",
    "previous Galaxy A52": "https://www.techradar.com/news/unofficial-samsung-galaxy-a52-5g-renders-give-us-a-first-look-at-the-phone",
    "Galaxy A72 renders": "https://www.techradar.com/news/samsung-galaxy-a72-and-a32-leaks-detail-these-upcoming-affordable-5g-phones",
    "Samsung Galaxy A51": "https://www.techradar.com/reviews/samsung-galaxy-a51-review",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_a52_5g_and_a72_5g_show_up_in_leaked_official_renders-news-47460.php"
  }
}