{
  "source": "https://www.techradar.com/news/remember-your-old-mobile-phones-with-this-new-online-museum",
  "title": "Remember your old mobile phones with this new online museum",
  "category": "phones",
  "updated": "2021-11-24T14:07:47Z",
  "author": "james-rogerson",
  "summary": "The Nokia 1600, the IBM Simon and a whole lot more",
  "article": [
    "Thanks in large part to smartphones and their cameras, there are near endless pictures of modern handsets that you can turn up with a quick Google search, while sites like TechRadar also extensively detail these phones, but what about older handsets? That’s where the new Mobile Phone Museum comes in.",
    "This newly launched website houses over 2,100 unique handsets, dating as far back as 1984. As well as seeing photographs of each phone, you can also read a detailed overview highlighting key features, and see other details such as their weights and codenames.",
    "To help you browse the included phones, they’ve been sorted into various collections, such as best sellers (like the Motorola Razr V3), ugly handsets (including the Nokia 7600), and firsts, such as the Sony Ericsson W800, which was the first Walkman phone.",
    "The Mobile Phone Museum is the brainchild of Ben Wood (who’s also Chief Analyst at technology research firm CCS Insight), and it’s designed not just as a way to remember old handsets you might have had, but also to inspire and educate a new generation of engineers and designers.",
    "It’s not complete though. Many handsets are missing from the collection, and the site is calling for donations of those missing mobiles. If you do send an old phone that’s absent from the site then it will be photographed and moved to a secure storage facility, so it will never be lost to time.",
    "Many histories are patchy and incomplete, but mobile phones are a recent enough invention that no older model needs to be forgotten, and the Mobile Phone Museum is a great way to ensure every key handset is remembered.",
    "While you can probably find photographs and details of most mobile phones online, in many cases it will take a lot of digging, and the images might be low quality. As time goes on, it could become even harder to find these older handsets if they’re not catalogued properly.",
    "But with the Mobile Phone Museum they’ll all be in one place, with complete details, high-quality images, and with the phones themselves carefully stored so that at least one example of each handset will survive for a long, long time.",
    "All it needs now is for people to dig out and donate the missing handsets, so that records of mobile phone history can be made complete."
  ],
  "headers": {
    "5": "Opinion: an important project for remembering the industry’s history"
  },
  "links": {
    "Mobile Phone Museum": "https://www.mobilephonemuseum.com/",
    "Motorola Razr V3": "https://www.techradar.com/news/phone-and-communications/mobile-phones/motorola-razr-v3-the-greatest-phone-of-all-time-1294669",
    "Nokia 7600": "https://www.techradar.com/news/phone-and-communications/mobile-phones/the-10-ugliest-phones-of-all-time-1292442"
  }
}