{
  "source": "https://www.techradar.com/news/totally-rated-are-ps5s-finally-getting-easier-to-buy",
  "title": "Totally Rated: are PS5s finally getting easier to buy?",
  "category": "gaming",
  "updated": "2021-07-13T13:31:04Z",
  "author": "rhys-wood",
  "summary": "PS5, Beats Studio Buds and Mario Golf head up this Totally Rated episode",
  "article": [
    "Season 2 of Totally Rated is now underway, and we've got a bumper episode to kick things off. We start off by analyzing whether PS5s are actually becoming easier to buy after over seven months on sale.",
    "We follow up with The Sims 4's Sims Sessions event bringing live music to the game before checking in on tech with Apple's new Beats Studio Buds.",
    "Finally, it's back to gaming. This time on the Nintendo Switch as we putt Birdies and Bogeys with a certain Italian plumber in Mario Golf: Super Rush.",
    "First up, we're checking in on the PS5. More specifically, its infamous elusiveness. However, it seems that now, PS5s are getting much easier to buy... so long as you already own a PS5.",
    "That's right, purchase invitations for a new wave of PlayStation Direct stock were sent out to existing PS5 owners, giving those who already own the console a chance to buy a second one should they wish.",
    "It seems like a baffling decision at first, or maybe even an oversight. However, it appears to be a concentrated effort on Sony's part to skirt the scalpers and give PS5 owners the chance to perhaps buy one for a friend or relative.",
    "With real life music festivals a distant memory thanks to the Covid-19 pandemic, EA has stepped in to save the day by hosting a music event in a seven-year-old game in a language no one understands.",
    "While a decent effort, and something quite unique for the aging life-sim game, the experience was somewhat underwhelming, with TechRadar's Vic Hood writing about her disappointment with the event:",
    "\"The ticket said the site would be 'at the riverbend', so I searched all over for (what I assumed would be) a big ol’ festival site. So imagine my disappointment when I located the site, only to find it was a measly little section of the park with a lowkey stage, three tents, a craft table, a merch stand, some toilets and a food stall.",
    "It wasn’t exactly what I imagined – the sort of thing that could be put up in your digital backyard for a few Simoleons, presumably.\"",
    "The ‘Sims Sessions’ music festival took place inside the Sims 4 and was headlined by pop sensation Bebe Rexha, with Glass Animals and Joy Olo Dokun serving as the opening acts. It's a shame, then, that the festival wasn't exactly a smash hit.",
    "Apple’s worst kept secret finally launched this week as they released the Beats Studio Buds. Previously, celebrities had been spotted wearing the earbuds, but they've now been unleashed on the general public.",
    "Nick Pino from TechRadar gave his verdict on the latest noise cancelling earbuds: \"They sound great, with a lively sound quality that elevates the highs and lows of your music, and feel supremely comfortable to wear for long periods of time.",
    "\"They're not without some drawbacks, though. Chief among them is their lackluster call quality and lack of an H1 Wireless Chip. Battery life with either ANC or Transparency mode turned on is a little short at only five hours (15 hours with the case), and their noise cancellation isn’t exactly class-leading, either.",
    "\"That said, these are our favorite Beats earbuds since the Powerbeats Pro elevated the workout earbud form factor in 2019.\"",
    "Mario made his long-awaited return to the links recently in Mario Golf: Super Rush for the Nintendo Switch. Unfortunately, Ben Tryer from GamesRadar felt the game didn’t live up to expectations: \"Mario Golf: Super Rush lives up to its name in most ways.",
    "\"This is golf where someone has leaned on the fast-forward button and the pressure to swing and slice as quickly as possible is just as important as accuracy.",
    "\"That pace also extends to the game’s design, where every mode feels like it’s been designed to be devoured swiftly instead of savored.",
    "\"Unfortunately, the one aspect where nominative determinism doesn’t come into play is the ‘Super’ part.\"",
    "While Super Rush remains a solid effort and a welcome addition to the Mario sports roster, it unfortunately maintains developer Camelot's curse of not quite being as feature-rich as one would hope.",
    "Mario Golf: Super Rush will see a string of free updates in future, including new characters and courses. Here's hoping the game will eventually be worth its retail price tag, but only time will tell. For now, Mario needs to work on his short game.",
    "Finally, this year’s Mobile World Congress took place in late June and into July, 2021. It’s the biggest trade show in the mobile calendar and is where many of the year’s most exciting handsets are often announced. But predictably, this year was a bit scaled back from what we'd usually expect.",
    "Thanks to the Covid-19 pandemic, this year's event was much smaller than previous years, and was run as a hybrid event with many of the launches and announcements happening online.",
    "Despite that, Samsung announced an announcement event for the next Galaxy Watch saying it’s coming later in the year. Elsewhere, Lenovo introduced us to the Smart Clock 2 and the Snapdragon 888 Plus finally launched.",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every week."
  ],
  "headers": {
    "3": "PS5s are getting easier to buy... but there's a catch",
    "6": "The Sims 4 Sessions was an oddly isolated experience",
    "11": "Beats Studio Buds finally release",
    "15": "On the green with Mario Golf: Super Rush",
    "21": "Mobile madness"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Beats Studio Buds": "https://www.techradar.com/reviews/beats-studio-buds-review",
    "so long as you already own a PS5": "https://www.techradar.com/news/ps5-owners-can-now-buy-another-ps5-thanks-to-sony",
    "somewhat underwhelming": "https://www.techradar.com/news/bad-food-and-bands-ive-never-heard-of-the-sims-4-music-festival-is-almost-the-real-thing",
    "Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Smart Clock 2": "https://www.techradar.com/news/lenovo-quietly-unveils-smart-clock-2-and-wireless-charging-dock"
  }
}