{
  "source": "https://www.techradar.com/news/these-solar-powered-headphones-boast-a-virtually-infinite-battery-life",
  "title": "These solar-powered headphones boast a virtually infinite battery life",
  "category": "audio-visual",
  "updated": "2021-06-29T08:16:59Z",
  "author": "olivia-tambini",
  "summary": "The Urbanista Los Angeles are solar-powered headphones",
  "article": [
    "Update: The Urbanista Los Angeles are now available to pre-order, and you can do so over on Urbanista's store page for the wireless headphones.",
    "Ever been caught out and about without a charger for your wireless headphones? Well, with the latest noise-cancelling headphones from Urbanista, you needn't worry about lugging around a cable, because they get their energy from the sun.",
    "The Urbanista Los Angeles are able to convert all forms of light, outdoor and indoor, into energy to deliver a \"virtually infinite\" playtime, according to the Swedish audio brand.",
    "That's thanks to a partnership with Exeger, a company that's created a new material called Powerfoyle, which can convert \"any form of light into clean energy and can be seamlessly integrated into any design\". This material has been used in the construction of the headphones' headband.",
    "This means that the wireless headphones are constantly charging when exposed to light. According to Urbanista, \"just an hour\" spent outside on a sunny day will give you three hours of playtime, while an hour outside on a cloudy day will give two hours of battery life.",
    "They even charge in ambient light, so simply wearing them in a well-lit room will top up the battery life – or when you're not using them, you can leave them by a window to generate another hour of playtime.",
    "With the total battery life coming in at 50 hours, you may not have the need to charge these headphones with a USB-C cable very often, if at all (assuming the technology works as promised, of course).",
    "Like the Urbanista Miami headphones, the Los Angeles come with 40mm neodymium drivers, a built-in mic, Bluetooth 5 connectivity, an automatic pausing feature, and a choice of Siri or Google Assistant support.",
    "If they do sound anything like their predecessors, you can expect a well-balanced soundstage, with an extended bass response that will suit pop and RnB – though we found the Urbanista Miami didn't deliver the kind of accuracy and detail audiophiles may crave.",
    "Hybrid Active Noise Cancelling should reduce annoying environmental sound, though you can switch on the Ambient Sound Mode at the tap of a button if you need to be aware of your surroundings.",
    "It looks like Urbanista has taken its design cues from the Miami headphones too, with generously padded ear cushions and an adjustable headband – it's a design we found to be quite comfortable, so we're glad to see it being revived for this new solar-powered model.",
    "In spite of their rather futuristic-sounding specs, the Urbanista Los Angeles won't be too pricey when they launch in the next few months. Costing $199 / £169 (about AU$250), they'll be considerably cheaper than the best headphones of 2021, the Sony WH-1000XM4.",
    "That's if they actually materialize. These aren't the first headphones to tout Powerfoyle technology, with the JBL Reflect Eternal being announced in late 2019.",
    "Like Urbanista, JBL claimed these headphones would deliver \"endless playtime\"; however, a year-and-a-half later, and we're still waiting for solar-powered headphones to emerge.",
    "JBL's Reflect Eternal headphones were launched via a crowdfunding campaign and were due to ship in October 2020, but the company put the project on hold in November, blaming the Covid-19 pandemic for production delays.",
    "We're more hopeful for Urbanista, though, and there's no reason to think that the Los Angeles won't launch later this year as planned and beat JBL to the punch. In any case, we can't wait to get our hands on them and find out whether that playtime really is infinite."
  ],
  "headers": {
    "7": "From Miami to LA"
  },
  "links": {
    "Urbanista's store page": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1062210869453843500/https://www.urbanista.com/uk/losangeles",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Urbanista Miami": "https://www.techradar.com/reviews/urbanista-miami",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "JBL Reflect Eternal": "https://www.techradar.com/news/jbl-is-crowdfunding-headphones-that-never-need-to-be-plugged-in",
    "crowdfunding campaign": "https://www.indiegogo.com/projects/jbl-reflect-eternal-self-charging-headphones#/"
  }
}