{
  "source": "https://www.techradar.com/news/score-a-cheap-rtx-3080-with-alienwares-early-black-friday-pc-deals-this-weekend",
  "title": "Score a cheap RTX 3080 with Alienware's early Black Friday PC deals this weekend",
  "category": "computing",
  "updated": "2021-10-22T22:10:02Z",
  "author": "alex-whitelock",
  "summary": "A superb price for a pre-built with an RTX 3080",
  "article": [
    "If you, like us, are struggling to get your hands on that coveted RTX 3080 graphics card, consider checking out Dell's early Black Friday gaming PC deals this weekend.",
    "In particular, take a look at this Alienware Aurora R12 for $2,155.99 (was $2,489.98). A tasty $334 price cut has made this easily one of the best value RTX 3080 pre-builts out there, and the combination of an Intel Core i7-11700F, 16GB of RAM, and 512GB simply can't be ignored at this price.",
    "Pre-builts have had a bit of a 'reputation' among hard-core PC gamers over the past few years for being a bad value - something that's unwarranted now, in our opinion. Considering you'd pay, on average, around $1,500 for the card itself on eBay right now, it's actually not a bad idea to go all-in on a pre-built - especially when you're securing top-shelf specs on the other components.",
    "It's also better than similar early Black Friday gaming PC deals right now - such as this RTX 3080-equipped HP Omen for $2,169.99. Not only is this HP slightly more expensive, but its measly Core i5 processor and 256GB SSD can't hold a candle next to the Alienware's specs.",
    "And I mean, do you really need an excuse not to buy an Alienware machine if you have the cash? Just look at them. These machines have some of the nicest, most unique cases on the market right now - plus, you'll get excellent cable management and an easy to upgrade tool-less form factor too.",
    "If this one's a little bit out of your budget (...understandable), we've also rounded up a few more early Black Friday gaming PC deals just below. If you're outside the US, you'll also find a few great deals in your region too.",
    "Check out our guide to the upcoming Black Friday PC gaming deals if you'd like to know what's in store over the next month. Also, check out this week's best Alienware Aurora prices for deals on other premium gaming PCs."
  ],
  "headers": {
    "6": "More gaming PC deals this weekend"
  },
  "links": {
    "for $2,155.99 (was $2,489.98)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9094594670187475000/https://deals.dell.com/en-us/member/productdetail/ayxi",
    "around $1,500": "https://www.ebay.com/sch/i.html?_from=R40&_trksid=p2380057.m570.l1313&_nkw=RTX+3080&_sacat=0&mkevt=1&mkcid=1&mkrid=711-53200-19255-0&campid=5337827784&customid=trd-us-4856843724225432000",
    "for $2,169.99": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1026624644191823100&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fshop%2Fpdp%2Fomen-30l-desktop-gt13-0380t-2h4a2av-1%3Fjumpid%3Dma_hp-gaming_product-tile_desktops_9_2h4a2av-1_omen-30l-desktop-gt1",
    "Black Friday PC gaming deals": "https://www.techradar.com/deals/best-black-friday-pc-gaming-deals-2019",
    "Alienware Aurora prices": "https://www.techradar.com/deals/the-best-alienware-aurora-prices-sales-and-deals"
  }
}