{
  "source": "https://www.techradar.com/news/facebook-joins-rust-foundation",
  "title": "Facebook joins Rust Foundation",
  "category": "computing",
  "updated": "2021-04-30T09:14:44Z",
  "author": "mayank-sharma",
  "summary": "Facebook has been an active Rust user since 2016",
  "article": [
    "Facebook has formalized its association with the popular Rust programming language by officially joining the Rust foundation.",
    "The non-profit Rust foundation was launched earlier this year with Mozilla, Huawei, Google, Microsoft, and Amazon Web Services (AWS) as its founding members.",
    "The open source Rust language was originally developed by Mozilla, makers of the popular Firefox web browser, in 2010 and has been a developers’ favorite virtually since its inception.",
    "Rust has been voted as the most loved language in Stack Overflow’s Developer Survey for the past five years, and is used by some of the biggest tech giants who’ve been supporting its development financially, even before the creation of the foundation.",
    "Facebook is now the latest tech heavyweight to join the Rust Foundation, though the social networking giant has been developing internal tooling with it since 2016.",
    "The social network first used the language for its internal source control tool back in 2016.",
    "“For developers, Rust offers the performance of older languages like C++ with a heavier focus on code safety. Today, there are hundreds of developers at Facebook writing millions of lines of Rust code,” shares Facebook engineering team in a new blog post.",
    "“We are joining the Rust Foundation to help contribute to, improve and grow this language that has become so valuable to us and developers around the world. We look forward to participating with the other foundation members and the Rust community to make Rust a mainstream language of choice for systems programming and beyond,” said Joel Marcey, Open Source ecosystem lead at Facebook who joins the board of the Rust Foundation.",
    "Furthermore, Facebook has also shared that it now has a dedicated Rust team of developers that’s responsible for pushing the adoption of the language inside the company, as well as step up contributions to Rust and Rust-based open source projects, and also actively engage with the Rust community."
  ],
  "headers": {
    "5": "Rust at Facebook"
  },
  "links": {
    "Rust foundation": "https://www.techradar.com/news/tech-majors-come-together-to-launch-the-rust-foundation",
    "AWS": "https://www.techradar.com/news/aws",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "Developer Survey": "https://insights.stackoverflow.com/survey/2020#technology-most-loved-dreaded-and-wanted-languages-loved",
    "hundreds of developers at Facebook": "https://developers.facebook.com/blog/post/2021/04/22/meet-rustaceans-chris-konstad/",
    "said Joel Marcey": "https://developers.facebook.com/blog/post/2021/04/29/facebook-joins-rust-foundation/"
  }
}