{
  "source": "https://www.techradar.com/news/exclusive-gamestop-ps5-restock-in-store-event-time-and-all-202-locations-listed",
  "title": "Exclusive: GameStop PS5 restock in-store event time today and all 202 locations listed",
  "category": "gaming",
  "updated": "2021-11-22T22:54:39Z",
  "author": "matt-swider",
  "summary": "Here are some exclusive details about the PS5 restock at GameStop for today, Thursday, September 30, including how much you'll have to pay for a bundle.",
  "article": [
    "Live reporting: The GameStop PS5 restock in-store event is today, September 30.",
    "We can confirm 202 GameStop locations in New York, Georgia and Texas are now having their first in-store restock of 2021. It requires buying a PS5 Disc bundle, at least at the GameStop locations we checked today. Another fact from our on-the-ground reporting: it'll cost $705 for all of the items included (everything is at face value). There are no games included, but accessories and gift cards are there.",
    "Here's one of the paper tickets GameStop is handing out to people in line. There were 42 consoles available through this one New York City GameStop, but other locations have as many as 50 PS5 consoles for sale today, according to our sources.",
    "The GameStop in-store restock time is when your local store opens (some open at 8am EDT) – but only if you live in three locations in the United States: New York, Atlanta and Dallas-Ft. Worth (or their surrounding areas), according to GameStop. The good news is that there are a bunch of stores in each location that will have PS5 stock.",
    "We spent hours putting together a full list of all 202 GameStop locations, but first, here's how to get a leg up on PS5 restock alerts online:",
    "Here's something annoying: GameStop's broken PS5 restock store locator only exact matches a store location by its zip code or city name if they're due to have the PS5 for sale. Meaning, you can't simply type your home zip code into the field. Also if you type in New York, you won't get listings for nearby Brooklyn or Queens, and if you type in New York City, it returns zero results.",
    "Luckily, we were able to display all 202 store locations due to get the PS5 restock and we've listed them below.",
    "GameStop said that some of its New York City stores will have the PS5 console, but there are a lot of GameStop locations on the map. We dove into the list of stores in the GameStop database to determine which GameStop says will sell PS5 today Thursday, September 30.",
    "It's not just Atlanta but the surrounding area within the state of Georgia that will sell the PS5 console at GameStop within the next few hours.",
    "Everything is bigger in Texas, and it has the most store GameStop locations that will sell the PS5 today. Here are all of the GameStop Texas stores that will carry it.",
    "That was a lot of work to parse out a broken store locator. Please check with your local GameStop store to make sure the information in the GameStop database is correct and hasn't changed."
  ],
  "headers": {
    "5": "GameStop store locations: all 202 locations listed",
    "7": "63 New York GameStop PS5 restock store locations",
    "8": "61 Atlanta GameStop PS5 restock store locations",
    "9": "78 Texas GameStop PS5 restock locations"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart"
  }
}