{
  "source": "https://www.techradar.com/news/some-canon-printers-are-reportedly-being-bricked-after-running-out-of-ink",
  "title": "Some Canon printers are reportedly being bricked after running out of ink",
  "category": "computing",
  "updated": "2021-10-18T10:53:11Z",
  "author": "mayank-sharma",
  "summary": "Lawsuit challenges Canon for preventing its all-in-one from scanning and faxing documents when its ink cartridge is empty",
  "article": [
    "The American subsidiary of the Japanese imaging giant Canon is being taken to court for disabling scanning or faxing functions of certain all-in-one (AiO) printers when they run out of ink.",
    "The lawsuit has been filed by a Canon customer who was surprised that his AiO printer wouldn’t let him scan or fax documents after its ink tanks were empty.",
    "In his lawsuit, David Leacraft blames Canon for deceptive marketing and unjust enrichment by disabling functions on his Pixma MG6320 that don’t require ink.",
    "\"Plaintiff Leacraft would not have purchased the device or would not have paid as much for it had he known that he would have to maintain ink in the device in order to scan documents,\" reads the complaint for the class action lawsuit according to BleepingComputer.",
    "The lawsuit alleges that Leacraft logically assumed that printing would be the only function he’d not be able to use on his multi-function printer when it was out of ink, which shouldn’t have any bearing on the other non-ink dependent functions, such as scanning and faxing.",
    "Leacraft further alleges that Canon on its part doesn’t advertise that all the functions on its multi-function depend on there being ink in its tanks.",
    "Interestingly though, while Canon doesn’t list this requirement on the box of the Pixma MG6320, there are several posts on the official Canon forums with support agents for the company informing surprised customers that the printer needs to have ink in all of its tanks to be fully usable.",
    "\"The PIXMA MG6320 must have all ink tanks installed in the printer and they all must contain ink in order to use the functions of the printer….There is no workaround for this,” writes a Canon support agent in response to a query from another user.",
    "The lawsuit alleges that Canon is only forcing this requirement in order to sell replacement ink cartridges.",
    "\"There is no reason or technical basis for manufacturing the All-in-One Printers with an ink level detection function that causes the scanner to stop functioning when ink is low or empty. Canon designed the All-in-One Printers in such a way to require consumers to maintain ink in their devices regardless of whether they intend to print,\" notes Leacraft’s complaint.",
    "Canon’s response to the lawsuit isn’t known at the moment,",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "All-in-one or all-for-one?"
  },
  "links": {
    "Canon": "https://www.techradar.com/best/canon-printers",
    "all-in-one (AiO) printers": "https://www.techradar.com/news/best-all-in-one-printer",
    "lawsuit": "https://www.documentcloud.org/documents/21085661-123118208417",
    "writes a Canon support agent": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3272705228525032400/https://community.usa.canon.com/t5/Printer-Multifunction-Support/one-ink-empty-can-t-scan/m-p/323046/highlight/true#M40538",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/legal/canon-sued-for-disabling-scanner-when-printers-run-out-of-ink/"
  }
}