{
  "source": "https://www.techradar.com/news/sonys-xperia-1-iii-flagship-phone-can-now-be-pre-ordered-for-a-cool-dollar1300",
  "title": "Sony's Xperia 1 III flagship phone can now be pre-ordered for a cool $1,300",
  "category": "phones",
  "updated": "2021-07-05T11:00:22.636Z",
  "author": "david-nield",
  "summary": "More expensive than the Xperia 1 II",
  "article": [
    "We've been waiting to find out the US price and availability details for the Sony Xperia 1 III, the company's flagship phone for 2021, and now that wait is over: preorders are open now, with shipping on August 19, and you'll have to part with $1,299.99 to get hold of the phone.",
    "That makes the handset $100 more expensive than the Sony Xperia 1 II was at launch, following a trend we've seen recently from Sony: premium smartphones at premium prices. The device retails for £1,199 in the UK.",
    "Compare the $1,299.99 asking price with the starting price for the iPhone 12 Pro Max, which starts at $1,099, and the Samsung Galaxy S21 Ultra, yours for $1,199.99 and up. This is a serious investment we're talking about here.",
    "Sony would argue that you get plenty of smartphone in return for your cash, and in our review we gave the handset four stars out of five – our verdict is that this is Sony's best smartphone in quite some time, with a fantastic display and battery life that goes beyond what a lot of its competitors can offer.",
    "The phone comes rocking a 6.5-inch, 3840 x 1644 pixel, 120Hz refresh rate OLED display with HDR support and the capacity to display more than a billion colors – not a bad start – while the device is powered by the high-end Snapdragon 888 processor from Qualcomm.",
    "This being a Sony phone, the camera modules are as impressive as you would expect: the rear camera is a quad-lens 12MP+12MP+12MP+0.3MP affair, with ultrawide capabilities and up to 4.4x optical zoom. That's true optical zoom too, with a telephoto lens element that actually moves inside the unit.",
    "We've already mentioned the battery, which has a 4,500mAh capacity that can comfortably cover a whole day, and you also get IP68 water resistance, a generous 12GB of RAM, and either 256GB or 512GB of internal storage (which can be expanded through a microSDXC slot).",
    "High-level specs then for a corresponding high-level price – and now available to pre-order direct from Sony, although only the black version is available (with a purple option to come). If you're after \"a highly capable smartphone with a superb screen\", we concluded in our review, \"the Xperia 1 III may be the perfect phone for you\"."
  ],
  "headers": {
    "4": "Specs appeal"
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "open now": "https://electronics.sony.com/mobile/smartphone/all/p/xqbc62-b",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "our review": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "direct from Sony": "https://electronics.sony.com/mobile/smartphone/all/p/xqbc62-b"
  }
}