{
  "source": "https://www.techradar.com/news/this-powercolor-rx-6900-xt-is-the-fastest-big-navi-card-you-can-get",
  "title": "This PowerColor RX 6900 XT is the fastest Big Navi card you can get",
  "category": "computing",
  "updated": "2021-04-13T18:14:30Z",
  "author": "john-loeffler",
  "summary": "The Red Devil Ultimate pushes the limit",
  "article": [
    "PowerColor is set to release its latest Red Devil graphics card, the PowerColor Radeon RX 6900 XT Red Devil Ultimate, and it promises to be the fastest RX 6900 XT on the market.",
    "The RX 6900 XT Red Devil Ultimate is said to feature a higher-binned Big Navi GPU, the Navi 21 XTXH, which makes the RX 6900 XT Red Devil Ultimate a premium card aimed at the overclocking and AMD enthusiasts out there. There's no word yet on availability or pricing, but given the specialized OC build of the card and the current GPU market, we can expect it to among the most expensive consumer graphics cards out there.",
    "Originally detailed by French outlet Overclocking.com, the RX 6900 XT Red Devil Ultimate manages to achieve OC boost speeds of 2,425 MHz, which would make it the fastest RX 6900 XT by clock speed currently on the market. If you dig deeper into the overclocking exercise carried out by Overclocking, they were able to push the RX 6900 XT Red Devil Ultimate as high as 2,851MHz during their 3DMark Firestrike benchmark (with a graphics score of 70,822).",
    "There is a 3,000MHz cap on the clock speeds of the Navi 21 XTX GPUs that earlier RX 6900 XT cards had been using, according to Wccftech, and Overclocking confirms that this is still the case with the Navi 21 XTXH.",
    "The card appeared to be limited to about 2,700MHz initially, but AMD gave the testers a new BIOS that let the card hit a TDP of 330W, which is what enabled the overclockers to push the card up against this hard cap.",
    "They needed liquid nitrogen cooling though, so unless you are an extreme overclocker yourself, you shouldn't expect to achieve this kind of speed on your own, much less when playing the best PC games out there that really tax this kind of hardware."
  ],
  "headers": {
    "3": "Pushing the speed limit on the RX 6900 XT"
  },
  "links": {
    "Overclocking.com": "https://overclocking.com/test-powercolor-rx-6900-xt-red-devil-ultimate/7/",
    "Wccftech": "https://wccftech.com/powercolor-fastest-radeon-rx-6900-xt-red-devil-ultimate-graphics-card-big-navi-21-xtxh-gpu/",
    "best PC games": "https://www.techradar.com/news/best-pc-games"
  }
}