{
  "source": "https://www.techradar.com/news/wandavision-episode-7s-commercial-is-about-the-future-of-the-mcu-movies",
  "title": "WandaVision episode 7’s commercial is about the future of the MCU movies",
  "category": "entertainment",
  "updated": "2021-02-21T10:48:04Z",
  "author": "richard-edwards",
  "summary": "Huge spoilers ahead",
  "article": [
    "Spoilers for WandaVision follow.",
    "In most TV shows, commercials are an annoying interruption, the bits you want to skip through to get back to the entertainment. In WandaVision, however, they’re a key part of the mystery, offering subtle clues about what’s going on in Westview. The ad for Nexus anti-depressants in ‘Breaking the Fourth Wall’ (WandaVision episode 7) may be the most important of the lot.",
    "Why? In Marvel comics, ‘Nexus’ is a word loaded with meaning, opening doors to the many realities of the multiverse. That could have colossal implications for the Marvel Cinematic Universe, potentially providing an explanation for the events in WandaVision, while setting up the upcoming, Sam Raimi-directed Doctor Strange in the Multiverse of Madness – and the MCU’s Phase 4.",
    "So as WandaVision prepares to take the MCU interdimensional, we discuss that crucial WandaVision episode 7 commercial, and dive into Marvel comics continuity to explain why Nexus Beings and the Nexus of All Realities are such a big deal.",
    "Don't miss our analysis of the WandaVision episode 7 ending, too, if you want to learn more about what's going to happen next in the show.",
    "All of WandaVision’s six in-episode commercials to date (the ‘real-world’ set episode 4 didn’t have one) have had ties to the Marvel Cinematic Universe. Some have been obvious (like the Stark Industries Toast Mate 2000 in episode 1), while others have been more subtle – the Lagos paper towels in episode 5 allude to an incident in the opening of Captain America: Civil War.",
    "However, none of the previous ads have quite as many potential consequences for the MCU as the commercial for Nexus anti-depressant medication in episode 7.",
    "In the commercial, a woman – played by Victoria Blade, who’s appeared in every WandaVision ad except the Yo-Magic animation in the ’90s-set episode 6 – sits alone on a park bench.",
    "“Feeling depressed?” asks the voiceover. “Like the world goes on without you? Do you just want to be left alone? Ask your doctor about Nexus…”",
    "It goes on to say that Nexus is “a unique anti-depressant that works to anchor you back to your reality – or the reality of your choice.” The woman walks up to a pharmacy counter staffed by regular WandaVision commercial actor Ithamar Enriquez.",
    "Then the smallprint: “Side effects include: feeling your feelings, confronting your truth, seizing your destiny and, possibly, more depression.”",
    "And then, as the woman leaves the pharmacy: “You should not take Nexus unless your doctor has cleared you to move on with your life. Nexus: because the world doesn’t revolve around you. Or does it?”",
    "While much of the commercial focuses on Wanda’s state of mind as she grieves for Vision, the references to “the reality of your choice”, and whether or not the world “revolves around you” have multiverse-shaped implications. As does the fact this brand of medication is called Nexus…",
    "The so-called Nexus of All Realities is the point where all possible realities within the Marvel comics multiverse overlap. As such, it serves as a gateway between numerous dimensions.",
    "Conveniently for Marvel’s writers, this unique location can be found on Earth, in a Florida swamp, where it’s generally protected by plant/human hybrid Man-Thing. The Nexus made its first appearance in Adventure into Fear #11 in 1972.",
    "As well as having their own unique powers, Nexus Beings share the ability to influence probability. In other words, they can alter the future and the flow of the space-time continuum – this means they’re among the most powerful entities in the universe. Among their number are the wizard Merlin, the X-Men’s Jean Grey, Reed and Sue Richards’ kid Franklin, Kang the Conqueror (Big Bad in the upcoming Ant-Man and the Wasp: Quantumania) and… Wanda Maximoff and Vision.",
    "In Highlander-style, there can be only one Nexus Being in each of the parallel worlds of the multiverse. Scarlet Witch (aka Wanda) is the Nexus Being (or Nexi) for Reality-616, the main continuity in Marvel comics.",
    "It could be the biggest thing to happen in the MCU since Thor’s banishment to Earth revealed the existence of the Nine Realms, or the Chitauri invasion force showed the world that extra-terrestrial life is real – and can be hostile.",
    "The MCU has hinted at the existence of the multiverse in the past, not least in Doctor Strange, where the Sorcerer Supreme battled Dark Dimension resident Dormammu. We also know that the Doctor Strange sequel will be titled Doctor Strange in the Multiverse of Madness – which is quite a big clue.",
    "If WandaVision has just confirmed the existence of a Nexus of All Realities, however, it could be the route to discovering the alternative dimensions of the MCU. The implications are huge for Phase 4 of the epic Marvel Cinematic Universe continuity.",
    "If the MCU Wanda is a Nexus Being like her comics counterpart, this could explain how she has the power to manipulate the reality of Westview, New Jersey, turning it into a total-immersion journey through US sitcom history. The WandaVision episode 7 ad’s references to “the reality of your choice” and the idea that the world may actually revolve around Wanda seems to be pointing the story in that direction.",
    "And even though the comics’ Nexus of All Realities is located in Florida, there’s no reason the MCU version can’t be shifted a few hundred miles up America’s East Coast to New Jersey. If Wanda wanted to bring Vision back to life, a powerful location like the Nexus seems as good a place as any to do it – especially if newly revealed antagonist Agatha Harkness had anything to do with her ‘decision’ to move there.",
    "In WandaVision terms, the Nexus could explain why Wanda’s brother, Pietro, looks like the X-Men universe’s Evan Peters incarnation, rather than the MCU’s Aaron Taylor-Johnson version. Perhaps we’re about to find out that the disparate continuities of the non-MCU Spider-Man and X-Men movies are all part of one big- (and small-) screen Marvel multiverse.",
    "There have also been plenty of rumors that the follow-up to Spider-Man: Far From Home will feature previous Spider-Men Tobey Maguire and Andrew Garfield – though current Peter Parker Tom Holland has denied it – and a newly opened multiverse could explain how they get together. And if Wanda truly is a Nexus Being, it could be why she’s a key player in Doctor Strange in the Multiverse of Madness – perhaps the Sorcerer Supreme will utilize her ability to control reality (or realities).",
    "The Nexus may tie into the upcoming Loki TV show, too, seeing as it involves the Time Variance Authority – an organisation responsible for monitoring the timeline of the universe and Nexus Beings.",
    "So it may turn out that WandaVision’s little Nexus commercial is the most important revelation in the MCU for nearly a decade.",
    "New episodes of WandaVision are available every Friday on Disney Plus."
  ],
  "headers": {
    "5": "What happens in the WandaVision episode 7 commercial?",
    "13": "What is the Nexus in Marvel comics?",
    "15": "What’s a Nexus Being in Marvel comics?",
    "17": "What could the Nexus mean for the future of the Marvel Cinematic Universe?"
  },
  "links": {
    "Doctor Strange in the Multiverse of Madness": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-lands-a-big-name-composer",
    "WandaVision episode 7 ending": "https://www.techradar.com/news/wandavision-episode-7-ending-explained",
    "Yo-Magic animation": "https://www.techradar.com/news/wandavision-episode-6-featured-the-creepiest-mcu-moment-ever",
    "Kang the Conqueror": "https://www.techradar.com/news/marvel-may-have-just-cast-a-big-mcu-avengers-villain-in-ant-man-3",
    "Agatha Harkness": "https://www.techradar.com/news/wandavision-episode-7-ending-explained",
    "Pietro": "https://www.techradar.com/news/quicksilver-in-wandavision-explained-what-we-know-about-pietro-maximoff",
    "X-Men movies": "https://www.techradar.com/how-to/how-to-watch-the-x-men-movies-in-order",
    "current Peter Parker Tom Holland has denied it": "https://www.techradar.com/news/spider-man-3-wont-feature-tobey-maguire-or-andrew-garfield-says-tom-holland",
    "Loki TV show": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more"
  }
}