{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-disney-plus-and-more-this-weekend-september-24-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, Disney Plus and more this weekend",
  "category": "entertainment",
  "updated": "2021-09-25T15:52:16Z",
  "author": "axel-metz",
  "summary": "Here’s what’s dropping on streamers this weekend",
  "article": [
    "September is proving a lucrative month for streaming. Last week saw the arrival of Sex Education season 3 on Netflix, Everybody's Talking About Jamie on Prime Video and The Morning Show on Apple TV Plus, and all three streamers each get another high-profile addition this weekend, too.",
    "Undoubtedly the biggest is Foundation, Apple’s highly-anticipated series adaptation of Isaac Asimov’s sci-fi novels. But joining the fantasy fun is Star Wars: Visions on Disney Plus, as well as (at long last) The Green Knight on Prime Video in the UK.",
    "The point being, there’s a lot of great content on offer this week. Below, we highlight seven of the biggest movies and TV shows dropping on streamers, and how to watch them in the US and the UK – from blockbuster movies to returning shows. (Netflix's Tudum event, meanwhile, is also running this weekend if you want to learn more about the streamer's future).",
    "Perhaps the biggest project to hit Apple TV Plus since its launch in 2019, Foundation chronicles a band of intergalactic exiles on their journey to save humanity and rebuild civilization.",
    "Based on a series of novels by sci-fi godfather Isaac Asimov, this ten-episode show is already being dubbed Game of Thrones in space, and stars accomplished screen actors Jared Harris and Lee Pace alongside newcomers like Lou Llobell and Cassian Bilton.",
    "We’ve also heard that showrunner David S. Goyer has a \"loose plan\" to tell this epic tale across eight seasons, so we’re excited to see just how much Apple’s staggering budget pays dividends in Foundation’s first crop of episodes.",
    "The series' first two entries are available to stream now (you can read our episode 1 recap now) with subsequent episodes streaming weekly every Friday. Could this be the show to make Apple TV Plus a real entertainment contender?",
    "Now available to stream on Apple TV Plus",
    "US readers, humor us. We’re well aware that David Lowery’s artsy medieval epic was released across the pond several months ago (and is now available on VOD), but UK viewers can now, finally, enjoy the movie on Prime Video after a lengthy pandemic-induced delay.",
    "The Green Knight is based on the 14th-century poem of the same name, and follows Dev Patel’s Gawain as he traverses a fantastical 6th-century England in search of the eponymous green beast.",
    "We spoke to director Lowery and the Green Knight himself, Ralph Ineson, ahead of the movie’s UK release, who both told of the risks and rewards involved in crafting such an unconventional picture for today’s audiences.",
    "Watch this one, even if only to have your mind blown by its visuals.",
    "Now available to stream on Amazon Prime Video UK",
    "Another much-anticipated arrival this weekend is Disney Plus’ Star Wars: Visions, a collection of nine anime shorts set within the Star Wars universe.",
    "Disney invited seven different Japanese animation studios to craft each episode, which have also all been dubbed into English with a voice cast featuring Lucy Liu, Neil Patrick Harris, Joseph Gordon-Levitt, David Harbour and more.",
    "We chatted with the show’s executive producer, James Waugh, who spoke of the studio’s desire to “showcase the entire spectrum of tones and styles going on in Japan.” Visions is a totally different Star Wars experience to any we’ve encountered before, which is reason enough to give it a shot.",
    "Now available to stream on Disney Plus",
    "Dear White People season 4 (styled as Vol. 4) arrives as the final instalment in the Justin Simien-created Netflix series, which finds itself becoming a musical this time around.",
    "Reunited amid a pandemic, future Sam and Lionel look back on their final year together at the predominantly white Winchester University – which provides some… interesting viewing.",
    "Season 4 has once again been praised for its writing and social commentary, though some fans have taken issue with the producers’ decision to switch up the format of the show so dramatically. Still, you can’t knock a good sing-a-long.",
    "Now available to stream on Netflix",
    "Melissa McCarthy and Chris O'Dowd star in The Starling, a low-budget drama acquired by Netflix that tells the tale of a woman pestered by a persistent bird while gardening.",
    "That doesn’t sound like the most engaging premise, and while McCarthy has been praised for leaning heavier on the drama and less on the comedy in this one, the movie as a whole hasn’t been too well received. In fact, one review called The Starling a “wildly misjudged mess.” Ouch.",
    "It’s also playing in theaters, too, if you fancy risking the ticket price on a movie that you could just as easily watch – and maybe stop watching – from the comfort of your own home.",
    "Now available to stream on Netflix",
    "Continuing with the bird theme, Birds of Paradise follows an aspiring American ballerina as she heads to Paris to attend a prestigious-but-also-scary ballet school.",
    "In fairness, the likes of Black Swan and Suspiria had us thinking all dance schools were scary, anyway, so we’re not surprised to learn that Birds of Paradise tells a “darkly intriguing” and “seductively entertaining” story.",
    "This one is based on A.K. Small's novel Burning Bright Stars, and features Diana Silvers, Jacqueline Bisset and Kristine Froseth.",
    "Now available to stream on Amazon Prime Video",
    "In this new Netflix series from The Haunting of Hill House creator Mike Flanagan, the arrival of a mysterious young priest (Hamish Linklater) on an isolated island seems to trigger a string of supernatural – and typically unwelcome – happenings.",
    "The trailer makes this one look like it bears shades of Midsommar and Stephen King’s Needful Things, so expect a spiritual but undoubtedly unsettling trip into the life of a religion-obsessed community hypnotized by the supposed presence of miracles.",
    "All seven episodes are available to stream today.",
    "Now available to stream on Netflix"
  ],
  "headers": {
    "3": "Foundation (Apple TV Plus)",
    "8": "The Green Knight (Amazon Prime Video)",
    "13": "Star Wars: Visions (Disney Plus)",
    "17": "Dear White People season 4 (Netflix)",
    "21": "The Starling (Netflix)",
    "25": "Birds of Paradise (Amazon Prime Video)",
    "29": "Midnight Mass (Netflix)"
  },
  "links": {
    "Sex Education season 3": "https://www.techradar.com/news/sex-education-season-3-finally-has-a-release-date-netflix-confirms",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Foundation": "https://www.techradar.com/news/foundation-on-apple-tv-plus-release-date-plot-cast-and-what-we-know-so-far",
    "Star Wars: Visions": "https://www.techradar.com/news/star-wars-visions-a-galaxy-far-far-away-as-youve-never-seen-it-before",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Netflix's Tudum event": "https://www.techradar.com/news/how-to-watch-tudum-online-date-start-time-and-what-to-expect-from-the-netflix-event",
    "also heard": "https://www.techradar.com/news/apple-tvs-foundation-may-run-for-as-long-as-game-of-thrones",
    "read our episode 1 recap now": "https://www.techradar.com/news/foundation-episode-1-recap-an-ambitious-but-clunky-start-to-apples-new-flagship-show",
    "Apple TV Plus a real entertainment contender": "https://www.techradar.com/features/apple-tv-plus-is-having-a-moment-and-netflix-should-be-worried",
    "spoke to director Lowery": "https://www.techradar.com/news/the-green-knight-director-david-lowery-on-the-risk-and-reward-of-his-medieval-epic",
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "chatted with the show’s executive producer": "https://www.techradar.com/news/star-wars-visions-a-galaxy-far-far-away-as-youve-never-seen-it-before",
    "totally different Star Wars experience": "https://www.techradar.com/news/star-wars-visions-looks-totally-different-and-thats-why-you-should-watch-it"
  }
}