{
  "source": "https://www.techradar.com/news/ipad-deals-magic-keyboard-on-sale-now-at-amazon",
  "title": "iPad deals can save you $100 on the Magic Keyboard in this rare offer from Amazon",
  "category": "tablets",
  "updated": "2021-02-26T13:50:01Z",
  "author": "tabitha-baker",
  "summary": "A stunning price drop on the premium accessory",
  "article": [
    "We don't see iPad deals offering price cuts on premium accessories like this every day. That's why this $100 discount on the iPad Magic Keyboard at Amazon is so impressive this weekend - the usually expensive (to the tune of $300) floating keyboard is available for just $199 right now.",
    "That's by far the cheapest we've ever seen this device go for, with iPad deals never dropping the price below $270 before now. That means this offer will certainly prove popular and we wouldn't take too long to get to checkout as we don't know how much longer this price will hold out for.",
    "If you've picked up an 11-inch iPad Pro or Air 4 to get some work done in the last few months, this is a must-have accessory and at this price it's a steal.",
    "Not in the US? You'll find more iPad Magic Keyboard deals further down the page.",
    "If you're yet to grab yourself a tablet, check out the latest iPad deals. Or, if you're looking to pair your new keyboard with incredibly handy (and now more supported than ever thanks to iPadOS 14) Apple Pencil deals."
  ],
  "headers": {
    "4": "More iPad Magic Keyboard deals"
  },
  "links": {
    "available for just $199 right now": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0863BQJMS%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2334311885362166300-20",
    "iPad Magic Keyboard deals": "https://www.techradar.com/deals/ipad-pro-cheap-magic-keyboard-price-deals-sales",
    "iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "Apple Pencil deals": "https://www.techradar.com/deals/the-best-cheap-apple-pencil-prices-sales-and-deals"
  }
}