{
  "source": "https://www.techradar.com/news/privacy-is-now-the-most-important-factor-when-picking-a-browser",
  "title": "Privacy is now the most important factor when picking a browser",
  "category": "computing",
  "updated": "2021-08-09T19:07:36Z",
  "author": "anthony-spadafora",
  "summary": "New research shows users are willing to switch browsers for better privacy",
  "article": [
    "Privacy is becoming an increasing concern for internet users worldwide and new research from eyeo and Opera has revealed that 83 percent of users would consider switching to a different browser if it offered improved privacy protection.",
    "To compile their new research, the German ad-filtering company and the maker of the Opera browser surveyed 2,500 global internet users to gain a better understanding of their attitudes toward privacy.",
    "Surprisingly the survey found that only a quarter (25%) of respondents trust their current browser with their personal information which underlines the need for better trust and transparency.",
    "Founder and CEO of eyeo, Till Faida provided further insight on the survey's findings in a press release, saying:",
    "“The research shows that internet users have quite a complex relationship with their browsers. They clearly hold them in high regard in many respects and recognise the major benefits they bring to their online experience. At the same time, users are very privacy-conscious, particularly when it comes to intrusive advertising or excessive use of tracking cookies. There’s a better balance to be struck here, where advertising remains a core element of the browsing experience, but is done in a responsible manner that respects user privacy.”",
    "In order to protect their privacy when browsing the web, 50 percent of respondents admitted to using an ad blocker in the last month to prevent ads from being displayed while 64 percent have made a conscious decision to delete tracking cookies.",
    "Although more users are now leveraging ad blockers and calling for improved privacy protection, the data from eyeo and Opera's survey shows that many are willing to compromise when advertising is concerned. Of those surveyed, 35 percent acknowledge the valuable role cookies play in the internet ecosystem and 69 percent are happy to see some ads if doing so provides them with access to free news.",
    "Faida also explained that most internet users realize that ads are necessary to help maintain a free and accessible internet. By using technologies such as ad filtering, consumers can allow noninvasive ads to appear when browsing while hiding the more annoying ones such as pop-ups or animated ads.",
    "Those interested in making the switch to a more privacy-focused browser should check out our complete list of the best anonymous browsers as they allow you to browse the web securely without being tracked online."
  ],
  "headers": {
    "5": "Striking the right balance"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "Opera browser": "https://www.techradar.com/reviews/opera-browser",
    "personal information": "https://www.techradar.com/news/keeping-personal-information-secure",
    "Till Faida": "https://www.techradar.com/news/what-do-ad-blockers-think-about-advertising",
    "ad blocker": "https://www.techradar.com/news/fake-ad-blocker-extensions-used-in-ad-fraud-scheme",
    "tracking cookies": "https://www.techradar.com/news/google-says-its-no-longer-interested-in-tracking-users",
    "best anonymous browsers": "https://www.techradar.com/best/anonymous-browsing"
  }
}