{
  "source": "https://www.techradar.com/news/mercedes-is-showing-off-actual-working-in-car-mind-control",
  "title": "Mercedes is showing off actual working in-car mind control",
  "category": "car-tech",
  "updated": "2021-09-06T13:37:10Z",
  "author": "john-mccann",
  "summary": "Just think, the Vision AVTR will do the rest",
  "article": [
    "Isn't it annoying having to input a destination address into your car's sat nav via its full, on-screen QWERTY keyboard, or manually skipping the current track blasting through the stereo via the highly-convenient on-wheel button?",
    "Imagine if you could just think about where you wanted to go, or how you'd rather the current song not be playing, and your car would do the rest. Well, that's what Mercedes is showing off at the IAA Mobility 2021 show in Munich, Germany.",
    "The German firm has incorporated brain-computer interfaces (BCI) into its Mercedes-Benz Vision AVTR concept car, and visitors to the IAA Mobility 2021 show will be able to try the mind-control feature in person.",
    "The Vision AVTR was first unveiled at CES 2020 where Mercedes revealed the concept was able to recognize drivers by their heartbeat and breathing patterns, but the inclusion of mind-control is a new addition.",
    "The technology, as it currently stands, requires the user to wear a BCI device with wearable electrodes on the back of their head, which reads brain waves which can then be translated into actions for the vehicle.",
    "Mercedes says that \"after a short calibration process\" of around one minute, anyone will be able to perform certain functions inside the car using their thoughts.",
    "Users have to focus on particular light points on the digital dash, and the system determines which one it's being focused on via the BCI device, triggering a preset function.",
    "Mercedes details the system in some more detail; \"The BCI device measures the neuronal activity at the cortex in real time. It analyses the measured brain waves and recognizes on which light points the user directs [their] focus and full attention (attention-sensing interface).",
    "\"The stronger the focus, the higher the neuronal activity. The device then triggers the targeted function in the vehicle.\"",
    "While there may be a working concept that people can try out, Mercedes is clear that the technology won't find its way into consumer vehicles anytime soon.",
    "It says mind-control features \"will not be available in everyday life tomorrow. But they are no longer science fiction either.\""
  ],
  "headers": {
    "4": "Just think it"
  },
  "links": {
    "was first unveiled at CES 2020": "https://www.techradar.com/news/avatar-2-first-look-revealed-at-ces-2020"
  }
}