{
  "source": "https://www.techradar.com/news/marvel-reveals-first-look-at-moon-knight-she-hulk-disney-plus-shows",
  "title": "Marvel reveals first look at Moon Knight, She-Hulk Disney Plus shows",
  "category": "entertainment",
  "updated": "2021-11-12T17:28:05Z",
  "author": "tom-power",
  "summary": "She-Hulk and Moon Knight arrive in 2022",
  "article": [
    "Marvel Studios has given us our first taste at its upcoming Disney Plus shows in She-Hulk and Moon Knight.",
    "Revealed as part of the November 12 Disney Plus Day celebrations, Marvel released a 14-minute long video that looks back at its 2021 streaming slate, as well as looking forward to what's to come.",
    "The featurette, which also gives us a good glimpse at the streamer's upcoming Hawkeye TV series, is only viewable on the Disney Plus app right now. If you hop on over there and skip to the 11:50 mark, though, you can check out the first footage of Moon Knight and She-Hulk.",
    "The video doesn't give too much away about either show, but it does give us an insight into what they'll look and sound like.",
    "Starting with Moon Knight, we see Oscar Isaac's Marc Spector slowly losing his mind after his dissociative identity disorder (DID) begins to manifest itself a superpower when he becomes a conduit for the Egyptian moon god Khonshu.",
    "\"I can't tell the difference between my weaker life... and dreams,\" Isaac's Spector tells an unknown individual. Some spliced together footage shows Spector becoming more irrational as the voiceover plays, before we see Spector beating someone to death in a public bathroom. He's got his back to the camera, but we finally get a glimpse of Isaac in his iconic Moon Knight costume, before he flees over a rooftop with his vigilante pseudonym's silhouette visible on the streets below.",
    "Meanwhile, we see Tatiana Maslany's Jennifer Walters, a lawyer by trade, performing some yoga before she heads to work. The footage quickly skips to Walters as her superhero alter-ego She-Hulk, however, who we only see from the back again. But we get a good sense of how athletic and powerful she'll be.",
    "Before we press on with more about the She-Hulk footage, Marvel also released some updated artwork for its She-Hulk, I Am Groot, Ironheart and Secret Invasion Disney Plus shows. Check them out below:",
    "Another video chop and we're watching Mark Ruffalo's Smart Hulk/Bruce Banner conducting tests on what appears to be a younger Walters. He tells her that their transformations are triggered by \"anger and fear\", before we cut to Walters and Banner posing together for what appears to be a TV commercial. \"You won't like me when I'm angry,\" Walters says to the camera – a fun nod to the Hulk's iconic line.",
    "We also get a brief glimpse at Marvel's other major Disney Plus show, Ms. Marvel, which is due to land in summer 2022. We see Iman Vellani's Kamala Khan in her homemade Ms. Marvel costume, as well as everyday citizens watching in awe as she runs alongside a large building's windows.",
    "Right now, none of the above series have concrete release dates. Hopefully, though, it won't be too long before we find out when Ms. Marvel, She-Hulk and Moon Knight will debut on Disney Plus. For now, we'll have to make do with the upcoming Marvel movies, such as Spider-Man: No Way Home."
  ],
  "headers": {},
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Disney Plus Day": "https://www.techradar.com/news/disney-plus-day-how-to-watch-date-start-time-shang-chi-what-to-expect-and-more",
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "Disney Plus app": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-9395432591817478000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fvideo%2F6dc7f5fe-3382-4a01-9b58-74448927591c",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know"
  }
}