{
  "source": "https://www.techradar.com/news/england-vs-sri-lanka-live-stream-how-to-watch-odi-series-2021-online-from-anywhere",
  "title": "England vs Sri Lanka live stream: how to watch ODI series 2021 online from anywhere",
  "category": "computing",
  "updated": "2021-06-29T07:38:11Z",
  "author": "aatif-sulleyman",
  "summary": "Can Lions roar back after last week's chastening T20 defeats?",
  "article": [
    "Eoin Morgan and Kusal Perera lock horns again, with the Islanders playing for pride and payback after their routing in last week's T20 series. These two sides have played out some cracking One Day International series over the years, and with expanded crowds allowed at this week's triple-header, things are looking up. Follow our guide as we explain how to watch an England vs Sri Lanka live stream and watch the ODI cricket series online, wherever you are in the world.",
    "The series forms part of the inaugural ICC Cricket World Cup Super League, in which England are doing pretty well, and Sri Lanka... aren't. The Lions are propping up the league table and face possible relegation to the second tier, while England are sitting pretty in second, behind Bangladesh.",
    "That said, the competition has been ravaged by Covid-19, and Sri Lanka have played three games fewer than their opponents. Being slapped with a two-point penalty for bowling a slow over rate against the West Indies didn't help their cause either.",
    "Jos Buttler, Jason Roy and Liam Livingstone were the stars of England's T20 triumphs last week, and Perera's men will need to step things up significantly to stave off a humiliating whitewash.",
    "Follow our guide for all the details you need to find a reliable 2021 England vs Sri Lanka live stream and watch all the action from the ODI cricket series online from anywhere.",
    "In the UK, India, New Zealand, Australia or the US? We've got you covered below with your official broadcasting options.",
    "But if you're out of the country and are still desperate to tune into certain matches, you'll quickly find that online access is geo-blocked. In order to get around that (and assuming it complies with the Ts&Cs of the broadcaster in question), you can download and use a VPN.",
    "Use a VPN to live stream cricket from anywhere"
  ],
  "headers": {
    "5": "How to watch England vs Sri Lanka ODI cricket from outside your country",
    "8": "England vs Sri Lanka live stream: where to watch ODI cricket in the US (and Canada)"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}