{
  "source": "https://www.techradar.com/news/the-flash-movie-teaser-almost-gives-us-michael-keatons-batman",
  "title": "The Flash movie teaser almost gives us Michael Keaton's Batman",
  "category": "entertainment",
  "updated": "2021-10-16T18:40:22Z",
  "author": "samuel-roberts",
  "summary": "Ezra Miller's Flash hits the big screen again",
  "article": [
    "Warner Bros. has revealed a first teaser for The Flash at DC's FanDome event, which is coming to theaters on November 4, 2022. The film offered us the outline of Michael Keaton's on-screen Batman in the Batcave, but stopped short of showing him in full.",
    "\"You can go anywhere you want, right? Any timeline? Any universe?\" asks a voice. The trailer then roughly outlines the premise of the movie, which sees Barry Allen (Ezra Miller) changing the past with his time-traveling powers to save his mother from being murdered.",
    "\"You changed the future and you changed the past,\" the trailer continues. We see a glimpse of The Flash's new suit, then get a quick look at Keaton's Batman in silhouette – and almost a look at his Batmobile from the 1989 movie, too.",
    "Check the trailer out below – we'll replace this with an official teaser as soon as it's available:",
    "The movie is directed by IT's Andy Muschietti, and will feature Sasha Calle as Supergirl and Kiersey Clemons as Iris West – the latter was first seen in Zack Snyder's Justice League earlier this year. Ron Livingston will play Barry's father, Henry, replacing Billy Crudup from Justice League.",
    "The story is inspired by the comic book Flashpoint, where Barry's decision to save his mother has a profound impact on the world that follows – including war between Atlantis and Themyscira.",
    "It's unclear just how much of the story will make it into the movie, but it allows the filmmakers to explore other DC timelines – like that of Keaton's Dark Knight. It's previously been reported that Ben Affleck's Batman will also make an appearance, and it's likely to set the rules of how DC's universes will play nice with each other in future.",
    "Given that the film is more than a year away, this is a super early look, which is why we mostly see effects-free shots – a full trailer seems likely to follow when The Batman lands in 2022."
  ],
  "headers": {},
  "links": {
    "DC's FanDome event": "https://www.techradar.com/news/dc-fandome-2021-how-to-watch-date-time-star-guests-and-more"
  }
}