{
  "source": "https://www.techradar.com/news/global-chip-shortage-could-soon-drive-up-the-price-of-smartphones",
  "title": "Global chip shortage could soon drive up the price of smartphones",
  "category": "computing",
  "updated": "2021-06-07T11:50:26Z",
  "author": "sead-fadilpasic",
  "summary": "The smartphone supply-demand equilibrium may soon be disturbed, Gartner warns.",
  "article": [
    "Although the global chip shortage has not yet taken a major toll on the smartphone industry, analyst firm Gartner believes prices may soon rise.",
    "In its latest report, Gartner states that smartphone sales have taken off since the turn of the year, growing by 26% in Q1. As compared with the same quarter last year, sales were up by 22%.",
    "Gartner attributes this rate of growth to the number of people working and studying from home, as well the fact that 2020 was a particularly poor year for the industry as a result of the pandemic.",
    "“The improvement in consumer outlook, sustained learning and working from home, along with pent-up demand from 2020 boosted sales of smartphones in the first quarter. Consumers started spending on discretionary items as the pandemic situation improved in many parts of the world and markets opened up,” said Anshul Gupta, Senior Research Director at Gartner.",
    "However, while demand is currently being met by supply, Gartner warned that bottlenecks in the semiconductor industry may soon begin to cause problems.",
    "\"The global chip shortage has not yet impacted the smartphone industry as the demand and supply equilibrium is met. This may change in the coming quarters and result in an increase in the average selling price of smartphones globally,\" said the firm.",
    "The expansion of 5G infrastructure and ready availability of compatible devices also played a part in the growth in sales. Apple, for example, was said to have experienced “continued demand”, thanks to its first ever 5G iPhone.",
    "“5G will continue to be the major growth driver for Apple in 2021. Device upgrades will fuel demand for Apple’s flagship phone throughout the year,” Gupta added.",
    "Gartner also said that Xiaomi, Oppo and Vivo all witnessed growing demand for 5G smartphones, as well as managing to capitalize on the poor performance of LG and Huawei.",
    "Overall, Samsung holds the largest market share (20.3%), having shipped more than 76 million units in Q1."
  ],
  "headers": {
    "6": "5G drives demand"
  },
  "links": {
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "studying from home": "https://www.techradar.com/best/best-online-learning-platforms"
  }
}