{
  "source": "https://www.techradar.com/news/shopify-unveils-its-vision-for-the-future-of-e-commerce",
  "title": "Shopify unveils its vision for the future of ecommerce",
  "category": "computing",
  "updated": "2021-06-30T09:23:16Z",
  "author": "rob-clymo",
  "summary": "Developer conference showcases a plethora of new products",
  "article": [
    "Shopify has taken the covers off a host of new features and improvements to the functionality of its ecommerce portfolio at its Unite 2021 event.",
    "Over 450 million people used the digital checkout facilities from Shopify during 2020, with the company processing $120 billion in Gross Merchandise Volume (GMV).",
    "However, Shopify has bold plans to boost that even further, using the Unite get together to reveal a raft of new tools for improving the fortunes of small businesses and larger ventures alike.",
    "Central to the news is the Storefronts aspect of the ecommerce platform. Online Store 2.0 includes a big upgrade to Shopify’s Liquid platform, which effectively allows business owners to get the best from developer features, without the need for coding. There’s a new editor experience too, theme app extensions and a Shopify Theme Store, which will be available from July 15, along with a fresh default theme in the shape of Dawn.",
    "Custom storefronts have been tweaked too, allowing users to get more from a boosted Shopify infrastructure, which includes improvements to server locations and the way they handle API requests.",
    "Meanwhile, Hydrogen is a new React framework, specifically designed to let developers build their own custom storefronts more easily. Oxygen is another new tool, which Shopify says will be its future hosting platform further helping to improve overall efficiency.",
    "Similarly, the areas of metafields and custom content have also been singled out for improvements. Products and product variants can be quickly added into store designs, while the increased use of metafields will enable business owners more flexibility in the formats of content used within Shopify.",
    "The developer conference also showcased changes to Shopify Checkout. Again, this has received improvements to its overall infrastructure, with the aim of Shopify, by way of an example, to allow a “single merchant to be able to sell over 300,000 pairs of sneakers in just over eight minutes.”",
    "Checkout Extensions will give developers more freedom to securely build apps into the Shopify Checkout area, as well as working with the Shop Pay feature. Adding more efficiency will be improvements to Shopify Scripts, while Payment Platform is a new way of integrating third-party gateways into the Shopify Checkout area.",
    "There’s also a concerted effort by Shopify to entice more developers to use the ecommerce platform. Developers who build for the Shopify App Store will pay 0% revenue share for the first $1 million they make annually from the platform, starting August 1. Theme Store developers will get the benefit of the same deal.",
    "According to the company, over 1.7 million merchants are said to be using Shopify themes, so the financial incentive for Theme Store developers is likely to be met with enthusiasm.",
    "“The internet is the world’s largest city, and Shopify is building its commerce infrastructure,” said Tobi Lutke, CEO of Shopify.",
    "“Especially over the past year, we saw independent businesses succeed by showing up creatively and uniquely in this city. The future of commerce on the internet relies on creative expression at every touchpoint. Together with developers, we are building the infrastructure to make this possible.”"
  ],
  "headers": {
    "4": "Shopify Checkout"
  },
  "links": {
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "small businesses": "https://www.techradar.com/best/best-small-business-software",
    "ecommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Shop Pay": "https://www.techradar.com/news/shopify-plans-to-offer-shop-pay-to-any-merchant-on-facebook-or-google"
  }
}