{
  "source": "https://www.techradar.com/news/amazon-alexa-and-david-bowie-will-soon-have-something-in-common",
  "title": "Amazon Alexa and David Bowie will soon have something in common…",
  "category": "smart-home",
  "updated": "2021-07-23T10:32:25Z",
  "author": "rhys-wood",
  "summary": "A new voice profile is coming to Alexa, and it's called Ziggy",
  "article": [
    "Amazon is rolling out a brand new voice for Alexa that will give users a more masculine option over the assistant’s default voice, and it even comes with its own new wake word. Named Ziggy, this deeper-voiced alternative has certainly been a long time coming for Alexa compatible devices.",
    "Much like the celebrity voices of Shaquille O’ Neal and Melissa McCarthy that were recently added to Alexa, Ziggy is currently only available to use in the US. However, given that Ziggy is more of a generalist voice, and not licensed from a specific celebrity, we expect it to roll out worldwide eventually.",
    "If you’re in the US, then, you can check to see if Ziggy has rolled out to your Alexa device by asking it to “change your voice.” If the default voice changes over to Ziggy, then you know your device has been updated. You can also check for Ziggy in your Alexa app’s settings on Android or iOS.",
    "The name ‘Ziggy’ also acts as a wake word, in case you think Alexa isn’t a good fit for the masculine-voiced alternative. This can also be set in your Alexa app’s settings, where Ziggy should now be one of the default wake word options.",
    "If alternative voices are becoming the norm in the voice assistant space, then Amazon and Alexa are certainly late to the party. Both Siri and Google Assistant have offered alternative voices for a while now, so it’s possible that Alexa enthusiasts registered enough demand for Amazon to take notice. That, or the company finally figured Alexa was seriously in need of an update.",
    "It’s curious that the Ziggy update comes within relatively the same timeframe as Amazon announcing its participation in the Matter initiative, a collective branding featuring over 170 tech companies with the aim of greatly simplifying smart home setups. It means that those wishing to stick with Alexa once Matter launches will also have options as to how they’d like their voice assistant to sound.",
    "The crux of why this matters, though, is that choice is never a bad thing when it comes to voice assistants. The addition of Ziggy is a neat bit of customisation, and we love the distinct name, which should help prevent users from accidentally activating the device through background chatter (some kids are called Alexa, you know). So long as they’re not listening to David Bowie, of course.",
    "via The Ambient"
  ],
  "headers": {
    "4": "Analysis: Amazon under pressure?"
  },
  "links": {
    "Alexa": "https://www.techradar.com/best/80-amazon-alexa-easter-eggs-fun-tips-and-tricks-for-your-echo-speaker",
    "celebrity voices": "https://www.techradar.com/news/alexa-adds-two-celebrity-voices-to-its-lineup-but-wed-love-to-see-more",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "iOS": "https://www.techradar.com/news/ios-15-update",
    "Matter initiative": "https://www.techradar.com/news/your-amazon-echo-speaker-is-getting-an-update-that-matters",
    "some kids are called Alexa, you know": "https://www.techradar.com/news/should-amazon-rename-alexa",
    "The Ambient": "https://www.the-ambient.com/news/alexa-male-voice-now-available-ziggy-2675"
  }
}