{
  "source": "https://www.techradar.com/news/windows-11-finally-gets-native-android-apps-but-only-for-certain-users",
  "title": "Windows 11 finally gets native Android apps – but only for certain users",
  "category": "computing",
  "updated": "2021-10-20T16:44:32Z",
  "author": "darren-allan",
  "summary": "Only testers in the Beta Channel can try out the feature right now",
  "article": [
    "Windows 11 finally has the highly anticipated support for Android apps which Microsoft promised upon first revealing the OS – albeit just in testing for now, and only certain Windows Insiders can benefit from it.",
    "As you may recall, the ability to natively run Android apps on the Windows 11 desktop – or at least some Android apps, namely those provided by the Amazon App Store, via the Microsoft Store – was hoped to be present at release, but the feature never came.",
    "Now, at least, we can see Microsoft is progressing towards its realization with the introduction of the Android apps experience to testers in the Beta Channel (Windows 11 Build 22000.xxx series) who are in the US. Dev Channel testers won’t get Android support yet, but Microsoft says they will do “down the road”.",
    "Microsoft reminds us that this functionality is driven by the Windows Subsystem for Android, which eligible testers will find under the Start menu (and they can tweak relevant settings from there). Like the Windows Subsystem for Linux, it runs in a Hyper-V Virtual Machine.",
    "From the user experience point of view, Android apps can be treated just like common-or-garden Windows apps on the desktop. They can be pinned, Alt-tabbed between, snapped side-by-side to run more than one app, plus Android apps are supported in the Action Center with notifications, and you can cut and paste clipboard material between Android and Windows software.",
    "The idea, as you might expect, is for things to be as seamless as possible, and Microsoft also makes it clear that accessibility is high on the priority list, noting that “many Windows accessibility settings apply to Android apps and we are working with Amazon to deliver more improvements”.",
    "Android support is live now, in theory, for the aforementioned testers, but the link Microsoft provides in its instructions to get going is actually missing. We expect that’ll be remedied very soon, though.",
    "The arrival of native Android app support is no big surprise given that there was a very recent leak of the feature being tested internally at Microsoft, so it was expected to be here soon. Maybe not quite this soon, but hey, the sooner the better, obviously. With testing now fully underway in the Beta Channel, the prospects for a more timely arrival in the release version of Windows 11 are looking brighter.",
    "Naturally, the addition of more apps to the armory of Windows 11 users is a good thing, but the initial selection for testing is small as you might expect. There are 50 apps to begin with, but new software will be coming as the months progress. The initial offerings include the Kindle app, Lego Duplo World, and mobile games including Lords Mobile.",
    "Of course, it’s early days, so don’t expect smooth sailing when playing around with Android apps. Indeed, Microsoft has highlighted a bunch of known issues, including camera glitches in some apps, bugs around apps coming out of modern standby, and performance slowdown when running multiple Android apps.",
    "While only US testers can get involved at the moment, presumably that will open up to other regions as time progresses, too."
  ],
  "headers": {
    "7": "Analysis: Not a surprise, but great to see nonetheless"
  },
  "links": {
    "Microsoft promised upon first revealing the OS": "https://www.techradar.com/news/windows-11-will-bring-native-android-apps-to-the-microsoft-os",
    "provided by the Amazon App Store": "https://www.techradar.com/news/why-windows-11-going-with-amazon-for-its-android-apps-and-not-google-is-a-masterstroke",
    "Windows Subsystem for Linux": "https://www.techradar.com/news/windows-subsystem-for-linux-for-windows-11-is-on-the-microsoft-store-now",
    "Android apps": "https://www.techradar.com/best/best-android-apps-2021",
    "noting": "https://blogs.windows.com/windows-insider/2021/10/20/introducing-android-apps-on-windows-11-to-windows-insiders/",
    "instructions": "https://blogs.windows.com/windows-insider/2021/10/20/announcing-android-apps-on-windows-11-preview-for-windows-insiders-in-the-beta-channel/",
    "very recent leak of the feature being tested internally at Microsoft": "https://www.techradar.com/news/windows-11-spotted-running-android-apps-so-support-could-be-arriving-soon"
  }
}