{
  "source": "https://www.techradar.com/news/ios-1511-just-landed-on-your-iphone-with-an-important-bug-fix",
  "title": "iOS 15.1.1 just landed on your iPhone with an important bug fix",
  "category": "phones",
  "updated": "2021-11-18T10:42:41Z",
  "author": "james-peckham",
  "summary": "Fixes the dropped call issue",
  "article": [
    "Your iPhone just received a new update to the latest version of iOS 15.1, and it's designed to bring an important bug fix for those with an iPhone 12 or an iPhone 13 series handset.",
    "iOS 15.1.1 fixes a bug that was affecting some of the most recent Apple handsets where the phones dropped calls more regularly than they should. Some handsets had been suffering from the issue since iOS 15.1 landed in October.",
    "If you've been experiencing these issues, this will be a big update for you but it doesn't bring any other features for those that haven't suffered from the problem over the last month.",
    "The update should be available on your iPhone now, if your device is compatible. Any phones that were upgraded to iOS 15.1 - that's the iPhone 6S or above - will be able to download this update.",
    "To get this, go to the Settings app on your iPhone and head to General. Under this menu, you'll find Software Update under here where iOS 15.1.1 ready to go in there.",
    "Some may have been excited to see a new update land on their iPhone, but this is only important for those that have been experiencing that annoying bug where your handset drops calls.",
    "For those affected, this will be a big change. For everyone else, you'll be waiting until iOS 15.2 until you see some more features.",
    "We've yet to find out when that new update is dropping, but the beta versions of the software have given us an insight into the features to expect.",
    "Those include a new App Privacy Report, which is designed to give you a clearer idea of what phone features each app uses, and Legacy Contacts that you can include so someone can still access your iPhone's data after you've passed away."
  ],
  "headers": {
    "5": "Analysis: An important update, but only for some"
  },
  "links": {
    "iOS 15.1": "https://www.techradar.com/news/ios-151-news",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review"
  }
}