{
  "source": "https://www.techradar.com/news/apple-m1-vs-intel-which-macbook-deal-should-you-buy-on-black-friday",
  "title": "Apple M1 vs Intel: which MacBook deal should you buy on Black Friday?",
  "category": "computing",
  "updated": "2021-10-30T09:00:00Z",
  "author": "john-loeffler",
  "summary": "Black Friday MacBook deals will be huge, but which is right for you?",
  "article": [
    "With early Black Friday deals right around the corner, there are bound to be some awesome sales on last year's MacBooks, but you'll have choices to make between Apple M1 vs Intel MacBooks.",
    "The Apple MacBook Air (M1) and MacBook Pro 13-inch (M1) released late last year are two of the best laptops ever made, so there's a lot of anticipation around these two laptops in particular. Especially because we saw some awesome Black Friday MacBook deals on these two devices even though they were only a few weeks old by the time Black Friday and Cyber Monday rolled around.",
    "The Intel-powered MacBook Air (2020) and MacBook Pro (13-inch, 2020 – released earlier in 2020 before the Apple M1 chip was even announced – are still incredible though, and these two devices, in particular, saw some of the best Black Friday laptop deals all year thanks to the demand for the new M1 devices driving demand for these two laptops down during the holiday season.",
    "What about this year, though? This year's Black Friday shopping rush is coming hot off the heels of the launch of the Apple MacBook Pro 16-inch (2021) and Apple MacBook Pro 14-inch (2021), both of which are powered by the new Apple M1 Pro and M1 Max chips.",
    "We already know that this is undoubtedly going to drive demand away from all of last year's MacBook devices, which should make them prime targets for awesome deals in the coming weeks and on Black Friday itself.",
    "So if you don't need a MacBook Pro device as powerful as the latest models, or if you're really looking to keep things in the 13-inch range, then this Black Friday is going to be a great time to buy one of last year's devices. And ditto if you want the portability of the MacBook Air but don't want to wait until next year's anticipated MacBook Air (2022) refresh.",
    "But you'll have an important choice to make: Apple M1 vs Intel, which MacBook model from last year is going to be the better Black Friday deal?",
    "The ongoing supply chain crisis is well on its way to becoming an internet meme at this point, but it is absolutely a very real problem that could have a huge impact on Black Friday inventories – especially for high-tech goods like laptops that are almost exclusively made in Asia.",
    "Particularly, a huge part of that crisis is at major ports in America and Europe where cargo ships are idling offshore waiting for the room to offload their hundreds of thousands of containers packed full of merchandise.",
    "Until retailers' relatively-small warehouse inventory is cleared out, the existing cargo on the docks at these ports can't be moved out, which need to move fast to make room for the cargo sitting offshore.",
    "This means that older inventory or lower-demand merchandise is going to be aggressively priced in order to move it out quickly. In the case of the MacBook Air and MacBook Pro 13-inch laptops, this absolutely means the Intel-powered models from last year.",
    "Since these models are effectively two generations old (if you count the new MacBook Pro 14-inch and 16-inch devices), then retailers absolutely must move existing inventory of these two MacBook models in particular to make room for the more in-demand M1-powered models and the latest M1 Pro and M1 Max-powered laptops, which are expected to be huge profit drivers for tech retailers this year.",
    "How do you move a low-demand MacBook, though? That's the question and given the supply chain pressure, the quickest and easiest way to do this is to aggressively price these two laptops lower and earlier than you might otherwise have considered.",
    "We're already seeing early-2020 MacBook Air and MacBook Pro 13-inch laptops approaching the kinds of prices we saw last year during Black Friday, and the early Black Friday deals haven't really kicked into high gear yet. In the next few weeks, we're expecting the price on these devices to drop lower to make room for the more profitable M1, M1 Pro, and M1 Max MacBook devices.",
    "One of the biggest surprises from Black Friday 2020 was some surprisingly good savings on the then-brand-new M1 MacBook Air, MacBook Pro 13-inch laptops and the M1-powered Mac Mini.",
    "We honestly weren't expecting the prices on those to see any cuts at all, but we saw anywhere from $50 to $150 knocked off those devices on Black Friday and Cyber Monday. Now that the M1 MacBook Air and MacBook Pro devices are a year old, do we expect to see more of the same or should we see better pricing than last year's Black Friday sales?",
    "It's a tough question, actually. We do expect that last year's deals pretty much set a baseline precedent that will be hard for retailers to ignore this year. It's almost certain that we'll see the kinds of prices we saw last year at least.",
    "The question really does come back to that supply chain crisis we talked about earlier. While the MacBook Air (M1) and MacBook Pro 13-inch (M1) might be a year old, they're still the latest models in these two product lines.",
    "For the MacBook Air, the M1 MacBook Air is the best MacBook Air you can get right now, so it's not as likely to need aggressively low pricing to maximize profits on its sales during Black Friday. Black Friday deals on the Air will likely be $50 better than the best pricing we saw last year, which was about $100 off the $999 MSRP for the entry-level MacBook Air configuration.",
    "The M1 MacBook Pro 13-inch is a bit more of an open question, since yes, it's the best 13-inch MacBook Pro out there, but there's an even better 14-inch MacBook Pro out there now as well.",
    "This could seriously cut into the demand for the 13-inch Pro model, meaning it will probably need much better pricing in order to entice customers to buy that laptop rather than go for the 14-inch version.",
    "We saw about $50 to $150 off the entry-level 13-inch model last year and up to $200 off the most-specced out configurations, so we'd expect as much as $400 off the high-end configurations and the smallest discounts coming in at about $150 on the entry-level models and everything in between.",
    "Now the question comes down to the Apple M1 vs Intel MacBook Air and MacBook Pro models from 2020.",
    "The Intel-powered MacBooks are likely to see the biggest price cuts overall, and we're expecting to see them much sooner than Black Friday even. By Black Friday itself, the pressure to move those devices out is pretty much irrelevant since it's too late for retailers to use that inventory space for the M1 versions of either device for a higher profit.",
    "Ironically, there might be even better pricing on the Intel-powered MacBooks from 2020 before Black Friday than on Black Friday itself. If you want the best price on a MacBook, the Intel models are your best bet and you shouldn't hesitate on grabbing a great deal now rather than waiting until Black Friday since you might even get a better price on those right now.",
    "If you want the latest and greatest MacBook Air with the M1 chip, then obviously Black Friday is going to have some great prices. That said, we're already seeing similar pricing now that we saw during last year's Black Friday. If you see a new MacBook Air with an M1chip for $100 off, holding out to Black Friday might only save you about $50 to $100.",
    "If that savings aren't enough to hold off on buying a new MacBook Air right now, then you probably should go ahead and take advantage of the early Black Friday MacBook Air deals you can get right now.",
    "For Black Friday MacBook Pro deals though, there are some great deals out there now, but there are likely to be some significantly better ones on Black Friday and Cyber Monday, so it might really be worth holding off until then if you don't absolutely need to buy a new MacBook Pro 13-inch this very moment.",
    "In any case, we'll be sure to bring you the very best Black Friday MacBook deals we find, both early sales and during Black Friday and Cyber Monday, so make sure to stay tuned to TechRadar for the very latest."
  ],
  "headers": {
    "7": "What to expect from an Intel-powered MacBook this Black Friday",
    "14": "Will M1 MacBooks offer better Black Friday deals than last year?",
    "22": "Which Black Friday MacBook deal should you look for?"
  },
  "links": {
    "Apple MacBook Air (M1)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pro 13-inch (M1)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Black Friday MacBook deals": "https://www.techradar.com/black-friday/black-friday-macbook-deals",
    "MacBook Air (2020)": "https://www.techradar.com/reviews/macbook-air-2020",
    "MacBook Pro (13-inch, 2020": "https://www.techradar.com/reviews/macbook-pro-13-inch-2020",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Apple MacBook Pro 16-inch (2021)": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "Apple MacBook Pro 14-inch (2021)": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "Apple M1 Pro and M1 Max": "https://www.techradar.com/news/m1-pro-vs-m1-max",
    "MacBook Air (2022)": "https://www.techradar.com/news/macbook-air-2022",
    "an internet meme at this point": "https://twitter.com/jpbrammer/status/1452405433310851080?s=20",
    "Black Friday MacBook Air deals": "https://www.techradar.com/black-friday/black-friday-macbook-air-deals",
    "Black Friday MacBook Pro deals": "https://www.techradar.com/black-friday/black-friday-macbook-pro-deals"
  }
}