{
  "source": "https://www.techradar.com/news/mark-zuckerberg-unveils-wild-ar-plans-at-facebook-connect-event",
  "title": "Mark Zuckerberg unveils wild AR plans at Facebook Connect event",
  "category": "gaming",
  "updated": "2021-10-29T09:58:24Z",
  "author": "hamish-hector",
  "summary": "Zuckerberg shows us the far future of AR in Horizon",
  "article": [
    "At the Facebook Connect event today, Mark Zuckerberg's opening keynote detailed his plans for a metaverse that combines the real and virtual worlds, letting people connect wherever they happen to be, using devices like the Oculus Quest 2 headset, the Ray-Ban Stories smart glasses and now Project Cambria.",
    "In the Metaverse, Zuckerberg said, people will be able to create AR tags attached to real-world locations to create art and tell stories, play table tennis or chess with players that aren't there physically, and interact with digital objects that react realistically to user movements.",
    "Right now Facebook's plans (the company is now called Meta, by the way) seem far more like science fiction, but Zuckerberg is working hard to explain how his company's Horizon VR and AR platform can bring these ideas into reality. His cautious wording reveals that this interconnected future is still uncertain -- some would call it preposterous.",
    "Mark Zuckerberg detailed a world where holograms will stand beside us in concerts and people can work together in digital offices despite being thousands of miles apart. Hearing him speak it's hard not to feel amazed by the world that might be.",
    "But the issue is that while aspects of this integrated metaverse already exist, key pillars that will hold up the bulk of Meta's vision feel like they are still a decade away. The technology we have just isn't there yet, and while we can start to move in the direction Meta outlines, the whole keynote is full of speculation that leaves us wondering why we bothered to tune in.",
    "In fairness, it wasn't all speculative. Meta understands that it will take an enormous amount of collaboration to bring the metaverse to life and announced plans that it can action in the coming year.",
    "To help bring more creatives to the field of AR, Meta detailed plans to create official classes as a first step, and it showed off basic apps that will bring AR to its preexisting devices - such as an app that can anchor to piano keys to teach people how to play their favorite songs.",
    "But on the path to the metaverse, these developments feel like the equivalent of running one inch in a marathon - there's a lot further still to go.",
    "At some point we will have to walk these first inches, but did we really need a one-and-a-half-hour event to explain what we might have in 2032 rather than focusing on what's coming in 2022? When the dream is so speculative there will be a lot of people - us included - that can't help but feel this presentation would have been better to deliver when we're further along the path to the metaverse; when it feels a lot less like science fiction and more like science fact."
  ],
  "headers": {
    "3": "Analysis: \"This sounds like science fiction\""
  },
  "links": {
    "Facebook Connect": "https://www.techradar.com/how-to/how-to-watch-facebook-connect-and-what-we-want-to-see-at-the-oculus-event",
    "Oculus Quest 2 headset": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Ray-Ban Stories smart glasses": "https://www.techradar.com/reviews/ray-ban-stories-facebook-smart-glasses",
    "Project Cambria": "https://www.techradar.com/news/new-oculus-vr-headset-officially-teased-at-facebook-connect-2021",
    "now called Meta": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
    "some would call it preposterous": "https://www.techradar.com/news/facebooks-whole-metaverse-thing-its-simply-ridiculous-and-we-have-questions"
  }
}