{
  "source": "https://www.techradar.com/news/the-rise-of-data-privacy-concerns",
  "title": "The rise of data privacy concerns",
  "category": "computing",
  "updated": "2021-10-29T19:30:13Z",
  "author": "olga-andrienko",
  "summary": "Data privacy is not a matter to be taken lightly",
  "article": [
    "More and more people are becoming increasingly aware that if they aren’t being sold something, their data is likely the product. When you use services like Facebook without having to pay a penny, the question “what is the actual cost?” may cross your mind.",
    "At some point, the personal information stored on various resources can become public or be used against someone. This might concern companies tracking your location, analyzing your browsing history, or even examining the way you scroll or guide your cursor on a website.",
    "Private data is something we all want to be secure, and whenever a huge breach or security issue happens, the perception of overall data protection evaporates rather quickly. Recently, there have been notable security breaches on popular platforms to warrant these concerns. The public isn’t so willing to overlook their privacy and give the go-ahead to any request for data anymore. Recent analysis shows that search volume for the keyword \"privacy\" has increased over the last four years, reaching about 600,000 user requests per month in 2021.",
    "Privacy is gaining more visibility. One of the important questions is understanding what else people are looking for alongside it. Users are starting to increase their number of inquiries regarding laws regulating the exchange of personal information and its protection",
    "The popularity of the “data privacy act” - the act which requires organizations to keep and maintain records of every breach of security if personal information is compromised - proves it in practice. Global Google search for this term and related ones, over the last 12 months, exceeded 40,000.",
    "This search trend underlines the intention to get acquainted with specific details of how to manage digital data efficiently and take countermeasures. The next thing would be to understand how users react to changes in privacy settings they are doing to keep their information safe and sound.",
    "WhatsApp has received a lot of flak lately due to privacy concerns, data breaches, and ill-reputed tactics brought forward by Facebook (such as merging WhatsApp with Facebook Messenger and thus enabling harder data tracking). A big spike was noticed the moment WhatsApp introduced a new policy: about 450,000 search requests in just one month.",
    "Many queries indicate pent-up demand in securing privacy-related aspects of life. Telegram and Signal messengers got a considerable and stable growth in search volume. Telegram has seen 15 million monthly global searches, while Signal is trending with 82.9% growth since last year and 700,000 search queries in 2021.",
    "An interesting point: an increase in secure messaging follows precisely after the introduction of the new WhatsApp privacy policy. The number of requests to download application data also suggests that people were worried about the principles of storing their data and kept in mind switching to new messaging platforms for daily communication. Secured messaging is then followed by various password manager services and data vaults, which are also growing in popularity – this trend has risen by 640% over the last year, with the “password manager” keyword achieving 378,000 requests per month in 2021.",
    "More and more people are looking into wiping their social media activity off the internet, starting with the most popular social media accounts. In recent research we commissioned earlier this year, we can see how the desire to delete an Instagram account is changing over time. While the number of search requests to delete Facebook accounts is quite stable, the number of searches for deleting Instagram has doubled in four years. What is interesting is that Instagram leads the chart, despite Facebook's data privacy intrusions and possibly social media fatigue on top of it. Oh and in case you were wondering, Facebook owns both Instagram and WhatsApp.",
    "GDPR is a regulation that requires businesses to protect the personal data and privacy of EU citizens for transactions that occur within EU member states. Non-compliance could cost companies dearly.",
    "Ever since GDPR was successfully implemented by the European Union, the search volume for these terms has been steadily decreasing. The term “GDPR” has 857,333 global monthly searches on average in 2021 so far. What’s more, most search requests originate from the UK (22.2%), the US (14.2%), Italy (6.4%), India (3.7%), and Germany (3.3%), with other countries accounting for the rest (50.3%). The trends are clear: the end-users recognize the importance and meaning behind data privacy, and recent security issues and controversies are a good example of that. Data breaches drive public awareness of privacy, and people begin to learn that this is indeed a rabbit hole that seems to have no end as to where it all leads.",
    "Privacy will become a driving factor in a customer’s decision to use a certain product or network in the foreseeable future. Secure messaging, emailing, and other means of communication and data protection are on the rise and will continue to see this trend. GDPR and other regulations have provided a good example to the rest of the world - privacy is not a matter to be taken lightly.",
    "Want to protect your privacy online further? Check out our roundups of the best privacy apps and the best anonymous browsers"
  ],
  "headers": {
    "3": "Matters of concern",
    "6": "How people secure their privacy",
    "9": "Social media account deletion trends",
    "10": "Legislative power is the way out of this situation"
  },
  "links": {
    "personal information": "https://www.techradar.com/news/keeping-personal-information-secure",
    "new policy": "https://www.techradar.com/news/whatsapps-new-privacy-policy-requires-you-to-share-data-with-facebook",
    "Telegram": "https://www.techradar.com/reviews/telegram-encrypted-messaging",
    "Signal": "https://www.techradar.com/reviews/signal-encrypted-messaging",
    "secure messaging": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "password manager": "https://www.techradar.com/best/password-manager",
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know",
    "data privacy": "https://www.techradar.com/news/the-10-data-privacy-fails-of-the-decade-and-what-we-learnt-from-them",
    "best privacy apps": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "best anonymous browsers": "https://www.techradar.com/best/anonymous-browsing"
  }
}