{
  "source": "https://www.techradar.com/news/will-new-ipad-pro-and-other-2021-ipads-be-hard-to-buy-heres-what-we-know-so-far",
  "title": "Will new iPad Pro and other 2021 iPads be hard to buy? Here's what we know so far",
  "category": "tablets",
  "updated": "2021-05-02T08:00:38Z",
  "author": "tom-bedford",
  "summary": "It's looking likely",
  "article": [
    "If you're excited for the new iPad Pro 2021, or perhaps one of the tablets we're expecting Apple to debut later in the year like the new iPad or iPad Mini 6, news probably hasn't escaped you of possible stock shortages (or perhaps news had escaped you, so we're sorry you had to find out this way).",
    "Word is that when each of the new iPads goes on sale, stock will be pretty limited - we've seen the same thing for PS5s, Xbox Series Xs and RTX 3090 graphics cards, and apparently iPads are next.",
    "If you're trying to buy one, then, you might find lots of retailers out of stock, or with units in just a few configurations, and if you try to order one there might be a several-month wait time.",
    "The supposed reason is an ongoing chipset shortage around the globe, linked to the Covid-19 pandemic and a few other factors also linked to the events of 2020.",
    "This hasn't been explicitly confirmed by Apple - though the company has come pretty close to admitting it - but evidence suggests it'll be the case. However there's some reason to believe iPads might not be as hard to buy as some of those other gadgets. We'll run you through some of the key pieces of evidence either way.",
    "Apple has come as close as possible to admitting there will be iPad stock shortages, without explicitly saying as much.",
    "During Apple's Q2 2021 earnings call, CEO Tim Cook fielded questions about the chipset shortage, saying \"we expect to be supply-gated, not demand-gated\" - in other words, supply of chipsets will be the thing making iPads scarce, not too much demand for them.",
    "This gels with rumors from late 2020, which stated the reason the iPhone 12 launch and release was delayed was not, as some thought, because of Covid-19, but actually because of a lack of components.",
    "So Apple certainly seems to be facing the shortage as much as every other relevant company, though at least in the case of the iPhones, it found ways to get around this issue (by delaying the release). However it has released one product that was super hard to buy at launch: the iPad Air 4.",
    "The iPad Pro (2021) won't be the first iPad to fall afoul of the chipset shortage - the iPad Air 4, launched in late October 2020, gets that crown.",
    "For a few weeks after its launch, the iPad Air was out of stock in most brick-and-mortar and online stores, with people queuing up outside certain Apple stores to try and buy the slate (though Covid restrictions were as much to blame for those lines).",
    "If you searched hard enough, you could sometimes find the odd iPad Air for sale in shops, but often if you ordered you had several-month-long waiting times.",
    "However that didn't last long, and quite quickly stock began to appear. By Black Friday that year, a month from launch, lots of stores had enough iPad Air units to sell them at a discount, though lots of places sold out quite quickly again afterwards.",
    "Now, though, it's pretty easy to buy an iPad Air, so clearly the shortages didn't last long. Perhaps we'll see the same happen for 2021 iPads.",
    "As we said, lots of gaming devices have been in short supply because of the chipset shortages, but there are also issues within the mobile world too.",
    "Samsung's CEO has stated the anticipated Galaxy Note 21 smartphone from the company could actually be canceled, citing an imbalance between supply and demand for chipsets, though this isn't certain just yet.",
    "While not all companies have spoken out as publicly as Samsung and Apple, we've seen a few moves in the phone world that are likely because of the chipset situation. Quite a few Xiaomi phones have only been released months after announcement, something the company doesn't usually do.",
    "In addition, Google is rumored to be using an older chipset for its Pixel 5a device, with the chipset shortage being the scapegoat for this use of pre-existing technology.",
    "It's likely that many more companies have been affected by the global technology situation, with the above being just a few, easily-identifiable cases.",
    "For the above reasons, it seems likely the iPad Pro and other Apple tablets could be affected in some way, but it's worth pointing out that not all companies have shifted their patterns during the shortage. For example, the OnePlus 9 series launched and went on sale with much the same promptness as handsets from the company always do.",
    "The only way to know for certain if iPads will be hard to buy upon launch, is to wait until they're released and try to buy them."
  ],
  "headers": {
    "5": "What Apple has said",
    "9": "What the iPad Air 4 can tell us",
    "14": "What's happened to other companies"
  },
  "links": {
    "new iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "new iPad": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "iPad Mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "possible stock shortages": "https://www.techradar.com/news/ipad-pro-2021-and-new-imac-may-have-limited-stock-this-year",
    "PS5s": "https://www.techradar.com/reviews/ps5",
    "Xbox Series Xs": "https://www.techradar.com/reviews/xbox-series-x",
    "RTX 3090": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3090-find-stock-here",
    "rumors from late 2020": "https://www.techradar.com/news/apple-faced-with-shortage-of-power-chips-for-iphone-12",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "could actually be canceled": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
    "Xiaomi phones": "https://www.techradar.com/news/best-xiaomi-phones",
    "is rumored to be using an older chipset": "https://www.techradar.com/news/google-may-re-use-pixel-5-and-pixel-4a-5gs-processor-in-pixel-5a",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review"
  }
}