{
  "source": "https://www.techradar.com/news/oneplus-watch-could-come-in-a-sporty-design-as-well-as-a-standard-one",
  "title": "OnePlus Watch could come in a sporty design as well as a standard one",
  "category": "wearables",
  "updated": "2021-02-17T09:31:36Z",
  "author": "tom-bedford",
  "summary": "Some smartwatch patents have leaked",
  "article": [
    "The OnePlus Watch is expected to be the company's second wearable device, after the OnePlus Band, and you might be able to buy the watch with distinct straps depending on what you plan to do with it.",
    "OnePlus Watch patents have been filed in the German Patent and Trademark Office, and spotted by website TechnikNews. They show the smartwatch with the same body, but different straps, with one seemingly being leather (or perhaps faux-leather) while the other looks like a silicone-style material.",
    "Traditionally, leather (or substitutes) have been used in fashion smartwatches, while silicone-family straps have been used for fitness watches, as it can be more breathable and adjustable, and doesn't warp and rot from moisture like sweat as leather does.",
    "So by the looks of it, the OnePlus Watch could work with multiple bands, so if you want a quick workout before a social engagement, for example, you can easily swap between the two straps.",
    "Many smartwatches have removable and replaceable straps, so if these patents do actually represent actual straps OnePlus has created, it remains to be seen if both bands actually come with the device, or if you have to buy one.",
    "A fair few smartwatches come with various bands in the box, so you can start using both straight away, and don't have to buy any extras.",
    "However, some only come with one band which is the case with the Apple Watch. You can buy Apple Watches with a range of band materials, depending on how you think you'd use the smartwatch, though you can buy new ones if you prefer to mix it up.",
    "So which will the OnePlus Watch go for? While we can't say for certain, it seems likely if the patent includes both smartwatch straps along with the body, it's because you can buy them together - so these could be the two 'default' options when you buy the smartwatch.",
    "This is just a patent though, showing a company is considering an idea, so it's no confirmation OnePlus will offer this two-band swap when the smartwatch comes out. We'll have to wait and see.",
    "Via GSMArena"
  ],
  "headers": {
    "4": "To buy or not to buy?"
  },
  "links": {
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "OnePlus Band": "https://www.techradar.com/reviews/oneplus-band",
    "TechnikNews": "https://www.techniknews.net/news/oneplus-watch-erste-skizzen-gesichtet/",
    "GSMArena": "https://www.gsmarena.com/oneplus_watch_appears_in_patent_schematics_with_two_different_wrist_strap_designs-news-47774.php"
  }
}