{
  "source": "https://www.techradar.com/news/playstation-now-could-finally-rival-xbox-game-pass-thanks-to-a-new-patent",
  "title": "PlayStation Now could finally rival Xbox Game Pass, thanks to a new patent",
  "category": "gaming",
  "updated": "2021-09-29T17:53:00Z",
  "author": "adam-vjestica",
  "summary": "PS5 games could come to PlayStation Now",
  "article": [
    "Sony’s PlayStation Now service could get PS5 games in the near future, based on a new patent that was filed by the company.",
    "The patent, called ‘Ultra high-speed low-latency network storage’, was filed on April 27, 2021, and shows how Sony is planning to use multiple NVMe SSDs to store video game data (thanks, DualShockers). This data can then be dynamically streamed between the SSDs so that it can be delivered to the client without delay in case a drive gets overloaded or dies.",
    "The addition of NVMe SSDs suggests Sony could be using the same drives found in PS5, which would naturally open the door to PS5 games appearing on PS Now.",
    "As it stands, PlayStation Now only lets users download a large number of PS4 and PS2 games, but these can also be streamed. PS3 games are also included in the service, but they cannot be downloaded.",
    "If PlayStation Now can add PS5 games to its service, it could match Microsoft’s recent plans to let Xbox Game Pass Ultimate members stream Xbox Series X/S games on Xbox One via the cloud. Microsoft recently announced that Xbox Cloud Gaming is now available to Xbox Insiders to test, with a rollout planned for this holiday (that's between September and December).",
    "PS4 players could use PS Now to stream PS5 games, which would be great value for those who aren’t planning to upgrade to Sony’s new console anytime soon, which is still hard to find in stock.",
    "PlayStation Now has struggled to attract subscribers in the same vein as Microsoft’s Xbox Game Pass. PS Now had over 3.2 million subscribers as of April 2021, while Microsoft’s subscription service surpassed 18 million subscribers back in January 2021.",
    "The biggest difference between the two services is that Xbox Game Pass often includes notable day one releases, like Outriders, gives subscribers access to every first-party game from Xbox Game Studios, and includes numerous Xbox Series X and Xbox Series S optimized titles.",
    "Meanwhile, PS Now often gets games at a much later date, doesn’t include Sony’s first-party lineup at launch, and there are no PlayStation 5 games available right now. Hopefully, that's about to change."
  ],
  "headers": {
    "6": "Analysis: PS5 games on PS Now would be a huge win"
  },
  "links": {
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "patent": "https://patentscope.wipo.int/search/en/detail.jsf?docId=US335381925&tab=NATIONALBIBLIO",
    "DualShockers": "https://www.dualshockers.com/ps5-games-on-ps-now-may-soon-be-a-reality/",
    "PS2 games": "https://www.techradar.com/news/best-ps2-games-anniversary",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Cloud Gaming is now available to Xbox Insiders": "https://www.techradar.com/news/xbox-cloud-gaming-is-now-available-for-xbox-insiders-to-test",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "over 3.2 million subscribers": "https://www.pushsquare.com/news/2021/05/ps_now_has_a_respectable_3_2_million_subscribers",
    "18 million subscribers": "https://www.techradar.com/news/xbox-game-pass-hits-18-million-subscribers-as-microsofts-strategy-pays-off",
    "Outriders": "https://www.techradar.com/reviews/outriders-review",
    "Xbox Series X and Xbox Series S optimized titles": "https://www.techradar.com/news/best-xbox-series-x-optimized-games"
  }
}