{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-could-get-some-new-color-options-very-soon",
  "title": "Samsung Galaxy S21 could get some new color options very soon",
  "category": "phones",
  "updated": "2021-07-08T08:36:12Z",
  "author": "tom-bedford",
  "summary": "Not quite a hue-ge upgrade",
  "article": [
    "If you're tempted to buy the Samsung Galaxy S21, S21 Plus or S21 Ultra, you'll find there's a fair range of choice when it comes to color - more than for your average smartphone, anyway. However, it sounds like the selection of Samsung Galaxy S21 colors is about to get even bigger.",
    "According to a leaker on Korean social network site Naver, Samsung is planning new color options for the S21 series.",
    "It's not clear what these colors are, but the poster uses the word 'series', so it's likely that each of the three phones in the line will get a splash of paint. We could see different new shades coming to different phones, or the same color applied to all three, or even multiple new hues.",
    "Apparently, these colors will release around the same time as the Galaxy Z Fold 3 and Galaxy Z Flip 3, two upcoming foldable phones from Samsung we're expecting to see launched sometime in August.",
    "That could give us a hint at what to expect with the Galaxy S21. In its August 2020 launch event that brought the Galaxy Note 20, Galaxy Tab S7 and more, Samsung also unveiled a color called Mystic Bronze that all the new products came in - perhaps it's found itself a new color for 2021, and we'll see the foldables available in it.",
    "If that's true, we could also see the Samsung Galaxy S21 color options updated to include the tone too. It'd make sense, as strong rumors suggest the Galaxy Note 21 has been canceled, and Samsung may still want a flagship line that comes in the new color.",
    "This is all speculation for now, but if you've read all the way through this article, it's safe to assume you're interested in the new Samsung Galaxy S21 colors. We'll update you when we find out what they are, or when these new phones go on sale, but if you don't want to wait you could just check out the current Samsung Galaxy S21 deals."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S21 colors": "https://www.techradar.com/news/samsung-galaxy-s21-colors-every-shade-available-including-s21-plus-and-s21-ultra",
    "Naver": "https://blog.naver.com/yeux1122/222423012991",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Samsung Galaxy S21 deals": "https://www.techradar.com/deals/best-samsung-galaxy-s21-deals"
  }
}