{
  "source": "https://www.techradar.com/news/emerging-channels-safety-minefield-or-audience-goldmine",
  "title": "Emerging channels: safety-minefield or audience-goldmine?",
  "category": "computing",
  "updated": "2021-05-25T14:27:31Z",
  "author": "tanzil-bukhari",
  "summary": "Are emerging channels matching their hyper-growth",
  "article": [
    "Like everyone, marketers have had a challenging year. Advertising budgets fell early in the pandemic, and many brands have struggled to build their voice while navigating 2020’s turbulent news cycles. Throughout 2021, marketers will be looking to reset and rebuild - particularly as budgets are expected to bounce back. In particular, marketers are going to be focused on emerging channels, specifically CTV and social.",
    "And why wouldn’t they? Over half the world’s population is now on social media, with an average of 2 million new users joining each day, bolstered by new fast growing platforms. Meanwhile, CTV use has continued to skyrocket with consumers spending more time at home. In fact, we found that 44% of consumers spent more time using CTV devices since the pandemic started.",
    "But are these super-charged platforms and devices matching their hyper-growth with controls to make them brand safe?",
    "New platforms bring new risks. But this shouldn’t necessarily switch marketers off. Understanding and acknowledging risks is the first step in successfully navigating and tackling them.",
    "Social media, from its earliest days to the current buzz around Clubhouse, is built on user generated content (UGC), which is hard to moderate, particularly given the scale and pace of growth these platforms operate at. With billions of users there are billions of opportunities for unsuitable content to be shared.",
    "While technology is helping, much of this moderation still has to be undertaken manually, and there’s the growing safeguarding challenge of more young users on platforms, as well as the societal risks of fake news in the pandemic era.",
    "However, UGC-powered platforms offer significant opportunities for brands - if brands and the platform take the right approach. Facebook continues to act as a key advertising platform, as do others that have faced UGC challenges in recent years, like YouTube and Twitter. Facebook recently announced timely plans to tackle false information around vaccines while, alongside Twitter and YouTube, it’s also agreed a framework in collaboration with the Global Alliance for Responsible Media that will help in identifying harmful content.",
    "Newer players need to enter the space with these learnings in mind. A collaborative approach, making the most of integrations from experienced ad-tech providers and trusted publishers are crucial to implementing effective safety controls and building brand confidence.",
    "While CTV is less of a minefield regarding UGC (particularly if brands focus ads on premium channels) it comes with its own challenges. Fraudsters follow the money, and with high-engagement rates and cost per impression, CTV has become highly attractive to bad actors. In January 2021, we identified and blocked the biggest CTV fraud scheme to date - ParrotTerra - which was spoofing 3.7 million device signatures each day.",
    "To an extent, this was expected, and inevitably more will follow. Fraud follows ad spend, particularly when emerging channels like CTV are involved, where demand outstrips supply and measurement or safety technologies are not yet widely adopted.",
    "However, this level of fraud poses risks to brands, which if not addressed, may create a reluctance to part with spend.",
    "Inventory that is transacted through our own certified marketplaces with fraud detection technology in place can help brands to advertise with confidence. The differences between certified and non-certified marketplaces are stark: non-certified programmatic advertising sees a fraud rate over 11x higher than CTV transacted by DoubleVerify certified marketplaces.",
    "While fraud on UGC (and to a lesser extent on CTV) present risks, technology and industry collaboration offers a route to alleviating these issues, helping brands, publishers and platforms to unlock new audiences.",
    "Embracing technology, building best-practices and setting a performance baseline underpinned by quality inventory are all key to helping brands make the most of emerging channels.",
    "Those buying on CTV need to embrace solutions that offer full transparency and accurate data on where their campaigns are running, and how they are performing. On top of this, the industry must continue to educate itself and make certification the norm to protect advertisers from fraud.",
    "Likewise, industry collaboration and a drive for greater integration with proven ad tech players is key when it comes to enabling high-growth social platforms fulfil their potential to brands. While moderation will be a continued challenge for both established and emerging social players, with the right technology in place it doesn’t have to impede brand campaigns.",
    "As with any new medium or platform, there are risks. But armed with foresight and the tools to navigate them, brands can reach new audiences, flex their creative muscles on a new channel, and do so safely in the years ahead."
  ],
  "headers": {
    "3": "User Generated Content and advertising’s evolving relationship",
    "8": "CTV and the flood of fraud",
    "13": "A collaborative approach to emerging channels"
  },
  "links": {
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "devices": "https://www.techradar.com/best/streaming-device",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "data": "https://www.techradar.com/best/best-data-loss-prevention-service"
  }
}