{
  "source": "https://www.techradar.com/news/black-widow-made-big-bucks-on-disney-plus-is-this-the-future-of-new-movies",
  "title": "Black Widow made big bucks on Disney Plus – is this the future of new movies?",
  "category": "entertainment",
  "updated": "2021-07-12T11:16:53Z",
  "author": "samuel-roberts",
  "summary": "Black Widow made more than $60 million via Premier Access purchases",
  "article": [
    "Black Widow's simultaneous launch in theaters on Disney Plus looked to be a massive success over this past weekend. As well as landing $158 million at the worldwide box office, the long-awaited movie starring Scarlett Johansson generated more than $60 million in Premier Access purchases via the streaming service.",
    "It was the highest box office launch since the pandemic began last year. Disney hasn't gotten this detailed with data about money coming in from Disney Plus before – but the fact it's touting the number at all suggests it considers the launch a success. Getting Black Widow via Premier Access costs $29.99 / £19.99 / AUD $34.99, so that number likely includes a couple of million purchases at least.",
    "According to Deadline, that $60 million figure leans heavily towards people watching in the US.",
    "Right now, this is the only Marvel movie on the calendar to get a simultaneous release via Disney Plus. Next up in the MCU is Shang-Chi and the Legend of the Ten Rings, which releases exclusively in theaters on September 3.",
    "The move to release Black Widow in theaters and on streaming services was savvy – with rising Covid-19 cases in countries like the UK, the option to watch from home is most welcome. While we all miss the theatrical experience, flexibility is key right now.",
    "For Marvel movies, though, Disney sounds pretty firm on keeping that exclusive theatrical window. “If it’s something like a Marvel movie or a Lucas [Star Wars] movie, something that’s going to have a lot of legs playing into a larger mythology, then [going to a theater] is the way that fans tend to prefer to consume those movies,” CEO Bob Chapek said back in May.",
    "Disney is committed to theatrical releases, then, but it also wants to see shorter delays between the day a movie hits cinema screens and is available to stream from home.",
    "“It doesn’t look like things are going to return to exactly how Disney released films pre-pandemic,” Chapek added, “but films will be arriving much quicker, and Disney Plus Premier Access may stick around a little longer if consumer habits change and it’s financially successful.”",
    "Well, the launch of Black Widow would appear to suggest it's been successful. If anything is an impetus to change the traditional release model, surely it's seeing these numbers.",
    "Disney has plenty of reasons to back the full return of theaters, though – in 2019, before theaters around the world closed, it claimed an enormous 38% of the domestic US box office gross.",
    "As Chapek says, the future of Premier Access depends on consumer habits as well as money – it's genuinely not the same experience to watch a blockbuster at home as it is on the big screen. But for many people, this was a comfortable alternative for Black Widow, and for Disney, selling the movie directly to consumers is no doubt great for its bottom line.",
    "It definitely feels like this model has a future, then, while we wait for the world to return to normal."
  ],
  "headers": {
    "4": "Will more Marvel movies launch on Disney Plus?"
  },
  "links": {
    "Black Widow": "https://www.techradar.com/news/how-to-watch-black-widow-online-on-disney-plus-today-from-anywhere",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "said back in May": "https://www.techradar.com/news/heres-how-disney-plus-movie-releases-will-work-as-theaters-reopen"
  }
}