{
  "source": "https://www.techradar.com/news/lgs-2021-soundbars-boast-dolby-atmos-and-hi-res-audio-for-cinematic-sound",
  "title": "LG's 2021 soundbars boast Dolby Atmos and Hi-Res Audio for cinematic sound",
  "category": "audio-visual",
  "updated": "2021-04-07T08:49:25Z",
  "author": "olivia-tambini",
  "summary": "They're designed to work perfectly with LG TVs too",
  "article": [
    "LG may have stopped making phones, but the company is storming ahead with its home cinema devices, having released more details on its 2021 soundbar lineup.",
    "All of the new soundbars come with spatial audio support, with Dolby Atmos and DTS:X, as well as Dolby Vision compatibility via 4K pass-through.",
    "Not only that, but LG's latest soundbars also support Hi-Res Audio, so they should sound great while playing back your music, as well as when you're watching films or TV shows.",
    "Most impressive is the flagship SP11RA soundbar, which comes with 7.1.4 channels, including up-firing drivers in its rear speakers – that should give you a really immersive audio performance, as well as 'true' Dolby Atmos, with sound bouncing off of your ceiling and back down to your ears. That gives the impression of sound coming at you from all angles, putting you right in the heart of the action on your screen.",
    "Many budget soundbars offer virtual versions of Atmos, which use signal processing to mimic this effect – though the real thing is usually far more convincing.",
    "The SP11RA doesn't come cheap though, costing £1,499.99. Global pricing is still to be confirmed, but that works out at around $2,000 / AU$2,700.",
    "However, there are cheaper options, with prices starting at £399.99 (about $550 / AU$720) for the 5.1-channel SP7Y, which comes with DTS Virtual:X.",
    "All of the new soundbars are designed to work seamlessly with LG's 2021 OLED Evo and QNED TVs, with support for the TVs' AI Sound Pro feature.",
    "According to LG, this allows the soundbars to take advantage of the \"superior audio processing power of AI Sound Pro\", without the need to rely on the TVs' comparitvely inferior inbuilt speakers.",
    "LG’s soundbars also now offer all of the same sound modes as its latest TVs, allowing you to easily switch between the soundbar and the TV using the TV remote.",
    "All the soundbars offer a continuation of LG's collaboration with Meridian Audio, and boast a new feature called Meridian Horizon. This technology up-mixes two channel stereo content into multichannel audio, which should provide a more immersive listening experience, no matter where you're sat in relation to the soundbar.",
    "There's also AI Room Calibration to ensure that you're getting the optimal sound regardless of how big or small (or weirdly-shaped) your living room is, with the soundbars using spatial awareness technology to measure your room's dimensions and customizing the sound accordingly.",
    "In terms of design, the new 2021 soundbars look pretty much as you'd expect, though some use recycled materials, according to the company. In fact, the SP7Y features a jersey fabric made from recycled PET (polyethylene terephthalate) bottles, which LG says leads to \"almost seven fewer plastic bottles occupying landfills\".",
    "Eco-friendly credentials aside, the new soundbars aren't as striking as the LG QP5 Éclair, which was announced during CES 2021 at the beginning of this year.",
    "As its name suggests, the soundbar looks a little like an éclair pastry, with a compact frame and rounded edges. The LG QP5 Éclair comes in at just 11.7 inches by 2.3 inches (W x H), making it an ideal choice if you're short on space – or if you simply dislike the look of traditional soundbars.",
    "Despite its small size, it comes with some mightily impressive audio specs, including upfiring tweeters for Dolby Atmos, a wireless subwoofer, and support for DTS:X. There's no word yet on how much the new soundbar will cost, but if LG can price it competitively, it could be a great alternative to other small soundbars like the Definitive Technology Studio 3D Mini."
  ],
  "headers": {
    "7": "AI sound"
  },
  "links": {
    "stopped making phones": "https://www.techradar.com/news/lg-has-officially-quit-making-phones-heres-whats-next",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "DTS:X": "https://www.techradar.com/news/dtsx-vs-dolby-atmos-vs-dts-play-fi",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "budget soundbars": "https://www.techradar.com/news/soundbar-deals",
    "OLED Evo and QNED TVs": "https://www.techradar.com/news/lg-tv-2021",
    "LG QP5 Éclair": "https://www.techradar.com/news/this-eclair-shaped-dolby-atmos-soundbar-could-be-a-satisfying-treat-for-tight-spaces",
    "Definitive Technology Studio 3D Mini": "https://www.techradar.com/news/this-mini-soundbar-packs-in-dolby-atmos-and-hi-res-audio-without-taking-over-your-living-room"
  }
}