{
  "source": "https://www.techradar.com/news/the-walking-dead-season-11-episode-8-recap-a-brutal-mid-season-finale",
  "title": "The Walking Dead season 11 episode 8 recap: a brutal mid-season finale",
  "category": "entertainment",
  "updated": "2021-10-11T18:37:43Z",
  "author": "ross-kennedy",
  "summary": "Action-packed and emotional, but overshadowed by cliff-hangers",
  "article": [
    "Spoilers follow.",
    "A storm arrives In Alexandria, battering the defenses and setting fire to the windmill. Walkers from all around are attracted to this spinning Catherine wheel and swarm Alexandria. Huddled together in Aaron’s house, the survivors hatch a plan. Carol, Kelly and Connie will repair the walls, Aaron and Magna head to put out the windmill fire while the rest remain to protect their people.",
    "We follow the action inside the house, where Judith sits with Gracie and Virgil, the latter still recovering from his wounds. They speak about Michonne and her mother’s love for Judith, which gives her hope and strength. She commits to protecting the other kids, especially Gracie who is adamant she'll be strong like the others.",
    "The walkers creep further in, reaching the house, wherein Rosita takes her moment to shine. She goes out in the heavy rain to clear the walkers from the porch and stem the tide of bodies. Despite this, their numbers swell, and the door can’t hold out much longer. Everyone gathers upstairs, until only Lydia is left to hold the door shut. Judith realizes Gracie is unaccounted for and finds her in the basement trying to grab a weapon to help. As the floor floods, Judith grabs her and they try to leave, but the walkers are already inside the house. The girls can only lock themselves in the basement.",
    "Elsewhere in Meridian, the Reapers spot horde outside of their compound, unaware Maggie’s group are among it, but noticing the strange patterns they walk in and how they keep a distance from the walls. Wells is sent out to coax the ‘rotters’ away, but the masked Negan and Maggie surprise him, stabbing him until the walkers consume him. Getting no response from Wells' walkie-talkie, Pope believes this proves Maggie is out there. Leah is horrified that he sent Wells out to die to prove his theory, but Pope rationalizes that they are at war and sometimes sacrifices need to be made.",
    "Daryl, noticing his people among the horde, takes the chance to walk around the compound, wherein he becomes a saboteur behind enemy lines. He covertly takes out a lone Reaper, opens a gate and misdirects their efforts, all while trying to open Leah’s eyes to Pope’s paranoia.",
    "As the Reaper’s explosives are unable to scatter the walkers, a secret weapon is deployed. This is a hwacha: an old Korean artillery piece that fires hundreds of rockets. Directed at the encroaching horde, Daryl finally tells Leah the truth, that they must stop the hwacha as he needs to protect Maggie’s people, his people, hidden among the walkers. He also wants her to come with him. Unsure of what to do, Leah remains lost in thought as Pope directs the artillery.",
    "During this, Maggie and Gabriel have snuck into the compound thanks to Daryl and split up. Gabriel acquires a sniper rifle to cover Maggie, while she hotwires a truck and uses it to smash through the main gate. With their main defense breached, the compound swells with walkers and the Reapers are in the streets to take them out.",
    "Pope orders the hwacha to be fired inside the compound, with Leah warning him that will kill their own people. He declares himself the voice of God and that he is not to be questioned (he’s Pope, get it?). She exchanges a look with Daryl who draws his weapons. Leah kills Pope while Daryl takes out the hwacha operator.",
    "Seeing the many deaths of her people caused by Daryl and her friends, Leah refuses to go with Daryl and radios in that it was he who killed Pope. He asks why, and she says the same reason he’s doing what he’s doing. To protect her family. Daryl escapes, and Leah, now as their de facto leader, directs the Reapers to fall back and fires the hwacha towards Maggie and Negan, who stare up as the rockets fly. Cut. The episode ends.",
    "Part A of season 11 concludes. An episode of high energy and big spectacles amid battles against the living and the dead, this mid-season finale offers no moment to catch your breath. Whether it's in the tension of Pope’s increasing violent paranoia, Leah’s internal conflict over Daryl or worrying a beloved favorite will be bitten in Alexandria, this was a relentless way to see out the season's first run.",
    "But with both cliffhangers landing mid-action, it feels terribly contrived. Little payoff seems to be this season’s theme. If the narrative continues to be teased out in small parts and offer little closure, the final season of The Walking Dead, like this episode, will ultimately leave many sour."
  ],
  "headers": {
    "5": "Battle pope",
    "10": "Verdict",
    "12": "Trivia about this episode"
  },
  "links": {}
}