{
  "source": "https://www.techradar.com/news/the-eternal-problem-driving-of-one-of-the-oldest-open-source-projects-around",
  "title": "The eternal need driving of one of the oldest open source projects around",
  "category": "computing",
  "updated": "2021-02-14T13:33:05Z",
  "author": "joel-khalili",
  "summary": "An elder of the open source movement is celebrating its 20th anniversary",
  "article": [
    "Two decades on from the launch of open source CMS Drupal, its founder Dries Buytaert is wondering precisely where the time went.",
    "In that period, the platform has weathered an overhaul to the browser market, the transition to a mobile-first web and the rise of multi-channel digital experiences, and is currently used by 1 in 30 websites worldwide for some of the most complex use cases.",
    "The technology sector is in the habit of chewing up businesses and spitting them back out, but Drupal appears to have found the formula for continued relevance and the open source ecosystem is arguably healthier than ever.",
    "According to Buytaert, the company’s longevity can be attributed to two factors: a willingness to change and a focus on a “forever problem” that open source is uniquely equipped to address.",
    "“Since the early days of the internet, people and organizations have wanted to express themselves online and to participate in the web,” he told TechRadar Pro.“And that’s still true today; people still need to manage content, they still need to publish content and they still want to be involved.”",
    "“I think about the web as a public good, as infrastructure for the world that everyone should have access to. This means it’s important to invite everyone to help build it - and that’s the beauty of open source.”",
    "Ever since the open source movement first emerged, there has been resistance in some quarters against the commercialization of products built by the community. Open source software is for everyone, they say, and shouldn’t be withheld for commercial gain.",
    "However, Buytaert believes the notion that commercialization and open source are inherently at odds with one another is a misconception.",
    "“The tension comes from the early days of open source, when it was a renegade anti-establishment movement, fighting for freedom against proprietary software,” he said. “But over the years it has become clear that commercial involvement in open source software does not mean it becomes proprietary.”",
    "This shift in attitude is perhaps best exemplified by Microsoft, which for a long time was among the most vociferous opponents of open source - and even referred to the movement as a “cancer” in 2001. Likewise, the company’s stranglehold on the software market made it the antithesis of what the open source community hoped to achieve.",
    "But the Redmond giant has had an almost total change of heart, becoming a huge proponent of and contributor to the open source cause, as demonstrated by its purchase of code repository GitHub in 2018.",
    "“Organizations slowly began to see the light and companies like Microsoft came to realize it’s a superior innovation model. Open source snuck organically into every company in the world; you’d be challenged to find a business that’s not using an open source product in some way,” Buytaert explained.",
    "“At its core, open source is just a license, but it has given rise to huge communities of collaborators. And it’s still a mystery to some people that contributors from across the world, many of whom are volunteers, can build something together that is as good as traditional software.”",
    "In the early years of Drupal, Buytaert’s focus was almost entirely on functionality and the quality of code, to his own detriment. It meant he was happy to compromise on usability and also ended up surrounding himself with like-minded developers who were unlikely to challenge his position.",
    "As the company enters its third decade, however, Drupal is operating under a totally different philosophy, with a laser focus on making the platform easier to use for content creators.",
    "“Statistically, everyone will land on a Drupal site at some point, which means we’re really building the platform for everyone on the web - and that realization is important,” Buytaert explained.",
    "This new outlook is also about preparing for what Buytaert considers the next internet revolution: the transition to an API-first web, all about web services and embracing the multi-channel experience.",
    "He says it’s no longer sufficient for a company to just build a website; now, they need a mobile application, a chatbot, voice controls for smart devices etc.",
    "“In the last ten years, we’ve transformed from just a website management solution to being a multi-channel publishing platform. That meant rethinking quite a few things, returning to the proverbial whiteboard and starting over,” he said.",
    "“From our perspective, suddenly we needed to store content in a way that makes no assumptions about how it will be output. Managing and optimizing content for all the different channels has become vital.”",
    "To help less technical content creators build these multi-channel experiences, Drupal is in the process of shifting towards a simpler UI and expanding its support for web service APIs. The firm is also working to introduce a greater level of automation to the platform to make processes such as updating websites far simpler.",
    "“This may sound like a lot of priorities to juggle, but the benefit of having so many people working on the platform is that we can divide and conquer,” said Buytaert. “In short, people should expect Drupal to become easier and easier to use.”"
  ],
  "headers": {
    "6": "A fierce rivalry, resolved",
    "13": "Retooling Drupal"
  },
  "links": {
    "CMS": "https://www.techradar.com/best/cms",
    "developers": "https://www.techradar.com/news/best-laptop-for-programming",
    "build a website": "https://www.techradar.com/news/the-best-website-builder"
  }
}