{
  "source": "https://www.techradar.com/news/google-cloud-slashes-its-cut-of-third-party-sales",
  "title": "Google Cloud slashes its cut of third-party sales",
  "category": "computing",
  "updated": "2021-09-27T13:47:33Z",
  "author": "sead-fadilpasic",
  "summary": "Follows Microsoft Azure as regulatory pressure mounts",
  "article": [
    "Google Cloud is slashing the amount of money it earns when people buy third-party software through its marketplace.",
    "As the cloud storage giant looks to increase its competitiveness against the likes of AWS and Microsoft Azure, as well as to alleviate the pressure coming in from regulators, Google has decided to cut its “take rates” from 20% down to 3%.",
    "Google Cloud has confirmed the changes were in the works, but refrained from giving any concrete numbers.",
    "“Our goal is to provide partners with the best platform and most competitive incentives in the industry,” a Google spokesperson told CNBC in an email. “We can confirm that a change to our Marketplace fee structure is in the works, and we’ll have more to share on this soon.”",
    "CNBC noted that some of the key software companies, such as Accenture, Equifax, FactSet, Freshworks, Hewlett Packard Enterprise and Xilinx, are missing from Google’s marketplace.",
    "They are, however, present on AWS, where the listing fee is about 5%. Allegedly, the AWS marketplace generates between $1 and $2 billion a year in revenue, a figure Amazon declined to comment on.",
    "This is not the first time Google has said it will be cutting down on revenue earned through its platforms. In July, the company slashed its earnings from the Play Store from 30% down to 15%, for the first $1 million in revenue a developer earns for the year.",
    "Apple reduced its earnings, in the same manner, earlier this year, following the lawsuit from Epic Games, while Microsoft lowered its revenue from the Windows app store from 30% to 12%.",
    "“Our fees are only intended to offset our operational costs of invoicing and billing customers, and operating the marketplace,” Charlotte Yarkoni, chief operating officer for cloud and artificial intelligence at Microsoft, said in a statement. “We are not trying to take a share of our partners’ revenue. Our ecosystem is a channel for us to help partners sell their solutions, not the other way around, unlike other cloud vendors.”",
    "Via: CNBC"
  ],
  "headers": {
    "4": "Keeping up with AWS"
  },
  "links": {
    "Google Cloud": "https://www.techradar.com/news/what-is-google-cloud-storage",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "earnings from the Play Store": "https://www.techradar.com/news/google-cuts-play-store-commission-fee-but-indian-app-developers-unimpressed",
    "CNBC": "https://www.cnbc.com/2021/09/26/google-lowers-its-cloud-marketplace-revenue-share-to-3percent-from-20percent.html"
  }
}