{
  "source": "https://www.techradar.com/news/google-sued-over-greatly-exaggerated-claims-about-streaming-service-stadia",
  "title": "Google sued over 'greatly exaggerated' claims about streaming service Stadia",
  "category": "gaming",
  "updated": "2021-02-19T14:48:43Z",
  "author": "vikki-blake",
  "summary": "Bungie and id Software also targeted",
  "article": [
    "Google has been hit by a class lawsuit alleging Google Stadia \"greatly exaggerated\" the quality of its streaming service.",
    "The breach-of-contract lawsuit, which was filed in October 2020 in New York, USA, says Google \"made false and misleading claims concerning the streaming quality of Stadia’s service in order to generate increased revenue for the Google Stadia division\", and insists Google violated consumer protection laws.",
    "The filing also takes issue with Bungie and id Software for what it says were \"unfair and deceptive trade practices concerning the advertised display quality and resolution of video games distributed by Google Stadia\".",
    "It further alleges that Google intentionally deleted a tweet that said Red Dead Redemption 2 could be played in 4K / 60fps even when a player didn't have a high-speed internet connection, stating \"Google understood that it was intentionally misleading consumers and wanted to assure there was no direct false statements coming from Google regarding the Stadia service\".",
    "“As a result of Google’s actions, there are hundred [sic], if not thousands, of articles and reports across the United States and the world containing misleading statements originating from Google that consumers are making purchasing decisions based upon,” the lawsuit says. “Google has done nothing to correct the false information concerning the power and resolution of the games available on Stadia and does not disclose to consumers in the Google Stadia store the resolution of each of the games available for purchase.”",
    "More than 100 games are coming to Google Stadia in 2021, the company has confirmed.",
    "The cloud streaming service has been hampered by a lack of titles in recent months, despite being lauded for its surprisingly good performance as an on-the-go gaming platform.",
    "Now, Google has confirmed the likes of FIFA 21 (March 17), Judgment (April 23) and Shantae: Half-Genie Hero Ultimate Edition (February 23) will all arrive at different points throughout the year.",
    "It was welcomed news, particularly as we recently reported that Google plans to shut down its internal development studio and divert all resources to enticing third-party developers to launch games on the platform.",
    "Via ClassAction.org, via 9to5Google."
  ],
  "headers": {
    "5": "State of Stadia"
  },
  "links": {
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "The breach-of-contract lawsuit": "https://www.classaction.org/media/shepherd-v-google-llc-et-al.pdf",
    "More than 100 games are coming to Google Stadia in 2021": "https://www.techradar.com/news/google-stadia-is-getting-more-than-100-games-this-year-including-fifa-21",
    "has confirmed": "https://community.stadia.com/t5/Stadia-Community-Blog/Next-up-on-Stadia-Adventure-explore-and-compete-in-9-games/ba-p/53677",
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "recently reported": "https://www.techradar.com/news/google-closes-game-development-studios-but-promises-stadia-will-go-on",
    "ClassAction.org": "https://www.classaction.org/blog/basically-beta-testers-class-action-alleges-google-lied-about-stadia-display-quality-resolution-to-lock-in-subscribers",
    "9to5Google.": "https://9to5google.com/2021/02/18/stadia-4k-lawsuit-class-action/"
  }
}