{
  "source": "https://www.techradar.com/news/how-much-longer-will-iphone-xr-deals-realistically-be-available",
  "title": "How much longer will it realistically be before Apple's iPhone XR gets discontinued?",
  "category": "phones",
  "updated": "2021-02-25T10:11:54Z",
  "author": "alex-hughes",
  "summary": "One of Apple's longest standing handsets can't have much longer left...surely?",
  "article": [
    "Apple makes some of the best phones around, and its latest round of handsets sits proudly near the top of our best smartphones guide. But like a lot of other phone providers, Apple doesn't hold much love for its older devices.",
    "Despite creating a massive range of incredibly popular handsets, Apple is quick to discontinue old phones once it moves on to the newest and best release, and with the iPhone 12 launch, the brand is committing to this more than ever.",
    "Both the iPhone 11 Pro and Pro Max have received the axe from Apple, and despite the fact, the popular iPhone 11 has managed to cling on, Apple's entire range prior to 2020 is now gone...with one exception.",
    "Launching way back in October 2018, everything suggests that the iPhone XR should have been discontinued now. Newer iPhones haven't made it this far, and both the iPhone SE and 11 can be bought for similar prices with newer specs.",
    "And yet, the iPhone XR is still readily available to buy in both the UK and US and shows no sign of disappearing anytime soon, even with two generations of Apple devices now exceeding it.",
    "However, while it was one of Apple's most popular launches and one of its longest-running handsets, we would be shocked to see it hang around for that much longer.",
    "Apple's next collection of handsets will be launching at the end of this year, putting the iPhone XR three generations behind. Apple continuing to stock iPhone XR deals past that point would be a big shock and, realistically...a very confusing decision.",
    "With that in mind, the longest we can see the handset being available to buy is until Apple's next launch or maybe just before that. This does still give you plenty of time to get your investment in if you've had your eyes on Apple's bargain iPhone XR.",
    "The iPhone XR is a unique handset, managing to outlast a number of other devices launched after it. And it isn't just Apple that does this, brands like Samsung and Google also have a speedy discontinuation cycle.",
    "With new devices launched every year from all of the biggest providers, it is no surprise that they aren't available for long. But for those who don't want to fork out for the latest and greatest, this can be a massive pain.",
    "Take Samsung for example. It has recently launched its latest range - the Samsung Galaxy S21. With this launch, we saw the end of the 1-year-old Samsung S20 line with a number of retailers removing it from their stores and Samsung no longer selling it directly.",
    "Apple is in a similar position, no longer stocking the previous-generation iPhone 11 Pro or Pro Max. While this shows just how popular the iPhone XR was and still is, it also shows that mobile phone deals don't hang around for long!",
    "Luckily, when a phone becomes discontinued, retailers still have stock to burn through, and refurbished offers exist. In fact, the end of a phone's life is actually the perfect time to get it with prices falling as stock runs low. If you can hold out for its end, the iPhone XR could well hit an all-time low price."
  ],
  "headers": {
    "3": "The iPhone XR is still going strong:",
    "8": "The discontinuation of phones is becoming popular:"
  },
  "links": {
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "iPhone XR deals": "https://www.techradar.com/deals/best-iphone-xr-deals",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung no longer selling it directly": "https://www.techradar.com/news/samsung-s20-deals-are-discontinued-now-the-samsung-galaxy-s21-is-here",
    "mobile phone deals": "https://www.techradar.com/deals/mobile-phone-deals"
  }
}