{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s8-trio-could-launch-with-cutting-edge-power",
  "title": "Samsung Galaxy Tab S8 trio could launch with cutting-edge power",
  "category": "tablets",
  "updated": "2021-08-19T14:18:54Z",
  "author": "james-rogerson",
  "summary": "2022's top Android chipset",
  "article": [
    "Samsung launched the Galaxy Tab S7 in August 2020, so we should be due a new model imminently, yet sources suggest the Samsung Galaxy Tab S8 range might actually not land until early 2022. That’s a shame, but it seems that Samsung might be making the most of the extra time.",
    "According to @UniverseIce (a leaker with a good track record), the Samsung Galaxy Tab S8, Galaxy Tab S8 Plus, and Galaxy Tab S8 Ultra will all have a Snapdragon 898 chipset.",
    "That’s a chipset that hasn’t even been announced yet, let alone made available on phones, but it’s expected to be the successor to the Snapdragon 888 and is likely to power many of next year’s top Android flagship phones. So if the Galaxy Tab S8 launched now it wouldn’t be able to have such a powerful chipset at its heart.",
    "The source emphasizes that none of the Samsung Galaxy Tab S8 models will use the Exynos 2200, which is expected to be the next top-end chipset built by Samsung itself. This isn’t surprising though, since Samsung’s flagship slates tend to stick with Snapdragon.",
    "As well as this chipset information, @UniverseIce also claims that the Samsung Galaxy Tab S8 range will all support 45W charging. That’s a lot faster than Samsung’s phones, which for the most part top out at 25W, but it’s no better than what was offered on the Samsung Galaxy Tab S7.",
    "With all three rumored Samsung Galaxy Tab S8 models supposedly using a top-end chipset faster than any currently found in an Android phone or tablet, they could be well positioned to compete with the mighty M1 chipset in the iPad Pro 2021 models.",
    "If they have 45W charging too then they’ll also charge much faster, with Apple’s slates topping out at 18W.",
    "Based on previously rumored specs, the Galaxy Tab S8 range could also rival the iPad Pro range for size, with the Tab S8 Ultra actually thought to be even bigger at 14.6 inches.",
    "High resolution screens and 120Hz refresh rates are likely too, as is AMOLED (at least on the pricier two models). None of the iPad Pro range use AMOLED, though the iPad Pro 12.9 (2021) would likely be able to hold its own with its Mini LED display.",
    "Still, these rumored specs suggest the Samsung Galaxy Tab S8 range will be able to rival or beat Apple’s best tablets in most hardware areas – though they might still struggle to compete when it comes to software.",
    "Via GSMArena"
  ],
  "headers": {
    "5": "Analysis: the Samsung Galaxy Tab S8 range could be the biggest iPad Pro rivals yet"
  },
  "links": {
    "Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "not land until early 2022": "https://www.techradar.com/news/samsung-galaxy-tab-s8-could-land-alongside-the-galaxy-s22-as-an-ipad-pro-rival",
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1428267332997025794",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-11-2021-review",
    "previously rumored specs": "https://www.techradar.com/news/the-samsung-tab-s8-could-come-with-a-huge-screen-and-a-giant-battery",
    "iPad Pro 12.9 (2021)": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "GSMArena": "https://www.gsmarena.com/the_upcoming_galaxy_tab_s8_slates_will_feature_snapdragon_898_chipsets_not_exynos_2200-news-50579.php"
  }
}