{
  "source": "https://www.techradar.com/news/fujifilm-x-h2-tipped-to-have-smartphone-style-computational-photography",
  "title": "Fujifilm X-H2 tipped to have smartphone-style computational photography",
  "category": "cameras",
  "updated": "2021-11-23T11:48:53Z",
  "author": "mark-wilson",
  "summary": "The sweet spot between phones and full-frame powerhouses?",
  "article": [
    "The best phone cameras are now capable of aping the photographic effects of larger cameras, thanks to computational photography. So why can't mirrorless cameras use similar tricks to beat smartphones at their own game? Well, fresh rumors suggest that could finally happen in 2022, starting with the flagship Fujifilm X-H2.",
    "Fuji Rumors has pieced together statements from Fujifilm over the past few years to arrive at its prediction for the X-H2. Collectively, these quotes suggest that we could \"see lots of computational magic being implemented in the X-H2\" that could boost the in-camera possibilities for effects like focus-stacking.",
    "While Fuji Rumors is keen to point out that this isn't based on any insider info or tip-offs, it does tally with some official quotes from Fujifilm managers. Back in April 2019, Toshihisa Iida (who's now President and Managing Director at Fujifilm Europe) said that \"in three years, AI (artificial intelligence or computational photography) will become [an] important part of photography.\"",
    "More recently, in a DPReview interview, Shinichiro Udono, Senior Manager at Fujifilm, responded to a question about computational photography by saying that \"if the sensor speed and processing speed are both very fast, then you can do a lot of things.\" While that might sound vague, it's significant for the rumored Fujifilm X-H2, because that camera is likely to have a next-generation sensor and processor, given that the current X-Trans IV series has reached the end of its life.",
    "With the Fujifilm X-H2 expected to arrive in 2022 as the company's new flagship mirrorless camera, it would certainly be a prime candidate for the introduction of new software features that leverage its next-gen sensor and processor. And with the camera expected to also come in two versions – potentially a compact, vlogging model to go alongside a professional powerhouse – it's shaping up to be one of the biggest camera launches of next year.",
    "Smartphones have used computational photography to reinvent point-and-shoot snapping, but mirrorless cameras like the rumored Fujifilm X-H2 need it for different reasons – to attract learner photographers, but also to help improve the workflows of professionals.",
    "Right now, popular effects like long exposures or focus-stacking (where several shots with different focus points are combined to create a single photo with front-to-back sharpness) require using extra ND filters or post-processing software. If some of this friction could be removed and instead done in-camera, it'd certainly be welcomed by many photographers.",
    "Part of the reason why smartphones have made such strides in computational photography is because they have small sensors, which makes multi-frame processing less processor-intensive than it would be on mirrorless cameras. But we've already seen Olympus cameras pioneer computational effects like 'Live ND' and 'Handheld High Res shot mode', and the next generation of stacked sensors and processors mean this could finally be possible on cameras with larger sensors, too.",
    "OM System (the new home of Olympus cameras) has already said that it's developing a new interchangeable lens camera that will \"improve image quality through the use of computational photographic technology.\" The gauntlet has already been laid down, and it seems the Fujifilm X-H2 may need to pick it up if it's to survive in that competitive space between smartphone cameras and full-frame models.",
    "The question, though, is whether brands like Fujifilm have the software chops needed to create innovative in-camera processing that meets the needs of more advanced photographers. Computational tricks could help narrow the huge gap that now exists in the user experiences of smartphones and mirrorless cameras, but they would need to produce results that hold up on larger screens (and in larger prints) if they're to be anything more than a side-note."
  ],
  "headers": {
    "5": "Analysis: a smart, but challenging, move for mirrorless cameras"
  },
  "links": {
    "best phone cameras": "https://www.techradar.com/news/best-cameraphone",
    "Fujifilm X-H2": "https://www.techradar.com/news/fujifilm-x-h2-release-date-news-rumors-and-what-we-want-to-see",
    "Fuji Rumors": "https://www.fujirumors.com/fujifilm-x-h2-coming-2022-with-huge-computational-photography-boost/",
    "DPReview interview": "https://www.dpreview.com/interviews/5938467980/interview-fujifilm-we-are-not-just-a-camera-company-we-are-an-imaging-company",
    "already said that it's developing a new interchangeable lens camera": "https://www.techradar.com/news/the-end-of-olympus-cameras-is-sad-but-om-systems-plans-could-soften-the-blow"
  }
}