{
  "source": "https://www.techradar.com/news/many-developers-are-still-avoiding-the-office",
  "title": "Many developers are still avoiding the office",
  "category": "computing",
  "updated": "2021-11-18T14:35:27Z",
  "author": "mayank-sharma",
  "summary": "Survey finds more developers prefer to work remotely in 2021",
  "article": [
    "Most developers are still opting to work from home despite many businesses looking to re-open offices following the worst of the pandemic, a new survey has found.",
    "As part of its annual Octoverse survey, Github polled over 40,000 developers on its platform that boasts of over 73 million users, and discovered that 2021 only helped cement the paradigm shift to remote and hybrid work environments.",
    "When asked about their work environment preferences before and after the pandemic, only about 11% of the respondents expected to go back to working in a collocated environment, translating into a 30% drop from 41% working in an office before.",
    "Respondents who were in the office either full or part-time dropped from 41% before the pandemic to a mere 10.7% now. Correspondingly, hybrid working, with team members distributed between office and home, registered a jump from 28.1% to 47.6%.",
    "Another indication of the shift in the developers’ work environment is the increase in the number of fully remote teams from 26.5% to 38.8%.",
    "“Last year, our approach to remote work reflected a lack of familiarity. We were juggling competing needs in our personal lives and at work while trying to maintain the same levels of productivity before the pandemic. During 2021, we’ve begun to evolve from merely compensating while hoping for a return to the “old normal” to truly metamorphosing our processes with the awareness of remote work needs,” sums up GitHub.",
    "Working remotely? These are the best tools for a hybrid work environment"
  ],
  "headers": {
    "3": "In with the new"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "fully remote": "https://www.techradar.com/news/why-businesses-need-to-opt-for-remote-first",
    "remote work": "https://www.techradar.com/news/best-remote-desktop-software",
    "sums up GitHub": "https://octoverse.github.com/",
    "best tools for a hybrid work environment": "https://www.techradar.com/features/the-best-tools-for-hybrid-working"
  }
}