{
  "source": "https://www.techradar.com/news/many-americans-are-planning-to-spend-their-stimulus-checks-on-bitcoin",
  "title": "Many Americans are planning to spend their stimulus checks on Bitcoin",
  "category": "computing",
  "updated": "2021-03-16T12:54:23Z",
  "author": "joel-khalili",
  "summary": "Stimulus funds are set to be funnelled into Bitcoin and stocks",
  "article": [
    "Many recipients of coronavirus stimulus checks in the United States plan to spend the money on Bitcoin, a new report claims.",
    "The Japanese investment bank Mizuho Securities surveyed a relatively small pool of 235 citizens, but found that almost 40% intend to invest the funds into stocks and/or cryptocurrencies.",
    "According to the report, Bitcoin will account for 60% of stimulus funds invested, triggering a rise of “as much as 2-3%” in the currency’s trillion-dollar market capitalization.",
    "Traditional stocks predicted to see the greatest gains as a result of the stimulus program include Visa, Mastercard, PayPal and Square, all of which operate in the payments ecosystem.",
    "The Biden administration’s new $1.9 trillion Covid relief law, rubber stamped last week, will see checks worth $1,400 delivered to all Americans whose household income amounts to less than $150,000/year (roughly 90% of households).",
    "The initiative also takes into account dependents, meaning a household of two adults and two children could receive a check worth up to $5,600.",
    "The first round of stimulus payments were delivered on Friday and will continue to be processed over the coming weeks, setting the stage for an uptick in trading activity.",
    "A cocktail of factors have combined to build enthusiasm for investing among US citizens, including the ongoing Bitcoin bull run, the recent trading frenzy among retail investors and the expectation of economic recovery linked with vaccine rollouts.",
    "Other investors, meanwhile, see Bitcoin as a hedge against the US Dollar, which some believe will sink in value as a result of the stimulus program.",
    "The Mizuho report arrived hot on the heels of a weekend in which Bitcoin vaulted beyond a valuation of $60,000, just a handful of months after breaking $20,000 for the first time.",
    "Via Yahoo! Finance"
  ],
  "headers": {
    "4": "Bitcoin trading frenzy"
  },
  "links": {
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "recent trading frenzy": "https://www.techradar.com/news/gamestop-fever-rwallstreetbets-and-the-stock-trading-frenzy-explained",
    "Yahoo! Finance": "https://finance.yahoo.com/news/nearly-10-of-the-380-billion-in-stimulus-checks-may-be-used-to-buy-bitcoin-and-stocks-survey-131009531.html?guccounter=1"
  }
}