{
  "source": "https://www.techradar.com/news/firefox-on-android-is-getting-a-super-useful-time-saver-update",
  "title": "Firefox on Android is getting a super-useful time saver update",
  "category": "computing",
  "updated": "2021-10-01T19:07:00Z",
  "author": "anthony-spadafora",
  "summary": "Easily login to all of your online accounts using Firefox saved passwords on Android",
  "article": [
    "Mozilla is making it easier to access your saved passwords from its browser as part of a new update rolling out soon for Firefox on Android.",
    "To commemorate this year's Cybersecurity Awareness month, the company has added several new features to Firefox for Android designed to help keep its user's passwords safe online.",
    "Users of Mozilla's browser will be able to seamlessly access any of the passwords saved in Firefox's password manager. This means that they'll be able to log into any of their online accounts using their Firefox saved passwords without even having to open a webpage.",
    "At the same time, users can also leverage biometric security, such as your face or fingerprint, to unlock the app and safely access the credentials for their online accounts.",
    "In addition to making it easier to access your saved passwords, now when you create an account for any app on your Android smartphone, you can also create and add a new password which will be saved directly in Firefox. From here, you can use this new password on both mobile and desktop when signing into the online account associated with it.",
    "Mozilla is also bringing the ability to autofill passwords on Android and users will be able to use any password saved in Firefox to log into their online accounts. However, if you have a Firefox account, then you'll be able to sync all of your passwords across both desktop and mobile devices.",
    "Access to Firefox's password manager on Android can be further secured by using your fingerprint or face so that no one else using your smartphone can use your saved passwords to login to your online accounts.",
    "While these new password features can help protect your online accounts, you can secure your device further by signing up for Mozilla VPN and using the company's VPN service to encrypt data sent from your smartphone."
  ],
  "headers": {
    "4": "Firefox saved passwords"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "Cybersecurity Awareness month": "https://www.techradar.com/news/why-cybersecurity-awareness-month-still-matters",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Android smartphone": "https://www.techradar.com/best/best-android-phones",
    "Firefox account": "https://www.techradar.com/how-to/how-to-change-your-mozilla-firefox-password",
    "Mozilla VPN": "https://www.techradar.com/reviews/mozilla-vpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}