{
  "source": "https://www.techradar.com/news/vmware-names-raghu-raghuram-as-new-ceo",
  "title": "VMware names Raghu Raghuram as new CEO",
  "category": "computing",
  "updated": "2021-05-14T14:57:35Z",
  "author": "mayank-sharma",
  "summary": "18-year VMware veteran Raghuram nets top job",
  "article": [
    "VMware has promoted its current chief operating officer (COO) of products and cloud services Raghu Raghuram, to serve as its next CEO.",
    "The virtualization giant has been vetting CEO candidates since the departure of Pat Gelsinger to take the top job at Intel back in January 2021.",
    "At the start of next month, Raghuram will relieve VMware CFO’s Zane Rowe, who had been serving as interim CEO following Gelsinger’s departure.",
    "According to Reuters, Raghuram, an 18-year veteran of VMWare, was asked to step up after several external candidates turned down the post. His elevation prompted the company’s other COO Sanjay Poonen, who was also vying for the top job, to depart.",
    "Stepping into the new role, Raghuram’s first major task looks to be helping VMware complete its demerger from majority owner Dell back into an independent company.",
    "Last month, Dell put into motion the process to spin off its 81% stake in VMware for a special cash dividend of $9.7 billion.",
    "The demerger was first proposed in a filing in July 2020, and is finally expected to close in Q4 2021, subject to regulatory approval.",
    "Speaking to Reuters, Raghuram expressed his desire to double down on VMware’s existing strategy of helping customers work with a choice of multiple computing providers. \"Embedded in the VMware DNA is this Switzerland mentality. What I hope to do is accelerate it even further.”",
    "Via ZDNet"
  ],
  "headers": {
    "4": "Dell de-merger"
  },
  "links": {
    "VMware": "https://www.techradar.com/news/vmware-launches-new-multi-cloud-platform-to-accelerate-app-modernization",
    "virtualization": "https://www.techradar.com/best/best-virtual-machine-software",
    "departure of Pat Gelsinger": "https://www.techradar.com/news/intel-chooses-vmwares-pat-gelsinger-to-replace-bob-swan-as-ceo",
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "spin off its 81% stake": "https://www.techradar.com/news/dell-set-to-spin-off-vmware-into-independent-company-also-selling-boomi-cloud-arm",
    "ZDNet": "https://www.zdnet.com/article/vmware-names-raghu-raghuram-as-its-new-ceo/"
  }
}