{
  "source": "https://www.techradar.com/news/samsung-predicts-strong-quarter-for-its-mobile-division-after-q4-struggles",
  "title": "Samsung predicts strong quarter for its mobile division after Q4 struggles",
  "category": "phones",
  "updated": "2021-01-28T12:31:27Z",
  "author": "steve-mccaskill",
  "summary": "Overall profit is up by a quarter but mobile division lags",
  "article": [
    "Revenues and profits at Samsung’s mobile business fell during the final quarter of 2020 as increased demand for smartphones was offset by intense competition and higher marketing expenses.",
    "Like other smartphone manufacturers, Samsung has suffered from the impact of Covid-19 on demand and supply chain. However, the final quarter is traditionally a strong one for vendors as it coincides with Christmas.",
    "Although there was a quarter-on-quarter increase in demand, the company’s IT and Mobile Communications division posted 22.34 trillion won (£15bn) in mobile revenues and profits of 2.42 trillion won (£1.6bn) for Q4 – annual declines of 10.5% and 4% respectively.",
    "Samsung expects the overall market will decline in Q1 but believes that by launching new products at all price points – including the Samsung Galaxy S21 – its own sales will increase.",
    "“The Mobile Communications Business is set to see robust sales of flagship smartphones such as the Galaxy S21 and new mass market models,” it said. “The Consumer Electronics Division will likely post stable results despite weakness in seasonal demand, underpinned by new product launches and introduction of new premium lineups.”",
    "Longer term, there is a belief that the market will recover as the year progresses.",
    "“In 2021, market demand is likely to recover to pre-COVID levels backed by gradual recovery in the economy and accelerating expansion of the 5G market,” the company added.",
    "Overall, Samsung’s profits increased by 26.4% year-on-year to 9.05 trillion Korean won (£5.9bn) as revenues reached 61.55 trillion won (£40 billion), an increase of 2.8%. This is despite ongoing difficulties in the memory chip market owing to a strong Korean Won and long-term price pressures.",
    "There is belief that 2021 will finally be the year that Samsung’s memory business turns a corner, while significant pent-up demand will also aid the company’s efforts. However, it has also warned investors that despite a bumper Q4, revenues will likely fall in Q1."
  ],
  "headers": {
    "3": "Samsung Q2 results"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}