{
  "source": "https://www.techradar.com/news/motorola-edge-20-could-be-an-impressive-phone-with-one-disappointment",
  "title": "Motorola Edge 20 could be an impressive phone with one disappointment",
  "category": "phones",
  "updated": "2021-07-28T09:18:56Z",
  "author": "james-rogerson",
  "summary": "Bizarre batteries",
  "article": [
    "While there isn’t as much hype around the Motorola Edge 20 (or Motorola Edge 2 as they might be called) range as some other phones, they could be worth getting excited about, as rumors suggest they’re landing imminently, and the latest leak points to them being impressive handsets, albeit with some flaws.",
    "TechnikNews has shared renders and specs for the Motorola Edge 20, the Motorola Edge 20 Lite and the Motorola Edge 20 Pro, and they sound like significant upgrades on the original Motorola Edge, and even the Motorola Edge Plus.",
    "Starting with the Motorola Edge 20 Pro, this apparently has a Snapdragon 870 chipset, which is a recent high-end one that sits just below the Snapdragon 888 found in many of 2021’s flagship phones.",
    "It’s also said to have 12GB of RAM, 256GB of storage, and a 6.7-inch Full HD+ screen with a 144Hz refresh rate – which is a refresh rate we’ve mainly only seen on gaming phones before now, and should make interactions feel extra smooth.",
    "The camera meanwhile apparently includes a 108MP main sensor, a 16MP ultra-wide one, and a 2MP depth sensor. It’s also said to have a 4,500mAh battery with 30W charging, and to come in Midnight Blue and Blue Vegan Leather shades, with a cost of €699 (around $825 / £595 / AU$1,125).",
    "Next up there’s the standard Motorola Edge 20, which apparently has a mid-range Snapdragon 778G chipset paired with 8GB of RAM and 128GB of storage, but the same camera and screen as the Edge 20 Pro. However, the battery is listed at just 4,000mAh (again with 30W charging).",
    "This phone will apparently come in Frosted Grey and Frosted White shades, at a cost of €499 (roughly $590 / £425 / AU$800).",
    "Finally there’s the Motorola Edge 20 Lite, which this site claims has a MediaTek Dimensity 720 5G chipset, found in the likes of the Samsung Galaxy A32 5G. The Edge 20 Lite also apparently has 8GB of RAM, 128GB of storage, and a 6.7-inch Full HD+ screen with a 90Hz refresh rate.",
    "The phone is also said to have a 108MP main camera, an 8MP ultra-wide, and a 2MP depth sensor, plus a 32MP camera on the front, and interestingly it apparently has the biggest battery of the bunch at 5,000mAh, again with 30W charging. There’s no word on the price, but expect it to be the cheapest of the three, though as ever with leaks we’d take all of this with a pinch of salt anyway.",
    "We’re used to cheap phones having big batteries, so the Motorola Edge 20 Lite having a 5,000mAh one isn’t totally surprising, but usually when you have multiple phones in the same range the battery size either stays the same or goes up with the cost, as you’ll see on the Samsung Galaxy S21 range and the iPhone 12 range for example.",
    "Here, though, it almost feels random, with the cheapest phone having the biggest battery (assuming this leak is right) and the middle model having the smallest.",
    "Strangeness aside, that could lead to the Motorola Edge 20 having disappointing life compared to its siblings – though we won’t know for sure until we’ve put them to the test. It could also be a disappointment for those who shell out on the pricey Pro model yet still get an inferior battery to the Lite.",
    "Otherwise, with the possible exception of that 2MP tertiary camera, the rumored specs taken in the context of the leaked prices seem respectable, with the 144Hz screens being potential highlights. But this odd battery arrangement could hold the pricier models back.",
    "Via GSMArena"
  ],
  "headers": {
    "9": "Analysis: the standard Edge 20 could be the weak link in terms of battery life"
  },
  "links": {
    "Motorola Edge 20": "https://www.techradar.com/news/motorola-edge-20",
    "TechnikNews": "https://www.techniknews.net/news/motorola-edge-20-serie-alle-informationen-vorab-exklusiv/",
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Motorola Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "Samsung Galaxy A32 5G": "https://www.techradar.com/news/samsung-galaxy-a32-5g-release-date-price-specs-and-5g-vs-4g-lte",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "GSMArena": "https://www.gsmarena.com/motorola_edge_20_edge_20_pro_edge_20_lite_renders_reveal_phones_in_full-news-50253.php"
  }
}