{
  "source": "https://www.techradar.com/news/dialog-agrees-dollar6bn-takeover-deal",
  "title": "Dialog agrees $6bn takeover deal",
  "category": "computing",
  "updated": "2021-02-08T15:31:10Z",
  "author": "barclay-ballard",
  "summary": "Another major acquisition of a UK technology giant",
  "article": [
    "UK-based chipmaker Dialog Semiconductor has accepted a $6 billion takeover bid from Japanese tech firm Renesas Electronics.",
    "Dialog is probably best known for supplying power management circuits and other elements for use in Apple’s iPhone range.",
    "The Renesas offer is an all-cash deal, working out at €67.50 per share – a premium of about 20% compared with Dialog’s closing price at the end of last week.",
    "“For several years, we have successfully executed on a diversification strategy that positions Dialog for high-growth,” Dr Jalal Bagherli, CEO of Dialog, said. “We have built a strong foundation of high-performance analog and power efficient mixed-signal expertise, extended our product portfolio and applied our technologies into markets including 5G, wearables, automotive, smart home, connected medical and industrial IoT. This compelling platform – combined with Renesas’ leading embedded compute, analog and power portfolio – creates even greater growth opportunities in today’s increasingly connected world. The Dialog team is excited to join forces with Renesas. The combined company will be in an even stronger position to provide innovative products for these markets, building on Renesas’ extensive sales, distribution and customer support capabilities.”",
    "Renesas was not the only party interested in acquiring Dialog. According to reports, the Franco-Italian firm STMicroelectronics was among the other companies interested in a takeover, but Dialog chose Renesas because its culture, reputation, technology and market reach were better fits.",
    "The acquisition represents another example of consolidation in the semiconductor space. With technology only likely to grow in prominence across all aspects of our daily lives, larger tech firms are looking to buy up successful smaller players in an effort to dominate the market.",
    "Perhaps the highest profile example of this is Nvidia’s proposed takeover of another British semiconductor firm, Arm. That deal is currently being investigated by market regulators in the UK, the US, China and the EU. It will be interesting to see if Renesas’s purchase of Dialog comes under similar levels of scrutiny.",
    "Via Bloomberg"
  ],
  "headers": {
    "4": "Subject to regulator approval"
  },
  "links": {
    "iPhone": "https://www.techradar.com/reviews/iphone-x-review",
    "said": "https://www.renesas.com/us/en/about/press-room/renesas-and-dialog-semiconductor-join-forces-advance-global-leadership-embedded-solutions",
    "currently being investigated": "https://www.techradar.com/news/eu-will-investigate-nvidia-takeover-of-arm",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-02-08/renesas-confirms-talks-to-buy-apple-supplier-dialog-semi?srnd=technology-vp"
  }
}