{
  "source": "https://www.techradar.com/news/can-house-of-the-dragon-break-the-game-of-thrones-finale-curse",
  "title": "Can House of the Dragon break the Game of Thrones finale curse?",
  "category": "entertainment",
  "updated": "2021-10-06T10:25:01Z",
  "author": "samuel-roberts",
  "summary": "What the House of the Dragon trailer tells us",
  "article": [
    "Things are off to a good start for HBO's House of the Dragon, following the Game of Thrones prequel's first trailer release this week. The minute-long teaser has been viewed more than 6 million times, while fewer than 10% of its user votes on YouTube are negative. That's pretty promising, ahead of its 2022 release.",
    "Still, if you head into the comments – genuinely never a good idea on the internet – a familiar pattern emerges. Among the jokes about Targaryens, you'll predictably find plenty of people pointing out how bad the finale to Game of Thrones was.",
    "\"Ok, just tell me: the two guys who killed the last season haven't touched this show and I'll watch it,\" says one.",
    "\"The book's arc they're going to adapt is finished already. This time, there is no excuses [sic],\" says another.",
    "It's fairly brutal stuff – and no doubt something HBO is prepared to meet head on. This show, of course, comes from an entirely different set of creators to Game of Thrones. David Benioff and DB Weiss have a big deal with Netflix, and recently produced the well-received series The Chair starring Sandra Oh. They have no involvement with this show.",
    "Ryan J Condal, who co-created the seemingly ignored sci-fi series Colony starring Lost's Josh Holloway, is behind this show, sharing a creator credit with author George RR Martin (who has still not finished the book The Winds of Winter). It's hard not to see the baggage of the prior show carrying over in some form, but being set 200 years before the events of the series with just a single existing book to adapt arguably lets them have a clean break.",
    "They're going to need it.",
    "There was no doubt that HBO was going to continue to mine Game of Thrones for new series after the main show ended. But it hasn't taken the process lightly, going as far as shooting a pilot for a Jane Goldman-created show known as Bloodmoon that would've starred Naomi Watts, among others, before scrapping it.",
    "House of the Dragon was created in the wake of that.",
    "The continuation of Game of Thrones feels very un-HBO in some ways – the cable network wasn't traditionally known for follow-up series or prequels. The current age of streaming, though, has changed the priorities of major entertainment companies. HBO has brought back Sex and the City for a new series, following a couple of movies, while Deadwood got a follow-up movie a few years back. The Sopranos prequel film The Many Saints of Newark has renewed interest in that show.",
    "The grab for consumer dollars means that intellectual properties are more valuable than ever – it's why Disney is using Star Wars and Marvel to get people excited about Disney Plus. Game of Thrones was arguably too big to leave alone, with 19.4 million people tuning into the finale on the night it aired in the US. It makes sense to keep franchising a fantasy series like this that spans so many in-universe years, and has so many stories that can potentially be told.",
    "The fact is, by the time House of the Dragon arrives, it will have been three years since the Game of Thrones finale. Clearly, people haven't forgotten how much they hated that final episode – but at least the feeling won't be as raw. People might be more prepared to give this a chance.",
    "There's also no doubt that the quality of the cast here is a reason to check it out. The likes of Matt Smith, Paddy Considine and Sonoya Mizuno should offer this show a very different energy – and the idea of depicting Westeros in such a different timeframe has a lot of visual potential.",
    "Ultimately, we'll know pretty quickly whether the latent interest in Game of Thrones is enough to support another show of this scale. Our guess is, there will be as long as it doesn't feel unnecessary – but we're not keen to see a whole universe of series around Game of Thrones as we're getting with Star Wars over the next couple of years.",
    "One might be enough. And if House of the Dragon can renew our investment in this fictional universe – which is a massive challenge at this stage – perhaps we'll regain our appetite to see more of it."
  ],
  "headers": {
    "7": "Should we let our Game of Thrones baggage go?"
  },
  "links": {
    "House of the Dragon": "https://www.techradar.com/news/house-of-the-dragon",
    "how bad the finale to Game of Thrones was": "https://www.techradar.com/news/game-of-thrones-is-10-years-old-and-now-its-dead-to-us"
  }
}