{
  "source": "https://www.techradar.com/news/windows-vpn-services-could-come-under-serious-attack-soon",
  "title": "Windows VPN services could face serious security worries soon",
  "category": "computing",
  "updated": "2021-10-20T14:17:33Z",
  "author": "mayank-sharma",
  "summary": "Don’t bother us with privilege escalation vulnerabilities, notes the exploit broker",
  "article": [
    "Popular exploit broker platform Zerodium has tweeted its desire to acquire zero-day exploits that capitalize on vulnerabilities in three widely-used virtual private network (VPN) service providers.",
    "By its own admission Zerodium is currently interested in bugs that affect Windows clients for NordVPN, ExpressVPN, and SurfShark VPN services.",
    "Reporting on the development, BleepingComputer says that the three companies manage more than 11000 servers spread over tens of countries, and collectively serve at least 17 millions users around the world.",
    "Zerodium is an above-board platform whose customer base is composed of government institutions, primarily from Europe and North America, that are willing to shell huge amounts of money to get their hands on advanced zero-day exploits and cybersecurity research.",
    "In its tweet, the popular premium vulnerability broker said it was looking for vulnerabilities that can be used to develop “information disclosure, IP address leak, or remote code execution” exploits.",
    "Interestingly, it also clarified that it wasn’t in the market for a local privilege escalation vulnerability.",
    "While the platform hasn’t clarified its intentions behind seeking zero-days in the three VPN services, BleepingComputer fathoms that it could be at the behest of one of its government customers that needs a way to identify cybercriminal activity hiding behind VPN services.",
    "Threat actors are known to hide behind the safeguards provided by VPN, and both NordVPN and SurfShark have reportedly been used by threat actors in the past.",
    "None of the three VPN providers have yet issued a statement on Zerodium’s post.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "What’s cooking?"
  },
  "links": {
    "tweeted": "https://twitter.com/Zerodium/status/1450528730678444038",
    "VPN": "https://www.techradar.com/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "SurfShark VPN": "https://www.techradar.com/reviews/surfshark",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/zerodium-wants-zero-day-exploits-for-windows-vpn-clients/"
  }
}