{
  "source": "https://www.techradar.com/news/hp-reckons-it-has-the-answer-to-your-hybrid-working-problems",
  "title": "HP reckons it has the answer to all your hybrid working problems",
  "category": "computing",
  "updated": "2021-10-19T12:06:07Z",
  "author": "sead-fadilpasic",
  "summary": "New range of HP tools aims to improve the remote working model",
  "article": [
    "Remote working has opened up numerous opportunities, but also presented challenges, as employees and decision-makers struggled to find the right technologies to enable solid communication and tight collaboration in a virtual environment.",
    "The pandemic may be on its way out, but hybrid working isn’t going anywhere, and HP has launched a new set of tools that it claims greatly improve remote working and collaboration, all while being secure, simple to install, and easy to run.",
    "What’s more, the new HP Presence tools provide business leaders with much-needed real-time analytics.",
    "HP Presence is a bundle of both hardware and software, and it includes the Mini Conferencing PC (a high-powered device that comes with HP Wolf Security for Business, bundled); Control and Control Plus (intelligent room controls, AI-powered audio from Bang&Olufsen); See 4K AI Camera (an AI-powered camera with an extra focus on data privacy); Audio Video Bar; Hub and the Talk Satellite Microphones, making sure everyone in the conference call can be heard loud and clear).",
    "HP says it paid close attention to making sure the conference call can be started quickly and be seen clearly.",
    "To that end, it designed features such as HP Meeting Ready, which automatically wakes up the room control and brings the camera to life, when someone walks in.",
    "HP Speaker Frame, a picture-in-picture mode, spotlights in-room speakers, while HP Auto Frame puts meeting room attendees into perspective by framing out white space for a better conferencing experience for remote attendees. HP Speaker Tracking, on the other hand, allows speakers to move around the room while keeping them in frame.",
    "To make sure the new offering is affordable to as may businesses as possible, HP has created three scalable kits - for small spaces, medium spaces, and large ones. Every kit includes an HP Presence Mini PC, an HP Presence Control Center, colour-coded cables, and mounting equipment, but differs on things like the AI camera, or the AI video bar.",
    "Pricing is yet to be announced, and most of the tech should be generally available by February 2022."
  ],
  "headers": {
    "4": "Improving conference calls"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}