{
  "source": "https://www.techradar.com/news/what-is-thread-and-why-do-your-smart-home-gadgets-need-it",
  "title": "What is Thread and why do your smart home gadgets need it?",
  "category": "smart-home",
  "updated": "2021-01-25T14:22:26Z",
  "author": "carrie-ann-skinner",
  "summary": "Faster, stronger connections and less energy consumption, what’s not to love?",
  "article": [
    "When Apple launched the HomePod Mini late last year, a lot was made of the fact the smart speaker supported Thread. Until the Apple launch, Thread was a little-known smart home technology that certainly wasn’t a phrase on everybody’s lips.",
    "Now, it’s become a term that’s being heard more and more when it comes to smart home devices. But just what is Thread and why do smart home gadgets need it? Here’s everything you need to know.",
    "Thread is a wireless standard for smart home devices that just like Zigbee and Z-wave, lets the smart home devices work together.",
    "Unlike Zigbee and Z-wave, Thread devices create a mesh network with each gadget acting as an access point or node and communicating with each other rather than only communicating with the main access point. The more Thread-enabled devices you install in your home, the bigger and stronger the mesh network gets. This also means there’s no need for a third-party hub or service, whether that’s Alexa, IFTTT or Siri, to allow different devices to work together.",
    "Thread is different to existing protocols in several ways.",
    "Not-for-profit organization the Thread Group developed the technology. The group is made up of engineers and developers from big names in smart home including Apple, Amazon and Google as well LG and Samsung.",
    "You’ll need a smart home device that doubles as a Thread Border router so the different devices can talk to each other. The HomePod Mini is the first smart home device that offers this functionality. However, more are expected to become available throughout 2021. Thread-supported devices can be paired with the border router in seconds.",
    "There are currently only a handful of devices that support Thread but the list is growing. These include:",
    "Both Nanoleaf and Eve have committed to launching more Thread-enabled devices in 2021.",
    "Products that support the technology will feature a ‘Built on Thread’ or ‘Thread Certified Component’ badge. These badges indicate the products have been rigorously tested.",
    "The Thread Group says more than 250 devices can be connected together using the technology.",
    "Thread uses AES encryption (the same protocol used by Zigbee and Z-Wave) combined with banking-standard cryptology. This means each device creates a secure connection with the others, which the Thread Group says is harder to hack."
  ],
  "headers": {
    "2": "What is Thread?",
    "4": "How is Thread different is existing protocols?",
    "5": "Who created Thread?",
    "6": "What do I need to use Thread?",
    "7": "What devices support Thread?",
    "9": "How do I know if a smart home device supports Thread?",
    "10": "How many Thread devices can I connect at once?",
    "11": "Is Thread secure?"
  },
  "links": {
    "HomePod Mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "Thread Group": "https://www.threadgroup.org/",
    "Eve have committed to launching more Thread-enabled devices": "https://www.techradar.com/news/eve-weather-with-thread-and-homekit-support-revealed-in-fcc-filing"
  }
}