{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-might-finally-have-a-launch-date-in-january",
  "title": "Samsung Galaxy S21 FE might finally have a launch date – in January",
  "category": "phones",
  "updated": "2021-10-14T23:14:00Z",
  "author": "david-lumb",
  "summary": "Possible new gear for the new year",
  "article": [
    "It’s still unclear when the Samsung Galaxy S21 FE may arrive, with suspicions divided between next week and January, but a new leak leans toward the latter – and even suggests a launch date of January 11.",
    "We’ve heard conflicting reports about the Galaxy S21 FE’s potential release, but this is the first date we’ve heard, coming courtesy of leaker Jon Prosser, who tweeted a launch date of January 11, 2022. Notable leaker Max Weinbach affirmed these findings in a reply to Prosser’s tweet.",
    "Prosser asserted in a follow-up tweet that the S21 FE had been delayed yet again, supporting the notion that Samsung had planned the phone’s release (probably around September when the Samsung Galaxy S20 FE had been released in 2020) but that issues had pushed the launch back. Rumors have suggested supply and production difficulties had caused the prior delays, and possibly this one as well.",
    "Samsung has not yet confirmed that there is a Galaxy S21 FE headed for the market, but enough rumors have asserted its existence that we believed one was coming. If it was going to arrive at the same time of year as its predecessor, we would have expected a September launch, but rumors of its delay reached us before then – and pinned the blame on the global chipset shortage.",
    "It’s the same vague reason we suspected the Samsung Galaxy Note 21 was formally cancelled. The Galaxy S21 FE was even reportedly cancelled as well according to a Samsung official, with S21 FE support pages dropping from the internet to boot. Another rumor suggested the phone would finally come in October, and a Samsung Unpacked event announced for October 20 raised suspicions that the S21 FE would finally launch then.",
    "But yet another rumor reset the supposed launch window for January, perhaps even setting the S21 FE in the early-year release slot typically reserved for the year’s flagship phones (in this case, the Samsung Galaxy S22). Prosser’s tweet at least gives us a date to expect, though it’s unclear if the S21 FE will replace the S22 or if we’ll see both phones share the stage."
  ],
  "headers": {
    "3": "Analysis: so why isn’t the S21 FE here yet?"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "tweeted": "https://twitter.com/jon_prosser/status/1448631361905086468",
    "reply": "https://twitter.com/MaxWinebach/status/1448640308506333189",
    "tweet": "https://twitter.com/jon_prosser/status/1448637524268695554",
    "cancelled": "https://www.techradar.com/news/apparently-even-samsung-doesnt-know-if-the-galaxy-s21-fe-is-coming-out",
    "dropping": "https://www.techradar.com/news/samsung-galaxy-s21-fe-is-almost-certainly-canceled-as-samsung-removes-support-page",
    "suggested": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-may-be-way-way-later-than-we-expected",
    "announced": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-land-on-october-20-one-day-after-the-pixel-6",
    "reset": "https://www.techradar.com/news/samsung-galaxy-s22-may-be-delayed-with-galaxy-s21-fe-taking-its-place-in-january"
  }
}