{
  "source": "https://www.techradar.com/news/success-in-digital-commerce-innovate-then-optimize",
  "title": "Success in digital commerce: Innovate, then optimize",
  "category": "computing",
  "updated": "2021-10-21T10:22:57Z",
  "author": "paul-lynch",
  "summary": "The difference between innovation and optimization",
  "article": [
    "Brands have needed to innovate over the last 18 months. The impact from the pandemic meant retailers had to adapt quickly. Some high street stores had to close, meaning many customers turned to the digital world for their shopping. It was inevitable that new and updated services were needed, and fast. However, there’s only a brief window for innovation. Once the pioneers master the art, others cotton on and provide similar services, where it becomes an industry standard. Thankfully, innovation isn’t where it stops. Brands can put their own creative spin on it once the technology develops and the processes can be optimized over time.",
    "But who is innovating and bringing completely fresh ideas to market, and who is adopting and optimizing these processes for their own customers? The truth is, commerce is a fast-paced industry, and consumers don’t care much for who was first – but who is better.",
    "The drivers behind optimization and innovation are the same; you want happy customers, happy co-workers, and a better bottom line.",
    "Tapping into the wisdom of the crowd and making continuous, small optimizations is the sure-fire way to please many of your customers. From convenience to community, a solid feedback loop keeps a finger on the pulse of changing customer expectations. Whilst innovation offers customers the unexpected. It brings radically new experiences that may only impact a small group of customers at first, but if done correctly that group will grow often through word of mouth alone.",
    "There’s more certainty in optimization, as you’re fine-tuning something that is already working with your customer or proven in your industry. Tools to measure these efforts are usually more mature, making it easier to validate your work and secure a budget. With innovation, you’re hoping that one of the 15 experiments you run pays off. This typically means working with leaner tools that let you get prototypes up and running quickly and then making larger investments to scale and optimization comes after the prototype has proven itself.",
    "There’s also a lot of gratification in seeing your well-oiled machine steadily become more efficient. With nearly unending possibilities to automate and tweak the system, optimization is a playground for data lovers. Innovation, being more driven by gut feeling, is likely going to draw more emotional investment. This is important because if you’re doing something brand new, you’re going to have to be able to advocate for it and get others on board and excited.",
    "While innovation and optimization can happen in any area of commerce, they have more recently been most associated with the digital side of business. As a result, many eCommerce teams find themselves in a hybrid position.",
    "The digital commerce department has the most detailed view of the customer, with insights into purchasing behavior and engagement trends that offer a wealth of opportunities for optimization. At the same time, it’s often the department with the most access to cutting-edge tools and technologies, which sets the stage for innovation. Ecommerce teams need to be at the forefront of change, urging wider teams to innovate and optimize to provide the best service possible to customers.",
    "New digital experiences are in high demand, and brands cannot afford to ignore it. 85% of companies surveyed in our research said that their customers are demanding more innovation. Customer expectations for new and engaging online experiences will remain high, and brands must cater for their ever-growing needs.",
    "Smaller eCommerce teams have a huge task on their hands when they need to provide new channels, personalization, rich product information, multiple payment methods, a widening range of shipping and return options, 24/7 support, and a seamless experience that connects it all. To be successful, new technologies need to be implemented to ensure they are catered for new eCommerce expectations. Yet all too often, brands are using technology that was built years ago and not suited to current business needs. Optimization and innovation work together in retail. Those that don’t invest and continue to improve will be left by the wayside."
  ],
  "headers": {
    "2": "Heading in the same direction",
    "6": "Teamwork paves the way",
    "8": "Don’t get left behind"
  },
  "links": {
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "customer": "https://www.techradar.com/best/cx-tools",
    "eCommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "payment": "https://www.techradar.com/best/best-payment-gateways"
  }
}