{
  "source": "https://www.techradar.com/news/how-to-watch-evangelion-30101-thrice-upon-a-time-stream-online",
  "title": "How to watch Evangelion: 3.0+1.01 Thrice Upon a Time - stream online now",
  "category": "computing",
  "updated": "2021-08-16T17:14:18Z",
  "author": "daniel-pateman",
  "summary": "The final chapter of the anime tetralogy is now available to watch",
  "article": [
    "You don't actually need a maths degree to enjoy Evangelion: 3.0+1.01 Thrice Upon a Time, the re-released version of the fourth and purportedly final chapter in the “Rebuild of Evangelion” film series. It’s a pop culture phenomenon in Japan, and viewers worldwide can now stream the thrilling conclusion from August 13. Read on as we explain how to watch Evangelion: 3.0+1.01 Thrice Upon a Time with a subscription to Amazon Prime Video.",
    "Part of the Neon Genesis Evangelion franchise originated by writer and chief director Hideaki Anno, the films began by “rebuilding\" the plot of the TV series.",
    "15 years after an apocalyptic event called the 'Second Impact' wiped out half the human population, the city of Tokyo-3 finds itself under attack by alien beings called Angels. It’s left to young teen Shinji to protect humanity by piloting an Evangelion – a humanoid-mecha hybrid – to stop the impending threat.",
    "Production delays meant a 9-year hiatus between the release of part three and the fourth instalment. It finally debuted in Japan to much acclaim in March, before being re-released in June with extra material as Evangelion: 3.0+1.01 Thrice Upon a Time.",
    "We begin the final film in Paris with Misato and her anti-NERV group tasked with saving the city in just 12 minutes. Meanwhile, viewers are reunited with Shinji (Megumi Ogata), Rei (Megumi Hayashibara) and Asuka (Yūko Miyamura) as they desperately seek shelter on the outskirts of Tokyo-3.",
    "The most accessible film in this mega franchise promises to thrill anime fans and newbies alike. So, read on as we explain how to watch Evangelion: 3.0+1.01 Thrice Upon a Time online with Amazon Prime Video right now.",
    "If you're a Prime Video subscriber but find yourself stuck abroad in a country where the service isn't available or you can't log-in as usual, that's probably down to geo-blocking restrictions.",
    "Thankfully, help is at hand. Downloading a VPN will allow you to watch Evangelion: 3.0+1.01 Thrice Upon a Time no matter where you are, simply by changing your IP address to one that's back in your country of residence. Here's how to get started with this essential bit of streaming software.",
    "More like this:"
  ],
  "headers": {
    "6": "How to watch Evangelion: 3.0+1.01 Thrice Upon a Time from abroad"
  },
  "links": {
    "Amazon Prime Video": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FEVANGELION-1-01-THRICE-UPON-TIME%2Fdp%2FB098VW137N%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3958497444733566500-20",
    "anime": "https://www.techradar.com/best/best-anime",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}