{
  "source": "https://www.techradar.com/news/over-half-of-workers-would-rather-quit-than-go-back-to-the-office",
  "title": "Over half of workers 'would rather quit' than go back to the office",
  "category": "computing",
  "updated": "2021-10-12T12:13:27Z",
  "author": "sead-fadilpasic",
  "summary": "Losing the ability to telecommute would see many quit on the spot",
  "article": [
    "More than half of hybrid workers (52%) say they would rather quit their jobs than be forced to go back to the office full time, new research has found.",
    "A report from Momentive (formerly SurveyMonkey), found that flexible and hybrid working have now become core benefits offered to many workers (34% and 44%, respectively).",
    "Polling more than 2,000 UK adults for the report, Momentive has found that 40% of workers are hesitant about returning to the office full time, rising “drastically” to 60% for workers who’ve been used to working on a hybrid or remote basis. One in ten (11%) said they would quit on the spot if their ability to video conference was taken away.",
    "At the same time, somne employees believe that working remotely also means being at a disadvantage compared to their in-office peers. More than a fifth (21%) of employees report having “proximity bias” - a worry that not being physically close to a boss or coworker means missing out on different work opportunities.",
    "This is particularly expressed among the younger workforce (a third of 18- to 24-year-olds). What’s more, a quarter (25%) also admitted they don’t ask their remote colleagues for advice as much as they did their physically present partners.",
    "But the market is highly competitive, and today’s businesses need to work extra hard to attract and retain talented people.",
    "In that vein, Momentive sought to understand the benefits employees would like to see offered in the future and found that a four-day workweek (42%) and unlimited holiday (41%) were the two most in-demand benefits. And with remote working being the norm nowadays, it’s not as surprising to learn that mental health support, as a benefit, rose in popularity, from 17% just before the pandemic, to 33% today.",
    "To motivate employees to return to the office, businesses should do these three things, the report says: mandated vaccinations for all employees (35%), providing larger office space, to help with social distancing (32%), or demanding employees to bring a negative Covid-19 test before entering the office (30%).",
    "“Employees are more empowered than ever, and companies need to offer what matters to them or risk losing great talent,” says Zander Lurie, CEO of Momentive. “Creating a work culture that your employees want to be a part of every day requires listening. Feedback helps business leaders tap into what workers need to be successful.”"
  ],
  "headers": {
    "5": "Benefits to retain talent"
  },
  "links": {
    "hybrid workers": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "video conference": "https://www.techradar.com/best/best-video-conferencing-software"
  }
}