{
  "source": "https://www.techradar.com/news/9-things-you-may-not-know-about-electric-bikes",
  "title": "9 things you may not know about electric bikes",
  "category": "fitness",
  "updated": "2021-07-12T16:30:19Z",
  "author": "jamie-carter",
  "summary": "Everyone wants an e-bike, but read this before you buy",
  "article": [
    "Are electric bikes ‘cheating’? The end of lockdowns has seen a spike in demand for electric bikes all across the world. Safe, convenient, sustainable and a lot healthier than you might think, e-bikes are on a meteoric rise, but before you invest in one of the best electric bikes here are some things you might not know about these darlings of urban mobility.",
    "Like loo rolls and telescopes, electric bikes were one of the coronavirus pandemic’s surprising benefactors. Partially caused by commuters wanting to avoid public transport post-lockdown, in the US sales of electric bikes jumped by 85% – about 600,000 electric bikes – in 2020 alone. That’s one sold every 52 seconds. That spike won’t continue indefinitely, but with three million electric bikes sold in 2019 this $40 billion market is increasing about 25% per year, with some predicting it will reach $118 billion in 2030. In Europe about 17% of all bike sales are electric, but that rises to 50% in the Netherlands and Germany.",
    "An electric bike is one with an electric motor and a battery that propels the bike. That’s the simplest definition, but do you want a small propulsion motor to assist you as you pedal, or a power application motor and a throttle so you can ride your electric bike a bit like a moped?",
    "Between those two extremes – the former called ‘pedelecs’ and the latter ‘throttle on demand’ – dozens of options to suit every kind of rider and budget. Pedelecs typically have an electric motor in the rear wheel hub while high-powered electric bikes often have the motor on the cranks or on the front wheel hub.",
    "Although the tendency for owners of electric bikes to ride at faster speeds and for longer tends to mean more wear and tear, and so more servicing costs, the main cost of owning one is recharging its battery. However, it’s a relative pittance. According to Raleigh it takes between four and six hours to charge a 300Wh, 400Wh or 500Wh battery – the most common sizes found on electric bikes – which equates to no more than $0.13 / £0.10 / AU$17 worth of electricity per recharge. So after the initial purchase they’re practically free.",
    "While you can get electric bikes with batteries as large as 900Wh and motors as powerful as 1,000W, exactly what constitutes an electric bike is defined by government regulations – and they differ drastically.",
    "In the US it differs by state, but at a federal level an electric bike is defined as a two or three-wheeled vehicle with fully operable pedals and an electric motor of less than 750W with a maximum speed of less than 20 mph.",
    "Meanwhile, the UK government defines an electric bike as an ‘electrically assisted pedal cycle’ (EAPC) that must have pedals that can be used to propel it. Its electric motor must have a maximum power output of 250Wh and a top speed of 15.5mph/25kmph, but you don’t need a licence to ride one and it does not need to be registered, taxed or insured.",
    "Electric bikes are not cheating! They’re mostly about battery-powered pedal-assist, not pedal-replace. Some electric bikes feature battery-powered assist via pedalling, while others have a throttle to give you an on-demand boost.",
    "Either way, the point of an electric bike isn’t to ‘cheat’ at cycling. Instead, with a little extra power under your feet it encourages you to tackle the kinds of rides you’d otherwise not venture out on.",
    "They can help new riders attempt rides they normally wouldn’t, whether that’s across town, uphill or across rough tracks. For older riders for whom the hills may gradually be getting tougher, an electric bike means they can keep much more active for much longer.",
    "Can you get a good workout on an electric bike? If you think they’re a lazy person’s option then think again. A study published in May 2021 revealed that a group of cyclists who had just purchased an electric bike were able to complete a three-mile bike ride – simulating a typical commute – faster and with less effort when compared to regular bikes. Crucially, from read-outs on their heart rate and oxygen consumption (V̇O2) also found that the same e-cyclists got a good ‘moderate intensity’ workout, suggesting that e-bike use may still benefit health-related fitness. Other studies indicate that e-cyclists burn only about 20% fewer calories than those on regular bikes. Put simply, you’ll go faster, ride longer and overall you’ll expend just as much effort as on a regular bike.",
    "Electric bikes are increasingly being seen as a vital tool in fighting global climate targets. Though they seem like a novelty in comparison to macro-scale projects like carbon capture, high-speed transit systems and retrofitting office buildings, they’re one of several small-scale and low-cost modular innovations that can, according to a study in Science, outperform larger-scale alternatives. Electric bikes were considered alongside solar panels, electricity storage batteries, heat pumps, smart thermostats and shared taxis – they’re at the cutting edge of attempts to reduce both air pollution in cities and carbon footprints.",
    "How far can you ride on a single charge? So-called ‘range anxiety’ isn’t as serious as with electric cars. After all, if the battery runs out you just cycle using your legs, which for a cyclist isn’t exactly an horrific scenario. The biggest determining factors for the range of an electric bike is, of course, its motor, its battery and how much you use pedal assistance.",
    "Most modern electric bikes use lithium-ion batteries and battery capacity is measured in Watt hours (Wh). A 300Wh battery is rated to go for between 15 miles/25km and 50 miles/80km on a single charge on average use. For a step-up 400Wh battery it’s between 25 miles/40km and 62 miles/100km. That’s for smooth terrain; reduce by around a half if using steep or off-road trails.",
    "It’s not an exact science, so the best advice is to get the biggest and best you can afford to reduce your range anxiety and time spent recharging.",
    "Can you think of a product that doesn’t get better with every new iteration? The same thing will happen to electric bikes, partly because the first generation don’t offer the best possible power delivery, efficiency or range.",
    "In fact, most electric bikes use pedelec motors originally developed for power steering in cars and other devices. So while electric cars currently have an efficiency of about 90%, for electric bikes it’s about 70%. So expect newer, smaller and lighter motors in future that go faster and for longer. Gears, cooling, power electronics and the battery will also improve greatly in the next few years and features like immobilisers and GPS racking will go mainstream."
  ],
  "headers": {
    "1": "1. The market for electric bikes is booming",
    "2": "2. There are different kinds of electric bike",
    "4": "3. Electric bikes don't cost much to run",
    "5": "4. What’s classed as an e-bike differs by country",
    "8": "5. You still have to pedal, just less",
    "11": "6. Electric bikes are good for you",
    "12": "7. They’re essential to a low-carbon future",
    "13": "8. ‘Range anxiety’ isn’t really a thing",
    "16": "9. Electric bikes will improve"
  },
  "links": {
    "the best electric bikes": "https://www.techradar.com/best/electric-bike",
    "600,000": "https://electrek.co/2020/10/28/the-us-is-doubling-e-bike-imports-this-year-to-half-a-million-and-even-that-isnt-enough/",
    "predicting": "https://www.alliedmarketresearch.com/electric-bikes-market",
    "17% of all bike sales are electric": "https://cyclingindustry.news/electric-bike-sales-now-17-of-all-eu-cycle-sales-growth-rate-accellerating/",
    "According to Raleigh": "https://www.raleigh.co.uk/gb/en/electric-bike-knowledge/electric-bike-running-costs/",
    "UK government defines an electric bike": "https://www.gov.uk/electric-bike-rules",
    "Electric bikes are not cheating": "https://www.techradar.com/news/no-of-course-electric-bikes-arent-cheating",
    "published": "https://journals.lww.com/acsm-tj/Fulltext/2021/04150/Metabolic_and_Cardiovascular_Responses_to_a.5.aspx",
    "according to a study in Science": "https://science.sciencemag.org/content/368/6486/36/tab-article-info"
  }
}