{
  "source": "https://www.techradar.com/news/inside-luca-the-studio-ghibli-inspired-italian-pixar-film-made-entirely-from-home",
  "title": "Inside Luca, the Studio Ghibli-inspired Italian Pixar film made entirely from home",
  "category": "entertainment",
  "updated": "2021-06-19T13:00:00Z",
  "author": "tom-power",
  "summary": "“At the beginning, we didn’t know if we could make this movie”",
  "article": [
    "How do you make universally loved animated movies? For Pixar, the process (on the surface at least) appears to be simple: craft a highly relatable story set in a fantasy world, add plenty of moments that will make audiences laugh and cry, and create the most beautiful animation possible.",
    "Of course, it’s more complicated than that – but what happens when an already-complex process is made more difficult by an unexpected global event?",
    "For the team behind Luca, Pixar’s latest film, the Covid-19 pandemic was that event. Luca was no longer just Pixar’s 26th animated feature; it became the studio’s first-ever project to be made entirely from home.",
    "Ahead of Luca’s June 18 release, TechRadar sat down with director Enrico Casarosa and producer Andrea Warren to talk about the massive challenge of making a movie remotely. We also discussed how the Italy-set film was inspired by some unusual sources, and the story behind the hilarious cameo of one of Luca’s supporting characters.",
    "Set on the Italian Riviera in the 1950s, Luca is a heartwarming tale that explores the power of friendship, the importance of accepting who you are, and the nostalgic escapism of childhood summers.",
    "The film follows Luca, voiced by Jacob Tremblay, a shy and lonely teenager who longs for adventure. He seemingly gets his wish when he meets the confident Alberto (Jack Dylan Grazer), and it isn’t long before the pair embark on a dangerous trip to the fictional seaside town of Portorosso.",
    "Why is it dangerous? Because both Luca and Alberto hide a secret – they’re sea monsters, and Portorosso’s townsfolk have hunted such creatures for centuries.",
    "Luckily for Luca and Alberto, they can adopt human form when on dry land. What they can’t do, however, is blend into their surroundings very well – and the duo soon find themselves drawing suspicious glances from fellow teenager Giulia (Emma Berman), her fisherman father Massimo (Marco Barricelli) and local town bully Ercole Visconti (Saverio Raimondo).",
    "For Casarosa, Luca’s story and setting were of personal significance. Having grown up in Genoa, the Italian Riviera city, he was a timid child until he met real-life best friend Alberto – a lifelong companion who brought Casarosa out of his shell.",
    "“He [Alberto] was a troublemaker,” Casarosa explains. “I followed him around and got dragged into trouble. When we started work on Luca, I started asking myself ‘Would we be the same people if we didn’t have the friends we have?’ and ‘What does friendship do when we grow up? How much of it is about finding ourselves?’ When I pitched the first idea for Luca, a lot of people related and said they had friends like that, too.”",
    "Naturally, a movie centered on childhood friendships required a young cast to voice the lead roles, with Luca becoming the first Pixar movie since 2017’s Coco to have a teenage lead. Luca’s creative team cast the proverbial net far and wide in search of its three stars ( Luca, Alberto and Giulia), and eventually settled on the talented trio of Tremblay, Grazer and Berman.",
    "While Tremblay (Room, Doctor Sleep) and Grazer (Shazam, It) have plenty of acting experience despite their tender years, Berman was an industry newcomer. As Warren explains, though, the teenage actress wasn’t daunted by the prospect of taking her first major movie role.",
    "“Emma is just so joyful, excited and giddy,” Warren says. “There were times where she was having so much fun recording lines that we’d say ‘Emma, we need less giggling’. She just embodies that spirit and energy, so she was a great match for Giulia’s quirkiness.”",
    "Supporting Luca’s young-yet-talented cast are the likes of Maya Rudolph (Bridesmaids, Mitchells vs the Machines) and Jim Gaffigan (My Boys, Chuck) as Luca’s mom and dad respectively. The duo, though, are upstaged – in Luca’s family circle, at least – by a movie-stealing cameo from deep-sea dwelling uncle Ugo, played by none other than Borat star Sacha Baron Cohen.",
    "“One of the wonderful silver linings of making this movie remotely was it opened up collaborations that we wouldn’t normally see,” Casarosa says. “We found a little window in Sacha’s busy schedule and we were so happy that he wanted to delve into this character. We wrote three versions of his monologue and let Sacha run with it, and it was the funniest stuff. That gave us the little bit that we use in the post-credits scene as we just had to fit more Ugo into the movie.”",
    "Given the inspiration for Luca’s story and setting, it comes as no surprise that Italian influences run through its heart.",
    "Research trips to the Cinque Terre (a group of colorful and picturesque centuries-old Italian Riviera fishing villages) helped to inform the aesthetic of Portorosso and Luca’s depiction of Mediterranean coastal communities. The 1950s and 1960s Golden Age of Italian cinema, including famed director Federico Fellini’s works and Luchino Visconti’s La Terra Trema, a documentary-style drama about real-life Italian fishermen, were also notable influences for Luca’s characters, location and plot.",
    "Two of Luca’s biggest stylistic inspirations, though, came from unusual sources. Breaking Away, a 1979 American coming-of-age drama centered on competitive cycling, was crucial in helping Luca’s creators-in-chief to marry its two distinct parts together.",
    "“Breaking Away taught us about turning two movies into one,” Casarosa says. “We had a similar structure of friendship that Breaking Away has, but we also have these two worlds [Portorosso and Luca’s underwater home] and the sea monster secret. It was interesting to see how Breaking Away weaved its two elements together, which helped us to connect our two worlds and themes in order to complete our own puzzle.”",
    "As for Luca’s second artistic inspiration, Casarosa turned to one of his favorite childhood pastimes – Studio Ghibli films, which informed everything from Luca’s manga-style character designs to the watercolor, painterly visuals of Portorosso and the surrounding countryside.",
    "“I love Hayao Miyazaki movies,” Casarosa reveals. “I really like the sense of wonder, the kid-infused worlds and the care he has for nature. A lot of Studio Ghibli's dreamlike sequences certainly influenced us, so we tried to bring that warmth and imperfection to the computer animation. I love to bring an organic feel to the overall look – like a painting or a sketch – that’s still immersive and very rich, like Miyazaki’s various legendary works.”",
    "Work had already begun on Luca pre-pandemic (research trips to the Italian Riviera had taken place before the virus’ emergence), but few among the cast and crew could have imagined the challenges that would be presented by the Covid-19 outbreak and subsequent lockdowns.",
    "As coronavirus swept the globe, the animation studio was forced to close its Californian campus and instruct its entire workforce to work remotely.",
    "Luca, then, became the first Pixar movie to be animated, recorded and edited entirely from the homes of the Disney subsidiary’s employees, leading to concerns about how Luca would be developed – and completed.",
    "“At the beginning, we didn’t know if we could do this,” Casarosa recalls. “We were told ‘the schedule isn’t changing’ so we didn’t know how we’d make it. Everything felt slower, and there was a moment of feeling panicked but, slowly, the resourcefulness and scrappiness [of the team] came together and we found solutions.”",
    "That problem-solving encompassed every aspect of development. Cast members were sent iPads to record their lines from home (Grazer’s entire performance as Alberto was voiced in his mom’s closet), while Pixar employees with families were allowed to work around looking after their children.",
    "Perhaps the biggest challenge, though, was creating the emotional heartbeat of any Pixar film: the music.",
    "“We had to record the score over Zoom,” Warren says. “There were lots of restrictions around certain kinds of instruments, how many could be in the same room – string musicians could be as they could wear masks, but horns couldn’t – and we had to record them all separately. We’re used to a world where you’re hearing it recorded and you have a good sense of how it’s playing with the picture. In this case, you had to not only imagine how different orchestral sections would sound alongside one another, but also how they worked with the movie playing. It was different but we’re just so grateful that we could find ways to proceed.”",
    "As stressful as its development must have been, the fact that Pixar crafted Luca entirely from home doesn’t show in the final product, an achievement our review attests to.",
    "If anything, it’s a hugely impressive feat that Pixar made its latest movie in such difficult circumstances. It’s entirely fitting that, in order to produce a movie about camaraderie and exploring different cultures – the latter of which we all hope to do once the pandemic subsides – Pixar’s crew had to stick together and overcome so many challenges of their own.",
    "“Luca is about wanting to be part of something outside of our immediate families,” Warren says. “It’s about wanting to experience cultures beyond our own. Luca discovers the power of exploring and celebrating another culture, while learning to honor and share his own. I hope that some of those messages, including that notion of friendship, reaches audiences and especially kids.”",
    "Luca is now available to stream exclusively on Disney Plus."
  ],
  "headers": {
    "4": "Making a splash",
    "15": "Creating an Italian anime",
    "21": "Pandemic perils"
  },
  "links": {
    "Luca": "https://www.techradar.com/news/luca-on-disney-plus-is-the-nostalgic-pixar-fantasy-movie-to-get-you-ready-for-summer",
    "our review": "https://www.techradar.com/news/luca-on-disney-plus-is-the-nostalgic-pixar-fantasy-movie-to-get-you-ready-for-summer"
  }
}