{
  "source": "https://www.techradar.com/news/windows-11-now-available-to-windows-insiders-can-your-computer-run-it",
  "title": "Windows 11 now available to Windows Insiders – can your computer run it?",
  "category": "computing",
  "updated": "2021-07-28T12:22:43Z",
  "author": "john-loeffler",
  "summary": "New OS just dropped",
  "article": [
    "Windows 11 is now available for download to Windows Insiders as a preview build, giving selected users the first real look at Microsoft's successor operating system to Windows 10.",
    "Announced on Monday afternoon via Microsoft's official Windows Blog, the release isn't a surprise – the company had said it would be available this week – but it's still earlier than most were expecting.",
    "In a message to participants in the Windows Insider program, the company said: \"As we finalize the product over the coming months, we will work with you to validate the experience. You will get to try many, but not all, of the new features we showed last week in this early preview. We will bring more features such as Chat with Microsoft Teams and Android apps in the Microsoft Store over the coming months as they are ready for you – we are just getting started on this journey together!\"",
    "Participants in the Microsoft Office Insiders program can now also download newly designed Office apps like Word and Excel to bring a more unified look across the board. The company also said that Windows Insiders using ARM-based PCs can also try out a new 64-bit version of Office for Windows on ARM.",
    "In addition to releasing the Insider Preview build of Windows 11 and new preview builds of Office apps, Microsoft also released more information on the Windows 11 minimum system requirements.",
    "This is due largely to \"confusion\" about the company's PC Health Check tool. \"Based on the feedback so far,\" Microsoft said, \"we acknowledge that it was not fully prepared to share the level of detail or accuracy you expected from us on why a Windows 10 PC doesn’t meet upgrade requirements. We are temporarily removing the app so that our teams can address the feedback.\"",
    "In lieu of the PC Health Check app, Microsoft updated its minimum system requirements page for Windows 11 to better reflect what you'll need to get the new OS up and running on your PC when it is released.",
    "For a complete list of additional, non-essential requirements, check out Microsoft's Windows 11 specification page."
  ],
  "headers": {
    "4": "Microsoft Windows 11 system requirements come into focus",
    "7": "Windows 11 Minimum system requirements"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows Insiders": "https://www.techradar.com/news/software/operating-systems/microsoft-now-has-six-million-windows-insiders-1301632",
    "Windows Blog": "https://blogs.windows.com/windows-insider/2021/06/28/announcing-the-first-insider-preview-for-windows-11/",
    "company also said": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1160618061968942600&xs=1&url=https%3A%2F%2Finsider.office.com%2Fen-us%2Fblog%2F64-bit-office-for-windows-on-arm&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-11-now-available-to-windows-insiders-can-your-computer-run-it",
    "released more information": "https://blogs.windows.com/windows-insider/2021/06/28/update-on-windows-11-minimum-system-requirements/",
    "PC Health Check tool": "https://www.techradar.com/news/tpm-20-windows-11-pc-health-check-and-the-potential-messy-upgrade",
    "Windows 11 specification page": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6238830497138304000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fwindows%2Fwindows-11-specifications"
  }
}