{
  "source": "https://www.techradar.com/news/dropbox-is-going-head-to-head-with-docusign-with-advanced-e-signatures",
  "title": "Dropbox is going head to head with DocuSign with advanced eSignatures",
  "category": "computing",
  "updated": "2021-06-15T18:15:02Z",
  "author": "anthony-spadafora",
  "summary": "HelloSign now offers Qualified Electronic Signatures",
  "article": [
    "Dropbox has announced that its eSignature solution HelloSign now offers Qualified Electronic Signature (QES) in order to further support customers doing business in the EU and UK.",
    "For those unfamiliar, QES meets the highest standard of security and authentication in Europe and is the only type of electronic signature that carries the same legal value as a handwritten signature under electronic IDentification, Authentication and Trust Services (eIDAS).",
    "HelloSign COO Whitney Bouck explained in a press release that decision to add QES to its eSignature service was made as part of its global expansion efforts, saying:",
    "“We recently expanded globally and brought our trusted eSignature functionality to businesses across the world in 21 additional languages,. We are so pleased to now bring our customers the option of adding QES to their agreements, providing even greater confidence as they build out their digital workflows and conduct business in the EU.”",
    "As some specific use cases such as loan, lease and rental agreements, sales agreements and employment contract termination require QES in the EU and UK, existing HelloSign customers can QES to their premium plans as an incremental add-on.",
    "The company's premium plan customers can now add QES in increments of 100 per year depending on the individual needs of their business.",
    "HelloSign with QES delivers the highest standard of legally binding eSignatures thanks to the company's decision to partner with IDnow for face-to-face identity verification and the Trusted Service Provider (TSP) Namirial for digital certification.",
    "QES isn't the only HelloSign feature designed to promote security and compliance as the company also offers OAuth and SAML for single-sign-on (SSO) and two-factor authentication (2FA) so users can seal final documents and identify any changes. The Dropbox-owned eSignature solution even meets stringent SOC 2 Type II, ISO 27001 and ISO 27018 compliance requirements so that HelloSign users can rest easy knowing their documents are secure."
  ],
  "headers": {
    "4": "Face-to-face identity verification"
  },
  "links": {
    "eSignature solution": "https://www.techradar.com/best/best-esign-software-solutions",
    "HelloSign": "https://www.techradar.com/news/dropbox-snaps-up-hellosign-in-dollar200m-deal",
    "IDnow": "https://www.techradar.com/news/how-to-detect-and-prevent-identity-fraud",
    "SSO": "https://www.techradar.com/best/best-identity-management-software",
    "2FA": "https://www.techradar.com/news/what-is-2fa"
  }
}