{
  "source": "https://www.techradar.com/news/asus-rog-zephyrus-duo-15-wants-to-prove-that-dual-screen-gaming-laptops-arent-just-a-gimmick",
  "title": "Asus ROG Zephyrus Duo 15 wants to prove that dual-screen gaming laptops aren’t just a gimmick",
  "category": "computing",
  "updated": "2021-01-12T18:40:50Z",
  "author": "matt-hanson",
  "summary": "Will it convince us?",
  "article": [
    "Asus has revealed a range of new gaming laptops at CES 2021, with the most interesting being the Asus ROG Zephyrus Duo 15, a thin and light device that comes with a second screen.",
    "Asus has been making laptops with secondary screens, known as the ScreenPad Plus, for a few years now, and while we’ve appreciated the company’s attempt to revolutionise the laptop form factor in the past, we’ve yet to be really convinced that putting a second screen in a laptop is more than just a gimmick that raises the overall price of the device.",
    "Still, Asus isn’t giving up, and the ROG Zephyrus Duo 15 once again comes with a second 14-inch half-height IPS touchscreen in either FHD or UHD resolutions, and support for styluses.",
    "The advantage of this second screen is that in supported games, it could be used to show extra menus, maps or inventory options. This could give gamers a competitive edge, though it does rely on game developers adding support. While the ScreenPad Plus remains a niche feature, we’re not too sure how many games will take advantage of this, though Asus assures us it is working with a number of third-party game and app devs to bring support.",
    "In fact, it’s content creators and streamers, rather than regular gamers, that could benefit from the second screen. By using the second screen to show tools and shortcuts, while the main screen is used for games (if streaming) or creative apps, content creators could see a real productivity benefit.",
    "Asus has also announced a partnership with Xplit Gamecaster, allowing you to monitor your stream on the second screen while you play a game on the main screen (which is no slouch, with a 15.6-inch display, and offers either 4K at 120Hz or 1080p at a remarkable 300Hz.",
    "Specs-wise, the Asus ROG Zephyrus Duo 15 features cutting edge next-gen AMD Ryzen mobile processors, which AMD has just announced at CES 2021, along with new Nvidia RTX 3000 mobile GPUs, which have also just been revealed. So, Asus has certainly put together an extremely powerful gaming laptop. But will the extra screen finally feel worthwhile? We’ll hopefully get a chance to test it out soon with our full review.",
    "Asus also announced new 15-inch and 17-inch versions of the ROG Strix SCAR, which are aimed at esports players, and come packing the latest tech from AMD and Nvidia.",
    "So, along with the new AMD Ryzen 5000 mobile CPUs and Nvidia RTX 3000 series mobile GPUs that have just been announced, they also come with high refresh rate displays (up to 360Hz), optical mechanical keyboard and up to 64GB of RAM.",
    "Again, they look set to be incredibly capable gaming laptops packed with cutting-edge components. They’ve also been given a brand new design, including new RGB lighting, bold colors and interchangeable thermal cover caps, which you can even 3D print yourself.",
    "Not only does this new design result in some seriously striking-looking laptops, but it means Asus has been able to reduce the overall footprint of the laptops by 7%, making them even more portable. Battery life is also set to increase thanks to a larger capacity (and more efficient hardware).",
    "We can’t wait to get our hands on these new laptops when they are available later this year."
  ],
  "headers": {
    "7": "Asus ROG Strix SCAR"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "RGB lighting": "https://www.techradar.com/news/razer-rgb-christmas-lights-are-a-thing-now-so-i-created-a-monster"
  }
}