{
  "source": "https://www.techradar.com/news/what-to-do-about-whatsapp-pink",
  "title": "What should you do if you get a link for WhatsApp in pink?",
  "category": "computing",
  "updated": "2021-04-19T08:30:39Z",
  "author": "balakumar-k",
  "summary": "Long story short: it's a virus",
  "article": [
    "Some WhatsApp users have reported receiving a link on their phones that says it will turn the the messaging app's theme from its trademark green to a new pink shade.",
    "The link also promises other new features and, to add authenticity to the claim, the link claims to be an official update from WhatsApp. So what should you do if you get the link?",
    "You shouldn't open this link, and if you do it may mean hackers are able to access your phone. Cyber security analysts are advising users to stay away from such a link.",
    "Internet security researcher Rajshekhar Rajaharia said in a tweet: \"Beware of WhatsApp Pink!! A Virus is being spread in WhatsApp groups with an APK download link. Don''t click any link with the name of #WhatsappPink. Complete access to your phone will be lost.\"",
    "Experts also warned users to stick to the basics and never install any APK or mobile app other than those available on the official Apple App store of Google Play Store.",
    "Such malicious apps can be used to compromise your phone and steal personal data. For example, it can be used to capture and steal banking passwords.",
    "The current case of Pink WhatsApp is a case of malware impersonating as fake WhatsApp feature apps, another cyber expert said.",
    "A spokesperson for WhatsApp has said, \"Anyone can get an unusual, uncharacteristic or suspicious message on any service, including email, and anytime that happens we strongly encourage everyone to use caution before responding or engaging.",
    "\"On WhatsApp in particular, we also recommend that people use the tools that we provide within the app to send us a report, report a contact or block contact.”"
  ],
  "headers": {
    "3": "This is what WhatsApp wants you to do"
  },
  "links": {
    "WhatsApp": "https://www.techradar.com/news/whatsapps-flaw-allows-stalkers-to-track-you-easily",
    "tweet": "https://twitter.com/rajaharia/status/1383476641293168640"
  }
}