{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-mentioned-on-samsung-mexico-website",
  "title": "Samsung Galaxy S21 FE mentioned on Samsung Mexico website",
  "category": "phones",
  "updated": "2021-04-30T22:46:00Z",
  "author": "david-lumb",
  "summary": "The Samsung S21 FE has been name-checked on a Samsung website",
  "article": [
    "The rumored Samsung Galaxy S21 FE has gotten another shout-out, this time from Samsung’s official Mexico website, which mentioned the phone by name and showed an image.",
    "At time of publishing, the S21 FE mention was still visible on the Samsung Mexico site – just hover your mouse over the 'Mobile' tab at the top of the screen to show the dropdown menu and look to the right, where a photo and 'Conoce más sobre Galaxy S21 FE' (Learn more about Galaxy S21 FE) appears on the right with a link to the Samsung Galaxy S21 family of phones. See a screenshot below:",
    "There's no listing for an S21 FE in the linked list of S21 phones for sale, and it’s not clear if the phones depicted in the associated photo include the S21 FE (it’s likely the S21 and S21 Ultra). The alt text for the image does mention the S21 FE, though.",
    "That confusion isn’t surprising – the more affordable Samsung Galaxy S20 FE looked a lot like the Samsung S20 lineup it followed. And even if the linked page of S21 phones doesn’t currently include the S21 FE, it does suggest that Samsung sites could be preparing to list the new affordable phone.",
    "While we haven’t heard about a release date for the Samsung S21 FE, we have seen rumors about what it will feature. Specs-wise, we’re expecting the phone to have a 6.4-inch AMOLED screen, a Snapdragon 888 or Exynos 2100 chipset, 6GB or 8GB of RAM, 128GB or 256GB of storage, a 4,500mAh battery, and a 32MP front-facing camera.",
    "We’ve also seen how the phone may look thanks to several rounds of renders, which show a very similar design to the S21 phones: a full glass front with central punch-hole for the selfie shooter, and a seamless back cover broken only by a camera block in the top left featuring a vertically-aligned trio of camera lenses. While the coloring in the renders may not accurately reflect how the phones will look, other rumors suggest the phone will come in light green, purple, pink, white, and grey.",
    "Via Android Police"
  ],
  "headers": {
    "4": "Samsung S21 FE: what we know"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Samsung Mexico site": "https://www.samsungstore.mx/",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Samsung S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "battery": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-pack-a-bigger-battery-than-the-regular-galaxy-s21",
    "camera": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-and-camera-details-leaked",
    "rounds": "https://www.techradar.com/news/samsung-galaxy-s21-fe-design-revealed-in-unofficial-renders",
    "renders": "https://www.techradar.com/news/samsung-galaxy-s21-fe-renders-show-off-the-phone-in-full",
    "light green": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-and-camera-details-leaked",
    "Android Police": "https://www.androidpolice.com/2021/04/30/heres-your-first-look-at-the-samsung-galaxy-s21-fe/"
  }
}