{
  "source": "https://www.techradar.com/news/early-amazon-prime-day-deal-get-dollar10-of-free-credit-when-you-buy-a-dollar40-gift-card",
  "title": "Early Amazon Prime Day deal: get $10 of free credit when you buy a $40 gift card",
  "category": "news",
  "updated": "2021-06-07T17:34:50Z",
  "author": "alex-whitelock",
  "summary": "A great little freebie for this year's Amazon Prime Day deals",
  "article": [
    "Fancy scoring $10 to spend on this year's Prime Day deals? Right now at Amazon you can do just that if you spend $40 or more on an Amazon eGift card.",
    "Simply use the code GIFTFORPD21 at checkout and you'll get your credit within two days of your purchase. What makes this promo so good? Well, technically you can send an Amazon eGift card to yourself - essentially pocketing a nice little discount for the upcoming Prime Day deals. Note, however, you will need to be an Amazon Prime member to eligible here and it's limited to once per customer.",
    "Also, this $10 of free credit is also only eligible for discounting 'official' Amazon store listings - not third-party sellers. Regardless, the best Prime Day deals are normally on official Amazon listings and the company's own products either way, so it's still a fantastic promo.",
    "While Amazon Prime Day falls on June 21st to 22nd this year, this gift card promotion ends on June 20 11:59PM (PT), so definitely don't hang around if you're getting your shopping list ready for this year's Prime Day deals.",
    "Also available today is another great Amazon Prime Day promotion that lets you save $10 when you spend $10 or more on small business products. We've included more details on this deal just below, alongside Amazon Prime free trial information if you'd like to try it. You can also visit our main Prime Day deals page for all the latest news in the lead-up to the big event itself."
  ],
  "headers": {
    "5": "Other great Amazon services to check out"
  },
  "links": {
    "spend $40 or more on an Amazon eGift card": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fb%3Fnode%3D14485264011%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1613012807584495600-20",
    "save $10 when you spend $10 or more on small business products": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fb%2Fref%3Ds9_acss_bw_cg_sbp22c_1a1_w%3Fnode%3D17879387011%26pf_rd_m%3DATVPDKIKX0DER%26pf_rd_s%3Dmerchandised-search-top-3%26pf_rd_r%3D8CTYC4S3PY3YYT74B1R8%26pf_rd_t%3D101%26pf_rd_p%3D88eec129-7b10-4933-831c-edd42d77f18c%26pf_rd_i%3D17879387011%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8067590472150628000-20",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}