{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-s21-fe-leaks-again-this-time-in-its-official-cases",
  "title": "The Samsung Galaxy S21 FE leaks again, this time in its official cases",
  "category": "phones",
  "updated": "2021-12-04T16:00:45Z",
  "author": "david-nield",
  "summary": "The leaks keep on coming",
  "article": [
    "It's been a busy week for those trying to keep tabs on the various leaks and rumors around the Samsung Galaxy S21 FE, and we've got some more imagery to share with you: pictures of the handset in a variety of official cases posted to a retail website ahead of time.",
    "These images appeared on Box in the UK (via GSMArena), and we get a look at the phone in the Clear View Cover, the Silicone Cover, and the Clear Standing Cover cases – the usual selection of cases that Samsung puts out alongside its premium smartphones.",
    "The pictures posted to Box don't really tell us anything new, but we once again get a look at the design of the Galaxy S21 FE, with its punch hole selfie camera at the top of the screen in the center, and a triple-lens rear camera array on the back.",
    "Most smartphone launches are preceded by a bunch of leaks and rumors these days, but we can't remember a recent handset that we have known quite so much about in advance as the Samsung Galaxy S21 FE. Perhaps that's partly down to its delayed launch.",
    "Only yesterday we learned that pricing for the phone is likely to match the Galaxy S20 FE that it's replacing – so in the region of $699 / £699 / AU$1,149. Also on the pricing front, we've heard that the Galaxy S21 FE will be retailing for €649 in European territories.",
    "Numerous leaked images of the phone have also appeared in recent months, while we've also heard plenty about the potential specs of this device – which most probably aren't going to vary too much from what we've seen with the Samsung Galaxy S21 series.",
    "It isn't official yet, but the Samsung Galaxy S21 FE is widely expected to be making its debut at the start of January 2022, as part of the CES 2022 tech showcase schedule. Once that launch is out of the way, Samsung has plenty more phones coming next year too.",
    "Not long after the arrival of the Galaxy S21 FE we should be getting the Samsung Galaxy S22 line-up of handsets, which are due to break cover in February. The phones aren't thought to be hugely different from their S21 predecessors, but we should get the usual annual bumps in terms of performance and camera capabilities.",
    "One phone to look out for in particular is the Galaxy S22 Ultra, which may even get a Note moniker added to its name. It is in effect replacing the Galaxy Note series, it looks like, with a design that's distinctly different from the S22 and the S22 Plus, superior cameras, and support for the Samsung S Pen stylus.",
    "Around August time we should get a refresh of Samsung's foldable phones, with the Galaxy Z Fold 4 and the Galaxy Z Flip 4 rumored to be on the way. Add in Samsung's usual batch of mid-range and budget phones, and it's going to be a busy year."
  ],
  "headers": {
    "3": "Leaks, leaks and more leaks",
    "6": "Analysis: what to expect from Samsung in 2022"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Box": "https://track.webgains.com/click.html?wgcampaignid=138485&wgprogramid=13045&clickref=trd-us-7401654777028488000&wgtarget=https%3A%2F%2Fwww.box.co.uk%2F",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_s21_fes_design_confirmed_through_cases-news-52135.php",
    "delayed launch": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leaked-launch-date-risks-it-getting-lost-next-to-galaxy-s22",
    "we learned": "https://www.techradar.com/news/the-samsung-galaxy-s21-fe-is-rumored-to-cost-the-same-as-the-s20-fe",
    "Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "we've heard": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leak-shows-off-all-the-phones-color-options",
    "leaked images": "https://www.techradar.com/news/heres-what-the-samsung-galaxy-s21-fe-might-look-like",
    "potential specs": "https://www.techradar.com/news/samsung-galaxy-s21-fe-pricing-specifications-design-surface-online-heres-what-we-know",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "CES 2022": "https://www.techradar.com/news/ces-2022",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "added to its name": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-design-shown-off-in-backplate-leak",
    "Galaxy Z Fold 4": "https://www.techradar.com/news/samsung-galaxy-z-fold-4",
    "Galaxy Z Flip 4": "https://www.techradar.com/news/samsung-galaxy-z-flip-4"
  }
}