{
  "source": "https://www.techradar.com/news/a-major-star-wars-casting-mystery-mightve-been-solved",
  "title": "Star Wars: Ezra Bridger casting rumor intensifies",
  "category": "entertainment",
  "updated": "2021-03-16T12:20:56Z",
  "author": "samuel-roberts",
  "summary": "Has Lucasfilm cast its Ezra Bridger?",
  "article": [
    "Star Wars: Ahsoka, the upcoming spin-off from The Mandalorian, is rumored to have cast its live-action version of the character Ezra Bridger from the animated series Star Wars: Rebels. Actor Mena Massoud is rumored to play the hero, and now the actor might've teased his involvement in a post on Instagram.",
    "in February 2021, the YouTube channel Kessel Run Transmissions reported that actor Massoud – best known for 2019's live-action Aladdin movie – had verbally agreed to be cast as the live-action version of Ezra. Though Massoud hadn't officially signed on to play the character at the time, at least according to the report, he was deemed the frontrunner. The reveal video mentions that the Ahsoka show is where we'll first meet the character in live-action.",
    "Now, the actor has posted a quote from Ezra Bridger on Instagram (see below) – which appears to tease the possibility of him playing the character. \"Hey, just so you know, when I escape I won't hurt any of you,\" is indeed a direct quote from episode 9 of Star Wars: Rebels season 2, 'Stealth Strike'.",
    "Kessel Run Transmissions has form on these rumors, unlike so many outlets of wild stories – the channel successfully called the existence of animated series Star Wars: The Bad Batch last year. Massoud is also high on many fans' wish lists.",
    "Here's Massoud's post:",
    "Since this casting hasn't been officially announced by Lucasfilm, we'd still consider it a rumor for now. It's possible that Massoud could just be messing around, based on the intense speculation that has sprung up in recent weeks.",
    "It's expected that Ezra Bridger will journey alongside Ahsoka Tano (Rosario Dawson) in her search for Grand Admiral Thrawn, as teased by season 2 of The Mandalorian. This would continue the story of Rebels in live-action.",
    "Star Wars: Ahsoka, as of late last year, was in the writing stages. The spin-off was announced during Disney's Investor Day in December 2020, as one of 10 different Star Wars shows coming to Disney Plus. Dawson's role as Ahsoka was very well-received in The Mandalorian – so it makes sense Lucasfilm would swing equally hard to cast another animated favorite in live-action.",
    "Still, Ahsoka could be a few years away yet – the only live-action Star Wars show releasing in 2021 will likely be The Book of Boba Fett, which is coming in December 2021. Two other shows, Andor and Obi-Wan Kenobi, are filming now."
  ],
  "headers": {
    "7": "A major step forward"
  },
  "links": {
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Kessel Run Transmissions": "https://www.youtube.com/watch?v=yEJ6qSvprps&ab_channel=KesselRunTransmissions",
    "Star Wars: The Bad Batch": "https://www.techradar.com/news/star-wars-the-bad-batch-release-date-cast-and-what-we-know-about-the-disney-plus-show"
  }
}