{
  "source": "https://www.techradar.com/news/kick-start-your-smart-home-with-eves-new-energy-smart-plug-with-thread-support",
  "title": "Kick-start your smart home with Eve’s new Energy smart plug with Thread support",
  "category": "smart-home",
  "updated": "2021-03-05T11:29:54Z",
  "author": "carrie-ann-skinner",
  "summary": "Eve Energy is one of three products getting support for the smart home protocol",
  "article": [
    "Smart home brand Eve has unveiled a new smart plug and connected weather station that supports Thread smart home technology. Eve Energy is a new iteration of Eve’s smart plug, which can also keep track of how much energy the device plugged into it is using, and is priced at $39.95 / £34.95 (about AU$50). It will be available in the US on April 6, and in the UK in early May.",
    "Eve Weather is a replacement for the Eve Degree connected weather station, following a filling for the device with the FCC (Federal Communications Commission) in January. It monitors the temperature, humidity, and air pressure in and around your home, which can be seen on the device itself or in the app on a smartphone or tablet.",
    "Eve has given the weather station Thread as well as Bluetooth connectivity and it’s IPX3 rated so can be used outside. Eve Weather will cost $69.95 in the US and £64.95 in the UK and go on sale on March 25.",
    "Eve is also bringing Thread support to its Eve Aqua smart water controller through a firmware update in April 2021. The smart home device allows you to control outdoor faucets from your smartphone or tablet, and is available in the US and the UK now for $99.99 / £89.95. All of Eve’s products work with HomeKit, Apple’s smart home platform, although they are not compatible with Alexa or Google Assistant.",
    "Similar to Zigbee and Z-wave, Thread lets smart home devices from different manufacturers connect to each other, but it’s faster, offers a more reliable connection and uses less power.",
    "To use Thread in your smart home set up, you’ll need a device that doubles as a Thread Border router so the different devices can talk to each other. The HomePod Mini is the first smart home device that offers this functionality. However, more are expected to become available throughout 2021.",
    "Thread technology aims to make smart homes more reliable and ensure you don’t have to purchase devices from the same manufacturer, and we can’t fault that sentiment. However, Eve products currently only work with HomeKit, which will be a blow to many consumers that are using Alexa and Google Assistant to control their smart homes."
  ],
  "headers": {
    "3": "Eve Aqua",
    "4": "What is Thread?",
    "6": "Is Thread the future?"
  },
  "links": {
    "Thread smart home technology.": "https://www.techradar.com/news/what-is-thread-and-why-do-your-smart-home-gadgets-need-it",
    "Eve’s smart plug": "https://www.techradar.com/reviews/elgato-eve-energy-smart-switch",
    "filling for the device with the FCC": "https://www.techradar.com/news/eve-weather-with-thread-and-homekit-support-revealed-in-fcc-filing"
  }
}