{
  "source": "https://www.techradar.com/news/the-rumored-folding-iphone-could-work-with-the-apple-pencil",
  "title": "The rumored folding iPhone could work with the Apple Pencil",
  "category": "phones",
  "updated": "2021-12-04T04:12:31Z",
  "author": "tom-bedford",
  "summary": "Perhaps an Apple Pencil 3",
  "article": [
    "We've heard very little about the iPhone Flip - even that name is a guess, one of many predictions and speculations attached to the nebulous concept of a folding iPhone which could come out in a couple of years. An analyst has some predictions that could paint a clearer picture, though.",
    "According to EqualOcean, a Chinese analyst firm that we haven't covered before regarding phone leaks, the first folding iPhone will be released in 2023, will have a 7.3 or 7.6-inch screen, and will support a stylus. Because of the questionable source of this information, take it all with a big grain of salt.",
    "Now let's unpack all that. Firstly, the 2023 release date is something we've heard before, so it could be accurate but also could be a guess based on other rumors. If true, it suggests Apple still has a lot of work to do on the folding iPhone, so don't hold your breath for it any time soon.",
    "Next, the two possible screen sizes both imply the phone won't have a 'clamshell' form factor like the Motorola Razr, which looks like a standard smartphone until you fold it in half to make it smaller, but will have a 'book' form factor like the Samsung Galaxy Z Fold 2, which seems to be your average smartphone until you unfold it to reveal a bigger inner screen.",
    "Presumably, the 7.3-inch or 7.6-inch display would be this large inner one, as it's much bigger than your standard smartphone screen.",
    "Finally, and perhaps the biggest news, is the stylus compatibility, as it suggests the phone will work with the Apple Pencil. Since that tablet stylus (and its Pro-grade sibling, the Apple Pencil 2) is quite big, we'd expect this to be an Apple Pencil 3, which might be smaller so it could be easily stored with the iPhone.",
    "No foldable phones thus far have stylus support, but the Samsung Galaxy Z Fold 3 could get it, if rumors are to be believed. Styli are typically used with tablets, as the large screen space makes note-taking and sketching convenient, and that would also be the case with the large inner screen of a foldable phone.",
    "Since the folding iPhone isn't expected to see the light of day for several years, all this information is very early, and a lot could change internally that makes the information we've heard here redundant. The only way to get concrete information on the iPhone Flip, or whatever it's called, is to wait until the device is announced - which could be a very, very long way off.",
    "You might also want to check out the best Apple Pencil alternatives."
  ],
  "headers": {},
  "links": {
    "iPhone Flip": "https://www.techradar.com/news/foldable-iphone",
    "EqualOcean": "https://equalocean.com/briefing/20210210230025840",
    "something we've heard before": "https://www.techradar.com/news/first-foldable-iphone-may-be-a-clamshell-and-come-in-lots-of-bright-colors",
    "Motorola Razr": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "if rumors are to be believed": "https://www.techradar.com/news/the-samsung-galaxy-z-fold-3-might-finally-add-s-pen-support-to-the-foldable",
    "Apple Pencil alternatives": "https://www.techradar.com/best/best-apple-pencil-alternatives"
  }
}