{
  "source": "https://www.techradar.com/news/zoom-could-owe-you-a-pay-out-after-court-ruling-over-privacy-breaches",
  "title": "Zoom could owe you a pay-out after court ruling over privacy breaches",
  "category": "pro",
  "updated": "2021-12-03T12:25:05Z",
  "author": "sead-fadilpasic",
  "summary": "Zoom settles class-action lawsuit",
  "article": [
    "Zoom has settled a class-action lawsuit that alleged the company was in breach of privacy laws and put its users’ data at risk. As a result, it now needs to pay a small sum to all customers that can prove they were affected.",
    "The lawsuit alleged that the video conferencing app, Zoom Meetings, shared certain user information with third parties, did not do everything it could to prevent unwanted meeting disruption by third parties, and that the company falsely advertised its service as end-to-end encrypted.",
    "In the legal notice of class-action settlement, which was published on the Zoom Meetings Class Action website, it was said that Zoom \"denies any liability whatsoever, and believes that no member of the Settlement Class, including the Plaintiffs, has sustained any damages or injuries due to these allegations\".",
    "However, because the company has decided to settle the suit, it is still required to issue compensation.",
    "Zoom will be paying out $85 million in total, and also agreed to change its policies and practices to benefit the members of the settlement class.",
    "It seems that quite a large number of people are eligible to receive a small amount of compensation as a result. They fall into two categories: paying customers and those who use the free version.",
    "Paying users that subscribed between March 30, 2016 and July 30, 2021 can file a claim for $25, or 15% of the subscription fee, whichever sum is greater. Those who used the free version by registering an account or downloading the Zoom Meeting app during the same time frame can file a claim for $15.",
    "It’s important to keep in mind that the sum could change, depending on the number of people who file the claim. The claims must be submitted by March 5, 2022, with the final approval hearing scheduled for April 7, 2022.",
    "Those who used an enterprise-level account or government account are not eligible for any compensation.",
    "Claims can be filed here."
  ],
  "headers": {
    "4": "Who is eligible for compensation from Zoom?"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "here": "https://www.zoommeetingsclassaction.com/Home/SubmitClaim"
  }
}