{
  "source": "https://www.techradar.com/news/iphone-apps-on-ipados-15-will-finally-get-this-must-have-feature",
  "title": "iPhone apps on iPadOS 15 will finally work as they're supposed to",
  "category": "computing",
  "updated": "2021-06-10T11:15:47Z",
  "author": "daryl-baxter",
  "summary": "Landscape mode finally arrives",
  "article": [
    "It’s been discovered that in iPadOS 15, iPhone apps can now run in landscape mode as well, not solely in portrait, on the iPad, making many apps much more usable than before.",
    "As the days pass from this year’s WWDC keynote, we’re slowly finding out more features from Apple’s new updates, and uncovering the little touches that are going to make significant differences to many users in the future.",
    "Ever since the launch of the iPad in 2010, you have been able to download iPhone apps to the tablet, but they would also display at the same size of an iPhone, with the option to enlarge it to fit the screen of an iPad.",
    "Thanks to a Reddit post, we’ve now got another useful feature for iPhone apps running on iPad.",
    "Some developers would rather have certain apps run on the iPhone only, and that’s totally understandable. Certain functions in some apps work best on one device in a certain size.",
    "This is why you can go to the App Store, search for an app like Instagram or Monzo and you can download the iPhone version for your iPad.",
    "This feature has barely seen any improvements since 2010, as it was years until the iPhone view was updated from the original 3.5 inch size and non-retina display, to the bigger, retina image in iPadOS 14.",
    "Now, though, iPadOS 15 enables these apps to be displayed in landscape orientation, other than just in portrait. With accessories like the Magic Keyboard that require the tablet to be in landscape, it only makes sense for this feature to arrive now, albeit a year later than hoped.",
    "While this is very welcome for apps like Instagram and others, it does raise the question of why Instagram isn’t on the iPad natively. With the cameras on the tablet becoming much more improved in recent years, it rivals the quality of the iPhone XS cameras from 2018.",
    "But with iPadOS 15 bringing bigger widgets to the home screen alongside features that have been there for years now, it seems as though Instagram can really take advantage of the screen space that the iPad provides.",
    "While it can be used in Safari to view photos and Instagram Stories, it’s a very short stop-gap to what a native iPad app could be capable of.",
    "In the meantime, having iPhone apps run in a view that users primarily use is a big win here, and it only means that you can use the trackpad and a keyboard with ease in Instagram and more.",
    "Via MacRumors"
  ],
  "headers": {
    "4": "iPhone apps on iPad",
    "8": "Analysis: Bring native Instagram to iPad"
  },
  "links": {
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15",
    "Reddit post": "https://www.reddit.com/r/ipad/comments/nuod7n/iphone_apps_finally_rotate_on_ipados_15/",
    "MacRumors": "https://www.macrumors.com/2021/06/08/iphone-apps-on-ipados-15-now-run-in-landscape/"
  }
}