{
  "source": "https://www.techradar.com/news/new-amazon-kindle-oasis-2021",
  "title": "New Amazon Kindle Oasis (2021): what we want to see",
  "category": "tablets",
  "updated": "2021-05-07T10:55:56Z",
  "author": "tom-bedford",
  "summary": "Amazon's next premium Kindle ereader.",
  "article": [
    "The Amazon Kindle Oasis line is one of the most premium ranges of ereaders there is; certainly it's Amazon's top-end collection of portable reading devices. We're hoping to see a new version of the device some time in 2021.",
    "We last saw an Amazon Kindle Oasis ereader launched in July 2019, so it's about time a new version of the premium book replacement came out, as the company typically takes two years between its ereaders.",
    "Therefore, a mid-2021 release date for the next Kindle ereader sounds plausible, though by no means definite, as we've been waiting even longer for the new Kindle (2021) and Paperwhite (2021) devices.",
    "We haven't heard any news or leaks about a new Amazon Kindle Oasis for 2021 - not yet, at least - but until then, we've come up with a wishlist of what we want to see. We'll also collect all information when we do receive it, and list it below, so you can see all there is to know.",
    "As the top-end model of Amazon's three Kindle ereader lines, the Oasis costs a lot - its feature set needs to match, with enough features to knock your socks off, otherwise it'd seem like a waste of cash.",
    "The previous three Amazon Kindle Oasis devices came out in 2016, 2017 and 2019, so it would seem they're released every year or two - that would make it likely a 2021 release date is on the cards for the fourth-generation version.",
    "Saying that, we didn't see any Kindles launched in 2020, despite a new Paperwhite being long-overdue. It could seem, then, that the Covid-19 pandemic has affected production, but that's just speculation - either way, don't be surprised if there's no new Oasis this year.",
    "In terms of price, the Amazon Kindle Oasis devices are always pricey - the last one started at $249.99 / £229.99 / AU$399 for 8GB storage and went up to $279.99 / £259.99 / AU$449 if you wanted 32GB worth of books - if you wanted 4G connectivity to download books on the go, you'd fork over a lofty $349.99 / £319.99 / AU$559.",
    "Unless there's a huge new feature, we'd expect the Amazon Kindle Oasis would got a similar amount.",
    "Here are all the changes and new features we want the Amazon Kindle Oasis (2021) to have. And no, a USB-C port won't be on this list, because that's not something we want to see -it's something we expect to see.",
    "By the sounds of things, color e-ink screens are the next 'thing', with TCL confirmed to be working on an ereader that's not monochromatic but colored, and it's very likely Amazon is at least working on such technology too.",
    "While a color display wouldn't be something we'd like to see in the Kindle or Kindle Paperwhite lines - such technology would likely bump the prices of those higher than would befit an entry-level or mid-range device - but it'd work on an Oasis device, which cost quite a bit more.",
    "A color ereader would let you read magazines and comic books exactly how they appear, not in a gloomy black-and-white, and since Amazon Prime Reading and Kindle Unlimted both give you access to lots of both, it'd let you make the most of your Kindle.",
    "Amazon Kindle ereaders only connect to the slower 2.4GHz internet bandwidth, not the faster 5GHz - since not everyone uses the former anymore, it can result in some people being unable to connect their Kindles to the web.",
    "We'd like to see the Kindle Oasis compatible with our 5GHz Wi-Fi so we can actually download books onto it without faff. Kindles can often have trouble connecting to hotspotted smartphones too, an issue we'd like to see fixed in the future.",
    "Currently on Amazon Kindle devices, seeing a list of your owned (or downloaded) books can be a little annoying. The Kindle home page doesn't show you many, giving you just a small glimpse at your library, with the rest of the page being a storefront with new and recommended books.",
    "If you head over to your library, you won't just see a list of your books but everything you've downloaded from the Kindle store, and things you've downloaded onto your device yourself, with only six entries per page. Sure, you can use the filter options, but they're a touch unintuitive - for example, you can filter by 'Read' or 'Unread', but there's no option for part-read books, and they're sent to the 'Unread' section.",
    "We'd like to see the Amazon Kindle library re-organized into a more easy-to-navigate way, perhaps with some customization (like variable amounts of books listed) so people can arrange it in a way that's logical to them. Oh, and this should go without saying, but the page navigation buttons should let you scroll through pages of the library, not throw you to a different menu.",
    "If you winced when you saw the previous Amazon Kindle Oasis price in the section above, you're not alone - in our full review we found that it was an accomplished ereader, but not one which totally justified its high price.",
    "We'd like to see a lower price, people can spend less on the device and more on their books. An exception to this would be made if new features justified the higher price, of course - that color e-ink screen won't come cheap, after all.",
    "Perhaps the most distinctive feature of the Amazon Kindle Oasis is its 'ridge-style' design - one half protrudes from the other, to make a natural hand-hold, where the center of mass is snugly in whichever hand you're holding the thing with.",
    "Well, in theory this is how it works, but in our full Kindle Oasis (2019) review we noted 'the ridge wasn’t quite thick enough to offer a comfortable hold' - we found it a little challenging to use the thing as intended. It's a good idea, but needs refining.",
    "We'd like to see the next Kindle Oasis redesign this handle, so it's a little thicker, and perhaps feels a little more natural to hold."
  ],
  "headers": {
    "5": "New Amazon Kindle Oasis (2021) release date and price",
    "9": "What we want to see",
    "10": "1. A color screen",
    "13": "2. Improved internet connection",
    "15": "3. A redesigned library layout",
    "18": "4. A lower price",
    "20": "5. An improved handle design"
  },
  "links": {
    "Kindle (2021)": "https://www.techradar.com/news/new-amazon-kindle-2021",
    "Paperwhite (2021)": "https://www.techradar.com/news/new-amazon-kindle-paperwhite"
  }
}