{
  "source": "https://www.techradar.com/news/black-friday-deals-make-super-cheap-amazon-fire-tablets-even-cheaper",
  "title": "Black Friday deals make super-cheap Amazon Fire tablets... even cheaper",
  "category": "tablets",
  "updated": "2021-11-20T10:07:25Z",
  "author": "tom-bedford",
  "summary": "🔥 deals on 🔥 tablets",
  "article": [
    "Another year, another Black Friday grinds into life - and, as ever, Amazon's Fire tablets have been discounted down to far cheaper than normal.",
    "Are they great, iPad-rivalling tablets? No, but they're inexpensive, and for some that's enough.",
    "We're currently seeing discounts on the 7-, 8- and 10-inch versions of the device, including the Plus variants of the Fire HD 8 and Fire HD 10, and the Kids' and Kids Pro versions of all three slates.",
    "(In case you haven't been tracking the minute details of Amazon's tablet launches: Plus versions come with wireless powering, while Kids versions are for 3-7 year olds and Kids Pro are for 6-12 year olds, both with more robust frames and dedicated, age-appropriate software).",
    "Some of these Black Friday deals have cut half the price of the slate off - although given how cheap they normally are, the actual dollar-or-pound savings aren't astronomical.",
    "So if you've got your heart set on a new Fire Tablet, now could be the time to do it. They're not the cheapest they've ever been - we saw slightly higher savings last November, so we'd expect further Amazon Black Friday savings before the Black Friday period is out.",
    "We've ordered each section by size (and by UK and US), with standard, then Plus, then Kids, then Kids Pro for each model listed. Scroll down or control-F to find the tablet you want.",
    "(Not in the US or UK? Scroll down for deals in your region).",
    "No matter where you live, you'll find all the lowest prices for the Amazon Fire tab from around the web right here, with offers available in your region."
  ],
  "headers": {
    "8": "More Amazon Fire tab deals",
    "9": "More Black Friday deals"
  },
  "links": {
    "Fire HD 8": "https://www.techradar.com/reviews/amazon-fire-hd-8-2020",
    "Fire HD 10": "https://www.techradar.com/reviews/amazon-fire-hd-10-2019-review",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Amazon Black Friday savings": "https://www.techradar.com/black-friday/amazon-black-friday-deals"
  }
}