{
  "source": "https://www.techradar.com/news/android-12-has-a-small-fix-for-an-annoying-screenshot-problem",
  "title": "Android 12 has a small fix for an annoying screenshot problem",
  "category": "phones",
  "updated": "2021-04-23T14:38:03Z",
  "author": "hamish-hector",
  "summary": "You can now swipe both and left on right screenshots",
  "article": [
    "The Android 11 update included a bevy of changes but one of the more noticeable ones was to screenshots. A handy pop-up gave you the option to share or edit the image with one button, though if you wanted to do neither it was a pain to remove quickly. It appears those problems will soon disappear when Android 12 lets you flick it away thanks to details from the latest developer preview.",
    "Previously, when you took a screenshot, you’d have to tap on a small ‘X’ in the corner to remove it. The ‘X’ was easy to miss and you could easily open up a different screen. This small update should make the interface more intuitive, letting you swipe the pop-up off-screen either to the left or right (in a previous developer preview you could only swipe to the left).",
    "Android 12 is expected to enter beta release by May, with a final release version likely to launch for the public later this year. Exactly what it’ll land on your smartphone is unclear, though.",
    "So far Android 12 has focused on more of these improved user experience upgrades. Developer Preview 1 included more efficient video and image compression, blocks to repeated notifications and app icon updates for more home screen customization.",
    "The next Developer Preview showed us some improvements for round-edged phones and a change to smoother transitions to picture-in-picture. So there’s nothing mind blowing so far, but these smaller improvements will likely have more of an impact on your day-to-day experience.",
    "We’re aren’t likely to see any more big changes incoming, but when any more Android 12 features are announced we’ll be sure to explain how they’ll work and the impact they could have on your Android smartphone."
  ],
  "headers": {
    "3": "What other features are coming to Android 12?"
  },
  "links": {
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android 12": "https://www.techradar.com/news/android-12-news"
  }
}