{
  "source": "https://www.techradar.com/news/what-time-is-the-conjuring-the-devil-made-me-do-it-released-on-hbo-max",
  "title": "What time is The Conjuring: The Devil Made Me Do It released on HBO Max?",
  "category": "entertainment",
  "updated": "2021-06-04T08:14:56Z",
  "author": "samuel-roberts",
  "summary": "You can watch this week's big new HBO Max release now",
  "article": [
    "Update: The Conjuring: The Devil Made Me Do It is now streaming on HBO Max for those on the $14.99 subscription tier.",
    "Original story: Want to know when new movie The Conjuring: The Devil Made Me Do It releases on HBO Max in the US this Friday, June 4? The latest in the horror series will land on the service at a minute after midnight Pacific time, following the pattern of other HBO Max releases. Scroll down for an exact time where you are.",
    "The third in The Conjuring trilogy sees Patrick Wilson and Vera Farmiga reprise their respective roles as paranormal investigators Ed and Lorraine Warren. This time, they're taking on an extremely high-profile case, after a young man accused of murder argues he was possessed by a demon. Can the pair untangle this web and discover the truth?",
    "Critics are mostly positive on this one, which will be available on HBO Max for 31 days once it releases, at the same time it hits theaters. Factoring in spin-offs like the Annabelle series, this is the eighth movie set in The Conjuring universe – which began all the way back in 2013. It's the latest in HBO Max's impressive range of new movie premieres, the next of which is the musical In The Heights, which hits the service on June 11.",
    "Here's everything you need to know about when The Conjuring: The Devil Made Me Do It releases on HBO Max.",
    "We double-checked this with HBO Max – The Conjuring: The Devil Made Me Do It will be available at 12.01AM PDT / 3.01AM EDT on Friday, June 4 on the streaming service. So, if you were hoping to watch it the second it drops, be prepared for a very late night.",
    "This is standard timing for new HBO Max content. Note that you can only watch The Conjuring: The Devil Made Me Do It during these 31 days if you're subscribed to the $14.99 standard tier of HBO Max – the cheaper ad-supported tier does not offer the day-and-date new movie releases.",
    "If you're UK-based, you don't have access to HBO Max, so unfortunately you can't stream the movie. You can go see it in cinemas if you're comfortable doing so, though – it was released in the UK on May 26. So, while you might lack the convenience of being able to stream it, you at least had a week's head start on US viewers."
  ],
  "headers": {
    "5": "What time is The Conjuring: The Devil Made Me Do It released on HBO Max?",
    "7": "Can you stream The Conjuring: The Devil Made Me Do It in the UK?"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained"
  }
}