{
  "source": "https://www.techradar.com/news/the-original-star-wars-clone-wars-still-kicks-ass",
  "title": "The original Star Wars: Clone Wars still kicks ass",
  "category": "entertainment",
  "updated": "2021-03-20T14:00:35Z",
  "author": "richard-edwards",
  "summary": "The legacy of the classic Star Wars: Clone Wars 2D cartoon lives on, and it's coming to Disney Plus in April",
  "article": [
    "Trade disputes? Midi-chlorians? Whiny teen romance? A Star Wars fan craves not these things. Nonetheless, that’s what George Lucas gave them when he unleashed his divisive prequel trilogy on the world – though it soon turned out he hadn’t entirely forgotten about the adventure and excitement that made a generation fall in love with a certain galaxy far, far away….",
    "First released on the Cartoon Network in 2003, the original, 2D Clone Wars cartoon was Star Wars with the talky bits surgically removed. Set just after Attack of the Clones had kickstarted the galactic conflict that would subsequently conclude in 2005’s Revenge of the Sith, it was our first proper glimpse of the skirmish Obi-Wan Kenobi had teased in A New Hope.",
    "And even though the first run of episodes clocked in at just three minutes apiece, you rarely felt short-changed on the storytelling front – it was like watching Star Wars on fast forward. The contrast with the often-ponderous prequel movies couldn’t have been starker.",
    "For its first animated Star Wars show since ’80s spin-offs Droids and Ewoks, Lucasfilm turned to Genndy Tartakovsky. At that point the animator was already hot property, best known for his work on Cartoon Network hits Dexter’s Laboratory and Samurai Jack – he’d later go on to direct the Hotel Transylvania movies, and help future The Mandalorian creator Jon Favreau storyboard action sequences in Iron Man 2.",
    "Tartakovsky brought an entirely new aesthetic to the Star Wars galaxy. While the characters, creatures and spaceships were mostly lifted from the movies, he gave them a highly stylized, angular look heavily influenced by anime. And – much like JJ Abrams, Rian Johnson and Favreau himself a decade later – he was given license to reimagine Star Wars with the eyes of a fan, in a way the franchise’s creator, Lucas, never could. The result was a blur of whirling lightsabers and blaster fire, that also managed to push the boundaries of physics like a Looney Tunes cartoon.",
    "While the Expanded Universe that existed beyond the Star Wars movies was nowhere near as vast, prominent or complex as it is now, Tartakovsky’s show displayed considerable understanding – and affection for – what had come before. One episode, for example, showcased an army of IG assassin droids jetting into battle, while another featured Ortolans, the blue elephant-like race that counts Max Rebo (of Jabba’s house band fame) as a member.",
    "There were also casual references to key Star Wars locations like Dantooine and the fourth moon of Yavin, authentic sound effects, and fun in-jokes – the look of Muunilinst, home of the Intergalactic Banking Clan, was inspired by the US dollar bill.",
    "Jedi who had previously been little more than faces in the council chamber on Coruscant suddenly got the chance to lead their own episodes. The amphibious Kit Fisto memorably headed underwater to settle a dispute between the Mon Calamari and trident-wielding Quarren on Mon Cala – it was like watching Aquaman 15 years early.",
    "And proving that Clone Wars was never regarded as a throwaway kids’ show, it was notable for introducing key elements of Star Wars lore, such as Anakin Skywalker's ascension to the rank of Jedi Knight, or the first screen appearance of lightsaber-powering kyber crystals. Episode III villain General Grievous (originally voiced by Futurama’s John DiMaggio) made his debut in the cartoon as Count Dooku’s protégé, alongside wannabe Sith (and future fan favorite) Asajj Ventress. And even though conversation was never a priority, Clone Wars still found time to develop Anakin’s secret relationship with Padme, or Palpatine’s Machiavellian scheming – especially in a third season that upped each episode’s runtime to 12 minutes.",
    "According to animator Bryan Andrews, one of Lucas’s directives was that “we want you to animate the opening crawl [for Revenge of the Sith]”. Clone Wars delivered on that front, too, culminating with Palpatine being captured by Grievous, and a space battle brewing in the skies above Coruscant. With a total duration of two hours, the 25 instalments of the Clone Wars added up to Episode 2.5 in all but name.",
    "Finally, after a long period in the wilderness – the series was available in unauthorized form on YouTube, and via used DVDs on eBay – Disney Plus is rolling the show out on April 2, 2021, giving all Star Wars fans a chance to watch it at their leisure.",
    "After the show finished its all-too-brief run in 2005, its thunder was subsequently stolen by a CG-animated namesake that ran for seven seasons (from 2008), and became as integral to official Star Wars continuity as the movies. Soon after Disney bought Lucasfilm in 2012, Tartakovsky’s show joined Ewoks, Droids, Caravan of Courage: An Ewok Adventure and numerous Expanded Universe novels and comics in the Star Wars Legends range of stories that are no longer considered canon.",
    "Even so, the 2D Clone Wars’ fire hasn’t gone out of the universe entirely. While the CG version of The Clone Wars largely rewrote Anakin and Obi-Wan’s adventures between Episodes II and III, showrunner Dave Filoni (now a key player on The Mandalorian and spin-offs like Ahsoka) was clearly heavily influenced by Tartakovsky’s take on Star Wars. Familiar storylines – like aforementioned Mon Calamari/Quarren tiff on Mon Cala – are reimagined, while characters who first came to prominence in the earlier cartoon (such as Ventress or Jedi Padawan Barris Offee) received meaty story arcs. There are also clear echoes in the character design.",
    "The CG Clone Wars, Star Wars Rebels and Star Wars Resistance may have dipped deeper into Star Wars lore, but it’s unlikely any of Lucasfilm’s more recent animated shows would have had the chance to plug the gaps between the movies had Tartakovsky’s turbo-charged cartoon not blazed a trail first. Clone Wars deserves to be a series long remembered, and is more than worthy of its newfound place on Disney Plus. It may no longer be canon, but it’s not like putting the infamous Star Wars: Holiday Special up there, is it?",
    "Both volumes of Star Wars: Clone Wars will release on Disney Plus on April 2."
  ],
  "headers": {
    "3": "Return of the Genndy",
    "10": "Forgotten Wars"
  },
  "links": {
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Star Wars Legends": "https://www.starwars.com/news/the-legendary-star-wars-expanded-universe-turns-a-new-page",
    "Ahsoka": "https://www.techradar.com/news/the-mandalorian-spin-offs-ahsoka-and-rangers-of-the-new-republic-explained"
  }
}