{
  "source": "https://www.techradar.com/news/blink-vs-arlo-which-home-security-system-is-best-for-you",
  "title": "Blink vs Arlo: which home security system is best for you?",
  "category": "smart-home",
  "updated": "2021-10-06T18:19:22Z",
  "author": "simon-hill",
  "summary": "These affordable smart camera systems cover indoors and out",
  "article": [
    "The best home security cameras are a great way to check in on your property when you’re not around, ensuring you to confirm all is well with your home. They’re one of the best lines of defense in your home security strategy, so it’s not surprising almost 20% of US homes have a home security camera installed, according to Safety.com’s home security survey.",
    "Arlo is one of the biggest names in the home security market right now, but it comes with a pretty hefty price tag, whereas Blink - a home security brand owned by Amazon - is more affordable and snapping at Arlo’s heels.",
    "Blink isn't the only Amazon-owned security brand, the tech giant also backs video doorbell and home security camera company Ring. Find out how the two brands differ in Blink vs Ring.",
    "Arlo and Blink offer very similar motion-sensing home security cameras, but that may leave you struggling to decide which is best suited to you. Fear not, we’ve tested a range of devices from both brands to give you the low-down.",
    "Read on to discover how these two home security camera systems compare – or, if you’ve already decided which of the two you wish to buy, check out the best prices right now for Blink and Arlo home security cameras:",
    "So just how much will you have to lay out for this plethora of home security devices? Blink’s cameras are slightly more affordable than Arlo’s offering, although they’re not available in Australia, unlike Arlo’s cameras.",
    "The Blink Mini is the brand’s most affordable home security camera and is priced at $34.99 / £34.99 (AU$50), while the Blink Indoor will set you back $79.99 / £79.99 (AU$110) for a one- camera kit, $139.99 / £139.99 (AU$190) for a two-camera kit and $189.99 / £189.99 (AU$350) for a three-camera set.",
    "The Blink Outdoor is the priciest offering at $99.99 / £99.99 (AU$130) for a one-camera kit, $179.99 / £179.99 (AU$240) for a two-camera kit and $249.99 / £249.99 (AU$335) for a three-camera set.",
    "When it comes to storing videos recorded by Blink cameras, they can either be saved in the cloud - all Blink cameras come with a free trial, which in the US lasts 30 days, while in the UK it’s available until September 2021. Once the trial expires it’ll cost you $3 / £2.50 per month if you want to review footage captured by the security camera at a later date.",
    "Alternatively, the footage can be stored locally, as long as you have a Blink Sync module 2, which comes bundled with the Blink Indoor and Blink Outdoor camera, or costs at $34.99 / £34.99 if purchased separately. You’ll also need a 256 GB USB flash drive (around $25 / £25) to enable local storage - this isn’t provided with any of the cameras.",
    "When it comes to Arlo, its most affordable security camera is the Arlo Essential Indoor Camera, which will cost you $99 / £119.99 / AU$159.99 while weatherproof cameras that can be used outside start from $129.99 / £129.99 / AU$229 for the Arlo Essential Spotlight camera.",
    "The Arlo Pro 2 is priced from $399.99 / £569.99 / AU$450 while Arlo’s top-of-the-range Ultra 2 starts from $599.99 / £629.99 / AU$1,049.99.",
    "Arlo’s cloud storage service is called Arlo Smart and costs $2.99 / £2.49 / AU$4.49 per month per camera if you want to store footage in up to 2k. Alternatively, it’s priced at $9.99 / £7.99 / AU$14.99 per month for up to five cameras.",
    "To store footage recorded in 4K (only the Arlo Ultra and Ultra 2 can record at this resolution at present) it costs $4.99/ £3.99 / AU$7.49 per camera per month or $14.99 / £12.49 / AU$ 21.99 per month for up to five cameras.",
    "All four options store video for up to 30 days and all of the cameras come with a three-month free trial. Local storage is available for those cameras that come with a base station, although it’s worth noting that you won’t be able to view the footage in the Arlo app if it's stored locally.",
    "If you purchase some of Arlo’s older home security cameras such as the original Arlo, Arlo Pro, or Arlo Pro 2, these include seven days of cloud recording free of charge, although you will need the premium Arlo Smart service if you want to review the video for up to 30 days after it’s been recorded or want the source of the motion to be identified.",
    "When it comes to choice, Arlo offers more choice than Blink when it comes to the number of different models of home security cameras available, but that’s not to say they don’t offer similar features. So get ready as we run down just what’s on offer.",
    "Powered by removable batteries, Arlo’s top-of-the-range home security cameras are weatherproof so they can be used inside or outdoors. They use a base station to connect to the internet via an Ethernet cable attached to your router, rather than pairing directly with your home Wi-Fi network. As well as increasing the range of the cameras, this also ensures the cameras remain secure and the video feed is less likely to be intercepted.",
    "The Arlo Ultra and Arlo Ultra 2K both record color footage in 4K during the day and at night, although the Arlo Ultra supports both 2.4GHz and 5GHz Wi-Fi rather than just 2.4GHz and has an increased range, which should reduce connectivity issues.",
    "The Arlo Pro 4 can only record video at a resolution of 2K, but aside from that, it offers the same features as the Arlo Ultra and Ultra 2, along with the ability to connect directly to your home Wi-Fi network rather than needing a base station.",
    "The Arlo Pro 3 offers the same features as the Arlo Pro 4 but can’t connect directly to your home Wi-Fi network, while the Arlo Pro 2 records in color Full HD during the day and black-and-white Full HD video at night.",
    "There’s also the Arlo Pro 3 Floodlight, which acts as a security light to illuminate when motion is detected as well as recording footage.",
    "They’re not the only cameras Arlo offers, it's more affordable Essential range features three models of Full HD camera that don’t require a base station.",
    "The Arlo Essential Spotlight and Arlo Essential XL Spotlight are battery-powered (the XL version battery lasts up to one year between charges compared to the six months offered by the Essential Spotlight) and can be used indoors or outside.",
    "These are joined by the Essential indoor camera - a wired device designed for inside the home, which includes a privacy shutter to offer peace of mind to those that worry their every move is being watched. On top of that, the Arlo Go is a Full HD battery-powered security camera that connects to mobile data rather than Wi-Fi - making it good for areas your home network doesn’t reach.",
    "As we’ve already mentioned, Blink’s offering is much smaller with just three models to choose from. Its top-of-the-range home security camera is Blink Outdoor - a Full HD device that’s weatherproof so it can be used outside or indoors and is powered by two AA lithium batteries. Blink Indoor is a version of the battery-powered camera designed for use inside the home. Finally Blink Mini is a compact FullHD wired security camera, again suitable for indoor use only.",
    "On the whole, Blink and Arlo’s home security cameras are evenly matched when it comes to video and audio quality. We’ve reviewed the majority of the products offered by both brands, and in our tests the video has always been clear and detailed, while the audio has always been extremely coherent.",
    "However, in our eyes Arlo trumps Blink in two areas of audio and video quality; one being that some cameras can record in 2K and 4K resolution. This means you’ll be able to capture a wider area without losing detail in the video - ideal if you’re mounting the cameras outside and up high; for example to ensure they capture the whole of your driveway.",
    "The second is the inclusion of spotlights in several of the cameras to provide color footage at night as well as during the day - this isn’t something any of Blink’s cameras offer.",
    "Both Blink and Arlo have a number of handy features that can reduce the number of false-positive motion alerts you receive; such as assigning activity zones so you’re not notified unless motion is detected in these areas, and scheduling when the camera should be monitoring for motion and when it shouldn’t.",
    "However once again Arlo just pips Blink to the post here thanks to its smart features. As well as being able to identify whether the motion has been created by a persona, animal, vehicle or another source such as wind rustling in the trees, Arlo cameras also offer rich notifications to your phone, providing you with a snapshot of the motion - so you can easily decide if you should launch the app and investigate, or ignore the alert.",
    "Both Blink and Arlo cameras will integrate with voice assistants, so you can use the best smart speakers to converse with anyone in the camera’s field of view and see a live feed from the camera through the best smart displays.",
    "Arlo is the clear favorite here, as all of the home security cameras and video doorbells integrate with Amazon Alexa and Google Assistant, while some of their devices also offer Apple HomeKit integration.",
    "Blink’s cameras however are only compatible with Alexa, which isn’t surprising since Blink is an Amazon-owned brand.",
    "Blink is a basic, affordable camera system with no ongoing running costs beyond the batteries, which makes it an attractive option for anyone looking to dip a toe into home security cameras.",
    "Both systems are very easy for the average homeowner to install and use, but Arlo is potentially much more sophisticated with a range of different devices, software smarts, and greater smart home integration.",
    "However, to get the most from Arlo you’ll need to go for a monthly subscription on top of the already higher initial outlay for the hardware, so would suit someone looking for a wider range of control as well as a varying degree of needs around the home when it comes to automation and monitoring."
  ],
  "headers": {
    "4": "Best Blink and Arlo deals",
    "5": "Price",
    "16": "Range",
    "26": "Video and audio",
    "29": "Smart features",
    "34": "Verdict"
  },
  "links": {
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Safety.com’s home security survey": "https://www.safety.com/home-security-survey/",
    "Blink vs Ring": "https://www.techradar.com/news/blink-vs-ring-what-are-the-differences-between-amazons-cams",
    "Arlo Ultra": "https://www.techradar.com/reviews/arlo-ultra",
    "Arlo Pro 3": "https://www.techradar.com/reviews/arlo-pro-3",
    "Arlo Pro 2": "https://www.techradar.com/reviews/netgear-arlo-pro-2",
    "Arlo Essential Spotlight": "https://www.techradar.com/reviews/arlo-essential-spotlight-review",
    "Essential indoor camera": "https://www.techradar.com/reviews/arlo-essential-indoor-camera",
    "Blink Mini": "https://www.techradar.com/reviews/blink-mini"
  }
}