{
  "source": "https://www.techradar.com/news/how-to-use-a-juicer-save-time-and-money-juice-extracting-at-home",
  "title": "How to use a Juicer: Save time and money juice extracting at home",
  "category": "appliances",
  "updated": "2021-08-30T07:00:00Z",
  "author": "helen-mccue",
  "summary": "Everything you need to know about juicers and how to make the best juice at home",
  "article": [
    "Fruit and vegetable juice is a refreshing beverage that’s grown in popularity over the past two decades. Sipping a glass of Orange juice with your breakfast may once have been the norm, but now there’s a wide array of unusual but tasty concoctions on offer, both in juice bars and in the grocery store.",
    "The best juicers make it easier to enjoy a tasty combination of fruit and vegetable extracts, at home. Whether you’re just looking to get your five-a-day in a more interesting and varied way, or you’re embarking on a juice cleanse in a bid to detox, juicers make it much more affordable and more convenient than buying ready-made juices from the grocery store. In fact, Statista estimates that 1.49 million juices were sold to consumers in 2019.",
    "That isn't really surprising, when you consider the average American consumed six gallons of juice in 2018, while the juice and smoothie bar market was worth $2.62 billion in 2019, research by Statista has revealed.",
    "If you're considering joining the millions that already own a juice extractor, or you’re a juicing novice and want to create refreshing juice with as little effort as possible, you may be wondering just how these kitchen appliances work, what you can actually do with them and do you really need one?",
    "Read on to found out just how juicers work, or if you want to get your hands on one of the best juicers right now, check out these great deals for some of the best prices on the market.",
    "Juicers work by chopping or grinding fruit and vegetables that have been pushed down a chute, to extract the liquid. The flesh, pith, and skin, which is collectively known as pulp, is considered a waste product and discarded by the juicer into a separate container, leaving a smooth, pulp-free drink.",
    "Some juicers come with strainers that can divert some of the pulp into your drink, which considering it contains healthy fiber as well as other vitamins and minerals, is certainly beneficial.",
    "If you’re trying to reduce food waste, there are plenty of ideas online for using up pulp discarded by a juicer, such as these six delicious recipes.",
    "There are two different types of juicers; centrifugal juicers and cold press juicers, which are also known as slow juicers or masticating juicers, and they work in slightly different ways.",
    "Centrifugal juicers use spinning blades to chop up the fruit and vegetables, and as the name would suggest, the cut-up pieces are pushed against a fast-spinning strainer using centrifugal force, this separates the juice from the pulp.",
    "Centrifugal juicers are the most affordable style of juicer on the market, which makes them a good choice if you’re new to juicing and don’t want to invest too much in an extractor. They have large feed chutes that can usually take whole fruits like apples without the need to chop them up first, and they’re very quick at extracting the juice.",
    "However, the fast speeds can create a lot of froth on top of the juice and juice yields (the amount of juice extracted) can be lower than you get from a cold press juicer. They don’t usually manage to extract much juice from leafy greens like kale.",
    "Cold press or slow juicers work by slowly grinding up the fruit and vegetables and pushing the mixture through a filter to extract the juice.",
    "A good cold press juicer will produce very dry pulp and high juice yields, so there’s much less waste than you get with a centrifugal juicer. They also make juice with very little, if any, froth on top and are much more effective when it comes to harder-to-juice foods like leafy greens.",
    "They’re more expensive than centrifugal juicers, so they’re not ideal if you’re on a budget. That said if you do a lot of juicing, over time they make up for the higher price tag by producing more juice and less waste. They are slower and usually, there’s much more prep involved because they have smaller feed tubes so your juice ingredients need cutting up before juicing.",
    "All juicers will have different requirements for peeling, but as a general rule, you don’t need to peel the skin if you would usually eat it. So, for fruits like apples and pears where you would usually eat the skin, there’s no need to peel before juicing but it’s worth removing the stalk and some juicer manuals will advise removing the core too. There’s no need to peel carrots either but you would usually cut the tops off.",
    "If you would never eat the skin when eating the fruit whole, then don’t juice it either. This is true for things like citrus fruits, melon, and pineapple. Not only do you want to avoid juicing the parts you wouldn’t normally eat, but these tough and fibrous skins might also damage your juicer. For fruits with a big stone inside, like peaches, mango, or even cherries, you’ll need to cut out the stone before the fruit goes into the juicer so you don’t damage the juicer.",
    "The simple answer is yes, you can usually juice all citrus fruits in both centrifugal and cold press juicers, but as we’ve already mentioned you’ll need to peel or cut off the skin first. However, if you’re planning on juicing a lot of citrus fruits it’s worth thinking about whether a citrus juicer is a better option for you.",
    "You’ll get better juice yields from a citrus juicer as they’re specifically designed to be efficient at extracting juice from citrus, plus you’ll usually only need to cut your oranges in half instead of peeling them completely. Available as manual or electric versions, they’re cheaper than many centrifugal and cold press juicers too.",
    "We won’t lie to you, juicers can be tricky to clean! Lots of juicers can be fiddly to assemble and disassemble with several parts that make cleaning a bit awkward. If the fiddly cleaning is putting you off, look for a juicer with dishwasher safe parts, plenty of models now come with dishwasher safe parts to make cleaning easier."
  ],
  "headers": {
    "5": "So, how do juicers work?",
    "9": "What is a centrifugal juicer?",
    "12": "What is a cold press juicer?",
    "15": "Do fruits and vegetables need to be peeled before juicing?",
    "17": "Can I juice Citrus in a standard juicer?",
    "19": "How to clean a juicer?"
  },
  "links": {
    "best juicer": "https://www.techradar.com/news/best-juicer",
    "Statista": "https://www.statista.com/statistics/1176158/juice-and-smoothie-bar-industry-market-size-us/",
    "six gallons of juice in 2018": "https://www.statista.com/statistics/297320/us-fruit-juice-consumption/",
    "six delicious recipe": "https://www.huffingtonpost.co.uk/entry/juicer-pulp-recipes_n_579773d7e4b02d5d5ed2dd62"
  }
}