{
  "source": "https://www.techradar.com/news/vodafones-nb-iot-network-now-covers-98-of-the-uk",
  "title": "Vodafone's NB-IoT network now covers 98% of the UK",
  "category": "computing",
  "updated": "2021-07-20T13:40:55Z",
  "author": "steve-mccaskill",
  "summary": "Vodafone's LPWAN for IoT has near-nationwide coverage",
  "article": [
    "Vodafone’s Narrowband-IoT network (Nb-IoT) now covers 98% of the UK’s landmass, strengthening the operator’s bid to be a leader in IoT connectivity.",
    "The company has been one of the biggest supporters of NB-IoT, a Low Power Wide Area Network (LPWAN) technology designed for use cases where power consumption and battery life are more important factors than bandwidth.",
    "Mass IoT projects deploy sensors across a wide geographic area, often in hard-to-reach places, and are designed to be untouched for several years. Any change to that plan, such as a battery replacement, is either logistically challenging or upsets the economics of the entire project.",
    "Although traditional mobile networks have a clear advantage over other forms of IoT connectivity like Wi-Fi, Bluetooth, and Sigfox, they use more energy. The propagation and power consumption characteristics of NB-IoT ensure it can connect devices that need to be in place for more than five years.",
    "For applications that require a stronger signal, coverage drops to 87%, but Vodafone will see if it can extend its network on a case-by-case basis.",
    "Vodafone sees NB-IoT as complementary to its other connectivity services, such as 4G 5G, which can deliver greater bandwidth and a constant connection. This, it argues, allows it to offer flexible, tailored services for customers bade on their needs.",
    "“NB-IoT is a part of our network that is often overlooked, but it but it is becoming increasingly important, bringing data from a growing variety of devices to power decision-making in more organisations,” said Anne Sheehan, Business Director, Vodafone UK.",
    "“This is a network which has been designed for low-bandwidth devices, allowing for coverage that goes beyond 4G, and devices where battery life could be extended to as long as ten years. In IoT, customers might want to use our 4G network for real-time, data-intensive analytics, while others might need a connectivity solution for non-time sensitive use cases, such as environmental monitoring.",
    "“We have invested in NB-IoT because we want to offer our customers the right tools for the right job, in a way which is affordable and accessible for every customer.”",
    "Vodafone is also building outs its NB-IoT network across its European networks and has held roaming trials with other mobile operators."
  ],
  "headers": {
    "3": "Vodafone IoT"
  },
  "links": {
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know"
  }
}