{
  "source": "https://www.techradar.com/news/xbox-game-pass-for-pc-is-a-frustrating-mess-heres-why",
  "title": "Xbox Game Pass for PC is a frustrating mess",
  "category": "gaming",
  "updated": "2021-06-08T16:34:11Z",
  "author": "rhys-wood",
  "summary": "Opinion: Xbox Game Pass for PC needs more time in the oven",
  "article": [
    "There’s no denying that Xbox Game Pass is one of the most appealing business models around. It lets subscribers download and play hundreds of games that span multiple genres, from triple-A blockbusters to indie darlings, all for a low monthly fee.",
    "This would usually be cause for much praise, but today we’re talking about Xbox Game Pass for PC, where the situation isn’t quite so rosy.",
    "Xbox Game Pass for PC is the antithesis of its console counterpart. While Game Pass on Xbox One and Xbox Series X/S features its own neat and tidy section on the dashboard, the PC app remains an unorganized nightmare. Plagued with issues from day one like a confusing interface, semi-hidden options, poor optimization, page load bugs and more, Xbox Game Pass for PC is barely worth a look as it stands.",
    "And that’s a crying shame, considering the things Xbox Game Pass for PC gets right. For one, it’s bolted onto your Xbox Game Pass Ultimate subscription, so there’s no need to pay extra for the service. There’s also a bunch of games available to play on PC that aren’t on the console version on Game Pass, such as Crusader Kings 3 and the Age of Empires series. Xbox Game Pass for PC could be great, but the following five issues are holding the service back.",
    "Checking out all games available on Xbox Game Pass for PC should be an easy endeavor, but the app makes sure this isn’t the case. Clicking the “All PC Games” tab does indeed take you to an overview of every game available on the app, but it routinely seems to arbitrarily give up loading the page.",
    "Sifting through the list, you’ll often hit a block where the page ceases to scroll. That’s not because you’ve reached the end of the page (that’s right, MotoGP 20 certainly isn’t alphabetically the last game in the list), but rather that the page has decided it won’t load anymore.",
    "This can be fixed by scrolling back up a bit, then scrolling down again to reveal more games that the app previously refused to show. But this has to be done continuously until you’ve reached the end of the page, and sometimes even that doesn’t work. For comparison’s sake, Xbox Game Pass on console doesn’t have this issue – “All Games” will indeed show you all games from the get-go, making this PC bug all the more aggravating.",
    "Xbox Game Pass for PC is home to many games with significant file sizes, such as Gears 5, Control and Dirt 5. What you might not know is that you may want to think twice before even installing them on your system, lest you potentially forfeit that storage space long after you’ve uninstalled the game.",
    "The issue here is that you technically don’t own the games present on the Xbox Game Pass service. Your monthly subscription instead grants you access to the games in the library, most of which are only there for a limited period of time. As such, your PC often has to store crucial files in a “locked away” part of your storage to ensure they can be managed server side.",
    "This changes on a game-by-game basis, but some users have reported not being able to get that storage space back again after they’ve uninstalled a game – those files are still being locked away for good.",
    "What’s worse is that the official workaround from Microsoft seems to be to either reboot your PC via the Run function or seek help through the Windows Store Apps troubleshooter, hardly helpful advice for those who aren’t as PC savvy – and an annoying workaround for those that are.",
    "Strangely, this isn’t a bug. Xbox Game Pass for PC may not work as intended if you’re not signed in on two different storefronts with the same account. In layman’s terms, you have to be signed in to the Xbox Game Pass for PC app, and the Microsoft Store using the same account.",
    "Why? Because the app is tied to Windows 10’s disaster of a storefront. If you haven’t signed in to the Microsoft Store, you won’t be able to run the games you’ve downloaded on the Xbox Game Pass for PC app.",
    "To remedy this, click your account’s icon in the top right corner of the Xbox Game Pass for PC app, followed by Settings. On the Account tab, click “Change my Microsoft Store account” and ensure you’re logged in on both services with the same account. This shouldn’t even need to be a step, but it’s something you need to keep in mind each time you open the Xbox Game Pass for PC app.",
    "If you’re an avid PC gamer, you likely won’t have as many games installed via Xbox Game Pass for PC as you would on Steam, for example, so you'd think that sorting through your minimal library of downloaded games would be easy. And yet, the former’s game sorting options are way too basic.",
    "The Collection tab on the left of the Xbox Game Pass for PC app displays all the games you have installed. The problem here is that there’s little to no options to sort these games to your liking. You can display them in alphabetical or reverse alphabetical order, and that’s about it.",
    "Let’s compare this to Steam, where sorting options are much more robust. You can create your own folders for specific types of games, for example. I personally love fighting games, so I have a folder in my Steam library dedicated to just that.",
    "On Xbox Game Pass for PC, I’m simply not able to sort my installed games by genre, file size or anything of the sort. Granted, most installed libraries on Xbox Game Pass for PC won’t be monolithic, but extra sorting options can never hurt and only add to the app’s overall accessibility.",
    "Xbox Game Pass for PC falls into the same trap Windows 8 and (to a lesser extent) Windows 10 did: the need to make the app look flashy and stylish while leaving functionality as an afterthought.",
    "As a result, Xbox Game Pass for PC isn’t well optimized, especially if your PC isn’t blessed with high-end components that are required to run the app adequately.",
    "It doesn’t help that screenshots, purchase options, DLC and achievements are placed front and center on each game’s dedicated page, either. System requirements are buried under the “More” option that’s a lot smaller than it should be, and crucial accessibility information like photosensitivity warnings are tucked away at the very bottom of this menu, too, instead of being shown on any game’s front page to help minimize risk.",
    "Xbox Game Pass for PC has a lot of work ahead of it, then, if it wants to become as organized and easy to use as its Xbox console counterpart. If Microsoft can address these issues, though, it will show that Xbox Game Pass is a formidable platform across both console and PC. So here's hoping the above issues can eventually become a thing of the past."
  ],
  "headers": {
    "4": "Unresponsive browsing experience",
    "7": "Locking you out of your own storage",
    "11": "The double sign-in combo",
    "14": "Less than basic sorting options",
    "18": "Style over substance"
  },
  "links": {
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Game Pass for PC": "https://www.techradar.com/how-to/how-to-set-up-xbox-game-pass-for-pc",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Crusader Kings 3": "https://www.techradar.com/best/best-pc-strategy-games-the-top-15-pc-strategy-games-of-all-time",
    "Age of Empires": "https://www.techradar.com/news/xbox-game-studios-finally-reveals-all-about-age-of-empires-4",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review",
    "Control": "https://www.techradar.com/reviews/control-review",
    "some users have reported": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-8286690094546967000&murl=https%3A%2F%2Fanswers.microsoft.com%2Fen-us%2Fxbox%2Fforum%2Fxba_wowpc-xba_gowxb%2Fcancelled-game-download-still-taking-up-space-on%2F171bc271-de21-47d0-979f-64c6821a3016",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}