{
  "source": "https://www.techradar.com/news/new-apple-airtags-update-is-designed-so-people-cant-use-them-to-track-you",
  "title": "New Apple AirTags update is designed so people can't use them to track you",
  "category": "phones",
  "updated": "2021-06-04T08:53:10Z",
  "author": "james-peckham",
  "summary": "And a similar feature for Android phones",
  "article": [
    "Apple AirTags are only a month old, but the company has already issued a software update to tweak some of the features after the general public began using them.",
    "The biggest change is that AirTags will now make a noise at a random time within eight to 24 hours of them being 'lost'. Previously this was set to three days by default, and this new change is for privacy reasons.",
    "The change is to discourage AirTags being used to track people without their knowledge, and the hope is that it'll make a noise when it's on your person (or in your bag or luggage) to alert you to its presence.",
    "iPhones also have an alert system built-in that notifies you if you're traveling with an a suspicious AirTag too. What happens if you have an Android phone? Apple has confirmed it's working on an Android app that you'll be able to use to see if you have any AirTag devices travelling with you.",
    "It's not entirely clear how that'd work if you're traveling with someone who has an AirTag. You'll also need to manually download this app to be certain you aren't being tracked, so that's a step that many won't take.",
    "Apple has told CNET we'll be seeing more details on this app later this year, so it sounds like it'll likely be a bit of a wait until you can get this app on your Android device.",
    "Own an Apple AirTag? These updates will begin rolling out now, and you'll find your AirTag will automatically update when near to your iPhone, so you won't manually have to do anything to download the update.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "CNET": "https://www.cnet.com/news/apple-bolsters-airtag-privacy-measures-to-offer-android-detector-app-later-this-year/",
    "GSMArena": "https://www.gsmarena.com/apple_hints_at_android_app_for_airtags_new_update_discourages_unwanted_tracking-news-49454.php"
  }
}