{
  "source": "https://www.techradar.com/news/amd-brings-auto-overclocking-and-windows-11-support-to-its-radeon-graphics-cards",
  "title": "AMD brings auto-overclocking and Windows 11 support to its Radeon graphics cards",
  "category": "computing",
  "updated": "2021-09-13T21:57:04Z",
  "author": "john-loeffler",
  "summary": "FidelityFX Super Resolution support grows as well",
  "article": [
    "AMD's latest Radeon Software Adrenalin release for its best graphics cards is bringing some brand new features for fans of Team Red, including a more streamlined auto-overclocking experience for Radeon graphics cards on AMD Ryzen powered machines, new Windows 11 support, and even some new features for older cards.",
    "The new Adrenalin release adds three major features on the hardware side of things. First, it provides a simplified hardware performance tuning experience for desktop PCs powered by AMD Ryzen 5000-series processors with AMD's latest Radeon RX 6000-series graphics cards, like the RX 6800 XT and RX 6600 XT.",
    "With the new release, the CPU and GPU overclocking options will be in the same hardware control tab, allowing you to more easily fine tune the performance of the two to maximize their performance when working together.",
    "The new update also expands Windows 11 support to Radeon cards, enabling features like Radeon Boost, Radeon Anti-Lag, and Radeon Image Sharpening. This should considerably improve the Windows 11 experience for most Radeon users who have already downloaded the Windows 11 Insider Preview build and help any fence sitters out there who've been waiting for better hardware support to jump into trying out the new OS.",
    "The last major hardware update in the new Adrenalin release is also geared more towards some of the older hardware out there. AMD Smart Access Memory support is now being extended to AMD Radeon RX 5000-series graphics cards, which will speed up performance when paired with AMD Ryzen 5000-series and some Ryzen 3000-series processors and AMD 500-series motherboards.",
    "You can download the new release now from AMD's site.",
    "In addition to the new Adrenalin software release, AMD also updated the list of games that support AMD FidelityFX Super Resolution, AMD's answer to Nvidia's DLSS super sampling technology. The new titles include:",
    "In addition, titles like World War Z: Aftermath, JX3, F1® 2021 and No Man’s Sky are expected to roll out FSR support in the coming weeks.",
    "While the newest graphics card hardware like AMD's RX 6800 and Nvidia's RTX 3080 suck up a lot of the attention from developers and media alike, the reality is that very few people have actually been able to buy these new cards. Scalpers, cryptominers, and the ongoing semiconductor shortage make it all but impossible to buy these cards online and offline brick-and-mortar stores aren't a much better option.",
    "According to the latest Steam Hardware Survey for August 2021, the most popular graphics card in use is the Nvidia RTX 1060, with just over 10% of users surveyed. You have to go all the way down to number 13 to find an Nvidia Ampere card (RTX 3070), and eight of the top 10 cards are RTX 1000-series cards.",
    "In fact, not a single Big Navi graphics card appears in the nearly 100 graphics cards and mobile GPUs on the list, unless you count \"other\". All of the new, fancy features of the latest graphics card like ray-tracing are great, but the overwhelming majority of users simply don't have access to them, so its nice to see AMD continue to improve the performance of the older hardware that most of us actually have."
  ],
  "headers": {
    "8": "Analysis: it's nice to see some older hardware getting some love"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "new Adrenalin release": "https://community.amd.com/t5/blogs/amd-radeon-software-auto-overclock-and-windows-11-support/ba-p/488439",
    "RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "RX 6600 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6600-xt",
    "downloaded the Windows 11 Insider Preview": "https://www.techradar.com/news/how-to-download-windows-11",
    "AMD's site": "https://www.amd.com/en/support",
    "RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "offline brick-and-mortar stores aren't a much better": "https://www.techradar.com/news/life-in-the-queue-meet-the-gamers-camping-out-for-an-rtx-3080-ti-across-the-us",
    "Steam Hardware Survey for August 2021": "https://store.steampowered.com/hwsurvey/Steam-Hardware-Software-Survey-Welcome-to-Steam",
    "Nvidia RTX 1060": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/nvidia-geforce-gtx-1060-1325075/review",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi"
  }
}