{
  "source": "https://www.techradar.com/news/xbox-series-x-restock-in-usa-best-buy-walmart-target-microsoft-availability",
  "title": "Xbox Series X restock: Best Buy has stock right now – here's how to buy the console",
  "category": "gaming",
  "updated": "2021-08-30T10:44:49Z",
  "author": "matt-swider",
  "summary": "Our Xbox Series X restock Twitter tracker Matt Swider monitors US stores 24/7, and Microsoft's new pilot program is your best chance to buy the console",
  "article": [
    "Update: New Xbox Series X restock dates for this week have been analyzed by our Xbox restock tracker Matt Swider, so head on over to the updated news story.",
    "The Xbox Series X restock at Best Buy is happening right now, and our 27/7 Xbox restock Twitter tracker Matt Swider will send you an alert when it's in stock – if you follow his Twitter account and turn on notifications.",
    "It's officially been two weeks since the last Xbox Series X restock in the US but there's hope if you follow our 24/7 Xbox restock Twitter tracker Matt Swider, who will send you an alert when it's in stock – if you follow his Twitter account and turn on notifications. Best Buy, GameStop, Target and Walmart are among the dozen stores in the US we're tracking daily and, when the Xbox Series X restock happened in June, we observed it's in stock longer at each of these retail locations, especially compared to the more in-demand PS5 restock. There are also secret Xbox Series X restock opportunities: Target has daily morning restocks at a handful of zip codes, while Microsoft's Xbox Insiders program reserves the new console loyal customers.",
    "► When is Xbox restock? Follow our Xbox Series X restock Twitter tracker Matt Swider and turn on notifications for live restock news. It's the fastest way to get Xbox restock updates.",
    "► Don't buy from other Twitter users – which are all scams. Only buy from the US stores Matt alerts you about. No one will legitimately sell Xbox Series X for just $550.",
    "Click on this last major Xbox Series X restock date, when Best Buy had the $499 Xbox for sale at MSRP.",
    "The Microsoft store hasn't had a major restock in the US months. Why? It's partly because the company is now diverting some of Xbox Series X inventory to a pilot program designed to help its most loyal Xbox fans get the new Series X console.",
    "The Xbox Insiders Xbox Series X upgrade plan is actually a great incentive for people who want to beta test dashboard tweaks and other system updates that Microsoft is developing for its consoles, and if you're stuck testing things out on an old Xbox One and wanting to upgrade to new Xbox Series X, really you should be the first in line.",
    "Note: you'll need to power up your older Xbox One in order to log into the Xbox Insiders program. You can't do this online, nor can you find the menu on an Xbox Series X. This prevents Xbox Series X owners from ordering a second console from their brand new system.",
    "The Xbox Series X restock news has been slow recently, with the last massive restock date being at Walmart on July 1. That's two weeks ago today, July 14. But what we noticed is that the console was far easier to buy than prior weeks and months. This is a good sign.",
    "Here's what we observed during the last three restock opportunities:",
    "The same thing happened on June 24 and June 29 when there was a Best Buy Xbox Series X restock. The console just sat there for several minutes without selling out (though its availability is by region despite being sold online, so you may see a different in-stock notice where you live), and it was selling for MSRP. Even GameStop was willing to sell the new Xbox in stores without forcing a bundle in a one-off opportunity in June.",
    "Finally, there's typically a Costco bundle that contains MLB The Show and an SDD that gets a little pricey, but it was available to purchase for an entire weekend. This is a much better option than resorting to a reseller, who will charge you the same price for just the console.",
    "So while we haven't seen the new Xbox in stock at retailers in recent days (besides a random BJs Wholesale restock), there's a lot of promise in the two weeks ahead, as GameStop, Best Buy and Walmart are all due to carry the Microsoft console.",
    "Here are some options to buy the Xbox Series X.",
    "Every morning Target has the Xbox Series X in stock at random stores to be bought online (no, you cannot buy the Xbox in stores in the US at this time). The problem is that it's hard to issue Twitter alerts when it's usually select stores in a city and there are as few as five consoles as part of the Xbox restock.",
    "Target has switched from a nationwide restock date to offering the Xbox Series X at a local level (again only to be bought online buy picked up in stores) and it has the Xbox consoles for sale as they come in every morning.",
    "Stores like Walmart and GameStop often restock the Xbox Series X through the Xbox All Access bundle, which works a lot like a smartphone plan. You pay for the console over time, but you're also signed up for Xbox Game Pass Ultimate (which is actually something you should look into buying alongside an Xbox anyway).",
    "After 24 months, you save a couple of dollars with this Xbox Series X plan, but you're on the hook being required to pay for it for two years.",
    "We'll continue to offer Xbox Series X restock updates as stores like Best Buy, Walmart and GameStop are overdue to make the Microsoft console available to purchase. It's true that Xbox Series X restock news so far in the latter half of 2021, from July 1 onward, has been basically non-existent, but that should change as retailers in the US stock the console. Plus, Microsoft has to compete with those Nintendo OLED pre-orders very soon."
  ],
  "headers": {
    "6": "Microsoft's secret Xbox Series X availability",
    "9": "Xbox Series X restock news: Walmart and Best Buy",
    "15": "Target Xbox Series X restock: daily online locally",
    "17": "Xbox All-Access is often the silent restock"
  },
  "links": {
    "Xbox Series X restock": "https://www.techradar.com/news/xbox-series-x-restock-at-gamestop-date-and-time-confirmed-heres-when",
    "Xbox restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "Follow our Xbox Series X restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "Xbox Insiders Xbox Series X upgrade plan": "https://gamingtarget.com/article.php?artid=19269",
    "Xbox in stores": "https://www.techradar.com/news/exclusive-gamestop-xbox-series-x-restock-in-store-no-ps5",
    "Nintendo OLED pre-orders": "https://www.techradar.com/deals/nintendo-switch-oled-stock-where-to-buy"
  }
}