{
  "source": "https://www.techradar.com/news/netflix-isnt-making-the-queens-gambit-season-2-right-now-heres-why",
  "title": "Netflix isn't making The Queen's Gambit season 2 right now – here's why",
  "category": "entertainment",
  "updated": "2021-03-02T16:41:44Z",
  "author": "tom-power",
  "summary": "Is it checkmate for Netflix's popular series?",
  "article": [
    "Anya Taylor-Joy has revealed that there have been no talks over a second season of The Queen's Gambit.",
    "Speaking to Entertainment Tonight after her Golden Globes win for best actress in a limited series, Taylor-Joy was asked if she would be open to reprising her role as competitive chess player Beth Harmon.",
    "\"Maybe,\" Taylor-Joy said when asked about the prospect. \"Not to disappoint anybody, but we just never thought about it. It was always a sapling to tree transition. You see her grow, you leave her in a good place. So we were genuinely surprised when people were like, 'Where's season 2?'\"",
    "Despite confirming that a follow-up to the award-winning Netflix series wasn't on the table, Taylor-Joy admitted that she would consider a return if showrunners Scott Frank and Allan Scott asked her to.",
    "\"That being said,\" Taylor-Joy added, \"I adore the entire team that made it, and I would jump at the chance to work with them again.\"",
    "It's highly unlikely we'll see more of the series on Netflix. As Taylor-Joy explained, The Queen's Gambit is a self-contained story that completes Beth's arc as a character, so there is no real reason for the Netflix property to become a franchise like Stranger Things or The Crown.",
    "That's not to say The Queen's Gambit lacked the popularity to become an ongoing series, however. According to a report from Variety, the drama pulled in 62 million viewers inside its first month. Netflix's figures are always skewed, admittedly, given that the streamer's viewing figures are based on people who have watched at least two minutes of an episode, documentary, or film.",
    "Still, clearly The Queen's Gambit was a smash hit – both in its number of viewers and cultural impact. We positioned it at number two in our best TV shows of 2020 list.",
    "Despite that, don't expect an announcement for a second season any time soon."
  ],
  "headers": {
    "5": "Why The Queen's Gambit season 2 makes little sense"
  },
  "links": {
    "Entertainment Tonight": "https://www.etonline.com/anya-taylor-joy-on-possibly-revisiting-queens-gambit-for-season-2-after-golden-globe-win-exclusive",
    "Variety": "https://variety.com/2020/digital/news/queens-gambit-netflix-viewing-record-1234838090/",
    "best TV shows of 2020": "https://www.techradar.com/best/best-tv-shows-2020-new"
  }
}