{
  "source": "https://www.techradar.com/news/cupra-launches-first-all-electric-car-and-its-a-really-hot-hatch",
  "title": "Cupra launches first all-electric car – and it’s a (really) hot hatch",
  "category": "car-tech",
  "updated": "2021-05-25T12:09:10Z",
  "author": "axel-metz",
  "summary": "Good things come in small packages",
  "article": [
    "Cupra, the high-performance subsidiary of Spanish automaker Seat, has announced its first all-electric vehicle (EV) – the Cupra Born.",
    "Possibly the hottest of hot hatch EVs we’ve seen to date, the Born aims to beat the competition by boasting impressive performance credentials despite its modest size, made possible by the electric platform of its Volkswagen Group parent.",
    "That means the Born is a similar offering to the recently-released Volkswagen ID 3, though Cupra claims the car will bring its own “stimulating design and instantaneous performance” to the EV market.",
    "The Cupra Born will be available in several different variants, and its wow factor really depends on the model you choose. The 45kWh, 150bhp model, for example, will get you a competent – albeit not particularly impressive – 211 miles of range, marking the entry point for the lineup.",
    "The 58kWh, 204bhp model, though, returns a more encouraging 260 miles of range, while the top-spec, 77kWh battery version – which boasts 231bhp – will get you up to 335 miles.",
    "As with the ID 3, this high-end variant of the Born can clock a 0-62mph (0-100km/h) sprint time of 6.6 seconds, too – which is an attractive figure for an electric hatchback.",
    "Even more attractive, though, is its design, which is decidedly sexier than its Volkswagen counterpart. \"We have invested a lot of time in tuning the chassis, steering and powertrain,” Werner Tietz, head of R&D at Cupra, said at the Born’s official launch.",
    "“We will offer the car with DCC [dynamic chassis control] in combination with ESC Sport and a lower ride height – 50mm at the front and 10mm at the rear,” he added, “which gives a nice feeling.”",
    "Being the sporty arm of Seat, Cupra has always produced pretty cars, but it's good to see the manufacturer carry this design philosophy through to the aesthetic of its first all-electric model. Maybe it’s the Spanish heritage?",
    "As for its charging capacity, Cupra says the Born can gain 62 miles of range in seven minutes using a 125kW charger on its largest battery, while a 5-80% charge (the benchmark measurement for modern EVs) from a 125kW fast charger will take 35 minutes.",
    "Inside, the Cupra Born doesn’t boast the bells and whistles of more expensive saloon EVs like the Audi Q4 e-Tron or Kia EV6 – but it’s no slouch, either.",
    "A 12-inch infotainment touchscreen will arrive as standard in all models, alongside an augmented reality (AR) display, fully digital instrument cluster and touch-sensitive icons controlling major interior functions. Compatibility with in-car mobile software like Apple CarPlay and Android Auto will also be included.",
    "Naturally, you can also expect the Born to come equipped with all the standard gadgetry of modern EVs – adaptive cruise control, travel assistance, traffic sign recognition, emergency assistance and pre-crash assistance, for example. A top-view camera and intelligent parking assistance will also be available as optional extras.",
    "The Born is quite the environmentally-friendly car, too. The company says its seats are made from upcycled marine plastics, while recycled microfibres will be made available as an option for doors and seats.",
    "Price-wise, the Cupra Born is expected to retail for around £34,000 ($48,000 / AU$60,000) when it hits the road in early 2022 – though that figure is subject to change."
  ],
  "headers": {
    "10": "Keeping it simple"
  },
  "links": {
    "Audi Q4 e-Tron": "https://www.techradar.com/news/audis-new-fully-electric-car-is-its-cheapest-yet",
    "Kia EV6": "https://www.techradar.com/news/kia-ev6-interior-rivals-the-likes-of-audi-and-mercedes",
    "augmented reality": "https://www.techradar.com/how-to/what-is-augmented-reality",
    "Apple CarPlay": "https://www.techradar.com/news/best-apple-carplay-apps",
    "Android Auto": "https://www.techradar.com/reviews/android-auto-review"
  }
}