{
  "source": "https://www.techradar.com/news/loki-episode-4-post-credits-scene-explained",
  "title": "Loki episode 4 post-credits scene explained",
  "category": "entertainment",
  "updated": "2021-06-30T11:19:47Z",
  "author": "tom-power",
  "summary": "Loki episode 4 brings some big revelations to light",
  "article": [
    "Spoilers follow for Loki episode 4.",
    "Loki episode 4 – The Nexus Event – has landed on Disney Plus, and it’s the most important instalment in the god of mischief’s solo adventure yet.",
    "There are plenty of revelations in this week’s episode, some of which confirmed that certain Loki fan theories were correct, but the biggest was reserved for episode 4’s post-credits scene.",
    "For the first time in Marvel’s Loki, there’s a post-credits scene to enjoy – and you’ll want to watch it for some big surprises.",
    "We’re diving into major spoilers for Loki episode 4 from this point on. If you haven’t finished watching, turn back or you’ll have it ruined for you.",
    "Before we dive into the post-credits scene, let’s briefly recap that climactic episode 4 scene.",
    "After Loki and Sylvie begin to sow discourse throughout the Time Variance Authority (TVA) – the duo tell Mobius and Hunter B-15 that they’re also variants – the pair are hauled before the so-called Time Keepers by Ravonna Renslayer.",
    "Found guilty of being variants, Loki and Sylvie are sentenced to death by the Time Keepers. However, Hunter B-15 shows up, deactivates Loki and Sylvie’s time collars, and a fight breaks out between the TVA’s forces and the trio.",
    "During the ensuing battle, it’s revealed that the Time Keepers aren’t real: they’re mindless androids, which means that they didn’t create the TVA, the sacred timeline (the MCU timeline, that is) isn’t so sacrosanct after all, and the TVA is built on a web of lies.",
    "After they defeat Ravonna and her guards (and find out that the Time Keepers are merely fake overlords), Loki and Sylvie have another weird romantic moment.",
    "That is, until Loki is seemingly killed.",
    "Coming to after she was knocked unconscious by Sylvie during their fight, Ravonna grabs one of the TVA’s pruning batons and disintegrates Loki, much to the shock of Sylvie and viewers.",
    "As always, though, not everything is as it seems with Loki.",
    "Episode 4’s post-credits scene shows that Loki is still alive. Waking up in a post-apocalyptic New York (there’s a destroyed Avengers Tower in the background), Loki asks himself “Is this Hel? Am I dead?” – but it turns out he’s not alone.",
    "“Not yet,” an off-screen stranger says. Confused, Loki looks up. “But you will be, unless you come with us,” the voice continues.",
    "The camera switches from Loki to reveal who is talking to him: it’s Richard E. Grant, who was rumored to appear in the TV show. At it happens, he's portraying another Loki variant.",
    "That’s not all, however. Grant’s old Loki is joined by three more Lokis: a younger version of Loki (known as Kid Loki in the comics), a Black Loki (who seems to have adopted the mantle of Thor) and a crocodile Loki. Yes, you read that right: a reptilian Loki.",
    "Funnily enough, the post-credits scene is similar to how the Avengers stood over Loki in 2012’s Avengers Assemble, which is a cool callback.",
    "Marvel's comics hold some of the answers to this particular question.",
    "Classic Loki is pulled straight from Marvel’s Golden Age comics, with his iconic yellow and green costume (complete with huge horned helmet). This is the first iteration of the character in Marvel comics, who made his debut in October 1962’s Journey Into Mystery #85.",
    "This incarnation of Loki stuck around for quite a long time in the comics (even though he occasionally died), and it was this iteration who became Lady Loki for a number of comic issue runs that were released in the late 2000s.",
    "Loki dies once more during the events of 2010 comic run Siege, but doesn’t stay dead for long. He gets reincarnated as Kid Loki in Thor #617 and ends up joining the Young Avengers line-up in the superhero group’s 2013 comic relaunch. Kid Loki becomes teenage Loki in Marvel’s Loki: Agent of Asgard comic run, but he’s a less evil version of the character than he was previously.",
    "Jack Veal (The End of the F***king World) will portray Kid Loki in episode 5. Depending on how that instalment plays out, he may appear in episode 6, too.",
    "We suspect that Old Loki and Kid Loki possess similar abilities to Tom Hiddleston’s Loki (shapeshifting, magic and intelligence among others) but we aren’t sure if Black Loki does.",
    "Why? Well, Black Loki (portrayed by Deobia Oparei) appears to be a brand-new variation on the character. There are currently no instances of a Black Loki in Marvel's comics, so this is likely an original Loki who has been created for the TV series.",
    "Black Loki appears to have based himself on Thor, too. We see him sporting more battle-oriented clothing than Loki usually wears and he’s carrying a hammer that looks like it’s been assembled from scrap.",
    "Curiously, there’s precedent for Loki adopting Thor’s mantle in the comics.",
    "Loki has wielded Mjolnir – Thor’s hammer – on a couple of occasions, with these incidents occurring during Marvel’s Axis series and Thor’s 2020 comic run. It’s unclear, though, if Black Loki (who is also called Boastful Loki, according to the German language dub credits at the end of episode 4) has any of Thor’s powers or if he’s simply copying his brother’s aesthetic.",
    "Finally, we have Crocodile Loki. Again, there are no examples of Loki turning himself into a crocodile or alligator in the comics.",
    "However, given that Loki can shapeshift into, well, anything he wants, seeing a crocodile version of the character isn’t a stretch. We’ll have to see how Crocodile Loki factors into events when episode 5 lands.",
    "We hope so. As one of Loki’s teaser trailers showed, there’s a version of the character – President Loki – who we haven’t met yet. He’s the one who says “Come on, what did you expect?” before seemingly being turned on by his guards.",
    "Of course, this variant could end up being the Loki that we’ve followed throughout the series.",
    "This is speculation on our part, but he could overthrow whoever is in charge and, when he’s located by Sylvie or someone else, it could be his way of reintroducing himself to her and the viewers at home. After all, Loki only looks out for himself. Unless, of course, the other Loki variants teach him otherwise.",
    "We may also see some of the variants that were teased in episode 2. Before Mobius, Loki and the TVA forces head back in time to 1985, Mobius runs through a number of Loki variants that the TVA has already captured and pruned. These include a Loki who retained his frost giant skin color, a Loki who won the Tour de France and a monstrous looking Loki.",
    "If nothing else, it would be fun to see Hiddleston embody some of these other Loki variants. He's a talented actor, so we'd like to see him bring his comedic performance to more Lokis in episode 5.",
    "We’ll find out what’s going on exactly, and how many Loki variants there are, when Loki episode 5 arrives on July 7."
  ],
  "headers": {
    "5": "Loki episode 4 post-credits scene: Richard E. Grant’s character explained",
    "18": "Loki episode 4 post-credits scene: who are the other Loki variants?",
    "30": "Loki episode 4 post-credits scene explained: will we be introduced to other Loki variants?"
  },
  "links": {
    "certain Loki": "https://www.techradar.com/news/loki-episode-3-just-revealed-a-big-time-variance-authority-secret",
    "fan theories": "https://www.reddit.com/r/MCUTheories/comments/o2uuzo/sacred_timeline_is_pure_propaganda_lie_by_tva/"
  }
}