{
  "source": "https://www.techradar.com/news/parler-could-be-set-to-go-offline-again",
  "title": "Parler could be set to go offline again",
  "category": "computing",
  "updated": "2021-01-22T12:14:58Z",
  "author": "barclay-ballard",
  "summary": "AWS did not breach contract by revoking Parler's web hosting, US judge rules",
  "article": [
    "\"Free speech\" app Parler is likely to be forced offline once again after a US judge indicated that the company would find it very difficult to prove that Amazon had breached its contract by terminating web hosting services. The app had hoped to use legal channels to impel Amazon to allow its return.",
    "US District Judge Barbara Rothstein also rejected Parler’s claim that a preliminary injunction requiring AWS to host the social network would be in the public interest. Rothstein cited the “abusive, violent content” and “inflammatory rhetoric” often posted on the platform, and drew attention to the recent riots at the US Capitol that took place earlier this month.",
    "Following accusations that Parler is awash with far-right conspiracy theories and posts inciting violence, a number of major tech firms have sought to de-platform the site. Before Amazon terminated its web hosting services, both Google and Apple removed the Parler app from their respective app stores.",
    "Following AWS revoking web hosting support, Parler went offline before briefly returning. According to reports, the social network found a new home with a web hosting company called DDoS-Guard, which provides a similar service to the better-known CloudFlare.",
    "Now it looks as though DDoS-Guard may not be able to support Parler for much longer either. KrebsonSecurity reports that an investigation by LACNIC, the regional Internet registry for the Latin American and Caribbean regions, is set to revoke 8,192 IPv4 addresses from DDoS-Guard, including the one currently being used by Parler.",
    "With many Silicon Valley firms often accused of having a liberal bias, some have suggested that the effective banning of Parler is being pursued for political reasons. Whatever the motive, it looks like Parler users will have to find a new home very soon.",
    "Via Reuters"
  ],
  "headers": {
    "3": "Nowhere left to turn"
  },
  "links": {
    "Parler": "https://www.techradar.com/news/massive-parler-data-leak-exposes-millions-of-posts-messages-and-videos",
    "web hosting": "https://www.techradar.com/web-hosting/best-free-web-hosting",
    "KrebsonSecurity": "https://krebsonsecurity.com/2021/01/ddos-guard-to-forfeit-internet-space-occupied-by-parler/",
    "Reuters": "https://www.reuters.com/article/us-amazon-com-parler-idUSKBN29Q2T3"
  }
}