{
  "source": "https://www.techradar.com/news/keep-your-macbook-pro-i-only-have-eyes-for-nvidia-studio-laptops",
  "title": "Keep your MacBook Pro, I only have eyes for Nvidia Studio laptops",
  "category": "computing",
  "updated": "2021-11-17T16:29:56Z",
  "author": "jess-weatherbed",
  "summary": "Turning my back on the Mac",
  "article": [
    "When the latest generation of MacBook Pro was revealed several weeks ago, I found myself caught up in the subsequent excitement despite being a lifelong Windows user. Its announcement was masterfully done, with people scrambling to preorder minutes after the stream had finished. Had I a substantial stack of cash to my name I might have also joined in, but it wasn’t just the hefty asking price that made me come to my senses. Given the choice, I’d buy an Nvidia Studio laptop over a MacBook Pro. My own preference for Windows-based hardware does factor into that decision, but I also feel that they’re better optimized for what I would want in a creative workstation.",
    "After all, despite all the wealthy business execs that will be buying the new Apple flagship, the MacBook Pro is designed with content creators in mind, which is partly what made the decision to remove most of its ports back in 2016 so controversial. Apple may have restored them in this new iteration, but it still irked me that they had ever been removed in the first place. On top of this, while it may be one of the best choices for photographers and video editors, my creative interests sit more with 3D sculpting and other graphically demanding applications. Call me old fashioned, but I like having a dedicated graphics card over an integrated system in my workstation laptops, especially when it comes with goodies like DLSS and raytracing.",
    "Which is exactly why I would buy an Nvidia Studio laptop over a MacBook Pro. Nvidia may be more known for its gaming products, but the features it includes in its GeForce gaming line also have benefits for creatives. RTX GPU-accelerated ray tracing and AI-enhanced denoising are an amazing boost for anyone who works with applications such as Autodesk Arnold and Blender for example, all thanks to Nvidia Studio drivers.",
    "Studio drivers differ from the usual Game Ready drivers by optimizing a wide range of applications that cover almost the entire scope of the creative industry, such as the Adobe creative suite and Davinci Resolve. These Studio drivers come preinstalled on Nvidia Studio laptops, but they’re also compatible with cards from the GeForce GTX 10-series, right up to the professional Quadro range, (though you’ll see best results on an RTX-powered GPU).",
    "So if you can download drivers onto any compatible Nvidia-powered device, what’s so special about Nvidia Studio laptops? Well, the entire device is built for content creators so it’s not just the software you’re optimizing. This means you’re getting things like more RAM and storage than a typical laptop, alongside high-resolution, colour-accurate displays and usually, a good selection of ports for peripherals and SD cards.",
    "The Nvidia Studio allocation is also a badge, providing an easy way for non-tech savvy folks to know that whatever laptop bears the RTX Studio symbol has been designed from the ground up to provide creatives with the power to edit up to 8K video, real-time ray tracing, and AI-assisted features, all in a slim, robust chassis. Some even come with perks like an OLED display, alongside great sRGB and Adobe color coverage and high refresh rates.",
    "I would like to drill in that I by no means think the new MacBook Pro is a bad laptop, and I’d be out of my mind to suggest anything of the sort. It is, however, not the best choice for everyone despite its popularity, and I feel like the few weaknesses it has are covered by the wide range of Nvidia Studio laptops now available on the market.",
    "If you don’t want to be a part of the expansive Apple Ecosystem then it makes little sense to jump in with just the MacBook Pro, and while its fanless design and mini-LED display have already converted some Windows users, Nvidia has a trump card that Apple has no chance to counter.",
    "Specifications for content creation and videogames are very similar, which means that Nvidia Studio laptops are also, in a sense, powerful gaming laptops in disguise. I wouldn’t recommend them as a dedicated gaming device, but for students and working professionals who also like to crack open Steam after a few hours of editing videos or 3D rendering, they make the perfect hybrid solution.",
    "You can certainly play some games on macOS, but the list of supported titles pales in comparison to the world of gaming available to Windows users, and you won’t need to jump through hoops to do so. Currently, you can game on a Mac if you download a Windows emulator such as Parallels, but it’s not exactly a streamlined process.",
    "Meanwhile, games will run on both Nvidia Studio drivers and Game Ready drivers, but switching between the two is only a matter of pressing a button to download the driver you need in GeForce Experience. You’re truly getting the best of both worlds.",
    "Not only that, but the range of different components within these laptops means that certain models are better optimized for specific creative tasks. A MacBook Pro might be a fantastic all-rounder, but that won’t come to much if you need a beastly Nvidia RTX 3080 or RTX A5000 for 3D animation work, or you want raytracing and AI-enhancements on a tight budget.",
    "If we dive into the comparisons that Apple made during its October unveiling for the MacBook Pro then we can see that the Intel product being stacked against it for comparison was an MSI GP66 Leopard gaming laptop, equipped with an Intel i7-11800H processor, a GeForce RTX 3070 GPU and 16GB of RAM. Hardly an underpowered device, but there are better optimized and more powerful options available fighting Nvidia’s corner.",
    "And of course, there’s the cost to think about. A 14-inch MacBook Pro with a 10-core CPU / 16-core GPU M1 Pro and 16GB of RAM will set you back $2,499. Meanwhile, a Gigabyte Aero 15 OLED comes with, unsurprisingly, an OLED display, alongside an 11th generation Intel i9-11980HK processor, an Nvidia GeForce RTX 3080 GPU and 32GB of RAM for $2,749.",
    "To showcase the capabilities of Nvidia Studio devices, artist Steven Christopher has recreated the now iconic living room from The Simpsons using Blender and Unreal Engine 4, complete with raytraced lighting. The project was created using an RTX 3070-powered Gigabyte Aero laptop and according to Christopher took around 4 days from start to finish.",
    "Given this kind of creative showcasing isn’t what’s usually displayed in marketing content for the MacBook Pro, I have my doubts over how well it would hold its own against these specialized devices, especially without any raytracing capabilities. If my interests were with video or photo editing and audio mixing then I’d likely feel more torn, but as someone who dabbles in 3D sculpting and is learning my way around Unreal Engine 4, Nvidia will be winning my favor (and cash).",
    "Considering the additional features you’re getting, that’s an easy choice in my book. Perhaps I’ll be the only one dying on this hill, but Nvidia’s work into developing the Studio laptops currently available has certainly persuaded me from jumping ship to macOS any time soon.",
    "Where does that leave the MacBook Pro? In the words of Shania Twain, “that don’t impress me much”."
  ],
  "headers": {
    "3": "The driving force of creativity",
    "12": "It's all about the hardware"
  },
  "links": {
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "remove most of its ports back in 2016": "https://www.techradar.com/news/macbook-pro-models-could-regain-hdmi-ports-and-sd-readers-in-2021",
    "Studio drivers": "https://www.techradar.com/news/nvidia-geforce-experience-can-now-make-adobe-lightroom-run-better-as-well-as-your-games",
    "Adobe creative suite": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "Davinci Resolve": "https://www.techradar.com/reviews/davinci-resolve-17",
    "Nvidia Studio drivers": "https://www.techradar.com/news/nvidia-geforce-experience-can-now-make-adobe-lightroom-run-better-as-well-as-your-games",
    "Game Ready drivers": "https://www.techradar.com/news/nvidia-driver-makes-dlss-better-and-boosts-frame-rates-for-all-games",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "GeForce RTX 3070 GPU": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "14-inch MacBook Pro": "https://www.techradar.com/news/macbook-pro-16-inch-2021-and-14-inch-models-hit-mass-production-according-to-rumor",
    "$2,749": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FGIGABYTE-AERO-15-OLED-YD-93US648SP%2Fdp%2FB096TB8MRB%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1335166652982992600-20",
    "Steven Christopher": "https://www.artstation.com/artwork/9mv9KW"
  }
}