{
  "source": "https://www.techradar.com/news/5g-networks-are-on-the-verge-of-becoming-mainstream-in-some-markets",
  "title": "5G networks are on the verge of becoming mainstream in some markets",
  "category": "phones",
  "updated": "2021-05-11T11:12:42Z",
  "author": "steve-mccaskill",
  "summary": "Challenging 2020 will be offset by strong momentum in 5G market",
  "article": [
    "The number of global 5G connections will triple to 670 million during 2021, according to CCS Insight, which says strong momentum in the deployment and adoption of next-generation networks will overcome the wider market challenges of the past 12 months.",
    "Device shipments fell by 13% last year as the industry grappled with economic uncertainty caused by the pandemic and although the market is expected to contract by 6% in 2021, the 5G segment will be less susceptible to ongoing challenges.",
    "Although a chip shortage will have implications for manufacturers throughout the year, it is probable that the higher end of the market will be less affected. One third of all handsets sold in 2021 are set to be 5G compatible, analysts predict.",
    "The wider availability of devices, and greater affordability, coupled with a wider post-pandemic recovery and accelerating network deployments will all contribute to strong adoption of 5G over the next two years, leading to 3.6 million connections by 2025.",
    "In more advanced 5G connections like South Korea and China, analysts say the technology is on the verge of being truly mainstream. One in five smartphones in the former are 5G and the latter is on track to reach the same milestone this year.",
    "The pace in the US has been slower, despite being the first country to switch on a 5G mast. The initial focus there was on Fixed Wireless Access (FWA) broadband rather than mobile services, however strong pushes from operators combined with the launch of the first compatible iPhone means analysts predict American will be a front runner again very soon.",
    "Meanwhile, delayed spectrum auctions and the impact of bans on Huawei have failed to dampen momentum in Western Europe. Operators now have the necessary airwaves and network equipment agreements in place to build out their services.",
    "By the middle of the decade, it is predicted that more than 75% of all phones sold in developed regions will be 5G compatible, while other markets, such as India, will see strong momentum.",
    "The only two areas of dampened expectations are IoT and FWA. The pandemic has caused delays in standardisation and deployment of the former, while there is also a belief that the latter will remain a niche service in many markets."
  ],
  "headers": {
    "3": "Global 5G connections"
  },
  "links": {}
}