{
  "source": "https://www.techradar.com/news/dying-light-2-will-make-an-appearance-at-gamescom-2021-heres-what-to-expect",
  "title": "Dying Light 2 will make an appearance at Gamescom 2021 - here’s what to expect",
  "category": "gaming",
  "updated": "2021-08-18T17:32:20Z",
  "author": "emma-boyle",
  "summary": "Parkour!",
  "article": [
    "Dying Light 2 developer, Techland, has confirmed that the game will be present at Gamescom 2021, with a showcase featuring gameplay and brand new details.",
    "Techland issued an invitation to fans to join it at Gamescom via a video posted to its YouTube channel. In partnership with IGN, the presentation will take place on August 26, at 11am PT/ 2pm ET/ 7pm BST ​​and will be hosted by Lead Gameplay Designer, Tymon Smektała.",
    "As for what we should expect to see during the presentation, Smektała confirmed that “the two main gameplay pillars” of Dying Light 2, combat and parkour, will be covered in his conversations with guests, with a new gameplay trailer thrown in for good measure.",
    "Though the presentation is a part of Gamescom 2021, it’s actually the third episode in the developer’s Dying 2 Know series in which it delves into the nitty gritty of Dying Light 2, with previous episodes revealing the release date and giving insights into the game's story, enemies and setting.",
    "Dying Light 2’s presentation takes place on the second day of Gamescom 2021, which officially kicks off on August 25 and will run through to August 27. Dying Light 2 itself will launch on December 7 2021 for PS4, Xbox One, Xbox Series X/S and PS5.",
    "After a delay in 2020, a long silence, and the announcement of a new December release date earlier this year, Techland appears to be trying to be open with fans about what they can expect from Dying Light 2 through its Dying 2 Know livestreams.",
    "As the pandemic has pushed big game shows like E3 and Gamescom even more online than they were before, the value of the livestream and the way it allows developers and publishers to appeal directly to players has only become more clear. If previous episodes of Dying 2 Know hadn't taken place, this Gamescom show could run the risk of being an info dump, instead it's just another piece of the puzzle.",
    "Studios like Techland and Playground with their Dying 2 Know and Forza Horizon Let’s Go streams have utilized livestreams well, drip-feeding information to fans who know where to find them, using the dedicated space to delve into details in a way that isn’t always possible at in-person events. Though not always a guaranteed indicator of what the final game will be, these livestreams seem like a pretty effective method of keeping conversation around the game going.",
    "This is Gamescom’s second entirely online event and it seems organisers are trying to build on the first. With just a week to go until the show begins, the schedule is starting to fill out with presentations such as Xbox’s stream on August 24, the two hour Opening Night Live hosted by Geoff Keighley on August 25 and the Future Games Show on August 26 currently confirmed."
  ],
  "headers": {
    "5": "Analysis: All online seems to be working"
  },
  "links": {
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors",
    "Gamescom 2021": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show",
    "earlier this year": "https://www.techradar.com/news/dying-light-2-release-date-confirmed-for-december",
    "Xbox’s stream on August 24": "https://www.techradar.com/news/xbox-gamescom-2021-stream-date-announced-heres-when-to-tune-in",
    "the two hour Opening Night Live": "https://www.techradar.com/news/expect-two-hours-of-upcoming-games-at-gamescom-2021s-opening-night-live",
    "Future Games Show on August 26": "https://www.techradar.com/news/future-games-show-at-gamescom-will-feature-over-40-games-heres-how-to-watch"
  }
}