{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-basically-sounds-like-the-note-21-at-this-point",
  "title": "Samsung Galaxy S22 Ultra basically sounds like the Note 21 at this point",
  "category": "phones",
  "updated": "2021-09-23T09:09:25Z",
  "author": "tom-bedford",
  "summary": "Including an S Pen slot",
  "article": [
    "Though the Samsung Galaxy Note 21 has been canceled, fans of stylus-toting Samsung phones might not have to go without: while the Galaxy S21 Ultra came with compatibility for the company's S Pen, apparently the Ultra variant of the upcoming Galaxy S22 will actually have a slot for the stick.",
    "This comes from popular and prolific leaker Ice Universe, writing on Chinese social media website Weibo, who said that according to their industry sources \"the S22 has become the Note, with a built-in S Pen\". If the leak is right, this means there will be a hole in the body of the phone in which you can store Samsung's S Pen stylus when it's not in use.",
    "Ice Universe adds that the phone will look similar to the Galaxy Note 20 Ultra, though what that actually means is very unclear - perhaps it refers to the sharper top edges the Note Ultra phone had. In addition, the leaker says the phone will have a 5,000mAh battery.",
    "This doesn't tell us about the base Galaxy S22 and S22 Plus, but judging by the S21 series, they'll likely miss out on stylus functionality.",
    "When the Samsung Galaxy Note 21 was confirmed to be canceled, it was implied that the line would continue in future years, but subsequent industry rumors seemed to disagree. Many speculated the Galaxy Z Fold 3 was the Note's replacement, as a top-price phone with stylus compatibility, and therefore future Samsung foldable phones would permanently replace the Note line.",
    "While the Z Fold 3 and S21 Ultra both had compatibility for the S Pen stylus, neither had an actual place to hide the stick when not in use, making them slightly less useful than the Note for this feature.",
    "However if the Galaxy S22 Ultra has a hole for the stylus, and also the top specs and price that we'd expect, the only thing separating it from an actual Note Ultra phone would be the name.",
    "If that turns out to be true, it's basically a death knell for the Note series: Samsung surely wouldn't put out a Note-alike S22 Ultra alongside an actual Note phone in the same year, all but confirming the Note range is permanently gone.",
    "Galaxy Note fans won't be left wanting though, if that turns out to be the case, because the Samsung Galaxy S22 Ultra will be everything they want. We'll have to see if that turns out to be the case though, and the S22 series is expected to launch early in 2022."
  ],
  "headers": {
    "4": "Analysis: forget-me-Note"
  },
  "links": {
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Weibo": "https://weibo.com/5673255066/Kzm3UtAHi?type=comment#_rnd1632383882380",
    "Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones"
  }
}