{
  "source": "https://www.techradar.com/news/ps5-storage-running-low-these-prime-day-external-storage-deals-will-help",
  "title": "PS5 storage running low? These Prime Day gaming deals on external storage will help",
  "category": "computing",
  "updated": "2021-12-05T16:54:14Z",
  "author": "daryl-baxter",
  "summary": "Expand your PS5 storage for less",
  "article": [
    "Need more PS5 storage? Amazon's Prime Day deals are now live, and there's a great selection of external hard drives that can give you more room to store your favorite games. For instance, you can save 35% off the ArmorATD 4TB Terrain external drive or a chunky $200 off a WD Black 4TB SSD.",
    "With Sony's PlayStation Plus and Play at Home initiatives, there's been plenty of opportunity to download a plethora of games for your PS5 console for free. Eventually, this all adds up on the internal SSD, which still can't be expanded at the moment.",
    "With big exclusives coming to PS5 like Ratchet and Clank: Rift Apart, alongside Final Fantasy VII Intergrade, there's a good chance that you will need some more storage so you don't have to constantly delete games and manage your installed library.",
    "Just remember that although you can store PS5 games on an external drive, you can't play them. You'll need to transfer them back onto the console's external drive if you want to boot them up.",
    "It's worth noting that all of the drives below also work on PS4, Xbox One, Xbox Series X and Xbox Series S.",
    "Not in the US or UK? Scroll down for deals in your region.",
    "The main factor to consider when looking at an external drive for your PS5 is how much storage you think you will need for the coming months. With Far Cry 6, Horizon Forbidden West and more coming throughout the year, it may be best to look at a drive that has at least 2TB of storage.",
    "No matter where you live, though, you'll find all the lowest prices for external hard drives from around the web right here, with offers available in your region.",
    "You might also want to check out the best PS5 external hard drives."
  ],
  "headers": {
    "6": "More external hard drive deals"
  },
  "links": {
    "PS5 storage": "https://www.techradar.com/best/best-ssd-for-ps5",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "save 35% off the ArmorATD 4TB Terrain external drive": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FG-Technology-ArmorATD-All-Terrain-Portable-External%2Fdp%2FB07QNRH3NY%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5611361439403396000-20",
    "$200 off a WD Black 4TB SSD": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FWD_BLACK-P50-Game-Portable-Compatible-Playstation-Xbox%2Fdp%2FB08V8THXNL%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1347308662694912000-20",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-deals",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "PS5 external hard drives": "https://www.techradar.com/best/best-ps5-external-hard-drives"
  }
}