{
  "source": "https://www.techradar.com/news/the-xiaomi-mi-11t-could-boast-two-innovative-upgrades-to-beat-the-iphone-13",
  "title": "The Xiaomi Mi 11T could boast two innovative upgrades to beat the iPhone 13",
  "category": "phones",
  "updated": "2021-06-13T13:30:25Z",
  "author": "david-nield",
  "summary": "Under-display cameras and UWB",
  "article": [
    "The smartphone market doesn't stand still for long, and we're already looking forward to what the Xiaomi Mi 11T flagship might have in store – in particular, two innovations that would put it on a par or ahead of every other handset on the market.",
    "According to well-known tipster Digital Chat Station on Chinese social network Weibo (via PhoneArena), a future Xiaomi flagship is going to feature both an under-display selfie camera and ultra-wideband (UWB) support to help it stand out from the crowd.",
    "That in-screen camera is a rumor we've heard before in regards to future Xiaomi phones, and the technology is also supposedly coming to handsets such as the Samsung Galaxy S22. You can actually get under-display selfie cameras on smartphones today – they just don't work very well.",
    "As for ultra-wideband support, the short range communications protocol has been built into recent iPhones, and is the main technology offered by the Apple AirTags. It wouldn't be a surprise if Xiaomi was planning some tracking devices of its own.",
    "The original leak suggests that these features are coming to a Xiaomi handset this year – that makes us think the Xiaomi Mi 11T is the most likely beneficiary, as the follow-up to the Xiaomi Mi 11 is scheduled to arrive around September time.",
    "On the other hand, Xiaomi might decide to delay the implementation of under-display cameras and ultra-wideband until the Xiaomi Mi 12 is ready. That particular phone isn't due to launch until the start of 2022, if Xiaomi sticks to its usual schedule.",
    "It really is a question of when not if though: in-screen cameras and UWB are two of the hottest bits of smartphone tech at the moment, and Xiaomi isn't usually shy about pushing the newest features out to its phones as soon as they're available.",
    "So where will that leave the iPhone 13? The upcoming Apple handset will undoubtedly feature ultra-wideband in some form, so it can fully support the AirTags, but we don't expect Apple to introduce in-screen selfie cameras for a while yet."
  ],
  "headers": {
    "4": "Choose your flagship"
  },
  "links": {
    "Xiaomi Mi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "PhoneArena": "https://www.phonearena.com/news/xiaomi-mi12-flagship-under-display-camera-uwb-leak_id132788",
    "we've heard before": "https://www.techradar.com/news/xiaomi-mi-12-might-beat-samsung-galaxy-s22-to-the-punch-for-one-premium-feature",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "don't work very well": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "for a while yet": "https://www.techradar.com/news/a-future-iphone-could-have-an-in-screen-camera-but-probably-not-the-iphone-12"
  }
}