{
  "source": "https://www.techradar.com/news/how-to-watch-the-little-things-online-stream-the-new-movie-on-hbo-max-from-anywhere",
  "title": "How to watch The Little Things online: stream new Denzel movie on HBO Max now",
  "category": "computing",
  "updated": "2021-03-10T12:21:38Z",
  "author": "daniel-pateman",
  "summary": "HBO Max blockbuster stars Denzel, Jared Leto and Rami Malek",
  "article": [
    "A spate of murders in LA threatens to dredge up the dark past of Kern County Sherriff Joe \"Deke\" Deacon in this much-anticipated film from writer-director John Lee Hancock. Starring Academy Award-winners Denzel Washington and Rami Malek as two detectives assigned to the case - with Jared Leto the creepy lead suspect. It's a nail-biting crime thriller, so read on below we explain how you can watch The Little Things online and stream the latest exclusive HBO Max movie premiere wherever you are today.",
    "The film starts with LAPD detective Jim “Jimmy” Baxter (Malik, Mr Robot, Bohemian Rhapsody) engaging the help of Joe “Deke” Deacon (Washington, Training Day, American Gangster), a California Sherriff with razor-sharp instincts, to help stop a serial killer terrorizing Los Angeles. But, as they pursue their main suspect – local man Albert Sparma (Leto, Dallas Buyers Club, Requiem for a Dream) – events from Deke’s past return to haunt him, and threaten to derail the case completely.",
    "The Little Things is the collaborative effort of an insane amount of talent. All three lead actors have won an Oscar AND a Golden Globe, while 15-time Academy Award-nominated Thomas Newman (American Beauty, 1917) produced the film’s score. Then, rounding out an acclaimed cast are Natalie Morales as Detective Jamie Estrada, Terry Kinney as LASD Captain Carl Farris, and Chris Bauer as Detective Sal Rizoli.",
    "Dripping in atmosphere, suspenseful, and full of complex characters, if you loved David Fincher’s Seven and his 2007 film Zodiac, you won’t want to miss this. Just keep reading, and we’ll detail how to watch The Little Things online no matter where you are in world, even though the new movie is debuting exclusively on HBO Max in the US."
  ],
  "headers": {
    "4": "How to watch The Little Things: release date in Australia"
  },
  "links": {
    "exclusively on HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-5962819842765922000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-watch-the-little-things-online-stream-the-new-movie-on-hbo-max-from-anywhere"
  }
}