{
  "source": "https://www.techradar.com/news/cancelled-n64-goldeneye-007-xbox-remaster-leaks-online-and-you-can-play-it",
  "title": "Cancelled N64 GoldenEye 007 Xbox remaster leaks online - and you can play it",
  "category": "gaming",
  "updated": "2021-02-03T17:22:22Z",
  "author": "rhys-wood",
  "summary": "For emulation, Bond",
  "article": [
    "The realm of video game preservation is often a surprising and delightful space. This was once again proven recently as a GoldenEye 007 remaster, originally intended for release on the Xbox 360 in 2007, was leaked online in a playable state following a full playthrough uploaded to YouTube.",
    "If you’re familiar with the original N64 release of GoldenEye 007, you’ll notice upon watching the video just how faithful of a remaster this is. Gameplay, music and sound effects all remain intact, while the game’s textures have undergone a significant upscale.",
    "It’s not entirely unlike 4J Studios’ 2010 remaster of Perfect Dark, which was also released onto the Xbox Live Arcade ecosystem. One big difference here being that the GoldenEye 007 remaster wasn’t outsourced. Rather it was being developed in-house by Rare itself.",
    "Sadly, the GoldenEye 007 remaster was canned due to copyright issues, but it appears to be in a near complete state. In fact, the full remaster is now available to download and is playable on an emulator.",
    "It’s been confirmed that the game is indeed playable, and in an enjoyable state too, with John Linneman of Digital Foundry citing as much in a tweet posted earlier today.",
    "Thanks to various efforts, the GoldenEye 007 remaster has been preserved for fans of the original to check out at their leisure. In typically witty fashion, Rare also didn’t let the project die with a whimper, acknowledging its likely demise with this cheeky splash screen:",
    "While an officially released GoldenEye 007 remaster would have been extremely welcome on the XBLA platform, the rights to 007 video games are notoriously difficult to navigate. The IP is jointly owned by Danjaq LLC and Metro Goldwyn Mayer. Several video game companies have had access to the franchise over the years, including EA, Activision, Nintendo, and most recently Hitman developer IO Interactive.",
    "Head of Xbox Phil Spencer has always seemed keenly aware of the interest in an official GoldenEye 007 remaster. In 2015, Spencer tweeted that the rights “are so challenging, looked at this many times. Lot’s [sic] of different parties to work with, we’ve always given up.” So there’s still hope yet one day for an official revival of this iconic game."
  ],
  "headers": {
    "3": "A load of old Boris"
  },
  "links": {
    "uploaded to YouTube.": "https://www.youtube.com/watch?v=A0GinqO4lhU&feature=emb_imp_woyt",
    "Perfect Dark": "https://www.techradar.com/news/perfect-dark-trailer-at-game-show-awards-shows-joanna-dark-is-back",
    "IO Interactive.": "https://www.gamesradar.com/uk/project-007-james-bond-game-io-interactive-guide/",
    "tweeted": "https://twitter.com/XboxP3/status/674375237622890498"
  }
}