{
  "source": "https://www.techradar.com/news/realme-gt-a-popular-cheap-android-phone-is-finally-getting-a-global-release",
  "title": "This popular cheap phone is finally getting a global release, to take on Xiaomi and Moto",
  "category": "phones",
  "updated": "2021-05-19T11:29:36Z",
  "author": "tom-bedford",
  "summary": "The Realme GT is coming",
  "article": [
    "The Realme GT was a much-rumored Android phone at the beginning of 2021, but after a China launch everything went silent - it started to seem like the low-cost powerhouse was exclusive to that country.",
    "It seems that's not the case though, because when announcing the Realme GT's Android 12 beta program, the company also confirmed that the \"realme GT will launch globally soon\".",
    "That's pretty big news, as the phone seemed like a OnePlus Nord or Google Pixel 4a rival with really impressive specs for its price, and now we'll almost definitely see it soon.",
    "We've no idea when this global launch will take place - there's a May 24 event happening in China but it seems this is for the Realme GT Neo, the GT's sibling, and this event likely won't include global release information.",
    "If you don't know about Realme, we've got a guide to the brand and its phones here. It's an Android phone maker that specializes in low-cost handsets, and the Realme GT was the start of a new car-themed line of devices.",
    "The Realme GT launched in China for CNY2,899, which converts to about $450, £320, AU$580 - those would all be low prices for the specs on offer, which we'll get to below. Reports from China suggested the phone sold incredibly well, likely because of this price.",
    "The spec list for the Realme GT is impressive - there's the top-end Snapragon 888 chipset, a 6.43-inch 120Hz AMOLED display, a 64MP main camera and super-fast 65W wired charging, amongst other things.",
    "Some may find the design impressive too, as the phone has a yellow body with a black racing stripe. The phone is named after the Grand Tourer type of racing vehicle, though beyond the design that's mostly just marketing talk.",
    "Android phone fans are likely excited to see this phone grace the global market, as it could be the phone that catapults the brand to popularity. We'll keep you updated if and when the phone gets a worldwide launch."
  ],
  "headers": {
    "4": "What is the Realme GT?"
  },
  "links": {
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Android 12 beta": "https://www.techradar.com/news/android-12-news",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "guide to the brand and its phones here": "https://www.techradar.com/news/what-is-realme-a-guide-to-the-company-and-its-smartphones",
    "Reports": "https://www.gizmochina.com/2021/03/10/realme-gt-5g-crosses-100-million-yuan-sales-revenue-in-10-seconds/"
  }
}