{
  "source": "https://www.techradar.com/news/this-super-cheap-electric-car-is-outselling-tesla-but-you-cant-buy-it",
  "title": "This super cheap electric car is outselling Tesla – but you can’t buy it",
  "category": "car-tech",
  "updated": "2021-02-25T11:45:53Z",
  "author": "axel-metz",
  "summary": "Behold, a box-on-wheels",
  "article": [
    "A budget electric vehicle (EV) is outselling Tesla two to one – but it’s only available in China.",
    "The Hongguang Mini EV, a joint venture between the Chinese-owned SAIC Motor and US auto giant General Motors (GM), retails for $4,500 (around £3,200 / AU$5600) and is proving a hit against its more expensive competitors.",
    "A recent BBC News report suggests the Hongguang Mini and its more premium, air-conditioned sibling (which costs just over $5000 / £3500 / AU$6300) have surpassed the Tesla Model 3 to become the best-selling EVs in China.",
    "The partnership between the Chinese and American manufacturers – known locally as Wuling – seeks to offer consumers what the company describes as “the people’s commuting tool.”",
    "Of course, the Hongguang EVs can’t match Tesla’s lineup for battery, range or performance – the Mini model, for example, has a top speed of just 100km/h (62mph) and can accommodate four people at a squeeze.",
    "But Wuling’s comparatively miniscule prices (the “affordable” Tesla, the Model 3, starts at $39,990 / £40,490 / AU$73,900) has seen consumers embrace the convenience of its cheap, clean, no-frills vehicles in measures rare among EVs globally.",
    "The Hongguang Mini EV is now believed to be the second-best-selling EV worldwide, behind the Model 3.",
    "Car experts have dubbed Wuling’s EV range as China’s best \"new-energy\" vehicles, as the country orients itself towards a greener automotive future.",
    "\"China's government is serious about pollution reduction and becoming the global lead in adopting and promoting innovation of electric vehicles,\" Shaun Rein, managing director of the China Market Research Group, told the BBC.",
    "\"We remain very bullish on the adoption of budget EVs like the Hongguang Mini to higher end ones like NIO and Tesla,\" he added.",
    "Naturally, it’s a more attractive proposition when companies make luxury and high-performance vehicles – the Hongguang Mini, for all its practicality, doesn't come close to luxury or high-performance. But, ultimately, cars are a consumer product, and price will almost always win out over leather seats and top speeds.",
    "Among the constant noise surrounding the EV products of Tesla, Audi and even Apple, it’s refreshing to see a major automotive company step up and deliver a simple (and commercially successful) car that targets everyday buyers, rather than only those with deep pockets.",
    "Can we expect to see the Wuling EV range launch elsewhere? The company has said it plans to export its vehicles overseas, with reports citing a Latvian automaker as a potential European manufacturing partner.",
    "But don’t get too excited – due to differences in environmental requirements in the US, Europe and Australia, you can expect these quirky little boxes-on-wheels to cost twice the price if they ever do make it across the pond.",
    "Via BBC News"
  ],
  "headers": {
    "7": "New energy"
  },
  "links": {
    "BBC News report": "https://www.bbc.co.uk/news/business-56178802",
    "Tesla Model 3": "https://www.techradar.com/news/tesla-model-3",
    "Model 3": "https://www.techradar.com/news/tesla-model-3",
    "BBC": "https://www.bbc.co.uk/news/business-56178802",
    "even Apple": "https://www.techradar.com/news/apple-car",
    "BBC News": "https://www.bbc.co.uk/news/business-56178802"
  }
}