{
  "source": "https://www.techradar.com/news/amazons-colonialist-mmo-shouldnt-exist-but-for-reasons-other-than-controversy",
  "title": "Amazon's colonialist MMO shouldn't exist, but for reasons other than controversy",
  "category": "gaming",
  "updated": "2021-05-12T20:54:04Z",
  "author": "nick-pino",
  "summary": "OPINION: Bad premise meets generic gameplay",
  "article": [
    "New World, Amazon’s upcoming MMO that’s set to release in August, has gotten a lot of flak for its premise – one that that puts you in the shoes of a frontiersman in a strange new land, and though it's set in a fictional land called Aeternum, has some parallels to the experience of settlers coming to America in the 1600s. At best, it’s a problematic core tenet for a video game; at worst, it feels pro-imperialism. Either way, it’s not a flattering comparison.",
    "And yet, that’s somehow only part of the problem with New World. Even if you peel back the icky imperialistic layers of the game, what you find underneath is a generic MMO – one that will require a massive active user base to be engaging, and that Amazon Games will have to sink boatloads of money into before it becomes worth playing.",
    "With just months left before its slated release date, it’s unlikely that Amazon will pull the plug on New World – but having played it for a half-dozen hours over three lengthy sessions, I really wish that it would.",
    "If you missed the New World first look that I wrote two years ago, the thing that gripped me at first was its potential as a sandbox – a clean slate that gamers would enter and terraform themselves by building castles, erecting settlements and banding together to form EVE Online-esque clans a thousand members strong.",
    "To make that premise work, the game had to be set in a relatively barren continent, a place called Aeternum that’s located in the Atlantic Ocean. Thematically, that made sense. But then Amazon Games started adding more lore in there – how, actually, this land is cursed by something called The Corruption and while there were previous explorers, they all mysteriously disappeared.",
    "To reclaim the land, you’ll need to get to the bottom of what happened here by, well… turning a pristine, resource-rich continent into a war-torn wasteland where you and your friends vie for control of small plots of land against others in endless battle. Oh, and in between you might visit some dungeons to figure out what happened and why Aeternum is cursed, or whatever. But mostly you’ll be fighting in massive player-versus-player battles.",
    "Problematically, however, as of right now there's no telling how easy it will be to find players to band together with. The best case scenario is that it'll be easy to find a large group of other players to participate in these battles, through matchmaking or a very robust guild system that incentivizes these activities. But even if that's the case, New World is going to need a massive player base to keep them filled around the clock – and that’s going to require a huge marketing campaign and level of persuasion that a better game wouldn't need.",
    "In our most recent demo, New World’s Game Director Scot Lane said that the team has added in voiceovers and cut-scenes to help flesh out the single-player side of the game, as well as quest givers and NPCs to provide structure beyond the on-going warfare, but that’s only just been introduced as of March 23, 2021. (CORRECTION: Amazon has reached out to say that \"While Expeditions are new, New World has had PvE content, including quests and NPCs, since at least 2019\".) For the large part, it still seems like it’s just you and your crew versus the world.",
    "In between these battles, Amazon Games hopes to hook you with a crafting system that allows you to make new weapons and armor, as well as entire buildings. Our last demo was entirely focused on that mechanic, and to be honest it felt like a lot of work just for a rival band of warriors to come along and tear it all down.",
    "The silver lining is that the combat – while still pretty generic in its weapon selection, skill trees and abilities – was actually fast-paced and pretty fun. It feels like what would happen if Dark Souls met World of Warcraft. There’s a lot of emphasis placed on moving and dodging enemy attacks rather than staying in one spot to support your allies.",
    "As an archer/fencer hybrid, I was always compelled to hit enemies at range to get their attention – then follow it up with a flurry of blows when they inevitably got up in my party’s face. With a healer (played by one of the game’s developers) keeping us alive, we were able to clear the first dungeon fairly quickly, and the combat still stands out as one of the best parts.",
    "I’m not sure how well the combat will hold up over the course of a 100-hour MMO, however, nor am I sure that crafting system is robust enough to keep anyone interested for more than an hour... and considering that these are key pillars of the game, there’s good reason to be concerned.",
    "If Valheim and ARK: Survival Evolved didn’t exist, there might have been room for a game like New World, too. Those games also have players banding together to create something bigger and better than any one person can achieve by themselves. But they’re also infinitely more interesting in their settings, characters and level designs. Heck, in ARK: Survival Evolved, you can tame and mount a Megalodon and a Tyrannosaurus Rex. There’s nothing I’ve seen in New World that’s one-tenth as interesting as that last sentence.",
    "I wrote two years ago in our preview that, “In its current state, [New World] is really rough and unfinished. It's littered with resources at this point, and a few monster mobs, but by and large it's a fairly generic-looking continent without a lot of personality.” Having played it again last week – spending time with some of the new content called Expeditions that add an element of PvE combat to the game – I can’t say I feel any differently.",
    "What the studio has focused on is adding new weapons to the game (an ice glove that caused a big drop in frame rate, and a rapier), two new zones (Ebonscale and Reekwater), a revamped crafting system, Expeditions, and Outpost Rush – which admittedly is a lot of content.",
    "There’s a chance that all that new content cements everything together in a way that I just couldn’t comprehend after playing the game multiple times over the last few years. It’s possible that the new quest givers in Reekwater and Ebonscale add a narrative richness that gives context and relevance to the story and helps New World to distinguish it from its contemporaries.",
    "If it wants to succeed in that, though, New World has to offer a better crafting and survival experience than Valheim and ARK while simultaneously being a better MMORPG than Final Fantasy 14 and Elder Scrolls Online. That’s a tall order. Gamers who have sunk long hours into these games aren’t going to jump ship for any old generic-looking MMO – and without a lot of personality in its character design or environments, I’d say New World is firmly in that camp.",
    "Now, there’s a chance that maybe the media and influencers who’ve seen the game just weren’t shown the best, most interesting parts of the game. Maybe there’s an interesting city in Ebonscale that’s bursting at the seams with life and vibrancy. Maybe there’s an Expedition out there that explains why this game is worth paying $39.99. But, by the same token, maybe Amazon Games has already shown us the parts of the game that it thought was worth playing – and it just isn’t all that good."
  ],
  "headers": {
    "3": "New World meets old problems",
    "8": "Fighting, crafting, fighting, crafting...",
    "12": "It’s like Valheim, but somehow more generic"
  },
  "links": {
    "New World first look": "https://www.techradar.com/reviews/new-world",
    "as of March 23, 2021": "https://www.newworld.com/en-us/news/articles/updates-on-quest-design"
  }
}