{
  "source": "https://www.techradar.com/news/samsung-confirms-that-future-phones-wont-come-with-chargers-or-earphones",
  "title": "Samsung confirms that future phones - like Note 21 - won’t come with chargers",
  "category": "phones",
  "updated": "2021-01-18T09:54:36.085Z",
  "author": "james-rogerson",
  "summary": "But it might not be a sudden change",
  "article": [
    "One change Samsung made for the Samsung Galaxy S21 range wasn’t an addition but a loss, as it’s not including charging plugs or earphones in the box, and the company has now confirmed that this change won’t be limited to the Galaxy S21 range.",
    "In a Q&A post on the company’s mobile press page, Patrick Chomet, EVP and Head of the Customer Experience Office at Samsung, said the following:",
    "“We believe that the gradual removal of charger plugs and earphones from our in-box device packaging can help address sustainable consumption issues and remove any pressure that consumers may feel towards continually receiving unnecessary charger accessories with new phones.”",
    "From that it sounds like the goal is ultimately to no longer include a charging plug or earphones with any Samsung phone – or any other relevant Samsung devices either. However, the mention of this being a “gradual removal” suggests it won’t be a sudden change.",
    "In other words, some future Samsung phones probably will still have one or both of those things in the box, but others probably won’t, and over time they’ll become less common.",
    "Samsung also gave reasons for their removal, explaining that many of its customers are reusing their old accessories, and that no longer including a charging plug or earphones is more environmentally sustainable. The company also notes that it’s been including standardized USB-C charging ports since 2017, meaning that older chargers will still work with newer Samsung Galaxy devices.",
    "As for which upcoming phones will keep or lose their chargers and earphones, we can only really speculate for now, but it’s likely at the very least that the Samsung Galaxy S22 range won’t have these things in the box, since the S21 range doesn’t.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "A gradual change"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "mobile press page": "https://www.samsungmobilepress.com/featurestories/answers-to-your-questions-about-the-galaxy-s21-series-from-samsung-mobile-executives",
    "Phone Arena": "https://www.phonearena.com/news/Samsung-removes-charger-earphones-Galaxy-devices_id129552"
  }
}