{
  "source": "https://www.techradar.com/news/the-saudi-womens-rights-activist-who-found-freedom-and-destruction-on-the-internet",
  "title": "The Saudi women’s rights activist who found freedom and horror on the internet",
  "category": "computing",
  "updated": "2021-11-20T23:58:33Z",
  "author": "joel-khalili",
  "summary": "Meet Manal al-Sharif, technologist by trade and ‘activist by accident’",
  "article": [
    "Born into a devout Muslim family in Saudi Arabia, Manal al-Sharif spent her childhood under the impression that women were second-class citizens. In her small world, every piece of information she met was curated carefully, censored in such a way as to crush any spirit of rebellion.",
    "Courtesy of the internet, which arrived in her country in 1999, she was able to dispossess herself of these inherited misconceptions and came to understand the oppression under which she was living.",
    "“Under an authoritarian regime, you’re controlled by fear; you have a lot of questions, but nobody will answer them,” she told TechRadar Pro. “That pretty well describes my childhood in Saudi Arabia.”",
    "“But when the internet came, my questions were answered. This is the power of technology to break through the black box that people live in when they don’t have access to information.”",
    "Captivated by the internet and technology more broadly, al-Sharif went on to pursue a degree in computer science, becoming the first Saudi woman to specialize in information security, for which she has a considerable talent.",
    "However, while the web is responsible for liberating al-Sharif from her intellectual prison, her relationship with the platforms it has spawned is complex. She is torn between a respect for the internet’s ability to spread knowledge and connect the farthest corners of the globe, and a very personal understanding of the hatred it can sow.",
    "Although the arrival of the internet paved the way for al-Sharif’s “enlightenment”, as she describes it, it was social media that gave her the first opportunity to stand up to authority.",
    "al-Sharif says she came to understand the power of social media during the Arab Spring, a period in the early 2010s during which a series of pro-democracy uprisings took place across the region, including in Saudi Arabia.",
    "During this time, dissidents used social media not only to discuss and debate the socio-political issues at hand, but also to organize and coordinate, to maximize the impact of the demonstrations.",
    "“It was interesting to see how social media gave us a voice,” said al-Sharif. “In a country where your opinions are unwelcome, online anonymity gave me space to question my belief system.”",
    "“I could connect with activists all around the world to exchange ideas and have discussions that could never have taken place otherwise. Twitter was our virtual civil society, the parliament we never had.”",
    "Most importantly, the world was paying attention, she says. Issues that were very local, were made international by social media, which swung the power balance in favor of the collective.",
    "Buoyed by this experience and hungry for ways to bring about change in her own country, al-Sharif identified an opportunity.",
    "In Saudi Arabia at the time, women were not allowed to drive a motor vehicle. Instead, they had to rely on male companions for transport, which placed significant limits on the freedoms of a divorcee like al-Sharif. In a bid to break the taboo (for there was no real law against the act), al-Sharif took to the streets in her car, capturing the moment using her iPhone.",
    "On YouTube, the video amassed 700,000 views in a matter of days, and many more since. And the Facebook and Twitter accounts al-Sharif later created became the basis for a community of hundreds of thousands under the banner: “Women2Drive”.",
    "Later, Saudi authorities arrested al-Sharif at her house in the early hours of the morning. The official charge: driving while female. Before the arrest was made, al-Sharif was able to warn a friend that police had gathered outside; he live-tweeted the arrest, creating a storm on social media.",
    "During the nine days al-Sharif was kept in custody, women’s right to drive in Saudi Arabia became a global story. Reportedly, Hillary Clinton heard about the arrest and put in a call to the Saudi foreign ministry to apply pressure.",
    "According to al-Sharif, social media was instrumental not just in raising awareness of the issue, but also in securing her eventual release. Saudi Arabia despises bad publicity, she explained, and social media was the perfect tool for creating it.",
    "“It wasn’t just about the right to drive, though, it was about the right to exist,” she told us. “Driving was just the most public act of disobedience; it was top of mind every time you went out on the street, so it was a useful symbol.”",
    "In June 2018, the Saudi Arabian monarchy lifted the driving ban at last; a small triumph for al-Sharif and the Women2Drive movement, although the battle for women’s rights in the country continues.",
    "Social media hasn’t always been a power for good in the life of al-Sharif, however. After her activism began to attract attention, and conservative media started covering the story, she faced a torrent of abuse online from people who thought she had disgraced herself and her country.",
    "As a result of her newfound notoriety, al-Sharif was also “softly pushed out” of her job at oil company Saudi Aramco, which had been supportive of her desire to work in cybersecurity (which was highly unusual at the time), but unwilling to shoulder negative publicity itself.",
    "“It was a high price to pay, but you lose battles to win wars,” she told us. “If I could turn back time, I wouldn’t have changed a thing.”",
    "Although al-Sharif developed coping mechanisms to deal with the criticism and vitriol online, she could not abide the way in which dictatorial powers were beginning to weaponize social media platforms.",
    "In fact, al-Sharif deleted all her social profiles in 2018, even though this meant severing the line of communication with her many thousands of followers. She did so live on stage during a speech at an EU summit in Stockholm, in the aftermath of the assassination of journalist Jamal Khashoggi by the Saudi state.",
    "When people like al-Sharif took to social media to discuss the killing and launch criticism at the Saudi regime, they were “washed out” by trolls and bots (known in Saudi Arabia as “flies”), she says. These automated accounts were designed explicitly to push the monarchy’s agenda, intimidate dissidents and quiet any rumors of its role in Khashoggi’s murder.",
    "In the weeks after news of the assassination emerged, these were some of the the trending hashtags on Twitter in the country (translated from the original Arabic):",
    "Neither is Saudi Arabia the only nation accused of abusing bot farms to sow discord, spread misinformation and squash its opponents. For example, Russia was found to have used bots to manipulate voters ahead of the 2016 US election, which resulted in the presidency of Donald Trump. And China is known to have used fake Twitter accounts to spread pro-government messages during recent protests in Hong Kong, and in the early days of the Covid-19 pandemic.",
    "“I went from someone who completely believed in social media, to someone who was horrified by it,” said al-Sharif. “During this period, I felt very hopeless. Suddenly we had lost a platform that had given us a voice.”",
    "“The same tools we had used to liberate ourselves were now being used for oppression. This was a profound discovery.”",
    "Life after social media is quieter for al-Sharif, especially now she is living in Australia in self-imposed exile. She says she is disconnected from Saudi Arabia since quitting, but is otherwise glad of the opportunity to reflect.",
    "In spite of her opinions about the companies running the world’s largest social media and internet platforms, al-Sharif remains optimistic about the prospects society can find a way to harness their benefits and keep their destructive potential in check.",
    "Having left her job as CISO at the University of New South Wales, she has turned her attention to a new project: the Ethical Technologists Society, an organization she founded to raise awareness of breaches of digital rights. She has also started a podcast, called Tech4Evil, in which she tackles the abuse of centralized power, surveillance capitalism, data privacy and other related issues.",
    "Asked how she would begin to address the problems with today’s algorithm- and ad-based internet models, al-Sharif explained the issues can only be solved through conversation. She says technologists are guilty of speaking the language of technologists, but it's important now to broadcast the message to a wider audience.",
    "“Ultimately, people must boycott companies that betray their trust. These companies have become what they are because of the power of the network,” she told us. “We don’t want to lose the power of technology, but we also don’t want people to give away their digital rights for the sake of convenience. There is a middle ground.”",
    "Although money is tight and her plan not yet fully fleshed out, al-Sharif and the Ethical Technologists Society will endeavor to build an “ethical technology index” to help people make informed decisions about the companies they interact with. She imagines such a system could also be used to hold technology companies accountable for the consequences of their actions.",
    "The organization will also push for greater transparency in the sector. al-Sharif reserved some praise for Twitter, which recently launched a service that shines a light on any information requests it receives from governments, and Reddit does something similar. But she says these companies must go further, providing full access to their algorithms for independent audit, especially Facebook.",
    "There are also micro-rebellions that everyone can practice, she says, to minimize the stranglehold of Big Tech. For example, boycotting Google Search to deprive the company of advertising revenue, or always using a VPN and private browser to shield internet activity from prying eyes. In isolation, these acts are inconsequential, but en masse could begin to create noise.",
    "The path out of the labyrinthine created by abuses of the internet is as yet unclear. For every solution to the complex problems in question, there is an equally persuasive and legitimate counterargument. But al-Sharif has faith in the ability of technology to deliver us from this situation, just as it did when she was young."
  ],
  "headers": {
    "6": "The right to drive",
    "20": "Weaponizing social media",
    "30": "Where do we go from here?"
  },
  "links": {
    "information security": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "web": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "global story": "https://www.nytimes.com/2011/05/24/world/middleeast/24saudi.html",
    "assassination of journalist Jamal Khashoggi": "https://www.nytimes.com/2021/02/26/us/politics/jamal-khashoggi-killing-cia-report.html",
    "used bots to manipulate voters": "https://www.nytimes.com/2020/03/29/technology/russia-troll-farm-election.html",
    "spread pro-government messages": "https://www.propublica.org/article/how-china-built-a-twitter-propaganda-machine-then-let-it-loose-on-coronavirus",
    "Tech4Evil": "https://tech4evil.com/",
    "data privacy": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "launched a service": "https://transparency.twitter.com/",
    "something similar": "https://www.redditinc.com/policies/transparency-report-2020-1",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "private browser": "https://www.techradar.com/best/anonymous-browsing"
  }
}