{
  "source": "https://www.techradar.com/news/how-marvel-shows-on-disney-plus-could-change-tv-forever-in-2021",
  "title": "How Marvel shows on Disney Plus could change TV forever in 2021",
  "category": "entertainment",
  "updated": "2021-01-05T13:00:47Z",
  "author": "samuel-roberts",
  "summary": "Blockbuster TV is about to take over",
  "article": [
    "The Mandalorian was just the start: on January 15, WandaVision brings the Marvel Cinematic Universe to Disney Plus for the first time, and from there it escalates throughout 2021. On March 19, Cap spin-off The Falcon and the Winter Soldier rolls out weekly, and then Loki comes to the small screen in May. Next up, in the middle of the year, the Marvel animated show What If? brings actors from the movies back to voice key characters in alternate universe scenarios. Finally, 2021 is due to be rounded out by shows about Ms Marvel and Hawkeye, both of which will introduce new heroes to the MCU.",
    "That's a lot of Marvel, and it's actually just the start. Many more shows will follow in subsequent years, but none of this is news if you're even vaguely tuned in to the goings-on of this fictional universe. What's weird is how much of it there is in 2021 – which is partly determined by Covid-related production delays, which pushed a couple of series back from last year. If you thought the first 12 months of Disney Plus was a little slow for originals (and I did, though Simpsons marathons kept me busy), this avalanche of Marvel stuff is most welcome.",
    "In 2021, Marvel is going to be at the heart of the pop culture conversation – and it's never going to let up. I expect this run of shows to be incredibly influential on Disney's competition, in trying to make similarly broad series with massive budgets and big stars. But is that a good thing? And do we really need this many Marvel shows?",
    "I've heard a few people say that The Mandalorian season 2 essentially replaced blockbuster movies in 2020 – both in the scale of the show, which was indistinguishable from the films in how elaborately it was presented, but also in how we talked about it online. I think that's true. For the eight closing weeks of 2020, The Mandalorian was pop culture for a lot of people, and while the show isn't at all that complicated to follow, there was plenty to dissect from a Star Wars lore perspective.",
    "These Marvel shows could each be as big a deal as The Mandalorian, inspiring a similar level of debate, memes and explainers of where certain elements originated in the comics. People are particularly hungry for Marvel content right now, and what's a better distraction from a seemingly endless pandemic than your first visit to the MCU since summer 2019?",
    "Marvel is likely to be at the heart of television discussion in 2021, just by the commercial strength of the characters and sheer volume of series. But I think it's leading to a larger overall change in TV to come, where 'blockbuster' TV shows are going to become more valuable to services than the types of prestige dramas that have largely defined the streaming age so far (the House of Cards, Ozark and Orange is the New Black-type series).",
    "There is definitely room for both – just look at The Queen's Gambit, watched by 62 million households on Netflix around the same time The Mandalorian returned – but I do think the next frontier of streaming TV is everyone looking for their own version of Mando. That is, a crowd-pleasing series, perhaps based on a familiar character or property, that appeals to as many people as possible.",
    "The Mandalorian is a strange TV show in that it doesn't observe the rules of recent trends in TV drama. Indeed, as it's been pointed out many times, it's more like a Xena-style adventure-of-the-week type series, the likes of which were mostly popular in the '80s and '90 rather than recent history. Of course, Mando is different from those earlier shows for numerous reasons – costing a lot more to make and being set in the Star Wars universe, for example.",
    "By taking those influences, though, it's deeply refreshing to watch versus other modern TV shows – and it's impossible to envision it being better if it swapped its adventure-of-the-week format for a more talky, serialized drama approach. Unlike a lot of prestige-style shows seen on the likes of Netflix and HBO, too, The Mandalorian is designed to be watched by kids as well as adults.",
    "It's not like The Mandalorian is entirely without precedent. Star Trek: Discovery, which is frustratingly inconsistent, is based on a popular existing property and clearly a more contemporary and expensive-looking show than the older Trek series. But Discovery feels much more like it's trying to be a weighty hour-long drama than Mando, attempting to fit into a TV landscape that already exists.",
    "On the horizon, there are other signs that people are trying to craft their own versions of The Mandalorian, or the Disney Plus Marvel shows – that is, taking existing pop culture properties, and building a monstrously big TV series around them. Just look at Amazon, which is making a show based on the Fallout games, as well as a Lord of the Rings series and another fantasy series based on The Wheel of Time books. To a lesser extent, too, The Boys and upcoming comic book adaptations like animated superhero series Invincible and the Stranger Things-ish Paper Girls show how having well-regarded source material is a helpful sell.",
    "On HBO Max in the US, too, numerous TV shows based on DC Comics characters are in the works. This isn't new, by any means – Warner Bros has been making them since Smallville and the Batman animated series. The key fresh element, however, is that these shows will tie in to the theatrical movies, including an upcoming Gotham police drama crossing over into 2022's The Batman, and a spin-off of The Suicide Squad based on John Cena's character, Peacemaker. Crossing the two over is a deliberate part of the future strategy – as discussed in a New York Times interview with DC Films' Walter Hamada.",
    "Again, that feels like an approach that takes a page from the Marvel playbook, of ensuring you need to watch the TV shows to follow the story of the films. But it also shows how blockbuster movies are spilling onto our TV screens in a way that's different to how it used to be – it's a big shift from the church-and-state approach taken in the past, and illustrates how important TV subscription fees are to these older entertainment companies. They want to make something you've never seen before to keep you spending money.",
    "The Mandalorian offers hope that this newer type of blockbuster TV can be incredibly exciting, and capture the thrills of watching a movie on the big screen. Marvel's efforts, though, are still a bit of a mystery at this point – and these shows coming this year all sound drastically different to each other, meaning we could see some resonate more than others.",
    "We'll soon see how successfully they connect with people, and how closely the TV side resembles the 23 movies in the MCU. It's hard not to be optimistic about the idea of seeing some of these characters again – and even if six shows seem like a lot for 2021, it'll sure give us something to talk about in a year where blockbuster movies still seem uncertain in large parts of the world.",
    "This is a new phase in the streaming TV arms race. The TV shows you love probably aren't going to change any time soon. But the shows people are talking about all the time could look very different in a year's time."
  ],
  "headers": {
    "3": "The birth of real blockbuster TV",
    "7": "Are these types of shows new?",
    "13": "But will it equal great TV?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "show based on the Fallout games": "https://www.techradar.com/news/fallout-tv-show-on-amazon-prime-trailer-release-date-predictions-and-what-we-know",
    "Lord of the Rings series": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "The Boys": "https://www.techradar.com/news/the-boys-season-3-release-date-season-2-ending-explained-castplained-cast",
    "The Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer",
    "New York Times interview": "https://www.nytimes.com/2020/12/27/business/media/dc-superheroes-movies.html"
  }
}