{
  "source": "https://www.techradar.com/news/canon-eos-r7-tipped-to-arrive-in-2022-to-mark-the-end-of-eos-m-cameras",
  "title": "Canon EOS R7 tipped to arrive in 2022 to mark the end of EOS M cameras",
  "category": "cameras",
  "updated": "2021-12-01T15:40:44Z",
  "author": "mark-wilson",
  "summary": "Rumors suggest an APS-C RF mount camera is 'definitely' en route",
  "article": [
    "So far, all of Canon's RF-mount mirrorless cameras have been pricey, pro-focused models with slightly painful price tags. But the good news for amateur and hobbyist shooters is that this is almost certain to change in 2022, according to fresh rumors.",
    "The reliable Canon Rumors has been told by a \"solid source\" that \"Canon is 'definitely' releasing an APS-C RF mount camera in 2022\". The site didn't go as far as naming the model or any specifics, only raising the possibility of an EOS R7 that \"could take the place of the EOS M line.\" But given previous rumors, the arrival of an EOS R7 is certainly the most likely scenario.",
    "There has been growing speculation about the arrival of a Canon EOS R7, or at least an APS-C camera with Canon's RF-mount, for well over a year now. Canon Rumors even reported in December 2020 that one was already being tested in the wild, and was based on the chassis of the Canon EOS R6 .",
    "Whether it's been pandemic-related delays or simply the fact that Canon has been focusing on the Canon EOS R3 and fleshing out its lens lineup, the much-anticipated EOS R7 seems to have stalled in recent months. But an APS-C RF-mount camera seems almost certain to land in 2022, given that Canon Rumors gave its speculation a rumor rating that it says equates to \"fact.\"",
    "The question now is, what kind of camera will it be, and what does this mean for Canon's current EOS M series? The latter, which arrived in 2012 as a mirrorless alternative to Canon's EF-mount DSLRs, seems destined for abandonment. Canon's focus is now on making high-end glass for its RF-mount cameras, though the EOS M series will still provide super-cheap options for beginners for the next few years.",
    "We'll have to wait for firmer rumors on the Canon EOS R7, if that is indeed the first RF-mount camera with a smaller APS-C sensor, but previous speculation has suggested that it's likely to be compact hybrid model for sports shooters and videographers. If it's built around the design and engine of the Canon EOS R6, that could be a recipe for Canon's most popular mirrorless camera far.",
    "Sensor size is usually a good indicator of a camera's price point and target audience – and while many professionals, in particular landscape snappers, use cameras with smaller APS-C sensors, it's fair to say that the arrival of a Canon EOS R7 would open up the RF-mount to a whole new audience.",
    "Previous speculation has suggested that the EOS R7 won't be an entry-level model, but rather a 'mini EOS R6' for sports and wildlife shooters who demand a speedy, lightweight camera. But it's also likely to be the first of many Canon RF-mount mirrorless cameras, as they take the baton from the older EOS M range in 2022.",
    "Why does Canon need a whole new system for APS-C mirrorless cameras? Some might cynically say \"to sell more lenses\", but there are solid technical reasons why it makes sense. Firstly, the RF-mount has big advantages over Canon's previous mounts, including a greatly-reduced flange distance (the space between the lens mount and image sensor) and a data pathway that has a higher bandwidth. These mean it can design new lenses that simply haven't been possible before.",
    "It also makes sense for Canon, and Canon photographers, to only have one mirrorless mount to worry about. This is a benefit that Sony has often crowed about with its E-mount, which is found on both APS-C and full-frame mirrorless cameras. This would allow Canon snappers and video creators to have two or more bodies that all share the same lenses.",
    "The other benefit of APS-C sensors is that they can provide more reach (with longer effective focal lengths) in smaller, lighter lenses. This means Canon would need to develop some more compact RF-mount glass, or at least properly open up the RF-mount to third-party lens makers, to help its new APS-C cameras realize their potential. But the Canon EOS R7, if that's what it's ultimately called, would certainly be an exciting first step for anyone who's looking to buy a powerful, compact mirrorless camera in 2022."
  ],
  "headers": {
    "6": "Analysis: next-gen Canon cameras for hobbyists"
  },
  "links": {
    "Canon Rumors": "https://www.canonrumors.com/canon-will-release-an-aps-c-rf-mount-cameras-later-in-2022-cr3/",
    "Canon EOS R7": "https://www.techradar.com/news/canon-eos-r7",
    "Canon EOS R6": "https://www.techradar.com/reviews/canon-eos-r6-review",
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3"
  }
}