{
  "source": "https://www.techradar.com/news/divinity-original-sin-2-is-now-on-ipad-pro-heres-what-its-like-to-play",
  "title": "Divinity: Original Sin 2 is now on iPad Pro – here’s what it’s like to play",
  "category": "gaming",
  "updated": "2021-05-18T16:00:12Z",
  "author": "david-lumb",
  "summary": "Divinity: Original Sin 2, the lauded RPG, is available on the iPad Pro today.",
  "article": [
    "Larian's Divinity: Original Sin 2 is one of the most celebrated RPGs in recent years, channeling the appeal of classic games like Baldur's Gate and Neverwinter Nights to the modern day. Thanks to the power of iPad Pro tablets, you can take Divinity: Original Sin 2 to go – but there are a few adjustments when playing on a smaller screen.",
    "Thankfully, most of the game’s base functionality has been imported, including its impressive volume of voiced dialogue and narration. Visually, the game looks identical to the console versions of Divinity: Original Sin 2, with graphics akin to the ‘highest’ settings on PC. It’s a mobile version without any story or experiential compromises, with all Grab Bag DLC included for $25 (around £18 / AU$32).",
    "The big changes are in the touch interface, which translates the expansive array of interactions in the game to different gestures and touch controls. It works as best it can – and truly, anything you want to do in the game, you can do with a series of touches and taps – but it takes a bit more effort to do, well, everything.",
    "That’s the limitation of a touch interface, but thanks to recent iPadOS updates, you can easily link a console controller (including PS5 and Xbox Series X gamepads with iPadOS 14.5) to your iPad Pro and use that instead. I vastly preferred to play this way rather than wrestle with the touch interface, and the controls on the PS4 DualShock 4 gamepad were similarly mapped to those on the console version – meaning veterans of the latter will effortlessly switch to playing this way on the iPad Pro version. Desktop players will need a bit of retraining for either method, or they could link up a Bluetooth keyboard and mouse to their iPad Pro if they have the sedentary luxury and play that way.",
    "Larian had already quietly been developing an iPad Pro version with Elverils, a Saint Petersburg-based studio with experience porting desktop and console games to mobile platforms, when Apple informed the former that an even more powerful tablet was on its way: with a 2018 or 2020 iPad Pro, Divinity: Original Sin 2 runs at 30fps, but can achieve up to 60fps on a 2021 iPad Pro powered by the M1 chipset – the same silicon in the newest Apple desktop computers.",
    "Thanks to all that power, the game can effortlessly transition to and from split-screen when multiple players party up for the easy drop-in/drop-out couch (or car/bus/train/plane) co-op the original game is known for. Or they can join their friends with cross-play between PC/Mac or other iPad Pro players (sorry, no console for now). There’s also cross-save progression, but only between the tablet and Mac versions of the game.",
    "Unfortunately, the game’s graphical and performance demands mean the 2017 iPad Pro and older models can’t run the game, though it will work on the souped-up iPad Air 2020. And like other graphically-intensive mobile games, this one drains battery, sucking just under 25% in an hour of play during our time with it. But for the novelty of taking Divinity: Original Sin 2 on the go, players who already have the pricey and powerful tablets now have a new 100-plus hour RPG to take with them. And compared to iPad ports of games like Baldur’s Gate and Baldur’s Gate 2, Divinity: Original Sin 2 is a thoroughly modern experience.",
    "So how is it to play the desktop RPG on a tablet?",
    "I tried out pre-release builds of Divinity: Original Sin 2 on an iPad Pro 2020 – except for a handful of lucky device reviewers, the M1-packing iPad Pro 2021 is out of reach for everyone until it ships in July. I’m looking forward to that smooth 60fps gameplay when I can get my hands on the most advanced Apple tablet, but until then, I had a great time playing Divinity: Original Sin 2 on the 2020 model.",
    "As previously mentioned, the iPad Pro version of the game plays almost identically to the console and desktop version aside from the interface and control options. There’s still multiple modes and difficulties available (Story, Classic, Tactical, and Adventure) when starting a new game, as well as the option to pick a pre-made character or customize one yourself.",
    "The gameplay screen is preserved from the other versions, with a skill bar at the bottom, minimap in the top right corner, and your current character in the top left corner, with portraits cascading down for the rest of your party. Given the smaller screen than your average computer or console monitor, the skill bar takes up the entire bottom width.",
    "Graphically, the game looks beautiful, taking full advantage of the iPad Pro 12.9’s 2732x2048 pixel resolution – which about matches the 1440p max resolution of the PC game. You’d have to really stare side-by-side at footage of the original game at max settings (like in this video here) to notice very slight differences – some slightly less dynamic lighting, some slightly lower-res textures in the environment, some toned-down environmental effects (like lower-framerate fires), and in my case, the 30fps cap. It’s paltry, and more a testament to the fidelity of the mobile version than any complaint.",
    "(A quick note: I played using a Magic Keyboard, more for its use as a sturdy base-and-stand combo than for its keys, as there’s no keyboard or touchpad functionality in the iPad Pro version aside from typing in local/party chat. The game does support keyboard and mouse controls via Bluetooth, which we didn’t test.)",
    "The big change – and adjustment – are the controls. As previously mentioned, I highly preferred playing with a console controller than with the touch controls, especially since I’d played the console version before. Its controls are roughly similar: face buttons for interacting, canceling, and ending turns early, while holding down the right trigger brought up a radial wheel with character skill, equipment, and party details.",
    "The touch controls relegate all of these to various menus that expand from single buttons located in the top-right corner around the minimap. Pressing the big helmet button unfurls all the character skills, equipment, and other options (press it again to furl them back up and keep the screen clear). The blue ‘eye’ button unfolds a button for several camera options as well as a button for ‘search area,’ which you’ll probably end up tapping a lot.",
    "That’s because single-tapping the screen is both ‘move to this location’ and highlight an object, while double-tapping interacts with an object – meaning you might tap to check something out and accidentally start running over, blundering into enemy sightlines or triggering traps or even simply running into pools of fire or acid or any of the various character-harming liquids the game loves to spill in the player’s way.",
    "This isn’t an insurmountable challenge, and can be managed with some finesse, but it does mean the game takes a bit more time to weave through than it does with other control methods. Likewise with the camera – instead of keys or a dedicated joystick, you’ll have to alternate between moving, interacting, and shifting the camera. Luckily, the latter are intuitive, with the expected gestures and results: tap-and-drag to pan around, twirl two fingers to rotate, and pinch-and-zoom to, well, zoom. Your fingers just have to take turns rather than multitasking across a keyboard or controller.",
    "There’s also a cute (and optional) magnifying glass that appears when you select a spell to ensure pinpoint targeting. All the tap-button menus, chat windows, activity logs, and other expandable screen elements can be folded back up by tapping again, keeping everything clear. And there’s even a couple novelty quick-access buttons to ‘ping’ and ‘quicksave’ that are easily found around the mini-map; in short, it may be a lengthier process to get around in the iPad Pro version of Divinity: Original Sin 2, but it’s got everything you remember from the original.",
    "So with the successful adaptation of Larian’s 2017 masterpiece, what’s in store for the studio’s next games – perhaps including its current project, Baldur’s Gate 3, which is still in early access on PC?",
    "Divinity: Original Sin 2 on iPad Pro is Larian’s first mobile game, according to Michael Douse, Director of Publishing at Larian, who doesn’t count the Nintendo Switch version of D:OS2 that came out in September 2019. The studio started work on the adaptation two years ago, which isn’t a port, he insisted to TechRadar in an interview, citing the complete version of the game in the iPad Pro version.",
    "Larian chose the iPad Pro because it could reproduce the game in total – the team and Douse tentatively claim D:OS2 is the first AAA game to run on an iPad Pro, though I can’t think of any other non-abridged games to make the jump – and the results speak for themselves, with the iPad Pro version rivaling console-level quality.",
    "Then came news of the M1 chipset in the iPad Pro 2021, which Douse estimates pushes the tablet’s performance somewhere between prior (Xbox One, PS4) and current-gen consoles (Xbox Series X, PS5) – perhaps underpowered compared to the latter, but still capable of showcasing an impressive array of games, much like the Nintendo Switch.",
    "“You look at what the Switch has been doing with back-catalog games – a very large percentage of successful Switch games are games that were released quite a long time ago that are still relevant. What does that mean for iPad now, and what does that mean for ARM [chipsets],” Douse said.",
    "There are some limitations to the iPad format – the touch interface, of course, but also the 11-inch and 12.9-inch displays, which put a cap on resolution potential. Instead, the team has pushed for sharpness and fluidity: D:OS2 has over 8,000 shaders (discrete programs modifying light and texture on graphical elements), which Douse believes is unprecedented for iPad games.",
    "“In terms of premium games, I think we have a feature set that is unmatched by any other prior game on the platform. What can we take with what we’ve learned working on the M1 to the MacBook Pros and maybe apply that knowledge to future games,” Douse said. “We’d be going into the territory of a next-gen version of the game which is crazy if you think about the permutations of a mobile platform entering those discussions – how do you take a [game] on PC and Xbox One and PS4 and take it even further into next-gen?”",
    "Or perhaps, maybe, Baldur’s Gate 3, which is still in early access on PC? Douse couldn’t comment on that – officially, ‘no firm plans’ on an iPad Pro version of Baldur’s Gate 3 – but knowing that there is a mobile chip that matches Larian’s ambitions changes how they might plan their game releases. When developers don’t need to ‘nerf’ textures or shadows or anything on 100-hour RPG players can take anywhere, how will that change the ecosystem?",
    "The answer depends on consumers, Douse says: to him, D:OS2 is a bit of a bellwether, which could lead players to demand more uncompromised 100-hour RPGs and inspire more developers to make them. On the plus side, Larian figured out a lot of solutions for adapting its game engine to tablets and developing a touch interface that could be used in future games. But the studio won’t know whether it will make more until D:OS2 hits the App Store and, perhaps, changes the conversation; positive feedback (and likely, sales) could change their plans going forward.",
    "“Will players want more of that? Will people start saying ‘oh, this [iPad Pro] is a bonafide gaming device that we can have premium experiences on?’” Douse said. “I think the narrative around that is going to shape what we do with the ability to make our games mobile in the future.”"
  ],
  "headers": {
    "8": "Divinity: Original Sin 2 by touch",
    "19": "Larian and iPad: an unlikely match?"
  },
  "links": {
    "iPadOS": "https://www.techradar.com/news/ipados-145",
    "link": "https://www.techradar.com/how-to/how-to-connect-a-ps4-controller-to-your-iphone-ipad-or-android-phone",
    "iPadOS 14.5": "https://www.techradar.com/news/ipados-145",
    "iPad Air 2020": "https://www.techradar.com/reviews/ipad-air-4-review",
    "iPad Pro 2020": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "video": "https://www.youtube.com/watch?v=faMmAGy0ma0"
  }
}