{
  "source": "https://www.techradar.com/news/us-government-teams-up-with-tech-giants-to-tackle-the-next-big-cyberattack",
  "title": "US government teams up with tech giants to tackle the next big cyberattack",
  "category": "computing",
  "updated": "2021-08-05T19:32:51Z",
  "author": "anthony-spadafora",
  "summary": "CISA taps Amazon, Microsoft, Google and other tech firms for new cybersecurity initiative",
  "article": [
    "The US government has announced that it will partner with Amazon, Microsoft, Google and other tech companies as part of a new initiative aimed at bolstering the country's cyber defenses.",
    "The initiative, called the Joint Cyber Defense Collaborative (JCDC), will see the Cybersecurity and Infrastructure Security Agency (CISA) work alongside leading technology providers, cybersecurity firms and telecoms to create and execute new cyber defense operations plans.",
    "According to a report from the Wall Street Journal, the JCDC will initially focus on combating ransomware and other cyberattacks on cloud computing providers to avoid situations like the recent Kaseya supply-chain ransomware attack which occurred earlier this summer.",
    "CISA director Jen Easterly explained in a press release how the JCDC will help the US government as well as businesses deal with the most serious cyber threats to the country, saying:",
    "“The JCDC presents an exciting and important opportunity for this agency and our partners – the creation of a unique planning capability to be proactive vice reactive in our collective approach to dealing with the most serious cyber threats to our nation. The industry partners that have agreed to work side-by-side with CISA and our interagency teammates share the same commitment to defending our country’s national critical functions from cyber intrusions, and the imagination to spark new solutions. With these extraordinarily capable partners, our initial focus will be on efforts to combat ransomware and developing a planning framework to coordinate incidents affecting cloud service providers.”",
    "By establishing the JCDC, CISA will be able to integrate unique cyber capabilities across multiple federal agencies, state and local governments and private sector businesses to achieve shared objectives.",
    "The new initiative will also allow the public and private sector to share insights, implement coordinated defensive cyber operations and support joint exercises to improve cyber defense operations in the US.",
    "In addition to AWS, Microsoft and Google Cloud, AT&T, Crowdstrike, FireEye Mandiant, Lumen, Palo Alto Networks and Verizon will also work alongside the JCDC. Meanwhile government partners include the Department of Defense (DoD), US Cyber Command, the NSA, the Department of Justice (DoJ), the FBI and the Office of the Director of National intelligence.",
    "By working together with technology companies, the US government and CISA will hopefully be able to prevent future supply-chain attacks while improving the country's cyber defense capabilities.",
    "Via Wall Street Journal"
  ],
  "headers": {
    "5": "Joint Cyber Defense Collaborative"
  },
  "links": {
    "CISA": "https://www.techradar.com/news/nsa-cisa-heres-how-we-can-properly-secure-kubernetes",
    "a report": "https://www.wsj.com/articles/u-s-taps-amazon-google-microsoft-others-to-help-fight-ransomware-cyber-threats-11628168400?mod=djemalertNEWS",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Kaseya supply-chain ransomware attack": "https://www.techradar.com/news/kaseya-ceo-says-thousands-of-firms-may-be-affected-by-ransomware-attack",
    "press release": "https://www.cisa.gov/news/2021/08/05/cisa-launches-new-joint-cyber-defense-collaborative",
    "AWS": "https://www.techradar.com/news/aws",
    "Google Cloud": "https://www.techradar.com/news/google-cloud-wants-to-help-secure-your-whole-enterprise-network",
    "DoD": "https://www.techradar.com/news/you-can-now-have-thousands-more-people-in-your-microsoft-teams-call",
    "DoJ": "https://www.techradar.com/news/doj-disrupts-massive-business-email-scam-operation",
    "Wall Street Journal": "https://www.wsj.com/articles/u-s-taps-amazon-google-microsoft-others-to-help-fight-ransomware-cyber-threats-11628168400?mod=djemalertNEWS"
  }
}