{
  "source": "https://www.techradar.com/news/hawkeye-episode-3-recap-marvels-latest-tv-show-lands-a-bullseye",
  "title": "Hawkeye episode 3 recap: Marvel's latest TV show lands a bullseye",
  "category": "entertainment",
  "updated": "2021-12-01T14:03:31Z",
  "author": "richard-edwards",
  "summary": "Massive Hawkeye episode 3 spoilers ahead",
  "article": [
    "Spoilers for the first three episodes of Hawkeye follow. You've been warned.",
    "For a TV show named after the “World’s Greatest Marksman” – though we’re pretty sure Green Arrow would dispute that – the first two episodes of Hawkeye were relatively light on the bow-and-arrow stuff.",
    "That’s remedied in ‘Echoes’, however, as Clint Barton and Kate Bishop deliver a spectacular audition for the US Olympic archery team – much of it while hanging out the side of a car that isn't a vintage Dodge Challenger.",
    "Their race across New York is undoubtedly one of the best action sequences to come out of any Marvel Cinematic Universe (MCU) Disney Plus show. As the Tracksuit Mafia pile into the chase, we’re treated to an infectious mix of sharp dialogue, Fast & Furious-style stunt driving, and a lucky dip of trick arrows so ingenious that Robin Hood’s feud with the Sheriff of Nottingham could have been done and dusted in a matter of minutes.",
    "It’s the highlight of Hawkeye’s best outing yet, an episode that cements the Barton/Bishop dynamic while expanding the show’s scope with the (proper) introduction of Maya Lopez, star of Marvel’s upcoming Echo TV show and one of the MCU's growing list of Phase 4 projects.",
    "While previous episode ‘Hide and Seek’ lost momentum as soon as Clint and Kate went their separate ways, ‘Echoes’ makes sure they never leave each other’s orbit. It’s the smartest move the writing team could have made, because the chemistry between Jeremy Renner and Hailee Steinfeld is so strong you’d still be hooked if none of their scenes were punctuated by blockbuster-grade stunts.",
    "Crucially, though, their friendship is given space to evolve, the cynical father figure/wide-eyed fan hierarchy gradually flattening out into something akin to mutual respect. And while there’s nothing like being taped to a pair of coin-operated horses when you need to deliver some home truths – Clint still needs to remind Kate he’s the one protecting her – it’s also the place Hawkeye concedes there might be some talent lurking behind his sidekick’s rich-kid privilege. From there, all it takes to make Clint concede she might soon be troubling the archery world rankings is a high-speed dash across the Big Apple and a daring leap off a bridge.",
    "There’s a growing tenderness to the double act, a sense Clint and Kate are starting to trust one another, too. Hawkeye’s admission that he felt the same buzz as Kate when he first became a superhero is a rare glimpse beyond the cynicism, sacrifice and loss that now cloud his feelings about life as an Avenger. Meanwhile, his insistence that he really isn’t a role model comes loaded with subtext, whether it’s guilt about his actions as Ronin, or the fact most of his career has been spent as the mortal guy standing alongside literal gods. Can firing a load of fancy arrows really cut it when a friend from work can summon thunder and lightning?",
    "‘Echoes’ also treats Clint’s hearing loss – more of a side note in Hawkeye’s first two episodes – with sensitivity. Clint and Kate’s out-of-sync Subway conversation about compliments and dogs skirts a fine line between tenderness and humor, while Clint’s phone call with his youngest son is a genuinely beautiful piece of writing. The way Kate steps in to transcribe Nate’s words shows she’s got Clint's back, while Renner makes Barton's emotional shift, from confusion to frustration to sadness to joy, look effortlessly natural.",
    "Have you ever longed for anyone to make it home in time for Christmas more than you do Clint in this moment? It’s a not-a-dry-eye-in-the-house moment, and anyone who claims Marvel is just about people in fancy suits blowing stuff up should watch this scene.",
    "‘Echoes’ may be the Clint ’n’ Kate show, but it also provides a spectacular entrance for Maya Lopez. Newcomer Alaqua Cox makes her mark on the series from her very first scene, and it feels like an important, inclusive step for Marvel to have so many scenes in American Sign Language (ASL).",
    "The episode’s opening flashback deftly highlights the parallels and contrasts between two women of a similar age whose lives have taken them in very different directions. Where Kate grew up in a world of wealth and privilege, Maya was pulled into the world of organised crime – yet both are motivated by the deaths of their fathers.",
    "Indeed, Maya’s desire to exact revenge on Ronin for killing her dad appears to be all-consuming – to the point it almost seems a shame that we already know she’s getting her own TV show. Some kind of redemptive arc is clearly imminent, but a bit more ambiguity at this stage would surely have been better for the character.",
    "Right now, however, our biggest question concerns step-dad-elect Jack’s motives, and his possible connections with the Tracksuit Mafia. Popping up in the final scene brandishing a sword rather than a butterscotch, when Clint and Kate 'break' into the home of the latter's mother, suggests he’s not just popped in for a friendly chat. Hopefully, Kate’s a little better at swinging through the penthouse from chandeliers than that time she broke her arm. She'll need to be if the duo are to get out of another predicament.",
    "After a promising start, ‘Echoes’ is the episode where Hawkeye establishes itself as a must-watch – with memorable action, cracking one-liners and moments of surprising tenderness.",
    "Truthfull, it’s everything you could possibly want from a Marvel TV show or movie. Meanwhile, in just a few minutes on screen, Alaqua Cox’s brilliant performance as Maya Lopez does more than enough to raise anticipation for her Echo TV show. And, with a tease about the series' potential villain exciting fans, it seems that the back half of the show's six episode run will be just as memorable for the right reasons.",
    "Against all the odds, Hawkeye’s belated elevation to the ranks of Marvel’s most beloved heroes may actually happen – if he can just deal with all that tricky Ronin-shaped baggage, that is.",
    "New episodes of Hawkeye stream on Disney Plus every Wednesday."
  ],
  "headers": {
    "14": "Our verdict",
    "17": "Marvel-ous facts"
  },
  "links": {
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Phase 4 projects.": "https://www.techradar.com/news/marvel-phase-4",
    "with a tease about the series' potential villain": "https://www.techradar.com/news/hawkeye-episode-3-may-have-just-confirmed-the-return-of-a-fan-favorite-character"
  }
}