{
  "source": "https://www.techradar.com/news/nvidia-rtx-3080-shortage-could-continue-until-q3",
  "title": "Nvidia RTX 3080 shortage could continue until Q3",
  "category": "computing",
  "updated": "2021-03-15T17:02:30Z",
  "author": "carly-page",
  "summary": "Supply issues are unlikely to ease up anytime soon",
  "article": [
    "Nvidia’s RTX 3000-series stock shortage is unlikely to ease up anytime soon, with reports claiming Ampere GPUs will remain in short supply until the third quarter.",
    "Back in January Nvidia's CFO, Collette Kress, suggested that the ongoing GPU shortage would likely improve in the second quarter, saying \"we expect overall channel inventories… will likely remain lean throughout Q1.",
    "However, Digitimes reports that it’s “unlikely” that the GPU shortage will ease until the third quarter of the year - which means the RTX 3060, RTX 3060 Ti, RTX 3070, RTX 3080, and RTX 3090 will remain in short supply until July at the earliest.",
    "There are multiple reasons behind the ongoing stock shortage, from Covid-19 supply chain issues to global shortages of GDDR6 memory. A significant proportion of RTX 3000 GPUs have also been snapped up by cryptominers, which Nvidia has attempted to tackle with hash rate limiters and the release of its crypto-focused CMP series of graphics cards.",
    "Digitimes reports that Samsung’s 8nm yields for Nvidia’s Ampere GPU is another contributing factor, with the company said to be struggling to get good numbers of working chips from each wafer.",
    "There’s some good news, however, as the report mentions that TSMC is freeing up some additional supply due to the fact Apple has released some of the stranglehold it had over the company’s 5nm and 7nm manufacturing capabilities.",
    "Sweclockers claims that AMD and Nvidia are among these manufacturers and, while AMD might focus its efforts its newly-announced EPYC Milan server chips, Nvidia might actually have some RTX 30-series cards being made by TSMC instead of Samsung.",
    "Digitimes’ report comes after a MarketWatch report suggested that the ongoing chip supply issues won’t be resolved until 2022. It spoke to analysts who suggested it would take three-to-four quarters for supply to catch up with demand and then another one-to-two quarters for inventories at customers/distribution channels to be replenished back to normal levels."
  ],
  "headers": {},
  "links": {
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "Digitimes": "https://www.digitimes.com/news/a20210315PD201.html",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3090-find-stock-here",
    "GDDR6 memory": "https://www.techradar.com/news/the-amd-and-nvidia-graphics-card-shortage-could-continue-until-february-2021",
    "cryptominers": "https://www.techradar.com/news/how-cryptomining-is-making-it-harder-to-find-the-graphics-cards-you-want",
    "Nvidia has attempted to tackle": "https://www.techradar.com/news/how-nvidia-is-tackling-cryptomining-so-more-gamers-can-get-rtx-cards",
    "CMP series of graphics cards": "https://www.sweclockers.com/artikel/31438",
    "Sweclockers": "https://www.sweclockers.com/nyhet/30595-nvidia-kan-flytta-ampere-tillverkning-till-tsmc-ar-2021",
    "its newly-announced EPYC Milan server chips": "https://www.techradar.com/news/amd-unleashes-record-breaking-3rd-generation-epyc-cpus",
    "the ongoing chip supply issues won’t be resolved until 2022": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right"
  }
}