{
  "source": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
  "title": "PUBG news: all the latest updates for PlayerUnknown’s Battlegrounds",
  "category": "gaming",
  "updated": "2021-10-27T14:43:30Z",
  "author": "adam-vjestica",
  "summary": "PUBG continues to wage war on Xbox, PS4, Stadia, PC and mobile",
  "article": [
    "PlayerUnknown’s Battlegrounds (or PUBG as it’s commonly known) spearheaded the popularity of battle royale games. It was a breakout hit that inspired countless competitors such as Fortnite and Apex Legends, but it still remains one of the most played games on Steam and Xbox Live.",
    "Unlike its rivals, PUBG is a more simulation-focused affair, with real-world weapons and physics to consider, such as bullet drop and variable weather conditions. If you’ve been turned off by Fortnite’s flamboyant art style or the relentlessly fast gameplay of Call of Duty: Warzone, PUBG is well worth a go – it’s also on Xbox Game Pass.",
    "Since its meteoric rise from a Steam Early Access title to achieving the highest concurrent player count on Steam back in 2018, PUBG has made its way to PS4, Xbox One, Stadia, Android and iOS. PUBG also receives regular updates, adding new content, features and – perhaps somewhat predictably – plenty of fixes for annoying bugs.",
    "But what is PUBG? Well, if you’ve ever watched the cult-hit film Battle Royale, you should understand the basic idea. 100 players drop onto a deserted island and quickly scavenge for loot. You’ll need to find armor, weapons and healing items, then do whatever it takes to survive until you’re the last man standing.",
    "To make things more interesting, you’ll have to move to a constantly shrinking zone that randomly appears on the map, via land, air or sea. If you get caught outside of the zone, you’ll gradually take damage, which increases dramatically as the game progresses. Pro tip: don’t get caught outside the zone.",
    "Should you manage to survive until the very end, you’ll see the coveted “winner winner chicken dinner” phrase appear on screen. And due to the overwhelming odds stacked against you during every match, you’ll probably want to screenshot it as they don’t come around very often – which makes them taste all the sweeter.",
    "Despite the game now being available on multiple platforms, PUBG continues to evolve with the addition of new maps, survivor passes and modes for players to enjoy. We’ll show you what’s new, why it matters, and what’s planned for the future of PlayerUnknown’s Battlegrounds.",
    "PUBG is getting another chunky update which adds new weapons, a way to survive getting knocked when in the water, and... chickens.",
    "Taego is getting two new weapons: the M79 grenade launcher and the Mortar. The M79 doesn't do any damage, but launches special smoke grenades. It takes up your pistol slot and looks like a great alternative to carrying heavy smoke grenades. The Mortar takes up one of your primary weapon slots and takes five seconds to deploy. You can rain down fire on enemies from behind cover.",
    "After update 14.2, knocked swimmers will no longer die instantly but enter a new animation that means you can swim to shore and be revived.",
    "Chickens have also been added to Taego, which can give your position away. They will flee if you make too much noise or get too close, so make sure they don't cluck things up for you.",
    "For all the changes, tweaks, and updates, check out the full patch notes below.",
    "Another new update is here and it brings a bunch of improvements as well as some fun seasonal makeovers.",
    "First up, there’s a new ‘carry’ feature. This allows players to pick up any downed survivors and carry them to safety.",
    "As long as the person you want to pick up isn’t obstructed or being revived, just throw them over your shoulder and get out of there! This comes with some restrictions, you can’t sprint, jump or use healing items while you’re carrying them to safety. Also, a little more gruesomely, you can also pick up downed enemies and use them as human shields.",
    "There have been a number of improvements to the Taego map, including additional cover in certain areas, changes made to some cliffs and general typography and new breakable pots with loot inside, which are dotted around the map. There are also new special zones marked on the map where you can spawn weapons from other battlegrounds.",
    "Pochinki has also had some updates too, including a new waterway, more places to take cover and some adjustments to the topography of the map.",
    "You’ll also find some vehicle improvements and, because spooky season is nearly upon us, added Halloween decor comes to Erangel along with a new Trick-or-Treat Progressive M416 weapon complete with jack-o-lantern design on the side.",
    "Another PUBG update has arrived and as we've come to expect, it adds a slew of new changes and additions to the game.",
    "Update 13.2 brings a new weapon to the battlefield, the P90 SMG which can only be found in a Care Package. It comes fully equipped with everything you need: a Cheek Pad, Handguard, Laser, and Silencer. The P90 SMG isn't just ideal for close range, though. You can switch between a Holographic Sight or use the Flipsight for added magnification. It uses custom 5.7mm ammo, so you only get 250 rounds to play with. Each magazine holds 50 bullets, so make them count.",
    "On Taego, a new vehicle has been added in the form of the Porter pickup truck. It's based on the real life Hyundai Motor Company's commercial truck, and is the first vehicle that includes a Trunk System. You can load it up with any supplies you find, and can carry up to four passengers.",
    "Want to flush out a group of enemies from a nearby building? The new Blue Zone Grenade creates a round blue zone that expands to a maximum of ten meters, and inflicts damage to anyone who is inside for five seconds. It then shrinks down and disappears, which takes another five seconds to occur.",
    "PUBG is also receiving a new mode called Casual Mode. It's a way for players to practice and have fun in less intense matches. The game will only allow 12 human players, with the rest of the competitors being made up of bots.",
    "Finally, new weather options have been added to Taego, Sunset and Overcast, as well as Blue Zone Rebalancing and improvements to the Comeback BR mode found exclusively in Taego.",
    "PUBG Update 13.1 brings lots of new additions to Taego – the brand new map introduced in the last update. For starters, the beginning of the game gets more intense with the transport plane players fly in on having to make an emergency landing – which means one dramatic parachute jump to kick things off.",
    "Other updates to Taego include more new care package drops, which contain ammunition, healing suppliers, throwables and lots more. These drop more frequently than regular care packages, but they’re still being dropped, too.",
    "The new Self AED mechanic has an increased spawn rate and can now be used in the secret room in Taego. There are other new additions, like emergency pickup, C4 and a Spike Trap. And the spawn rate of some throwables and other attachments has been lowered.",
    "Sanhok has also got a few notable additions in Update 13.1, including new cliffs and rocks, which provide players with some additional cover on the beach. The temple has been relocated, with some more cover along the path leading to it.",
    "As well as map and spawn changes, updates come to weapons this time around, too, so be sure to read the patch notes to see how your favorite weapon might have changed – for example, DMRs will be more difficult to use at long range.",
    "A new weapon also joins the game, the Buzzkill DMR, which can be found in its new contraband crate, and you can customize its skin with upgrades.",
    "Other updates in 13.1 include a new spraying system, which is basically tagging the battleground with spray paint, as well as UI improvements to the match results screen and kill message improvements.",
    "Take a look at the full list of changes in the patch notes below.",
    "PUBG Update 12.2 brings a brand new 8x8 map to the game called Taego. It promises to let players battle it out on diverse terrain and environments, and is available to Solo and Squads, including 1-man Squad Modes, and playable in TPP and FPP.",
    "Taego has some unique features compared to Erangel and Miramar. First of all, there's no Red Zone, so you won't have to worry about being bombarded during a match. Taego also features flocks of birds scattered across the map that react to player movement and gunfire, giving you an extra warning if an enemy squad is lurking nearby. Finally, Taego has two new gameplay mechanics: Comeback BR and Self AED, which give players a chance to get back into the fight.",
    "Comeback BR is a Taego exclusive second-chance mechanic that gives players who die during the first Blue Zone phase another chance to drop back into the fight. Players will face off in a separate location called the Comeback Arena, and if you emerge victorious you'll rejoin the game in phase 3.",
    "Self AED is another Taego exclusive mechanic that again lets people get back into the fight. The Self AED is a world-loot item that lets you revive yourself when you're DBNO, and can be used in Solo and Squad matches.",
    "Update 12.2 also brings two new weapons and a new vehicle into Taego: the K2 assault rifle, MK12 DMR and Pony Coupe.",
    "Check out the full list of changes in the patch notes below.",
    "PUBG Update 12.1 is now available, and it's arguably one of the most substantial updates the game has received in a while.",
    "First up is a rework of Miramar, the first map added to PUBG post-launch. Miramar's update features improved textures and lighting, as well as a general map clean-up that makes it easier to see which areas are traversable. Players have been waiting for Miramar to been remade for quite some time, so it's great to see one of the game's original maps get some love.",
    "A new vehicle, the speedy ATV, is also being added to the reworked Miramar, giving some much-needed speed to traversal on this colossal 8x8 map.",
    "The final addition to Miramar is the ruthlessly powerful Lynx AMR armor-piercing sniper rifle. This monstrous weapon can destroy weaker vehicles like bikes in a single shot, and you can be sure it'll also make short work of even tough Level 3 helmets and armor. The drawbacks? The Lynx AMR can only be found in care packages, and comes with just 5 shots with no way to reload.",
    "If you love customization then the Weapon Skin upgrade system might be one for you to check out. This new system will allow players to progressively upgrade the appearance of their weapons, and trick them out with visible stat tracking, animations, accessories and more.",
    "Other updates include improved bots that actually drop from the plane like regular players, a football/soccer minigame playable in the pre-game lobby, and a custom game variant that allows for vehicle races.",
    "You can check out the full patch notes below.",
    "Update 11.2 for PUBG is now live, and as we've come to expect, it brings a slew of improvements to PlayerUnknown's Battlegrounds.",
    "Survivor Passes are no longer tied to seasons, which should give the developer more flexibility in to what rewards it can include. Case in point, there's a six week event where you can earn various pyjama party cosmetics.",
    "Miramar's infamous bridge has received a tweak to prevent it feeling like you're driving down a highway to hell. The bridge has been widened, more cover has been added, and there's new catwalks to traverse across.",
    "PUBG's reputation system has also been improved, to stop you being reported into oblivion by enemy squads, and there have been a number of performance improvements to the game. Recoil when firing from the passenger seat in a vehicle has been increased, too.",
    "You can check out the full patch notes below.",
    "PUBG update 11.1 is now live on PC and consoles, but what exciting additions can players look forward to this time around?",
    "Well, for starters, Paramo is back with updated terrain and new games modes to try out. New mastery medals can also be earned so you can bling up the newly revamped PUBG ID, and a new Emergency Pickup might save your bacon on larger maps - deploy the pickup and you can grab a quick transport over to the safe zone.",
    "Other changes include changes to the killfeed, weapon balances, and various quality of life improvements. You can check out an overview of what's included in the video below.",
    "PUBG update 10.3 is now available PC and consoles, and it brings with it a number of notable improvements to the battle royale game.",
    "The key new additions include a new weapon sound selection system, some lighting improvements for Karakin and the ability to emote with your teammates.",
    "Weapon sound select system",
    "Players can now switch between the original and remastered version of certain weapon sounds. The weapons included are the M249, M416, Kar98k and SKS. You can select your preference from the Settings Menu under the Audio tab.",
    "Karakin map improvements",
    "Karakin has received some graphical upgrades, with improved lighting that helps give the compact map a more unique look and feel.",
    "Emote with your squad",
    "If you love dancing after winning a chicken dinner, you'll soon be able to do so in sync with your teammates. Emotes need to support the feature, and you can tell the ones that do as they will have two characters in the emote image.",
    "Any player within a 15 meter radius of your character or in the lobby on the main menu will also perform the emote, but you can choose to stop it any time if you've been unknowingly forced to dance.",
    "Of course, the patch also nixes a litany of bugs and adds some more minor quality of life improvements for players to enjoy. You can check out the full patch notes below.",
    "The latest PUBG update is now live, and it brings a number of new changes, tweaks and additions to the popular battle royale game.",
    "Update 10.2 adds a brand new car, the Coupe RB, which becomes the second fastest vehicle in the game. It'll spawn on Erangel, Miramar and Sanhok, and seats two people.",
    "Speaking of vehicles, you can now perform stunt emotes when using the dirt bike. Six default stunt emotes can be played, and can only be triggered in mid-air. It means the dirt bike no longer has a horn, though - but we're not complaining.",
    "A new Reputation System has also been introduced to improve in-game interactions between players and reduce toxic behavior. This should help you determine whether a player who joins your squad is serious about winning or just focused on griefing.",
    "Improvements have been made to the game's inventory system, which should make looting and equipping weapons easier than before, along with a number of quality of life changes that will make navigating the game's UI, store and notifications a lot smoother.",
    "Of course, it wouldn't be a PUBG update without countless new bug fixes, so check out the full patch notes below if you want to see everything that's changed.",
    "PUBG's next big update is now available on the test server, and it introduces a brand-new map called Haven and various gameplay improvements for players to enjoy.",
    "New urban map",
    "Haven is a tightly packed 1x1 urban map, which supports up to 32 players at a time in Duos or 1-Man Duos. The map is split into a number of districts, including the Residential Zone, Coal Yard and Docks. You'll need to adapt your tactics depending on which area you're in, as each present different opportunities to exploit.",
    "New foes to face",
    "Haven is also occupied by Pillar Guards and Commanders, which offer a new challenge in PUBG. This enemy faction protect certain areas of the map, and will attack players on sight. The guards will also send backup requests to Pillar Scout Helicopters that patrol the map, which can then in turn alert the Pillar Tactical, which is a heavily armed vehicle that cannot be destroyed.",
    "To help you get around Haven, emergency parachutes can be found, allowing you to quickly descend from high places without taking fall damage.",
    "Like Paramo, Haven is a seasonal map only, and will disappear once Season 10 ends, so don't miss out on the action before it's gone.",
    "Costume presets",
    "Although numerous bug fixes and tweaks are also included in Updated 10.1, one pleasing quality of life addition is the option to make costume presets. You can now dress for the map you're playing and access your favorite outfits quickly.",
    "Update 9.1 for PUBG brings with it a host of welcomed changes, including a brand new dynamic map called Paramo.",
    "Paramo is a 3x3 map that features 64 players. It takes place near an active volcano that can erupt at any time, so you'll need watch out for molten lava and other hazards. The dynamic world alters locations between matches, which should make every trip to Paramo a unique experience. Paramo will be provided as a Seasonal Match that's separate from the current matchmaking pool.",
    "Paramo also adds destroyable new item boxes that spawn in certain houses. These boxes contain loot such as ammo, throwables and healing items. Paramo includes a handful of exclusive Care Package items, too, like the full-body camo suits, ghillie suit and critical response kit, which lets you revive a downed squad member in just one second.",
    "Ranked Mode",
    "You can finally play Ranked Mode in solo, allowing you to battle other players one-on-one without facing bots. These matches have the same competitive rules as Ranked Squad matches, such as 64 players, no red zones, more loot and TPP only.",
    "Weapon balance update",
    "After receiving feedback from players, the Beryl M762 and SLR have been nerfed as they proved to be too strong compared to other weapons in the game.",
    "Survivor Pass: Highlands",
    "The new Survivor Pass contains 50 levels full of rewards for players to unlock. It'll run for two months, and is available for 990 G-Coin. You can collect a total amount of 1,000 G-Coin from the rewards, which means if you collect all the rewards you can use your haul for the next Survivor Pass.",
    "60fps mode for Xbox One X and PS4 Pro Update 9.1 will lift the 30fps frame cap on consoles, allowing Xbox One X and PS4 Pro to target 60fps. The resolution is dropped to 1080p, but the trade off should be well worth it.",
    "For everything else that's been included in the next PUBG update, check out the patch notes below.",
    "Since Season 6, developer PUBG Corporation has tried to align its PC and console updates more closely. Usually it takes about two weeks before consoles catch up with the PC version of the game, but that gap has closed recently, which is great news for console players who want to play the latest updates as soon as possible.",
    "Yes! With PUBG mobile, you can win chicken dinners directly from your phone. The game is more arcade-like and accessible than the PC and console versions of the game, but it shares all the maps and features that players have come to enjoy. You can expect things like auto pick-up, aim assist and touchscreen controls and other mobile optimizations.",
    "To play PUBG on your mobile, you’ll need to be using at least iOS 9 (that’s an iPhone 5S or newer) and Android owners must be using 5.1.1. Lollipop or later. You’ll also need 2GB or RAM to play the game, and 900 MB of free space.",
    "PUBG Lite is a stripped-down version of PUBG that’s designed for lower-spec hardware. PUBG is notoriously taxing on GPUs and CPUs, so PUBG Lite was created so that more people could get in on the battle royale craze. It’s a great alternative if you don’t own a powerful gaming PC or console to play on, plus it’s free-to-play.",
    "You sure can! The game is free to Stadia Pro members, and supports cross-play with Xbox One and PS4. It's the most up-to-date version of the game, too, which means it includes all the maps and the latest features. There's no download or patches, either, so you can start playing instantly."
  ],
  "headers": {
    "3": "PUBG overview",
    "7": "Update 14.2 is now on test servers",
    "12": "Update 14.1 is now live",
    "18": "Update 13.2 is now live",
    "24": "Update 13.1 is now live",
    "32": "Update 12.2 is now live",
    "38": "Update 12.1 is now live",
    "45": "Update 11.2 is now live",
    "50": "Update 11.1 is now live",
    "53": "Update 10.3 is now live",
    "63": "Update 10.2 is now live",
    "69": "Update 10.1 is now live",
    "78": "Update 9.1 is now live",
    "89": "What's the latest PUBG update for Xbox One and PS4?",
    "90": "Can I play PUBG on mobile?",
    "92": "What is PUBG Lite?",
    "93": "Can I play PUBG on Stadia?"
  },
  "links": {
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
    "battle royale games": "https://www.techradar.com/best/best-battle-royale-games",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Xbox Game Pass": "https://www.techradar.com/deals/cheapest-xbox-game-pass-deals-prices",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Android": "https://play.google.com/store/apps/details?id=com.tencent.ig&hl=en_GB",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8629632228494298000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fpubg-mobile-2nd-anniversary%2Fid1330123889"
  }
}