{
  "source": "https://www.techradar.com/news/does-an-instant-pot-use-a-lot-of-electricity",
  "title": "Does an Instant Pot use a lot of electricity?",
  "category": "appliances",
  "updated": "2021-12-03T11:49:48Z",
  "author": "helen-mccue",
  "summary": "Will using an Instant Pot save on electricity? We’ve done the calculations.",
  "article": [
    "Instant Pots are extremely popular kitchen appliances that allow you to cook some of your family favorites like stews, casseroles, and tender ribs. They offer a multitude of cooking methods and can speed up cooking times, too.",
    "So it's no surprise, you’ll find one of the best Instant Pots in more than a quarter of US homes, according to research by Kerry, a food science and nutrition firm. A versatile addition to your kitchen, an Instant Pot allows you to pressure cook, slow cook, steam and sauté. Some models can be used to make yogurt, sous vide, and even replace one of the best air fryers, so there are plenty of reasons why this simple cooking appliance can earn a valued spot on your kitchen countertop.",
    "One of the biggest draws of an Instant Pot is the pressure cook function, which speeds up cooking times and, in many cases, ensures you’ll have tender meat that falls off the bone in under 30 minutes. But you may be wondering, does this intense pressurized cooking use more, or less electricity than you’d use making meals in your oven? We put it to the test to find out.",
    "Fancy grabbing yourself an Instant Pot now rather than finding out how much electricity they use? We've rounded up the best prices on the web.",
    "First off, we must admit that this isn’t an easy calculation. Not all ovens are the same, some are more efficient than others and that’s before you take into account the cavity size and how well insulated the oven is. Even if we could hook up an electricity meter to a household oven, they vary so much that it wouldn’t be representative of all ovens.",
    "So we’ve made a few assumptions in order to figure out the best way to compare Instant Pots to ovens.The average size single built-in wall oven in the UK with an A energy rating uses around 0.8Kwh of electricity per hour when used at around 356 F / 180 C. Keep in mind that UK ovens are typically smaller than US ovens, they usually have a capacity of around 2.5 cubic feet / 70 liters, whereas US ovens in a standard 30 inch range have an average capacity of 5 cubic feet/ 140 liters which means they will use more energy.",
    "So, to figure out how much energy an Instant Pot uses, we hooked up the Instant Pot Pro Crisp - the brand’s top-of-the-range model - to an energy meter and got cooking. First, we prepared two racks of baby back ribs in the Instant Pot on high for 25 minutes. The pressure cooker took seven minutes to preheat so the total cook time was actually 32 minutes. It used 0.26Kwh of electricity and gave us beautifully succulent and tender ribs falling off the bone.",
    "The same ribs cooked in the oven on low take around three hours. As the oven was at 230 F / 110 C we halved the 0.8Kwh figure for electricity consumption. This gives us a total of 1.2Kwh estimated electricity use if cooked in the oven for three hours. By our calculations, cooking the ribs in the oven on low uses around four and a half times the amount of electricity than pressure cooking them in the Instant Pot.",
    "We admit that after pressure cooking you might want to grill/ broil the ribs for a short time smothered in BBQ sauce to create the perfect result – but adding that would just complicate the calculations and the ribs are perfectly delicious without this step, you can coat them in sauce and eat immediately.",
    "Alongside pressure cooking, slow cooking is another of the Instant Pot’s multitude of cooking methods, but is using an Instant Pot for this method of cooking more energy-efficient too? We whipped up a beef chili in both appliances to find out.",
    "The chili was bubbling away on the high setting in the Instant Pot for six hours and used just 0.31kwh of electricity. However, cooking the chili in the oven at a low temperature for six hours would use a total of 2.4Kwh, as we once again halved the average usage of 0.8kwh to reflect the oven was used at just 230 F / 110 C.",
    "Based on our crude calculations, an oven would use a staggering eight times more electricity than an Instant Pot to slow cook a chili for six hours. We suspected the Instant Pot would win in this competition, but this difference is mind-blowing. And if you have a bigger or less efficient oven, this difference will grow significantly, meaning the Instant Pot could potentially save you even more money.",
    "We’ve been quite conservative in our estimates of how much electricity an oven would use, it’s highly likely that most ovens would use far more electricity than the figures stated above. But despite us giving best case scenario figures for the amount of power used by an oven, the Instant Pot is still the clear winner, by miles.",
    "Just how much money you’re likely to save on your electricity bill will depend on your tariff, but there’s no denying that if you switched some of your oven-cooked meals to an Instant Pot, you would save money - it’s a very efficient little countertop cooking appliance.",
    "But watch out for the automatic keep warm function, if this kicks in after cooking and you leave it for several hours, the energy consumption will obviously increase. Having said that, it would have to be in keep warm mode for a very long time, to get anywhere near the amount of energy used by an oven just to cook the meal in the first place."
  ],
  "headers": {
    "4": "Under pressure",
    "9": "What about slow cooking?"
  },
  "links": {
    "best Instant Pots": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "Kerry": "https://www.kerry.com/insights/kerrydigest/2019/easier-faster-better-appealing-to-the-instant-pot-consumer",
    "best air fryers": "https://www.techradar.com/news/best-air-fryer"
  }
}