{
  "source": "https://www.techradar.com/news/ubisoft-avatar-game-is-the-first-real-surprise-of-e3-2021",
  "title": "Avatar: Frontiers of Pandora is the first real surprise of E3 2021",
  "category": "gaming",
  "updated": "2021-06-12T20:50:08Z",
  "author": "samuel-tolbert",
  "summary": "Massive Entertainment's next massive game is Avatar",
  "article": [
    "Avatar: Frontiers of Pandora was easily the biggest surprise announcement at Ubisoft Forward during E3 2021, along with Mario + Rabbids Sparks of Hope, that is.",
    "Developed by Massive Entertainment, the team behind The Division franchise, Avatar: Frontiers of Pandora is being developed using Ubisoft's impressive proprietary Snowdrop graphics engine, so it should be quite the looker. James Cameron's Avatar film, which was released in 2009, is still one of the most successful films of all time, and Avatar 2 is currently in the works. It makes sense than for Ubisoft to develop a game set in the world of Pandora.",
    "Check out the game's first cinematic trailer below.",
    "While details are still scarce, the game is currently slated to be released sometime in 2022 and is being developed for the Xbox Series X, Xbox Series S, PS5, PC and Amazon Luna.",
    "The game will presumably launch around the same time as Avatar 2, when interest in James Cameron's series will be at its peak once again. The sequel to the first film is due to release on December 16, 2022.",
    "This isn't the first Avatar video game we've seen from Ubisoft. James Cameron's Avatar: The Game released in 2009 but didn't fare too well with critics, amassing an overall score of 61 on Metacritic. Let's hope this one turns out to be a lot better."
  ],
  "headers": {},
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Mario + Rabbids Sparks of Hope": "https://www.techradar.com/news/ubisoft-and-nintendo-are-teaming-up-for-another-mario-rabbids-game",
    "Avatar 2": "https://www.techradar.com/news/avatar-2-release-date",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Amazon Luna": "https://www.techradar.com/news/amazon-luna-first-look-is-amazons-game-streaming-service-worth-trying",
    "Metacritic": "https://www.metacritic.com/game/pc/james-camerons-avatar-the-game"
  }
}