{
  "source": "https://www.techradar.com/news/the-ps5-is-making-me-hate-pc-gaming",
  "title": "The PS5 is making me hate PC Gaming",
  "category": "gaming",
  "updated": "2021-02-01T17:06:53Z",
  "author": "jess-weatherbed",
  "summary": "Opinion: I just want to enjoy new games again",
  "article": [
    "We had some pretty volatile ups and downs last year, but the latest gaming hardware releases were peppered throughout the rollercoaster of late 2020. There was something for everyone, from the long-awaited next-gen Sony PS5 and Microsoft Xbox Series X consoles being announced and subsequently released, to the reveal of AMD and Nvidia's latest graphics card lines that promised to power even the most demanding gaming software. I emerged from all this gaming news with high hopes and expectations. I've owned both a PS4 and a gaming PC for many years now, but my computers have always won the title of being my favorite gaming hardware, often leaving my PS4 gathering dust for months on end. Knowing I could only afford one, I had a decision to make: do I buy a PS5 now, or save up for a shiny GeForce RTX 3090 and CPU upgrade? It seemed like an obvious choice at the time. I'm now kicking myself.",
    "When the next generation of ray tracing graphics cards was announced, we only had some demo footage and some pretty baseless graphs to show what performance to expect. Since these GPUs have hit the market we've seen games such as Cyberpunk 2077, Watchdogs: Legion, and The Medium released, giving us the opportunity to test this groundbreaking computing hardware for ourselves. And each time, be it down to overly demanding software or lack of optimization for PC, I'm left disappointed. Before the games were even released, we were seeing some fairly alarming system requirements to play the latest AAA titles. It was reported this week by DSOG that the Medium couldn't run at a consistent 60fps on a PC equipped with an Intel i9-9900K and an RTX 3080, even on standard 1080p quality and ray tracing switched off. And the optimization issues faced by The Medium are hardly unique. Sure, I could go back and play some great older games, but brand new releases that were supposed to show of the raw power of the latest hardware have fallen a tad flat for me. They've hardly knocked it out of the park on consoles either, but the Sony-exclusive titles don't suffer from the issues faced by multi-platform games. I found myself over the last few weeks looking over the unsatisfactory performance and reviews, questioning what the point is of having the most powerful graphics cards and CPUs on the market if the games struggle to run. This hardware should last gamers several years without requiring an upgrade, and yet they already feel outdated when trying to play games on release. Have the game developers stretched too far? Or are our expectations too high? It's honestly hard to say at this point.",
    "PC gaming sometimes feels like a constant uphill battle to evolve and accommodate the very latest in computing technology, combining a love for tech tinkering with a gaming hobby for many. You need to put consistent effort, money, or both into being a PC gamer because a large reason people might choose a computer over a console is the ability to experience games in the highest achievable quality. PC gamers joke about having a superiority complex for this very reason. And yet, PS5 owners can currently experience 4K quality, better game optimization (in some titles), and haptic feedback in the DualSense controller for significantly less than a comparable gaming computer would cost to buy or build. I can sense my own inflated ego for building and playing PCs withering away when I try to work out how much effort and cash I'm putting into my gaming hobby VS how much fun I'm actually getting out of it with these new games. One of the biggest reasons I (and many others) will also be buying a PS5 is because of the Sony Exclusive titles. These games consistently rank in 'best of' lists, and despite also playing games that are restricted to PC, such as World of Warcraft or Dota 2, I prefer the Playstation-only titles. Sure, they sometimes eventually make their way to Steam or Epic, but that's years down the line and after some pretty heavy optimization. When the PS5 showcase announced Horizon: Forbidden West, Demon's Souls and God of War: Ragnorak, I excitedly noted them as titles to look forward to playing when I could eventually buy the console myself. Now that the first few months of the Nvidia Ampere and AMD 'Big Navi' hardware have passed, I'm left feeling disappointed and envious of my console playing peers.",
    "Gaming on a console is effortless - you don't need to worry about overclocking or changing out your cooling system or CPU. Your controller comes in the box, so there's no need to research the best mice options or key switches to improve your performance. The entire system is provided for you, for an arguably affordable price, and only needs to be updated every 5-7 years. Comparatively, PC gaming feels almost exhausting and financially depressing. This is in no way saying that I'll be switching out my gaming PC in favor of a PS5, and I'm sure this time next year I'll be back to popping jokes at the expense of my console playing friends, but I'm firmly stepping down from my high horse for the time being. Until games are better optimized for PC or developers manage their hardware expectations, every game I'm looking forward to in 2021 is currently a PS5-exclusive. Now I just need to somehow get my hands on one."
  ],
  "headers": {},
  "links": {
    "Sony PS5": "https://www.techradar.com/reviews/ps5",
    "Microsoft Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Watchdogs: Legion": "https://www.techradar.com/reviews/watch-dogs-legion",
    "The Medium": "https://www.techradar.com/reviews/the-medium",
    "DSOG": "https://www.dsogaming.com/pc-performance-analyses/the-medium-cannot-run-with-constant-60fps-on-the-rtx3080-even-at-1080p-high-rt-off-settings/",
    "Horizon: Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Demon's Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Now I just need to somehow get my hands on one.": "https://www.techradar.com/news/where-to-buy-ps5"
  }
}