{
  "source": "https://www.techradar.com/news/the-best-phones-of-2022-will-get-a-5g-speed-boost-and-better-battery-life",
  "title": "The best phones of 2022 will get a 5G speed boost and better battery life",
  "category": "phones",
  "updated": "2021-02-10T11:35:06Z",
  "author": "james-rogerson",
  "summary": "There's a new modem in town",
  "article": [
    "Qualcomm has announced a new 5G modem dubbed the Snapdragon X65, and it promises some big improvements to performance and battery life – although it'll be a while before you see these come to your new phone.",
    "The Snapdragon X65 is the successor to the Snapdragon X60 modem, which comes with the Snapdragon 888 chipset found in the likes of the Samsung Galaxy S21 and Xiaomi Mi 11, and it supports 5G download speeds of up to 10Gbps, up from 7.5Gbps with the Snapdragon X60.",
    "While that’s a big boost on paper, if you’ve used 5G you’ll know that current speeds are typically much, much lower than either of those maximums, so it might not make much difference for a while, although it could be a useful upgrade if you hang on to your phone for long enough, as eventually speeds like that may become realistic.",
    "What should be more immediately useful is that the new modem sounds less power-hungry than its predecessor. 5G can be a big battery drain, but the Snapdragon X65 supports the upcoming 3GPP Release 16 specification, which is designed to improve a number of aspects of 5G, including power consumption.",
    "On top of that, in phones the Snapdragon X65 modem will be paired with a new QTM545 mmWave antenna module, which itself is designed to improve power efficiency.",
    "It also includes the world’s first AI antenna tuning technology, which Qualcomm says enables “major improvements” to cellular performance and power efficiency.",
    "One example of how it achieves this is by detecting how you grip your device with 30% more accuracy, which allows for faster data speeds, better coverage, and longer battery life – holding your phone in a particular way can interfere with the data signal, so presumably this tech would optimize the signal to compensate.",
    "The Snapdragon X65 also features upgradable architecture, meaning that new features can be added via software updates, so devices will be able stay up to date with the latest 5G tech for longer.",
    "So this sounds like a promising new modem, although with the Snapdragon X60 only just hitting devices we wouldn’t expect to see it in phones for a while.",
    "Qualcomm claims it will start appearing in devices in 2021, but based on past form we probably won’t see it in smartphones until the next flagship Snapdragon chipset launches, and that isn’t expected until late 2021, with few if any phones likely to get it before early 2022.",
    "Via The Verge"
  ],
  "headers": {
    "3": "A battery boost too"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "3GPP Release 16 specification": "https://www.3gpp.org/release-16",
    "The Verge": "https://www.theverge.com/2021/2/9/22274127/qualcomm-x65-5g-modem-10gbps-speeds-ai-tuning-software-updates"
  }
}