{
  "source": "https://www.techradar.com/news/lenovos-new-thinkpad-has-one-major-linux-upgrade",
  "title": "Lenovo's new ThinkPad has one major Linux upgrade",
  "category": "computing",
  "updated": "2021-06-08T10:01:38Z",
  "author": "mayank-sharma",
  "summary": "Lenovo ThinkPad X1 Carbon gets the Tiger Lake treatment",
  "article": [
    "Lenovo has updated its popular business-class ThinkPad X1 Carbon laptop series, which now comes pre-installed with either Fedora Linux or Ubuntu, besides Windows 10.",
    "Now in its 9th generation, the ThinkPad X1 Carbon is one of Lenovo’s longest-running line of business laptops. The latest series sports Intel’s 11th Gen Core Series “Tiger Lake” processors and a host of other improvements thanks to the line being Intel Evo certified.",
    "The latest series retains the X1 Carbon’s characteristic hybrid carbon fiber weave and thanks to the magnesium alloy body weighs in at 2.49 pounds (1.13 Kg). New in this generation is the unified one-bar hinge design, a wider touchpad, and an improved Dolby Atmos enabled speaker system.",
    "The laptop also sports a new 14-inch 16:10 format UHD+ (3840X2400) display.",
    "Running through the specs, the Thinkpad X1 Carbon has all the features you’d expect from a business laptop.",
    "The Tiger Lake CPUs can take upto 32GB of LPDDR4x-4266 DRAM and upto 1TB PCIe SSD.",
    "Since the Thinkpad X1 Carbon is powered by the latest Intel CPUs, there’s also support for Thunderbolt 4, and it’s got a pair of them. According to Lenovo, a single Thunderbolt 4 port allows you to connect two 4K monitors or a single 8K monitor.",
    "There’s also a couple of USB Type-A ports, both of which are USB 3.2 Gen 1, as well as a full-sized HDMI 2.0 port, a combo headphone/mic 3.5mm jack and an optional Nano-SIM slot.",
    "The base model of the X1 Carbon with the Intel Core i5-1135G7 CPU, 8GB RAM, 256 GB SSD storage, and Full HD display costs about $1400, and the top of the line with an i7 processor, 4K display, 32GB RAM, and 1TB storage, will set you back by $2286.",
    "Via 9to5Linux"
  ],
  "headers": {
    "4": "Thinkpad X1 Carbon upgrade"
  },
  "links": {
    "Lenovo": "https://www.techradar.com/news/the-best-lenovo-laptops-2018",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "4K monitors": "https://www.techradar.com/news/best-4k-monitors",
    "8K monitor": "https://www.techradar.com/best/best-5k-and-8k-monitors",
    "9to5Linux": "https://9to5linux.com/lenovos-thinkpad-x1-carbon-gen-9-laptop-now-comes-with-fedora-linux-or-ubuntu"
  }
}