{
  "source": "https://www.techradar.com/news/samsung-galaxy-m12-launched-and-its-a-cheap-phone-with-a-mammoth-battery",
  "title": "Samsung Galaxy M12 launched and it's a cheap phone with a mammoth battery",
  "category": "phones",
  "updated": "2021-02-05T13:54:30Z",
  "author": "james-rogerson",
  "summary": "6,000mAh of power",
  "article": [
    "If you want a phone that can last then Samsung might have just the handset for you, as it’s unveiled the Samsung Galaxy M12, a phone with a 6,000mAh battery.",
    "What can you do with a 6,000mAh battery? According to Samsung you can browse the internet for up to 24 hours, or watch up to 23 hours of video, or listen to music for up to 110 hours (which is almost five days). So at the very least, this should be one of those rare phones that doesn’t need charging daily.",
    "Elsewhere the Samsung Galaxy M12 is less impressive but still sounds reasonable. It has a 6.5-inch 720 x 1600 LCD screen, up to 6GB of RAM, up to 128GB of storage, and an unnamed 2GHz octa-core chipset.",
    "There’s also a quad-lens camera, with a 48MP f/2.0 main snapper, a 5MP f/2.2 ultra-wide one, a 2MP f/2.4 macro one, and a 2MP f/2.4 depth one. The front-facing camera meanwhile is 8MP, and other features include 15W charging, a microSD card slot, a 3.5mm headphone port, and a side-mounted fingerprint scanner.",
    "So all in all the Samsung Galaxy M12 sounds like a low-end to lower mid-range phone, and it certainly looks like one, with a large bezel below the screen, a notch at the top, and a back that’s described as ‘metallic’ but looks like it’s probably plastic.",
    "Still, that means it should be affordable, though so far it’s only been launched in Vietnam. It’s not clear yet where else the Samsung Galaxy M12 will land, but we wouldn’t be surprised if it’s more widely available soon. At the very least it looks likely to come to India.",
    "Via GSMArena"
  ],
  "headers": {
    "3": "Ordinary elsewhere"
  },
  "links": {
    "According to Samsung": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3422613768161971700&xs=1&url=https%3A%2F%2Fwww.samsung.com%2Fvn%2Fsmartphones%2Fgalaxy-m%2Fgalaxy-m12-blue-64gb-sm-m127flbgxxv%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-galaxy-m12-launched-and-its-a-cheap-phone-with-a-mammoth-battery",
    "likely to come to India": "https://www.techradar.com/news/samsung-galaxy-m12-clears-bis-certification-indian-launch-imminent",
    "GSMArena": "https://www.gsmarena.com/samsung_unveils_galaxy_m12_with_6000_mah_battery_48_mp_main_camera-news-47600.php"
  }
}