{
  "source": "https://www.techradar.com/news/scientists-discover-500-light-year-wide-hole-in-the-milky-way-torn-open-by-a-supernova",
  "title": "Scientists discover 500 light-year-wide hole in the Milky Way torn open by a supernova",
  "category": "appliances",
  "updated": "2021-09-24T23:32:06Z",
  "author": "john-loeffler",
  "summary": "The blast tore a colossal, star-forming molecular cloud in two",
  "article": [
    "Scientists have discovered a gigantic hole blown out of the Milky Way, and believe a powerful supernova 10 million years ago might be to blame.",
    "The gap or \"cavity\" as astronomers are describing it, was described this week in a paper published this week in The Astrophysical Journal Letters as a spherical void cut out of the Perseus and Taurus molecular clouds and spans nearly 500 light-years across.",
    "\"We have two theories—either one supernova went off at the core of this bubble and pushed gas outward forming what we now call the 'Perseus-Taurus Supershell,'\" said lead author Shmuel Bialy, a postdoctoral researcher at the Institute for Theory and Computation at Harvard's Center for Astrophysics (CfA), \"or a series of supernovae occurring over millions of years created it over time.\"",
    "\"Hundreds of stars are forming or exist already at the surface of this giant bubble,\" Bialy added.",
    "Incredibly, what we've long thought of as two independent structures – the Perseus and the Taurus molecular clouds, located in the region of the sky marked by the constellations Perseus and Taurus – might actually have been one and the same as recently as 10 million years ago, but was literally torn in two by the cosmic blast.",
    "The void was discovered after astronomers created a 3D map of that region of space using data gathered from Gaia, a European Space Agency-launched space telescope, in order to study the two molecular clouds for the first time in three-dimensional space. Until now, molecular clouds could only be seen in two dimensions, limiting what we could know about their position, size, and other features.",
    "\"We've been able to see these clouds for decades, but we never knew their true shape, depth or thickness. We also were unsure how far away the clouds were,\" said Catherine Zucker, a postdoctoral researcher at the CfA who led a separate study in The Astrophysical Journal that described the 3D mapping process. \"Now we know where they lie with only 1 percent uncertainty, allowing us to discern this void between them.",
    "Molecular clouds like the ones that the research teams were studying when they discovered this massive wound in the Milky Way are responsible for the formation of all the stars in the sky.",
    "As our colleagues over at Space.com explain, these unfathomably big clouds are full of hydrogen, helium, and a bunch of other elements that form the stars, planets, moons, and other objects of a solar system, which form inside them as these elements get drawn together by gravity.",
    "Blowing a 500 light-year wide hole in one of them is an impressive feat, which demonstrates the equally unfathomable power of a supernova, that final energetic gasp of a dying star. These blasts also seed their material back into the universe as new molecular clouds to begin again the cycle of creation and destruction in the universe.",
    "Whether it was a single gargantuan blast or many smaller ones over time, it reminds us that as powerful as all of our bombs put together might be, they are nothing compared to the raw power of the natural world."
  ],
  "headers": {
    "7": "Analysis: the universe is a vast and violent place"
  },
  "links": {
    "The Astrophysical Journal Letters": "https://doi.org/10.3847/2041-8213/ac1f95",
    "The Astrophysical Journal": "https://doi.org/10.3847/1538-4357/ac1f96",
    "Space.com": "https://www.space.com/mysterious-milky-way-cavity-discovered"
  }
}