{
  "source": "https://www.techradar.com/news/browser-wars-microsoft-edge-is-beginning-to-steal-users-from-google-chrome",
  "title": "Browser wars: Microsoft Edge is beginning to steal users from Google Chrome",
  "category": "computing",
  "updated": "2021-12-07T14:10:30Z",
  "author": "joel-khalili",
  "summary": "Will Microsoft Edge soon mount a genuine challenge to Chrome?",
  "article": [
    "New data suggests Microsoft Edge is slowly beginning to lure users away from Google Chrome, which has had a stranglehold on the web browser market for years now.",
    "According to the latest figures from Statcounter, the Microsoft Edge market share exceeded 4% for the first time ever in November, cementing the browser’s place as the world’s third most popular service (behind only Safari and Chrome).",
    "The only major browser to lose market share last month, meanwhile, was Google Chrome, which is now responsible for 64.04% of web activity, down from a peak of 65.27% in the summer.",
    "Of course, the gap between Microsoft Edge and Google Chrome remains massive, and the latter won’t fall from the top spot any time soon.",
    "However, Microsoft will nonetheless be encouraged by the performance of its new flagship browser, with which it hopes to regain a foothold in the browser market after the infamous decline of Internet Explorer (which was once used by 95% of netizens).",
    "Since the new Chromium-based Edge went live last year, its growth has been fueled in large part by the retirement of Edge Legacy and Internet Explorer, whose users Microsoft carefully funnelled towards its new service. To maintain this rate of growth, however, the company is tasked with figuring out how to lure people away from the likes of Firefox, Safari and Chrome.",
    "In recent months, Microsoft has been aggressive in its attempts to push Edge, both leveraging the large Windows 10 and 11 install base to boost its user numbers and making it more difficult to switch default browsers (although it has since retreated a little on its position).",
    "The company has also delivered a consistent stream of new features for the browser, ranging from new Microsoft 365 integrations to tools designed to help users save money in the run-up to Christmas.",
    "After overtaking Mozilla’s browser in the rankings for the first time in July, Edge now appears to be successfully padding out its user base with converts from Chrome. Admittedly, progress is slow, but the signs are positive for Microsoft."
  ],
  "headers": {
    "3": "Microsoft Edge vs. Google Chrome"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "web browser": "https://www.techradar.com/best/browser",
    "latest figures from Statcounter": "https://gs.statcounter.com/",
    "web": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "leveraging the large Windows 10 and 11 install base": "https://www.techradar.com/news/microsoft-is-weaponizing-windows-11-in-a-bid-to-conquer-the-browser-market",
    "more difficult to switch default browsers": "https://www.techradar.com/news/changing-your-default-browser-in-windows-11-will-be-a-nightmare",
    "retreated a little": "https://www.techradar.com/news/microsoft-to-stop-forcing-edge-on-windows-11-users",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "save money": "https://www.techradar.com/news/microsoft-edge-could-be-the-unexpected-hero-of-black-friday-heres-why",
    "overtaking Mozilla’s browser": "https://www.techradar.com/news/microsoft-edge-just-left-a-serious-rival-in-its-dust"
  }
}