{
  "source": "https://www.techradar.com/news/apple-ipad-air-4-deals-reach-lowest-price-ever-in-amazons-presidents-day-sales",
  "title": "Apple iPad Air 4 deals reach lowest price ever in Amazon's Presidents' Day Sales",
  "category": "tablets",
  "updated": "2021-02-13T16:30:24Z",
  "author": "alex-whitelock",
  "summary": "A rare chance to snag a bargain iPad deal",
  "article": [
    "We've spotted one of the best iPad deals this year so far over at the Amazon Presidents' Day sale - the new Apple iPad 4 for just $539.99 (was $599).",
    "At a full $59 less than retail price, this latest iPad deal from Amazon is a whole $10 to $20 better than the usual sale we see on the Air 4. What's more, unlike in previous sales, all colors are available at a discount and for immediate delivery - that's honestly quite rare for iPad deals, especially at Amazon. Subsequently, whether you want to go for a more subdued traditional hue like the Space Gray, or one of the more eye-catching new colors like Green or Sky Blue - the choice is yours.",
    "The iPad Air 4 is the latest tablet from Apple and one that sits rather comfortably between the more basic standard 10.2 iPad (also on sale), and the more premium iPad Pro range. While it forgoes some of the bells and whistles of the Pro series (like a LiDAR scanner) it's still packing the latest Apple A14 chip, giving it plenty of grunt under the hood for all those intensive applications. With a new squared-off aesthetic and near-all screen display, we can't lie - it also simply looks fantastic.",
    "If you'd like to see what else is discounted this weekend, head on over to our main Presidents' Day sale page. If you're visiting us from outside the US, you can also see the best prices on iPad deals near you just down below.",
    "If you'd like to do some further reading and see the other models in the range, check out this week's best iPad deals. Also worth checking it is this week's best Samsung tablet deals, which are a great Android-based alternative."
  ],
  "headers": {
    "4": "Apple iPad deals in the Amazon Presidents' Day sale"
  },
  "links": {
    "for just $539.99 (was $599)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-iPad-Air-10-9-inch-Wi-Fi-64GB%2Fdp%2FB08J66ZMY7%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2472360844437705000-20",
    "also on sale": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-iPad-10-2-inch-Wi-Fi-32GB%2Fdp%2FB08J65DST5%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5020657882567903000-20",
    "Presidents' Day sale": "https://www.techradar.com/news/presidents-day-sales-deals-2021",
    "best iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "Samsung tablet deals": "https://www.techradar.com/news/mobile-computing/tablets/samsung-galaxy-tab-deals-1295910"
  }
}