{
  "source": "https://www.techradar.com/news/black-widow-post-credits-scene-explained",
  "title": "Black Widow's post-credits scene explained, and where it'll lead the MCU next",
  "category": "entertainment",
  "updated": "2021-07-12T11:19:28Z",
  "author": "samuel-roberts",
  "summary": "Spoilers for Black Widow follow",
  "article": [
    "Spoilers for Black Widow's post-credits sequence follow.",
    "After a wait of more than a year and what feels like 50 trailers, Black Widow has finally released in theaters and on Disney Plus Premier Access. It's...fine. It really is what they promised the movie would be: a prequel, set after Captain America: Civil War, that sheds more light on Natasha Romanoff (Scarlett Johansson) and her past in the Black Widow program.",
    "We meet the closest thing she had to a family before the Avengers, including Yelena Belova, a fellow victim of the Red Room indoctrination process.",
    "The movie ends with Natasha about to join Steve Rogers in freeing the other Avengers incarcerated at the end of Civil War, before the events of Infinity War begin. But a post-credits sequence – one that makes you wait through the entire credits over multiple minutes – is set long after that.",
    "Below, we're going to explain what happens in Black Widow's post-credits scene, and how it looks set to tie in to an upcoming MCU project.",
    "The scene is set after the events of Avengers: Endgame – so, around six years after Black Widow ends. We know this because Natasha Romanoff is dead at this point, after she sacrificed herself to get Clint Barton the Soul Stone to defeat Thanos. That event is vital to the point of this post-credits scene.",
    "Yelena Belova pulls up to a small graveyard in the middle of the American Midwest with her dog, Fanny (a reference to a line from earlier in the film). She cleans the decorations around Natasha Romanoff's grave, and kneels down beside it to mourn.",
    "Moments later, she's joined by someone obnoxiously blowing their nose: Valentina Allegra De Fontaine (played by Julia Louis-Dreyfus). If you're reading this and you're up-to-date on your Marvel canon, you know who this is. She was introduced in The Falcon and the Winter Soldier, and recruited Wyatt Russell's off-brand, discharged 'Captain America' John Walker for...something, equipping him with a black uniform and the new alias of US Agent.",
    "\"You're not supposed to be bothering me on my holiday time, Valentina,\" Yelena tells her unwelcome visitor, suggesting she's employed by Valentina in some capacity. She then asks for a raise.",
    "Valentina then sheds light on why she's interrupting Yelena's time off. \"I've got your next target, thought I'd hand-deliver it.\"",
    "\"Maybe you'd like a shot at the man responsible for your sister's death?\" she asks, producing a tablet device. What's displayed on there? It's none other than a picture of Clint Barton (Jeremy Renner) – who, of course, was present for Natasha's death in Avengers: Endgame, but not the actual cause of it.",
    "From this, we can deduce that Yelena has spent the intervening years since the events of Black Widow getting her hands dirty. Valentina is better known as Madame Hydra in the comics – it's unclear what they're going for with the MCU version, but there's definitely something shady in her intentions.",
    "Speculation is rife that she's building some kind of counterpart to the Avengers, and that's why she recruited Walker. The Thunderbolts or Dark Avengers from Marvel's comics seem to be the most likely possibility – perhaps they'll be an enemy in a future Avengers movie. That remains to be seen.",
    "Notably, this Easter Egg is the one thing in the movie that was changed by the pandemic-induced reshuffling of Marvel's schedule – De Fontaine was meant to appear in Black Widow first and then appear in The Falcon and the Winter Soldier, according to Kevin Feige. Hence why she doesn't get properly introduced in the scene. If you're not caught up on all the MCU TV shows, you won't know who this is. That's a sign of how important the small screen is now to Marvel.",
    "What is clear, though, is that Black Widow's post-credits scene is meant to tie in to the upcoming Hawkeye TV series – more on that below.",
    "It would appear so. If Yelena is sent on a revenge mission to get Clint Barton, then it's likely to play out in his only future confirmed appearance is in this year's Hawkeye TV show on Disney Plus. Besides, a report on the well-connected THR in December 2020 said that Florence Pugh was involved with the show – that same story correctly called Vera Farmiga's casting in Hawkeye, so it seems probable that Pugh's casting is the real deal, too.",
    "So, is Yelena secretly the villain of Hawkeye? We're unsure – we can't see them coming to blows in a major way without resolving their differences. It's more likely that she's being brought into the story to connect her back to the Avengers roster of characters, putting her in the frame for future MCU stories.",
    "Clint, after all, had a close relationship with Natasha. The Hawkeye show was bound to touch upon that in some fashion, as well as his brutal rampage depicted in Avengers: Endgame. Bringing Yelena into the story would help round this off, given her own connection to Natasha.",
    "This, then, is where you'll probably see Florence Pugh in the MCU next. Hawkeye is expected to release in late 2021.",
    "While the Hawkeye series is primarily about Clint training up a new Hawkeye – Kate Bishop, played by Hailee Steinfeld – leaks have suggested it's likely to cover a lot more than that. Read our guide to Hawkeye on Disney Plus for more."
  ],
  "headers": {
    "5": "When is the Black Widow post-credits scene set?",
    "6": "Black Widow post-credits scene explained",
    "15": "Does Black Widow's post-credits scene set up Hawkeye on Disney Plus?"
  },
  "links": {
    "Black Widow": "https://www.techradar.com/news/how-to-watch-black-widow-online-on-disney-plus-today-from-anywhere",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "Valentina Allegra De Fontaine": "https://www.techradar.com/news/falcon-and-the-winter-soldier-episode-5-that-big-villain-cameo-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "John Walker": "https://www.techradar.com/news/new-captain-america-in-the-falcon-and-the-winter-soldier-explained",
    "Kevin Feige": "https://www.youtube.com/watch?v=UwlegYq7WXU&ab_channel=OnTheRedCarpet",
    "THR": "https://www.hollywoodreporter.com/news/general-news/marvels-hawkeye-enlists-vera-farmiga-4099065/",
    "Hawkeye on Disney Plus": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know"
  }
}