{
  "source": "https://www.techradar.com/news/dyson-omni-glide-vs-dyson-v15-detect-which-new-cordless-vacuum-is-best-for-you",
  "title": "Dyson Omni-glide vs Dyson V15 Detect: Which new cordless vacuum is best for you?",
  "category": "appliances",
  "updated": "2021-05-31T05:00:50Z",
  "author": "carrie-ann-skinner",
  "summary": "Is the Dyson V15 Detect better than the Dyson Omni-glide?",
  "article": [
    "Just days after Dyson’s most innovative cordless vacuum to-date, the Dyson V15 Detect (that comes with lasers, no less), went on sale the floorcare stalwart has dropped another new cordless vacuum.",
    "The Dyson Omni-glide is a new type of cordless vacuum cleaner that’s designed for hard floors and is more compact and lighter than any of Dyson’s cordless cleaners to date.",
    "The biggest upgrade is the cleaner head that has not on,e but two, brush bars meaning cleaning takes less time.",
    "The cleaning head also sits on four 360-degree castors so it can move in any direction, and the vacuum cleaner can even lay flat, making it good for hard to reach corners and ensuring areas under furniture are dust-free.",
    "But aside from their differing cleaning heads, you’re probably wondering exactly what the differences are and whether they’re both among the best vacuum cleaners on the market right now - and we've tested both in depth to find out.",
    "Read on to find out just how these cordless vacuums compare – or, if you know which Dyson cleaner device you want, check out the best prices right now for both products below:",
    "At $399.99 / £349.99 / AU$599.99, the Dyson Omni-glide is Dyson’s most affordable vacuum cleaner to date, although it’s still relatively expensive compared to many other cordless vacuums, and is available to buy now in the US and Australia, and will go on sale in the UK in July.",
    "In contrast, the Dyson V15 Detect, which is known as the V15 Detect Absolute in the UK and the V15 Detect Total Clean in Australia, is priced at $699.99 / £599.99 / AU$1,399.",
    "There are two variants of the V15 available. In the US the second model is called the Dyson Outsize Absolute+ and is priced at $899.99 while in the UK it's known as the Dyson Outsize Absolute and costs £699.99.",
    "It has a larger 0.5-gallon / 1.9-litre dust bin, although it can’t count and sort the dust particles, and the US model comes with two batteries.",
    "In Australia, the Dyson V15 Detect Absolute Extra is also available and comes with a free-standing dock, for a cost of AU$1,449.",
    "The Dyson Omni-glide and Dyson V15 Detect certainly look different from each other.",
    "While they both have a main section that contains the motor, cyclones - which generate centrifugal force to keep dust and dirt in the canister - and a dust canister, the Dyson Omni-glide is much smaller and more compact than the V15 Detect.",
    "The Dyson Omni-glide has a vertical handle, which houses the swappable battery, rather than the traditional trigger-style handle found on the V15 Detect, which is also where the swappable battery is fitted.",
    "The Omni-glide’s power button, which can be found on the front of the handle, ensures the vacuum cleaner runs continually until it’s turned off, while the trigger on the V15 Detect means it’s only powered when this is held down.",
    "The dust canister on the Omni-glide holds 0.05 gallons / 0.02 liters, compared to the 0.2 gallon / 0.75 liter dust canister on V15 Detect. Both cordless vacuums can be used in stick mode, with a wand and cleaning head attached to the canister, or converted into handheld mode and used with any of the tools they come bundled with.",
    "Because of the long handle, we found the Omni-glide cumbersome to use in handheld mode. On that note, the Omi-glide comes with one cleaning head, and three tools, while the V15 Detect has two cleaning heads, and six tools bundled with it.",
    "The runtimes of each vacuum vary wildly too. During testing, the Omni-glide lasted 20 minutes on the lowest power setting, although this dropped to just shy of 18 minutes on maximum power.",
    "Meanwhile, the V15 Detect lasted a respectable 59 minutes between charges on the lowest-power mode. We were also disappointed that the Omni-glide has no real way of gauging the battery level, whereas the V15 has an (awesome) LCD screen that shows the remaining runtime, as well as any blockages and a breakdown of the dust it’s collected thanks to the piezo sensor (more on that below).",
    "When it comes to suction, the Omni-glide has two power levels while the V15 Detect has three, meaning the latter is more adept at sucking around the house.",
    "More suction power means the vacuum is better at pulling up ground-in dirt from carpets, making cleaning your floors a much quicker task - but when you consider the Omni-glide is designed solely for hard floors while the V15 Detect can be used on carpet as well as hard floors, this reduced suction isn’t really an issue.",
    "On test, we found both vacuums whipped away fine dust and cereals from hard floors in just one slow sweep, so the reduced suction on the Omni-glide certainly hasn’t hampered its cleaning ability.",
    "The Omni-glide and the V15 Detect both have cleaning heads that offer very different functions.",
    "The Omni-glide’s cleaning head has two as two brush bars covered in soft nylon to capture large particles without damaging hard floors, while anti-static carbon fiber filaments collect fine dust at the same time.",
    "The head sits on four 360 degree castors that, along with an articulating neck, allow the vacuum cleaner to be steered in any direction. It can also lay completely flat, making it great for cleaning under low-lying furniture and in tight spaces.",
    "On test we were impressed at just how smoothly the cordless vacuum glided on hard floors and how easy it was to steer around a circular trash can in the kitchen, and underneath a sideboard in the living room.",
    "The V15 Detect’s hard-floor cleaning head can’t be steered in any direction and only has one brush bar, but it does feature a laser, which shines a beam of green light in front of the head, to highlight hidden dust that can’t be seen by the human eye.",
    "The V15 Detect is also fitted with an acoustic piezo sensor that can count and identify the size of the dust particles it collects, displaying the information on the LCD screen - not something the Omni-glide offers but a handy feature if you want evidence just how thorough your clean has been.",
    "Finally, the V15 Detect also ships with a High Torque cleaning head that can be used on carpet as well as hard floors.",
    "When this head, which has 56 polycarbonate teeth that shred hair into small sections so they won’t get tangled around the brush bar, is used on Auto mode, the vacuum cleaner will adjust the suction power to suit the floor type it’s being used on automatically.",
    "When it comes to choosing between the Dyson Omni-glide vs the Dyson V15 Detect, the type of flooring you have in your home will affect which cordless vacuum cleaner is best for you.",
    "If you have only hard floors then the Dyson Omni-glide will be a great buy. If you have carpet, the Omni-glide won’t be your main vacuum cleaner, but it will work as an additional vacuum for quick cleans.",
    "The V15 Detect is a real powerhouse when it comes to carpet vacuuming, and many will enjoy the 'gamified' nature of the seeing the cleanliness of your floor on the LCD screen.",
    "Also, you know... lasers.",
    "The Omni-glide is more compact than the V15 Detect, making it good for homes that are short on space, and can easily get under low-lying furniture or in tight spaces, so if this sounds like your home, it’ll be a winner.",
    "It’s also more affordable too, so is a good choice for those on a budget - saving heavily if you don't have carpet.",
    "However, for those that want to use the vacuum in handheld mode a lot - an area where we found the Omni-glide uncomfortable to use - or want proof that your vacuuming sessions really are thorough, then the V15 Detect steps up to the plate here and is a worthwhile investment."
  ],
  "headers": {
    "5": "Best Dyson V15 Detect and Dyson Omni-glide deals",
    "6": "Price",
    "11": "Design",
    "17": "Battery life and power",
    "22": "Features",
    "30": "Verdict"
  },
  "links": {
    "Dyson V15 Detect": "https://www.techradar.com/reviews/dyson-v15-detect-absolute",
    "Dyson Omni-glide": "https://www.techradar.com/reviews/dyson-omni-glide-review",
    "cordless vacuum cleaner": "https://www.techradar.com/news/best-cordless-vacuum-cleaner",
    "best vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}