{
  "source": "https://www.techradar.com/news/the-best-way-to-get-an-rtx-3070-or-rtx-3080-on-black-friday-is-in-a-prebuilt-pc",
  "title": "The best way to get an RTX 3070 or RTX 3080 on Black Friday is in a prebuilt PC",
  "category": "computing",
  "updated": "2021-11-23T21:43:43Z",
  "author": "jackie-thomas",
  "summary": "Opinion: finding an RTX 3080 sucks right now, just buy a PC",
  "article": [
    "In past years on Black Friday, you could easily go to Newegg, and buy a bunch of PC components at a discount to make up for buying a graphics card at retail price. GPUs have never seen huge discounts, beyond maybe 20 bucks here and there. But now that an RTX 3080 is selling for at least $2,095 on StockX right now when it is supposed to retail for $699 – a lot has obviously changed.",
    "Last year, when the RTX 3080 came out, Black Friday came just a couple months after the GPU. The graphics card has been sold out since it went on sale. At the time, I thought it was something that would be alleviated after a couple months, like it did with the RTX 2080 Ti before and the GTX 1080 Ti before that. I was wrong.",
    "That means that Black Friday gaming PC deals are the best way to get an RTX 3080 or RTX 3070 graphics card right now, even if you're the type that swore up and down they'd never stoop to buying a prebuilt. And, listen, I'm the same way. I don't think I've ever owned a pre-built PC for my own uses. But if I still had an older PC right now, the temptation would be there.",
    "I'm lucky in that I get a chance to play with most of the big-name PC builds here in the US. I usually get to mess with the latest stuff from huge brands like Alienware, along with more boutique builders like Maingear and Falcon Northwest. The nicest computers from these companies have always come with a huge price increase, but it's so much different now.",
    "When the market rate for a standalone graphics card is at $2,000, and you have a Maingear Vybe system with an RTX 3070 for $1,974 in the US or a RTX 3080 system for just $599 more, why wouldn't you just jump on that. Plus, that $2,599 3080 system? That's with an AMD Ryzen 9 5900X, 16GB of RAM and a 512GB SSD. That processor alone basically makes up for the price difference. Plus, you get an incredible system built by some of most skilled builders in the business.",
    "The same goes for Falcon Northwest, even though its PCs are a bit more expensive. You can get an incredible system from that company with an RTX 3080 and a Core i7 processor, backed up with 32GB of RAM for $3,999. And, yeah that's way more expensive, but that's a legitimate luxury item – more than you could claim for an ABS system you buy at Newegg.",
    "And if you want to go with a popular name, you can also get an Alienware rig with a Ryzen 9 chip and an Nvidia GeForce RTX 3080 for $2,769. Though, that's more expensive than the Maingear system, and won't be nearly as reliable. So, take that as you will.",
    "These days pretty much every PC retailer on the planet sells PCs that are just thrown together as a glorified bundle deal. PCs from ABS on Newegg spring to mind. They're built in low-end cases and aren't shown the same amount of care that a boutique builder will put into a system.",
    "But they're the best way to get your hands on a graphics card right now, especially if you can cannibalize a few upgrades out of it. One of the big Black Friday deals Newegg is advertising right now is an ABS Gladiator rig with an RTX 3080, a two-year-old processor and 16GB of RAM for $2,599. That's after a $200 discount. It's not a great deal.",
    "However, it is an RTX 3080, along with plenty of other components you can probably use to upgrade your system if you need it. This is very much a system I would only recommend for someone that's comfortable opening it up when it comes in and making sure everything stayed connected while shipping, which is basically the same kind of person that's probably looking for an upgrade, rather than a full pre-built system.",
    "The way I look at it, not only is this a way to buy an RTX 3080, but it's also a box of spare parts that you can use if anything you're running in your rig goes south – hey, stuff happens.",
    "Did your CPU cooler fail? You have an off-the-shelf ThermalTake cooler you can rip out of this ABS system. Did one of your fans die? Well, you have 5 fans in this PC that you can use to replace it. Do you need to upgrade to a CPU and motherboard that will support Windows 11? The Intel Core i7-10700KF here will work!",
    "It's definitely not an ideal situation, but nothing in the PC gaming world is ideal right now. This time of year, I'm used to writing a whole bunch about how you should be building a PC using newly-discounted parts. And while there are some sweet SSD deals out there, and even some monitor deals, it's still not a good time to build a PC.",
    "And as someone who's been building her own PCs for nearly 20 years and has pushed everyone to do the same. This Black Friday is breaking my heart."
  ],
  "headers": {
    "3": "There are some great gaming PCs out there",
    "7": "Even the bad PCs have value",
    "14": "More Black Friday gaming PC deals"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3080 is selling for at least $2,095 on StockX right now": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-4448067314812446700&url=https%3A%2F%2Fstockx.com%2Fnvidia-geforce-rtx-3080-graphics-card-founders-edition&article_name=The%20best%20way%20to%20get%20an%20RTX%203070%20or%20RTX%203080%20on%20Black%20Friday%20is%20in%20a%20prebuilt%20PC&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-best-way-to-get-an-rtx-3070-or-rtx-3080-on-black-friday-is-in-a-prebuilt-pc",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 2080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-ti-review",
    "GTX 1080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1080-ti",
    "Black Friday gaming PC deals": "https://www.techradar.com/black-friday/black-friday-computer-deals-2020-top-deals-we-expect-to-see-and-early-offers-live-now",
    "Maingear Vybe system with an RTX 3070 for $1,974 in the US": "https://www.techradar.com/deals/get-an-rtx-gaming-pc-in-style-with-these-maingear-black-friday-deals",
    "RTX 3080 system for just $599 more": "https://maingear.com/product/vybe-rtx-3080/",
    "RTX 3080 and a Core i7 processor, backed up with 32GB of RAM for $3,999": "https://builder.falcon-nw.com/configuration/summary",
    "Ryzen 9 chip and an Nvidia GeForce RTX 3080 for $2,769": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1221531677291474700/https://www.dell.com/en-us/shop/desktop-computers/alienware-aurora-ryzen-edition-r10-gaming-desktop/spd/alienware-aurora-r10-desktop/wdr10_cec_30s"
  }
}