{
  "source": "https://www.techradar.com/news/heres-how-burnout-can-put-the-security-of-your-organization-at-risk",
  "title": "Here's how burnout can put the security of your organization at risk",
  "category": "computing",
  "updated": "2021-12-08T01:30:01Z",
  "author": "anthony-spadafora",
  "summary": "Burned-out employees are less likely to follow security guidelines",
  "article": [
    "Perhaps the allure of working from home has worn off or employees are just finding themselves in a slump but across industries, workers are now reporting extraordinarily high burnout which puts them and the security of their organizations at risk.",
    "To better understand this burnout phenomenon, 1Password has released its first State of Access benchmark report titled “The Burnout Breach”. The company behind the popular password manager surveyed 2,500 adults to learn more about how workforce burnout has opened businesses to attacks.",
    "1Password found that trends such as remote and hybrid work, the “Great Resignation” and even significantly worse behavior by cybersecurity professionals are the driving forces behind this new threat to both business success and longevity.",
    "CEO at 1Password, Jeff Shiner provided further insight in a press release on how pandemic-fueled burnout is now a security risk to both small and large businesses, saying:",
    "\"Pandemic-fueled burnout—and resultant workplace apathy and distraction—has emerged as the next significant security risk. It's particularly surprising to find that burned-out security leaders, charged with protecting businesses, are doing a far worse job of following security guidelines—and putting companies at risk. It's now a business imperative for companies to engage the humans at the heart of security operations with tools, training and ongoing support to create a culture of security and care that helps us all stay safe at work.\"",
    "According to 1Password's research, 84 percent of security professionals and 80 percent of other workers are feeling burned out which has led to some serious backsliding when it comes to security protocols.",
    "For instance, burned out employees ignore the rules with a third less less likely to follow their organization's security guidelines, burnout is fueling a shadow IT renaissance with 60 percent of burned-out employees creating, downloading or using software and apps at work without permission from their IT departments and security professionals are twice as likely as other workers to “completely check out” and “do the bare minimum at work”.",
    "At the same time though, burnout is fueling the Great Resignation with more employees ready to resign at a moment's notice. Of those surveyed, nearly two-thirds (64%) said they were actively looking for a new job, on the verge of quitting or open to the idea of switching jobs. However, security professionals are almost 50 percent more likely than other workers to be actively looking for a new job which can hurt the security posture of a business.",
    "With regular employees checked out and security professionals doing the bare minimum, organizations are more likely to have their systems infected with malware and fall victim to either phishing or cyberattacks. For this reason, organizations should look for signs of burnout and try to be accommodating to employees or risk losing their workers at a time when finding new talent has become increasingly difficult.",
    "Looking to improve your security posture? Check out the best password managers, best identity theft protection and best malware removal software"
  ],
  "headers": {
    "5": "Bad burnout behaviors"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "burnout": "https://www.techradar.com/news/remote-workers-are-sick-and-tired-of-their-inboxes",
    "1Password": "https://www.techradar.com/reviews/1password",
    "The Burnout Breach": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1031718031860953700/https://1password.com/resources/2021-state-of-secure-access-report/",
    "password manager": "https://www.techradar.com/best/password-manager",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Great Resignation": "https://www.techradar.com/news/redditors-abuse-receipt-printer-bugs-to-spread-their-anti-work-credo",
    "press release": "https://www.prnewswire.com/news-releases/report-burnout-puts-business-privacy-and-security-at-risk-301438999.html",
    "shadow IT": "https://www.techradar.com/features/shadow-it-friend-or-foe",
    "looking for a new job": "https://www.techradar.com/best/us-job-sites",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "finding new talent": "https://www.techradar.com/news/ten-ways-to-find-employees-for-your-business",
    "best password managers": "https://www.techradar.com/best/password-manager",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "best malware removal software": "https://www.techradar.com/best/best-malware-removal"
  }
}