{
  "source": "https://www.techradar.com/news/no-hp-didnt-just-leak-the-amd-ryzen-7000-series",
  "title": "No, HP didn’t just leak the AMD Ryzen 7000 series",
  "category": "computing",
  "updated": "2021-10-11T09:55:41Z",
  "author": "darren-allan",
  "summary": "Comedy of errors in all-in-one PC listing from HP?",
  "article": [
    "AMD could have Ryzen 7000 processors waiting in the wings, according to the latest from the rumor mill – but we’re not so sure, and this leak, which comes from HP (once again), is likely to be a listing error of some kind.",
    "The full story here is that as @momomo_us highlighted on Twitter (via Wccftech), HP has put up a product listing for future all-in-one PCs which will use either Intel’s incoming Alder Lake chips, or the “AMD Ryzen 7000” series.",
    "Obviously that’s pretty odd, because as likely won’t have escaped your attention, AMD’s current processors are Ryzen 5000 models, so logically the next in line is the Ryzen 6000 range – and here the company appears to be looking to skip straight to Ryzen 7000.",
    "Why would this happen? That’s unclear, but the argument, or at least suggestion, is that AMD might just have APUs from the Ryzen 7000 family ready to roll (the 24-inch and 27-inch all-in-ones or AIOs are ‘coming soon’ according to the listing).",
    "As these are AIOs, they would be running an APU (CPU plus graphics) – presumably ‘Rembrandt’ based on Zen 3+ in theory – rather than actual Zen 4 desktop chips (‘Vermeer’). Zen 4 is still a long way out, of course, as next-gen desktop CPUs won’t be here until the end of 2022. (Before that, we’ll get a refresh of current Ryzen processors making use of 3D V-Cache tech early next year).",
    "Not only does it seem plain unlikely that AMD would skip Ryzen 6000, there are other reasons why this particular leak seems seriously iffy, and more likely to be a listing mistake than anything else.",
    "HP’s other product listings for desktop computers and AIOs refer to Ryzen 5 processors, and Ryzen 9, so it seems like the possibility here is that the listing should read ‘Ryzen 7’, and someone has accidentally labeled it as ‘Ryzen 7000’.",
    "That possibility is backed up by the fact that there is another mistake in the listing, as the SSD is called an ‘SSE’, and if that level of carelessness is anything to go by, it’s easy to imagine another error happening. Even though this sort of thing really shouldn’t get through on a big company’s official website.",
    "We can’t totally rule out the possibility that there is a grain of truth here, though. HP does have a history of leaking hardware before it’s released, and it’s not unthinkable for AMD to skip to Ryzen 7000 somehow – that just really doesn’t seem likely, and we’re not buying it."
  ],
  "headers": {
    "5": "Analysis: The curious case of the ‘SSE’"
  },
  "links": {
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Wccftech": "https://wccftech.com/amd-ryzen-7000-cpu-powered-hp-all-in-one-desktop-pcs-confirmed-launching-in-2022/",
    "Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "based on Zen 3+ in theory": "https://www.techradar.com/news/leaked-roadmap-of-amds-laptop-cpus-could-give-intel-nightmares",
    "won’t be here until the end of 2022": "https://www.techradar.com/news/amds-still-on-target-to-release-zen-4-cpus-and-rdna-3-gpus-in-2022",
    "3D V-Cache tech": "https://www.techradar.com/news/amd-3d-chiplet-technology-meet-the-future-of-processors",
    "product listings": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1387238595902188800&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fdesktops-computers.html",
    "SSD": "https://www.techradar.com/best/best-m2-ssd"
  }
}