{
  "source": "https://www.techradar.com/news/skate-4-is-being-developed-by-a-new-ea-studio-heres-what-you-need-to-know",
  "title": "Skate 4 is being developed by a new EA studio – here's what you need to know",
  "category": "gaming",
  "updated": "2021-01-27T17:51:34Z",
  "author": "vic-hood",
  "summary": "'Some would say things have come full circle'",
  "article": [
    "For a long time, it seemed like a new Skate game was nothing but a pipe dream, but EA pleased fans when it announced Skate 4 at EA Play 2020 - and now, the company has revealed who exactly is developing this long-awaited sequel.",
    "EA has announced that its new studio, Full Circle, is working on Skate 4. Based in Vancouver, Full Circle is headed up by former head of Xbox Live, Daniel McCulloch, and is \"coming together to create rad experiences and redefine the way gamers create content that can be shared with the Skate community.\"",
    "\"The fans wished Skate back into existence and we want them involved in the process from development to game launch and beyond. We want them to feel like they are a part of Full Circle,” said Daniel McCulloch, GM of Full Circle. “We’re all about having fun and making great games that people want to play with their friends. And, we’re looking for more developers to help us build compelling worlds for players to explore.\"",
    "But this isn't necessarily a brand new team. Full Circle sees the return of the Skate series' creative leadership, Deran Chung and Cuz Parry, who worked on the previous three games in the franchise.",
    "“We’re so stoked to be back working on Skate,” the pair said. “Some would say things have come full circle.”",
    "The first three games in the Skate series were initially developed by EA Blackbox, with the last game in the franchise, Skate 3, released in 2010. However, fans have been eagerly awaiting a new addition to the series, with many taking to social media to be EA for a new entry. In 2016, there was even a campaign by skateboard park, The Berrics, called \"Make EA Skate again\".",
    "Finally, in 2020, EA officially confirmed Skate 4, with Parry telling fans in the announcement video that they had \"commented this into existence\".",
    "With members of the original team officially on board, we're hoping that the wait – and campaign – was worth it."
  ],
  "headers": {
    "5": "An unlikely return"
  },
  "links": {}
}