{
  "source": "https://www.techradar.com/news/hoping-for-netflix-to-support-apples-spatial-audio-dont-hold-your-breath",
  "title": "Hoping for Netflix to support Apple's Spatial Audio? Don't hold your breath",
  "category": "audio-visual",
  "updated": "2021-02-24T16:22:35Z",
  "author": "olivia-tambini",
  "summary": "Apple's Spatial Audio isn't coming to Netflix any time soon",
  "article": [
    "Put away your AirPods Pro: Netflix isn't adding support for Spatial Audio, as the streaming giant quashes previous rumors of a serious audio upgrade.",
    "In a statement to MacRumors, a Netflix spokesperson said that \"it's not currently testing spatial audio support, and has no plans to make public at this point in time\".",
    "Instead, the spokesperson said Netflix has been testing \"multi-channel support for built-in speakers\", so there's at least some good news for home cinema enthusiasts.",
    "The statement puts rumors of Spatial Audio support coming to Netflix to rest (for now, anyway), after a report from iPhoneSoft said that the feature had been in testing since December 2020.",
    "Quoting an anonymous Netflix developer, the report said that a small selection of titles would support the immersive audio format to begin with, and that it wasn't expected to roll out for a while.",
    "For the uninitiated, Apple's Spatial Audio is the company’s answer to Dolby Atmos for Headphones, designed for the AirPods Pro true wireless earbuds and AirPods Max over-ear headphones.",
    "It takes 5.1, 7.1, and Dolby Atmos content and applies directional audio filters, placing sound in a 3D sphere, which makes it feel as though the sound from your films and TV shows are coming at you from all angles.",
    "What’s unique to Spatial Audio though, is that it uses the built-in accelerometers and gyroscopes inside Apple’s earbuds and headphones to track the position of your head, as well as the position of your iPhone or iPad.",
    "That means that, when you watch films on your iPhone or iPad, the sound will always be placed correctly based on the action on the screen – so, if you turn your head or shift your device, it will still sound as though the sound is coming from the screen.",
    "While Netflix already support Dolby Atmos – which is far more accessible than Apple's iOS device-limited Spatial Audio tech – it would have made sense for the streaming platform to expand its surround sound repertoire, especially now that the Apple AirPods Max have given viewers another way to enjoy the technology.",
    "Plus, Spatial Audio is already supported by rival platforms like Disney Plus, HBO Max, and (of course) Apple TV Plus.",
    "We doubt that Netflix will want to be left behind by its competitors when it comes to surround sound support, but it's clear that Spatial Audio won't be coming to the streaming service any time soon. Just don't rule it out for the future."
  ],
  "headers": {
    "3": "Sad news for Spatial Audio"
  },
  "links": {
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "previous rumors of a serious audio upgrade": "https://www.techradar.com/news/netflix-is-rumored-to-be-adding-spatial-audio-for-the-airpods-pro-and-airpods-max",
    "MacRumors": "https://www.macrumors.com/2021/02/22/netflix-not-testing-spatial-audio/",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "iPhoneSoft": "https://iphonesoft.fr/2021/01/14/netflix-teste-actuellement-fonction-spatial-audio",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Apple’s earbuds": "https://www.techradar.com/news/airpods-beats-and-the-best-apple-headphones-you-can-buy-in-2020",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "streaming platform": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "HBO Max": "https://www.techradar.com/reviews/hbo-max",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus"
  }
}