{
  "source": "https://www.techradar.com/news/sony-a1-vs-canon-eos-r5-which-mirrorless-camera-wins-the-battle-of-the-hybrids",
  "title": "Sony A1 vs Canon EOS R5: which mirrorless camera wins the battle of the hybrids?",
  "category": "cameras",
  "updated": "2021-01-30T14:36:26Z",
  "author": "andrew-williams",
  "summary": "We compare the two hybrid powerhouses",
  "article": [
    "You may have felt a sharp intake of breath when you saw the price of the Canon EOS R5, which arrived in 2020 for $3,900 / £4,200 / AU$6899. But Sony has just upped the game with its flagship Sony A1, a mirrorless powerhouse that costs a cool $6,500 / £6,500 / AU$10,499.",
    "That's a pretty big difference, and there are rumors that a Canon EOS R1 could yet arrive to take on Sony's trailblazer. But which of today's high-end hybrids wins the great Sony A1 vs Canon EOS R5 battle?",
    "The A1, also known as the Alpha 1, aims to be the ultimate mirrorless camera for action and sport photographers, or just about anyone who wants the best experience available in a full-frame camera at a manageable size.",
    "But is the Sony A1 really that much better than the Canon EOS R5? On paper, it beats the Canon in a number of respects, but not all. Let’s break it down.",
    "It’s business as usual in the Sony and Canon design labs. The Sony A1 and Canon EOS R5 have fairly similar dimensions, but the A1’s main body box is trimmer and more angular than the R5’s.",
    "Canon lets its contours bloom out, for a softer appearance and shape. Thickness is the one significant practical difference here. The Sony Alpha 1 is around 17mm slimmer than the Canon.",
    "But when you compare these cameras from above, much of the difference is down to the jutting of the EVF eyepiece and the shape of the handgrip.",
    "The Canon EOS R5’s grip extends out a little further, and perhaps has better contouring for your fingers.",
    "Both cameras are weather-sealed, and there’s only a gram between them once you add the battery and memory card. The Canon EOS R5 weighs 738g, the Sony Alpha A1 737g.",
    "Controls layouts are different but, ultimately, comparable. The Canon EOS R5 has an additional monochrome display up top, which is handy when shooting with the camera well below eye level.",
    "Added consideration for awkward shooting positions continues in the Canon EOS R5’s rear screen.",
    "Its display folds out on a hinge, where the Sony Alpha A1 has a less flexible flip-out display. Sony’s style will be quicker to use in some situations (particularly photography, rather than video), but the Canon’s is a good deal more flexible.",
    "The Canon EOS R5’s display specs are also superior. This is a 3.15-inch, 2.1-million dot LCD. That equates to a 960 x 720 pixel resolution.",
    "The Sony A1's display is a little smaller, with a 3-inch diagonal. And its resolution is lower at 1.44-million dots, or 800 x 600 pixels.",
    "The most important differences here are the Canon’s greater screen size, and that more versatile hinge.",
    "The situation flips around in the EVF, the electronic viewfinder. Sony’s EVF is significantly better. The Alpha A1 has a 0.64-inch OLED panel with 0.9x magnification, zero image blackout while shooting, and an excellent maximum 240Hz refresh rate.",
    "The A1's EVF resolution is 9.44-million dots, equivalent to 2048 × 1536 pixels. This is a fantastic, large, very high resolution viewfinder.",
    "The Canon EOS R5’s EVF belongs to the league below. It uses a smaller 0.5-inch OLED panel with 0.76x magnification and lower 5.76 million dot resolution. That is 1600 x 1200 pixels.",
    "It’s not quite the difference between a Full HD TV and a 4K one, but there is a significant gap here.",
    "Back when full-frame cameras had to rely on separate AF modules, the number of focus zones was a reasonable indication of AF performance. Nowadays? Not so much.",
    "The Canon EOS R5 has 5,940 focus points when you use “single point” AF, or 1,053 in area focus.",
    "By comparison, the Sony A1 has a more traditional-sounding 759 focus zones. Either way you look at it, Canon’s numbers are higher.",
    "Frame coverage is perhaps more important. The Canon covers 100% of the frame, the Sony 'just' 93%. Of course, this isn’t going to affect too many people as we’re talking about the extreme edges of the frame here.",
    "We can’t fully compare these cameras’ autofocus systems from specs alone, in part because Canon made such impressive progress with the Canon EOS R5. Its eye-tracking AF is excellent – you can read more about that in our EOS R5 Animal Eye AF review – and it even uses a clever system to all but remove viewfinder blackout when shooting in burst mode.",
    "Sony has traditionally been the best choice for full-frame compact system camera autofocus, and the EOS R5 can go toe-to-toe with the excellent Sony Alpha A7R IV. But we're expecting the top-end Alpha 1 to make some noticeable improvements, thanks its brand-news sensor and improved Animal Eye AF, which now includes bird recognition.",
    "The A1 also claims to have improved generalized AF subject-tracking. We’ll have to test this in person, as the Sony A1 uses the same Bionz XR processor as the A7S III.",
    "The Sony A1 and Canon EOS R5 can both shoot 8K video at 30 frames per second. However, there are some differences in how they operate.",
    "Canon’s camera can shoot 8K footage with 4:2:2 10-bit color depth. Sony’s 8K is at 10-bit, 4:2:0. This means the chroma color information is shared between adjacent pixels to a greater extent, and should be a consideration if your work involves a lot of careful color grading of footage.",
    "The Sony Alpha 1 does offer 4:2:2 10-bit shooting, but at 4K/60p and 4K/120p rather than 8K/30p.",
    "This is not a straight win for the Canon in practice, though. Its 8K capture is limited to 20 minutes, according to Canon, where Sony says the A1 can shoot for a minimum of 30 minutes. As ever, this is a heat-related issue. Actual results will depend on the ambient temperature, and this is a 'soft' cap, not a hard one.",
    "Shooting time in 4K/120p is limited to 7min 29sec in the Canon EOS R5, and we haven’t yet heard any word of the limit on the Sony in this mode.",
    "Want to shoot raw video? There are some differences here, too. The Canon EOS R5 can capture up to 12-bit RAW internally, but its HDMI output is limited to 4K/60p. Sony has no internal raw capture, but the A1's HDMI is capable of 16-bit, 4332 x 2448 output. Again: not 8K, but at a bit higher depth than the Canon.",
    "Neither camera has to use a cropped view when shooting at 8K. Both of them downsample their image from their native 8.2K and 8.6K sensor resolution respectively.",
    "Let’s talk practicalities. The Sony Alpha 1’s 8K mode has a bitrate of around 400Mbps. Canon’s bitrate is approximately 2600Mbps when recording 8K raw, or around 470Mbps when using the most effective IPB compression profile.",
    "Your instinct may be that higher bit-rates are better. But when we’re talking about storing to expensive CFexpress cards, the appeal of 8K raw may dwindle for some, as it eats up around 325MB of storage a second.",
    "Action photographers, take note. The Canon EOS R5 can shoot at up to 20fps using its electronic shutter, or 12fps using its mechanical one.",
    "It’s fast but the Sony A1 is faster, at least in its electronic shutter mode. Its Bionz XR processor allow for 30fps capture of 50MP files. There are also 20fps, 15fps and 5fps modes if you don’t need that max speed.",
    "Using the mechanical shutter, the A1 is slightly slower than the Canon, with a top speed of 10fps. Still, 30fps is quite incredible for a 50MP camera, and Sony expects most A1 users to rely almost exclusively on the electronic shutter.",
    "The real-world usefulness of the Sony A1’s burst is superior too. Its buffer allows you to shoot 400 JPEGs or 238 raws before pausing, compared to 350 JPEGs or 180 raws from the Canon.",
    "When you consider these numbers, the Sony A1 starts to look like the ultimate mid-size sports shooter. But we'll have to do some real-world testing to find out for sure.",
    "Eight-stop image stabilization is perhaps the most eye-opening claim of the Canon EOS R5. This is three stops higher than we are used to seeing from the best mirrorless cameras. By comparison, Sony claims the Alpha 1 offers 5.5 stops of stabilization.",
    "What is this magic? The EOS R5 body has a relatively conventional five stops of IBIS, slightly lower than the Sony’s 5.5 stops. But it can be used in combination with the stabilization of certain Canon lenses to reach that ultra-high level of motion buffering.",
    "Canon’s system is designed to bring together both kinds of stabilization, that of the body and lens. You only tend to see IS in safari-style zoom Sony lenses, where the optical stabilization is used to help with x/y axis shake, rather than pitch and yaw.",
    "The result? The Canon EOS R5 may let you slow down that shutter further without seeing handshake blur in images. That said, Canon’s eight-stop claim seems to be quite specific, relating to the use of a 24-105mm lens at 105mm.",
    "This suggests the difference between the two will not be so obvious when using a 'walk around' street photography lens.",
    "It's time to tackle some of the slightly dry, but important, practicalities of these two cameras. The Sony A1 uses the NP-FZ100 battery, a 16.4Wh unit. The Canon EOS R5's LP-E6NH battery has slightly lower capacity of 15.3Wh.",
    "Sure enough, the published Sony figures are a little better than Canon’s. The Alpha 1 is rated for 530 shots using the LCD screen, or 430 shots with the viewfinder. This drops to 490 shots (LCD) and 320 (viewfinder) in the EOS R5.",
    "Canon does not publish any video stamina figures, but Sony does. It claims the A1 offers 145 minutes of continuous recording with the viewfinder, or 150 minutes using the LCD display. There’s no word on the video mode used for these tests, but it's not going to be 8K.",
    "Both cameras have dual memory card slots, but the types they accept are different.",
    "The Sony A1 has two combi-slots that can take either CFexpress Type A or cheaper SD cards. Canon’s EOS R5 has one slot for the larger, faster CFexpress Type B and a second for regular old SD cards. That second slot won’t accept a CFexpress Type A card.",
    "The theoretical peak write speed may be higher in the Canon, but the Sony also has a pro-friendly Gigabit Ethernet port for ultra-fast wireless transfer (when the camera itself is plugged into an access point, anyway). You can also setup FTP (File Transfer Protocol) transfers, which will be handy if you need to send images while shooting out in the field.",
    "You can even use a Sony Xperia Pro phone as an 4K external monitor for the Alpha 1 (above). Finally: a concrete reason to buy a top-end Sony phone over a Samsung or Apple.",
    "The Sony A1 has Bluetooth 5.0, compared to the Canon EOS R5’s Bluetooth 4.2 — although the practical benefits of this difference remain to be seen. And both cameras have dual band 2.4GHz/5GHz Wi-Fi, which is good to see. Neither has Wi-Fi 6, but no-one should be surprised these cameras lack some tech that has only just made it to high-end phones.",
    "These are expensive cameras, but the Sony A1 costs a lot more. It’s $6,500 / £6,500 / AU$10,499 at launch, for the body only.",
    "By comparison, the Canon EOS R5 costs $3,899 / £4,199 / AU$6,899. There’s a huge cost difference here, which explains why Sony is able to use elements like the high-end EVF and an even more powerful processor array.",
    "On paper, the Sony A1 beats the Canon EOS R5 in some significant respects. But the $2,500-plus price difference may renew your appreciation for the slightly older Canon.",
    "The benefits you get for the Sony A1's high price include an excellent EVF, an incredible 50MP 30fps burst mode, and niche extras like a built-in Ethernet port. Features like this make the Sony Alpha 1 an obvious choice for action and sport photographers who want a smaller camera.",
    "For the average enthusiast, though, the Canon EOS R5 may be a better deal. You still get ultra-fast burst shooting, great stabilization, very high resolution images and a screen that is more versatile, reducing the need for an external monitor. One thing's for sure – we're looking forward to pitting these two mirrorless cameras against each other out in the field, so look out for that soon."
  ],
  "headers": {
    "4": "Design: Curves versus angles",
    "10": "Screens: Sony wins on EVF, Canon for rear screen",
    "19": "Autofocus: Canon EOS R5 wins on numbers",
    "26": "Video: 8K wins and losses on both sides",
    "35": "Burst shooting: Sony A1 wins for ultimate speed",
    "40": "Stabilization: Canon EOS R5 promises better IS",
    "45": "Battery life and connectivity: Sony brings the advanced tech",
    "53": "Price: the Sony A1 will make your eyes water",
    "55": "Takeaway"
  },
  "links": {
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Canon EOS R1": "https://www.techradar.com/news/canon-eos-r1-rumored-to-be-coming-with-next-gen-autofocus-and-key-video-feature",
    "EOS R5 Animal Eye AF review": "https://www.techradar.com/news/24-hours-with-the-canon-eos-r5-a-wildlife-photographer-gives-his-verdict",
    "Sony Alpha A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "best mirrorless cameras": "https://www.techradar.com/news/best-mirrorless-camera",
    "Sony Xperia Pro": "https://www.techradar.com/news/sony-xperia-pro-is-a-5g-uploading-second-screen-for-professional-content-streamers"
  }
}