{
  "source": "https://www.techradar.com/news/should-you-buy-a-mesh-wi-fi-system",
  "title": "Should you buy a mesh Wi-Fi system?",
  "category": "computing",
  "updated": "2021-12-06T00:09:55Z",
  "author": "darren-allan",
  "summary": "Who needs one, what is mesh Wi-Fi good for – and are there any pitfalls?",
  "article": [
    "Mesh Wi-Fi has been around for some time now, with many big hardware manufacturers now offering their own take on this tech, including most famously Google. These devices have been getting better and better, being honed and bringing in support for the latest wireless standards (Wi-Fi 6), and in Google’s case making a hybrid move with an integrated smart speaker in the Nest Wifi.",
    "Despite this hardware having gone through several iterations in the case of many manufacturers, you may still only be vaguely aware of what this tech is all about, and might have plenty of questions about exactly how mesh Wi-Fi works. And most importantly, you could be mulling whether it’s a system worth investing in as opposed to a traditional router.",
    "Well, allow us to lend a hand in dealing with these issues. Firstly, we’ll look at the ins-and-outs of mesh Wi-Fi and how it works, before considering whether you might actually need mesh networking in your life.",
    "Mesh Wi-Fi offers a way to throw a blanket of wireless coverage over your home (or office) by using multiple devices which are hooked up to each other seamlessly – something that even the best routers cannot usually do.",
    "A mesh Wi-Fi system will have one device that acts as the central unit, and is connected to your DSL or cable modem, with it acting like a standard router. The other units are then satellites which are wirelessly hooked up to the central unit, but provide their own Wi-Fi signal, therefore strengthening coverage in the different parts of the house where they’re positioned. When linked up as such, all these units form a ‘mesh network’ (which is all the same network).",
    "You’ll need to buy a mesh Wi-Fi package with enough units to cover the entire area of your house, and manufacturers provide square footage guidelines to let you know how many devices will be necessary.",
    "As we’ve just discussed, the point of mesh Wi-Fi is to extend the coverage of your wireless network around the house. Therefore, it won’t make much sense – well, any sense – to invest in mesh networking technology if you have a small house (or apartment) throughout which the Wi-Fi coverage is good in every room when using a run-of-the-mill router.",
    "The main use case for a mesh Wi-Fi system is in larger houses, which might have so-called wireless ‘dead spots’, or rooms where the Wi-Fi coverage drops off so you get nothing at all (or an intermittently barely usable signal). With mesh Wi-Fi, you can have the central router unit in the lounge (or wherever you prefer), and then place the satellites to extend coverage to those other rooms which get no Wi-Fi signal otherwise, allowing other users to connect around the house, and helping to provide better coverage and support the use of more devices on your home network.",
    "Another point to bear in mind is that mesh Wi-Fi is generally pretty novice-friendly, as these systems are invariably easy to set up via a simple smartphone app. User-friendliness never hurts, of course, though some standard routers (or indeed traditional Wi-Fi extenders) can also be easy enough to get going with, too. The aforementioned apps usually make it a snap to manage your mesh Wi-Fi network after it’s gone live, too.",
    "For those with a larger home, then, mesh Wi-Fi could be of huge benefit. Even with a more middling-sized property, there could be an argument for a mesh Wi-Fi system if the wireless signal isn’t that great on the fringes of your house. There may be rooms where speeds aren’t that good – even if they remain usable – and the need to cure those issues will depend on your own tolerance for any potential slight slowdown, and how much time you spend in those areas. In such borderline cases, it’ll be a matter of balancing the benefits against the outlay for a mesh Wi-Fi system.",
    "Speaking of the outlay to get up and running with mesh networking, one of the main cons here is the cost. As you might guess, given that it involves multiple devices, the typical pack of two or three units that a mesh Wi-Fi system comprises of doesn’t come cheap, generally speaking.",
    "That said, pricing isn’t exactly out-of-line when compared to high-end routers – which is effectively what a mesh Wi-Fi product is, when you think about it, offering high-quality Wi-Fi coverage for a premium – and asking prices have come down over time somewhat. It’s also worth bearing in mind that we’ve noticed when it comes to Black Friday or Prime Day and the like, mesh networking technology often gets some sizeable price cuts, making it a considerably more tempting proposition. If one of those big sales events is near, it could well be worth holding your horses a bit longer before making a purchase.",
    "Avid gamers may also shy away from a mesh Wi-Fi system, as the core router provided is never going to be able to match the sheer oomph of one of the best gaming routers, or give you gaming-related features and things like traffic prioritization (or functions like the ability to connect to the fastest game server). Premium routers will generally give you more fine-grained and in-depth controls than a mesh Wi-Fi product, too.",
    "Another potential negative is that not everyone is happy about having pieces of hardware visible about the house. These folks may feel that it’s bad enough having to locate one router somewhere, without having to place a few different devices dotted about the home. On the flipside, the good news is that most mesh Wi-Fi hardware is designed to be nicely compact and generally blend in with home décor – and these units are nothing like the kind of antenna-bristling beasts that you’ll see with some standard router designs.",
    "In short, the design of these units can actually be a pro rather than con, particularly if you want a smart speaker too, because as we mentioned at the outset, Google’s Nest Wifi offers a space-saving 2-in-1 combination of mesh router plus speaker.",
    "Obviously enough, the answer to this question depends on your own personal needs and situation. As we’ve already covered, a mesh Wi-Fi system is primarily aimed at those with a larger house, and it makes no sense for somebody living in a small property which is easily blanketed in Wi-Fi coverage by a normal router anyway.",
    "We’ve covered the most common drawbacks, and aside from hardcore gamers – who’ll likely want a dedicated gaming router with all the associated bells and whistles – the main bone of contention is the cost of a mesh Wi-Fi product. You may be able to sidestep that by finding products on sale during the likes of Black Friday week, but if the asking prices for mesh networking simply look too rich for your blood, then you might be better off considering a traditional Wi-Fi extender (which isn’t nearly as seamless a solution, but could still work as a more palatably wallet-friendly proposition).",
    "Many folks with a larger house will, however, easily get their money’s worth from a mesh Wi-Fi setup, particularly families with kids, the parents of which can put paid to whinges on the topic of connection speeds in upstairs bedrooms, for example. As well as guaranteeing strong wireless coverage throughout the house, mesh Wi-Fi systems work seamlessly, are simple to setup and manage, plus they’re easy to expand by tacking on a further device if needed.",
    "You might also want to check out the Asus ZenWiFi AX (XT8) review"
  ],
  "headers": {
    "3": "What is mesh Wi-Fi and how does it work?",
    "6": "Why would you want a mesh Wi-Fi system?",
    "10": "Why might you pass on mesh Wi-Fi?",
    "15": "Should you buy a mesh Wi-Fi system?"
  },
  "links": {
    "Mesh Wi-Fi": "https://www.techradar.com/news/best-wireless-mesh-routers",
    "Google": "https://www.techradar.com/reviews/google-wifi",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Nest Wifi": "https://www.techradar.com/reviews/google-nest-wifi-review",
    "router": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523",
    "best routers": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Avid gamers": "https://www.techradar.com/news/best-pc-games",
    "best gaming routers": "https://www.techradar.com/news/the-best-gaming-routers",
    "Wi-Fi extender": "https://www.techradar.com/news/the-best-wi-fi-extenders",
    "Asus ZenWiFi AX (XT8)": "https://www.techradar.com/reviews/asus-zenwifi-ax-xt8"
  }
}