{
  "source": "https://www.techradar.com/news/free-vpn-might-be-coming-to-a-chrome-based-browser-soon-but-it-is-not-edge",
  "title": "Free VPN might be coming to a Chromium-based browser soon, but it's not Edge",
  "category": "pro",
  "updated": "2021-12-02T07:59:25Z",
  "author": "desire-athow",
  "summary": "Or Chrome or Safari or Firefox for that matter",
  "article": [
    "Vivaldi has brought a new stack of features to its eponymous challenger browser, Vivaldi browser. The fifth iteration of the browser brings theme sharing to the fore as well as Vivaldi Translate, one that doesn’t use Microsoft or Google technologies and will live in a dedicated Translate panel on the desktop browser.",
    "Vivaldi on Android will get two-level tab stacks for extreme browser users, while Chromebooks/tablet users will get a side panel to optimize screen space better. The browser has historically shunned many of the tracking and data collections techniques used by rivals as it aspires to be one of the best browsers for privacy and anonymity.",
    "Speaking of which, a source close to Vivaldi has confirmed to TechRadar Pro that they are actively looking for the right partners to launch their own VPN service, one which is likely to cost nothing given that Opera, which was founded by Vivaldi’s CEO Jon von Tetzchner, has integrated a free VPN in its browser for several years.",
    "Our source cheekily added: “You never say never, we may come up with our own solution, just the way we've got Mail, Calendar, Feeds (in beta currently). Having our own VPN is not trivial so it would be premature to make a headline of sorts. But yes, we are looking at potential partners.”",
    "Mozilla went the other way by having Mozilla VPN that sits alongside its popular Firefox browser as a paid for service. Safari developer Apple, on the other hand, offers a Privacy Relay, which is similar to a VPN Lite service as part of iCloud+ subscription.",
    "Google Chrome doesn’t have any VPN attached to it although Google has started to roll one as part of its Google One subscription. That leaves Microsoft as the only big browser outfit without a consumer facing VPN or privacy product but for how long."
  ],
  "headers": {
    "2": "Is Vivaldi VPN next?"
  },
  "links": {
    "best browsers for privacy and anonymity": "https://www.techradar.com/best/anonymous-browsing",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "free VPN": "https://www.techradar.com/vpn/best-free-vpn",
    "Mozilla VPN": "https://www.techradar.com/reviews/mozilla-vpn",
    "Firefox browser": "https://www.techradar.com/reviews/mozilla-firefox",
    "Privacy Relay": "https://www.techradar.com/news/what-is-apple-private-relay-and-is-it-worse-than-a-vpn"
  }
}