{
  "source": "https://www.techradar.com/news/samsung-the-frame-gets-a-new-tv-accessory-and-its-literally-a-shelf",
  "title": "Samsung The Frame gets a new TV accessory – and it's literally a shelf",
  "category": "televisions",
  "updated": "2021-05-07T13:33:12Z",
  "author": "henry-st-leger",
  "summary": "That's 'My Shelf' to you",
  "article": [
    "Samsung The Frame TV, the sleek designer television, has got a new accessory to help you further customize your decor – and it's called My Shelf.",
    "My Shelf is, as you'd expect, a dedicated shelf for mounting your Frame TV, for those wanting to \"create a tailored wall with personal touches to complement your screen and decor.\"",
    "It isn't just a shelf to sit underneath The Frame, though. Images show off a top-and-bottom casing, with flexibility with whether to center the screen or shift to one-side (as in the photo above). It's only compatible with the largest 55-inch, 65-inch, and 75-inch sizes, but should offer a new way to showcase Samsung's centerpiece television.",
    "We're told My Shelf \"will be available in four different colors: beige, white, brown, and black\" – in keeping with the bezel / frame options that have traditionally been available for the set.",
    "It might not be the most imaginative addition, but it is a practical one, and will make matching The Frame with the objects around it that little bit easier.",
    "The beige option will be launching first, it seems, with the other colors expected to follow later in the year – while the 2021 Frame itself will be delivered to US shoppers by March 18 (UK release date not yet confirmed, but likely shortly after).",
    "The shelf accessory isn't the only new display option for The Frame TV, of course. We'd already heard about the tripod TV stand allowing you to place The Frame like a painting on an easel – and seemingly moving into The Serif's territory – while the Slim Fit Wall Mount will help keep a wall-mounted Frame display flush against the wall.",
    "The number of customizable bezel options is also increasing with choices \"from slim, neutral, and minimalist to big, ornate, and bold.\" This year's Frame TV is much slimmer, too, almost halving in depth from 45.8mm to just 24.9mm.",
    "All in all, it's clear that Samsung is embracing its Frame series and going all-in on customization to best cater to individual tastes.",
    "That's also reflected in a massive increase for The Frame's internal storage. The 2021 model will pack in 6GB of storage rather than the meagre 500MB seen on last year's model, which Samsung says will allow for around \"1,200 ultra hi-res images.\"",
    "Pricing for the 2021 Samsung The Frame TV starts at $999 (around £700 / AU$1,250) for a 43-inch size, and goes up to $2,999 (around £2,100 / AU$3,800) for a 75-inch size. It's also available in 50-inch, 55-inch, and 65-inch models, with a 32-inch Full HD option possibly coming later in the year."
  ],
  "headers": {
    "6": "Shelve it"
  },
  "links": {
    "Samsung The Frame TV": "https://www.techradar.com/news/should-i-buy-samsung-the-frame-tv",
    "tripod TV stand": "https://www.techradar.com/news/tripod-tv-stands-are-coming-to-samsung-the-frame-and-lg-oled-tvs-and-were-all-for-it"
  }
}