{
  "source": "https://www.techradar.com/news/steam-gets-a-new-look-is-valve-laying-the-groundwork-for-the-steam-deck",
  "title": "Steam gets a new look – is Valve laying the groundwork for the Steam Deck?",
  "category": "gaming",
  "updated": "2021-07-30T11:08:41Z",
  "author": "jess-weatherbed",
  "summary": "Either way, it looks snazzy",
  "article": [
    "Just because the Steam Deck has been hogging most of the recent news, doesn't mean that Valve is neglecting its game distribution service. Windows Central reports that the latest beta client for Steam on Windows, Mac, and Linux contains some interesting UI changes, particularly on the downloads page.",
    "Not only has the downloads section been completely redesigned, but new features are being introduced to streamline its usage, including the ability to manually reorder your download queue by dragging and dropping the games into the order of your choosing.",
    "The beta also includes the usual bug fixes and updates you would expect from a Steam update, such as a new installation process for the HTC Vive Pro 2 VR headset, with a prompt that should automatically appear to download the relevant driver.",
    "For anyone that has multiple drives on their PC, there are also some useful changes coming to library folders. Each drive you have a library folder in will get its own dedicated tab, which, in theory, will allow you to easily move your game files around without having to mess with your devices Filer Explorer. This feature isn't currently working, but we've all accidentally installed huge game files onto our boot SSD at some point, so this should remove some stress going forward.",
    "You have to sign up for the beta if you're wondering why you can't see any of these changes live on Steam right now, so if you're tempted to try these new features for yourself then head to the Steam taskbar located at the top of the application and click settings. From there, you should land on the account section where you can opt into beta participation. The full list of updates can be found in Valves update announcement, but we've detailed some of the key changes below.",
    "Valve is no stranger to futureproofing, so it's likely that some of these updates could be linked to the Steam Deck launch. The library folders overhaul especially could be to prepare for users moving game files between the internal drive and any additional SD card storage you insert into the device.",
    "It also seems a few of the changes involve a general interface clean up, such as the removal of the 'Recent Friend Activity' shelf which could take up precious space on a 7-inch display. Features like drag and drop may also have been optimized for the Steam Deck's innovative trackpad controls to make Steam more pleasant to use on such a small screen.",
    "The color palette update may also have been developed along a similar means to help push accessibility not just on laptops and desktops, but also for anyone with those accessibility concerns looking to reserve a Steam Deck for themselves.",
    "That said, Valve likes to develop and release features a good deal ahead of time, regardless how many users will actually see benefits. A few months back Steam announced a feature that allowed 8K streaming, despite the fact most computers would need to be equipped with pricey components like a Ryzen 5950x CPU and an Nvidia GeForce RTX 3090 graphics card (and of course, an 8K monitor or TV) to achieve this.",
    "The good news about this beta client update is that it standard PC users will also reap the benefits alongside prospective Steam Deck owners, so this is a win-win situation for PC gamers across the board."
  ],
  "headers": {
    "2": "Full Steam ahead",
    "5": "Analysis: designed for the Steam Deck?"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Windows Central": "https://www.windowscentral.com/steam-beta-update-july-29",
    "HTC Vive Pro 2": "https://www.techradar.com/reviews/htc-vive-pro-2-review",
    "Valves update announcement": "https://steamcommunity.com/groups/SteamClientBeta/announcements/detail/2974049913511655206",
    "8K streaming": "https://www.techradar.com/news/steam-is-getting-8k-streaming-but-why",
    "Ryzen 5950x CPU": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-9-5900x-and-5950x-find-stock-here",
    "Nvidia GeForce RTX 3090 graphics card": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "8K monitor": "https://www.techradar.com/best/best-5k-and-8k-monitors"
  }
}