{
  "source": "https://www.techradar.com/news/google-play-store-will-follow-apple-app-store-privacy-labels",
  "title": "Google Play will follow Apple app store 'privacy labels'",
  "category": "phones",
  "updated": "2021-05-07T09:07:58Z",
  "author": "balakumar-k",
  "summary": "Google follows Apple and tells developers to reveal info on data collection",
  "article": [
    "Google is creating a new safety section in its Play app store to let Android users see exactly what data developers collect and share about them.",
    "The news follows a similar move by Apple in late 2020 that saw the iOS App Store publish a \"privacy label\" concerning the data collection and sharing practices of services on the platform.",
    "The move will also give Android users access to additional privacy and security information in a bid to safeguard their safety when using the Play Store.",
    "All apps on Google Play - together with Google’s personal apps - will now be required to share this info and supply a 'privateness' coverage.",
    "The Google Play safety section will tell users exactly what information an app has access to, such as location data or contact details, with developers able to justify their practices if they choose.",
    "It will also detail if an app encrypts data, if it follows Google’s policies for families and children, whether users have a choice in sharing information, and whether users can request data deletion if they uninstall an app.",
    "Android app developers have to declare the info before the second quarter of 2022, with users set to see the safety section in Google Play sometime in the first three months of 2022.",
    "Any apps that don't include the new labels could see their updates blocked, or their services removed from the Play Store.",
    "“We work closely with developers to keep Google Play a safe, trusted space for billions of people to enjoy the latest Android apps. Today, we’re pre-announcing an upcoming safety section in Google Play that will help people understand the data an app collects or shares, if that data is secured, and additional details that impact privacy and security,” Google Vice President Product (Android Security and Privacy) Suzanne Frey said in a blog post.",
    "Apple’s latest mobile software update, iOS 14.5, includes an App Tracking Transparency feature, which requires users to opt in to being tracked by apps for personalized advertising.",
    "Apple had openly declared that it will clamp down on snoopy apps that stealthily shadow people on their iPhones to help sell more advertising.",
    "The update has kicked up a storm, primarily led by Facebook which has been saying that many small business would be affected by this change.",
    "Facebook's opposition appears to stem from the fact that it, along with many other apps, gathers information about users' interests in order to tailor information and adverts especially for them. It says that blocking this practice will hurt ad revenues.",
    "Google also relies on advertising revenue, but the company says it is still working on how it can limit data collection and cross-app tracking on the Android platform and not be seen inflexible as Apple."
  ],
  "headers": {
    "3": "Getting private",
    "9": "Android vs iOS"
  },
  "links": {
    "a similar move by Apple": "https://www.techradar.com/news/apple-wants-to-eliminate-dodgy-apps-with-nutritional-info-esque-privacy-labels",
    "blog post": "https://india.googleblog.com/2021/05/new-safety-section-in-google-play-will.html",
    "clamp down on snoopy apps": "https://www.techradar.com/how-to/how-to-view-the-apple-privacy-labels-in-the-mac-app-store",
    "primarily led by Facebook": "https://www.techradar.com/news/apples-new-os-update-ios-145-has-the-feature-that-facebook-is-dead-against"
  }
}