{
  "source": "https://www.techradar.com/news/doom-eternal-bundle-gives-you-a-fighting-chance-to-buy-an-nvidia-rtx-3080-ti-gpu",
  "title": "Doom Eternal bundle gives you a fighting chance to buy an Nvidia RTX 3080 Ti GPU",
  "category": "computing",
  "updated": "2021-06-23T15:49:33Z",
  "author": "darren-allan",
  "summary": "Nvidia and Bethesda raffle boasts 300 of these powerful graphics cards",
  "article": [
    "If you’re mulling the prospect of splashing a huge chunk of cash on the new GeForce RTX 3080 Ti graphics card, your first challenge, of course, is to find one on sale.",
    "However, the good news is that Nvidia and Bethesda have teamed up with a promo that could help you snag one of these new GPUs, as it’s offering no less than 300 of these Ampere monsters as part of a bundle purchase, with lucky buyers from the US and Europe picked out in a raffle.",
    "The Doom Eternal GeForce RTX 3080 Ti Demon Slayer Bundle is priced at $1,450 (with taxes and shipping cost to be added), or €1399.99 in Europe (around £1,200). It comes complete with the 3080 Ti Founders Edition graphics card, a code to get you a copy of Doom Eternal Deluxe Edition, plus some exclusive collectibles thrown in (and a bonus $100 Bethesda Gear Store digital gift card).",
    "Now, rather than a stampede to buy this top-performing GPU – which folks have been purchasing prebuilt gaming PCs at eye-watering costs to get hold of – as mentioned, a reservation raffle has been selected as the fairest way to give everyone who is interested an equal shot.",
    "Registration for the raffle has just opened and will run until July 7, whereupon the 300 winners will be drawn and notified by email on July 8. They will then have 48 hours to actually complete their product order, losing the ability to do so once that time period expires – with any unpurchased graphics cards being raffled again.",
    "To enter the raffle, head here for entrants who are a resident of the US or Canada (who must have reached the age of majority in their state). Only one entry per household is allowed. Those in Europe (excluding Italy) need to sign up here.",
    "As you might have seen, Doom Eternal just got support for ray tracing and DLSS in the latest Nvidia graphics driver, and these shiny new graphics will be live when the game’s big update arrives very shortly on June 29. And if you have a 3080 Ti in your gaming PC come mid-July, you’ll be able to enjoy all those ray-traced details to the max…"
  ],
  "headers": {
    "4": "Knee-deep in the raffle"
  },
  "links": {
    "GeForce RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "purchasing prebuilt gaming PCs at eye-watering costs": "https://www.techradar.com/news/want-an-nvidia-rtx-3080-ti-on-prime-day-these-gaming-pcs-could-net-you-one",
    "head here": "https://gear.bethesda.net/pages/bethesdagearcontest",
    "sign up here": "https://eumerch.bethesda.net/de/nvidia-graphics-card-raffle",
    "Doom Eternal just got support for ray tracing": "https://www.techradar.com/news/nvidia-dlss-has-arrived-on-linux-will-this-tempt-gamers-to-switch-from-windows-10",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-brings-faster-frame-rates-to-more-games-thanks-to-unreal-engine-plug-in"
  }
}