{
  "source": "https://www.techradar.com/news/new-macbook-air-could-arrive-early-2022-with-m2-chip-and-imac-colors",
  "title": "New MacBook Air could arrive early 2022 with M2 chip and iMac colors",
  "category": "computing",
  "updated": "2021-07-06T08:58:53Z",
  "author": "darren-allan",
  "summary": "Something ‘colorful’ this way comes, apparently…",
  "article": [
    "The next MacBook Air will be the first laptop from Apple to use the next-gen M2 chip when it purportedly arrives in 2022, complete with iMac-like color schemes – and the MacBook Pros which are expected to debut before that, likely later this year, will use the M1X.",
    "That’s the latest rumor from leaker Dylandkt, an iOS developer who regularly shares Apple-related findings on Twitter and has proved accurate in the past.",
    "As you can see, the theory is that the MacBook Air will debut at some point in the first half of 2022 with the M2 chip, which will be a full-on sequel to the M1, and it’ll be “most likely built on the same foundation the A15 is built on” (the A15 being the chip destined for the iPhone 13 later this year) as Dylandkt elaborates in a further tweet.",
    "As for the M1X, that’ll be inside the new MacBook Pro machines which Dylandkt expects to launch in either October or November (and there’ll be a Mac mini M1X too, as the leaker has claimed in the past). Other recent buzz on the grapevine seems to suggest a September or October launch for these new Pro laptops, which will supposedly consist of redesigned MacBook Pro 14-inch and 16-inch models, with October seeming more likely.",
    "That said, Dylandkt admits there is still some uncertainty around this launch timeframe, because Apple has been having some issues with the supply of components – and that could potentially delay matters further. Equally, there have been rumors suggesting that the launch of the MacBook Pros could be much closer and indeed might be this summer (as Mark Gurman has previously insisted).",
    "As you might expect, the M1X that will supposedly power the MacBook Pros will be built along the same lines as the M1 but will increase the CPU and GPU core count, and will also pull more power as a result.",
    "When questioned about next year’s ‘colorful’ MacBook Air and what colors this range might run with, Dylandkt reckons that the paint jobs will be the same as the new iMac, “including the same bezel color” (meaning a white bezel surrounding the display).",
    "Treat all this, of course, with the appropriate amount of caution as with any hardware rumor. Certainly regarding the launch timeframe, as Dylandkt admits, there may be all sorts of factors in play that even Apple may not be able to control – meaning even if Tim Cook’s firm is planning for a certain release schedule, that may yet slide. In short, everything is still likely rather up in the (MacBook) air.",
    "Via Wccftech"
  ],
  "headers": {
    "6": "The color of MacBooks"
  },
  "links": {
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pros": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "chip destined for the iPhone 13": "https://www.techradar.com/news/iphone-13s-a15-bionic-chip-reportedly-in-production-suggesting-september-release",
    "launch in either October or November": "https://www.techradar.com/news/new-macbook-pro-14-inch-and-16-inch-could-arrive-disappointingly-late-in-2021",
    "supply of components": "https://www.techradar.com/news/new-apple-macbooks-and-ipads-could-get-delayed-due-to-chip-shortages",
    "rumors suggesting": "https://www.techradar.com/news/apple-might-be-releasing-the-m1x-macbook-pro-sooner-than-we-thought",
    "might be this summer (as Mark Gurman has previously insisted)": "https://www.techradar.com/news/rumored-macbook-pros-could-use-m1x-chip-this-year-with-m2-coming-in-2022",
    "M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "paint jobs will be the same as the new iMac": "https://www.techradar.com/news/the-new-imac-isnt-pretty-its-just-badly-designed",
    "Wccftech": "https://wccftech.com/apple-m2-chipset-for-2022-macbook-air/"
  }
}