{
  "source": "https://www.techradar.com/news/most-workers-still-dont-want-to-return-to-the-office",
  "title": "Most workers still don't want to return to the office",
  "category": "computing",
  "updated": "2021-10-06T12:34:52Z",
  "author": "sead-fadilpasic",
  "summary": "Bosses want to go back, employees don't, Slack finds",
  "article": [
    "Workers and employers are still worlds apart when it comes to the view on hybrid working and returning to the office post-pandemic, a new study by Future Forum, a Slack-launched consortium, says.",
    "“The great executive-employee disconnect”, report, based on a poll of more than 10,000 knowledge workers in the US, Australia, France, Germany, Japan, and the UK says remote working executives are nearly three times more likely to want to return to the office full-time, compared to employees.",
    "Drilling deeper, the report found two-thirds of execs (68%) want to work in the office most of the time and, of that group, 59% plan to bring their employees back with them. Two-thirds are currently designing their companies’ post-pandemic workforce policies without significant input from their employees.",
    "At the other end, three-quarters (76%) of workers don’t want to return to the office full-time.",
    "In fact, over the past year, employee desire for a flexible working environment has remained consistent, to the point that an increasing number is willing to look for work elsewhere, if they’re not provided with the option of remote working.",
    "Right now, more than half (57%) of knowledge workers are “open to looking for a new job” in the next year.",
    "Executives need to do more and redesign their workplaces into something that attracts, empowers, and retains the best and most diverse talent, the consortium concluded.",
    "While the process and the end result may differ from company to company, there are certain principles that everyone can keep in mind, including embracing flexibility, training and rewarding inclusion, and building connections through transparency.",
    "“The view of the office looks different from the top,” said Brian Elliott, Executive Leader of the Future Forum. “While executives are banging down the door to get back to their corner offices, non-executive employees are demanding flexibility in where and when they work. Companies must do more to bridge this gap in order to attract and retain top talent.”"
  ],
  "headers": {
    "6": "Attracting the workforce"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}