{
  "source": "https://www.techradar.com/news/oppo-find-x3-pro-vs-iphone-12-pro",
  "title": "Oppo Find X3 Pro vs iPhone 12 Pro: we compare Apple and Oppo's Pro flagships",
  "category": "phones",
  "updated": "2021-03-12T06:30:57Z",
  "author": "axel-metz",
  "summary": "Like a Pro",
  "article": [
    "As the middleman between the already-excellent iPhone 12 and iPhone 12 Pro Max, the iPhone 12 Pro is certainly in the upper echelon when it comes to smartphones in 2021 – but that’s not to say it’s without competition.",
    "That competition is all the more important, too, when Apple’s devices sit at the pricier end of the spectrum without offering any features you might consider truly groundbreaking.",
    "Enter the Oppo Find X3 Pro. As one of the most exciting and powerful smartphones of the year, does the premium handset in Oppo’s new Find X3 5G range offer the bells and whistles to rival – or even exceed – its iPhone counterpart?",
    "Here’s how these two Pro models match up.",
    "The first thing to note is that both these smartphones are far from cheap. As Pro variants in their respective model lineups, it’s no surprise to see these handsets reach into the quadruple figures when it comes to price.",
    "The iPhone 12 Pro released worldwide back in October 2020, meaning you can get your hands on it now for a starting price of $999 / £999 / AU$1,699 for the 128GB model. It’s worth noting that this price rises to $1299 / £1,299 / AU$2,219 for the 512GB version, but we expect most everyday users will be well-served by the base capacity.",
    "The Oppo Find X3 Pro 5G, on the other hand, won’t be released until April 14, and doesn’t look likely to arrive anywhere other than in the UK, Ireland and Australia. It’s also set to start at an eye-watering £1,099 / €1149 (around AU$1,980), which is 30% more expensive than the standard Find X3 (starting at £699 / €749 / around AU$1,260) and almost three times the price of the Lite variant (starting at £379 / €449 / around AU$680) – which is a cost jump beyond even Apple proportions.",
    "It must be said that both devices look great. The iPhone 12 Pro design is different from last year’s iPhone 11 Pro – which isn’t always a given with Apple – thanks to its flat sides with sharp, 90-degree edges. It’s not a design move we’ve seen from the company since the days of the iPhone 5, and the entire iPhone 12 range benefits from this re-discovery of a winning aesthetic.",
    "Apple says the new edge design also makes the iPhone 12 Pro twice as resilient as its predecessor in the event of a drop, which is always handy (though this isn’t something we’ve been willing to test).",
    "Other new additions include the Ceramic Shield on the front, which replaces the glass from the iPhone 11. Apple has worked with Corning to create a structure that it says isn't actually glass, but rather a 'nano-crystalline' material that has four times the strength of last year's screen, so it should be harder to break the iPhone 12 Pro in that respect, too.",
    "The device comes in Apple’s graphite, silver, gold and pacific blue color variants.",
    "The Oppo Find X3 Pro is also pretty good-looking, even if it’s not quite as visually-striking as its predecessor. Thanks to its large display, there’s very little bezel to be seen here, with the screen taking up the near-entirety of the device’s front face. We’re tempted to say it looks somewhat similar to the Samsung Galaxy 21 from the front, if not for the different positioning of the front facing camera.",
    "At the rear of the device, the camera module has been encased in the back panel so that it blends in with the streamlined design – which makes for a less in-your-face camera approach than Samsung’s latest flagship, to say the least.",
    "In fact, beyond the more curvaceous edges of the Oppo device, both the Find X3 Pro and iPhone 12 Pro look fairly similar from the rear, especially in terms of their like-minded camera positioning. Arriving in blue and gloss black colour variants, the former, from a distance, could easily be mistaken for a pacific blue iPhone 12 Pro.",
    "Weight-wise, both devices are near-identical. The iPhone 12 Pro weighs in at 189g, with the Oppo Find X3 Pro only slightly heavier at 193g. Neither is particularly hefty in the hand, and their respective ergonomic designs make them easy to hold.",
    "The iPhone 12 Pro has an impressive 6.1-inch OLED screen, capable of displaying deep blacks, vivid whites and a vast range of colors, especially when you’re viewing HDR footage.",
    "Whether you're looking at high-quality photography from Instagram or just want to enjoy your home movies – which can be captured in the high-end Dolby Vision format in 4K at a buttery-smooth 60 frames per second – Apple’s premium iPhone packs a display which ranks as one of the best on the market.",
    "Less impressive is its 60Hz refresh rate, which wouldn’t be worth mentioning if it wasn’t for the 120Hz equivalent boasted by the Oppo Find X3 Pro (although, in fairness, 60Hz is just fine). Oppo’s flagship also comes with a slightly larger, curved 6.7-inch AMOLED screen, which means brighter colors with the added benefit of more efficient power consumption.",
    "The QHD+ resolution and HDR10+ functionality of the Find X3 Pro also means it’s Oppo’s first ever smartphone capable of capturing and displaying up to one billion colors in a single image – ten times more than the human eye can detect.",
    "Does this mean it has a better screen than the iPhone 12 Pro? On paper, yes, but in practise, it’s hard to tell. By no means do the superior specs of the Find X3 Pro render the iPhone’s screen anything less than impressive – we’re talking about very slight improvements to color gamut and pixel density here – but the Oppo Find X3’s larger display does mean it edges out its competitor when it comes to professional tasks.",
    "When it comes to cameras, the gulf between the two phones gets a little wider.",
    "The iPhone 12 Pro comes packed with a 12-megapixel triple-lens camera; a regular wide option, an ultra-wide sensor, and a telephoto 2x zoom for getting closer to your subjects. There’s also a fourth sensor, a LiDAR scanner, which makes it easier for the iPhone to work out what it's looking at.",
    "This is a great camera set-up, and the iPhone 12 Pro’s ability to use all three of its rear lenses in Night Mode delivers mightily-impressive low-light performance.",
    "But the Oppo Find X3 Pro doubles-down on its snapping capabilities. It’s the first smartphone to combine both two primary 50MP cameras (wide-angle and ultra-wide angle) with a new-to-market Sony IMX 766 imaging sensor, which aims to revolutionise how users film and take photographs on the move.",
    "The camera also offers DSLR-level video capture as well as full manual control over shutter speed and focus – designed to make the phone a videographer’s best friend. The iPhone 12 Pro has the ability to record, edit and watch Dolby Vision content in 4K at 60fps, and the Oppo matches it in this respect with the added bonus of a dedicated Film mode (much like a Pro photography mode, but for video).",
    "For what it’s worth, both devices have the same 32MP f/2.4 selfie snapper – just behind the Samsung Galaxy S21 Ultra’s 40MP front-facing camera.",
    "Like with their cameras, it’s a little tricky to directly compare the internals of the Oppo Find X3 Pro and iPhone 12 Pro without using them side-by-side.",
    "Under the hood, the iPhone packs Apple’s A14 Bionic chipset alongside 6GB of RAM (according to our diagnostics), which offers more than enough power to get through pretty much any task and makes the device the fastest phone we’ve ever tested. Naturally, the iPhone 12 Pro runs the latest version of iOS 14, Apple’s smoothest and most customizable OS to date.",
    "The Oppo Find X3 Pro, on the other hand, boasts a top-end Snapdragon 888 chipset and 12GB of RAM, which is twice as much as the iPhone – a benchmark test returned a multi-core score to rival most other competitors, too. The Find X3 Pro also runs Android 11 overlaid with ColorOS 11.2 (as with the other three Find X3 models in the lineup).",
    "This isn’t to say the Oppo is drastically faster than the iPhone 12 Pro, but its internals do suggest that, should they be paired side-by-side, the former would slightly out-perform the latter.",
    "Both devices include 5G support for lightning-quick internet speeds and an IP68 certification to keep them dust and water resistant. We know that the iPhone 12 Pro can survive being submerged deeper and longer than any iPhone before it, and the Find X3 Pro follows suit (though it goes without saying that neither are entirely waterproof).",
    "We don’t know exactly how big the battery is in the iPhone 12 Pro (Apple doesn’t disclose this information), but we found that with light use we could easily make it to midnight with more than half the battery remaining. The phone can actually work for 48 hours before desperately needing a charge, which supports Apple’s claims that it can run streamed videos for up to 17 hours and audio for up to 65.",
    "That doesn’t mean the iPhone 12 Pro battery life is excellent, though, especially when using the improved internet speeds of 5G. You'll get 15-20% less battery life if using 5G signal only on the device, which is likely why Apple has added in a smart data mode that slows 5G speeds to 4G levels if 5G isn't needed.",
    "It’s also worth noting that Apple doesn’t supply a charging block in the box, so if you don’t have an old Lightning cable to hand, you’ll have to head to the shops.",
    "The Oppo Find X3 Pro is fitted with a 4500mAh battery – which is 500mAh larger than the one found in the Samsung Galaxy S21 – and provides competent, if not earth-shattering, battery life. It comfortably lasts a full day on one charge.",
    "Unlike Apple, Oppo will provide a charger in the box – a 65W SuperVOOC 2.0 Flash Charge, to be exact – so you won’t have to worry about an additional purchase. The Find X3 Pro also comes with reverse charging capabilities, allowing you to use the phone to charge other devices that support wireless charging – not something we’ve seen yet on any iPhone.",
    "There’s no denying that the iPhone 12 Pro is a great smartphone; it’s quick, bright, has a fantastic camera and comfortably stands alongside the best phones on the market right now.",
    "The Oppo Find X3 Pro, though, goes toe-to-toe with its Apple counterpart in almost every department, even bettering it in areas like photography, display and processing power. Of course, ‘bettering’ here only refers to slight visual or performance improvements rather than any major advantages to write home about – but on paper, the Oppo is objectively the superior phone.",
    "It’s worth remembering that the Oppo Find X3 Pro won’t be available worldwide, and also that it costs noticeably more than the iPhone 12 Pro, so only if you’re willing to shell out the bigger bucks (and possibly relocate) will you get to see what Oppo’s premium flagship smartphone has to offer. Otherwise, the iPhone 12 Pro will be just fine."
  ],
  "headers": {
    "4": "Oppo Find X3 Pro vs iPhone 12 Pro price and availability",
    "7": "Design",
    "15": "Display",
    "20": "Camera",
    "26": "Specs and performance",
    "31": "Battery life",
    "36": "Takeaway"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "predecessor": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "Samsung Galaxy 21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review#design",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "we’ve ever tested": "https://www.techradar.com/reviews/iphone-12-pro-review#camera",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "we’ve seen yet": "https://www.techradar.com/news/apples-magsafe-iphone-battery-pack-could-support-reverse-charging"
  }
}