{
  "source": "https://www.techradar.com/news/hyperion-xp-1-the-hydrogen-electric-221mph-hypercar-with-1000-mile-range",
  "title": "Hyperion XP-1: the hydrogen-electric, 221mph hypercar with 1,000 mile range",
  "category": "car-tech",
  "updated": "2021-01-22T10:58:10.101Z",
  "author": "john-mccann",
  "summary": "It'll also get you from 0-60mph in under 2.2 seconds",
  "article": [
    "The Hyperion XP-1 wants to show the world why hydrogen electric vehicles are the future. It boasts supreme performance, huge range, low weight and a futuristic design that'll likely turn heads everywhere it goes.",
    "It does away with the lithium-ion batteries you find in most electric cars available today, instead swapping them out for a hydrogen tank and super capacitors which not only weigh less, but can operate more efficiently at extreme temperatures and - Hyperion claims - the system is safer than lithium-ion counterparts.",
    "With the XP-1 weighing less than its lithium-ion packing competitors, it's allowed US firm Hyperion to eke out every last drop of performance, resulting in some road-scorching specs.",
    "We sat down with Hyperion CEO, Angelo Kafantaris, during CES 2021 to talk about the firm's hydrogen ambitions and it's new XP-1 hypercar.",
    "If you want to know about the Hyperion XP-1, then read on as we have all the details on the futuristic car which uses some of the same technology as NASA.",
    "Hyperion expects to begin production of the XP-1 in 2022, with the first customers receiving their vehicles by the end of that year, but the majority of orders are set to be fulfilled in 2023.",
    "Just 300 Hyperion XP-1 hypercars are being produced and, while the firm has not revealed how much it costs, we expect that the price will be lofty.",
    "The Hyperion XP-1 has an impressive spec sheet. The four-wheel drive car can produce over 1500 hp, which the company claims will propel the XP-1 to a top speed of 221mph, making it faster than many big names including the Lamborghini Aventador S, McLaren Senna, Ferrari LaFerrari and Porsche 911 GT2 RS.",
    "It will also be able to go from 0-60mph in lightning quick time - under 2.2 seconds. That puts the Hyperion XP-1 up there with some of the fastest accelerating cars on the planet.",
    "Tesla's Model S with Ludicrous Mode has a claimed time of 2.3 seconds, as does the Dodge Challenger SRT Demon and Ariel Atom 500 (V8), meanwhile the Bugatti Chrion comes in at 2.4 seconds and the Porsche 918 Spyder at 2.5 seconds.",
    "Hyperion says that the XP-1 will be able to offer up to 1,000 miles of range from a single tank of hydrogen when driven at road legal speeds. That's much greater than any current electric car available currently, with many ranging from 100 to 400 miles on a single top-up.",
    "Once the hydrogen tank is empty, you can top it back up in under five minutes - far quicker than recharging the lithium-ion batteries in fully electric cars. The trouble is, there are hardly any hydrogen fueling stations around the world, which means owning a hydrogen-electric car right now isn't overly practical.",
    "Hyperion hopes the fueling network will develop in the coming years, and the driving force for it building the XP-1 is to help push forward its own plans to build a network of hydrogen fueling stations. It's an energy company first, motor vehicle brand second.",
    "It all sounds very impressive, but we'll have to wait for the production cars to roll off the factory lines and arrive with owners before we can tell if the XP-1 can live up to the billing.",
    "Part of the Hyperion XP-1's unique design is its articulating, solar panel-clad rear wing. It swoops down over the side of the vehicle, hugging it.",
    "The rear wing and raises up and moves backwards for optimum down force when driving, and when parked, the wing can track the sun's movement and adjust its position to ensure it's getting the most rays on its solar panels.",
    "While the solar panels do not produce enough electricity to power the car, they do provide power for some of the electronics inside the vehicle - which takes a small amount of demand off the hydrogen.",
    "Another eye-catching element of the Hyperion XP-1 can be found inside the cockpit and it stretches from the dash, through the middle of the two seats to the rear of the cabin.",
    "We're talking about its display. Instead of opting for a door-to-door screen like in the Honda E and Byton M-Byte, Hyperion has instead equipped the XP-1 with this unusual display between the seats.",
    "Other than the image above, and knowing it will feature gesture controls, we don't know too much else about the Tony Stark-inspired display. Kafantaris has confirmed that Hyperion will reveal more information about the display next month, and we'll bring you everything you need to know when that happens.",
    "The XP-1 is just the start for Hyperion in terms of vehicles, as Kafantaris explained.",
    "\"Future vehicles from Hyperion will always be in smaller numbers, but nothing quite as small as the 300 roll out we're doing here.",
    "\"There will be cheaper vehicles, there will be more vehicles coming from Hyperion, but our focus will always be station infrastructure.\"",
    "It's a company worth keeping an eye on then as the race between hydrogen electric and lithium ion in our cars really hots up."
  ],
  "headers": {
    "5": "Hyperion XP-1 release date and cost",
    "7": "Hyperion XP-1 speed, acceleration and range",
    "14": "Hyperion XP-1 tech and solar spoilers"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Honda E": "https://www.techradar.com/news/the-new-honda-e-electric-car-is-tech-central-for-drivers-and-passengers",
    "Byton M-Byte": "https://www.techradar.com/news/the-byton-m-byte-isnt-just-a-car-its-a-smart-device-on-wheels"
  }
}