{
  "source": "https://www.techradar.com/news/iphone-13-pro-vs-iphone-12-pro",
  "title": "iPhone 13 Pro vs iPhone 12 Pro: has Apple finally created a Pro worthy of the name?",
  "category": "phones",
  "updated": "2021-12-04T01:35:05Z",
  "author": "jon-mundy",
  "summary": "Brighter, further, faster, baby",
  "article": [
    "Apple’s iPhone 13 smartphone range is official, and the iPhone 13 Pro is shaping up to be another classy yet compact flagship handset. But how does it compare to 2020’s iPhone 12 Pro?",
    "We now have all the key specifications, so we can give you an idea of how the two phones stack up ahead of our in-depth hands-on.",
    "Should you upgrade to the iPhone 13 Pro in 2021? Let’s take a closer look at what’s being offered.",
    "The iPhone 13 Pro will be released on September 24, 2021. That’s a little earlier in the year than the iPhone 12 Pro, which landed on October 23, 2020.",
    "Apple’s pricing largely matches the iPhone 12 Pro. The entry-level 128GB model of the iPhone 13 Pro will set you back $999 / £949 / AU$1,699, while the 256GB model will cost $1,099 / £1,049 / AU$1,869, and the 512GB model will cost $1,299 / £1,249 / AU$2,219.",
    "For the very first time, there’s also a new 1TB model with the iPhone 13 Pro. This will cost $1,499 / £1,449 / AU$2,569.",
    "The iPhone 12 Pro started from $999 / £999 / AU$1,699 for the 128GB model at launch. The 256GB model cost $1,099 / £1,099 / AU$1,899, while $1,299 / £1,299 / AU$2,219 got you the range-topping 512GB model.",
    "As you can see, UK buyers are benefiting from a recent currency shift from Apple, which means they get a little more for their money.",
    "The iPhone 13 Pro looks very similar to the iPhone 12 Pro, but we would have been extremely surprised if that weren’t the case. Apple switched up its iPhone design in a big way with last year’s models, so another wholesale change isn’t on the cards yet.",
    "While you get the same angular design, parallel glass surfaces, and surgical-grade stainless steel rim, there are subtle differences.",
    "The newer phone is a little bigger and heavier than its predecessor, reflecting its larger battery. While the iPhone 12 Pro measures 146.7 x 71.5 x 7.4mm and weighs 189g, the iPhone 13 Pro measures 146.7 x 71.5 x 7.65mm and weighs 204g. The newer phone is a fraction thicker and 15g heavier.",
    "You get a slightly different array of color options with this year’s iPhone too: Graphite, Gold, Silver, and Sierra Blue. The iPhone 12 Pro laid on Silver, Graphite, Gold, and Pacific Blue.",
    "As with the iPhone 12 Pro, the iPhone 13 Pro covers its front with a Ceramic Shield, which is four times tougher than most other glass display materials.",
    "Perhaps the most significant design change this time around is the display notch, which is 20% smaller on the iPhone 13 Pro than its iPhone 12 Pro counterpart.",
    "At first glance, these two displays look identical. They’re both 6.1-inch Super Retina XDR OLED displays with the same 1170 x 2532 resolutions. Both can hit a peak brightness of 1200 nits for HDR content.",
    "There are a couple of differences though. One is that the iPhone 13 Pro's display gets brighter in outdoor lighting, to the tune of a mighty 1,000 nits. The iPhone 12 Pro can only manage 800 nits.",
    "The key difference, however, is one that makes the iPhone 13 Pro earn its Pro name in a way that the iPhone 12 Pro really should have done 12 months before. The new phone finally adds a 120Hz refresh rate to the equation.",
    "This is a much delayed feature, with Apple having introduced its super-smooth ProMotion standard with the 2017 iPad Pro. It basically means that content can scroll past twice as smoothly as on the iPhone 12 Pro’s 60Hz equivalent.",
    "Apple has used LTPO (low-temperature polycrystalline oxide) display technology here, so it can scale the iPhone 13 Pro display’s refresh rate from 10Hz right up to 120Hz according to the task at hand.",
    "This LTPO technology has been present in Android phones for a while, but the interesting point here is that iOS itself has been programmed to track the speed of your touch inputs and adjust the screen’s refresh rate accordingly. The result is that it should seamlessly scale without you even realizing, thus saving vital battery life.",
    "Like the iPhone 12 Pro before it, the iPhone 13 Pro packs in a trio of 12MP cameras.",
    "This time around, the iPhone 13 Pro gets a new larger wide sensor and a wider f/1.5 aperture (compared to the iPhone 12 Pro’s f/1.6) for a 2.2x improvement in low light shots.",
    "The iPhone 13 Pro’s ultra-wide sensor has been widened to an f/1.8 aperture, which is much larger than the iPhone 12 Pro’s f/2.4 equivalent. All in all, this sensor enjoys a 92% low light improvement over the iPhone 12 Pro’s ultra-wide.",
    "That’s not the only way in which the iPhone 13 Pro’s ultra-wide camera is an improvement. It also has the ability to capture sharp super-close-up macro shots from as close as 2cm away from the subject.",
    "Elsewhere, the 12MP telephoto lens gets a boost from a 2x optical zoom on the iPhone 12 Pro to a 3x optical zoom on the iPhone 13 Pro. You can also shoot Night mode shots using the telephoto sensor this time around.",
    "Apple always comes to the table with fresh photographic tricks, and in the iPhone 13 Pro that includes a new feature that lets you select from various Photo­graphic Styles, altering the tone and warmth without making things like skin and skies look unnatural.",
    "Smart HDR 4, meanwhile, can make adjustments for multiple people in a scene.",
    "On the video front, the new Cinematic mode will automatically select the point of focus for movie theater-worthy productions, even following a subject’s gaze and anticipating when a subject is about to come into view. It also lets you edit the depth effects after you shoot.",
    "Later in the year, a feature called ProRes video is coming, which will let you record, edit, and deliver broadcast-ready content on the go at 4K/30fps - or at 1080p if you opt for a 128GB model.",
    "It’s looking like a healthy bump up from what remains one of the finest smartphone cameras on the market in the iPhone 12 Pro.",
    "Apple’s A-series chips are always at the very top of the smartphone performance tree, and we can’t see that changing with the iPhone 13 Pro’s A15 Bionic.",
    "This offers a 6-core CPU that’s 50% faster than the leading competition on the Android side. When it comes to the GPU, the A15 in the iPhone 13 Pro is even meatier than the A15 Bionic found in the iPhone 13, with a 5-core GPU (rather than 4-core) proving a claimed 50% boost over its nearest rival.",
    "Apple didn’t provide much in the way of direct comparisons with its immediate past, but we do know that the A15 Bionic chip’s new Neural Engine is capable of 15.8 trillion operations per second, which beats the iPhone 12 Pro's A14 Bionic’s 11 trillion operations per second handily.",
    "You get most of the same storage options as before, which equates to 128GB, 256GB, and 512GB. For the first time ever, though, Apple has also launched a mighty 1TB storage option.",
    "Apple also reckons that the iPhone 13 Pro supports more 5G bands than the iPhone 12 Pro. Will that matter to most people? It’s highly doubtful.",
    "We were a little concerned last year when the iPhone 12 Pro rolled out with a 2,815mAh battery, which represented a regression from its predecessor. Thankfully, Apple claims that the iPhone 13 Pro's battery is larger.",
    "We’re not sure how much bigger - Apple doesn’t typically share such figures - but there are rumors that it could be 3,095mAh.",
    "With the inclusion of a 120Hz display, the iPhone 13 Pro arguably needs that extra juice. But we’re still hopeful that it can match or even exceed the iPhone 12 Pro’s stamina.",
    "Apple is claiming that the iPhone 13 Pro gains 1.5 hours of battery life per charge compared to the iPhone 12 Pro. That’s potentially a huge increase.",
    "Last year, we found that we were comfortably getting through the day and managing to hit six hours of screen-on time with the iPhone 12 Pro. So we could be looking at quite the stamina champ in the iPhone 13 Pro.",
    "Apple doesn’t appear to have improved the iPhone 13 Pro’s charging provision at all. We’re still looking at 20W wired, 15W wireless, and absolutely no charging brick bundled in. Just like the iPhone 12 Pro, in other words.",
    "As was widely expected, this is an ‘evolution not revolution’ year for Apple’s iPhone family.",
    "This means that in the iPhone 13 Pro you’re getting a very similar package to the iPhone 12 Pro, but with a healthy speed boost, potentially much improved cameras, superior battery life, and a significantly more fluid display.",
    "That 120Hz refresh rate really is the headline news here, but it also feels like a feature the iPhone 12 Pro should have had a year earlier.",
    "We’ll need to go hands-on to be sure, but the iPhone 13 Pro looks to be a safe upgrade for anyone coming from an iPhone 11 Pro or earlier. iPhone 12 Pro users might want to hold out for another year - or at least until our iPhone 13 Pro review is done.",
    "You might also want to check out the iPhone 12 Pro vs iPhone 11 Pro or iPhone 12 Pro vs iPhone 12 Pro Max comparison."
  ],
  "headers": {
    "3": "iPhone 13 Pro vs iPhone 12 Pro price and availability",
    "8": "Design",
    "14": "Display",
    "20": "Camera",
    "30": "Specs and performance",
    "35": "Battery",
    "41": "Takeaway"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "iPhone 12 Pro vs iPhone 11 Pro": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-11-pro",
    "iPhone 12 Pro vs iPhone 12 Pro Max": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-12-pro-max"
  }
}