{
  "source": "https://www.techradar.com/news/xbox-winter-game-fest-offers-up-a-ton-of-free-indie-game-demos-this-month",
  "title": "Xbox Winter Game Fest offers up a ton of free indie game demos right now",
  "category": "gaming",
  "updated": "2021-12-09T11:33:08Z",
  "author": "rhys-wood",
  "summary": "Xbox celebrates The Game Awards in style",
  "article": [
    "The ID@Xbox Winter Game Fest event is underway, allowing you to download and try out a ton of indie game demos right now. The showcase is being hosted in conjunction with The Game Awards happening on December 9, 2021.",
    "As reported by VGC, a grand total of 36 indie game demos are downloadable from the Xbox Store from now until December 21 when the event wraps up. The games featured include some which have had a good bit of buzz surrounding them over the past few months, including Demon Turf, Death Trash and Aztech Forgotten Gods.",
    "It's worth noting that most of the indie game demos available during the ID@Xbox Winter Game Fest event won't be demos in the traditional sense. Most of which are likely to be 'show floor' demos, akin to a 5-10 minute slice of gameplay you'd find at an in-person venue.",
    "If you want to check out some of these indie games for yourself, we've included the full list below. All you need to do is search for them on the Xbox Store and you'll be able to download the demo from each game's individual store page. The demos will be playable on Xbox Series X/S consoles as well as Xbox One.",
    "It's worth noting that while these indie game demos will be delisted on December 21, they should still be playable on your console after the fact if you've still got them installed. So if there's any you particularly like, you'll be able to keep the demo until the full game releases.",
    "The full list of games demos featured in the ID@Xbox Winter Game Fest event are as follows:"
  ],
  "headers": {},
  "links": {
    "The Game Awards": "https://www.techradar.com/news/game-awards-2021-the-nominees-and-what-we-expect-to-see",
    "VGC": "https://www.videogameschronicle.com/news/xboxs-winter-game-fest-offers-36-free-demos-of-upcoming-indie-games/",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}