{
  "source": "https://www.techradar.com/news/finding-ps5-in-stock-over-christmas-might-be-complicated-heres-why",
  "title": "PS5 stock continues to be affected by these key factors, Sony reveals",
  "category": "gaming",
  "updated": "2021-02-24T15:10:47Z",
  "author": "adam-vjestica",
  "summary": "PS5 stock shortages are set to continue",
  "article": [
    "Finding PS5 in stock isn’t set to get any easier and could even impact Christmas sales, according to Sony Interactive Entertainment’s CEO, Jim Ryan.",
    "In an interview with GQ Magazine, Ryan explained that there are a number of key factors affecting PS5 restock. It isn’t solely down to Covid-19 restrictions or the legions of PS5 scalpers that we should apparently feel sorry for, but global semiconductor shortages are also to blame.",
    "“Obviously in a pandemic supply chains become a little more complicated than would normally be the case,” Ryan said. “You know, one very visible example is the difficulties in the semiconductor market. You know, whether it’s automobiles, smartphones, PCs or games consoles, the problems in all those areas are very widely documented.”",
    "Ryan also shared that Sony’s distribution model has had to change, particularly as consumers are less likely to visit brick-and-mortar stores to purchase a PS5 due to Covid-19 restrictions.",
    "“We had to move to a distribution model that is entirely online and that’s something that we never had to do before,” Ryan explained.",
    "Ryan reiterated that Sony is working “as hard as we possibly can” to meet the extraordinary demand for PlayStation 5, but apologized to those who still haven’t been able to secure the console since its November 12, 2020 release date.",
    "Worryingly, when pressed for a date as to when PS5 supply will improve, Ryan couldn’t commit to anything concrete and hinted that supply issues could affect Christmas sales. Suddenly, that Black Friday and Cyber Monday ‘deal’ on PS5 you were hoping for may just be securing the console at full price.",
    "“We’re doing our best. I was just looking at the supply figures for the UK – we put a considerable amount of product into the UK market last week. And that will continue over weeks and months to come,” Ryan said. “We’re working as we always have, but with renewed vigour and energy post Christmas to get supply up, it will increase as each month passes. And the situation will start to get better hopefully quite quickly. We have been relentless in terms of trying to increase production and I really can’t say any more than that.”",
    "However, Ryan also told the Financial Times (subscription required) that: “The pace of the improvement in the supply chain will gather throughout the course of the year, so by the time we get to the second half of [2021], you’re going to be seeing really decent numbers indeed.” But went on to say, “there are very few magic wands that can be waved” in terms of how quickly the supply issues will be fixed.",
    "Demand for PS5 has helped Sony sell 4.5 million PS5 consoles at the end of December, which Ryan said is “more than we did PS4s in 2013”. The console comes in two variations: a standard PS5 and a PS5 Digital Edition which removes the disc-drive. Despite having two versions of the hardware available, the PS5 has been incredibly hard to find.",
    "We’re continuing to scour the biggest online retailers to provide any stock updates when PS5 consoles do arrive on virtual shelves, in a bid to help you secure Sony’s elusive console. Hopefully, this task will get easier soon, as supply can often sell out in mere seconds of going live thanks to sophisticated bots and incredible demand."
  ],
  "headers": {
    "5": "Sony is ‘very sorry’ you can’t buy PS5",
    "9": "The wait continues"
  },
  "links": {
    "PS5 in stock": "https://www.techradar.com/news/where-to-buy-ps5",
    "an interview": "https://www.gq-magazine.co.uk/culture/article/playstation-vr-jim-ryan-interview-2021",
    "PS5 scalpers that we should apparently feel sorry for": "https://www.techradar.com/news/ps5-scalpers-want-you-to-feel-sorry-for-them-and-yes-theyre-being-serious",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Financial Times": "https://www.ft.com/content/f7c089dc-515e-4387-82fd-ea0a49998650",
    "bots": "https://www.techradar.com/news/ps5-and-xbox-series-x-stock-update-walmart-cracks-down-on-bots-and-scalpers"
  }
}