{
  "source": "https://www.techradar.com/news/the-msi-geforce-rtx-3080-gaming-z-trio-could-mean-youll-finally-get-a-new-gpu",
  "title": "The MSI GeForce RTX 3080 Gaming Z Trio could mean you’ll finally get a new GPU",
  "category": "computing",
  "updated": "2021-03-09T14:31:27Z",
  "author": "hamish-hector",
  "summary": "Or maybe it’s just a paper launch",
  "article": [
    "MSI has quietly announced new models in its custom line of Nvidia GeForce RTX 3080s, introducing the RTX 3080 Gaming Z Trio 10G and the RTX 3080 Gaming Trio Plus 10G. For those looking for an RTX 3080, this launch could be your chance to finally get one.",
    "Both graphics cards look practically identical to the MSI GeForce RTX 3080 Gaming X Trio we’ve seen already, with the only differences being new vent holes and each being 28g - or around 2% - lighter than what’s come before.",
    "In fact, the only difference of note is that the new Gaming Z Trio card comes with a factory boosted overclock speed of 1830MHz - 15MHz, or just under 1% faster than the Gaming X Trio. The Gaming Trio Plus has no such increase over the Gaming Trio.",
    "While the upgrades aren’t significant based on other RTX 3080s, they will be an improvement over older cards so are worth keeping an eye on if you’re in the market. However, with the ongoing chip shortages for GPUs, we hope these graphics cards won’t see MSI spread its supplies too thin and turn this into a paper launch.",
    "According to Urban Dictionary, a paper launch is what happens when a company makes a fantastic product in limited quantities. The product has launched on paper and been discussed in the press, but isn’t actually available in the wild.",
    "In this case, MSI could say the Z Trio is its fastest RTX 3080 to build up hype and brand recognition, but thanks to a global shortage for chips, would only make a handful of them.",
    "We certainly hope this isn’t what’s happening, and that more people will finally hold an RTX 3080 in their hands, but we’ll have to wait a while longer for when the RTX3080 Gaming Z Trio and Trio Plus hit shelves to know for sure.",
    "Via VideoCardz"
  ],
  "headers": {
    "4": "What is a paper launch?"
  },
  "links": {
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "MSI GeForce RTX 3080 Gaming X Trio": "https://www.techradar.com/reviews/msi-rtx-3080-gaming-x-trio",
    "Urban Dictionary": "https://www.urbandictionary.com/define.php?term=paper%20launch",
    "VideoCardz": "https://videocardz.com/newz/msi-launches-geforce-rtx-3080-gaming-z-trio-and-gaming-trio-plus"
  }
}