{
  "source": "https://www.techradar.com/news/could-lgs-rollable-oled-tv-become-a-truly-portable-screen",
  "title": "Could LG's rollable OLED TV become a truly portable screen?",
  "category": "televisions",
  "updated": "2021-09-08T13:52:55Z",
  "author": "henry-st-leger",
  "summary": "One OLED expert thinks so",
  "article": [
    "The LG rollable OLED TV has, since its launch, been an exciting mess of contradictions. The primary one being that, while its innovative unfurling mechanism makes it a great space-saving measure, the high price tag means it’s likely only to feature in the large homes of the wealthy.",
    "Retailing for $99,999 / £99,999 in the US and UK, the rollable OLED is little more than a proof of concept to be enjoyed by a small handful of technology enthusiasts – with the added convenience of its rolling mechanism having to be weighed up with the exponential cost compared to an LG C1 or LG G1 OLED, either of which could be bought 50 times over for the same amount of cash. That’s despite both featuring effectively the same panels and processors as their rollable counterpart.",
    "A rollable OLED TV will only really enter the mainstream when costs reduce sufficiently – though it may be the model’s legacy is in the smaller, more portable devices it inspires rather than simply a cheaper version of the same technology.",
    "That’s what we’re told by Jacky Qiu, VP and Co-Founder of OTI Lumionics – an innovator in next-gen OLED display tech – who spoke exclusively to TechRadar about where the LG rollable OLED TV could go next.",
    "Qiu tells us that “The high cost for the rollable OLED TV is due to reduced yield for the new process required to make the rollable TV,” and while production costs should gradually decrease, and the RRP drop for any hypothetical second iteration, “it is unlikely that you can see a 10x price reduction from $100,000 a unit to $10,000 a unit.”",
    "The great complexity of the production process is a huge factor here, given the challenge of ensuring an ultra-thin 55-inch TV panel can be handled without damages – an issue that plagued early OLED TV production and led various big TV brands to ditch the technology altogether, even if some came back into the fold after LG’s success in the area. That problem is only exacerbated by foldable technologies, as the screen needs to be continually manipulated in and out of a curled up shape without issue.",
    "“The main difficulty,” says Qiu, “is in handling of this glass without any damage throughout the whole process from evaporation in a production line that’s longer than a football field, while also making sure it’s perfectly flat; packaging the piece of glass to prevent moisture from getting in (to a spec equivalent to that only one drop of water can get in over the size of a football field); putting all of the electronics on the panel to make the module; and finally packaging the panel into the rollable form and undergo rigorous testing to ensure mechanical and performance stability over many rolling cycles is not trivial.”",
    "So for anyone hoping to get the OLED R as their next television upgrade, it’s not very likely to happen in the next few years. Qiu also makes the point that “LG Display currently has a monopoly on OLED TV and demand remains very high,” so there’s very little motivation for them to turn their rollable OLED into a mass-market money-spinner, rather than the “aspirational technology demonstrator” it is now.",
    "The main draw of the rollable OLED, or LG Signature Series OLED R, is how the screen can be rolled up into its base station – either hiding the screen entirely or showing a portion of it as a rectangular smart display.",
    "As Qiu says, the current “pilot product” could start to enter the mainstream market if it drops to the $10,000-$20,000 bracket, though it’s unlikely to happen in the near future. But while a rollable OLED 2.0 might still feature an inaccessible price tag, the real legacy of this technology could be in quite a different form factor – one that ditches a glass panel for plastic OLED tech that can be more easily manipulated, and more easily produced at scale.",
    "“Based on our conversations with people in the industry that are knowledgeable about the LG rollable OLED TV,” says Qiu, “a key benefit everyone is touting is the fact that TV can be portable and moved from one room to another. Thus, the key innovation to come would be if the rollable OLED TV can utilize plastic OLED technology to reduce weight of the panel, reduce bending/rolling radius and thus reduce the mechanical component and enclosure weight requirements, allowing for a more resilient (higher yield) and portable device.",
    "“While we have no predictions for 2.0 model at this time, we are incredibly excited about the prospect of a smaller panel, and more resilient rollable OLED TV as the path forward for cost reduction for the rollable OLED TV genre, and we believe a positive market reaction to the current offering would be very helpful to push the technology forward.”",
    "A smaller, lighter television with a more portable base station – say, without the 100W 4.2 channel Atmos speaker system on the current rollable OLED TV – could be far more easily transported between rooms, stuck in a cupboard, even packed into a car boot to take on holiday to a hotel or B&B, if not just over to a friend’s house for a cozy movie night. If the Nintendo Switch showed there was a market for home devices that can also be taken on the go, why couldn’t an LG TV do the same thing?",
    "A cheaper-to-make TV, produced at a larger scale, could also get us close to that $10,000-$20,000 price point – not a budget device by any means, but one that could start finding itself in far more homes and retail spaces.",
    "It’s obviously too early to give any speculation too much weight: LG’s rollable OLED prototype took over two years to go from its first trade show appearance to actually releasing in South Korea, and another year before we saw it in Western markets. Any meaningful iteration is likely a long while off, especially one that disrupts the television industry in the way that a truly portable OLED TV display could.",
    "But for those balking at the high price of LG’s current rollable offering, there may be hope yet for a version of this screen that truly realizes the potential of rollable technology."
  ],
  "headers": {
    "4": "What does LG have to prove?",
    "8": "Merrily we roll along"
  },
  "links": {
    "LG rollable OLED TV": "https://www.techradar.com/reviews/lg-signature-series-oled-tv-r-65r9",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "LG G1 OLED": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "55-inch TV": "https://www.techradar.com/best/55-inch-4k-tv",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "Atmos speaker": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}