{
  "source": "https://www.techradar.com/black-friday/amazon-black-friday-deals",
  "title": "Amazon Black Friday deals 2021: early Black Friday offers now live",
  "category": "televisions",
  "updated": "2021-11-26T16:14:42Z",
  "author": "alice-marshall",
  "summary": "The Amazon Black Friday deals are here across laptops, TVs, speakers, and much more",
  "article": [
    "Well, it's here. You might still be feeling stuffed by all the Thanksgiving turkey, but Black Friday 2021 has arrived and with it a truck load of the best Amazon Black Friday deals. While Amazon and other retailers kicked off their promotions back at the beginning of November, Amazon is sure to have saved its best for the event itself, with a ridiculous amount of money to be saved across a whole range of categories.",
    "Make the most of slashed prices across TVs, AirPods, laptops, vacuum cleaners, toys, air fryers, headphones, and so much more. There's no better time than the Amazon Black Friday sale to finish off your Christmas shopping and ensure your gifts arrive on time for the festive holiday.",
    "Surprising to absolutely no one, some of the best Amazon Black Friday deals are on the retailer's own devices, including up to 50% off its Echo Dot smart speakers. This includes both the 3rd Gen and the first price drop we've seen on the new 4th Gen spherical iteration. Similar big savings are there to be had on the Fire Stick, with 40% shaved off its usual cost.",
    "Going in and out of stock, savvy shoppers can also pick up Apple's premium true wireless, the AirPods Pro with a new Magsafe wireless charging case for $189.99 - their lowest ever price.",
    "For our picks of the best deals, why not check out our Amazon Black Friday deals live blog, or keep scrolling - and make sure you bookmark this page to ensure you get all the up-to-date news on the best Amazon Black Friday deals as they arrive.",
    "Because the deals kick off a week ahead of time, you really won't have to worry too much about the official Black Friday start time on Amazon. That said, new deals start at 12:01 AM PST, so that's the best time to look for new deals to pop up.",
    "If you can't check for deals every day of the week for Amazon's Black Friday sale, we definitely recommend stopping by from 12:01 AM Friday November 26 until the end of the day. That should be when we see the best deals happening.",
    "See more offers with our roundup of the best deals from the Walmart Black Friday and Best Buy Black Friday sale events."
  ],
  "headers": {
    "5": "Amazon Black Friday hours"
  },
  "links": {
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "up to 50% off its Echo Dot": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FEcho-Dot%2Fdp%2FB07FZ8S74R%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8734647765869412000-20",
    "first price drop we've seen on the new 4th Gen spherical iteration": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAll-New-Echo-4th-Gen%2Fdp%2FB07XKF5RM3%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7974215992544596000-20",
    "big savings are there to be had on the Fire Stick": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Ffire-tv-stick-with-3rd-gen-alexa-voice-remote%2Fdp%2FB08C1W5N87%3Fref%3Ddlx_early_gd_dcl_img_9_8e3adf40_dt_sl7_22%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1266297149365597700-20",
    "AirPods Pro with a new Magsafe wireless charging case for $189.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MWP22AM-A-AirPods-Pro%2Fdp%2FB07ZPC9QD4%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1406262092981681400-20",
    "check out our Amazon Black Friday deals live blog": "https://www.techradar.com/black-friday/amazon-black-friday-deals",
    "Walmart Black Friday": "https://www.techradar.com/news/live/walmart-black-friday-deals-launch-today-and-were-live-updating-all-the-top-sales",
    "Best Buy Black Friday": "https://www.techradar.com/black-friday/best-buy-black-friday-deals"
  }
}