{
  "source": "https://www.techradar.com/news/the-first-8k-ps5-game-is-here-but-sony-only-lets-you-see-it-at-4k",
  "title": "The first 8K PS5 game is here – but Sony only lets you see it at 4K",
  "category": "gaming",
  "updated": "2021-09-30T16:41:22Z",
  "author": "hamish-hector",
  "summary": "The Touryst is the first PS5 game to run at 8K / 60fps",
  "article": [
    "Yes, you read that headline correctly, the very first PS5 game to run in 8K at 60fps has recently landed on the console. However, you won’t actually be able to see it running in all that 7680 x 4320 gloriousness.",
    "The game in question is called The Touryst - an action-adventure puzzle game developed and published by Shin'en Multimedia. It was first released on the Nintendo Switch almost two years ago to fairly decent reviews but has now shot back into the limelight thanks to its impressive technical achievement on PlayStation hardware.",
    "What makes The Touryst’s feat even more astounding is that it doesn’t have to rely on any technical trickery to artificially boost its performance. There’s no temporal supersampling, no AI upscaling, and no checkerboarding just pure honest 8K at 60fps.",
    "We’ve already mentioned there's a catch though. While the game will be being processed at 8k on the PS5 hardware Sony’s firmware currently downscales the image when it outputs it to your display. The PS5 has the HDMI 2.1 hardware needed to output 8K / 60fps video but, for now, Sony seems to be locking that feature off.",
    "For a lot of people, this technical triumph will probably net little more than a ‘Cool, so what?’ reaction, but there are quite a few reasons to care even if you don’t own an 8K capable device right now.",
    "For one, PS5 owners can finally see the true power of their console in action. It’s one thing for Sony to claim its console can achieve 8k / 60fps in optimal test conditions, it’s another to see the PS5 actually doing so with a real game you can play today.",
    "While we wouldn’t expect God of War Ragnarok or Horizon Forbidden West to launch with the same capabilities as The Touryst, after a few years of fine-tuning and when developers better understand the console’s hardware there’s now a glimmer of a chance we could see a AAA game run at 8K / 60fps before this generation is done.",
    "That’s an impressive prospect especially when you think that even the PS4 Pro and Xbox One X (souped-up rereleases of last-gen’s consoles) had to pull out a few software tricks to get select titles up to 4k / 60 fps.",
    "Even if you’re still stuck with a 4K or an HD TV, better-rendered games can still improve your image quality. You won’t get the full 8K effect but your downscaled image will look slightly better than one rendered natively at 4K or that was upscaled by AI.",
    "Hopefully, Sony will update the PS5 firmware soon so we can properly experience 8K gaming for ourselves."
  ],
  "headers": {
    "4": "Analysis: is 8K on PS5 that big a deal?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "The Touryst": "https://www.techradar.com/news/the-touryst-is-the-dark-horse-of-the-xbox-series-x-launch-games-lineup",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "God of War Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x"
  }
}