{
  "source": "https://www.techradar.com/news/apple-macbook-airs-rumored-upgrades-could-take-the-worlds-best-laptop-to-another-level",
  "title": "Apple MacBook Air’s rumored upgrades could take the world’s best laptop to another level",
  "category": "computing",
  "updated": "2021-07-23T10:42:56Z",
  "author": "matt-hanson",
  "summary": "Mini LED display apparently coming",
  "article": [
    "It looks like the best laptop in the world, the MacBook Air, will be getting a major upgrade in 2022, with Apple reportedly planning to include a Mini LED display with its thin and light device.",
    "The latest rumor comes via Ming-Chi Kuo, an Apple analyst that has given us some good early insights into what the Cupertino company is planning.",
    "Kuo has previously claimed that Mini LED will be coming to MacBook Airs in 2022, and a Digitimes report earlier this year also suggested that Apple is bringing Mini LED to more of its products, which strengthens these rumors.",
    "So, what is Mini LED? Essentially, it’s a display technology that shrinks down the LED modules in LCD screens. This allows for much brighter, more vibrant, images, and it will also allow for much darker blacks.",
    "This boost in contrast allows for Mini LED displays to come close to the quality of OLED screens – but without the burn-in issues that OLED can suffer from (where a faint image is left on the screen).",
    "While Mini LED is increasingly being used in TVs, Apple has already introduced it, with great success, to the new iPad Pro 12.9 (2021), and the tablet really benefitted from the new tech. To have it come to MacBooks as well is a really exciting proposition.",
    "The rumors surrounding a potential MacBook Air 2022 model are picking up steam, and if even half of them are true, it could result in a seriously impressive bit of kit.",
    "The MacBook Air (M1, 2020) is currently sitting at the top of our best laptops list for a good reason – it offers excellent performance, battery life and value. But the 2022 model could be even better.",
    "Not only would a stunning Mini LED screen set the MacBook Air apart from many of its rivals, there are rumors that there will be a bigger redesign of the overall look of the laptop, including slimmer bezels around the screen. As much as we love the MacBook Air (M1, 2020), one of our biggest complaints about it is that the design is feeling a little outdated these days.",
    "As the new iMac (24-inch, 2021) shows, Apple doesn’t seem afraid to drastically redesign some of its iconic products, so a new-look MacBook Air certainly could be on the cards.",
    "We also expect it to be powered by a more powerful follow-up to the M1 chip (possibly the M2). That power boost, combined with a modern new look and Mini LED screen could easily make the best laptop in the world even better. We can’t wait.",
    "Via MacRumors"
  ],
  "headers": {
    "3": "What’s Mini LED?",
    "6": "Analysis: Why this matters"
  },
  "links": {
    "best laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "Digitimes report earlier this year": "https://www.digitimes.com/news/a20210107PD207.html",
    "what is Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "iPad Pro 12.9 (2021)": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "MacBook Air (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "iMac (24-inch, 2021)": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "MacRumors": "https://www.macrumors.com/2021/07/22/mini-led-macbook-air-mid-2022/"
  }
}