{
  "source": "https://www.techradar.com/news/apple-pencil-could-banish-touch-bar-if-new-macbook-patent-comes-to-pass",
  "title": "Apple Pencil could banish Touch Bar if new MacBook patent comes to pass",
  "category": "computing",
  "updated": "2021-08-18T09:36:13Z",
  "author": "rhys-wood",
  "summary": "A MacBook shake-up could happen soon",
  "article": [
    "A recently published patent from Apple hints that future MacBook models could swap the Touch Bar for Apple Pencil support. If the company were to go ahead with the plans shown in the patent, it would be quite a shake-up for future MacBooks, given Apple’s prominent use of the Touch Bar over the past few years.",
    "The patent, filed with the US Patent & Trademark Office and spotted by Patently Apple, pertains to a potential MacBook design that features a slot for the Apple Pencil where the Touch Bar would otherwise be. While inserted in this retainer slot, the Apple Pencil can act as a mouse or display function keys thanks to the retainer’s built-in lighting system.",
    "In the patent images, we can also see a demonstration of the Apple Pencil situated on the sides and bottom of the MacBook, perhaps attached to it magnetically. This doesn’t tell us much, admittedly, but we can glean that the Apple Pencil will be removable and likely retain its usual feature set, such as being used as a stylus.",
    "It’s important to note that these Apple Pencil plans for a future MacBook design here are only in the patent stage for now. Therefore, there’s no guarantee that Apple will see the design to fruition. However, the real question is what can the Apple Pencil achieve that the more traditional Touch Bar can’t?",
    "Let's say Apple sees the design through, and you’ve got yourself a MacBook with an Apple Pencil and expanded functionality via the electronic retainer slot. One big aspect would be versatility, as the patent shows that the Apple Pencil can offer function keys as well as allowing you to adjust options like volume and brightness, or even use the accessory as a scroll wheel.",
    "One other nice thing that could be easily overlooked? You’re likely getting a free Apple Pencil with your MacBook. That’s great because the device also acts like a stylus, meaning it can be used to interact with touch screens such as on your iPhone or iPad. Budding artists can also use the Apple Pencil as a means to start drawing more complex pictures, no longer having to use their fingers to get the job done.",
    "We won’t be so quick to discount the usefulness of the Touch Bar, though. This nifty MacBook addition offers tailored options based on the software you’re using, such as offering editing controls in Final Cut Pro, or even touching up images in Photoshop. We’re not entirely sure the lack of visual feedback on an Apple Pencil alternative could offer such robust features.",
    "We also have to wonder how the inclusion of an Apple Pencil would factor into the cost of the prospective future MacBook shown in the patent. The second-generation Apple Pencil retails at $119 / £119 / AU$189, which we imagine would be rolled into the cost of the MacBook. The interactive lighting technology in the device’s retainer slot could also push the price of the MacBook up.",
    "Regardless, we’re certainly interested to see what Apple ultimately does with the patent. Once again, we must stress that a patent’s details aren’t a guarantee for a future model. But it is nice to see Apple at least considering other options for potential MacBook buyers."
  ],
  "headers": {
    "3": "Analysis: what is Apple thinking?"
  },
  "links": {
    "MacBook": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Apple Pencil": "https://www.techradar.com/news/mobile-computing/tablets/apple-pencil-everything-business-users-need-to-know-1304017",
    "Patently Apple": "https://www.patentlyapple.com/patently-apple/2021/08/apple-invents-a-macbook-that-integrates-an-apple-pencil-that-provides-mouse-and-f-key-functionality.html"
  }
}