{
  "source": "https://www.techradar.com/news/how-to-watch-the-wire-online",
  "title": "How to watch The Wire online: stream every season of the HBO classic from anywhere",
  "category": "entertainment",
  "updated": "2021-03-03T16:34:40Z",
  "author": "james-laird",
  "summary": "Crime drama arguably the best TV show ever made",
  "article": [
    "With apologies to Game of Thrones devotees and with all due respect to Breaking Bad, the debate over what's the best TV show ever pretty much boils down to The Wire vs The Sopranos - and many people would argue in favor of David Simon's Baltimore-based crime epic. Follow our guide as we explain how to watch The Wire online and stream all five seasons of the seminal HBO drama wherever you are.",
    "Inspired by former Baltimore Sun reporter Simon's 1991 book Homicide: A Year on the Killing Streets, The Wire broadly focuses on a police unit's attempts to combat the city's heroin trade through surveillance. But that doesn't even begin to do it justice.",
    "With each season zeroing in on a different Baltimore institution - its drug gangs, working class seaport system, government, schools and media all going under the microscope - the show doesn't so much tear up the typical good guys vs bad guys cop show script as take a chainsaw to it.",
    "Politicians and police leaders are shown to be just as responsible for the city's decline as the kids slinging dope in the projects and the organized crime outfits supplying them, making for an unflinching expose of 21st century urban America.",
    "Simon's first-hand experience gives the show an unparalleled authenticity in this regard, while The Wire also stands out for its superb casting. It made Hollywood stars of two hitherto little known British actors, Dominic West and Idris Elba; introduced us to Michael B. Jordan; and gave the world a new cult hero in Michael K. Williams.",
    "Produced and aired by HBO, that makes HBO Max the most obvious place to watch The Wire online - but there are loads of ways to stream The Wire wherever you are in the world. Read on for all the best."
  ],
  "headers": {
    "6": "How to watch The Wire: stream every season online in Australia"
  },
  "links": {}
}