{
  "source": "https://www.techradar.com/news/microsoft-is-launching-a-whole-new-version-of-teams",
  "title": "This all-new version of Microsoft Teams will take over your working life",
  "category": "computing",
  "updated": "2021-12-01T20:47:55Z",
  "author": "anthony-spadafora",
  "summary": "New stand-alone version of Microsoft Teams specifically targets SMBs",
  "article": [
    "Small businesses will now be able to utilise video conferencing software and online collaboration tool much easier with the launch of the first ever stand-alone version of Microsoft Teams.",
    "Available now, Teams Essentials provides small businesses with an affordable meeting solution that is ideal for hybrid work environments. At just $4 per user per month, the software giant's new offering is one of the most competitively priced video conferencing and collaboration solutions on the market today.",
    "“We know how difficult the past 20 months have been for small businesses,\" noted Microsoft's corporate vice president of Modern Work, Jared Spataro. \"They’ve had to demonstrate extreme flexibility to adapt, often with limited access to tools and technology. Teams Essentials is built specifically to meet the unique needs of small businesses, enabling them to thrive in this new era of work.”",
    "SMBs that sign up for Teams Essentials will be able to hold unlimited group meetings for up to 30 hours and meetings with up to 300 people but they'll also get access to 10GB of cloud storage per user.",
    "Teams Essentials also includes all of the existing and upcoming capabilities available in the free version of Teams such as easy invitations that only require an email address, Outlook Calendar and Google Calendar integration, virtual backgrounds, Together mode, always-available chats, polls and more.",
    "Small businesses interested in purchasing Teams Essentials subscriptions for their employees can do so directly through the Teams website or from a variety of Microsoft Cloud Partners including ALSO, Crayon, Ingram, Pax8, Rhipe, TD Synnex, Telefonica (ES), Deutsche Telekom, Vodafone (IT) and Wortmann AG.",
    "While Teams Essentials makes sense for small businesses that want to continue using their existing office software, for just $1 more at $5 per user per month, they can sign up for Microsoft 365 Business Basic which also includes access to the web and mobile versions of Microsoft's Office apps, 1TB of cloud storage per user, business-class email, Teams meetings recordings with transcripts and more.",
    "Looking to improve your video calls? Check out our roundups of the best video conferencing software, best business webcams and best headsets for conference calls"
  ],
  "headers": {
    "3": "Microsoft Teams Essentials"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "online collaboration tool": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Teams Essentials": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1246113335626903000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-teams%2Fcompare-microsoft-teams-options%3Factivetab%3Dpivot%3Aprimaryr1",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Outlook Calendar": "https://www.techradar.com/reviews/outlook-calendar",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "polls": "https://www.techradar.com/best/best-qanda-and-polling-platforms",
    "office software": "https://www.techradar.com/best/free-office-software",
    "Microsoft 365 Business Basic": "https://www.techradar.com/news/buy-microsoft-office-prices",
    "best video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "best business webcams": "https://www.techradar.com/best/best-business-webcams",
    "best headsets for conference calls": "https://www.techradar.com/news/best-business-headphones-and-earphones"
  }
}