{
  "source": "https://www.techradar.com/news/apple-homepod-mini-is-getting-a-big-upgrade-but-wheres-spatial-audio",
  "title": "Apple HomePod mini is getting a big upgrade – but where's Spatial Audio?",
  "category": "audio-visual",
  "updated": "2021-09-16T09:03:57Z",
  "author": "olivia-tambini",
  "summary": "The HomePod mini still won't have Dolby Atmos support",
  "article": [
    "The Apple HomePod mini is among the best smart speakers you can buy today, thanks to its incredible sound, compact design, and great price – and now, Apple has confirmed some of the upgrades that are coming to the wireless speaker with the launch of Software version 15 on September 20.",
    "According to 9to5Mac, you'll be able to select a single or pair of HomePod minis as the default speakers for your Apple TV 4K – so you won't have to specify them every time you sit down to watch a TV show.",
    "If you're worried about disturbing your neighbors during late night movie sessions, you'll be able to turn the bass down on your HomePod mini, too.",
    "When a HomePod mini is playing music nearby, you'll also see media playback controls appear automatically on your iPhone's lock screen, making it easier to adjust your music quickly.",
    "Siri, the voice assistant built into the smart speaker, is getting some new skills, too. You'll be able to ask Siri to turn on your Apple TV, start playing a movie, and control the playback as you watch.",
    "The voice assistant will also adjust its speaking level based on the room you're in and how loudly you're speaking.",
    "Smart home support is getting more comprehensive with the new software version, with Siri gaining the ability to control smart home devices at a specific time; for example, you could ask it to turn off your smart lights in 10 minutes as you head to bed. You'll also be able to enable Siri on compatible HomeKit accessories around your home, so you won't actually need to be near to your HomePod mini to activate the voice assistant – and Siri will even tell you if your HomeKit Secure Video doorbell or security camera detects a package outside your door.",
    "Those new features all sound very promising – but the one thing we were really excited for hasn't been mentioned by Apple.",
    "We're talking about Lossless and Spatial Audio support via Apple Music on the HomePod Mini, both of which were tested in the beta version of the new software.",
    "The Lossless tier of Apple Music brings hi-res audio to the streaming service. Starting at CD quality (16 bit / 44.1kHz), it goes up to 24 but / 48 kHz, and can be played natively on Apple devices. And, for audiophiles, there's Hi-Resolution Lossless, which increases all the way up to 24 bit / 192kHz.",
    "Spatial Audio takes 5.1, 7.1, and Dolby Atmos content and applies directional audio filters, placing sound in a 3D sphere – making it feel as though your music is coming at you from every angle for an immersive listening experience.",
    "Previously, you were only able to experience Dolby Atmos on HomePod speakers connected to an Apple TV – and lossless audio wasn't ever really expected to land on the compact wireless speaker, as Apple had previously said it wouldn't be supported by the HomePod mini.",
    "9to5Mac says that Apple still promises these features will be supported this year, but there's no indication of when that might be – in any case, we'll have to wait for another software update or patch for the technology to reach our homes."
  ],
  "headers": {
    "7": "Analysis: the biggest upgrade is still missing"
  },
  "links": {
    "Apple HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "best smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "9to5Mac": "https://9to5mac.com/2021/09/15/everything-new-homepod-software-version-15/",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k/reviews/apple-tv-4k-2021",
    "HomeKit Secure Video": "https://www.techradar.com/news/homekit-secure-video-explained-apples-plan-to-keep-your-security-cam-vids-safe",
    "security camera": "https://www.techradar.com/news/best-home-security-camera",
    "Lossless and Spatial Audio": "https://www.techradar.com/how-to/apple-music-spatial-audio-and-lossless-guide-heres-how-to-turn-them-on",
    "beta version of the new software": "https://www.techradar.com/news/dont-upgrade-your-apple-homepod-with-the-new-beta-software",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066"
  }
}