{
  "source": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-12-pro-max",
  "title": "iPhone 12 Pro vs iPhone 12 Pro Max: what's different between Apple’s best phones?",
  "category": "phones",
  "updated": "2021-12-03T12:24:21Z",
  "author": "jon-mundy",
  "summary": "Battle of the iPhone 12 Pro models",
  "article": [
    "After several years of incremental updates, the sharp-edged iPhone 12 family has successfully cut through our smartphone apathy with a bold new outlook and a whole new range of upgraded specs such as better internals and 5G connectivity",
    "Right at the top of this roster sits the iPhone 12 Pro Max and the iPhone 12 Pro, two lean and speedy apex predators ready to pounce on their rotund rivals. How do these phones differ? You may be surprised to learn it isn't just the size of the handsets, as there are some other differences to look out for.",
    "So what is different, and how do they square up to one another? Which is more worthy of the ‘Pro’ title? And, most importantly, which is the better phone? Here we're going to take a look so you can make the right decision between the iPhone 12 Pro and its even higher spec (and therefore more expensive) Pro Max sibling.",
    "The 128GB iPhone 12 Pro hit shops on October 23, 2020, with prices starting from $999 / £999 / AU$1,699 for the 128GB model. If you want 256GB, you’ll need to stump up $1,099 / £1,099 / AU$1,899, while a range-topping 512GB model costs $1,299 / £1,299 / AU$2,219.",
    "There was a slight delay in the iPhone 12 Pro Max hitting shops, courtesy of the COVID–19 outbreak hitting supply chains hard. It finally landed on November 13, 2020 at a cost of $1,099 / £1,099 / AU$1,849 for 128GB of storage, rising to $1,199 / £1,199 / AU$2,019 for 256GB, and $1,399 / £1,399 / AU$2,369 for 512GB.",
    "The above prices are those stated on Apple’s own official store, but you can sometimes find savings from third-party retailers. That said, these are typically minor. Apple gear holds its value, and we're unlikely to see a big drop until the iPhone 13 family debuts later in 2021. We're expecting that in September though, so you shouldn't have to wait too much longer.",
    "Apple really reset the design clock with the iPhone 12 family. A new angular approach stands in stark contrast to the rounded, softened efforts of the past six years.",
    "Both the iPhone 12 Pro and the iPhone 12 Pro Max are just 7.4mm thick, and sport dead-flat surfaces on all four edges. Only the tightly rounded corners betray any hint of curvature, much as they did with the iPhone 4 and iPhone 5 years prior.",
    "If you didn’t have anything to provide a sense of scale, you’d find these two young Pros to be identical. Both are available in the same range of four finishes – Silver, Graphite, Gold, and Pacific Blue – and each comes with the same shiny fingerprint-attracting stainless steel rim.",
    "Both phones are similarly tough, too, with a front-mounted Ceramic Shield supposedly providing four times the drop-protection of regular display glass. That said, we found quite early in our testing that both phones were still susceptible to picking up small nicks and scratches, just like any other phone.",
    "An enhanced IP68 rating, meanwhile, enables both phones to remain immersed in six meters of water for up to 30 minutes.",
    "The only significant external difference between these two phones is size. As befits its name, the iPhone 12 Pro Max is much bigger than the iPhone 12 Pro: 14mm taller, 7mm wider, and 39g heavier.",
    "Add in a larger camera module (which we’ll talk about later), and the iPhone 12 Pro Max is much less wieldy than the iPhone 12 Pro. You need to really want a large phone before you commit to buying one, since it isn’t the sort of device that will easily slip into a jeans pocket or tiny handbag.",
    "One other slight external difference is the relative visual impact of that display notch. The sheer fact that the iPhone 12 Pro Max has a much bigger screen means that Apple’s Face ID-enabling bar feels much less intrusive on the larger phone.",
    "The reason the iPhone 12 Pro Max is so big, of course, is that it has a whopping 6.7-inch screen, dwarfing the iPhone 12 Pro’s 6.1-inch alternative.",
    "Size aside, though, these displays are remarkably similar. We’re looking at a pair of Super Retina XDR OLEDs, with roughly the same 460ppi(ish) pixel density, the same HDR10 credentials, and the exact same brightness specifications (800 nits typical, 1200 nits peak).",
    "They’re stunning screens, capable of outputting bold yet accurate colors and deep blacks. But they also share the same glaring flaw – the lack of a fast refresh rate.",
    "Neither screen can accelerate beyond 60Hz, just like their predecessors. With their Android rivals hitting 90Hz or even 120Hz as a matter of course, this is a bit of an oversight.",
    "Especially when Apple set the standard for Pro-themed 120Hz display technology with ProMotion, which made its debut in the 2017 iPad Pro. It should really have made its way into these two Pro phones, too, maybe as a point of difference to the iPhone 12 and iPhone 12 mini.",
    "Besides this downer, we found both screens to be among the best out there at rendering images and video.",
    "So far so similar, but we’ve now reached one of the key differences between the iPhone 12 Pro Max and the iPhone 12 Pro – at least on paper.",
    "While both phones have a trio of 12MP sensors covering wide, ultrawide, and telephoto angles, and a LiDAR sensor to improve low-light autofocus, there are a couple of key differences.",
    "First and foremost among these is a 47% larger image sensor for the main wide camera on the iPhone 12 Pro Max. This explains the reason the Max’s camera module is noticeably bigger, but it also has the simple benefit of letting in way more light than its little sibling.",
    "As a result, the iPhone 12 Pro Max is the low-light king, even in an iPhone 12 range packing a uniformly brilliant Night mode. The larger phone’s telephoto lens also goes to a longer 2.5x, compared to the iPhone 12 Pro’s 2x, although both succeed in getting closer to the wide sensor in tone and quality than before.",
    "These hardware differences aside, we were surprised by the similarities in the quality of most shots between the two. This suggests that much of Apple’s photographic special sauce lies with its computational algorithms and its image processing – which are, of course, identical on both phones.",
    "To that end, both phones have access to advanced Apple features such as Smart HDR 3 and Deep Fusion, which smartly select and combine exposures for more crisp, contrasty shots. Both also get to utilize the new ProRAW standard, which combines the data-packed raw format with the auto-adjusting computational improvements of JPEG.",
    "Both phones have the notable ability to shoot Night mode shots across all four cameras – selfie cam included. That’s pretty darned impressive.",
    "And on the video front, both Pros get to shoot Dolby Vision-enhanced video at 4K and 60fps, something their non-Pro brothers can’t quite stretch to.",
    "In short, then, the iPhone 12 Pro Max has the better camera of the two, but the difference isn’t as marked as we’d expected.",
    "iPhones have become so fast that there’s almost no point to talking about Apple’s year-on-year improvements. Both the iPhone 12 Pro and the iPhone 12 Pro Max are way faster than their Android rivals, and a healthy 20% faster than the previous year’s Apple models.",
    "When pitched against one another, however, there’s virtually no difference to speak of. Both phones pack Apple’s A14 Bionic chipset and 6GB of RAM, and are nigh-on identical in both benchmarks and our real-world experience",
    "There isn’t a 3D game on the App Store that can make either handset break a sweat, with the same true for intensive tasks such as multitasking and photo editing. These phones are as fast as it gets right now, and probably will be until the iPhone 13 Pro and iPhone 13 Pro Max hit the market in late 2021.",
    "We’re happy to see that Apple has finally upped its storage game with the two Pro models. Both now feature 128GB as standard, rather than the paltry 64GB of prior Pros. This can be upped to 256GB or 512GB at the checkout – at a steep price, of course.",
    "Apple’s big selling point for the entire iPhone 12 range is 5G. Both the iPhone 12 Pro and the iPhone 12 Pro Max offer the ability to connect to the next-gen network, where available, but coverage is still very patchy at the time of writing.",
    "We’d love to get more excited about 5G, but it’s still something for the future for the majority of people. It’s a good feature to have in the bank for when network operators get into a 5G rollout groove, though.",
    "The iPhone 12 Pro Max’s larger chassis has enabled Apple to include a huge battery – by Apple standards, at least. At 3,687mAh, the Max cell dwarfs its 2,815mAh brother.",
    "It’s a little disappointing to realize that Apple has actually shrunken both batteries compared to their direct predecessors. That’s by more than 200mAh for the 12 Pro, and by almost 300mAh in the case of the Max.",
    "When it comes to direct comparisons, though, the iPhone 12 Pro Max battery wins out comfortably, despite having to drive that larger display. It’s the longest-lasting member of the iPhone 12 range, and is the only phone of the four that will last through a full day of intensive use away from a Wi-Fi hotspot.",
    "Use of 5G will inevitably see your battery level drop more dramatically, but as we’ve already discussed, this won’t be an issue for most people right now.",
    "Apple has put its old MagSafe branding to a new magnetized accessory standard that benefits both phones. You can clip a wireless charger to the back of the phone, which works similarly to a Qi wireless charger, but is more secure.",
    "Unfortunately, this MagSafe charger isn’t bundled into either box. Nor is any kind of charging plug, for that matter. All you get with both Pros is a USB-C-to-Lightning cable. If you want to take advantage of Apple’s new 20W fast charging, then you’ll need to spend $19/£19/AU$29 on the appropriate accessory.",
    "The iPhone 12 Pro and the iPhone 12 Pro Max are cut from the same cloth. It’s just that the latter uses a larger outline.",
    "If you’re a fan of larger phones, the Max is the obvious choice. But if portability and one-handed use are more of a priority, then the Pro is the better pick. That’s the simplified conclusion that can be drawn from our comparison, but there are a couple of added points of nuance that tilt the scales a little.",
    "Despite the similarities, the iPhone 12 Pro Max is the better phone overall. It comes with a superior camera that captures brighter, sharper low-light shots, and it also benefits from significantly longer battery life.",
    "Committed photography buffs and power users should seriously consider the Max. It’s quite simply the best of the best, while the iPhone 12 Pro has much of its thunder stolen by the cheaper iPhone 12.",
    "You might also want to check iPhone 12 Pro vs iPhone 11 Pro."
  ],
  "headers": {
    "3": "iPhone 12 Pro vs iPhone 12 Pro Max price and availability",
    "6": "Design",
    "14": "Display",
    "20": "Camera",
    "29": "Specs and performance",
    "35": "Battery life",
    "41": "Takeaway"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 4": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-4-694980/review",
    "iPhone 5": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-5-1096004/review",
    "2017 iPad Pro": "https://www.techradar.com/reviews/ipad-pro-105",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "LiDAR sensor": "https://www.techradar.com/news/what-is-a-lidar-scanner-the-iphone-12-pros-rumored-camera-upgrade-anyway",
    "ProRAW": "https://www.techradar.com/news/what-is-apple-proraw-the-new-photo-format-coming-to-iphone-12-pro-explained",
    "MagSafe charger": "https://www.techradar.com/best/best-magsafe-accessories",
    "iPhone 12 Pro vs iPhone 11 Pro": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-11-pro"
  }
}