{
  "source": "https://www.techradar.com/news/best-wearables-of-ces-2021",
  "title": "Best wearables of CES 2021: Fossil, Amazfit, Honor and more",
  "category": "wearables",
  "updated": "2021-01-13T15:00:50Z",
  "author": "david-nield",
  "summary": "Check out some of the top tech from CES 2021",
  "article": [
    "CES 2021 has been a mostly virtual rather than a physical event, but it's still been a packed show – and in among the flood of new technology we've seen there have been some notable new wearables that are worth reviewing.",
    "These are our favorite wearables of the CES 2021 show, the devices that we think are good enough to earn a place on your wrist over the coming months – and there are some big names here too, including Fossil, Amazfit and OnePlus.",
    "Fossil is well known for making some of the best Wear OS smartwatches in the business, and now it has one that can make and receive calls all on its own, no connected phone required. It's not much of an upgrade over the standard Fossil Gen 5, but it might be enough of an upgrade to make it worth your while. Like previous Fossil smartwatches, the Gen 5 LTE really looks the part and offers plenty of style.",
    "The internal specs of a Qualcomm Snapdragon 3100 chipset, 1GB of RAM and 8GB of storage are solid rather than spectacular, but it's also fair to say they're just about the best you can get inside a Google-powered watch at the moment. As you would expect from Wear OS, you get first-class integration with Android, and the wearable will also work with iOS at a push. Google Assistant is of course front and center too.",
    "For the time being the smartwatch is only available in the US, and only on Verizon in terms of its LTE connectivity, but we're waiting on news of wider availability. The starting price in the US is $349, which works out at about £255 / AU$450. If you're sure that Wear OS is for you, and you want as much freedom as possible away from a smartphone, it's definitely worth a look.",
    "Amazfit has made quite a name for itself in the budget wearables space, and the GTS 2e and GTR 2e smartwatches look set to continue the company's trend of producing good quality, affordable devices that don't skimp on features. With stress level, heart rate and sleep quality monitoring on board, as well as all the usual activity tracking capabilities, they're great all-around fitness devices.",
    "One of the key improvements over the Amazfit GTS 2 and Amazfit GTR 2 is extended battery life, with both of these new devices able to go for up to 45 days between charging (as long as you're doing relatively little with them). There's also blood-oxygen saturation measurement, the advanced metric that enables you to keep tabs on changes in your SpO2 levels to better understand how hard your body is working during exercise.",
    "The main difference between the smartwatches is in the design, and we like the aesthetics of both of them: the GTS 2e has a square 1.65-inch display, while the GTR 2e has a circular 1.39-inch screen on the front. Amazfit's own software is on board, which works with both Android and iOS, and both go for $139.99 in the US. The GTS 2e is confirmed in the UK at £119, though no news yet on a UK release for the GTR 2e, or on whether or not these devices will make it to Australia.",
    "Hybrid smartwatches are ideal if you want a classic timepiece look with a small dash of smartness, and the Skagen Jorn HR is a perfect example of the form. In appearance you could mistake it for a normal watch, yet it packs in a heart rate monitor, workout tracking, sleep tracking, phone alerts, music controls, custom watch faces and more besides.",
    "Those custom watch faces are made possible by a E-ink display, and the wearable is available in both 38mm and 42mm case sizes. There's no GPS included, but the Skagen Jorn HR is waterproof, so you don't need to worry about getting caught out in the rain. The watch runs customized software, and works with Android and iOS.",
    "One of the benefits of that E Ink screen (and the lack of GPS) is a longer battery life – the Skagen Jorn HR can go for two weeks between charges, according to the manufacturer. An on sale date is yet to be announced, but we know the pricing is going to be $195 / £189 (around AU$250, with availability in Australia yet to be confirmed).",
    "It's not always easy to tell where smartwatches end and fitness trackers begin, especially when there's a device like the Honor Band 6 on the market: it's lightweight and compact enough to be a fitness tracker, and yet it has a color screen that tells the time. It could also be exactly the sort of wearable you're looking for.",
    "With a 1.47-inch AMOLED display, a variety of tracking sensors (including ones for monitoring heart rate, blood oxygen and sleep), media playback controls for your smartphone, weather forecasting and more, it's a device that doesn't hold back on the feature set. It also offers two weeks of battery life between charges, which is good to see.",
    "This being Honor, the price is very appealing too – we're awaiting confirmation of international pricing, but the Honor Band 5 sold for $36.99 / £29.99 (roughly AU$50), so expect something in that kind of area. Expect the band to be available in a selection of punchy colors too.",
    "Our final wearable is, unfortunately, not yet available outside of India, but we're hoping for an international launch soon. It's certainly a notable new device – the first wearable from phone maker OnePlus, and something to keep us busy while we wait for the long-promised OnePlus Watch.",
    "While technically not revealed as part of CES 2021, we wanted to include it here as it was unveiled in India at a similar time to when the big virtual Vegas show was going on.",
    "While the OnePlus Band doesn't offer a huge amount in terms of innovation or advanced features, it wraps all the basics up in a stylish and affordable design, which is fine by us. A total of 13 different activities can be tracked by the little device, and it can keep tabs on your heart rate and blood oxygen levels too, as well as displaying notifications from a connected smartphone.",
    "It's topped off with a small 1.1-inch AMOLED screen for displaying all your key stats. As we've said, we're still waiting to hear if the OnePlus Band is going to make it out to the rest of the world, but in India it's retailing for Rs 2,499 – that works out at a very reasonable $35 / £25 / AU$45."
  ],
  "headers": {
    "2": "1. Fossil Gen 5 LTE",
    "5": "2. Amazfit GTS 2e / GTR 2e",
    "8": "3. Skagen Jorn HR",
    "11": "4. Honor Band 6",
    "14": "Wildcard: OnePlus Band"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Wear OS smartwatches": "https://www.techradar.com/news/best-wear-os-watch",
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
    "Amazfit GTS 2": "https://www.techradar.com/reviews/amazfit-gts-2",
    "Amazfit GTR 2": "https://www.techradar.com/reviews/amazfit-gtr-2",
    "Honor Band 5": "https://www.techradar.com/reviews/honor-band-5-review",
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review"
  }
}