{
  "source": "https://www.techradar.com/news/nintendo-switch-production-could-be-hit-by-global-chip-shortage",
  "title": "Nintendo Switch production could be hit by global chip shortage",
  "category": "gaming",
  "updated": "2021-05-06T13:34:53Z",
  "author": "rhys-wood",
  "summary": "The Switch could be going the way of the PS5",
  "article": [
    "Nintendo has revealed that it expects a drop in hardware sales of around 12% in the upcoming financial year, citing global chip shortages that could affect production of the Nintendo Switch and, potentially, the rumored Nintendo Switch 2 / Pro.",
    "In its full-year results statement for the 2021-22 financial year, Nintendo predicted that its net profit for the current financial year that began in April will fall by 29% as a result of a predicted decline in hardware sales.",
    "By the end of the 2021-2022 period, Nintendo predicts that it will sell around 25.5 million Nintendo Switch consoles, a drop from the 28.8 million consoles the company sold during the financial year just ended, with those sales boosted by increased demand for entertainment during the Covid-19 pandemic, as well as the spectacular success of Animal Crossing: New Horizons.",
    "Nintendo’s anticipated supply issues are hardly surprising considering the surge in demand for hardware components across the board. Analysts have also issued warnings for GeForce RTX 30-series GPUs, for example, predicting scarce availability of those products throughout the rest of 2021.",
    "It’s also possible that Nintendo’s hardware output won’t just be limited to the Switch. If the company is indeed working on the rumored Nintendo Switch 2, then it’s likely that production of both consoles would be affected by the same supply issues that are still affecting the PS5, which could lead to similarly limited availability of consoles for consumers to buy.",
    "As Nintendo faces the reality of post-Covid component shortages, the company could still shore up profits in other areas of its business, such as the recently opened Super Nintendo World theme park based in Osaka, Japan, as well as within its mobile division, with games like Fire Emblem Heroes and Pokémon Go continuing to generate huge amounts of revenue.",
    "While the company might struggle a bit more on the hardware front this year, Nintendo still has plenty of game launches lined up for the 2021-2022 financial year, including the recently released New Pokémon Snap, as well as the upcoming Mario Golf: Super Rush and Pokémon Brilliant Diamond and Shining Pearl remakes.",
    "It’s also possible that we’ll see Splatoon 3, Pokémon Legends Arceus and The Legend of Zelda: Breath of the Wild 2 early in 2022, although no concrete release date exists for those games as yet."
  ],
  "headers": {
    "3": "Component conundrum"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch 2": "https://www.techradar.com/news/nintendo-switch-2",
    "2021-22 financial year": "https://www.ft.com/content/a7d74cf9-0cc3-4f7a-957e-2ede59286e27",
    "Animal Crossing: New Horizons": "https://www.techradar.com/reviews/animal-crossing-new-horizons",
    "issued warnings": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "GeForce RTX 30-series": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "still affecting the PS5": "https://www.techradar.com/news/ps5-and-xbox-series-x-shortages-could-last-until-the-end-of-2021-says-new-report",
    "Super Nintendo World": "https://www.techradar.com/news/super-nintendo-world-is-coming-to-japan-in-2020",
    "Pokémon Go": "https://www.techradar.com/news/gaming/pokemon-go-updates-everything-you-need-to-know-about-what-s-coming-next-1330140",
    "New Pokémon Snap": "https://www.techradar.com/reviews/new-pokemon-snap-review",
    "Pokémon Brilliant Diamond and Shining Pearl": "https://www.techradar.com/news/pokemon-diamond-and-pearl-remakes",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
    "Pokémon Legends Arceus": "https://www.techradar.com/news/pokemon-legends-arceus-trailer-release-date-news",
    "The Legend of Zelda: Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2"
  }
}