{
  "source": "https://www.techradar.com/news/how-to-buy-a-gaming-pc-without-getting-ripped-off",
  "title": "How to buy a gaming PC without getting ripped off",
  "category": "computing",
  "updated": "2021-09-04T16:55:13Z",
  "author": "jackie-thomas",
  "summary": "Avoid the pitfalls, get in the game",
  "article": [
    "When you're setting out to get a new gaming PC, there are typically about three different ways you can go about it – you can build it yourself, buy one off of a store shelf (which includes, like, Amazon), or you can go on a manufacturer's website and configure the system of your dream.",
    "And now that it's so hard to find PC components at a reasonable price, especially graphics cards, more people than ever are picking up pre-built gaming PCs. But, when you go to CyberPowerPC, Maingear, or even to Dell's website to configure an Alienware gaming PC, there are a lot of pitfalls that mean you could spend a lot of extra money without it really resulting in a better experience for you.",
    "Unfortunately, this means that you'll need at least some literacy when it comes to PC components to really know how to configure a gaming PC that's actually worth the money you're spending on it. But, for PC Gaming Week, we decided that it's time to really get into the nitty-gritty and give you a few things to keep your eyes open for when shopping for a new gaming PC.",
    "When you go to a manufacturer's website, it's easy to see a PC starting at like $1,000 and think that sounds like an excellent deal – it almost never is. For example, right now at Dell, you can get the Alienware Aurora R12 – a computer we loved – for just $1,129. But click into that starting configuration, and you're getting an Intel Core i5-11400F, 8GB of RAM (and probably a single stick – more on that later), and an Nvidia GeForce GTX 1650 Super. And to make it worse, it also has a 1TB spinning hard drive, and no SSD.",
    "And it's not just Alienware, either. Just looking over at iBuyPower, and it has an \"Intel 10th Gen Gamer Daily Deal\" posted, starting at $1,429. But that also just has a single 8GB stick of RAM and it even starts off with an Intel Core i3-10105F. It at least has an SSD to start off with and an AMD Radeon RX 6600 XT, but that is not a $1400 PC, we're sorry.",
    "There are some manufacturers out there that have more reasonable entry-level configurations. Maingear and NZXT BLD are both good about not giving you a totally crap PC just because you don't want to spend thousands of dollars. But, both of those options are more expensive across the board, too.",
    "There are probably plenty of people out there that will see this and just say \"how hard is it to just look at the specs to see what you're buying before you check out?\" but a lot of the people that are going to opt for the first Alienware that pops up on the page are going to be parents just trying to get their kids a kick-ass birthday present, and they might not necessarily be up to date with the latest tech. Especially when it's something like that iBuyPower option we mentioned earlier, which has a last-generation processor in its $1,429 starting configuration.",
    "One of the first things you'll probably notice a soon as you go on these boutique builder websites is that there's an absolute ton of different customization options. This is a dream come true for folks that really want to create the machine of their dreams, but it's a nightmare for anyone unfamiliar with the wonderful world of PC components.",
    "Just looking at this CyberPowerPC promoted PC, there are 51 different chassis options, 19 different sets of fans and 26 different CPU coolers on offer. And, to make things worse, if you try to save some money, you might get an error message yelling at you that you're making the wrong choice.",
    "For instance, with this PC, we selected the Cooler Master Hyper 212 Black Edition – which is one of the best CPU coolers on the market, mind you – and it told us it wouldn't be beefy enough to handle the default CPU, which is just an Intel Core i7-11700KF. Yeah, it probably isn't going to be pushing that CPU into the stratosphere with a high overclock, but at stock settings, it's going to keep that little chunk of silicon more than cool enough.",
    "What makes that worse, though, is that with so many CPU cooler options available, some raising the price by as much as $253, we can totally see someone being intimidated by a warning message like that into upgrading to an unnecessarily powerful AIO cooler.",
    "With so many options available, it's incredibly easy to spend money that you don't really need to spend, in ways that aren't really going to materially affect your experience or gaming performance of your shiny new PC.",
    "A lot of boutique PC builders will have an option when you're configuring your PC to overclock your system for you. Now, we love overclocking as much as anyone, but in terms of the extra performance you're going to get, it's probably not really worth spending extra money on it.",
    "After all, the core appeal of overclocking is squeezing a little bit of free performance out of your computer, but that appeal is dampened when you have to pay for it. At the most, you're going to see a 5-10% difference in games and that's pretty unlikely, especially with a CPU overclock.",
    "Our advice, if you really want to mess around with overclocking your PC is to just do it yourself after you get the PC in hand. The process is fairly foolproof at this point, and you probably don't even have to go into the BIOS to do it like we had to do in the old days.",
    "You can use something like EVGA Precision X1 or MSI Afterburner to overclock your graphics card, and it has safeguards in place so that you won't permanently damage the GPU no matter how extreme you try to go. And, for your CPU, you really only need to think about overclocking Intel chips – AMD chips don't really overclock really well – and you can just use the Intel Extreme Tuning Utility to safely do that.",
    "So, it's probably not really worth paying Origin or Cyberpower PC to overclock your PC, when you can download an app and push a few buttons to get the same result. These options probably made a bit more sense a decade ago, when overclocking really required you to dig around the BIOS and change complicated and dangerous settings, but that's really not the case anymore.",
    "It's just not worth it at this point, just get everything with the factory settings. Even in the best-case scenario, an overclock isn't going to make the difference between running a game and not running it.",
    "Generally, our advice on buying a gaming PC, and the things you should put in it is going to largely remain the same: it depends.",
    "For most people though, you're going to be fine with whatever the default motherboard is, especially if you're not the type to mess around with overclocking.",
    "As for your processor, we find that an Intel Core i5 or an AMD Ryzen 5 processor is going to be the sweet spot for most gamers. You can go higher than that if you need that extra computing power – like if you're going to be doing some video editing or something – but a 6-core processor is going to be plenty for most people.",
    "Just make sure to get something that's current-generation. You're probably going to be spending upwards of a thousand bucks or quid on your rig, so you're going to want to make sure you get an 11th-gen chip for Intel or a 5th-gen for AMD Ryzen. If you were following our advice and getting the mid-range, that would be the Intel Core i5-11600K (or 11600KF) for Team Blue or the AMD Ryzen 5 5600X for Team Red.",
    "As for your graphics card, that largely depends on what resolution you want to play your games at. Sure, a lot of people want a shiny new RTX 3080, but unless you're playing games at 4K, it's probably not worth the extra expense. If you just want to play everything at 1080p, an AMD Radeon RX 6600 XT or an Nvidia GeForce RTX 3060 are going to be more than enough.",
    "Just a word of advice, don't spend more than $1,000 on a gaming PC that's using something like the Nvidia GeForce GTX 1650 Super. That card, even if it's inflated due to cryptomining, is just not worth that amount of cash.",
    "Pretty much every company that sells gaming PCs is also going to try to sell you monitors, keyboards, headsets and other such items. Our advice? Only buy the gaming rig from the PC builder.",
    "More often than not, you're going to save a pretty substantial amount of money by just buying the peripheral or accessory you want on Amazon or Newegg, rather than getting it bundled with your machine."
  ],
  "headers": {
    "3": "Don't buy the entry-level model",
    "7": "Don't get lost in all the options",
    "12": "Don't bother with the overclocks",
    "18": "What should you actually look for?",
    "24": "Finally, get your accessories elsewhere"
  },
  "links": {
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "PC components": "https://www.techradar.com/how-to/pc-components",
    "PC Gaming Week": "https://www.techradar.com/news/welcome-to-techradars-pc-gaming-week-2021",
    "CyberPowerPC promoted PC,": "https://www.cyberpowerpc.com/system/Daily-Deal-VR-i7K",
    "EVGA Precision X1": "https://www.evga.com/precisionx1/",
    "MSI Afterburner": "https://www.msi.com/Landing/afterburner/graphics-cards",
    "Intel Extreme Tuning Utility": "https://www.intel.com/content/www/us/en/download/17881/29183/intel-extreme-tuning-utility-intel-xtu.html"
  }
}