{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-have-more-storage-and-a-lower-price-than-the-fold-2",
  "title": "Samsung Galaxy Z Fold 3 could have more storage and a lower price than the Fold 2",
  "category": "phones",
  "updated": "2021-06-21T13:00:14Z",
  "author": "james-rogerson",
  "summary": "It's sure to still be very expensive",
  "article": [
    "The Samsung Galaxy Z Fold 3 is bound to be one of the most expensive phones of the year, but it looks increasingly likely that it might at least be cheaper than its predecessor was at launch.",
    "The latest evidence of that comes from a post on Naver (a South Korean social media site), where it’s been claimed that the Galaxy Z Fold 3 will be slightly cheaper than the Samsung Galaxy Z Fold 2.",
    "While we’d take this with a pinch of salt, it’s the second time we’ve heard this, with a previous leak saying that the upcoming foldable could be up to 20% cheaper than its predecessor. For reference, the Galaxy Z Fold 2 launched at $1,999 / £1,799 / AU$2,999.",
    "This latest leak also mentions that there could be a 512GB model of the Samsung Galaxy Z Fold 3, whereas – outside China at least – you were limited to 256GB with the Samsung Galaxy Z Fold 2. Twitter leaker @kbc20000 has recently made the same storage upgrade claim, though they don’t have much of a track record, so this too we’d take with a side of salt.",
    "In any case, hopefully we’ll have confirmation of these claims soon, as the Samsung Galaxy Z Fold 3 is likely to be announced in August, with August 3 being the latest rumored date.",
    "It might not land alone either, with the Samsung Galaxy Z Flip 3, Samsung Galaxy S21 FE, Samsung Galaxy Watch 4 and Samsung Galaxy Watch Active 4 all potentially landing on the same day, so if you’re a Samsung fan, August 3 is worth marking in your calendar.",
    "Via SamMobile"
  ],
  "headers": {
    "3": "Double the storage"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Naver": "https://blog.naver.com/yeux1122/222404379900",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "@kbc20000": "https://twitter.com/kbc20000/status/1406252063340699650",
    "August 3": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "SamMobile": "https://www.sammobile.com/news/galaxy-z-fold-3-price-tough-to-resist/"
  }
}