{
  "source": "https://www.techradar.com/news/ibm-launches-quantum-computing-developer-certification",
  "title": "IBM launches quantum computing developer certification",
  "category": "computing",
  "updated": "2021-03-31T02:08:03Z",
  "author": "anthony-spadafora",
  "summary": "Quantum computing developer certification could be a game changer for job seekers",
  "article": [
    "With the quantum era just around the corner, interest in quantum computing has grown tremendously over the past few years which is why IBM has announced the world's first ever developer certification for programming a quantum computer.",
    "According to a report from the market research firm P&S Intelligence, quantum computing could be a $65bn industry by 2030 and this will likely lead to an influx of new jobs in the field.",
    "With its new IBM Quantum Developer Certification, IBM Quantum is providing a path for people with all development backgrounds to earn a certification in programming with Qiskit.",
    "For those unfamiliar, Qiskit is an open source quantum software development kit supported by IBM. Since its launch in 2017, thousand of users have developed applications, maintained and improved code and have take part in hackathons using Qiskit.",
    "As IBM makes progress on its quantum development roadmap, the company wants to build a diverse, global, cloud-based ecosystem of developers who can bring quantum computing skills to their industries and communities.",
    "The IBM Quantum Developer Certification is a 60-question certification exam that will be offered on the Pearson VUE platform. Those who pass the exam will have demonstrated experience using Qiskit to create and execute quantum computing programs on both IBM's quantum computers and simulators. When it's released, the exam will be available worldwide and will be in English.",
    "As IBM Quantum's hardware and software develop further, so too will the IBM Quantum Developer Certification in order to show that certified individuals are able to use state-of-the-art hardware and application modules.",
    "In addition to its new certification, IBM Quantum is also working to ensure that educators have access to its tools through its Quantum Educators program and its Introduction to Quantum Computing and Quantum Hardware semester-long course. Interested users can apply for the IBM Quantum Developer Certification here."
  ],
  "headers": {
    "4": "IBM Quantum Developer Certification"
  },
  "links": {
    "IBM": "https://www.techradar.com/news/ibm-has-big-plans-for-the-future-of-quantum-computing",
    "developer certification": "https://www.techradar.com/best/online-class-sites-do-these-online-courses-from-the-comfort-of-home",
    "report": "https://www.globenewswire.com/news-release/2020/02/10/1982087/0/en/Quantum-Computing-Market-is-Poised-to-Surpass-64-988-3-Million-By-2030-P-S-Intelligence.html",
    "IBM Quantum Developer Certification": "https://www.ibm.com/blogs/research/2021/03/quantum-developer-certification/",
    "Qiskit": "https://www.techradar.com/news/ibm-has-doubled-the-power-of-its-quantum-computer",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "quantum development roadmap": "https://www.techradar.com/news/ibm-to-boost-performance-of-quantum-processors-by-41-times-in-three-years",
    "Quantum Educators program": "https://quantum-computing.ibm.com/programs/educators",
    "Introduction to Quantum Computing and Quantum Hardware": "https://qiskit.org/learn/intro-qc-qh",
    "here": "https://www.ibm.com/certify/exam?id=C1000-112"
  }
}