{
  "source": "https://www.techradar.com/news/prime-gaming-april-2021-free-loot-for-rainbow-six-siege-apex-legends-and-more",
  "title": "Prime Gaming April 2021: free loot for Rainbow Six Siege, Apex Legends and more",
  "category": "gaming",
  "updated": "2021-03-25T13:00:07Z",
  "author": "vic-hood",
  "summary": "All the free content up for grabs in April",
  "article": [
    "Want to grab some free loot? Of course you do. Then check out Prime Gaming's April offering, which includes exclusive content for Rainbow Six Siege, Fall Guys, Apex Legends and For Honor. Plus five more free games, which have been added to the Prime Gaming library.",
    "So what is up for grabs? Starting March 25 (that's today), Fall Guys players can pick up the exclusive Boxzilla Bundle, which includes the adorable Boxzilla costume plus 6,500 Kudos to spend in the store.",
    "For those who prefer some shooter action, Rainbow Six Siege players can grab the exclusive Caveira Bundle, which includes a new uniform, headgear, weapon skin and charm – designed by community SAU_SIEGE.",
    "But it's not just Rainbow Six Siege and Fall Guys players who are benefiting in April. Apex Legends players can still claim the exclusive Adrenaline Affliction skin for Octane right now, while For Honor players can claim seven days' worth of Champion Status, which includes XP boosts and more, as well as two Scavenger Crates.",
    "The end date on many of these bundles hasn't been confirmed at the time of writing – while they'll likely be available until the end of April, the For Honor loot is available to claim until April 26.",
    "Also, make sure to check out the other Prime content on offer over at its official website, where you can claim these offers, as there's content for Roblox, Smite, Rogue Company and more.",
    "In addition to this free content, five new free PC games are also being added to the Prime Gaming library from April 1. These are The Escapists, Moving Out, Aces of the Luftwaffe, Move or Die, and Before I Forget, all of which will be free to download and play for Prime members. But if they're not to your liking, you can check out the 30+ other games on offer in the library.",
    "Prime Gaming (formerly known as Twitch Prime) offers Amazon Prime members access to a free Twitch channel subscription, exclusive in-game content, and free PC games every month.",
    "And you don't even have to be a PC player to take advantage of these offers, as most of these offers extend to console too (like the Apex Legends and Fall Guys offers).",
    "If you're a Prime member already, then it's definitely worth making use of the benefits that come with Prime Gaming. If you're not a member yet, simply click on the sign-up link below to start your 30-day free trial and access everything that Prime Gaming has to offer."
  ],
  "headers": {
    "7": "Make the most of Prime"
  },
  "links": {
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "official website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6879465707975810000&xs=1&url=https%3A%2F%2Fgaming.amazon.com%2Fhome&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fprime-gaming-april-2021-free-loot-for-rainbow-six-siege-apex-legends-and-more",
    "formerly known as Twitch Prime": "https://www.techradar.com/news/twitch-prime-is-now-prime-gaming-will-keep-serving-up-free-gaming-goodies"
  }
}