{
  "source": "https://www.techradar.com/news/halo-infinite-will-let-you-jump-seamlessly-between-xbox-series-x-and-pc",
  "title": "Halo Infinite will let you jump seamlessly between Xbox Series X and PC",
  "category": "gaming",
  "updated": "2021-04-29T14:44:51Z",
  "author": "samuel-tolbert",
  "summary": "Strap in across platforms",
  "article": [
    "Halo Infinite is easily the biggest upcoming game from Microsoft's Xbox Game Studios, and while it'll launch day and date across Xbox One, Xbox Series X, Xbox Series S and PC, players on PC won't be barred from carrying over any progress made on console.",
    "Microsoft's Head of Xbox Game Studios, Matt Booty, confirmed today via Xbox Wire that Halo Infinite will support cross-play and cross-progression across Xbox consoles and PC, so you won't be restricted no matter where you decide to play.",
    "This is just part of what will make Halo Infinite a tentpole release on PC as well as Xbox Series X. Halo Infinite will also feature support for ultrawide and super ultrawide monitors, as well as a range of graphics settings so even if you haven't been able to grab an RTX 3080, you'll be good to go.",
    "Booty also revealed that Halo: The Master Chief Collection has crossed over 10 million players on PC since it first launched, which has no doubt informed the focus on making Halo Infinite a proper release on PC. After being delayed out of 2020, Halo Infinite is currently scheduled to launch at an unknown date sometime in Fall 2021 (between September and December).",
    "Booty also explained how Microsoft is working to further its reach in PC gaming, starting with developers. Beginning on August 1, 2021, Microsoft will no longer share 70% of the revenue for any games sold on the Microsoft Store and is instead bumping the number up to 88%, in line with PC games sold on the Epic Games Store.",
    "Booty closes by noting that while \"we still have a lot of work to do,\" Microsoft has never been in a better place with PC gaming."
  ],
  "headers": {
    "4": "Xbox on PC continues to improve"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Wire": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1143720895014571600&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F04%2F29%2Fcontinuing-our-pc-gaming-journey-in-2021-and-beyond%2F",
    "ultrawide": "https://www.techradar.com/news/ultrawide-monitor",
    "RTX 3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "Halo: The Master Chief Collection": "https://www.techradar.com/news/halo-the-master-chief-collection-is-getting-a-serious-xbox-series-x-upgrade",
    "PC gaming": "https://www.techradar.com/news/the-best-gaming-pc",
    "Epic Games Store": "https://www.techradar.com/news/free-epic-games-store-games-this-weeks-giveaways-revealed"
  }
}