{
  "source": "https://www.techradar.com/news/oneplus-phones-history",
  "title": "OnePlus smartphones: a complete history of its handsets ahead of the OnePlus 9",
  "category": "phones",
  "updated": "2021-02-20T08:00:48Z",
  "author": "david-nield",
  "summary": "From flagship killers to mid-range gems",
  "article": [
    "OnePlus only appeared on the scene in 2014, but since then it's been responsible for some of the very best phones on the market – its tactic of selling well-specced and well-designed phones at affordable prices has been a hit with buyers, and it's not hard to figure out why.",
    "Looking back on the history of OnePlus phones is to take a tour through the history of phones in general. You can track all the developments of recent years, from the arrival of 5G, to the appearance of the notch and the ever-improving quality of phone cameras.",
    "Here we'll take you in detail through all the phone releases that OnePlus has ever put out, from the flagship killers of its early days through to the super-budget handsets that it's recently launched. The company's handsets have had quite a history, as we'll explain.",
    "And you can also see the approach that OnePlus is taking to the market changing over time too: the smartphone and gadget scene today is very different today than it was back in 2014, and like all the other top-tier device makers, OnePlus has adapted accordingly.",
    "OnePlus burst onto the smartphone scene in 2014 with the original flagship killer, the OnePlus One – close-to-flagship specs for a much cheaper price. It's easy to forget now, but the impact of such a powerful phone at such a low price was huge. Add in the Google Nexus 5 from the previous year, and for the first time we began to realize that great phones didn't necessarily have to cost a massive amount of money.",
    "The OnePlus One had a starting price of $299 in the US and £229 in the UK, not far off half the price of the other flagship phones at the time. The phone was initially pushed out to customers through a special invite system, adding to the exclusive feel of the handset and confirming that we did indeed have something special on our hands – even if the limited supply was somewhat frustrating.",
    "In terms of specs, the phone came with a 5.5-inch, 1080 x 1920 pixel LCD screen, and was powered by a Qualcomm Snapdragon 801 processor, 3GB of RAM and either 16GB or 64GB of internal storage. Around the back, there was a single-lens 13MP camera. Back in 2014, those were very impressive specs indeed, and in our review we described the performance-to-price ratio as \"one of the most impressive we've ever seen in a smartphone\" – and OnePlus was only just getting started.",
    "When you've had a hit like the OnePlus One, what do you do for a follow-up? The OnePlus 2 didn't actually change too much, with OnePlus obviously wanting to repeat the same success of the original OnePlus phone with a similar formula. The specs got a boost, as you would expect: in 2015 the phone was up to a Qualcomm Snapdragon 810 CPU, and the 64GB storage model got an upgrade to 4GB of RAM, but the rest of the specs were otherwise largely the same.",
    "The screen size and resolution stayed the same, but OnePlus did improve the camera, and upgrade some of the materials on its second handset for a more premium feel: the addition of a metal frame around the sizes of the phone was a welcome touch. Once again the price was very appealing, with the OnePlus 2 originally going on sale with a starting price of $329 / £249, just slightly up from its predecessor.",
    "And in our review it was the price that really made the phone stand out: it was \"a price tag that puts the rest of the mid-to-high-end mobile market to shame\" we wrote at the same, and OnePlus was fast earning a reputation as a manufacturer that could make top-tier phones at mid-range prices. Once again, OnePlus had made a stunning smartphone.",
    "If you thought that OnePlus only became interested in sub-flagship phones in 2020 with the OnePlus Nord, then you've forgotten all about the OnePlus X that followed the OnePlus 2 in 2015. The specs weren't quite as good, but the price got lower still with the X edition: this smartphone went on sale for a mere $249 / £199 when it first appeared.",
    "It was a smaller phone, with a screen size of 5 inches and a resolution of 1080 x 1920 pixels, but the display was upgraded to the superior AMOLED technology rather than LCD. In terms of performance it was really only on a par with the original OnePlus One, but you still got plenty for your money – \"producing a phone of this quality, for this price, is quite an achievement by OnePlus\" we wrote in our review.",
    "OnePlus went back to the Qualcomm Snapdragon 801 for the OnePlus X, with 3GB of RAM and 16GB of storage the only configuration option. The rear camera was a single-lens 13MP affair, as it had been on the previous two OnePlus phones, though the OnePlus handsets were still lacking certain premium features like wireless charging and waterproofing.",
    "2016 brought the OnePlus 3, the first metal unibody smartphone from OnePlus – even at this early stage there were signs that OnePlus was eventually going to move towards fully featured, full-price flagships with all the bells and whistles of the high-end devices that the company had originally been trying to undercut.",
    "At $399 / £329, the OnePlus 3 was still very affordable, just not as affordable as its predecessors had been. The phone came running a Qualcomm Snapdragon 820 processor and an impressive 6GB of RAM, and with 64GB of internal storage. The camera was upgraded to a single-lens 16MP model, but as well as confirming the switch to AMOLED for the display tech, the screen size stuck with the standard OnePlus 5.5 inches, with a resolution of 1080 x 1920 pixels.",
    "In our review we described the OnePlus 3 as a phone that \"goes toe-to-toe with the high-end flagships of 2016\" despite cutting a substantial chunk off the price. At the time it was undoubtedly the best OnePlus phone to date, and something of a return to form after the slightly underwhelming response to the OnePlus 2. With the OnePlus 3 and its new metal housing, OnePlus was starting to find its feet properly.",
    "The year 2016 was also the year when the now familiar T versions of the OnePlus phones first got started. The OnePlus 3T was an ever-so-slightly improved edition of the OnePlus 3, bringing with it a processor that was a touch faster (the Snapdragon 821), an option with more storage and more RAM, and a slightly bigger battery.",
    "Other specs, like the display and the rear camera, were identical to the OnePlus 3 – this was very much a mid-cycle refresh intended to tempt in smartphone buyers who had passed on the other phone that OnePlus had pushed out in 2016. The pricing continued to sneak up though: this phone started at $439 / £399.",
    "Bringing out a T model is a strategy that OnePlus has kept to this day – albeit with a few tweaks – and while it raised a few eyebrows at the time, it seems to have paid off in the long term. In our review, we summed up the OnePlus 3T as \"another excellent handset\" from OnePlus that \"improves on the OnePlus 3 in several key areas\", including performance and battery life.",
    "The OnePlus 4 was skipped – most probably because of the number's association with unluckiness in China – and so we had the OnePlus 5 in 2017. It was a phone that didn't skimp on the specs, with a Qualcomm Snapdragon 835 paired with 6GB or 8GB of RAM, and 64GB or 128GB of internal storage. For a phone in 2017, they were top drawer specs, and even though the price continued to rise, this remains one of the most successful and well-received phones in OnePlus history.",
    "This was the first OnePlus phone to have a dual-lens rear camera – a 16MP + 20MP affair with 1.6x optical zoom – but the AMOLED screen stuck to the standard 5.5-inch, 1080 x 1920 configuration. That helped to keep the price respectable: the OnePlus 5 went on sale for $499 / £449 and up. As the power and specs of the OnePlus phones continued to get better, it wasn't able to offer quite such substantial savings compared to the prices you had to pay for a full flagship.",
    "We were certainly very taken with the phone in our review of the OnePlus 5: it was \"an all-round fantastic phone\" we thought at the time, combining \"a great camera, phenomenal performance and a premium design\" to make a very appealing handset indeed – and one that remained relatively affordable.",
    "By 2017, OnePlus was committed to the mid-cycle T update, and so we got the OnePlus 5T to improve on the OnePlus 5 later in 2017. There were quite a few changes to talk about, including the removal of the home button for the first time – the fingerprint sensor got moved to the rear of the handset, which meant the screen size could increase to 6.01 inches, the biggest yet for OnePlus.",
    "The display resolution shifted slightly, to 1080 x 2160 pixels, but under the hood we had exactly the same configuration as the OnePlus 5: a Qualcomm Snapdragon 835 processor, 6GB or 8GB of RAM, and 64GB or 128GB of internal storage. The rear camera was slightly improved on the 5T, although the 16MP and 20MP ratings remained the same.",
    "While it was only a T refresh, the slim and stylish looks of the OnePlus 5T, with no home button on the front, mean you could reasonably call it the start of the modern OnePlus era. In our review we said that it represented \"some of the best value for money in the market\", and at $499 / £449 the starting price was the same as the OnePlus 5 that came before it.",
    "The OnePlus 6 that arrived in 2018 was a superstar of a phone. It had the biggest screen on a OnePlus phone yet – 6.28 inches, running at a resolution of 1080 x 2280 pixels – and it also introduced the display notch to the OnePlus series for the first time. On top of that it was packed with power and came with a very capable rear camera, something that had perhaps let down previous OnePlus handsets.",
    "In our review we said it was \"the most polished, premium smartphone the firm has made in its short existence\", and this really was a handset that could compete directly with the best that Samsung and Apple had to offer at the time. Part of the appeal was a new all-glass design, meaning that the OnePlus 6 had a very flagship-like aesthetic.",
    "The phone was powered by a Qualcomm Snapdragon 845 processor, which you could pair with 6GB or 8GB of RAM. The internal storage options were 64GB, 128GB, and – for the first time on a OnePlus phone – 256GB. As for the rear camera, the phone came with a 16MP + 20MP snapper on the back. Perhaps unsurprisingly, given the specs, this was the most expensive OnePlus phone to date, with a starting price of $529 / £469.",
    "Another half-yearly refresh phone from OnePlus, the OnePlus 6T didn't change much from the phone that came before it apart from the design – the display notch got shrunk down to a small teardrop, and the screen size increased yet again, to 6.41 inches (the resolution went up accordingly too, to 1080 x 2340).",
    "Notably the OnePlus 6T was the first OnePlus phone to have an in-screen fingerprint sensor, and the battery got a boost to 3,700 mAh from 3,300 mAh – a boost that meant you could well and truly get through a whole day without worrying about a recharge. Otherwise, the OnePlus 6T was very similar indeed to the OnePlus 6, although the starting price of $549 / £499 was ever so slightly higher.",
    "While there were only a select few upgrades on the OnePlus 6T, and the internal specs stayed the same, it fulfilled the purpose of a T refresh device in bringing OnePlus back into the smartphone conversation. In our review we described the phone as \"the most accomplished phone we’ve ever seen from the company\".",
    "2019 was the first year that we saw both a standard and a Pro version of a new OnePlus phone, with the OnePlus 7 and the OnePlus 7 Pro making an appearance at the same time. It's a strategy that OnePlus has stuck with in the years since, so it would seem that the company is finding some success with it. In terms of similarities, both phones ran on a Qualcomm Snapdragon 855 processor, coming with 6GB, 8GB or 12GB of RAM, and 128GB or 256GB of internal storage.",
    "The Pro was the significantly better phone though: it had a curved 6.67-inch, 1440 x 3120 pixel resolution, 90Hz refresh rate screen compared with a 6.41-inch, 1080 x 2340 pixel, 60Hz refresh rate screen, as well as a triple-lens 48MP + 8MP + 16MP rear camera with 3x optical zoom and ultrawide – the standard OnePlus 7 settled for a dual-lens 48MP + 5MP rear camera with neither optical zoom nor an ultrawide mode. The Pro model was also the first OnePlus handset to come with a 5G configuration option.",
    "Another interesting feature of the OnePlus 7 Pro, which started at $669 / £649: it did away with the display notch and had a pop-up selfie camera as well, which we rather liked: \"OnePlus has done it again\" we declared in our review. The OnePlus 7 sold for a very reasonable £499 and up (it wasn't available in the US), and in our review we described it as a \"dependable, affordable flagship smartphone\".",
    "You know the pattern by now: a OnePlus phone is followed by a OnePlus T phone, and in 2019 the company decided to upgrade both its handsets at the same time – a move it didn't repeat in 2020. The OnePlus 7T was the bigger upgrade over its direct predecessor, with a bigger 6.55-inch, 1080 x 2400 pixel resolution, 90Hz refresh rate display, a triple-lens 48MP + 12MP + 16MP rear camera with ultrawide and 2x optical zoom (and a rather strange circular design), and a $599 / £549 starting price. In our review we described it as \"an excellent low-cost flagship\".",
    "The OnePlus 7T Pro kept the pop-up selfie camera of the OnePlus 7 Pro, and kept just about everything else as well – the upgrade between these two phones was a minor one, and you'd actually struggle to tell them apart. The 7T Pro did get a slight battery boost, and a small upgrade in terms of internal specs, and in our review we said it was \"the most impressive device yet\" from OnePlus, albeit very similar to the 7 Pro. For this phone the starting price was £699, and it wasn't made available in the US.",
    "Both the OnePlus 7T and the OnePlus 7T Pro were powered by the Snapdragon 855 Plus processor, so there was a minor upgrade there, and the RAM and storage configurations got a little tweak as well – both phones topped out at 256GB of internal storage, with the OnePlus 7T going up to 8GB of RAM and the OnePlus 7T Pro going up to 12GB. It was very much a year of experimentation for OnePlus, as it tested out different phones in different markets and introduced the Pro models for the first time.",
    "Both the OnePlus 8 and the OnePlus 8 Pro came running the Snapdragon 865 processor from Qualcomm, and both had displays with curved edges and 5G on board, but that's pretty much where the similarities end. The OnePlus 8, starting at $699 / £599, came with a curved edge 6.55-inch, 1080 x 2400 pixel, 90Hz refresh rate screen, a triple-lens 48MP + 16MP + 2MP rear camera with ultrawide, and in our review we said that it \"sets the bar high for mid-priced flagships in 2020\".",
    "This time around there wasn't such a big jump to the Pro edition, but it still had some improvements: a curved edge 6.78-inch, 1440 x 3168 pixel, 120Hz screen, and a quad-lens 48MP + 8MP + 48MP + 5MP rear camera with ultrawide and 3x optical zoom. At long last it was the first OnePlus phone to offer both wireless charging and an IP68 rating for protection against water and dust, and the starting price at launch was $899/£799.",
    "In our review we described the OnePlus 8 Pro as a \"proper flagship phone\", and it really marks the culmination of the OnePlus journey from making flagship killers to making proper flagships, complete with extras like wireless charging and waterproofing. Both these handsets came with the same configuration options: 8GB or 12GB of RAM, and 128GB or 256GB of internal storage.",
    "In the same year that OnePlus released a \"proper flagship phone\", it also turned its attention to the mid-range and budget sections of the market as well: say hello to the OnePlus Nord (starting at £379 with no US launch), the OnePlus Nord N10 5G ($299 / £329), and the OnePlus Nord N100 ($180 / £179).",
    "Whereas OnePlus previously tried to package flagship-level components in an affordable package, these phones are very much mid-range and budget in terms of specs as well as price. They leave out features such as wireless charging and waterproofing, knock down the display resolutions and camera specs (none of these phones offer optical zoom, for example), and in the case of the Nord N10 5G and Nord N100, swap an AMOLED screen for an LCD one. To be fair though, the prices are very appealing.",
    "The OnePlus Nord runs a Snapdragon 765G processor with up to 12GB of RAM and 256GB of internal storage – it's more of a mid-to-high-ranger – while the Nord N10 5G goes for a Snapdragon 690 5G processor, 6GB of RAM and 128GB of storage, and the Nord N100 has a Snapdragon 460 processor, 4GB of RAM and 64GB of storage. It'll be interesting to see where OnePlus goes with the affordable Nord range in future years.",
    "The final OnePlus phone of 2020 was the OnePlus 8T – there was no upgrade this time around for the OnePlus 8 Pro, which ended the year as pretty much the best phone in the OnePlus range. Again, it's a sign of the OnePlus strategy shifting over time, and we might not see T-level upgrades to the Pro handsets in the future. The starting price for the OnePlus 8T at launch was $699 / £599, the same as the OnePlus 8, and perhaps another sign of what's to come.",
    "The OnePlus 8T didn't change a whole lot from the OnePlus 8. The screen refresh rate got bumped to 120Hz from 90Hz, and an extra camera lens got added on the rear – a 2MP depth sensor. The battery got bigger – 4,500 mAh rather than 4,300 mAh – and the fast charging speed increased from 30W to 65W. Just about all of the other specs were the same, though the OnePlus 8T did go back to a flat glass display (the display size remained unchanged at 6.55 inches).",
    "Many phone makers now release more affordable versions of their flagship phones, and it would seem that's the role of the OnePlus 8T. With the Nord range now out, OnePlus might not feel it needs a T edition in future years, but time will tell. In our review we said that the phone was \"more of the same – and that's okay\"."
  ],
  "headers": {
    "4": "OnePlus One (2014)",
    "7": "OnePlus 2 (2015)",
    "10": "OnePlus X (2015)",
    "13": "OnePlus 3 (2016)",
    "16": "OnePlus 3T (2016)",
    "19": "OnePlus 5 (2017)",
    "22": "OnePlus 5T (2017)",
    "25": "OnePlus 6 (2018)",
    "28": "OnePlus 6T (2018)",
    "31": "OnePlus 7 and OnePlus 7 Pro (2019)",
    "34": "OnePlus 7T and OnePlus 7T Pro (2019)",
    "37": "OnePlus 8 and 8 Pro (2020)",
    "40": "OnePlus Nord, Nord N10 5G and Nord N100 (2020)",
    "43": "OnePlus 8T (2020)"
  },
  "links": {
    "best phones": "https://www.techradar.com/news/best-phone",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "OnePlus One": "https://www.techradar.com/reviews/phones/mobile-phones/oneplus-one-1244307/review",
    "Google Nexus 5": "https://www.techradar.com/reviews/phones/mobile-phones/google-nexus-5-1194974/review",
    "our review": "https://www.techradar.com/reviews/oneplus-8t-review",
    "OnePlus 2": "https://www.techradar.com/reviews/phones/mobile-phones/oneplus-2-1300253/review",
    "OnePlus X": "https://www.techradar.com/reviews/phones/mobile-phones/oneplus-x-1307733/review",
    "OnePlus 3": "https://www.techradar.com/reviews/phones/mobile-phones/oneplus-3-1323353/review",
    "OnePlus 3T": "https://www.techradar.com/reviews/oneplus-3t-review",
    "OnePlus 5": "https://www.techradar.com/reviews/oneplus-5",
    "OnePlus 5T": "https://www.techradar.com/reviews/oneplus-5t-review",
    "OnePlus 6": "https://www.techradar.com/reviews/oneplus-6",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "OnePlus 7T": "https://www.techradar.com/reviews/oneplus-7t",
    "OnePlus 7T Pro": "https://www.techradar.com/reviews/oneplus-7t-pro-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus Nord N10 5G": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "OnePlus Nord N100": "https://www.techradar.com/news/oneplus-nord-n10-5g-and-n100-announced-as-two-new-super-cheap-phones",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review"
  }
}