{
  "source": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
  "title": "Spatial Audio: our guide to immersive speakers, headphones, and streaming services",
  "category": "audio-visual",
  "updated": "2021-11-29T07:56:37Z",
  "author": "olivia-tambini",
  "summary": "Apple's Spatial Audio, Dolby Atmos, DTS:X, and more",
  "article": [
    "Immersive sound formats are taking the world of home audio by storm, with Apple’s Spatial Audio joining the likes of Dolby Atmos, DTS:X, Sony’s 360 Reality Audio and Creative’s Super SXFI in the quest to make 3D sound in the home more accessible than ever.",
    "Though these audio technologies differ in the way they enable immersive sound, they are all capable of making the sound of your music, films, and games feel as though it’s coming from all around you.",
    "Whether you call it immersive, 3D, or spatial audio, these technologies are the biggest thing to happen to home cinema and music listening since surround sound.",
    "While surround sound gave our music a sense of horizontal direction, spatial audio takes this one step further by adding height cues to film soundtracks and music. Imagine the difference between hearing a helicopter flying a few hundred yards away versus directly over your head, and you’re nearly there.",
    "For cinephiles, spatial audio makes films feel more engrossing, placing you right in the action, and it allows gamers to hear the sound of enemy footsteps creeping towards them from any direction.",
    "More recently, spatial audio has been expanded to music too, with some formats placing instruments in a virtual sphere so you can feel as though you’re surrounded by the musicians in your favorite bands, or sitting in the midst of a full orchestra.",
    "Exciting right? While the world of spatial audio is definitely a step forward for cinephiles, gamers, and music lovers, it can also be pretty confusing, with lots of different formats to choose from.",
    "Where you can find support for these formats also varies, with each TV and music streaming service offering support for one format exclusively, a mixture of a few, or none at all.",
    "And, once you’ve worked out where you can get spatial audio content, you need to make sure you have the right equipment to experience it, whether that’s a Dolby Atmos soundbar, a DTS:X-touting AV receiver, or a pair of Apple AirPods Pro true wireless earbuds.",
    "To help cut down on the confusion, we’ve put together this handy guide to the top spatial audio formats you can try right now, as well as everything you need to take your content to the glorious third dimension.",
    "Dolby Atmos is probably the best-known of all the spatial audio formats, having been originally developed for cinema and later making its way to the world of music streaming.",
    "The format gives sound a more three-dimensional effect than traditional surround formats, with sound designers taking elements from a track and placing them in a virtual sphere. This allows movie makers to make sounds feel as though they are coming at you from all angles, which is particularly useful for cinema. For example, a helicopter flying overhead in a film could be made to sound as though it’s really flying above you with the help of Dolby Atmos.",
    "‘True’ Dolby Atmos makes use of overhead speakers to achieve this effect, though innovations in the world of soundbars and speakers has made it possible for home cinema enthusiasts to experience the format for themselves.",
    "These days you can get soundbars with upfiring tweeters that bounce sound up to your ceiling and back down to your ears or add-on modules that allow your existing speakers to deliver Dolby Atmos when combined with a compatible AV receiver.",
    "However, if you don’t have upfiring tweeters or overhead speakers, you can still experience Dolby Atmos with the company’s Height Virtualization technology, which makes use of your existing 5.1, 7.1, or stereo speaker setup.",
    "It essentially works by tricking your brain into thinking certain sounds are originating from above you, using height cue filters that simulate the natural cues imparted by the human ear to sounds arriving from overhead.",
    "Dolby Atmos is also available for music, placing individual instruments and effects within that virtual sphere instead of elements from a movie soundtrack.",
    "The format can be applied to new music or as part of a remaster, provided the original audio stems are available to edit. When you play the music back, it should feel as though you’re enveloped in a dome of sound, and it works with speakers or via Dolby Atmos for Headphones.",
    "DTS:X is very similar to Dolby Atmos in that it creates three-dimensional sound that moves around you as it would in real life.",
    "The big difference however, is that DTS:X doesn’t require overhead speakers or upfiring tweeters, working with standard surround sound speaker setups up to a maximum 11.2-channel system. You can use overhead channels if you want to create a more convincing 3D sound experience, though.",
    "DTS:X also has the added benefit of allowing you to manually adjust different sound elements, so you could increase the volume of dialogue on a soundtrack if you’re struggling to hear them over loud music or effects.",
    "Apple’ Spatial Audio is the company’s answer to Dolby Atmos for Headphones, designed for the AirPods Pro true wireless earbuds and AirPods Max over-ear headphones.",
    "It takes 5.1, 7.1, and Dolby Atmos content and applies directional audio filters, placing sound in a 3D sphere.",
    "What’s unique to Spatial Audio though, is that it uses the built-in accelerometers and gyroscopes inside Apple’s earbuds and headphones to track the position of your head, as well as the position of your iPhone or iPad.",
    "That means that, when you watch films on your iPhone or iPad, the sound will always be placed correctly based on the action on the screen – so, if you turn your head or shift your device, it will still sound as though the sound is coming from the screen.",
    "As you may have guessed, you’ll need an Apple device with iOS 14 or iPadOS 14, as well a streaming service that supports 5.1, 7.1, or Atmos. Stereo content can also be converted to Spatial Audio as long as the streaming service has enabled a special plugin for stereo spatialization.",
    "As well as the AirPods Pro and AirPods Max, the devices that support Spatial Audio include iPhone 7 and later, iPad Pro 11-inch, iPad Air (3rd generation), iPad Pro 12.9-inch (3rd generation) and later, iPad (6th generation) and later, and the iPad mini (5th generation) and later.",
    "If Dolby Atmos is made for cinema, Sony 360 Reality Audio is the 3D audio answer for music streaming – though the format hasn’t exactly taken off in the way we imagine Sony was hoping.",
    "The immersive music format designed to be streamed over mobile music streaming services and played through compatible headphones or Bluetooth speakers.",
    "Though it has support from a range of streaming services, creating object-based audio – so-called 360-degree sphere-mapping where each individual instrument, vocals and effect needs to be specifically placed in a sphere – is something Sony will need to persuade music producers to do before 360 Reality Audio can stand a chance of becoming as commonly used as Atmos.",
    "Super X-FI doesn't have the star-power of Atmos or the name recognition of Apple, but it's well-worth knowing about.",
    "Instead of relying on musicians and studios mixing and mastering their content for 3D space, Super X-FI relies on a proprietary algorithm and a custom chip to up-mix regular surround sound, stereo sound and even mono(!) audio tracks.",
    "All the algorithm needs to work is a picture of your ears - weird, we know - but with it Super XFi can use the shape of your ears and head to calculate how audio needs to be tuned to give you a 3D effect by feeding it through its Super X-FI ULTRADSP chip.",
    "That chip, the real driving force for Super X-FI, is now built inside eight different products from Creative including two wireless headphones, true wireless earbuds, two gaming headsets and two headphone amps, with a soundbar - the Creative SXFI Carrier - in the works.",
    "The technology was debuted at CES a few years back before getting a second form at last year's CES 2020, and the improvement definitely sharpened the technology to a finer point. It's now just as immersive as a proper Dolby Atmos setup when you pair the amp with the right headphones, but considering you all you need is a pair of Creative headphones, an amp or a pair of earbuds to get started, it's far, far more accessible when you're first testing the waters of 3D audio.",
    "Netflix supports Dolby Atmos on some of its titles, but not all – you’ll be able to see which shows and films support the format as they have an Atmos icon next to their description.",
    "You’ll need a Netflix subscription that supports streaming in Ultra HD, a TV, smartphone, or tablet that supports Atmos, as well as an Atmos-capable audio system. Your streaming quality will also need to be set to High or Auto.",
    "Like Netflix, Amazon Prime has a few titles in Dolby Atmos, but it's limited to the Amazon Fire TV and Fire TV Sticks, Apple TV 4K, LG and Samsung 4K TVs (2017 onwards), and the Xbox One, Xbox One S, and Xbox Series X.",
    "Other streaming services that support spatial audio in the form of Dolby Atmos include Disney Plus, Hulu, Vudu, HBO Go, and Rakuten.",
    "As you may have guessed, Apple TV Plus comes with support for the brand’s Spatial Audio feature, as long as you’re watching with a pair of AirPods Pro or AirPods Max headphones. If you’re watching using your home cinema system, there are a number of titles available in Dolby Atmos.",
    "You can stream your music from Tidal in glorious spatial audio through your Atmos-enabled set-top box, TV, or speaker system. You'll need to have a $19.99 / £19.99 / AU$23.99 per month Tidal HiFi account to take advantage of this feature, as well as the right kit to properly experience the Dolby Atmos effect.",
    "The immersive audio format is also available on compatible Android phones and tablets, though this requires you to listen through headphones, so you won’t be getting ‘true’ Atmos.",
    "To find tracks in Atmos, looks for the Dolby symbol beside songs in the Tidal app.",
    "Amazon Music HD is the company’s Hi-Res streaming tier comes with a growing catalog of spatial audio music designed to be played with the Echo Studio smart speaker, including tracks mastered in Dolby Atmos and Sony’s 360 Reality Audio.",
    "Compatible tracks will appear with a 3D badge, and Amazon has also curated 3D audio playlists – though you can only experience them using the Echo Studio. Amazon Music HD costs $12.99 / £12.99 for Prime members, and $14.99 / £14.99 for everyone else. At the time of writing, the tier is still unavailable in Australia, but that works out at around AU$16 / $19.",
    "Most modern TV’s are compatible with spatial audio in the form of Dolby Atmos, including the Panasonic HZ2000 TV, the Philips OLED+935, and the LG CX OLED TV.",
    "While some Dolby Atmos-compatible TVs come with decent built-in speakers, you’ll probably want to hook them up to an external soundbar or speaker system to get the most out of the 3D audio format.",
    "As well as playing Dolby Atmos movies, you can get Dolby Atmos Music tracks via the Tidal app on compatible Android TVs from Sony and Philips.",
    "Many streaming dongles and boxes come with support for both Dolby Atmos and DTS:X, including the Chromecast with Google TV, Amazon Fire TV Stick HD, Apple TV 4K, and the Roku Streaming Stick Plus.",
    "Of course, you’ll need Dolby Atmos-compatible speakers hooked up to your TV to take advantage.",
    "One of the biggest announcements surrounding the PS5 was that is would come with 3D audio, using its own proprietary tech instead of allowing for Dolby Atmos support.",
    "Right now, you can only experience it through Sony’s own Pulse 3D Wireless Headset, though it’s expected that it will eventually be available via third party headphones, soundbars, and speakers.",
    "The Xbox Series X on the other hand, comes with Dolby Atmos upmixing, taking a non-Dolby Atmos source and turning it into an approximation of Dolby Atmos sound.",
    "The effect isn’t as immersive as true, encoded-at-source Dolby Atmos, but as the upmixing technology was developed by Dolby itself, you can be fairly confident that upmixed audio will pack more of a sonic punch than non-upmixed sources.",
    "Unlike the PS5’s 3D Audio technology, you can experience the Xbox Series X’s Dolby Atmos upmixing tech with your existing compatible speakers or headphones.",
    "Dolby Atmos and/or DTS:X support is becoming something of a standard for premium soundbars these days, with models like the Sonos Arc coming with dedicated upfiring tweeters that bounce sound up to your ceiling and back down to your ears.",
    "Many soundbars that don’t have upfiring tweeters come with support for Atmos Height Virtualization or DTS: Virtual X, using height cues to trick your ears into thinking the sound is coming at you from all angles.",
    "There are also more niche soundbars like the Creative SXFI Carrier, which combines the immersive sound of Dolby Atmos audio with the unique virtual surround sound of Creative's own Super X-FI technology.",
    "It's the first soundbar to support Super X-Fi technology, but you can only experience it if you plug in a pair of headphones – otherwise, Dolby Atmos is there to take up the spatial audio reins.",
    "If you want to add spatial audio to a multi-speaker setup, you can do so by adding a compatible AVR (audio-visual receiver).",
    "Many of today’s AVRs come with Dolby Atmos support, as well as DTS:X compatibility as standard. The inclusion of the latter technology means you can use them with your existing speaker setup and Blu-ray player without the need for extra height channels.",
    "If you do want to get a more immersive experience however, you can buy add-on height channels like the PSB Imagine XA Dolby-enabled speakers to bring upfired sound to your existing setup.",
    "If you want to add spatial audio to a multi-speaker setup, you can do so by adding a compatible AVR (audio-visual receiver).",
    "Many of today’s AVRs come with Dolby Atmos support, as well as DTS:X compatibility as standard. The inclusion of the latter technology means you can use them with your existing speaker setup and Blu-ray player without the need for extra height channels.",
    "If you do want to get a more immersive experience however, you can buy add-on height channels like the PSB Imagine XA Dolby-enabled speakers to bring upfired sound to your existing setup.",
    "There are but a few wireless speakers that support 3D Audio. The first wireless speaker to support Dolby Atmos was the Echo Studio, which also comes with support for Sony’s 360 Reality Audio.",
    "It was followed soon after by the Apple HomePod, which gained Atmos support via a software update in 2020.",
    "Neither of these smart speakers come with upfiring tweeters, so you’ll only be getting a virtual 3D audio experience. If true sonic height is important to you, you may be interested in Sony’s latest 360 Reality Audio-toting wireless speaker. The Sony SRS-RA5000 features a trio of up-firing speakers that spread audio vertically, giving your music a sense of height – and the company hasn't shied away from making them the star of the show, furnishing them in contrasting copper or silver depending on your choice of color.",
    "We’re hopeful that more wireless speaker manufacturers will include support for spatial audio in future models, and we think it’s increasingly likely as more music streaming services explore more immersive codecs.",
    "The Apple AirPods Pro and AirPods Max are probably the most popular headphones to boast immersive sound, with the brand’s own Spatial Audio technology on board.",
    "Of course, this is limited for use with a select number of iOS devices, so you’ll need to already be plugged into the Apple ecosystem to take advantage.",
    "Sony’s 360 Reality Audio is much less partisan, with the company saying that it works with headphones from most manufacturers. Saying that, the tech works best when using Sony’s own headphones, including the best headphones of 2021, the Sony WH-1000XM4.",
    "With compatible Sony models, you can use the Headphones Connect app to analyze your ear shape with your phone’s camera, which is used to optimize the sound output of your headphones for 360 Reality Audio.",
    "Creative’s SXFI Air Headphones work in a similar way, albeit with the company’s own spatial audio tech on board. The company also makes dongles that add the technology to third-party headphones."
  ],
  "headers": {
    "10": "Dolby Atmos",
    "18": "DTS:X",
    "21": "Apple Spatial Audio",
    "27": "Sony 360 Reality Audio",
    "30": "Super X-FI from Creative",
    "35": "Netflix",
    "37": "Amazon Prime Video",
    "39": "Apple TV Plus",
    "40": "Tidal",
    "43": "Amazon Music HD",
    "45": "TVs",
    "48": "Streaming devices",
    "50": "Game consoles",
    "55": "Soundbars",
    "59": "AVR setups with multiple speakers",
    "65": "Wireless speakers",
    "69": "Headphones"
  },
  "links": {
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "music streaming service": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Dolby Atmos for Headphones": "https://www.techradar.com/news/dolby-atmos-music-everything-you-need-to-know-about-the-immersive-sound-format",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "iPhone 7": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-7-1327947/review",
    "iPad Pro 11-inch": "https://www.techradar.com/reviews/ipad-pro-11",
    "iPad Air (3rd generation)": "https://www.techradar.com/reviews/ipad-air-2019",
    "iPad Pro 12.9-inch (3rd generation)": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "iPad mini (5th generation)": "https://www.techradar.com/reviews/ipad-mini-2019",
    "Sony 360 Reality Audio": "https://www.techradar.com/news/first-look-sony-360-reality-audio",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Amazon Prime": "https://www.techradar.com/best/best-amazon-prime-shows",
    "Amazon Fire TV": "https://www.techradar.com/reviews/amazon-fire-tv-2017-review",
    "Fire TV Sticks": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Amazon Music HD": "https://www.techradar.com/news/amazon-music-takes-on-tidal-with-hi-res-audio-streaming",
    "Hi-Res": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Panasonic HZ2000 TV": "https://www.techradar.com/reviews/panasonic-hz2000-4k-oled-tv",
    "Philips OLED+935": "https://www.techradar.com/reviews/philips-oled935-tv",
    "LG CX OLED TV": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Android TVs": "https://www.techradar.com/news/best-tv",
    "Dolby Atmos-compatible speakers": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Pulse 3D Wireless Headset": "https://www.techradar.com/reviews/ps5-pulse-3d-wireless-headset",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "Creative SXFI Carrier": "https://www.techradar.com/reviews/creative-sxfi-carrier",
    "Blu-ray player": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "PSB Imagine XA Dolby-enabled speakers": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Sony’s latest 360 Reality Audio-toting wireless speaker": "https://www.techradar.com/news/new-sony-wireless-speaker-boasts-unusual-design-with-an-important-audio-purpose",
    "wireless speaker": "https://www.techradar.com/reviews/huawei-sound-x-wireless-speaker",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Creative’s SXFI Air Headphones": "https://www.techradar.com/reviews/creative-sxfi-air-headphones-review"
  }
}