{
  "source": "https://www.techradar.com/news/netflix-wants-christopher-nolans-next-movie-but-would-he-do-it",
  "title": "Netflix wants Christopher Nolan's next movie – but would he do it?",
  "category": "entertainment",
  "updated": "2021-07-29T16:45:51Z",
  "author": "axel-metz",
  "summary": "Not for love nor money",
  "article": [
    "Christopher Nolan is a big fan of the theatrical experience – but he doesn't seem to dig streaming in the same way. Back in 2020, the Tenet director described HBO Max as “the worst [streamer] of the lot,” adding that Warner Bros’ hybrid release plan makes “no economic sense” when it comes to 2021 movies like Dune and The Suicide Squad.",
    "Well, Nolan’s reservations about streaming haven’t dampened the spirits of Netflix film chief Scott Stuber, who has voiced his desire to release the director’s next movie on the platform.",
    "In an interview with Variety, Stuber claimed he would do “everything [he] can” to work with Nolan “if and when he comes up with his new movie,” adding that you need to have “zero ego” in Hollywood and lauding Nolan for being “an incredible filmmaker.”",
    "High praise, indeed – but it’s not Netflix who needs convincing. Back in 2017, Nolan told IndieWire that “Netflix has a bizarre aversion to supporting theatrical films\" and a “mindless policy of everything having to be simultaneously streamed and released.” He has since toned down his feelings for streamers, but it still seems unlikely that Nolan would ever sign off on a deal that would see one of his movies never make it to the cinema.",
    "So what would Nolan stand to gain from penning a partnership with Netflix? Well, while the streamer would no doubt open the war chest to bring his vision to life, the big-budget director has never struggled for financing on his projects. Tenet cost a reported $200 million, while The Dark Knight Rises was green-lit with a budget of nearer $230 million.",
    "Netflix likes to spend big, that much is clear, but rarely that big. To date, the streamer’s biggest movie has been Martin Scorsese’s The Irishman, which commanded an estimated budget of $159 million.",
    "Reports suggest Netflix’s spy drama The Gray Man will become its most expensive ever at $200 million, but that figure only just approaches the region of Nolan’s latest projects. This year's Red Notice, starring Dwayne Johnson, Gal Gadot and Ryan Reynolds, could cost upwards of $160 million, according to a Variety report.",
    "It’s also unlikely that Netflix’s carte blanche approach to creative direction would be a major draw for the director. Typically, the streamer has given the reins over to filmmakers whose visions would be otherwise stifled by studio executives who have no time for bold ideas – David Fincher’s Mank, for instance – but again, that isn’t a problem Nolan has faced in recent years.",
    "Being the sure-fire, cash cow director he is, Warner Bros. has had no qualms signing off on completely original IP like Inception because it knows his movies will turn a profit – outside of pandemic times, of course.",
    "Still, in a reality where Netflix did manage to land Nolan, they'd have no problem giving his movies a platform. The streamer currently has around 210 million paid subscribers – which is probably slightly more than would typically see the director's movies in theaters.",
    "That’s still a fairly arbitrary comparison, though, and Nolan would likely argue on the contrary – putting his movies in cinemas allows everyone an equal opportunity to see them.",
    "For Netflix, landing Nolan is clearly still a dream scenario, based on Stuber's words. As for whether he stays with long-time collaborators Warner Bros., that's an altogether larger question – especially with rumors of a departure to rival studio Universal on the cards.",
    "Besides, Nolan isn’t the only acclaimed director on the streamer’s radar. Netflix recently penned a deal with Steven Spielberg’s movie studio, Amblin Partners, which will see it produce several new feature films for the platform every year – with some projects potentially directed by Spielberg himself.",
    "These new movies aren’t yet associated with any budgetary or genre requirements, either, so it’s likely that Netflix will benefit from more high-profile productions like Michael Bay's 6 Underground or The Irishman in the near future, in any case.",
    "If Netflix were to bag Spielberg and Nolan? Then theaters might have cause to panic.",
    "Via GamesRadar"
  ],
  "headers": {
    "4": "Analysis: Would Nolan make a Netflix movie?"
  },
  "links": {
    "described": "https://www.hollywoodreporter.com/business/business-news/christopher-nolan-rips-hbo-max-as-worst-streaming-service-denounces-warner-bros-plan-4101408/",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Dune": "https://www.techradar.com/news/dune-cast-release-date-trailer",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "Variety": "https://variety.com/2019/film/news/red-notice-dwayne-johnson-gal-gadot-ryan-reynolds-netflix-1203262879/",
    "IndieWire": "https://www.indiewire.com/2017/07/christopher-nolan-interview-dunkirk-netflix-1201857101/2/",
    "Reports": "https://finance.yahoo.com/news/netflix-most-expensive-productions-ever-190044132.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAADI_D7GhO2oBJMBc3yLBxf8Y_0BvLbtNlbbIlfRzIuqBhNekF0eYEfVxR094PpVT7r5iN1PKiSn6ImHrVB17QAKGCy5qCR59n9VSOUUOMDZEU_im2TV7gX9pqgF_nNA5MEQxJiLiVBhJaiZDbV_VZ0USbnUF1cpZVKzLcN_yRQX0#:~:text='The%20Gray%20Man'&text=it's%20not%20out%20yet.,biggest%20budget%20film%20so%20far.",
    "around 210 million": "https://www.statista.com/statistics/250934/quarterly-number-of-netflix-streaming-subscribers-worldwide/#:~:text=Netflix%20had%20207.64%20million%20paid,Netflix's%20total%20global%20subscriber%20base.",
    "rumors": "https://variety.com/2020/film/news/christopher-nolan-warner-bros-deal-hbo-max-1234849809/",
    "recently penned a deal": "https://www.techradar.com/news/netflix-lands-deal-with-steven-spielberg-for-new-movies",
    "GamesRadar": "https://www.gamesradar.com/netflix-wants-to-release-christopher-nolans-next-movie/"
  }
}