{
  "source": "https://www.techradar.com/news/chinas-cryptomining-ban-probably-wont-help-you-get-a-new-gpu",
  "title": "China's cryptomining ban probably won't help you get a new GPU",
  "category": "computing",
  "updated": "2021-09-27T10:26:02Z",
  "author": "jess-weatherbed",
  "summary": "A depressing reality check",
  "article": [
    "China has expanded its crackdown on cryptocurrencies after several months of closing down mining operations in the country, now going a step further and deeming all crypto-related activities illegal, as reported by the Financial Times.",
    "While this is clearly bad news for people trying to trade using digital currency within the country, PC gamers and builders might see this as the light at the end of the tunnel for the ongoing graphics card shortage. GPUs were snapped up en masse after the release of the Nvidia Ampere and AMD RDNA2 series to be used in Ethereum mining farms, causing frustration from the gaming community.",
    "In reality, this ban on cryptocurrency and related trading is unlikely to make finding a GPU any easier, though you might be able to snag a well-used one second hand in the expected mass selloff.",
    "Gamers will likely feel little pity for cryptominers in China, or those who made significant trades with people within the country, and while we certainly don't condone mining giving its ecological impact, reduced demand from cryptominers likely won't result in plentiful stock becoming available.",
    "We're in the midst of a global shortage of silicon chips thanks to high demand from almost every area of tech, from computers to cars and smartphones, and this is predicted to last well into 2022, or even beyond according to companies like Intel. Production has also been made worse due to the coronavirus pandemic, reducing the workforce for manufacturers like TSMC, the world's largest semiconductor foundry that supplies AMD, Apple, Nvidia and more.",
    "With so many large brands essentially forming a queue for available silicon, things are looking tight until manufacturing capacity can increase. This shortage isn't just affecting graphics cards either – other highly in-demand hardware such as Sony Playstation 5 consoles and cars have been affected.",
    "With demand over the pandemic being so high, and available inventory so low, it's created the perfect storm of hardware shortages with skyrocketing prices thanks to artificial inflation and scalpers utilizing bots to buy up what little available stock there is at MSRP (or close to it), and then reselling on sites like eBay and Facebook Marketplace for a hefty profit.",
    "Given Bitcoin hasn't been mined on consumer GPUs for a while, most of the crypto demand for graphics cards came from Ethereum miners. We might see a fresh flood of second hand (and heavily used) GPUs on the market as mining operations close down, but with existing demand already being so high and production badly impacted for the foreseeable future, it's unlikely that we will see an increase in available stock for some time.",
    "Thanks to a combination of Nvidia implementing a Hash Rate limiter on it's most sought after GPUs and China cracking down on mining operations in recent months, predictions emerged that we could see some improvement in stock availability, but in reality, the impact was been negligible in the face of the chip shortage.",
    "If you're happy to take a risk and buy a used product then we could see a second wave of second-hand GPUs appearing online, with previous listings for GeForce RTX 3060 card being advertised as low as 1,760 yuan (roughly $270/£195/AU$360). There are predictions however that large operations could be relocated to other countries with less restrictive laws on trading and mining cryptocurrency, with CBC reporting that up to a million Bitcoin processors might be moved to Alberta, Canada.",
    "While Bitcoin doesn't utilize consumer GPUs, Ethereum is also likely to persevere. While value originally tanked shortly after the announcement that China was introducing the blanket ban on cryptocurrency, Coindesk shows that there are still profits to be made, with value for both Bitcoin and Ethereum significantly higher than it was during the crash back in July.",
    "Sadly, there's no easy solution to this mess. It could be years until we see production levels finally reach the current demand, but there's a chance that the number of PC Gamers could have dropped off due to the lack of available hardware.",
    "Our suggestions, while not ideal for everyone, are to look into a gaming laptop or try a cloud streaming service like GeForce Now. Gaming laptops appear to be more readily available, and with prices so high for dedicated graphics cards, you can get an entire system for the same price as an Nvidia GeForce RTX 3080.",
    "Similarly, where pre-built gaming PCs were once shrugged off as being more expensive than building your own, system builders can get GPU stock directly from the manufacturer (or similar wholesalers), allowing them to get a much better rate on components. As a result, buying a pre-built PC might save you some cash and time rather than waiting for prices to recover.",
    "If you already have a system that you're trying to upgrade and your internet is decent, GeForce Now allows you to play games you already own via cloud gaming, and from our own tests, this is a far cry from the laggy gameplay seen during the launch of Google Stadia.",
    "We remain hopeful that something could change in the coming months, but most evidence suggests that we're in this for the long haul. Treat your aging hardware right, you might be dependant on it up until the launch of the Nvidia 4000 series."
  ],
  "headers": {
    "3": "Why can't I buy a GPU at MSRP?",
    "7": "Crypto will survive",
    "11": "What can you do?"
  },
  "links": {
    "Financial Times.": "https://www.ft.com/content/31f7edf7-8e05-46e1-8b13-061532f8db5f",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "AMD RDNA2": "https://www.techradar.com/news/amd-big-navi",
    "Ethereum": "https://www.techradar.com/news/ethereum-a-victim-of-its-own-success",
    "global shortage of silicon chips": "https://www.techradar.com/news/no-one-can-really-say-when-the-chip-shortage-will-end-heres-why",
    "according to companies like Intel": "https://www.techradar.com/news/even-intel-thinks-the-global-chip-shortage-could-last-years",
    "second-hand GPUs": "https://www.techradar.com/news/cryptominers-are-selling-off-rtx-cards-in-bulk-after-chinas-crypto-crackdown",
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "CBC reporting that up to a million Bitcoin processors might be moved to Alberta, Canada.": "https://www.cbc.ca/news/canada/calgary/bitcoin-mining-black-rock-petroleum-company-1.6106978",
    "Coindesk": "https://www.coindesk.com/",
    "number of PC Gamers could have dropped off": "https://www.techradar.com/news/is-the-current-gpu-market-killing-pc-gaming",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "Gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "pre-built gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Nvidia 4000 series": "https://www.techradar.com/news/nvidias-rtx-4000-gpus-promise-a-huge-performance-leap-but-amd-rdna-3-might-outdo-them"
  }
}