{
  "source": "https://www.techradar.com/news/whatsapp-edges-closer-to-multi-device-support",
  "title": "WhatsApp edges closer to multi-device support",
  "category": "computing",
  "updated": "2021-01-06T15:25:02Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Android beta shows more signs of support for multiple devices",
  "article": [
    "There have been hints and rumors of multi-device support coming to WhatsApp for what seems like forever. Now, in the latest beta version of the Android app, there are further signs of progress having been made and the promise that users will be able to test out the feature soon.",
    "The updated beta version of the app also requires users to agree to new terms of service – as we have been expecting for a while. Among the changes to the terms of privacy policy user must agree to are how WhatsApp share data with parent company Facebook.",
    "The updated terms of service are now part of WhatsApp Beta 2.21.1.1, but they won't make their way to the main release until February. The agreement screen in WhatsApp Beta indicates that the new policies come into force on February 8, 2021, and you will need to agree to them if you want to continue using the chat app.",
    "Multi-device support is something that users have been begging for for quite some time, and although it's still not activated or testable yet, the app does reveal that it will eventually be possible to use WhatsApp on the web without the need to keep your phone connected as you currently do.",
    "WhatsApp Beta doesn't give any indication of quite when we can expect multi-device support to be enabled, but in-app screens reveal that it will be possible to use WhatsApp on up to four devices at once. When the feature does go fully live, it will be possible to archive and mute chats, delete messages and chats, and place calls from the desktop app, but not all of these options will be available immediately",
    "If you are already signed up for the WhatsApp beta program, you will be able to download the latest update via Google Play. If you're not currently a beta user, there are unfortunately no more spaces available for new sign-ups, but you can keep an eye out for openings here.",
    "Via WABetaInfo"
  ],
  "headers": {
    "4": "Stay connected"
  },
  "links": {
    "we have been expecting": "https://www.techradar.com/news/whatsapp-plans-to-update-its-terms-of-service-what-to-expect",
    "here": "https://play.google.com/apps/testing/com.whatsapp",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-1-1-whats-new/"
  }
}