{
  "source": "https://www.techradar.com/news/budget-motherboards-and-gpus-could-get-pricier-due-to-copper-foil-shortage",
  "title": "Budget motherboards and GPUs could get pricier due to copper foil shortage",
  "category": "computing",
  "updated": "2021-09-30T10:08:20Z",
  "author": "darren-allan",
  "summary": "Rising production costs might even impact premium products too",
  "article": [
    "Apparently there are fresh pricing difficulties with PC components – and it’s apparently to do with the supply of copper foil which is used in printed circuit boards (PCBs).",
    "As Tom’s Hardware spotted, there is a DigiTimes report which points out that prices are heading upwards – indeed, ‘surging’ – for copper and copper-clad laminates (CCLs) which are used in the production of the aforementioned PCBs.",
    "This is due to the rising price of copper, and more specifically, the spiking price of copper foil which has gone up by some 35% or so since the end of 2020. CCLs are produced using this foil (on both sides), and so those price hikes – plus increased costs associated with higher transportation costs, and more overall demand for PCBs across the tech industry (a lot of the stuff is used in lithium batteries) – are leading to copper foil getting more expensive quite quickly.",
    "When it comes to PC components, graphics cards and motherboards in particular are in the firing line here because they use larger PCBs (motherboards especially are big hulking things, of course) and more layers (CCLs), and therefore more copper foil. High-end motherboards can use eight layers or more, as Tom’s points out, so it’s easy to see how small cost increases in copper foil can mount up.",
    "In the bigger picture, premium motherboards may not be likely to see any price hikes for the consumer simply because they are expensive pieces of equipment already, with large profit margins built-in (which is typical of any high-end kit, of course).",
    "So those big margins can easily enough absorb what are relatively small cost increases in procuring copper foil, with no need for manufacturers to tap the consumer for any extra cash. In theory, anyway – but there’s no guarantee that product makers won’t pass any increases on in this tougher economic climate, especially if the aforementioned demand and transport problems start to really make themselves felt in components where a lot of CCLs are used.",
    "When it comes to lower-end and more budget-oriented products, where margins are much slimmer, these thorny issues around copper foil could impact production costs more severely – with there likely being little choice but to pass this pain on to the consumer.",
    "We don’t need any more gloomy news on the supply front in the PC world, of course, but who knows – any price impact may be minimal. Only time will tell, but as we mentioned at the outset, the last thing we need is yet more upward movement on component prices."
  ],
  "headers": {
    "4": "Analysis: What kind of impact might these supply issues have?"
  },
  "links": {
    "PC components": "https://www.techradar.com/how-to/pc-components",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/motherboard-and-gpus-under-pressure-due-to-copper-foil-pricing",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "motherboards": "https://www.techradar.com/news/computing-components/motherboards/best-motherboard-14-reviewed-and-rated-904229",
    "gloomy news on the supply front": "https://www.techradar.com/news/global-chip-shortage-could-drag-on-until-2023"
  }
}