{
  "source": "https://www.techradar.com/news/intel-finally-nails-7nm-but-meteor-lake-cpus-wont-hit-until-2023",
  "title": "Intel finally nails 7nm, but Meteor Lake CPUs won’t hit until 2023",
  "category": "computing",
  "updated": "2021-03-24T11:46:04Z",
  "author": "darren-allan",
  "summary": "Presumably with an Alder Lake refresh – Raptor Lake? – coming next year",
  "article": [
    "Intel’s Meteor Lake desktop CPUs, built on a 7nm process, are progressing and will be shipping in 2023, the chip giant has announced.",
    "Meteor Lake chips have previously been glimpsed (in Linux code) with the expectation that they could be scheduled for 2022 or 2023, so the latter proved to be correct.",
    "The revelation was made at Intel’s ‘Unleashed: Engineering the Future’ event, and was delivered by new chief executive Pat Gelsinger, who made it clear that Intel has now tamed 7nm and solved the thorny problems which were proving serious roadblocks to changing up a gear in terms of manufacturing process.",
    "Gelsinger observed: “We’ve rearchitected and simplified our 7nm process flow, increasing our use of EUV by more than 100%.”",
    "He further stated: “Leveraging our 7nm process, we are advancing the development of lead data center and client CPUs – starting with ‘Meteor Lake,’ our high-volume 2023 client product. In fact, we expect to tape in our 7nm compute tile for Meteor Lake in the second quarter of this year.”",
    "Essentially, ‘taping in’ is a milestone which means that as of Q2, different elements of the CPU will be brought together, so the overall design can be finalized (and then ‘taped out’). As well as Meteor Lake, Intel will have Granite Rapids 7nm data center processors on the boil in 2023 as well.",
    "Meteor Lake is thought to be built along the same lines as Alder Lake, which is a hybrid design of big and small (power-efficient) cores. Meteor Lake is expected to combine Ocean Cove and Gracemont cores (whereas Alder Lake is Golden Cove plus Gracemont). It’ll also employ Intel’s Foveros tech – in other words, a 3D design where tiles are stacked on top of each other.",
    "While all this is obviously good news for Intel, the company has taken its sweet time getting here, and of course AMD has had 7nm products for some time now (while there is a lot more to CPU performance than simply what process it’s built on, that’s obviously an important factor). Intel’s imminent Rocket Lake CPUs are a backport of 10nm Cypress Cove tech to 14nm.",
    "Interestingly, while Intel says it will be producing most of its own chips in 2023, the company made it clear that some production for certain processors would be outsourced to TSMC. So, we’re looking at a two-pronged manufacturing strategy here.",
    "It’s not clear whether the outsourced chips will be 7nm, or another process, but both consumer and data center products will be made by TSMC, and Intel noted that these will be “additional leadership CPU products”, meaning key models.",
    "Gelsinger asserts: “There is a renewed sense of energy and excitement inside Intel that is building – excitement that our employees, partners and customers are not only seeing but echoing.”",
    "Going forward, as mentioned, the next steps for Intel’s desktop CPUs are Rocket Lake (still 14nm as mentioned) and Alder Lake (10nm), both of which are coming this year, and with Meteor Lake (7nm) now slated for 2023, that leaves one question – what’s coming in 2022?",
    "Next year could see a refresh of Alder Lake called Raptor Lake, or at least that’s one theory which has been floating around the rumor mill of late. That would make Raptor Lake 13th-gen and Meteor Lake 14th-gen, potentially with Lunar Lake to follow as the 15th-gen range in 2024.",
    "Treat all that as the speculation it is, and of course even if this is Intel’s plan right now, there’s no guarantee that this potential production roadmap will pan out as intended.",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "8": "Two prongs are better than one?"
  },
  "links": {
    "CPUs": "https://www.techradar.com/news/best-processors",
    "have previously been glimpsed": "https://www.techradar.com/news/weve-already-caught-a-glimpse-of-intels-13th-gen-meteor-lake-cpus",
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought",
    "Intel’s imminent Rocket Lake CPUs": "https://www.techradar.com/news/intel-finally-confirms-its-new-rocket-lake-s-processors-will-launch-on-march-30",
    "next steps for Intel’s desktop CPUs": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september",
    "Raptor Lake": "https://www.techradar.com/news/raptor-lake-could-be-intels-13th-gen-cpus-with-a-nice-surprise-for-gamers",
    "Lunar Lake to follow as the 15th-gen range in 2024": "https://www.techradar.com/news/intel-lunar-lake-spotted-again-but-rumored-14th-gen-cpus-may-not-arrive-for-ages",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/intel-fixes-7nm-meteor-lake-and-granite-rapids-coming-in-2023"
  }
}