{
  "source": "https://www.techradar.com/news/amazon-prime-day-gift-card-deal-gets-you-dollar10-after-buying-a-dollar40-gift-card",
  "title": "Amazon Prime Day gift card deal gets you $10 after buying a $40 gift card",
  "category": "news",
  "updated": "2021-06-22T14:07:00Z",
  "author": "matt-hanson",
  "summary": "A $40 gift card for them and a $10 gift card for you",
  "article": [
    "Amazon is giving away $10 gift cards in its Prime Day deals when you purchase a $40 gift card - essentially giving you $50 worth of gift cards for $40.",
    "To claim the Prime Day gift card deal, all you have to do is enter the code GCPRIME2021 at checkout with at least $40 worth of gift cards in your card, and your $10 promotional credit will be applied to your account within two days after the purchase is completed.",
    "Amazon is limiting it to one gift card per user and the deal is only valid until 11:59 p.m. (PT), June 22, 2021 while supplies last. So, you don't have long if you want to grab this deal!",
    "This Prime Day gift card deal is one of the most popular ones during Amazon Prime Day, and it’s easy to see why - it’s free money (that you need to spend at Amazon, but still).",
    "That said, watch out for the fine print here - as it's a little more complicated than it first appears. For one, the $10 credit will be applied to the account that paid for the $40 gift card unless you ship a physical card to someone else.",
    "For another, the promotional credit only applies to products and digital content sold by Amazon.com or Amazon Digital Services LLC - not on products from third-party vendors.",
    "The good news is that Amazon sells A LOT of stuff. When you factor in all the devices, all the eBooks, all the movies, shows and music available, it's a vast, vast catalogue of products to pick from, so we're sure you'll find a good use for the credit you'll get.",
    "No matter where you live, you'll find all the lowest prices for the Amazon gift cards on Prime Day right here, with offers available in your region."
  ],
  "headers": {
    "3": "The Amazon Prime Day gift card deal",
    "7": "More Amazon Prime Day gift card deals",
    "8": "More Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "$50 worth of gift cards for $40": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FExclusive-Gift-Card-Offer-July%2Fb%3Fie%3DUTF8%26node%3D14485264011%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2677182079255988000-20"
  }
}