{
  "source": "https://www.techradar.com/news/marvels-moon-knight-may-have-just-confirmed-oscar-isaac-casting",
  "title": "Marvel's Moon Knight may have just confirmed Oscar Isaac casting",
  "category": "entertainment",
  "updated": "2021-01-07T17:30:53Z",
  "author": "axel-metz",
  "summary": "Poe Dameron is coming to the MCU",
  "article": [
    "Moon Knight cinematographer Gregory Middleton has seemingly confirmed that Oscar Isaac will be donning the white cape of Marvel’s titular hero in the upcoming Disney Plus series.",
    "In a recent Instagram post, Middleton wrote: “Well the secret is out. It’s an honor to be a part of introducing a new character to the MCU #MoonKnight,” describing Oscar Isaac – who was tagged in the post – as an “amazing performer.\"",
    "The post all but confirms Isaac will portray the lead role as Marc Spector, the lesser-known superhuman crimefighter in the Marvel Cinematic Universe whose powers are granted by the Egyptian moon god Khonshu. The 41-year-old actor had been widely reported to front the series, with Keanu Reeves also rumoured to be in contention for the lead role.",
    "Middleton’s comments also confirm that the character’s signature white cape will feature in the show – “Who says cinematographers worry about white costumes!” – though this was perhaps more of a foregone conclusion than Isaac’s casting. Still, it’s good to see Disney sticking to the source material.",
    "Marvel’s Moon Knight series is one of a lot of MCU projects bound for the streaming service in 2021. WandaVision is just around the corner, set to premiere on Disney Plus starting January 15, before The Falcon and the Winter Soldier, Loki, She-Hulk, Ms. Marvel and Hawkeye all make their way to the platform later on in the year.",
    "Marvel's Chief Creative Officer Kevin Feige had previously suggested that both She-Hulk and Ms. Marvel would wrap production in 2020, but Covid-19 restrictions meant filming was halted for most of its projects – meaning its release slate has gone a little awry.",
    "Moon Knight was first announced at D23 way back in August 2019, so there’s no telling when to expect it’s arrival on Disney Plus – given that Isaac’s casting as the lead has only just been announced (and still unofficially, mind), it’s not likely to be any time soon. Still, it looks like there’ll be enough Marvel to go around until then."
  ],
  "headers": {
    "3": "Coming soon"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "widely reported to front the series": "https://www.techradar.com/news/moon-knight-oscar-isaac-in-talks-for-lead-role-in-latest-disney-plus-mcu-casting-news",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained"
  }
}