{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-is-dollar50-off-in-amazons-black-friday-sales",
  "title": "Samsung Galaxy Watch 4 is $50 off in Amazon's Black Friday sales",
  "category": "wearables",
  "updated": "2021-11-26T04:57:53Z",
  "author": "tom-bedford",
  "summary": "Off the standard and Classic watches",
  "article": [
    "The Samsung Galaxy Watch 4 and Watch 4 Classic, the two newest smartwatches from the tech giant, are both discounted by $50 at Amazon as part of its Black Friday deals.",
    "That's a modest Black Friday smartwatch deal but these are two very new devices, which means the unimpressive reduction can be forgiven somewhat. The discount affects all four sizes of the watch (two for the standard and two for the Classic) for different colors and connectivity options too.",
    "(Not in the US? Scroll down for deals in your region).",
    "Both the Galaxy Watch 4 models run the newest version of Wear OS, designed by Google in collaboration with Samsung, and they have loads of fitness modes and health tracking features as well as lifestyle tools.",
    "What's the difference between the standard and Classic smartwatch? Well the latter comes in slightly bigger sizing options, has a more classic watch design, and has a rotating bezel for easier navigation. Oh, and it costs more money.",
    "No matter where you live, you'll find all the lowest prices for the Samsung Galaxy Watch 4 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Samsung Galaxy Watch 4 Black Friday deal",
    "5": "More Samsung Galaxy Watch 4 deals",
    "6": "More Black Friday deals"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday smartwatch deal": "https://www.techradar.com/news/black-friday-smartwatch-deals"
  }
}