{
  "source": "https://www.techradar.com/news/dogecoin-price-surges-to-new-all-time-high-on-etoro-listing",
  "title": "Dogecoin price surges to new all-time high on eToro listing",
  "category": "computing",
  "updated": "2021-05-06T11:00:20Z",
  "author": "anthony-spadafora",
  "summary": "Meme cryptocurrency has surpassed $.050 a coin",
  "article": [
    "Following its recent jump in price last month ahead of DogeDay, the meme cryptocurrency Dogecoin (DOGE) has once again hit a new all-time high after being listed on two additional cryptocurrency exchanges.",
    "The cryptocurrency has finally managed to surpass $0.50 a coin after falling slightly from a previous record price of $0.47 back in mid-April according to data from CoinDesk. Since the beginning of this year though, Dogecoin's price has climbed by an impressive 11,000 percent.",
    "Dogecoin's latest boost comes after the trading platform eToro announced that it would add support for the cryptocurrency following strong customer demand. By listing Dogecoin on its platform, eToro is opening it up to around 20m users worldwide that could help drive its price up even further.",
    "Following the news, the cryptocurrency exchange Gemini announced that it too would support Dogecoin by allowing its 13.6m users to purchase it.",
    "While eToro and Gemini listing the cryptocurrency is certainly a big deal, if Coinbase finally decides to support Dogecoin its 56m users could help push the coin's price to $1.",
    "In addition to being listed on eToro and Gemini, more businesses have begun accepting Dogecoin for payments including the medical supplier CovCare, Newegg and the NBA team the Dallas Mavericks which has also helped drive up the cryptocurrency's price.",
    "The pro baseball team the Oakland Athletics also recently announced that it would sell two-seat pods for 100 DOGE (around $48) for its upcoming three-match series against the Toronto Blue Jays.",
    "In a statement, CEO and Founder of Allnodes, Konstantin Boyko-Romanovsky provided further insight on Dogecoin's growing popularity, saying:",
    "“Dogecoin continues to defy expectations within the crypto market. I believe that part of the reason is the hype that surrounds it, which comes from celebrities like Elon Musk and Mark Cuban. Since the coin has an inflationary supply, it is affordable. Mark Cuban sees it as an alternative to Bitcoin for payment transactions. It appeals more to the general public because it costs so little. $60,000 for a single Bitcoin may be intimidating to some. In a way, Doge then is more like a USD but in a digital form.”",
    "Although Dogecoin was launched in 2013 by IBM developer Billy Markus and Adobe data scientist Jackson Palmer as a joke, the cryptocurrency now has a market capitalization of $59bn and has become the fourth-largest cryptocurrency in the world.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies."
  ],
  "headers": {
    "5": "Dogecoin hype"
  },
  "links": {
    "Dogecoin": "https://www.techradar.com/news/what-is-dogecoin-all-you-need-to-know-about-the-meme-cryptocurrency-explained",
    "cryptocurrency exchanges": "https://www.techradar.com/best/mining-rigs",
    "CoinDesk": "https://www.coindesk.com/price/dogecoin",
    "eToro": "https://www.techradar.com/best/mining-pools",
    "Coinbase": "https://www.techradar.com/reviews/coinbase-cryptocurrency-exchange",
    "Newegg": "https://www.techradar.com/news/dogecoin-can-now-be-used-to-buy-a-ps5-or-geforce-rtx-3080-at-newegg",
    "two-seat pods for 100 DOGE": "https://twitter.com/Athletics/status/1389260734329094144?s=20",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs"
  }
}