{
  "source": "https://www.techradar.com/news/zoom-will-soon-make-it-obvious-if-youre-late-to-your-next-big-meeting",
  "title": "Zoom will soon make it obvious if you're late to your next big meeting",
  "category": "computing",
  "updated": "2021-12-02T05:00:04Z",
  "author": "anthony-spadafora",
  "summary": "Hosts and co-hosts can now easily see if everyone has joined a meeting",
  "article": [
    "Zoom is rolling out a number of new updates for its video conferencing software and one of them might finally encourage users to ensure they're on time for their next big meeting.",
    "According to a new blog post from the company, Attendance Status makes it easier for organizations to streamline the start of their Zoom Meetings by allowing meeting hosts and co-hosts using its Google Calendar or Outlook Calendar integrations to view who has accepted or declined a meeting invite.",
    "However, this new feature also gives them the ability to see whether everyone invited to a meeting has joined. If you're used to arriving earlier for video calls, you should be fine but for those that try to slink in unnoticed later on in a meeting, your boss or manager will now be aware of your absence, so tread carefully.",
    "You'll also no longer be able to use the excuse that you had to update your Zoom client as Zoom recently added a new automatic update feature for Windows and macOS that ensures everyone in a meeting is running the latest version of the company's software.",
    "In addition to its new Attendance Status feature, Zoom is also rolling out other new features to help hosts engage with their attendees and get the most out of their recorded content.",
    "As a presenter isn't always the one controlling a slide show, Zoom users can now select multiple people to control the movements of slides in a presentation. This means that presenters will no longer have to ask another attendee to move their presentation forward.",
    "When it comes to getting feedback and insights from team members during meetings, Zoom has added more options for creating polls including ranked responses, matching, short and long answers and even fill in the blank. At the same time though, this feature can also be used for quizzes to create more effective experiences for students, onboarding sessions or other events.",
    "Finally, Zoom is adding additional watermark settings to its software to help organizations and individuals get the most out of their recorded content and avoid distracting watermarks. Users can now set the size and placement of watermarks as well as enable them by default and customize them via the web portal prior to starting a meeting.",
    "Looking to improve your video calls? Check out our roundups of the best video conferencing software, best business webcams and best headsets for conference calls"
  ],
  "headers": {
    "4": "Slides, polling and watermarks"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "blog post": "https://blog.zoom.us/november-2021-product-updates/",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "Outlook Calendar": "https://www.techradar.com/reviews/outlook-calendar",
    "automatic update feature": "https://www.techradar.com/news/zoom-is-finally-adding-this-essential-feature-on-windows-and-macos",
    "presentation": "https://www.techradar.com/best/best-presentation-software",
    "polls": "https://www.techradar.com/best/best-qanda-and-polling-platforms",
    "quizzes": "https://www.techradar.com/news/this-free-microsoft-tool-will-take-any-zoom-quiz-to-the-next-level",
    "best video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "best business webcams": "https://www.techradar.com/best/best-business-webcams",
    "best headsets for conference calls": "https://www.techradar.com/news/best-business-headphones-and-earphones"
  }
}