{
  "source": "https://www.techradar.com/news/the-next-mass-effect-gets-a-new-narrative-producer",
  "title": "The next Mass Effect gets a new narrative producer",
  "category": "gaming",
  "updated": "2021-06-09T18:09:16Z",
  "author": "samuel-tolbert",
  "summary": "Building the team",
  "article": [
    "The next Mass Effect game is still years away but it looks like development is starting to ramp up at BioWare.",
    "Hilary Heskett, who previously worked at EA before heading over to Bethesda Softworks as a brand manager, returned to EA back in May 2020. Recently, she confirmed on Twitter that she'll be part of the team on the new Mass Effect game and is taking on the role of a narrative producer.",
    "The next Mass Effect is being led by Mike Gamble, with a teaser trailer for the game first unveiled at the Game Awards 2020. Gamble is working as director on the project, with a 'veteran team' being assembled.",
    "The teaser trailer is vague but it does hint that the game takes place at least partially in the Milky Way galaxy, as we see an older Liara T'Soni and fallen Reapers.",
    "Even if the team is growing, players shouldn't expect to see the next Mass Effect for a while. BioWare's other big upcoming roleplaying game (RPG), Dragon Age 4, is likely going to arrive first and even that game doesn't appear to be close.",
    "We've seen bits and pieces of Dragon Age 4 that indicate it's set in the Tevinter Imperium, home of a ruling class of Blood Mages. The game does not have a release date or a release window at this time. Reports suggest that it will be a traditional single-player RPG, eschewing prior plans for a multiplayer experience of some kind.",
    "Whenever Dragon Age 4 and the next Mass Effect do arrive, it's safe to assume they'll be available on Xbox Series X, Xbox Series S, PS5 and PC."
  ],
  "headers": {
    "4": "This game is still a long ways off"
  },
  "links": {
    "next Mass Effect": "https://www.windowscentral.com/mass-effect-next",
    "teaser trailer": "https://www.techradar.com/news/the-new-mass-effect-trailer-could-be-the-first-sign-of-a-true-mass-effect-4",
    "Dragon Age 4": "https://www.techradar.com/news/dragon-age-4-release-date-news-and-rumors",
    "Reports suggest": "https://www.techradar.com/news/dragon-age-4-is-going-to-be-a-solo-experience-after-eas-change-of-heart",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}