{
  "source": "https://www.techradar.com/news/google-pixel-6-vs-google-pixel-6-pro-how-do-the-new-phones-compare",
  "title": "Google Pixel 6 vs Google Pixel 6 Pro: how do the new phones compare?",
  "category": "phones",
  "updated": "2021-10-29T11:29:37Z",
  "author": "james-rogerson",
  "summary": "Going Pro is a big upgrade",
  "article": [
    "Google has finally fully unveiled the Pixel 6 and the Pixel 6 Pro. This came months after the company partially revealed the phones, so it's been a long time coming, but we now know all the juicy details.",
    "The question you might be asking yourself right now then is which - if either - to buy, and to help you answer that we've compared the Pixel 6 and the Pixel 6 Pro in all the areas that matter, so you can see exactly how they compare.",
    "From their designs to their screens, cameras, power, price and more, here's how Google's latest two Pixel handsets stack up.",
    "The Google Pixel 6 and the Google Pixel 6 Pro have very similar designs, and both have that distinctive camera bump you can see in the images above and below, but there are some differences.",
    "For one thing, the colors vary. Both phones come in three shades, but with the Pixel 6 you get the choice of a red and peach combination (called Kinda Coral), a black and grey (called Stormy Black), or a green and yellow (known as Sorta Seafoam).",
    "With the Pixel 6 Pro there’s the option of yellow and orange (Sorta Sunny), white and grey (Cloudy White), or black and grey (Stormy Black).",
    "Note that in all cases they also have a black camera bump, and that some colors will only have limited availability. Google claims that Kinda Coral and Sorta Sunny will only be available in limited quantities, and only during the fourth quarter of the year, while if you pick a 256GB Pixel 6 Pro then you'll only be able to get it in Stormy Black.",
    "You'll notice that the camera bump has a matte black top and bottom edge on the Pixel 6, as do the sides of the phone, while on the Google Pixel 6 Pro these elements are glossy silver on the white model, and a gold shade on the yellow one.",
    "You’ll also notice that the area above the camera block is larger on the Pixel 6 Pro than on the Google Pixel 6.",
    "Their dimensions and weight also vary, with the Google Pixel 6 coming in at 158.6 x 74.8 x 8.9mm and 207g, while the Pixel 6 Pro is 163.9 x 75.9 x 8.9mm and 210g. So the Pixel 6 Pro is slightly taller, wider and heavier, but not by much, and it's the same thickness.",
    "There are some differences in materials too - they both use tough Gorilla Glass Victus on the front, but while the Pixel 6 Pro also uses this on the back, the standard Google Pixel 6 uses slightly less tough Gorilla Glass 6. And while the Pixel 6 Pro has a polished alloy frame, the Pixel 6 instead has a tactile alloy frame.",
    "However both have the same level of water and dust resistance, with an IP68 rating.",
    "As for the display, that’s a 6.7-inch 1440 x 3120 curved OLED screen with a 120Hz refresh rate on the Pixel 6 Pro, while the standard Pixel 6 has a 6.4-inch 1080 x 2400 flat OLED screen with a 90Hz refresh rate.",
    "So you're getting a larger, curvier screen with a higher refresh rate on the Google Pixel 6 Pro. The Pro also has more pixels per inch, at 512 to the Pixel 6's 411. Both phones support HDR10 though, and use tough Gorilla Glass Victus to protect the screens.",
    "They also both have a 1,000,000:1 contrast ratio, but their aspect ratios are slightly different, with the Google Pixel 6 Pro's screen being 19.5:9, while the standard Pixel 6's is 20:9.",
    "The Google Pixel 6 has a dual-lens camera, including a 50MP f/1.85 main camera and a 12MP f/2.2 ultra-wide one (with a 114-degree field of view). The Google Pixel 6 Pro has all the same lenses, but additionally has a 48MP f/3.5 telephoto one offering 4x optical zoom.",
    "On the front meanwhile you get an 8MP f/2.0 camera on the Pixel 6 and an 11.1MP f/2.2 camera on the Pixel 6 Pro. The latter of these has a slightly wider field of view, at 94 degrees rather than 84.",
    "The front snapper on the Pixel 6 Pro also supports 4K video recording, and 1080p at 60fps, while the standard model just supports 1080p and just at 30fps, though there's no difference to the video skills of the rear cameras.",
    "As for the battery, there's a 4,614mAh one in the Google Pixel 6 and a 5,003mAh one in the Pixel 6 Pro. Despite being bigger though the latter also charges faster, at up to 50% in 30 minutes (with a 30W charger that's sold separately). The standard Pixel 6 meanwhile can reach up to a 30% charge in the same time with the same charger.",
    "Both phones also support wireless charging, at up to 21W with the Pixel 6 and 23W with the Pixel 6 Pro, and Google claims that both can last for up to 24 hours between charges - or up to 48 hours if using Extreme Battery Saver mode.",
    "The big new spec of the Pixel 6 range is its Google Tensor chipset, as this is the first time the company has made its own one. But this is found in both the Pixel 6 and the Pixel 6 Pro, so there’s no difference there.",
    "Where the phones may well differ is in RAM and storage, as while the Pixel 6 comes with 8GB of RAM and a choice of 128GB or 256GB of storage, the Pixel 6 Pro comes with 12GB of RAM and a choice of 128GB or 256GB of storage.",
    "There's also an ultra-wideband chip in the Pixel 6 Pro, allowing for more accurate ranging and spatial orientation than you get with the standard Google Pixel 6.",
    "But the remaining features and the software are otherwise much the same. Both run Android 12 with the promise of at least five years of security updates, both support 5G, and both have stereo speakers and an under-display fingerprint scanner.",
    "So far we only have partial pricing for Google Pixel 6 deals, but we know that the Google Pixel 6 (128GB) starts at $599 / £599 / AU$999, while the Pixel 6 Pro (128GB) starts at $899 / £849 / AU$1,299.",
    "In Australia, the 256GB Pixel 6 model costs AU$1,129 while the Pixel 6 Pro 256GB model costs AU$1,449, and the 512GB config sets you back AU$1,599.",
    "For reference, the Google Pixel 5 retailed for $699 / £599 / AU$999, so the Pixel 6 costs a similar amount, while the Pixel 6 Pro costs more. Both phones will be available in stores from October 28.",
    "If you choose the Google Pixel 6 Pro then you're getting a phone with a larger, higher resolution screen with a higher refresh rate, plus an extra camera lens, a better front-facing camera, a bigger (and faster charging) battery, more RAM and a slightly tougher build.",
    "On paper it's a significantly better phone, but it's also a bit bigger and a lot more expensive, so it won't be the right fit for everyone. Still, it seems like the Google Pixel 6 Pro is a true flagship, which is nice to see given that last year Google stuck exclusively with mid-range phones.",
    "But specs might not tell the whole story, so you might want to wait for our full reviews before buying either of these phones."
  ],
  "headers": {
    "3": "Design",
    "12": "Display",
    "15": "Camera and battery",
    "20": "Specs and features",
    "24": "Price",
    "27": "Takeaway"
  },
  "links": {
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "stereo speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "Google Pixel 6 deals": "https://www.techradar.com/deals/best-google-pixel-6-deals-and-google-pixel-6-pro-deals-to-pre-order",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5"
  }
}