{
  "source": "https://www.techradar.com/news/you-wont-be-able-to-buy-the-mi-mix-4-xiaomis-new-galaxy-note-21-replacement",
  "title": "You won't be able to buy the Mi Mix 4, Xiaomi's new Galaxy Note 21 replacement",
  "category": "phones",
  "updated": "2021-08-11T13:43:49Z",
  "author": "tom-bedford",
  "summary": "Mi Mix 4 is possibly China-only",
  "article": [
    "The new Xiaomi Mi Mix 4 has an under-display selfie camera, premium design and super-fast charging; it's everything we hoped the Galaxy Note 21 would be and more... except, like Samsung's cancelled phablet, you'll likely never hold it in your hand.",
    "Via Twitter, in response to comments on one of its posts, Xiaomi UK has confirmed that there are \"no plans to sell this model in the UK\". The brand left the same comment under many posts, clearly at pains to make the issue clear.",
    "While the UK is far from the only place in the world beyond China, with Xiaomi phones also being popular in India and mainland Europe, many other regional Xiaomi Twitter accounts haven't posted about the Mi Mix 4 at all, also suggesting there are no plans to launch the phone there.",
    "Xiaomi is vocal about its plans for world smartphone market domination. \"We aim to become global number one in three years\" said company CEO Lei Jun at the Mi Mix 4 launch, as reported by the BBC, and according to some reports they've already succeeded already – at the very least, they're top in Europe.",
    "It's curious that a brand with such big aspirations would launch impressive-looking products at widely-covered events, but then only launch them in one market, even if it's the biggest phone market in the world. Xiaomi is no stranger to launching China-exclusive products – it's not the only company that does so – but none of Xiaomi's closest competitors do.",
    "Xiaomi's current strategy in Europe and India seems to be releasing a glut of low-cost phones from its Pocophone and Redmi lines, but not launching all its premium flashy devices like the Mi Mix Fold, Mi 11 Pro and now the Mi Mix 4.",
    "Presumably there are complex business reasons behind the decision not to release all its top products globally, but from the outside, it doesn't look great on Xiaomi. Either the brand doesn't value its global audience enough to offer the interesting phones, or it's too chicken to expand its operations fully by mass-producing its most top-end devices on the scale it'd need.",
    "Hopefully soon, we'll see more Xiaomi phones reach the European shores – but until then, we'll be enjoying the wider selection of foldables and top-end handsets other companies actually do launch worldwide."
  ],
  "headers": {
    "3": "Analysis: big plans, little action"
  },
  "links": {
    "Xiaomi Mi Mix 4": "https://www.techradar.com/news/xiaomi-mi-mix-4-news",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Xiaomi UK": "https://twitter.com/XiaomiUK/status/1425114676720017410",
    "BBC": "https://www.bbc.co.uk/news/business-58168547",
    "some reports": "https://www.sammobile.com/news/xiaomi-dethrones-samsung-worlds-biggest-smartphone-brand-q2-2021/",
    "they're top in Europe": "https://www.techradar.com/news/samsung-is-no-longer-the-biggest-smartphone-vendor-in-europe",
    "Mi Mix Fold": "https://www.techradar.com/news/xiaomi-mi-mix-fold-release-date-price-features-and-everything-you-need-to-know",
    "Mi 11 Pro": "https://www.techradar.com/news/xiaomi-mi-11-pro-is-real-but-you-wont-be-able-to-buy-it"
  }
}