{
  "source": "https://www.techradar.com/news/microsoft-teams-will-now-recap-your-meetings-for-you",
  "title": "Microsoft Teams will now recap your meetings for you",
  "category": "computing",
  "updated": "2021-01-18T08:59:31Z",
  "author": "barclay-ballard",
  "summary": "Very useful for those missed meetings",
  "article": [
    "Microsoft Teams has a new feature that will allow users to access important information from a meeting following its conclusion. The recap feature will begin its rollout by the end of January and is expected to be with all Teams users by mid-February.",
    "The new addition will allow Teams users to access meeting recordings, chat messages, notes and transcripts from the meeting tab. The feature is expected to prove extremely useful for individuals that may have been unable to attend a meeting, as well as those that were present but want to access the relevant information at a later time.",
    "Following the coronavirus pandemic, digital tools like Microsoft Teams have increasingly been used to allow members of staff to remain in contact and collaborate while face-to-face meetings are not possible. However, there remains logistical challenges and not every individual can be present at every meet meeting, even remotely. The new recap feature should make it easier to ensure members of staff do not miss out on important discussions.",
    "Microsoft has launched a number of new features for its Teams platform of late. In addition to the recap functionality, a history menu will be launched in February that will make it easier for users to navigate to previously visited locations, and enhanced search functionality should make finding specific content more straightforward.",
    "Teams has had to compete with other popular collaboration tools, including Zoom and Google Meet, all of which have seen their popularity surge over the last 12 months.",
    "Teams may be at an advantage, however, if it leverages the popularity of Microsoft’s other office solutions. Recently, the company announced that a new Presenter View for Teams would enable it to better incorporate Microsoft PowerPoint presentations.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "A presentation platform"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Presenter View": "https://www.techradar.com/news/microsoft-teams-is-testing-a-new-feature-that-will-give-your-presentations-extra-oomph",
    "Windows Latest": "https://www.windowslatest.com/2021/01/14/microsoft-teams-is-getting-meeting-recap-new-navigation-experience/"
  }
}