{
  "source": "https://www.techradar.com/news/sonys-wh-ch710n-wireless-headphones-cost-much-less-than-usual-over-black-friday",
  "title": "Sony's WH-CH710N wireless headphones cost much less than usual over Black Friday",
  "category": "audio-visual",
  "updated": "2021-11-24T13:43:02Z",
  "author": "rhys-wood",
  "summary": "A massive saving on one of Sony's best headphones",
  "article": [
    "The Sony WH-CH710N noise cancelling wireless headphones are almost half off during the Amazon Black Friday sales. This incredible deal puts one of Sony's best headphones at one of the lowest prices we've seen during the online sales extravaganza.",
    "With Black Friday deals in full swing, it's been easier than ever to get a great pair of Sony headphones at a discounted price. Right now over at Amazon US, you can save over $100 on the WH-CH710N, as the retailer has discounted them to just $78.",
    "Things look just as good across the pond, where the WH-CH710N wireless headphones have been slashed to just £69 at Amazon UK, down from the usual retail price of £130.",
    "Prefer to shop elsewhere? The Sony WH-CH710N have been discounted to the same price at both Very and Currys in the UK. This is great news, as it means there are other options in place should Amazon sell through its entire stock.",
    "(Not in the US or the UK? Scroll down for deals in your region).",
    "Can't quite afford the WH-CH710N wireless headphones? Sony's WH-CH510 might be your next best option. We rated these over-ears highly in our review, citing great audio and battery life as two big reasons to grab these affordable headphones.",
    "While certainly not quite as excellent as the pricier Sony WH-1000XM3s or its flagship WH-1000XM4s, the WH-CH710N noise cancelling headphones remain an excellent choice if you're after a solid pair of over-ears at a bargain price.",
    "Boasting a fun, energetic sound profile and fantastic 35-hour battery life, the WH-CH710Ns are really only let down by cheap build quality, and their noise cancellation works just fine, but is by no means class-leading.",
    "If you're looking for something of a higher quality, we'd recommend checking out our Sony WH-1000XM4 Black Friday deals hub, where you'll find a range of great deals on Sony's best headphones. We also have a buying guide for the best over-ear headphones you can buy, if you'd like some more professional, tested advice before you commit to a Black Friday purchase.",
    "No matter where you live, you'll find all the lowest prices for the Sony WH-CH710N noise cancelling wireless headphones from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best Sony WH-CH710N Black Friday deals (US)",
    "6": "Today's best Sony WH-CH710N Black Friday deals (UK)",
    "9": "More Sony WH-CH710N Black Friday deals",
    "10": "More Black Friday deals"
  },
  "links": {
    "Sony WH-CH710N": "https://www.techradar.com/reviews/sony-wh-ch710n",
    "Amazon Black Friday": "https://www.techradar.com/black-friday/amazon-black-friday-deals",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "just $78": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB085RNVJ3P%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1224973723740216800-20",
    "just £69 at Amazon UK": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB086LLYK4S%3Fth%3D1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1264509684714288600-21",
    "Very": "https://www.awin1.com/awclick.php?awinmid=3090&awinaffid=103504&clickref=trd-us-1278748707487372300&p=https%3A%2F%2Fwww.very.co.uk%2Fsony-whch710n-noise-cancelling-wireless-headphones-with-35-hours-battery-life-quick-charge-built-in-mic-and-voice-assistant%2F1600472837.prd%3F_requestid%3D890358%26Ntt%3Dsony%2520wh%2520ch710n",
    "Currys": "https://www.awin1.com/awclick.php?awinmid=1599&awinaffid=103504&clickref=trd-us-6898814035985224000&p=https%3A%2F%2Fwww.currys.co.uk%2Fgbuk%2Faudio-and-headphones%2Fheadphones%2Fheadphones%2Fsony-wh-ch710n-wireless-bluetooth-noise-cancelling-headphones-white-10206714-pdt.html",
    "WH-CH510": "https://www.techradar.com/reviews/sony-wh-ch510",
    "Sony WH-1000XM3": "https://www.techradar.com/deals/the-best-sony-wh-1000xm3-sales-prices-and-deals",
    "WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Sony WH-1000XM4 Black Friday deals": "https://www.techradar.com/black-friday/black-friday-sony-wh1000xm4-deals",
    "best over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342"
  }
}