{
  "source": "https://www.techradar.com/news/knives-out-2-may-have-an-all-star-cast-to-rival-the-original-heres-why",
  "title": "Knives Out 2 may have an all-star cast to rival the original – here's why",
  "category": "entertainment",
  "updated": "2021-05-12T09:02:52Z",
  "author": "tom-power",
  "summary": "Edward Norton has reportedly joined Knives Out 2",
  "article": [
    "Knives Out 2 is shaping up to have a cast that could be as good as the original movie. Netflix's upcoming murder mystery sequel officially landed Dave Bautista yesterday (May 11), and it appears that another A-list actor has signed on to star alongside the Guardians of the Galaxy star and the returning Daniel Craig.",
    "According to Deadline, Edward Norton has agreed to join Rian Johnson's follow-up to his 2019 smash hit. There's no word on what character Norton would play and, unlike Bautista, the Fight Club and Grand Budapest Hotel star hasn't confirmed the news himself on social media.",
    "What we do know, though, is that the movie is set to start shooting soon. Per the same report from Deadline, Knives Out 2 will start production this summer in Greece. If that's the case, we can expect plenty of other casting announcements in the coming days and weeks.",
    "It looks like Johnson is trying to top the cast that he assembled for Knives Out with its sequel, but there's still some way to go before we can categorically say yes or no.",
    "Knives Out 2 only has three actors so far in Craig, Bautista and Norton. As we said, while it's early days, Knives Out had a superb cast full of award winners and household names, so Knives Out 2 will really need to step up its game if it wants to best its predecessor on that front.",
    "Knives Out's cast was made up of huge stars including ex-Captain America star Chris Evans, Golden Globe winner Jamie Lee Curtis, the late, legendary Oscar winner Christopher Plummer and breakout star Ana de Armas among its 18-strong cast. Knives Out 2, then, will need more massive names if it hopes to overthrow its sibling in the casting stakes.",
    "Norton's casting, though, does represent something of a win for Knives Out 2. The Moonrise Kingdom actor has been pretty selective about his roles in recent years, and hasn't appeared in a movie since 2019.",
    "Norton will feature in Wes Anderson's upcoming flick The French Dispatch, but that film's release date was pushed back 12 months due to the Covid-19 pandemic. Before that, Norton had only starred, or played a supporting role, in seven movies since 2014.",
    "His signing up to Knives Out 2, then, is something of a coup for Johnson, and shows that actors are eager to feature in his whodunit sequel regardless of their role. We'll find out more about the Knives Out 2 cast as more announcements are made.",
    "Netflix recently bought the rights to two Knives Out sequels for an eye watering $450 million, but we have no idea about potential release dates for either movie yet."
  ],
  "headers": {
    "3": "Analysis: will Knives Out 2 have an all-star cast to rival its predecessor?"
  },
  "links": {
    "officially landed Dave Bautista": "https://www.techradar.com/news/knives-out-2-has-just-added-this-mcu-star-to-its-cast",
    "Deadline": "https://deadline.com/2021/05/knives-out-2-edward-norton-daniel-craig-rian-johnson-1234752619/",
    "bought the rights": "https://www.techradar.com/news/netflix-is-making-two-knives-out-sequels"
  }
}