{
  "source": "https://www.techradar.com/news/intel-rocket-lake-allows-for-new-world-record-ram-overclock-of-a-staggering-7156mhz",
  "title": "Intel Rocket Lake allows for new world record RAM overclock of a staggering 7156MHz",
  "category": "computing",
  "updated": "2021-04-13T09:33:22Z",
  "author": "darren-allan",
  "summary": "MSI overclocking team works wonders with HyperX DDR4 RAM",
  "article": [
    "Intrepid overclockers have managed to juice up a stick of RAM to set a new world record speed of 7,156MHz.",
    "The feat was achieved by MSI overclocking experts in a Rocket Lake-powered PC built around the new Core i9-11900K. The stick of 8GB HyperX Predator DDR4 memory is officially rated as 4600MHz, so the overclock represents a massive 55% speed increase.",
    "As PC Gamer reports, that sets a new world record, although as you can imagine this isn’t something you can achieve yourself, or even get remotely near.",
    "The completely impractical method that the MSI overclockers used to hit the dizzy heights of 7,156MHz included the obligatory liquid nitrogen cooling, as well as CAS Latency being upped to 58 (from 19 at stock with this RAM).",
    "Note that it was also a single stick of RAM, so single-channel rather than dual-channel (in real world situations, the latter is the way you want to be running system memory for the best performance, meaning two 4GB sticks rather than a single 8GB module as is the case here). The 11900K CPU was also massively underclocked (to just under 1.5GHz) in the record-beating rig.",
    "While broadly speaking Rocket Lake has received a lukewarm reception, certainly at the higher-end, as the flagship 11900K is rather underwhelming for a number of reasons – Intel’s 11th-gen desktop platform does appear to have some impressive potential for RAM overclocking.",
    "Indeed, as PC Gamer observes, it’s not just this new world record which has been achieved, but the top four fastest overclocks for DDR4 memory now use Rocket Lake chips (all beating out the AMD Ryzen 7 4700GE which is around 500MHz slower than the new record set here).",
    "While getting this kind of blazing RAM performance might be inconceivable for run-of-the-mill PC owners, this still points to promising things for Rocket Lake in terms of enthusiast overclockers using simpler and more practical measures to pep up their system memory, and getting the best results possible."
  ],
  "headers": {
    "5": "RAM Rocket"
  },
  "links": {
    "RAM": "https://www.techradar.com/news/the-best-ram-deals",
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "Core i9-11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "PC Gamer": "https://www.pcgamer.com/uk/so-rocket-lake-is-good-for-something-the-11900k-nails-ddr4-overclocking-record-at-7156mhz/",
    "rather underwhelming for a number of reasons": "https://www.techradar.com/reviews/intel-core-i9-11900k"
  }
}