{
  "source": "https://www.techradar.com/news/cant-wait-for-dying-light-2-heres-a-great-new-reason-to-revisit-the-original",
  "title": "Can't wait for Dying Light 2? Here's a great new reason to revisit the original",
  "category": "gaming",
  "updated": "2021-06-23T13:19:13Z",
  "author": "vic-hood",
  "summary": "Get your hands on new Dying Light story content",
  "article": [
    "Can't wait to get your hands on Dying Light 2 later this year? Well, developer Techland is offering a pretty good reason to revisit the original in the meantime.",
    "Techland has announced a new free content drop for Dying Light 2's Hellraid DLC that adds a brand new Story Mode, new areas and weapons, as well as a number of technical and visual improvements.",
    "This new Story Mode sees players traveling into the \"demon-infested bowels\" of Ba’al’s Temple to rescue a powerful and mysterious mage called Lucius, and also adds three new quests: Clavis Stone, Imprisoned and Beneath Seals, which are all available to play in co-op. In addition, players can explore new locations, will encounter a new \"shield-bearing skeleton enemy\" and will be able to get their hands on two new weapons: Corrupted Justice, a long-ranged bow, and Bonecrunch, a two-handed hammer.",
    "Techland has confirmed that this new Story Mode will sit alongside the pre-existing Raid Mode, which will be accessible after completing the new narrative prologue.",
    "Finally, this new content improves Dying Light's lighting system, animations, minimap and inventory management, while also adding new environmental sounds. You can check out the full patch notes here.",
    "It's worth noting that you will need to have the Dying Light Hellraider DLC to take advantage of this new content drop. But, for those that already do, it's a great reason to jump back into the world of Dying Light ahead of Dying Light 2's release on December 7, 2021.",
    "While a recent stream gave us an update on the long-awaited sequel, including a solid release date, we're hoping we'll hear even more about Dying Light 2 (officially called 'Dying Light 2: Staying Human') at E3 2021."
  ],
  "headers": {
    "5": "Dying to know"
  },
  "links": {
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors",
    "here": "https://store.steampowered.com/agecheck/app/1300710/.",
    "E3 2021": "https://www.techradar.com/news/e3-2021"
  }
}