{
  "source": "https://www.techradar.com/news/squarespace-evades-part-of-website-builder-patent-lawsuit",
  "title": "Squarespace evades part of website builder patent lawsuit",
  "category": "computing",
  "updated": "2021-08-28T03:22:40Z",
  "author": "anthony-spadafora",
  "summary": "One of five patent infringements has been dropped in the lawsuit against Squarespace",
  "article": [
    "Squarespace has managed to have one of the allegations against it dropped in a patent lawsuit involving its website builder.",
    "Back in September of last year, the Web 2.0 and mobile technology firm Express Mobile filed lawsuits against some of the biggest names in the ecommerce and technology industry including Atlassian, Dropbox, eBay, Expedia, Facebook, Google, HubSpot, Microsoft and of course, Squarespace.",
    "According to those lawsuits, founder, chairman and CTO of Express Mobile as well as founder and chair of XMO, Steven H. Rembpell developed the patents and technology at the center of these lawsuits in the late 1990s. From his inventions, XMO now holds key foundational patents covering What You See Is What You Get (WYSIWYG) website development methods and the integration of web services into web and mobile solutions.",
    "In a press release from last year, Rembpell provided further insight on the lawsuits that are now being decided in court, saying:",
    "\"I am a lifelong inventor and have been developing software technologies globally for companies for close to 50 years. We don't want to stop the defendants or anyone from using our patents - we just want to be paid a fair royalty.\"",
    "As reported by Law360, Squarespace is able to escape part of the patent lawsuit as a result of US District Judge Richard G. Andrews granting the company's request to toss out Express Mobile's allegations of induced, contributory and willful infringement of one of its five patents.",
    "However, Squarespace wasn't able to slip out of the direct infringement claims by arguing that the complaint failed to adequately show how its website building platform met the limitations of the claims. Instead, Judge Andrews agreed with Express Mobile that Squarespace was “prematurely seeking detailed infringement contentions” that were not required at the current stage of the case.",
    "At the same time though, Judge Andrews also kept Express Mobile's claim of divided infringement in the case by rejecting Squarespace's claims that the complaint failed to show any “direction or control” or “joint enterprise” between it and third-party users.",
    "Express Mobile's lawsuit against Squarespace as well as the other ecommerce and tech companies is still ongoing and we'll likely find out more as it progresses.",
    "Via Law360"
  ],
  "headers": {
    "5": "Squarespace patent suit"
  },
  "links": {
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "WYSIWYG": "https://www.techradar.com/news/the-best-free-website-builder",
    "press release": "https://www.prnewswire.com/news-releases/express-mobile-inc-asserts-patent-infringement-suits-against-nine-leading-technology-firms-301123236.html",
    "Law360": "https://www.law360.com/delaware/articles/1416365/squarespace-dodges-part-of-website-building-patent-suit"
  }
}