{
  "source": "https://www.techradar.com/news/everyone-is-talking-about-aws-infinidash-but-it-doesnt-exist",
  "title": "Everyone is talking about AWS Infinidash, but it doesn't exist",
  "category": "computing",
  "updated": "2021-07-05T23:00:41Z",
  "author": "anthony-spadafora",
  "summary": "Fake AWS service has led to new job postings, a textbook and more",
  "article": [
    "A recent online post from Twilio developer educator Joe Nash about a new AWS service has led some companies to update their job requirements.",
    "In his tweet, Nash argued that if he and other developers mentioned a new AWS product on social media, some companies would add it to their job ads, saying:",
    "“I am convinced that a small and dedicated group of twitter devs could tweet hot takes about a completely made up AWS product, idk AWS Infinidash or something, and it would appear as a requirement on job specs within a week.”",
    "While there are currently more than 200 AWS services, Infinidash isn't one of them as it is an entirely made up product. However, in just a few short days, Nash's theory was proven correct.",
    "Just three days after Nash's tweet, the encrypted messaging app Signal posted a job ad for a server engineer that required Infinidash experience. The ad also said that experience with the open source software OpenDash was also acceptable as Infinidash had already been forked.",
    "Signal's job ad required applicants to have “considerable time spent” working with Infinidash despite the fact that the fake AWS product was only recently released. For those unfamiliar, this is a nod to a job ad from IBM posted last year that required job applicants to have twelve years of experience working with Kubernetes although the project launched in 2014.",
    "The AWS Infinidash joke continued when a fake textbook titled “Advanced Infinidash: The Definitive Guide” that mimicked the look of similar textbooks from O'Reilly appeared online.",
    "As The Register was interested to get to the bottom of Nash's Infinidash post, the news outlet spoke with the developer who said he created it as a reaction to GitHub's Copilot service which is a “vaguely named blackbox technology, available on a limited basis to a small number of people” that most developers will only get to see through posts from developer influencers online.",
    "Via The Register"
  ],
  "headers": {
    "4": "Infinidash developers wanted"
  },
  "links": {
    "Twilio": "https://www.techradar.com/reviews/twilio-voice",
    "AWS": "https://www.techradar.com/news/aws/news/aws-wants-to-tempt-customers-into-switching-to-linux",
    "tweet": "https://twitter.com/jna_sh/status/1410178986978775040",
    "200 AWS services": "https://www.techradar.com/news/aws",
    "Signal": "https://www.techradar.com/news/signal-is-getting-a-crypto-based-payments-system",
    "open source software": "https://www.techradar.com/best/best-open-source-software",
    "IBM": "https://www.techradar.com/news/ibm-becomes-first-to-demonstrate-advantage-of-quantum-computers-in-real-life-scenario",
    "Kubernetes": "https://www.techradar.com/news/what-is-kubernetes",
    "The Register": "https://www.theregister.com/2021/07/05/infinidash/",
    "GitHub's Copilot service": "https://www.techradar.com/news/ai-powered-github-tool-will-pretty-much-write-your-code-for-you"
  }
}