{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22s-small-battery-feels-pretty-final-with-new-leak",
  "title": "Samsung Galaxy S22’s small battery feels pretty final with new leak",
  "category": "phones",
  "updated": "2021-09-29T20:41:04Z",
  "author": "david-lumb",
  "summary": "Small battery with small size?",
  "article": [
    "A new leak suggests the Samsung Galaxy S22 will have a smaller battery than its predecessor, echoing several previous rumors and convincing us even more that Samsung will shrink its battery capacity.",
    "A new certification listed on Safety Korea, as spotted by Phone Arena, shows a photo of a supposed Galaxy S22 battery unit with two numbers in the label’s fine print: a ‘typical capacity’ (often the figure used in advertisements) of 3,700mAh, with a rated capacity of 3,590mAh. By comparison, last year’s Galaxy S21 had a typical capacity of 4,000mAh and rated capacity of 3,880mAh.",
    "That’s a slight but not insignificant drop in capacity, and goes against general precedent that batteries get bigger in phones going forward – or at least not smaller. But that’s the second time we’ve heard that the Galaxy S22’s rated capacity will be 3,590mAh after a previous rumor.",
    "We’ll have to see, of course, if a lower capacity directly translates to less battery life – or if Samsung can manage efficiencies and other tricks to make the Galaxy S22 last as long as its predecessor.",
    "We’re still a ways out from the Samsung Galaxy S22’s launch, which we expect to follow its predecessors by coming early next year – likely January 2022.",
    "What we have heard suggests the phone will have a 6.06-inch display and be physically smaller than the Samsung Galaxy S21 (which had a 6.2-inch screen). It would make sense that the battery may have a consequently smaller capacity, then, though certainly unfortunate.",
    "Otherwise, a recent Samsung Galaxy S22 render leak suggests the phone will look much like the S21 before it, with vertically-aligned rear cameras nested in a sizable camera bump. In other words, not much new – although another render of the Samsung Galaxy S22 Ultra reveals a potential camera setup that doesn’t have a bump at all – just glass covering all five lenses in an oblong shape. We’ll just have to wait and see whether these are the final designs for the phone."
  ],
  "headers": {
    "4": "Analysis: smaller phone, smaller battery – is anything better in the S22?"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Safety Korea": "https://www.safetykorea.kr/release/certDetail?certNum=ZU10196-21014&certUid=5177418",
    "Phone Arena": "https://www.phonearena.com/news/samsung-galaxy-s22-battery-capacity-confirmed_id135390",
    "rumor": "https://www.techradar.com/news/samsung-galaxy-s22-could-have-at-least-one-serious-issue",
    "likely": "https://www.techradar.com/news/the-samsung-galaxy-s22-could-arrive-in-january-2022-according-to-a-new-leak",
    "smaller": "https://www.techradar.com/news/samsung-galaxy-s22-screen-and-battery-could-both-be-smaller-than-the-s21",
    "leak": "https://www.techradar.com/news/samsung-galaxy-s22-and-s22-renders-leak-out-hint-at-a-galaxy-note-22-ultra"
  }
}