{
  "source": "https://www.techradar.com/news/feel-old-yet-your-2015-macbook-is-now-a-vintage-product-according-to-apple",
  "title": "Feel old yet? Your 2015 MacBook is now a vintage product according to Apple",
  "category": "computing",
  "updated": "2021-07-01T12:51:27Z",
  "author": "hamish-hector",
  "summary": "Is it time to upgrade your old-school notebook?",
  "article": [
    "Apple has just declared that the 2015 12-inch MacBook you still have kicking around is now a vintage product. The now six-year-old notebook has been off sale for between five and seven years, meaning it has earned itself a place amongst the likes of the iPhone 5, iPod Classic, and original iPad Air.",
    "This change was spotted by AppleInsider, who noted that this is the first product from the MacBook line to be added to the list (though entries from the MacBook Air and MacBook Pro product lines have been added already). In 2019 Apple decided to discontinue production of its 2017 MacBook, and since then we’ve not received a new entry to replace it.",
    "This new vintage classification won't immediately change much for you if you're still using the 2015 MacBook, but it's an early warning sign that you'll want to upgrade your notebook soon. If you want to know why read our explanation below.",
    "Apart from making you feel old, and potentially meaning avid Apple collectors will consider paying more for your vintage MacBook, this new tag means that your old MacBook is one step closer to becoming ‘obsolete'.",
    "As explained on Apple’s official page, obsolete products are no longer able to receive a hardware service from official Apple suppliers and partners. That means unless you can find a reliable third-party vendor, when your MacBook breaks, it’s unfixable.",
    "Thankfully, you should have several more years before the 2015 MacBook moves from vintage to obsolete, but take this as a warning you might want to think about upgrading.",
    "Since the product was released six years ago, Apple has made some brilliant leaps forward with its internal tech. For one, you’ll now be able to get a MacBook that uses an M1 processor, a powerful chip that Apple has designed for exclusive use in its best products.",
    "The Retina display has also received an upgrade (offering way better image clarity) as has the webcam, so it can output a much better picture when you need to FaceTime your friends and family. To learn more, you can check out our full MacBook Air (2020) review.",
    "Of course, you don’t have to upgrade if you’re happy with your classic tech, just watch out. While you can still get it repaired for now, time is running out before it could be broken for good."
  ],
  "headers": {
    "3": "What does being a vintage product mean?"
  },
  "links": {
    "iPhone 5": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-5-1096004/review",
    "iPod Classic": "https://www.techradar.com/reviews/gadgets/ipods-and-portable-audio/ipod-and-mp3-players/apple-ipod-classic-272026/review",
    "AppleInsider": "https://appleinsider.com/articles/21/06/30/apple-declares-12-inch-macbook-from-2015-a-vintage-product",
    "Apple’s official page": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8378739914095923000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-gb%2FHT201624",
    "MacBook Air (2020) review": "https://www.techradar.com/reviews/apple-macbook-air-m12020"
  }
}