{
  "source": "https://www.techradar.com/news/xbox-series-x-vr-support-teased-again-by-console-error-message",
  "title": "Xbox Series X VR support teased again by console error message",
  "category": "gaming",
  "updated": "2021-03-30T10:54:12Z",
  "author": "gerald-lynch",
  "summary": "Is VR gaming for Xbox gamers once again on the cards?",
  "article": [
    "It was teased ahead of the release of Microsoft's latest consoles, but could VR gaming be once again on the cards for the Xbox Series X and Xbox Series S consoles?",
    "As spotted by IGN Italy, some Italian Xbox users are being greeted with with a message that translates as “An update for the VR headset is available” when connecting the new Xbox Wireless Headset to a console. An additional message requests users \"Update VR headset\" before continuing.",
    "The message only appears when using an \"Xbox Series X/S operating system\", according to the report.",
    "Microsoft has yet to comment on the message, so it's hard to say yet whether it's been written into the system in error, or has slipped into consumer messaging ahead of an official announcement. Indeed, both headphones (like the Xbox Wireless) and VR hardware (like the Oculus Quest 2) are both referred to as 'headsets', despite their differing purposes and form factors.",
    "And yet, Microsoft has dabbled with the idea of bringing VR support to its Xbox platform in the past. Xbox boss Phil Spencer, in February 2020, stated that VR support for its console would become a \"no brainer,\" if VR continues to grow in popularity. And ahead of the Series X / S console's eventual reveal, the company stated that a successor to the Xbox One X could support \"high fidelity VR\" – a statement that hasn't born fruit, even if the Xbox Series X hardware is certainly capable of powering VR applications. Microsoft has even partnered with Facebook's Oculus in the past, bundling in the Xbox One controller with the company's Oculus headsets previously.",
    "Remember, Microsoft already works alongside partner brands to make Windows VR and Mixed Reality headsets, so it's not completely removed from the hardware side of the equation, either, even if it decides eventually not to bring Oculus Quest 3 support to the table, or chooses to sidestep Xbox branded VR hardware. With Sony going all-in with a PSVR 2 headset, maybe it's time Microsoft followed suit."
  ],
  "headers": {
    "3": "Xbox VR support incoming?"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "IGN Italy": "https://it.ign.com/xbox-series-x/179732/news/microsoft-al-lavoro-su-un-headset-vr-per-xbox-gli-indizi-arrivano-dalle-nuove-cuffie-wireless",
    "Xbox Wireless Headset": "https://www.techradar.com/reviews/xbox-wireless-headset-review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "\"no brainer,\"": "https://www.videogameschronicle.com/news/xbox-boss-hopes-it-will-eventually-be-a-no-brainer-to-support-vr/",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors"
  }
}