{
  "source": "https://www.techradar.com/news/pixars-next-movie-is-taking-a-summer-vacation-to-the-charming-italian-coast",
  "title": "Pixar's next movie is taking a summer vacation to the charming Italian coast",
  "category": "entertainment",
  "updated": "2021-04-28T15:02:19Z",
  "author": "tom-power",
  "summary": "Would you Luca that",
  "article": [
    "The announcement of a new Pixar movie almost always enthralls fans of the beloved animation studio. Now, four months from the release of the Oscar-winning Soul, and ahead of its latest short 22 vs Earth arriving on Friday, Pixar has released the official trailer for its newest feature film.",
    "Luca, which lands exclusively on Disney Plus this summer, is a coming-of-age tale about the titular character who, alongside his new friend Alberto, just wants to fit in and be normal.",
    "What sets Luca and his bestie apart from those who inhabit the fictional Italian coastal town of Portorosso? Well, they're sea monsters who can masquerade as humans.",
    "Check out the official trailer for Luca below:",
    "In a word, no. Pixar fans may have begun to worry about the studio's movies never receiving theatrical releases again, given that Soul also launched on Disney's streaming platform.",
    "However, don't expect this to become the norm for Pixar feature-length films. While Soul was released on Disney Plus in December 2020, it also arrived in cinemas in countries where the streamer isn't available yet.",
    "This means that Disney and Pixar will still release the latter's films on the big screen again in the future. Following Luca's release, Pixar's next two films - Turning Red and Lightyear - should launch in theaters worldwide, providing that the pandemic has subsided enough by next year.",
    "The reason behind Luca's Disney Plus launch is down to the Covid-19 pandemic. While some countries have begun, or continue, to roll out their Covid-19 vaccine programs, some theatre chains are yet to reopen and likely won't do so until the vast majority of a nation's population is vaccinated against the disease.",
    "Rather than push Luca's release date back - an issue that Disney has already had to contend with over its other upcoming releases - Pixar will release it on Disney Plus. It'll be available at no extra cost to Disney Plus subscribers, too, so viewers won't have to pay for the privilege of watching it on release day.",
    "Starring the likes of Jacob Tremblay (Doctor Sleep), Jack Dylan Grazer (Shazam!), Emma Berman (This Is Us) and Maya Rudolph (Grown Ups), Luca will arrive on Disney Plus and select theaters on June 18, 2021."
  ],
  "headers": {
    "4": "Is this the start of Pixar movies launching exclusively on Disney Plus?"
  },
  "links": {
    "Pixar": "https://www.techradar.com/news/ratatouille-is-still-the-best-pixar-movie-on-disney-plus-heres-why",
    "Soul": "https://www.techradar.com/news/how-to-watch-soul-online-stream-the-new-pixar-movie-on-disney-plus-today",
    "22 vs Earth": "https://www.techradar.com/news/how-pixar-made-22-vs-earth-a-soul-short-inspired-by-apocalypse-now"
  }
}