{
  "source": "https://www.techradar.com/news/diablo-4s-open-world-is-as-diablo-as-it-gets",
  "title": "Diablo 4's open world is as Diablo as it gets",
  "category": "gaming",
  "updated": "2021-02-22T11:58:53Z",
  "author": "robert-zak",
  "summary": "Interview: Diablo 4 devs tell us more about how the first open-world game in the series will work.",
  "article": [
    "BlizzCon 2021 has come and gone, with the eerily online-only event leaving us with a splattering of new Diablo details. There’s the long-overdue announcement of a Diablo 2 Remaster and the reveal of the Rogue class for Diablo 4, as well as insight on the new PvP mode (maybe you’re even open to the new details surrounding mobile game Diablo Immortal, now that enough Diablo-related good news sits between us and its disastrous debut in 2018).",
    "But during my interview with Diablo 4 art director John Mueller and lead designer Joe Shelly at BlizzCon 2021, I wanted to find out more about the game’s oft-repeated claims to being an open-world game. We know from everything we’ve seen that in the nitty-gritty of combat, Diablo 4 is going to be nittier and grittier than all Diablos before it, but how does that fit into an open-world structure? Will Blizzard delve deep into open-world design and take on board the great ideas of the past generation, or is it paying lip-service to the popular buzzword in a bid to garner more attention?",
    "The answer is ‘a bit of both’, but those who are intrigued by its open-world stylings should understand that this is still very much a Diablo game only bigger, using that extra space to grow into a moreish service game.",
    "Open-world is a broad brush of course, conjuring certain tropes that aren’t things I usually associate with Diablo – non-linear progression and exploration, engaging interactions with the world beyond the main campaign, surprise encounters and side-stories. Diablo’s world of Sanctuary in previous outings was largely made up of hubs linked by vast barren killing fields containing dungeons. The environments were essentially arenas that happened to be seamlessly linked, and you were usually doing just one quest at time, pushing through the story at pace.",
    "Structurally at least, Diablo 4 is dropping the linear Act progression for something more akin to open-world design. “There’s an entry point in the game, then there’s a point when things diverge and you have a lot of options about which way you can go”, says Mueller. “For the first part of the game there’s a path in, then a lot of options about where you can go from there. At a much later point it converges back together for the final act”.",
    "As an example, after the opening segment of the game you can pursue story questlines in three separate regions of the world: Scosglen, the Fractured Peaks, or the Dry Steppes. You’re free to tackle these in any order you like.",
    "There’s more to engage with beyond the main quest too. Where Diablo 3’s campaign always felt like a fast-track towards a simple but addictive endgame, here Blizzard wants to make the world more dynamic. “In an open-world game there’s all these fun things that pull you off the path”, says Mueller. “I know that there are Boars in the Dry Steppes, I know there are skeletons in the south-eastern part of Scosglen, or I go to the coast and it’s drowned – it really informs a lot of player decisions that you’ve never had to think about in a Diablo game”.",
    "Lead designer Joe Shelly gives me an example of how a regular day out in this more open iteration of Diabloland might look. “You might waypoint into the Fractured Peaks, hop on your mount, ride out to a camp, complete it, along the way you might get distracted by an event… maybe some Goat Men are harassing some villagers”. He continues. “Then, having completed the Camp you might discover that a World Boss has showed up in Scosglen, so maybe you head up there to deal with that with some other players”.",
    "PvP, meanwhile, will take place in a dedicated region called the Fields of Hatred. Here you’ll collect the unique currency of Blood Shards by fighting monsters as well as other players, though Mueller points out that more cunning players can engage with this region in a different way. “I see the Fields of Hatred as PvE content,” he says. “It’s the survival aspect of the game where I’m just trying to get in, get Shards, go to the vendors, and get out”.",
    "It’s great that Diablo 4 is integrating its campaign, PvP and endgame into one world – a massive improvement on Diablo 3’s fragmented Campaign and Adventure modes. By letting you meander through other activities while working through the story, the game makes you engage with the world that bit more, introducing some of that open-world sense of discovery into the series.",
    "Of course, the nature of these activities is more Destiny 2 or Path of Exile than, say, Red Dead Redemption 2. The fact that there was no mention of sidequests and stories during the interview, but rather World Bosses, PvP zones and Events, reveals its open world to be very much in service of a game-as-service – bolstered by the fact that you’ll be sharing the world with other online players (though not in an MMO way, as Blizzard urgently keeps reiterating).",
    "Mueller confirmed that there will be no branching storylines or dialogue options, although one element straight from the Ubisoft school of open-world design is the Camp system. Out in the world you’ll find camps inhabited by different kinds of enemies, with Mueller stressing that “every camp that the designers have done has been unique – there’s always cool little scriptures, lore bits, that kind of stuff”.",
    "Defeat the enemies in these camps and you’ll liberate them for the regular folk of Sanctuary, which can lead to interesting knock-on effects that show off the newly reactive world. There’s one camp where the villagers, struggling to fend off a local tribe of cannibals, get into cahoots with some fallen demons. These demons (being, y’know, demons), end up taking over the village, and you’re called in to help. You go in, do your hack-and-slash Diablo Dance of Death, and make it safe for the villagers to return, offering vendors, a waypoint, and new opportunities. “The mines underneath this village become accessible when you do this”, adds Mueller. “And you’ll find that everybody inside them has turned to salt, which is a cool visual part of it.”",
    "Diablo 4 has grown the series out to fit the open-world mold through sheer size and seamlessness, with each of its five regions being up to 10 times bigger than any of those in Diablo 3. But on the evidence of everything we’ve seen so far you’ll still be spending much more time ploughing through the denizens of hell – zapping between Waypoint and Event and World Boss and Dungeon – than getting lost in the wilds of Sanctuary.",
    "And that’s great, even if the open-worldliness here is being pushed harder than in games that tick many more of those boxes. A series with such a strong identity was always going to funnel new design ideas towards its own purpose: that of reclaiming its throne as the leading hack-and-slash ARPG. Diablo 4 has some stiff competition, much more so than its predecessor, but you can bet your soul that this ageless old demon will make a fight of it."
  ],
  "headers": {},
  "links": {
    "long-overdue announcement of a Diablo 2 Remaster": "https://www.techradar.com/news/diablo-2-resurrected-is-a-4k144hz-remaster-of-diablo-2-for-pc-and-consoles",
    "reveal of the Rogue class for Diablo 4": "https://www.techradar.com/news/diablo-4s-rogue-class-unveiled-with-its-very-own-trailer-at-blizzcon-2021",
    "new details surrounding mobile game Diablo Immortal": "https://www.techradar.com/news/diablo-immortal-will-be-a-mobile-mmo-developers-reveal-at-blizzcon-2021"
  }
}