{
  "source": "https://www.techradar.com/news/why-you-shouldnt-expect-iphone-12-deals-this-amazon-prime-day",
  "title": "Why you shouldn't expect iPhone 12 deals this Amazon Prime Day",
  "category": "phones",
  "updated": "2021-06-18T07:00:12Z",
  "author": "david-lumb",
  "summary": "Don't expect Amazon Prime Day iPhone deals – but here's some alternatives",
  "article": [
    "We expect plenty of deals during Amazon Prime Day 2021 on June 21, and it won’t be tough to find great discounts on gadgets, tablets, and phones. But one thing you probably won’t find? iPhone 12 deals on Amazon Prime Day.",
    "That’s not to say it’s impossible – you could find some savings here and there on older iPhones, but you won’t find the discounts you might expect on a bigger deals holiday like Black Friday. But the real issue is that Apple simply doesn’t participate in sales events that it’s not holding.",
    "So what WILL you find on Amazon Prime Day? Deals on Android phones, most likely, with discounts on older and budget models as retailers make room for the new stock. And certainly deals on other devices like Amazon Fire tablets, headphones, home goods, and other gadgetry.",
    "That might be little comfort to iPhone owners, who are typically locked into the Apple ecosystem and find it easier to simply upgrade to a newer iPhone than transition to Android. If it’s any consolation, there isn’t really a ‘best’ time for official Apple deals on its phones, aside from hoping for a discount on older models when the new ones are released in September or October.",
    "But if you absolutely positively need a discount on an iPhone, we’ll list the few we expect to get discounted, on Apple’s site or elsewhere – along with the Android alternatives you may consider.",
    "When new iPhones hit the market, the older models usually see a drop in price – for instance, when the new iPhone 12 came out in September 2020, the iPhone 11 was immediately discounted, first on Apple’s site and then on online retailers.",
    "What’s missing? Amazon, of course: Apple rarely participates in deal holidays of any sort, but especially not ones held by other tech giants. Heck, we barely see iPhone discounts during the Black Friday discount season.",
    "What few Amazon Prime Day iPhone deals do happen this year almost certainly won’t be on the latest iPhone 12 lineup. For reference, here's the best iPhone 12 deals available right now:",
    "Instead, expect older iPhones to see price drops, especially those that have been replaced in Apple’s official lineup.",
    "Now that the iPhone 12 is the best iPhone, we may see discounts on former flagships that are a few years out of date, like the iPhone XS or iPhone X. These were the best iPhones in their day, and despite being overshadowed by new devices, are still powerful phones compatible with the newest iOS 14.6 software updates – and should get them for years to come.",
    "Older models like the iPhone 8 and iPhone 7 ranges could get discounts, too. These models can still get upgraded to the latest iOS 14.6 software and are affordable to boot, but they’re getting a bit long in the tooth, so don’t expect them to get new operating system versions forever.",
    "The upcoming iOS 15 is expected to be compatible with iPhone 6S and newer phones, though we may see it drop off with 2022’s iOS 16. That could mean the iPhone 7 falls off compatibility with 2023’s iOS 17, but that’s pure conjecture, and far in the future regardless.",
    "Now that you’re aware of how rare Amazon Prime Day iPhone deals are likely to be, here are some alternatives – yes, Android alternatives – that you might see discounted.",
    "TechRadar is rounding up all the top deals over the Prime Day sales period, and we’ve put all the best Prime Day deals in an easy-to-navigate article to help you find the bargains you’re looking for."
  ],
  "headers": {
    "5": "Which iPhones, if any, could see Amazon Prime Day deals",
    "12": "Which iPhone alternatives will likely get Amazon Prime Day deals?"
  },
  "links": {
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Amazon Fire tablets": "https://www.techradar.com/best/best-amazon-fire-tablets",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iOS 14.6": "https://www.techradar.com/news/ios-146-update",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "iPhone 7": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-7-1327947/review",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}