{
  "source": "https://www.techradar.com/news/huawei-mate-x2-leak-suggests-a-big-camera-upgrade-and-a-very-different-design",
  "title": "Huawei Mate X2 leak suggests a big camera upgrade and a very different design",
  "category": "phones",
  "updated": "2021-01-21T10:52:02Z",
  "author": "james-rogerson",
  "summary": "More screens and more megapixels",
  "article": [
    "The Huawei Mate Xs is one of the best foldable phones you can buy and the only real rival to the Samsung Galaxy Z Fold 2, but the Huawei Mate X2 might land soon, and a leak suggests it will be a lot closer to Samsung’s design.",
    "Digital Chat Station (a leaker with a reasonable track record) has posted a specs list for the Mate X2 on Chinese social network Weibo, and it includes mention of two screens – an 8.01-inch 2200 x 2480 internal one, and a 6.45-inch 1160 x 2700 secondary one.",
    "That mention of an internal screen suggests that the display folds inwards (with the main, folding screen being hidden when it’s folded shut), whereas on the Huawei Mate Xs the main screen is the only screen and is always visible, just it shrinks down to half the usable size when it’s folded shut.",
    "This isn’t the first time we’ve heard that the Huawei Mate X2 might have an inward folding screen, but it is the first time we’ve heard the specs of the secondary display.",
    "Other specs leaked here include mention of a 16MP selfie camera and a quad-lens rear camera, with 50MP, 16MP, 12MP and 8MP lenses. There’s no mention of what purpose each serves, but that sounds like an upgrade on the quad-lens setup offered by the Huawei Mate Xs, at least in terms of megapixels.",
    "It also sounds like the Huawei Mate X2 will be able to zoom further, as the source claims that there’s up to 10x optical zoom. Though – via machine translation – they also say “(mixed?)”. It’s not clear what they mean by that, but it perhaps means it’s 10x hybrid optical zoom, which would use a combination of optical and digital to achieve that zoom range.",
    "There’s also a high-end Kirin 9000 chipset listed, along with a 4,400mAh battery with 66W fast charging, Android 10 (though don’t expect Google apps or access to the Google Play Store), dimensions of 161.8 x 145.8 x 8.2mm, and a weight of 295g.",
    "As ever with leaks, we’d take all of this with a pinch of salt, but hopefully we’ll know the truth about the Huawei Mate X2 soon, as the Mate Xs was announced almost a year ago in February 2020, so a successor is almost due.",
    "Via GSMArena"
  ],
  "headers": {
    "3": "Get closer"
  },
  "links": {
    "Huawei Mate Xs": "https://www.techradar.com/reviews/huawei-mate-xs",
    "best foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Digital Chat Station": "https://weibo.com/6048569942/JEa9F2hXg?type=comment",
    "might have an inward folding screen": "https://www.techradar.com/news/huaweis-mate-x-foldable-phone-successor-may-look-a-lot-like-the-samsung-galaxy-fold",
    "don’t expect Google apps": "https://www.techradar.com/news/huawei-ban",
    "GSMArena": "https://www.gsmarena.com/huawei_mate_x2_full_specs_tipped-news-47322.php"
  }
}