{
  "source": "https://www.techradar.com/news/aliens-fireteam-elite-nails-the-adrenaline-rush-of-facing-an-overwhelming-xenomorph-hive",
  "title": "Aliens: Fireteam Elite nails the adrenaline rush of facing an overwhelming xenomorph hive",
  "category": "gaming",
  "updated": "2021-08-23T16:15:28Z",
  "author": "gerald-lynch",
  "summary": "Let’s ROCK!",
  "article": [
    "We’ve been here before – staring down the shattered remains of a space colony corridor, gas vents steaming, strobe lights pulsing, the sounds of metal scraping as an obscene insectile horror bears down upon us. It’s Aliens, guys, most certainly the most-mined film in gaming history. Without Aliens, there’d be no Gears of War; no Halo.",
    "But while the influence of James Cameron’s frenetic 1986 sci-fi sequel has proved inspiration for some of the best games of all time, it’s often fared much worse when it comes to delivering actual licensed Aliens games.",
    "Aliens fans, I’m here to set your minds at ease – Aliens: Fireteam Elite, the new three-player squad-based shooter from Cold Iron Studios, is good. Very good perhaps. Not great, mind you, but if you’re a fan of the near-perfect film, this is your best chance yet to live out its action in a game.",
    "What Aliens: Fireteam Elite nails that no other Aliens game has managed, is the thrill of the chase. Taking inspiration from the Left 4 Dead series, it surpasses Valve’s classic team shooter in this regard. Played from a third-person perspective, you are positively swarmed by H. R. Giger’s terrifying creation from all angles.",
    "Dozens upon dozens of xenomorphs fill the screen during Aliens: Fireteam Elite’s many battles, climbing out of vents, scuttling along ceilings and diving through dark tunnels. Equipped with the series’ signature weapons, from turrets to smart guns, spread across four classes that your three man team can pick from, you’ve certainly got the firepower to take down these foes. But battles are hard fought and not easily won, especially when “special” xenomorphs appear, like Spitters, Warriors, Prowlers and Drones, which behave exactly as they sound.",
    "There’s barely a chance to breathe – stop to regroup and the anxiety-raising blip of the motion tracker will kick in again – you’ll turn to find yet another brigade bearing down on you, and so the race to the next objective must be taken on immediately. The fact there is no checkpointing across levels can seem harsh and cruel, especially when some levels can last as long as forty minutes. But it enhances the importance of teamwork and survival across every run, and adds to the sense of desperation a game based on Aliens should.",
    "The meat of Aliens: Fireteam Elite is that core run-gun-and-survive gameplay. It does a good job of conjuring the iconic locations and sound effects from the series – including the newer Prometheus-era films – with a score that neatly references James Horner’s militaristic Aliens soundtrack.",
    "The campaign isn’t particularly long – I’d say you’ll bash through its four chapters (separated into three missions each) in seven or eight hours, depending on difficulty level and the quality of your team mates. That’s an important point to make, as if you’re going in solo, you’ll be paired with AI “synthetic” squaddies. They are rubbish, making my love for the movie’s heroic android Bishop all the stronger. You’ll eventually come across some aggressive synthetics to blast in the campaign (the only point where the game’s otherwise pointless cover system comes into play), and solo players will relish the opportunity.",
    "You’ll be encouraged to replay the missions to unlock customizations for your created marines, and earn new weapons and abilities for your class and rank. But the grind here to get the best gear will be an arduous one, and probably best left to only the most hardcore of fans.",
    "More interesting are the challenge cards which can be applied at the start of a mission to add in an extra challenge in exchange for greater XP awards – like a multiplied number of enhanced xenomorph baddies for instance. But despite XP challenges like this, the upgrade meta-game here is a bit superfluous, and thankfully mostly ignorable unless you really want to eke your money’s worth out of Aliens: Fireteam Elite.",
    "Then there’s the headshots. Oh, the headshots! Aliens: Fireteam Elite is worth your money for its headshot sound alone, a pavlovian stab of what sounds like snapping violin strings every time you hit a xeno in its bulbous noggin. My three man squad of ass-kicking Xbox Live Marines ended up running around levels mimicking its satisfying “dulo-loo” sound every time we heard one.",
    "It’s a point which highlights both Aliens: Fireteam Elite’s strength and weakness at the same time – if, like me, you sat down to play with the nerdiest Aliens fanboys in town, it is an absolute blast to roleplay the “ultimate badass” colonial marine fantasies, with all the toys in tow. But a squad based shooter like this, with everyone nattering down the comms channel, does nothing to help Aliens: Fireteam Elite when it comes to atmosphere. Any potential for real fear is alleviated by having your pals just down the line, and while Aliens was always more of an action film than Alien with its horror leanings, there’s very little to fear here.",
    "Perhaps that’s for the best? The Alien franchise has always been a tale of two halves – the creeping, inescapable terror of Alien versus the heart-pounding battles of Aliens. Alien Isolation perfected gaming’s take on the former, and while Aliens: Fireteam Elite isn’t quite the perfect organism for channelling James Cameron’s sequel, it comes closer than any game before has managed. And I for one am happy we can live in a gaming landscape where both takes on the franchise can exist.",
    "Game over, man? Nah – Aliens: Fireteam Elite gives the action-focussed strand of the series a new lease of life. Let’s hope there’s a sequel ready to chest-burst out before too long.",
    "Aliens: Fireteam Elite is out now for PS4, PS5, Xbox One, Xbox Series X / S and PC. A copy of the game was provided by the publisher for the purposes of review."
  ],
  "headers": {
    "3": "Aliens not-so Isolated",
    "6": "Not bad… for a human",
    "10": "Game over, man?"
  },
  "links": {}
}