{
  "source": "https://www.techradar.com/news/wandavision-episode-7-ending-explained",
  "title": "WandaVision episode 7's ending explained: what did we just learn?",
  "category": "entertainment",
  "updated": "2021-02-19T17:58:07Z",
  "author": "samuel-roberts",
  "summary": "Massive spoilers follow",
  "article": [
    "Spoilers for WandaVision episode 7 follow.",
    "WandaVision episode 7's ending at last told us who the show's true villain is – and honestly, it wasn't a surprise. In fact, it was one we suspected all along, rather than the more out-there theories regarding Mephisto and even Baron Mordo from Doctor Strange.",
    "Instead, the ending of episode 7 revealed that WandaVision's main antagonist has been hiding in plain sight the entire time. Agatha Harkness, the neighbor we've come to know as Agnes, played by Kathryn Hahn, has her own magical powers – and she's been pulling Wanda's strings throughout the series, generally tormenting our titular hero over the past seven episodes of the show.",
    "Just like the musical number at the end of episode 7 says, \"Who's been pulling every string? It's been Agatha all along.\" More ominously for Wanda Maximoff, the song also says that \"it's too late to fix anything now that everything has gone wrong\".",
    "Plus, we learned that Agatha Harkness killed Sparky the dog, the WandaVision household's pet. That's unforgivable.",
    "So, who is Agatha Harkness, and what havoc has she been wreaking on Wanda's life in Westview? And could Mephisto still be part of the WandaVision story? We'll explain everything below, and explore the unanswered questions left by episode 7 of the series.",
    "In Marvel's comics, Agatha Harkness was introduced all the way back in Fantastic Four issue 94, back in 1970. Initially introduced as someone skilled in the art of raising children, she turns out to be a witch – later it would be revealed that she's been alive for hundreds of years, and was around during the Salem witch trials.",
    "In the comics, Agatha Harkness was Wanda's mentor and eventual enemy – she revealed that Wanda's children were composed from parts of the Marvel villain Mephisto, and Wanda subsequently murdered her during a particularly rough time for the character in the '00s. As ever with Marvel comics characters, though, Agatha wouldn't remain completely dead forever.",
    "That's pretty much all the context you need going into the show.",
    "The biggest unanswered question of WandaVision to date has been who the series' villain is. Finally, episode 7's reveal, where Wanda walks into Agnes' basement looking for her children, Billy and Tommy, reveals that her neighbor is actually called Agatha Harkness – and that she has magic powers herself, as well as numerous dark magic-related objects strewn around her basement.",
    "The musical number that follows, which Agatha broadcasts into Wanda's head, makes it clear as day that Agnes is the antagonist of the show, and has been all along.",
    "With just two episodes to go, it seems unlikely that Mephisto, or any other speculated-upon Marvel entity, will enter the picture and turn out to be the 'real' villain.",
    "But, the Mephisto theory can't be discounted entirely yet, and here's why. Mephisto's origins were recently detailed in an Avengers comic, Avengers issue 38, in the latest volume of the series – this particular issue was published late last year. It depicts the Earth being formed four billion years ago in the Marvel universe, and Mephisto appears as... a fly. We double-checked the issue on Marvel Unlimited after the episode released.",
    "You probably noticed the fly in Agnes' house at the end of episode 7. Could Mephisto still be part of the WandaVision story, yet to be revealed? Could this be Agnes' unseen husband, 'Ralph'?",
    "The main problem with this theory: that particular comic was published in late 2020, whereas WandaVision began filming a long time before that. It could just be a coincidence.",
    "Some have speculated that Agatha's in-universe Marvel comics son, Nicholas Scratch, is hiding in plain sight in the show, too. Agatha's rabbit is referred to as Señor Scratchy – did she use her magic powers to turn her own son into a pet? That's a theory we've seen shared multiple times now. If it's true, that's a great detail.",
    "The book seen in Agatha's basement at the end of episode 7 is speculated to be the Darkhold – a book of powerful black magic that's appeared in Marvel's comics numerous times.",
    "Pretty much everything bad that has happened to Wanda or Vision in this set of episodes is down to the actions of Agatha Harkness (or SWORD, in several other cases). Here's what the ending of episode 7 revealed Agatha is responsible for during the past seven episodes of the series:",
    "What we didn't see in these flashbacks, though, is exactly how Westview and the Hex came to be. Did Wanda create the town? Did Agatha Harkness? Or was it some combination of the two? It's a subject of much debate. The exact origins of the town are yet to be revealed, but we expect we'll find out how it all happened in the next couple of episodes.",
    "This part wasn't explored by the ending, but our expectation is that Agatha's magic probably helped bring Vision back to life in the sitcom world of Westview. That's because, much like Pietro when his dead body briefly appeared to Wanda in episode 6, Vision's Mind Stone-free walking corpse was seen in its 'real' form in episode 4 of the show. Our guess is the two were 'resurrected' by the same magic – but we'll have to wait and see on that.",
    "Likewise, we can assume that Agatha is partly responsible for the existence of Wanda's children, Billy and Tommy – but that's another element of the series that needs to be explained.",
    "Agatha's magic, then, is almost certainly part of the reason that our synthetic Avenger still lives. But we'll have to wait and see when it comes to the truth behind the Avenger's revival."
  ],
  "headers": {
    "6": "Who is Agatha Harkness in the comics?",
    "9": "Is Agatha Harkness WandaVision's real villain?",
    "17": "Which events of WandaVision has Agatha Harkness been responsible for?",
    "19": "Did Agatha Harkness bring Vision back to life?"
  },
  "links": {
    "Marvel Unlimited": "https://www.techradar.com/reviews/marvel-unlimited-review"
  }
}