{
  "source": "https://www.techradar.com/news/how-to-watch-back-to-the-future-online-stream-anywhere",
  "title": "Back to the Future trilogy lands on Amazon Prime Video - here's how to watch for free",
  "category": "entertainment",
  "updated": "2021-03-01T12:01:13Z",
  "author": "james-laird",
  "summary": "Stream the all-time classics without paying a penny today",
  "article": [
    "Amazon has a real treat in store for movie fans this March, with the online giant kicking off Spring by adding the entire Back to the Future trilogy to its Prime Video library.",
    "Previously, some of the films languished on lesser known streaming services and you couldn't find all three in the same place in many countries - despite their iconic status. Now, all you need is a FREE 30-day Prime Video trial and you can easily watch all three Back to the Future movies online this month without paying a penny!",
    "One of the most successful and revered film franchises of all-time, Back to the Future first hit screens back in 1985, before spawning two sequels: Back to the Future 2 in 1989 and Back to the Future 3 in 1990. Unlike many cringe-inducing follow-up efforts, they were all well-received and earned five Academy Award nominations between the trio.",
    "Following the adventures of Marty McFly (Michael J Fox), his mad scientist friend Doc (Christopher Lloyd), and the heavily modded DeLorean time machine they use to decade-hop like you or I might run the occasional red light, it's a multi-genre classic that blends sci-fi, action and comedy to perfect effect.",
    "Whether you're watching Back to the Future for the umpteenth time or finally scratching it off your bucket list, the good news is you can now watch them 100% commitment-free and cancel at any time. Should you decide to keep the service (and it's a great one to have, between the riches of Prime Video and Amazon's famous free one-day Prime delivery), it costs just $12.99 a month or save by getting a yearly Prime subscription for $119. And just to reiterate, you get full access to the core Prime Video library included in that fee - there's no hidden extras.",
    "If you think that being able to watch all three Back to the Future movies online free with a 30-day Prime Video trial sounds good, we've got even better news for you - it's just the tip of the iceberg when it comes to what's on offer with Prime Video.",
    "The service also exclusively hosts some of the most recent critically-acclaimed dramas around, including One Night In Miami and Steve McQueen's Small Axe miniseries; comedy gold like Borat 2; can't-miss TV shows including Billions, The Affair, The Boys, Mr Robot, and Downtown Abbey; and plenty more classics too, from The Truman Show to Dazed and Confused.",
    "Many of these are exclusive, Amazon Original content, too, and won't be found anywhere else. Plus, it's got some big releases coming up this month, namely Coming 2 America - the long-awaited sequel to Eddie Murphy masterpiece Coming to America (already on Prime Video).",
    "If you're a US resident outside of the country for whatever reason right now, then geo-blocking restrictions will stop you from watching one of Hollywood's greatest trilogies online via Amazon Prime Video.",
    "Fortunately, there’s a simple solution in the form of a VPN. It's a piece of software that, once downloaded and installed, lets you temporarily relocate your device's IP address to a country of your choosing.",
    "ExpressVPN is our no. 1 rated VPN and the ideal solution for UK residents wanting to watch British streaming services like iPlayer from abroad. It's fast, easy to get up and running (it only takes a couple of minutes), and is compatible with nearly all modern devices including Amazon Fire TV Sticks, Apple TVs, Xbox and PlayStation consoles, Windows and Mac computers, and iOS and Android hardware."
  ],
  "headers": {
    "2": "Great Scott!",
    "5": "More movies to watch with a FREE 30-day Prime Video trial",
    "8": "How to watch Prime Video online from outside the country"
  },
  "links": {
    "FREE 30-day Prime Video trial": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBack-Future-Michael-J-Fox%2Fdp%2FB00498XR9U%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1112426922021641200-20",
    "30-day Prime Video trial": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBack-Future-Michael-J-Fox%2Fdp%2FB00498XR9U%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1056606864718680700-20",
    "Small Axe": "https://www.techradar.com/news/how-to-watch-small-axe-online-stream-new-steve-mcqueen-bbc-series-free-and-anywhere",
    "Borat 2": "https://www.techradar.com/news/how-to-watch-borat-2-online-stream-borats-subsequent-moviefilm-anywhere",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn"
  }
}