{
  "source": "https://www.techradar.com/news/a-new-dandd-game-launches-on-ps5-xbox-series-x-and-pc-this-june",
  "title": "A new D&D game launches on PS5, Xbox Series X and PC this June",
  "category": "gaming",
  "updated": "2021-03-16T13:01:02Z",
  "author": "henry-st-leger",
  "summary": "Dungeons & Dragons: Dark Alliance is coming",
  "article": [
    "Dungeons & Dragons: Dark Alliance is coming, with a June 22 launch date confirmed by Wizards of the Coast, the publisher of the cross-media D&D franchise.",
    "The D&D RPG will be landing on PC, PS4, PS5, Xbox One, Xbox Series X and Xbox Series S, for a multi-platform launch across consoles old and new. As of March 16, though – today, at the time of writing – it is available to pre-order via the Dark Alliance website for $39.99 / €39.99 / £33.49.",
    "There's also a \"retail-exclusive Steelbook edition for $59.99 / €59.99 / £49.99 at select retailers\", which includes \"a Steelbook case, a printed art book, a downloadable Dungeons & Dragons soundtrack, a Beholder and Lich weapon set, and the forthcoming expansion 'Echoes of the Blood War'\" – meaning anyone wanting to commit to the DLC in advance can do so.",
    "Naturally, there's a Digital Deluxe Edition with most of the same perks, though currently for the same price. We're also told that \"all pre-orders – regardless of edition or platform – will receive an exclusive in-game Beholder weapon set at launch.\"",
    "Dark Alliance is technically a reboot of the 2001 Dungeons & Dragons video game, with inspiration taken from the Icewind Dale: Rhyme of the Frostmaiden sourcebook that launched in last September.",
    "As an action RPG, players can expect a lot of hack-and-slash combat, with the option to choose between a variety of preset characters – including the dark elf Drizzt Do’Urden and his barbarian, ranger, and cleric companions – so you're not getting the customization of Baldur's Gate 3 or Cyberpunk 2077.",
    "It's designed with the co-op experience in mind – much like playing D&D around a table, then – but with a single-player mode included too.",
    "Dark Alliance makes history as the first D&D video game to actually be published by Wizards of the Coast – rather than licensed out to third party developers, as with Baldur's Gate 3, which is being published by Larian Studios.",
    "It might be hard to draw attention away from the new Baldur's Gate game, however, given it launched in Early Access in October 2020 and has been building up hype and players in the months since.",
    "Dark Alliance is also set in the Forgotten Realms, though there are a few key differences between it and Baldur's Gate 3; namely, the \"real-time combat and dynamic co-op gameplay\", rather than the latter's turn-based system.",
    "But there's more! The popularity of D&D 5E (Fifth Edition) is leading to a new push of D&D computer games. Back in December 2019, Wizards of the Coast president Chris Cocks confirmed that \"seven or eight\" video games based in the world of Dungeons & Dragons were in various stages of development.",
    "We know that developer Hidden Path Entertainment is also working on an \"AAA, third-person, open-world fantasy RPG\" set in the D&D multiverse."
  ],
  "headers": {
    "7": "No gatekeeping here"
  },
  "links": {
    "D&D": "https://www.techradar.com/news/dnd-5e-races-classes-dice",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Dark Alliance website": "https://darkalliance.wizards.com/en",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "D&D 5E": "https://www.techradar.com/news/dnd-5e-races-classes-dice",
    "is also working on an \"AAA, third-person, open-world fantasy RPG\" set in the D&D multiverse": "https://www.techradar.com/news/an-open-world-dandd-game-is-being-developed-by-an-unexpected-studio"
  }
}