{
  "source": "https://www.techradar.com/news/twitter-users-can-now-remove-followers-without-them-knowing",
  "title": "Twitter users can now remove followers without them knowing",
  "category": "computing",
  "updated": "2021-10-12T01:02:33Z",
  "author": "jasmine-gearie",
  "summary": "'Soft blocking' comes to Twitter",
  "article": [
    "Twitter has launched a new feature that gives users more control over who can interact with them, essentially allowing users to ‘soft block’ their own followers.",
    "The feature is currently available to everyone using Twitter on the web – no word yet on when it’ll be available for the app. To remove a follower, head to your profile and click 'Followers'. From there, click the three dots next to their name and select 'Remove this follower'.",
    "This action will remove the user from your followers without them being notified of the removal – though according to Twitter, the account can still follow you again in the future. After being removed, the account will no longer be able to see your tweets in their timeline, but they will be able to send direct messages.",
    "The ability to remove followers is part of a larger effort by Twitter to not only stifle trolls, but to allow users to better curate their own experience on the social media platform.",
    "Last month, a new Safety Mode feature began rolling out to testers – it’s an algorithm that identifies accounts that are sending abuse or repetitive mentions to other users, and automatically blocks them for seven days.",
    "While users might want to outright block other accounts harassing them online, the ability to remove followers, or 'soft block' them, is perhaps a way to create a comfortable space for yourself online. It limits who can see your tweets in their feed, and helps avoid the confrontation that a hard block can bring.",
    "Given The Wall Street Journal’s recent report that Facebook is aware of Instagram’s negative impact on teen mental health, there should be a vigorous focus on how social media platforms can better help, not harm, their audiences.",
    "The ability to remove followers is small and long overdue, but a step in the right direction no less."
  ],
  "headers": {
    "3": "Why we need a way to remove followers"
  },
  "links": {
    "stifle trolls": "https://www.techradar.com/news/twitter-gets-new-feature-that-can-automatically-block-trolls",
    "Safety Mode": "https://blog.twitter.com/en_us/topics/product/2021/introducing-safety-mode",
    "The Wall Street Journal’s": "https://www.wsj.com/articles/facebook-knows-instagram-is-toxic-for-teen-girls-company-documents-show-11631620739"
  }
}