{
  "source": "https://www.techradar.com/news/revil-returns-but-under-another-name",
  "title": "REvil returns, but under another name",
  "category": "computing",
  "updated": "2021-07-28T11:51:16Z",
  "author": "mayank-sharma",
  "summary": "Or is it?",
  "article": [
    "The emergence of a new threat actor in underground forums has led cybersecurity experts to speculate the outfit could perhaps just be REvil ransomware operator under a changed name.",
    "Earlier this month, the notorious Russia-based ransomware group took all its online properties offline, leading to speculation that the group could have been hit by law enforcement agencies, following its extravagant attack against managed service providers (MSP) by exploiting a vulnerability in the Kaseya VSA remote management software to infect thousands of computers around the world.",
    "Identifying themselves as BlackMatter, the new threat actor has expressed interest in purchasing access to compromised corporate networks in the US, UK, Canada, and Australia.",
    "Analysts at risk intelligence firm Flashpoint have drawn several similarities between BlackMatter and REvil regarding their tactics and policy of staying clear of medical and government institutions.",
    "After registering on the Russian-language hacker forums, XSS and Exploit, BlackMatter made a substantial deposit of four bitcoin (about $150,000) in an escrow account, before posting its request looking for targets.",
    "The seriousness of BlackMatter’s intent is what brought the group immediately to the attention of observers.",
    "However, the Flashpoint researchers note that the new group could just be copycats imitating REvil’s behavior to gain immediate credibility as its reincarnation.",
    "Furthermore, while the language of their post, and their goals clearly point to the fact that BlackMatter is a ransomware operator, the researchers suggest that one shouldn’t jump to conclusion just yet since “two posts and a large escrow account do not make a ransomware group.”"
  ],
  "headers": {
    "4": "No smoking gun"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Russia-based": "https://www.techradar.com/news/this-weird-hack-might-help-keep-your-pc-safe-from-russian-hackers",
    "took all its online properties offline": "https://www.techradar.com/news/revil-websites-disappear-from-the-web",
    "remote": "https://www.techradar.com/news/best-remote-desktop-software",
    "infect thousands of computers": "https://www.techradar.com/news/kaseya-ceo-says-thousands-of-firms-may-be-affected-by-ransomware-attack",
    "drawn several similarities": "https://www.flashpoint-intel.com/blog/chatter-indicates-blackmatter-as-revil-successor/",
    "bitcoin": "https://www.techradar.com/best/mining-rigs"
  }
}