{
  "source": "https://www.techradar.com/news/nvidia-geforce-experience-can-now-make-adobe-lightroom-run-better-as-well-as-your-games",
  "title": "Nvidia GeForce Experience can now make Adobe Lightroom run better – as well as your games",
  "category": "computing",
  "updated": "2021-04-16T10:18:03Z",
  "author": "matt-hanson",
  "summary": "New feature added by Nvidia",
  "article": [
    "The Nvidia GeForce Experience tool has just been given a new major feature that allows you quickly optimize settings in creative apps, such as DaVinci Resolve, Adobe Lightroom and Illustrator and AutoCAD.",
    "In much the same way as Nvidia GeForce Experience checks to see if you’re using the best settings in your games to maximise performance for your graphics card, the app will now see if you have the best settings in a variety of apps.",
    "If you don’t, then you can quickly and easily change those settings, which in some cases could see a marked improvement in performance.",
    "Nvidia GeForce Experience can also be used to check to ensure you have the latest drivers, and it will do that with Nvidia Studio drivers as well. These are drivers specially-made for creative applications, rather than gaming.",
    "While Nvidia GeForce Experience is primarily designed for PC gamers, and lets them keep their drivers up to date and optimize their games, it’s good to see it supporting creative apps as well.",
    "Many laptops and PCs aimed at creative professionals come with Nvidia graphics cards and use Nvidia’s Studio drivers, so to have an app that can let you know if any of your programs aren’t optimized, and to let you quickly and easily install the latest Studio drivers, can prove really handy, especially for people who don’t want to mess around with settings and drivers.",
    "You can download Nvidia GeForce Experience directly from Nvidia’s website.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Making life easy"
  },
  "links": {
    "download Nvidia GeForce Experience": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-8182150787215507000&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-gb%2Fgeforce%2Fgeforce-experience%2F",
    "The Verge": "https://www.theverge.com/2021/4/15/22385195/nvidia-geforce-experience-creative-app-settings-optimization-feature"
  }
}