{
  "source": "https://www.techradar.com/news/why-power-bank-deals-are-hard-to-find-this-prime-day",
  "title": "Why power bank deals are hard to find this Prime Day",
  "category": "phones",
  "updated": "2021-07-07T15:39:57Z",
  "author": "david-lumb",
  "summary": "Can't find many power banks on sale? Here's why.",
  "article": [
    "Hunting for an Amazon Prime Day power bank deal? Want an external battery to juice up your devices while you’re on the go? You might not have found a lot of discounts during Amazon Prime Day 2021 – and there’s a reason for that.",
    "True, you can still find some of the best Amazon Prime Day power bank deals from Anker, but three of the biggest external battery-selling brands – RavPower, Aukey, and Mpow – have been banned from Amazon.",
    "Amazon confirmed to The Verge that it had taken RavPower products off its online shopping platform. Though the company didn’t explain why, they had taken action after a Wall Street Journal story emerged wherein columnist Nicole Nguyen reported that RavPower had offered a $35 gift card for giving a positive review, theoretically encouraging a host of fake reviews.",
    "This presumably prompted an investigation that led to Amazon banning RavPower, which would follow the company's ban of Aukey and Mpow from the platform due to similar pay-for-fake-review sins back in May reportedly due to FTC pressure, according to Vox.",
    "Obviously, any more extensive scrutiny on Amazon or other online marketplaces can only be a good thing. Consumers rely on products ratings and user reviews to inform their purchases, and anyone cheating the system casts doubt on Amazon’s platform and the layman’s ability to perceive an online item’s quality.",
    "It’s understandable why Amazon has seemingly moved quickly to snuff out this practice and shore up consumer faith in evaluation via mass reviews. Even if that means fewer choices of power banks on Amazon Prime Day, it should mean that the ones still for sale on the online platform have more trustworthy ratings than before the brands were banned.",
    "There are still some good Amazon Prime Day power bank deals to find right now, and unsurprisingly, they’re all from Anker. Then again, it’s a brand we’ve trusted and used ourselves, so we’re not recommending them halfheartedly.",
    "Not in the US or UK? Here are other great deals for the above models in your region:",
    "TechRadar is rounding up all the top deals over the Prime Day sales period, and we’ve put all the best Prime Day deals in an easy-to-navigate article to help you find the bargains you’re looking for."
  ],
  "headers": {
    "6": "A few of the best Amazon Prime Day power bank deals"
  },
  "links": {
    "power bank": "https://www.techradar.com/news/top-portable-chargers",
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best Amazon Prime Day power bank deals": "https://www.techradar.com/news/the-best-power-bank-and-phone-accessory-deals-this-amazon-prime-day",
    "banned": "https://www.techradar.com/news/heres-why-you-cant-buy-new-power-banks-from-ravpower-aukey-or-mpow",
    "The Verge": "https://www.theverge.com/2021/6/16/22536976/amazon-ravpower-battery-charger-removed-amazon",
    "Vox": "https://www.vox.com/recode/22443153/amazon-seller-supsensions-aukey-mpow-ftc-paid-fake-reviews",
    "best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}