{
  "source": "https://www.techradar.com/news/clubhouse-fans-can-now-send-their-favorite-creators-money",
  "title": "Clubhouse fans can now send their favorite creators money",
  "category": "computing",
  "updated": "2021-04-06T15:05:56Z",
  "author": "mike-moore",
  "summary": "Creators can now get paid for their Clubhouse work",
  "article": [
    "Popular chat app Clubhouse has announced users will soon be able to send money to their favorite creators on the platform.",
    "The app has partnered with payment processor Stripe to launch Clubhouse Payments, which will allow users to tip money via a creators profile page.",
    "Clubhouse says 100% of the money will go directly to the creators, but users will need to register a debit or credit card with the app first, with Stripe charging a small processing fee.",
    "Available now for test groups, Clubhouse Payments simply requires users (once they've registered a debit or credit card) to go to their favorite speaker's profile, tap the Send Money button at the bottom and then choose the amount they want to donate.",
    "\"From the earliest days of Clubhouse, a guiding principle has been to build a platform that puts the creator first,\" the company wrote in a blog post announcing the new feature. \"Our aim is to help creators build community, audience, and impact. And as Clubhouse continues to scale, it’s important to us to align our business model with that of the creators—helping them make money and thrive on the platform.\"",
    "Clubhouse says it is only rolling out the feature to a selected group of users first in order to get feedback and fine-tune the process, and hopes to make payments available to more users soon.",
    "\"This will be the first of many features that allow creators and to get paid directly on Clubhouse,\" the company added. \"We are excited to see how people use it, and to continue working hard to help the amazing members of the Clubhouse community grow and thrive.\"",
    "As we note in our explainer, Clubhouse is basically an exclusive hangout spot mixed with podcasting and networking tools. In it, you can start a conversation with friends or strangers with shared hobbies across the world or listen in on conversations between celebrities and CEOs. You may even be able to chat with those celebrities yourself."
  ],
  "headers": {
    "3": "In the money"
  },
  "links": {
    "Clubhouse": "https://www.techradar.com/how-to/what-is-clubhouse",
    "payment processor": "https://www.techradar.com/best/best-payment-gateways",
    "a blog post": "https://www.joinclubhouse.com/introducing-payments"
  }
}