{
  "source": "https://www.techradar.com/news/microsoft-wants-to-rein-in-your-potty-mouth-with-new-profanity-filter",
  "title": "Microsoft wants to rein in your potty mouth with new profanity filter",
  "category": "computing",
  "updated": "2021-03-27T10:35:34Z",
  "author": "joel-khalili",
  "summary": "Microsoft is taking steps to help businesses sanitize communication",
  "article": [
    "Microsoft is working on a new filtering mechanism that will identify threatening or profane messages sent by employees.",
    "A new entry in the company’s product roadmap describes an imminent upgrade to the Microsoft 365 Compliance Center, which will allow administrators to train classifiers that “detect threat, targeted harassment and profanities”.",
    "These trainable classifiers will be able to detect abuse in a range of languages, including English, French, Spanish, German, Portugeuese, Italian, Japanese and Chinese.",
    "The new feature is still technically under development, but is set to arrive within the next handful of days.",
    "While the use of swear words in jest is a relatively harmless foible, many employees have suffered genuine abuse at the hands of colleagues.",
    "The arrival of collaboration tools has made it easier than ever to communicate at work, but they have also created another avenue (beyond email) by which staff can abuse one another, often without the knowledge of management or fellow co-workers.",
    "This problem has likely only been exacerbated by the rise of remote working, which has practically eliminated all face-to-face interaction between employees in favor of virtual forms of communication.",
    "The Microsoft 365 Compliance Center is designed primarily to help businesses manage their compliance needs in relation to information governance. However, with the new trainable classifiers, the Compliance Center can be put to work to identify and address improper conduct as well.",
    "“A classifier learns how to identify a type of content by looking at hundreds of examples of the content you’re interested in classifying,” explains Microsoft in a blog post. “The classifier then makes predictions as to whether any given item falls into the category you’re building.”",
    "The harassment classifier is designed to detect abuse targeted at an individual or group based on race, ethnicity, gender, sexual orientation, age and disability. The profanity and threat classifiers are a little simpler, built to detect common swear words and aggressive language.",
    "However, Microsoft is keen to emphasize that the new filters should not comprise the entirety of a business’ efforts to stamp out abuse.",
    "“While the classifiers may assist your organization in monitoring offensive and other language used, the classifiers do not address consequences of such language and are not intended to provide your organization’s sole means of monitoring or responding to such language,” said the firm."
  ],
  "headers": {
    "4": "Toxic working environment"
  },
  "links": {
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46194&u1=trd-us-7213396268877889000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-au%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D70798",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "email": "https://www.techradar.com/news/best-email-provider",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1205648546496522800&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fmicrosoft-365%2Fcompliance%2Fclassifier-learn-about%3Fview%3Do365-worldwide"
  }
}