{
  "source": "https://www.techradar.com/news/new-ipad-pro-could-land-soon-with-a-mini-led-screen",
  "title": "New iPad Pro 2021 could land soon with a Mini LED screen",
  "category": "tablets",
  "updated": "2021-02-19T12:27:59Z",
  "author": "james-rogerson",
  "summary": "Possibly coming early this year",
  "article": [
    "We’ve been hearing for a while that Apple might upgrade the screen on a future iPad model, offering a Mini LED display rather than an LCD one, and it now looks like that day could come sooner rather than later.",
    "DigiTimes claims that it expects Apple will “possibly” launch a 12.9-inch iPad Pro with a Mini LED screen in the first quarter of 2021 (so by the end of March).",
    "We would however take this with a pinch of salt, as the site doesn’t sound very certain, and it appears to have come to this conclusion based on claims from Epistar’s company president, Fan Chin-yung, that “shipments for mini LED chips will begin to contribute to consolidated revenues in first-quarter 2021.”",
    "Epistar produces LEDs, so it presumably wouldn’t make this comment if it didn’t have customers lined up, though there’s no confirmation that Apple is one of them, and – according to DigiTimes – Fan Chin-yung additionally stated that large-volume shipments of Mini LED chips wouldn’t begin until the second or third quarter, and that revenues from them wouldn’t peak until then either.",
    "So based on that it sounds to us like a Mini LED iPad Pro might not arrive until later in 2021, assuming it launches this year at all.",
    "Still, it’s not the first time that we’ve heard there could be a Mini LED iPad Pro at some point in 2021, and it’s a change we’d like to see, as Mini LED can improve contrast and color reproduction, as well as being more energy-efficient than an LCD screen.",
    "The iPad Pro 2020 launched back in March, so we may well see an iPad Pro 2021 this coming March, whether or not it uses this new screen tech. If such a slate is landing that soon we’d expect plenty more leaks and rumors in the coming weeks and months, so stay tuned to TechRadar for all the updates.",
    "Via Apple Insider"
  ],
  "headers": {
    "3": "It might land later"
  },
  "links": {
    "upgrade the screen on a future iPad model": "https://www.techradar.com/news/new-mini-led-ipad-and-airpods-3-tipped-for-the-first-half-of-2021",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "DigiTimes": "https://www.digitimes.com/news/a20210105PD211.html",
    "could be a Mini LED iPad Pro at some point in 2021": "https://www.techradar.com/news/ipad-pro-2021-rumor-points-to-a-mini-led-screen-saving-oled-upgrade-for-2022",
    "iPad Pro 2020": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "Apple Insider": "https://appleinsider.com/articles/21/01/05/apple-on-track-to-release-mini-led-ipad-pro-in-early-2021"
  }
}