{
  "source": "https://www.techradar.com/news/the-best-portable-apps",
  "title": "Best portable apps of 2021",
  "category": "computing",
  "updated": "2021-10-08T06:52:59Z",
  "author": "daryl-baxter",
  "summary": "Your favorite software, anywhere",
  "article": [
    "The best portable apps make it easy to run programs straight from a USB stick or cloud storage to any device.",
    "Portable apps are programs that don't have to be installed, and don't change your PC's settings. Provided there’s enough space available, you can store portable apps anywhere – an internal drive, an external storage device like a USB stick or SD card, on a networked drive, or a cloud storage service like OneDrive or DropBox.",
    "Portable apps have several advantages: they make it easy to switch between different computers because you can take your software with you, they don't interfere with any other programs installed on your PC, and they can be used on PCs with restricted user permissions (at work or school, for example).",
    "Some portable apps have an ‘installer’, but don't worry – this just unzips a compressed file archive and saves the extracted files to a location of your choice; it doesn’t make any changes to your system files. Other portable apps are provided as a regular ZIP file for you to extract yourself.",
    "The program itself is an EXE file, but the extracted folder will also contain associated files including fonts and settings, which are essential for it to run. Some portable apps have optional language files, which will add to the size considerably, so consider opting out of these unless you need a language other than English.",
    "Here, then, are the best portable apps currently available.",
    "All the popular browsers have portable editions, but for sheer convenience we've opted for Google Chrome Portable. Because it's linked to your Google account, all your bookmarks and preferences are automatically synced, making it the best choice for working on the move.",
    "Chrome also supports hundreds of extensions, though you might want to be a bit picky about which you install – they can bump up the disk space requirements considerably.",
    "A couple of pointers to note are that passwords are not saved between PC's by default, and that certificates are not managed by Chrome but by windows so these won't transfer with you.",
    "LibreOffice Portable is the largest of the portable apps here, but it's still amazingly compact considering it's a full office suite. You’ll need an external drive if you want to carry it, but you can easily keep it in the cloud (Google Drives gives you a free 10GB to play with, and DropBox gives you 2GB).",
    "LibreOffice Portable includes almost all the programs from the installable version of LibreOffice: Writer (word processing), Calc (spreadsheets), Impress (presentations), Draw (vector drawing), Math (formulas), and Base (databases). The only thing missing is Charts – though you can create graphs and other visualizations using Calc.",
    "Like many portable apps, LibreOffice Portable is made using open source code. This takes some time, so it's a few versions behind the installable version of LibreOffice. However, that time has been well spent and it's well optimized for use on the move, with easy access to documents stored on a networked drive, an FTP server, or cloud storage account.",
    "The portable edition of GIMP, the free open source graphic and image editor, should be fine to install on any modern USB stick or any other storage media.",
    "GIMP Portable is a hefty folder thanks to all the necessary resources, including brushes, plugins and fonts. The need to access all of these means GIMP Portable takes a little while to launch, but once it does you've got the perfect tool for advanced photo editing, wherever you are.",
    "It's easy to open files from a local drive, networked storage, or a URL, making GIMP Portable brilliant for editing pictures remotely. The portable edition is based on the full version's current stable release, so you'll get all the latest features and built-in extensions.",
    "VLC is one of the most capable and widely-supported media players around. Its main appeal is its ability to play pretty much any audio or video file or stream, without the need to download additional codecs.",
    "That flexibility makes VLC Media Player Portable extremely handy. Keep it in reserve and if you come across an awkward file that won't play nicely with your regular music or video software, you've got the perfect tool for the job.",
    "VLC Media Player Portable can handle files from any location, including local drives, network storage, and streams. You can even supplement it with extensions to integrate it with specific services - though bear in mind that this will add to its size considerably.",
    "CCleaner is the biggest name in system maintenance. It makes it easy to clear out clutter like temporary files and cookies that not only takes up valuable space, but can also put your privacy at risk.",
    "CCleaner Portable is a handy toolkit that you can run on any PC in need of a good spring clean. The download includes both the 32-bit and 64-bit versions of the program, so you can pick the right one for the OS running on the afflicted machine.",
    "CCleaner Portable is ideal for helping out friends and family members whose PCs have started to slow down (though always check before deleting their cached logins). Oh yes, and if you’re running it from your Downloads folder, don’t worry – it won’t try to delete itself.",
    "Most of the portable software here is nice to have to hand, but Emsisoft Emergency Kit is essential – particularly if you’ve been lumbered with the role of unofficial tech support for your friends and relations.",
    "Emsisoft Emergency Kit isn't a replacement for antivirus software; instead, it's designed to save your bacon if your PC has already become infected with something unpleasant. If your machine is acting strangely, just run the program, update its database of threats, and scan for nasties.",
    "If anything suspicious is found, Emsisoft Emergency Kit quarantines it to preventing it from affecting system files, then gives you the option to delete it, or release it back into the wild."
  ],
  "headers": {},
  "links": {
    "USB stick": "https://www.techradar.com/news/best-usb-flash-drives",
    "SD card": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "ZIP file": "https://www.techradar.com/best/free-winzip-alternative",
    "Google Chrome Portable": "https://portableapps.com/apps/internet/google_chrome_portable",
    "LibreOffice Portable": "https://www.libreoffice.org/download/portable-versions/",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "GIMP Portable": "https://gimp-portable.com/",
    "VLC Media Player Portable": "https://portableapps.com/apps/music_video/vlc_portable",
    "CCleaner Portable": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8147095767765374000/https://www.ccleaner.com/ccleaner/builds",
    "Emsisoft Emergency Kit": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3146939934685064700&xs=1&url=https%3A%2F%2Fwww.emsisoft.com%2Fen%2Fhome%2Femergencykit%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-best-portable-apps",
    "antivirus software": "https://www.techradar.com/best/best-antivirus"
  }
}