{
  "source": "https://www.techradar.com/news/continuing-the-fight-against-fraud-in-2021",
  "title": "Continuing the fight against fraud in 2021",
  "category": "computing",
  "updated": "2021-03-08T12:10:56Z",
  "author": "roy-aston",
  "summary": "The technology that’s going to help fight against fraud",
  "article": [
    "The digital transformation of many businesses has had to accelerate at pace in response to the COVID-19 pandemic. In a short space of time, businesses had to adapt to new ways of working, put technology in place to enable productivity from anywhere, while ensuring customer and employee experiences didn’t falter.",
    "As we’ve transitioned to both living and working from home, it is unsurprising that the stay-at-home orders and social distancing measures have had a huge impact on consumers’ reliance on eCommerce. Lack of access to high street stores, and the need to shop for items to combat the pandemic are driving consumers online. Our research (among 8,000 consumers) showed that 18% of people shopped online for the first time in the first month of the pandemic.",
    "This rapid shift has created challenges across the whole eCommerce ecosystem. More specifically, merchants have had to change their operating models overnight, scale at speed, and assess their payments strategies to accommodate the rise in non-cash transactions. If that wasn’t enough, they also have an even greater challenge of combatting an ever-growing threat: fraud.",
    "Unfortunately, we know that the pandemic has provided opportunities for fraudsters. As the volume of online transactions has surged, so has the number of individuals waiting to capitalize on the situation. History tells us that criminals often thrive in times of crisis, and the threat of cybercrime during COVID-19 is being compounded by the volume of easier targets as some consumers are sharing their financial details online for the first time.",
    "UK Finance has already issued warnings that criminals have adapted to the new circumstances brought about by the pandemic, exploiting people’s need to increasingly transact online. It’s clearly a concern for consumers - 41% state they’re now limiting their online shopping through fear of being a victim of fraud - and a major issue for merchants. Data from our latest research report shows that an increase in fraudulent transactions has been one of the greatest concerns for 55% of businesses. Businesses need to think about their payments capabilities in a smarter way to ensure seamless, secure consumer experiences at scale, as well as keep several steps ahead of the bad actors.",
    "There are key tech developments that will play a significant role in evolving payments solutions and keeping consumers safe. The next generation of cloud computing is one. Over the last couple of decades organizations have moved from operating their own on-premises data-center IT infrastructures to using combinations of public and private clouds in an effort to boost agility, reduce expenditure, and provide more innovative services to customers.",
    "But some shortcomings of the hybrid cloud strategy - namely, the location of services - has hampered companies’ abilities to harness the potential of the cloud, especially in relation to artificial intelligence (AI) use cases and data analytics.",
    "Distributed cloud essentially gets the compute, storage and networking technology closer to the merchant and the consumer; where the data is being generated. It also carries advantages around compliance and regulatory requirements related to where data resides, which can be one of the sticking points of public cloud offerings.",
    "The benefits of distributed cloud for merchants are obvious. The proximity of the data makes it easier, faster, and cheaper to analyze. This allows merchants to use a variety of technologies allowing more insights into customers and transactions.",
    "As a result, businesses can understand how their customers behave, anticipate their needs, and personalize services. More importantly in today’s climate of increased risk for consumers, it can help companies more proactively address cybercrime, uncovering unusual transactions and mitigating attempts at fraud before a customer even knows they were a target.",
    "Automation is nothing new within business, but automation in combination with AI is a game-changer.",
    "With the two technologies working together, organizations can crunch huge amounts of data cheaply, intelligently and at scale. This enables companies to make faster and more accurate decisions because they have insight into every point of the customer journey.",
    "It can help merchants understand consumer buying behavior and how they’re making payments in order to create frictionless routes to purchasing products and services. And when applied to complex issues such as fraud, for instance, the ability to detect patterns, make connections, and spot anomalies becomes infinitely easier.",
    "While it might feel as though cloud, automation, and AI have been around for a long time (in tech terms), the potential of these technologies is still being fully realized. But as they reach critical stages in their maturities, we’ll see them continue to develop into critical tools for merchants and players in the wider payments landscape."
  ],
  "headers": {
    "3": "The rise of fraud",
    "5": "Bringing the cloud into the equation",
    "10": "Add automation to the mix",
    "13": "Looking even further ahead"
  },
  "links": {
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "employee experiences": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "eCommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "IT infrastructures": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}