{
  "source": "https://www.techradar.com/news/innovative-disruption-ride1up-disrupting-the-status-quo",
  "title": "Innovative disruption; Ride1UP disrupting the status quo",
  "category": "news",
  "updated": "2021-07-10T00:02:05Z",
  "author": "sponsored",
  "summary": "Rethinking how we navigate and interact with our communities",
  "article": [
    "Our cities are built around the automobile and that means that even short journeys end up requiring a drive. The result is pollution and congestion, not to mention death and injury from accidents.",
    "Ride1UP wants to change that with its line-up of affordable electric bikes. Active travel is the future for mobility and commuting in our communities, but for many people the cost and the fitness requirements mean that it’s not something they would consider.",
    "Ride1UP aims to break the cycle of car dependency by making electric bikes much more affordable, with its prices ranging from just over $1000 to $2295. An electric bike is a great option for shorter in-town journeys: it’s non-pollution, fast, can be used to carry stuff and gives every rider the assistance they need to make cycling that much easier.",
    "Ride1UP’s founders started off by building their own electric bikes by hand. That showed them how few affordable options there were out there - and that they could offer the same quality as major brands at much lower cost.",
    "An electric bike ups your independence and frees you from your automobile",
    "They also realized just how life-changing an electric bike was, upping their independence and lowering their reliance on an automobile to get around.",
    "The San Diego-based brand also highlights just how efficient electric bikes are, using even less energy per mile than walking or cycling a non-assisted bike. Take a look at its motivating video promoting its vision:",
    "Ride1UP’s range includes features like fenders and lights to make cycling an all-weather option and most models feature disc brakes for great stopping power wet or dry. You can find e-bikes with a rear rack for carrying duties and many models have fully enclosed batteries for clean looks and weatherproof riding.",
    "In fact, Ride1UP has majored on quality specs for all its electric bikes, matching that seen on major brand machines costing thousands of dollars more. Its e-bikes are designed to be just as robust as name brand machines too, with sturdy aluminum frames, suspension forks on many models, quality wheels and tires and components from big names like Shimano and Tektro.",
    "You can get on a Ride1UP Roadster V2 for only $1095 and with a myriad of other choices that are easy on the eyes and the wallet, there is no wonder why Ride1UP has caught our attention. Take a look here at what the Roadster V2 has to offer.",
    "Another popular model, the Core-5, is priced at a startling $1195.",
    "There’s loads of collateral on Ride1UP’s blog online, including an explainer of the range and a buyer’s guide.",
    "The latest Prodigy e-bike will be released next year, with pre-orders opening summer 2021. It comes in city hybrid format and as a step-thru model, both of which have a rigid fork, and as a hardtail mountain bike frame with a suspension fork. It will offer Class 3 e-bike performance with a 28mph top speed.",
    "New Prodigy model offers powerful assistance at a fraction of the cost of name brand e-bikes",
    "The Prodigy’s electric motor and control system come from German brand Brose, as seen on e-bikes from some major bike brands. paired to a 14Ah battery using Samsung lithium ion cells. That gives 250 watts of power and 90Nm torque - again up there with performance figures for MTBs from leading brands",
    "Like Ride1UP’s other e-bikes, the Prodigy’s battery should give you between 30 and 50 miles range, depending on where and how you ride. The bar-mounted controller and display lets you know your charge level and available range as you ride. With a weight of around 48lb, you can carry the e-bike up stairs and into buildings too and it's rated for rider and luggage weight of up to 275lb.",
    "The key to Ride1UP’s low prices is its lean production and distribution. Its low volume packaging means it can offer buyers in the contiguous 48 states shipping free of charge from its Nevada warehouse using major delivery companies, without incurring their larger package rates.",
    "Shipping to Hawaii and Alaska is available for $190 and it will ship to Canada and Mexico for $100.",
    "Ride1UP sells direct from its site and offers 0% finance, a 30 day trial period and one year warranty, along with US based customer support and an extensive knowledge base to help you get the most from your electric bike.",
    "Pledge to use your electric bike to replace five journeys by automobile each month and there’s a further $40 off the price of Ride1UP’s e-bikes."
  ],
  "headers": {
    "12": "Three specs for the new Prodigy",
    "16": "Lean sales and distribution"
  },
  "links": {
    "Ride1UP": "https://classic.avantlink.com/click.php?tt=cl&mi=21413&pw=27131&ctc=trd-us-1279607644325126100&url=https%3A%2F%2Fride1up.com%2F%3Fwpam_id%3D350",
    "Roadster V2": "https://www.youtube.com/watch?v=zvdoTxUGkDo",
    "Core-5": "https://classic.avantlink.com/click.php?tt=cl&mi=21413&pw=27131&ctc=trd-us-1406664762662662700&url=https%3A%2F%2Fride1up.com%2Fproduct%2Fcore-5%2F",
    "blog online": "https://classic.avantlink.com/click.php?tt=cl&mi=21413&pw=27131&ctc=trd-us-3885283727101249000&url=https%3A%2F%2Fride1up.com%2Fblogs%2F",
    "an explainer of the range": "https://classic.avantlink.com/click.php?tt=cl&mi=21413&pw=27131&ctc=trd-us-1067808246322982800&url=https%3A%2F%2Fride1up.com%2Ffinding-your-perfect-ebike-is-hard-we-just-made-it-easier%2F",
    "buyer’s guide": "https://classic.avantlink.com/click.php?tt=cl&mi=21413&pw=27131&ctc=trd-us-1427475434050161000&url=https%3A%2F%2Fride1up.com%2Fwhat-to-look-for-in-your-next-electronic-bike-purchase%2F",
    "Prodigy e-bike": "https://classic.avantlink.com/click.php?tt=cl&mi=21413&pw=27131&ctc=trd-us-9189992379313881000&url=https%3A%2F%2Fride1up.com%2Fproduct%2Fprodigy%2F",
    "step-thru model": "https://classic.avantlink.com/click.php?tt=cl&mi=21413&pw=27131&ctc=trd-us-6165387481116842000&url=https%3A%2F%2Fride1up.com%2Fst-xr-frames-what-is-the-difference%2F",
    "direct from its site": "https://classic.avantlink.com/click.php?tt=cl&mi=21413&pw=27131&ctc=trd-us-1162234521104601600&url=https%3A%2F%2Fride1up.com%2F%3Fwpam_id%3D350"
  }
}