{
  "source": "https://www.techradar.com/news/5g-connections-to-top-three-billion-by-2026",
  "title": "5G connections to top three billion by 2026",
  "category": "phones",
  "updated": "2021-08-10T08:58:27Z",
  "author": "mike-moore",
  "summary": "Juniper Research report predicts 940% 5G growth over next few years",
  "article": [
    "The number of 5G connections across the globe is set for a huge rise as the technology becomes more and more embedded in our everyday lives, reports have claimed.",
    "New figures from Juniper Research predict that the total number of 5G connections will reach 3.2 billion by 2026 - a major increase from the estimated 310 million around today.",
    "Alongside the expected growth in 5G phones and other mobile devices, the rise in connections is set to be spurred on by a number of use cases, with remote healthcare and mobile gaming due to see particularly high growth.",
    "The report notes that the Asia Pacific region will make up a significant portion of this growth, with the area set to account for around 60% of global 5G connections, or two billion, by 2026.",
    "\"Operators in China, Japan and South Korea have all implemented lower subscription costs, which have accelerated 5G adoption, thus enabling these subscribers to explore novel services that require 5G connectivity,\" said report co-author Dave Bowie.",
    "Juniper Research notes that this huge growth will necessitate a significant increase in spending by operators around the world in 5G infrastructure.",
    "Most notably, standalone 5G networks should see a large amount of interest as operators look to best position their services to manage expected increases in future capacity. The report notes that the use of network orchestration tools, which allow operators to use AI analysis of their traffic and adapt network conditions accordingly, will become vital, providing more bandwidth to connections that need it the most, all whilst maintaining strong service performance.",
    "As the average revenue per 5G smartphone declines over the next few years due to market saturation, with Juniper predicting a fall from $29 today to $17 by 2026, network orchestration tools will have another key role to play, allowing operators to retain their network’s highest throughput and lowest latency for the connections that require it.",
    "Maintaining this level of service and network speed would allow operators to justify keeping their charges high to maintain profitability."
  ],
  "headers": {
    "3": "5G growth"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "5G phones": "https://www.techradar.com/best/best-5g-phones"
  }
}