{
  "source": "https://www.techradar.com/news/8-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-august-14-2021",
  "title": "8 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-08-13T14:00:53Z",
  "author": "axel-metz",
  "summary": "Here’s what’s dropping on streamers this weekend",
  "article": [
    "Typically, we’re able to spot themes in our weekly streaming round-ups. Sometimes, there’s an influx of superhero adventures, other times a noticeable abundance of blood and gore. This weekend, though, a decidedly eclectic mix of new movies and TV shows means we’re a little short on consistency.",
    "Over the next few days, we’re being treated to all sorts of different content – tense thrillers, returning comedies, poignant dramas, horror flicks… and yes, even the odd comic book adventure (or two).",
    "Below, we round up eight of the biggest additions coming to the likes of Netflix, Disney Plus and HBO Max to keep you parked in front of the screen this weekend.",
    "Indisputably the most radically different Marvel series to land on Disney Plus so far, What If… ? reimagines the stories of classic MCU characters by thrusting them into hypothetical situations that depart (sometimes drastically) from their mainline movie adventures.",
    "Based on the comics of the same name, this 9-episode animated show (episode 1 is available now) sees Peggy Carter take the Super Soldier serum, Steve Rogers don the Iron Man suit and T'Challa become Star Lord, among other wacky scenarios. Most of the MCU’s cast return in voice form, too, which lends an authenticity to the wild stories.",
    "In our review, we described What If… ? as a surreal anthology series with limitless potential, and we also chatted to the show’s creators to get a sense of just how important it was to mix up the Marvel formula.",
    "Whether you’re a superhero fan or simply enjoy outside-the-box TV concepts, you won’t want to miss this one.",
    "Now available to stream on Disney Plus",
    "The much-loved cop comedy returns for its eighth and final season this weekend, with the first two episodes arriving on Peacock Premium in the US.",
    "The likes of Detective Jake Peralta, Captain Holt and Lieutenant Jeffords will all be bidding farewell to a series that first aired in 2013 – but not before addressing our unanswered questions. How will Jake and Amy handle having a child? Will Holt manage to become commissioner? What’s the deal with Rosa?",
    "For UK viewers, this one may be a little trickier to get hold of (it’s expected to land on E4, but not for a while, which is just annoying), though we suggest consulting our how-to-watch Brooklyn Nine Nine season 8 guide for more on that.",
    "Now available to stream on Peacock Premium in the US",
    "John David Washington swaps entropy for mystery in Netflix’s latest original movie, Beckett, directed by frequent Luca Guadagnino collaborator Ferdinando Cito Filomarino.",
    "Following a tragic car accident in Greece, the titular American tourist finds himself at the center of a dangerous political conspiracy – and on the run for his life. Vicky Krieps, Boyd Holbrook, and Alicia Vikander also star.",
    "Critical reception has been mixed so far, but Beckett at least sounds like a novel take on the tried-and-tested manhunt formula.",
    "Now available to stream on Netflix",
    "Two years after Netflix made a splashy deal to bring the Neon Genesis Evangelion TV series (one of the best anime around) to its streaming service, Amazon Prime Video has brought the later Rebuild movies over to its own streamer – including this, the fourth and final movie in the series.",
    "For the uninitiated, the four films retell the story of the original show with nicer animation and multiple tweaks to how events play out. They can be enjoyed on their own without you ever having watched the series, but we'd recommend binging the show first and then giving this a try. That way you can compare and contrast.",
    "Evangelion superficially looks like any other anime about a young man destined for greatness, who pilots a big mech – but as a million people will tell you, there's a lot more to it than that in terms of themes and imagery. It's really cool that Amazon found a way to get this fourth movie to viewers around the world without waiting for a theatrical release first.",
    "Now streaming on Amazon Prime Video",
    "After bagging several awards at this year’s Sundance Film Festival, CODA (short for Child of Deaf Adults) lands on Apple TV Plus this weekend as a touching portrait of a young girl living among her deaf fishing family.",
    "A remake of the 2014 French film La Famille Bélier, CODA stars Emilia Jones as main character Ruby, who explores her love of singing even as her family’s business faces collapse.",
    "By way of comparison, the last film to win both top Sundance awards was Minari – so this one’s definitely worth a look.",
    "Now available to stream on Apple TV Plus",
    "Amazon’s acclaimed anthology series returns for a second season this weekend, with an all-star cast that includes Kit Harington, Garrett Hedlund, Miranda Richardson, Tobias Menzies, Anna Paquin, Minnie Driver and more.",
    "Once again based on the popular New York Times column, Modern Love’s sophomore outing tells eight more stories exploring relationships, love and human connection from all corners of the globe.",
    "It looks like a right tear-jerker, to be honest.",
    "Now available to stream on Amazon Prime Video",
    "Remember David Cronenberg, acclaimed director of The Fly, A History of Violence and Eastern Promises? Of course you do, but you might not remember him as an actor.",
    "Well, the Canadian filmmaker stars (!) in Slasher: Flesh & Blood, the fourth instalment of the gruesome horror anthology which finds a new home on Shudder, having previously released on both Chiller and Netflix.",
    "Flesh & Blood sees members of a wealthy family reuniting on a secluded island, only to find themselves pitted against each other in a cruel game of life and death – which sounds… fun?",
    "Episodes 1 and 2 are available to stream now, with remaining episodes arriving weekly.",
    "Now available to stream on Shudder",
    "The former DC Universe series becomes an HBO Max exclusive for its third season, which once again follows the exploits of Teen Titans Nightwing, Raven and Beast Boy, among others.",
    "New episodes will see the titular heroes en route to Gotham City, where they reunite with old friends and face new threats (of the masked variety, most likely).",
    "Given the juvenile nature of its source material, Titans has been praised for its darker take on some pretty complex characters – so there’s definitely something here for casual DC fans to enjoy.",
    "Three new episodes are available to stream now, with the rest arriving in weekly instalments. It’s also worth noting that the show is likely to land on Netflix later this year as with seasons 1 and 2, so UK viewers can hopefully get in on the action soon.",
    "Now available to stream on HBO Max in the US"
  ],
  "headers": {
    "3": "What If… ? (Disney Plus)",
    "8": "Brooklyn Nine-Nine season 8 (Peacock Premium)",
    "12": "Beckett (Netflix)",
    "16": "Neon Genesis Evangelion: 3.0+1.0 Thrice Upon a Time (Amazon Prime Video)",
    "20": "CODA (Apple TV Plus)",
    "24": "Modern Love season 2 (Amazon Prime Video)",
    "28": "Slasher: Flesh & Blood (Shudder)",
    "33": "Titans season 3 (HBO Max)"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "our review": "https://www.techradar.com/news/marvels-what-if-is-a-surreal-disney-plus-anthology-show-with-limitless-potential",
    "chatted to the show’s creators": "https://www.techradar.com/news/inside-marvels-what-if-the-disney-plus-animated-show-that-reshapes-the-mcu",
    "Peacock Premium": "https://www.techradar.com/reviews/peacock-tv",
    "how-to-watch Brooklyn Nine Nine season 8 guide": "https://www.techradar.com/news/how-to-watch-brooklyn-nine-nine-season-8-online-stream-from-anywhere",
    "best anime": "https://www.techradar.com/best/best-anime",
    "Shudder": "https://www.techradar.com/best/best-shudder-movies"
  }
}