{
  "source": "https://www.techradar.com/news/what-time-is-rick-and-morty-season-5-episode-5-released-today",
  "title": "When is Rick and Morty season 5 episode 9 released? Return date, trailer and more",
  "category": "entertainment",
  "updated": "2021-09-06T10:21:29Z",
  "author": "samuel-roberts",
  "summary": "Here's when Rick and Morty season 5 episode 9 airs on Adult Swim",
  "article": [
    "Rick and Morty season 5, episode 9 has a release date, and it's very soon: Sunday, September 5, 2021. The season finale will bundle together the final , 'Forgetting Sarick Mortshall' and 'Rickmurai Jack', the show is taking a brief hiatus in season 5 while we wait for the finale.",
    "The brief wait for this finale has been most welcome: episode 8 of Rick and Morty season 5 was intense, so a bit of breathing room from all that emotional turmoil and lore seemed like a sensible idea. Now, with the finale coming up, we're ready to jump back in to the sci-fi animated comedy.",
    "Here's what we know about Rick and Morty season 5, episode 9 so far, including a teaser trailer of what's to come.",
    "Rick and Morty season 5 episode 9 is airing on Adult Swim in the US on Sunday, September 5 at 11pm Eastern time (or 10pm Central time/11pm Pacific). If you miss the episode but you've got your cable provider details available, it's possible to log in on the Adult Swim and stream season 5 episodes. Episode 1 is currently available to watch for free.",
    "Rick and Morty season 5 has, up until episode 9, ran with zero breaks so far – a relief after the annoying mid-season hiatus of season 4. Here's the schedule for season 5:",
    "There is a brief teaser for Rick and Morty season 5, episode 9 that asks \"what is Rick without Morty?\", with Rick spinning a 'wheel of better things that Morty' to set up the (possible) premise for this season finale. Check it out below:",
    "Rick and Morty season 5 can't currently be streamed on HBO Max, only seasons 1-4. You'll have to watch the show on Adult Swim to stay up to date for the time being.",
    "Rick and Morty season 5 episode 9 will air on the UK channel E4 at 10pm on Monday, September 6. Handily, the episodes are streaming on-demand on All4 afterwards for free – so you don't need to watch it live.",
    "In Australia, episodes of Rick and Morty are fast-tracked from the States to Netflix, though you'll have to wait a few hours for new episodes to appear on the service – that's certainly preferable to Netflix's approach last season, in which episodes would arrive on the service a week behind the rest of the world. Season 5 episode 9 will arrive on Netflix in Australia at around 5pm (AEST) on Monday, September 6.",
    "You can't currently watch Rick and Morty season 5 on Netflix in the UK, only seasons 1-4. We're hopeful, though, that it'll be added to the library eventually."
  ],
  "headers": {
    "3": "When is Rick and Morty season 5 episode 9 released on Adult Swim?",
    "4": "Rick and Morty season 5 release schedule",
    "5": "Rick and Morty season 5 episode 9 trailer",
    "6": "Is Rick and Morty season 5 on HBO Max?",
    "7": "When is Rick and Morty season 5 episode 9 airing on E4 in the UK?",
    "8": "When is Rick and Morty season 5 arriving on Netflix in Australia?",
    "9": "Will Rick and Morty season 5 be released on Netflix UK?"
  },
  "links": {
    "currently available to watch for free": "https://www.adultswim.com/videos/rick-and-morty/mort-dinner-rick-andre"
  }
}