{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-have-a-tiny-outer-screen",
  "title": "Samsung Galaxy Z Fold 3 could have a tiny outer screen",
  "category": "phones",
  "updated": "2021-04-07T09:55:50Z",
  "author": "hamish-hector",
  "summary": "Does size really matter?",
  "article": [
    "A new rumor suggests that the Samsung Galaxy Z Fold 3 may have a very small outer screen; one that’s smaller than the screen on the Galaxy Z Fold 2. The leak says the display will be the same resolution (816 x 2260 pixels) but will only be a 5.4-inch display, rather than the 6.2-inch of the Fold 2.",
    "This new display size seems a little off if you ask us - so it’s worth taking this leak with an extra pinch of salt - especially since the inner display will supposedly be a much larger 7.7-inches.",
    "It’s possible that it’s just a typo and we could be looking at a 6.4-inch display instead but we’ll have to wait for an official reveal to know for sure.",
    "If the leak is true, the design of the Galaxy Z Fold 3 could be disappointing for fans looking to upgrade their Fold 2 or those wanting to try out a folding phone for the first time. We’ll have to see if there is a method to Samsung’s madness should the leak turn out to be real.",
    "Samsung’s Z Fold line of phones open up like a book and feature two screens. One screen sits on the phone’s ‘front cover’ - making it look like a thicker regular phone - and the other is inside - giving you an extra large ‘double-page spread’ of a display.",
    "The aim of the Z Fold series is to balance keeping the smaller form factor of a phone but give you a larger screen like a tablet, though the developing tech and extra components mean that it can all come at a price.",
    "If the Z Fold 3 does feature a smaller outer display than its predecessor, our first guess is that this is a cost saving method.",
    "Hopefully, the screen size would be part of a plan to bring the new model into a more reasonable price range for phone buyers. As we learn more about the Galaxy Z Fold 3, we’ll be sure to keep you updated.",
    "Via GSMArena"
  ],
  "headers": {
    "4": "Why are there two displays on the Z Fold 3?"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "leak": "https://twitter.com/chunvn8888/status/1379357251807272962?s=20",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_z_fold3_may_have_a_smaller_outer_screen-news-48540.php"
  }
}