{
  "source": "https://www.techradar.com/news/dont-get-burnt-by-email-scams-this-summer-with-our-top-security-tips",
  "title": "Don't get burnt by email scams this summer with our top security tips",
  "category": "computing",
  "updated": "2021-08-20T13:53:26Z",
  "author": "techradar-pro",
  "summary": "Stay safe from scams by following our security guidance",
  "article": [
    "Summer is typically a time to relax, enjoy some downtime and maybe even get away to some far-flung holiday location for some sun, sea and sand - although with pandemic restrictions still in place for many, these vacations may be a little closer to home this year.",
    "But if you've not managed to escape the office this summer, you'll still need to make sure you stay protected - not from sunburn or too many drinks by the pool, but online.",
    "Unfortunately scammers don't take the holidays off, and whether you're at home or back in the office, cybersecurity needs to continue all year round, even as you take a break. Here's some of our top tips to stay safe from email scams and other online threats.",
    "With ongoing Covid restrictions meaning many of us are once again opting for \"staycations\", there is always a temptation to check work emails or messages.",
    "Although your co-workers may have told you to have some time away from emails, and whilst there may be nothing wrong with the occasional inbox scan, that's no reason to let up on your security when away from work.",
    "Always keep your guard up when checking work-related emails, and make sure you don't fall victim to \"holiday brain\", slip up and unwittingly open up a scam link or message. Even if you do, Bitdefender Total Security is able to cover all your security needs, packing in real-time data protection,malware blockers and antivirus to keep your device and your data safe from all the latest threats.",
    "Among the most common email scams are phishing threats, where hackers send spoof messages that imitate a legitimate company in an attempt to fool victims and steal login details or personal information.",
    "If you receive an email that looks or seems suspicious, be sure to carefully examine it - phishing messages often contain obvious spelling mistakes, wrong images or formatting errors, or have clearly malicious links that can be detected by hovering over them with your cursor.",
    "Bitdefender Total Security is able to safeguard from such threats with its advanced anti-phishing protection, detecting and blocking malicious websites that pose as legitimate businesses or organisations.",
    "Along with getting a new summer wardrobe, you can also make sure that your security protection and passwords stay fresh in order to stay safe from scams.",
    "Having strong and unique passwords for your accounts can keep scammers and hackers at bay, meaning criminals aren’t able to gain access to any of your online accounts or personal devices.",
    "Re-using passwords across multiple accounts is never advised, as all it takes is for one of these to be compromised for hackers to gain knowledge of your logins to everything else.",
    "Bitdefender Total Security features an in-built Password Manager service that can secure not just passwords, but also credit card information and other sensitive data in a cyber-vault for easy access whenever you need them, as well as recommending secure password suggestions to make sure all your accounts stay protected.",
    "Along with work devices, many of us are aware that proper security protection is needed across all our internet-connected devices, whether that's a laptop, desktop, printer or more.",
    "All it takes is for one device to fall victim to a scam or virus for the entire network to be compromised, so the need to secure all your products is greater than ever.",
    "Bitdefender Total Security is able to secure all your devices, working across multiple software versions, including Windows, macOS, Android and iOS - and with up to 15 devices covered per subscription household, you can make sure all your mobile devices stay protected."
  ],
  "headers": {
    "3": "Keep your guard up",
    "6": "Beware phishing threats",
    "9": "Ensure your passwords are looking their best",
    "13": "Keep all your devices covered"
  },
  "links": {
    "Bitdefender Total Security": "https://www.bitdefender.co.uk/solutions/total-security.html"
  }
}