{
  "source": "https://www.techradar.com/news/marvell-takes-on-broadcom-with-billion-dollar-innovium-deal",
  "title": "Marvell takes on Broadcom with billion-dollar Innovium deal",
  "category": "computing",
  "updated": "2021-08-03T20:25:42Z",
  "author": "anthony-spadafora",
  "summary": "Acquisition will help Marvell expand its presence in the growing cloud data center market",
  "article": [
    "Marvell Technology has announced its plans to acquire the chip maker Innovium for $1.1bn in an all-stock deal to complement its Ethernet offerings.",
    "Once the acquisition is complete, the semiconductor company will be better positioned to go head-to-head with its rival Broadcom which currently dominates the market for chips that go into the switches used in cloud data centers.",
    "Last year Marvell purchased Inphi Corp, which builds chips to connect switches with fiber optic cables, for $10bn to help it move further into the cloud data center market and by acquiring Innovium, the company will be able to continue these efforts.",
    "President and CEO of Marvell, Matt Murphy provided further insight on its decision to acquire Innovium in a press release, saying;",
    "“Our acquisition of Innovium and its complementary offerings further extends Marvell’s leadership in the cloud, and I am excited that Innovium has secured significant share at a marquee cloud customer. Innovium has established itself as a strong cloud data center merchant switch silicon provider with a proven platform, and we look forward to working with their talented team who have a strong track record in the industry for delivering multiple generations of highly successful products.”",
    "By acquiring Innovium, Marvell aims to position itself as the semiconductor solutions partner for cloud computing giants including AWS, Microsoft and others which makes a lot of sense as the data center market for Ethernet switch silicon is expected to grow to $2bn by 2026.",
    "The company also expects that its purchase of Innovium will add $150m in incremental revenue to its books by next fiscal year.",
    "Once the transaction is complete, CTO and founder of Innovium Puneet Agarwal will join Marvell along with the rest of the company's team. Together they'll work to improve Innovium's cloud-optimized switch program within the combined company.",
    "Under the terms of the deal, Marvell will pay $1.1bn in stock as it takes on $145m in cash from Innovium's balance sheet so that the total net cost of the deal will amount to $955m."
  ],
  "headers": {
    "5": "Innovium acquisition"
  },
  "links": {
    "Marvell Technology": "https://www.techradar.com/news/first-pcie-50-ssds-could-top-10gbps-thanks-to-this-chipset",
    "Broadcom": "https://www.techradar.com/news/broadcom-reportedly-set-to-buy-software-giant-sas",
    "press release": "https://www.marvell.com/company/newsroom/marvell-to-acquire-innovium-accelerates-cloud-growth-with-expanded-ethernet-switching-portfolio.html",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}