{
  "source": "https://www.techradar.com/news/is-the-razer-project-hazel-chroma-facemask-coming-too-late",
  "title": "Is the Razer Project Hazel Chroma facemask coming too late?",
  "category": "appliances",
  "updated": "2021-06-15T14:08:46Z",
  "author": "hamish-hector",
  "summary": "Too late or just in time?",
  "article": [
    "During its E3 2021 conference, Razer finally provided us with more details about the Project Hazel N95 respirator it showed off at CES 2021, including a rough release date for the RGB facemask.",
    "It does feel as though it's coming a little late, though, and you won’t be likely to get one until “early Q4”, according to Razer CEO Min-Liang Tan.",
    "In less technical terms, that means that we won’t see one until October 2021 at the earliest. That’s still some time away, and we can’t help but feel like Project Hazel is releasing a bit too late to be relevant to the Covid-19 pandemic.",
    "Is that the case though? While we wait for a more exact release date when we can get our hand on the latest Razer launch, here’s an explanation of what Project Hazel is and why it might not be one to dismiss just yet.",
    "We might not have Razer’s Project Hazel in our hands yet, but the company has shared a lot of details explaining why it’s more than just a facemask with its iconic Chroma RGB lighting.",
    "For one, Project Hazel boasts high bacterial filtration efficiency (BFE) and a high fluid resistance to give it the same protection levels as a surgical N95 respirator - with active ventilation, a UV light for auto-sterilization, and replaceable and rechargeable ventilators to keep you protected all day long.",
    "It should improve the mask-wearing experience, too. Project Hazel is designed to fit comfortably and can be customised to fit different face shapes. What’s more, the mask includes a clear plastic screen with LED lighting to illuminate your mouth and an in-built microphone to amplify your voice. These features should mean that communication is a lot easier than in a typical face covering.",
    "While that’s great, does any of it really matter if Covid-19 vaccines are making it relatively safer to interact with friends, family and strangers, as well as the potential for demand of masks to dry up?",
    "Here in the US and UK, the worst of the pandemic appears to reaching a safe conclusion. Vaccination rates are rising and life is gradually returning to normal as a result, though this isn’t the case everywhere. Parts of the world are still seeing high Covid-19 case numbers and, while richer nations have made a pledge to donate one billion vaccines to poorer countries by the end of 2022 (per BBC), they don’t yet have the vaccines needed to help keep those numbers down.",
    "Hopefully, this will have started to change by October but, as we’ve seen with treatment rollouts already, it takes time to get to everyone and so we could see aspects of the pandemic lasting into 2022 and beyond. Because of this, there’s a fairly high chance that Razer’s facemask will still find a market, with users keen to wear it to stay safe from Covid-19 when it's eventually released.",
    "We may also find that people want to keep wearing masks after mandates have been lifted. They’ve helped keep other virus rates low, so the general population might be keen to keep up their more healthy lifestyles. It also can’t be ignored that whatever the item, a ‘limited drop’ instantly gives it an air of exclusivity that means everyone will want one - just look at items like the Supreme Brick.",
    "While Razer’s Project Hazel mask might be coming late into the pandemic, then, it probably isn't too late to help keep some people safe, and its overdue release won't affect Razer's ability to sell them as quickly as the PS5 and latest GPUs.",
    "As we learn more about Razer's Project Hazel, including details on how you can get one for yourself, we'll be sure to keep you updated on everything you need to know."
  ],
  "headers": {
    "4": "What makes Project Hazel more than just a mask?",
    "8": "Analysis: Is Project Hazel coming too late?"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Project Hazel N95 respirator": "https://www.techradar.com/news/razers-project-hazel-has-us-genuinely-excited-to-wear-a-smart-face-mask",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "BBC": "https://www.bbc.co.uk/news/live/uk-57458944",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "latest GPUs": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458"
  }
}