{
  "source": "https://www.techradar.com/news/new-microsoft-365-tool-makes-reporting-dodgy-emails-a-breeze",
  "title": "New Microsoft 365 tool makes reporting dodgy emails a breeze",
  "category": "computing",
  "updated": "2021-08-16T20:16:55Z",
  "author": "anthony-spadafora",
  "summary": "NCSC's new tool lets employees report phishing emails and online scams with one click",
  "article": [
    "The National Cyber Security Center (NCSC) is making it even easier for UK employees to report phishing emails thanks to the release of its new reporting tool which can be added to an organization's Microsoft 365 accounts.",
    "Once added to Microsoft 365, the tool appears as a new button that employees can click on to report phishing emails or potential scams to the NCSC's Suspicious Email Reporting Service (SERS). However, clicking the button will also inform an organization's IT team so that everyone can be aware of the threat.",
    "Since its launch in April of last year, SERS has received over 6.5m reports from the public which resulted in the removal of more than 97k scam URLs. In fact, during July of this year, it took just four hours on average to remove the malicious URLs used in phishing emails reported to the NCSC's SERS.",
    "Technical director of the NCSC, Dr. Ian Levy provided further insight in a press release on the new tool's potential to help stop phishing campaigns and other scams from reaching employee inboxes, saying:",
    "“Opportunistic scams during the pandemic have demonstrated how cyber criminals constantly find new ways to target us. The good news is that you can help protect your workplace by forwarding suspected scam emails to the Suspicious Email Reporting Service from your work email account at the click of a button. This simple technical innovation could enable millions more people to join our mission to stop scam emails from ever reaching UK inboxes.”",
    "Although many of the best email services include filtering systems that can block phishing attacks before they reach your inbox, cybercriminals continue to devise new ways to bypass these defense systems.",
    "Some of the recent phishing campaigns identified by experts at the NCSC that target organizations include malware, clone login pages and emails containing fake alerts about online collaboration software and video conferencing software from Microsoft, Google and other tech giants.",
    "Organizations interested in adding the NCSC's reporting tool to Microsoft 365 can check out this guide for more information while organizations that are unable to install the new tool are still encouraged to forward potential email scams directly to the NCSC.",
    "By crowdsourcing the detection and reporting of phishing emails and other online scams, the NCSC is not only helping protect organizations in the UK but businesses around the world."
  ],
  "headers": {
    "5": "Reporting phishing and online scams"
  },
  "links": {
    "NCSC": "https://www.techradar.com/news/that-sms-message-could-be-some-seriously-nasty-android-malware",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "SERS": "https://www.ncsc.gov.uk/information/report-suspicious-emails",
    "press release": "https://www.ncsc.gov.uk/news/email-innovation-simplifies-takedown-of-cyber-scams",
    "best email services": "https://www.techradar.com/news/best-email-provider",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "online collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "check out this guide": "https://www.ncsc.gov.uk/guidance/configuring-o365-outlook-report-phishing-for-sers"
  }
}