{
  "source": "https://www.techradar.com/news/this-nintendo-switch-online-rumor-could-be-a-rare-opportunity-for-switch-owners",
  "title": "This Nintendo Switch Online rumor could be a Rare opportunity for Switch owners",
  "category": "gaming",
  "updated": "2021-10-05T11:38:18Z",
  "author": "rhys-wood",
  "summary": "And it's not that much of a stretch",
  "article": [
    "Nintendo Switch Online's upcoming Expansion Pack subscription plan is due to launch around the end of October 2021, and will see the addition of Nintendo 64 and Sega Genesis / Mega Drive games to the service.",
    "As reported by Wccftech, trusted insider and co-founder of Xbox Era Nick Baker believes that one of the best games on the N64, Perfect Dark, will be available as part of Nintendo Switch Online's Expansion Pack before the end of the year.",
    "Additionally, Baker stated in another tweet that he assumes all Rare-developed N64 titles will be made available on Expansion Pack. If true, this would encapsulate popular N64 titles like Killer Instinct Gold, Conker's Bad Fur Day, Jet Force Gemini and more.",
    "Currently, we don't know much about Nintendo Switch Online's Expansion Pack subscription plan, besides the added inclusion of N64 and Genesis / Mega Drive titles.",
    "During the September 2021 Nintendo Direct, presenter Yoshiaki Koizumi stated that more details about the plan, including release date and pricing, will be revealed sometime in the month of October.",
    "Considering Rare is currently owned by Microsoft, you might take one glance at this rumor and scoff. However, it's really not all that much of a stretch. Banjo-Kazooie has already been confirmed as one of the N64 titles coming to Nintendo Switch Online, so another Rare-developed game like Perfect Dark doesn't seem all that impossible. It would also be a great addition to tide us over until the release of the new Perfect Dark on Xbox Series X/S and PC.",
    "In fact, Microsoft and Nintendo seem to be on good terms overall. The two companies have collaborated multiple times in the past, including bringing cross-play to Minecraft and featuring Banjo and Kazooie as playable characters in Super Smash Bros. Ultimate.",
    "We really wouldn't be surprised, then, if Microsoft is willing to greenlight other Rare titles for the Expansion Pack service. The British developer was such a prolific presence on the N64 that Expansion Pack would be sorely lacking without it. We'd at least love to see more Nintendo-centric Rare titles show up on the service, including Donkey Kong 64 and Diddy Kong Racing.",
    "One game we're certain won't make the cut, though, has to be GoldenEye 007. The Bond license has been infamously slippery in the years since the N64 classic's release and is currently co-owned by MGM Studios and Danjaq LLC, both of which Nintendo would have to go through in order to get Bond back. We'd be disappointed, but not at all surprised, if Nintendo deemed GoldenEye 007 not worth the effort in that case."
  ],
  "headers": {
    "5": "Analysis: Has Nintendo finally struck gold with Switch Online?"
  },
  "links": {
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer",
    "Expansion Pack": "https://www.techradar.com/news/nintendo-switch-online-to-offer-n64-and-genesis-games-with-new-subscription-plan",
    "Wccftech": "https://wccftech.com/perfect-dark-nintend-switch-online-n64/",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "another tweet": "https://twitter.com/Shpeshal_Nick/status/1444980560531582976?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1444980560531582976%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwccftech.com%2Fperfect-dark-nintend-switch-online-n64%2F",
    "new Perfect Dark": "https://www.techradar.com/news/perfect-dark-trailer-at-game-show-awards-shows-joanna-dark-is-back",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "cross-play to Minecraft": "https://www.techradar.com/news/this-nintendo-switch-xbox-one-cross-play-trailer-is-the-greatest",
    "Super Smash Bros. Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review",
    "GoldenEye 007": "https://www.techradar.com/news/gaming/relive-the-greatness-of-goldeneye-with-this-hd-fan-made-remake-1326553"
  }
}