{
  "source": "https://www.techradar.com/news/ikeas-new-starkvind-air-purifier-can-transform-into-a-coffee-table",
  "title": "IKEA’s new Starkvind air purifier can transform into a coffee table",
  "category": "appliances",
  "updated": "2021-08-06T13:50:32Z",
  "author": "jamel-smith",
  "summary": "Save space with the Swedish furniture brand’s latest two-in-one device",
  "article": [
    "IKEA has unveiled a new air purifier that can double as a side table, ensuring that those tight on space will still be able to enjoy clean air in their homes.",
    "The IKEA Starkvind air purifier, which is also available as a stand-alone appliance (if you have the space for it) is suitable for small-to-medium rooms up to 215 square feet in size.",
    "IKEA claims the three-filter purification system in the air purifier can trap 99.5% of particles measuring 0.1-2.5 micrometers in size – including dust, pollen, formaldehyde and other indoor air pollutants, many of which are caused by the way we clean, heat and cook in our homes. The IKEA Starkvind will go on sale in the US in October with two variations, a standalone version available in black or white for $129 and the coffee table version for $189.",
    "By connecting the Starkvind to IKEA’s smart home control device, the Tradfri gateway, which is part of the kit needed to control the IKEA Tradfri smart plug, you can control and schedule the air purifier via the IKEA home smart app. It also brings Amazon’s Alexa, Google’s Home, and HomeKit integration to the air purifier, so you can control Starkvind with your voice and ensure it works with any existing smart home devices you have in your home. This is an upgrade on IKEA’s previous air purifiers, such as the Fornuftig which had to be connected to a third-party smart plug to be used in home automations.",
    "IKEA has also equipped the Starkvind with a built-in air quality sensor which will now facilitate an auto mode. In auto mode, it’ll adjust the purifier’s fan speed according to the amount of PM2.5 particles in the air.",
    "With the Starkvind starting from an affordable $129 price, IKEA is looking to pull customers away from the market-leading and highly expensive air purifiers that range from $500 to even $1,000, like Dyson’s range of purifiers and Blueair’s 211+ and Conways’s AP-12512 HH.",
    "Though these air purifiers are effective at filtering air, their price points are simply unaffordable for the average consumer. With the Starkvind, those that want an air purifier to help alleviate their hayfever or asthma have a relatively affordable device that’ll also get the job done.",
    "There's a $60 uptick of course to get a Starkvind model that doubles as a coffee table – not a huge ask compared to Dyson models, but still something to consider given that a cheap IKEA coffee table can cost just $30 by itself.",
    "We can also assume IKEA will keep replacement filters at around the same cheap price as Fornuftigs. Currently, prices are $12.99 for a replacement gas filter and $5.99 for the particle remover, compared to the $79.99 you’ll need to fork out a Dyson replacement air filter. Affordability is obviously paramount for IKEA, and while this model likely won't be as effective as the likes of Dyson, there's no denying the value here."
  ],
  "headers": {
    "5": "Analysis: Price is everything"
  },
  "links": {
    "IKEA Tradfri smart plug": "https://www.techradar.com/reviews/ikea-tradfri-wireless-control-outlet"
  }
}