{
  "source": "https://www.techradar.com/news/funimation-cost",
  "title": "Funimation cost and plan prices guide",
  "category": "entertainment",
  "updated": "2021-10-19T10:17:34Z",
  "author": "daniel-pateman",
  "summary": "Stream hundreds of anime titles online without breaking the bank",
  "article": [
    "There’s a voracious global appetite for anime content, and streaming service Funimation is an all-you-can-eat buffet for die-hard fans of Japanese animation. It’s home to hundreds of TV shows, from ready-to-binge classics like Dragon Ball and My Hero Academic to new episodes simulcast straight out of Japan. And when it comes to the Funimation cost? Well, that depends on the subscription package you choose.",
    "There are slight variations from region to region. But, regardless of where you’re streaming from, you’re guaranteed a quality library of captivating anime content. Read on below for a detailed breakdown of what you can enjoy for the Funimation cost.",
    "US and Canadian subscribers can choose between three separate plans:",
    "Each subscription offers uninterrupted, ad-free access to over 15,000 hours of anime content – predominantly dubbed, though many titles are available with subtitles too – and it can all be streamed in pristine HD (1080p) quality.",
    "There are a few key differences between Premium and Premium Plus. You’re limited to two streams with the former plan, but Plus will let you stream to five different devices at once. It also has download functionality, enabling you to watch titles offline on your mobile device via the Funimation app.",
    "The nuclear option, however, is Premium Plus Ultra. It’s an annual plan that provides everything included in the Premium Plus package, but with free shipping on ALL orders and an annual anniversary gift.",
    "Internationally, Funimation is available to subscribers in the UK, Ireland, Australia, New Zealand, Mexico, Brazil, and now Columbia, Chile and Peru. There’s only one Premium Plus option though, that lacks the bells and whistles of its North American counterpart (e.g., you get 5 simultaneous streams and downloads for offline viewing, but none of the freebies).",
    "The Funimation cost in certain territories is provided below:",
    "There’s plenty of excellent anime content to gawk over. So, if you decide to splurge on an annual subscription, don’t feel guilty: you’ll save a tidy 16% off the Funimation cost when paid in one chunk annually. Better still, no matter where you are in the world, you can benefit from a Funimation free trial.",
    "Head to the Funimation website and sign up to the right plan for you",
    "The price points for Crunchyroll subscriptions are higher than their equivalent Funimation price plans. The entry-level Fan option is $7.99 a month, allowing for a single stream and no download functionality. However, pay $14.99 for the top-tier Ultimate Fan option, and get an impressive 6 streams and $25 off every $100 spent quarterly in the Crunchyroll store.",
    "Yes, you’ll pay more than the Funimation cost for a Crunchyroll membership. But you also get more bang for your buck. Boasting over 1100 titles in comparison to around 700, Crunchyroll is the self-dubbed “world’s largest anime collection”. It’s got its own original shows and some live-action dramas (\"dorama\"), plus a collection of digital manga for die-hard anime fans.",
    "Other than the price, there’s one significant difference. Funimation specializes in dubbed content, so it’s great for people who don’t speak Japanese or find subtitles distracting (although much of its content includes subs too). Almost everything on Crunchyroll is subtitled and presented with the original Japanese voice cast though, so it could be the preferred option for anime purists.",
    "These differences might soon become a moot point, however, as Funimation Global Group LLC recently gobbled up Crunchyroll through an acquisition finalized in August. While future plans for the service are unclear, the CEO of Sony Pictures Entertainment commented that they intend to “create a unified anime subscription experience”: suggesting that the two services will be merged into one mammoth anime offering.",
    "Until then, both platforms have their own merits. And, much like Funimation, there is a 14-day Crunchyroll free trial offer for new subscribers.",
    "Hardcore anime fans will definitely want to invest their entertainment dollars in an SVOD service like Funimation. Those with a more casual interest, however, might want to explore the platforms listed below. Each provides a respectable collection of anime, but alongside a broader variety of TV and movie titles.",
    "Netflix",
    "From $8.99 a month you can dive into a library of over 6000 TV shows and feature films. Over 200 of those are anime titles, including Netflix Originals Castlevania and Knights of Sidonia, Pokémon: Indigo League, Full Metal Alchemist, and the acclaimed Neon Genesis Evangelion. And the number of titles keep on growing, with Super Crooks hitting the platform on November 25. Plus, if you're in the UK, you'll also have access to Studio Ghibli's acclaimed movies.",
    "HBO Max",
    "HBO Max counts Studio Ghibli and Crunchyroll among its 10 content hubs, all accessible with the $9.99 ‘With Ads’ and the $14.99 ‘Ad-Free’ plans. The WarnerMedia Direct platform has the exclusive streaming rights to every Studio Ghibli movie (with the exception of Grave of the Fireflies). It has also culled a few dozen titles from the Crunchyroll platform, among them popular hits like Death Note, Erased, Tokyo Revengers and Kabaneri of the Iron Fortress. So, while its anime offering is modest compared to Funimation – totalling less than 50 titles – they’re of a very high calibre.",
    "Amazon Prime Video",
    "There’s a decent haul of anime here too, with classics like Akira, Cowboy Bebop and Amazon Original series Blade of the Immortal, plus the whole Evangelion film series including Evangelion: 3.0+1.01 Thrice Upon a Time. It’s $12.99 for an Amazon Prime subscription, which gifts members additional perks like free delivery, Prime Music and more. Or you can pay $8.99 instead if you just want to access its huge entertainment library. Be aware, though, that a significant amount of its anime offering appears to require a one-off rental fee to watch, rather than being part of a paid Prime membership.",
    "Hulu",
    "To the discerning anime fan, Hulu could be the perfect companion. It’s $6.99 ad-supported plan provides a whopping library of over 4000 films and TV shows, with a surprisingly strong showing of titles harvested under its anime hub. You’ll spy content familiar from the Funimation platform here: all 4 seasons of Attack on Titan, Dragon Ball, Tokyo Ghoul, Assassination Classroom, My Hero Academia, Sailor Moon, and the recently added Demon Slayer: Kimetsu No Yaiba. Plus, you can stream exclusive Hulu Originals like Love Victor and Only Murders in the Building if you're looking for some variation.",
    "Read more:"
  ],
  "headers": {
    "2": "Funimation cost and plans at a glance",
    "10": "How does the Funimation cost compare to Crunchyroll?",
    "15": "How does the Funimation cost compare to other streaming services?"
  },
  "links": {
    "Funimation": "https://www.techradar.com/news/funimation-explained-subscriptions-sign-up-free-account",
    "three separate plans": "https://funimation.8u86.net/c/221109/302280/4688?subId1=trd-us-1300713522440291600&sharedId=trd-us&u=https%3A%2F%2Fwww.funimation.com%2Fsubscribe%2F",
    "Funimation app": "https://www.techradar.com/news/funimation-app",
    "save a tidy 16% off": "https://funimation.8u86.net/c/221109/302280/4688?subId1=trd-us-5997858494835809000&sharedId=trd-us&u=https%3A%2F%2Fwww.funimation.com%2Fsubscribe%2F",
    "Funimation free trial": "https://www.techradar.com/news/funimation-free-trial",
    "Head to the Funimation website and sign up to the right plan for you": "https://funimation.8u86.net/c/221109/302280/4688?subId1=trd-us-1322167618801505800&sharedId=trd-us&u=https%3A%2F%2Fwww.funimation.com%2Fsubscribe%2F",
    "Crunchyroll subscriptions": "https://www.crunchyroll.com/",
    "Funimation Global Group LLC recently gobbled up Crunchyroll": "https://www.techradar.com/news/crunchyroll-and-funimation-unified-is-the-future-of-streaming-wars-summed-up",
    "Crunchyroll free trial": "https://www.techradar.com/news/crunchyroll-free-trial",
    "Studio Ghibli": "https://www.techradar.com/news/where-to-watch-studio-ghibli-films-from-anywhere-stream-on-netflix-and-beyond",
    "Evangelion: 3.0+1.01 Thrice Upon a Time": "https://www.techradar.com/news/how-to-watch-evangelion-30101-thrice-upon-a-time-stream-online",
    "anime hub": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1079970566874782000&xs=1&url=https%3A%2F%2Fwww.hulu.com%2Fhub%2Fanime&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ffunimation-cost",
    "Attack on Titan": "https://www.techradar.com/news/how-to-watch-attack-on-titan-season-4-online-stream-every-new-episode-from-anywhere",
    "Only Murders in the Building": "https://www.techradar.com/news/how-to-watch-only-murders-in-the-building-online"
  }
}