{
  "source": "https://www.techradar.com/news/apex-legends-and-titanfall-developer-is-working-on-a-brand-new-game",
  "title": "Apex Legends and Titanfall developer is working on a brand new game",
  "category": "gaming",
  "updated": "2021-04-24T17:07:05Z",
  "author": "emma-boyle",
  "summary": "Building a new IP \"from scratch\"",
  "article": [
    "Respawn Entertainment, the development studio behind games such as Apex Legends, Star Wars Jedi: Fallen Order and Titanfall, has revealed that it's in the early stages of developing a new game.",
    "The news was revealed by programmer at Respawn Entertainment, Steven Kah Hien Wong, who tweeted out a job advertisement for a software engineer, in which it's confirmed that the role is for a \"brand new IP\". This was then retweeted by Respawn’s studio head Vince Zampella, who called the new project “super exciting stuff”.",
    "It’s clear that the new game is still in the very early stages of development; not only is Zampella inviting applicants to “get in early”, programmer Steven Kah Hien Wong stated that the development team currently comprises only five people, with the new hire to be the sixth.",
    "At this early stage, we can probably figure out more about what the game isn’t than what it is. As a “new IP” that’s being built “from scratch”, it seems safe to say that this title isn’t going to be another Star Wars game or that highly-desired third Titanfall game (sorry Titanfall fans).",
    "The only thing that's close to a hint in the job advertisement for the game is that whoever is hired will be part of a team that's aiming to “Pioneer new ways to enable ‘adventuring until the heat death of the universe’\", which sounds exciting and ambitious but isn’t particularly enlightening. Does that mean space? Procedural generation? Game as a service? None of the above? We imagine we won't find out for a while.",
    "While this new IP is in development, Respawn Entertainment still has plenty on its plate with Apex Legends. The game’s ninth season, called Legacy, is fast approaching for console and PC players, while the first regional beta tests for Apex Legends Mobile are kicking off later this month with plans to expand to “more regions and more players around the world” through 2021",
    "Via IGN"
  ],
  "headers": {
    "4": "A mystery"
  },
  "links": {
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Star Wars Jedi: Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "Titanfall": "https://www.techradar.com/news/titanfall-2-review",
    "tweeted": "https://twitter.com/gluttyriceball/status/1385307135689465856?s=20",
    "job advertisement": "https://www.respawn.com/careers/software-engineer-new-product-incubation",
    "Apex Legends Mobile": "https://www.techradar.com/news/apex-legends-mobile-news",
    "kicking off later this month": "https://www.techradar.com/news/apex-legends-mobile-beta-launch-plans-announced-heres-where-to-play-it-first",
    "IGN": "https://www.ign.com/articles/respawn-is-in-the-early-days-of-building-a-brand-new-franchise"
  }
}