{
  "source": "https://www.techradar.com/news/otterais-new-tool-can-transcribe-your-zoom-calls-for-you",
  "title": "Otter.ai's new tool can transcribe your Zoom calls for you",
  "category": "computing",
  "updated": "2021-05-20T03:25:07.329Z",
  "author": "anthony-spadafora",
  "summary": "Otter Assistant automatically joins Zoom meetings for you and takes notes",
  "article": [
    "The speech to text company Otter.ai has launched a new tool to help business users keep better track of what goes on in their Zoom meetings.",
    "Available to all Otter.ai Business users, Otter Assistant can automatically join Zoom meetings on a user's behalf by integrating with their calendar and video conferencing software.",
    "When you're in a scheduled meeting, Otter Assistant will take notes for you so that you can focus on the meeting itself instead of trying to write down and remember everything that was discussed. After a meeting is over, these notes are then shared with other participants regardless of whether or not they actually attended the meeting.",
    "Co-founder and CEO of Otter.AI, Sam Lian explained how Otter Assistant can help make meetings more productive and collaborative in a press release, saying:",
    "“As virtual meetings persist, we need a way to make them more productive and collaborative and to alleviate Zoom gloom. Now, through the power of artificial intelligence, you can send your Otter Assistant to meetings on your behalf so you can focus on what’s most relevant without worrying about missing anything. There has never been an easier way to share meeting content.”",
    "According to a recent Otter.ai YouGov survey of 2,000 employees working from home, 42 percent admitted to experiencing Zoom fatigue since the pandemic began while 26 percent of those surveyed said that they think meeting notes should always be shared with attendees.",
    "With Otter Assistant, the company aims to try and alleviate some of the difficulties of video conferencing by using AI to automatically take notes for every Zoom meeting on your calendar including those you attend but do not host. One of the best things about Otter.ai's new tool is that it joins meetings for you so whether you're running late, need to step away for a moment or can't attend a meeting, you'll know exactly what happened.",
    "In order to start using Otter Assistant though, you'll need be an Otter Business user and a subscription to the company's paid service starts at $20 per user per month.",
    "If you frequently attend meetings on Zoom and have trouble remembering exactly who said what, then Otter.ai's tool could be worth a look and the company does offer a one month free trial to Otter Business so you can test it out for yourself."
  ],
  "headers": {
    "5": "Otter Assistant"
  },
  "links": {
    "speech to text": "https://www.techradar.com/news/best-speech-to-text-app",
    "Otter.ai": "https://www.techradar.com/reviews/otter-review",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "calendar": "https://www.techradar.com/best/best-calendar-apps",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "press release": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1178947482046568000&xs=1&url=https%3A%2F%2Fblog.otter.ai%2Fsend-your-otter-ai-assistant-to-zoom-meetings%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fotterais-new-tool-can-transcribe-your-zoom-calls-for-you",
    "Otter.ai YouGov survey": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5682892017245449000&xs=1&url=https%3A%2F%2Fblog.otter.ai%2Fdont-zoom-in-too-close%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fotterais-new-tool-can-transcribe-your-zoom-calls-for-you",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Zoom fatigue": "https://www.techradar.com/news/academics-have-identified-exactly-why-video-conferencing-has-you-feeling-exhausted",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "one month free trial": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4566786646309316000&xs=1&url=https%3A%2F%2Fotter.ai%2Fpurchase%2Fteam%3Fcode%3DONEMONTHFREETRIAL%26utm_source%3Dbusinesspage%26utm_medium%3Dtopcta&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fotterais-new-tool-can-transcribe-your-zoom-calls-for-you"
  }
}