{
  "source": "https://www.techradar.com/news/intel-to-show-off-rocket-lake-in-a-matter-of-days-plus-powerful-new-8-core-laptop-cpus",
  "title": "Intel to show off Rocket Lake in a matter of days, plus powerful new 8-core laptop CPUs",
  "category": "computing",
  "updated": "2021-03-16T10:06:05Z",
  "author": "darren-allan",
  "summary": "GDC Showcase session happens on March 18",
  "article": [
    "Intel is getting ready to show off its next-gen Rocket Lake desktop processors in just a couple of days at a pre-GDC (Game Developers Conference) session on March 18, and the chip giant has promised more details on Tiger Lake’s 8-core CPUs for laptops to boot.",
    "It should prove to be an interesting double-whammy, although the caveat is that this is part of the GDC Showcase conference, and it’s an online session for developers that requires registration.",
    "This virtual conference is happening ahead of the main GDC event that kicks off in July 19 (again, in virtual form due to the pandemic), and the goal is to give folks a ‘taste’ of what to expect come July.",
    "The session was highlighted by @momomo_us on Twitter (via VideoCardz), and it’s about how ‘gaming is shaping the world’, with Intel’s Marcus Kennedy (general manager of gaming and esports) in charge of delivering the presentation.",
    "Intel’s blurb for the session states: “In launching the 11th generation of Core processors Intel brings a brand new architecture improving the performance of both notebook and desktops. Intel offers a first look at the new Tiger Lake H-series notebook and Rocket Lake desktop processors while sharing stories and demos from their software vendor collaborations.”",
    "As mentioned, the session takes place on March 18 at 2:40pm, which is presumably US time, and from what we can gather on Twitter, looking at the times mentioned for events which have already occurred, it’s PST.",
    "The registration page for the GDC Showcase is here, but it’s an extensive form to fill in, and (obviously) is intended for game developers. Don’t worry, though, because we will be on hand to report all the interesting information Intel (hopefully) divulges. Although of course it remains to be seen exactly what this reveal is about, and it may only be a vague teaser…",
    "That said, we can keep our fingers crossed that we’ll get some juicy info given that Rocket Lake processors have been confirmed as going on sale come March 30, just two weeks away now.",
    "Rocket Lake will be headed up by an 8-core flagship CPU, which is two fewer cores than the current Comet Lake flagship, but rumors indicate some solid gains for gamers with 11th-gen chips.",
    "A lot will depend on where the pricing of Rocket Lake processors is pitched, and while it’s unlikely we’ll get any indication of that in this GDC Showcase event, you never know…"
  ],
  "headers": {
    "4": "What to expect"
  },
  "links": {
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "Tiger Lake’s 8-core CPUs": "https://www.techradar.com/news/the-latest-intel-11th-gen-tiger-lake-leak-might-disappoint-you",
    "@momomo_us": "https://twitter.com/momomo_us/status/1371343215257817088",
    "VideoCardz": "https://videocardz.com/newz/intel-to-showcase-tiger-lake-h-and-rocket-lake-at-gdc-on-march-18th",
    "states": "https://showcase.gdconf.com/session/gaming-is-shaping-the-world-presented-by-intel-corporation/879917",
    "here": "https://gdc.informatech.com/showcase/2021/index/registrations/profile",
    "confirmed as going on sale come March 30": "https://www.techradar.com/news/intel-finally-confirms-its-new-rocket-lake-s-processors-will-launch-on-march-30",
    "8-core flagship CPU": "https://www.techradar.com/news/rocket-lake-leak-reveals-final-specs-of-flagship-intel-core-i9-11900k-desktop-cpu",
    "rumors indicate some solid gains for gamers": "https://www.techradar.com/news/intel-rocket-lake-leak-hints-at-core-i9-11900k-cpus-gaming-performance"
  }
}