{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-wear-os-rumors-get-huge-new-hint-from-google-itself",
  "title": "Samsung Galaxy Watch 4 Wear OS rumors get huge new hint from Google itself",
  "category": "wearables",
  "updated": "2021-05-18T17:55:49Z",
  "author": "tom-bedford",
  "summary": "Samsung built the new Wear OS update",
  "article": [
    "There have been plenty of rumors suggesting that the Samsung Galaxy Watch 4 and Watch Active 4, two anticipated smartwatches, will ditch Samsung's Tizen operating system in favor of Google's Wear OS. Now, those rumors sound all but guaranteed.",
    "At Google IO 2021, the tech giant unveiled updates to its stalwart Wear OS system, including design changes and new features, and its announcement includes one huge tidbit - the thing was designed alongside Samsung.",
    "There's little precedent to an announcement like this. Google typically designs its own software, and then if companies want to design offshoots of Google's OS, it'll do so itself. This is the first time Google has designed a huge OS update like this, hand-in-hand with another company.",
    "While this news doesn't explicitly guarantee the two new Samsung Galaxy smartwatches will run Wear OS, it's the closest thing we could get without actual confirmation.",
    "Samsung wouldn't exactly put in the time or money required to develop a new OS update if it didn't plan to use it. And this way, the company could make sure to design its watch hardware alongside the software, so they work perfectly hand-in-hand.",
    "Previous rumors suggested Samsung was keen to work with Wear OS for its watches, as the Google OS has access to the wearable Play Store, which Tizen doesn't, and third-party apps are a big deal for some people.",
    "We're expecting to see the two new Samsung watches launch in August, and we'll have to wait until then to see if they run Wear OS for sure. But at this point, there's little doubt in our minds."
  ],
  "headers": {
    "3": "Watch this space"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog",
    "its announcement": "https://google-i-o-2021.prezly.com/a-new-material-design-language-and-os-experience"
  }
}