{
  "source": "https://www.techradar.com/news/microsoft-edge-for-apple-m1-macs-is-tantalizingly-close",
  "title": "Microsoft Edge for Apple M1 Macs is tantalizingly close",
  "category": "computing",
  "updated": "2021-01-18T12:03:51Z",
  "author": "joel-khalili",
  "summary": "An M1-native version of Microsoft Edge is already available in beta channels",
  "article": [
    "Since the launch of Apple’s custom M1 chip, which features in the latest MacBook Pro and MacBook Air, software developers have rushed to deliver builds that run natively on the new silicon.",
    "Having recompiled its Office 365 suite to run on Apple’s new devices, Microsoft has turned its attention to its flagship web browser, Edge. After an M1-specific version released in early access last month, a full stable build is on the immediate horizon.",
    "Edge for M1 devices released to the Microsoft Insider Canary channel (which usually houses the most experimental features) on December 17, before graduating to Dev and Beta channels over the weekend.",
    "“Starting today, you can download your Microsoft Edge Insider channel of choice with native macOS ARM64 support! Head to our Insider website to download Canary, Dev or Beta to see how it runs,” tweeted Microsoft.",
    "With Edge for M1 now available across all early access channels, a full public launch is imminent.",
    "While Mac owners can use an emulator (e.g. Apple Rosetta) to run applications that are not optimized for M1 chips, Edge fans will nonetheless celebrate the arrival of an M1-native build.",
    "Although useful, emulation almost always results in a drop-off in performance, because computing resources must be set aside for translation. Given the central importance of web browsers to any modern computing experience, performance issues are likely to frustrate.",
    "Microsoft Edge is currently playing catch-up in this sense, with rival browsers Google Chrome and Firefox already recompiled to run on Arm-based M1 chips.",
    "According to the release schedule, Microsoft Edge version 88 (the next stable build) is set to launch within the next week or so, although it is unclear whether a stable build of Edge for M1 will launch in lockstep.",
    "Microsoft has not yet responded to our request for clarification, but the software’s arrival in Dev and Beta channels suggests a full launch is just around the corner."
  ],
  "headers": {
    "5": "Microsoft Edge for Apple M1"
  },
  "links": {
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Edge for M1 devices": "https://www.techradar.com/news/microsoft-edge-is-now-natively-available-on-apple-m1-devices",
    "tweeted": "https://twitter.com/MSEdgeDev/status/1350205277660995585?s=20",
    "Google Chrome": "https://www.techradar.com/news/apple-m1-macs-are-getting-their-own-version-of-google-chrome-but-its-already-causing-issues",
    "Firefox": "https://www.techradar.com/news/firefox-84-dramatically-boosts-performance-on-apple-silicon-macs",
    "release schedule": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4126396469024623000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fdeployedge%2Fmicrosoft-edge-release-schedule"
  }
}