{
  "source": "https://www.techradar.com/news/cd-projekt-red-restructures-could-work-on-next-witcher-cyberpunk-games-at-the-same-time",
  "title": "CD Projekt Red restructures, could work on next Witcher, Cyberpunk games at the same time",
  "category": "gaming",
  "updated": "2021-03-30T19:08:50Z",
  "author": "samuel-tolbert",
  "summary": "CD Projekt Red is overhauling a lot of processes to work on two games at once.",
  "article": [
    "CD Projekt held a strategy meeting today, discussing the company's roadmap for the remainder of 2021 and looking ahead into 2022. CD Projekt Red is committed to providing more updates, free DLC and a current-generation patch for Cyberpunk 2077, letting the game run look and run even better on Xbox Series X, Xbox Series S and PS5.",
    "Meanwhile, more updates for GWENT: The Witcher Card Game are coming, while a current-generation patch for The Witcher 3: Wild Hunt is also on the way at some point in the second half of 2021.",
    "Arguably the biggest news however has to do with how CD Projekt Red is restructuring. The team is overhauling different processes, allowing development of two AAA games simultaneously — meaning we might see the next Witcher and Cyberpunk games arrive much sooner.",
    "The CD Projekt strategy meeting shared the company's vision for a more unified, flexible team that can work on two AAA games at the same time. Referred to as Red 2.0, this plan would see the proprietary Red Engine developed to support \"two franchises,\" all but confirming simultaneous development of new Witcher and Cyberpunk games.",
    "CD Projekt Red is also expanding to support this scale, acquiring Vancouver-based support studio Digital Scapes to be part of the CD Projekt Red Vancouver team.",
    "CD Projekt Red will also be working towards a more \"sustainable and caring work environment,\" which comes after extreme crunch was reported in the leadup to the release of Cyberpunk 2077 in December 2020.",
    "The PC version of the game received positive reviews but other versions of the game quickly came under fire, with criticism addressing the numerous bugs, glitches and performance problems present. Cyberpunk 2077 was then pulled from the PlayStation Store and has not yet returned."
  ],
  "headers": {
    "3": "Big changes to the studio structure"
  },
  "links": {
    "discussing": "https://www.youtube.com/watch?v=IIAiGI-v6Y8",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "acquiring": "https://www.cdprojekt.com/en/media/news/cd-projekt-acquires-the-canadian-digital-scapes-game-development-studio/",
    "pulled": "https://www.techradar.com/news/sony-pulls-cyberpunk-2077-from-playstation-store-offers-full-refund"
  }
}