{
  "source": "https://www.techradar.com/news/this-apple-watch-power-bank-is-the-weirdest-deal-i-spotted-on-prime-day",
  "title": "This Apple Watch power bank is the weirdest deal I spotted on Prime Day",
  "category": "phones",
  "updated": "2021-06-22T05:57:15Z",
  "author": "david-lumb",
  "summary": "Recharge your Apple Watch 6 with this angler fish-looking power bank",
  "article": [
    "There are plenty of great Amazon Prime Day deals flowing, from Amazon Echos and OLED TVs to Garmin watches. Even the oddball Lego deals didn’t prepare me for the weirdest deal I’ve seen yet: a power bank that looks like an angler fish but can recharge your Apple Watch.",
    "Let’s be clear: the iWALK Portable Apple Watch Charger ordinarily looks normal, with a cylindrical build typical of pocket-size power banks. But the thumbnail, which has an Apple Watch wrapped around the product, makes the hanging watch band look like the gaping mouth of an abyssal fish with the Lightning charger looming out on a cord like a glowing orb, ready to mesmerize the ichthyoid’s doomed prey.",
    "Maybe I’ve been staying up too late trawling for deals.",
    "But on paper, the iWALK Portable Apple Watch Charger seems like it would be a helpful charger for more than just your smartwatch. Its 9000mAh battery could seemingly recharge a flagship iPhone several times with a full charge, though the item’s Amazon description doesn’t inspire confidence – to quote, it “will be able to charge your Apple Watch about 0000 times.”",
    "This could just be a translation error, and the 251 ratings on its Amazon listings page are mostly positive (4.5 star rating). We’ll always be skeptical of products we haven’t tested ourselves, especially after Amazon banned well-known brands Ravpower, Aukey, and Mpow, likely for fake reviews.",
    "With due caution, we’d be genuinely excited for a power bank that could charge our Apple smartwatch on the go: even the latest Apple Watch 6 has less than a full day’s battery life, so having one of these in our travel bags or work satchels would be nice in the event we forgot to recharge it at the end of the day.",
    "TechRadar is rounding up all the top deals over the Prime Day sales period, and we’ve put all the best Prime Day deals in an easy-to-navigate article to help you find the bargains you’re looking for."
  ],
  "headers": {
    "6": "More Amazon Prime Day deals"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Amazon Echos and OLED TVs": "https://www.techradar.com/news/the-30-best-prime-day-deals-so-far-echo-oled-tvs-apple-watch-fire-tablets-more",
    "Garmin watches": "https://www.techradar.com/best/garmin-watch",
    "Lego deals": "https://www.techradar.com/news/these-prime-day-lego-city-deals-slash-prices-on-some-great-gifts-and-perfect-presents",
    "banned": "https://www.techradar.com/news/why-power-bank-deals-are-hard-to-find-this-prime-day",
    "best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}