{
  "source": "https://www.techradar.com/news/we-need-more-nintendo-switch-games-but-these-ports-wont-cut-it",
  "title": "We need more Nintendo Switch games – but these ports won't cut it",
  "category": "gaming",
  "updated": "2021-02-20T14:00:11Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Port of call",
  "article": [
    "We waited 532 days for a Nintendo Direct, and all we got was a lousy Wii port for Nintendo Switch.",
    "Okay, maybe that’s a little harsh on The Legend of Zelda: Skyward Sword, but its announcement was indicative of Nintendo’s biggest problem: the Japanese giant simply can’t stick to a healthy release cadence without reverting back to its tried and tested strategy of releasing older games, most of which we've played countless times before.",
    "I’ve already expressed my frustration at how a disappointing number of Wii U games have been ported to Nintendo Switch, often with little to no enhancements to speak of (did we really need a ‘Funky New Mode’ in Donkey Kong Country: Tropical Freeze?). But now that the well of Nintendo’s failed console has seemingly run dry, the company has turned its attention to the Wii and even the Nintendo 3DS. We’re getting Skyward Sword HD, one of the most divisive Zelda games in recent memory, and a game that I don’t recall anyone port-begging for, Miitopia.",
    "Really, Nintendo?",
    "Instead of creating games that take full advantage of the Nintendo Switch’s feature set, Nintendo is seemingly content with padding out the Switch’s games library with yet more ports from its past systems. And, in fairness, it’s easy to see why. These re-releases sell in their millions, as people flock to revisit classic titles or games they simply may have missed the first time around.",
    "But what about aging Nintendo stalwarts, like me? Does Nintendo care about the day one adopters of its hardware who, perhaps foolishly, turn up every generation to experience something new? Honestly, when it comes to new experiences on Switch, Mario might as well jump on my head and say “fuggedaboutit.”",
    "During the Nintendo Switch’s first year, I’ll admit that we were utterly spoiled with hit after hit. In 2017, Nintendo released Super Mario Odyssey, The Legend of Zelda: Breath of the Wild, Splatoon 2, Mario + Rabbids Kingdom Battle, Fire Emblem Warriors, Mario Kart 8: Deluxe, ARMS and Xenoblade Chronicles 2. I’d even throw 1-2-Switch into that list too, simply because it’s still the only game that really showcases what HD Rumble in the Joy-Con can do.",
    "This stellar launch year gave the console some much-needed momentum, and more importantly, painted a rosy picture of what was to come. It also helped dispel any fears Wii U owners may have had that the horrendous software droughts that plagued the previous generation were a thing of the past.",
    "Sadly, Nintendo has struggled to maintain its excellent start on Nintendo Switch, and has resorted to some rather unsavoury methods that, while great for new adopters, leave a bitter taste in my mouth.",
    "To date, Nintendo has released (or is planning to release) 15 games we’ve already seen, and likely already paid for. Practically all of these titles come with a full fat price tag, and Nintendo has even gone as far as to release a compilation of classic Mario games that come with a finite release date, just to encourage impulse purchases.",
    "Watching a Nintendo Direct these days can often feel like déjà vu, then, but I had high hopes that, because it’d been almost two years without one, we’d actually see something new and exciting. How foolish I was. Instead, I watched with malaise as we were introduced to third-party games that are largely past their expiry date, and waited for the inevitable new release that’s sold under the guise of another lazy Switch port. Cue The Legend of Zelda: Skyward Sword HD.",
    "Now, there’s absolutely nothing wrong with bringing back older titles. I’m a sucker for a great remaster or collection, but not when there's zero effort into making the title any better, or better-placed on the new hardware.",
    "There’s the odd exception, of course, like the Link’s Awakening remake – but you only need to look at Demon’s Souls on PS5 or Halo: The Master Chief Collection on Xbox Series X to see what a proper remaster can accomplish. The recently announced Diablo 2: Resurrected also puts the likes of Skyward Sword HD to shame.",
    "Microsoft is even retroactively making games that you might already own better than ever before thanks to its FPS Boost feature and Smart Delivery. And with both Sony and Xbox dropping free next-gen upgrades left right and center, playing Super Mario Sunshine at 30 frames per second in 720p, warts and all, simply doesn’t cut it.",
    "Seeing The Legend of Zelda: Skyward Sword HD appear during the Nintendo Direct, with its soupy textures and washed-out color palette, brought back painful memories that I’d rather forget, and provoked the same sort of disenchanted reaction I’ve felt to the majority of the Switch’s offerings in the last few years: I've already played this before, and I won’t be paying full price to do so again when there’s no real incentive to do so.",
    "Damningly, you could argue that the biggest news during the Nintendo Direct was for a game that wasn’t even there. Nintendo revealed that no Breath of the Wild 2 details would be shared, despite its ongoing silence since the game’s initial reveal at E3 2019. Other notable Switch games like Bayonetta 3, Metroid Prime 4 and the recently announced Project Triangle Strategy are so far away that they may as well have been part of a fever dream at this point.",
    "And that says it all, really. I’m definitely not the only one who’s desperate to hear more about new games on Switch instead of reliving the past for what feels like the millionth time. Come on, Nintendo – give me something new to play already."
  ],
  "headers": {
    "6": "Nintendo’s awakening",
    "11": "Skyward bored",
    "15": "Breath of the mild"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "The Legend of Zelda: Skyward Sword": "https://www.techradar.com/news/legend-of-zelda-breath-of-the-wild-2-wasnt-announced-but-skyward-sword-hd-is-coming",
    "Wii U games have been ported to Nintendo Switch": "https://www.techradar.com/news/nintendo-switch-continues-to-be-a-slap-in-the-face-to-all-wii-u-owners",
    "Nintendo 3DS": "https://www.techradar.com/news/5-reasons-you-should-buy-a-nintendo-3ds-over-the-nintendo-switch",
    "Super Mario Odyssey": "https://www.techradar.com/news/super-mario-odyssey-review",
    "The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/legend-of-zelda-breath-of-the-wild-2-wasnt-announced-but-skyward-sword-hd-is-coming/news/the-legend-of-zelda-breath-of-the-wild-review",
    "Mario Kart 8: Deluxe": "https://www.techradar.com/how-to/mario-kart-8-deluxe-tips-and-tricks",
    "ARMS": "https://www.techradar.com/how-to/arms-tips-and-tricks",
    "Joy-Con": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "Mario games": "https://www.techradar.com/news/the-best-super-mario-games",
    "Link’s Awakening": "https://www.techradar.com/reviews/the-legend-of-zelda-links-awakening-review",
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Halo: The Master Chief Collection": "https://www.techradar.com/news/halo-the-master-chief-collection-is-getting-a-serious-xbox-series-x-upgrade",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Diablo 2: Resurrected": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "FPS Boost feature": "https://www.techradar.com/news/xbox-series-x-update-quadruples-the-framerate-of-older-games-heres-how-it-looks",
    "Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "Super Mario Sunshine": "https://www.techradar.com/news/the-new-mario-nintendo-switch-collection-is-not-worthy-of-the-all-stars-name",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Metroid Prime 4": "https://www.techradar.com/news/metroid-prime-4"
  }
}