{
  "source": "https://www.techradar.com/news/call-of-duty-mobile-zombies",
  "title": "Call of Duty: Mobile zombies is returning, but not as you remember it",
  "category": "phones",
  "updated": "2021-07-30T09:21:11.211Z",
  "author": "tom-bedford",
  "summary": "Undead Siege mode is coming",
  "article": [
    "Early adopters of Call of Duty: Mobile will remember that the hugely-popular mobile game launched with a zombies mode, adapted from the Black Ops series of games. Only one map was available, and more were expected - but then the zombies mode was abruptly removed from the game in March 2020.",
    "At the time, the developers stated \"the mode just didn’t reach the level of quality that we desire\", but no word was given on when, or if, we'd be able to slay waves of zombies on our smartphones again.",
    "That's changed, and we now know that Call of Duty: Mobile will get zombies once again, sometime in 2021, though not in the classic wave-based style we expected. Instead, we'll be seeing zombies return via the Battle Royale mode, though we don't know too much about this upcoming update, in a mode called Undead Siege.",
    "Below, we've collected all we know so far about the Call of Duty: Mobile zombies' update, so you can stay in the loop.",
    "When first announced in July 2021, Undead Siege was given a rough '2021' release window - that's quite a long stretch of time. However, some fans think the mode could launch alongside Call of Duty: Mobile's Season 6.",
    "Season 6 of the game - not actually the sixth season, we should add - is set to launch on July 30.",
    "Early promotion for Call of Duty: Mobile Season 6 doesn't hint towards a new zombies mode at all though, and some fans think Undead Siege could launch later. Season 7 of the game would begin in late September, and would therefore encompass the Halloween season, which would be a perfect thematic fit for the mode.",
    "As we've said, Undead Siege isn't the wave-based classic style of Call of Duty zombies you're used to - instead, it uses the Battle Royale map.",
    "In Undead Siege, you're dropped into the map in squads, and have to survive five 'nights' as a team - how long that equates to in actual real-life time, isn't clear. As you'd expect, each night brings tougher hordes of enemies.",
    "You drop in with one of your custom loadouts from the multiplayer mode, but apparently you also need to scavenge equipment and tools to keep yourself in the game.",
    "That's because Undead Siege also has elements from tower defense-style games, as you need to build defenses and turrets to fortify a base.",
    "How this side of the mode actually works isn't clear at all, and we're expecting quite the learning curve when playing this mode for the first time.",
    "There's absolutely no word on whether the wave-based Call of Duty zombies mode will return, only speculation. But people are hopeful.",
    "Fans hope that the Undead Siege mode is a precursor to the classic mode returning, perhaps in a later season towards the end of 2021 or at the beginning of 2022, judging by comments on social media.",
    "When Call of Duty: Mobile launched, the only zombies map was Shi No Numa, a Japanese swamp, which is one of the original maps from Call of Duty: World at War. Nacht Der Untoten, the first ever zombies map (also from World at War) was also worked on for the mobile game, but was only playable for a brief amount of time.",
    "It seemed like, then, the original batch of maps was being worked on for Call of Duty: Mobile, which includes the aforementioned two, Verruckt and Der Reise. However it's worth pointing out that before Call of Duty: Mobile launched, early alphas showed a very early zombies mode.",
    "The early betas of the game let you play short, several-minute-long missions, not a wave-based mode, based on the Green Run location from Black Ops 2 (several zombies maps were all based in this same larger map - it's confusing, don't worry about it).",
    "The fact that the Green Run missions were scrapped, shows the developers understand fans' love of the classic zombies action - the fact that work was clearly being done on new classic maps, shows that groundwork is already there.",
    "Finally, the game's Player Profile shows you your zombies stats, including how many matches you've been in, your ranking and your total damage output in zombies, and if the mode was being removed or replaced with Undead Siege, it'd be odd that these stats remain.",
    "So all evidence suggests that Call of Duty: Mobile very well could get zombies back again in a real way. However that's all speculation, and even if true it could be some time before classic zombies returns. So take all that information with a pinch of salt for now."
  ],
  "headers": {
    "4": "When will Call of Duty: Mobile zombies return?",
    "7": "What will Call of Duty: Mobile zombies be like?",
    "12": "Will the 'classic' Call of Duty: Mobile zombies mode return?"
  },
  "links": {}
}