{
  "source": "https://www.techradar.com/news/most-firms-are-clueless-about-the-environmental-impact-of-data-storage",
  "title": "Most firms are clueless about the environmental impact of data storage",
  "category": "computing",
  "updated": "2021-11-22T14:01:36Z",
  "author": "sead-fadilpasic",
  "summary": "Growing volumes of data require more energy, report reminds",
  "article": [
    "IT services and hardware have become a top sustainability priority for most companies, but many aren’t sure about the efficiency of data storage in terms of sustainability and carbon footprint, new research has found.",
    "This is according a new report from Fujifilm, based on a poll of 1,200 C-suite execs from Japan, the US, Germany, and China. It adds that businesses are “vastly underestimating” the environmental impact of the energy that’s required to support such high storage volumes, as well as the subsequent carbon emissions, Fujifilm says.",
    "By 2025, the world will have generated more than 11 zettabytes of data, a separate report from market analysts IDC claims, and with this growth will rise the demand for data storage. Among those who are yet to consider eco-friendlier data storage options, more than a third said they lacked awareness of the issue, or didn’t understand it, to begin with.",
    "With energy consumed by data centers growing “at an alarming rate”, tape storage is emerging as one of the possible solutions, according to Fujifilm president, Hironobu Taketomi.",
    "“Fujifilm looks forward to working with other industry stakeholders to identify solutions, such as tape storage, that can help mitigate carbon emissions from storing data, which will help support the technical area of the United Nations Paris Agreement framework designed to reduce greenhouse gas emissions and limit global warming,” he said.",
    "Many of the report’s respondents also said they wouldn’t be able to differentiate between “hot” and “cold” data, and are clueless how this knowledge could affect their sustainability practice.",
    "But generally speaking, most companies want to do their part in the fight against climate change. The vast majority of US respondents, for example, listed ICT services and equipment as priority areas for their organization, in their fight to impact climate change. Recycling, energy consumption, and employee/customer awareness were also listed as priority areas."
  ],
  "headers": {
    "3": "Can tape storage help climate change?"
  },
  "links": {
    "data storage": "https://www.techradar.com/best/large-hard-drives-and-ssds",
    "storage options": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "data centers": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}