{
  "source": "https://www.techradar.com/news/wandavision-gets-a-slew-of-new-teasers-ahead-of-its-january-release",
  "title": "WandaVision gets a slew of new teasers ahead of its January release",
  "category": "entertainment",
  "updated": "2021-01-04T17:46:39Z",
  "author": "emma-boyle",
  "summary": "Listen out for that original theme song",
  "article": [
    "Ahead of WandaVision’s fast-approaching premiere on Disney Plus, some brand new teasers have been released, giving us another tantalizing look at what seems set to be a seriously unusual new venture for the MCU.",
    "The teasers aren't particularly long but they do have some interesting little tidbits that can contribute to helping us peel back some more of the sitcom-inspired weirdness of WandaVision in order to get a better grasp of what the show’s actual story is going to be.",
    "The newest and longest clip runs for a full minute and although each of the clips show Wanda, or Scarlet Witch, using her powers to alter reality, here we get the best look at the small era-blending glitches and jarring moments which suggest that she’s struggling to keep the real world at bay. Even more interesting, you'll hear a snippet of one of the original themes that's been composed for the show by Frozen songwriting duo Kristen Anderson-Lopez and Robert Lopez. It's one of several themes they've penned for the show.",
    "In another clip, posted on the Disney Channel Twitter, we finally hear a direct reference to Wanda and Vision’s pre-show superhero lives when one character says “you’re the Avengers” and Wanda herself says “people are on the verge of discovering our secret.”",
    "In a final clip on the official WandaVision Twitter page, Wanda and Vision’s twin children make an appearance, shown very briefly as babies in the arms of their parents.",
    "When it arrives on screens on January 15, WandaVision will be the first of several MCU TV shows on Disney Plus this year, as well as the first Marvel Phase 4 outing full stop. WandaVision is going to tie into the 2022 Doctor Strange movie, Doctor Strange in the Multiverse of Madness, with Olsen set to reprise her role.",
    "More Marvel TV projects will come to Disney Plus later in the year, with Hawkeye, Falcon and the Winter Solder and Loki all confirmed. That’s not to mention the slate of Phase 4 films that are on the horizon through this year and into 2022 as well. After a dearth of content in 2020, 2021 is set to be very busy for Marvel fans.",
    "If you’re hoping to get involved with all of these Marvel TV shows but you haven’t signed up for Disney Plus yet, now might be a good time to pick up an annual subscription, particularly for those living in the UK. Disney has announced that the subscription price is due to go up in February 2021 as a wave of new Star content arrives on the service."
  ],
  "headers": {
    "5": "The first of many"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-just-added-a-major-black-widow-character-says-report",
    "Falcon and the Winter Solder": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Loki": "https://www.techradar.com/news/new-loki-disney-plus-trailer-shows-the-god-of-mischief-stirring-up-trouble-again",
    "announced": "https://www.techradar.com/news/disney-plus-uk-is-about-to-get-double-the-content-via-star-and-a-price-increase"
  }
}