{
  "source": "https://www.techradar.com/news/steam-sale",
  "title": "Steam Summer Sale 2021: the best deals and PC games on Steam",
  "category": "gaming",
  "updated": "2021-06-25T11:13:04.849Z",
  "author": "gerald-lynch",
  "summary": "The Steam Summer Sale 2021 is here",
  "article": [
    "The Steam Summer Sale 2021 is upon us, and is providing PC gamers with a whole host of tempting deals on some of the best PC games on the market. We're seeing tons of games go on sale from triple-A blockbusters to smaller scale indie titles, many of which will surely have steep discounts.",
    "If you've been waiting to pull the trigger on a great deal for the next big addition to your Steam library, then you're in luck. The Steam Summer Sale 2021 began on June 24, 2021 at 10am PST / 1pm EST / 6pm BST / 7pm CEST. It ends on July 8 at 10am PST / 1pm EST / 6pm BST / 7pm CEST, so there's plenty of time to make some big additions to your Steam library.",
    "During the 2020 Steam Summer Sale, there were some games that offered up to 10-30% discounts, but what we were interested in was the really juicy discounts on some of our favorite PC games. Steam always manages to have some really deep discounts on some fairly big-name games, and we're also seeing that with the Steam Summer Sale 2021.",
    "To help you separate the best deals from the stinkers, we've compiled a list of the very best discounts featured during the 2021 Steam Summer Sale. Browse below to find a game to suit you, ranging from triple-A smash hits to beloved indies and everything in between.",
    "Whichever way you approach a particular Steam Sale, you're guaranteed to have the chance to pick up some top gaming titles at great prices.",
    "Finding bargains isn't too difficult, but there are a few techniques and tricks that are worth using if you want to get the most out of the sales.",
    "First off, you shouldn't expect brand-new games to get the really steep discounts that have become synonymous with the Steam sales. You may see a 5%, or even 10% discount on games that have been recent big hits, but if they're still new enough to be spinning money without needing a price cut, don't expect that to change now that the sale is here.",
    "But, with the exception of the newer titles, pretty much the entire store receives a 25% discount, if not higher, with a select few seeing a massive 90% off the list price. While the store now highlights what Valve considers the best deals, it's worth noting that flash and community sales are no longer in the mix, so feel free to pick a title on sale when you like – its discounted price will stand for the duration of the sale."
  ],
  "headers": {
    "4": "How to get the best deals in the Steam Sales",
    "6": "What games will be in the Steam Sales?"
  },
  "links": {
    "best PC games": "https://www.techradar.com/news/best-pc-games"
  }
}