{
  "source": "https://www.techradar.com/news/ps5-has-only-just-stopped-losing-money-for-sony-but-thats-normal",
  "title": "PS5 has only just stopped losing money for Sony – but that's normal",
  "category": "gaming",
  "updated": "2021-08-30T01:57:42Z",
  "author": "axel-metz",
  "summary": "Out of the red",
  "article": [
    "Sony’s disc-based PS5 console is no longer selling at a loss, according to the company’s chief financial officer Hiroki Totoki.",
    "Bloomberg reports that Totoki shared the news at Sony’s recent earnings briefing, which comes shortly after the Japanese tech giant confirmed the PS5 is now the fastest-selling PlayStation system of all time.",
    "For the first time since its November 2020 release, the PS5 is covering its own manufacturing costs, though the less expensive and disc-less Digital Edition is still losing money for Sony.",
    "That doesn’t mean the company isn’t making a profit, though. Bloomberg reports that the losses incurred by the PS5 Digital Edition continue to be offset by the enduring sales of hardware like the PS4, and it’s normal for games consoles to sell at a loss in the early months of their life cycle.",
    "The PS4, for instance – which has now sold over 116 million units worldwide – didn’t turn a profit until six months after release.",
    "There are exceptions to the rule, of course. The Nintendo Switch began making money from the get-go, but it’s rare that consoles form the biggest part of a company’s sales.",
    "Microsoft has famously never turned a profit on any of its Xbox hardware, for example, with most revenue coming instead from game sales or subscription services like Xbox Game Pass.",
    "Eventually, maybe. But not for a long time.",
    "Despite taking a little longer to cross over into the green (or orange, at least), meteoric sales of the PS5 have ensured Sony’s latest console looks set to make a financial impression comparable to its predecessor – but the global chip shortage means the company is struggling to manufacture enough PS5 systems to meet global demand.",
    "With millions still wondering where to buy a PS5, there’s no denying the interest in Sony’s product, but there’s little sign that manufacturing speeds will begin to match those of the PS4 any time soon.",
    "Still, Sony has managed to sell 10 million PS5 consoles in the same time it took to sell 7.8 million PS4s, so if demand is sustained, there’s every chance that – in the next six or seven years – the PS5 could outmuscle its older sibling for total units sold.",
    "Until then, though, we’ll keep waiting in the restock queues.",
    "Via Gamespot"
  ],
  "headers": {
    "7": "Analysis: Can the PS5 outsell the PS4?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-04/sony-raises-profit-outlook-as-gaming-demand-stays-resilient?srnd=technology-vp",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "never turned a profit": "https://www.eurogamer.net/articles/2021-05-06-microsoft-confirms-its-never-made-profit-from-sale-of-an-xbox-console",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "global chip shortage": "https://www.techradar.com/news/intel-ceo-says-chip-shortage-could-stretch-into-2023",
    "where to buy a PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "sell 10 million": "https://www.theverge.com/2021/7/28/22597784/sony-ps5-playstation-5-sales",
    "Gamespot": "https://www.gamespot.com/articles/ps5-no-longer-being-sold-at-a-loss-at-least-not-the-main-model/1100-6494775/?ftag=CAD-01-10abi2f"
  }
}