{
  "source": "https://www.techradar.com/news/lastpass-business-adds-new-adoption-tool-family-accounts",
  "title": "LastPass Business adds new adoption tool, family accounts",
  "category": "computing",
  "updated": "2021-06-15T22:22:00Z",
  "author": "anthony-spadafora",
  "summary": "New adoption dashboard makes it easier for admins to enroll employees",
  "article": [
    "LogMeIn has announced that it has redesigned its LastPass Business password manager in an effort to better secure the online accounts of employees working from home as well as those at organizations which have adopted hybrid working.",
    "LastPass Business, formerly known as LastPass Enterprise, is built on customer feedback and designed to secure access in the modern hybrid workforce.",
    "VP of product management at LastPass, Dan DeMichele explained in a press release how customer feedback helped influence its redesign of LastPass Business, saying:",
    "“Customer feedback is at the core of these updates to our LastPass Business offering. Over the last year, we heard their need for better visibility into end user adoption; a desire to encourage good password habits beyond the workplace, especially as everyone spends more time online; and the requests not to be forced into technology they’re not ready for. We’re confident our customers will be happy to see this feedback come to life with our updated LastPass Business offering.”",
    "As part of its redesign, the service now features a brand-new admin console that makes onboarding and account management easier than ever. To help drive adoption across organizations, the LastPass admin console also now includes a new adoption dashboard which provides admins with the insights and tools they need to get all of a company's employees to use LogMeIn's business password management software.",
    "LastPass Business customers can now access the company's single-sign-on (SSO) app in the LastPass browser extension and password vault to make it simpler to access their key applications. This means that employees now have a seamless login experience whether they're accessing a traditional web login or an SSO-enabled cloud app.",
    "Businesses can start with a base business password management package from LastPass which includes SSO for up to three cloud apps and multi-factor authentication (MFA) at no additional cost. However, as a company's security needs change, advanced functionality can be added through LastPass's SSO and MFA add-on offerings.",
    "Finally, LastPass Business also now includes Families as a Benefit at no additional cost. With this feature, employees get access to a premium LastPass account for personal use as well as up to five accounts for those closest to them so organizations can encourage good password habits beyond the workplace.",
    "LastPass Business including Freemium SSO and MFA is available at $6 per user/ month while the Advanced MFA add-on costs an additional $3 per user/month and the Advanced SSO add-on is $2 per user/month. However, both add-ons and a LastPass Business account can be bundled together for just $9 per user/month."
  ],
  "headers": {
    "5": "SSO, MFA and family accounts"
  },
  "links": {
    "password manager": "https://www.techradar.com/best/password-manager",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "onboarding": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "business password management software": "https://www.techradar.com/best/business-password-management-software",
    "SSO": "https://www.techradar.com/best/best-identity-management-software",
    "cloud app": "https://www.techradar.com/best/free-cloud-apps",
    "MFA": "https://www.techradar.com/news/mfa-could-be-the-future-of-workplace-security",
    "good password habits": "https://www.techradar.com/news"
  }
}