{
  "source": "https://www.techradar.com/news/dunes-official-trailer-has-arrived-and-it-looks-like-an-oscar-contender",
  "title": "Dune's official trailer has arrived – and it looks like an Oscar contender",
  "category": "entertainment",
  "updated": "2021-07-22T13:47:09Z",
  "author": "tom-power",
  "summary": "Dune will land in theaters and on HBO Max in October",
  "article": [
    "After what seemed like an eternal wait, the official trailer for Dune has landed online – and it looks absolutely epic.",
    "Warner Bros' upcoming reboot of Frank Herbert's iconic sci-fi novel, which is also getting a spin-off TV series called Dune: The Sisterhood, is due to be released in theaters and on HBO Max (in available territories) later this year.",
    "With its launch date fast approaching, fans had been holding out hope that a new trailer would arrive at some point – and they haven't been disappointed.",
    "Check out the new trailer for Dune below:",
    "The three-and-a-half minute long video gives us our clearest look yet at the movie, which has been helmed by award-winning director Denis Villeneuve (Arrival, Blade Runner 2049), and it looks as stunning and action-packed as we hoped it would be.",
    "Dune stars Timothee Chalamet (Call Me By Your Name, Little Women) as Paul Atreides, the heir to House Atreides.",
    "Paul's family take up residence on the dangerous desert planet known as Arrakis, which is home to 'spice', the most valuable resource in the universe.",
    "House Atreides' enemies, though, cast admiring glances towards Arrakis with the view to taking control of the planet's spice mining operation. Whoever controls the export of spice controls the galaxy, after all, and it isn't long before all-out war breaks out among Dune's numerous houses.",
    "Long-time Dune fans have been waiting years for a new live-action adaptation of Herbert's novel. In less then three months time, those dreams will finally be realized and we expect Dune aficionados (and regular cinephiles) to flock to theaters to watch it on the big screen.",
    "Based on Dune's aesthetic, stacked cast and big name director, it isn't surprising to work out why. The movie looks absolutely beautiful and, when you realize that Greig Fraser (Rogue One, Lion, Zero Dark Thirty) is the cinematographer behind it, you'll understand why it's such a feast for the eyes.",
    "Villeneuve's involvement, too, is a major plus point for Dune. The French-Canadian director has three Oscars and two BAFTA awards under his belt for his work on previous sci-fi movies in Arrival and Blade Runner 2049. His eye for detail, experience with helming major studio films and his relationship with world-famous actors will have helped Dune's production move as smoothly as possible.",
    "Finally, we come to the movie's cast. Alongside Chalamet, Dune will star Oscar Isaac, Jason Mamoa, Rebecca Ferguson, Zendaya, Josh Brolin, Dave Bautista, Javier Bardem and Stellan Skarsgard among others.",
    "As we said, it's an all-star cast. With so many big name actors attached to it, there's sure to be someone involved that any and all film fans will want to attend a screening for.",
    "All of this makes us think that Dune is sure to receive multiple nominations at next year's Oscars, BAFTAs, Golden Globes and other prestigious award ceremonies.",
    "The film should have been part of the 2021 awards circuit. However, its release has been delayed three times due to the Covid-19 pandemic, but it's sure to be up for an award or 10 in 2022. We'll be very surprised if it isn't, given the talent on show.",
    "The first movie in a planned two-part movie adaptation, Dune will arrive in theaters and on HBO Max on October 22 in the US and October 21 in the UK."
  ],
  "headers": {
    "8": "Analysis: Dune could be a big awards contender in 2022"
  },
  "links": {
    "Dune": "https://www.techradar.com/news/dune-cast-release-date-trailer",
    "HBO Max": "https://www.techradar.com/deals/hbo-max-price-cost-deals"
  }
}