{
  "source": "https://www.techradar.com/news/how-to-use-a-home-security-cameras-and-how-it-could-replace-a-video-doorbell",
  "title": "How to use a home security camera, and how it could replace a video doorbell",
  "category": "smart-home",
  "updated": "2021-08-08T07:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Want peace of mind that your property is safe when you’re not around? A home security camera can help",
  "article": [
    "Being able to keep an eye on your property when you’re not at home can be a comfort for many of us. In fact, when it comes to the crimes Americans worry most about, 35% say their property being burgled when they’re not around is their biggest concern according to market research firm Statistia.",
    "This is where the best smart home security cameras come in, as they’ll send an alert to your smartphone if they detect motion so you can take appropriate action, and they’re far easier to install, and more affordable than traditional wired CCTV systems.",
    "But just how do these smart home devices work, what you can actually do with them and do you really need one?",
    "Want to get your hands on the best home security cameras now? Check out these great deals for some of the best on the market.",
    "In the US, one in five homes has a home security camera installed (according to Safety.com’s home security survey) making them among the most popular smart home devices on the market right now.",
    "However, they’re not just for home security - they can also be handy if you want to check the kids are home from school and doing their homework rather than playing outside or, thanks to the built-in speakers, soothe anxious pets that are home alone.",
    "Home security cameras work in the same way as the best video doorbells, by connecting to the internet and sending a notification to your phone whenever motion is detected in the camera’s field of view.",
    "If you receive a notification, or you just want to see what’s happening at your home, you can use the companion app on your smartphone, tablet, or if you’re home on a compatible smart display, such as the Amazon Echo Show 10 or the Google Nest Hub (2nd generation), to view a live feed from the camera to see what’s happening.",
    "All security cameras also feature a built-in speaker and microphone that allow you to converse with anyone in the camera’s field of view too.",
    "Home security cameras will also store the footage recorded when motion is detected so it can be reviewed back at a later date.",
    "This is handy if you missed the notification when it arrived, but want to see just what triggered an activity alert. However, for many home security cameras, this does require a monthly subscription, which starts from $2.99 / £2.49 / AU$4.49.",
    "As they work in the same way, you may be wondering if a home security camera could replace a video doorbell.",
    "While it offers the same basic functions; such as alerting you when it detects a person or motion at your threshold and allowing you to view a live feed from the camera and interact with anyone it’s field of view, there will (obviously) be no physical doorbell for someone to press. Similarly, you’d need a smart speaker, such as an Amazon Echo (2020), or smart display connected to the camera to ensure you got an audible notification inside your home if someone was to arrive at your door.",
    "A security camera is often mounted higher up than a video doorbell to ensure it captures the full length of someone at your door, and with a secure mount that would make it harder for it to be removed by thieves.",
    "So, if you’re just after being able to see who’s at your door, we’d still suggest browsing our list of the best video doorbells for ease of use - but if you’re more interested in home security then you’ll get most of the benefits, such as motion detection and alerts, from a mounter camera.",
    "Some home security cameras, such as those from Ring, Google and Swann connect directly to your home Wi-Fi network, which means they are very simple to set-up and don’t require any extra kit. Others, however, require a base station - sometimes called a hub.",
    "The base station connects directly to your router using an ethernet connection and creates its own Wi-Fi link with the security camera. This connection is often more stable than a direct link between the camera and your router, and is also more secure, meaning the camera’s feed is less likely to be intercepted by unauthorized users.",
    "The benefits don’t stop there either - base stations often offer local storage for footage recorded by the cameras too, removing the need to subscribe to the camera’s cloud storage service.",
    "For some, this is in the form of a micro SD card slot located in the base station, while others use flash memory under the hood of the hub.",
    "However it’s worth noting that with Arlo home security cameras, for example, if you use the base station for local storage, you won’t be able to view the stored videos through the app - you’ll need to remove the micro SD card from the base station and plug it into a computer if you want to review the footage.",
    "Many of the home security cameras available right now are mains-powered and designed to be used indoors only.",
    "These are best suited to anyone wanting to check on their pets or kids, rather than those looking for a home security camera to catch intruders, as by the time they are spotted on the camera, they’ll have already breached your home.",
    "Instead, if you’re looking to keep an eye on anyone lurking on your property, consider a weather-proof camera for the exterior of your home, and they’re available in both mains-powered models and battery-operated designs.",
    "Those connected to the mains may require professional installation if you don’t have the relevant electrical qualifications, but they’ll constantly be monitoring for motion without worry of discharging.",
    "Battery-operated home security cameras should last anywhere from three to twelve months before they need recharging.",
    "However, this depends on a number of factors: how many times the camera identifies motion, how often its live feed is activated and the number of times the microphone and speaker are used to interact with someone in the camera’s field of view.",
    "Obviously they’ll be out of action when the battery needs recharging - the camera will notify you when the battery level is getting low - unless they have a removable battery and you purchase an additional one, which can be swapped with the dead battery in seconds.",
    "Receiving notifications about motion detected by your home security cameras can be useful, if it's about a real incident, but those that turn out to be about birds on your lawn, the wind rustling through trees or even car headlights shining through windows from the road can be frustrating.",
    "To combat this, many home security cameras including those from Arlo, Ring, Eufy and Google also offer handy features to reduce these nuisance alerts; for example activity zones so you’re only alerted when motion is detected in these areas and AI that can identify whether an animal, vehicle or person caused the alert too.",
    "Most home security cameras also offer integration with Amazon Alexa, Google Assistant or HomeKit, so they can be set to work with your smart speakers and smart displays; alerting you when motion is detected and in the case of smart displays, as well as some TV streaming devices, viewing the camera’s feed on its screen or your TV. Not all home security cameras are compatible with all voice assistants, however, so make sure you check it will work with your current kit before you buy."
  ],
  "headers": {
    "4": "So, how do home security cameras work",
    "11": "Can a home security camera replace a video doorbell?",
    "15": "Base station or direct Wi-Fi?",
    "20": "Outdoor home security cameras",
    "27": "Plenty of smarts",
    "30": "Which are the best home security cameras?"
  },
  "links": {
    "Statistia": "https://www.statista.com/statistics/339735/crime-worries-in-the-united-states/",
    "best smart home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Safety.com’s": "https://www.safety.com/home-security-survey/",
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers"
  }
}