{
  "source": "https://www.techradar.com/news/why-starfield-wont-be-fallout-in-space",
  "title": "Why Starfield won’t be Fallout in space",
  "category": "gaming",
  "updated": "2021-10-02T17:45:27Z",
  "author": "jordan-middler",
  "summary": "Bethesda’s next big franchise can distance itself from the wasteland",
  "article": [
    "After years of anticipation, speculation, and a few leaks, at E3 2021, Xbox and Bethesda finally confirmed what gamers around the world had been waiting to hear. Starfield, the next big RPG from Bethesda Game Studios, had a release date. And while its November 11, 2022 launch was almost 18 months away, the newly released teaser trailer, giving us the first look at the world of Starfield, only further stoked the excitement of fans.",
    "However, for those who’ve grown tired of the Bethesda formula, there’s been a lingering worry since the reveal that Starfield won’t be the revolutionary new step in the history of the legendary studio that they’re promising. Much in the same way that you can very much feel the DNA of Fallout 3 in Skyrim, many are wondering if Starfield is poised to be little more than Fallout in space.",
    "So, with details thin on the ground, we’ve decided to put your mind at ease with a collection of reasons why we think Starfield probably won’t be Fallout in space. We’ll be looking at things like the brand new lore that Bethesda gets to establish, the technological advancements, and the fact that, instead of a burned-down corner of America, Todd and the gang have all of the cosmos to play with.",
    "The most staggering difference between Fallout and Starfield is purely the canvas that Bethesda Game Studios gets to work with when creating its narrative. The Fallout maps were famously huge, emerging into The Capital Wasteland for the first time is a moment that’s indelibly marked in the minds of players everywhere. Ultimately though, however big the maps got, they’re still just a small chunk of the United States.",
    "With Starfield, Bethesda has an infinite amount of space, no pun intended, to play with. While Starfield likely isn’t going to consist of hundreds of planets, we’ve already seen in games like Xbox stablemate Obsidian’s The Outer Worlds how multiple planets can allow developers to totally change the landscape, the atmosphere and the visuals of a location. That mentality with the budget and scope of a Bethesda game means that we think it’s extremely unlikely that you’ll find yourself getting tired of the environment. No more tediously walking over a never-ending series of brown hills, now just jump in your ship and change the scenery.",
    "Since the Fallout games all take place in the wake of a large chunk of the US being landscaped by a nuclear weapon, a byproduct of that is that there’s not a huge amount of functioning guns left kicking around the wasteland. Even when you do find something that’s close to working, it’s probably been bolted together with pieces of old metal and tin cans. However, in the far-flung future of Starfield, no longer will you have to maintain your equipment by strapping bits of old windshield together, as the technology you’ll be using will be brand new.",
    "We got a brief look at a weapon in the teaser trailer, showing off a sleek yellow and white design. The gun, which appears to be some kind of SMG, also features an ammo reading on the gun itself, perhaps hinting at more inworld HUD elements integrated into the game.",
    "Hopefully, the upgrade to a new suite of futuristic and alien weapons also allows for a refresh of the combat system, which while not as VATs reliant as it once was, still isn’t up to the standards of a modern shooter. But, will shooting be your only option in Starfield? What about melee weapons? Will you even need to use weapons? How Starfield sets this element of its gameplay apart from Fallout and Skyrim is truly one of the most intriguing unanswered questions about the game.",
    "Along with the Power Armor and Vault Boy, Fallout’s soundtrack is one of the most iconic elements of the game. Made up of popular pre-50s swing and jazz music, no one can forget the first time they turned their pip-boy to Galaxy News Radio and heard the sultry sound of Capital Wasteland DJ Three-Dog introduce “I don’t want to set the world on fire”. This music was so essential to setting the atmosphere of the Fallout games, to ground them in reality with licensed music that gave the impression that long before the bombs dropped, this universe shared a history with our own.",
    "In Starfield, barring any connection to the current history of Earth, or your character carrying around a collection of old songs from home, there’s not likely to be much in the way of licensed music to set the tone. In fact, in the teaser trailer, you can see half of a poster for what appears to be a musician playing a space violin. Or, it could just be a regular violin, to be honest, but that’s less fun. The idea that the developers are going to establish a whole canon of new musical acts is hugely exciting, however, how much of this will manifest in the game, and how much of the musical score will rely on songs from our current earth remains to be seen.",
    "When Bethesda took over the Fallout IP in the mid-2000s, it inherited a large amount of lore that had been developed over the two previous Fallout games, in anticipation of Fallout 3. And while Fallout 3’s canon doesn’t stick rigidly to the rules of those PC classics, it did give the team a foundation to work off, with things like the vaults, plenty of monsters, and even some of the games most recognizable imagery like the Brotherhood of Steel.",
    "Conversely, Starfield is a completely clean slate for Bethesda Game Studio. This isn’t based on any previous IP, it’s built from the ground up by the developer. The trailer hails it as “a brand new universe, 25 years in the making”. The idea of seeing this team being able to stretch its legs with something completely new, on a whole new generation of hardware is incredibly exciting. The lore has to be built from scratch, the locations, the characters, all of it has to stand on its own, without the help of a previous series behind it. It’s a huge challenge for any studio, no less one with such high expectations around it.",
    "Love him or hate him, Todd Howard is one of the most recognizable faces in video game development. You can tell just by the reaction he gets when he’s brought on stage at E3, what he means to players. A Todd Howard game means something, and that’s why when he was associated so closely with the launch of, and eventual disaster of Fallout 76, people felt so let down.",
    "Starfield is Todd Howard’s opportunity to regain that trust from players. Whether you feel he earned it fairly or unfairly, I’m sure he’s more than aware of the meme status he achieved with the Fallout 76 announcement. If Starfield can make players feel like the first time they blew up Megaton, or stepped into the world of Skyrim, then his legacy as the face of Bethesda, will be reestablished. Players love Bethesda Game Studios games, but there was definitely a feeling of being underwhelmed with Fallout 4’s similarity to the games that came before it. Starfield needs to be more than that. It has to be the blueprint for the next 20 years of the company."
  ],
  "headers": {
    "3": "There’s a starfield, waiting in the sky",
    "5": "No more upcycled artillery",
    "8": "I don’t want to set the moon on fire",
    "10": "It’s a new day, yes it is",
    "12": "2022, a Todd Odyssey"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "teaser trailer": "https://youtu.be/pYqyVpCV-3c",
    "Fallout 76": "https://www.techradar.com/news/fallout-76-review-part-1-our-first-steps-in-the-wasteland",
    "Fallout 4": "https://www.techradar.com/news/gaming/fallout-4-the-good-the-bad-and-the-ugly-of-the-boston-wastelands-1308511"
  }
}