{
  "source": "https://www.techradar.com/news/where-was-the-xiaomi-mi-11-pro-at-the-mi-11-launch-here-are-our-best-guesses",
  "title": "Where was the Xiaomi Mi 11 Pro at the Mi 11 launch? Here are our best guesses",
  "category": "phones",
  "updated": "2021-02-09T19:00:33Z",
  "author": "tom-bedford",
  "summary": "Conspicuously absent",
  "article": [
    "The Xiaomi Mi 11 launch on February 8 turned out to be very light on new devices - we saw the Mi 11, already announced in China in December 2020, a new version of the Mi Electric Scooter Pro 2, already announced worldwide in July 2020, and the Xiaomi Mi TV Q1, which is only getting a very limited release, though admittedly is technically a new product.",
    "We’d heard rumors the launch event would also bring us the Xiaomi Mi 11 Pro, as well as perhaps a Lite and Ultra model of the new Xiaomi flagship, but those rumors evidently turned out to be incorrect.",
    "So without any further news of a potential Xiaomi Mi 11 Pro release date, we’re left wondering why the phone wasn’t shown off with its sibling.",
    "Xiaomi doesn’t have any official comment on this, or even on whether the phone is coming at all - the company declined to comment on the matter - so until the phone is released (if it ever is), we’ve collected our theories as to why it wasn’t shown off.",
    "Of course, this speculation could be totally wrong, but we’ve looked at trends in the phones market to give our best guess.",
    "In most years, annual tech show MWC would take place in February - that’s when Xiaomi launched the Mi 9 in 2019, and it also unveiled the Mi 10 at the same time in 2020, despite MWC being canceled then.",
    "This year, though, MWC is taking place in late June, and we’ve been unsure if the phones that would typically launch during February MWC still will at that point in the year, or if we’ll instead see them later on. The Xiaomi Mi 11 did the former, but the Mi 11 Pro might do the latter.",
    "By that we mean, while the Xiaomi Mi 11 came out at the beginning of the year, its Pro sibling (and possibly Lite and Ultra) could instead be launched in June at MWC 2021. Since the middle of the year is usually quite quiet in terms of phone launches, the Mi 11 Pro would potentially be the biggest launch of the tech event, giving Xiaomi incentive to launch it there.",
    "In 2020 Xiaomi unveiled three models in the Mi 10 series in February, before then showing off the Mi 10 Ultra in August that same year. The six-month gap let the Mi 10 Pro be the brand’s top phone for a long while, before it got replaced by a super-phone.",
    "By the sounds of its specs, the Xiaomi Mi 11 Pro could fill the same role in the brand’s 2021 phone line-up as the Mi 10 Ultra, as rumors suggest it will have impressive cameras and charging speeds. We’ve only heard a few Mi 11 Ultra rumors, so we’re not sure that handset is coming at all.",
    "Perhaps Xiaomi views the Mi 11 Pro in the same way it did the Mi 10 Ultra, as an ultra-attention-stealer, and therefore wants to space it out from the ‘standard’ Mi 11 to give that phone its time in the limelight.",
    "It’s very likely the Snapdragon 888 would be the chipset used in the Xiaomi Mi 11 Pro, as it’s one of the top smartphone processors available right now, and is also used in the standard Mi 11. By the sounds of it, though, there’s a shortage of the processor about.",
    "As reported by Bloomberg, and confirmed by Qualcomm's CEO in the article, there’s a shortage in chipsets right now, due to a demand increase thanks to everybody working from home, which isn’t balanced by increased supply. So it sounds like Qualcomm, which makes Snapdragon chipsets, might not have enough Snapdragon 888 chipsets to go around.",
    "Most flagships coming out in the first half of 2021 are expected to use the Snapdragon 888 - the Samsung Galaxy S21 and Xiaomi Mi 11 do and others like the Oppo Find X3, OnePlus 9 and Sony Xperia 1 III likely will do also. That’s lots of companies having to share a few Snapdragon 888s.",
    "Perhaps Xiaomi couldn’t acquire enough chipset stock for both a standard and Pro Xiaomi Mi 11, and decided to release just one now, with another coming further down the line when enough stock could be acquired. This theory would work alongside one of the other two posited here."
  ],
  "headers": {
    "5": "Xiaomi and MWC",
    "8": "Playing the Ultra game",
    "11": "The Qualcomm Snapdragon 888 shortage"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "new version of the Mi Electric Scooter Pro 2": "https://www.techradar.com/news/xiaomis-new-electric-scooter-sounds-like-a-beast-but-weve-seen-it-before",
    "Xiaomi Mi TV Q1": "https://www.techradar.com/news/the-xiaomi-mi-tv-q1-is-the-most-gorgeous-affordable-75-inch-4k-tvs-youll-never-see",
    "Xiaomi Mi 11 Pro": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "MWC": "https://www.techradar.com/news/mwc-2021-news",
    "Mi 9": "https://www.techradar.com/reviews/xiaomi-mi-9",
    "Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "MWC being canceled": "https://www.techradar.com/news/mwc-2020-is-cancelled-everything-you-need-to-know-about-what-happens-next",
    "Mi 10 Ultra": "https://www.techradar.com/news/xiaomi-mi-10-ultra",
    "Mi 10 Pro": "https://www.techradar.com/reviews/xiaomi-mi-10-pro-review",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-02-03/qualcomm-gives-upbeat-sales-forecast-on-5g-smartphone-demand",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii"
  }
}