{
  "source": "https://www.techradar.com/news/ecoflows-new-portable-power-station-provides-power-for-work-home-and-play",
  "title": "EcoFlow’s new portable power station provides power for work, home and play",
  "category": "smart-home",
  "updated": "",
  "author": "sponsored",
  "summary": "Battery provides electricity for plug-in AC devices",
  "article": [
    "People today live in a connected world, one where power for smartphones, computers, and other electrical technology is mandatory wherever they’re having fun camping, relaxing at home, or earning a paycheck at work. This is doubly true during power blackouts: when the local power grid is down, people need access to their own reliable power sources more than ever.",
    "EcoFlow’s new DELTA mini portable power station is designed to meet all of these needs in a compact, totable package. Due to be launched September 5, 2021 as the HSN Daily Special on HSN TV and HSN.com at the special discounted price of $799, and afterwards for $999 on www.EcoFlow.com, the new DELTA mini is the affordable, portable power supply for self-reliant people smart enough to take command of their electrical needs.",
    "About the size of a small drinks cooler, the EcoFlow DELTA mini can store 882Wh (Watt hours) of electricity in its onboard lithium battery. Moreover, the DELTA mini’s patented X-Stream technology allows this portable battery to be recharged up to 80% within an hour, and up to 100% in 1.6 hours (using a 900W input).",
    "In those situations where a standard power supply doesn’t exist to recharge the DELTA mini, solar panels can be used to recharge it anywhere touched by the sun.",
    "When connected to three 110W solar panels in full sunlight, the DELTA mini can be fully recharged in 3.3 to 6.6 hours.",
    "The EcoFlow DELTA mini can provide reliable electricity to people needing backup power at home or work, or main power for campers, farmers, first responders, ranchers and anyone else operating away from the electrical power grid.",
    "When solar panels are attached, the DELTA mini can even provide reliable power for people in remote regions where the local electrical supply is unreliable or nonexistent.",
    "So what does this mean in real life? Well, the DELTA mini has enough juice to run a speaker for 30 hours, a car fridge for 12 hours, a coffee maker for 0.7 hours, an electric kettle for 0.5 hours, plus recharge a drone 12 times and a digital camera 38 times.",
    "It also has enough output (1400W) to power 90% of all household appliances (e.g. a coffeemaker, dishwasher, hair dryer, microwave and vacuum cleaner, among others), and can even power an 1800W device using EcoFlow’s patented X-Boost technology.",
    "Extreme weather is becoming common around the world, resulting in more power outages and damaged distribution grids than ever before.",
    "This is why having a backup power supply makes such good sense, whether for home, work, or both. When you need power, you’ll have it.",
    "EcoFlow’s DELTA mini fulfills this role effectively and affordably. It is also lightweight and small enough to take on the road to keep all of your devices recharged and running, even in the middle of nowhere.",
    "To learn more about the DELTA mini and EcoFlow’s full range of power storage units - enough to run a whole house and then some - go here."
  ],
  "headers": {
    "2": "Powerful Specs",
    "5": "Powerful Possibilities",
    "9": "Affordable Backup Power for Everyone"
  },
  "links": {
    "HSN.com": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3229635471510419000&xs=1&url=https%3A%2F%2Fecoflow.com%2Fproducts%2Fecoflow-delta-mini-power-station%3Futm_source%3DPRTechRadar%26utm_medium%3Dreferral%26utm_campaign%3Ddelta_mini_launch&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fecoflows-new-portable-power-station-provides-power-for-work-home-and-play",
    "www.EcoFlow.com": "https://bit.ly/3mlA9V6",
    "here": "https://bit.ly/3mlA9V6"
  }
}