{
  "source": "https://www.techradar.com/news/bojack-horseman-creators-next-film-is-a-sci-fi-apple-tv-plus-movie",
  "title": "Bojack Horseman creator ditches Netflix for Apple TV Plus to make new sci-fi movie",
  "category": "entertainment",
  "updated": "2021-01-13T10:31:06Z",
  "author": "henry-st-leger",
  "summary": "Starring Andy Samberg",
  "article": [
    "Sometimes news is good, actually. A host of incredible creative and comedic talent and coming together for a new sci-fi movie over at Apple Studios, and we couldn't be more excited about the outcome.",
    "Raphael Bob-Waksberg, the creator of the hit Netflix Original animated series Bojack Horseman, is behind the concept for the upcoming film, which will no doubt air on the Apple TV Plus streaming service. But the screenplay is set to be written by Andy Siara, who wrote the sci-fi time-travel comedy Palm Springs, one of the best Hulu movies we had the pleasure of watching last year.",
    "The only talent attached so far is Andy Samberg, star of Brooklyn Nine-Nine, and one of the two leads of Palm Springs (alongside Cristin Milioti, who you may know from Black Mirror, or How I Met Your Mother). Noah Hawley, creator of Marvel TV show Legion, is set to produce – and comedian Ben Stiller will also produce through production company Red Hour.",
    "We expect it will be a live-action flick, rather than an animated series, based on Samberg's involvement. There's no synopsis or title for the film as of yet, but the names attached are enough to spark our curiosity.",
    "Apple TV Plus has also been kicking into gear as of late, building on what was quite a meager launch lineup in 2019 to include some of the best TV shows of recent memory – such as the feel-good soccer biopic Ted Lasso and game developer sitcom Mythic Quest.",
    "Of course, in these challenging times for TV production, it's hard to tell when this project might actually come together.",
    "We're already having to cope with continual delays to production of Stranger Things season 4 and The Witcher season 2, and perpetual releases on the likes of Netflix and Disney Plus have started to slow down considerably – even if the latter has finally managed to bring WandaVision to our screens.",
    "In the meantime, check out our guide to Apple TV Plus shows for something that's actually available already."
  ],
  "headers": {
    "5": "Production slump"
  },
  "links": {
    "Netflix Original animated series": "https://www.techradar.com/news/best-netflix-animated-series",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "best Hulu movies": "https://www.techradar.com/best/best-hulu-movies",
    "Black Mirror": "https://www.techradar.com/news/black-mirror-release-date-cast-episodes-netflix",
    "best TV shows": "https://www.techradar.com/best/best-tv-shows-2020-new",
    "Stranger Things season 4": "https://www.techradar.com/news/stranger-things-season-4",
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Netflix and Disney Plus": "https://www.techradar.com/news/disney-plus-vs-netflix-who-will-win",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Apple TV Plus shows": "https://www.techradar.com/news/from-spielberg-to-oprah-these-are-the-first-apple-tv-plus-exclusive-shows"
  }
}