{
  "source": "https://www.techradar.com/news/apple-glass-ar-specs-may-be-self-cleaning-and-feature-3d-audio",
  "title": "Apple Glass AR specs may be self-cleaning and feature 3D audio",
  "category": "wearables",
  "updated": "2021-02-25T16:34:32Z",
  "author": "axel-metz",
  "summary": "No tiny windscreen wipers, though",
  "article": [
    "Apple Glass, Apple’s rumored AR wearables, may come equipped with self-cleaning functionality and radar-like audio, new patent applications suggest.",
    "According to AppleInsider, the tech behemoth recently applied for a patent detailing \"audio-based feedback for [a] head-mountable device,” suggesting Apple is working on technology for its AR glasses which could see them capable of detecting far-away sounds and informing the wearer of their location.",
    "While the document itself doesn’t go into details regarding the purpose of such functionality, it seems that Apple Glass might be able to notify the wearer of sounds beyond their own field of hearing. So, in theory, they could direct you to the origin of a sound you usually wouldn’t be able to hear.",
    "A previous patent application had suggested the glasses may offer realistic sound effects to complement digitally-created imagery, in what sounds like a form of 3D audio, and these latest applications suggest Apple is doubling-down on the audio capabilities of its upcoming AR wearables.",
    "A further patent submitted by Apple indicates the glasses might come with an even more futuristic feature – self-cleaning glass (or “opticals”, as Apple puts it).",
    "Titled \"Particle Control for Head-Mountable Device,\" the patent hints at a device that could automatically clear dust and other foreign objects from what Apple refers to as \"optical modules.”",
    "Any bespectacled person knows that, over time, glasses succumb to the general wear and tear of life, whether through discolouration or the erosion of actual components, so AR wearables that could potentially resist the elements would be a welcome step into the future.",
    "Again, details are scarce on how exactly Apple Glass would do this, but the patent does hint at a device which could employ vibrations to independently remove dust and dirt – which seems logical, we guess.",
    "There’s also been a host of other patent applications and rumours swirling around regarding Apple Glass in recent months – from LiDar sensors to microchips – so we’ve put together a handy round-up of everything we know about the AR wearables so far.",
    "As for when we expect them to arrive? The jury is out, but our best guess is sometime in the next year.",
    "Via AppleInsider"
  ],
  "headers": {
    "4": "Not quite windscreen wipers"
  },
  "links": {
    "Apple Glass": "https://www.techradar.com/news/apple-glasses",
    "AppleInsider": "https://appleinsider.com/articles/21/02/25/apple-glass-microphones-may-locate-sounds-and-direct-users-to-the-source",
    "a patent": "http://appft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.html&r=37&p=1&f=G&l=50&d=PG01&S1=(apple.AANM.+AND+20210225.PD.)&OS=aanm/apple+and+pd/2/25/2021&RS=(AANM/apple+AND+PD/20210225)",
    "patent application": "http://patft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&r=1&f=G&l=50&s1=10728690.PN.&OS=PN/10728690&RS=PN/10728690",
    "further patent": "http://appft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.html&r=33&p=1&f=G&l=50&d=PG01&S1=(apple.AANM.+AND+20210225.PD.)&OS=aanm/apple+and+pd/2/25/2021&RS=(AANM/apple+AND+PD/20210225)",
    "LiDar sensors": "https://www.techradar.com/news/apple-glasses-could-land-in-early-2022-with-lidar-tracking",
    "a handy round-up": "https://www.techradar.com/news/apple-glasses"
  }
}