{
  "source": "https://www.techradar.com/news/jupiters-legacy-has-been-dropped-by-netflix-but-is-it-officially-cancelled",
  "title": "Jupiter's Legacy has been dropped by Netflix – but is it officially cancelled?",
  "category": "entertainment",
  "updated": "2021-06-03T08:55:26Z",
  "author": "tom-power",
  "summary": "Jupiter's Legacy on Netflix seems to be done after one season",
  "article": [
    "Jupiter's Legacy on Netflix is no more. The superhero TV show, based on Mark Millar and Frank Quitley's comics of the same name, has seemingly been canned after just one season.",
    "Taking to his personal Twitter account on Wednesday (June 2), Millar confirmed that a second season of Jupiter's Legacy wouldn't be happening. Strangely, though, his statement didn't include the word 'cancelled', so it's unclear if Netflix has officially scrapped the series.",
    "Millar went on to thank the Jupiter's Legacy team for all of their hard work in bringing Jupiter's Legacy to life, before revealing that the show's cast had been informed about Netflix's decision not to move ahead with a second season.",
    "\"I'm really proud of what the team achieved with Jupiter's Legacy and the amazing work everyone did in that origin season,\" Millar wrote. \"Given where we're going next, we've made the tough call of letting our incredible cast out of their show commitment as we continue to thoughtfully develop all realms of the Jupiter's Legacy saga.",
    "\"We're confident we'll return to it later, and just want to say thanks to you guys for your continued support and to the cast and crew who made this look so great.\"",
    "At the time of writing, none of the show's main cast have commented on Netflix's decision.",
    "Millar's statement doesn't exactly say that Jupiter's Legacy was cancelled, but it's easy to read between the lines and conclude that this is the case.",
    "According to The Hollywood Reporter's Borys Kit, Jupiter's Legacy season 1 reportedly cost Netflix an eyewatering $200 million to produce. Given that the series was met with a lukewarm reaction by critics (and some fans), you can see why Netflix pulled the plug on a TV show that, for its monetary outlay, didn't resonate with audiences.",
    "Jupiter's Legacy was viewed (in some quarters) as Netflix's answer to Amazon Prime's R-rated superhero shows in The Boys and Invincible. While its competitors' superhero adaptations have been critically acclaimed from many viewers, though, Jupiter's Legacy wasn't - and it's ultimately paid the price for it.",
    "According to Deadline's sources, Jupiter's Legacy could return in a different capacity (an anime series, anyone?), but it's unclear if we'll see The Utopian, Lady Liberty, Brainwave and more make another appearance on Netflix.",
    "Despite Jupiter's Legacy becoming the second major Netflix casualty in recent times (The Irregulars was also cancelled in May), this isn't the end of Millar's association with Netflix.",
    "The streamer acquired his comic book company – Millarworld – in August 2017 with the view to adapting more of Millar's comics for TV.",
    "Next up is an animated adaptation of Supercrooks, which is set to debut at the Annecy International Animation Film Festival between June 14 and June 19. Other comics that are getting the Netflix treatment include American Jesus, Empress, Huck, Prodigy and The Magic Order.",
    "Finally – and somewhat surprisingly – Millar's Twitter statement also revealed that a live-action version of Supercrooks was in development at Netflix.",
    "It seems strange that the streamer has greenlit anime and live-action shows based on the same comic property. It's likely, though, that the latter will tie into the live-action world of Jupiter's Legacy in a way that the animated series wouldn't.",
    "Could we see the likes of Josh Duhamel and Ben Daniels reprise their superhero roles in a cameo capacity in either production? Possibly but, for now, their time in the Jupiter's Legacy universe is over."
  ],
  "headers": {
    "6": "Analysis: will Jupiter's Legacy be revived by Netflix?"
  },
  "links": {
    "Jupiter's Legacy": "https://www.techradar.com/news/jupiters-legacy-season-2-release-date-plot-cast-and-more",
    "The Boys": "https://www.techradar.com/news/the-boys-season-3",
    "Invincible": "https://www.techradar.com/news/invincible-season-2",
    "Deadline's sources": "https://deadline.com/2021/06/supercrooks-live-action-series-netflix-matt-millar-jupiters-legacy-canceled-cast-released-1234768204/",
    "also cancelled in May": "https://www.techradar.com/news/netflix-has-cancelled-the-irregulars-so-what-went-wrong#:~:text=Yep%2C%20The%20Irregulars%20has%20been,Netflix%20after%20a%20solitary%20season.&text=First%20reported%20by%20Deadline%2C%20and,canned%20by%20the%20streaming%20giant."
  }
}