{
  "source": "https://www.techradar.com/news/box-might-finally-make-mac-cloud-storage-useful",
  "title": "Box might finally make Mac cloud storage useful",
  "category": "computing",
  "updated": "2021-10-21T19:00:51Z",
  "author": "anthony-spadafora",
  "summary": "New Box Drive update offers a secure and seamless experience on macOS",
  "article": [
    "After adding support for M1 Macs earlier this year, the cloud storage provider Box has announced that it has upgraded the Box desktop experience for macOS users.",
    "Using a browser to access your files stored in the cloud can be cumbersome which is why Box Drive allows users to open, edit and create Box files directly from their desktop and have their content saved automatically to the cloud.",
    "Box's latest release builds on its support for Apple silicon Macs and the company's new version of Box Drive was built using Apple's File Provider Extension APIs which offer a more secure and seamless experience when using cloud storage services on macOS.",
    "The latest version of Box Drive includes full support for M1 Macs while offering a more seamless and secure experience on all Macs thanks to Box's new integration in Finder.",
    "At the same time, this new release is compatible with macOS Monterey, significantly streamlines the install experience for Box Drive on all Macs and provides broader application compatibility by supporting Mac package files.",
    "However, by switching to a new architecture, Box will be able to build and roll out new Box Drive capabilities on macOS more quickly.",
    "The new Box Drive experience for Mac is available for all users on macOS Big Sur 11.5+ and macOS Monterey. Business and individual users running macOS Monterey won't be required to take any additional actions to get this new release as Box's software will be updated automatically while business users on macOS Big Sure 11.5+ can turn on the new experience by visiting this page and following its instructions."
  ],
  "headers": {
    "3": "New Box Drive experience"
  },
  "links": {
    "M1 Macs": "https://www.techradar.com/news/apples-new-macos-monterey-brings-features-to-m1-macs-only",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Box": "https://www.techradar.com/reviews/box",
    "browser": "https://www.techradar.com/best/browser",
    "Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Finder": "https://www.techradar.com/how-to/how-to-show-hidden-files-in-macos",
    "macOS Monterey": "https://www.techradar.com/news/macos-12",
    "visiting this page": "https://support.box.com/hc/en-us/articles/4407737091219"
  }
}