{
  "source": "https://www.techradar.com/news/yet-another-exchange-is-abandoning-this-massive-cryptocurrency",
  "title": "Yet another exchange is abandoning this massive cryptocurrency",
  "category": "computing",
  "updated": "2021-01-18T18:18:56Z",
  "author": "joel-khalili",
  "summary": "Kraken becomes the latest crypto exchange to drop XRP",
  "article": [
    "Cryptocurrency exchange Kraken has become the latest in a series of high-profile platforms to delist XRP, one of the world’s largest digital currencies.",
    "The decision was prompted by a lawsuit filed in December by the US Securities and Exchange Commission (SEC), against XRP custodian Ripple, it’s CEO Brad Garlinghouse and President Chris Larsen.",
    "The lawsuit hinges on the classification of XRP as a security (i.e. a financial asset from the investor intends to profit) as opposed to a currency or medium of exchange. The SEC claims the sale of XRP amounted to a violation of federal securities law, because Ripple failed to properly classify its product and, by extension, provide sufficient information to investors.",
    "“Given the recent SEC filing against Ripple Labs Inc., we are halting XRP trading for US residents no later than January 29, 2021 at 5pm PT,” explained Kraken in a blog post.",
    "According to the firm, the decision will only affect US-based customers. Although they will no longer be able to purchase XRP, US residents will still be able to deposit, hold or withdraw via Kraken’s wallet service.",
    "The company explained it could not yet say for how long restrictions will last. “We are monitoring the situation regarding the SEC’s filing and will adapt according to any new developments,” it added.",
    "When the lawsuit was first announced, only two small US exchanges (CrossTower and Beaxy) dropped XRP from listings. However, a raft of major players - such as Binance and Coinbase - have since followed, making the cryptocurrency effectively untradeable in the US and damaging the value of existing XRP holdings.",
    "The digital currency is currently sitting at a valuation of just $0.28 per coin, down by more than 50% from roughly $0.55 before the SEC lawsuit was announced. The cryptocurrency has fallen from third to fifth largest in the world by market capitalization, overtaken by Tether and Polkadot.",
    "Ripple, for its part, maintains that XRP should not be classified as a security, and Garlinghouse himself described the lawsuit as “an attack on the entire crypto industry and American innovation.”",
    "In the company’s Wells Submission, a document that allows defendants to respond to any lawsuit brought against them, Ripple states that “the SEC’s theory, that XRP is an investment contract, is wrong on the facts, the law and the equities.”",
    "“[The SEC theory] ignores the economic reality that XRP is, and has long been, a digital asset with a fully functional ecosystem and a real use case.”",
    "Via CoinDesk"
  ],
  "headers": {
    "6": "XRP lawsuit"
  },
  "links": {
    "a lawsuit": "https://www.techradar.com/news/this-massive-cryptocurrency-could-be-about-to-become-effectively-untradeable",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6538297467682934000&xs=1&url=https%3A%2F%2Fblog.kraken.com%2Fpost%2F7450%2Fkraken-to-halt-xrp-trading-for-u-s-residents%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fyet-another-exchange-is-abandoning-this-massive-cryptocurrency",
    "Wells Submission": "https://ripple.com/wp-content/uploads/2020/12/Ripple-Wells-Submission-Summary.pdf",
    "CoinDesk": "https://www.coindesk.com/sec-sues-ripple-over-7-year-1-3b-ongoing-xrp-sale"
  }
}