{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-2-buyers-can-now-try-the-phone-for-100-days-before-committing",
  "title": "Samsung Galaxy Z Fold 2 buyers can now try the phone for 100 days before committing",
  "category": "phones",
  "updated": "2021-02-24T11:25:28Z",
  "author": "james-rogerson",
  "summary": "It's the same for the Galaxy Z Flip 5G",
  "article": [
    "Foldable phones are expensive, and they’re also not going to be a good fit for everyone, so convincing people to take a chance on them is one of the major hurdles that companies face. But Samsung has just made it a lot less risky to give a foldable phone a try.",
    "Buyers in the US who purchase a Samsung Galaxy Z Fold 2 or Samsung Galaxy Z Flip 5G direct from Samsung’s online store between now and April 1 will get 100 days to try the phone. If you decide you don’t want it during that period, you can return it for a full refund.",
    "Most phones bought from Samsung’s online store only have a 15-day return window, and many other retailers are similar, so extending that to 100 days for foldables gives buyers plenty of time to make sure it’s the phone they want.",
    "It’s worth noting that for now this program has only been announced for the US, but we wouldn’t be surprised if it gets rolled out elsewhere too.",
    "To tempt buyers even more, Samsung is also offering what it calls 'enhanced trade-in credit' of up to $550 (around £390 / AU$700) if you trade in an eligible device when you make your purchase.",
    "The company is also chucking in $200 (roughly £140 / AU$250) of store credit towards accessories – though GSMArena has confirmed that unsurprisingly you don’t get to keep that if you return the foldable phone, and if you’ve already used it you’ll have to either pay for the items or return them too.",
    "Still, there’s a lot here to make a foldable phone purchase a bit less daunting. Of course, what we really want is for prices to come down, but we’re probably still years away from most foldables being truly ‘affordable’."
  ],
  "headers": {
    "3": "Extra incentives"
  },
  "links": {
    "Foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy Z Flip 5G": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Samsung’s online store": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1157910054338045000&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fshop%2Fall-deals%2F%23&article_name=Samsung%20Galaxy%20Z%20Fold%202%20buyers%20can%20now%20try%20the%20phone%20for%20100%20days%20before%20committing&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-galaxy-z-fold-2-buyers-can-now-try-the-phone-for-100-days-before-committing",
    "GSMArena": "https://www.gsmarena.com/samsung_allows_100day_return_window_for_z_fold2_and_z_flip_5g_in_the_us-news-47906.php"
  }
}