{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-could-be-surprisingly-affordable",
  "title": "Samsung Galaxy Z Fold 3 and Z Flip 3 could be surprisingly affordable",
  "category": "phones",
  "updated": "2021-07-12T14:59:29Z",
  "author": "james-rogerson",
  "summary": "Still far from cheap",
  "article": [
    "Foldable phones are always among the most expensive phones you can buy, but this year Samsung might look to make them a little more affordable, with both the Samsung Galaxy Z Fold 3 and the Galaxy Z Flip 3 rumored to be cheaper than their predecessors.",
    "According to a leaker known as Lanzuk, posting on Naver (a South Korean social media site), the Samsung Galaxy Z Fold 3 will cost somewhere between 1,900,000 South Korean won and 1,999,000 won, with the price likely to be closer to the latter of those.",
    "For reference, the Samsung Galaxy Z Fold 2 launched for 2,398,000 won, so that’s a significant drop, and the leaked price converts to around $1,745 / £1,255 / AU$2,330 (using the highest of the two leaked numbers). The Z Fold 2 meanwhile cost $1,999 / £1,799 / AU$2,999, so that again is a sizeable drop – though converted prices won’t be totally accurate.",
    "It’s a similar story with the Samsung Galaxy Z Flip 3, which will reportedly cost between 1,200,000 won and 1,280,000 won, but will apparently be closer to the lower of those two numbers. A conversion from that number comes in at $1,045 / £755 / AU$1,400, while the Samsung Galaxy Z Flip 5G cost $1,449 / £1,399 / AU$2,599 at launch.",
    "While we’d take these numbers with a pinch of salt, we’ve heard multiple times that these foldables will be cheaper than their predecessors, so a lower price is looking likely.",
    "You might also get some tempting extras for you money too, as @GaryeonHan has tweeted that the Samsung Galaxy Watch 4 and Samsung Galaxy Buds 2 are likely to either be thrown in, or offered at a heavy discount when buying one of these foldables.",
    "We wouldn’t count on this given that the leaker doesn’t have much of a track record, but it’s not unbelievable, as Samsung often bundles freebies with expensive phones. If this does pan out, then we’d expect these would be limited to pre-orders, and assume the Galaxy Watch 4 will be included with the Galaxy Z Fold 3, and the Buds 2 with the Z Flip 3.",
    "The wait to get all these gadgets should almost be over too, as it’s rumored that Samsung will unveil them on August 11, probably alongside the Samsung Galaxy S21 FE.",
    "Via PhoneArena and @FrontTron"
  ],
  "headers": {
    "5": "Get a Galaxy Watch 4 thrown in"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Lanzuk": "https://blog.naver.com/yeux1122/222428835314",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy Z Flip 5G": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "@GaryeonHan": "https://twitter.com/GaryeonHan/status/1414525462039072772",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "PhoneArena": "https://www.phonearena.com/news/samsung-galaxy-z-fold-3-price-pre-order-gifts-leaked_id133539",
    "@FrontTron": "https://twitter.com/FrontTron/status/1414521686150443009"
  }
}