{
  "source": "https://www.techradar.com/news/mondaycom-workdocs-is-like-google-docs-on-steroids",
  "title": "monday.com workdocs is like Google Docs on steroids",
  "category": "computing",
  "updated": "2021-08-17T21:17:22Z",
  "author": "anthony-spadafora",
  "summary": "New online collaboration software aims to keep workers on monday.com's platform",
  "article": [
    "The work management company monday.com has launched a new online collaboration software solution called workdocs that aims to give Google Docs a run for its money.",
    "Rather than have employees switch between its platform and other office software, workdocs is built directly into monday.com's platform. It's also available for all of the company's users including those on its free plan though they are limited to up to two users.",
    "While similar to Salesforce's Quip, workdocs is a more comprehensive offering that doesn't hide any of its features behind an additional subscription. The ability to edit live documents in workdocs is included in a user's monday.com subscription but being able to do so in Quip requires upgrading to a Salesforce Anywhere Advanced plan which costs an exorbitantly high $100 per user per month.",
    "Although workdocs is already integrated into monday.com's Work OS, the company plans to add integrations for other popular software from Salesforce, Microsoft and Google going forward.",
    "Workdocs utilizes monday.com's new real-time engine which the company built upon its Work OS operating system and allows hundreds of people to work simultaneously on the same document.",
    "Workdocs allows monday.com users to create shared workdocs visible to other team members, private workdocs only viewable by themselves or other invited users and shareable workdocs where other team members and even those outside of one's organization can be added to a document. Although workdocs users will be able to enter text and see what others are working on at the same time, it's worth noting that its undo function only undoes a user's own work instead of the latest additions to a document.",
    "Despite the fact that workdocs has just launched, there are already more than thirty widgets available for the service including calendar, chart, clock, inbox, list view, Gantt, to do and more. Just like workdocs documents, these widgets operate in real-time and when a task is updated in Monday.com, they are updated as well.",
    "Existing monday.com users can log on to the company's platform to check out workdocs for themselves while interested users can take a look at this new video which provides additional details on the service.",
    "Via Enterprise Times"
  ],
  "headers": {
    "4": "workdocs"
  },
  "links": {
    "monday.com": "https://www.techradar.com/reviews/mondaycom",
    "online collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "office software": "https://www.techradar.com/best/free-office-software",
    "Quip": "https://www.techradar.com/news/salesforce-debuts-new-all-in-one-platform-for-the-post-pandemic-world",
    "operating system": "https://www.techradar.com/news/best-alternative-operating-systems",
    "Gantt": "https://www.techradar.com/best/gantt-chart-software",
    "new video": "https://www.youtube.com/watch?v=IjtcEEJBtcY",
    "Enterprise Times": "https://www.enterprisetimes.co.uk/2021/08/17/monday-com-delivers-workdocs-a-new-way-to-collaboratively-create-content/"
  }
}