{
  "source": "https://www.techradar.com/news/windows-10x-will-feature-clever-anti-theft-protection-to-deter-thieves",
  "title": "Windows 10X will feature clever anti-theft protection to deter thieves",
  "category": "computing",
  "updated": "2021-01-14T11:04:45Z",
  "author": "matt-hanson",
  "summary": "Making your device safer",
  "article": [
    "Microsoft is adding a new anti-theft feature to Windows 10X, which will stop people from resetting a stolen device and reusing it.",
    "With anti-theft protection turned on, you will need to enter in your PIN or Microsoft Account password to reset the device – which essentially reinstalls Windows 10X and sets everything back to their default settings.",
    "So, if someone stole your Windows 10X device, they would not be able to reset it. This would effectively permanently lock them out of the device, and would keep the ‘Find my device’ feature running, which could help you locate it.",
    "The idea is that this would make Windows 10X devices less appealing to thieves. The drawback is that thieves may not know about Windows 10X or the feature, and will pilfer it anyway. Once they find out it’s locked, they may just discard it, which may make it easier for you to get it back.",
    "However, we’re not sure if performing a clean reinstall of Windows 10X, rather than a restore, would bypass this.",
    "Of course, the best anti-theft protection for your device remains being careful with it when using it in public places.",
    "As MSPowerUser reports, this anti-theft protection feature looks like it’s just coming to Windows 10X, not regular Windows 10.",
    "Windows 10X is a version of Windows 10 that was originally meant for dual-screen devices, but is now being released for budget and low powered laptops in a bid to compete with Chromebooks running ChromeOS.",
    "We should start seeing Windows 10X-toting devices in the first half of 2021, and it will be interesting to see just how much of a threat they will be to Chromebooks, which are particularly popular in the education sector thanks to their security, solid performance and low prices."
  ],
  "headers": {
    "6": "Windows 10X"
  },
  "links": {
    "Windows 10X": "https://www.techradar.com/news/windows-10x",
    "MSPowerUser reports": "https://mspoweruser.com/microsoft-windows-10x-anti-theft-protection/",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook"
  }
}