{
  "source": "https://www.techradar.com/news/intel-alder-lake-leak-shows-a-flagship-cpu-that-could-be-an-amd-ryzen-5950x-killer",
  "title": "Intel Alder Lake leak shows a flagship CPU that could be an AMD Ryzen 5950X killer",
  "category": "computing",
  "updated": "2021-07-21T09:54:39Z",
  "author": "darren-allan",
  "summary": "If this leaked benchmark pans out, AMD could have something to seriously worry about",
  "article": [
    "Intel’s Alder Lake flagship CPU has been the subject of another leak, specifically an illuminating benchmark result which backs up other recent spillage showing the Core i9-12900K comfortably beating out the Ryzen 5950X.",
    "This time, the leak comes from Raichu on Twitter, who claims to have results for a qualification sample (early pre-release model) of the 12900K which was water-cooled and benchmarked in Cinebench R20 (help yourself to condiments on the way in).",
    "Note that Raichu meant 12900K and not ‘12900KS’ as written in the original message, a clarification made in a follow-up tweet. At any rate, the Alder Lake flagship sample managed to hit 11,600 in Cinebench R20 multi-threaded, and 810 in single-threaded.",
    "As VideoCardz, which spotted the rumored scores, points out, if you compare those results to the Ryzen 9 5950X (as per Guru3D findings), the 12900K looks to be over 11% faster than the AMD flagship in multi-core, and a hefty 26% better in single-core. And that’s with the Intel CPU not being a finished product…",
    "Of course, this is just a rumored leak based on a supposed sample Intel chip, so we shouldn’t get carried away with what would seem to be seriously impressive performance figures. However, as we mentioned at the outset, the interesting part here is that a previous 12900K leak indicates the same thing, namely a Cinebench R20 multi-core result of approximately 10% better than the 5950X.",
    "Even if these rumors are on the money, Cinebench is just one metric for measuring the performance of a CPU, so again, let’s be cautious around our expectations here. Indeed, Raichu warns that this is just a single test here, and the leaker expects that the 12900K and 5950X will be ‘well-matched’ overall.",
    "Raichu also observes that power consumption for Alder Lake is something of a concern, and the 12900K will likely drain over 200W when running flat-out at full Turbo. Again, this reinforces what we’ve heard previously, namely that the 12900K sports a rumored base TDP of 125W, but the max power draw (known as ‘PL2’) could weigh in at 228W. Do note that this is still an improvement on Rocket Lake, with the 11900K hitting 250W for PL2.",
    "If Alder Lake does turn out to be an ace up Intel’s sleeve, though, what’s doubly interesting – or worrying from AMD’s perspective – is the apparent lack of any response from Team Red in the near future. Remember that the rumor mill isn’t expecting a new generation of processors from AMD until late in 2022, when Zen 4 should purportedly arrive – with a Zen 3+ overhaul apparently not planned.",
    "However, AMD will obviously do something in the interim, with the current theory being a Ryzen 5000 XT refresh. Will that be enough? If Alder Lake pans out as this leak suggests, perhaps not – even if AMD is planning on making the next XT revamp much more peppy than the original by the use of 3D Chiplet technology. Let’s also not forget the synergy between Alder Lake and Windows 11 which is purportedly in the works, too."
  ],
  "headers": {
    "6": "Power drain"
  },
  "links": {
    "Intel’s Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "Ryzen 5950X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-9-5900x-and-5950x-find-stock-here",
    "VideoCardz": "https://videocardz.com/newz/intel-core-i9-12900ks-qs-allegedly-outperforms-ryzen-9-5950x-in-cinebench-r20-test",
    "Guru3D": "https://www.guru3d.com/news-story/alleged-intel-core-i9-12900k-beats-amd-ryzen-9-5950x-with-cinebench-r20-(bigtime).html",
    "previous 12900K leak indicates the same thing": "https://www.techradar.com/news/intel-alder-lake-flagship-cpu-may-not-boost-as-fast-as-rumor-mill-hoped",
    "max power draw (known as ‘PL2’) could weigh in at 228W": "https://www.techradar.com/news/intel-alder-lake-cpu-rumored-specs-could-mean-amd-has-a-serious-fight-on-its-hands",
    "when Zen 4 should purportedly arrive": "https://www.techradar.com/news/amds-next-gen-ryzen-cpus-and-rdna-3-gpus-could-launch-together-at-end-of-2022",
    "3D Chiplet technology": "https://www.techradar.com/news/amd-3d-chiplet-technology-meet-the-future-of-processors",
    "synergy between Alder Lake and Windows 11": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows"
  }
}