{
  "source": "https://www.techradar.com/news/microsoft-excel-is-getting-a-whole-load-of-new-updates-and-upgrades",
  "title": "Microsoft Excel is getting a whole load of new updates and upgrades",
  "category": "computing",
  "updated": "2021-01-26T16:01:42Z",
  "author": "barclay-ballard",
  "summary": "Excel for the web is set for a host of upgrades",
  "article": [
    "A whole host of improvements and new features are coming to Microsoft Excel for the web, according to a company blog post. The significant performance improvements concern opening workbooks, scrolling, and cell formatting.",
    "“With an uncompromised goal to provide our customers with the ideal, fast, and smooth user experience, we’re excited to announce the latest significant performance improvements in Excel for the web,” Danielle Rifinski, product manager at Microsoft, explained. “We have addressed and improved several scenarios, including opening workbooks, navigating within a workbook, and other interactions.”",
    "The upgrades are part of an ongoing commitment Microsoft has to improve the user experience for Excel for the web. The technology giant advises individuals to visit UserVoice in order to provide suggestions for improvements or new features, or send feedback directly to the company’s developers using the relevant Office app.",
    "Among the new Excel for web features that Microsoft would like feedback on are improvements to loading times, scrolling, and cell selection. The firm has significantly reduced the time it takes to load a workbook, made scrolling quicker and smoother, and optimized the speed of selection. Altogether, the new features should enable Excel users to work more efficiently and, hopefully, be more productive.",
    "Other upgrades concern navigation and data modification within the Excel web app. Microsoft has optimized navigation actions, including find/search, go-to, page-up, and page-down, and developed faster cell editing and formatting options.",
    "Given that more employees are working from home as a result of the COVID-19 pandemic, web-based applications have seen a rise in usage. With this in mind, the performance improvements recently announced by Microsoft for its Excel web app will certainly be welcomed."
  ],
  "headers": {
    "3": "Online upgrades"
  },
  "links": {
    "Microsoft Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8560402038913525000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fexcel-blog%2Fperformance-improvements-in-excel-for-the-web%2Fba-p%2F2068621&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-excel-is-getting-a-whole-load-of-new-updates-and-upgrades"
  }
}