{
  "source": "https://www.techradar.com/news/this-cyber-monday-beats-powerbeats-pro-deal-drops-buds-to-their-lowest-price-ever",
  "title": "This Cyber Monday Beats PowerBeats Pro deal drops buds to their lowest price ever",
  "category": "audio-visual",
  "updated": "2021-11-29T09:21:21Z",
  "author": "rhys-wood",
  "summary": "Grab the fitness buds for less on Cyber Monday",
  "article": [
    "We've seen a lot of fantastic Cyber Monday Beats deals this year, many of which have carried over from the Black Friday sales. If you're looking for a superb pair of running earbuds, there's also a deal for you on the Beats PowerBeats Pro, which are down to their lowest price ever at Amazon in both the US and UK.",
    "Down to a record-low price as part of the Cyber Monday deals, the Beats PowerBeats Pro can be bought right now for just $149.95 in the US and £149 in the UK. US buyers are getting a slightly better deal overall, saving $100 off retail price, but UK shoppers certainly aren't being short-changed.",
    "(Not in the US or UK? Scroll down for deals in your region).",
    "Cyber Monday is today, and thus will be the last big sales event before the run-up to Christmas and the holidays. As such, now is an excellent time to grab a Cyber Monday Beats PowerBeats Pro deal before prices go back to normal tomorrow.",
    "Looking for headphones brands other than Beats? We've got a buying guide for the best Cyber Monday headphones deals if you want a more general overlook at what you can buy during today's sales. We've also been seeing a lot of Cyber Monday AirPods deals if you fancy shopping around for Apple's range of premium buds.",
    "No matter where you live, you'll find all the best Cyber Monday Beats PowerBeats Pro deals from around the web below."
  ],
  "headers": {
    "3": "Today's best Cyber Monday Beats PowerBeats Pro deals",
    "5": "More Cyber Monday Beats deals",
    "6": "More Cyber Monday deals (UK)"
  },
  "links": {
    "Cyber Monday Beats deals": "https://www.techradar.com/cyber-monday/beats-cyber-monday-deals-2021",
    "Beats PowerBeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Cyber Monday headphones deals": "https://www.techradar.com/cyber-monday/cyber-monday-headphones-deals",
    "Cyber Monday AirPods deals": "https://www.techradar.com/cyber-monday/airpods-deals-airpods-pro-deals"
  }
}