{
  "source": "https://www.techradar.com/news/after-e3-2021-future-shows-could-be-a-mix-of-physical-and-digital",
  "title": "After E3 2021, future shows could be 'a mix of physical and digital'",
  "category": "gaming",
  "updated": "2021-06-09T18:27:09Z",
  "author": "emma-boyle",
  "summary": "Change and adapt",
  "article": [
    "This year, E3 is going all-digital for the very first time but the ESA has said that while physical shows will return in the future, they could embrace more digital elements.",
    "In a recent interview with GamesIndustry.biz, ESA president Stanley Pierre-Louis said that this year's show being entirely online will provide the organization with opportunities to learn what works and what could potentially be carried over to future events.",
    "“This will provide us with an opportunity to present to members of the industry, media, and fans an opportunity to participate fully,” Pierre-Louis said, “and I think that provides a real unique opportunity to learn this year what we can apply to future events that will probably be a mix of physical and digital.”",
    "Of course, nothing is set in stone just yet and Pierre-Louis wasn’t able to give any solid details on how the ESA might attempt to balance physical and digital elements, saying that the exact shape of E3’s future is “yet to be determined”. He added, “we hope to learn from this year’s event what transfers well. I can’t speak to future E3s because we really want to focus on E3 2021 and ensure this is a great experience for exhibitors, the media, and fans alike.”",
    "It’s perhaps unsurprising, given the uncertainty of the last year, that the ESA is considering making digital aspects a more permanent part of E3 going forward. It’s only recently that Blizzard Entertainment, for instance, announced BlizzCon 2021 will not be going ahead in its usual form and that instead another Blizzconline style event will be held in early 2022, with “smaller in-person gatherings” expected to be a part of that.",
    "We're now gearing up for the start of E3 2021, which is set to run from June 12 to June 15. Across the four-day broadcast, gaming fans will be able to watch a mix of press conferences, panels and interviews. The ESA has also created an app and online portal, with elements designed to encourage viewers to interact with the show beyond simply watching the livestreams.",
    "A full schedule for E3 2021 has now been released and we have presentations and announcements from a wide range of publishers to look forward to, from Ubisoft and Nintendo to Square Enix and Microsoft. The notable absence this year is Sony, which has confirmed it isn’t planning to present at the show.",
    "E3 isn’t the only online gaming event that’s taking place over the next few weeks and months, though. Geoff Keighley’s Summer Game Fest kicks off on June 10 with Steam Next Fest hot on its heels later in the month. EA has confirmed it’ll be holding its traditional EA Play event, this year on the slightly later date of July 22 and, shortly after that, an all-digital Gamescom 2021 will be taking place in August."
  ],
  "headers": {
    "5": "A busy summer"
  },
  "links": {
    "GamesIndustry.biz": "https://www.gamesindustry.biz/articles/2021-06-09-catching-up-with-the-esa-on-the-eve-of-the-first-digital-e3",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "announced": "https://www.techradar.com/news/blizzcon-2021-is-canceled",
    "Blizzconline": "https://www.techradar.com/news/blizzcon-2021",
    "an app and online portal": "https://www.techradar.com/news/e3-2021-app-and-online-portal-revealedheres-how-the-all-digital-event-will-work",
    "confirmed": "https://www.techradar.com/news/ea-play-2021-confirmed-for-july-following-rumored-battlefield-june-reveal",
    "Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know",
    "Steam Next Fest": "https://www.techradar.com/news/steam-next-fest-is-coming-in-june-with-hundreds-of-game-demos",
    "Gamescom 2021": "https://www.techradar.com/news/gamescom-2021-is-to-be-an-all-digital-event"
  }
}