{
  "source": "https://www.techradar.com/news/samsung-neo-qled-tvs-meet-the-future-of-quantum-dot-tvs",
  "title": "Samsung Neo QLED TVs: meet the future of quantum dot TVs",
  "category": "televisions",
  "updated": "2021-02-01T10:37:28Z",
  "author": "nick-pino",
  "summary": "The evolution of QLED TVs is here",
  "article": [
    "During its First Look CES 2021 event, Samsung has taken the wraps off its QLED TV successor – a technology it’s dubbed Neo QLED – that packs in 10 times the amount of LEDs into a screen to radically increase brightness, reduce blooming and widen viewing angles.",
    "Neo QLED takes its inspiration from Samsung’s mammoth Mini-LED TV, The Wall, and uses a totally new type of LEDs that Samsung has developed to focus light through the quantum dot filter.",
    "The result? 100% color volume of DCI-P3, plus better local dimming.",
    "Despite the new name, however, Neo QLED TVs will follow Samsung’s traditional naming schemes and will be split into two new 4K (the Samsung QN90 and QN85) and two new 8K models (the Samsung Q900 and Q800) that will be available starting later this year.",
    "For the past few years, using self-emissive technology has given OLED TVs a real advantage over QLED and other quantum dot LED-LCD TVs in terms of contrast - but by reducing the size of the LEDs and reducing the dispersion of light, Neo QLED should perform just as well in terms of black levels as OLED but retain the higher peak brightness. Neo QLED could be the great equalizer for LED-LCD TVs.",
    "That said, all of these new LEDs are going to need to be controlled individually - a task that will require a smarter, more efficient processor.",
    "To power it, the brain behind each of these TVs will be Samsung’s new quantum processor that can effectively manage each of these individual LEDs, plus take in ambient light data from a sensor on the TV to automatically raise or lower the brightness of the screen.",
    "That processor will use Multi-Intelligence Deep Learning for upscaling, according to Samsung, that uses up to 16 neural network image databases to properly and precisely upscale content to fill the 8K resolution.",
    "When asked about which specs would make the transition to Neo QLED, Dan Schinasi Director of Product Planning at Samsung basically said, well, everything: “Yes to HDMI 2.1. Yes to 4K at 120Hz. Yes to VRR. Yes to FreeSync Premium … Yes to everything.”",
    "That last bit of news is great for gamers who recently picked up an Xbox Series X or PS5 and are looking for the next great display - with native 4K/120 support with VRR, Neo QLED TVs could be some of the nicest-looking partners for next-gen consoles.",
    "But it’s not just old features making a return on Neo QLED - these TVs will have a few new tricks up their sleeves as well.",
    "“We’re taking things one step further in 2021,” Schinasi said in our interview. “We’re adding two new really cool features ... one is a game bar that you can pull up on demand. You can see your HDR status, you can see your frame rates, you can see if your auto low latency mode is turned on or off and adjust it if that’s your preference. So avid gamers will really appreciate that.”",
    "Everything we heard about Samsung’s Neo QLED TVs is promising - from their higher brightness and better contrast, to their new gaming features and support for 4K/120Hz, there doesn’t seem to be a real weak point to speak of.",
    "If Samsung can really deliver on all of the above at a price that doesn’t destroy the bank - and that’s a big if considering the cost of the Samsung Q950TS began at $12,999 / £11,999 for the 85-inch model that was available in the US and UK just one short year ago - it might remove OLED's foothold as the go-to cinephile screen.",
    "Unfortunately Samsung isn’t saying how much its new Neo QLED TVs are going to cost ahead of CES 2021, but if they can keep in line with the company’s 2020 models - the Samsung Q90T and Samsung Q80T - there’s every reason to believe that Neo QLED is exactly the TV cinephiles and gamers have been waiting for."
  ],
  "headers": {
    "4": "Neo QLED: brighter screens with better contrast",
    "8": "All the specs: HDMI 2.1 for 4K/120, VRR, ALLM",
    "12": "Neo QLED: is this the chosen one?"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "QLED TV": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "The Wall": "https://www.techradar.com/news/samsung-the-wall-microled-tv",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "Samsung Q950TS": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "Samsung Q90T": "https://www.techradar.com/reviews/samsung-q90t-qled-tv",
    "Samsung Q80T": "https://www.techradar.com/reviews/samsung-q80t-qled-tv"
  }
}