{
  "source": "https://www.techradar.com/news/solarwinds-hack-was-carried-out-from-within-us",
  "title": "SolarWinds hack 'carried out from within US'",
  "category": "computing",
  "updated": "2021-02-18T12:39:27Z",
  "author": "barclay-ballard",
  "summary": "But Russian actors are reportedly still to blame",
  "article": [
    "The latest evidence from the investigation into the SolarWinds hack suggests that the attack was carried out from within the US - but it is still believed that Russia was ultimately responsible for the cyberattack.",
    "In a press briefing, Deputy National Security Advisor Anne Neuberger explained that the investigation into the SolarWinds hack was still in its “beginning stages.” Since the attack came to light in December last year, more information has come to light gradually. As well as multiple private companies being affected, nine federal agencies were also compromised.",
    "Although it is not currently clear how the SolarWinds attack was carried out, Neuberger was able to confirm that it was launched from within the US. It has been suggested that a domestic attack may have made it more difficult for US cybersecurity teams to identify the hack, as they often focus on international threats.",
    "The SolarWinds hack has been called the “largest and most sophisticated attack the world has ever seen.” The breach involved SolarWinds Orion network monitoring software, which is used by an estimated 18,000 customers. Among these, it is believed that a smaller number of targets were subjected to follow-up intrusions.",
    "Among the most worrying developments is the number of government agencies that have fallen victim to the SolarWinds hack. Although not all of the names of the affected government bureaus have been shared, it is known that the US Department of Energy and the National Nuclear Security Administration were both targeted.",
    "Among more recent revelations concerning the hack, it was revealed that thousands of software developers were likely to have been involved and that 4,032 lines of code were used. With the investigation ongoing, it is likely that further disclosures will be forthcoming soon.",
    "Via Bloomberg"
  ],
  "headers": {
    "3": "The investigation continues"
  },
  "links": {
    "SolarWinds": "https://www.techradar.com/reviews/solarwinds-service-desk",
    "network monitoring": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "software developers": "https://www.techradar.com/best/best-mobile-app-development-software",
    "lines of code": "https://www.techradar.com/best/best-school-coding-platform",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-02-17/solarwinds-hacks-perpetrated-from-inside-u-s-white-house-says"
  }
}