{
  "source": "https://www.techradar.com/news/streamlabs-unveils-website-builder-with-built-in-tipping",
  "title": "This new mobile website builder comes with built-in tipping",
  "category": "computing",
  "updated": "2021-02-24T16:19:59Z",
  "author": "mayank-sharma",
  "summary": "New Streamlabs website builder tool is free to use and includes analytics as well",
  "article": [
    "Live streaming software firm Streamlabs has launched a mobile website builder tool that can put up a tipping feature on the landing page.",
    "The tipping feature in Streamlabs new all-in-one bio link tool dubbed Willow will not just showcase their portfolio but is also designed to help them generate more revenue by allowing their audience to tip directly through the page.",
    "Talking about Willow, Ashray Urs, Head of Product at Streamlabs, said that the new tool gives content creators “a central hub to showcase who they are, [while] improving brand awareness and monetization.”",
    "Underlining the need for the tool, Streamlabs notes that social media platforms like Twitter, Instagram, TikTok, and others usually only allow their users to include one URL in the bio.",
    "This limitation, together with the user’s need to showcase their full online presence, has given rise to several all-in-one platforms and website builders.",
    "The unique aspect of Willow is the ability to toggle on a Tips feature from the website builder’s interface. This will place a Donate! Button on the user’s profile, which when pressed will automatically deposit tips into the user’s linked PayPal account.",
    "Streamlab assures that it doesn’t take a cut from the tips, while speaking to TechCrunch.",
    "In a blog post announcing the tool, Streamlabs says that Willow is free to join and comes with pre-designed themes along with some useful analytics to allow users to see the number of clicks as well as which platforms their audience has clicked on.",
    "The company also notes that in the future they’ll offer a $5/month Pro version of Willow that will offer additional themes, and enhanced analytics.",
    "Via: TechCrunch"
  ],
  "headers": {
    "3": "Available for free"
  },
  "links": {
    "streaming": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "portfolio": "https://www.techradar.com/news/best-website-builder-portfolio",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "TechCrunch": "https://techcrunch.com/2021/02/23/streamlabs-launches-a-link-in-bio-website-builder-that-includes-tipping/"
  }
}