{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-s22-could-land-this-year",
  "title": "The Samsung Galaxy S22 could land this year",
  "category": "phones",
  "updated": "2021-09-28T08:58:30Z",
  "author": "james-rogerson",
  "summary": "A December date",
  "article": [
    "The Samsung Galaxy S22 is probably landing soon, with most leaks suggesting it’s coming in January, but we’ve now heard that it might actually land even sooner than that.",
    "That’s according to Ice Universe (a prolific leaker with a good track record), who tweeted that “if S22 decides to release in December, it is reasonable to cancel S21 Fe.”",
    "That’s referring to the recent reports that the Samsung Galaxy S21 FE – a phone we were expecting to see imminently – might have been canceled.",
    "So it seems that Ice Universe is suggesting Samsung might have canceled the Galaxy S21 FE specifically to clear the way for the Samsung Galaxy S22 range.",
    "It’s worth noting that, from the wording of the tweet, it’s not clear whether Ice Universe actually has inside information, or whether they’re just speculating, but it would be an odd thing to speculate given that this is the first we’ve heard of a December launch for the Samsung Galaxy S22 range.",
    "There would be some logic to launching the Samsung Galaxy S22 range in December. With the Samsung Galaxy Note 21 and perhaps also the Galaxy S21 FE canceled, Samsung’s late-year smartphone slate is emptier than usual, especially for those who can’t stomach the cost of a foldable phone.",
    "So getting some high-profile new models out to fill the gap could make sense. It would also give the company some shiny new handsets to tempt Christmas buyers, and with the Samsung Galaxy S22 Ultra (or Note 22 Ultra as it might be called) potentially acting as a replacement for the Note 21, it would also make sense to launch that sooner rather than later.",
    "On the other hand, it would seem strange to launch two Galaxy S generations in a single year, and might also prove confusing to buyers. Plus, while Samsung could be chasing Christmas sales, a December launch would seem a little late for that.",
    "So for now we’re skeptical that we’ll see the Samsung Galaxy S22 range this year, but we wouldn’t completely rule it out either."
  ],
  "headers": {
    "5": "Analysis: will Samsung release the S22 in December?"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Ice Universe": "https://twitter.com/UniverseIce/status/1442306147071922180",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "might have been canceled": "https://www.techradar.com/news/apparently-even-samsung-doesnt-know-if-the-galaxy-s21-fe-is-coming-out",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "as it might be called": "https://www.techradar.com/news/samsung-galaxy-s22-and-s22-renders-leak-out-hint-at-a-galaxy-note-22-ultra"
  }
}