{
  "source": "https://www.techradar.com/news/tsmc-5nm-chip-bad-news",
  "title": "TSMC's latest 5nm production is at max capacity. Here's why that's bad news",
  "category": "computing",
  "updated": "2021-08-05T21:57:19Z",
  "author": "john-loeffler",
  "summary": "Chips are rolling off the line as fast as they can – but not fast enough",
  "article": [
    "TSMC appears to be running its advanced 5nm production lines at full capacity and may even be forced to prioritize more \"lucrative\" clients due to the ongoing semiconductor shortage.",
    "According to Wccftech, Apple has contracted with TSMC to use its N5P node to produce its A15 Bionic chip that will power the upcoming iPhone 13. Apparently, Apple has placed an order for up to 100 million 'Bionic' chips from TSMC, so considering the ongoing semiconductor shortage, that doesn't leave much capacity for the incredibly high demand for silicon across pretty much every sector.",
    "What's more, the Taiwanese firm looks like it's completely booked for its 3nm node as well. With the company's fabrication facilities running at full tilt, companies like Qualcomm have had to turn to Samsung to produce its latest Snapdragon chips, which puts further strain on Samsung's fabrication capacity.",
    "News that TSMC is running at full capacity on some of its most in-demand nodes shouldn't surprise anyone given the ongoing silicon shortage. Demand for tech products has only increased in the past year and a half as the coronavirus pandemic forced more consumers than anticipated to turn to high-tech solutions for everything from remote work and school to entertainment.",
    "The pandemic also made it much harder to produce the necessary hardware components to power much of this tech, which has just made the inevitable tech shortage that much worse.",
    "We've already seen laptop manufacturers make a turn away from lower-profit Chromebooks towards the higher-margin Windows 11 laptops to be released later this year. This is no doubt a reflection of the reality that if you can only get so many semiconductor components, you're going to prioritize those that will let you make the most money overall.",
    "This latest news might be focused on mobile CPUs rather than the Apple M1 chip used in the new MacBook Air, 13-inch MacBook Pro, and 24-inch iMac, but there's almost certainly increased pressure to produce those chips as well, since Apple relies on TSMC for those as well.",
    "This is bad news for anyone who doesn't have the gobs of money to throw around like Apple does. Even bigger names like AMD and Nvidia are going to have to fight that much harder to get the semiconductors they need to power their CPUs and GPUs.",
    "Fighting for attention from TSMC is going to be an increasingly expensive proposition until fabrication capacity ramps up across the industry, something that can't happen until new plants come online and that takes years. Needless to say, this isn't a problem that looks like it'll be solved any time soon."
  ],
  "headers": {
    "3": "Analysis: competition for silicon is getting fierce as shortage drags on"
  },
  "links": {
    "Wccftech": "https://wccftech.com/tsmc-5nm-facility-at-full-capacity-3nm-booked/",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "laptop manufacturers make a turn away": "https://www.techradar.com/news/chromebooks-set-to-suffer-at-the-hands-of-windows-11-laptops",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "13-inch MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "24-inch iMac": "https://www.techradar.com/reviews/imac-24-inch-2021"
  }
}