{
  "source": "https://www.techradar.com/news/amazon-will-soon-let-you-buy-now-pay-later",
  "title": "Amazon will soon let you buy now, pay later",
  "category": "computing",
  "updated": "2021-08-30T19:04:29Z",
  "author": "anthony-spadafora",
  "summary": "Amazon purchases over $50 can be split into simple monthly payments",
  "article": [
    "Amazon customers will soon be able to buy now and pay for products later as the ecommerce giant has announced a new partnership with the payment network Affirm.",
    "Buy now, pay later services have become increasingly popular among consumers due to the fact that they allow them to spread payments for products over a period of time via installments. In addition to Affirm, other key players in the growing space include Klarna and Afterpay.",
    "As part of their new partnership, Amazon and Affirm are now in the process of making the payment network's service available to select customers though in the coming months, Amazon plans to to make it more broadly available.",
    "Although consumers have been able to buy products and pay for them later using credit cards since the 1950s, late charges and other hidden fees often apply. Affirm on the other hand doesn't charge consumers any late or hidden fees.",
    "Select Amazon customers will soon have the option to split the total cost of purchases of $50 or more into simple monthly payments using Affirm. Customers that are approved to use the service will see the total cost of their purchase upfront and will never pay more than what they agree to at checkout.",
    "SVP of Sales at Affirm, Eric Morse provided further insight on the company's new partnership with Amazon in a press release, saying:",
    "“By partnering with Amazon we’re bringing the transparency, predictability and affordability that Affirm provides today to the millions of people who shop on Amazon.com in the US. Offering Affirm’s alternative to credit cards also delivers more of the payment choice and flexibility consumers on Amazon want.”"
  ],
  "headers": {
    "3": "Buy now, pay later without hidden fees"
  },
  "links": {
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Affirm": "https://www.techradar.com/news/shopify-plans-to-offer-shop-pay-to-any-merchant-on-facebook-or-google",
    "Buy now, pay later": "https://www.techradar.com/news/buy-now-pay-later-services-set-to-soar",
    "Klarna": "https://www.techradar.com/news/klarna-launching-into-consumer-bank-accounts",
    "Afterpay": "https://www.techradar.com/news/square-snaps-up-buy-now-pay-later-service-afterpay",
    "credit cards": "https://www.techradar.com/best/best-credit-card-processing-service",
    "Amazon": "https://www.techradar.com/news/amazon-buys-11-jumbo-jet-to-boost-prime-ecommerce-deliveries",
    "press release": "https://www.affirm.com/press/releases/amazon-partners-with-affirm"
  }
}