{
  "source": "https://www.techradar.com/news/this-july-4th-save-up-to-50-on-certified-refurbished-gear-on-ebay",
  "title": "This July 4th, save up to 50% on Certified Refurbished gear on eBay",
  "category": "news",
  "updated": "2021-06-22T00:38:27Z",
  "author": "sponsored",
  "summary": "Celebrate and save",
  "article": [
    "The fourth of July is almost here once again, and that means it’s time to break out the swim trunks and flip flops, brush off the grill, and get ready for a weekend of good food and fun with friends and family.",
    "It also means it’s a great time of year to save big on Certified Refurbished gear on eBay. From June 21 to June 28, you can save up to 50% on all kinds of goodies,including power tools, electronics, small kitchen appliances, Bluetooth speakers, and more. Plus, for that week only you can take an extra 15% off select items.",
    "For the math-challenged among us, that’s as much as 65% off amazing, like-new gear perfect for anyone in the house.",
    "After months of working from home and not seeing as much of each other as we used to, there’s no doubt that many of us are looking forward to getting outside and responsibly enjoying the summer time together.",
    "Whether you’re looking for outdoor gear to spruce up your barbeque or some things for around the house, the Certified Refurbished store on eBay is the best place to look. You can find the items you want at prices that are quite affordable.",
    "eBay’s Certified Refurbished store guarantees all items will be in like-new condition and each one has been expertly inspected and restored by the manufacturer or a manufacturer approved vendor. For the vast majority of items, they were unused items that were returned then expertly refurbished to guarantee that they work good-as-new.",
    "Everything purchased from the Certified Refurbished store in the U.S. comes with a two-year warranty and a hassle-free 30-return policy. If you don’t like what you ordered or didn’t get what you were hoping for, just send it back within 30 days for a full refund.",
    "All items will come with brand new accessories and manuals and will come in manufacturer-sealed packaging so you’ve got everything you need to start using your gear as soon as you get it.",
    "From June 28 through July 5, eBay will have amazing deals across the Certified Refurbished store for huge Independence Day savings. The great prices on the wide selection of products will get even better for the entire week so be sure to check it out.",
    "If Dad didn’t quite get what he wanted for Father’s Day, or you’re have your eye on something but just haven’t found the price you wanted for it yet, or you just want to stock up on some great new gear and incredible prices, be sure to check out eBay’s Certified Refurbished store from June 21 through July 5."
  ],
  "headers": {},
  "links": {
    "Certified Refurbished": "https://ebay.us/kfkrT3",
    "From June 21 to June 28": "https://ebay.us/AgyOV1",
    "June 28 through July 5": "https://ebay.us/8M4Qdk"
  }
}