{
  "source": "https://www.techradar.com/news/new-amazon-smart-tv-could-be-the-screen-to-buy-this-black-friday",
  "title": "New Amazon smart TV could be the screen to buy this Black Friday",
  "category": "televisions",
  "updated": "2021-11-05T17:22:24Z",
  "author": "henry-st-leger",
  "summary": "Is an Amazon-branded smart TV on the way?",
  "article": [
    "It sounds like Amazon could be pushing even further into the smart TV market, with reports of a first-party screen developed by the retail and technology giant – and it could spell big savings over Black Friday 2021.",
    "Described by Business Insider as “a closely guarded secret at the company,” this Amazon-branded television is reportedly intended to compete more directly with larger-scale TV makers such as LG and Samsung.",
    "Business Insider states that “The models are expected to be big screen TVs in the range of 55 to 75 inches.” The report also says “They are due to be released as soon as October, but the rollout has been beset with logistical bottlenecks” – so it’s possible that the launch could come even later than that during the Black Friday sales.",
    "Amazon is no stranger to partnering with TV makers, having worked with both Toshiba and Insigna for their ranges of screens with a built-in Fire TV platform – not to mention Amazon’s multiple iterations of Fire TV streaming sticks. But this would be the first time that Amazon has released a smart TV solely under its own name (outside of the AmazonBasics TV it sells in India), rather than piggybacking on the authority of existing TV brands.",
    "The sizing of these screens suggests quite a different focus from Amazon, too, targeting larger screen sizes rather than the cheap small TVs usually put out with Toshiba and Insignia.",
    "These screens will unsurprisingly be “Alexa-powered”, using Amazon’s voice assistant for hands-free commands. We expect we could see a version of the Alexa Voice Remote bundled in, given it also comes with Amazon’s Fire TV streaming devices.",
    "Only the US market is mentioned for now, though we expect Amazon has its eyes on the global market beyond an initial North America launch too.",
    "Of course, the timing of this prospective launch wouldn’t be accidental. Amazon has a long reputation for flash sales on its own-brand devices, especially over the annual Prime Day sales.",
    "But with Black Friday coming in late November, a launch shortly before the year’s biggest technology deals event seems like perfect timing – allowing Amazon to steal some thunder and introduce its own smart TV range to the market amid a flurry of discounts and sales.",
    "We expect even the 75-inch TV model will be semi-affordable for that size, likely under the $1,000 / £1,000 / AU$1,500 mark – with smaller models possibly half that amount in the sales.",
    "There’s a danger of Amazon’s TVs failing to offer sufficient picture quality, especially at larger screen sizes – which tend to make any picture defects more glaring and noticeable. If the entire range is filled with edge-lit screens and cheap processors, even the Fire TV interface won’t elevate its offering above any other budget TV range on the market.",
    "As ever, though, Amazon is as much a marketplace as it is a manufacturer, and it’s ability to push its own products front and center, or undercut the competition on pricing in order to gain sales momentum, means an Amazon own-brand smart TV will likely fare better than some.",
    "We've yet to hear directly from Amazon on the matter, and don't necessarily expect to until the company is ready to unveil the smart TV – if it even exists. But we'll let you know as and when Amazon responds to our request for comment."
  ],
  "headers": {
    "7": "Sale away"
  },
  "links": {
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Business Insider": "https://www.businessinsider.com/amazon-close-to-launching-its-own-tv-in-the-us-2021-9?utmSource=twitter&utmContent=referral&utmTerm=topbar&referrer=twitter&r=US&IR=T",
    "LG and Samsung": "https://www.techradar.com/news/samsung-vs-lg-tv-which-tv-brand-is-better",
    "Black Friday sales": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "small TVs": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660",
    "streaming devices": "https://www.techradar.com/best/streaming-device",
    "Prime Day sales": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "75-inch TV": "https://www.techradar.com/news/best-75-inch-4k-tvs"
  }
}