{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-could-improve-one-of-the-galaxy-s21s-surprisingly-weak-specs",
  "title": "Samsung Galaxy S22 could improve one of the Galaxy S21's surprisingly weak specs",
  "category": "phones",
  "updated": "2021-07-16T08:21:40Z",
  "author": "tom-bedford",
  "summary": "Perhaps a decent charging speed",
  "article": [
    "If you compare the charging speeds of top Android phones, the Samsung Galaxy S21 will stick out like a sore thumb, with its 25W powering relatively glacial compared to the 55W of the Xiaomi Mi 11 or 65W of the OnePlus 9, Realme GT and Oppo Find X3 Pro.",
    "That could change with the Samsung Galaxy S22 though, as a major leaker has suggested Samsung could bring an improved powering speed. Posting on Chinese social media platform Weibo, leaker Ice Universe stated \"S22 is testing the charging power above 25W, 45W or 65W\".",
    "The meaning of this post isn't exactly cryptic - apparently, Samsung is looking at either 45W or 65W charging for its next top-end smartphone series, which would bring the Galaxy S22 more in line with its competition.",
    "The Samsung Galaxy S21 takes over an hour to power its 4,000mAh battery to full, with the S21 Ultra needing over two hours to fill its 5,000mAh battery. We've tested several phones with 4,500mAh batteries and 65W charging, and it took them about 40 minutes to get from empty to full, so it's clear that quicker charging speeds would be a benefit to the S22 series.",
    "It's worth pointing out that Samsung is no stranger to faster charging, as the Galaxy S20 Ultra had 45W, but since then the company has stuck to 25W with its flagships.",
    "Samsung wouldn't be able to simply increase the charging speed on the Galaxy S22 and call it a day though, as there are drawbacks to faster powering. Namely, if a phone is plugged in when it's already fully charged, this can damage the battery.",
    "Faster powering on a handset means the charging period is shorter, and therefore the damaging time is longer (well, it's a bit more complicated than that, but we're simplifying it for you).",
    "For faster charging to work well on the phone, Samsung would need to introduce some preventative measures to ensure battery health.",
    "One of these could be smart charging, a tactic Sony and Oppo use in their phones. With smart charging, you set a time when you need the phone to be full, and plug the device in - it'll only start powering up when there's just enough time to get to 100%, so the battery isn't getting overcharged. This is super useful for overnight charging, as it can mitigate hours of potential battery harm.",
    "Another option is trickle charging, so when the phone is plugged in and at 100% charge, the charger will only provide enough battery to compensate for the power the handset is naturally using, therefore keeping it at full power but not overcharging.",
    "Faster charging for the Samsung Galaxy S22 is definitely a good thing - 25W is just too slow for a top-end phone - but the new feature will only work well if it's implemented smartly.",
    "We'll have to see what Samsung chooses to do, before we know for sure though. The handset is expected to launch in January or February 2022, so we've got a while to wait."
  ],
  "headers": {
    "5": "Another Galaxy S22 change"
  },
  "links": {
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Ice Universe": "https://m.weibo.cn/detail/4659129220073782",
    "S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review"
  }
}