{
  "source": "https://www.techradar.com/news/oneplus-nord-2-5gs-likely-design-and-color-shown-off-in-a-new-render",
  "title": "OnePlus Nord 2 5G’s likely design and color shown off in a new render",
  "category": "phones",
  "updated": "2021-07-19T09:49:10Z",
  "author": "james-rogerson",
  "summary": "Dressed in red",
  "article": [
    "The OnePlus Nord 2 has leaked enough that we have a good idea of what to expect from it, but just in case you were in any doubt as to the likely design, a new render has emerged, providing a close look at both the front and back of the phone.",
    "Shared by Evan Blass, this render is either unofficial or leaked, so we’d take it with a pinch of salt. But Blass has an excellent track record for leaks, and the render exactly lines up with previous leaks, and also with an official teaser.",
    "There’s a punch-hole camera in the top left corner of the flat screen, generally slim bezels, with a slightly larger one below the display, and a triple-lens camera on the back.",
    "The only thing actually new here is the color, with the OnePlus Nord 2 5G shown in a red shade. The only other colors we’ve seen so far are grey/silver and green, so those might be among the colors the Nord 2 is offered in.",
    "It’s worth noting also that while the phone is referred to as the OnePlus Nord 2 5G here, we wouldn’t expect there to be a 4G model as well.",
    "We know the OnePlus Nord 2 is being officially announced on July 22, so there’s not long to wait until we get confirmation of all the details, but with most things having either leaked or been revealed early by OnePlus we’re not expecting many surprises.",
    "The company has confirmed, for example, that the Nord 2 has a 6.43-inch AMOLED screen with a 90Hz refresh rate, and that it will be powered by a MediaTek Dimensity 1200-AI chipset. Leaks meanwhile point to a 50MP main camera, an 8MP or 16MP ultra-wide one, and a 2MP depth sensor, along with a 4,500mAh battery."
  ],
  "headers": {},
  "links": {
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "Evan Blass": "https://twitter.com/evleaks/status/1417043437275201538",
    "an official teaser": "https://www.techradar.com/news/oneplus-nord-2-looks-surprisingly-like-the-oneplus-9-in-official-images",
    "are grey/silver": "https://www.techradar.com/news/oneplus-nord-2-leaked-renders-look-a-lot-like-the-oneplus-9-pro",
    "has confirmed": "https://www.techradar.com/news/oneplus-nord-2-screen-specs-confirmed-but-dont-expect-huge-changes",
    "powered by a MediaTek Dimensity 1200-AI chipset": "https://www.techradar.com/news/oneplus-nord-2-is-real-company-confirms-in-a-surprise-announcement",
    "a 4,500mAh battery": "https://www.techradar.com/news/oneplus-nord-2-could-fix-its-predecessors-biggest-weaknesses"
  }
}