{
  "source": "https://www.techradar.com/news/resident-evil-village-at-8k-can-the-nvidia-rtx-3090-handle-the-horror",
  "title": "Resident Evil Village at 8K: can the Nvidia RTX 3090 handle the horror?",
  "category": "gaming",
  "updated": "2021-05-08T11:00:33Z",
  "author": "matt-hanson",
  "summary": "Resident Evil Village is a great PC port, but how does it run at 8K?",
  "article": [
    "Resident Evil Village is the latest entry in the iconic horror series, and not only did we love the game in our review, we've also been impressed with how well the game runs on PCs, with even lower powered graphics cards like the RTX 3060 putting in a fantastic performance.",
    "The fact that it runs so well on PC, while also looking mightily impressive and supporting atmospheric effects like ray tracing, has meant we couldn't wait to try it out at 8K.",
    "We've tested a range of modern games such as Cyberpunk 2077 and Watch Dogs: Legion at the demanding 7680 x 4320 resolution, and even the mighty RTX 3090, currently the most powerful gaming GPU on the market today (if you can find one), struggled to reach acceptable frame rates without some serious tinkering.",
    "Hopefully, the fine work Capcom has put into the PC port of Resident Evil Village could give this game a better chance of running at the holy grail of ultra-high definition gaming: 8K at 60FPS. Let's find out how it does.",
    "As usual, we started out our tests with the default settings, which had most things set to 'High', with 8GB of textures, and an overall memory usage of 15GB. The RTX 3090 comes with 24GB of the stuff, so that's not an issue, though even the high-end RTX 3080, with 10GB, won't be able to handle that.",
    "It looked fantastic, but it played... not so well. It actually hit an average of 37.6 fps, which is pretty impressive at 8K on high settings, with even the minimum framerates not going below 30 fps. We usually say that 30 fps is the bare minimum for an enjoyable gaming experience, and so the fact that Resident Evil Village goes above that at 8K on high settings is impressive.",
    "However, 60 fps is our goal here, and the game feels like it was made for that kind of frame rate, so even though 30 fps is acceptable, the game feels sluggish. Also, while most things are set to 'high', ray tracing is off. Turning it on (but keeping it low) didn't impact the frame rates that much, however.",
    "There are lots of display settings to tweak, including textures, which has a number of options that are still labelled as 'high'. By knocking a few options down a single step, while keeping things on 'high' saw a slight fps bump to 38 fps.",
    "Putting textures to the lowest setting that is still labelled 'high', with 0.25GB of memory usage, and an overall usage of 7.4GB (so the RTX 3080 and RTX 3070 can handle it), saw another bump to 42.6 fps. The game still looked great, and it started to feel more responsive as well.",
    "Knocking all settings to medium gave us an average frame rate at 8K of 43.4 fps. However, it's here that the drop in visual fidelity was noticeable, with pop-ins and rougher textures. In a horror game that relies on atmosphere, the bump in frame rates at 8K just didn't seem worth it.",
    "But, could we hit 60 fps at 8K?",
    "No.",
    "Even at lowest settings, we just got 47.5 fps. Turning off all additional graphical features, such as volumetric lighting allowed us to eke out a bit more performance (hitting 52 fps on average), but the hit to the graphics was too much to bear. While it certainly didn't look awful, the game felt lifeless and flat. It feels like you're missing out on an important part of the game, and playing at 8K isn't worth that compromise - especially when any benefits from playing at such a high resolution are diminished when you start drastically lowering texture quality.",
    "The fact that Resident Evil Village looks - and runs - so well at 4K on PC means that this is still the best resolution to play at, as you get gorgeous image quality and atmosphere.",
    "So, after a promising start, Resident Evil Village needs too many compromises to play at 8K, unless you're happy with 30 fps on a PC that costs well over $2,000."
  ],
  "headers": {
    "4": "Resident Evil Village 8K performance"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "how well the game runs on PCs": "https://www.techradar.com/news/resident-evil-village-pc-performance-the-almost-perfect-pc-port-we-all-needed",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Cyberpunk 2077": "https://www.techradar.com/news/cyberpunk-2077-at-8k-shows-that-nvidias-dlss-tech-is-the-ultimate-hack",
    "Watch Dogs: Legion": "https://www.techradar.com/news/can-the-nvidia-rtx-3090-run-watch-dogs-legion-at-8k"
  }
}