{
  "source": "https://www.techradar.com/news/latest-amazon-echo-dot-sees-return-to-lowest-price-yet-at-amazon",
  "title": "Latest Amazon Echo Dot now just $29.99 for a limited time",
  "category": "smart-home",
  "updated": "2021-04-30T14:38:49Z",
  "author": "tabitha-baker",
  "summary": "The cheapest price since Black Friday",
  "article": [
    "Amazon Echo Dot deals are returning to some record low prices this weekend, in a discount we haven't seen since last year's Black Friday deals. For a limited time you'll find the fourth generation smart speaker available for just $29.99 (was $49.99), but we don't know just how long this offer will last and stock will certainly start moving quickly once word gets around.",
    "The brand new Echo Dot offers all the Alexa smart speaker functionality of previous models, but in a completely new, larger, shell that offers richer sound quality. The newer model also features the AZ1 Neural Edge chip that will speed up Alexa's responses as well.",
    "However, aside from a design change, slight boost in audio, and a new processor, the function of the Amazon Echo Dot does remain unchanged from the third generation. If you'd prefer to spend as little as possible, then, you'll find the previous model on sale for $24.99 (was $39.99).",
    "You're getting the cheapest price we've seen so far, and 2021's best discount so far. That's perfect if you missed out on those early savings, as this model has only dropped down to $35 in sales since.",
    "Not in the US? Scroll down for more Amazon Echo deals in your region.",
    "We're rounding up all the latest cheap smart home device deals right here on TechRadar, but if you're looking at Google's ecosystem you'll need to take a look at the latest Google Home prices as well. Of course, we're expecting more offers to spring up in the upcoming Amazon Prime Day deals as well so stay tuned for more."
  ],
  "headers": {
    "5": "More Amazon Echo Dot deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "for just $29.99 (was $49.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fall-new-Echo-Dot%2Fdp%2FB07XJ8C8F5%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8099534754194914000-20",
    "for $24.99 (was $39.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FEcho-Dot-3rd-Gen-Sandstone%2Fdp%2FB07PGL2N7J%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1934544875718874600-20",
    "Amazon Echo deals": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals",
    "cheap smart home device deals": "https://www.techradar.com/news/the-best-cheap-smart-home-gadgets-of-2019",
    "Google Home prices": "https://www.techradar.com/news/google-home-prices-deals",
    "Amazon Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}