{
  "source": "https://www.techradar.com/news/apple-bans-apps-offering-you-rewards-for-switching-off-ios-145s-app-tracking",
  "title": "Apple bans apps offering you rewards for switching off iOS 14.5’s app tracking",
  "category": "phones",
  "updated": "2021-04-28T10:54:59Z",
  "author": "hamish-hector",
  "summary": "No tricks or treats",
  "article": [
    "Apple’s iOS 14.5 update is finally out and one of the most talked-about features is app tracking transparency. Now Apple has announced that any apps that reward you for turning on data tracking will be banned from the App Store.",
    "App tracking transparency is a new data privacy feature that will let you control how apps track you when you aren't using them. The apps can still track you on their own platform, but not what you do on others without asking first.",
    "However, blocking tracking will most likely negatively affect the finances for many developers, so offering an incentive to accept is in their best interests. Apple’s new Human Interface Guidelines should protect you from any apps hoping to manipulate you into being tracked.",
    "The idea of allowing an app to follow you around as you use your iPhone or iPad isn’t the most appealing, but are there any incentives to want to opt in to app tracking?",
    "Given that apps can’t reward you, the main draw will be more relevant content. If an app wants to show you an advert or highlight a post, having an accurate idea of what you’d be interested in will let them show you something you actually want to see.",
    "However, there are arguments that they could still build a picture of you from within their own app, and who really cares if an advert is relevant or not? We’ll have to wait and see how companies react and cope with the change, but hopefully, these privacy options will appear on Android handsets soon.",
    "If you’re especially worried about tracking, particularly on non-Apple devices, check out our best VPN guide for tools to help protect your privacy."
  ],
  "headers": {
    "3": "Why should I opt in to app tracking?"
  },
  "links": {
    "Apple’s iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "app tracking transparency": "https://www.techradar.com/news/what-is-app-tracking-transparency-on-iphone-ios-145s-big-update-explained",
    "Human Interface Guidelines": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1234971287220356600&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fdesign%2Fhuman-interface-guidelines%2Fios%2Fapp-architecture%2Faccessing-user-data%2F",
    "best VPN guide": "https://www.techradar.com/vpn/best-vpn"
  }
}