{
  "source": "https://www.techradar.com/news/samsung-galaxy-book-pro-available-for-preorder-with-huge-discount-plus-free-galaxy-buds-pro",
  "title": "Samsung Galaxy Book Pro available for preorder with huge discount plus free Galaxy Buds Pro",
  "category": "computing",
  "updated": "2021-12-03T08:15:07Z",
  "author": "alex-whitelock",
  "summary": "Big trade-in savings plus some great freebies",
  "article": [
    "Two stunning new ultrabooks - the Samsung Galaxy Book Pro and Samsung Galaxy Book Pro 360 - have just dropped for pre-order over at the official Samsung Store this week and there are already some great savings (and freebies) up for grabs.",
    "Normally retailing for $1,099 and $1,299 respectively, both laptops are available with a huge potential saving of up to $549 off with a trade-in plus a free pair of Galaxy Buds Pro - premium wireless earbuds that are worth $179 by themselves. You can, if earbuds aren't your thing, also get a $150 Samsung Store voucher instead. Note, we've listed USD prices here, but these same deals are available on the UK store page.",
    "Specs on the Samsung Galaxy Book Pro range include an 11th gen Intel Core i5 processor, 512GB SSD, and 8GB of RAM on the baseline Pro model and an 11th gen Core i7 on the Pro 360 model. Both models are available in 13.3-inch and 15.6-inch form factors with options for 16GB of RAM and feature what Samsung is touting as 'Super' AMOLED displays. As you'd expect, the 360 model has a touchscreen and is able to be converted into either a premium tablet or ultrabook.",
    "While we haven't got our hands on the Samsung Galaxy Book Pro range just yet, they do look absolutely stunning and potentially serious challengers to the current ultrabook kings - the Dell XPS 13 and the HP Spectre x360. As we all know, Samsung is a real leader when it comes to displays, but at just 0.47-inches thick and just 3.1 pounds in weight, the new Samsung Galaxy Book Pro are also looking like very slick machines indeed.",
    "Need something a little cheaper? See the best laptop deals in your region just below.",
    "Looking for something cheaper? Check out our page on this week's best cheap laptop deals. Also recommended are this week's best Dell XPS 13 deals.",
    "Also, check out our review of the Samsung Galaxy Book Ion right here"
  ],
  "headers": {
    "5": "Samsung Galaxy Book Pro deals"
  },
  "links": {
    "UK store page": "https://www.awin1.com/awclick.php?awinmid=17946&awinaffid=103504&clickref=trd-us-7678896462670788000&p=https%3A%2F%2Fwww.samsung.com%2Fuk%2Fpc%2Fgalaxy-book%2Fgalaxy-book-pro%2Fbuy%2F",
    "best cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "Dell XPS 13 deals": "https://www.techradar.com/news/dell-xps-13-deals",
    "Samsung Galaxy Book Ion": "https://www.techradar.com/reviews/samsung-galaxy-book-ion-review"
  }
}