{
  "source": "https://www.techradar.com/news/steam-next-fest-is-coming-in-june-with-hundreds-of-game-demos",
  "title": "Steam Next Fest is coming in June with 'hundreds' of game demos",
  "category": "gaming",
  "updated": "2021-03-24T18:02:27Z",
  "author": "emma-boyle",
  "summary": "The event formerly known as Steam Game Festival",
  "article": [
    "Steam Next Fest is Valve’s newly revealed “multi-day celebration of upcoming games” and it’s scheduled to take place in June 2021.",
    "Previously known as Steam Game Festival, Steam Next Fest is set to feature “hundreds of game demos”, “oodles” of developer livestreams as well as conversations with development teams about the games they’re developing that are coming to Steam in the near future. According to Valve, the event has been renamed “to more directly communicate its focus” on upcoming games.",
    "Valve's digital event will kick off on June 16 and will run through to June 22. The last Steam Game Festival took place in February 2021 and offered access to 500 demos for free. Though Valve has confirmed there will, once again, be hundreds of demos to choose from, an exact number hasn't been given just yet. That’s likely to be confirmed closer to the time.",
    "With Steam Next Fest now confirmed, June has the potential to be a very busy month for game fans.",
    "Although E3 2021 has been cancelled in a physical sense once again, there are reports that the ESA isn’t ready to abandon the event entirely this year. According to a report from VGC, there are proposals for E3 2021 to take place digitally over three days between June 15 and June 17 - right at the same time as Steam Next Fest. This digital E3 would apparently also see demos release online, as well as “keynote sessions from games partners, an awards show, a June 14 preview night and other smaller streams from games publishers, influencers and media partners.”",
    "That’s not to mention Geoff Keighley’s Summer Game Fest which has the potential to take place at this time too. 2020’s Summer Game Fest ran over the course of four months, though Keighley has said on Twitter that the next iteration is likely to be “more condensed”.",
    "So, while there’s going to be a shortage of in-person events in 2021 it’s unlikely that there’s going to be a shortage of exciting games news."
  ],
  "headers": {
    "3": "June looks busy"
  },
  "links": {
    "newly revealed": "https://store.steampowered.com/sale/nextfest",
    "The last Steam Game Festival": "https://www.techradar.com/news/test-over-500-games-on-steam-for-free-in-feb",
    "E3 2021 has been cancelled": "https://www.techradar.com/news/e3-2021-is-reportedly-canceled-but-its-not-gone-for-good",
    "VGC": "https://www.videogameschronicle.com/news/e3-pushes-forward-with-plans-for-a-digital-2021-event/",
    "2020’s Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-to-replace-e3-as-2020s-marquee-gaming-event",
    "said on Twitter": "https://twitter.com/geoffkeighley/status/1358866661940416514?s=20"
  }
}