{
  "source": "https://www.techradar.com/news/qled-vs-uhd",
  "title": "Ultra HD vs QLED TV: what's the difference?",
  "category": "televisions",
  "updated": "2021-06-29T13:57:22Z",
  "author": "jamie-carter",
  "summary": "Why settle for one when you can have both?",
  "article": [
    "Should you buy a QLED TV or an Ultra HD TV? If you’re in the mood for buying a new television you’ve likely come across both of these terms. What do they mean? Do you need them? Is it possible to get both?",
    "To start, most QLED TVs available today are 4K TVs. In fact, all QLED TVs on sale have a minimum 4K resolution, so in practice you can’t have the former without the latter. That said, it is possible to get a 4K Ultra HD TV without QLED – there are plenty of regular LED-LCD and OLED TVs out there, too.",
    "The TV market is beset by purposefully-confusing names for new and hyped-up picture advancements, design overhauls, and new iterations designed to make buying a TV a tick-box exercise. For QLED and Ultra HD, it’s best you know what they are and why you would ever need them.",
    "So here’s the lowdown on exactly what you need to know about QLED, Ultra HD, and where they sit in the TV market.",
    "QLED, if you've never heard of it before, is basically a souped-up LED-LCD TV of the kind that have been around for decades.",
    "QLED stands for quantum-dot light-emitting diode. Although Samsung makes a lot of different kinds of TVs, QLED TV is its mass-produced premium panel technology, as you can see if you examine this year’s new Samsung TVs.",
    "On the other hand, Ultra HD is a TV feature found across the board on new TVs of about 40-inches in size. Short for 'ultra high definition', Ultra HD usually refers to TVs with a 4K resolution. You’ll hear people referring to Ultra HD TVs and 4K TVs, but they're exactly the same thing.",
    "In terms of sharpness they’re now firmly in the mainstream, having taken over from softer full HD TVs, but not as detailed as next-generation 8K TVs.",
    "For now, Ultra HD 4K TVs are the sweet spot for big screen TVs both in terms of technology and price, though whether you also go for QLED is more complicated. For example, Samsung manufacturers 4K QLED TVs, but also 4K LED TVs, Micro LED TVs and the rather confusingly-named Neo QLED TVs (QLED, but with a Mini LED backlight).",
    "“Ultra HD” refers to a 4K digital cinema standard, while “4K” tends to be used for consumer-grade TVs for the home. Either way, 4K is now the most common pixel resolution for a TV. Ultra HD TVs use a panel with 3840 x 2160 pixels, which is known as 2160p, but also as 4K because of images are almost 4,000 pixels wide.",
    "Yes – if only because it will be a default feature on almost every TV from about 40-inches in size and larger – unless you go for a very expensive 8K model or a very small TV. So unless you’re looking for a 32-inch TV, perhaps for a bedroom, you’re almost certainly going to be looking for an Ultra HD 4K TV.",
    "Though native 4K sources of content are few, they’re now growing quickly. You'll find native 4K content on Netflix, Amazon Prime Video, Disney Plus, Hulu, Rakuten TV, and other TV streaming services land as well as Ultra HD Blu-ray Discs, while Apple TV 4K, PlayStation 4 Pro, PlayStation 5 and the Xbox Series X all deal in native 4K content.",
    "QLED TVs use a ‘quantum dot’ filter. Made from ultra-small semi-conductor particles that can be precisely controlled, these quantum dot filters can be very precisely controlled for color output, essentially helping to create a brighter image and a broader colour spectrum.",
    "So if you see a 4K LED TV and a 4K QLED TV, the rule of thumb says that the QLED TV is going to be better in terms of colour accuracy. Although most QLED TVs are sold by Samsung, it does also supply them to TCL and Hisense.",
    "OLED vs QLED is an oft-asked question asked by those wanting to buy a premium TV, but it’s largely based on a misunderstanding of what a QLED TV is. QLED’s close-in-the-alphabet name makes it seems like a straight-up alternative to OLED (organic light-emitting diode) technology, but they are radically different.",
    "The pixels in a QLED TVs are illuminated by an old-fashioned backlight (either direct LED backlighting and edge-lighting). Consequently, QLED TVs don’t show black areas of images as well as OLED TVs do. That’s because OLED TVs control each individual pixel, and they’re thinner, to boot. OLED TVs also give much superior viewing angles, more fluid fast motion and better black levels, meaning they're generally better for movies.",
    "However, QLED TVs excel when used in brightly-lit rooms, and for desktop PC monitors and laptops. The QLED vs OLED questions remain because it pits Samsung – the only manufacturer of QLED panels – against LG, the only manufacturer of OLED panels, which supplies them to the likes of Sony, Panasonic and Philips.",
    "As you may have noticed, Samsung employs armies of marketing creatives to come up with bamboozling terminology, the latest of which is Neo QLED. Found in Samsung's 2021 TV range, it’s Samsung’s own name for something that a lot of TV makers are using – Mini LED. Mini LED TVs use a ‘micro layer’ over the backlight to guide the light of the Mini LEDs through the same quantum dots used in QLED TVs. The end result is more control over brightness control.",
    "Micro LED is a brand new (and massively expensive) TV panel technology that threatens to banish QLED to history … maybe. It’s been around since Samsung airred ‘The Wall’ Micro LED in 2018, though early in 2021 saw the debut of Samsung’s Micro LED TV in 110-inch, 99-inch and 88-inch sizes.",
    "As you might have guessed this new panel technology – which uses pixel-sized LEDs for creating brighter, higher-contrast images with less power – is, for now, all and only about monster-sized TVs that you almost certainly cannot afford. It’s one to watch for the future; get ready for a Micro LED vs OLED debate.",
    "If you’re set on QLED, go for Samsung’s best QLED TVs. For the price, we quite like last year's Samsung Q80T QLED that will set you back $1,199 / £1,099 (around AU$1,500). However, move up a notch and you’ll find that only some of Samsung’s 8K TVs – such as the Q800T and the Q950TS – use QLED panel tech.",
    "If, however, you’re not bothered about QLED and just want a 4K TV, look for the best 4K TVs covering technologies including QLED and OLED, and encompassing brands like LG, Panasonic, Sony and Philips, as well as Samsung."
  ],
  "headers": {
    "4": "What does QLED mean?",
    "6": "What is Ultra HD?",
    "10": "But do you need Ultra HD?",
    "12": "How does QLED work? Is it different than OLED?",
    "17": "What is Neo QLED? Mini LED? Micro LED?",
    "20": "Should you buy a 4K Ultra HD QLED TV?"
  },
  "links": {
    "QLED TV": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Ultra HD TV": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "buying a new television": "https://www.techradar.com/how-to/buy-a-tv",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Ultra HD": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "8K TVs": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "4K QLED TVs": "https://www.techradar.com/news/best-samsung-tv",
    "Micro LED TVs": "https://www.techradar.com/news/micro-led-tv",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "small TV": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Hulu": "https://www.techradar.com/reviews/hulu",
    "Rakuten TV": "https://www.techradar.com/reviews/rakuten-tv-review",
    "TV streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Ultra HD Blu-ray Discs": "https://www.techradar.com/news/video/blu-ray/the-best-4k-ultra-hd-blu-ray-movies-1329414",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "PlayStation 4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "OLED vs QLED": "https://www.whathifi.com/advice/oled-vs-qled-which-best-tv-technology",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Micro LED": "https://www.techradar.com/news/micro-led-tv",
    "The Wall": "https://www.techradar.com/news/samsung-the-wall-microled-tv",
    "Samsung’s Micro LED TV": "https://www.techradar.com/news/heres-when-you-can-buy-samsungs-massive-micro-led-tv",
    "Micro LED vs OLED": "https://www.techradar.com/news/microled-vs-oled-the-battle-of-the-high-end-display-tech",
    "Samsung Q80T QLED": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
    "Q800T": "https://www.techradar.com/reviews/samsung-q800t-8k-qled-tv",
    "Q950TS": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "QLED and OLED": "https://www.techradar.com/news/oled-vs-qled"
  }
}