{
  "source": "https://www.techradar.com/news/this-futuristic-electric-motorcycle-is-built-for-the-moon",
  "title": "This futuristic electric motorcycle is built for the moon",
  "category": "fitness",
  "updated": "2021-10-22T11:41:00Z",
  "author": "jamel-smith",
  "summary": "A lightweight bike to replace conventional rovers",
  "article": [
    "NASA is looking for new rovers for its new Artemis space program, and German design company Hookie thinks it has the perfect solution: a lunar electric motorcycle.",
    "Because the motorbike, called the Tardigrade, has just two wheels, it’s much lighter than a conventional moon buggy.",
    "“A moon buggy requires almost the same space as three to four Tardigrades,” Hookie co-founder Nico Muller told Interesting Engineering. “The weight is much less than that of a complete buggy made out of steel.”",
    "Hookie has used laser-cut aluminum frames to further reduce weight, and Kevlar to protect the motorcycle and drivetrain from the increased radiation in space. That weight and size saving would allow NASA to use much smaller lunar landers, thereby reducing costs and fuel usage.",
    "Although NASA hasn’t invested in it yet, Muller says the agency is aware of the Tardigrade project. “It would be amazing to talk about future collaborations or ideas,” he said.",
    "NASA explored many different types of lunar rovers for earlier Apollo missions, including a type of electric scooter.",
    "This was very different from the futuristic Tron-type motorcycle Hookie has designed, and although NASA went as far as building a prototype, the scooter was scrapped in favor of the four-wheeled electric buggy that’s now symbolic of the space agency’s moon programs.",
    "Via Electrek"
  ],
  "headers": {
    "5": "The lunar scooter"
  },
  "links": {
    "Interesting Engineering": "https://interestingengineering.com/step-aside-moon-buggy-the-worlds-first-moon-motorcycle-concept-is-here",
    "electric scooter": "https://www.techradar.com/best/best-electric-scooters",
    "Electrek": "https://electrek.co/2021/10/21/check-out-this-working-prototype-lunar-electric-motorcycle-for-nasas-moon-exploration/"
  }
}