{
  "source": "https://www.techradar.com/news/microsoft-promises-windows-11-will-be-faster-in-2022",
  "title": "Microsoft promises Windows 11 will be faster in 2022",
  "category": "computing",
  "updated": "2021-11-19T10:37:08Z",
  "author": "darren-allan",
  "summary": "Performance will be an ‘area of focus’ next year, with UI flaws hopefully set to be resolved",
  "article": [
    "Windows 11 has core elements of the desktop interface which are performing disappointingly sluggishly for some users, with Microsoft working on fixes for well-documented issues with File Explorer – and the software giant further promising that it’ll concentrate on improving performance levels in the OS next year.",
    "In a Reddit AMA (‘Ask Me Anything’, meaning a Q&A session) with the Windows Developer team, spotted by Windows Latest, one user commented on a trend towards UI sluggishness continued in Windows 11, to which the Microsoft team responded: “Performance will be an area of focus for us in 2022,” including having UI elements rendering on the screen faster.",
    "The questioner carried on to clarify their main bugbears with poor performance in Windows 11 (and with Windows 10, too), with the central issues being around File Explorer as already mentioned, and the sluggish right click menu which “actually made me go back to [Windows] 10 on my home machines.”",
    "Microsoft replied: “Some of what you mentioned is performance dictated by WinUI, but also some is likely unrelated to anything our team does but still important/valid feedback for Windows as a whole. Internally, in addition to wanting to focus some of our UX framework’s time on [performance] in 2022, we also have a dedicated team formed recently to tackle this topic more holistically.”",
    "Incidentally, those who are suffering any kind of gremlins with Microsoft’s new OS might find it useful to check out our extensive guide on Windows 11 problems and how to fix the most common issues.",
    "Clearly, then, this is an issue Microsoft is taking seriously – as it should be. Anything which makes Windows 11 feel less than responsive when tackling basic tasks like going into folders and browsing through files, or invoking the right click menu, is really not good, and is bound to leave a sour taste in the mouth of users who have upgraded to what (obviously) should be a superior OS.",
    "Going back to Windows 10 because of the performance of the right click menu, as mentioned by the above complainant, really isn’t something that should be happening at all, ever; so this is pretty embarrassing for Microsoft.",
    "While it’s good to hear that performance will be a priority next year, and it’s also laudable that Microsoft is being upfront about what’s going on here, we – and doubtless others – are left wondering exactly how the release version of an OS got shipped with these kind of basic UI issues affecting some users or hardware configurations (particularly lower-end machines, as you might expect)."
  ],
  "headers": {
    "5": "Analysis: Transparency is commendable, but how did this happen in the first place?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "Microsoft working on fixes for well-documented issues with File Explorer": "https://www.techradar.com/news/windows-11-hit-by-another-bug-as-microsofts-file-explorer-nightmare-gets-worse",
    "Reddit AMA": "https://www.reddit.com/r/Windows11/comments/qw7o69/were_the_windows_developer_team_and_were_back_to/",
    "Windows Latest": "https://www.windowslatest.com/2021/11/19/microsoft-windows-11-winui-performance-focus/",
    "responded": "https://www.reddit.com/r/Windows11/comments/qw7o69/were_the_windows_developer_team_and_were_back_to/hl5wsvy/",
    "being around File Explorer": "https://www.techradar.com/news/windows-11-memory-leak-problem-causes-file-explorer-to-eat-ram",
    "Windows 11 problems and how to fix the most common issues": "https://www.techradar.com/how-to/windows-11-problems-how-to-fix-the-most-common-issues",
    "release version of an OS": "https://www.techradar.com/news/how-to-download-windows-11"
  }
}