{
  "source": "https://www.techradar.com/news/final-fantasy-xiv-on-ps5-brought-a-pc-improvement-ive-been-waiting-for",
  "title": "Final Fantasy XIV on PS5 brought a PC improvement I've been waiting for",
  "category": "gaming",
  "updated": "2021-04-13T18:51:15Z",
  "author": "bill-thomas",
  "summary": "Opinion: Finally a nice, clean Final Fantasy XIV user interface",
  "article": [
    "Final Fantasy XIV finally made its way to PS5 today, bringing speedy load times and gorgeous 4K graphics to the MMORPG. But, I play on PC, which means I have been getting those features for a very long time. However with Patch 5.5 – or \"Death Unto Dawn\" if you want to use the cool name – the PS5 version has allowed for 4K UI assets to finally be included in the game.",
    "Now, according to the latest Steam Hardware Survey, only like 2.4% of PC gamers are even using a 4K gaming monitor, so this is a pretty niche complaint right off the bat – but the FFXIV UI has never looked great on a 4K panel. With the new patch, though, it finally does.",
    "That means that text no longer looks pixelated, and all the rounded corners that are ubiquitous in Final Fantasy XIV's UI are nice and smooth. The low-res UI has never been enough to get me to stop playing Final Fantasy XIV for literally a minute, but I love how crisp everything looks now.",
    "If you play Final Fantasy XIV at 4K and you want to see just how good the menus can look, you can go into your graphics settings by hitting escape, choosing System Configuration, then Display Settings. Under the High Resolution UI Settings, you'll see a new \"300% (4K)\" option. Select that.",
    "Now, if you're anything like me, you had your UI built around either the 150% or 200% options, and your screen now probably looks a little like this.",
    "Nobody can play like that, but luckily you can manually adjust scaling for elements of your UI, and they'll look better than ever. If you hit escape and go into HUD Layout, it'll bring up the UI customization overlay. To change the size of anything on your screen, all you have to do is left-click it, then hit the little gear wheel to the right of the \"Current UI Element\" on the HUD Layout window.",
    "There, you can change the size of the Element you're working on, along with transparency and other settings depending on what you're working with. I turned everything down to a 60% size, except for my mini-map and debuffs (because I'm bad at the game). And now the game looks much more manageable.",
    "Despite the fact that the game still doesn't support mods on PC (at least officially), there are still a ton of different ways to change the way the game looks. And with an MMORPG, where the UI is way more actively engaged with than most other types of PC games, getting it just right is super important.",
    "At the end of the day, this is a pretty minor change on PC. It's not like Final Fantasy XIV's UI was illegible or anything before this update, and it's not like this is the thing that was stopping Final Fantasy XIV users on PC from downing Eden's Verse on Savage difficulty. It's just a nice little quality of life change for those of us that are playing on a high-resolution monitor.",
    "It does wonders for the game's presentation, though, especially as new players start to come in as the game gets ready for the launch of its next expansion, Endwalker, later in 2021.",
    "One of the things I love most about this change, though, is how much better cutscenes look now that the text is nice and smooth.",
    "Final Fantasy XIV is a game with a lot of cutscenes, and the only ones that have any voice acting at all are part of the main story quest. However, because a lot of what you'll be doing, particularly at endgame, is side quests, making the text a little easier on the eyes is long overdue.",
    "I used this patch as an excuse to unlock the new Alliance Raid during work hours, and I actually read all the the dialog because it wasn't so pixelated, and the text chat window was nice and large.",
    "Just look at the picture above! That's what I had to deal with when doing these hour-long cutscene sprees just to unlock the latest raid. I skipped so many side stories, and even bits of the main story that I have had friends rave to me about, just because it's so uncomfortable to read such a tiny text box for such a long period of time.",
    "But thankfully, because this patch is basically the end of Shadowbringers, all of the raid content has been added to the New Game Plus mode, so I can replay all of it in comfort, finally.",
    "So, basically, I can thank the PS5 for finally giving me an excuse to jump into all the surely weird and wonderful side quests that Final Fantasy XIV has to offer, and it all came down to scaling the UI for the resolution I play the game at.",
    "Now, pardon me, I have a lot of lore to catch up on so I can finally understand what my friends are talking about without having to ask a bunch of silly questions whenever they're talking about the story.",
    "Actually, who am I kidding, I'm still going to have a lot of ridiculous questions."
  ],
  "headers": {
    "3": "How do you turn it on?",
    "8": "Why does this matter?"
  },
  "links": {
    "Final Fantasy XIV": "https://www.techradar.com/news/live/final-fantasy-14-endwalker-live-blog-come-and-experience-the-launch-with-us",
    "Steam Hardware Survey": "https://store.steampowered.com/hwsurvey/Steam-Hardware-Software-Survey-Welcome-to-Steam",
    "4K gaming monitor": "https://www.techradar.com/news/best-4k-monitors",
    "PC games": "v"
  }
}