{
  "source": "https://www.techradar.com/news/supreme-court-dismisses-oracle-claims-to-jedi-challenge",
  "title": "Supreme Court dismisses Oracle claims to JEDI challenge",
  "category": "computing",
  "updated": "2021-10-05T18:30:56Z",
  "author": "anthony-spadafora",
  "summary": "Oracle's JEDI appeal won't be heard by the Supreme Court",
  "article": [
    "The US Supreme Court has dismissed a challenge put forth by Oracle over the way in which the Pentagon awarded the government's now-canceled Joint Enterprise Defense Infrastructure (JEDI) contract.",
    "The Supreme Court's justices declined to hear the database software company's appeal of a lower court ruling that found Oracle was not financially harmed by any errors made by the Pentagon due to the fact that the company would not have qualified for it in the first place.",
    "According to a ruling from the US Court of Federal Claims, Oracle was unable to fulfill the JEDI contract's requirement of “having at least three commercial cloud-hosting data centers within the US, separated by at least 150 miles, along with various other security standards”.",
    "While the US Defense Department awarded the JEDI contract to Microsoft in 2019, the deal was scrapped in July of this year and a new contract called the Joint Warfighter Cloud Capability (JWCC) that includes both Amazon and Microsoft was put in place instead.",
    "Despite the fact that the JEDI contract no longer existed, Oracle still wanted the Supreme Court to hear its appeal as it said the flaws in the original contract could resurface during the biding process for the new contract.",
    "Oracle first sued the US government in regard to JEDI back in 2018 claiming that it was unfair for the Defense Department to award the contract to a single company. It also took issue with the conflicts of interest in the procurement process as at that time, AWS was trying to recruit a government employee to help with the negotiations.",
    "Oracle provided further insight into the reasons behind its appeal in its complaint, saying:",
    "\"Cases do not become moot simply because a defendant issues a press release claiming to have ceased its misconduct. The government asserts that the Department of Defense mooted this case by cancelling JEDI, the procurement contract that Oracle has challenged...Far from making it 'absolutely clear' that the challenged misconduct will not recur, the Department essentially admits the challenged misconduct will continue – and will continue to prejudice Oracle.”",
    "While Oracle's protests over the JEDI contract have now been thrown out by the US Supreme Court, the company's argument that the Department of Defense mooted its case by canceling the original contract is still sound even though it failed to meet the contract's original requirements.",
    "Via The Register"
  ],
  "headers": {
    "4": "Appealing a canceled contract"
  },
  "links": {
    "Oracle": "https://www.techradar.com/news/oracle-wants-to-drastically-simplify-app-development-with-new-low-code-service",
    "JEDI": "https://www.techradar.com/news/pentagon-is-still-deciding-on-aws-or-microsoft-for-jedi-deal",
    "database software": "https://www.techradar.com/best/best-database-software",
    "ruling": "https://regmedia.co.uk/2020/09/02/2_sept_oracle_vs_usa.pdf",
    "Microsoft": "https://www.techradar.com/news/microsoft-scores-dollar10bn-pentagon-cloud-contract",
    "new contract": "https://www.techradar.com/news/pentagon-cancels-major-jedi-cloud-contract",
    "Defense Department": "https://www.techradar.com/news/us-department-of-defense-just-had-a-massive-vpn-upgrade",
    "AWS": "https://www.techradar.com/news/aws",
    "its complaint": "https://regmedia.co.uk/2021/09/21/supplemental_brief_20_1057_oracle_vs_usa_and_amazon.pdf",
    "The Register": "https://www.theregister.com/2021/10/04/supreme_oracle_jedi/"
  }
}