{
  "source": "https://www.techradar.com/news/nvidia-ampere",
  "title": "Nvidia Ampere: release date, specs and rumors",
  "category": "computing",
  "updated": "2021-03-16T17:51:01Z",
  "author": "bill-thomas",
  "summary": "It's officially the GeForce RTX 3080",
  "article": [
    "With the impressive RTX 3000 series out in the wild, Nvidia Ampere is no longer reserved for data center devices. After months of speculation, it’s officially the architecture behind the Nvidia’s new generation of RTX GPUs that include the RTX 3080, RTX 3070 and the Titan-level RTX 3090. And, so far, things are going swimmingly for the successor to both Volta and Turing.",
    "The RTX 3000 GPUs are delivering staggering performance, with the Nvidia GeForce RTX 3080 delivering impressive 4K gaming prowess and the RTX 3070 offering performance that’s on par with the RTX 2080 Ti at less than half the price. There are newer arrivals as well – newly-released mid-rangers Nvidia GeForce RTX 3060 and Nvidia GeForce RTX 3060 Ti have given the more budget-conscious a reason to upgrade from their previous-generation cards.",
    "Thanks to the RTX 3000 series, Nvidia Ampere is now one of the most exciting Nvidia releases in the mainstream market yet. As Nvidia CEO Jensen Huang puts it, those who’ve been sticking to Pascal until a worthy successor comes along should feel “safe to upgrade now.\"",
    "The company has also been putting in the hours on the A100 GPU, for what should hopefully be a 20x improvement in computing power. With the explosive growth in cloud computing, AI is increasingly integral and important. Whether it’s Amazon building grocery stores that enable instant purchasing when you throw something in your cart, or IoT devices littering your home, or even self-driving cars, more and more computing power is needed. 7nm Nvidia Ampere architecture, as well as the 3rd generation Tensor Cores, are a huge part of that.",
    "Any business needing such hefty computing power should be able to take advantage of the data center GPU, like the DGX A100 which is a rack of eight A100 GPUs costing $1 million. In fact, Google Compute Engine already has. It’s possible that Microsoft, Dell and Amazon have already bought in or will soon.",
    "There’s a lot to know about the Nvidia Ampere architecture so we’ve gathered everything about it on here. Read on, and keep this page bookmarked as we’ll update it as soon as new information and updates land at our desks.",
    "The first wave of the highly-anticipated 3000-series graphics cards has just been launched at the Nvidia September 1 event, somewhat confirming recent rumor alleging that Nvidia will launch three new graphics cards in September.",
    "The RTX 3000 flagship, Nvidia GeForce RTX 3080, is going to be available on September 17 to be followed by the Nvidia GeForce RTX 3090 on September 24. The RTX 3070, which is poised to replace the RTX 2080 Ti, is slated to be released sometime in October, though no official date has been announced.",
    "With the next-generation consoles like the PS5 and Xbox Series X likely launching around November, we certainly expected Nvidia to launch its next-generation GeForce cards around the same time to capitalize on the next-gen gaming hype. Once the cards are actually out, water cooling should be available immediately for early adopters.",
    "The first three GPUs in the RTX 3000 series has just been announced, alongside their respective price tags, and we’re happy to report that two-thirds of them are priced competitively.",
    "This is great news for consumers. These cards will be a hot commodity when they are released, so there's definitely reason for Nvidia to price them even higher than Turing cards. Luckily, and perhaps thanks to AMD, that isn’t the case here.",
    "The Nvidia GeForce RTX 3080, which is apparently twice as fast as the RTX 2080, Starts at $699 (£649, about AU$975) – that’s $100 less than the price of the RTX 2080 when it was first released. The Nvidia GeForce RTX 3070, which apparently is going to be faster than the 2080 Ti, is coming in at just $499 (£469, about AU$680). So, compared to the previous generation, it looks like Nvidia is really coming after AMD in terms of rolling out powerful GPUs that are more accessible in pricing.",
    "As for the RTX 3090, it is unfortunately poised in the premium range with a hefty price tag of $1,499 (£1,399, AU$2,100). Still, considering that Nvidia is calling this the greatest generational jump, and that it’s a triple slot card that’s capable of playing games at 8K, 60fps and is 30-degrees cooler than Titan RTX, it’s not a bad price.",
    "Remember, the Titan RTX rolled out $2,499 (£2,399, AU$3,999), making the RTX 3090 a whopping $1,000 cheaper and only $300 more than the RTX 2080 Ti.",
    "The Nvidia A100, which is also behind the DGX supercomputer is a 400W GPU, with 6,912 CUDA cores, 40GB of VRAM with 1.6TB/s of memory bandwidth. Needless to say, it's kind of a behemoth – but it kind of has to be.",
    "But, it's even more powerful than it lets on. Nvidia is claiming that this GPU is a 20x jump in performance over the last generation, which makes it easy to understand why companies from Amazon Web Services to Microsoft are already jumping in on the action.",
    "But what does that mean for GeForce? Kicking off the Ampere GeForce lineup is the RTX 3070, which will boast 20 Shader-TFLOPS, 40 RT-TFLOPS and 163 Tensor-TFLOPS, alongside 8GB of GDDR6 RAM – and it’s expected to be faster than the 2080 Ti. On the other hand, the RTX 3080, the flagship, will have 10GB of GDDR6X RAM, 30 Shader-TFLOPS, 58 RT-TFLOPS and 238 Tensor-TFLOPS. It will, according to Jensen, double the performance of the RTX 2080.",
    "Finally, the RTX 3090 will have 36 Shader-TFLOPS, 69 RT-TFLOPS and 285 Tensor-TFLOPS, as well as 24GB GDDR6X RAM.",
    "One speculation does point to the existence of a Nvidia GeForce RTX 3080 Ti, whose Asus model may have been leaked recently, having a massive 627mm² die. This further fuels rumors that Nvidia Ampere GeForce GPUs will be based on Samsung's 8nm node, rather than the 7nm TSMC node that the pro-level Ampere chips are based on.",
    "Other GeForce RTX 3000 cards have made an appearance in the rumor mill as well. Speculations that the RTX 3070 Ti will be built on the GA104-400, and up the ante to 3,072 CUDA cores and have GDDR6X memory support.",
    "Either way, with the next generation of games pushing higher resolutions, and with more games with ray tracing hitting the market thanks to the new consoles, you can expect these next graphics cards to be incredibly powerful, especially if they have to go up against AMD RDNA 2 or \"Big Navi\" cards.",
    "The RTX 3080, the first Ampere RTX GPU to hit the streets, is out in the world, and we’ve already put it through its paces. It’s an absolute powerhouse of a graphics card, doubling the performance of its predecessor and even beating the RTX 2080 Super as well as the previously unbeatable RTX 2080 Ti.",
    "Calling this GPU \"fast\" is a bit of an understatement. It delivers excellent 4K gaming performance, consistently running anywhere from 75-100 fps at 4K with maximum graphics settings during our tests. And, that’s while keeping it cool at around 60°C in a closed tower with two 240mm fans serving as intake.",
    "We also tested the MSI RTX 3080 Gaming X Trio, which beats the Nvidia RTX 3080 Founders Edition by about 7% in most 4K game benchmarks. It’s also every overclocker’s dream, touting what could be the best cooling solution in a 3080 and more robust power delivery than the Founders Edition.",
    "With the RTX 3080 already delivering breathtaking performance, it’s certainly a promising start for Nvidia’s RTX 3000 series. We can’t wait to get our hands on the RTX 3070 and the RTX 3090, and take them out for a spin."
  ],
  "headers": {
    "6": "Nvidia Ampere release date",
    "9": "Nvidia Ampere price",
    "14": "Nvidia Ampere specs",
    "21": "Nvidia Ampere performance"
  },
  "links": {
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Nvidia GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "Nvidia GeForce RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "highly-anticipated 3000-series graphics cards": "https://www.techradar.com/news/dont-worry-it-looks-like-nvidia-ampere-may-actually-be-coming-to-geforce-cards",
    "recent rumor": "https://www.techradar.com/news/nvidia-rtx-3000-launch-details-leak-and-amd-could-be-in-big-trouble",
    "water cooling": "https://www.techradar.com/news/nvidia-geforce-rtx-3000-gpus-could-run-very-hot-but-ekwb-is-already-making-water-blocks-to-cool-them",
    "GPUs": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Turing cards": "https://www.techradar.com/news/nvidia-turing",
    "Asus model may have been leaked": "https://www.techradar.com/news/asus-rtx-3080-ti-leak-shows-us-what-a-next-gen-flagship-nvidia-gpu-could-look-like",
    "having a massive 627mm² die": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-could-be-smaller-than-2080-ti-but-dont-panic",
    "AMD RDNA 2": "https://www.techradar.com/news/amd-big-navi",
    "beating the RTX 2080 Super": "https://www.techradar.com/news/nvidia-rtx-3080-vs-rtx-2080-super",
    "MSI RTX 3080 Gaming X Trio": "https://www.techradar.com/reviews/msi-rtx-3080-gaming-x-trio"
  }
}