{
  "source": "https://www.techradar.com/news/sony-fx3-leak-suggests-it-could-be-perfect-partner-for-sony-airpeak-drone",
  "title": "Sony FX3 leak suggests it could be perfect partner for Sony Airpeak drone",
  "category": "cameras",
  "updated": "2021-02-15T11:03:54Z",
  "author": "mark-wilson",
  "summary": "A drone-friendly Sony A7S III in different clothes, it seems",
  "article": [
    "A new leak for the rumored Sony FX3 full-frame camera suggests it might just have been built to be the perfect sidekick for the Sony Airpeak drone.",
    "Contrary to earlier whispers that the FX3 might be capable of shooting 8K video, the YouTube channel Gaston Shutters has claimed that sources have revealed the camera will effectively be a Sony A7S III in different clothes – making it an ideal partner for Sony's incoming Airpeak drone.",
    "The channel's new leaked image shows us the FX3's top plate for the first time, with the camera's controls understandably very different from the A7S III – after all, the FX3 will be part of Sony's Cinema line, despite the inclusion of an Alpha logo on its front.",
    "But according to Gaston Shutters, the internal specs will be almost identical to the A7S III, with a 12MP full-frame sensor, in-body image stabilization (IBIS) and the ability to shoot 4K/120p slo-mo, but not 8K.",
    "So why might Sony be making such a similar model to the one that sits top of our list of the best 4K cameras? The pretty reasonable speculation is that the FX3's cleaner and more de-cluttered design makes it an even better match for loading it in and out of the gimbal on Sony's Airpeak drone (and perhaps other drones, too).",
    "Without an electronic viewfinder or mechanical shutter, the FX3 will likely have a lighter and more streamlined body that would be ideal for pro aerial filmmaking duty.",
    "The new speculation certainly makes a lot of sense. After all, the camera that Sony showed in its first press photos for the Airpeak drone was the Sony A7S III – but that camera was designed more for handheld hybrid shooters.",
    "The rumors would also help explain why the Sony FX3 has an Alpha logo on the front, unlike any other model in Sony's cinema line. Aerial filmmakers usually want the option of shooting both video and stills – and despite its video leanings, the FX3 is rumored to have a photo mode, too.",
    "According to the Gaston Shutters leak, the FX3 won't have built-in ND filters (a feature that you'll find in higher-end cameras like the Sony FX6), but will take CFexpress Type A cards, another feature it appears to share with the Sony A7S III.",
    "So when are we likely to see the Sony FX3 fully unveiled? There have been no official launch events announced yet, but the rumors suggest that pre-orders will start on February 23 and that the FX3 will cost €3,795 (around $4,600 / £3,315 / AU$5,925).",
    "That price puts it in the ballpark of the Sony A7S III, and would ensure that the FX3 would have plenty of suitors on the ground as well as among aerial filmmakers. Particularly if Sony adds some extra surprise features to the FX3 that haven't yet appeared in leaks."
  ],
  "headers": {
    "6": "Flying high"
  },
  "links": {
    "Sony Airpeak drone": "https://www.techradar.com/news/sony-airpeak-drone-release-date-price-rumors-and-leaks",
    "Gaston Shutters": "https://www.youtube.com/watch?v=cVeXLvAxgOA",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "best 4K cameras": "https://www.techradar.com/news/best-camera"
  }
}