{
  "source": "https://www.techradar.com/news/this-new-cryptocurrency-could-potentially-cause-an-ssd-or-hard-drive-shortage",
  "title": "This new cryptocurrency could potentially cause an SSD or hard drive shortage",
  "category": "computing",
  "updated": "2021-05-06T11:04:22Z",
  "author": "darren-allan",
  "summary": "Could Chia seeds grow into a threat to SSD or HDD stock?",
  "article": [
    "Crypto-miners have exacerbated graphics card shortages in recent times, adding to the problems faced by frustrated gamers looking to buy a new GPU, and a fresh cryptocurrency on the scene might just eventually impact a different set of PC components – namely drives.",
    "Chia, which is still yet to be made available to buy, is designed to be an eco-friendly cryptocurrency, so instead of relying on power-hungry GPUs (or ASIC devices), it leverages the power of drives: SSDs or hard disks which use way less power.",
    "However, assuming that Chia successfully establishes itself as a green-friendly alternative in the cryptocurrency sphere, the problem is that solid-state drives or hard drives could be bought up by miners (or rather, ‘farmers’ – we’ll come back to that later).",
    "Indeed, as Hong Kong-based tech site HKEPC reports (as spotted by Tom’s Hardware), this is already happening over in Asia – indeed there is talk of ‘panic buying’.",
    "The Hong Kong market has seen a spike in sales of hard drives of 4TB to 8TB capacities, so much so that the prediction is that due to demand, hard drive and SSD prices could go up in Hong Kong by $200 HKD to $600 HKD (which is about $25 to $75 or so; around £20 to £55, or AU$30 to AU$100).",
    "Which is a worrying development on top of the existing supply chain problems caused by the pandemic, and recent reports of a lack of key components and a power outage which is expected to push SSD prices up a chunk.",
    "The better news is that the SSDs being sought out are enterprise models with high endurance, because Chia pushes drives with constant reading and writing – but consumer SSDs might be used in a pinch.",
    "Tom’s further notes that one of the major manufacturers in China, Jiahe Jinwei, has told MyDrivers that it has sold out of some high-end 1TB and 2TB NVMe SSDs already – and the firm says it will be implementing restrictions to stop miners from hoovering up consumer models. Indeed, apparently Jiahe Jinwei is planning to market an SSD specifically for cryptocurrency use, in much the same way that there are dedicated GPUs for miners.",
    "How exactly does Chia work, you might be wondering? Rather than the traditional cryptocurrency ‘proof of work’ model, Chia – which is the brainchild of Bram Cohen, the inventor of BitTorrent – runs on a ‘proof of space and time’ basis; proof of space referring to storage capacity, with time added as an additional factor.",
    "As the Chia FAQ explains: “Proof of Space is a cryptographic technique where provers show that they allocate unused hard drive space for storage space. In order to be used as a consensus method, Proof of Space must be tied to Proof of Time. PoT ensures that block times have consistency in the time between them and increases the overall security of the blockchain.”",
    "The gist of it is that rather than having huge electricity-sapping mining efforts, Chia can be ‘farmed’, with those farmers allocating sections (plots) of their drives dedicated to the cryptocurrency.",
    "The makers observe: “Farming remains decentralized because anyone that has installed our software and has plots can win the next block … [farming] relies on empty hard disk space and anyone with a mobile phone, laptop, or corporate network tends to have extra space not currently being used.",
    "“Unlike mining, once you’re done farming your storage you can repurpose it to, for example, store your family photos.”",
    "As mentioned, Chia is yet to launch as a digital commodity you can buy, but it is currently in a pre-farming phase, as the FAQ explains.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies."
  ],
  "headers": {
    "8": "Proof of space and time"
  },
  "links": {
    "graphics card shortages": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "ASIC devices": "https://www.techradar.com/best/asic-devices",
    "SSDs or hard disks": "https://www.techradar.com/news/ssd-vs-hdd-which-is-best-for-your-needs",
    "HKEPC": "https://www.hkepc.com/20288/%E7%A4%A6%E5%B7%A5%E7%98%8B%E7%8B%82%E6%90%B6_HDD__SSD_%E6%8C%96%E6%8E%98_Chia_%E5%A5%87%E4%BA%9E%E5%B9%A3_%E9%A6%99%E6%B8%AF%E4%BB%A3%E7%90%86HDD_%E8%A2%AB%E6%8E%83%E5%85%89%E4%BE%86%E8%B2%A8%E5%A4%A7%E6%BC%B2%E5%83%B9_",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/hard-drive-ssd-shortages-imminent-if-new-cryptocurrency-blooms",
    "expected to push SSD prices up a chunk": "https://www.techradar.com/news/ssd-price-increase-could-affect-your-next-pc-build",
    "SSDs": "https://www.techradar.com/best/ssd-for-cryptocurrency-mining",
    "MyDrivers": "https://news.mydrivers.com/1/751/751502.htm",
    "dedicated GPUs for miners": "https://www.techradar.com/news/gigabyte-cmp-30hx-officially-announced-but-price-and-release-date-still-a-mystery",
    "FAQ explains": "https://www.chia.net/faq/#faq-13"
  }
}