{
  "source": "https://www.techradar.com/news/nintendo-switch-online-finally-gets-some-great-free-games-kind-of",
  "title": "Nintendo Switch Online finally gets some great free games... kind of",
  "category": "gaming",
  "updated": "2021-07-22T10:51:36Z",
  "author": "vic-hood",
  "summary": "Try these Switch games for free",
  "article": [
    "Nintendo is offering Nintendo Switch Online members two new free game trials, allowing subscribers to try out two top Switch games for a limited time.",
    "In the US, Switch online subscribers can now try the popular social-deduction game Among US for free for one week (from July 21 to July 27). While usually Among Us on Switch would cost $5, those who wish to purchase the full game can grab it for 30% off until August 1 - meaning it's only $3.50.",
    "Meanwhile, Nintendo Switch Online members in Europe will be able to try out ridiculous hospital sim Two-Point Hospital: Jumbo Edition for free from July 28 until August 3.",
    "US Nintendo Switch subscribers can download and play Among Us for free right now, by following the free trial prompt on the Nintendo eShop. While the Two-Point Hospital free trial isn't available quite yet, European Switch online subscribers can download the game trial right now, ahead of its unlocking on July 28. Simply head over to the Two-Point Hospital listing on the Nintendo eShop and follow the \"try for free\" prompts.",
    "There's no word on whether an Among Us free trial will come to Europe, or whether a Two-Point Hospital game trial will come to North America.",
    "The Nintendo Switch Online price is $19.99 / £17.99 / AU$29.95 for a full year's subscription, a fairly reasonable sum for any gaming subscription service (especially as you get access to a wide array of classic Nintendo titles for free). You also need to take out the membership if you're looking to play titles like Mario Kart and Super Smash Bros. Ultimate online with your friends.",
    "Among Us is an online multiplayer game that sees each player taking on the role of a crewmate upon a base or ship, with the aim being to complete tasks that help keep the map functioning like a well-oiled machine. However, the twist is that one crewmate is the Imposter, tasked with murdering as many of the other players as possible without getting caught. It's up to crewmates to try to work out who the Imposter is and to eject them from the base. But, get it wrong, and you sacrifice one of your one crewmates and allow the Imposter to continue running rampant.",
    "Among Us first release on mobile devices, where it's free, and gained huge popularity during the early stages of the Covid-19 pandemic - resulting in the social deduction game being rolled out to PC and consoles. If you're ever played the likes of Mafia or Werewolf, then you're going to love this.",
    "Two-Point Hospital, on the other hand, is a simulation game that sees you trying to construct and manage an empire of hospitals. But Two-Point Hospital isn't all that simple thanks to whacky patients who suffer from even whackier illnesses - some may need you to treat their literal lightbulb heads while others may need some therapy to stop acting like Freddie Mercury. That's before we even get into pandemics that turn everyone into Egyptian mummies and extreme weather conditions that threaten to rip apart your hospital",
    "Two-Point Hospital is ridiculous but offers huge amounts of fun. If you ever played Theme Hospital, then you know what you're in for.",
    "While it's great to see Nintendo adding more free game trials, allowing players to try before they buy, it only highlights how behind Nintendo is when it comes to its free Nintendo Switch Online game offerings.",
    "While Switch Online subscribers get access to free games such as Kirby's Adventure, Super Mario Bros, and The Legend of Zelda, we would love to see Nintendo offering some newer free titles as part of its subscription. When compared to the likes of PS Plus and (to a lesser extent) Xbox Live Gold, Nintendo is considerably behind, offering a nostalgia service rather than a means for players to discover more modern titles they may otherwise not have.",
    "I can't help but wish that these game trials had instead been offered for free for a month to Switch Online subscribers, with players able to continue playing as long as they remained a member - in the same way as PS Plus allows. Yes, PS Plus is a more expensive prospect, but Nintendo would likely be extended goodwill from players to increase its Switch online pricing in return for a plethora of free top Switch games every month - rather than simply more retro games."
  ],
  "headers": {
    "6": "Tell me more about the games",
    "10": "Analysis: How do these offerings compare against Nintendo's rivals?"
  },
  "links": {
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer",
    "top Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Among Us": "https://www.techradar.com/news/among-us-mobile-game",
    "Nintendo eShop": "https://www.nintendo.co.uk/Games/Nintendo-Switch/Two-Point-Hospital-JUMBO-Edition-1716185.html?utm_medium=social&utm_source=twitter&utm_campaign=NintendoSwitchOnline%7CTwoPointHospital_TrialAnnouncement%7Co2LPV%7Cm_id_a2fGte8fme%7C1716185%7Cw30",
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "Xbox Live Gold": "https://www.techradar.com/news/xbox-live-gold-deals"
  }
}