{
  "source": "https://www.techradar.com/news/teenage-mutant-ninja-turtles-reboot-gets-2023-release-date",
  "title": "Teenage Mutant Ninja Turtles reboot gets 2023 release date",
  "category": "entertainment",
  "updated": "2021-06-02T12:04:04Z",
  "author": "axel-metz",
  "summary": "With Seth Rogen at the helm",
  "article": [
    "Just when we thought the era of movie reboots couldn’t get any crazier, a new Teenage Mutant Ninja Turtles movie is on its way in 2023 – with Seth Rogen and Nickelodeon as producers.",
    "The project was announced back in August 2020, but the Superbad actor has now shared a cryptic tweet which sheds more light on what audiences can expect from the CG-animated adventure.",
    "The most notable detail among the scribbles – supposedly taken from Leonardo’s journal – is the movie’s August 11, 2023 release date, alongside notes referencing brothers Raphael, Michelangelo and Donatello as well as the turtles’ friend and reporter April O’Neil.",
    "As per a recent Variety report, writer and co-director of the excellent The Mitchells vs. The Machines, Jeff Rowe, will helm the movie, working from a screenplay written by Brendan O’Brien. The latter also wrote the script for Bad Neighbors and its sequel, which Rogen starred in and produced with long-time creative partners Evan Goldberg and James Weaver.",
    "It’s safe to say we know what brand of humor to expect, then. Back in 2020, Rogen told Collider that “the ‘Teenage’ part of Teenage Mutant Ninja Turtles was always the part that stuck out to [him] the most as a lifelong fan,” so might we see a Superbad-esque take on the beloved comic book franchise?",
    "Leonardo, Raphael, Michelangelo and Donatello are no stranger to big-screen outings.",
    "Having originated as a comic book in 1984, the Teenage Mutant Ninja Turtles (often abbreviated to TMNT) franchise has since spread its shells to countless animated TV series and movies.",
    "The 1990s saw the turtles in live-action form for the first time, while Michael Bay attempted to breathe new life into the characters by producing two CGI-heavy movies in the 2010s – Teenage Mutant Ninja Turtles and its sequel, Out of the Shadows.",
    "Say what you want about the franchise’s slapstick humor and apparent unwillingness to call it a day, but its films have grossed more than $1.2 billion at the worldwide box office, so it’s no wonder Rogen and co. are keen to bank on the popularity of Leonardo and his reptilian brothers.",
    "There’s no word yet on the movie’s cast, or indeed whether Rogen himself may star in his own picture, but we expect to be drip-fed more details as 2023 rolls nearer.",
    "Via GamesRadar"
  ],
  "headers": {
    "5": "Rebooting… the reboot?"
  },
  "links": {
    "cryptic tweet": "https://twitter.com/Sethrogen/status/1399776734946357251?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1399776734946357251%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.gamesradar.com%2Fteenage-mutant-ninja-turtles-reboot-from-seth-rogen-arriving-summer-2023%2F",
    "Variety": "https://variety.com/2021/film/news/teenage-mutant-ninja-turtles-reboot-seth-rogen-1234985667/",
    "Collider": "https://collider.com/seth-rogen-teenage-mutant-ninja-turtles-movie-reboot-details/",
    "GamesRadar": "https://www.gamesradar.com/teenage-mutant-ninja-turtles-reboot-from-seth-rogen-arriving-summer-2023/"
  }
}