{
  "source": "https://www.techradar.com/news/oneplus-nord-se-cancelled",
  "title": "OnePlus Nord SE might be cancelled after all",
  "category": "phones",
  "updated": "2021-03-29T22:27:56Z",
  "author": "david-lumb",
  "summary": "OnePlus Nord ‘Special Edition’ may be shuttered",
  "article": [
    "The OnePlus Nord SE (or ‘Special Edition’) has been essentially cancelled, according to a new report, which claims the phone that we expected won’t be provided to the public.",
    "Noted tipster Max Jambor, who had first leaked in December that OnePlus was making the Nord Special Edition in partnership with designer Joshua Vides, is now claiming in a Voice post that the phone won’t be presented to the public at all. Jambor didn’t hear why the phone was effectively cancelled, nor could he rule out that a different phone released in the future would pick up the OnePlus Nord SE name.",
    "If true, this means the next mid-range phone coming from the brand will likely be the not-yet-officially-named OnePlus Nord 2, which we expect to come sometime in mid-2021, assuming it follows the release window of the original OnePlus Nord.",
    "The OnePlus Nord was a pleasant surprise when it came out in July 2020: high specs and plenty of camera capability at mid-range prices, which felt like a return to the brand’s heyday releasing phones far below the pricetags of its current flagships. The Nord’s £379 / €399 (around $480, AU$680) starting pricetag is half that of the just-released OnePlus 9’s price, and nearly a third the cost of the OnePlus 9 Pro.",
    "Since then, OnePlus has released even more affordable models in the OnePlus N10 5G and OnePlus N100, so the upcoming Nord SE was exciting for rumors claiming it would pack flagship perks – like 65W charging, which just debuted in the OnePlus 9 series – in a cheaper package.",
    "For what it’s worth, we’ve at least heard more about the OnePlus Nord 2, including that it may launch with a MediaTek chipset instead of Snapdragon silicon, suggesting it’s more likely to come out than the SE. And we can finally stop mistaking it for the iPhone SE or Xiaomi Mi 9 SE...",
    "Via Android Central"
  ],
  "headers": {
    "3": "A growing mid-range OnePlus lineup"
  },
  "links": {
    "leaked": "https://www.techradar.com/news/oneplus-nord-se-apparently-isnt-a-new-cheap-phone-after-all",
    "Voice": "https://www.voice.com/post/@maxjmb/oneplus-nord-se-not-gonna-happen-1617000955-485858715",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus N10 5G": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "OnePlus N100": "https://www.techradar.com/news/oneplus-nord-n10-5g-and-n100-announced-as-two-new-super-cheap-phones",
    "charging": "https://www.techradar.com/news/oneplus-nord-se-with-65w-charging",
    "launch": "https://www.techradar.com/news/oneplus-nord-2-may-launch-soon-without-a-snapdragon-chipset",
    "Android Central": "https://www.androidcentral.com/oneplus-scraps-special-edition-oneplus-nord-se"
  }
}