{
  "source": "https://www.techradar.com/news/crysis-2-remaster-could-be-on-the-way-soon",
  "title": "Crysis 2 remaster could be on the way soon",
  "category": "computing",
  "updated": "2021-05-25T08:06:21Z",
  "author": "axel-metz",
  "summary": "Crytek gets cryptic with Crysis",
  "article": [
    "Crysis developer Crytek has teased what seems to be an upcoming project based around Crysis 2 – likely to be a remaster.",
    "In a cryptic tweet, the official Crysis Twitter account wrote “They used to call me Prophet” – the name of the game’s protagonist – alongside the suspicious eyes emoji.",
    "The post was later accompanied by a screenshot of Crysis 2, which launched in 2011 for Microsoft Windows, PlayStation 3, and Xbox 360. It was widely regarded as a major benchmark for graphical performance on PC and consoles at the time.",
    "Although there hasn’t yet been an official word on whether Crysis 2 is getting a remaster, the tweet seems to suggest so. Especially since the game’s predecessor, Crysis, got its own remaster, Crysis Remastered, back in 2020, it would follow that Crytek might look to capitalise on Crysis 2’s similar level of popularity.",
    "Of course, Crysis 2 already looks great, especially on PC. It was the first title to use CryEngine 3, which boasted some of the most impressive light, water and destruction effects player’s could find in a game back when it was released almost a decade ago.",
    "Still, the 8K resolutions, ray tracing and technological improvements that accompanied the first Crysis remaster would still be welcome additions to a Crysis 2 equivalent. Crysis Remastered did suffer from some poor optimization, mind, so Crytek would do well to better bring a Crysis 2 remaster in line with modern first-person-shooters.",
    "Despite the obvious interest in an updated Crysis 2 game, it’s clear fans would rather see the arrival of a fourth instalment in the franchise.",
    "“I don’t understand why they would remaster Crysis 2,” one reply to the cryptic tweet read. “The game already looks amazing and sometimes better than most of the games today. It made sense for Crysis 1 [...] but I would be rather hyped for Crysis 4 or something that would give us more story.”",
    "Given that the game is approaching its tenth anniversary in October, though, we’d wager it’s a sure bet to expect a Crysis 2 remaster some time later this year.",
    "That being said, with E3 2021 set to take place next month, might we see further game-related announcements from the developer? There’s a chance that a Crysis 2 remaster may act as a placeholder while Crytek develops Crysis 4 for next-gen consoles – which is a game that would generate a lot more excitement, to say the least.",
    "Via MSPoweruser"
  ],
  "headers": {
    "6": "In with the old"
  },
  "links": {
    "Crysis Twitter account": "https://twitter.com/Crysis?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1395761867042217990%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.techradar.com%2F",
    "Crysis Remastered": "https://www.techradar.com/reviews/crysis-remastered",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "reply": "https://twitter.com/Ikasonik/status/1395769774769070082",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "MSPoweruser": "https://mspoweruser.com/crytek-is-teasing-something-with-crysis-2/"
  }
}