{
  "source": "https://www.techradar.com/news/mortal-kombat-first-reactions-heres-what-the-critics-thought",
  "title": "Mortal Kombat first reactions: here's what the critics thought",
  "category": "entertainment",
  "updated": "2021-04-15T02:48:24Z",
  "author": "stephen-lambrechts",
  "summary": "Is it a flawless victory?",
  "article": [
    "Mortal Kombat, the highly anticipated video game adaptation from director Simon McQuoid and producer James Wan, is finally set to arrive in theaters and on HBO Max next week, but that doesn't mean the hype train is ready to stop.",
    "Warner Bros. has released a new featurette dedicated to spotlighting the film's fight choreography, along with some of the cast's action movie and martial arts backgrounds.",
    "According to McQuoid, the film's producers set out to hire people who could really sell the brutality of Mortal Kombat's fight scenes. \"The fatalities are sickeningly violent, but we all knew we needed to cast some really amazing talented people to make it feel real.\"",
    "Based on the video below, we can already tell that this adaptation of Mortal Kombat will be a far more accurate representation of the games than the previous films from the '90s – not just due to the promised violence, but because it seems to really lean into the fantasy aspects of the series.",
    "The first Mortal Kombat reviews from international critics, as rounded up by ScreenCrush, have started rolling in, and so far they seem to echo the sentiment above.",
    "James Marsh of the South China Morning Post calls the film a \"gleefully violent video game adaptation\" that features \"boxers with ninja blood and green berets with robot arms pummeling invisible lizards and bat-winged demon babes to a bloody pulp.\"",
    "A'bidah Zaid of Geek Culture says \"The visuals, sound effects, gore and action are exactly what fans have been looking for since the original 1995 film and more.\"",
    "\"The fatalities are just as gruesome as you’d expect... but it’s the hand-to-hand combat that stands head and shoulders above everything else here,\" says Sergio Pereira of Fortress of Solitude.",
    "That said, most of the critics agree that while the film delivers on action and violence, it's decidedly lacking when it comes to character development. Mufaddal Fakhruddin, IGN Middle East says \"for the average viewer, there will be little reason to care for the stakes here.\"",
    "In one of the film's more negative reviews, Casey Chong of Casey's Movie Mania hopes \"that whoever ends up in charge of the sequel would improve significantly upon the largely dour reboot.\"",
    "So, mostly positive reactions for the film so far, with a few areas which could be considered cause for concern. Luckily, we won't have to wait long to see it for ourselves – Mortal Kombat releases on HBO Max and in theaters on April 23 in the US. It also arrives in the UK cinemas on the same day, and slightly earlier in Australia on April 21."
  ],
  "headers": {
    "4": "First reviews are in – is it a flawless victory?"
  },
  "links": {
    "next week": "https://www.techradar.com/news/mortal-kombats-release-has-been-delayed-but-not-by-much",
    "ScreenCrush": "https://screencrush.com/mortal-kombat-first-reviews/",
    "South China Morning Post": "https://www.scmp.com/lifestyle/entertainment/article/3128762/mortal-kombat-movie-review-gleefully-violent-video-game",
    "Geek Culture": "https://geekculture.co/geek-review-mortal-kombat-2021/",
    "Fortress of Solitude": "https://www.fortressofsolitude.co.za/mortal-kombat-2021-review-not-a-flawless-victory-but-certainly-victorious/",
    "IGN Middle East": "https://in.ign.com/mortal-kombat-reboot/157355/review/mortal-kombat-movie-review-2021",
    "Casey's Movie Mania": "https://www.caseymoviemania.com/2021/04/mortal-kombat-2021-review/"
  }
}