{
  "source": "https://www.techradar.com/news/nasas-mars-helicopter-is-now-scouting-new-sites-for-perseverance-rover-to-study",
  "title": "NASA's Mars helicopter is now scouting new sites for Perseverance rover to study",
  "category": "appliances",
  "updated": "2021-08-18T00:36:15Z",
  "author": "john-loeffler",
  "summary": "The Mars drone's 12th flight was its most difficult – and productive – yet",
  "article": [
    "NASA's Ingenuity Mars Helicopter has been a phenomenal success story, fulfilling all of its original mission objectives shortly after touching down on Mars. But like the many robotic explorers before it on the red planet, Ingenuity is seeing its mission evolve with each passing Martian sol. Its next task: scouting ahead for potential sites for the NASA Perseverance Mars Rover to study on the ground.",
    "Ingenuity was always meant to be a proof-of-concept more than a functional planetary explorer. When NASA announced that it would be landing robotic drones on Saturn's moon Titan in the 2030s, there was a very real question about whether something like this would even be possible.",
    "Humans have only been flying for just over 100 years on this planet, so trying to fly anything on an alien world via satellite connections and relayed instructions was NASA's first order of business. Simply showing that humans could fly a drone on Mars in any capacity was pretty much all Ingenuity set out to do.",
    "But just like NASA's Opportunity Mars Rover saw its original 90-day mission evolve into 15 years of exploration, engineers with NASA's Jet Propulsion Laboratory (NASA-JPL) in California have found new tasks for Ingenuity to perform, including scouting the Martian landscape for potential sites of interest for the Perseverance rover to examine, while also scouting that same landscape for potential dangers.",
    "After Perseverance's first attempt at collecting samples of Martian soil failed to produce a workable sample to study, scientists concluded that the problem might be the soil itself.",
    "\"Both the science and engineering teams believe that the uniqueness of this rock and its material properties are the dominant contributor to the difficulty in extracting a core [sample] from it,\" wrote Louise Jandura, Chief Engineer for Sampling & Caching at NASA-JPL, in a blog post last week.",
    "\"Therefore, we will head to the next sampling location in South Séítah, the farthest point of this phase of our science campaign.'",
    "The challenge is that the terrain between where Perseverance is currently and the possible sites that it could sample isn't completely flat. There are mounds and dunes along the path that could snag the $2.7 billion rover, something you don't ever want to have happen if you can help it. If Perseverance gets stuck, there's no one there to pull it out.",
    "That's where Ingenuity is coming in. According to Space.com, the nearby South Séítah region has many more sampling opportunities for the rover, but also an increased risk to both rover and helicopter. The terrain is uneven, meaning that several of the cameras Ingenuity uses to assess its height can quickly go from \"you're totally fine\" to \"pull up!\" very quickly, which could easily lead it to crash.",
    "That kind of maneuvering hasn't been done before with Ingenuity but it's apparently taken it in stride, performing its 12th flight overall, adding about 1,500 feet (450m) of distance to the 1.4 miles (2.2km) Ingenuity has already flown, and 2:49 minutes of flight time to the nearly 19 minutes flown so far.",
    "Nobody here is out to knock NASA's Mars Ingenuity helicopter, lets get that out of the way right up front. A small box with wire legs and a pair of twin-blade rotors isn't exactly a Maserati, but we're also flying this small drone the size of a shoebox on another planet. This, full stop, is a historic achievement.",
    "But its hard to look at Ingenuity and not think about NASA's Dragonfly. NASA's proposed autonomous drones for its Titan mission, the Dragonfly will have to be Ingenuity on steroids.",
    "Fully autonomous, with an extensive range, and sent to Titan as part of a fleet of drones, the Dragonfly will give us our first on-the-ground look at an alien world with an active liquid weather cycle (though the liquid raining down from its clouds, running in its rivers, and filling its lakes is methane, not water).",
    "It is also believed that there is also a water ocean containing salts and ammonia about 35 to 50 miles (55 to 80 kilometers) below its icy surface that scientists believe to be one of the few places in the solar system that might be hospitable to life.",
    "So in all the ways that matter, Ingenuity is laying the groundwork for the Dragonfly drones we're going to be sending to Titan, which may be its most important mission of all."
  ],
  "headers": {
    "10": "Analysis: Mars Ingenuity is a historic bit of tech, but Titan will tell the tale"
  },
  "links": {
    "blog post": "https://mars.nasa.gov/mars2020/mission/status/320/assessing-perseverances-first-sample-attempt/",
    "Space.com": "https://www.space.com/mars-helicopter-ingenuity-12th-flight-success"
  }
}