{
  "source": "https://www.techradar.com/news/lg-has-officially-quit-making-phones-heres-whats-next",
  "title": "LG has officially quit making phones – here's what's next",
  "category": "phones",
  "updated": "2021-04-05T03:02:31Z",
  "author": "matt-swider",
  "summary": "The focus will be 6G, EVs, IoT and B2B Solutions, according to LG",
  "article": [
    "LG has official quit making phones today, according to an official press release, so we won't see new LG smartphones in 2021. This announcement isn't going to surprise anyone in the mobile space, as the move has been rumored for several weeks.",
    "This means two things. First, we won't see phones like the rumored LG V70 ThinQ, LG G10 or LG Velvet 2, as the company is closing its entire mobile business unit. We probably won't see the LG Rollable the company teased at CES 2021 and confirmed would be released in 2021, either. LG calls the move a \"strategic decision to exit the incredibly competitive mobile phone sector.\"",
    "Second, LG says this means it'll be free to focus resources on growth areas, citing a whole list of sectors where its brand is better positioned: \"electric vehicle components, connected devices, smart homes, robotics, artificial intelligence and business-to-business solutions, as well as platforms and services.\"",
    "In the statement, LG reveals it'll \"leverage its mobile expertise and develop mobility-related technologies such as 6G\" just as most people are getting 5G phones.",
    "The good news is that if you own an LG phone or want to buy one – say the LG V60 or LG Velvet – you'll be covered. Both current LG phone inventory will remain on sale in stores and online, and service support and software updates will continue for existing LG phone customers. There just won't be any new LG smartphones going forward.",
    "LG says the wind down of its mobile phone business is expected to be completed by July 31, although you'll probably still be able to buy an LG phone after that date.",
    "Take a look back at 5 truly wild LG phone innovations – and why they failed. It was a company that often pushed the envelope of smartphones – better selfie cameras (LG V10), a focus on ultra-wide camera before many others (LG G6) and innovative video camera controls that others eventually copied (LG V30).",
    "But it didn't always go in the right direction to connect with customers – attempted innovations like modular phones (LG G5), flexible displays (LG G Flex 2), leather backs (LG G4), gimmicky motion sensors (LG G8), and dual screens (LG G8X) were tepidly received.",
    "It also never had the competitive strength to offer better prices at the carrier level in key regions like the US, when Samsung and Apple consistently beat it on deals. LG phones started the 2010s with very popular phones like the LG G2, but by the end, its handsets just couldn't stand out in the crowd – and experiments like the LG Wing 5G or Dual Screen on the LG G8X/LG V60 just didn't draw consumers in like foldable phones."
  ],
  "headers": {
    "4": "What will happen to current LG phones?"
  },
  "links": {
    "rumored": "https://www.techradar.com/news/lg-looks-ever-more-likely-to-be-quitting-the-smartphone-business",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "LG V60": "https://www.techradar.com/reviews/lg-v60-thinq",
    "LG Velvet": "https://www.techradar.com/reviews/lg-velvet",
    "5 truly wild LG phone innovations – and why they failed": "https://www.techradar.com/news/5-truly-wild-lg-phone-innovations-and-why-they-failed",
    "LG V10": "https://www.techradar.com/reviews/phones/mobile-phones/lg-v10-1305854/review",
    "LG G6": "https://www.techradar.com/reviews/lg-g6",
    "LG V30": "https://www.techradar.com/reviews/lg-v30",
    "LG G5": "https://www.techradar.com/reviews/phones/mobile-phones/lg-g5-1315187/review",
    "LG G Flex 2": "https://www.techradar.com/reviews/phones/mobile-phones/lg-g-flex-2-1263346/review",
    "LG G4": "https://www.techradar.com/reviews/phones/mobile-phones/lg-g4-1292304/review",
    "LG G8": "https://www.techradar.com/reviews/lg-g8-review",
    "LG G8X": "https://www.techradar.com/reviews/lg-g8x-review",
    "LG G2": "https://www.techradar.com/reviews/phones/mobile-phones/lg-g2-1171025/review",
    "LG Wing 5G": "https://www.techradar.com/reviews/lg-wing-5g-review",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones"
  }
}