{
  "source": "https://www.techradar.com/news/hbo-max-is-getting-a-cheaper-ad-supported-tier-but-theres-a-huge-drawback",
  "title": "HBO Max is getting a cheaper ad-supported tier – but there's a huge drawback",
  "category": "entertainment",
  "updated": "2021-03-12T22:10:47Z",
  "author": "nick-pino",
  "summary": "You'll only get to see theatrical releases on the service if you pay for the full tier",
  "article": [
    "Your HBO Max subscription could be getting cheaper if you don’t mind watching advertisements, AT&T announced today.",
    "Previously AT&T (owners of WarnerMedia, which in turn owns HBO and HBO Max) announced that it would bring the service to 60 new countries in June – and when that happens, AT&T will also launch a cheaper ad-supported price tier, according to information obtained by The Verge.",
    "So what’s the catch? Well, you won’t be able to watch cinema releases the same day as they launch in theaters like you can with the full service. What that means, essentially, is that you’ll be paying less to watch shows like Rick & Morty and Game of Thrones, but you’ll be missing out on The Matrix 4 and Dune when they come to the full service and theaters later this year.",
    "As a consolation, however, you won’t have to watch ads on first-party HBO content – e.g. TV shows like Game of Thrones, The Wire or The Sopranos. And there is always the chance that the movies will be available on the service sometime after the launch, too.",
    "Unfortunately, AT&T didn’t disclose how much the new service is going to cost, nor did it give an exact launch date for the new tier.",
    "Traditionally, ad-supported services come in at half the cost of their ad-free counterparts (here in the US, Hulu costs $5.99 for the ad-free version and $11.99 for ad-free) so it’s likely that the new tier for HBO Max will be under $10 given its base price of $14.99 per month. How much it will cost outside of the US in any one of the 60 new countries, however, is anyone’s guess.",
    "So should you subscribe now or hold off? Our advice: probably hold off, if you can.",
    "Because the service will be coming out in just a few months, it might be worth holding off on subscribing , especially if you wouldn’t mind watching ads – and missing a few theatrical releases – for a lower price."
  ],
  "headers": {
    "4": "So how much will it cost?"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/reviews/hbo-max",
    "The Verge": "https://www.theverge.com/2021/3/12/22327217/hbo-max-ad-supported-tier-launch-date-international-price-subscriber-growth"
  }
}