{
  "source": "https://www.techradar.com/news/there-might-be-a-xiaomi-12-ultra-ultra",
  "title": "There might be a Xiaomi 12 Ultra... Ultra",
  "category": "phones",
  "updated": "2021-11-16T09:31:47Z",
  "author": "tom-bedford",
  "summary": "The Xiaomi 12 Ultra Enhanced",
  "article": [
    "While a few phone companies have started launching 'ultra' versions of top-end flagships, with the Xiaomi 12 it seems the trend might be bucked... because there might be an ultra version of the Xiaomi 12 Ultra.",
    "This comes from popular Xiaomi fan website Xiaomiui, which spotted a reference in Xiaomi code to two new smartphones, code-named Loki and Thor.",
    "Apparently one of these is the Xiaomi 12 Ultra, and the other is a rumored Xiaomi 12 Ultra Enhanced. It doesn't seem like you're get the ultimate phone by opting for the Xiaomi 12 Ultra.",
    "Those codenames are presumably a reference to Scandinavian folklore, not Marvel - it's said that the Xiaomi 12 Pro is codenamed Odin. However, it doesn't seem like that naming scheme affects the whole series, as a previous rumor suggested two versions of the Xiaomi 12 Lite are codenamed Zijin and Taoyao.",
    "So what's special about the Xiaomi 12 Ultra Enhanced? Well, right now... we don't know, though judging by the title alone it'll be an even more powerful version of the Ultra version of the phone.",
    "Previous leaks for the Xiaomi 12 Ultra make it sound a lot like the Xiaomi Mi 11 Ultra, with a 50MP main, 48MP ultra-wide and 48MP periscope zoom camera, but with an extra telephoto snapper on top of those.",
    "So how many Xiaomi 12 mobiles are we expecting at this point?",
    "That's a lot of phones - and it's not including any Xiaomi 12T family that was expected will be released later in the year. Presumably not all of them will launch at the same time though, as the Xiaomi Mi 11 family was staggered over time.",
    "The Xiaomi Mi 11 launched in December 2020 in China then February 2021 globally, alongside the Mi 11 Lite. The Ultra came later, then a new version of the Mi 11 Lite came months after that alongside the Xiaomi 11T family.",
    "So while it might sound like there's an overwhelming number of Xiaomi 12 phones coming, you can rest assured they likely won't all launch at once - and it's possible they won't all launch globally either."
  ],
  "headers": {
    "6": "Analysis: many Mi mobiles"
  },
  "links": {
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Xiaomiui": "https://xiaomiui.net/xiaomi-12-ultra-and-enhanced-specifications-are-spotted-296/",
    "two versions of the Xiaomi 12 Lite": "https://www.gizchina.com/2021/10/29/miui-code-exposes-xiaomi-12-lite-and-xiaomi-12-lite-zoom/",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Mi 11 Lite": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "Xiaomi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro"
  }
}