{
  "source": "https://www.techradar.com/news/microsoft-relaunches-bug-bash-challenge-for-windows-insider-how-to-enter",
  "title": "Microsoft relaunches Bug Bash challenge for Windows Insider: How to enter",
  "category": "computing",
  "updated": "2021-05-14T17:00:04Z",
  "author": "daryl-baxter",
  "summary": "Gotta catch them all",
  "article": [
    "Microsoft has announced the return of its Bug Bash event for Windows 10 that will run from now through May 17, which challenges users in the Windows Insider channels to find bugs and report them as fast as they can in order to earn rewards in the form of badges.",
    "The Windows Insider channel is Microsoft’s method of bringing out features that need to be tested before they’re brought out as an official update. For example, the UI and icons are in the midst of being redesigned, and can be seen in the recent development builds of Windows 10.",
    "With Windows 10 21H2 set to become a significant update for the operating system, it only makes sense for Microsoft to have any major bugs quashed now before it’s rolled out to every user.",
    "This is an event by Microsoft for users in the Windows Insider program to comb through the recent pre-release versions of Windows 10 and look for any features that may not be working as correctly as they should be.",
    "This event will have 18 tasks available to begin with, from freeing up disk space, to testing out the magnifier app. There’s plenty of random objectives for you to complete, with more on their way, but completing them will earn you several badges that you can freely flaunt across the Insider program.",
    "If you’re already in the Windows Insider program, you can enter Bug Bash here.",
    "If you’re not, go to Settings > Windows Update > Windows Insider Program to allow your PC to install a pre-release build of Windows 10, and once the process is complete, you will be able to earn as many badges as you can."
  ],
  "headers": {
    "3": "What is Bug Bash?",
    "5": "How to enter"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 10 21H2": "https://www.techradar.com/news/windows-10-21h2-update",
    "event": "https://twitter.com/windowsinsider/status/1392510784123678723",
    "enter Bug Bash here": "http://aka.ms/FHQuests"
  }
}