{
  "source": "https://www.techradar.com/news/what-the-corporate-it-world-can-learn-from-film-studios",
  "title": "What the corporate IT world can learn from film studios",
  "category": "computing",
  "updated": "2021-04-19T10:16:48Z",
  "author": "eric-troyer",
  "summary": "Can the corporate world learn from creative studios?",
  "article": [
    "We know that just about every UK enterprise is already using the cloud and planning to be cloud-first and even cloud-only in the future. But how do these companies make the most of cloud technology today?",
    "When looking for best cloud practices, it makes sense to look at how data and compute-intensive businesses are getting the job done. IT leaders may be surprised then to hear that some of the most innovative approaches to the technology can be found in Hollywood, not Silicon Valley.",
    "In an industry where the boundaries of visual effects and animation are constantly being pushed, it’s not just the design software that needs to be state of the art, it’s also the infrastructure supporting the creative work - the ‘boring’ back-end technology. And this is where the cloud plays a starring role. The rendering of the innovative animation and visual effects we’ve become used to watching requires high levels of compute power. And the massive amount of data generated by animation and visual effects puts a strain on IT networks, and can lead to congestion, higher latency, and lower quality of service.",
    "For that reason, CTOs and IT management teams are becoming an even more vital part of the creative process at production studios. They’re responsible for ensuring that their network IT infrastructure can support the demands and needs of the filmmakers. They’ve realized this means the whole network across the entire studio must perform at a high level and be reliable and cost-efficient. Often an IT team’s connectivity choices are critical to minimizing latency and downtime.",
    "Failing to make the right connectivity choices can lead to the entire rendering process taking days or weeks to complete, and, in the worst-case scenario, days of work can be lost if a cloud connection fails. In a world where we all wait with bated breath for the next release on streaming platforms, rendering delays can push release dates.",
    "But we’re not all in the movie business - much as we might wish we were. So, what can we take from a visual effects studio’s approach to the cloud? And how can we use this in other sectors that deal with data intensive applications?",
    "For many creative studios, and indeed many other companies in the media industry, a flexible approach to cloud connectivity has been a key ingredient to success.",
    "Framestore, a British animation and creative studio hosted its animation and visual effects rendering compute functions on-premises. But, as workloads increased, they often exceeded their on-premises capabilities and accessed additional compute power in the cloud. To move their data, they created numerous VPN tunnels via the public internet but found them to be slow and unreliable.",
    "The company realized their network infrastructure needed to change and explored ways to find a more sustainable solution. Leveraging a Software Defined Network (SDN) allowed them to create the on-demand, pay-as-you-go cloud connections they wanted, while supporting the compute power that animation and visual effects rendering required, with low latency and high reliability and performance.",
    "This flexible approach to the cloud could also help many businesses in other sectors. Film studios may have to ramp up compute to cope with particular intensive days of editing, but businesses across all sectors will find they need to scale-up and scale-down cloud connectivity in line with demand. An online retailer may see a surge in activity during Black Friday, for example, or may need to move data across several locations as they prepare for a new product launch. Being able to quickly flex-up and flex-down when needed, not only enables the workforce to get on with their work quickly and effectively, but also ensures that businesses are not tied into long-term, expensive, contracts with ISPs, carriers, and other telco providers when the level of connectivity, or compute, is not needed all year round.",
    "A well-thought-out network infrastructure, with reliable cloud connectivity at its heart, can also help businesses get the most out of their talent.",
    "Ridding their creative artists of IT headaches helps studios like Framestore consistently deliver the goods. For example, four films featuring its work – The Midnight Sky, Mulan, The Secret Garden and Wonder Woman 1984 - have been included in the BAFTA longlist for the ‘Special Visual Effects’ award.",
    "As David Lennox, Lead Systems Engineer, Framestore, points out: “My team’s job is making sure compute power is available for our artists to use. That’s where I see technology at Framestore doing good. We’re enabling creatives to produce this type of work”.",
    "As the cloud becomes more integral to a businesses’ infrastructure, CTOs will find that empowering staff with the right connectivity and network infrastructure has never been so important. So, if they’re looking for a little inspiration on how to get it right, they may want to turn to the big screen."
  ],
  "headers": {
    "2": "A blockbuster need for connectivity",
    "6": "A flexible approach to cloud connectivity",
    "10": "Unlocking creativity"
  },
  "links": {
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "IT management": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "IT infrastructure": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}