{
  "source": "https://www.techradar.com/news/oppo-find-x3-might-not-be-a-real-phone-at-least-not-with-that-name",
  "title": "Oppo Find X3 might not be a real phone - at least, not with that name",
  "category": "phones",
  "updated": "2021-02-03T14:40:18Z",
  "author": "tom-bedford",
  "summary": "Only three phones in the line",
  "article": [
    "There were four Oppo Find X2 smartphones, but with the Oppo Find X3 line, we might see that number drop to three - with the titular handset the one to go, if rumors are to be believed.",
    "This comes from leaker Evan Blass, who has been thoroughly leaking the Oppo Find X3 series of smartphones and has provided some information on which handsets will come as well as what specs they'll have.",
    "The four Oppo Find X2 phones were, starting from low-spec to top-end, the Find X2 Lite, Find X2 Neo, Find X2, and Find X2 Pro. Apparently, the Find X3 phones will have the same suffixes but with the removal of the 'standard' model, or the phone just called the Oppo Find X3.",
    "This makes sense - for the Find X2 line-up, the hierarchy was clear aside from which way around the Neo and vanilla phone went. If this Oppo Find X3 leak is correct, people won't need to check specs lists to see which is the budget or premium entry.",
    "As we said, Blass has been leaking lots of Oppo Find X3 series details, though we should note there's nothing on the Neo yet, and Blass had already leaked the news that the Find X3 Lite is literally just the Oppo Reno 5.",
    "The most recent piece of information concerns the design of the Pro model, featuring lots of hands-on images of the phone. In particular, the camera bump we've seen in other renders is detailed.",
    "This camera bump is a square that stands out from the phone's rear similar to the iPhone 12 or Google Pixel 5, but with a smooth curve that joins it to the rest of the body, not the angular bump of those other phones.",
    "Apparently Oppo refers to this as a 'crater' design, and Blass states \"it's said to be a significant technical achievement\", though we're sure it'll become a divisive design.",
    "Other information provided regards the camera specs, some of which we'd heard before. According to Blass, both the main and ultra-wide cameras will have new 50MP Sony sensors, and they'll be joined by a 3MP macro camera which has 25x zoom (for really close-up shots) and a 13MP telephoto camera with 2x optical zoom (for distance shots).",
    "Finally, Blass states the phones will launch \"sometime next month\" - that's March, if you're reading this in the future - something Oppo had already confirmed. When more rumors or official information comes out about the Oppo Find X3 series, we'll make sure to bring it to you."
  ],
  "headers": {
    "4": "More Oppo Find X3 news"
  },
  "links": {
    "Oppo Find X2": "https://www.techradar.com/reviews/oppo-find-x2-review",
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Evan Blass": "https://twitter.com/evleaks/status/1356872441939771392",
    "Find X2 Lite": "https://www.techradar.com/reviews/oppo-find-x2-lite",
    "Find X2 Neo": "https://www.techradar.com/reviews/oppo-find-x2-neo",
    "Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "leaked the news": "https://www.voice.com/post/@evan/oppo-find-x3-lite-will-be-a-reno5-rebadge-1610105255-1817111864",
    "Oppo Reno 5": "https://www.techradar.com/news/oppo-reno-5",
    "most recent piece of information": "https://www.voice.com/post/@evan/oppo-find-x3-pro-camera-up-close-personal-1612290026-1503992642",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "something Oppo had already confirmed": "https://www.techradar.com/news/oppo-find-x3-launch-confirmed-for-march-ages-after-its-samsung-galaxy-s21-rival"
  }
}