{
  "source": "https://www.techradar.com/news/amds-fidelityfx-super-resolution-wont-require-machine-learning-unlike-nvidia-dlss",
  "title": "AMD's FidelityFX Super Resolution won't require machine learning, unlike Nvidia DLSS",
  "category": "computing",
  "updated": "2021-03-24T12:24:02Z",
  "author": "jess-weatherbed",
  "summary": "The FPS boosting battle is set to begin",
  "article": [
    "We recently confirmed that FidelityFX Super Resolution, AMD's answer to Nvidia's DLSS (Deep Learning Super Sampling), will finally be coming to RDNA 2-powered graphics cards at some point in 2021. Despite rivaling Team Green's AI-powered framerate booster, AMD's VP of graphics, Scott Herkelman, informed PCWorld that FidelityFX won't require any machine learning to work.",
    "FidelityFX has been teased since the Radeon 6000 graphics cards were announced, and its possible that even if low stock had not affected GPU sales, AMD being unable to rival Nvidia's DLSS feature may have left some folk overlooking Big Navi in favor of what the framerate boost could offer in games. It isn't clear how the lack of machine learning could impact Team Red's offerings, but getting an FPS booster in games at all will be a big step in bringing the fight to Nvidia on a more equal playing field. Despite both the Radeon RX 6800 and Radeon RX 6800 XT being fantastic graphics cards, without supersampling they have less features to offer than the likes of the GeForce RTX 3080 or RTX 3070.",
    "AMD may also be highlighting how it doesn't agree with Nvidia that machine learning is needed for these features.",
    "Nvidia has long dominated lists like the Steam Hardware Survey likely due to both availability and customer demand. Radeon GPUs are usually more affordable than their Nvidia GeForce counterparts, so the inclusion of this new DLSS competitor may just be the edge AMD needed to take the rival manufacturer's crown. It was previously rumored that we would see AMD's FidelityFX coming to Radeon RX GPUs in March 2021, but that was clearly an optimistic estimate. Herkelman states that there is still more work that needs to be done to perfect the tech, but things are looking positive and that AMD has been making the effort to include fans in the design process to make sure dedicated followers will get input to influence the feature. It's unclear if this 'open design' with people has actually resulted in the late launch, but given how bumpy DLSS 1.0 was for Nvidia, it makes sense that AMD would prefer to take its time and deliver to the best of its ability.",
    "More games may also be needed to prepare for the feature to avoid the same mistakes as Nvidia back in 2018, when DLSS dropped with very few compatible titles.",
    "Via PC Gamer"
  ],
  "headers": {
    "3": "The real fight is about to begin"
  },
  "links": {
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "informed PCWorld": "https://www.youtube.com/watch?v=jENqMuHJgow&t=2056s",
    "FidelityFX": "https://www.techradar.com/news/amds-fidelityfx-super-resolution-will-launch-this-year-to-take-on-nvidia-dlss",
    "Radeon 6000 graphics cards": "https://www.techradar.com/news/amd-big-navi",
    "Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "FidelityFX coming to Radeon RX GPUs in March 2021": "https://www.techradar.com/news/amd-fidelityfx-super-resolution-might-launch-in-march-to-challenge-nvidia-dlss",
    "PC Gamer": "https://www.pcgamer.com/amd-fsr-fidelity-fx-super-resolution-announcement/"
  }
}