{
  "source": "https://www.techradar.com/news/vista-is-the-evil-twin-of-windows-11-heres-why",
  "title": "Vista is the evil twin of Windows 11: here's why",
  "category": "computing",
  "updated": "2021-07-11T00:08:09.018Z",
  "author": "daryl-baxter",
  "summary": "The final Vista frontier",
  "article": [
    "Amongst the many features of Microsoft’s Windows 11 is its new look, which has largely been received well by the Windows community. However users have been confused about the system requirements of the upgrade, alongside other aspects of which Microsoft haven’t rectified as yet.",
    "There’s an old myth that says – as with Star Trek films – you can tell the quality of a good Windows update by whether it falls on an odd or even number.",
    "Both Windows 8 and Star Trek V: The Final Frontier both weren’t received well, but Windows 7 and Star Trek VIII: First Contact were received well – and it’s a dilemma that’s lasted for years.",
    "However, it looks as though Microsoft wants to bring back Windows Vista for a new audience, and it seems like it could be on the right track, as long as communication with users is clear.",
    "If you were following news of Windows almost twenty years ago, there’s a good chance you would have heard about Longhorn. This was the sequel to Windows XP, released in 2001, which would bring a whole load of next-generation features, such as:",
    "However, development was reset in 2005, with many features, including WinFS, scrapped. What we got was unfortunately a bloated release in late 2006 in the form of Windows Vista, with widgets (called Gadgets in Vista) that were barely useful for the desktop, with a huge installation size for its time as well as an Aero interface that demanded a lot from many graphics cards than what was needed – and that’s not even the whole list of complaints.",
    "This was known as the sixth version of Windows, so some users weren’t holding out much hope for this update anyway, and their doubts were only proven when Vista was not well received. It wasn’t long until Windows 7 arrived in 2009 to a more positive reception.",
    "However, while Vista brought a lot of baggage, it did have potential at the time. For all of its troubled development and bloated features, it hinted at something more. While Windows 8 was the true fork in the road with its huge start screen and the desktop relegated to a tile, Vista was a trier.",
    "This brings us to Windows 11, which has another redesign, alongside being another release that features widgets (actually called widgets this time), but with system requirements for TPM and CPU eligibility that have confused many users and vendors alike.",
    "However, most of the reception to Windows 11 has been positive, especially as Microsoft were adamant in 2015 that there would not be a Windows 11 or 12. While the upcoming update of Windows 10, called ‘Sun Valley’ was showcasing some redesigned icons and explorer windows, Windows 11 looks to be a substantial update, justifying the name.",
    "If Windows 11 proves anything, it's that the last few months have shown me that the reception of Windows Vista could have been so much better if development went smoother, and the communication was once again clearer.",
    "Both Vista and 11 are two sides of the same coin to me – both with similar aims, but with muddled communication from Microsoft.",
    "The company should clear up the confusion of the processor requirements and TPM fast. Even almost two weeks on since the announcement, we’re not crystal clear on just which PCs are eligible for an update.",
    "Windows Vista showed promise but faltered at the last hurdle with a bungled rollout, high system requirements and a bloated operating system. Windows 11 shows even more promise, but risks tripping up if Microsoft still isn't clear as to whether TPM will really matter once it's released later this year.",
    "As Star Trek’s Mister Spock once said, in a twist to his catchphrase: ‘The needs of the few outweigh the needs of the many’. And it seems like Microsoft may be relying on its high-end users here to update to Windows 11, even at the expense of more casual users who don’t update their machines every year and may miss out on a useful update such as Windows 11.",
    "Microsoft has been known to learn from their past mistakes, such as Windows 8 and the announcement of the Xbox One. But with the release of Windows 11 already looming, users will be looking to see if the company will release clearer information on how to upgrade their machines, and avoid the repeat of Windows Vista."
  ],
  "headers": {
    "4": "The good cop, bad cop routine",
    "8": "Windows Vista 2.0"
  },
  "links": {
    "that have confused": "https://www.techradar.com/news/windows-11-system-requirements-are-bad-news-for-old-laptops-and-pcs"
  }
}