{
  "source": "https://www.techradar.com/news/chris-evans-could-play-captain-america-again-but-in-which-marvel-movie",
  "title": "Chris Evans appears to shoot down report he'll play Captain America again (updated)",
  "category": "entertainment",
  "updated": "2021-01-15T09:10:39Z",
  "author": "samuel-roberts",
  "summary": "A new report says the actor is close to returning to the MCU, but he doesn't",
  "article": [
    "Update: Chris Evans appears to have shot this rumor down.",
    "Original story: Chris Evans, who played Captain America until Avengers: Endgame, is reportedly close to reprising the role of Steve Rogers in another Marvel project. That's according to Deadline, which suggests the deal isn't totally done yet, but that it could lead to a second appearance in a Marvel property beyond this new one.",
    "The other important caveat is that sources in the report suggest this probably isn't for a new Captain America movie – and is instead more comparable to Robert Downey Jr's supporting appearances in Captain America: Civil War and Spider-Man: Homecoming.",
    "Marvel didn't comment, and while the track record of Deadline is pretty great as an industry publication, you'll want to wait for an official announcement before getting too excited.",
    "At the end of Avengers: Endgame, Steve Rogers returned the Infinity Stones to their respective timelines, spent a long life with Peggy Carter and then handed the shield over to Sam Wilson (Anthony Mackie). It was largely expected that this would mark the end of Evans' time playing the character.",
    "Still, the appetite to see Evans reprise the role is no doubt incredibly high.",
    "There are so many ways Steve Rogers could return: in flashback, for example, or from an alternative reality, especially as Marvel begins experimenting with the concept of a Multiverse. We could also see how Steve returned the Infinity Stones to each timeline at the end of Endgame – although you could argue that tale is better left to the imagination.",
    "However they do it, Evans' return would no doubt delight fans. Despite having three solo movies and appearing in four Avengers films – not to mention his brief cameo in Thor: The Dark World – Steve Rogers proved to be one of the most textured characters of the MCU, with a relatively deep personal journey through the series.",
    "That arc did feel like it ended conclusively. But in the world of comics, there's always another Captain America story to tell."
  ],
  "headers": {
    "6": "Where could Cap appear?"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/01/captain-america-eyes-return-to-the-mcu-as-chris-evans-nears-deal-to-reprise-role-in-future-marvel-project-1234672430/"
  }
}