{
  "source": "https://www.techradar.com/news/3d-printing-is-back-and-set-for-a-worldwide-surge",
  "title": "3D printing is back and set for a worldwide surge",
  "category": "computing",
  "updated": "2021-04-08T20:20:57Z",
  "author": "anthony-spadafora",
  "summary": "3D-printed parts market will see huge growth this decade",
  "article": [
    "As 3D printers have become more affordable and 3D printing is increasingly being used for more than prototypes and one-off parts, the industry has the potential to significantly disrupt traditional manufacturing according to a new report from Lux Research.",
    "Data from the firm's new “Will 3D Printing Replace Conventional Manufacturing?” report suggests that the total 3D printing market will reach $51bn in 2030 driven mainly by growth in production parts. The report also highlights the 3D printing market size and growth by application and material.",
    "Research director at Lux Research and of the the lead authors of the report, Anthony Schiavo provided further insight on how 3D printing has the potential to upend the current manufacturing landscape in a press release, saying:",
    "\"3D printing will be a key in the future manufacturing landscape thanks to benefits that it can bring over injection molding, machining, casting, or other conventional methods. These benefits include customization and personalization, the ability to create complex geometries, part consolidation, and in some cases lowering costs.\"",
    "Lux Research's report also found that the value of 3D-printed parts will rise at a 15 percent compound annual growth rate (CAGR) over the next decade from $12bn in 2020 to $51bn in 2030.",
    "According to Schiavo, the largest share of this growth will be in end-use parts that are just 23 percent of the market today but will reach a 38 percent share in 2030. Industries that will account for the largest share of these end-use parts include the medical and dental industries which will reach $4.5bn in 2030 followed by aerospace at $3.9bn.",
    "At the same time, while 3D printing for manufacturing matures, strategies will shift. Vertical integration is critical today but horizontal specialists will be able to to capture more profits in the future. However, the relative immaturity of 3D printing as a manufacturing technology means that well-integrated ecosystems will be a requirement to be competitive."
  ],
  "headers": {
    "4": "3D-printed parts"
  },
  "links": {
    "3D printers": "https://www.techradar.com/best/best-3d-printers",
    "3D printing": "https://www.techradar.com/news/3d-printing-revenue-set-to-boom-this-year",
    "Will 3D Printing Replace Conventional Manufacturing?": "https://www.luxresearchinc.com/will-3d-printing-replace-conventional-manufacturing",
    "press release": "https://www.prnewswire.com/news-releases/lux-research-forecasts-the-3d-printing-market-will-reach-51-billion-in-2030-301264573.html#:~:text=The%20total%203D%20printing%20market,research%20and%20innovation%20advisory%20services.&text=As%203D%20printing%20for%20manufacturing%20matures%2C%20strategies%20will%20shift.",
    "3D-printed parts": "https://www.techradar.com/news/3d-printing-is-helping-to-tackle-nuclear-waste",
    "medical": "https://www.techradar.com/news/sinterex-aims-to-become-a-specialist-in-healthcare-3d-printing",
    "dental": "https://www.techradar.com/news/dentists-could-soon-be-3d-printing-your-crowns-dentures-and-more",
    "aerospace": "https://www.techradar.com/news/computing-components/printers-and-scanners/why-3d-printing-is-an-unmissable-opportunity-for-aerospace-and-defence-sectors-1240485"
  }
}