{
  "source": "https://www.techradar.com/news/yet-more-amd-and-nvidia-gpus-could-be-coming-including-rx-6600-and-rtx-3050-models",
  "title": "Yet more AMD and Nvidia GPUs could be coming – including RX 6600 and RTX 3050 models",
  "category": "components",
  "updated": "2021-03-29T09:20:48Z",
  "author": "darren-allan",
  "summary": "RTX 3050 and Ti versions are inbound, along with RX 6700, 6600 and 6600 XT",
  "article": [
    "A bunch of new graphics cards from both AMD and Nvidia, including the RTX 3050 Ti plus a mobile variant of that GPU, could be on the horizon – at least going by some fresh additions to AIDA64’s supported cards.",
    "AIDA64 is a system diagnostics and benchmarking tool, and in the past new GPUs have been spotted in the software before their release; but as ever, treat this info with caution. As VideoCardz (which reported this) points out, this should in no way be treated as any kind of confirmation – but it certainly indicates these GPUs are expected.",
    "Theoretically, going by the new entries in the latest beta version of AIDA64, Nvidia has RTX 3050 and 3050 Ti graphics cards inbound for laptops, as well as an RTX 3050 Ti for desktop PCs (all built on the GA107 GPU or its mobile variant).",
    "What backs this up and strengthens the possibility of these releases, of course, is that we’ve seen strong rumors of some of these products already, particularly the GeForce RTX 3050 Ti mobile graphics card, which has been spotted in leaks of both Asus and Samsung laptops. It’s expected to carry 4GB of GDDR6 VRAM and 2,560 CUDA cores. The supposed vanilla RTX 3050 has been similarly rumored for quite some time now, too, so it would be no surprise to see these GPUs pitch up soon.",
    "The much-talked-about desktop RTX 3080 Ti is also mentioned, but it has popped up in AIDA64 before. The grapevine already holds that the 3080 Ti could be here as soon as next month, possibly being followed by the RTX 3070 Ti in May (but that model isn’t mentioned here, of course).",
    "On the AMD front, we have sightings of the Radeon RX 6700 and 6600, as well as the 6600 XT in AIDA64 (with the 6600 versions using the Navi 23 GPU, and Navi 22 for the 6700).",
    "AMD recently launched the RX 6700 XT, and as we’ve seen, its purported RX 6700 sibling, plus two RX 6600 models, have also been regulars from the rumor mill of late. We’ve heard that the RX 6700 may have 6GB and 12GB versions, and the 6600 XT could also match that latter 12GB memory configuration.",
    "Even with all the previous speculation flying around here, we still need to be careful around assuming the existence of these GPUs with too much conviction – but clearly there will be more wallet-friendly options coming from Nvidia and AMD. The question is when, and these entries in AIDA64 suggest it’ll be sooner rather than later, despite potential stock concerns."
  ],
  "headers": {
    "5": "AMD rivals"
  },
  "links": {
    "the RTX 3050 Ti": "https://www.techradar.com/news/nvidia-rtx-3050-rtx-3050-ti-and-rtx-3060-might-debut-at-ces-next-week",
    "VideoCardz": "https://videocardz.com/newz/aida64-gets-support-for-geforce-rtx-3050-ti-and-radeon-rx-6600-xt",
    "Asus": "https://www.techradar.com/news/nvidia-rtx-3050-ti-gpu-could-soon-power-up-budget-gaming-laptops",
    "Samsung laptops": "https://www.techradar.com/news/nvidia-rtx-3050-ti-gpu-spotted-in-leak",
    "RTX 3050 has been similarly rumored for quite some time now": "https://www.techradar.com/news/nvidia-rtx-3050-rtx-3050-ti-and-rtx-3060-might-debut-at-ces-next-week",
    "grapevine already holds that the 3080 Ti could be here as soon as next month": "https://www.techradar.com/news/nvidia-could-be-about-to-hit-amd-hard-with-launch-of-rtx-3080-ti-and-3070-ti-gpus",
    "RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "RX 6700 may have 6GB": "https://www.techradar.com/news/amd-rx-6700-leak-sparks-worries-that-it-wont-have-enough-memory",
    "6600 XT could also match that latter 12GB memory configuration": "https://www.techradar.com/news/amd-rx-6700-and-6600-xt-gpus-could-both-load-up-with-12gb-vram"
  }
}