{
  "source": "https://www.techradar.com/news/nintendo-switch-is-finally-getting-one-of-the-best-games-of-the-last-decade",
  "title": "Nintendo Switch is finally getting one of the best games of the last decade",
  "category": "entertainment",
  "updated": "2021-02-18T11:00:26Z",
  "author": "vikki-blake",
  "summary": "Nintendo confirms a summer 2021 release window for Outer Wilds",
  "article": [
    "Critically-acclaimed time loop game Outer Wilds is finally coming to Nintendo Switch. The announcement dropped during yesterday's Nintendo Direct, where it was given the approximate release window of summer (or Q2 for those of you living below the equator) 2021.",
    "Outer Wilds is a charming out-of-this-world action-adventure game developed by Mobius Digital. You play as an unnamed astronaut stuck in a time loop who can only explore the solar system in 22-minute chunks before the sun explodes.",
    "While it may sound a little frustrating, it's surprisingly good fun, and it's essentially a long mystery game where you're trying to piece together what happened to an ancient civilization.",
    "It's been available on PC and Xbox One since it launched in May 2019, and joined PlayStation 4 later that same year. Below, you can take a look at it in action on Nintendo Switch:",
    "Outer Wilds was one of our top games of 2019. We said it was special because there's a sense that the places you discover have their own cultures, architecture and people – they're places that are homes, rather than just resource repositories to exploit, and we're treated to a warm, welcoming adventure filled with cosmic mystery and puzzles.",
    "It’s a game for those who want to take their time, to explore every corner of the planets they visit, and learn about their diversity. You’ll die and be reborn many times, but it’s presented so elegantly that you’ll be smiling all the way rather than biting your controller in frustration. Honest."
  ],
  "headers": {
    "4": "Why should you care that Outer Wilds is coming to Nintendo Switch?"
  },
  "links": {
    "Nintendo Direct": "https://www.techradar.com/news/the-first-nintendo-direct-in-over-a-year-kicks-off-tomorrow-heres-what-to-expect",
    "top games of 2019": "https://www.techradar.com/news/pc-games-2019-the-best-games-that-came-out-this-year"
  }
}