{
  "source": "https://www.techradar.com/news/chromecast-with-google-tv-just-gained-another-premium-music-streaming-service",
  "title": "Chromecast with Google TV just gained another premium music streaming service",
  "category": "televisions",
  "updated": "2021-02-25T22:57:06Z",
  "author": "nick-pino",
  "summary": "Amazon Music is now available on Google TV and Android TV devices",
  "article": [
    "Google and Amazon announced today that the companies are bringing the Amazon Music app to Google TV and Android TV devices, including the Chromecast with Google TV, Nvidia Shield and Sony smart TVs.",
    "The app should be available now on Android TV's Google Play Store on devices in 12 countries including the US, UK, Canada, Brazil, Mexico, Germany, France, Italy, Spain, India, Japan and Australia.",
    "The app supports both Amazon Music Unlimited, Amazon’s premier music streaming service that has over 70 million songs available on-demand, and the regular version of Amazon Music that’s included with your Amazon Prime subscription that has over two million songs.",
    "If you don’t subscribe to either of those services but still want to see what the app is all about, Amazon Music has a free, ad-supported selection of top playlists and stations that are available to everyone.",
    "While the availability of the Amazon Music app on Android TV devices isn’t the biggest news item of the day, it does represent a shift from the walled-garden approach companies like Google, Apple and Amazon have sometimes taken in the past when it comes to their services.",
    "To this day, these companies still won’t even sell each other’s devices in their respective stores to this day - a move that can force users into sticking with one company for multiple services.",
    "Admittedly, bringing one music streaming app to the other’s smart TV platform doesn’t do much to change things, but hopefully it shows that collaboration can be just as effective as competition... at least when it comes to music streaming services."
  ],
  "headers": {
    "4": "More music for everyone"
  },
  "links": {
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "Nvidia Shield": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review"
  }
}