{
  "source": "https://www.techradar.com/news/wandavision-episode-8s-mid-credits-scene-explained",
  "title": "WandaVision episode 8's mid-credits scene explained",
  "category": "entertainment",
  "updated": "2021-02-26T19:02:16Z",
  "author": "tom-power",
  "summary": "Spoilers are incoming",
  "article": [
    "It goes without saying but, if you haven’t seen WandaVision episode 8 yet, turn back now. Spoilers follow.",
    "Like episode 7, WandaVision episode 8 has a mid-credits scene – but unlike last week's episode, this one is much heavier on plot. Featuring the return of Vision (sort of, anyway), the sting suggests that WandaVision episode 9 is heading towards a gigantic MCU battle within Westview.",
    "Below, we'll explain what the mid-credits scene in WandaVision episode 8 means, and how the image of a 'white' Vision has origins in Marvel's comics. We'll also take a few guesses at what next week's finale will entail.",
    "Once the main credits have rolled, we’re reunited with SWORD’s acting director Tyler Hayward (Josh Stamberg) in his new temporary base outside of the Hex. A soldier informs Hayward that something is ready to be \"launched\" (which was hinted at in episode 7), and we follow Hayward and his underling into a nearby tent.",
    "Hayward comments on the fact that SWORD has tried to put something back together millions of times without success, but that has now changed thanks to a new power supply “directly from the source”. The camera pans to the Stark Industries drone that Wanda destroyed back in episode five, which is still glowing with her chaos magic.",
    "Hayward instructs his team to turn an elaborate machine on, which siphons chaos magic from the drone and feeds it into a glass cabinet that houses a mysterious, white figure. The camera pans up, and, surprise surprise, it’s none other than a more android form of Vision. The colorless version of the synthezoid powers up before white Vision’s eyes open. The ‘newborn’ Vision looks down at his hand as Hayward and co. look on before the screen cuts to black.",
    "White Vision is the product of Hayward’s Project Cataract. In WandaVision episode six, Dr. Darcy Lewis (Kat Dennings) hacked into SWORD’s database and uncovered secret files that were only viewable to Hayward and his inner circle.",
    "Now, we know what the real motive behind this project was. As we witnessed in WandaVision episode 5, SWORD was experimenting on Vision’s dead body when Wanda seemingly broke into the facility and stole his remains. Of course, one of episode eight’s flashbacks shows that Hayward had doctored that security camera footage to make it look like Wanda had illegally entered SWORD’s premises and violated Vision’s living will to steal his body back.",
    "In fact, Wanda didn’t forcefully take Vision’s dead body to reanimate him. She couldn’t feel his presence when she entered SWORD’s laboratory and used her magic on the hole in his head where the Mind Stone should be, so she left peacefully. As a result, Hayward was able to continue his experiments on Vision’s remains and bring him back online – albeit with a different complexion and apparently no memories of who he was.",
    "White Vision, or Gray Vision as he’s sometimes known, has appeared in Marvel’s comic books in the past. WandaVision’s new aesthetic for the character is based on a well-known 1989 comic arc called 'Vision Quest'. During this storyline, Vision is abducted and dismantled by rogue United States government agents led by a character named Cameron Brock. It seems that Hayward is based on Brock but, unlike his comic counterpart, Hayward doesn’t appear to have been manipulated by a time traveling entry called Immortus.",
    "The Avengers are able to recover Vision’s remains, and Dr. Hank Pym is able to reassemble him. However, Simon Williams – who also goes by the superhero alias Wonder Man – refuses to help bring back Vision’s old personality. Wonder Man’s own brainwaves had originally been used as the foundation for Vision’s emotional makeup and, given that this was done without Wonder Man’s consent, Williams is dead against the idea. With no emotions to speak of and a discoloration brought on by his dismantling, Vision is resurrected as an emotionless, colorless synthezoid.",
    "White Vision ends up fighting alongside the Avengers in the comics, and his silver and purple complexion does return after he’s rebuilt again down the line. We aren’t sure if that will be the case for the MCU’s interpretation of white Vision, but we have our thoughts on how that could work later on.",
    "Why wasn’t Vision brought back as gray Vision? Well, we’ve already seen Vision as a lifeless, gray version of himself in the MCU. That’s the color that remained once Thanos had ripped the Mind Stone out of Vision’s head in Avengers: Infinity War. It makes sense that WandaVision opted for a white version of the character, then, to prevent any confusion between these two iterations.",
    "With the white Vision now online, it appears that we’ll get a three-way battle between various factions. We have Wanda, Vision and Monica on one side, Hayward and this other Vision on another, and Agatha Harkness and 'Quicksilver' at the third point of the triangle. So we can expect a typical MCU throwdown in the final episode.",
    "We didn’t see Wanda’s recreation of Vision in episode 8, but we know that he’s en route back to her after he left Darcy in episode 7. Right now all signs point towards Vision and white Vision duking it out while Wanda and Agatha have their own skirmish, with Monica and Pietro involved in some capacity too. The mid-season trailer had a brief scene where Vision says to Wanda “So let’s fight for it”, which hints that the duo will battle for the town of Westview – or Wanda’s altered reality version of it – so we know an MCU-style battle is coming.",
    "It’s unclear what powers White Vision will possess, but he is a by-product of Wanda’s chaos magic, so it stands to reason that he’ll have similar powers to her or Vision. We can expect him to have superhuman strength and speed, the ability to fly, and potentially phase through objects like Vision can. What we don’t know is whether white Vision has a Mind Stone-esque beam ability, as witnessed in Vision's past appearances. The mid-credits scene shows that he has an icon where Vision’s head-based Mind Stone is, but it remains to be seen if that houses a superpower that white Vision can use or not.",
    "It’s also possible that white Vision could be the future of the MCU’s version of the character. He’s already powered by Wanda’s chaos magic, so she may be able to talk him round to their side. Alternatively, Wanda may find a way to transfer Vision’s consciousness into white Vision, which would allow him to continue existing in the MCU post-WandaVision.",
    "That is unless this Vision imposter has to be destroyed. Given that it is Hayward’s creation, he might have installed something that prevents Wanda or Vision from convincing white Vision to join their cause.",
    "If white Vision remains a foe, it may need to be killed in order to save Westview and the world, and bring Wanda some form of closure from the trauma she has endured. We’ll find out how WandaVision ends, and whether Vision will be part of the MCU going forward, when the series finale releases on March 5."
  ],
  "headers": {
    "3": "WandaVision episode 8 mid-credits scene explained: what is white Vision?",
    "6": "What is white Vision?",
    "9": "Does white Vision appear in the comics?",
    "13": "What will white Vision’s role in WandaVision be?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "WandaVision episode 8": "https://www.techradar.com/news/wandavision-episode-8-recap-review",
    "WandaVision episode 5": "https://www.techradar.com/news/wandavision-episode-5-recap-review"
  }
}