{
  "source": "https://www.techradar.com/news/amazons-lord-of-the-rings-has-found-its-composer-and-its-a-perfect-fit",
  "title": "Amazon's Lord of the Rings has found its composer – and it's a perfect fit",
  "category": "entertainment",
  "updated": "2021-09-20T08:55:16Z",
  "author": "tom-power",
  "summary": "Howard Shore may be returning to Middle Earth again",
  "article": [
    "Amazon Studios is reportedly in talks with Howard Shore about composing the score to its upcoming Lord of the Rings TV show.",
    "Per Deadline, Shore is considering a return to Middle Earth, with the Oscar-winning composer speaking with Amazon about writing the music for the series.",
    "At the moment, there's no word on how long Shore and Amazon Studios have been in discussions for. If Amazon's Lord of the Rings show manages to recruit Shore, though, it'll be a major coup for the TV series.",
    "Shore, who has scored other notable productions including The Departed, The Silence of the Lambs and Philadelphia, previously won three Oscars for his work on Peter Jackson's Lord of the Rings movie trilogy.",
    "The Canadian composer landed two Best Original Score Academy Awards for The Fellowship of the Rings and The Return of the King in 2001 and 2003 respectively. Shore also earned himself a third Oscar for Best Original Sony at the 2003 Academy Awards for The Return of the King's 'Into the West', which was sung by Annie Lennox.",
    "Following his stint on the Lord of the Rings trilogy, Shore returned to pen the music for Peter Jackson's Hobbit film trilogy between 2012 and 2014. More recently, Shore scored Netflix drama Pieces of a Woman and coming-of-age tale Funny Boy.",
    "If Shore signs onto Amazon's Lord of the Rings, it'll be his first work for a TV production since co-writing the theme song to The Tonight Show with Conan O'Brien in 2010.",
    "This isn't the first indication that we've had about Shore wanting to return to the Lord of the Rings franchise.",
    "In January, TechRadar entertainment reporter Tom Power (in his freelance days) spoke to Shore for Observer.com, and asked the legendary musician if he had spoken to Amazon about scoring their Lord of the Rings TV show. Unsurprisingly, Shore revealed he would be open to the possibility.",
    "\"I haven’t talked to the production [team] about it [Lord of the Rings],\" he said. \"I haven’t been following it, but I would consider it.\"",
    "Given Shore's history with the Lord of the Rings series, Amazon would have been silly not to broach the subject with Shore and his representatives. His work on the Lord of the Rings movie trilogy is regarded as one of the best film scores ever made. Shore's music for The Hobbit film trilogy, too, isn't to be sniffed at.",
    "If Amazon are successful in landing Shore, it'll be a perfect fit for its TV adaptation. There'll be plenty of continuity linking all three live-action productions through Shore's music, and he could even utilize elements from his six Lord of the Rings scores. Interspersing the TV show's score with music from the movies for, say, whenever the One Ring is on screen, would be a cool throwback and be immediately recognizable to diehard fans.",
    "With Amazon's Lord of the Rings series set in the Second Age, too, Shore would be able to craft new, distinguishable music for this specific period of Middle Earth's history.",
    "We're already on board with Shore's return, so there's only one thing that Amazon has to do right now: sign him up as soon as possible."
  ],
  "headers": {
    "7": "Analysis: Howard Shore is the ideal candidate for Amazon's Lord of the Rings"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/09/the-lord-of-the-rings-composer-howard-shore-score-amazon-tv-series-middle-earth-jrr-tolkien-1234839274/",
    "Observer.com": "https://observer.com/2021/01/howard-shore-pieces-of-a-woman-lord-of-the-rings/"
  }
}