{
  "source": "https://www.techradar.com/news/marvel-future-revolution-a-day-with-the-new-smartphone-superhero-mmo",
  "title": "Marvel Future Revolution: this smartphone MMO may be better than Marvel's Avengers",
  "category": "phones",
  "updated": "2021-08-27T10:00:33Z",
  "author": "david-lumb",
  "summary": "Marvel’s latest smartphone game is an MMO adventure – here’s what it’s like to play",
  "article": [
    "While we got to hear about Marvel Future Revolution early from the team at developer Netmarble, we didn’t have an idea of how all those systems and world-merging storyline’s (not to mention the 50-player battles) would fit together.",
    "Now that the game has been globally released, here’s how a Marvel mobile MMO works.",
    "Opening up the game throws you right into a fight, with the player controlling over half a dozen of Marvel’s greatest heroes as they struggle to stop a worlds-ending event called The Convergance. Instead, the alternate Earths combine into one, and players explore the new multi-themed cities and areas mish-mashing worlds together.",
    "As the game begins, players pick from a small roster of heroes – Captain America, Storm, Iron Man, Black Widow, Captain Marvel, Star-Lord, Doctor Strange, and Spider-Man – but there’s a deep customization of skills and costumes that makes them feel more personalized.",
    "Especially costumes, which the game’s developers seem to have a real respect for: you’ll pick up pieces of character outfits from different eras, but you’ll be able to change any equipment’s appearance for free to keep your look intact while upgrading your gear.",
    "That’s the kind of thoughtful, player-friendly design we were pleased to find throughout the game’s combat, upgrades, and cosmetics – a streamlining that’s downright essential given the complex systems that govern player progression. There are so many ways to improve your equipment, passive stat boosts, and overall hero collection that it can become dizzying.",
    "Equally overwhelming is the game itself, at least at first. True to Marvel and Netmarble’s claims, the game does feel like an MMO, with hordes of players and enemies filling a big world. The screen UI is pretty busy with a dozen buttons just for combat alongside quest reminders, menu buttons, a health bar, minimap, and so on.",
    "Play for a little while, though, and you start to make sense of the chaos, even appreciating the sets of interlocking systems that rain rewards on players for running around beating up bad guys. The game isn’t asking a lot of its players (at least at first), and it’s a fun ride to take your favorite hero out for a spin to fight classic enemies and explore worlds that evoke a classic Marvel tone.",
    "Despite playing on a small phone screen, Marvel Future Revolution feels like an MMO: big areas filled with plenty of enemies, non-player characters (NPCs), and other player-controlled heroes. You’ll run around well-detailed areas, chat with quest-givers and bystanders, and pick up collectibles in treasure chests.",
    "And like any MMO, there’s a good amount of repetition, from cleaning up ‘mobs’ (masses of enemy minions) to sidequests that amount to... cleaning up more mobs. Okay, most of the early tasks amount to beating up enemies, picking up an item or rescuing a civilian, and traveling to a new area. Rinse, repeat.",
    "Which would be more boring in a game that wasn’t crafted so well to keep you locked in to your Marvel hero fantasy. The technical polish shouldn’t be overstated. Visually, character models are very detailed, the world looks great with intricate and well-lit environments, and player abilities have vivid animations for a wide variety of effects from shield-throwing to webbing up foes to lightning storms. Those powers have great sound effects, too, and there’s a ton of good voice acting.",
    "With a cast of characters and villains familiar to MCU and comics fans, the game does an admirable job of nestling players in a world that feels like Marvel – and while enemies won’t pose much of a threat (it feels very difficult to die, at least in the early game), you’ll still feel like a superhero plowing through minions and villains.",
    "Every so often, the camera will zoom in for an over-shoulder cinematic look while a player hero performs a signature move. Heck, even the damage numbers have a comic book-feel with wham-bam-POW font and animation.",
    "Heroes are big, explosions are bigger, and running around beating up enemies is engaging ~ though it’s more the world you’re doing it in than the action you’re doing. That might be what eventually makes me fall off the game, but here’s what I’ll enjoy until then.",
    "Yep, it’s pretty rad to have so many options for each hero. At launch, there seem to be 18 sets of costumes (with four parts each: head, body, arms, and legs), which amounts to 72 elements to mix and match – but most of those sets have seven different palette swaps, bringing the total to 456. This makes the developers’ claims of ‘400 million combinations of different costume parts’ among all the starting heroes somewhat believable.",
    "The best part is that many of these are from comics history, recreating outfits from different eras and creator runs as well as alternate universe versions. There’s also entirely new costumes patterned after regions created for the game, like Hydra Empire, leading to Hugo Boss-ified duds for Captain America and Doctor Strange, or Asgardian-style ‘goddess of thunder’ armor from Midgardia for Storm.",
    "One thing I haven’t gotten to see are the massive 50-player battles that the game’s developers hyped up when I chatted with them before launch. While it’s fun to play through the single-player story cooked up for players – written by Marvel comics writer Marc Sumerak, who had previously worked on Marvel: Ultimate Alliance 3 and Future Revolution’s mobile game predecessor, Marvel Future Fight – I want to see how 50 players go head-to-head in one place.",
    "Granted, I’m already running around Future Revolution’s areas with a dozen other players while we all pursue various quests on our own, but I’m eager to see whether the massive player activity – which will include both player versus environment (PvE) and player versus player (PvP) combat – lives up to the hype.",
    "There’s a lot to explore in an MMO the first time around, but if you want to start another character – or in this case, hero – you’ll have to run through all the introductory missions and slowly grind your way up all over again. Like many other games, in Future Revolution, every character begins in the same starting area doing the same tasks, so it can quickly get repetitive to have to run through over and over.",
    "Unless you’re not the one doing the playing: unlike other games, Future Revolution has an auto-mode that, well, plays the game for you. Obviously this saps the fun if you’re letting the game play itself through new content, but if you wanted it to catch up a fresh character while you’re busy doing something else, like writing an article (my Black Widow is leveling up as we speak!), it’s nice to have the option.",
    "There are plenty of other reasons for auto-play, especially for accessibility reasons should players want to experience the game but get frustrated or tired of smartphone controls. Or maybe you want to let Marvel take the wheel to just enjoy the story.",
    "There’s other play-streamlining features that ease the grind, too, like tapping on a quest marker in the UI or the minimap to auto-travel to it. Or, if you don’t want to deal with the hassle of equipment and stat-boosting items, there are buttons to auto-equip gear for the most optimized build.",
    "Marvel Future Revolution isn’t for everyone, but it’s already an impressive game, and a great casual experience for fans who want more of the Marvel world on a platform they already own.",
    "Marvel's Avengers - the game developed by Crystal Dynamics that came out in 2020 -was a bit of a disappointment for many. We gave it a three star review on TechRadar, and this may be a great alternative for those who were also disappointed by that title.",
    "There’s a lot of neat touches for Marvel veterans in Future Revolution, too. Costumes aside, there’s a whole category of stat-boosting items consisting of covers of classic comic issues, and many of the heroes, enemies and villains are more obscure characters who don’t appear much in the mainstream Marvel films and shows.",
    "There’s still some kinks to be worked out – the game loses sound if you switch to a different app – and it drains a lot of battery with continuous play (and generates some impressive heat).",
    "But for MCU fans who are enjoying the Disney Plus shows and miss some of the bigger set pieces and action of the massive films, maybe Future Revolution will tide them over until they can see films as big as Avengers: Endgame in theaters again."
  ],
  "headers": {
    "8": "What’s it like to be a multiverse hero?",
    "14": "The costumes",
    "16": "The big battles",
    "18": "The auto-battles",
    "22": "The future"
  },
  "links": {
    "Marvel Future Revolution": "https://www.techradar.com/news/marvels-next-mobile-game-is-an-open-world-rpg-with-50-player-matches",
    "chatted": "https://www.techradar.com/news/marvels-next-mobile-game-is-an-open-world-rpg-with-50-player-matches",
    "Marvel's Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review"
  }
}