{
  "source": "https://www.techradar.com/news/amazfits-new-gts-2e-and-gtr-2e-cheap-smartwatches-are-official-and-coming-soon",
  "title": "Amazfit’s new GTS 2e and GTR 2e cheap smartwatches are official and coming soon",
  "category": "wearables",
  "updated": "2021-01-11T13:30:40Z",
  "author": "axel-metz",
  "summary": "The GTS 2e and GTR 2e offer big features for an affordable price",
  "article": [
    "Amazfit’s brand new smartwatches, the GTS 2e and GTR 2e, are coming to the US and UK, the company revealed at CES 2021.",
    "We had previously reported that the smartwatches were being released exclusively in China, but Amazfit today revealed the devices will be available from January 12 in North America via Amazfit’s official website and Amazon, with both models priced at $139.99.",
    "UK customers can also get their hands on the GTS 2e at Argos on January 12 (for £119), with the GTR 2e becoming available at a later date in 2021. We've yet to hear any information for those in Australia. Amazfit’s latest offerings are, as their names suggest, very similar to the GTS 2 and GTR 2, both of which were released in 2020. But these new devices differ from their predecessors in a few key ways.",
    "The first is their improved battery life. The GTS 2e and GTR 2e will last far longer between charges despite keeping the same battery capacity, thanks to the ditching of Wi-Fi connectivity that would otherwise eat into your runtime. It’s a trade-off that means you’ll need to keep the devices within Bluetooth distance of your phone to maintain full functionality, but it seems a worthy compromise given you can now go up to 45 days before running dry.",
    "The new smartwatches will also come with stress-level, heart-rate and sleep quality monitoring, suggesting the company is doubling down on delivering an all-round health protection experience. Another new feature is a blood-oxygen saturation measurement, meaning the GTS 2e and GTR 2e can monitor changes in your SpO2 levels to offer a better understanding of your physical condition when engaging in sustained physical activity.",
    "One missing feature from the Chinese release of the Amazfit products doesn't seem to be available on the US or UK devices, though. The GTS 2e and GTR 2e saw the addition of a new skin temperature sensor – like that found in the Fitbit Sense – to offer body temperature tracking as you sleep, which could alert you when you’re starting to become ill.",
    "The devices aren't able to read your core temperature, but it’s a neat new feature which hasn't earned a mention from Amazfit when the company has spoken about the smartwatches for other markets. TechRadar has asked Amazfit to confirm whether or not the feature is missing.",
    "On the face of it (pun intended), the main differences between Amazfit’s new smartwatches lie in their aesthetic. As with their predecessors, the GTS 2e has a square face, while the GTR 2e is round, with both offering a borderless, edge-to-edge display that uses curved glass to create an integrated visual experience.",
    "Both devices will feature an aluminium body to keep things lightweight while on the move, and incorporate vacuum coating to ensure the best resistance against scratches and general wear and tear.",
    "They will also be available in a selection of different colors: the GTS 2e comes in black, forest green and light pink, while the GTR 2e comes in black, light gray and mint green. The former boasts a rotatable, 1.65-inch HD AMOLED display, while the latter offers a smaller – but equally vivid – 1.39-inch display. Both smartwatches will feature a quick release mechanism to make their straps easily changeable.",
    "Among several other improvements over their predecessors – including improved haptic feedback, more sports modes and more intuitive voice assistance – the Amazfit GTR 2e and GTS 2e look set to offer smartwatch-wearers an affordable option should they be looking to upgrade their gear in 2021."
  ],
  "headers": {
    "7": "Cutting shapes"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "previously reported": "https://www.techradar.com/news/amazfit-reveals-a-pair-of-budget-smartwaches-to-challenge-the-fitbit-sense",
    "Amazfit’s official website": "https://us.amazfit.com/products/amazfit-gtr2e?utm_source=kol&utm_medium=cpc&utm_campaign=gtr2e",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08PCZKXN1%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1284393308370907100-20",
    "GTS 2": "https://www.techradar.com/reviews/amazfit-gts-2",
    "GTR 2": "https://www.techradar.com/reviews/amazfit-gtr-2",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense"
  }
}