{
  "source": "https://www.techradar.com/news/cloudflare-is-entering-the-email-security-game",
  "title": "Cloudflare is entering the email security game",
  "category": "computing",
  "updated": "2021-09-27T17:30:30Z",
  "author": "anthony-spadafora",
  "summary": "New solutions provide additional security and give users more control over their inboxes",
  "article": [
    "The web infrastructure company and CDN provider Cloudflare has announced that it is entering the email security business with new offerings to help solve email challenges while giving users more control over their inboxes.",
    "As part of the company's new offerings, users will be able to create custom email addresses, manage incoming email routing and prevent email spoofing and phishing on outgoing emails for free. However, Cloudflare will also offer an Advanced Email Security Suite that is tightly integrated with its Zero Trust solutions to provide businesses with a more holistic way to keep their companies and employees secure.",
    "First off, the company's new email routing tools will allow users to streamline email management with Cloudflare Email Routing which provides customers with more control over their email whether it's hosted Exchange, managed Office 365, Gmail, Google Workspace or even an old AOL address. For instance, a small business can have its own custom domain on its email addresses while managing everything from a consumer Gmail account.",
    "Co-founder and CEO of Cloudflare, Matthew Prince explained in a press release why the company has decided to enter the email security game, saying:",
    "“Customers have asked us to address email security for years. Today we’re announcing new tools that will help close the biggest remaining network security risk that Cloudflare hasn’t already covered, until now. We want to be the network that businesses of any size can plug into for all of their needs. While today marks our first step into this space, we ultimately hope to become the leader in email security.”",
    "In addition to Cloudflare Email Routing, the company also announced its new Email Security DNS Wizard to help users with an email address better protect their brand against phishing and spam.",
    "With Cloudflare's Email Security DNS Wizard, its customers can configure network records like Sender Policy Framework (SPF) or DomainKeys Identified Mail (DKIM) with one-click to protect from attackers misusing domains to send malicious emails.",
    "At the same time, the company's new solutions will also allow users to consolidate multiple email accounts into one unified inbox. Now users can have a custom domain email address that is automatically forwarded to their preferred mailbox such as Gmail or Outlook without anyone ever knowing it. This way their email will appear professional and on brand but they can still use their preferred email service and email client.",
    "Cloudflare's Advanced Email Security Suite meanwhile will offer full scanning of emails for security threats and work in front of any email hosting provider to supplement their anti-spam and security protections.",
    "Interested users that want to gain early access to Cloudflare Advanced Email Security Suite and contribute to its development can sign up here."
  ],
  "headers": {
    "5": "Email security"
  },
  "links": {
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "Cloudflare": "https://www.techradar.com/news/cloudflare-wants-to-help-you-build-flashier-websites-for-less",
    "Zero Trust": "https://www.techradar.com/news/cloudflare-one-can-monitor-all-your-business-networks",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "press release": "https://www.cloudflare.com/press-releases/2021/cloudflare-takes-on-email-security/",
    "Sender Policy Framework": "https://www.techradar.com/news/using-zero-trust-to-battle-email-impersonation-attacks",
    "DomainKeys Identified Mail": "https://www.techradar.com/news/us-presidential-candidates-arent-using-basic-email-security",
    "email service": "https://www.techradar.com/news/best-email-provider",
    "email client": "https://www.techradar.com/best/best-email-clients",
    "email hosting provider": "https://www.techradar.com/news/best-email-hosting-providers",
    "sign up here": "https://www.cloudflare.com/email-security/"
  }
}