{
  "source": "https://www.techradar.com/news/golden-globes-nominations-2021-full-list",
  "title": "Golden Globes 2021 nominations: see the full list of movies and TV shows here",
  "category": "entertainment",
  "updated": "2021-02-03T18:01:49Z",
  "author": "samuel-roberts",
  "summary": "Did your favorite make the cut?",
  "article": [
    "The Golden Globe 2021 nominations are in, and the diversity of nominees is improved in some categories from 2020's awards, even if big omissions remain. One year after the Golden Globes nominated no female film directors in its best director category, three have made the cut – Emerald Fennell (Promising Young Woman), Regina King (One Night in Miami) and Chloé Zhao (Nomadland, which comes to Hulu in the US on February 19).",
    "Netflix's Mank, the somewhat indulgent film about the making of Citizen Kane, gets a number of nominations. In fact, between Mank and The Trial of the Chicago 7, Netflix has two of the five movies nominated for Best Motion Picture – Drama. That makes sense when you consider the fact that many theaters have been closed over the past year.",
    "The most notable omission in the film categories is arguably that of Delroy Lindo, who blew us away in Spike Lee's Da 5 Bloods for Netflix last year. He didn't get nominated on the acting side, but Jared Leto did, for recently-released crime picture The Little Things (which currently has 48% positive reviews on Rotten Tomatoes).",
    "In TV, it's hard not to look at the categories and wonder if the pandemic has made for a slightly lesser year. Nonetheless, big hitters like The Queen's Gambit, Small Axe and Normal People got the credit they deserve – as did The Mandalorian, which is nominated for Best Television Drama.",
    "Still, a major omission on the TV side is Michaela Coel's I May Destroy You, which made TechRadar's list of the best TV shows of 2020, and deserved a shout here.",
    "The Golden Globe is traditionally considered an early predictor of the Oscars, but on some occasions in recent years, that hasn't been the case. Last year, Best Drama went to 1917. At the Oscars, Parasite won instead.",
    "The 2021 Golden Globes will be hosted by Tina Fey and Amy Poehler, and will air on February 28 at 5PM PT on NBC. When we get closer to the time, we'll let you know the easiest way to stream the Golden Globes anywhere in the world.",
    "Here are the nominees:",
    "Here's the weirdest category, which throws loads of supporting performances into one big bracket:",
    "And now for the film categories, which you'll find below."
  ],
  "headers": {
    "8": "Best Performance by an Actress in a Limited Series or Motion Picture Made for Television",
    "9": "Best Performance by an Actor in a Supporting Role in a Series, Limited Series or Motion Picture Made for Television",
    "10": "Best Original Song – Motion Picture"
  },
  "links": {
    "The Trial of the Chicago 7": "https://www.techradar.com/news/netflixs-the-trial-of-the-chicago-7-is-the-movie-you-need-to-stream-this-year",
    "The Queen's Gambit": "https://www.techradar.com/news/netflixs-the-queens-gambit-is-quietly-one-of-the-best-tv-shows-of-2020",
    "TechRadar's list of the best TV shows of 2020": "https://www.techradar.com/best/best-tv-shows-2020-new"
  }
}