{
  "source": "https://www.techradar.com/news/ericsson-no-longer-counting-on-chinese-5g-revenues",
  "title": "Ericsson no longer counting on Chinese 5G revenues",
  "category": "phones",
  "updated": "2021-07-19T09:21:29Z",
  "author": "steve-mccaskill",
  "summary": "Ericsson could get caught up in geopolitical row",
  "article": [
    "Ericsson reported organic sales of 8% during the second quarter of 2021 as demand for 5G equipment around the world increases but has warned investors that it no longer expects to benefit from some contracts agreed in China.",
    "The Swedish telecoms equipment manufacturer had secured 5G deals with all three major Chinese mobile operators, putting it in an ideal position to benefit from strong early momentum in the country.",
    "However, Sweden’s telecoms regulator has banned Huawei from supplying its 5G kit to Swedish operators on perceived national security grounds. It is therefore expected that China could retaliate and ban Ericsson from its domestic market.",
    "Given the wider geopolitical environment, Ericsson has decided it can no longer rely on the income.",
    "“We are well positioned to take advantage of continued market momentum with our competitive 5G product portfolio and cost structure However, it is prudent to forecast a materially lower market share in Mainland China for Networks and Digital Services as the earlier decision to exclude Chinese vendors from the Swedish 5G networks might influence market share awards.”",
    "Net sales were down slightly 1% to 54.9 billion SEK, however Ericsson said that when adjusted for various factors, revenues were up 8%.",
    "The Swedish network equipment manufacturer is one of the ‘big three’ in the Radio Access Network (RAN) market, along with Nokia and Huawei, and also provides a range of other products such as 5G core.",
    "Despite its possible struggles in China, Ericsson has been one of the main beneficiaries of Huawei’s exclusion from the US market. Only this week, it secured a five-year $8.3 billion contract with Verizon – the single largest deal in the company’s history.",
    "“Through proactive and continuous measures for supply chain resilience we have accelerated production to meet customer demand, and we are well prepared for any challenges in the future,” added Ekholm. “Our increased R&D investments have accelerated product development. We strengthened our Cloud RAN portfolio further with 5G mid-band and massive MIMO support for increased network performance.",
    "“The opportunity from enterprise for 5G provides an exciting growth path for Ericsson. We foresee 20-30% annual market growth in enterprise, with opportunities in automation, remote operations and safety management across whole industry sectors such as smart manufacturing, ports and airports, energy, mining, health and agriculture. We are confident that wireless will be the first-choice connection for global business in the 5G era.”"
  ],
  "headers": {
    "3": "Ericsson 5G"
  },
  "links": {}
}