{
  "source": "https://www.techradar.com/news/sony-teases-launch-of-new-vlogging-camera-next-week",
  "title": "Sony teases launch of new vlogging camera next week",
  "category": "cameras",
  "updated": "2021-07-01T09:07:13Z",
  "author": "mark-wilson",
  "summary": "One for the YouTubers, it seems",
  "article": [
    "Sony has revealed an intriguing teaser for the launch of a \"new camera\", which is taking place next week on July 7.",
    "The teaser from the official Sony Alpha Universe site doesn't give much away about what the camera will be, but includes the tagline \"capture more of your world\" and includes an image of a 'dead cat' windshield for a microphone.",
    "This strongly suggests that the new camera will be a video-focused camera for vloggers and YouTubers – so if you're in the market for one of those, it'll be well worth tuning into the live launch on July 7 at 10am EDT / 3pm BST, which works as 12am AEST on July 8 for those in Australia.",
    "While Sony is being cagey about the new announcement, we can make some educated guesses based on the style and color scheme of the teaser.",
    "Sony used a very similar multi-colored background for the launch of the Sony ZV-1, a compact vlogging camera that sits top of our guide to the best YouTube cameras. In fact, there's even a frame from that launch (below, which took place in May 2020) that looks almost identical to the one for its incoming camera.",
    "Does this mean Sony is launching a successor to the Sony ZV-1? It's possible, but with that camera still being relatively new, it seems more likely that it'll launch an alternative camera in a similar vein.",
    "Sony's big focus in the last 18 months has been launching compact, video-focused cameras for both professionals and amateur creators.",
    "That started with the arrival of the Sony ZV-1, which is a re-tooled version of its Sony RX100 series compact cameras, and was soon followed by the Sony A7S III in July 2020, a full-frame model that sits at the other end of the scale and has been hugely popular with filmmakers and YouTubers.",
    "Soon after, the full-frame Sony A7C arrived as a smaller, more affordable full-frame option for videographers, and we've also seen the Sony FX3 (which landed more recently in February) arrive as a similarly compact alternative in its Cinema line.",
    "In between all of this, stills photographers have been slightly frustrated by the lack of new photography-focused models, with no sign of the long-awaited Sony A7 IV. And this new teaser suggests that photographers hoping for that model will have to wait until after the launch another video-focused camera.",
    "This is good news for video creators, but what could the new launch be? Sony's strategy for its video cameras has been to rework existing models with a new video focus – the Sony ZV-1 came from its RX100 series compacts, while the Sony A7C is effectively a cross between its APS-C A6000 series and full-frame Sony A7 series.",
    "The rumors so far have suggested that the incoming model might follow the theme of the latter, only including an APS-C sensor rather than a full-frame one. If so, that would make it a more affordable option than the Sony A7C, but we'll have to wait for the full announcement to be sure. We'll see you there on July 7."
  ],
  "headers": {
    "6": "Video first"
  },
  "links": {
    "Sony Alpha Universe": "https://alphauniverse.com/stories/capture-more-of-your-world-new-sony-camera-announcement-on-july-7-2021/",
    "live launch": "https://www.youtube.com/watch?v=_qwMOP4Vnmo",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "best YouTube cameras": "https://www.techradar.com/best/best-youtube-camera",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Sony A7C": "https://www.techradar.com/news/the-sony-a7c-is-a-tiny-full-frame-vlogging-camera-with-a-big-price-tag",
    "Sony A7 IV": "https://www.techradar.com/reviews/sony-a7-iv"
  }
}