{
  "source": "https://www.techradar.com/news/google-drive-is-getting-an-important-security-upgrade",
  "title": "Google Drive is getting an important security upgrade",
  "category": "computing",
  "updated": "2021-02-18T06:11:35Z",
  "author": "anthony-spadafora",
  "summary": "Sharing links with the right colleague in Google Drive has never been simpler",
  "article": [
    "Sharing files with other members of your organization is about to get a whole lot easier in Google Drive as Google has updated its cloud storage service with a new security feature.",
    "Admins can now define specific audiences with whom users can link-share Google Drive files with in an effort to help keep organizational data secure while also making it simpler for them to share files with the right colleagues.",
    "This feature was initially released in beta during August of last year and since that time, Google has made two important changes based on user feedback. The search giant has increased the maximum number of target audiences a user can recommend from three to five and it has also made it possible for admins to add any group as a target audience including groups that belong to different organizations.",
    "Not only will this new feature help improve security but it will also save Google Drive users time by reducing the need to manage sharing requests from multiple individuals.",
    "Previously admins could choose between allowing users to link-share files to either their entire domain or anyone with the link in Google Drive.",
    "Now with target audiences though, admins can define and recommend more granular link-sharing options for users at their organization. This change will help improve the security posture at businesses that use Drive by making it harder for information to be shared with users outside of their organization.",
    "To enable this feature, admins will need to find Drive's target audience settings by heading to the Admin console, going to Director and clicking on Target audiences. Here they'll be able to assign target audiences at the group or OU level.",
    "Being able to share links to documents quickly is one of the main reasons so many businesses have shifted their workloads to the cloud. However, sharing links with unintended users can undermine an organization's security which is why Google is rolling out this new feature to paid Google Workspace users."
  ],
  "headers": {
    "4": "Link-sharing"
  },
  "links": {
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "share files": "https://www.techradar.com/best/best-apps-to-share-files-securely",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace"
  }
}