{
  "source": "https://www.techradar.com/news/the-communications-industry-and-the-cloud-getting-it-right",
  "title": "The communications industry and the cloud: getting it right",
  "category": "computing",
  "updated": "2021-04-09T11:07:53Z",
  "author": "francesco-venturini",
  "summary": "How CSPs can get cloud right",
  "article": [
    "It is a fact that cloud computing is transforming the Communications industry. From IT modernization to network virtualization, with a large impact on the go-to-market as well, the cloud is currently driving most Communications Service Provider (CSP) transformation strategies. But sometimes the business case isn’t clear and often the options for doing it wrong can be clearer than the path to doing it right.",
    "The last decade has been a period of intense disruption and transformation in the communications industry, fueled by emerging technologies, innovative new services, and a complete shift in business models. And this transformation is only going to accelerate in the years to come as the world becomes hyperconnected through 5G networks.",
    "However, as this opportunity creates a new value chain at the intersection of Connectivity and Cloud, it is not just open to the telecom sector, but it also offers new territory that can be captured by the Cloud hyperscalers, platform companies, and various other ecosystem players.",
    "For each of them, a new set of cloud-driven opportunities are being created, software and technology is quickly becoming a differentiator, platforms are becoming open and standard, adoption of data and AI is accelerating, and modern design and engineering practices are paving the way to increased competition in the marketplace.",
    "To save themselves from being left behind, CSPs no longer have a choice but to become a “telco-tech” organization, using technology innovation as the key differentiator and the enabler to capture trapped value. Cloud, data exploitation and a new value-centric operating model become the foundations of this new path.",
    "So, what is the opportunity Cloud offers for CSPs? Certainly, there’s an angle of migration and gradual modernization, with a business case substantially driven by cost optimization, efficiency and resilience. But Cloud offers so much more. It will be the driving force behind not only a new economic path offering business sustainability for the future, but also completely new processes, operating models, organizations, and products and services.",
    "Cloud becomes the foundation for CSPs to capitalize on emerging opportunities. First of all, accelerating the adoption and automation of digital channels and building the basis to transform data into insights across the whole enterprise. With this foundation, CSPs can expand into the digital home, which is a largely untapped opportunity. Also through Cloud, CSPs have a huge opportunity to help SMBs drive their economic recovery through extended services in commerce, online collaboration communication, and security. And finally, incorporating 5G Cloud edge to their networks and expanding their platform including real-time data, security, and software services, CSPs have the option to build a unique platform to drive the Connected Industry/B2B2X large enterprise opportunity.",
    "To spearhead their customers’ digital innovation, there are several principles CSPs need to keep in mind when accelerating their move to the cloud.",
    "The first is scalability, achieved through the adoption of a multi-cloud strategy, whereby both public cloud and hybrid models are used to take advantage of the strengths of multiple providers and delivering increased flexibility through choice. Maximizing hyperscalers is key to a multi-cloud strategy, but a clear strategy for their adoption of IT, network, and go-to-market approach must be clearly defined and organically executed. Jio, for example, is working with Microsoft Azure as it prepares to take advantage of 5G opportunities in India. The partnership combines Jio’s IT infrastructure with Microsoft Azure’s cloud platform, using data centers across the country to accelerate transformation on a national scale.",
    "Cloud also has the potential to optimize costs, but only if the CSPs embrace it to consequently reinvent their process and financial models to be leaner and more flexible. This is not a gentle adjustment; this is a distinct shift of processes to adapt the cost curve. Rakuten Mobile achieved this when it launched a fully virtualized cloud-native mobile network last year, completely reinventing how the network is built and operated. This helped Rakuten Mobile reduce their network operating costs to 30% lower than other mobile operators, as well as develop and launch software more quickly than their competitors.",
    "Speed is another essential principle closely tied to reinvention. Rapid change has traditionally not come easily to CSPs, which often have longstanding cultures and structures in place that impede progress. But to maximize cloud opportunity and keep up with ongoing innovation, CSPs need to transform at pace, as well as scale. This means adopting new cloud architect skills, new composite team organizations, and agile methodologies, that will help to open up new and unexplored value opportunities in digital services.",
    "In conclusion, CSPs will approach and experience their cloud journeys very differently, depending on their own situations, business drivers, and ambitions. And each will encounter their own challenges along the way. But there’s one thing not to forget: it’s not enough to simply migrate to the cloud. Any company can do that, and it doesn’t inherently generate any significant, sustainable competitive advantage.",
    "Thus, the final leg of the cloud journey is the ultimate end game for CSPs: a complete transformation of the CSP into a telco-tech company. That’s a software-based company that leverages intelligence and innovation, through a new operating model driven by the Cloud and an open and secure software foundation. The telco-tech paradigm puts technology at the core of the business and innovation strategy of the CSP, and fundamentally, is the path to doing Cloud right."
  ],
  "headers": {
    "5": "First, embrace the opportunity to innovate",
    "7": "Remember the guiding principles",
    "11": "Beware of ‘Lift and Shift’"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "5G": "https://www.techradar.com/best/best-5g-phones",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "IT infrastructure": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}