{
  "source": "https://www.techradar.com/news/lesbian-love-syndrome-a-history-of-yuri-and-lesbian-romance-in-gaming",
  "title": "Lesbian love syndrome: a history of Yuri and lesbian romance in gaming",
  "category": "gaming",
  "updated": "2021-01-24T14:00:50Z",
  "author": "georgina-young",
  "summary": "The great lesbian architects of the Yuri genre",
  "article": [
    "No matter who you are, and no matter your gender or sexuality, you can experience your own elicit lesbian love affair through the magic of games. Whether you stirred your beans with Sera in Dragon Age: Inquisition, slipped Samantha Traynor the tongue in Mass Effect 3, or boogied with any of the bisexual ladies in Fable, Fire Emblem: Three Houses, or Fallout 4, many of us have taken the opportunity to flirt with a feminine fling.",
    "However, we often think of explicit sexual relationships between women portrayed in the media as purposefully produced for an assumed male gaze. While this can be the case, it does a disservice to the great lesbian architects, who paved the way for their stories and representations in modern media.",
    "In 1919, Japanese novelist Nobuko Yoshiya released her semi-autobiographical novel Two Virgins in the Attic, a story about a woman who experiences her sexual awakening when she falls in love with her dorm mate. While lesbian attraction or sexual experiences in adolescence was known to, and in, the Japanese mainstream as class ‘S’ experiences, the Japanese name for what we in the West think of as a ‘phase’, it was often expected that women should mature past these and lead a traditional life. Yoshiya was letting women know – for the first time – that this was not the only outcome available to them. In an Encyclopedia of Lesbian and Gay Histories and Cultures, Jennifer E. Robertson commented:",
    "“Yoshiya's shoujo fiction, which dwelled on passionate friendship and a world without dominant males, inspired the emergence of a reflexive subculture.”",
    "The genre became known as Yuri, and eventually broke out of novels and into pop culture in the 1970s, when Ryoko Yamagishi, an author who “has always been fascinated by that which is queer”, created her manga, Our White Room, about a Japanese girl forced to go to an all-girls Catholic boarding school in France. While, in Yoshiya’s work, the romantic relationship and even the homosexual crush the pair shared were only connotated, Yamagishi’s work was much more overt, describing frankly her own homosexual experiences. Even though this practice was still taboo in a largely conservative Japanese society, she wanted to bring these hidden practices to the forefront.",
    "In an interview written for Bungeishunju books, Yamagishi says:",
    "“I’m certainly not afraid of taboos. It might seem perverted, but it’s more about wanting to shock the reader with those themes. Sensible people can step on the brakes and control the impulses that they want to express. But they can’t become artists that capture people’s hearts. I say to young people that only those who can expose their shame can become manga artists.”",
    "Yamagishi and Yoshida’s first expressions of lesbian love affairs were written by women for women. This meant that aside from explicit declarations of same-sex love, though examples of these were also present, there was a larger variety of implicit types of female affection and romance in the genre. The reader is left to fill in the gaps themselves, a process called \"making visible the invisible lesbian.\"",
    "Since these early works, Japan had made some progress in its representation and depiction of same-sex relationships. By the 1990s, while these relationships were still met with disapproval within Japanese society, in pop culture queer themes were commonly explored. Gay couples could be overtly presented in anime and manga in their home country, although they were often hetronormalized in the American release.",
    "Western audiences probably experienced their first Yuri storyline when season three of the anime series Sailor Moon introduced the same-sex romance between Sailor Uranus and Sailor Neptune in 1994. This was at a time when sapphic relationships were rare in Western media and almost non-existent in programs intended for children – indeed, the couple were first localized as cousins instead of lovers. Still, Sailor Moon and its creator, Naoko Takeuchi, led young women all over the world to realize for the first time that falling in love with your female companions was nothing out of the ordinary. Sailor Uranus, a woman with male characteristics, or otokoyaku – a Japanese theatrical term for women who play male parts – was adored and fawned over by female fans and critics alike.",
    "It wasn’t long before games followed suit, moving women's homoerotic experiences to the forefront. The SaGa series, known for having multiple different storylines based on the player’s choice of protagonist, featured its first lesbian narrative, written by Miwa Shoda, in 1997. Players who choose Asellus in SaGa Frontier will experience the touching courtship between her and Princess White Rose, who helps Asellus escape their castle following ridicule for her status as the only half-mystic in existence. Players took to the new protagonist, and SaGa Frontier went on to be the 29th best-selling PlayStation game of all time in Japan (according to Game Data Library).",
    "Lesbian romance was slowly becoming an accepted part of the gaming mainstream, but developers were – and still are – shy of creating games purely for a femme audience. This is potentially due to the commonly perceived notion that women simply don’t buy games, and developing games for a subset of women – an entirely homosexual feminine audience – remains a somewhat alien concept for many developers. Women who like women can be happily accommodated as an option, but rarely are stories made exclusively for us.",
    "Since the turn of the millennium, there have been a whole slew of games featuring changeable gender for the protagonist, and same-sex relationship opportunities as a result – although there are varying levels of inclusion of lesbian affairs in these titles. We’ve seen this from games such as Skyrim, Summon Night, and Persona 3 Portable, where the romance is the same with characters regardless of the protagonist's gender, to titles like Stardew Valley and Assassin's Creed Odyssey, where some NPCs are only romanceable for female characters. Then there are titles like Mirror's Edge, Bayonetta 2, and Rule of Rose, where only the feminine intimacy is overt, but outward expressions of sexuality remain covert.",
    "The key with these games is that while there is enjoyment to be had through the exploration of these girl-on-girl relationships, there’s something for the heterosexual male player too. Not just the titillation of watching two women go at it – these games are very tame in terms of salacious content, but the fact that the relationship which the player may or may not choose to participate in is not at the core of the gameplay. Even in games such as Life is Strange: Before the Storm and The Last of Us Part II, where the female protagonist is exclusively interested in homoerotic relations, these characteristics are merely part of a wider story, with a range of different styles of gameplay at the core which can appeal to a diverse audience.",
    "This is where Yuri narrative-based games come into play, in which the story is focused solely on these lesbian fantasies. While many of these games border on the erotic or downright pornographic, with many series mostly aimed at a male audience, a small number of Yuri games for women have started to emerge, which focus more on intimacy and coming to terms with a woman's own sexual awakening – series such as Nurse Love and Yumeutsutsu follow a female protagonist who can fall in love with any of their female co-workers. The popularity of this style of visual novel spawned increasing interest in the West with releases such as VA-11 HALL-A, where you take on the role of Jill a lesbian bartender in love with her boss, or Gone Home which tells the story of a woman's discovery of her sister's homosexual relationship.",
    "So the next time you’re whiling away your time making two of your girl sims do ‘woohoo’, take a moment to reflect on the long history of talented lesbians and women in the arts; women such as Nobuko Yoshiya and Ryoko Yamagishi, whose lives and storytelling gifts have lead to the popularization and inclusion of sapphic themes in today's mainstream media."
  ],
  "headers": {
    "2": "Making the invisible visible",
    "8": "Go West",
    "12": "Maybe gay but why not bi?"
  },
  "links": {
    "Fallout 4": "https://www.techradar.com/news/gaming/fallout-4-the-good-the-bad-and-the-ugly-of-the-boston-wastelands-1308511",
    "Game Data Library": "https://sites.google.com/site/gamedatalibrary/games-by-platform/playstation",
    "Stardew Valley": "https://www.techradar.com/news/games-of-the-generation-stardew-valley-is-a-welcome-break-from-the-chaos-of-the-world",
    "Assassin's Creed Odyssey": "https://www.techradar.com/news/assassins-creed-odyssey-review",
    "The Last of Us Part II": "https://www.techradar.com/reviews/the-last-of-us-2-review"
  }
}