{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-might-not-be-delayed-by-much-but-at-a-big-cost",
  "title": "Samsung Galaxy S21 FE release date might not be delayed by much - but at a big cost",
  "category": "phones",
  "updated": "2021-07-02T16:59:44Z",
  "author": "aakash-jhaveri",
  "summary": "Another Samsung flagship launch hurt by chipset shortage",
  "article": [
    "The Samsung Galaxy S21 Fan Edition is expected to bring flagship-grade features to a mid-range price point when it launches later this year, however a new development suggests that the release might be delayed, and the phone might not be as powerful as previously thought.",
    "A report from Korean news outlet Maeil states that Samsung is currently facing chipset supply issues - that's an issue that's plaguing the whole tech world, and is likely to blame for the Galaxy Note 21 being possibly canceled - and because of it, the Galaxy S21 FE's release will apparently be pushed back to the end of 2021 — much later than the expected August announcement.",
    "Moreover, it's said that Samsung is considering a last-minute switch to Exynos chipsets to circumvent the chipset shortage, which is a brand of processor it makes itself. For context, the Samsung Galaxy S21 FE was expected to be powered by the Snapdragon 888 made by Qualcomm, just like the flagship S21 series in the US. It’s unclear which in-house processor is in consideration, but the Exynos 2100 seems to be the most likely candidate, as that was used in Galaxy S21 deals in certain regions.",
    "Another strategy Samsung is apparently considering is to offer Snapdragon and Exynos variants of the Samsung Galaxy S21 FE, with some markets such as the US and Europe getting Snapdragon chipsets, while other regions are powered by Exynos.",
    "Samsung already follows the same strategy for its S series and Note series devices globally, but not with the FE variants. Samsung fans in certain regions have previously criticized this approach, as Snapdragon chipsets tend to be more powerful than their Exynos equivalents, so some regions of the world have suffered with weaker phones.",
    "It sounds like Samsung planned to only produce the Galaxy S21 FE with the more powerful Snapdragon chipset, but could be forced to use the weaker Exnyos as well in order to ensure the phone isn't delayed even further. Some people might be happy that the phone isn't pushed back into 2022, but others might malign the compromise Samsung is having to make in the chipset department.",
    "This is all speculation and rumors right now. We'll have to wait for the Samsung Galaxy S21 FE launch to know for certain what the situation is, but hopefully we won't have to wait too long."
  ],
  "headers": {
    "3": "A chipset downgrade"
  },
  "links": {
    "Samsung Galaxy S21 Fan Edition": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Maeil": "https://m.mk.co.kr/news/business/view/2021/06/633565/",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "flagship S21 series": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy S21 deals": "https://www.techradar.com/deals/best-samsung-galaxy-s21-deals"
  }
}