{
  "source": "https://www.techradar.com/news/5-things-we-love-about-the-ring-video-doorbell-pro-2-and-2-things-we-dont",
  "title": "5 things we love about the Ring Video Doorbell Pro 2 and 2 things we don’t",
  "category": "smart-home",
  "updated": "2021-02-28T09:00:18Z",
  "author": "carrie-ann-skinner",
  "summary": "From ‘head-to-toe’ view to colorized night vision",
  "article": [
    "The Ring Video Doorbell Pro 2 , the rumored successor to Ring's top-of-the-range Video Doorbell Pro, was officially confirmed this week. The mains-powered doorbell is available to pre-order now, and will go on sale on March 31 in the US and the UK, and on April 1 in Australia.",
    "On the surface, Ring’s newest flagship smart doorbell looks just like its predecessor, the Ring Video Doorbell Pro, but Ring has teased several under-the-hood tweaks that, it says, makes it the brand’s most advanced wired video doorbell to date. As you’d expect then, the Ring Video Doorbell Pro 2 is also the company’s most expensive video doorbell, priced at $249.99 / £219 / AU$399.99.",
    "We've picked out some things that we love about the new Ring Video Doorbell Pro 2, as well as a couple of features that we were disappointed not to see in Ring’s top-of-the-range wired doorbell.",
    "Can't wait for the Video Doorbell Pro 2 to arrive? Then check out the best prices for Ring doorbells below",
    "The biggest improvement to arrive on the Ring Video Doorbell Pro 2 is the boost to resolution: video is now recorded at 1526 x 1536 as opposed to the Full HD footage of the Ring Video Doorbell Pro. This puts Ring’s latest wired doorbell on an equal footing with its rival, the Arlo Video Doorbell, and means that video will be more crisp, with details clearly visible.",
    "Another positive change with the new model is that, thanks to a 150-degree square field of view, you can now see the full length of anyone on your doorstep, including any packages on the floor by their feet, enabling you to keep track of your deliveries more easily.",
    "In a first for Ring, the Ring Video Doorbell Pro 2 includes a radar that can be used to set ‘virtual’ thresholds, so the doorbell only starts recording and pushes out motion alerts if an object or person has crossed that threshold. According to Ring, this should reduce the number of false-positive – a person walking past your property, for example – activity alerts. The radar is also used in the new ‘Birds Eye View’ feature, which provides an aerial map of the exact path the object or person took to provide a better understanding of what triggered the activity alert.",
    "Unlike the Ring Video Doorbell Pro, which was supplied with four shades of faceplate in the box, the Ring Video Doorbell Pro 2 only comes with one, silver-colored unit. However, once the latter has been set up, you’ll be issued a voucher that can be exchanged for another faceplate free of charge. There are 16 colors to choose from including red, green and purple, so you can make your video doorbell look as striking or as discreet as you like.",
    "In the US, the Ring Video Doorbell Pro 2 will support the Alexa Greetings feature, which enables Amazon's voice assistant to ‘answer’ the door and take a message if you’re unable to do so yourself. The feature has already been introduced on the Ring Video Doorbell Pro, and is one of three 'Smart Responses’ being rolled out, although not all are available on all models. However, there's no word over whether Alexa Greetings and the other Smart Responses will be made available in regions outside the US.",
    "Ring says the new Video Doorbell Pro 2 will come with color night vision. When pressed, the company wouldn’t go into any detail about the feature but did state it would work in a similar way to the existing Ring Video Doorbell Pro. This means it isn’t full-color night vision; instead, it’s colorized night vision, where simulated-color is applied to areas of ambient light in the video. At present, none of the best video doorbells feature full-color night vision, and including the feature would have been a good way for Ring to stand out from the crowd.",
    "Google’s rival to the Ring Video Doorbell Pro comes with facial recognition. Nest Hello captures every face that approaches the door, allowing you to tag those belonging to your family and friends. The next time they arrive or leave, you’ll receive a notification stating who it is – which can offer great peace of mind, particularly if you have children that are traveling to and from school alone. We love this feature, and considering the Ring Video Doorbell Pro 2 is priced at a similar level as the Nest Hello, we think it would have been a good way to compete with its rival."
  ],
  "headers": {
    "4": "Better resolution",
    "5": "Head-to-toe view",
    "6": "Fewer unwanted motion alerts",
    "7": "More choice in faceplates",
    "8": "Alexa Greetings",
    "9": "Lack of full colour night vision",
    "10": "Facial recognition"
  },
  "links": {
    "Ring Video Doorbell Pro 2": "https://www.techradar.com/reviews/ring-video-doorbell-pro-2-review",
    "Video Doorbell Pro": "https://www.techradar.com/reviews/ring-video-doorbell-pro-review",
    "pre-order now": "https://www.techradar.com/news/ring-video-doorbell-pro-2-is-confirmed-and-its-available-to-pre-order-now",
    "Arlo Video Doorbell": "https://www.techradar.com/reviews/arlo-video-doorbell-review",
    "Alexa Greetings": "https://www.techradar.com/news/alexa-can-now-answer-your-ring-doorbell-and-take-a-message-if-you-cant",
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "Nest Hello": "https://www.techradar.com/reviews/nest-hello"
  }
}