{
  "source": "https://www.techradar.com/news/ratchet-and-clank-rift-apart-looks-gorgeous-in-new-ps5-gameplay-photo-mode-confirmed",
  "title": "Ratchet and Clank: Rift Apart looks gorgeous in new PS5 gameplay, photo mode confirmed",
  "category": "gaming",
  "updated": "2021-04-29T21:32:51Z",
  "author": "samuel-tolbert",
  "summary": "Interdimensional weapons collection",
  "article": [
    "Today, Sony held another State of Play presentation, this time primarily focused on Insomniac Games' upcoming PS5 exclusive Ratchet and Clank: Rift Apart.",
    "The gameplay footage showed off some of Ratchet's new moves, such as his dash and wallrunning capabilities, as well as gameplay of the newly-introduced Rivet, a female Lombax who players will also get to control. The two of them share an incredible arsenal of weapons and gadgets, with both new gear and returning staples of the franchise.",
    "All of these guns and tools are designed to feel unique due to the implementation of DualSense haptic feedback and adaptive triggers. Insomniac Games is harnessing the PS5's SSD speed to load entire levels every time a dimensional rift is opened, it's not just a simple arena swap.",
    "Finally, the presentation also confirmed the inclusion of a photo mode, so you won't have to stress about how you're taking the perfect show. You can check out the new gameplay footage in its entirety below:",
    "Ratchet and Clank: Rift Apart is slated to arrive for the PS5 on June 11, 2021.",
    "Two indie titles were also shown during this State of Play presentation. First up is Subnautica: Below Zero, which is coming to PS5 on May 14, 2021. It's targeting 60 FPS in performance mode, with DualSense implementation for the icy environment and fearsome foes.",
    "Finally, PlayStation is getting super Sus as Innersloth's hit Among Us is coming to PS4 and PS5 at some point later in 2021, and will even feature a Ratchet and Clank outfit exclusive to Sony console version of Among Us, though no exact release date or any other details (such as cross-play) were given."
  ],
  "headers": {
    "5": "Indies on the way"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "newly-introduced Rivet": "https://www.techradar.com/news/ratchet-and-clank-rift-apart-ps5-trailer-shows-off-the-new-female-lombax-rivet",
    "DualSense haptic feedback and adaptive triggers": "https://www.androidcentral.com/list-ps5-games-dualsense-haptic-feedback-adaptive-triggers"
  }
}