{
  "source": "https://www.techradar.com/news/bitcoin-price-hits-new-record-high-after-tesla-confirms-dollar15bn-purchase",
  "title": "Bitcoin price hits new record high after Tesla confirms $1.5bn purchase",
  "category": "computing",
  "updated": "2021-02-08T23:42:49Z",
  "author": "anthony-spadafora",
  "summary": "Tesla will soon start accepting payments in bitcoin for its products",
  "article": [
    "In a recent filing with the US Securities and Exchange Commission (SEC), Tesla announced that it has purchased $1.5bn worth of bitcoin which helped push the price of the cryptocurrency past $40k per coin.",
    "According to the filing, the US automaker said that it updated its investment policy in January to provide the company “with more flexibility to further diversify and maximize returns” on its cash. As part of the policy, Tesla plans to invest a portion of its cash reserves into “digital assets, gold bullion, gold exchange-traded funds and other assets as specified in the future”.",
    "In addition to buying $1.5bn in bitcoin, Tesla also revealed that it will soon start accepting payments in the cryptocurrency for its products on a limited basis, making it the first automaker to do so. The bitcoin purchased by the company will provide it with the liquidity it will need once it starts accepting cryptocurrency payments.",
    "At the end of last year, Tesla has over $19bn in cash and cash equivalents according to its fourth quarter and full year financial results, making its purchase of $1.5bn in bitcoin a big investment.",
    "Following the company's announcement, Bitcoin surged to new highs to reach a price of $45k at the time of writing. At the same time though, the company's shares were up by over two percent after the announcement.",
    "Tesla CEO Elon Musk has long been a proponent of the power of cryptocurrencies and in the past, he has taken to Twitter to share his thoughts on bitcoin. More recently though, he added #bitcoin to his bio on the social network which helped increase bitcoin's price by as much as 20 percent.",
    "Musk has also helped drive up the price of the cryptocurrency Dogecoin that was created by IBM software engineer Billy Markus and Adobe software engineer Jackson Palmer. In fact in a recent tweet, Musk made the claim that “Dogecoin is the people’s crypto”.",
    "Depending on how well Tesla's plans to accept bitcoin as payment for its products goes, we could possibly soon see other large businesses follow suit.",
    "Via CNBC"
  ],
  "headers": {
    "3": "Cryptocurrency push"
  },
  "links": {
    "bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "the filing": "https://www.sec.gov/Archives/edgar/data/1318605/000156459021004599/tsla-10k_20201231.htm",
    "Tesla": "https://www.techradar.com/news/tesla-will-make-its-fully-autonomous-mode-accessible-to-more-drivers",
    "fourth quarter and full year financial results": "https://ir.tesla.com/press-release/tesla-releases-fourth-quarter-and-full-year-2020-financial-results",
    "Twitter": "https://www.techradar.com/news/twitter-is-moving-more-of-its-platform-on-to-google-cloud",
    "Dogecoin": "https://www.techradar.com/news/what-is-dogecoin-all-you-need-to-know-about-the-meme-cryptocurrency-explained",
    "recent tweet": "https://twitter.com/elonmusk/status/1357241340313141249",
    "CNBC": "https://www.cnbc.com/2021/02/08/tesla-buys-1point5-billion-in-bitcoin.html"
  }
}