{
  "source": "https://www.techradar.com/news/5-things-we-saw-at-the-samsung-galaxy-s21-launch-including-one-you-may-have-missed",
  "title": "5 things we saw at the Samsung Galaxy S21 launch - including one you may have missed",
  "category": "phones",
  "updated": "2021-01-22T17:13:10Z",
  "author": "david-lumb",
  "summary": "The Samsung S21, S Pen, Galaxy Buds Pro, and more",
  "article": [
    "The Samsung Galaxy S21 phones have officially launched, and they’re a lot like we expected, thanks to plenty of leaks and rumors – but there’s still plenty to talk about. Here’s five things we saw at the Samsung Galaxy S21 launch event.",
    "Unsurprisingly, the phones are the focus: the Samsung S21 range follows the three-phone format of the Samsung Galaxy S20 phones, with a standard, Plus, and Ultra model. There have been some improvements...and some features and specs dropped in order to drop the price down to levels we haven’t seen in years.",
    "Contrast this belt-tightening with the Samsung Galaxy S21 Ultra, which is the most premium smartphone Samsung’s ever released. It packs two rear telephoto lenses, a 5,000mAh battery, and S Pen support.",
    "It wasn’t just phones, though: we also saw new noise-cancelling headphones, the Samsung Buds Pro, and Tile-like SmartTags you can clip to anything you don’t want to lose...along with new ways to use your devices to interact with cars.",
    "Sound like a lot? We'll walk you through it.",
    "The trio of Samsung Galaxy 21 phones were obviously the main draw to the launch event, and had an enticing new draw: they’re all cheaper than last year’s 5G models, and they’re coming out January 29.",
    "The Samsung Galaxy S21 price starts at $799 / £769 / AU$1,249, while the Samsung Galaxy S21 Plus cost begins at $999 / £949 / AU$1,549 and the S21 Ultra starts at $1,199 / £1,149 / AU$1,849 – saving $200 (and varying amounts in the UK and Australia) compared to the prices of the Samsung Galaxy S20, Galaxy S20 Plus, and Galaxy S20 Ultra from last year.",
    "That said, the S21 and S21 Plus both make compromises to get to those prices, with flat 1080 x 2400 AMOLED displays (6.2-inch and 6.7-inch screens, respectively) instead of the 1440 x 3200 resolution found in the S20 phones, though both have refresh rates maxing out at 120Hz.",
    "They also start at 8GB of RAM, instead of the 12GB base storage of the S20 line. Most challenging of all: they do not have a microSD slot, leaving owners unable to expand storage and reliant on a larger base storage level or space in the cloud. And in a final cost-cutting measure, Samsung dropped the wall charger block and earbuds previously included in every phone box. Yes, just like Apple.",
    "All three phones pack a Snapdragon 888 or Exynos 2100 chipset, baseline 8GB of RAM and 128GB of storage (12GB for the Ultra), large 4,500mAh/4,800mAh/5,000mAh battery (for S21/Plus/Ultra, respectively), and new improvements to camera modes. The S21 and S21 Plus both have triple rear cameras more or less the same as their S20 predecessors (12MP main, 64MP telephoto, 12MP ultra-wide).",
    "The S21 Ultra has plenty more to justify its higher cost than previous premium models: 12GB of base RAM, WQHD (1440 x 3200) resolution and 120Hz refresh rate simultaneously, and two rear telephoto lenses (3x optical and 10x optical zoom) to pair with the 108MP main shooter and ultra-wide camera...",
    "And it works with an S Pen.",
    "Yes, the S Pen is compatible with the S21 Ultra alone, which is the first time a non-Note phone has supported the stylus. That’s led to speculation (and supporting rumors) that an S Pen-equipped S21 Ultra spells doom for the Note line, though a Samsung employee allegedly affirmed that there will be another phone (potentially the Note 21) coming out this year.",
    "It’s nice to see S Pen support extend to other phones, and in addition to the other perks, makes the S21 Ultra more of a bargain than ever (especially with its lower price compared to the S20 Ultra 5G). It also stands superior to the Note 20 Ultra, and makes us wonder if there will be another Note phone.",
    "There’s no slot inside the new premium phone to house the stylus, but it can be housed on the side of dedicated cases. The S Pen is sold separately and available now – though there is also a more advanced S Pen Pro that will go on sale soon. Check our guide for the difference.",
    "As with prior S-series launches, the S21 arrived with new true wireless earbuds: the Samsung Galaxy Buds Pro. These noise-cancelling earbuds aim to rival Apple’s AirPods Pro.",
    "The Galaxy Buds Pro are slimmer earbuds than the Galaxy Buds, but not bean-shaped like the Galaxy Buds Live. In our early testing, we enjoyed some of the automatic noise cancellation tech, which matches its level to ambient noise levels, and intelligently lowers audio volume when it detects you're having a conversation IRL, then raises it when you're done talking.",
    "The Galaxy Buds Pro go on sale on January 15 in the US and other regions, and will cost $199 / £219 / AU$349 – which is notably cheaper than the AirPods Pro's price ($249 / £249 / AU$399).",
    "The Samsung SmartTags are Tile-like trackers that you can clip to objects to track with your phone. Specifically, you can use the SmartThings app to find it using Bluetooth signals to tell how close the clipped object is to the phone, and even works when the tag is offline or out of range, given you can find the history of tag locations.",
    "SmartTags are diamond-shaped accessories with a hole to slot in your keys, a pet’s collar, or whatever else. There’s a single button that you can assign to a smart-home function, like turning on your lights at home or setting the temperature.",
    "The SmartTags go on sale January 29 alongside the Samsung Galaxy S21; each will cost $29 / £29 (around AU$37), though they’ll also come in two- and four-packs. There’s a SmartTags Plus tracker coming, too, which uses UWB (ultra wide-band) tech for more accurate location data while also using the AR Finder on your phone to find the tags.",
    "The Samsung Galaxy S21 Plus and S21 Ultra can be used as car keys. Yes, really. Thanks to new ultra-wideband (UWB) tech in the phones (which first debuted in Apple iPhone 12 series), you can unlock your car by simply walking close to it.",
    "Samsung has partnered with Audi, BMW, Ford, and Genesis to work with its digital keys, though we don’t know which models and in which countries the tech will work in – though the soonest we might get them is 2022.",
    "Obviously, that means this feature won’t be useful in the S21 Plus and Ultra for awhile, but good news: UWB, and digital keys, will work with the Galaxy Note 20 Ultra and Galaxy Z Fold 2."
  ],
  "headers": {
    "5": "Samsung Galaxy S21, S21 Plus, and S21 Ultra",
    "12": "S Pen: the top accessory for the top phone",
    "15": "Samsung Galaxy Buds Pro: AirPods Pro rivals",
    "18": "Samsung SmartTags",
    "21": "UWB: Unlock your car with the S21 Plus and S21 Ultra"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "SmartTags": "https://www.techradar.com/news/samsung-galaxy-smarttag-release-date-price-design-and-features",
    "Samsung Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "S20 Ultra 5G": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "guide": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-works-with-an-s-pen-pro-but-what-does-it-do-differently",
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Samsung SmartTags": "https://www.techradar.com/news/samsung-galaxy-smarttag-release-date-price-design-and-features",
    "car keys": "https://www.techradar.com/news/you-can-use-the-new-samsung-galaxy-s21-as-a-car-key",
    "Apple iPhone 12": "https://www.techradar.com/reviews/iphone-12"
  }
}