{
  "source": "https://www.techradar.com/news/netflixs-army-of-the-dead-prequel-movie-gets-a-synopsis-heres-what-it-could-mean",
  "title": "Netflix's Army of the Dead prequel movie gets a synopsis - here's what it could mean",
  "category": "entertainment",
  "updated": "2021-05-12T13:26:54Z",
  "author": "tom-power",
  "summary": "Army of Thieves is reportedly coming to Netflix sometime this year",
  "article": [
    "Army of the Dead has almost arrived on Netflix, and fans are eager to watch Zack Snyder's newest movie when it lands on May 21.",
    "That doesn't mean that the Army of the Dead universe will be done and dusted once the zombie heist film launches, though. There are currently two spin-offs in the works at Netflix, and now we have an official synopsis for one that should land on the streamer in 2021.",
    "Army of Thieves will be a prequel film to Army of the Dead, and it'll star Matthias Schweighöfer's German safe cracker Dieter. We didn't know what this movie would entail, apart from the fact that it should arrive later this year, but we have an official premise to go alongside that launch date now.",
    "According to the movie's official Netflix page, Army of Thieves will see \"a mysterious woman recruit bank teller Dieter to assist in a heist of impossible-to-crack safes across Europe\".",
    "As well as starring in It, Schweighöfer has directed the heist flick, which draws from a screenplay written by Shay Hatten. It'll serve as Dieter's origin story, which is based on a story developed by Hatten and Zack Snyder. The movie will also star Game of Thrones' Nathalie Emmanuel and Jamestown's Stuart Martin among others.",
    "It's unlikely. Given that Army of Thieves' synopsis specifically mentions that Dieter is hired to crack open safes \"across Europe\", it's not expected that the film will be centered around the undead.",
    "That appears to have been confirmed as much by Schweighöfer, too. In an interview with io9 ahead of Army of the Dead's release, the German actor said that Army of Thieves \"is not a zombie movie\".",
    "However, we could get some zombie elements in Army of Thieves, even if they aren't extensive. In the same io9 article, Schweighöfer teased that \"maybe we have zombies in it\", which suggested that we might see what Dieter gets up to before Army of the Dead's events.",
    "Schweighöfer hinted at Dieter's \"crazy\" backstory in a ScreenRant article recently, so we should see how he eventually winds up in the US after his Europe-spanning adventures.",
    "\"I just finished a prequel for my character, so everything is in that film,\" he said. \"But the biography was that Dieter was - I can't say that, because it's a spoiler alert. You will love the prequel. His way to America is awesome. It's crazy.\"",
    "That \"way to America\" quote can be taken as being ambiguous, too. Army of Thieves may reveal what Dieter was up to once he travels to the US, and before the Las Vegas zombie outbreak occurs, given that Army of the Dead takes place in the aftermath of that event.",
    "If Army of Thieves shows how Dieter survived the Las Vegas zombie outbreak, we may invariably see him encounter some if he's in the city at the time of the epidemic. This would lead nicely into how he comes to be part of the crew put together by Scott Ward (Dave Bautista) in Army of the Dead.",
    "We'll be covering Army of the Dead extensively ahead of, and after launch, so ensure you check back on TechRadar for our weekend chat with Snyder and the cast. We'll also have our review and spoiler-based content landing next week.",
    "Army of the Dead will launch exclusively on Netflix on May 21, while Army of Thieves is scheduled to arrive sometime in 2021."
  ],
  "headers": {
    "5": "Analysis: will Army of Thieves be a zombie movie?"
  },
  "links": {
    "official Netflix page": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3074542349507575000/https://www.netflix.com/title/81185548",
    "io9": "https://io9.gizmodo.com/army-of-the-dead-s-spinoff-star-talks-safe-cracking-and-1846840401",
    "ScreenRant": "https://screenrant.com/army-dead-prequel-movie-dieter-backstory-matthias-schweighofer/"
  }
}