{
  "source": "https://www.techradar.com/news/range-rover-will-be-first-all-electric-land-rover-and-it-gets-its-biggest-screens-ever",
  "title": "Range Rover will be first all-electric Land Rover, and it gets its biggest screens ever",
  "category": "car-tech",
  "updated": "2021-10-26T19:45:59Z",
  "author": "john-mccann",
  "summary": "While plug-in hybrid gets huge range boost",
  "article": [
    "Land Rover has announced its luxury SUV, the Range Rover, will be offered with a fully electric drivetrain in 2024.",
    "The announcement was made alongside the introduction of the new Range Rover, which boasts a wide array of technology, and an enhanced plug-in hybrid with a much improved electric range.",
    "The all-electric Range Rover will be the first Land Rover to offer a drivetrain with no combustion engine, and it will mark the first of six new all-electric vehicles that will follow in the proceeding years.",
    "While we're yet to see a Land Rover EV, it's one half of the Jaguar Land Rover outfit, and Jaguar's high-acclaimed, fully electric I-Pace has been around for more than three years - which means there's already plenty of EV knowledge and know-how in the building.",
    "Land Rover hasn't revealed anything else about the first fully electric Range Rover, but it did reveal the vast array of technology it's bringing to its newly announced 2022 model.",
    "Amazon's voice assistant Alexa is fully integrated into the infotainment system, allowing you to check the news and weather, adjust car functions such as the navigation and audio, and control your home (such as lights and the garage door) with your voice.",
    "The new 2022 Range Rover also features wireless Apple CarPlay and Android Auto, removing the need to fumble around for a cable to connect your smartphone to the vehicle. You can just get in and it connects automatically. There's a wireless phone charging pad in the center console as well, ensuring you stay completely wire-free.",
    "You'll also get two massive screens -the biggest Land Rover has ever used - with a central 13.1-inch, curved infotainment display featuring haptic feedback, coupled with a 13.7-inch driver display.",
    "And if that wasn't enough, there's also the option to have two, 11.4-inch rear-seat entertainment displays, both of which can be operated independently.",
    "There's HDMI inputs for the screens, but if you connect them to a Wi-Fi hotspot rear-seat passengers will be able to use and watch smart TV applications while on the move.",
    "And for another layer of additional decadence, an 8-inch touch screen can be built into the armrest between the rear seats (when Executive Rear Seats are chosen) providing controls for seat functions such as heating and massage.",
    "Land Rover also claims its cabin air purification system can \"significantly reduce odors, bacteria and allergens including SARS-CoV-2 virus\"",
    "The Range Rover has been available as a plug-in hybrid (PHEV) for several years, offering a fully electric range of up to 25 miles, but the new Range Rover will significantly enhance this figure.",
    "According to Land Rover, the new, extended range PHEV Range Rover models - the P440e and P510e - will offer up to 62 miles / 100km of all-electric driving from a 38.2kW battery.",
    "Land Rover does admit it expects real-world range to be around 50 miles / 80km, but that's still double what its predecessor could do, and means more journeys can be made without calling on a combustion engine.",
    "The P510e won't be a slouch either, with a touted 0-60mph time of just 5.3 seconds, however when driving in EV mode speed will be limited to 87mph / 140km/h.",
    "Pricing for the PHEV Range Rover models has yet to be confirmed, but with the new Range Rover price starting at £94,400 (around $129,000 / AU$170,000), they certainly won't be cheap.",
    "If you're interested in the plug-in hybrid drivetrains on the new Range Rover you'll have to wait until early 2022 before being able to place an order, while orders for the non-hybrid models can be made from October 26, 2021."
  ],
  "headers": {
    "7": "Biggest screens ever",
    "12": "Doubling the PHEV range"
  },
  "links": {}
}