{
  "source": "https://www.techradar.com/news/surface-duo-update-could-make-it-the-ultimate-xbox-game-pass-machine",
  "title": "Microsoft's Surface Duo could become the ultimate Xbox Game Pass machine",
  "category": "gaming",
  "updated": "2021-03-19T17:26:50Z",
  "author": "adam-vjestica",
  "summary": "Dual-screen dream",
  "article": [
    "Microsoft’s Surface Duo could become the ultimate Xbox Game Pass device, after a new update to the Xbox Game Pass Beta app added support for dual-screen devices.",
    "If you’ve ever played Xbox Game Pass on an Android device, you’ll already be aware that some games have dedicated touchscreen controls. While it wouldn’t be our preferred way to play, there’s a lot to be said for being able to get gaming without syncing a controller or fishing out a bulky clip-on attachment.",
    "One of the biggest problems with mobile gaming, however, is that your fingers occupy a fair amount of the screen due to the controls being mapped to the display. By separating the two, the Surface Duo transforms into an appealing Nintendo DS-styled device, as the touchscreen buttons will appear on the bottom and the top display will show the game you’re playing.",
    "Interestingly, some games will even make use of the Surface Duo’s built-in gyro controls. It means that you can turn the camera in games like Gears 5 by physically moving your device around, which is the type of functionality we’ve seen in the past from some Nintendo 3DS games.",
    "The dual-screens of the Surface Duo are certainly ripe for gaming, then, and with this new update to the Xbox Game Pass Beta app, it might become the most seamless way to experience Microsoft’s subscription service on a mobile device.",
    "Of course, you can always connect a controller and play games on the Surface Duo in the phablet's 'Tent mode' but this would provide a far more elegant solution, particularly if you enjoy gaming on the go.",
    "It's worth noting that cloud gaming on Android devices is only available to Xbox Game Pass Ultimate subscribers, which is Microsoft's most expensive plan at $14.99 / £10.99 / AU$15.95 per month. You get all the benefits of Xbox Live Gold, access to the entire Xbox Game Pass library on console and PC, along with cloud gaming on Android devices."
  ],
  "headers": {
    "4": "Power of the cloud"
  },
  "links": {
    "Surface Duo": "https://www.techradar.com/reviews/microsoft-surface-duo",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review",
    "Nintendo 3DS games": "https://www.techradar.com/news/best-nintendo-3ds-games",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox Live Gold": "https://www.techradar.com/news/xbox-live-gold-deals"
  }
}