{
  "source": "https://www.techradar.com/news/chevrolet-bolt-owners-cant-catch-a-break-as-a-further-70000-electric-cars-recalled",
  "title": "Chevrolet Bolt owners can't catch a break as a further 70,000 electric cars recalled",
  "category": "car-tech",
  "updated": "2021-08-23T15:09:15Z",
  "author": "chris-teague",
  "summary": "The Chevy Bolt recall is becoming a nightmare for GM",
  "article": [
    "Earlier this month, we reported General Motors (GM) had issued its second Chevrolet Bolt recall in just a few months. The price tag and public relations nightmares related to that effort were enormous, but it now appears that there's a bigger headache for both GM and owners of the electric car.",
    "A third recall has now been issued, this time involving tens of thousands more vehicles.",
    "GM is expanding its recall effort to include remaining 2019 model year cars and all Bolt models from 2020 through 2022, including the brand-new Bolt EUV. That's over 70,000 electric cars across the US and Canada.",
    "Now on its third recall in the last nine months, the automaker says that affected vehicles could have two manufacturing defects.",
    "Though rare, the problems could increase the risk of fire, and include a torn anode tab and folded separator located in the same battery cell.",
    "General Motors will replace the battery modules in affected Bolt and Bolt EUV models free of charge out of an abundance of caution, with a price tag that is estimated to set the firm back a total of $1 billion.",
    "GM says that further investigation into battery partner LG's manufacturing processes uncovered defects in certain battery cells produced at LG's facilities.",
    "Given the number of vehicles included in the recall and the costs associated with the operation, it's no surprise that GM wants LG to pick up the tab for its battery defects.",
    "However, LG is not opening its bank account just yet, as it says that the expense should be split between the companies, depending on the results of an investigation into the matter.",
    "Though it's clear that this series of recalls has strained what was originally a promising relationship between GM and LG, the duo's fate is tied at the hip this deep into their courtship.",
    "Two new joint battery factories are under construction in the US, which will cost more than $4 billion and create more than 1,000 jobs. GM will be far more involved in quality control at the new facilities, which given the stakes behind its stated goal of moving to an all-electric vehicle lineup, is understandable.",
    "Customers are frustrated, but have little choice in the matter. Some have expressed fear that their cars will cause fires at home, but there's no avenue to sell the recalled vehicles until a fix is issued.",
    "In the meantime, recommended preventative measures are the same as before:"
  ],
  "headers": {
    "6": "Analysis: a difficult partnership"
  },
  "links": {
    "we reported": "https://www.techradar.com/news/more-woe-for-chevrolet-bolt-ev-owners-as-electric-car-gets-recalled-again-over-fire-risk",
    "third recall has now been issued": "https://media.gm.com/media/us/en/gm/home.detail.html/content/Pages/news/us/en/2021/aug/0820-bolt.html"
  }
}