{
  "source": "https://www.techradar.com/news/heres-how-much-the-new-samsung-frame-tv-will-cost-you",
  "title": "Here's how much the new Samsung Frame TV will cost you",
  "category": "televisions",
  "updated": "2021-02-22T16:26:06Z",
  "author": "henry-st-leger",
  "summary": "And this year's Samsung 4K TVs",
  "article": [
    "Samsung The Frame TV has been a poster child for Samsung's best designs for some time now – and we now have the pricing for its 2021 models and sizes.",
    "First things first: the pricing is pretty much the same as last year's model. You're paying an identical $999 (around £700 / AU$1,250) for a 43-inch size for both the 2020 and 2021 iterations, while the $1,299 (around £900 / AU$1,650) 50-inch model, $1,499 (around £1,000 / AU$1,900) 55-inch model, and $1,999 (around £1,400 / AU$2,500) 65-inch model are only an additional $100 over their predecessors. The largest 75-inch size, too, is $2,999 (around £2,100 / AU$3,800), a small step up from the $2,799 price tag of the 2020 model.",
    "There's no 32-inch TV confirmed just yet, though we wouldn't be surprised for it to make an appearance later in the year. The confirmed sizes will be launching by April 1.",
    "While a bigger price drop on the 2020 model would have been welcome alongside the launch of the 2021 Frame TV, it does show a desire for continuity, and it's still good to see that the price isn't jumping up for newer and more advanced hardware.",
    "Of course, The Frame isn't the only new Samsung TV worth paying attention to this year. We also now have prices for the Samsung Q60A QLED – successor to the Q60T and cheapest QLED in Samsung's range – which is starting at $549 (around £400 / AU$700) for a 43-inch size, and topping out at $2,599 (around £1,850 / AU$3,300) for a massive 85-inch size.",
    "The step-up Q70A QLED starts at $949 (around £700 / AU$1,200) for a 55-inch size and tops out at $2,999 (around £2,100 / AU$3,800) for an 85-inch size too, while the Q80A QLED (which replaces last year's Q80T, our favorite gaming TV) starts at $1,299 (around £900 / AU$1,650) for a 55-inch size and tops out at $3,699 (around £2,600 / AU$4,700) for an 85-inch size. There's also a Q85A QLED with the latest Neo QLED Quantum 4K processor, too, which ups the starting price to $1,599 (around £1,100 / AU$2,000) for a 55-inch size and tops out at $4,499 (around $3,200 / AU$5,700) for an 85-inch size.",
    "All of these 4K QLEDs will be shipping by March 25 too.",
    "While you inevitably end up sacrificing some of the processing and backlighting capabilities of higher-spec sets, The Frame is still the go-to QLED television for those after the best-looking television in Samsung's range, with a sleek finish and dedicated Art Store for displaying 1,400 paintings, drawings, and photography from some of the world's most prestigious galleries and museums (if you pay the monthly fee, that is).",
    "That aesthetic argument has only got stronger as time has gone on, too, and 2021 sees a number of notable changes to the design. This year's Frame TV is much slimmer, for one, almost halving in depth from 45.8mm to just 24.9mm.",
    "The smallest 43-inch model is compatible with a portrait view, too, meaning you can mount it however you like to fit in with other photos or paintings on your wall. It won’t be able to rotate on demand, though – you’ll need the Samsung Sero for that – and we wouldn’t recommend this for regular TV watching. But it may be a good fit for those mainly wanting to use Samsung’s new TikTok smart TV app.",
    "A tripod TV stand also gives buyers new ways of positioning their screen, while the number of customizable bezel options is increasing with choices \"from slim, neutral, and minimalist to big, ornate, and bold\"."
  ],
  "headers": {
    "7": "Beauty and the bezel"
  },
  "links": {
    "Samsung The Frame TV": "https://www.techradar.com/news/should-i-buy-samsung-the-frame-tv",
    "32-inch TV": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Q60T": "https://www.techradar.com/reviews/samsung-q60t-qled-tv",
    "Q80T": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
    "gaming TV": "https://www.techradar.com/news/best-gaming-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Samsung Sero": "https://www.techradar.com/reviews/samsung-sero-tv-review",
    "Samsung’s new TikTok smart TV app": "https://www.techradar.com/news/new-samsung-tvs-are-getting-a-tiktok-app-heres-why-that-matters"
  }
}