{
  "source": "https://www.techradar.com/news/halo-infinite-multiplayer-reveal-was-a-massive-win-for-343-industries-and-players-alike",
  "title": "Halo Infinite multiplayer reveal was a massive win for 343 Industries and players alike",
  "category": "gaming",
  "updated": "2021-06-24T12:00:18Z",
  "author": "samuel-tolbert",
  "summary": "Set for success",
  "article": [
    "After being delayed past the launch of the Xbox Series X and Xbox Series S in November 2020, 343 Industries' Halo Infinite is set to arrive in Holiday 2021. It's a game that's now been previewed at four separate summer showcases, starting with its initial reveal back at E3 2018. With a campaign gameplay reveal last year that delivered visuals many thought underwhelming, as well as the now-infamous (and much-memed) villain Craig, to say 343 Industries had a lot to prove in 2021 would be a ludicrous understatement. Yet it seems like the team nailed it, especially after a multiplayer unveiling during E3 2021 that saw unanimous praise.",
    "The reception hasn't just been \"oh that looks good\" but rather one of genuine joy and heartfelt excitement. At the time of this being written, the multiplayer deep dive that followed the showcase reveal stands at over 2.3 million views on the Halo channel, with what appears to be overwhelmingly positive comments.",
    "Part of that is the earnestness of it all. 343 Industries is opting for further customization than past titles, with accessible options that all adhere to an art style that truly seems to be capturing the tone and art style of Halo: Combat Evolved and Halo 3, all while keeping the actual gameplay married to more modern sandbox design sensibilities.",
    "The physics-based nature of it all just feels right for Halo: it's one thing for a veteran Halo player to hear that you can use grenades to knock weapons around for easier access — it's another entirely to watch it shown off in a multiplayer reveal trailer. The new Skewer weapon isn't just yet another gun for shredding vehicles – instead, it knocks them over with appropriate force and direction. The grappling hook's versatility is stellar enough to nearly warrant its own article, as players are shown using it to make mid-air no-scope shots, grab weapons that are out of reach, and even grapple onto aerial vehicles. What's not to love?",
    "I don't think it's a coincidence that Halo multiplayer looks so good by choosing to just be Halo multiplayer. Battle Royale may be the name of the multiplayer game across the industry but classic Arena and (slightly expanded) Big Team Battle? It's been missed and Halo Infinite seems ready to address that.",
    "All of that is further uplifted by the way 343 Industries is choosing to handle monetization. Battle Passes are nothing new these days, with more and more games competing for your time by dangling skins and other cosmetics that will disappear forever after a couple of months. Halo Infinite eschews that, with the developers promising that the Battle Passes will never expire and will always be available to purchase and put progress towards, a system that's downright revitalizing in an era of FOMO-driven game design.",
    "Frankly, in all my years of playing Halo, I've never seen the community this positive or excited in the leadup to a game from 343 Industries. Halo is an event, something that shifts the landscape when it arrives, and that's what was conveyed over these past couple of weeks.",
    "Of course, the game could still stumble at launch. Even new IPs and rising upcomers with large multiplayer portions tend to struggle with server problems at launch these days. A household name like Halo combined with the fact multiplayer is free-to-play? Whatever 343 is expecting, it likely won't be enough.",
    "This year's showing was focused on multiplayer but it's worth mentioning that what little we saw from the campaign again captured the right spirit of Master Chief. The stoic heroism of every line is every bit worthy of the original trilogy that came before and the mystery of his relationship to a new AI called the Weapon is intriguing.",
    "All this comes before 343 has taken a swan dive into other huge chunks of the game, such as Forge and how the toolset there has been expanded. Invite-based test flighting is set to begin this summer, but will there be a full open beta? Still, after a tenuous year, it truly seems like everything is on the right track.",
    "Now we just need an actual release date."
  ],
  "headers": {},
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "multiplayer deep dive": "https://www.youtube.com/watch?v=n-O7OuliQRY&t=601s"
  }
}