{
  "source": "https://www.techradar.com/news/samsung-tv-plus-is-now-available-online-and-you-can-try-it-for-free",
  "title": "Samsung TV Plus is now available online, and you can try it for free",
  "category": "televisions",
  "updated": "2021-07-12T09:49:15Z",
  "author": "rhys-wood",
  "summary": "Samsung TV Plus now more widely available",
  "article": [
    "Samsung has discreetly launched a web version of its Samsung TV Plus streaming service. This ad-supported streaming app was previously exclusive to Samsung smart TVs and phones, but a web version means that anyone with access to a browser can check out Samsung TV Plus, and you can do so entirely free of charge.",
    "Reported by Protocol, Samsung TV Plus’s web version looks to have soft-launched in May 2021 in certain regions, and has yet to be formally announced by Samsung itself. That’s understandable, as the web version looks to be available in the US only for the time being.",
    "If you’re in the US, then, you can check out the web version of Samsung TV Plus right now via its dedicated website. Keep in mind that while the service is free to use, it is ad-supported and some channels will require you to sign in with a Samsung account.",
    "Samsung TV Plus has been around since 2016, and while the service was originally subscription-based – and limited to certain Samsung smart devices – it has since shifted to an ad-supported model, and it’s great to see the app become more readily available through your internet browser.",
    "Of course, Samsung TV Plus isn’t the only streaming service in its lane. Roku, creator of the popular Roku Channel service, also branched out its app by making it available on mobile and the web. You can even use it on a Samsung smart TV.",
    "One concern, though, is that Samsung could be a bit late to the party with making TV Plus more widely available. There’s already a litany of streaming services big and small available across the web and smart devices.",
    "As such, Samsung TV Plus (while impressive in its varied roster of channels) might just be a drop in the streaming service ocean at this point, especially with the still limited availability of its web version."
  ],
  "headers": {
    "3": "Samsung on the web"
  },
  "links": {
    "Samsung TV Plus": "https://www.techradar.com/news/samsung-tv-plus-the-free-tv-streaming-service-explained",
    "Samsung smart TVs": "https://www.techradar.com/best/samsung-smart-tv-apps",
    "Protocol": "https://www.protocol.com/samsung-tv-plus-web-chromecast",
    "dedicated website": "http://www.samsungtvplus.com",
    "Roku Channel": "https://www.techradar.com/news/rokus-free-streaming-service-is-on-the-web-now"
  }
}