{
  "source": "https://www.techradar.com/news/fujifilm-confirms-its-working-on-high-resolution-mirrorless-cameras",
  "title": "Fujifilm confirms it's working on high-resolution APS-C mirrorless cameras",
  "category": "cameras",
  "updated": "2021-09-02T14:00:00Z",
  "author": "mark-wilson",
  "summary": "The clue is in those new lenses",
  "article": [
    "There have been growing whispers that Fujifilm is planning to release higher-resolution X-series mirrorless cameras like the rumored Fujifilm X-H2 – and it's just confirmed that with two new lens announcements today.",
    "During the launches of two new prime lenses – the Fujifilm XF23mm f/1.4 R LM WR and Fujifilm XF33m f/1.4 R LM WR – the camera giant stated that both are \"designed with a view to support future camera sensors of even greater resolution\" and that they set \"a new benchmark for XF lenses for the highest level of image resolution capability\".",
    "In other words, this new generation of lenses has been designed for Fujifilm's incoming high-resolution cameras, which will mark the end of the 26.1MP sensor that's been at the heart of most X-series cameras in the past few years.",
    "This isn't exactly a surprise – that trusty 26.1MP BSI X-Trans CMOS 4 sensor, which we still rate as the best APS-C chip around, has been an ever-present in its cameras since the Fujifilm X-T3 landed in 2018.",
    "But this is the first time that Fujifilm has officially confirmed that a new sensor is en route for its X-series cameras. And given this announcement, and the speed at which it's developing \"new-generation\" prime lenses, it's fair to assume that Fuji's next camera will have that new sensor, plus a new processor to boot.",
    "You can read out first impressions of Fuji's new 50mm equivalent lens in our hands-on Fujifilm XF33mm f/1.4 R LM WR review. While that lens is due to go on sale in late September for $799 / £699 (around AU$965), the Fujifilm XF23mm f/1.4 R LM WR ($899 / £819, around AU$1,130) will land on shelves a little later in November 2021.",
    "It isn't a huge surprise to discover that Fujifilm is working on higher-resolution mirrorless cameras. But the fact that it's dropping hints about them now suggests we'll likely have to wait until 2022 to see them.",
    "Today saw a huge burst of announcements – including what will almost certainly be the last new camera to feature its 26.1MP X-Trans CMOS 4 sensor, the Fujifilm X-T30 II. And if rumors are to believed, the camera that will showcase that next-gen sensor will the Fujifilm X-H2 sometime next year.",
    "The imminent move to a higher-resolution sensor doesn't instantly make today's Fujifilm cameras dated or poor buys. They continue to strike a great balance between image quality, performance and retro design – so much so, that the Fujifilm X-T4 remains our pick as the best camera for photography for most people, despite the excellence of pricier full-frame alternatives.",
    "But at the same time, Fujifilm is in danger of being left behind by the likes of Sony and Canon when it comes to the ever-increasing demands of professionals, particularly when it comes to video. Many full-frame flagship cameras are starting to offer 8K video as standard, and that isn't possible on Fujifilm's current 26.1MP sensor.",
    "Cameras like the Sony A1 and incoming Canon EOS R3 are also showing off the benefits of 'stacked' CMOS sensors, which have speedy read-out speeds to support high frame-rate burst shooting and video modes. Those sensors are arguably more necessary on full-frame cameras due to the volume of data produced by their larger sensors, but we still expect to see Fuji's next sensor offer a new stacked design.",
    "What Fujifilm needs to avoid doing in the process of moving to that new sensor is losing the charms that have made its X-series such a compelling alternative to full-frame cameras – rather than outright sharpness or detail, its cameras and lenses have offered more compact form factors and a retro character that's often absent in its more clinical rivals."
  ],
  "headers": {
    "6": "Analysis: 2022 will mark Fuji's new year resolution"
  },
  "links": {
    "Fujifilm X-H2": "https://www.techradar.com/news/fujifilm-x-h2-release-date-news-rumors-and-what-we-want-to-see",
    "Fujifilm XF33m f/1.4 R LM WR": "https://www.techradar.com/reviews/fujifilm-xf33mm-f14-r-lm-wr",
    "Fujifilm X-T3": "https://www.techradar.com/reviews/fujifilm-x-t3",
    "Fujifilm XF33mm f/1.4 R LM WR review": "https://www.techradar.com/reviews/fujifilm-xf33mm-f14-r-lm-wr",
    "best camera for photography": "https://www.techradar.com/news/best-camera",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3"
  }
}