{
  "source": "https://www.techradar.com/news/black-friday-sales-a-z-list-top-retailers",
  "title": "The best Black Friday sales: A-Z list of all the top retailers for 2021",
  "category": "computing",
  "updated": "2021-11-26T13:18:31Z",
  "author": "james-pickard",
  "summary": "Your comprehensive guide to the Black Friday sales this year",
  "article": [
    "Black Friday sales are now well underway. As it can be hard to keep track of everything that's going on through the day, we've picked out all the best offers from the top retailers this year and put them in this easy to browse A-Z list. You can scroll through all the sales below, or use the navigation menu to see if your favourite retailer has a sale live now. Don't see them yet? We're adding more throughout the day so do keep checking in.",
    "Some of the best Black Friday sales happening right now include Amazon, where you can save up to 50% off Echo Show, Echo Dot, Kindle and more. Those after even more tech bargains will want to head to Best Buy where 4K TVs start at just $99.99 and there's $150 to save on the MacBook Air. Or, for something completely different, the Adidas Black Friday sale has up to 50% off trainers, tracksuits, hoodies and more.",
    "That's just a small snapshot of the best bargains out there right now and you can find many more in this glossary of all the Black Friday sales. If you're more interested in specifically finding the very best individual offers, head to our Black Friday deals hub instead, where we're curating all the most exciting discounts in electronics, gaming, kitchenware, homeware, toys, sport and much more.",
    "Our guide to this year's Black Friday sales will expand over throughout November as more top retailers launch their holiday shopping events. You can either browse the guide alphabetically for information about everything that's happening this year, or use the navigation menu on the side of the page to jump to any retailers you're specifically interested in."
  ],
  "headers": {
    "3": "A-Z of Black Friday sales: retailer glossary"
  },
  "links": {
    "save up to 50% off Echo Show, Echo Dot, Kindle and more": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fblackfriday%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7725161642287346000-20",
    "4K TVs start at just $99.99 and there's $150 to save on the MacBook Air": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-2048870382925743600&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Felectronics%2Fblack-friday%2Fpcmcat225600050002.c%3Fid%3Dpcmcat225600050002&article_name=The%20best%20Black%20Friday%20sales%3A%20A-Z%20list%20of%20all%20the%20top%20retailers%20for%202021&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fblack-friday-sales-a-z-list-top-retailers",
    "50% off trainers, tracksuits, hoodies and more": "https://adidas.7eer.net/c/221109/264102/4270?subId1=trd-us-1021456020027728500&sharedId=trd-us&u=https%3A%2F%2Fwww.adidas.com%2Fus",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}