{
  "source": "https://www.techradar.com/news/the-explosion-of-new-mirrorless-camera-lenses-is-leaving-dslrs-in-the-dust",
  "title": "The explosion of new mirrorless camera lenses is leaving DSLRs in the dust",
  "category": "cameras",
  "updated": "2021-08-06T10:58:12Z",
  "author": "mark-wilson",
  "summary": "But how quickly can they be made?",
  "article": [
    "This week's deluge of new lens announcements for mirrorless cameras from the likes of Sigma, Tamron and 7Artisans shows that the camera world is starting to emerge from its pandemic-induced slump – and it's accelerating the growing gap between mirrorless bodies and DSLRs.",
    "In the space of a few days, we've seen exciting new lenses from Sigma, Tamron and 7Artisans for all of the major mirrorless mounts, and now Canon has joined the fray (unofficially, at least) with some new patents uncovered by Canon News for some promising f/1.4 primes for its RF-mount.",
    "There's no doubt the pandemic's effect on supply chains and manufacturing put a huge brake on the speedy development of new mirrorless lens ranges for the likes of Canon and Nikon. In May, Nikon was forced to officially deny to us that its Z-mount lenses had been hit by delays.",
    "But this week has shown that innovative mirrorless lenses, even though some are so-called 'development announcements', are arriving in their droves. And for DSLRs? The recent news has been quite the opposite. Yesterday we heard that Sony has officially stopped selling its A-mount DSLRs in the US, while DSLR lens news has been a procession of discontinuations for the Canon EF-mount and Nikon F-mount.",
    "By contrast, Sony's full-frame mirrorless cameras have been the clear winners of this week's lens rush. The Tamron 35-150mm f/2-2/8 for its E-mount is a particularly interesting new option for anyone who needs a hugely versatile focal range combined with a bright maximum aperture in a relatively small bundle.",
    "Equally exciting for owners of Sony, Panasonic or Leica cameras was the announcement of the Sigma 150-600mm f/5-6.3 DG DN OS Sports (below). Based on Sigma's older equivalent lens for DSLRs, it delivers a huge zoom range for a relatively low price tag of $1,499 / £1,199 (around AU$2,262). Unlike Tamron's new announcements, it'll also be available very soon, with pre-orders open now ahead of its availability from August 27.",
    "But it wasn't just full-frame mirrorless cameras that got all the treats this week, either. The China-based manufacturer 7Artisans revealed a super-bright, manual-focus 50mm f/0.95 lens for Sony, Fujifilm, Canon and Nikon APS-C cameras, plus Micro Four Thirds bodies from the likes of Olympus and Panasonic.",
    "And in perhaps the most symbolic changing of the guard, the Nikon Zfc – which is effectively a mirrorless clone of the Nikon FM2 SLR – is about to get its first third-party Z-mount lenses with matching retro styling, thanks to TTArtisan's leaked 50mm f/1.2, 35mm f/1.4 and 17mm f/1.4 offerings. The only real question mark about all of these announcements is how quickly they can be manufactured to meet demand.",
    "The arrival of such a wide variety of mirrorless glass this week doesn't negate the fact that DSLRs still hold the edge in the sheer number of lenses available. But it's the quality and innovation of the new mirrorless lenses that's really impressing, and turning 2021 into a possible inflection point in camera history.",
    "This week we've reviewed two excellent new macro options for Nikon and Canon mirrorless cameras: the Nikon Nikkor Z MC 105mm f/2.8 VR S, and Canon 100mm f/2.8L Macro IS USM (spoiler alert, it gets five stars). And while there are still some gaps in both of the camera giant's mirrorless lineups, most of these have either been filled or will be by the end of the year.",
    "What's more, pretty much every new first-party mirrorless lens offers a clear jump in quality compared to its DSLR equivalent. That's understandable, because mirrorless lens designs are more complex, allowing them to take edge-to-edge sharpness to new levels and control lens distortions at wide apertures.",
    "Of course, this is all simply a continuation of a trend from 2020, which according to CIPA figures was the first year where more mirrorless cameras were shipped than DSLRs. And it certainly doesn't mean that DSLRs are instantly poor cameras or not worth considering – when it comes to value, they're tough to beat thanks to the strength of the used market for both DSLR bodies and lenses.",
    "But the recent buzz around the Nikon Z9 and Canon EOS R3's appearances at the Olympics – where the two full-frame mirrorless cameras appear to be competing as hard as the athletes – and this week's flood of new lens announcements shows that mirrorless is now the only game in town for new cameras. And by the end of 2021, they may well have killed of the chance of seeing any new DSLRs completely."
  ],
  "headers": {
    "8": "Glass masters"
  },
  "links": {
    "Sigma": "https://www.techradar.com/news/sigmas-super-telephoto-lens-could-be-the-new-zoom-king-for-mirrorless-cameras",
    "Tamron": "https://www.techradar.com/news/tamron-is-making-the-ultimate-travel-zoom-lens-for-sony-mirrorless-cameras",
    "C": "https://www.canonnews.com/canon-patent-application-canon-35mm-f14-24mm-f14-22mm-f14",
    "anon News": "https://www.canonnews.com/canon-patent-application-canon-35mm-f14-24mm-f14-22mm-f14",
    "officially deny to us that its Z-mount lenses had been hit by delays": "https://www.techradar.com/news/nikon-denies-its-z-mount-lenses-have-been-hit-by-major-delays#:~:text=Nikon%20denies%20its%20Z%2Dmount%20lenses%20have%20been%20hit%20by%20major%20delays,-By%20Mark%20Wilson&text=So%20far%20in%202021%2C%20Nikon,in%20its%20Z%2Dmount%20roadmap.",
    "procession of discontinuations": "https://www.techradar.com/news/more-discontinued-nikon-lenses-signal-the-end-for-its-beginner-dslrs",
    "Tamron 35-150mm f/2-2/8": "https://www.techradar.com/news/tamron-is-making-the-ultimate-travel-zoom-lens-for-sony-mirrorless-cameras",
    "Sigma 150-600mm f/5-6.3 DG DN OS Sports": "https://www.techradar.com/news/sigmas-super-telephoto-lens-could-be-the-new-zoom-king-for-mirrorless-cameras",
    "Nikon Zfc": "https://www.techradar.com/news/nikon-zfc-release-date-price-specs-and-features",
    "TTArtisan's leaked 50mm f/1.2, 35mm f/1.4 and 17mm f/1.4 offerings": "https://nikonrumors.com/2021/07/30/more-pictures-of-the-upcoming-retro-silver-ttartisan-aps-c-lenses-for-the-nikon-z-fc.aspx/",
    "Nikon Nikkor Z MC 105mm f/2.8 VR S": "https://www.techradar.com/reviews/nikon-nikkor-z-mc-105mm-f28-vr-s",
    "CIPA": "https://www.cipa.jp/stats/dc_e.html",
    "Nikon Z9": "https://www.techradar.com/news/nikon-z9-makes-a-highly-revealing-appearance-at-the-olympics",
    "Canon EOS R3": "https://www.techradar.com/news/canon-eos-r3-shows-off-impressively-rapid-burst-mode-at-the-olympics"
  }
}