{
  "source": "https://www.techradar.com/news/this-pocket-sized-portable-ssd-can-massively-boost-your-ps4-or-xbox-storage",
  "title": "This pocket-sized portable SSD can massively boost your PS4 or Xbox storage",
  "category": "computing",
  "updated": "2021-03-04T16:00:41Z",
  "author": "abhishek-jadhav",
  "summary": "Crucial’s X6 4TB Portable SSD provides an ultra-high speed of 800MB/s for secure data transfer",
  "article": [
    "Crucial has revealed an update to its portable SSD line-up that should have photography and even gaming fans clamoring.",
    "The new 4TB version of Crucial’s X6 portable SSD is its highest capacity yet, and what’s more - at just 11 x 69 x 64 mm and weighing 40g, it fits right in your pocket.",
    "Yet in spite of its portability, the new X6 still offers a lot to time and data-hungry users, promising to deliver a speed of up to 800MB/s - up to 5.6x faster than most traditional HDDs.",
    "With the faster speeds of 800MB/s for reading and writing, the Crucial X6 outperforms opponents such as the formidable Samsung T5, which has a transfer speed of 540 MB/s.",
    "Crucial first launched the X6 portable SSD last year, promising a high-capacity external drive that will play nice with the USB-C connector on your laptop.",
    "Inside the new 4TB SSD is a USB 3.2 Gen-2 that looks like a connection protocol between the drive and computer, providing a faster speed of up to 10Gb/s. Because it supports Windows, macOS, and Android OS, the storage device works with almost every PC and gaming console, including the PS4 and Xbox One.",
    "If you have a USB-C port on your laptop, the device is ready to use - and for those with a USB-A port, you can add an extra adapter.",
    "When it comes to durability, the Crucial X6 Portable SSD can survive a 6.5-foot drop thanks to its shock and vibration resistance, and also boasts “extreme” temperature resistance, along with a three year warranty.",
    "Sadly the Crucial X6 4TB Portable SSD is currently sold out on Amazon, but is available directly from the company here."
  ],
  "headers": {
    "3": "Everything at your fingertips"
  },
  "links": {
    "portable SSD": "https://www.techradar.com/news/best-portable-ssd",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FCrucial-1TB-Portable-SSD-CT1000X6SSD9%2Fdp%2FB08W1KDM9K%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1215967806697440500-20",
    "here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4180307195454217000&xs=1&url=https%3A%2F%2Fuk.crucial.com%2Fssd%2Fx6%2FCT4000X6SSD9&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-pocket-sized-portable-ssd-can-massively-boost-your-ps4-or-xbox-storage"
  }
}