{
  "source": "https://www.techradar.com/news/5-games-i-cant-wait-to-play-on-steam-deck",
  "title": "5 games I can’t wait to play on Steam Deck",
  "category": "gaming",
  "updated": "2021-08-18T08:20:03Z",
  "author": "adam-vjestica",
  "summary": "Opinion: I’m all-in on Steam Deck",
  "article": [
    "Like countless individuals across the globe, I put my hard-earned money down for a Steam Deck as soon as preorders went live for Valve’s portable handheld. Unfortunately, though, securing the new device was a nightmare experience to say the least – something that I should have probably expected with the PS5 and Xbox Series X still being so damn hard to find.",
    "My inability to get my preorder in quickly had dire consequences, sadly. I won’t be able to cradle my very own Steam Deck until Q2 2022, which is still incredibly painful to write knowing that some lucky sods' pre-orders will arrive sometime in December 2021.",
    "The upside, I guess, is that by the time my Steam Deck arrives (I opted for the 512GB model that comes with the anti-glare etched screen because I don’t want to see my sullen face staring back at me during a late night gaming session), any launch day kinks that may occur will have hopefully been ironed out by then.",
    "Valve's lofty goal of ensuring that every game on Steam will work on the Steam Deck should also be realized by that time, or at least I really hope that will be the case. While I have a more than capable desktop PC, one which I proudly built myself from scratch over the course of one terrifying weekend, I spend so much time at my desk these days that the mere idea of booting up a game after work feels completely implausible.",
    "And that’s a shame, because even though the majority of my time is spent gaming on PS5 and Xbox Series X right now, there are a number of games in my Steam library that I’d love to play on a portable device, one that won’t come with massive compromises like we’ve seen with Nintendo Switch’s “impossible” ports.",
    "So while there’s no guarantee every single game I’ll want to play will be available on the Steam Deck, these five games have me giddy with excitement at the thought of being able to play them anywhere, anytime and… well, alone.",
    "Even after four years, my love hate relationship with PUBG continues to endure, though we’re definitely going through a rough patch at the moment. I’ve sunk a quite frankly disgusting amount of time into the Xbox One version of the game (40 days, 9 hours and 12 minutes to be exact), and honestly, I’ve grown tired of how little the game has evolved from a visual perspective since its 2017 release on Xbox consoles.",
    "Running the game on Xbox Series X at least lets me hit 60fps now, which I’m certainly thankful for. But it’s at the expense of the game’s 4K resolution that I’ve grown so accustomed to. If you opt for the ‘Framerate priority’ option, PUBG drops to 1080p, and the result ain’t pretty when blown up on a 55-inch TV, guys.",
    "What makes things worse, however, is that I also own PUBG on PC. And let me tell you, the difference between the two when it comes to graphics is akin to those hilarious ‘RTX ON versus RTX OFF’ memes that you might have seen. You’d be forgiven for thinking PUBG was a different game entirely when running on a capable PC, which makes playing the Xbox One version feel horribly outdated. The dance emotes are still fun, though.",
    "I’m cautiously excited, then, at the prospect of playing PUBG on the Steam Deck, though as it stands certain anti-cheat software doesn't mesh well with Linux, which is what SteamOS runs on. Now, I’m aware that the resolution will drop to 720p, but that’ll be circumvented somewhat by the handheld’s 7-inch display. What should be possible, however, is running the game at far higher graphical settings than what the Xbox and PS4 versions are capable of. Better draw distances, higher textures and PC-specific settings like a wider FOV will all be available.",
    "Throw in gyro controls to help tweak those long-range sniper shots with a Kar98k, and PUBG on Steam Deck might just rekindle my love affair with PlayerUnknown’s Battlegrounds all over again. I’ll take my next chicken dinner to go, please.",
    "Confession time: I’ve never completed The Witcher 3: Wild Hunt. In fact, I haven’t even come close. I’ve played a hell of a lot of Gwent, though, if that helps placate any feelings of anger you may have towards me.",
    "It’s not like I haven’t tried to spend time with Geralt and Roach, either. But whenever I’ve hit my stride (see: made it past the Bloody Baron mission) something pulls me away: be it work, other games, or maybe I’m just unable to sit still and play an RPG for hours anymore.",
    "The Steam Deck, though, could finally be the solution I need to banish my Witcher 3 guilt for good. The game already works great with traditional controls, and the Steam Deck’s specs should let me eke out far more performance from CD Projekt Red’s legendary title than what’s possible on the Xbox One version (at least until the free next-gen update arrives…)",
    "Of course, I’m fully aware that the game is on Switch, but I already own it on GOG and can pick it up for next to nothing on Steam should I need to. I’m also not prepared to stomach playing Witcher 3 at a soupy 540p resolution and with a shaky 30fps cap. Call me a snob, if you want.",
    "When I first heard that Konami’s eFootball was going free-to-play and coming to PC, I immediately thought of one thing: I can finally play a full-blown footie game on a handheld device.",
    "I thought that would also be the case when FIFA 20 was announced for Nintendo Switch, but EA’s port of the game immediately put me off as it was a massively inferior ‘Legacy’ version of what was available on Xbox One and PS4, and didn’t include any of the key improvements such as running on the Frostbite engine. As a result, I steered clear, and it looks like that decision was the right one in hindsight. Since FIFA 20, the Switch version only gets new kits and squads, meaning it’s the same game as before just masked in different clothes.",
    "FIFA 22 also won’t be a viable option for me on PC as EA has confirmed that unlike the PS5 and Xbox Series X versions of the game, PC players won’t get to enjoy the gameplay and animation improvements that will come with HyperMotion technology, something that could have a game-changing effect.",
    "eFootball promises to be different, however, as Konami has said all versions of the game will include it’s new Motion Touch technology. Konami has also ensured that the PC version of PES, which is what eFootball was previously known as, have always been up to speed, so I’d expect nothing different here.",
    "Even though eFootball will be free-to-play with a limited number of teams and modes, it does include Arsenal, who is the only team I’d play as anyway. As someone who is tired of Arsenal’s manager Mikel Arteta telling fans to “trust the process”, I’m looking forward to making the correct signings and tactical decisions in eFootball’s Master League mode, something which doesn’t happen very often at my beloved club.",
    "Another game that causes me to hang my head in shame is Red Dead Redemption 2. Despite sinking countless hours to the PC version and completing John Marston’s adventure on Xbox 360, I still haven’t hit the end credits in Rockstar’s renowned sequel, mostly due to the complicated setup that I’ve created.",
    "You see, after genuinely feeling queasy from playing Red Dead Redemption 2 on Xbox One X – partly due to the combination of the 30fps cap and the fact that Rockstar’s games have an excruciatingly high amount of input lag – I took the nuclear option and bought the game on PC. The problem is, I wanted to experience it on my TV to reap the benefits of HDR, which led to the type of hairbrained scheme that my partner has sadly become accustomed to.",
    "I jumped onto Amazon and bought a 25 meter HDMI cable so that I could connect my PC to my TV, and after carefully snaking it through my home in the most tasteful and discreet way possible, I was finally able to play Red Dead Redemption 2 on the big screen. What I failed to consider, though, was that the distance between my PC and my new play space teeters precariously close to the maximum distance that Bluetooth can provide. This means that the audio when I’m wearing headphones and wireless controller have a habit of disconnecting. That is, unless I perch right at the end of my couch, which is as comfortable as it sounds.",
    "At this point I just want to get the game done. So I’m hoping, praying even, that much like The Witcher 3, I might finally be able to tell my peers that “I too completed Red Dead Redemption 2” if I play it on the Steam Deck. Valve’s portable should (fingers crossed) be capable of running Red Dead Redemption 2 close to 60fps, though I may have to make some big sacrifices when it comes to the visuals… Who am I kidding, I’m never going to finish it, am I?",
    "Real-time strategy games aren’t as unplayable as they once were on consoles, but they’re still not really optimized for a pair of analog sticks and some face buttons. The Steam Deck, however, with its two trackpads, grip buttons and touchscreen, could be more than equipped to handle the latest RTS games, which makes the prospect of playing Age of Empires 4 on Valve’s portable device an exciting one.",
    "As someone who never quite got to grips with the Steam Controller’s trackpads, I’m still hesitant as to whether the Steam Deck’s pair of mice-like inputs will feel more intuitive, but I’m staying optimistic nonetheless. Being able to play games that are usually only reserved for mouse and keyboard could be one of the biggest boons of the Steam Deck, and Age of Empires 4 is the perfect candidate to put it through its paces.",
    "It remains to be seen whether the 7-inch display will be able to accurately convey all the onscreen information you need in these types of games, but as someone whose last memory of thoroughly enjoying an RTS game goes as far back as Command and Conquer: Red Alert, I’m looking forward to dipping my toes back into a genre that’s passed me by.",
    "Now, I better get to work on that time machine so I skip to Q2 2022 and get my hands on the Steam Deck before I die from anticipation."
  ],
  "headers": {
    "6": "PUBG",
    "11": "The Witcher 3: Wild Hunt",
    "15": "eFootball",
    "20": "Red Dead Redemption 2",
    "24": "Age of Empires 4"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "every game on Steam will work on the Steam Deck": "https://www.techradar.com/news/valve-claims-the-steam-deck-can-handle-any-game-you-throw-at-it-including-aaas",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "55-inch TV": "https://www.techradar.com/best/55-inch-4k-tv",
    "RTX ON versus RTX OFF": "https://www.techradar.com/news/minecraft-rtx",
    "certain anti-cheat software doesn't mesh well with Linux": "https://www.techradar.com/how-to/pre-ordered-a-steam-deck-heres-how-to-find-out-which-games-will-run-on-it",
    "SteamOS": "https://www.techradar.com/news/gaming/steamos-what-you-need-to-know-1183824",
    "free next-gen update": "https://www.techradar.com/news/the-witcher-3-is-headed-to-ps5-and-xbox-series-x-and-you-could-even-get-it-for-free",
    "eFootball": "https://www.techradar.com/news/konamis-efootball-is-a-free-to-play-fifa-22-rival-from-the-makers-of-pes",
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "PC players won’t get to enjoy the gameplay and animation improvements that will come with HyperMotion technology": "https://www.techradar.com/news/fifa-22-on-pc-wont-feature-eas-next-gen-animation-tech-and-players-arent-happy",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-release-date-news-and-rumors",
    "Xbox 360": "https://www.techradar.com/news/gaming/consoles/how-the-xbox-360-won-the-console-war-1196990",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Age of Empires 4": "https://www.techradar.com/news/age-of-empires-4-release-date-trailers-and-features",
    "Steam Controller": "https://www.techradar.com/reviews/gaming/games-consoles/controllers/valve-steam-controller-1212868/review",
    "Command and Conquer: Red Alert": "https://www.techradar.com/news/gaming/loved-command-and-conquer-you-ll-love-these-ios-games-1124172/news/command-and-conquer-remastered-collection-is-the-pc-gaming-nostalgia-trip-you-deserve"
  }
}