{
  "source": "https://www.techradar.com/news/apple-is-launching-a-classical-music-streaming-app",
  "title": "Apple is launching a classical music streaming app",
  "category": "audio-visual",
  "updated": "2021-08-31T09:15:15Z",
  "author": "olivia-tambini",
  "summary": "Apple Music is about to get even bigger",
  "article": [
    "Apple has bought the classical music streaming app Primephonic and plans to release its own app dedicated to classical music, as well as offering Apple Music subscribers Primephonic playlists and exclusive audio content.",
    "According to a press release from the tech giant, classical music fans with Apple music will get \"the best features from Primephonic\", including the ability to search by composer and repertoire, and more detailed classical music metadata.",
    "Primephonic is now no longer accepting new subscribers, and will officially shut down on September 7. Existing subscribers will get a prorated refund and will be able to use the service for free until then, as well as receiving six months of Apple Music for free, which includes access to Lossless and hi-res audio streams and classical albums in Spatial Audio.",
    "Apple is clearly on a mission to make its music streaming service as appealing to the widest spectrum of subscribers as possible.",
    "The new integration with Primephonic will open Apple Music up to a new demographic of classical music enthusiasts, potentially giving it the edge over its biggest rivals, including Spotify and Tidal.",
    "Apple Music has already expanded its catalog by offering Lossless and Spatial Audio at no extra cost to subscribers, democratizing hi-res audio while most other streaming services provide it for a fee – if they provide it at all.",
    "While Spotify is looking to bring in its own higher quality (but not hi-res) audio tier with Spotify HiFi, it's expected to cost more than a Premium subscription to the service.",
    "We still think Spotify is the best music streaming service for those that value easy music discovery and well-curated playlists over the very best audio quality – but improved access to classical music streams and the expertise of Primephonic means that even more users could be lured to Apple Music from Spotify."
  ],
  "headers": {
    "3": "Analysis: Apple Music continues its expansion"
  },
  "links": {
    "music streaming app": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "press release": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1363327402794018300&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F08%2Fapple-acquires-classical-music-streaming-service-primephonic%2F",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog"
  }
}