{
  "source": "https://www.techradar.com/news/supernova-shoots-a-dying-star-made-of-metal-out-of-milky-way-at-2-million-mph",
  "title": "Supernova shoots a dying star made of metal out of Milky Way at 2 million mph",
  "category": "appliances",
  "updated": "2021-08-14T22:12:25Z",
  "author": "john-loeffler",
  "summary": "The white dwarf might be a form of stellar shrapnel",
  "article": [
    "When astronomers first spotted the white dwarf designated LP 40-365 about 2,000 light years from Earth back in 2017, it was hard not to take notice.",
    "Rocketing against the rotation of the Milky Way, the white dwarf was travelling almost 2 million mph (about 3.2 million km/h), which is about four times faster than our sun rotates around the galactic core. At this speed, the star is well on its way to escaping the gravitational pull of the Milky Way and entering intergalactic space.",
    "Even more noticeable, according to LiveScience, was its composition, laden with heavy metals like oxygen, carbon, and magnesium (any atom larger than helium is considered a metal by astronomers). While it's not unusual for white dwarfs to have carbon and oxygen compositions, this star had magnesium and neon, which are typically formed under the intense energy of a supernova.",
    "This led researchers with Boston University's (BU) department of astronomy to study the star and piece together the puzzle of what sent it careening through the galaxy to its ultimate destination into the far reaches of intergalactic space. Their findings, published in The Astronomical Journal Letters, points to the catastrophic supernova.",
    "White dwarf stars are the hospice stage of a star's life cycle. When a main sequence star runs out of fuel to burn during nuclear fusion, there isn't enough outward force to hold up the intense mass of the star and it collapses in on itself. If a star's mass is more than roughly eight times the mass of the sun, the mass is so great that the result is either a neutron star or even a black hole.",
    "Smaller stars escape this fate, though. Their collapse leads them to shed their outer layers, which scatters most of the mass of the star into a massive, ring-like nebula. What's left behind is a bright, intensely hot husk of the star's core, known as a white dwarf, whose mass is held up not by fusion but by a quantum phenomenon involving electrons.",
    "While technically dead, as the nuclear fusion stage of the star's life is over, these stellar corpses will radiate heat and light for another billion years or so before going completely dark and becoming a black dwarf. In some instances, binary star systems can end up with two white dwarfs, and this is where things get interesting.",
    "The smaller of the two white dwarfs will start to consume the material of the larger, since more massive white dwarfs are actually smaller as a result of the increased mass and density. If a white dwarf consumes too much material though, the quantum process that keeps the star from collapsing further destabilizes, and the white dwarf erupts in a violent supernova.",
    "That is what the researchers at BU believe happened to this star.",
    "\"To have gone through partial detonation and still survive is very cool and unique, and it’s only in the last few years that we’ve started to think this kind of star could exist,\" said Odelia Putterman, a former BU student who co-authored the paper.",
    "\"The star is basically being slingshotted from the explosion, and we’re [observing] its rotation on its way out,\" Putterman added.",
    "What isn't known is whether the star was the partner star, or a chunk of the star that went supernova, though based on the speed of its rotation, the BU team believes that the star is essentially shrapnel of the more massive star that went supernova.",
    "\"These are very weird stars,\" said JJ Hermes, lead author of the paper and an associate professor of astronomy at BU. \"What we’re seeing are the by-products of violent nuclear reactions that happen when a star blows itself up.\""
  ],
  "headers": {},
  "links": {
    "white dwarf": "https://www.space.com/23756-white-dwarf-stars.html",
    "LiveScience": "https://www.livescience.com/runaway-star-streaks-milky-way.html",
    "The Astronomical Journal Letters": "https://doi.org/10.3847/2041-8213/ac00a8"
  }
}