{
  "source": "https://www.techradar.com/news/horizon-forbidden-west-features-a-brand-new-skill-tree",
  "title": "Horizon Forbidden West features a brand new skill tree",
  "category": "gaming",
  "updated": "2021-06-03T13:54:06Z",
  "author": "vic-hood",
  "summary": "'We didn't redesign the skill tree a little, it's completely thrown out the window'",
  "article": [
    "Horizon Forbidden West will feature an entirely new skill tree, according to developer Guerrilla Games.",
    "In an interview with Game Informer, game director Mathijs De Jonge revealed that Horizon Forbidden West's skill tree hasn't simply been updated since the first game, instead the previous skill tree has been \"completely redesigned and repopulated with new skills\", with new options to allowing players to upgrade Aloy's skills to suit their playstyle.",
    "\"We didn't redesign the skill tree a little, it's completely thrown out the window and started over,\" De Jonge explained. \"So there's a whole new skill tree. Also, visually, everything is completely new. We spent a lot of time giving more options to players. Which playstyles and how exactly it works, that's something we'll go into later when we can actually show it to you.\"",
    "De Jonge also explained how the skill tree is how players will be able to unlock 'Valor Surges', the powerful electric move we saw Aloy unleash during the recent Horizon Forbidden West gameplay reveal.",
    "According to De Jonge, Valor Surges are unlocked by spending skill points in the skill tree, with players then being able to choose which Valor Surge is active at any moment.",
    "To unleash a Valor Surge move, the Valor Surge bar in the bottom right of the screen needs to be filled. This is done by \"playing technically\", headshotting humans or removing components from enemies, which will reward players with specific technical combat XP, which is its own point system, that can be spent in the skill tree.",
    "In addition to revealing that the skill tree has been redesigned, Guerrilla Games also revealed that Horizon Forbidden West will have full PS5 3D audio and DualSense support, a new free-climbing system and a new melee system that allows for combos.",
    "We're hoping we get a closer look at these features in the coming months, ahead of Horizon Forbidden West's release sometime in late 2021. With Sony set to partake in Summer Game Fest, we're hoping the company hosts its own stream, with plenty of details on its upcoming PS5 and PS4 games."
  ],
  "headers": {
    "6": "What else?"
  },
  "links": {
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Game Informer": "https://www.youtube.com/watch?v=dNjqw2X6Y5o",
    "Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know"
  }
}