{
  "source": "https://www.techradar.com/news/square-follows-in-facebooks-footsteps-with-name-change-to-block",
  "title": "Square follows in Facebook's footsteps with name change to Block",
  "category": "computing",
  "updated": "2021-12-02T18:00:25Z",
  "author": "anthony-spadafora",
  "summary": "Name change differentiates the Square brand from the corporate entity",
  "article": [
    "Payments giant Square has announced that will change its name to Block in much the same way as Facebook recently rebranded as Meta.",
    "As the Square brand has become synonymous with the company's Seller business which includes mobile payments, POS systems, small business software and more, Block will be the name for the company as a corporate entity. At the same time, the change to Block acknowledges the company's growth so far while creating room for further growth.",
    "Since its launch in 2009, Square has added Cash App, TIDAL and TBD54566975 to its business but going forward, Block will serve as an “overarching ecosystem of many businesses” that are all united by their shared purpose of economic development.",
    "In a press release, former Twitter CEO and cofounder and CEO of Block, Jack Dorsey explained that despite Square's new name, its purpose remains the same, saying:",
    "“We built the Square brand for our Seller business, which is where it belongs. Block is a new name, but our purpose of economic empowerment remains the same. No matter how we grow or change, we will continue to build tools to help increase access to the economy.”",
    "The name change from Square to Block distinguishes the corporate entity from its businesses or building blocks and there will be no organizational changes. The new name also has many associated meanings for the company in addition to building blocks including neighborhood blocks and their local businesses, obstacles to overcome, a section of code, a blockchain and even communities coming together at block parties.",
    "Under Block, Square, Cash App, Tidal and TBD54566975 will continue to maintain their respective brands while a foundational workforce made up of teams such as Counsel, People and Finance will continue to help guide the company's ecosystem at the corporate level. It's also worth noting that Square Crypto which is a separate initiative of the company dedicated to advancing Bitcoin will change its name to Spiral as a result of Square's name change to Block.",
    "Square is expected to change its legal name “Square, Inc.” to “Block, Inc.” on or around December 10 after satisfying all legal requirements. However, its NYSE ticker symbol “SQ” will not change at this time.",
    "While Facebook recently restructured in a similar way with its Meta rebrand, Google actually started the trend in 2015 when it abruptly renamed itself to Alphabet in 2015.",
    "We've also featured the best ecommerce platforms, best payment gateways and best credit card processing services"
  ],
  "headers": {
    "5": "First a square now a block"
  },
  "links": {
    "Square": "https://www.techradar.com/reviews/square-reader",
    "rebranded as Meta": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
    "mobile payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "POS systems": "https://www.techradar.com/news/the-best-pos-system",
    "small business software": "https://www.techradar.com/best/best-small-business-software",
    "press release": "https://squareecom.yaub.net/c/221109/619387/10061?subId1=trd-us-1406784017910892500&sharedId=trd-us&u=https%3A%2F%2Fsquareup.com%2Fus%2Fen%2Fpress%2Fsquare-changes-name-to-block",
    "Jack Dorsey": "https://www.techradar.com/news/twitter-ceo-jack-dorsey-is-leaving-after-16-years",
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Alphabet": "https://www.techradar.com/news/world-of-tech/what-is-alphabet-google-s-new-parent-company-explained-1301513",
    "best ecommerce platforms": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "best payment gateways": "https://www.techradar.com/best/best-payment-gateways",
    "best credit card processing services": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}