{
  "source": "https://www.techradar.com/news/this-oculus-quest-2-hidden-feature-could-make-typing-in-vr-much-easier",
  "title": "This Oculus Quest 2 hidden feature could make typing in VR much easier",
  "category": "wearables",
  "updated": "2021-06-03T12:00:00Z",
  "author": "rhys-wood",
  "summary": "But will it ever see release?",
  "article": [
    "A dive into Oculus Quest 2’s system software has unearthed a dormant “pass-through keyboard” feature. Not typically available for general use, this feature could make it much easier to use a keyboard while wearing a VR headset.",
    "Spotted by YouTuber Basti564, this “pass-through keyboard” feature allows the user to define an area of real-world space where your keyboard and hand motions can be visible. Essentially, this integrates a rectangular camera view into your virtual reality play sessions, effectively allowing you to type accurately without taking off your Oculus Quest 2 headset.",
    "Without the pass-through keyboard feature, there’s currently only one keyboard that can be displayed in VR thanks to a unique feature – the Logitech K830, which pairs with the Quest 2 headset to create a visible 3D model of the keyboard. It’s far from an ideal solution, and due to the technology it relies on, it’s an especially limited one at that.",
    "While the pass-through keyboard feature is undeniably useful, the question remains as to why Facebook has left it in Oculus Quest 2 purgatory. The feature can actually be accessed, following instructions laid out by Basti564, and it works as intended. For the most part, that is.",
    "A test performed by UploadVR reported that the pass-through keyboard feature crashed the Oculus Quest 2’s Guardian functionality. Guardian is Oculus’s safety feature that defines your surrounding play area, creating virtual boundaries to minimize accidents in VR.",
    "Clearly, then, there are some compatibility issues to iron out before the feature is ready to go live. The pass-through keyboard is undeniably a cool feature that will do wonders for accessibility, but the Oculus team needs to iron out the kinks before it’s ready for widespread use.",
    "However, we’d love for the pass-through keyboard feature to be made fully available on Oculus Quest headsets sometime soon. The ability to use a keyboard hassle-free thanks to this functionality could be immensely valuable, and make VR much more accessible for genres where communication is key, like MMORPGs, shooters and real-time strategy games."
  ],
  "headers": {
    "3": "Typing with my eyes shut"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "VR": "https://www.techradar.com/news/the-best-vr-headset",
    "Basti564": "https://www.youtube.com/watch?v=JYE04_uTLs0",
    "UploadVR": "https://uploadvr.com/quest-passthrough-keyboard-found/",
    "MMORPG": "https://www.techradar.com/best/best-mmo-games"
  }
}