{
  "source": "https://www.techradar.com/news/philips-hue-app-update-improves-using-smart-lights-for-home-security",
  "title": "Philips Hue app update improves using smart lights for home security",
  "category": "smart-home",
  "updated": "2021-06-03T07:30:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Hue 4.0 app has more than 100 improvements",
  "article": [
    "The best smart lights not only allow you to create the right ambiance in your home in just a few taps, so whether you’re watching your favorite movie, entertaining or relaxing with a good book, smart lights can ensure your home is perfectly illuminated.",
    "Smart lights can also be an effective method of home security, alongside the best home security cameras, by giving the appearance someone is home in a bid to deter intruders, even if your property is empty.",
    "Philips Hue is hoping to make using smart lights for home security even easier, with its upgraded app that provides more customizable options home automation (the new name for Routines). Hue 4.0, which is being rolled out for iOS and Android, ensures both sunrise and sunsets can be mixed with specific on and off time when creating automations.",
    "For example - you’ll be able to set your porch lights to come on at sunset but ensure they switch off at 2am in the morning, rather than having to stay on until sunrise. There’s also the option to use rules such as 15 minutes before sunset - this can be handy if you have a large tree in front of your porch, which means it goes dark before sunset. There’s also a handy feature to randomize the times for lights to switch on and off to further deter intruders.",
    "The Hue 4.0 app has more than 100 updates over the current version, and at the same time Philips claims it’s more responsive too and if you use the Hue smart button or remote to control the lights, the change will be shown in the app instantly rather than taking 30 seconds to reflect the changes.",
    "Other features in the new-look app include multi-user geofencing, so the app will check to see if others are home first before activating location-based automations, as well as being able to see all of the lights and scenes on the same screen, so it's easy to control lights and choose from different scenes without having to switch between different tabs. On top of that, there’s support to switch between bridges - ideal if you have multiple bridges in your home or you have more than one home with Philips Hue smart lights in it. At the same time, the Hue Scenes Gallery has been made more accessible for those that want color inspiration for the smart lights in their home while left-handed mode makes it easier to control the app with one hand.",
    "It's not going to stop there either - Philips Hue also teased a forthcoming update due in the next few months, called dynamic scenes. This sees each of the lights in a room or zone slowly transition through the different colors included in the scene to create an unusual lighting effect.",
    "While having smart home devices such as smart lights certainly makes life a little easier, it’s clear that using them for security is also a big draw. According to Statistica, the global smart home security market was worth $2.49billion and will grow to be worth more than $5 billion in 2025. The Philips Hue app updates certainly make Hue smart lights more effective when being used for smart home security.",
    "However, in our eyes, multi-user geofence is the biggest game-changer of Hue 4.0. While it can be handy having all the lights switch off when you leave the house automatically, if someone is still at home it can be a royal pain. This will certainly make smart lights more attractive to more homeowners."
  ],
  "headers": {
    "4": "Faster, better, stronger",
    "7": "Analysis: smart lights getting smarter"
  },
  "links": {
    "best smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Statistica": "https://www.statista.com/statistics/1056057/worldwide-smart-home-security-market-value/"
  }
}