{
  "source": "https://www.techradar.com/news/indiana-jones-5-leak-shows-harrison-ford-in-costume-for-the-first-time-in-13-years",
  "title": "Indiana Jones 5 leak shows Harrison Ford in costume for the first time in 13 years",
  "category": "entertainment",
  "updated": "2021-06-08T13:51:47Z",
  "author": "axel-metz",
  "summary": "Same old Indy",
  "article": [
    "A new image leaked from the set of Indiana Jones 5 shows Harrison Ford winding back the clock as the iconic adventurer.",
    "In a photo shared to Twitter, the 78-year-old veteran actor can be seen donning the character’s famous relic-hunting get-up, fedora and all, for the first time in 13 years.",
    "Filming is now underway at the UK’s Pinewood Studios and elsewhere in the country, with some scenes having already been shot at Bamburgh Castle in Northumberland and the North Yorkshire Moors Railway, as reported by GamesRadar.",
    "As per the report, the sequence shot at the railway involved Ford's stunt double and replica World War 2 military vehicles – but that’s about as much concrete detail as we’ve got so far.",
    "Indiana Jones 5, the first movie in the franchise since 2008’s The Kingdom of the Crystal Skull, is scheduled for release on July 29, 2022, and will be helmed by Ford Vs Ferrari director James Mangold. Despite pulling out of directing duties in 2020, Steven Spielberg will be on hand as executive producer.",
    "Ford will star alongside Mads Mikkelsen, Thomas Kretschmann, Phoebe Waller-Bridge and Shaunette Renée Wilson, while John Williams will be returning as the movie’s composer.",
    "Naturally, we don’t yet have any confirmed details about the movie’s plot, but Mikkelsen, speaking to Collider in May, described the script as “everything [he] wished it to be.”",
    "If Indy’s unchanged outfit is anything to go by, it’s safe to assume we can expect Indiana Jones 5 to stick to the franchise's usual winning formula of relic-stealing, boulder-fleeing action."
  ],
  "headers": {},
  "links": {
    "Twitter": "https://twitter.com/IndianaJones_ch/status/1401984794259566594",
    "Filming is now underway": "https://www.techradar.com/news/indiana-jones-5-is-about-to-begin-filming-heres-what-we-know",
    "GamesRadar": "https://www.gamesradar.com/indiana-jones-5-set-photo-shows-harrison-ford-kitted-out-in-classic-indy-costume/",
    "Collider": "https://collider.com/indiana-jones-5-script-mads-mikkelsen-comments/"
  }
}