{
  "source": "https://www.techradar.com/news/android-12-is-sort-of-out-but-you-cant-get-it-yet",
  "title": "Android 12 is sort-of out, but you can’t get it yet",
  "category": "phones",
  "updated": "2021-10-05T09:18:22Z",
  "author": "james-rogerson",
  "summary": "The Pixel push is weeks away",
  "article": [
    "It’s a big year for Android, with the new Android 12 update looking like the biggest overhaul we’ve seen in a while, and it’s finally sort of launched – a month later in the year than Android 11 landed in 2020. But it’s not launched in a particularly useful form yet.",
    "Google has officially added Android 12 to the Android Open Source Project (AOSP), which as the name suggests is an open-source version of Android which is primarily used by developers and device makers, rather than end users.",
    "So this isn’t quite the version of Android 12 that will be pushed to your phone, and that isn’t coming quite yet, with Google promising it for Pixel phones in the next few weeks, followed by devices from Samsung, OnePlus, Oppo, Realme, Tecno, Vivo, and Xiaomi later this year.",
    "With the Google Pixel 6 rumored to be getting announced on October 19 and to be hitting stores on October 28, one of those dates may well be when Android 12 arrives on Pixel, but that's just speculation for now.",
    "In any case, it's typical for devices from other companies to take longer to get new Android releases, as the makers need to customize it for their devices, but what’s not typical is for the AOSP release to land before the launch on Pixel phones. Usually the two things happen at the same time.",
    "Speaking to XDA Developers, a Google spokesperson claimed that this is because it’s “putting the finishing touches on a special release with Pixel-exclusive and Pixel-first experiences on Android 12.” So expect the version on Pixels to be slightly different to the AOSP version, meaning you should also take any early reviews or impressions of Android 12 with a pinch of salt.",
    "Still, it sounds like the software must almost be done and it’s almost properly here, so for Pixel owners at least the wait is nearly over.",
    "Thanks to the various betas we already know a lot of what Android 12 has to offer, but in announcing the launch on the AOSP, Google highlighted the four key areas of focus for this release. Since this is a developer-focused release the company emphasized the importance of these things for developing apps and the like, but they’ll benefit end users too.",
    "First up, there’s the new Material You UI, which includes redesigned widgets, splash screens for all apps, and a generally more personalizable interface.",
    "Another focus is performance, with Google claiming that it has “reduced the CPU time used by core system services by 22% and the use of big cores by 15%.” The company additionally says it has made apps load faster and improved the speed of machine learning.",
    "Then there’s privacy, with improvements here including a new privacy dashboard which lets users more easily see when apps access the camera, microphone or location data. There are also new tools like the ability to only give an app your approximate location, even if it asks for your precise location.",
    "Finally, Google highlights its focus on better user experience tools. These tools do things like allowing apps to support rounded screen corners and AVIF images, and take advantage of new camera effects and sensor capabilities, among other things. So these tools are aimed squarely at developers, but should lead to better apps."
  ],
  "headers": {
    "7": "Analysis: Android 12 has four main focuses"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Pixel phones": "https://www.techradar.com/news/best-pixel-phones",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "XDA Developers": "https://www.xda-developers.com/android-12-launched/",
    "announcing the launch on the AOSP": "https://android-developers.googleblog.com/2021/10/android-12-is-live-in-aosp.html"
  }
}