{
  "source": "https://www.techradar.com/news/microsoft-teams-update-will-fix-one-of-its-most-frustrating-shortcomings",
  "title": "Microsoft Teams update will fix one of its most frustrating shortcomings",
  "category": "computing",
  "updated": "2021-03-23T10:53:41Z",
  "author": "joel-khalili",
  "summary": "At last, Microsoft Teams will let you reply to specific messages",
  "article": [
    "Microsoft is working on a long-awaited feature for the Teams desktop client that will prevent messages getting lost in the churn.",
    "According to the company’s product roadmap, Microsoft Teams will soon allow users to respond to specific messages, quoting the original query in the response.",
    "“The original message will be quoted in the reply text box, helping everyone in the chat to more easily understand the message’s context,” Microsoft explained.",
    "The feature will apply to one-on-one conversations, groups and in-meeting text chats and is set to land for all Teams users by the end of next month.",
    "The ability to respond to specific messages is nothing new in the world of collaboration tools. Slack, for example, has allowed users to create message chains for years and the Teams mobile app also already offers the feature.",
    "The upcoming update will restore parity between the desktop version of Microsoft Teams and its rivals in the field of collaboration.",
    "The feature will be particularly helpful in situations in which multiple conversations are occurring in a channel at once. The ability to quote the original message in a reply will make the thread of conversation much easier to follow and ensure fewer queries go unnoticed or unaddressed.",
    "Not only will users be able to reply to specific messages, however, but they’ll be given a much wider selection of emojis to use in their responses. Microsoft has also revealed it is working on a major expansion to the Teams emoji library, which will be expanded from just 85 items to more than 800.",
    "“The expanded emoji update offers people more fun and expressiveness in Teams, it also introduces a wider range of diversity and representation,” wrote Microsoft.",
    "As with the new reply feature, the upgraded emoji library is set to land in April."
  ],
  "headers": {
    "4": "Microsoft Teams update"
  },
  "links": {
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "product roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-9054727204496806000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D81113",
    "Slack": "https://www.techradar.com/reviews/slack",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "wrote": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-5186359470235821000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D81403"
  }
}