{
  "source": "https://www.techradar.com/news/brave-browser-will-soon-help-you-purchase-crypto-at-the-best-possible-price",
  "title": "Brave browser will soon help you purchase crypto at the best possible price",
  "category": "computing",
  "updated": "2021-02-24T14:15:20Z",
  "author": "joel-khalili",
  "summary": "Brave is expanding its range of crypto products and services",
  "article": [
    "Privacy-centric web browser Brave is working on a new feature that will help users purchase crypto at the best possible rates via decentralized exchanges (DEXs), a new roadmap for the company’s own digital token reveals.",
    "In a blog post explaining its ambitions for the Basic Attention Token (BAT), which is awarded to Brave users for viewing ads, the company set out plans to integrate a decentralized exchange (DEX) aggregator into the platform.",
    "The aggregator will compare rates across a number of DEX services, helping users to secure the most favorable price for each trade, and marks the company’s first foray into the world of decentralized finance (DeFi).",
    "According to the firm, the aggregator will also allow users to benefit from additional discounts when storing BAT in their wallet or using the token to pay for transaction fees.",
    "While Brave’s DEX aggregator will help users trade cryptocurrencies at more advantageous rates, the main caveat is that decentralized exchanges do not allow users to make purchases using fiat currencies, such as the US Dollar or British Pound.",
    "These exchanges differ from traditional platforms, such as Coinbase, in that they operate on a peer-to-peer model whereby one crypto token is exchanged for another, with custody of the asset remaining with the owner at all times.",
    "The most famous DEX is a platform called Uniswap, which has facilitated more than 30 million trades and boasts an all-time trading volume of $100 billion, making it by far the largest entity in the blossoming DeFi ecosystem.",
    "Brave’s DeFi ambitions did not stop with the aggregator, however; the company also revealed intentions to build a whole new DEX of its own, as a means of growing BAT and opening up DeFi services to a wider audience.",
    "“One of our goals is to make tokens and crypto easy to use for all of our users,” Brave CEO Brendan Eich told Decrypt.",
    "“The custom DEX which we plan to explore could help achieve this goal by enabling users to exchange BAT and other assets at lower fees, and with better user interface and security, by being built into Brave.”"
  ],
  "headers": {
    "4": "Decentralized crypto exchanges"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "exchanges": "https://www.techradar.com/best/mining-rigs",
    "blog post": "https://brave.com/bat-roadmap-2-0/",
    "DeFi": "https://www.techradar.com/news/what-is-defi-everything-you-need-to-know",
    "Coinbase": "https://www.techradar.com/reviews/coinbase-cryptocurrency-exchange",
    "Decrypt": "https://decrypt.co/59219/brave-browser-is-building-its-own-decentralized-exchange-aggregator"
  }
}