{
  "source": "https://www.techradar.com/news/this-4k-streaming-stick-could-make-google-tv-very-affordable",
  "title": "This 4K streaming stick could make Google TV very affordable",
  "category": "televisions",
  "updated": "2021-10-11T12:16:17Z",
  "author": "rhys-wood",
  "summary": "Could the Realme 4K Google TV Stick be one to watch out for?",
  "article": [
    "Realme is set to launch its first streaming stick very soon. The Realme 4K Smart Google TV Stick runs its namesake Google TV operating system, and features 4K 60fps support as well as HDR10+ for sharp and colorful picture quality.",
    "The Realme 4K Smart Google TV Stick launches on October 13, 2021. It doesn't currently have a price tag attached to it, though we imagine it'll be on a par with the Chromecast with Google TV at $50 / £60 / AU$99 – and it could be even cheaper given the lack of a dedicated remote.",
    "Details can be perused on the Realme 4K Smart Google TV's official page. Aside from the aforementioned picture quality features, the stick also has support for HDMI 2.1, USB-C connection and, as you might expect, built-in Google Assistant functionality.",
    "Strangely, the stick's official page doesn't detail too much in the way of supported apps, with only standouts like Netflix, Prime Video, YouTube and Google Play Games being shown.",
    "However, as the device is powered by Google TV, it should be safe to assume that other popular streaming apps like Disney Plus, Spotify and HBO Max will likely be viewable on Realme's new streaming stick.",
    "While Realme is perhaps best known for its selection of mid-range smartphones like the Realme GT, the company has branched out to other types of products in the past, including smart watches like the Realme Watch 2. The company has a reputation for launching quality products with low costs and relatively high specs.",
    "This looks like it may also be the case with the Realme 4K Smart Google TV stick. Google TV is about as good as telly-based operating systems get, with a responsive and easy-to-use interface that's in the process of outright replacing the more divisive Android TV – and, if the price is right, it could be the best way to upgrade your TV's operating system to Google TV for relatively little cost. (Currently, you need a pretty new Sony TV like the A90J, or a Chromecast with Google TV dongle, to try out the new OS.)",
    "Throw in other high quality features like 4K resolution and gorgeous HDR10+ support at a potentially low cost, and Realme might just be onto a winner. However, it's sure to face competition against similarly-priced streaming sticks like the Roku Streaming Stick 4K, which is also releasing in October and boasts support for HDR and Dolby Vision."
  ],
  "headers": {
    "5": "Analysis: Is Realme's 4K stick a big deal?"
  },
  "links": {
    "Google TV": "https://www.techradar.com/news/google-tv-vs-android-tv",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "official page": "https://event.realme.com/in/realme4ksmart-google-tv-stick",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "HBO Max": "https://www.techradar.com/reviews/hbo-max",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "Realme Watch 2": "https://www.techradar.com/reviews/realme-watch-2",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "A90J": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "Roku Streaming Stick 4K": "https://www.techradar.com/news/the-new-roku-streaming-stick-4k-is-an-affordable-dolby-vision-dream",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format"
  }
}