{
  "source": "https://www.techradar.com/news/the-aftermath-of-2020-navigating-the-next-normal-against-fraud",
  "title": "The aftermath of 2020: navigating the next normal against fraud",
  "category": "computing",
  "updated": "2021-05-04T14:06:15Z",
  "author": "gus-tomlinson",
  "summary": "Battling fraud in the next normal",
  "article": [
    "The Covid-19 pandemic put businesses on the hot seat with consumers abandoning the local high street for the global digital marketplace, causing society to undergo a sudden “digital acceleration” – a once-in-a-generation event whereby our dependence on technology has been expedited by over a decade, if not more, in the span of a single year. Overnight, organizations have had to build the solutions needed to support the verification of identity, transactions, and interactions.",
    "In this new environment, a technologically advanced business model is no longer an option, but rather a necessity. In fact, the growing need for businesses to become ‘digital-first’ has led to digital identity being a top priority for most businesses. This shift towards new digital channels - and therefore increased transaction volumes - has also inevitably given rise to the increased presence of fraudulent activity.",
    "Unfortunately, fraudsters don’t stop operating because of a pandemic. In fact, they often capitalize on the immense change and uncertainty that comes with an event like this to bolster their activity – targeting individuals and organizations while they are at their most vulnerable and least protected, in order to manipulate them, capture their data and steal their personal information.",
    "As data breaches and new forms of fraud continue to make the news, so too has the fear and skepticism over cybersecurity. It has therefore never been more important for businesses to tackle identity fraud, educate their most vulnerable customers on how to remain safe online and look to experienced security and fraud solutions that demonstrate a strong track record of verification and protection against cyber threats - from one-time passcodes and two-factor authentication, to behavioral biometrics and document verification.",
    "When it comes to accessing online services, customers see security as a priority. Our recent research has revealed that over half of consumers (63%) over 65 years of age – feel that the inability to steer clear of data breaches makes online transactions less secure.",
    "Yet, while the majority of those aged over 65 feel protecting personal data is in their own hands, a large part believe it’s the responsibility of the company holding the data. In focusing solely or disproportionately on customer experience, businesses are failing to give their customers the reassurance required to forge the trust gap that remains.",
    "Justly, consumers aren’t alone in their apprehension. Research conducted by fraud prevention service, Cifas, suggests that identity fraud cases have seen a rise of 32% over the past five years, and this is likely to continue as consumers opt for the digital high street for their needs and conveniences. Consumer confidence remains considerably low despite the fact that most businesses believe their current identity verification methods are effective.",
    "In order to then bridge that trust gap and ensure that consumers are protected, businesses must focus on reassuring customers that necessary steps are being taken to protect their data and identities. Transparency around these issues is key in order to win back consumer trust given the current and continued migration to digital-first living.",
    "The digital acceleration we saw throughout 2020, and even into this year, has forced businesses across all industries to communicate not only the benefits, but, more importantly, the credibility of the technologies that have quickly come into play.",
    "For customers today, an online transaction isn’t necessarily a trusted one. More than two in five (44%) of consumers feel unsafe when transacting with ‘international businesses’ online. As well as achieving the balance between security and experience, businesses must aim to do so in a world of borderless movement and spending, by accessing global identity data and learning how to trade seamlessly across borders. Doing so will not only provide improved convenience and instill trust in consumers but will ultimately allow companies to remain competitive in international markets. Given the immense rise in fraudulent activities, half of businesses aim to increase their spend on identity fraud prevention by the end of this year. While prioritizing and allocating budget may present a set of challenges, a range of new approaches will emerge, allowing organizations to better verify consumers are in fact, who they claim to be.",
    "Among the many changes that took place last year, the concept of identity continues to undergo transformation. It is therefore critical for businesses to keep pace and ensure they have the best data, tech, and people, innovating to find and implement solutions.",
    "When it comes to fraud, prevention is always the best course of action.",
    "In today's landscape, consumers are more aware than ever of the importance – and difficultly – of protecting their own data, and they will hold accountable the organizations that don’t take necessary steps to protect the information they share with them, as well as their identities.",
    "As we continue to live our lives online, we need to remember that the internet was built without identity in mind. As we continue down the path of digital acceleration, identity, and how we manage and verify it, will continue to evolve to keep the wheels of commerce turning and to foster digital trust among consumers looking to interact digitally without risking fraud."
  ],
  "headers": {
    "4": "The pain points of battling fraud",
    "8": "Navigating the next normal",
    "11": "Prevention is the best form of medicine"
  },
  "links": {
    "identity": "https://www.techradar.com/best/best-identity-management-software",
    "data": "https://www.techradar.com/best/best-data-recovery-software",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "customer experience": "https://www.techradar.com/best/cx-tools"
  }
}