{
  "source": "https://www.techradar.com/news/microsoft-to-stop-forcing-edge-on-windows-11-users",
  "title": "Microsoft to stop forcing Edge on Windows 11 users",
  "category": "computing",
  "updated": "2021-12-03T14:48:16Z",
  "author": "darren-allan",
  "summary": "Microsoft is ditching Windows 11’s frustrating default browser controls",
  "article": [
    "Microsoft has changed the way Windows 11 handles switching default web browsers, thankfully, reversing an unpopular decision it made when the OS was still in pre-release testing (back in August).",
    "A fresh preview (testing) version of Windows 11 (build 22509) now lets you switch the operating system’s default browser with a simple single click; which is just as it should be (and the scheme of things in Windows 10).",
    "So, what currently happens in Windows 11? Well, Microsoft concocted a rather convoluted method in the guise of offering users more fine-tuned control over what browser opens what files, which was, as we observed at the time of its inception, basically a nightmare (and it remains so).",
    "You get one chance to change your default browser away from Edge when you first install and fire up an alternative browser, like say Chrome or Firefox – and when you pick that alternative, you must remember to tick the ‘Always use this app’ box. If you don’t check the box, you won’t see this prompt again, and instead you’ll have to go into Settings yourself and manually change the default browser.",
    "The problem is that currently with Windows 11, this involves having to stipulate Chrome (or whatever alternative you wish to use instead of the built-in Edge browser) for multiple file types: HTML, HTM, PDF, SHTML, WEBP, HTTP, HTTPS, and more. As we already noted, the theory pushed by Microsoft is that this allows for more granular control.",
    "But what it really represents for the overwhelming majority is a lot of clicking and changing, but fortunately, as Rafael Rivera tweeted (via The Verge) to point out, in a new test build, Windows 11 now has a simple ‘Set default’ button for browsers, bringing things back in line with how Windows 10 works.",
    "Microsoft’s Aaron Woodman, VP of Windows marketing, told The Verge: “In the Windows 11 Insider Preview Build 22509 released to the Dev Channel on Wednesday, we streamlined the ability for a Windows Insider to set the ‘default browser’ to apps that register for HTTP:, HTTPS:, .HTM, and .HTML.”",
    "Remember, this new scheme is only in testing now, but with any luck, the change should come to the full version of Windows 11 eventually. As we touched on above, Microsoft’s argument about giving more fine-tuned control for default settings based on user feedback doesn’t wash, at all. Clearly, this was – well, still is for the time being – a way of making sure Edge keeps getting pushed to the forefront.",
    "Along with all the various ads for Edge, which as we saw earlier this week, have reached new lows in terms of anti-Chrome pop-ups (including ‘that browser is so 2008!’).",
    "We’ve said it before, and we’ll say it again: Microsoft, you aren’t going to nag people into using your browser (or anything else), it’ll just annoy them and likely have the opposite effect, if anything. Nobody would be too bothered about the occasional pop-up, perhaps, but the amount of promotional activity, combined with software changes like this whole debacle around defaults, is dangerous territory to be treading.",
    "At least this Windows 11 default browser decision has now been reversed, and we hope that the change comes through sooner rather than later."
  ],
  "headers": {
    "7": "Analysis: This should never have happened in the first place"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "web browsers": "https://www.techradar.com/best/anonymous-browsing",
    "basically a nightmare": "https://www.techradar.com/news/changing-your-default-browser-in-windows-11-will-be-a-nightmare",
    "Chrome": "https://www.techradar.com/news/browser-wars-google-chrome-just-received-a-major-performance-boost",
    "The Verge": "https://www.theverge.com/2021/12/3/22815209/microsoft-windows-11-default-browser-button-changes",
    "various ads for Edge": "https://www.techradar.com/news/microsoft-edge-is-bombarding-people-with-ads",
    "new lows in terms of anti-Chrome pop-ups": "https://www.techradar.com/news/microsoft-vs-google-browser-fight-gets-ugly-with-edge-pop-up-chrome-diss"
  }
}