{
  "source": "https://www.techradar.com/news/verizons-iphone-deals-include-the-iphone-11-for-just-dollar10-a-month-ends-sunday",
  "title": "Verizon's iPhone deals include the iPhone 11 for just $10 a month - ends Sunday",
  "category": "phones",
  "updated": "2021-04-16T17:57:15Z",
  "author": "alex-whitelock",
  "summary": "Save yourself over $300 with this iPhone deal",
  "article": [
    "Verizon deals have yielded a very competitive rate on the Apple iPhone 11 this weekend, which can be picked up for just $10 a month with a new unlimited data plan until Sunday.",
    "Unlike iPhone deals on the latest iPhone 12 or iPhone 12 Pro, no trade-ins are needed to get yourself this hefty price cut on the iPhone 11. Subsequently, this is one of the more 'flexible' options out there right now for bagging yourself a really cheap Apple flagship. Of course, the iPhone 11 is a little older now, but it's still very much relevant among the competition and a powerful device for everyday use.",
    "Previously, we did see this device go for $5 a month, although only with the combination of a new unlimited data plan and a trade-in. AT&T has also historically offered this sort of iPhone deals on the 11 series, and it's currently matching Verizon by offering it for $10 a month with a new plan too.",
    "Another strong option this weekend is the iPhone SE, which is actually free right now with a new unlimited plan at Verizon. While not quite as powerful as the iPhone 11, it's definitely a worthy contender - especially if you're on a budget.",
    "Outside the US? See the best iPhone deals in your region just below.",
    "For options across the entire range, see our main iPhone deals page. Alternatively, scope out the competition with our guide to this week's best cell phone deals."
  ],
  "headers": {
    "5": "iPhone 11 deals ending this Sunday at Verizon"
  },
  "links": {
    "for just $10 a month with a new unlimited data": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1208361556946138000/https://www.verizon.com/smartphones/apple-iphone-11/",
    "iPhone 12": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1404565031050776000/https://www.verizon.com/smartphones/apple-iphone-12/",
    "iPhone 12 Pro": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1735489893086599200/https://www.verizon.com/smartphones/apple-iphone-12-pro/",
    "for $10 a month with a new plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1071871598735246500/https://www.att.com/buy/phones/apple-iphone-11-64gb-black.html",
    "free right now with a new unlimited plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1119550305610884000/https://www.verizon.com/smartphones/apple-iphone-se-2020/",
    "iPhone deals": "https://www.techradar.com/deals/iphone-deals",
    "best cell phone deals": "https://www.techradar.com/deals/mobile-phone-deals"
  }
}