{
  "source": "https://www.techradar.com/news/the-best-laptops-of-ces-2021",
  "title": "The best laptops of CES 2021: the top notebooks on (virtual) show",
  "category": "computing",
  "updated": "2021-01-20T10:26:36Z",
  "author": "matt-hanson",
  "summary": "Best of show",
  "article": [
    "CES 2021 went online this year due to the global pandemic, but that didn’t stop laptop makers from showing off some brilliant new laptops at their virtual events, and we’ve listed the very best laptops of CES 2021 that caught our eye.",
    "Thanks to headline-grabbing announcements by Intel, AMD and Nvidia, which all had powerful new mobile components to show off, the future of laptops is incredibly exciting.",
    "So, we should see thinner, lighter and ever more powerful laptops coming soon. And, it wasn’t just Windows 10 laptops that wowed us – some of our favorite laptops of CES 2021 have actually been Chromebooks.",
    "Read on to find out what we think are the best laptops of CES 2021. If you’re want more suggestions for playing games on, then check out our best gaming laptops of CES 2021. Or, if you’d like help picking a device you can buy right now, then head over to our best laptops of 2021 roundup.",
    "From what we’ve seen in CES 2021, we think this could be the year of the Chromebook. The Samsung Galaxy Chromebook 2 was one of the best laptops we saw (and even got a chance to have a play around with), as Samsung has once again released a device that really pushes at the boundaries of what we expect from a Chromebook.",
    "So, you get a beautifully-designed Chromebook, with a keyboard that is a joy to type on and a gorgeous display. It’s also plenty powerful with an Intel Core i3 processor, and best of all, it’s affordable – starting at $549, rather than the eye-watering $999 the original Galaxy Chromebook started at.",
    "To get this lower price, Samsung has gone with a QLED screen instead of an AMOLED, and the processor isn’t quite as powerful as the previous models, but by cutting the price almost in half, we think these are sacrifices worth making. It means a premium, high-end Chromebook is now within reach for a lot more people.",
    "HP’s CES 2021 launches were mainly aimed at professionals and home workers, and it included what we think is the best business laptop of CES 2021 – the HP Elite Dragonfly G2.",
    "We loved the original Elite Dragonfly, and this new model looks like it could be another real winner. Weighing less than 1kg, it’s an ideal thin and light laptop for people who travel a lot, and packs 11th generation Intel processors, along with either 5G or 4G connectivity, so you can access the internet from almost anywhere.",
    "The Acer Chromebook Spin 514 is another Chrome OS laptop that really impressed us at CES 2021. This is the first Chromebook from Acer that’s powered by AMD Ryzen 3000 series chips, which – along with up to 16GB of RAM, means this is one of the most powerful Chromebooks you can buy.",
    "What we love about this laptop is that it proves that Chromebooks don’t have to just be cheap and low powered devices, they can have specs that rival many of the best Windows 10 laptops, which makes them brilliant productivity machines, capable of running multiple apps at once with ease.",
    "With Chrome OS supporting Android apps, and able to run Linux, the Acer Chromebook Spin 514 represents an exciting hint at the future of powerful Chromebooks, which can rival traditional laptops while keeping the flexibility and long battery lives that we’ve come to love about these Chrome OS-powered devices.",
    "The Lenovo LaVie Mini might just be the strangest laptop we saw at CES 2021. While it can be used as a small, compact 8-inch laptop, you can detach the keyboard and place it in a dock to connect to your TV, turning it into a console-like device.",
    "If that sounds similar to the Nintendo Switch to you, then you’re not alone. Especially as you can attach a controller shell which adds console-like controls to either side of the screen, again turning the Lenovo LaVie Mini into a portable gaming device that’s very reminiscent of the Switch.",
    "With an 8-inch 1200p touchscreen, the LaVie Mini also packs an 11th generation Intel Processor, Intel Xe integrated graphics and 16GB of RAM, plus a 256GB SSD.",
    "While those specs won’t handle high-end AAA games at full graphical settings, they’ll easily outshine the Nintendo Switch. Plus, with streaming services like Stadia and GeForce Now, you’d still be able to play games like Cyperpunk 2077 with ray tracing effects, as long as you have a good Wi-Fi signal.",
    "We’re not sure if it will ever come out (Dell’s similar Alienware Concept UFO is still missing in action after being spotted at CES last year), but we’re always suckers for laptop prototypes that promise to do something new and exciting.",
    "Speaking of laptops that try to do something new, Asus announced the ZenBook Duo 14 UX482, its latest dual-screen laptop. As well as having a second screen just above the keyboard (dubbed the ‘ScreenPad Plus’), the laptop comes with new 11th generation Intel Processors, optional Nvidia GeForce MX450 graphics, and Asus Intelligent Performance Technology (AIPT), which boosts the CPU power setting from 15W to 28W watts for improved performance without overheating.",
    "You’ll also get up to 32GB of RAM, which means this could be a real powerhouse of a laptop. Asus is working with more app makers to better integrate the ScreenPad Plus, so it will show tools, buttons and shortcuts for apps such as PhotoShop, which could really help with your productivity.",
    "The ScreenPad Plus can be raised up to help with airflow, keeping the powerful components inside the slimline laptop cool.",
    "While we appreciate Asus trying something different with its dual-screen laptops, they’ve never quite clicked for us. Hopefully, the Asus ZenBook Duo 14 UX482 will change that and prove that two screens on a laptop is more than just a gimmick."
  ],
  "headers": {
    "4": "Samsung Galaxy Chromebook 2",
    "7": "HP Elite Dragonfly G2",
    "9": "Acer Chromebook Spin 514",
    "12": "Lenovo LaVie Mini",
    "17": "Asus ZenBook Duo 14 UX482"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "best gaming laptops of CES 2021": "https://www.techradar.com/news/the-best-gaming-laptops-of-ces-2021",
    "Samsung Galaxy Chromebook 2": "https://www.techradar.com/reviews/samsung-galaxy-chromebook-2",
    "Acer Chromebook Spin 514": "https://www.techradar.com/reviews/acer-chromebook-spin-514",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Lenovo LaVie Mini": "https://www.techradar.com/news/at-ces-2021-lenovo-has-an-answer-to-the-nintendo-switch-and-dell-concept-ufo",
    "Alienware Concept UFO": "https://www.techradar.com/reviews/alienware-concept-ufo",
    "ZenBook Duo 14 UX482": "https://www.techradar.com/news/asus-tuf-dash-f15-shows-that-thin-and-light-gaming-laptops-dont-have-to-be-super-expensive"
  }
}