{
  "source": "https://www.techradar.com/news/ps5-restock-walmart-today-july-22",
  "title": "PS5 restock: Best Buy had a big restock on Friday – where and when to get it next",
  "category": "gaming",
  "updated": "2021-08-30T09:10:16Z",
  "author": "matt-swider",
  "summary": "The Best Buy PS5 restock gave people another chance to buy the Sony console. Here's what time it happened and when to expect the new PS5 restock.",
  "article": [
    "Best Buy PS5 restock update: We found PS5 in stock on Friday at Best Buy, and while it was difficult to bypass the infamous Best Buy checkout process, many people who follow our PS5 restock Twitter tracker Matt Swider was able to get the console, we can confirm. We're now looking where to buy PS5 next.",
    "You can buy PS5 too – if you follow Matt Swider's Twitter account and turn on notifications. When is next PS5 restock in the US and where will you be able to buy it? GameStop may have a PS5 restock soon, according to our sources, and it could happen next week with bundles available online.",
    "► When? Follow our PS5 restock Twitter tracker Matt Swider and turn on notifications for restock news. It's the fastest way to get PS5 restock updates.",
    "► Don't buy from other Twitter users – ever. They're all scams. Only buy from the US stores Matt alerts you about. No one will legitimate sell a PS5 for just $550.",
    "Directions: Click on this image of an example of a PS5 restock alert from Matt Swider and turn on notifications (that little bell icon) for instant alerts.",
    "Prior PS5 restock news from Thursday afternoon: The Walmart PS5 restock happened exactly like our PS5 restock tracker had reported hours earlier and hundreds of his followers were able to buy the console from Walmart. The PS5 Disc version was in stock this time, so Walmart didn't have the PS5 Digital Edition as a restock. There was also an Xbox Series X restock, a piece of news we also reported on in advance of the Walmart PS5 restock today. Both were on sale at 3pm EDT / 12pm PDT. Didn't get it? Get these alerts for the next restock opportunity.",
    "Update: The PS5 Disc was in stock Thursday at Walmart, and it went for the MSRP of $499. There was no Walmart PS5 Digital Edition in stock today, July 22.",
    "Prior reporting (we got right): It's been over a month since the last major PS5 restock at Walmart, and while it often has the most inventory, it's also one of the most popular stores in the US. Meaning everyone is trying to buy the PS5 console at the same time mid-afternoon.",
    "Today, July 22, could be the next chance to buy the PS5 from Walmart, and the usual restock time is in play: 3pm EDT / 12pm PDT, according to the unwavering Walmart pattern in 2021. Walmart ran out of $399 PS5 Digital consoles during its last major restock and, after that PS5 restock disaster, turned it into a net positive for consumers who got upgraded to the $499 PS5 Disc version for free.",
    "Walmart does take a long time to ship PS5 consoles to some people, but that's why we're a little more confident in a restock happening today: most people who bought the PS5 last month have finally gotten their delayed PS5 Disc model from Walmart in the mail. Walmart may be ready for another round of PS5 restocks later today.",
    "Best Buy makes it difficult to buy the PS5 for multiple reasons. First, its restock date and time hasn't been consistent like Walmart and it doesn't send us a heads-up as to when it'll restock. Often we have to rely on inside sources, who know when inventory comes into their regional warehouses but don't control the add-to-cart button.",
    "It may be an effort to thwart bots, but the truth is that bots are able to automatically check out more easily than everyone else (opening up multiple tabs and determining which page will get through the add-to-cart button queue the fastest). In your area, it may make buying PS5 impossible, as consoles need to be picked up in person three to five days later, so you have to select a local Best Buy store.",
    "We'll update you on Best Buy PS5 restock news when we know for a fact it'll be ready to release the Sony console – and you may have a chance to buy it.",
    "The last we checked with our sources at Target, there were just three PS5 consoles in the back room of stores. These individual stores can't sell their PS5 inventory until there's enough stock of the PlayStation 5 consoles to facilitate a nationwide PS5 restock. Everything happens online (you can't go to the store to buy it), but you do have to select in-store pickup (Target doesn't ship the PS5 at this time).",
    "The target PS5 restock time has consistently been anywhere fro 7am EDT to 8am EDT in the US, with the most popular time having been 7:40am EDT. Recently, it's happened a bit earlier (7:07 am EDT), so be sure to check starting at 7am EDT – when we think there's a restock. That's very early if you're in, say, California, where that time would be 4:40am PDT. But Target does this because it wants to finish the PS5 restock before its stores open for business that same day.",
    "Like Walmart, we often see Target stick to a day of the week pattern: the PS5 has consistently been sold out a Wednesday or Thursday in 2021 – with the exception that one Friday in which it was a short week pushing everything back (due to the 4th of July holiday earlier in the week).",
    "Amazon just had the PS5 in stock yesterday, July 21, and that means we probably won't see a restock there until late August. There's a consistent monthly pattern to Amazon in 2021: it's always a random weekday once a month and shifts between daytime and nighttime. Since this last restock happened during the day, we could see another midnight or 3am EDT PS5 restock from Amazon next month.",
    "Something to note: Amazon only had the $499 PS5 Disc console in stock this week, and there seems to be a pattern there too; only half of the time does Amazon offer the opportunity to buy the $399 PS5 Digital console. The same can be said about the Walmart PS5 restock events, though the PS5 Digital Edition is on sale more.",
    "We'll tweet out advice on how to secure the console when there's a restock at this US store. This is usually in a follow-up tweet (as seen below) right after the PS5 restock Twitter alert we send out immediately.",
    "The GameStop PS5 restock date is every seven and 15 days, and so far it's been just seven days since the game retailer has had the PS5 in stock in the US. Buyers of the last restock on Thursday, July 16 are just now getting their PS5 console orders in the mail. GameStop is one to hold out for because it offers bundles; this turns off resellers who can't easily profit off readily available games and accessories, and that's a good thing for real gamers who are still on the hunt for a PS5 console. GameStop is also limiting early access to its PS5 restock events to its Power Rewards Pro members, which costs $15 a year, further thinning out the heard.",
    "Going by that time table, the next PS5 restock at GameStop should be later this week (from Wednesday to Friday) or early the week after (Monday to Wednesday), if the US game retailer sticks to its usual pattern that's been used for much of 2021.",
    "Look for an alert for the GameStop PS5 restock similar to this one.",
    "The Sony Direct is the exact opposite of a Walmart PS5 restock for several reasons. This official store for the PlayStation brand uses a virtual queue system that makes buying a PS5 into a lottery, complete with a progress bar. Walmart just throws everyone onto a page with an add-to-cart button and then a checkout button that both fail to function properly 99% of the time.",
    "By doing this, Sony Direct randomizes who will get through the waiting process, though our expert advice always suggests using multiple devices to increase your chances. Both PS5 Disc at $499 MSRP and the PS5 Digital at the slightly cheaper price of $399 were for sale this week, but, as always, PS5 Digital Edition went out of stock first, a few minutes before PS5 Disc sold out.",
    "The restock time was at 5:05pm EDT, which is in line with when Sony Direct does a virtual queue for everyone. Two hours before that time, at 3pm EDT, there was a separate smaller Sony Direct virtual queue for people who got a special email invite ahead of time (about 40 hours in advance).",
    "According to our exclusive reporting, not everyone from the invite-only virtual queue was able to buy the console, which is extremely rare, especially when Sony Direct opens up orders to everyone else."
  ],
  "headers": {
    "6": "Walmart PS5 restock: it happened Thursday",
    "10": "Will Best Buy restock this week?",
    "13": "Target likely needs more time before a PS5 restock",
    "16": "Amazon PS5 restock: don't expect it in stock soon",
    "19": "GameStop PS5 restock: every 7 to 15 days (it's been 7)",
    "22": "Sony Direct PS5 restock already happened this week"
  },
  "links": {
    "PS5 in stock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "Follow our PS5 restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "PS5 restock tracker": "https://twitter.com/mattswider",
    "Xbox Series X restock": "https://www.techradar.com/news/xbox-series-x-walmart-restock-time-today",
    "PS5 restock disaster": "https://www.techradar.com/news/ps5-restock-in-the-us-walmart"
  }
}