{
  "source": "https://www.techradar.com/news/this-top-vpn-is-causing-blue-screen-of-death-crashes-on-windows-10",
  "title": "This top VPN is causing blue screen of death crashes on Windows 10",
  "category": "computing",
  "updated": "2021-01-26T13:55:26Z",
  "author": "barclay-ballard",
  "summary": "ProtonVPN advises downgrading to an earlier version",
  "article": [
    "A hugely popular VPN solution is causing some Windows 10 users to come face to face with the dreaded “blue screen of death” (BSOD). ProtonVPN confirmed that conflicts with unnamed antivirus solutions were behind the issue.",
    "“We have received reports that in particular circumstances the latest versions of ProtonVPN Windows clients (the stable version 1.18.2, and the early access version 1.18.3) might lead to Blue Screen crashes in Windows, due to a conflict with certain antiviruses,” a ProtonVPN status update explained. “We are actively working on a fix that will be made available as soon as possible.”",
    "The short-term solutions offered by ProtonVPN include disabling their antivirus solution or rolling back their version of ProtonVPN to an earlier iteration without this particular bug.",
    "Affected users have described how the BSOD is triggered immediately after ProtonVPN is launched. It is thought that the issue has been around for approximately two weeks now, as this is when the latest version of ProtonVPN was released.",
    "This is not the first time that ProtonVPN has had BSOD issue with its Windows clients. A look back through various Windows VPN support comments reveals that ProtonVPN users have had to deal with blue screens and system crashes, infrequently, since at least 2018.",
    "Given that the VPN space has become increasingly competitive of late, ProtonVPN will be hoping that it can release a more permanent fix for this particular issue quickly. Since the coronavirus pandemic, VPN usage has soared, with many individuals relying on the solutions to connect to services remotely. Disruption like the recently discovered BSOD issue could see ProtonVPN users search out alternatives.",
    "Via Bleeping Computer"
  ],
  "headers": {
    "3": "Not the first time"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ProtonVPN": "https://www.techradar.com/reviews/protonvpn",
    "explained": "https://protonstatus.com/incidents/124",
    "support comments": "https://go.getproton.me/aff_c?offer_id=25&aff_id=1046&source=trd&aff_click_id=trd-us-3757502811928354000&url=https%3A%2F%2Fprotonvpn.com%2Fsupport%2Fwindows-vpn-issues%2F%3FvisitorId%3Dho-%7Btransaction_id%7D%26aid%3D%7Baffiliate_id%7D%26offer_id%3D%7Boffer_id%7D%26url_id%3D%7Boffer_url_id%7D%26utm_campaign%3Dww-all-2a-vpn-gro_aff-g_acq-partners_program%26utm_medium%3Dlink%26utm_source%3Daid-tune-%7Baffiliate_id%7D%26utm_content%3D%7Boffer_id%7D%26hfp%3Dfalse%26spl%3D%7Baffiliate_id%7D%23comment-2004&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-top-vpn-is-causing-blue-screen-of-death-crashes-on-windows-10",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/software/protonvpn-causes-windows-bsod-crashes-due-to-antivirus-conflicts/"
  }
}