{
  "source": "https://www.techradar.com/news/new-gboard-app-points-to-coming-upgrades-for-wear-os",
  "title": "New Gboard app points to coming upgrades for Wear OS",
  "category": "wearables",
  "updated": "2021-05-07T09:02:10Z",
  "author": "david-nield",
  "summary": "More to come at Google IO 2021?",
  "article": [
    "Typing on a smartwatch isn't ideal at the best of times, but the newest app for Wear OS should make the experience better on Google-powered wearables: the Gboard keyboard that's already available on Android and iOS is making the jump to wrists.",
    "As per a forum post by a Google engineer, Gboard for Wear OS will bring with it gesture input and voice input as well as the standard QWERTY touch keyboard option, and there's also easy access to emojis for expressing yourself even faster.",
    "Where Gboard will really prove its worth – if the smartphone versions are anything to go by – is in the intelligent word suggestions and corrections that come up as you type. Typing can be a chore on a small smartwatch screen, so the less tapping you have to do the better.",
    "Gboard is going to come with support for all the languages that are built into Wear OS – though we can't find a definitive reference for exactly how many that is – and you'll be able to swap between languages on the keyboard without changing the language of the entire operating system.",
    "You don't actually need to do anything to get the update: it'll appear automatically on Wear OS smartwatches over the coming days via an over-the-air update, replacing the rather basic stock keyboard that is currently in place.",
    "The forum post wraps up with the message that \"We can't wait to share what more is in store for Wear OS by Google in 2021!\", which makes us hopeful that there might be some substantial upgrades to the smartwatch software this year after an extended period in the doldrums.",
    "Not only has there been a distinct lack of new apps for Wear OS in recent times – not even from Google itself – we've also been disappointed by the paucity of new hardware. The likes of TicWatch and Fossil are still flying the flag for Wear OS, but there's hardly an abundance of choice for consumers.",
    "That could change this year: Samsung is rumored to be switching back to Wear OS on its next smartwatches, while speculation about a Google Pixel Watch refuses to go away (especially in light of the Fitbit acquisition). Hopefully we'll hear more developments at Google IO 2021 when it gets underway on May 18."
  ],
  "headers": {
    "5": "More coming soon"
  },
  "links": {
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "forum post": "https://support.google.com/wearos/thread/108870878/new-gboard-app-arrives-on-wear-os?hl=en",
    "TicWatch": "https://www.techradar.com/reviews/ticwatch-pro-s-review",
    "Fossil": "https://www.techradar.com/reviews/fossil-sport-review",
    "is rumored": "https://www.techradar.com/news/evidence-mounts-the-samsung-galaxy-watch-4-will-run-wear-os",
    "next smartwatches": "https://www.techradar.com/news/samsung-galaxy-watch-4-and-active-4-likely-to-land-soon",
    "Google Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "the Fitbit acquisition": "https://www.techradar.com/news/5-likely-reasons-why-google-just-bought-fitbit",
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog"
  }
}