{
  "source": "https://www.techradar.com/news/amazon-build-it-is-kickstarter-for-odd-alexa-devices-like-this-smart-cuckoo-clock",
  "title": "Amazon Build It is Kickstarter for odd Alexa devices like this smart cuckoo clock",
  "category": "smart-home",
  "updated": "2021-02-17T19:37:30Z",
  "author": "hamish-hector",
  "summary": "Alexa, build me something",
  "article": [
    "Amazon is giving you the power to decide which Alexa-enabled products it will launch next thanks to its new Build It program. It’s much like a Kickstarter campaign: if a concept reaches its preorder goal, Amazon will manufacture the device and ship it off to everyone who put money behind the idea.",
    "The Build It program, which was unveiled today, will launch with three smart devices at first: a sticky note printer, smart nutrition scales, and a cuckoo clock.",
    "All three devices can be controlled by your Alexa speakers. With them, you could create physical reminders for yourself, check the nutritional information for your food, or set yourself alarms from a more traditional-looking timepiece.",
    "This first batch of products will have to reach their pre-order goal in the next 30 days to guarantee that they will be built. Pre-ordering one will also let you buy a product at a “special promo price” though we don’t know how significant this deal is. And don’t worry about paying money for a Kickstarter idea gone bad you’ll only be changed for Amazon Built devices if the concept reaches its goal and is turned into a finished design.",
    "Amazon’s Build It seems like a clear win-win situation for the company, successful products are guaranteed to turn a profit and unpopular ones won’t clutter up its virtual shelves. This near-total lack of risk will give Amazon designers a lot of freedom to create out-of-the-box and potentially brilliant ideas.",
    "The first batch of ideas shows this clearly. While the sticky note printer and smart scales seem like generally good ideas, the cuckoo clock is unlike anything we expected. We’ll just have to be careful not to get caught up with every kitschy concept that comes out of the Amazon Build It pipeline. We can only house so many smart gadgets."
  ],
  "headers": {
    "4": "What do we think of Build It?"
  },
  "links": {
    "Build It program": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fb%3Fie%3DUTF8%26node%3D21601403011%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5741228415314981000-20"
  }
}