{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-launch-date-confirmed-well-see-the-samsung-galaxy-s21-rival-soon",
  "title": "Xiaomi Mi 11 launch date confirmed - we'll see the Samsung Galaxy S21 rival soon",
  "category": "phones",
  "updated": "2021-01-29T10:02:26Z",
  "author": "tom-bedford",
  "summary": "It's coming on February 8",
  "article": [
    "After launching in China on December 28, we've been waiting for a global launch for the Xiaomi Mi 11, as it could be the Samsung Galaxy S21's biggest rival. We now know the phone's launch event is set for February 8.",
    "This comes from an event invitation sent to TechRadar, citing the launch start as 1pm CET (which would make it 12pm GMT, 7am ET, 4am PT, and 11pm ACT).",
    "Curiously, while this invitation comes with a link to Xiaomi's blog, we couldn't find a public confirmation of this launch date anywhere, either on social media or on the blog. Since it was from official channels, though, we're going to presume it's legitimate.",
    "At the Chinese launch event only the Mi 11 itself was unveiled, but there might be more smartphones coming in February.",
    "Rumors have started circulating about the Xiaomi Mi 11 Pro, which seems to be a camera beast with top specs across the board. It's also possible we'll see a Xiaomi Mi 11 Lite, as the last few generations of Mi flagship have come with such an affordable version, but we haven't heard much about it.",
    "There are also rumors circulating about a Xiaomi wearable coming; the company sometimes shows off smartwatches and fitness trackers, but so far none have been widely available to buy. So we could hear about a new Xiaomi smartwatch at the Mi 11 launch.",
    "TechRadar will be sure to cover all the announcements at the launch event, so check back then for everything Xiaomi unveils."
  ],
  "headers": {
    "3": "What's expected to come?"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}