{
  "source": "https://www.techradar.com/news/audibles-presidents-day-sale-can-save-you-dollar30-on-a-premium-plus-subscription",
  "title": "Audible's Presidents' Day sale can save you $30 on a Premium Plus subscription",
  "category": "audio-visual",
  "updated": "2021-02-10T16:31:24Z",
  "author": "alex-whitelock",
  "summary": "6 free books, plus thousands of titles at your fingertips",
  "article": [
    "To celebrate the annual Presidents' Day sale, Audible, the leading audiobook service from Amazon, is offering up 6 months of its new Audible Premium Plus subscription for just $9.95 - down from $14.94 and a total saving of $30 overall.",
    "What makes this Audible deal of note in our books (get it) is that it's for the 'Premium Plus' service, which is the second (and more expensive) tier of the current Audible subscription options. It's rarer to see discounts for this tier, and, unlike the standard Audible Plus subscription, you get a free book token every month with Premium Plus.",
    "Subsequently, this one's a great deal if you're really into your audiobooks and would like to build up a library to keep. Of course, going with Premium will also get you full access to the vast Audible Plus library of thousands of books and podcasts as well, so you'll never run out of content even after you've spent those tokens. Note, however, this Audible Presidents' Day sale promotion is only available for new customers right now, which is the main caveat to an otherwise excellent Audible deal. If you're an existing customer, we do however, have a few handy tips and tricks for saving money over at our main Audible discounts and promo codes article, though, so be sure to check that one out."
  ],
  "headers": {
    "3": "Other great Amazon services"
  },
  "links": {
    "for just $9.95": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fhz%2Faudible%2Fmlp%2Fmdp%2Fgold%2Fpaid%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2093082810982773200-20",
    "Audible discounts and promo codes": "https://www.techradar.com/news/audible-the-best-discounts-and-promo-codes-currently-available"
  }
}