{
  "source": "https://www.techradar.com/news/dropbox-wants-to-make-your-return-to-the-office-less-painful",
  "title": "Dropbox wants to make your return to the office less painful",
  "category": "computing",
  "updated": "2021-07-20T19:00:21Z",
  "author": "anthony-spadafora",
  "summary": "New tools aim to keep users organized at home and at work",
  "article": [
    "As employees begin preparing to return to the office, Dropbox has added new features to its cloud storage service to make it easier and faster for them to access their content and workflows.",
    "With the addition of suggested folders, workers will be able to add and share content with the right people more easily. Dropbox has also made it possible to access your content at a glance through a new simplified experience available in the task bar on Windows 10 or in the menu bar on macOS.",
    "To help users find the content they're looking for, the company has added a new left side navigation experience that gives you access to all of your files and folders from a dropdown menu. At the same time, a redesigned details panel provides important content highlights such as file type, who a file is shared with, when it was last modified and its location.",
    "Having to open a separate application each time you want to convert a file from one type to another can waste valuable time which is why users can now convert files to different formats such as JPEGs or PNGs without leaving Dropbox.",
    "In addition to its new UI improvements, Dropbox has also made it easier to centralize, organize and protect your most important personal content.",
    "The company has improved the performance and reliability of camera uploads and this feature is now also available to Basic users. With camera uploads, users can automatically back up their photos and videos from their smartphone directly to Dropbox and access them on any device. However, you can also back up specific albums and customize how photos and videos are saved in Dropbox's iOS app and this feature will be rolling out to Android soon.",
    "Dropbox has also upgraded its password manager with new features and the company now offers a browser extension for Dropbox Passwords that captures and fills in logins and passwords. Users can even securely share passwords and payments with others and the service now supports credit and debit cards.",
    "Regardless of whether you're working from home or your organization has implemented a hybrid work policy, Dropbox aims to ensure that you can quickly and easily access all of your content no matter where you are."
  ],
  "headers": {
    "4": "Securing content and staying organized"
  },
  "links": {
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "macOS": "https://www.techradar.com/news/macos-12",
    "convert a file": "https://www.techradar.com/how-to/how-to-convert-pdf-to-jpg",
    "camera uploads": "https://help.dropbox.com/installs-integrations/photos/camera-uploads-overview",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Dropbox Passwords": "https://www.techradar.com/news/dropbox-passwords-will-soon-be-free-for-all-users",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}