{
  "source": "https://www.techradar.com/news/outriders-demo-update-will-improve-matchmaking-and-change-loot-drops",
  "title": "Outriders demo update will improve matchmaking and change loot drops",
  "category": "gaming",
  "updated": "2021-03-05T11:58:58Z",
  "author": "vic-hood",
  "summary": "RIP Loot Cave",
  "article": [
    "Square Enix has detailed a new update coming to the Outriders demo which is set to make matchmaking faster, make Captains less frustrating and put an end to players taking advantage of the game's Loot Cave.",
    "The publisher detailed the upcoming update on Reddit, revealing that this backend update will make Captain's less frustrating, by reducing the effectiveness of the Healing Light mob ability and increasing the cooldowns for the From the Ashes and Phoenix Aura abilities. The update also makes boss Gauss more challenging, increasing his health points for repeat playthroughs and increasing his healing from the Steel Wall Ability.",
    "But perhaps the biggest change is to loot drops. Square Enix is putting an end to Outrider's Loot Cave, a loop that allowed players to farm gear quickly, by removing Legendary items from chests. In addition, Epic items will no longer appear in shops and vendors within the demo and side-quest rewards (on repeat runs) will now have the chance to drop Legendary items instead. However, drop rates will remain unchanged.",
    "The idea of these loot changes is to \"redirect\" players' gear farming efforts. According to Square Enix, while the main game has been balanced with a \"certain progression system\" this could be impacted by players heavily farming gear and mods in the game's demo - which has been happening. The publisher emphasized that it doesn't want to prevent farming runs, however it wants to \"ensure this process is not overly simplistic, easy or prone to exploitation\".",
    "This backend demo will roll out later today, at 3pm GMT / 7am PT / 10am ET on March 5 (and 2am AEDT on March 6).",
    "But this backend update isn't the only patch in the pipeline for Outriders. In addition, Square Enix also revealed that it plans to roll out a bigger update (likely early next week) which will bring a plethora of bug fixes and quality-of-life improvements.",
    "This update will add a Motion Blur Toggle, reduce improve matchmaking times and tweak frame rate output for some cutscene items (though a more \"comprehensive fix\" is also in the works for this). This update also aims to iron out a bunch of bugs and crashes across all platforms.",
    "The exact date for the rollout of this Outriders demo update is still to be confirmed.",
    "In addition, Square Enix acknowledged the connectivity issues many players had on the demo's launch day and explained that - while it was prepared for the number of players - the servers were not prepared for the speed at which players were joining the demo.",
    "According to Square Enix, over two million players have downloaded the Outriders demo since it launched last week, ahead of the game's official release on April 1.",
    "It's worth nothing that while these updates are being rolled out, there may be some disruption to the game. But typically updates don't take more than a few hours (tops)."
  ],
  "headers": {
    "5": "But that's not all",
    "8": "A successful demo"
  },
  "links": {
    "Outriders demo": "https://www.techradar.com/how-to/how-to-play-the-free-outriders-demo",
    "Reddit": "https://www.reddit.com/r/outriders/comments/lxntx5/outriders_demo_one_week_later_dev_update_official/"
  }
}