{
  "source": "https://www.techradar.com/news/these-stereo-speakers-come-with-an-awesome-space-saving-design-but-theyll-cost-you",
  "title": "These stereo speakers come with an awesome space-saving design – but they'll cost you",
  "category": "audio-visual",
  "updated": "2021-04-29T09:11:36Z",
  "author": "olivia-tambini",
  "summary": "They're the company's 'most advanced' speakers yet",
  "article": [
    "Bang & Olufsen has announced its \"most advanced\" wireless stereo speakers to date, and their unique space-saving design means that they won't dominate your living room.",
    "The Beolab 28 combine \"advanced acoustical innovations with convenient smart speaker features\", according to the company, and provide \"provides immersive, powerful studio-grade sound\" that automatically adapts to your space.",
    "The Beolab 28 comprise two column speakers with a rounded lower end, finishing in a cone that contains the woofer. They're held together by a backbone that hides the cables, and gives the impression that the speaker column is floating above the bottom cone.",
    "The stereo speakers can either be placed on the floor or hung on your wall, and come in Natural Silver, Black Anthracite or Bronze Tone aluminium. You can also choose between speaker covers in a knitted fabric or solid wood, so you should be able to find a finish that fits perfectly into your home.",
    "As well as looking pretty, those speaker covers have a special job; they open up like curtains when the speaker is switched on or move when the sound beam is adjusted, indicating whether the speaker is in narrow or wide mode. That certainly sounds like quite the spectacle.",
    "Inside each speaker is a built-in subwoofer, based on a custom-made 6.5-inch driver. That driver features a large excursion (in other words, it displaces lots of air as it moves), which the company says will create \"a powerful and precise\" bass response.",
    "That bass is also aided by Bang & Olufsen's Active Room Compensation, which should adapt the bass response to the room you put the speakers in – so in cramped spaces, it shouldn't sound too overpowering.",
    "Handling the mid and treble frequencies are three full range drivers and a one-inch tweeter on the front of each speaker, as well as an extra driver on the side. Bang & Olufsen says that these drivers and tweeters have \"exceptionally high\" sensitivity, so you should experience clear mids and precise trebles.",
    "Perhaps most interesting of all is the speakers' Beam Width Control. The company says that, in narrow mode, \"music reaches the ear directly and unaltered, minimizing the interference of side wall reflections and proving the ultimate sweet spot listening\".",
    "If you're looking for a less focused sound - perhaps for a party – wide mode diffuses sound around the speakers, \"maintaining a natural tonal balance even when sitting or walking away from the optimal listening area in front of the speakers\".",
    "As for connectivity, built-in support for music streaming means you should be able to easily play music from your phone through the speakers, with support for AirPlay 2, Chromecast, and Bluetooth.",
    "Bang & Olufsen says that the Beolab 28 will be made compatible with Beolink Multiroom later this year via an automatic software update, so you can use them as part of a wider home audio system.",
    "You can control the wireless speakers using a touch-sensitive interface on the top of the Beolab 28, which lights up as you approach it thanks to proximity sensors. Here, you can pause and play your music, skip tracks, and adjust the volume. There are also four 'favorite' buttons that let you present your chosen radio stations or Spotify playlists.",
    "Like other recent Bang & Olufsen speakers, the Beolab 28 come with a replaceable connectivity module, which the company says has been front-loaded with \"enough processing power and connectivity technology to receive new performance updates and features for years to come\".",
    "That means that, if the connectivity and streaming technology ever becomes outdated, the module can be replaced with the latest technology updates, so these speakers could last a very long time indeed.",
    "Their longevity may (slightly) soften the blow that comes with the Beolab 28's price tag. For the fabric-covered models, you're looking at £9,750 (about $13,500 / AU$17,400) per pair, while the wooden models are even pricier at £12,000 (about $16,700 / AU$21,500). Ouch."
  ],
  "headers": {
    "5": "Sound modes",
    "10": "Future-proofing"
  },
  "links": {
    "stereo speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "Spotify": "https://www.techradar.com/reviews/spotify"
  }
}