{
  "source": "https://www.techradar.com/news/epic-games-store-could-drain-a-scary-amount-of-laptop-battery-life-report-claims",
  "title": "Epic Games Store could drain a scary amount of laptop battery life, report claims",
  "category": "computing",
  "updated": "2021-03-24T14:31:00Z",
  "author": "darren-allan",
  "summary": "Steam does much better with power consumption, apparently",
  "article": [
    "The Epic Games Store may exact a rather shocking toll on your laptop battery, at least in certain scenarios going by a new report.",
    "These findings come from PC World, with the tech site noting a number of caveats, including that it has only conducted a limited amount of testing, as there are time issues involved evaluating battery rundown. Also, only certain hardware was used, too – not a gaming laptop, either, but actually a tablet hybrid: Microsoft’s Surface Pro 7+ (these results were stumbled on when reviewing the Pro 7+).",
    "Bearing all that in mind, PC World found that the Epic Games Store app running in the background on the Intel Tiger Lake-powered Surface Pro 7+ chomped as much as 20% of battery life – reducing battery longevity by some two hours – which is clearly an alarming figure. When the app was closed down, battery life returned to normal.",
    "Testing with Steam running in the background didn’t produce such a major drain, but only a slight drop of 3%. And interestingly, switching hardware to an AMD Ryzen processor also didn’t see the Epic store consuming such a lot of battery resources.",
    "The Epic Games Store running on a Surface Laptop 3 with Ryzen CPU witnessed a much smaller 8% decrease in battery life, although that’s still a bit of a hit, and more than we’d ideally be happy with. In this scenario, Steam made a negligible impact on the amount of battery juice available.",
    "While these are certainly somewhat worrying findings, they are tied to just one set of tests, so we definitely shouldn’t get carried away in assuming the kind of battery drain levels one might expect more broadly when running the Epic app.",
    "We contacted Epic for a comment on this, and a spokesperson told us: “Epic Games Launcher power consumption varies based on whether the launcher’s window is open. To address this, we’ve recently introduced an update [for client version 12.0.9] that has delivered improvements to power usage on Windows, and we are actively working to improve the performance and reduce the power consumption of our launcher.“",
    "Bear in mind the above tests were with the window minimized and the Epic Games Store app running in the background, as mentioned – PC World did also test with the window active (open), and found a slightly greater impact on battery longevity in this scenario, as Epic indicates.",
    "Since its launch, the Epic Games Store has been attracting a lot of gamers with its freebie giveaways, which have included some top-notch titles – although those flocking for the free offers may not be spending much outside of that activity (at least not yet)."
  ],
  "headers": {
    "5": "Epic drain?"
  },
  "links": {
    "Epic Games Store": "https://www.techradar.com/news/best-epic-games-store-games",
    "PC World": "https://www.pcworld.com/article/3608934/tested-how-the-epic-games-store-can-reduce-your-laptops-battery-life.html",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Surface Pro 7+": "https://www.techradar.com/news/microsoft-surface-pro-7-has-swappable-ssds-but-microsoft-doesnt-want-you-to-upgrade",
    "freebie giveaways": "https://www.techradar.com/news/free-epic-games-store-games-this-weeks-giveaways-revealed",
    "may not be spending much outside of that activity": "https://www.techradar.com/news/epic-games-store-freebies-are-attracting-tons-more-gamers-but-theyre-not-spending"
  }
}