{
  "source": "https://www.techradar.com/news/inexplicably-tottenham-hotspurs-son-heung-min-is-coming-to-pubg",
  "title": "Inexplicably, Tottenham Hotspur's Son Heung-Min is coming to PUBG",
  "category": "gaming",
  "updated": "2021-07-06T11:03:51Z",
  "author": "axel-metz",
  "summary": "Are ya winning, Son?",
  "article": [
    "Unexpected pop culture collaborations are nothing new in the gaming world. Travis Scott hosted a virtual concert in Fortnite, Fall Guys’ jellybean creatures got a wearable Godzilla skin and Jango Fett, for some reason, popped up in Tony Hawk’s Pro Skater 4.",
    "But it’s footballers who continue to establish themselves as gaming’s weirdest commercial partners in 2021, and PUBG’s latest off-the-pitch alliance is no different. Yes, Tottenham Hotspur's Son Heung-Min is coming to the popular battle royale game.",
    "PUBG first teased the collaboration via Twitter back in June, and did so again more recently, but eagle-eyed data miners have uncovered what to expect from the partnership when the game’s 12.2 update arrives on July 7.",
    "Images shared by PlayerIGN reveal an eight-piece cosmetic bundle as part of the collaboration with the South Korean winger, which is set to include two sportswear outfits, a signed helmet, the player’s game face, two new weapon skins and two of the player’s iconic celebrations as emotes.",
    "The bundle will likely be available to purchase via PUBG’s in-game store, though there’s no word on how much it will set you back. We’re guessing around 1000 G-Coin – approximately $10 / £10 / AU$13 – if recent cosmetic bundles are anything to go by, though previous items have exceeded that amount.",
    "It’s also still unclear whether Son will continue to work with Krafton, the game’s developer, as a brand ambassador for PUBG, or whether this cosmetic set represents the extent of their partnership. We’re assuming the latter, similar to Neymar Jr’s one-time collaboration with Fortnite.",
    "For a better look at Son in PUBG, PlayerIGN also shared some promo shots of the player modelling (virtually, of course) the new skins in the game world, which were officially posted to the PUBG Weibo account.",
    "What is clear, at least, is that we can expect countless Son-related memes to emerge when the game’s update drops on July 7.",
    "\"Are ya winning, Son?\", \"Cheers, Son's crying\" – you get the idea..."
  ],
  "headers": {},
  "links": {
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Fall Guys": "https://www.techradar.com/how-to/fall-guys-tips-guide",
    "Tony Hawk’s Pro Skater 4": "https://www.techradar.com/best/best-tony-hawk-games-from-tony-hawks-pro-skater-2-to-tony-hawks-underground",
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
    "Twitter": "https://twitter.com/PUBG/status/1407594307368984578",
    "again": "https://twitter.com/PUBG/status/1412310782294073344",
    "PlayerIGN": "https://twitter.com/PlayerIGN/status/1409742236204425218?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1409742236204425218%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.dexerto.com%2Fpubg%2Fhow-to-unlock-son-heung-min-pubg-skin-cosmetics-1604808%2F",
    "Neymar Jr’s one-time collaboration with Fortnite": "https://www.techradar.com/news/lara-croft-and-neymar-join-fortnite-season-6-battle-pass"
  }
}