{
  "source": "https://www.techradar.com/news/grand-theft-auto-the-trilogy-is-real-and-its-coming-to-nintendo-switch",
  "title": "GTA Trilogy remaster is real, and it’s coming to Nintendo Switch",
  "category": "gaming",
  "updated": "2021-10-08T15:33:23Z",
  "author": "adam-vjestica",
  "summary": "Three GTA games are being remastered",
  "article": [
    "Rockstar has confirmed that a GTA Trilogy remaster is on the way later this year, featuring HD remasters of Grand Theft Auto 3, Grand Theft Auto: Vice City, and Grand Theft Auto: San Andreas.",
    "The official title of the compilation is ‘Grand Theft Auto: The Trilogy - The Definitive Edition’, and will bring remasters of Rockstar’s GTA games to PS4, PS5, Xbox One, Xbox Series X/S, PC, and perhaps surprisingly, Nintendo Switch.",
    "The games will also come to iOS and Android in the first half of 2022, though we’re still awaiting pricing and a release date.",
    "The fact the game is coming to Nintendo Switch and mobile should give players an indication of how drastic this remaster will be. We're not expecting a huge overhaul when it comes to the game's visuals, though the remasters are expected to run on the Unreal Engine.",
    "Frustratingly, Rockstar hasn't shared what sort of technical upgrades we can expect from the GTA Trilogy, although we still don't really know how \"enhanced\" GTA 5 Enhanced Edition for PS5 and Xbox Series X is, either.",
    "We do at least know that the games will feature \"across-the-board upgrades including graphical improvements and modern gameplay enhancements for all three titles, while still maintaining the classic look and feel of the originals\", according to Rockstar's website.",
    "One other point to note is that Rockstar says it will begin \"removing existing version of the classic titles from digital retailers next week\", which is an odd decision, to say the least. It means that for preservation's sake, the new GTA Trilogy will be the only way to play these classic titles digitally moving forward, something that is bound to cause controversy with video game purists.",
    "It's great that Rockstar is releasing remasters of three of the best Grand Theft Auto games (though everyone has their personal favorites). However, the wait for a genuinely new title in the series is starting to become a running joke among fans.",
    "GTA 5 is set to be released for the third time in March 2022 and its latest trailer was panned by fans who claimed the game looks \"exactly the same\". Presumably, people are tired of hanging out with Franklin, Trevor, and Michael. GTA 6, meanwhile, is reported to release in 2024/2025, which isn't exactly just around the corner.",
    "Still, with the GTA Trilogy releasing on Nintendo Switch, it has the potential to reach a brand-new audience that may have never experienced three of Rockstar's best titles, as neither GTA 3, Vice City, nor San Andreas have released on Nintendo platforms in the past."
  ],
  "headers": {
    "7": "Analysis: the wait for a new GTA continues"
  },
  "links": {
    "GTA Trilogy": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "GTA 5 Enhanced Edition": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "website": "https://www.rockstargames.com/newswire/article/3933o7ko43o839/grand-theft-auto-the-trilogy-the-definitive-edition-and-more-coming-so",
    "best Grand Theft Auto games": "https://www.techradar.com/news/best-gta-games",
    "exactly the same": "https://www.techradar.com/news/gta-5-enhanced-edition-looks-exactly-the-same-as-fans-slam-games-latest-trailer",
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6"
  }
}