{
  "source": "https://www.techradar.com/news/pokemon-unite-tier-list-downloads-and-mobile-game-explained",
  "title": "Pokémon Unite: tier list, downloads, and mobile game explained",
  "category": "gaming",
  "updated": "2021-09-23T08:04:23Z",
  "author": "hamish-hector",
  "summary": "Pokémon Unite is out now on iOS, Android and Switch",
  "article": [
    "Pokémon Unite – the hit new Pokémon spin-off game – is out now on smartphones and Nintendo Switch consoles, having launched on iOS and Android a couple of months after its Switch debut.",
    "This new MOBA title is unlike pretty much anything we've seen from the Pokémon franchise before, offering plenty for both old and new fans to enjoy.",
    "We've rounded up everything you need to know about Pokémon Unite, including what it is, how to download it and which Pokémon are the best ones for your team.",
    "Pokémon Unite is a new MOBA starring many of your favorite monsters from the main series games. If you’re used to playing games like League of Legends or DOTA 2 you’ll be familiar with how MOBAs work; if not, here’s a quick rundown of Pokémon Unite.",
    "Unite is a 5v5 multiplayer match that’s all about battling. By defeating wild and opposing Pokémon you gain points that can be scored by dunking them into your opponent’s goal. Whichever team has scored the most points by the end of the match wins.",
    "While this is a change from the traditional gameplay of the franchise, familiar moves and evolutions make a return (but in a slightly new way). For one, all those type matchups you’ve spent years memorising mean nothing – Charizard is just as hurt by grass type moves as they are water.",
    "Additionally evolution is not permanent, meaning every match you’ll have to level up you Gabite, Charmander and Fletchling to get them back to their strongest forms.",
    "Pokémon Unite is now available on iOS, Android and Nintendo Switch. To download the game you’ll need an internet connection and access to the App Store, Google Play Store or Nintendo eShop respectively.",
    "The download comes in at just under 1GB (928MB according to the game’s official website). That isn’t too much space at all, so you almost certainly have space for it on your device.",
    "It’s completely free to download too, so if you’re interested in giving it a try there’s really no reason not to.",
    "Much like other MOBAs, Pokémon Unite will have a weekly rotating pool of six free Pokémon you can play with in matches, but if you want to be the very best like no one ever was you might want to unlock some permanently so you learn all of their strategies.",
    "When you start Pokémon Unite you can earn one Pokémon for free out of Charizard, Pikachu, Eldergoss, Snorlax or Talonflame. After that you’ll have to buy Pokémon using in-game currency or through free unlock challenges.",
    "By levelling up you can unlock two new buddies. At level two you get Slowbro and at level five you get Venusaur. Beginners can take part in a series of daily quests to unlock Crustle (but only within your first 30 days of starting the game).",
    "If you’re on mobile you can also take part in an event right now to win 32 battles and unlock Zeraora.",
    "Finally, there’s a 14-day Welcome gift event that rewards you for playing every day for two weeks. If you get all the rewards you’ll also unlock Alolan Ninetails, Cinderace, and Greninja.",
    "Pokémon Unite won’t just give you every Pokémon for free as explained above, so before you spend your hard-earned credits you might want to know which Pokémon are worth it. Here’s our breakdown of tier lists for each category",
    "Attacker tier list",
    "Unsurprisingly, Pokémon’s mascot would appear at the top of its tier list. It’s range lets you deal damage from afar and its variety of attacks make it perfect for crowd control. Cramorant is decent too, you just have to be accurate with your moves and know when to use them.",
    "Venusaur and Greninja sit near the bottom due to their limited usefulness -Venusaur is great near the match’s start and Greninja by the end. Both come with some increased risk, but if you can coordinate with your team, you might have a winning strategy on your side.",
    "Defender tier list",
    "Crustle, Blastoise, and Snorlax are all fairly decent picks that are hard to choose between. Crustle can slow attackers down, Blastoise can pack a punch back and Snorlax can heal up without having to retreat.",
    "Slowbro, while still decent, ends up on the bottom by virtue of not being the other three, but its abilities are still good. If you aren’t interested in playing defender often this free ‘mon is the only one you need.",
    "Speedster tier list",
    "Gengar can take a little time to power up, but once it has Levitate, Dream Eater and Hex, your opponent is in for a fright. It truly puts the speed in speedster.",
    "Zeraora and Absol are fairly good choices too with good offensive capabilities that make them forces to be reckoned with, especially when they show up to aid an ally.",
    "Supporter tier list",
    "Blissey and Mr Mime offer great support and can stick around for the long haul thanks to their great endurance stats. Mr Mime can be tricky to master, and Blissey won’t be able to fight back on its own, but as long as you stick with an ally you should be fine.",
    "Eldegoss is very well-rounded and a great choice if you’re only playing support because no one else is. You’ll be able to lend a hand in more ways than one if you use its abilities correctly.",
    "All-rounder tier list",
    "For All-rounders, Machamp’s powerful fists make it an ally you’d rather have on your team than against you. Even at lower evolution stages it’s fairly strong and once its unite move unlocks you’ll be able to boosts its stats right up to make it an absolute tank.",
    "Lucario is a close second, aided by the fact they don’t need to evolve, but Garchomp and Charizard are lower because they can take a little longer to reach their full potential - limiting their early match usefulness."
  ],
  "headers": {
    "3": "What is Pokémon Unite?",
    "7": "How to download Pokémon Unite",
    "10": "How to unlock new Pokémon in Pokémon Unite",
    "15": "Pokémon Unite tier lists"
  },
  "links": {
    "smartphones": "https://www.techradar.com/news/best-phone",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "having launched on iOS and Android": "https://www.techradar.com/news/pokemon-unite-launches-on-mobile-today-but-you-might-have-to-wait-to-play"
  }
}