{
  "source": "https://www.techradar.com/news/microsoft-exchange-vs-outlook",
  "title": "Microsoft Exchange vs Outlook: what's the difference?",
  "category": "computing",
  "updated": "2021-03-19T15:25:17Z",
  "author": "alex-mcomie",
  "summary": "We compare two of the most popular email providers for businesses",
  "article": [
    "Microsoft is one of the most popular email providers, and users can get a Microsoft email account through either Outlook or Exchange Online. While Outlook is a decent email client on its own, Exchange Online subscriptions have a variety of helpful features for businesses.",
    "In this article, we’ll cover the key differences between Microsoft Exchange and Outlook and help you identify the right option for your business. We’ll also outline the additional tools available in Microsoft 365 Business Standard, a productivity suite that includes a subscription to Exchange Online.",
    "Upgrading to an Exchange Online subscription gives you access to a number of features that aren’t available with a free Outlook email account. First, you’ll be able to store up to 50 GB with Plan 1 or 100 GB and unlimited archive storage with Plan 2. Users of Plan 2 can store their entire email history without worrying about running out of space.",
    "While Outlook gives you the option to create and manage groups, Exchange Online comes with much deeper tools for collaboration and team organization. Admins can create and share resources, contacts, or subgroups, and they have full control over individual and team permissions.",
    "Furthermore, Exchange Online Plan 2 offers an additional layer of security through data loss prevention. Besides the pre-set policies provided by Microsoft, you can utilize policies from independent vendors or develop your own based on your brand’s unique needs and priorities.",
    "Microsoft 365 makes it easy to connect email addresses to a custom domain, although this feature isn’t available with Exchange Online. Custom email addresses can make your brand appear more professional, especially compared to the usual @outlook.com.",
    "While Exchange Online provides far more tools than Outlook alone, Exchange Online users can still access their accounts through Outlook, which has a clear and professional design that makes it easy to find what you’re looking for. You can access the Outlook client online or through mobile apps on iOS and Android devices. A desktop app is also available for Microsoft 365 users.",
    "On the other hand, the Exchange admin center can be significantly more intimidating for new subscribers. This dashboard contains all the tools you need to manage your organization’s hosted email, but it may take you longer to get familiar with its features and options.",
    "That said, Exchange goes above and beyond Outlook when it comes to security. While Outlook merely filters spam emails into the Junk folder, Exchange Online Protection is far more flexible. Admins can actively filter messages based on corporate policies or government regulations in order to ensure compliance throughout the organization.",
    "Finally, Exchange Online enables subscribers to send substantially larger messages than those supported by Outlook. Outlook limits individual messages to a total size of just 20 MB, compared to 150 MB for Exchange Online. Keep in mind, though, that large attachments may be blocked by the recipient’s email client.",
    "Microsoft Support has many detailed articles on a wide range of common questions and issues for Outlook, Exchange Online, and a number of other platforms. You can also submit questions to the support community, which is relatively active.",
    "Live support is available for both Outlook and Exchange Online users through a 1-800 number or live chat interface. Unfortunately, the website doesn’t list any hours or estimated wait times for free users. Subscribers to 365 Business get access to 24/7 phone and web support.",
    "Microsoft’s branding is somewhat unclear, as the Exchange Online subscription is sometimes marketed as “Outlook for Business.” That said, the Outlook app itself is completely free. Like any other email provider, Outlook enables users to send and receive emails, though free users are limited to 15 GB of email storage.",
    "Exchange Online subscriptions start at $4 per user per month with an annual commitment for Plan 1, which comes with 50 GB of storage and basic tools such as calendar/contact sharing and inbox management.",
    "At $8 per user per month, Plan 2 adds a few advanced features, including data loss prevention and hosted voicemail. Along with raising the primary mailbox storage limit to 100 GB, Plan 2 provides unlimited storage via the In-place Archive.",
    "Finally, Microsoft 365 Business Standard subscriptions are available for $12.50 per month. This plan includes all features from Plan 1, 1 TB of file storage, and access to other apps, such as Word, Excel, and Microsoft Teams.",
    "Microsoft Outlook provides more than enough tools for many individuals and small businesses, but there’s no question that Exchange Online has a wider range of features. Whether these tools are worth the cost depends on the size of your business and your email needs.",
    "Extra storage space, 24/7 support, personalized email addresses, and data loss prevention are just a few benefits of Exchange Online. Given that plans start at just $4 per user per month, Exchange Online is an excellent option for any business that isn’t satisfied with Outlook’s features or storage limit."
  ],
  "headers": {
    "2": "Features",
    "6": "Performance",
    "10": "Support",
    "12": "Pricing and plans",
    "16": "Verdict"
  },
  "links": {
    "email providers": "https://www.techradar.com/news/best-email-provider",
    "email client": "https://www.techradar.com/best/best-email-clients",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "productivity suite": "https://www.techradar.com/best/best-productivity-apps",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Microsoft 365": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46194&u1=trd-us-2319231845387992600&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-US%2Fmicrosoft-365",
    "Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams"
  }
}