{
  "source": "https://www.techradar.com/news/why-we-didnt-see-the-nintendo-switch-pro-at-e3-and-when-it-might-be-announced",
  "title": "Nintendo Switch Pro at E3: why wasn't the new Switch announced?",
  "category": "gaming",
  "updated": "2021-07-06T13:54:19Z",
  "author": "adam-vjestica",
  "summary": "The Nintendo Switch Pro is coming… one day",
  "article": [
    "Well, the day is now here...the Nintendo Switch OLED is finally official, costing $349 and landing this October.",
    "Original article continues below:",
    "After appearing to be almost a certainty a few weeks ago, the Nintendo Switch Pro wasn’t announced at E3. Instead, Nintendo focused on showcasing upcoming Nintendo Switch games for 2021 and 2022, and that’s exactly what we got.",
    "While it wasn’t the most thrilling Nintendo Direct we’ve ever seen, it at least gave fans another glimpse of The Legend of Zelda: Breath of the Wild 2, which is due to release sometime in 2022, and a couple of surprises in Metroid: Dread and Advance Wars 1+2 Bootcamp.",
    "Funnily enough, despite making it clear that its E3 presentation would strictly focus on Switch games, Nintendo did actually reveal some new hardware: the Game & Watch: The Legend of Zelda console. However, the upgraded Switch that so many industry insiders and analysts had predicted was nowhere to be seen.",
    "With so many sources pointing to the existence of Nintendo’s new Switch, such as this report from Bloomberg, we’re still confident that the console is in development. Nintendo clearly isn’t quite ready to reveal it just yet, however, and E3 wouldn’t have been the best place to do so.",
    "If Nintendo did draw back the curtain to reveal a shiny new Switch Pro, which is tipped to have a 720p OLED screen and output at 4K resolution when hooked up to a TV, it’s likely that the company’s upcoming lineup of games would have been completely overshadowed by the new hardware.",
    "A large chunk of Nintendo’s conference would have required the company to delve into what the system can do, why it was made, and more importantly, why consumers should buy it. It’s more likely, then, that Nintendo will opt to dedicate an entire Nintendo Direct to the new hardware.",
    "With many suggesting that the Nintendo Switch Pro is set to release this year, we can only speculate that an announcement is still imminent. To give us an idea of which month Nintendo might choose to reveal the Switch Pro, the Nintendo Switch was announced in October and the Wii was announced in September. In contrast, both the Wii U and Nintendo 3DS were revealed at E3, and failed to get tills ringing when they launched.",
    "That’s not to say the same thing would have happened to the Nintendo Switch Pro, but there’s enough evidence to show that new hardware is best served when consumers can focus solely on its reveal, and not be distracted by new game announcements or what the competition is showing.",
    "With the Nintendo Switch and Nintendo Switch Lite continuing to fly off the shelves, you may be wondering why a Switch Pro is even necessary at this point. Well, with the Switch approaching its fifth year on sale, it’s starting to look slightly dated, particularly for those who play Switch games on the TV. Having a better display and the ability to output at 4K would certainly appeal to those who wish the Nintendo Switch was more powerful, and it would also extend the lifespan of Nintendo’s console, which traditionally last five years.",
    "Nintendo could also ditch the idea of a Nintendo Switch Pro and decide to make a Nintendo Switch 2, which could go a lot further in terms of innovating upon the console’s current design. It could also support backwards compatibility so that the Switch’s vast library of games isn’t forgotten about.",
    "Either way, we’re approaching the period where Nintendo usually reveals what’s next, and we’ve got no doubts that they won’t try to surprise us in some shape or another. Until then, we’ll have to wait until Nintendo’s ready to share more."
  ],
  "headers": {
    "8": "When will we see the Nintendo Switch Pro?",
    "10": "Who is the Nintendo Switch Pro for?"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "E3": "https://www.techradar.com/news/e3-2021",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "The Legend of Zelda: Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Metroid: Dread": "https://www.techradar.com/news/its-not-metroid-prime-4-but-metroid-dread-is-the-first-new-2d-entry-in-20-years",
    "Advance Wars 1+2 Bootcamp": "https://www.techradar.com/news/advance-wars-is-coming-to-nintendo-switch-in-3d-gba-remakes",
    "Game & Watch: The Legend of Zelda": "https://www.techradar.com/news/the-legend-of-zelda-game-and-watch-what-it-is-and-where-to-buy-it",
    "Bloomberg": "https://www.techradar.com/news/nintendo-switch-pro-might-be-revealed-before-e3-and-it-could-release-very-soon",
    "720p OLED screen": "https://www.techradar.com/news/why-the-nintendo-switch-2s-720p-oled-screen-would-make-perfect-sense",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Wii": "https://www.techradar.com/news/gaming/consoles/how-the-nintendo-wii-won-the-console-war-1197348",
    "Wii U": "https://www.techradar.com/news/nintendo-switch-continues-to-be-a-slap-in-the-face-to-all-wii-u-owners",
    "Nintendo 3DS": "https://www.techradar.com/news/5-reasons-you-should-buy-a-nintendo-3ds-over-the-nintendo-switch",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nintendo Switch 2": "https://www.techradar.com/news/nintendo-switch-2-news"
  }
}