{
  "source": "https://www.techradar.com/news/if-youre-experiencing-crashes-in-the-new-windows-11-build-heres-how-to-fix-it",
  "title": "If you're experiencing crashes in the new Windows 11 build, here's how to fix it",
  "category": "computing",
  "updated": "2021-09-03T10:49:44Z",
  "author": "daryl-baxter",
  "summary": "Microsoft is aware of the issues",
  "article": [
    "With Windows 11 being prepared for release on October 5, more Insider Builds are still being released to make sure that bugs are squashed while more refinements are rolled out.",
    "As we see applications such as Paint and the Snipping Tool be redesigned for the new upgrade, Microsoft is fine-tuning the release through the help of the Insider channels to make sure that it’s a substantial upgrade over Windows 10.",
    "However, users have been reporting issues with build 22000.176, bringing crashes across the operating system.",
    "While it’s normal to expect issues with insider builds, users have been reporting strange bugs with this particular build, but Microsoft is already aware, with a quick-fix already available.",
    "Users are finding that when the taskbar or other parts of the Explorer interface are being used, it’s either crashing or being non-responsive.",
    "Some have reported coming across this message when trying to launch an application as well: “This file does not have an app associated with it for performing this action. Please install an app or, if one is already installed, create an association in the Default Apps Settings page.”",
    "Microsoft has already updated the blog post explaining that it was a server-side issue responsible for these bugs. The following should fix these if you were experiencing anything similar when you updated to build 22000.176:",
    "There’s always the temptation to install the latest and greatest software from Apple, Microsoft and Google. It could be a new version of a web browser, or a new update to iPadOS for example. However, there are always risks associated with doing this, as it isn’t the final version.",
    "We’ve already seen the journey of the new Safari browser from Apple at WWDC 2021, with most of the design now reverted to how it’s always been, thanks to feedback from beta users.",
    "But some are still tempted to use these test versions on their main machines that are used for work and gaming. With build 22000.176 of Windows 11, it’s a great example of when something in testing can suddenly go wrong, which is why we always recommend installing these versions on a machine that you barely use, or through virtualization applications such as Parallels Desktop.",
    "Microsoft is on the home stretch with Windows 11 as October 5 nears, so if you’re on the Insider channel on your main PC, the time could be now to exit it and use Windows 10 until the free upgrade comes calling."
  ],
  "headers": {
    "4": "How to fix issues in 22000.176",
    "7": "Analysis: the time could be now to exit the Insider program"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "build 22000.176": "https://blogs.windows.com/windows-insider/2021/09/02/announcing-windows-11-insider-preview-build-22000-176/",
    "updated the blog post": "https://blogs.windows.com/windows-insider/2021/09/02/announcing-windows-11-insider-preview-build-22000-176/"
  }
}