{
  "source": "https://www.techradar.com/news/the-resident-evil-movies-first-trailer-has-dropped-and-it-doesnt-completely-suck",
  "title": "The Resident Evil movie's first trailer has dropped, and it doesn't completely suck",
  "category": "entertainment",
  "updated": "2021-10-07T16:19:18Z",
  "author": "rhys-wood",
  "summary": "The latest Resident Evil movie doesn't look terrible",
  "article": [
    "The upcoming Resident Evil: Welcome to Raccoon City movie is releasing exclusively in theaters on November 24, 2021, and the long-awaited film has finally received its first trailer. And the best part is that, shockingly, it doesn't look half bad.",
    "At roughly two and a half minutes long, the trailer largely focuses on the events of Resident Evil 2, that being in and around the Raccoon Police Department headquarters. Set design is impressively evocative of the PS1 original, as well as the lauded 2019 Resident Evil 2 remake.",
    "Later in the trailer, the perspective shifts to the series' inciting incident at the Spencer Mansion where, once again, the set looks to be remarkably on point. Across both settings we see familiar characters in the form of Claire and Chris Redfield, Jill Valentine and more.",
    "There's an impressive amount of attention to detail, too. The title of the movie is presented in the iconic Resident Evil font, and there are tons of easter eggs sprinkled throughout the trailer that series fans will have no trouble recognizing, like the truck scene from the opening of RE2, as well as \"itchy tasty\" scrawled in blood, referring to a haunting file found in the first game.",
    "A large amount of the series' terrifying creatures also make an appearance, and we're not just talking about the zombies. We spotted Resident Evil 2's horrifying Licker, alongside Cerberus dogs and what appears to be the final form of the mutated Umbrella scientist William Birkin.",
    "We won't rush to conclusions for Resident Evil: Welcome to Raccoon City just yet, but judging by this first trailer, the film looks to be doing a lot of things right. Set design is incredibly accurate and fittingly moody, and there are tons of recognizable props and iconography that scream \"Resident Evil.\"",
    "It's certainly a far cry from the Paul W.S. Anderson hexalogy of Resident Evil movies, which arguably took themselves far too seriously while deviating hugely from the series' plot and themes.",
    "Much like the positive impression we got from the first sneak peeks at Netflix's Cowboy Bebop, Resident Evil: Welcome to Raccoon City similarly gives us hope that maybe, just maybe, we'll finally get a video game adaptation that doesn't completely suck."
  ],
  "headers": {
    "5": "Analysis: Yep, we're excited"
  },
  "links": {
    "Resident Evil: Welcome to Raccoon City": "https://www.techradar.com/news/new-resident-evil-movie-title-should-delight-fans",
    "Resident Evil 2 remake": "https://www.techradar.com/reviews/resident-evil-2-remake-review",
    "Netflix's Cowboy Bebop": "https://www.techradar.com/news/netflixs-cowboy-bebop-is-showing-anime-adaptations-how-its-really-done"
  }
}