{
  "source": "https://www.techradar.com/news/theres-a-new-lord-of-the-rings-mobile-game-coming-but-wed-avoid-it",
  "title": "There's a new Lord of the Rings mobile game coming - but we'd avoid it",
  "category": "phones",
  "updated": "2021-08-25T14:37:40Z",
  "author": "tom-bedford",
  "summary": "Another time-wasting kingdom builder?",
  "article": [
    "You might be surprised to hear that, unlike other popular franchises like Game of Thrones or Star Wars, there aren't really that many Lord of the Rings games available on mobile phones - this is something it seems Chinese gaming leviathan Netease is hoping to solve with a new title.",
    "The company has just announced Lord of the Rings: Rise to War is coming to mobile phones on September 23 for the US, Europe, Oceania and some parts of Asia.",
    "The title is already available to pre-register on the Play Store here, but there doesn't seem to be an Apple App Store listing just yet.",
    "War is something you don't typically 'Rise' to, as most people would prefer to 'Go' to it (or avoid it altogether, outside games); strange name aside, LOTR:RTW was actually announced some time ago, though the release date news has given it a lot more visibility.",
    "The actual app listing is pretty vague on details regarding the game, so you'd be forgiven for having some optimism regarding the upcoming Lord of the Rings game - the images shown are clearly just promotional artwork, and the video is just meaningless text with rendered figures which look ripped straight from the original Battle for Middle Earth game.",
    "While official details on Lord of the Rings: Rise to War are vague, a few YouTube channels show beta footage of the game, and it looks... questionable.",
    "A little history lesson. There was a nasty span of years where 'kingdom builder' games tended to be the rage, both for mobile phones and browsers; they're nowadays often referred to as 'Clash of Clans clones', though many predate that watershed title.",
    "These were idle RPGs; you'd build a kingdom that would auto-generate resources when you weren't playing, and using these resources you'd construct buildings to increase the rate of resource generation. You'd also create other buildings like barracks and armories to create soldiers, which you could send on missions or raids against other players to grow your own wealth.",
    "The problem was that each of these actions took increasingly more time, so soon you'd have to be waiting days to do even basic tasks for your kingdom. The solution to that problem was to pay money to speed things up or skip the wait, so these games were pay-to-win in a way you'd only really notice once you were fully committed.",
    "Plus, loads were deceptively boring; you could waste weeks getting through the initial stages of a game, only to realize there was little beyond an attractive veneer.",
    "This kind of game was a nasty but standard part of mobile gaming for a good few years, and was only superseded when the industry really came into its own with fantastic gaming experiences that didn't exist just to rip you off. Clash of Clans is one of the few titles that bucks the trend by actually being okay to play without paying.",
    "This is a very circuitous way of saying that, from the beta footage of the game, Rise to War looks exactly like your cookie-cutter kingdom builder, with the Lord of the Rings skin thrown on top with a slap-dash abandon.",
    "The footage above shows all the standard kingdom builder elements: advisors popping up to guide you in excruciating detail through the tutorial, big counters telling you your hourly resource harvest rates, timers reminding you that you have to wait to do anything in the game, and there's a whiff of premium (read: paid) currency too.",
    "It's disappointing to see Lord of the Rings: Rise to War is that kind of game, especially now that mobile gaming offers such a wide variety of experiences, with developers constantly coming up with new ways to tell stories and entertain on the small screen.",
    "Watching that footage put us off any hope we had off a canonically or thematically faithful adaptation of Tolkein's world; instead, this looks like one of many mobile games we'll studiously avoid. This has made us very uneasy about Netease's recently-announced mobile Frostpunk game, and has us wanting the Lord of the Rings TV show to come along and cleanse our palette."
  ],
  "headers": {
    "5": "Analysis: Frodon't download"
  },
  "links": {
    "has just announced": "https://twitter.com/NetEaseGames_EN/status/1430465323078086657",
    "Play Store here": "https://play.google.com/store/apps/details?id=com.netease.lotr&hl=en_GB&gl=US",
    "Netease's recently-announced mobile Frostpunk game": "https://www.techradar.com/news/yet-another-critically-acclaimed-strategy-game-is-coming-to-mobile-phones",
    "Lord of the Rings TV show": "https://www.techradar.com/news/lord-of-the-rings-on-amazon"
  }
}