{
  "source": "https://www.techradar.com/news/diablo-immortal-release-date-news-trailers-phones",
  "title": "Diablo Immortal: everything there is to know about Blizzard's mobile game",
  "category": "gaming",
  "updated": "2021-08-04T10:22:46Z",
  "author": "gerald-lynch",
  "summary": "Diablo Immortal sees the hack n' slash dungeon crawler heading to mobile",
  "article": [
    "Diablo Immortal is bringing the world’s premier action role-playing game series, Diablo, to mobile devices but, following a recent delay, we won't get our hands on it until next year.",
    "Initially announced back in 2018, Diablo Immortal met with some controversy as fans weren't enthused by the idea of a mobile Diablo experience. But it seems that, with time and some more information on the game, the tide is beginning to turn. In early 2021, some select publications were given access to an early alpha version of the game and their positive reactions have raised hopes. According to IGN, Diablo Immortal is “great – a proper new entry in the series, and not – as some feared - a watered-down mobile lookalike.”",
    "While it initially looked likely that 2021 would be the year Diablo Immortal is unleashed on iOS and Android devices, Blizzard announced in August that Diablo Immortal has been delayed until 2022 to allow for more fine-tuning and improvements.",
    "We enjoyed our brief hands-on time with the game and are looking forward to seeing more but ,in the meantime, we've gathered together everything you need to know about Diablo Immortal, as well as more first impressions from early testers of the game.",
    "Diablo Immortal is set to release \"in the first half of 2022\", according to Blizzard.",
    "Initially Diablo Immortal was due to release sometime in 2021, but Blizzard announced in August that the ARPG has now been delayed until next year as the team needs more time to tune \"core and endgame features\".",
    "We'll have to wait for news from Blizzard on a more firm official release date but at the moment we only know that more tests are planned for later this year.",
    "The launch of a closed Alpha test in April 2021 brought with it a video developer update in which we get very brief glimpses at some more parts of the game.",
    "Diablo Immortal made an appearance at a gaming convention in China called ChinaJoy, with a brand new gameplay trailer (via BlizzPlanet). Across around two and half minutes of footage the trailer gives a glimpse of new models, UI and Diablo 2 villain Baal makes a brief appearance.",
    "BlizzCon 2019 brought a gameplay and development update trailer for Diablo Immortal which shows some new character classes, gameplay mechanics and locations.",
    "Check it out below:",
    "Two trailers were revealed for Diablo Immortal during Blizzcon 2018 – one a relatively extensive look at gameplay, the other a cinematic focusing on the story.",
    "Feast your eyes on both below:",
    "It may be a mobile game, but for the most part this is going to be the same Diablo you already know and love, albeit with controls designed to make the most out of a phone touchscreen rather than a mouse or controller.",
    "Developed cooperatively between Blizzard and Chinese devs at NetEase (the company which co-operates Overwatch, Diablo 3 and Warcraft in China), the game will be set five years after the events of Diablo 2, and will explore what happened after the Worldstone was destroyed in that game, and the path taken to the dismal world of Diablo 3.",
    "The likes of Tyrael, Malthael, and Leah and Deckard Cain will all feature in the story, as will the demon hunters Valla and Josen who appeared in Blizzard’s Heroes of the Storm. In terms of foes, expect appearances from Diablo’s buddy Baal and Skarn, the Herald of Terror. Story beats will be dished out via non-playable characters, with additional storylines landing through updates to the game.",
    "Built from the ground-up, Diablo Immortal will introduce new abilities and techniques not yet seen in a Diablo game. While six familiar classes will be present (Barbarian, Demon Hunter, Monk, Necromancer, Crusader and Wizard – with the Witch Doctor notably absent at this stage), they’ll be able to work together in all new ways.",
    "Abilities will be able to be combined to make cross class co-operative play more exciting. A Wizard for instance will be able to freeze a foe with ice crystals before firing a beam called the Ray of Frost into the crystal. When used individually, the Ray of Frost and ice crystals can only take down one baddie, but if the ray is fired at the crystal, it fragments the beam so it can hit multiple enemies.",
    "Players will be able to use Ultimate Abilities (charged through repeated basic attacks) and Legendary items in order to enhance their powers and unleash well-timed devastating attacks that could give them the edge in a difficult battle.",
    "Projectile and melee attacks will also be more clearly directional now—many attacks will include a a directional cone within which to fire them off, which will likely be handy when attempting to trigger the combo moves described earlier.",
    "The other big change for the game will be the amount of players who can team up together. Previously, this has topped out at four for Diablo 3. But footage of Diablo Immortal shows as many as ten players banding together to battle foes. Early reports indicate that these large scale battles will be locked to open world areas, with instanced dungeons (and the boss specific loot they offer) instead tied to four-player maximum parties, though a recent trailer from ChinaJoy looks like it has six-player parties available.",
    "There also seems to be a greater emphasis on environmental and platforming obstacles in Diablo Immortal. The gameplay clip showed levels in which players had to abseil down a chasm while battling the forces of darkness, and another where they travelled along what appeared to be a river in a raft, taking on baddies along for the ride.",
    "The question is how similar will Diablo Immortal be to previous Diablo games?",
    "Let's take a look at the early review of Diablo Immortal on Forbes, which should provide an initial answer to that question:",
    "\"So, it’s stripped down. But it plays well with the simplified controls and loot system, and the game essentially looks pretty close to Diablo 3, albeit a bit lower spec.\"",
    "\"This is a totally new game, to be clear, not a port. It has a new story and a surprising amount of voicework attached to it, and you will be fighting familiar enemies, yes (Fallen, spiders) but also new ones (Gargoyles). The game is not terribly difficult at the moment, and I haven’t died once, but it is slowly getting harder in time.\"",
    "So it'll have everything you know and love about Diablo, but will still feel fresh – hopefully. You’ll fight enemies, level up to acquire new skills while dearly wishing that the next felled foe will drop a more powerful weapon, armour piece or accessory to make your coming battles easier. It’s an addictive loop that has made Diablo one of the most revered franchises in all of gaming.",
    "Diablo Immortal’s announcement was met with, at best, a mixed reception. It’s been several years since Blizzard released a mainline Diablo game, and so the trailer seemed a tease for those expecting a full PC or console release. As such, the backlash was immediate, with some accusing Blizzard of cashing in on fans’ goodwill, and that the game was merely a reskin of co-developers NetEase’s previous mobile ARPG titles.",
    "Blizzard has looked to allay fears, saying that it’s taking as much care with Diablo Immortal as any of its titles, and assuring fans that it’s an all-new game worth their time.",
    "In an interview with GamesBeat, Blizzard president J. Allen Brack defended the decision to create a mobile game stating that while Blizzard would like its core fanbase to give the mobile release a chance, it's understood that \"every game is not going to be for every person\".",
    "Brack added that as a mobile title, Immortal will, of course, be \"different\" and that it's not trying to replicate the PC experience\" but promised \"it’s going to be a good, authentic experience for the Blizzard games we bring to that platform.\"",
    "However, so great has been the animosity that Blizzard has had to show its hand for further titles earlier than expected. Diablo 4 was officially announced at Blizzcon 2019 but, previous to this, Blizzard revealed that Immortal was not the only Diablo game currently in the works.",
    "In another interview with IGN, Brack said that the fan reaction to Immortal's reveal had taught Blizzard \"a huge number of lessons\". Brack acknowledged concern that Blizzard was moving away from PC releases in favor of mobile but said that this mobile release \"doesn’t mean we’re not going to be continuing to make awesome PC games and awesome console games like we have in the past\".",
    "In December 2020 it was confirmed that Diablo Immortal is going to be a free-to-play game with optional in-app purchases.",
    "In the announcement, Blizzard said \"We plan on supporting Diablo Immortal with a constant cadence of free content, including new gear, features, classes, stories, and areas to explore. We also want to make sure every purchase feels fair and is guided by a clear set of values that place an emphasis on the player experience for all players.\"",
    "In-app purchases are going to be \"entirely options\" so they aren't going to involve things like buying equipment - that can only be had by playing the game. Instead, in-game purchases will allow players to buy gems, crests and reforging items. In the BlizzCon 2021 Q&A, it was said that there are plans for a battle pass system with free and paid tracks.",
    "When Diablo Immortal launches it’ll have six core classes and the team is planning to add more along with extra areas and content. This will also be free to every players and no classes, zones or other content will be paywalled. “In-game purchases should never circumvent gameplay. We want to structure our purchases so it’s a bonus and you feel good about it,” lead designer Wyatt Cheng said.",
    "In an early test of the alpha version of the game, one reviewer wrote for IGN:",
    "\"I wasn’t able to spend real money during the alpha, but I felt no compunction to do so, nor did I feel like I was missing out on anything by purely playing Immortal free-to-play.\"",
    "\"This game has an awful lot of compelling gameplay and content for free, and all future content will also remain free, whether it’s new gear, areas, features or even classes. The proof will be in the playing, of course, but at this point the real-money options seem like they won’t be necessary to enjoy Diablo Immortal, but instead will be a nice bonus for those that are already in deep.\"",
    "Delayed to tune \"core and endgame features\"",
    "Blizzard announced in August that Diablo Immortal will no longer release in 2021, with the team now aiming for release in the \"first half of 2021\".",
    "\"Following feedback provided by test participants of the Closed Alpha, our team has been tuning core and endgame features,\" Blizzard wrote in a blog post announcing the delay. \"For example, we’re iterating on PvP content like the Cycle of Strife to make it more accessible, alongside late-game PvE content like the Helliquary to make it more engaging. We’re also working to provide controller support for those who want to play our game in a different way. However, these changes and additional opportunities to improve our gameplay experience will not be realized in the 2021 timeframe we had previously communicated. So, the game is now planned for release in the first half of 2022, which will allow us to add substantial improvements to the whole game.\"",
    "Blizzcon 2021 cancelled",
    "Don’t expect to get a Blizzcon 2021 update on Diablo Immortal—Blizzard has announced that the show is cancelled.",
    "“The ongoing complexities and uncertainties of the pandemic have impacted our ability to properly move forward on many of these fronts, and ultimately we’re now past the point where we’d be able to develop the kind of event we’d want to create for you in November,” writes Saralyn Smith, Executive Producer of BlizzCon.",
    "An online event with “smaller in-person gatherings” will apparently be held in early 2022, much like BlizzConline 2021. More details on this are expected at a later date, however, Diablo Immortal is expected to launch in some form this year so it remains unclear when we'll get our next update.",
    "Cycle of Strife and PvP",
    "We had the chance to sit down with some of Diablo Immortals developers to discuss the game’s faction vs faction PvP mode, Cycle of Strife, currently being tested in closed Alpha. With players taking part as Shadows, Immortals or Adventurers, competing in cycles, Diablo Immortal’s PvP is quite unique and potentially complex, particularly for a mobile game.",
    "“So part of [Cycle of Strife] was that [Diablo Immortal] is an MMO, part of it is we want to have a big social structure, and part of it was some more recent Diablo games didn’t have PvP,” Senior System Designer Kris Zierhut told Techradar. “This is really the first big PvP system that Diablo has ever had.”",
    "At the moment, the team is still adjusting and tweaking Cycle of Strife but even on release, Cycle of Strife will continue to change as more content is added and items are rebalanced. See more detail on Cycle of Strife in our full interview.",
    "A “much richer endgame experience” than Diablo 3",
    "Diablo Immortal’s endgame will apparently be “much richer” than that in Diablo 3, the game’s senior combat designer Julian Love has told Pocket Tactics.",
    "“One of the things that we really want is for players to have lots of different things to do in order to progress their characters,” Love says. “We have things like elder rifts, which are an incremental improvement on greater rifts. Then you’ve got the Helliquary, you’ve got bounties, you’ve got PvP. There’s also the Cycle of Strife that includes an adventurer thread, which is for people who are more PvE focused.",
    "“Typically, when we think about games, we think about levelling up through the storyline, seeing all the zones, then you reach a level cap, and that’s where the game ends. But in the case of Immortal, that’s really kind of where a whole new version – the full-blown version – of the game begins, in that all of these systems are unlocked for you and all of that variety is at your disposal.”",
    "Love touches on the game’s MMO nature and how this “more social environment” plays into the endgame. The Helliquary, he explains, is “a big endgame system where you are setting yourself up against these really large demons that are very intentionally difficult to fight. You’re going to have to prepare for those, you’re going to have to get good at them, you’re going to have to go out and engage in other aspects of the game in order to take them on.",
    "“Of course, players are going to share stories about those kinds of challenges with one another and reach out to others within the game in order to discuss those things. If it was an entirely single-player experience, those stories wouldn’t get shared and referenced as much as when you have a social environment.”",
    "Hands-on",
    "We had the chance to go hands-on with Diablo Immortal, experiencing 10 hours of the game and we enjoyed our time with it. We found that \"a lot of the Diablo experience has been adeptly preserved in the mobile game\" and felt that \"the game adheres to more of the arcade gameplay of Diablo 3 rather than the more grounded hack-and-slash combat of Diablo 2.\" You can read more about our early impressions of the game in our hands-on experience.",
    "Closed Alpha introduces new content",
    "A new closed Alpha has begun for Diablo Immortal and it’s introducing plenty of extra content. Accessible only to a limited number of Australian Android players at the moment, this new Diablo Immortal beta builds on December’s technical Alpha by adding a new class (the Crusader), new zones, a new dungeon and some endgame content.",
    "The addition of the Crusader means that five of Diablo Immortal’s six launch character classes have been tested, with only the Necromancer left to go. More classes are expected to be added to the game after launch.",
    "The new zones included in the Alpha are Mount Zavin, “the home of the Monks, who are among Sanctuary’s most deadly warriors” and the Frozen Tundra, a region where “war festers… around the great mountain of Arreat, where the Lord of Destruction still threatens the world.” The Frozen Tundra is also the home of the game’s new dungeon, the Cavern of Echoes, in which “adventurers will need to ward off the cold embrace of death as they seek out the Iceburn Tear.”",
    "On top of all of that, there’s a new PVP mode being tested. Called the Cycle of Strife, it sees three factions - adventurers, immortals and shadows — “wage war for the Eternal Crown—an ancient source of power central to the Cycle of Strife.”",
    "Before getting to the Cycle of Strife, though, players will be able to opt in to prove themselves in the 8v8 Battlegrounds in the city of Westmarch. On top of all of that, the blog post detailing the Alpha says there’s also “new Legendary items and Legendary gems, an additional Paragon Tree, two extra skills per class, a test experience teeming with new quests, bounties, and more!”",
    "Finally, there's the Helliquary. This device will apparently come to players after they finish the Main Quest in Bilefen and it \"allows heroes to locate powerful demons and trap them! Once the demons are defeated, the Helliquary can turn their Demonic Remains into power the Hero can take advantage of.\"",
    "This is quite a lot of additional stuff so it’s not all that surprising that Blizzard intends to have this Alpha test run slightly longer than the one from December—at the moment it doesn’t actually appear to have a set end date.",
    "Minimum device requirements for Technical Alpha",
    "In a blog post detailing the latest Alpha for Diablo Immortal, the minimum device requirements to take part have been revealed and are as follows:",
    "Android Minimum Requirements",
    "Apple Minimum Requirements",
    "The Horadric Bestiary",
    "The Diablo Immortal Twitter account has been tweeting out some entries in the Horadric Bestiary, seemingly revealing some of the creatures that you’re likely to come across in Diablo Immortal with a description and a brief video of artwork.",
    "Starting Feb 22, the Tweets are being posted once a week and thus far we’ve seen descriptions and images of things like the Hellhound, Khazra Warriors and Poisonous Bat Lizards.",
    "BlizzCon 2021",
    "BlizzCon 2021 didn't bring us a firm release date for Diablo Immortal, but there was an interesting Q&A which answered a few questions about the game and revealed more about what's to come. Below we've listed some of the interesting details.",
    "More testing is coming soon",
    "We didn’t get a release date for Diablo Immortal during BlizzCon 2021 but it has been confirmed that more tests are coming. In Diablo Immortal’s technical alpha which wrapped up in January, players were able to access five zones and progress through levels as part of testing the mid-game of character progression.",
    "At BlizzCon 2021 it was confirmed new tests are coming for a wider audience and that these should allow players to run into some end-game systems, though it’s not going to mean the end of character growth as there are prestige points and loot grinding to attend to. Future tests are also going to have more questing zones, access to new character classes and may even run for a longer period of time.",
    "We don’t have a date for the next tests just yet but the Diablo Immortal Twitter account has tweeted to say that more testing will be coming “to a wider audience with new content, a new class, and major endgame” and that an announcement is coming soon.",
    "Controller support is being investigated",
    "During BlizzCon 2021, it was revealed that controller support was one of the most requested things from the technical alpha and that while there is no news on it at the moment, the team is \"investigating\" bringing controller support in the future.",
    "Mobile MMO is the goal",
    "During BlizzCon we got another look at Diablo Immortal and it’s been confirmed that the game is a mobile MMO, or at least an action RPG with MMO elements like voice chat, public events, and dedicated dungeons to take on with your friends.",
    "During the game’s technical alpha, four-person dungeons were in operation and during the BlizzCon Q&A, the development team said they’d be keen to have event with more than four players, though at the moment they’re more of an aspiration and when the game launches it might be without these larger raid-like elements.",
    "Players will operate out of the hub city of Westmarch, and may pass “dozens” of players as they wander around. But more crucial to the MMO experience is “that the world exists outside of you,” as Wyatt Cheng put it, and much like World of Warcraft, the Diablo Immortal world is a persistent place that marches on with or without you.",
    "There are plans for guilds",
    "The alpha also featured voice chat within private party and public channels. The development team said that it intends to implement guilds into the game too, so that players can “feel like your membership and participation in a guild matters”.",
    "Suited for short play sessions",
    "Diablo Immortal’s gameplay is going to be more suited for short play sessions, which seems fitting for mobile. In the BlizzConline 2021 Q&A, the team leads talked about aesthetic and gameplay changes that have been made to make the Diablo experience work on smartphones.",
    "The Immortal team acknowledged the challenge of adapting the action RPG to mobile phone controls within the display as it means that players’ fingers will cover up some of the action, though it was said that it’s easy to “melt right into the game”.",
    "To make the game more suited to short play sessions, the Immortal team designed activities for one minute, or three minutes, or five minutes, so it would be satisfying for players who picked up and put down the game for brief sessions. But this shouldn't stop it being fun for those who want to play far longer sessions, as they do with the PC and console Diablo games.",
    "The game is also literally brighter and easier to see for those playing on their phones in varying lighting conditions. “It does benefit the game to not be so dark, because you’ve got players playing in a bunch of different ambient light situations and they can really struggle to see anything,” combat designer Julian Love said. “It’s the kind of problem where a gamma knob slider doesn’t really fix the problem. You really need enough ambient contrast in order to make sure that the visceral action remains present and people can distinguish what’s going on. It’s a very fast-paced game.”",
    "Even with these changes, the Immortal team is still trying to make Diablo Immortal feel like its PC and console predecessors – though it will likely take trial-and-error to nail the right approach.",
    "“The biggest thing I care about is ‘Does It Feel Like Diablo,’ and only way to find out is push it into public and see if it’s on the right track,” Love said.",
    "There will be PvP experiences",
    "Lead designer Wyatt Cheng said that Diablo Immortal’s PvP plans are “ambitious” and there are different zones with different mechanics. In the game’s technical alpha there was a glimpse of the kind of content they’re making to pit players against one another. These include a treasure chest that would spawn every three hours and only open to the last player standing.",
    "Using the mobile platform",
    "Diablo Immortal is all about feeling like a Diablo game but, in working with mobile, the development team has an opportunity to create entirely new experiences that haven’t been done on console or PC.",
    "In the BlizzCon 2021 Q&A combat designer Julian Love said that because every smartphone player is using the same control scheme, there’s an opportunity to explore new monster effects; things like allowing enemies to freeze the ground and make players slip, then combining that with other environmental effects like wind.",
    "“You’ve got this whole new problem for players: the ground is slippery, and there’s a wind blowing against you this way, and if I move with the wind I’m faster but slipping all over the place, but if I fight the wind, I don’t have traction,” Love said. “These are whole new problems for the player to solve.”",
    "We don’t know how often effects like this will crop up in Immortal, but it’s interesting to see how mobile is presenting new opportunities for gameplay.",
    "A 2021 release date could be on the cards",
    "Activision Blizzard has said that it’s expecting to see Diablo Immortal come to mobiles in 2021. The news comes from a February 2021 financial call in which Activision Blizzard CFO, Dennis Durkin, said that while Overwatch 2 and Diablo 4 are not expected to launch in 2021, “Diablo Immortal is progressing well, and we anticipate its launch later this year”, adding “we don’t have any material contribution from the title in our outlook presently.”",
    "Alpha testing over with more tests to come",
    "Alpha testing for Diablo Immortal, which began in late 2020, is now over, with sites like IGN and Forbes reporting nothing but good things when it comes to their first impressions of Diablo Immortal.",
    "In an official blog post, the Diablo Immortal development team has said that the feedback received fro the tests will “help us tweak, polish, and further optimize our core game systems.”",
    "It also seems there will be more tests down the line, with the update saying “we can’t wait to fight alongside you in our next tests!“ Whether these will be more wide-ranging Alpha tests or even wider-ranging Beta testing remains unclear. However, we're hoping this means some kind of release or access to the general public isn't too far down the line.",
    "August 2020 Update",
    "After some radio silence, a Diablo Immortal update appeared on the official Blizzard site. Written by Lead Designer, Wyatt Cheng, the update says that the development team is still \"hard at work\" on the game and, in light of the ongoing pandemic, has transitioned to working from home.",
    "Cheng touches on upcoming internal testing which will see Blizzard employees from around the world try the game out for themselves and provide feedback to the team. After this has been completed, the team will then \"focus on working through the feedback\" before sharing any more with the world.",
    "Rod Fergusson is overseeing the Diablo franchise The Coalition studio head Rod Fergusson has announced he's leaving the Gears of War developer to oversee the Diablo franchise at Blizzard Entertainment.",
    "Fergusson officially made the announcement on Twitter, revealing that he will be joining Blizzard in March where he will, no doubt, join the team in developing the upcoming Diablo 4 and Diablo 4 Immortal.",
    "Check out his tweet below:",
    "Image Credits: Blizzard Entertainment"
  ],
  "headers": {
    "4": "Diablo Immortal: cut to the chase"
  },
  "links": {
    "IGN": "https://www.ign.com/articles/why-diablo-immortals-alpha-was-a-hell-of-a-good-time",
    "enjoyed our brief hands-on time": "https://www.techradar.com/news/ive-played-diablo-immortal-how-blizzards-dark-action-rpg-plays-on-smartphones",
    "announced": "https://www.techradar.com/news/blizzcon-2021-is-canceled",
    "BlizzPlanet": "https://diablo.blizzplanet.com/blog/comments/diablo-immortal-china-website-updated",
    "Forbes": "https://www.forbes.com/sites/paultassi/2020/12/19/diablo-immortal-alpha-impressions-more-than-a-meme/?sh=2a38d8023c0f",
    "GamesBeat": "https://venturebeat.com/2019/05/14/blizzard-boss-j-allen-brack-world-of-warcrafts-past-future-and-his-hectic-start/",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "confirmed": "https://www.techradar.com/news/diablo-immortal-will-be-a-mobile-mmo-developers-reveal-at-blizzcon-2021",
    "BlizzCon 2021 Q&A": "https://www.techradar.com/news/diablo-immortal-will-be-a-mobile-mmo-developers-reveal-at-blizzcon-2021",
    "our full interview": "https://www.techradar.com/news/how-diablo-immortal-is-bringing-mmo-faction-vs-faction-pvp-to-mobile",
    "Pocket Tactics": "https://www.pockettactics.com/diablo-immortal/interview",
    "hands-on experience": "https://www.techradar.com/news/ive-played-diablo-immortal-how-blizzards-dark-action-rpg-plays-on-smartphones",
    "new closed Alpha has begun": "https://news.blizzard.com/en-us/diablo-immortal/23657317/diablo-immortal-closed-alpha-the-crusade-begins",
    "blog post": "https://news.blizzard.com/en-us/diablo-immortal/23583662/diablo-immortal-technical-alpha-one-step-closer-to-hell",
    "Diablo Immortal Twitter account": "https://twitter.com/DiabloImmortal",
    "but there was an interesting Q&A": "https://www.techradar.com/news/diablo-immortal-will-be-a-mobile-mmo-developers-reveal-at-blizzcon-2021",
    "said": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9504056176908415000&xs=1&url=https%3A%2F%2Fwww.fool.com%2Fearnings%2Fcall-transcripts%2F2021%2F02%2F05%2Factivision-blizzard-atvi-q4-2020-earnings-call-tra%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fdiablo-immortal-release-date-news-trailers-phones",
    "not expected": "https://www.techradar.com/news/overwatch-2-and-diablo-4-release-dates-slip-beyond-2021",
    "official Blizzard site": "https://news.blizzard.com/en-us/diablo3/23494812/diablo-immortal-2020-mid-year-update"
  }
}