{
  "source": "https://www.techradar.com/news/the-microsoft-teams-mobile-apps-just-got-a-whole-load-of-useful-upgrades",
  "title": "The Microsoft Teams mobile apps just got a whole load of useful upgrades",
  "category": "computing",
  "updated": "2021-06-24T10:54:46Z",
  "author": "mike-moore",
  "summary": "Both iOS and Android apps get some useful Microsoft Teams additions",
  "article": [
    "Using Microsoft Teams on a smartphone is set to get a lot more intuitive thanks to a range of updates announced by the company this week.",
    "Microsoft's video conferencing service is getting a number of improvements for users accessing Teams on mobile.",
    "The updates are mainly geared around making Microsoft Teams a much smoother user experience, and affect both the Android and iOS versions of the app, with the improved apps available to download now.",
    "The company says that thanks to the new upgrades, Microsoft Teams on iOS is now much easier to use in order to search and find particular information. Users can now search for a specific message, and choose to order the results by relevance or recency. The app will also now offer search topic suggestions as you type, and display top hits for your search results in order to track down exactly what you’re after.",
    "Teams on iOS will also now let users view attachments and suggest related files in the details tab of a meeting, potentially helping you track down the files you need in a pinch.",
    "The Android version of Microsoft Teams is also getting several new upgrades as the company looks to help out a wide range of mobile users.",
    "Android users can now join Microsoft Teams webinars directly from their phone or tablet, meaning you can dial in wherever you are, even on the go. All meetings (even appointments) are now automatically classified as online meetings on Teams, meaning users can quickly find and share a meeting invite link.",
    "The updates follow a range of releases from Microsoft as it looks to make Teams a more pleasant experience for mobile users, especially as many workers around the world begin returning to the office.",
    "This includes a recent update for Teams for Android and iOS that allows the platform to read chats and posts out loud on your device. The Immersive Reader function will only apply to content within Microsoft Teams, and may even allow users to focus on a specific chat or message, which they can currently do in the desktop version of Teams.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Mobile upgrades"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Immersive Reader function": "https://www.techradar.com/news/microsoft-teams-on-mobile-is-getting-a-very-welcome-upgrade",
    "MSPowerUser": "https://mspoweruser.com/microsoft-teams-ios-and-android-apps-update/"
  }
}