{
  "source": "https://www.techradar.com/news/sigma-fp-l-is-a-61mp-version-of-the-worlds-smallest-full-frame-camera",
  "title": "Sigma FP L is a 61MP version of the world's smallest full-frame camera",
  "category": "cameras",
  "updated": "2021-03-25T12:28:00Z",
  "author": "mark-wilson",
  "summary": "Now with improved resolution and autofocus",
  "article": [
    "The Sigma FP L has put an end to the leaks with its official announcement – and as expected, it's a 61MP version of the world's smallest full-frame camera.",
    "The modular mirrorless camera inherits the design of the Sigma FP from 2019, which means it's a stripped down, minimalist affair with no built-in viewfinder or image stabilization.",
    "But the Sigma FP L does bring a new 61MP sensor, which should make it more appealing to hybrid shooters who need more resolution than the 24MP offered by its predecessor, along with some improved autofocus.",
    "Rather than using the older contrast-based AF, the Sigma FP L brings a new hybrid system (mixing phase- and contrast-detection) that should bring a big improvement for both stills and video shooters.",
    "That extra resolution from the 61MP sensor means the Sigma FP L can also deliver a new 'crop zoom' function, which lets you crop into stills or video by five times in-camera to get a different angle, without sacrificing too much in the way of detail.",
    "Other new features include a USB charging, so you can do uninterrupted webcam streaming or time-lapses, and a true 24p recording mode. But the fundamental concept remains the same as before: the Sigma FP L is a tiny, video-focused full-frame camera that can record raw video internally, which makes it a very interesting rival to the recently announced Sony FX3.",
    "So who exactly is the Sigma FP L aimed at? If you like your cameras to be fully-featured out of the box, then it's probably not for you. The reason why the FP L is so small is that it doesn't have a built-in viewfinder, hot shoe, grip, in-body image stabilization or even a mechanical shutter, instead relying on its electronic shutter.",
    "While the Sigma FP L is a more well-rounded camera for hybrid shooters, thanks to those resolution and autofocus boosts, it is still primarily a video-oriented camera, thanks to that ability to shoot raw video (in Cinema DNG format) internally.",
    "This means it's a highly compact setup that offers lots of flexibility for those who like to color grade their footage afterward. You can also output ProRes Raw or Blackmagic Raw video to an external monitor, making the FP L impressively for such a small camera.",
    "It also compensates for its lack of built-in features with a range of accessories –including a new side-mounted EVF-11 viewfinder. This has a 3.68-million dot resolution, tilts upwards by 90-degrees and plugs into the HDMI port and is charged via the USB C port. Because the FP L has identical dimensions to its predecessor, you can also use all of Sigma's existing accessories with the new camera.",
    "The Sigma FP L will be available to buy in April for $2,499 / £1,999 (around AU$3,600), while the new EVF-11 accessory will cost $699 / £599 (around AU$1,080. We'll bring you our full review very soon."
  ],
  "headers": {
    "6": "Full throttle"
  },
  "links": {
    "Sony FX3": "https://www.techradar.com/news/sony-fx3-is-officially-its-smallest-cheapest-cinema-camera-for-pro-filmmakers"
  }
}