{
  "source": "https://www.techradar.com/news/box-and-zoom-team-up-to-make-video-meetings-slightly-less-annoying",
  "title": "Box and Zoom team up to make video meetings slightly less annoying",
  "category": "computing",
  "updated": "2021-09-03T19:00:03Z",
  "author": "anthony-spadafora",
  "summary": "Access your Box files in a Zoom meeting without leaving the app",
  "article": [
    "The cloud storage provider Box has announced that it has released a new app for Zoom so that users can access their files while using the popular video conferencing software.",
    "The new app builds on the existing partnership between the two companies and aims to make online collaboration easier for users of both services. Zoom Apps, which are available in the Zoom App Marketplace, are a new type of in-product integration that allows users to bring their favorite apps into their meetings held in Zoom.",
    "Product lead for Zoom Apps and integrations at Zoom, Ross Mayfield explained in a blog post how this additional interoperability between the two platforms will help teams collaborate more easily, saying:",
    "\"We’re thrilled to be strengthening our collaboration with Box by deepening interoperability between our two platforms. The ability to access and collaborate on Box content right from within Zoom makes teamwork more streamlined, while enhancing and simplifying the experience for our customers.”",
    "With the new Box app for Zoom, users can directly access Box from within Zoom and browse, preview and share their files whether or not they are currently in a meeting.",
    "While in a meeting, users can select a Box file to present to all attendees with just one click. However, Box's enterprise-grade security, compliance and governance is still applied to Box content that's accessed in Zoom to help protect your information.",
    "Box's new app for Zoom builds on its previous Zoom integration within Recommended Apps from last year which enables instant access to Zoom from Box. This integration allows users to create, start or join a meeting directly from the file they're working in without having to interrupt their workflow.",
    "Now that Box and Zoom have expanded their partnership further, don't be surprised if the two companies announced additional integrations in the future."
  ],
  "headers": {
    "4": "Box app for Zoom"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Zoom Apps": "https://www.techradar.com/news/zoom-is-launching-an-app-store-and-standalone-events",
    "Zoom App Marketplace": "https://www.techradar.com/news/zoom-is-about-to-make-video-calls-even-more-interesting",
    "blog post": "https://blog.box.com/secure-content-collaboration-box-app-zoom",
    "Box": "https://www.techradar.com/reviews/box",
    "Zoom": "https://www.techradar.com/reviews/zoom"
  }
}