{
  "source": "https://www.techradar.com/news/dji-mini-se-release-date-price-specs-and-what-we-want-to-see",
  "title": "DJI Mini SE release date, price, specs and features",
  "category": "cameras",
  "updated": "2021-07-02T10:03:42Z",
  "author": "andrew-williams",
  "summary": "The DJI Mini SE is official, but won't see a global release",
  "article": [
    "The DJI Mini SE, which had been hotly tipped to be the drone maker's next entry-level model, has officially landed – but only in selected regions, with no launch planned for the US or Europe (apart from Russia).",
    "Following leaks from retailers like Walmart, DJI has now officially spoken about the Mini SE, revealing that \"it uses the internal components of the Mavic Mini in the shell of the Mini 2, which generates slightly higher wind resistance, but provides much of the performance of the original Mavic Mini at a very attractive price\".",
    "Unfortunately for those outside outside Southeast Asia and South America, though, the DJI Mini SE won't be arriving with that attractive price anytime soon. DJI says there are \"currently no plans to sell this product in the US or Europe (apart from Russia)\".",
    "While that doesn't rule out a release in the future, DJI was keen to stress that the DJI Mini 2 \"remains our flagship entry-level drone\" thanks to its superior 4K/30fps video quality and 10km range, although the DJI Mavic Mini will remain on sale as an affordable alternative.",
    "The Mavic Mini may still max out at 2.7K resolution and a 4km range, but it remains one of the best beginner drones you can buy, and we have seen some discounts recently at events like Amazon Prime Day. If you were holding out for the DJI Mini SE, it's well worth keeping an eye out for offers – until then, here's the story of the slightly strange DJI Mini SE.",
    "The DJI Mini SE is available to buy now, but only in certain countries within Southeast Asia and South America, such as Malaysia and Brazil.",
    "This is slightly odd, as the main DJI Mini SE leaks came from US retailer Walmart, which published the drone’s product page towards the beginning of June 2021. In fact, that product page is still live, albeit without any pricing information.",
    "A week after that leak, images of the placeholder card you’d take to a customer services rep to pick up the drone at Walmart were also posted on Twitter and Reddit.",
    "Walmart seemed really keen to sell the DJI Mini SE, but that won't be happening for some time (if ever).",
    "The leaks had suggested that the DJI Mini SE would cost $299, which converts to around £212 / AU$388, though based on the DJI Mavic Mini's pricing would have likely equated to about £275 / AU$450.",
    "That's all a moot point now, though, as the Mini SE won't be going on sale in the US, Europe or Australia (yet). In Malaysia, it's gone on sale for RM1,349 for the base model, which converts to around $324 / £236 / AU$434.",
    "Outside those selected markets, the DJI Mavic Mini will remain on sale as a cheaper alternative to the higher-end DJI Mini 2. The latter was announced in November 2020 for $449 / £419 / AU$749, but you can now find the DJI Mavic Mini less than its original price of $399.",
    "The DJI Mini SE was never going to offer all the goodies of the DJI Mini 2 for a lower price, and that's certainly proven to be the case.",
    "The various Walmart leaks had suggested that the DJI Mini SE would be much closer to the 2019 DJI Mavic Mini in terms of specs and ability, and almost identical bar a few exterior design tweaks.",
    "And that's turned out to be the case, with DJI confirming to us that the DJI Mini SE \"uses the internal components of the Mavic Mini in the shell of the Mini 2\". This apparently \"generates slightly higher wind resistance, but provides much of the performance of the original Mavic Mini at a very attractive price\".",
    "This means the DJI Mini SE is an ultra-light 249g drone. That gram under 250g is important as in many markets it means it won't need to be registered, though it depends on local drone laws.",
    "As ever, you should be aware of the other numerous regulations that apply to all drones, regardless of size, in the country in which you'll fly them. But in many regions, this marks out the DJI Mini SE as one of the easier drones to fly out of the box.",
    "The DJI Mini SE has a 12MP camera on a 3-axis stabilizer gimbal and is capable of recording video at 2.7K/30p. This matches the DJI Mavic Mini, and given DJI's statement it's fair to assume that they use exactly the same lens and sensor.",
    "That said, looking at out DJI Mavic Mini review (or our sample footage below) is a reasonable way to see what you can expect from the DJI Mini SE's image quality. A lack of 4K capture is the most obvious restriction, as is its maximum 40Mbps bit-rate. This was bumped to 100Mbps on the DJI Mini 2. But otherwise, you can expect the Mini SE's image quality to be very strong for its rumored price point.",
    "The Mini SE's range is lower than DJI’s mid-range and high-end drones, too. That's because it uses the same Wi-Fi based system as the Mavic Mini, resulting in range of 2.5 miles or 4km. It does not have OcuSync 2.0, a DJI wireless tech that sees range increase to 10km.",
    "This may disappoint some, but it fits the DJI Mini SE's target audience. You might buy one of these as your first 'proper' drone, having tired of the tiny one you bought on a whim that gets blown around by a light breeze. The DJI Mini SE’s flight time is also 30 minutes, once again matching the Mavic Mini.",
    "So is this just a Mavic Mini with a couple of cosmetic tweaks and a lower price? In short, yes – and that makes sense for the \"emerging markets\", where drone flying is still in its infancy, that DJI has launched it in.",
    "There was some confusion about which controller the DJI Mini SE would use. One leak suggested it would have a grey pad that's similar to the DJI Mini 2’s design. This has a clamp to accommodate your phone, to show the video stream from the drone’s camera.",
    "But now the DJI Mini SE is official, we can see it has older, fold-out style controller included with the DJI Mavic Mini. It also includes the same QuickShot modes as the latter, including Dronie, Orbit, Propeller and Rocket. These are automated flight moves that create a social media-friendly cinematic effect.",
    "The original DJI Mavic Mini still rides high in our guide to the best beginner drones and, given the DJI Mini SE is internally identical to that drone, there's no reason to expect it'll perform any differently.",
    "The only minor change, according to DJI, will be its wind resistance thanks to those design tweaks, but the DJI Mini SE won't get an improved range as it lacks Ocusync connectivity and still has the Mavic Mini's controller.",
    "The bigger question for those outside Southeast Asia and South America, then, is will the DJI Mini SE ever be launched? DJI says it \"currently\" has no plans to release it in the US or Europe (outside Russia), but the fact that the drone was leaked by Walmart and is still listed on its site suggests that a US launch isn't out of the question in the future.",
    "Still, if you need a small, beginner-friendly drone right now, we're still going to be recommending the DJI Mavic Mini, as it remains a fine choice for those who don't need 4K shooting. It's also handily compatible with third-party apps like Litchi, which helps bring additional features like subject-tracking that you can't even get on the DJI Mini 2.",
    "We're also in the process of reviewing DJI rivals like the FIMI X8 Mini and Hubsan Zino Mini Pro, so despite the limited availability of the DJI Mini SE, there certainly isn't a lack of choice for those who need an affordable drone with a good camera."
  ],
  "headers": {
    "5": "DJI Mini SE release date and price",
    "12": "DJI Mini SE specs, leaks and features",
    "24": "DJI Mini SE early verdict"
  },
  "links": {
    "DJI Mini 2": "https://www.techradar.com/reviews/dji-mini-2",
    "DJI Mavic Mini": "https://www.techradar.com/reviews/dji-mavic-mini",
    "best beginner drones": "https://www.techradar.com/best/best-beginner-drones",
    "still live": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-1155144043694002000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FDJI-Mini-SE%2F550297208",
    "Twitter": "https://twitter.com/OsitaLV/status/1400614239090319362",
    "Reddit": "https://www.reddit.com/r/dji/comments/ns235y/what_the_link_in_first_comment/",
    "DJI Mavic Mini review": "https://www.techradar.com/reviews/dji-mavic-mini",
    "Litchi": "https://flylitchi.com/"
  }
}