{
  "source": "https://www.techradar.com/news/should-you-quit-google-photos-in-2021",
  "title": "Should you quit Google Photos in 2021?",
  "category": "cameras",
  "updated": "2021-05-29T08:00:48Z",
  "author": "chris-rowlands",
  "summary": "Is it better to stick or switch your snap backup?",
  "article": [
    "Unlimited image storage for absolutely nothing: Google’s photo backup deal was quite the steal. It’s little wonder that the promise of limitless free capacity quickly caught the attention of serial snappers. Provided you were happy to accept a cap on quality – which, at 16MP, was hardly extreme – the search giant would safely stash copies of all your precious snaps online.",
    "Alas, all good things must come to an end – including generous complimentary cloud storage allowances. Unless you’re the proud owner of a Pixel handset, unlimited space for ‘high quality’ images will end on 1 June 2021. Any ‘high quality’ shots uploaded to Google Photos after that date will count towards your free 15GB account limit.",
    "Already uploaded your entire library? Don’t panic: any snaps backed up before 1 June 2021 will not count towards the total. But you’ll still face a problem if you’re close to the limit. Hit 15GB with future uploads of any quality and you’ll have to make a choice: create space by deleting superfluous shots or pay to upgrade your account capacity.",
    "If the new rules will have you reaching for your wallet, it might be time to ask whether you should stick with Google Photos or quit the service in favor of an alternative photo backup service. Which is exactly the question we’ll explore below.",
    "Let’s get one thing straight: 15GB of complimentary cloud photo storage is a fantastic offer. Sure, it’s not the same as unlimited capacity, but 15GB is still more than any other mainstream provider currently promises for free: OneDrive, iCloud and Amazon Photos all offer just 5GB of storage. So if you’re looking for the most generous image backup solution, Google Photos remains the top choice if you don’t want to spend a dime.",
    "Even if your shooting habits mean you do need to expand your account capacity, the cheapest Google One subscription tier compares favorably to the upgrade fees of rival backup providers. For the sum of $1.99 / £1.59 / AU$2.49 per month, you’ll get 100GB of storage capacity across all Google products, including Google Drive. That’s a good chunk of space at a pocket-money price. And that’s for image files of any quality, including uncompressed originals. By comparison, Apple’s iCloud backup offers a broadly equivalent 50GB for $0.99 / £0.79 / AU$1.49 or 200GB for $2.99 / £2.49 / AU$4.49.",
    "It’s a similar situation for higher capacities. The 2TB Google One plan will set you back $9.99 / £7.99 / AU$12.49 per month. That’s slightly more than the equivalent iCloud plan, but less than or comparable to most other cloud photo backup options on a monthly basis. There is cheaper cloud storage out there, but not with the same smart features and cross-platform accessibility offered by Google Photos.",
    "In short, if your image library is already stored on Google Photos – and it’s less than 2TB in size – you’ll struggle to find cheaper expansion options than the ones offered by Google. More to the point, any marginal saving is unlikely to justify the significant time, effort and bandwidth that will probably be involved in downloading and transferring all of your uploaded shots to an alternative backup provider – unless they’re supported by Google’s Takeout service (which iCloud and Amazon Photos are not).",
    "That all changes if your library is bigger. Above 2TB, the next Google One tier is 10TB, which carries a significant cost increase. And that’s where Amazon Photos enters the equation. For the single monthly fee of US$12.99 / £7.99, an Amazon Prime subscription bags you free fast delivery and access to Amazon’s library of video content. More importantly, it also includes unlimited free storage space for full-resolution images.",
    "Amazon’s photo backup service isn’t quite as slick as Google Photos. But it is a real steal for those with sizeable libraries. With dedicated smartphone and Fire device apps, it’s also just as accessible. If your image collection will continue to grow, it’s well worth considering – even if you don’t plan on using the additional subscription benefits. Note that unlimited image storage isn’t available to Prime members in Australia.",
    "Rivals aside, Google Photos does plenty to justify a modest monthly fee. Paying for a Google One subscription technically does nothing more than net you extra storage capacity. But in reality, it means you can continue to use the smart skills of Google Photos to sort, edit and share images from across your collection.",
    "Google Photos scores top marks for both ease of use and intelligence. If your images are already stored with Google, you’ll know that it’s so much more than a space to simply dump your photo files.",
    "Sorting is a cinch thanks to favorites and custom albums. Google will even help to keep your images in order by suggesting smart albums, based on detected events. You can archive snaps to hide them from the main feed without deleting them – ideal for de-cluttering – while an incoming tool to identify out-of-focus and underexposed images will make it easier to scrap sub-par snaps.",
    "Images can be edited directly in the cloud, too, using Google’s preset filters or the arsenal of adjustment sliders. And the real boon is the ‘Auto’ filter, which brings out the very best in a given image with just a single click.",
    "Search tools also make it straightforward to find particular pictures. You can filter by image type – think screenshots and selfies – or locate photos from a certain place. Object recognition even allows you to search for snaps based on what they contain, from pets to parks to airplanes. It’s a highly effective and time-saving tool. Likewise, you can label the faces of your friends and Google will find them wherever they’re lurking in your library.",
    "Google Photos also lets you get creative, with the option to make collages, slideshows and animations from your images, while integrated sharing options mean it’s a cinch to send the results to friends and family.",
    "Granted, a lot of these features are not unique to Google Photos. Both iCloud and Amazon Photos offer smart search functionality, for example, as well sorting and sharing tools. But neither of those offer a feature superior to something Google Photos can do – and certainly nothing that justifies quitting it in favor of a killer skill found elsewhere.",
    "Google Photos is a compelling photo backup package. It’s easy to use yet offers a comprehensive set of features that are neatly integrated and very effective – arguably more so than its rivals when it comes to object and face recognition (although that’s difficult to objectively quantify). If you need to pay a small monthly fee to continue using the platform, you certainly get your money’s worth when it comes to usability and versatility.",
    "Flexibility is another reason to stick with Google Photos. Besides web browser access, Google Photos is available as an app for PC, Mac, Android and iOS. That means it’s incredibly simple to backup and sync your entire photo collection across any and all of your devices. The desktop solution works well for syncing snaps from your hard drive, while the mobile apps make it easy to automatically upload every image that you shoot.",
    "For Android users, Google Photos continues to be a no-brainer. In one form or another, you’ll find it baked right into your Android device. Equally, for iPad or iPhone owners, Google Photos represents an excellent substitute for the default Photos app. It’s as accessible as the stock Apple offering and integrates just as seamlessly. You can dive right into your image library, making use of the same searching, sorting and editing tools mentioned above, as well as additional features – including reverse image search, powered by Google Lens.",
    "Of course, plenty of other photo cloud backup providers offer apps that work across multiple platforms. That alone is not a justification to continue using Google Photos. But the fact that the Google Photos apps are so easy to use on different devices is a major selling point for a service that is also smart, feature-packed and affordable. And that’s especially true if you’re already familiar with the style and setup of Google’s interface and navigation menus.",
    "Google Photos also plays nice with other Google products, such as Google Drive and Docs, which is handy if those form part of your online workflow. It’s also straightforward to create a copy of your entire Google Photos library using Google’s Takeout service. This is a big bonus if you want to make a offline backup of your image collection for added security. Neither iCloud nor Amazon Photos make it as simple to export all of your uploaded images to a hard drive.",
    "It really depends on your situation. If you have a Nexus device, you should absolutely stick with Google Photos, because you’ll continue to receive unlimited free storage for ‘high quality’ photos after 1 June 2021.",
    "If you don’t have a Nexus device, the question then is whether your usage will take you over the 15GB free allowance that every Google account gets. If it won’t, definitely don’t quit Google Photos: 15GB is more generous than any other complimentary cloud backup capacity – not to mention all of the additional photo management features that you get to use for free.",
    "If you simply must have unlimited storage space for your photos, users in the UK or US have one clear alternative: Amazon Prime. For a reasonably affordable $12.99 / £7.99 per month, you get limitless capacity for full-resolution photographs. That is undeniably a very good deal for individual users. In fact, if you’re not already committed to a photo backup platform, it’s pretty much the best value bundle you can get, given the free delivery and video content perks that come with it.",
    "But most people are already committed to a photo backup platform. And while it’s undoubtedly nice to have endless space available, unlimited image storage will often be unnecessary for smartphone photographers: the efficiency of modern compression means file sizes can be kept pretty small. Because any ‘high quality’ shots uploaded to Google Photos prior to 1 June 2021 won’t count towards your account total, most users will take a while to max out on even the most affordable 100GB subscription plan.",
    "So if Google Photos is currently your platform of choice for image backups, we think you shouldn’t quit. There are countless cloud storage alternatives, some of which cost less for higher capacities. But few deliver the comprehensive and dedicated photographic functionality of Google Photos, not to mention the seamless cross-platform integration of its apps, as well as the ability to export your entire library to an offline drive. And with competitively priced expansion tiers, there’s little reason to quit and make a time-consuming switch away from Google Photos."
  ],
  "headers": {
    "4": "Is Google Photos good value?",
    "10": "Google Photos is a very smart way to store your photos",
    "18": "Google Photos integrates seamlessly across most devices",
    "22": "Should you quit Google Photos in 2021?*"
  },
  "links": {
    "Google Photos": "https://www.techradar.com/reviews/google-photos",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "iCloud": "https://www.techradar.com/reviews/apple-icloud",
    "Amazon Photos": "https://www.techradar.com/reviews/amazon-photos",
    "Google One subscription": "https://www.techradar.com/news/everything-you-need-to-know-about-google-one"
  }
}