{
  "source": "https://www.techradar.com/news/a-funeral-somehow-led-to-a-cd-stuck-in-my-ps5-disk-drive",
  "title": "A funeral somehow led to a CD getting stuck in my PS5 disk drive",
  "category": "gaming",
  "updated": "2021-09-26T13:00:45Z",
  "author": "jamel-smith",
  "summary": "Opinion: A PS3 is very different from a PS5 it seems",
  "article": [
    "Due to unforeseen events, I’ve come to learn that not only does the PS5 not support CD-R discs, but those CD-R discs may also get stuck in your PS5 disc drive. So, PS5 owners, avoid inserting CD-R discs into your PS5 because I promise you’d want to do your best to avoid sending your console into PlayStation Support.",
    "This dilemma started two weeks ago. I had a big family event coming (a funeral, to be precise), and my family wanted me to sort out the music. Because I consider myself to be something of a music connoisseur, I vowed to myself that I was going to make at least 90% of the attendees cry during the funeral service, and Mariah Carey’s One Sweet Day, and Yolanda Adams’ Open My Heart was going to help me do that.",
    "But, there was a problem; the church where the funeral was going to take place only had a CD player for playing music, so I found myself having to burn a CD in 2021.",
    "With the tear-jerking Mariah Carey and Yolanda Adams songs burnt on a blank CD-R disc using an old laptop of mine from 2010, I now needed to check if the songs were successfully burnt on the CD... but I didn’t have a CD player to hand.",
    "Maybe it was because I remembered the PS3 being the ultimate media center, but I thought my PS5 was going to be able to read CD-R discs, so I stupidly inserted the CD-R disc into my PS5 and… it got stuck.",
    "The PS5 didn’t read the disc, and every time I pressed the eject button an ugly rattling sound came from the console. Now panicking, I immediately went onto the PlayStation support site and found you could manually eject discs by taking the side panels off the PS5 and using some screwdriver wizardry. However, that didn’t work either. So, I had no other option but to send my PS5 off for repair.",
    "April this year was the first time I’ve had to use PlayStation Support, as my DualSense controller had the all-too-common stick drift issue and needed to be sent in for repair.",
    "I was worried about sending the DualSense for repair due to the slew of negative comments about PlayStation support on Reddit, but thankfully, I was mostly satisfied with the service. PlayStation Support only took two weeks to get my controller back to me, hence I thought sending my PS5 off to the repair center should be a relatively easy process… but it wasn’t.",
    "After a bit of conflicting information about if my PS5 was actually received by the repair center- it was- after about two weeks I finally got my PS5 back. PlayStation Support had successfully got the CD-R disc out of the disc drive and everything was fine, until I tried to insert Deathloop (I’ve been dying to play it for the past week now), only to find that the PS5 simply refused to accept the disc.",
    "So, after ejecting the stuck CD-R disc from the disc drive, no disc could be inserted at all. PlayStation Support, somehow, may not have tested the disc drive before sending the PS5 back out to me, which is kind of ludicrous. Now I’m stuck here with a PS5 that will not take discs, and in hindsight maybe I should’ve bought Deathloop digitally on the PS Store.",
    "Currently, I still haven’t got any definitive word from PlayStation Support on whether I’d need to send back my PS5 to get repaired again.",
    "But, on a good note, my music selection for the funeral was a success, so my thanks goes out to Mariah Carey and Yolanda Adams for making my family tear up.",
    "On the other hand, I’m about to cry myself, looking at all the PS5 games I can’t currently play, which is partly PlayStation Support’s fault, but largely my own fault for thinking my new PS5 could play CD-R discs."
  ],
  "headers": {
    "3": "Testing it out",
    "6": "PlayStation Support woes"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Mariah Carey’s One Sweet Day": "https://open.spotify.com/track/7ySbfLwdCwl1EM0zNCJZ38?si=6793467260494522",
    "Yolanda Adams’ Open My Heart": "https://open.spotify.com/track/4cNbCWPJjLHP5ijow5LbVg?si=a9e63287544049af",
    "Reddit": "https://www.reddit.com/r/PS5/comments/m21ap9/how_was_your_ps5_repair_experience/"
  }
}