{
  "source": "https://www.techradar.com/news/kyc-is-essential-especially-within-crypto",
  "title": "KYC is essential, especially within crypto",
  "category": "pro",
  "updated": "2021-07-10T14:17:55Z",
  "author": "rachid-ajaja",
  "summary": "Not a \"nice to have\" but a \"need to have\"",
  "article": [
    "As gatekeepers of traditional financial markets, one of the foremost imperatives for banks and financial institutions is to uphold the integrity of, and trust in, the markets themselves. History has shown that this moral burden alone has not stopped such institutions from engaging in suspect behavior, with governments across the world responding by enforcing regulations to ensure these institutions adhere to the rule of law.",
    "A recent report by Fenergo found that in 2020, penalties incurred by financial institutions for non-compliance with Anti-Money Laundering (AML), Know Your Customer (KYC), data privacy, and Markets in Financial Instruments Directive (MiFID) regulations totaled a staggering $10.6 billion globally.",
    "Such large figures have spurred institutions to update their KYC and AML processes in order to cut down on money laundering and prevent criminal activity in the financial markets, however with increasing amounts of cross-border activity and a lack of jurisdictional standardization, these updates have still fallen short. In comparison to the AML and KYC processes in the world of cryptocurrencies, traditional markets are lightyears ahead.",
    "A longstanding obstacle to the formal acceptance of cryptocurrencies by governments around the world and the subsequent mass adoption that would likely ensue is that the crypto space is a highly lucrative target for money laundering. In 2019, almost $3 billion was laundered through different cryptocurrency exchanges, many of which lack the AML and KYC processes that keep would-be launderers away from traditional financial institutions.",
    "One study even found that over half of all crypto exchanges had weak or non-existent KYC processes. Laundered money can be used for everything from basic tax evasion and drug or human trafficking to domestic and international terrorism. For a nascent industry that wants to become mainstream, allowing the proceeds of such illicit practices to flow through crypto markets is certainly less than ideal.",
    "It is important to understand that KYC policies are somewhat new to the cryptocurrency world. Some KYC processes are performed after the fact, some exchanges allow their users to open accounts without any KYC checks at all, and others have taken more drastic steps such as refraining from doing business with U.S. customers rather than relent and implement even the most basic of KYC and AML policies.",
    "In fact, some of the most popular U.S. exchanges have announced their limitation of American users and the transactions that American users can perform on their platforms, which, instead of working to better the adherence to these vital processes, is a step backward for the industry. If the crypto industry wants to be taken seriously, it must act seriously, not cower away from working within the guidelines that have been established to protect all parties.",
    "While governments can thus feel justified in cracking down on exchanges that are ill-prepared or unwilling to ensure AML and KYC compliance, the issue is that one of the key attractions of many blockchain and cryptocurrency projects is the anonymity of transactions themselves. How can a system which prides itself on anonymity force a user to provide their passport details just to make a transaction?",
    "Fortunately, there are many innovative solutions being devised within the blockchain and crypto industry at the moment, such as anonymous identity verification modules, where users can have their identities verified once, then prove their identity to new vendors or platforms with that initial verified identity, without providing or exposing their personal information again.",
    "It is no secret that cryptocurrencies are often used in ransomware attacks, plainly due to the ability for criminals to hide their identities and reduce the risk of funds being traced back to them. A recent report from the Ransomware Task Force, published with support from the likes of Microsoft and McAfee, outlined different private and public responses that could be taken to combat the surge in ransomware attacks.",
    "The report itself recommended the enforcement of already existing KYC and AML regulations, which is an easily attainable goal - the technology is already available. Think of it this way: if a hacker group hacks into a government database, which occurred in Ireland just recently, the group then steals the data of millions of individuals and threatens to publish it online unless the government pays a ransom in bitcoin because they can hide their identity, what will the broader financial industry, let alone the general public, associate cryptocurrencies with? Crime.",
    "This, in turn, will reduce the amount of participants in the crypto markets and inherently damage its reputation. Adherence to effective AML and KYC guidelines would not only protect the integrity of crypto markets, it would protect the underlying holders of cryptocurrencies from massive price fluctuations spurred on by illegal activity. Effective AML and KYC processes, legislation and guidelines would stop this disruptive cycle, therefore it is in all of our best interests to ensure these practical and attainable goals are met.",
    "Trustworthy KYC and AML processes are not 'nice to haves', but need to haves; they are absolutely necessary for the future prosperity of the crypto industry. These processes play a vital role in tackling illegal activity and represent a critical cornerstone of good business.",
    "In the same way that traditional financial institutions aim to maintain the integrity of the financial markets, leaders in the crypto industry must attempt to expunge the negative stereotypes that associate cryptocurrencies with money laundering by adopting effective AML and KYC measures on par with those in traditional markets, while allowing for anonymity where possible. Doing so will allow the industry to thrive, capitalize on its success of the past year, and secure its status as a paradigm shift in the way we transact."
  ],
  "headers": {
    "3": "A highly lucrative target",
    "5": "No KYC checks",
    "7": "KYC compliance",
    "9": "Enforcing existing KYC",
    "12": "KYC as a \"need to have\""
  },
  "links": {
    "cryptocurrencies": "https://www.techradar.com/news/6-cryptocurrencies-that-could-become-the-next-bitcoin",
    "crypto exchanges": "https://www.techradar.com/best/mining-rigs",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "database": "https://www.techradar.com/best/best-database-software"
  }
}