{
  "source": "https://www.techradar.com/news/overcoming-freedom-day-fear-by-embracing-a-digital-future",
  "title": "Overcoming ‘Freedom Day Fear’ by embracing a digital future",
  "category": "computing",
  "updated": "2021-08-06T14:39:53Z",
  "author": "ben-ramsden",
  "summary": "How to tackle ‘Freedom Day Fear’ for SMEs",
  "article": [
    "After what has arguably been the most testing period for businesses in recent history, 43% of SMEs say they are worried about the UK’s full reopening, according to PayPal’s latest Business of Change: Recovery & Rebuild report.",
    "Yet, the reopening of England and the rest of the UK is set to be a landmark event in the SME calendar, with 20% anticipating it to be the biggest moment for business growth this year, more so than Christmas.",
    "Although uncertainty remains, there is no doubt that the country reopening presents an unprecedented opportunity for businesses to take advantage of. Small businesses have been extremely resilient - but now is the time for SMEs to go a step further by capitalizing on the digital skills they have learned to power their recovery. I believe that these skills married with further investment in tech will stay just as relevant as restrictions ease and e-commerce opportunities continue to grow.",
    "In order to address this ever-changing business landscape, here are my top insights on how to tackle ‘Freedom Day Fear’ for SMEs, based on my past ten years at PayPal serving small businesses.",
    "Investing in technology is an absolute necessity for small businesses looking to engage in a digital-first world.",
    "Are you part of the 65% of SMEs in England that already plan to update their tech to engage in a digital-first world? The report also found that nearly one in six plan to invest in new software and app technology, while one in seven plan to adopt new payment options.",
    "Having the right tech isn’t just crucial for a digital-first approach in business, it also helps employees feel valued while potentially leading to increased productivity as they continue to develop the skills to keep up with these advancements. The research indicates that these changes are here to stay with top new ways of working including working from home (33%), using social media to sell and promote products (25%), and accepting digital payments (16%).",
    "SMEs should resist the urge to divert back to their old ways of doing things. The last year has set the world on a path from which there is no turning back. Commerce will become increasingly boundaryless. This means that it’s not about just accommodating shopper experience expectations but keeping pace as they evolve.",
    "I have seen plenty of new offerings in the market such as direct to consumer subscription services and conversational commerce via social media, chatbots and voice technology. Being digital first will enable businesses to stay more agile as commerce evolves – even as offline commerce starts to pick-up again."
  ],
  "headers": {
    "4": "Adopting a digital first trajectory"
  },
  "links": {
    "Small businesses": "https://www.techradar.com/best/best-small-business-software",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "working from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools"
  }
}