{
  "source": "https://www.techradar.com/news/this-clever-magsafe-grip-brings-physical-camera-controls-to-your-iphone",
  "title": "This clever MagSafe case brings DSLR camera controls to your iPhone",
  "category": "cameras",
  "updated": "2021-11-29T22:04:44.118Z",
  "author": "mark-wilson",
  "summary": "Crucially, it actually looks pocketable too",
  "article": [
    "A promising new Kickstarter project is aiming to become the first iPhone accessory to really nail the concept of adding physical camera controls to a smartphone.",
    "The Fjorden, which as the name suggests comes from an Oslo-based startup, is designed to bring the tactile joys of shooting with a dedicated camera, like a proper shutter button and customizable dials, while maintaining the iPhone's pocketable form factor.",
    "It's not the first accessory to try this, with previous attempts including the Moment Original Case and Shiftcam. But the Fjorden brings a few neat tricks, including a quick-release system for removing the grip when you don't need it and a MagSafe-compatible case.",
    "Compatible with all iPhone 11 and iPhone 12 sizes (along with future iPhones), the Fjorden grip is 10.7mm deep – the same as an Airpods case – which means it should still be pocketable, unlike some previous takes on the concept.",
    "It also promises to bring quite a few of the controls you'd find on a dedicated compact or mirrorless camera. These include a two-stage shutter button – which means you half-press to focus, then full-press to take a shot – plus a customizable control dial that lets you tweak settings like shutter speed or ISO without needing to touch the screen.",
    "You also get a customizable multi-function button, which you can use for triggering things like portrait mode or the flash, and a zoom lever for switching between your iPhone's lenses or zooming in and out, as you would when pinching-to-zoom.",
    "The only real downside to Fjorden is that you'll likely need to use a third-party app to unlock all of its functionality. Fjorden says its own camera app taps into all the computational photography tools that Apple has made available to developers, including Portrait Mode, HDR/Deep Fusion and ProRAW. But this unfortunately doesn't yet include Night Mode yet.",
    "Still, the project says existing apps like Obscura and ProCamera (which has developed its own Night Mode) will also be fully compatible with the Fjorden Grip at launch, and you'll at least be able to use the accessory's shutter button in the Apple's stock camera app.",
    "Naturally, all the disclaimers that usually apply to Kickstarter projects – that you're backing them at your own risk – are also relevant to the Fjorden. But it is one of the more promising takes on the 'iPhone case with camera controls' concept that we've seen.",
    "Firstly, despite the number of buttons and dials it brings, it still looks pocketable. This feels like an essential component of any phone accessory, but hasn't always been the case with previous takes on the idea.",
    "The Fjorden's MagSafe-compatible case is also appealing, even if it's a slight shame the grip itself doesn't attach using magnets – instead you remove it using a quick-release clip. There are also a couple of other neat touches, including a built-in kickstand and compatibility with Moment's M-Series lenses, via a mount that snaps onto the Fjorden's optional case.",
    "For all of the iPhone's recent leaps in computational photography, it still struggles (like most phones) to deliver the tactile shooting experience that photographers enjoy – for example, one-handed shooting, or being able to make creative tweaks without obscuring the viewfinder.",
    "It's too early to say whether or not the Fjorden is going to be the accessory that manages to pull off this concept, as a lot depends on how well it integrates with various camera apps. But it certainly looks like a promising take on the idea, even if it's not expected to ship until February 2022.",
    "It's already hit its Kickstarter goal and you can still pick up its early bird pledge for $129 / £103 (around AU$192), which includes the Fjorden Grip and back plate adapter, or $149 / £120 (around AU$224) for the Grip and MagSafe case (which fit any version of the iPhone 11 or 12)."
  ],
  "headers": {
    "8": "Analysis: A snappy take on the phone-camera hybrid"
  },
  "links": {
    "Fjorden": "https://www.kickstarter.com/projects/fjorden/fjorden-iphone-photography-reinvented",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone's lenses": "https://www.techradar.com/news/best-iphone-lenses-2020-transform-your-smartphone-photos",
    "early bird pledge": "https://www.kickstarter.com/projects/fjorden/fjorden-iphone-photography-reinvented"
  }
}