{
  "source": "https://www.techradar.com/news/motorola-razr-2021",
  "title": "Motorola Razr 2021 release date, price, news and leaks",
  "category": "phones",
  "updated": "2021-07-13T14:39:03Z",
  "author": "james-rogerson",
  "summary": "More power at a lower price",
  "article": [
    "The Motorola Razr 2021 is set to be the third-generation foldable phone from popular handset maker Motorola, and one of the most anticipated bending devices that'll be out in 2021.",
    "What's in a name? Well, maybe not the correct year, for start: while we thought the Razr series was being released in yearly iterations, a report suggests there might be no 2021 version of the handset, with the 2022 model seeing bigger improvements thanks to the extra year of development. That's not a confirmed report, though.",
    "Following on from the Motorola Razr and Razr 2020, the 2021 edition of Moto's foldable now has enough earlier models to build on to make something great - hopefully the company has learned from the two prior devices.",
    "We haven't got solid confirmation that Motorola is working on a third-gen Razr phone, but it seems likely with the annual installments up until now. Especially with the Samsung Galaxy Z Flip 3 slated to launch in late 2021, and the iPhone Flip hoped for in 2022, there's lots of competition for Moto to fight with.",
    "This phone, which for now we’re referring to as the Motorola Razr 2021, remains a complete mystery at the time of writing, but then we wouldn’t expect it to land until quite late in the year, so it’s no surprise that we’re light on news.",
    "What we do have though is a wish list of the things that we hope to see from the Motorola Razr 2021. Motorola’s first two foldables are interesting but flawed, so there’s a lot of room for improvement here.",
    "We’ve also included a look at when the Motorola Razr 2021 is likely to land, and what it might cost, all of which you’ll find below. And as soon as there are any rumors or news about it, we’ll add that in too.",
    "There aren’t any release date rumors yet, but the Motorola Razr 2020 was announced on September 9, 2020, and went on sale around a week later on September 15. However, the Motorola Razr 2019 was announced in November 2019 and didn’t go on sale until February 2020.",
    "As such, Motorola doesn’t have a consistent release schedule for this range, so it’s hard to predict exactly when the Motorola Razr 2021 will be unveiled, but for now our best guess would be in or around September, since that would be a year on from the last model.",
    "That's doubly the case thanks to a report suggesting there would be no 2021 Motorola Razr. The source suggests the 2022 Razr will see bigger improvements as a result.",
    "There’s no news on price either, but the Motorola Razr 2020 cost $1,399 / £1,399 (around AU$1,900) at launch, so we might see a similar price for the 2021 model.",
    "The Motorola Razr 2020 has a lot to like about it but also a lot of issues, which is why we only gave it three stars in our review. For the Motorola Razr 2021 to be a five-star phone it could do with the following.",
    "The Motorola Razr 2020 isn’t as expensive as the Samsung Galaxy Z Fold 2, but it still costs more than most conventional smartphones, even top-end ones, and it isn’t a top-end handset itself.",
    "As such, and particularly in the face of competition from the Samsung Galaxy Z Flip range, we’d really like to see the Motorola Razr 2021 have a lower price. If it can drop closer to $1,000/£1,000 that would make it a lot more tempting.",
    "One of our main complaints about the Razr 2020 is its battery life. Despite having two screens the phone only has a 2,800mAh battery, which is far smaller than most phones, and that translates into life that’s often under a day in our tests.",
    "It would probably fare better if you make heavy use of the small secondary screen rather than the main display, and it could be hard to put a much bigger battery in it without sacrificing the compact size, which is part of the appeal, but a phone that doesn’t reliably last a day isn’t a phone you can rely on.",
    "Another issue we had with the Motorola Razr 2020 was that the hinge would creak when unfolding the screen. This was an issue with the 2019 model too, but we really hope it’s fixed for the Motorola Razr 2021.",
    "While Motorola reassures that the creak is nothing to worry about, it’s also not something that you want a premium device to exhibit.",
    "The Razr 2020 has two screens but neither of them are particularly special. Its main 6.2-inch screen is slightly lower resolution than most high-end and even many mid-range phones at 876 x 2142, and it just has a basic 60Hz refresh rate too.",
    "Its secondary screen is even less impressive at 2.7 inches and 600 x 800, though that’s more forgivable since it’s designed as a smaller, lesser screen.",
    "For the Motorola Razr 2021 we really want to see some upgrades at least to the main display. The size of the current model is fine but a higher resolution and refresh rate would definitely help.",
    "Speaking of the screen, the Razr 2020’s main display can either be open flat or closed, but the Samsung Galaxy Z Flip lets you use the phone at any angle. So if you want to half open the main screen so you can sit it flat at a right angle for example, you can.",
    "We’d like the Motorola Razr 2021 to also have this ability. It’s a small thing, but it helps make the most of having a screen that folds.",
    "The Razr 2020’s cameras aren’t bad as such but they’re fairly basic, as there’s just a 48MP f/1.7 main camera and a 20MP f/2.2 selfie camera, so you don’t get the assortment of snappers that even quite affordable phones often now have.",
    "For the Motorola Razr 2021 then we want more cameras, with at the very least main, ultra-wide, and telephoto all accounted for.",
    "The Motorola Razr 2020 has a Snapdragon 765G chipset, which is upper mid-range, but given that this phone costs more than most flagships we’d like to see high-end power.",
    "So unless the Motorola Razr 2021 is significantly cheaper, we’d like it to include the Snapdragon 888 chipset (found in the likes of the Samsung Galaxy S21)."
  ],
  "headers": {
    "7": "Motorola Razr 2021 release date and price",
    "11": "What we want to see",
    "12": "1. A lower price",
    "14": "2. Better battery life",
    "16": "3. No more creaks",
    "18": "4. A better screen",
    "21": "5. An any-angle screen",
    "23": "6. More cameras",
    "25": "7. Top-tier power"
  },
  "links": {
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "a report suggests there might be no 2021 version of the handset": "https://www.techradar.com/news/motorola-razr-2021-might-be-canceled-but-xiaomi-and-honor-could-fill-the-void",
    "Motorola Razr": "https://www.techradar.com/reviews/motorola-razr",
    "Razr 2020": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "iPhone Flip": "https://www.techradar.com/news/foldable-iphone",
    "Motorola Razr 2019": "https://www.techradar.com/reviews/motorola-razr",
    "there would be no 2021 Motorola Razr": "https://www.techradar.com/news/motorola-razr-2021-might-be-canceled-but-xiaomi-and-honor-could-fill-the-void",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}