{
  "source": "https://www.techradar.com/news/sigma-launches-worlds-smallest-f28-zoom-lens-for-aps-c-cameras",
  "title": "Sigma launches world's smallest f/2.8 zoom lens for APS-C cameras",
  "category": "cameras",
  "updated": "2021-10-19T15:19:50Z",
  "author": "mark-wilson",
  "summary": "The perfect everyday lens for Sony APS-C fans?",
  "article": [
    "If you own a small APS-C camera like the Sony A6600 or Sony ZV-E10 and need an affordable, everyday zoom lens, then Sigma's new 18-50mm f/2.8 lens could become your new default choice.",
    "The Sigma 18-50mm f/2.8 DC DN Contemporary, to give the lens its full name, has been designed for APS-C cameras that are fronted by either Sony's E-mount or the L-mount (which is supported by Leica and Panasonic).",
    "Sigma claims that its 18-50mm f/2.8 is the smallest and lightest of its kind – in other words, an autofocus-equipped APS-C lens that has a constant f/2.8 aperture throughout its focal range. Given the lens weighs only 290g and measures 61.6x76.5mm (or 65.4x74.5mm on L-Mount), it's hard to disagree with that claim.",
    "Given the 18-50mm f/2.8 DC DN's versatility, it looks like a good-value option for both stills and video. The lens has a close-focusing distance of 12.1cm, making it suitable for macro-style close-ups, and is also resistant to both water splashes and dust (even if it lacks full weather-proofing).",
    "On the video front, the lens' stepping motor should mean relatively quiet and speedy autofocus, while its size should make it a simple option for those who like to mount their camera in a gimbal for smooth moving footage.",
    "Naturally, Sigma did have to make a couple of compromises to get the 18-50mm f/2.8 DC DN down to this size and price – and the main one is lens-based stabilization.",
    "Sigma justified this omission by pointing to the lens' bright f/2.8 aperture, which should let you shoot at relatively fast shutter speeds in most conditions to help reduce hand shake, and also the inclusion of in-body image stabilization (IBIS) in many cameras.",
    "This means it may be better with a camera like the Sony A6600 (which has IBIS), rather than one like the Sony A6100, depending on your needs. Still, the 18-50mm f/2.8 DC DN certainly looks like a good proposition for most Sony cameras at this price – it'll cost $549 / £429 (around AU$795) from the end of October.",
    "Canon, Sony and Nikon have understandably placed much of their focus on full-frame cameras and lenses this year, but lenses like this show that smaller APS-C sensors remain popular among hobbyist shooters for good reason.",
    "The main strengths of APS-C cameras, compared to full-frame, are their size, weight and cost – and the Sigma 18-50mm f/2.8 DC DN plays to all three of those advantages.",
    "But Sigma's impressively light zoom lens also promises to deliver higher quality images than most APS-C kit lenses, whose apertures tend to vary throughout their focal range. With a constant f/2.8 aperture, you don't have to worry about getting less light to your sensor towards the end of that maximum 50mm focal length.",
    "Sony and Leica shooters do already have options in this space, but none that are as small or affordable as this. Sony's own 16-55mm f/2.8 G is excellent but expensive, while Tamron's 17-70mm F/2.8 Di III-A VC RXD is almost twice the weight of Sigma's new lens.",
    "The only real shame is that Sigma hasn't made the 18-50mm f/2.8 DC DN available for the other big APS-C players, Fujifilm and Nikon. Sigma has been teasing the possibility of releasing lenses for Fujifilm's X-mount for a while, but it looks like Fuji fans will have to wait a little while longer before they get useful options like this promising all-rounder."
  ],
  "headers": {
    "8": "Analysis: Playing to the strengths of APS-C"
  },
  "links": {
    "Sony A6600": "https://www.techradar.com/reviews/sony-a6600",
    "Sony ZV-E10": "https://www.techradar.com/reviews/sony-zv-e10"
  }
}