{
  "source": "https://www.techradar.com/news/new-nvidia-geforce-rtx-3080-and-3070-gpus-released-by-msi",
  "title": "New Nvidia GeForce RTX 3080 and 3070 GPUs released by MSI",
  "category": "computing",
  "updated": "2021-03-19T13:21:09Z",
  "author": "hamish-hector",
  "summary": "Another GPU you can’t buy",
  "article": [
    "MSI has introduced yet another variant of Nvidia’s GeForce RTX 3080 and RTX 3070 graphics cards. The Suprim SE models will be slightly slower than its top-of-the-range Suprim X versions — but don’t expect these cards to sell out any less quickly.",
    "These GPUs are still Nvidia RTX 3080s and 3070s, both of which are highly sought after by PC gamers and crypto miners looking to enhance their computer performance. On top of that, while these cards are slower than both MSI’s Suprim X and Suprim versions, the SE cards have only a 5-7% slower clock speed. Other than that, the cards are all identical — and manual tuning should be able to bring the SE versions in line with the X.",
    "You might also have to fork out a fair amount to purchase one — even before inflated resale prices. MSI’s Nvidia GeForce RTX 3080 Suprim X 10G and GeForce RTX 3070 Suprim X 8G should retail for $900 (£650 / AU$1160) and $660 (£475 / AU$850) each. The non-X versions don’t drop much lower than those prices — only around $50 — so the SE models likely won’t offer significant savings either.",
    "For many of us, the idea of comparing top graphics cards seems a bit useless. With Nvidia and AMD’s best cards nearly impossible to get hold of, people are having to settle for whatever is available.",
    "In our testing, we found the RTX 3080 and RTX 3070 to offer some of the best performance we’ve ever seen from a graphics card. Value-wise the RTX 3080 even beats out the RTX 3090 to take second place on our best graphics cards list — while the RTX 3070 comes in at fifth, which isn’t too bad itself.",
    "AMD offers some stiff competition too. The AMD Radeon RX 6800 XT and 6900 XT are some pretty powerful GPUs, and definitely ones to also be on the lookout for if you want a high-end PC experience. With GPUs so difficult to find right now, keeping an eye out for stock across a broad selection should increase your chances of getting one.",
    "Via Tom's Hardware"
  ],
  "headers": {
    "3": "What are the best graphics cards on the market?"
  },
  "links": {
    "Nvidia’s GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "RTX 3090": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3090-find-stock-here",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "AMD Radeon RX 6800 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6800xt-find-stock-here",
    "6900 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6900-xt-find-stock-here",
    "Tom's Hardware": "https://www.tomshardware.com/uk/news/msi-rolls-out-geforce-rtx-3080-rtx-3070-se-gpus"
  }
}