{
  "source": "https://www.techradar.com/news/should-i-buy-a-sony-projector",
  "title": "Should I buy a Sony projector?",
  "category": "audio-visual",
  "updated": "2021-07-01T09:40:44Z",
  "author": "henrietta-rowlatt",
  "summary": "A guide to Sony projectors",
  "article": [
    "So you’re considering one of the best projectors? Perhaps you’re a movie fan who wants to curate their own home cinema night, popcorn and all. Or you’re a gamer who wants to step out onto a distant planet and blast life-sized aliens to smithereens? With the right projector you can do all of these things, and so much more.",
    "If you are indeed ready to take the plunge, or are looking to upgrade, there are a few considerations to take into account. Projectors require a little more planning and setting up when compared with televisions.",
    "To get the best out of one, you’ll need to attach it to the ceiling, as – unlike TVs – you’ll need distance between the lens and the screen to project. (Unless of course, you go for a short throw model, but we’ll talk a little more on this later.)",
    "A ceiling-mounted beamer also eliminates the possibility of shadows cast by passing people or pets. Not all need to be ceiling mounted as smaller projectors can be moved in and out of a room as needed, but Sony’s range mostly concentrates on larger 4K models so they’ll best be kept out of the way.",
    "The distance between the screen and lens matters too: too close and the screen is as small as a television losing the all-important wow factor, too far away and the screen will be overly dim. Balance is key, as is a measuring tape.",
    "You might also want to consider a pull down or permanent screen, particularly if you’re a stickler for color accuracy, a cream-coloured wall could throw off the white balance. Projectors work best in dark rooms, too, with minimal daylight to contend with.",
    "Sony itself is perhaps best known for its 4K systems, but it also makes a host of Full HD 1080p models. There's also one short throw model and a quirky portable system in the form of the Xperia Touch – a small projector that turns any surface into a collaborative touchscreen, and offers impressive technology, even if it’s a little on the pricey side.",
    "Japanese electronics maker Sony has been at the forefront of technological innovation for decades. The company revolutionised portable music consumption with the Walkman. Blu-ray, Sony's disk-based video format, brought high quality 4K video into the homes of consumers for the first time. And how could we forget the Sony Bravia TV range, which scores consistently high marks in TechRadar’s reviews?",
    "But what of Sony's projectors? You may not have thought about Sony as a projector manufacturer before, but your local cinema has. Sony provides industry-standard beamers and also uses some of that same technology in their consumer models, with three commercially available projectors using a dialled-down version of its X1 chip.",
    "The X1 is a 4K HDR processor that powers the best Sony TVs, although the recently announced Cognitive Processor XR looks set to replace it in upcoming 2021 screens.",
    "Sony’s consumer projectors tend to utilize a similar chassis design, with most models available in white and smudge resistant black. The color availability varies between regions, so be sure to check this with your local retailer. There are a few variations in size and there are some cosmetic differences, but structure-wise the chassis generally features a centrally mounted lens with air intake vents on either side. A familiar setup in large projectors, but here the front positioning of the intakes means that Sony’s beamers can be installed with their backs quite close to a wall without fear of overheating.",
    "Many models in Sony's range are also 3D compatible when paired with compatible glasses, although they’re usually not included. And before we get too far into model numbers, note that in Sony projectors, a higher number generally means a more expensive and feature-packed machine.",
    "Sony projectors come with several built-in technologies to improve picture quality. The first is Reality Creation, which is designed to enhance the original 1080p source with crisp and sharp full HD pictures.",
    "Next, there’s Motionflow, that ensures a super-fast response rate, meaning action shots don’t suffer from unnecessary motion blur. The technology is great for fast moving sports but works less well for films that run at 24 frames a second. This can be offset by using their True Cinema mode, which takes into account film frame rates. While all Sony projectors feature Motionflow, only some use the colour-enhancement technology TRILUMINOS, which promises a wider palette of rich colors.",
    "All Sony projectors, be they Full HD, 4K, short throw or commercial cinema, use Sony’s own SXRD technology. SXRD stands for Silicon X-tal Reflective Display, and it’s the company's version of liquid crystal on silicon.",
    "Sony projectors use a separate LCOS chip for each primary colour of light: green, red and blue. This allows a marked reduction in the rainbow effect and keeps the contrast high particularly when compared with single chip DLP projectors. And that high contrast, those brilliant whites and deep, dark blacks, is why cinephiles flock to Sony. SXRD also ensures that there are smaller gaps between the pixels than an standard LCD projector, meaning that you can project a larger image before seeing individual pixels. Another plus for the cinephiles.",
    "Not only that, but this technology is one of the few on the market that displays 4K natively. That's unlike Samsung’s DLP projectors, which must double flash the mirrors to get more than one pixel per frame and therefore 4K.",
    "The downside to this is that it makes Sony’s projectors, particularly their 4K range, rather big and heavy. You should always take that into consideration when looking at projectors: is your ceiling strong enough to take around 20kg in weight?",
    "Sony’s 4K range is expansive and impressive, but this isn’t all that they do. Sony’s smaller HD range uses that same SXRD technology, so no more rainbow effect. Sony offer two HD models, the VPL-HW45ES and the VPL-HW65ES. Both are 3D compatible and feature 1,800 lumens lamps.",
    "The more expensive of the two, the VPL-HW65ES features a Dynamic Contrast of 120,000:1 and an RJ45 LAN port which can be used for home automation. So with this projector it’s possible to have a setup that activates a motorised screen when the projector is switched on, which is very handy. Sony's HD models are also its lightest, with both models coming in at around 9kg.",
    "If you want to take the next step, Sony has an impressive range of consumer 4K projectors including one ultra short throw model. Again, all of these use Sony’s SXRD technology and vary from 1,500 lumens to a squint-inducing 10,000 lumens.",
    "Sony's three entry-level 4K models are all lamp-powered, with only one of their current range, the VPL-VW590ES, making use of their adapted X1 chip for projectors. All three can create 3D images and range from 1,500 to 1,800 lumens. The non-X1 models, the VPL-VW570ES and the VW270ES, only differ slightly in brightness.",
    "This kind of projector, unlike most TVs, can suffer from lamp burnout. In low light mode, these projectors are projected to last for 6,000 hours. But in order to get the best picture, you’ll probably be using a higher light setting to get the full amount of lumens promised in the spec sheet. Replacement lamps are available from Sony and cost around £200-£250 / $278-$347. Lamps generally last for a number of years, but do check with your specific retailer if you have questions.",
    "For a bit more cash you can invest in a laser 4K model; Sony offers six of this kind including one with ultra short throw technology. Three of the models are somewhat affordable with a price range of around £9,000 / $12,600 going up to £20,000 / $28,000. These three, the VPL-VW870ES, VPL-VW790ES and VPL-VW760ES are the same size as they use the same chassis, and all three weigh around 20kg/44lbs.",
    "Sony laser models are heavier and more expensive than lamp-based models. The lightest being 14kg/31lb their heaviest being 51kg/112lb. But laser models have several advantages, as the projection is focus-free, meaning that the focus stays consistent even when projecting onto curved or uneven surfaces. They also feature a higher contrast ratio, so blacks will be deeper and light colours even lighter.",
    "Sometimes this comes at a cost of lumens value, but according to Sony’s stats, this isn’t the case with its range as their laser projectors have higher brightness values than any of Sony's lamp models. And there’s Sony's lone short throw, the VPL-V21000ES which is priced at around £10,000 / $14,000. It’s a laser model and can project a screen of 80-120 inches from a distance of around 7 inches away.",
    "If you’re a film buff, you cannot ignore Sony’s pedigree. But Sony’s position as the manufacturer of the PS5 means it’s necessary to consider the gaming features of its beamer range.",
    "When Sony launched its laser projectors VPL-VW870ES (a high end laser), VPL-VW570ES (Sony’s flagship lamp model;) and VPL-VW270ES (Sony’s cheapest lamp model), it claimed that they were specifically designed with gaming and sports in mind. That makes sense, because Sony’s color-depth and contrast, thanks to its SXRD technology, results in more playable games. Dark shades are richer in tones, so in a low-lit stealth game you’ll be able to actually see your next target, rather than a sea of muddy grey.",
    "Sony currently features 11 projectors in its consumer range, two of which are Full HD, with the rest being 4K. Prices range from around £1800-£2000 / $2500-$2780 for the Full HD range. The three lamp 4K models start at £5,000 / $6950, with the X1-chipped VPL-VW590ES coming in around £6,900 / $9,580.",
    "Sony’s laser projector range starts at £9,000 / $12,500 and tops out at £20,000 / $27,775. Only the middle projector of this range, the VPLVW0790ES, features an X1 Projector chip.",
    "Then there’s the two very expensive 4K laser models, including the VPL-VW5000ES, which is around £47,000 / $65,270. Their flagship consumer model is the VPL-GTZ380, which at £80,000 / $112,000 is about the price of a flashy car.",
    "Sony projectors aren't the cheapest, then, and you'll likely want to consider a BenQ projector or Epson projector for something more mid-range. For comprehensive, capable home cinema projectors at whatever cost, though, Sony should be able to offer something suitable for your needs."
  ],
  "headers": {
    "7": "Sony projectors: an overview",
    "14": "Sony SXRD projectors",
    "18": "Sony HD projectors",
    "20": "Sony 4K projectors",
    "26": "Sony gaming projectors",
    "28": "How much does a Sony Projector cost?"
  },
  "links": {
    "best projectors": "https://www.techradar.com/best/4k-projector",
    "Xperia Touch": "https://www.techradar.com/news/sonys-xperia-touch-is-here-to-turn-your-walls-into-touchscreens-for-a-big-price",
    "Cognitive Processor XR": "https://www.techradar.com/news/sony-oled-tvs-could-shine-brighter-than-lgs-thanks-to-new-xr-processor",
    "ultra short throw": "https://www.techradar.com/news/short-throw-vs-long-throw-vs-ultra-short-throw-projector",
    "VPL-V21000ES": "https://www.techradar.com/news/sonys-ultra-short-throw-4k-projector-may-make-you-re-think-buying-a-premium-uhd-tv",
    "BenQ projector": "https://www.techradar.com/news/should-i-buy-a-benq-projector-a-look-at-the-budget-dlp-projector-brand",
    "Epson projector": "https://www.techradar.com/news/epson-projector"
  }
}