{
  "source": "https://www.techradar.com/news/will-the-black-friday-lego-deals-be-a-good-time-to-pick-up-discontinued-sets",
  "title": "Will the Black Friday Lego deals be a good time to pick up discontinued sets?",
  "category": "appliances",
  "updated": "2021-11-14T11:00:12Z",
  "author": "tom-bedford",
  "summary": "Old collector items",
  "article": [
    "Real Lego aficionados will know the curse of the discontinued kit - the company is constantly making new sets, but that also means it retires, and stops manufacturing older ones. Some lovely builds like great Creator, Architecture and franchise-themed ones have been lost to the sands of time this way.",
    "The kits don't get destroyed - once stock has dried up, people who have them often sell them on for hugely inflated prices. After all, supply has reduced but demand hasn't, and some kits can sell for 10 times (or sometimes even more) than their original price.",
    "You might think, then, with builds costing astronomical prices, it could be a smart idea to wait until the Black Friday Lego deals really kick off to pick up a build - but we're sorry to say, that that's not such a great plan.",
    "When Lego kits 'retire', as the brand calls it, they pretty quickly stop being sold by the company. But that doesn't just mean the brand's website stops listing it; any official retailer will stop selling it too.",
    "That means shops like Target and Walmart in the US, or Smyths and Argos in the UK, won't restock the kits once they sell out - generally, this means their range is near-identical to Lego's official lists.",
    "Instead, if you're looking to pick up one of the discontinued Lego sets, especially an older one, you're going to be relying on third-party retailers and resellers, like eBay, Facebook Marketplace or shops on Amazon.",
    "Generally, these retailers don't do Black Friday sales - especially if it's just another person who's selling on a second-hand Lego set. You might find one or two retired kits that are on offer, but we wouldn't recommend holding your breath.",
    "So if you're hoping to buy a super-expensive retired set, we're sorry to say, you're not going to find many deals to make it more affordable. Over time, the prices will just get higher and higher, without being affected by sales seasons.",
    "But other expensive Lego sets could see Black Friday deals; Lego still officially supplies a wide range of kits that cost huge amounts naturally (and you can only imagine how much these will cost when they get retired!).",
    "We actually wrote a whole roundup of the priciest Lego sets around including the Colosseum, Millennium Falcon and Hogwarts Castle, and lots of these kits actually could see substantial discounts - even 20% off a $600 set is a $120 reduction, after all.",
    "So if you want reduced Lego, Black Friday is the time for you - just don't expect to see sets that haven't been available for years get price cuts."
  ],
  "headers": {
    "3": "Official vs unofficial retailer",
    "7": "What about other expensive sets?"
  },
  "links": {
    "Black Friday Lego deals": "https://www.techradar.com/black-friday/black-friday-lego-deals",
    "priciest Lego sets around": "https://www.techradar.com/news/these-are-the-most-expensive-lego-sets-ahead-of-the-black-friday-deals"
  }
}