{
  "source": "https://www.techradar.com/news/banned-from-whatsapp-theres-a-new-appeals-process-on-the-way",
  "title": "Banned from WhatsApp? There's a new appeals process on the way",
  "category": "computing",
  "updated": "2021-07-13T10:12:07Z",
  "author": "sofia-wycislik-wilson",
  "summary": "WhatsApp is introducing an in-app option to review a ban",
  "article": [
    "WhatsApp are working on an appeals process on iOS to help un-ban your account if needed, making it much easier for you.",
    "Getting banned from any platform can be a serious pain. If you're blocked from using social media for some reason – perhaps posting something inappropriate – it is annoying, but getting kicked off a messaging app can be seriously inconvenient.",
    "WhatsApp has become stricter in enforcing its rules in recent times, and this means that more and more people are finding they have been slapped with a ban. But the company sometimes gets it wrong, and banned users understandably want to appeal. This process is going to be made a great deal easier.",
    "The latest beta version of WhatsApp for iOS shows that the company is working on an easy-to-use in-app ban review option. While this is currently only visible in the iPhone app, it is expected to also make an appearance in the Android version – after all, it would be strange for the two platforms to have different approaches to ban appeals.",
    "If your WhatsApp account is hit with a ban, a new option in the app is on the way. By tapping the new Request a Review option it will be possible to provide any details you think WhatsApp need to know about your account activity, and then you can submit the review for the company to investigate.",
    "WhatsApp will take a closer look at your account activity. It may determine that the ban was issued in error, perhaps because automated systems incorrectly identified spam-like activity. If this is the case, you will be notified that your account has been restored and then guided through the process of verifying it before you get back up and running,",
    "If, however, WhatsApp determines that the ban was the correct decision – perhaps for posting illegal content, or violating terms of service in another way – you'll be informed of this and invited to register a new number.",
    "Of course, all WhatsApp users hope to never be hit with the ban hammer, but it is good to know that if it strikes, the appeals process is being made as painless as possible.",
    "Via WABetaInfo"
  ],
  "headers": {
    "5": "Review and restore"
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/whatsapp-is-working-on-an-in-app-tool-to-review-bans/"
  }
}