{
  "source": "https://www.techradar.com/news/wonder-woman-game",
  "title": "Wonder Woman game trailer, news and rumors",
  "category": "gaming",
  "updated": "2021-12-10T15:00:12Z",
  "author": "vic-hood",
  "summary": "Suffering Sappho! A Wonder Woman game is in the works",
  "article": [
    "A Wonder Woman game is officially in the works at Monolith Productions, the developer behind Middle-earth: Shadow of Mordor and sequel Middle-earth: Shadow of War.",
    "Revealed at The Game Awards 2021, with a teaser giving us our first glimpse at the iconic DC superhero, Wonder Woman is set to be a single-player, third-person, open-world action-adventure, that will introduce a whole new original story set within the DC universe. Players will become Diana of Themyscira (aka Wonder Woman) as she \"fights to unite her Amazon family and the humans from the modern world\", according to publisher Warner Bros.",
    "What's more, this Wonder Woman game will utilize the Nemesis System seen in the Middle-Earth series, which will see players forging deep connections with enemies and allies as they progress through the game. It certainly sounds like this could be a superhero game unlike any we've seen before (and we're seeing a lot right now).",
    "Want to know more? Read on for everything we know so far about the Wonder Woman game.",
    "Monolith Productions hasn't confirmed when we'll get our hands on the Wonder Woman game - or which platforms it'll land on.",
    "But we can make an educated estimate that we won't see Wonder Woman until at least late 2022 and that it will likely land on PS5, Xbox Series X, Xbox Series S and PC. We could also see a release on PS4 and Xbox One, but we imagine that (given the game is likely at least a year out from release) Monolith will be aiming to target the latest hardware without being held back by the last generation of consoles.",
    "The Wonder Woman announcement teaser trailer doesn't give much away, but it does give us a close up look at the hero herself, complete with her iconic Lasso of Truth. It may not be much to go on, but we're suitably impressed with Monolith Production's design take on Diana Prince.",
    "Below, we've rounded up all the latest news and rumors on the Wonder Woman game. Details are a bit thin on the ground right now, but we'll update this page as and when we find out more.",
    "A focus on player-driven storytelling In a press release for Wonder Woman, David Hewitt, Studio Head of Monolith Productions teased how the Nemesis System will play into Wonder Woman's storytelling to \"push the open-world genre forward\" by combining cutting-edge action with inventive narratives\".",
    "A familiar lineup of enemies to take down We currently don't know who Diana's main adversaries with be in the Wonder Woman game, but it's almost certain that we'll see some familiar faces from the DC universe. We're hoping that Ares is the primary villain in Monolith's title, with the likes of Cheetah, Giganta, Circe and Doctor Psycho making appearances in some form - perhaps sitting just below Ares in the Nemesis system ranks.",
    "What's more likely (and actually makes more sense) is that Wonder Woman will take on Villainy, Incorporated, as the Nemesis System would work well with the villainous-team dynamic.",
    "An invisible jet Sure, it's cheesy, but we would love to see Monolith (somehow) make Wonder Woman's invisible jet cool. Wonder Woman 1984 did - kind of - but it would be great to see the developer integrate the jet into gameplay in a way that doesn't feel shoehorned.",
    "Combat that feels good One thing we've learned from recent superhero games is that how a hero feels to play is a make-or-break factor. We're hoping that Wonder Woman feels as strong as she is meant to be, with powerful melee attacks and - of course - the ability to Lasso of Truth our enemies.",
    "Utilizing the power of the PS5 and Xbox Series X Going off our last point, we would love to see Monolith adding haptic feedback and adaptive controller support to Wonder Woman, so we can really feel the tension in the lasso or the feel of kicking Cheetah in the face (hopefully). We're also expecting (more than hoping) Wonder Woman to have minimal loading screens despite being an open-world title and to simply look phenomenal."
  ],
  "headers": {
    "4": "Wonder Woman: cut to the chase"
  },
  "links": {
    "Middle-earth: Shadow of War": "https://www.techradar.com/news/middle-earth-shadow-of-war-review",
    "The Game Awards 2021": "https://www.techradar.com/news/the-game-awards-2021-the-biggest-announcements-and-reveals",
    "Wonder Woman game will utilize the Nemesis System": "https://www.techradar.com/news/wonder-woman-game-gets-shadow-of-mordors-best-feature-and-were-excited",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}