{
  "source": "https://www.techradar.com/news/ovhcloud-set-for-billion-dollar-ipo",
  "title": "OVHcloud set for billion-dollar IPO",
  "category": "computing",
  "updated": "2021-09-20T12:44:15Z",
  "author": "sead-fadilpasic",
  "summary": "Too early to talk about valuation, CEO says",
  "article": [
    "OVHcloud has confirmed it plans to launch an Initial Public Offering (IPO) as the company continues plans for global expansion.",
    "Reports said the France-based cloud computing service provider was planning on raising at least $469 million, and use the money to cement its leadership position not just in Europe, but also to help it expand further into North America and Asia.",
    "While OVHcloud did not provide the details regarding the timing of the IPO, nor its valuation, the Wall Street Journal reported that the move could value the company at more than $4.7 billion.",
    "Commenting on the speculation regarding valuation, the company’s CEO Michel Paulin said it was “much too early” to talk about any figures, Reuters reported.",
    "The Wall Street Journal also said the company would not make any final decision about proceeding with the offering and targeted price and valuation until it finishes determining investor interest.",
    "OVH's plans to run an IPO were first announced in March this year, but days later, a huge fire destroyed one of its data centers, postponing the plans indefinitely. Then, in June this year, the company confirmed it planned on proceeding with the IPO, but gave no deadlines or timetables.",
    "The company was founded in 1999 by the Klaba family and is headquartered in Roubaix, France. As of 2016, the company allegedly owned the world’s largest data center in surface area, while since 2019, it multiple media outlets described it as “the largest hosting provider in Europe, and the third-largest in the world based on physical servers”.",
    "The company hopes to grow its revenue anywhere between 10 and 15% for 2022, and expects organic revenue growth by 2025.",
    "Via: The Wall Street Journal"
  ],
  "headers": {
    "5": "Fire problems"
  },
  "links": {
    "OVH's plans to run an IPO": "https://www.techradar.com/news/ovhcloud-begins-journey-to-go-public-with-potential-ipo",
    "huge fire destroyed one of its data centers": "https://www.techradar.com/news/europes-large-web-hosting-provider-knocked-offline-following-fire",
    "The Wall Street Journal": "https://www.wsj.com/articles/europes-ovhcloud-readies-possible-4-7-billion-ipo-11632082037?mod=tech_lead_pos4"
  }
}