{
  "source": "https://www.techradar.com/news/disco-elysium-how-cult-heroes-british-sea-power-wrote-its-bafta-nominated-score",
  "title": "Disco Elysium: The Final Cut – How cult heroes British Sea Power wrote its award-winning score",
  "category": "gaming",
  "updated": "2021-03-31T11:32:26Z",
  "author": "gerald-lynch",
  "summary": "‘Less thinking, more intuition’: winning a BAFTA, we speak to the band behind Disco Elysium’s tunes",
  "article": [
    "British Sea Power has long sat on the vanguard of British rock’s alternative scene, coming up through the noughties ‘New Rock Revolution’ that made household names of The Strokes and Arctic Monkeys. However, while other bands sang of New York city cops or looking good on the dancefloor, British Sea Power were writing songs about the collapsing Antarctic ice shelf Larsen-B, Scapa Flow and the diverse, imbibable joys of EU internationalism.",
    "Literate without being humorless, experimental without forgetting the power of a pop hook, British Sea Power’s shimmering, stabbing guitars and lilting melodies have led to a musical career that’s seen them feeling as comfortable on the cavernous stages of the Glastonbury festival as rescoring 1934’s fictional proto-documentary Man of Aran.",
    "That their orbit would eventually end up on a collision course with Robert Kurvitz, lead designer and writer at ZA/UM, the developers of Disco Elysium: The Final Cut, the most ambitious, eccentric CRPG in decades, seems almost fated.",
    "Centring around an amnesiac, alcoholic cop on a murder case in a fictional post-Soviet territory, Kurvitz wrote more than a million words to bring the truly unique gaming world of Disco Elysium to life, one where the demons in your head (and at the bottom of a bottle) are more outlandish and threatening than those you would stare down the barrel at in lesser games.",
    "“Robert came to see us in the UK when we were on tour,” recalls guitarist Martin Noble.",
    "“He was a fan of the band and described noises and moods that were in our albums as a sort of starter palate. He said the game was going to be incredible and groundbreaking. He showed us some art work and described the world of the game in detail. Usually when people say something like this you think they may be a big-headed blagger. With Robert, you kind of knew that if he was the man behind it then it would be incredible.”",
    "“He flew all the way from Estonia and spilled his head on us,” adds bass guitar and vocalist Hamilton Wilkinson. “Something about Frodo, and a bag of gold. He bought me a coffee and I thought 'that's nice.'”",
    "Displaying “a more comprehensive knowledge of our albums than we had ourselves”, says singer-guitarist Yan Wilkinson (“he also did some very entertaining English accents”), British Sea Power jumped onboard with a development team more interested in Dadaism and Fluxus than killstreaks and microtransactions.",
    "Six months after the game’s release, British Sea Power and ZA/UM celebrated success at the 2020 BAFTA Games Award ceremony in which Disco Elysium earned three gongs – including one for its soundtrack.",
    "It was a match made in heaven – British Sea Power’s instrumentals weaving from the melancholic to the menacing, a perfect partner for the painterly palette of Disco Elysium’s art, and the slow creep of a fictional mind on the fringes of sanity.",
    "Though British Sea Power had soundtracked a film before, the process was quite different for Disco Elysium and the gaming medium the band found themselves working with.",
    "“With films you have to work more on timing,” says violinist and vocalist Abi Fry, “whereas with the game it's more about creating specific moods that can go on indefinitely and don't drive you completely mad.” Noble agrees. “If a film gets re-edited then you have to re-edit the song. As games are more freeform, so we can be too,” he says.",
    "“It's more about setting the right mood than supporting or narrating the action. Just creating a kind of ambience and sonic expanse,” says Yan, or “living in another person’s mind instead of your own for a while,” adds Hamilton.",
    "Although working on film has obvious transferable knowledge and skills, writing music for a game is hardly anything like putting an album together.",
    "“It’s a very different thing,” says Yan. “In some ways it is easier as there is less thinking and more intuition involved. Lyrics and vocals, which are quite challenging, aren’t necessary. There is also a strong definite direction which I enjoy for a change. A joy in less freedom. I like working with different atmospheres and just dwelling in them.”",
    "Noble agrees. “You don’t really need to create infectious melodies, or mega hooks, or work on intros, verses and choruses, etcetera. It’s more about moods, scenes. You can be quite meditative and repetitive while shifting around with subtle variety.”",
    "For the band, inspiration came naturally. There’s a natural synergy between the band’s style and the game’s eccentricity.",
    "Getting in the right mood, “wasn’t such a stretch,” says Yan. “Not too much method acting needed. The visuals also play such a big important role in the game. Very beautiful, kind of like a painting. So I wanted to fit in with that as well as suit the characters.”",
    "Kurvitz, being a big fan of the band, had littered the game with reference points to British Sea Power’s work, too.",
    "“I think there is crossover between the BSP world and Robert's,” says Noble. “We originally sent Robert a load of unused demo tracks that we had lying around. Robert found that some of it would be perfect for the game. There are actually loads of little BSP related things in the game - the name of some streets and buildings have BSP references that only a hardcore BSP fan would appreciate.”",
    "Science fiction books like 'Roadside Picnic' brought inspiration, and a live performance of the soundtracks to ‘Everybody’s Gone to the Rapture’ & ‘Dear Esther’ proved illuminating (Noble is friends with Jessica Curry, who composed those games’ soundtracks).",
    "“I'm a big fan of Angelo Badlamenti and his work with David Lynch,” notes Yan.",
    "“I also was influenced early on by the way Lynch uses sound in such a physical way. It's more common now but it wouldn't be without him. I am a big film fan and always find scores fascinating. Vyacheslav Oychinnikov was great with Tarkovsky and I was always incredibly impressed how Stanley Kubrick used music. Amazing.”",
    "But for the most part, British Sea Power found an easy rhythm with Kurvitz’s world. “Each composition had a character and strong story idea so the headspace was easy to find,” says Fry.",
    "And life on the road as a touring band can have its own amnesiac quality.",
    "“Not knowing who you are while stumbling around a strange world looking for clues is a familiar lifestyle to British Sea Power’s everyday dream, so it was a doddle for us,” jokes Hamilton.",
    "Having made one of the more evocative game soundtracks in recent memory, you may be surprised to find that British Sea Power don’t particularly class themselves as avid gamers. Though Fry admits to “growing up on BBC Micro Games: Castle Quest, Frak, Chuckie Egg and Granny's Garden,” and that the band “lost a year or two of our lives to Mario Kart when we were recording the Valhalla Dancehall album,” British Sea Power’s core gaming memories, fittingly, seem to be around re-soundtracking games in their youth.",
    "“I think games can benefit from a focused, brave and at times avant-garde approach that films do from music,” says Yan. “I remember making tapes to play with ZX Spectrum games as a kid with my brother. I wasn’t a big fan of The Pet Shop Boys then but West End Girls was perfect for driving along to in Outrun, as was the Beverly Hills Cop theme.” Fry still has a soft spot for the Double Dragon NES soundtrack, though.",
    "There’s a chance that British Sea Power could return to the game soundtrack world. “We love it. We’re hoping ZA/UM do another game and invite us back,” says Noble, also hinting that of the soundtrack “one or two [tracks] might make it onto the new BSP album in a different guise, and we hope to be able to play the soundtrack live at some point.”",
    "So, what do British Sea Power make of the finished Disco Elysium experience?",
    "“I love the depth and the boldness of it. The visual side is incredibly beautiful too,” says Yan.",
    "“I've never played a game like this before and think it’s absolutely amazing,” says Fry, echoing the sentiments of many who’ve touched the surface of Disco Elysium.",
    "“I played about 30 minutes with my nephew. I only scratched the surface really, but the painting is exquisite, the dialogue is really twisted and far out and the score is really rather excellent!” says Noble.",
    "As for getting through the entire game, which Kurvitz reckons would take some 120 hours to see all it has to offer? Maybe one day, says Yan.",
    "“I used to say at 70 I would enjoy gaming and heroin. But right now I’ve only just found time to start reading and painting more again.”",
    "This article was originally published on April 3, 2020."
  ],
  "headers": {
    "3": "‘Noises and moods’",
    "10": "‘A joy in less freedom’",
    "16": "‘Like a painting’",
    "26": "Outrun x The Pet Shop Boys"
  },
  "links": {
    "Larsen-B": "https://en.wikipedia.org/wiki/Larsen_Ice_Shelf",
    "Scapa Flow": "https://en.wikipedia.org/wiki/Scapa_Flow",
    "Man of Aran": "https://en.wikipedia.org/wiki/Man_of_Aran",
    "Dadaism": "https://en.wikipedia.org/wiki/Dada",
    "Fluxus": "https://en.wikipedia.org/wiki/Fluxus"
  }
}