{
  "source": "https://www.techradar.com/news/eu-falling-behind-us-and-south-korea-on-5g",
  "title": "EU 'falling behind' US and South Korea on 5G",
  "category": "phones",
  "updated": "2021-01-29T15:32:46Z",
  "author": "steve-mccaskill",
  "summary": "ETNO report says other regions are taking the lead",
  "article": [
    "Europe is falling behind the US and Asia when it comes to 5G development and rollout, according to the European Telecommunications Network Operators Association (ETNO).",
    "The industry body’s 2021 ‘State of Communications’ report, prepared by Analysys Mason, found that although the number of European covered by at least one 5G network had increased from 12.9% in 2019 to 24.4% in 2020, this still lagged behind other regions.",
    "In the USA, 76% can currently receive 5G while in South Korea the figure is 93%.",
    "The report also expressed concerns that demand for 5G services was weaker in Europe, meaning the business case for rapid rollout may not be as strong. This can partly be explained by the fact that Europe has very strong 4G, meaning the immediate advantages of enhanced mobile broadband are not as obvious.",
    "Compounding this is the fact that Average Revenue Per Users (ARPU) is also lower and European telcos spend more of their revenues on investment than their international counterparts. The report says European telco investment reached €51.7 billion 2019 and the value added by ETNO companies was worth €141.5 billion to European GDP.",
    "ETNO argues the high fragmentation of the European market (there are 39 major mobile operators compared to a handful in the US) and regulatory restraints have diminished the competitiveness of European operators. It adds that intense competition from big technology companies is hindering revenues, especially when it comes to voice and messaging.",
    "“We support the European Commission in their endeavour to achieve global digital leadership for the EU,” said Lise Fuhr, ETNO Director General. “This requires a renewed focus on investment in 5G, fibre and digital innovation. Digital networks and services are the foundation for Europe’s global competitiveness and green recovery, which will in turn empower European citizens.”",
    "Presumably, the organisation hopes the research will encourage action on the industry’s common requests. These include a more tolerant approach to consolidation, the removal of barriers to investment, and to accelerate greater regulation on tech giants to ensure a level playing field.",
    "Other grievances include the high cost of spectrum and a regulatory environment that fails to incentive investment.",
    "The EU has previously said it wants a common approach to the deployment of fibre and 5G services, arguing that connectivity can help the bloc in its economic recovery from coronavirus.",
    "“The pandemic presented European operators with dramatic changes in network usage as well as new operational challenges,” added Rupert Wood, Research Director at Analysys Mason. “European operators remain exposed to greater competitive pressures than elsewhere and consequently have revenue lines that change little in relation to surging demand. Despite these difficulties, they continue to invest heavily in fibre and 5G infrastructure to support European recovery and a post-pandemic digital agenda.”"
  ],
  "headers": {
    "3": "Europe 5G"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}