{
  "source": "https://www.techradar.com/news/how-to-watch-foundation-online-on-apple-tv-plus-where-you-are",
  "title": "How to watch Foundation online on Apple TV Plus where you are",
  "category": "computing",
  "updated": "2021-09-24T05:01:40Z",
  "author": "alice-marshall",
  "summary": "Isaac Asmiov's sci-fi arrives on Apple's streaming service",
  "article": [
    "Issac Asmiov's sci-fi novels - the very books that inspired the likes of Star Wars and The Hitchhiker's Guide to the Galaxy - finally arrives on screen, staring Jared Harris and Lee Pace. Already being dubbed 'Game of Thrones in space', below we’ll explain how to watch Foundation online now when you subscribe to Apple TV Plus.",
    "As a collection of short stories that has managed to spark the imagination of some of the most well known science fiction titles out there, it feels only right that the original should get its time on the silver screen.",
    "The Foundation is led by Hari Seldon (Harris), a mathematical genius who bands together scientists, engineers, and historians to preserve humanity as the Galactic Empire begins to fall, and reduce 30,000 years of predicted turmoil to just 1,000 years.",
    "To do so, they must travel to the planet of Terminus and safeguard the Encyclopedia Galactic (an anthology of humanity's knowledge) to ensure a second Empire can rise at the end of the millennium. However, Seldon is not all that he seems, having created a mysterious second Foundation within another part of the galaxy.",
    "One that is predicted to span across many future seasons and episodes, make sure you know how to watch Foundation online and stream season 1 from anywhere now.",
    "While Apple's answer to Netflix has a comparatively tiny library of films and shows to get stuck into – 60 and counting – what's available is top-notch, well-produced fare with little in the way of filler.",
    "The service's launch calling card was The Morning Show, a drama starring Jennifer Aniston, Reese Witherspoon, and Steve Carell, which was complemented by See - an epic sci-fi drama starring Jason Momoa and Alfre Woodard, as well as M. Night Shyamalan’s horror series, Servant.",
    "The service's surprise big breakout show so far has been the Jason Sudeikis comedy Ted Lasso, which follows an American football coach hired to coach a Premier League football team, which has earned an army of fans and a sizeable amount of gongs during this year's awards season.",
    "The small but great library is set to grow at a steady pace - alongside incoming second seasons of Ted Lasso and The Morning Show, Apple TV Plus looks to have a pretty strong-looking upcoming schedule of new exclusive content.",
    "The Martin Scorsese-directed Killers of the Flower Moon, promises a 'large-scale Western' that stars big guns Leonardo DiCaprio and Robert De Niro.",
    "The Shrink Next Door, meanwhile, is a new comedy series based on the 2019 podcast of the same name, that is set to bring together Will Ferrell and Paul Rudd.",
    "Read more:"
  ],
  "headers": {
    "5": "What else should I know about Apple TV Plus?"
  },
  "links": {
    "Apple TV Plus": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1271178818743360500&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fapple-tv-plus%2F",
    "The Morning Show": "https://www.techradar.com/news/season-2-of-apple-tv-plus-flagship-show-finally-has-a-release-date",
    "Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know"
  }
}