{
  "source": "https://www.techradar.com/news/ubuntu-is-the-brains-behind-xiaomis-half-life-esque-cyberdog",
  "title": "Ubuntu is the brains behind Xiaomi's Half Life-esque CyberDog",
  "category": "computing",
  "updated": "2021-12-02T22:48:18Z",
  "author": "mayank-sharma",
  "summary": "Open Source is critical for CyberDog, says Xiaomi",
  "article": [
    "Canonical, the company that sponsors the development of Ubuntu, has revealed that the popular Linux distro helps power Xiaomi’s recently released CyberDog.",
    "While unveiling the Mi Pad 5, Mi Mix 4, and some new smart home products earlier this year in August, Xiaomi launched a robotic version of man’s best friend. Dubbed CyberDog, Xiaomi’s mechanical canine looks a lot like Boston Dynamics' famous robotic dog, Spot.",
    "Unlike Spot however, the CyberDog has an open source core, Ubuntu 18.04 to be exact.",
    "“Open Source is core for CyberDog, it ensures compatibility and growth. It enables developers to have the freedom to push boundaries, and that is what CyberDog was meant to do,” remarked Huang Changjiang, project manager at Xiaomi.",
    "Canonical has used CyberDog as an example to illustrate how the open source community helps facilitate the field of robotics, thanks to a rich set of tools and libraries such as the Robot Operating System (ROS).",
    "“ROS deployment on Ubuntu becomes easier and makes secondary development more friendly. We aim to unlock this rich ecosystem of applications and algorithms for CyberDog,“ says Huang.",
    "Canonical shares that Xiaomi has released 1,000 CyberDog units and the company will also set up the “Xiaomi Open Source Community” to constantly share progress and results with developers around the world.",
    "Priced at $1,540, Canonical fathoms that CyberDog’s affordability and open source nature will help encourage engineers and robotic enthusiasts to accelerate the research for new use-cases.",
    "“We’re already seeing four legged robots exploring mines or helping first responders in natural disasters. These devices have also found uses in the construction industry or helping with industrial inspections, where terrain maneuverability poses a challenge. More and more applications are being discovered every day, thanks to this collaborative work,” opines Canonical.",
    "Interested in learning Linux? Take the best Linux distros for a spin on one of these best Linux laptops"
  ],
  "headers": {
    "4": "Open source robotics"
  },
  "links": {
    "Ubuntu": "https://www.techradar.com/news/ubuntu-2110-will-help-accelerate-cloud-native-app-development",
    "Linux distro": "https://www.techradar.com/best/best-linux-distros",
    "Xiaomi": "https://www.techradar.com/news/best-xiaomi-phones",
    "CyberDog": "https://www.techradar.com/news/xiaomis-new-robot-dog-is-a-cross-breed-of-boston-dynamics-and-a-furby",
    "Mi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "Mi Mix 4": "https://www.techradar.com/news/xiaomi-mi-mix-4-news",
    "smart home": "https://www.techradar.com/news/smart-home-devices",
    "robotic dog, Spot": "https://www.techradar.com/news/boston-dynamics-uncanny-robot-dog-spot-is-now-strutting-into-workplaces",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "remarked": "https://ubuntu.com/blog/cyberdog-a-four-legged-robot-revolution-with-ubuntu",
    "ROS": "https://www.techradar.com/news/qualcomm-is-taking-robotics-into-the-5g-era",
    "best Linux distros": "https://www.techradar.com/best/best-linux-distros",
    "best Linux laptops": "https://www.techradar.com/best/linux-laptops"
  }
}