{
  "source": "https://www.techradar.com/news/call-of-duty-ww2-vanguard-is-the-next-big-game-in-the-series",
  "title": "Call of Duty WW2: Vanguard is the next big game in the series",
  "category": "gaming",
  "updated": "2021-11-25T20:22:00Z",
  "author": "nick-pino",
  "summary": "New reporting pegs WW2 as the setting, and Vanguard as the title",
  "article": [
    "The Call of Duty franchise is likely returning to its traditional WW2 setting, a new report confirmed today. According to that report, the game is likely to be called Call of Duty WW2: Vanguard and it will be out before the end of the year.",
    "We first heard some of those details in a rumor last week, but now it’s been confirmed by the team at Eurogamer and their undisclosed source with privileged information who says that the game is well into development.",
    "While details are still thin, it doesn’t sound like there will be any relationship to the most recent Call of Duty: WWII (pictured above) that was developed by Sledgehammer Games back in 2017 – other than the game’s setting – and is likely to be another standalone entry.",
    "That said, it’s unclear at this point how the new game could integrate with Call of Duty: Warzone, Activision’s massively popular free-to-play first-person shooter, or if the latest game will include the popular Zombies mode that was made popular by Call of Duty: Black Ops. It's also unclear as to which consoles will be getting the game, though it seems likely that we'll see it on PC, PS5 and Xbox Series X.",
    "Should Eurogamer’s source turn out to be correct, this will be the sixth main entry in the franchise to explore the second world war, and the second within five years.",
    "The return to the European and Asian Pacific theater of war would be a slight departure from the franchise’s recent exploration of more modern settings that we saw in Call of Duty: Modern Warfare and Call of Duty: Black Ops 3, as well as the less-popular future settings of Infinite Warfare and Advanced Warfare. But it still begs the question: how many times will Call of Duty return to WW2?",
    "It's hard to blame the developers for their fascination with the subject – it is one of the most pivotal events of the last century after all – but we can also understand that some gamers may not be as infatuated with the subject.",
    "Regardless, it's worth holding off on judging the game before it's even been announced as there's real potential for Sledgehammer to do something new and unique, even in a setting that we've seen umpteen times in the last 20 years since the original Call of Duty came out on PC.",
    "For now, we'll just have to wait to find out more."
  ],
  "headers": {
    "4": "Another trudge through the trenches"
  },
  "links": {
    "Call of Duty WW2: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "rumor": "https://www.techradar.com/news/new-call-of-duty-name-leak-suggests-a-return-to-ww2",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-03-26-report-this-years-call-of-duty-returns-to-ww2",
    "Call of Duty: WWII": "https://www.techradar.com/news/call-of-duty-ww2-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Call of Duty: Modern Warfare": "https://www.techradar.com/reviews/call-of-duty-modern-warfare-2019-review",
    "Infinite Warfare": "https://www.techradar.com/news/call-of-duty-infinite-warfare-review"
  }
}