{
  "source": "https://www.techradar.com/news/the-galaxy-z-fold-3-and-galaxy-z-flip-3-rumored-to-have-gone-into-mass-production",
  "title": "The Galaxy Z Fold 3 and Galaxy Z Flip 3 rumored to have gone into mass production",
  "category": "phones",
  "updated": "2021-06-19T10:00:48Z",
  "author": "david-nield",
  "summary": "A tale of two foldables",
  "article": [
    "It looks like we don't have too much longer to wait to see Samsung's new foldable phones: the Galaxy Z Fold 3 and the Galaxy Z Flip 3 have apparently gone into mass production, with around 50,000-70,000 units of each device being rolled out every day.",
    "That's per the usually reliable Jon Prosser at FrontPageTech, who says that Samsung is on course to launch these devices at the previously rumored August 3 event. These folding phones are said to be going on sale on August 27, almost four weeks later.",
    "As Prosser himself says, that 50,000-70,000 figure is \"staggering\" – it suggests that Samsung expects sales of these devices to be a lot stronger than those of the Galaxy Fold 2 and the 5G Galaxy Flip, as more users embrace foldable display technology.",
    "While Samsung manufactured a combined 1-2 million units of the previous generation foldable phones, this time around it's looking more like a grand total of 7 million – so you can see the sort of ramp up in production that's happening this year.",
    "This is all still unverified information of course, so don't take it as certain just yet, but a lot of the rumors around these handsets seem to be pointing in the same direction now. We've been expecting them to make their debut in August for a while now.",
    "We've already had glimpses of what the Galaxy Z Fold 3 and the Galaxy Z Flip 3 might look like, and we like what we've seen so far. The Z Flip 3 is being tipped to come in a variety of different colors, with an eye-catching two-tone design on the back casing.",
    "There have also been whispers that these foldable phones could cost less than their predecessors, thanks to improvements in the production process and cheaper components – which would of course make the devices more appealing to potential buyers out there.",
    "All will be revealed on August 3 (probably). Alongside the Galaxy Z Fold 3 and the Galaxy Z Flip 3, it's probable that Samsung is also going to be showing off the Galaxy S21 FE, the Galaxy Watch 4, the Galaxy Watch 4 Active, and the Galaxy Buds 2."
  ],
  "headers": {
    "4": "Previous rumors"
  },
  "links": {
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "FrontPageTech": "https://www.frontpagetech.com/2021/06/18/exclusive-samsung-begins-mass-production-for-galaxy-z-fold-3-z-flip-3-ordering-50000-units-a-day/",
    "previously rumored": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
    "Galaxy Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "5G Galaxy Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "for a while now": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-and-z-fold-3-foldables-tipped-to-launch-in-august",
    "had glimpses": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-could-take-design-cues-from-the-pixel",
    "been whispers": "https://www.techradar.com/news/the-samsung-galaxy-z-flip-3-could-cost-less-than-we-thought",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Watch 4 Active": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2"
  }
}