{
  "source": "https://www.techradar.com/news/fall-guys-is-diving-onto-xbox-series-x-s-and-xbox-one-soon",
  "title": "Fall Guys is diving onto Xbox Series X, S and Xbox One soon",
  "category": "gaming",
  "updated": "2021-02-18T16:35:06Z",
  "author": "rhys-wood",
  "summary": "Heavy is the head that wears the crown",
  "article": [
    "Fall Guys is finally confirmed to be heading to Xbox Series X/S and Xbox One this summer (or Q2/Q3 if you're below the equator, as announced in a tweet from the official Xbox Twitter account.",
    "Fall Guys has been a resounding success since it released on PC and PlayStation 4 in August last year, but being stuck on those platforms has left the game with little room to grow its player base in the months since. Thankfully, that’s finally set to change.",
    "This follows the news from yesterday’s Nintendo Direct that Fall Guys will also be hitting the Nintendo Switch during the same period. There’s no word yet if Fall Guys will be cross-platform across all systems, with Sony often being the gatekeeper of such a process, like the time it was slow to give the go-ahead on cross-platform play for Rocket League.",
    "But given Nintendo and Microsoft’s amicable relationship, it’s not out of the question. Both companies have teamed up in the past to give us cross-platform play on Minecraft, for example.",
    "If you're uninitiated in the mayhem, Fall Guys is an online multiplayer platformer that tasks players with racing through numerous themed obstacle courses, similar to what you might see on shows like Wipeout or Takeshi's Castle.",
    "Both solo and team games are thrown into the mix, with the numbers of players being whittled down in each subsequent game, until the final, where the winner is the player first to grab the crown or stay alive longer than everyone else.",
    "Fall Guys being officially confirmed for release on Xbox consoles is great news. The game was originally tipped for release on Xbox Game Pass, a rumor that was quickly shut down by Devolver Digital, the game’s publisher.",
    "Developer Mediatonic has consistently supported Fall Guys since launch with three seasons of new content, all of which feature new stages to traverse and a bevy of rewards including costumes and paint jobs for those plucky bean-shaped characters, alongside stage variations that include obstacles like the infamous \"Big Yeetus\" hammer.",
    "We’d love to see some Xbox-centric rewards, too, such as Halo, Gears or Killer Instinct costumes. Fall Guys is no stranger to guest costumes, with the likes of Sonic the Hedgehog and Portal getting representation."
  ],
  "headers": {
    "4": "Falling for you"
  },
  "links": {
    "Fall Guys will also be hitting the Nintendo Switch": "https://www.techradar.com/news/surprise-fall-guys-is-coming-to-nintendo-switch",
    "Rocket League": "https://www.techradar.com/news/sony-finally-allows-rocket-league-cross-play-between-ps4-xbox-one-and-switch",
    "Big Yeetus": "https://twitter.com/FallGuysGame/status/1301188864162267137"
  }
}