{
  "source": "https://www.techradar.com/news/samsung-a52-5g-headlines-lineup-of-galaxy-phones-released-in-us",
  "title": "Samsung A52 5G headlines lineup of Galaxy phones released in US",
  "category": "phones",
  "updated": "2021-04-07T14:00:24Z",
  "author": "david-lumb",
  "summary": "As well as the Samsung A32, one of the cheapest 5G phones in the US",
  "article": [
    "Samsung is launching a slew of new phones in the US as its mid-range and budget lineup, fronted by the Samsung Galaxy A52 5G, offering some of the cheapest 5G phones on the market.",
    "The Samsung Galaxy A52 5G is the spotlight phone here, providing powerful specs and 5G connectivity at a decent price, and the phones only get more affordable from there. But notably absent in the US lineup is the Samsung Galaxy A72 5G, which launched alongside the A52 in March as the company’s most advanced non-flagship phone.",
    "Why isn’t the A72 coming to the US? Because the Samsung Galaxy S20 FE (Fan Edition) sold really well, according to Samsung – which implies the company didn’t want the lower-end flagship competing with the A72 and potentially cannibalize each other’s sales. In other words, we may not see another phone come into this space until the as-yet unconfirmed Samsung Galaxy S21 FE, if and when it launches later this year.",
    "In any case, the A52 5G is a strong mid-range device on paper: a Snapdragon 750G chipset with 6GB of RAM, 128GB of storage, a 6.5-inch AMOLED Full HD display with 120Hz refresh rate, a quad rear camera with 64MP main shooter, IP67 water- and dust-resistance, and stereo speakers. The phone starts at $499 and will be sold by AT&T, T-Mobile, Metro by T-Mobile, UScellular, and unlocked (it is available now in the UK for £399 and on April 9 in Australia for AU$649).",
    "The A42 5G will be the second-cheapest 5G phone offered by Samsung, aside from the A32 5G (and one of the most affordable 5G phones in the US). It packs the same Snapdragon 750G with 4GB of RAM and 128GB of storage, a slightly larger 6.6-inch AMOLED HD Plus display (but only 60Hz refresh rate), a triple rear camera headed by a 48MP main shooter, and will be a Verizon exclusive at $399 (around £288 / AU$520).",
    "The other three models represent the budget models Samsung is rolling out to the US, including quite possibly the cheapest 5G phone you can buy.",
    "First up is the Samsung Galaxy A32 5G, which packs a MediaTek 720 chipset with 4GB of RAM, 64GB of storage, a 6.5-inch LCD HD Plus display with 90Hz refresh rate, a quad rear camera with a 48MP main shooter, and of course, 5G connectivity for $279 (around £200 / AU$365) at T-Mobile, Metro by T-Mobile, and Cricket.",
    "The A12 is the next step down in affordability and features, with a MediaTek P35 chipset and 3GB of RAM, 32GB of storage, a 6.5-inch LCD HD Plus display with standard 60Hz refresh rate, a quad rear camera with a 16MP main shooter, and side fingerprint sensor for $179 (around £129 / AU$233) at AT&T, T-Mobile, Metro by T-Mobile, and Cricket.",
    "The A02s is the most affordable phone in Samsung’s 2021 lineup, packing a Snapdragon 450 with 2GB of RAM, 32GB of storage, the same 6.5-inch LCD HD Plus display as the A12, and a triple rear camera with 13MP main shooter for $109 (around £79 / AU$142) at Verizon, Boost, Charter, Metro by T-Mobile, UScellular, and unlocked at Samsung.com."
  ],
  "headers": {
    "5": "Budget phones: The Galaxy A32 5G, A12, and A02s"
  },
  "links": {
    "Samsung Galaxy A52 5G": "https://www.techradar.com/reviews/samsung-galaxy-a52-5g-review",
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "launched": "https://www.techradar.com/news/samsung-galaxy-a52-and-a72-are-here-and-bring-flagship-features-to-mid-range-phones"
  }
}