{
  "source": "https://www.techradar.com/news/heres-why-tablet-deals-could-be-the-best-part-of-black-friday-in-2021",
  "title": "Here's why tablet deals could be the best part of Black Friday in 2021",
  "category": "phones",
  "updated": "2021-10-16T08:00:41Z",
  "author": "tom-bedford",
  "summary": "Keep a tab open",
  "article": [
    "It’s no secret that over Black Friday, iPad deals tend to be more popular than discounts on other tablets - according to Google Trends, searches for discounts on Apple slates are roughly four times as high as the term ‘tablet deals’ over the Black Friday week.",
    "However, in 2021 it’s the Black Friday tablet deals that you should really keep your eyes peeled for, not the discounts on iPads.",
    "2021 has been the year of the Android tablets, with the number on the market exploding towards the end of the year. Many big brands have unveiled their first (or first-in-a-long-time) slates including the Xiaomi Pad 5, Nokia T20, Realme Pad and Huawei MatePad 11, and that’s alongside the many models that get yearly upgrades like the Samsung Galaxy Tab and Amazon Fire lines.",
    "This big increase in the number of tablets on the market could have a huge impact on Black Friday deals, in terms of both quantity and quality.",
    "Technically speaking, 2021 wasn’t the year of the tablet - 2020 was - but companies took quite a while designing and producing their slates.",
    "With Covid-19 sweeping the world, many people found themselves confined to their homes, and tablet sales saw a boom in sales as a result. People found them useful for watching movies in bed, playing games, as an educational tool or just as a work device.",
    "As shown by Statista’s stats on tablet sales over time, tablet sales had been trending down for several years before the pandemic boosted them back up. Separate data from Statcounter suggests iPads made up just over half of all tablet sales, with Samsung getting about half of the remaining sales and the rest being shared between a few companies like Amazon, Huawei and Lenovo.",
    "In 2021, we’ve seen loads of companies release tablets. Some of these are debut slates, like the Realme Pad or the Nokia T20 (we’ve seen Nokia tablets before, but this is the first since HMD Global took over the popular name). Some of these are the first devices we’ve seen in years from the company, like the Xiaomi Pad 5. And some companies which put out tablets regularly, made a bigger deal about their new devices, like Huawei with its MadPad 11.",
    "One company that was oddly quiet was Samsung, as we didn’t see a Galaxy Tab S7 successor in 2021 - as long as you don’t count the Galaxy Tab S7 FE, a budget spin-off of Samsung’s top-tier 2020 tablet. Apparently, a Galaxy Tab S8 is coming in early 2022 but it remains to be seen if that's accurate.",
    "It remains to be seen how long this tablet bubble lasts. It's possible that, once Covid is in the world's rear-view mirror, people will stop wanting the portable screen devices. But it's also feasible that the weirdness of the last year could inspire a long-lasting affinity for slates.",
    "Presumably, gadget-makers are hoping the latter is true, otherwise releasing tablets could be a risky prospect.",
    "With many more tablets on the market for Black Friday 2021 compared with the same time of year in 2020, the deals are going to be well worth watching.",
    "Naturally, with more tablets to buy, there will be more products discounted. This doesn't just affect the slates themselves, but accessories for them like styli, keyboards and cases.",
    "For tech buyers, competition can be a good thing, and if there are loads of tablet deals, it means there will likely be great discounts too: brands will want to discount their tech by enough to sway people from rival gadgets.",
    "So if you've been considering buying one of these new gadgets, it's worth waiting until November as we could see some great discounts.",
    "Some pre-Black Friday deals have already started, and we'll post them below. There's nothing amazing just yet, but if you're not fussy about how discounted your tech is, you might want to buy now."
  ],
  "headers": {
    "4": "The year of the tab",
    "11": "Big for Black Friday deals",
    "16": "UK tablet deals"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "iPad deals": "https://www.techradar.com/black-friday/black-friday-ipad-deals",
    "Google Trends": "https://trends.google.com/trends/explore?geo=US&q=ipad%20deals,tablet%20deals",
    "Black Friday tablet deals": "https://www.techradar.com/news/black-friday-tablet-deals-the-best-savings-on-ipads-fire-tabs-and-android-slates",
    "Android tablets": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "Xiaomi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "Nokia T20": "https://www.techradar.com/reviews/nokia-t20-review",
    "Realme Pad": "https://www.techradar.com/news/realme-pad-android-tablet",
    "Huawei MatePad 11": "https://www.techradar.com/reviews/huawei-matepad-11-review",
    "Statista": "https://www.statista.com/statistics/272070/global-tablet-shipments-by-quarter/",
    "Statcounter": "https://gs.statcounter.com/vendor-market-share/tablet/worldwide",
    "Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Galaxy Tab S7 FE": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-fe",
    "Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8"
  }
}