{
  "source": "https://www.techradar.com/news/fun-rick-and-morty-teaser-finally-casts-christopher-lloyd-as-the-real-rick-sanchez",
  "title": "Fun Rick and Morty teaser finally casts Christopher Lloyd as the real Rick Sanchez",
  "category": "entertainment",
  "updated": "2021-09-06T10:21:03Z",
  "author": "samuel-roberts",
  "summary": "Aw jeez",
  "article": [
    "Ahead of the Rick and Morty season 5 finale, Adult Swim has released a cool new video for the show that depicts Back to the Future's Christopher Lloyd and IT's Jaeden Martell as Rick and Morty in live-action respectively.",
    "This really brings the series full circle – the show's predecessor is a 2006 short called The Real Adventures of Doc and Mharti that was a gross riff on the Back to the Future concept. Further shorts would follow, and that DNA is obviously still present in the show today. Now, the real Doc Brown has played Rick. And hey, Martell is a perfectly fine substitute for Michael J Fox.",
    "It simply depicts Rick and Morty arriving out of a portal, with Rick saying \"Morty, we're home,\" and belching, while Morty responds with the classic \"aw jeez\".",
    "Check the video out below:",
    "'C-132' is a reference to the dimension that these versions of the characters are evidently from. Rick from the main series hails from C-137.",
    "The video doesn't appear to tie in to anything specific – the Adult Swim social media feeds periodically release short movies to promote the show, usually animated, and this is likely just another one of those. Rick and Morty's double-length season 5 finale airs this weekend on Adult Swim (or on E4 in the UK and Netflix in Australia this coming Monday), so this is probably tying in to that.",
    "Still, what an elaborate way to capture people's attention.",
    "If you want something more substantial, Adult Swim also just released the season finale's cold open – you can watch that below. It depicts Morty trying to repair the damage caused by Rick's various messes, but as is so often the case with the show, things escalate out of control.",
    "Rick and Morty season 5 episode 9 airs on September 5."
  ],
  "headers": {
    "5": "Is the live-action Rick and Morty video teasing anything?"
  },
  "links": {
    "Rick and Morty season 5 finale": "https://www.techradar.com/news/what-time-is-rick-and-morty-season-5-episode-5-released-today"
  }
}