{
  "source": "https://www.techradar.com/news/why-are-laptop-webcams-still-so-awful-and-when-will-it-change",
  "title": "Why are laptop webcams still so awful and when will it change?",
  "category": "computing",
  "updated": "2021-10-09T03:21:28Z",
  "author": "desire-athow",
  "summary": "Low-resolution is still the norm but why oh why?",
  "article": [
    "A new laptop from Chinese tech company Honor has shipped with an industry first that went, well, almost unnoticed.",
    "The MagicBook V14 is the first laptop to come with a 5-megapixel camera with a 90-degree ultra-wide angle camera. A handful of other devices like the HP Elite Dragonfly Max business laptop also have 5-megapixel cameras but (a) they’re likely to be 2-in-1 convertible laptops and (b) they still account for a tiny fraction of the market.",
    "So why is it that, in this day and age where hybrid working is all the rage, where Microsoft Teams, Zoom and Google Meet are household names and even mainstream smartphones (like the Infinix Zero 8) boast a selfie camera with 48-megapixel resolution, do laptop owners have to put up with VGA webcams (yes VGA)?",
    "VGA, for those below a certain age, refers to an antiquated, obsolete, bygone resolution of 640 by 480 pixels (or 307,000 pixels in all). It was mainstream towards the end of the last century (the 1990s) but has somehow managed to still find its way into at least one laptop launched in 2021 - namely, the Lenovo V17-IIL.",
    "While, there might be a funny side in seeing yourself on-screen as a Minecraft character, it’s not a sentiment shared by many.",
    "One of the best selling computer products of the past two years has been the humble webcam. The pandemic has shown that millions of people are not happy with the quality of the picture captured by integrated laptop webcams and sadly, that’s not something which will change soon.",
    "Our sample survey of 50 laptops currently on sale at Dell, Lenovo and HP - across gaming, consumer and business ranges - painted a bleak picture.",
    "Dell had no laptops with webcams with a higher resolution than 720p (about one million pixels), and that includes its most expensive laptop, the $5,339 Dell Precision 7760 Data Science Workstation. Lenovo didn’t fare better even for its mega expensive $5,159 ThinkPad P17 Gen 2 mobile workstation, and ditto for HP and Apple.",
    "As it stands, HD webcam represents the norm - not an exception - in a laptop launched in 2021. It’s the equivalent of having a CD-ROM drive on your laptop - it used to be cool but it is just an embarrassment these days. So why no change?",
    "Well, there’s the laws of physics, apathy and priorities. Pre-pandemic, webcam quality on laptops was far down the priority list because, most people met in real life and video conferencing was either done primarily in meeting rooms or on one’s smartphone, both delivering vastly better quality.",
    "That convinced vendors like Dell to stick to HD technology and shrink it to create ultra-portable laptops with tiny bezels like the award-winning XPS 13. Others, like Honor, have decided to hide the webcam altogether in a pop-up key on your keyboard. A couple - like Asus - went even further and eliminated the webcam altogether because… why not?",
    "The laws of physics and (generally speaking) capitalism as a whole also made the shift to multi-megapixel laptop webcams complicated. Phones tend to be thicker than laptop lids and laptop webcam modules tend to be horizontal (to fit in the bezel), not vertical (like for smartphones). So until there’s enough demand for laptop webcam modules with smartphone-like sensors, the transition won’t happen.",
    "Then there’s the reviewer and user apathy: HD webcams are the norm so reviews and users do not tend to highlight (or consider) it as an anomaly. It’s only when we, reviewers, act as a catalyst for change and start to highlight this as an aberration that readers will take notice and hopefully pressure vendors.",
    "Huawei and Honor are the only ones that dared put the webcam into a pop up key and the least we can say is that it’s not proving to be a popular option because of the fixed camera angle. Other alternatives could include having a thicker bezel, under display or punch hole cameras.",
    "At the end of the day, it will be down to the consumers to vote with their wallets. Enhancements to camera capabilities on smartphones have provided some compelling unique selling points to the likes of Huawei. Could someone replicate the same on laptops? The jury is out."
  ],
  "headers": {
    "6": "HD leads the way",
    "13": "So what comes next?"
  },
  "links": {
    "MagicBook": "https://www.techradar.com/reviews/honor-magicbook-pro-intel-edition-16-inch-laptop",
    "business laptop": "https://www.techradar.com/news/best-business-laptops",
    "2-in-1 convertible laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Minecraft": "https://www.techradar.com/news/the-history-of-minecraft",
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "Dell Precision 7760 Data Science Workstation": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1602699484210910700/https://www.dell.com/en-us/work/shop/workstations-isv-certified/new-precision-7760-data-science-workstation/spd/precision-17-7760-laptop/xctop776017dswsus_vp",
    "ThinkPad P17 Gen 2": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-1215460850512299300&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Fp%2Flaptops%2Fthinkpad%2Fthinkpadp%2Fthinkpad-p17-gen-2-%2817-inch-intel%29-mobile-workstation%2F20yu002jus",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review"
  }
}