{
  "source": "https://www.techradar.com/news/amd-might-solve-gpu-stock-woes-by-outsourcing-some-production-to-samsung",
  "title": "AMD might solve GPU stock woes by outsourcing some production to Samsung",
  "category": "computing",
  "updated": "2021-02-01T16:52:59Z",
  "author": "carly-page",
  "summary": "TSMC is reportedly struggling to keep up with demand",
  "article": [
    "AMD is reportedly looking to outsource some GPU production to Samsung in a bid to lessen its reliance on TSMC.",
    "While TSMC currently handles the entirety of AMD’s order, including its Zen 3 CPUs and RDNA 2 graphics cards, the company is reportedly struggling to keep up with demand.",
    "New rumours, courtesy of South Korean hardware forum Clien.net, claim that TSMC is facing “exceptionally high demand” for its foundry capacity, likely as a result of Apple securing its full 5nm capacity last year. This increased demand resulted in TSMC increasing its wafer prices, which in turn lead to Nvidia shifting the production of its GeForce RTX GPUs to Samsung.",
    "It looks like AMD could be about to follow suit. The company, which is looking to increase production capacity by some 50%, is reportedly to Samsung to fulfil its manufacturing needs.",
    "The firm is reportedly considering having some of its APIs and GPUs manufactured by Samsung, and Techpowerup speculates that the company could be planning to leverage the company’s 8nm manufacturing process for mid-range GPUs other less critical product lines.",
    "AMD could also be one of the first companies to utilize the company's upcoming 3nm facilities, although the company is still said to be weighing up its options before shifting production to Samsung.",
    "AMD and Samsung do already have an existing relationship; the companies are currently working on a custom mobile GPU that will be utilized for upcoming Samsung Exynos processors.",
    "Rumours of AMD planning to shift some production to Samsung comes just days after it was reported that Intel is planning to outsource some chip production to TSMC - despite talk of the company struggling to keep up with demand.",
    "A Digitimes report claimed that that Intel’s upcoming CPU products will be mass produced by TSMC on 3nm in the second half of 2022, and that Intel will become TSMC’s second biggest customer after Apple."
  ],
  "headers": {},
  "links": {
    "Zen 3 CPUs": "https://www.techradar.com/news/amd-zen-3",
    "RDNA 2 graphics cards": "https://www.techradar.com/news/amd-big-navi",
    "Clien.net": "http://Clien.net",
    "Nvidia shifting the production of its GeForce RTX GPUs to Samsung": "https://www.techradar.com/news/nvidia-might-beat-amd-in-gpu-stock-thanks-to-new-samsung-deal",
    "Techpowerup": "https://www.techpowerup.com/277974/amd-reportedly-in-plans-to-outsource-partial-chip-production-to-samsung",
    "the company's upcoming 3nm": "https://www.techradar.com/news/samsung-to-take-chip-war-to-tsmc-with-dollar116-billion-investment",
    "Intel is planning to outsource some chip production to TSMC": "https://www.techradar.com/news/intel-could-get-help-to-make-3nm-processors-in-2022-which-may-be-bad-news-for-amd",
    "Intel": "https://www.techradar.com/news/intel-in-2021-could-intel-regain-dominance"
  }
}