{
  "source": "https://www.techradar.com/news/new-motorola-edge-is-coming-in-just-a-few-days-but-it-may-be-a-china-exclusive",
  "title": "New Motorola Edge is coming December 9, but it may be a China exclusive",
  "category": "phones",
  "updated": "2021-12-01T03:40:29Z",
  "author": "james-peckham",
  "summary": "You may not be able to buy this one yet",
  "article": [
    "A new Motorola Edge phone is set to launch on December 9, and it'll be one of the first phones to include the new Qualcomm Snapdragon 8 Gen 1 chipset (previously anticipated to be named the Snapdragon 898).",
    "The only problem is, we don't know whether you'll be able to buy it. Announced during the Qualcomm Snapdragon Summit 2021, a Motorola representative said a new Edge smartphone is set to launch in China in the coming days.",
    "Ruben Castano, Head of Customer Experiences at Motorola, said, \"All the experiences you saw today will be available very soon on an upcoming Motorola Edge device.",
    "\"In fact, in just a few days we will reveal one of the very first smartphones to launch on this new Snapdragon 8 platform in China.\"",
    "Castano was clear that this device would be revealed in China, and that may mean this is a phone that won't be available elsewhere in the world. Motorola does sometimes reveal phones that are just specifically for that market.",
    "For example, 2021's Motorola Edge S was revealed in January this year but didn't make its way to other markets until April where it was revealed as the Motorola G100.",
    "If you are able to buy this smartphone, it may be you'll have to wait until 2022 and it may be introduced to markets like the US and UK under a different name.",
    "Less than an hour before this announcement, Xiaomi confirmed its upcoming Xiaomi 12 will be the first phone to feature the new chipset.",
    "We're not clear yet when the Xiaomi 12 will launch, or whether the new Motorola Edge phone will be revealed in full ahead of that handset, We also don't know exactly when the new Motorola handset will be revealed.",
    "Earlier this week, one leak suggested a Motorola Edge X30 smartphone was set to launch in China. That leak suggested it would feature the Snapdragon 8 Gen 1, so this may be the device Castano has been teasing.",
    "As spotted by Pocketlint, Motorola has now confirmed its event is taking place on December 9 in China but it has yet to confirm the exaxct name of the device it'll be launching."
  ],
  "headers": {
    "7": "Not the first"
  },
  "links": {
    "Qualcomm Snapdragon 8 Gen 1": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "Qualcomm Snapdragon Summit 2021": "https://www.techradar.com/news/live/qualcomm-snapdragon-summit-2021-live-blog",
    "Xiaomi confirmed its upcoming": "https://www.techradar.com/news/xiaomi-12-will-be-available-soon-with-a-qualcomm-snapdragon-8-gen-1-chipset",
    "one leak suggested a Motorola Edge X30": "https://www.notebookcheck.net/Motorola-s-Edge-X30-pops-up-in-a-new-leak-sparking-fresh-rumors-of-a-next-gen-flagship-smartphone.582093.0.html",
    "Pocketlint": "https://www.pocket-lint.com/phones/news/motorola/159260-motorola-edge-china-only-qualcomm-snapdragon-8-gen-1"
  }
}