{
  "source": "https://www.techradar.com/news/how-to-watch-can-vs-wood-live-stream-boxing-wba-featherweight-title-fight",
  "title": "How to watch Can vs Wood: live stream boxing WBA Featherweight title fight",
  "category": "computing",
  "updated": "2021-07-31T20:06:43Z",
  "author": "kevin-lynch",
  "summary": "WBA World featherweight title is on the line in Essex",
  "article": [
    "British champ Leigh Wood has a chance to demonstrate he can compete at the top tier of boxing tonight as he takes on China's Xu Can for the WBA Featherweight (Regular) title.",
    "The first of three consecutive Fight Camp cards over the coming weeks, tonight's event marks something of a new era for British boxing with it being the first card for Eddie Hearn's Matchroom promotions following their newly-penned exclusive deal with streaming service DAZN after moving from Sky Sports.",
    "Read on to discover the fight time, full card and your best Can vs Wood live stream options to watch, with DAZN the main broadcaster around the world.",
    "Tonight's event had originally been set to be headlined by Conor Benn vs Adrian Granados, but the 24-year-old British welterweight champ was forced to pull out following a positive covid test.",
    "Tonight's main event marks the first time that Can has fought for 20 months, but the 126-pound star has insisted he has never been better prepared coming into this fight.",
    "Can won his title after defeating Jesus Rojas in January 2019, and has since gone on to defend his crown on two occasions.",
    "The 27-year-old from Jiangxi, will likely be looking at tonight's fight as a stepping stone to a showdown with the winner of next month's clash between Mauricio Lara and Josh Warrington.",
    "Follow our guide below to catch this big fight - here's how to watch Xu Can vs Leigh Wood online and get a Can vs Wood live stream, no matter where you are in the world.",
    "You can watch Can vs Wood for free - but only in certain parts of the world. And you can at least get the fight dirt cheap in other countries.",
    "The cheapest of the cheap sees DAZN UK available for just £1.99 a month - a big saving, compared to the steeper DAZN US price of $19.99 a month.",
    "Boxing fans in Canada are also in luck, as while it costs 20 bucks in the Great White North, you can get a FREE trial of DAZN in Canada, as well as in Germany, Austria, Switzerland, Spain, Brazil and Japan.",
    "Coverage of the main card starts on DAZN at the somewhat early time of 7pm BST in the UK and 2pm ET / 11m PT in the US and Canada.",
    "The headline act is expected to start around 10pm BST local time, making it a 5pm ET / 2pm PT on start on Saturday afternoon in the US - though this of course depends on how long the earlier fights last.",
    "Pronounced 'Da Zone', DAZN is a sports-centric streaming service that launched in 2016 and is now available in over 200 countries all around the world including the US, Canada, and the UK.",
    "Its offering varies by region, but as an idea, it owns the rights to the Premier League, Champions League, NFL, cricket, snooker, rugby union and more in Canada - one of its original and biggest markets.",
    "It's also seeking to challenge the pay-per-view boxing hierarchy, and is landing an increasing number of coups.",
    "As we say, DAZN has this wrapped up pretty much everywhere. But if you're abroad and discover that your coverage is geo-blocked, then the only alternative that we know is to use a VPN to dial in to a country that is showing the fight.",
    "The software is perfect for this as it allows you to change your IP address and appear to be in a completely different location - and all through a safe, encrypted connection. Here's how to get started.",
    "Use a VPN to live stream anywhere",
    "Remember, there are loads of benefits to using a VPN beyond just helping you regain access to streaming services and content from abroad. One of the biggest is security: by using encrypted tunnels, VPNs give you a robust first-line of defense against cybercriminals and government snooping. This makes everyday tasks like online shopping and banking much safer, and many people choose to use one for that reason alone.",
    "However, those looking to subscribe to DAZN for the first time may find the service manages to effectively block certain VPNs at the point of creating an account. VPNs most notably encounter obstacles starting from scratch with DAZN Canada, though in other places like the US our general sports VPN recommendation was working fine in 2021.",
    "And if you've already got an account, a VPN should work wherever you are to help you regain access to pre-existing subscriptions.",
    "China may be the world's most populated country, but Xu Can's unique rise through the ranks marks him out as one of the first fighter's from the country to make a big impact on the world stage.",
    "Nicknamed the \"The Monster\" for his trademark relentless punching, (he managed to throw a stunning 1,562 shots in his title defence against Manny Robles II, a figure that ranked as sixth most punches delivered by a fighter since CompuBox starting taking records), Can has made two successful defences of his title since Jesus Rojas in January 2019.",
    "having not fought since November 2019, his progression has been put on hold largely thanks to the pandemic, but a win tonight should help underline once more that he has the potential to become one of the sport's biggest stars.",
    "Nicknamed Leigh-Thal, 32-year-old Leigh Wood is the current the British featherweight title holder.",
    "The Nottingham-born fighter has built back his career after his early promise was curtailed following a defeat to Gavin McDonnell for the British Super Bantamweight in 2014.",
    "After making a successful step up to the 125lb division, Wood claimed the Commonwealth and WBO European featherweight belts, but his progress suffered a setback last year after losing a majority points decision to fellow Brit Jazza Dickens at York Hall.",
    "An impressive TKO win over Reece Mould in February this year however appeared to show he was back to his best, setting up tonight's title challenge."
  ],
  "headers": {
    "8": "Xu Can vs Leigh Wood live stream options",
    "11": "Xu Can vs Leigh Wood time",
    "13": "What is DAZN? All about the sports streaming service",
    "16": "How to watch Xu Can vs Leigh Wood if you're away from your country",
    "22": "Who is Xu Can?",
    "25": "Who is Leigh Wood?",
    "29": "Xu Can vs Leigh Wood: Fight Camp 2 full card for Saturday's fight"
  },
  "links": {
    "with DAZN the main broadcaster around the world": "https://www.prf.hn/click/camref:1101l4vjL/pubref:trd-us-8676659214589412000/destination:https%3A%2F%2Fwww.dazn.com%2F",
    "DAZN UK available for just £1.99 a month": "https://www.prf.hn/click/camref:1101l4vjL/pubref:trd-us-3192160780700155400/destination:https%3A%2F%2Fwww.dazn.com%2F",
    "FREE trial of DAZN in Canada": "https://www.prf.hn/click/camref:1101l4vjL/pubref:trd-us-1491409971874643200/destination:https%3A%2F%2Fwww.dazn.com%2Fen-CA%2Fl%2Fsports",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}