{
  "source": "https://www.techradar.com/news/how-to-watch-al-davis-vs-the-nfl-online-stream-espn-30-for-30-documentary-anywhere",
  "title": "How to watch Al Davis vs The NFL online: stream ESPN 30 for 30 documentary anywhere",
  "category": "computing",
  "updated": "2021-02-04T23:58:06Z",
  "author": "james-laird",
  "summary": "Just win, baby!",
  "article": [
    "Gearing up for Super Bowl is almost as much fun as sitting back to watch the big game itself, and ESPN has a treat in store for NFL fans ahead of this Sunday's showdown in the form of a new instalment of its award-winning 30 for 30 documentary series. Follow our guide below as we explain how to watch Al Davis vs The NFL online and stream the new ESPN 30 for 30 wherever you are in the world today.",
    "Al Davis vs The NFL tells the story of former Raiders owner Al Davis' infamous feud with then-NFL commissioner Pete Rozelle. Davis wanted to move the Raiders (now of Las Vegas) from Oakland to Los Angeles and change the team's name in the 1980s, the NFL didn't think it was that straightforward, and so Davis sued the league - and won.",
    "All the while, the Raiders were busy racking up wins including two Super Bowls (1981 and 1984), making it the perfect aperitif for all those folks looking forward to a Super Bowl live stream this weekend.",
    "Intriguingly, the new 30 for 30 documentary use so-called 'deep fake' technology to recreate digital versions of the two characters - both now deceased - rather than rely on archival footage. Not everyone's happy about it, given the overwhelmingly negative connotations of the tech - and the fact that no amount of computer magic will ever recreate Davis' fiery personality.",
    "Nevertheless, it's another appetizer for NFL fans who just can't wait for the big game this Sunday, so you'll probably want to decide for yourself. Read on as we explain how to watch Al Davis vs The NFL and stream the new 30 for 30 ESPN documentary so you can make your mind up for yourself.",
    "As we've just explained, it's really straightforward for anyone in the US to watch 30 for 30 documentaries like Al Davis vs The NFL on ESPN.",
    "But for folk elsewhere, it may not be quite so simple. In some countries, you can buy access to ESPN Player, but in others geo-blocking restrictions will stand in your way.",
    "This is especially annoying when you're from the US and would normally be able to access ESPN back home. Fortunately, there is a solution in the form of a VPN. This nifty bit of software changes your IP address so that you can access all the content you normally would at home - just from anywhere in the world."
  ],
  "headers": {
    "5": "How to watch Al Davis vs The NFL from outside the country",
    "8": "How to watch Al Davis vs The NFL 30 for 30 documentary: stream ESPN in Australia"
  },
  "links": {
    "Super Bowl live stream": "https://www.techradar.com/news/watch-super-bowl-live-stream-2021-free-online",
    "ESPN Player": "https://www.espnplayer.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}