{
  "source": "https://www.techradar.com/news/black-panther-2-will-bring-the-next-iron-man-style-superhero-to-the-mcu",
  "title": "Black Panther 2 will bring the next Iron Man style superhero to the MCU",
  "category": "entertainment",
  "updated": "2021-08-20T08:59:29Z",
  "author": "tom-power",
  "summary": "Black Panther 2 will introduce Ironheart to the MCU",
  "article": [
    "Kevin Feige has confirmed that Black Panther 2 will introduce Ironheart to the MCU ahead of the character's own Disney Plus TV show.",
    "Speaking to ComicBook.com as part of the Shang-Chi press tour, Feige revealed that the Iron Man-like character – real name Riri Williams – will make her live-action debut in Black Panther: Wakanda Forever.",
    "Dominique Thorne has been cast as Williams since December 2020 when Marvel announced that an Ironheart series was in development. While many fans had expected Williams to appear in her own show first, she'll now take flight (metaphorically at least) in the forthcoming Black Panther sequel.",
    "Feige said: \"We're shooting Black Panther: Wakanda Forever right now, and the character of Riri Williams, you will meet in Black Panther 2 first. She started shooting, I think, this week before her Ironheart series.\"",
    "The Ironheart TV series doesn't have a release date yet, but we do know a couple of other details about the show. The Disney Plus series will comprise six episodes and it'll be written by Chinaka Hodges, whose previous credits include TNT's Snowpiercer TV show and Apple TV Plus' Amazing Stories reboot.",
    "Meanwhile, filming on Black Panther 2 began in June 2021 and is expected to last six months. The movie is currently slated to release on July 8, 2022.",
    "A relative newcomer to Marvel comics, Ironheart only made her debut in Invincible Iron Man Volume 2 #7.",
    "Created by Brian Michael Bendis and Mike Deodato, Riri Williams is a 15-year-old engineering student who ends up being accepted at M.I.T two years earlier than other students due to her genius intellect.",
    "There, she develops a suit that's remarkably similar to Iron Man's before adopting the Ironheart mantle after she foils a prisoners' escape plan from New Mexico State Penitentiary. After hearing of her exploits, Tony Stark endorses Williams' decision to become a superhero and becomes her mentor-in-chief.",
    "With Stark dead following the events of Avengers: Endgame, though, Williams' MCU introduction will be altered slightly from her comic book origins story – and that's where Black Panther: Wakanda Forever comes into play.",
    "As a nation far more technologically advanced than the rest of the world, Wakanda seems like the perfect place for Williams to build a fully functioning Ironheart suit.",
    "The MCU has precedence for this: Tony Stark provided Peter Parker with an upgraded Spider-Man suit – compared to the home-made costume he was wearing – in Captain America: Civil War, while the webslinger craft his own suit using Stark's technology for his final showdown with Mysterio in Spider-Man: Far From Home.",
    "Black Panther 2, then, could follow a similar story trajectory. Williams could be a 15-year-old M.I.T student by the start of the movie and may be selected to spend a semester abroad if Wakanda's main players hear of her genius-style exploits.",
    "Williams might have crafted a prototype of her Ironheart suit at M.I.T, which could get Wakanda's attention in the first place. Wakanda began setting up International Outreach Centres in the US in 2018's Black Panther, so a semester abroad-style program – that would allow Williams to study in Wakanda – wouldn't be so far-fetched.",
    "Wakanda would be able to provide Williams with the necessary tools to make a proper suit and, depending on how the film's plot plays out, she might help Shuri, Okoye and company in any climactic final battle. Then, Williams could decide to return back to the US, which would set up the events of the Ironheart TV show.",
    "Sure, Black Panther 2 would have a near identical plot device to Civil War if this is how Ironheart is introduced. Still, it worked for Spider-Man and, with Iron Man no longer around, it's the most logical way of bringing the superheroine to the MCU."
  ],
  "headers": {
    "6": "Analysis: Black Panther 2 is an intelligent way to introduce Ironheart to the MCU"
  },
  "links": {
    "Black Panther 2": "https://www.techradar.com/news/black-panther-2-release-date-cast-plot-and-everything-you-need-to-know-about-wakanda-forever",
    "ComicBook.com": "https://comicbook.com/marvel/news/black-panther-riri-williams-ironheart-mcu-debut-dominique-thorne/",
    "when Marvel announced": "https://twitter.com/MarvelStudios/status/1337199696343863296"
  }
}