{
  "source": "https://www.techradar.com/news/where-to-start-modernizing-your-legacy-portfolio",
  "title": "Where to start modernizing your legacy portfolio",
  "category": "computing",
  "updated": "2021-04-27T11:00:13Z",
  "author": "michael-cote",
  "summary": "There has never been a better time to start modernizing applications",
  "article": [
    "It should come as no surprise that the COVID-19 pandemic has forced businesses to re-evaluate their relationships with technology. A recent report found the pandemic has fast-tracked many UK company’s digital transformation efforts by over five years, with 96% noting plans have drastically sped up. At first, moving at such a pace is daunting, especially with the background noise of real life unfolding.",
    "While the drivers are not welcome, the need to accelerate has forced many organizations to change how they think of and work on software. It has also made companies prioritize what software they work on, and then do it quickly. There has been no time for complete, perfect portfolio and business opportunity analysis. When you don't have urgent clarity on what needs to happen, you tend to drift from one thing to another. A recent PwC survey demonstrates the power of clarity as well. Underlying the important role that technology has played during the pandemic, the report highlights that 52% of firms are planning to cut or defer investment because of COVID-19. This drops to only 9% of businesses making cuts in digital transformation budgets. As with emerging technologies like AI, app modernization projects can’t be undertaken ‘for the sake of it’. They have to serve a business purpose and support the entire organization. For instance, a recent study found that 57% of EMEA businesses recognize the role of modernized apps in enabling employees to work remotely.",
    "Usually, when an organization's software initiatives are stuck, it's because they've yet to prioritize the right applications to work on. Modernization programs need to start with the very concept of what a business hopes to achieve, followed by assessing which applications will yield the most business value, and, then, filtered by whether the time, skills and resources are readily available to modernize those apps. You want to sort your apps by value and feasibility. Without such an approach, you’ll end up selecting applications by hunches, pet project status, and soon end up doing everything, which leads to rarely shipping anything.",
    "The importance of modernizing the application portfolio shouldn’t be understated. Research shows that 80% of EMEA app developers and tech leaders believe that without successfully modernizing applications, organizations will not be able to deliver a best-in-class customer experience. In the past year, organization's budgeting decisions have shown the value of IT as well: PwC’s recent report highlights that 52% of firms are planning to cut or defer investment because of COVID-19. This drops to only 9% of businesses making cuts in digital transformation budgets.",
    "So, what should businesses consider when embarking on their app modernization journey?",
    "Typically, there are three common app modernization transformation journeys that organizations embark on.",
    "The first is data center transformation – automating data centers and migrating to the cloud. The second is DevSecOps transformation – delivering high quality, secure and compliant code to production faster and more frequently. The third is modernizing your application architecture, often to follow practices such as microservices architectures and API-first design.",
    "Again, though, you need to keep in mind that the purpose of all this is to serve the business and, ultimately, your customers. Think again of the clarity organizations were forced to achieve in the past year and use it to select the most important projects, not just the ones that seem like they should be modernized.",
    "As we've seen, older software stacks and production environments can significantly slow down your ability to evolve your software. And, if you can't evolve your software, you'll have a hard time evolving your business. Too many organizations are held back by their \"legacy\" portfolios. A Forrester survey commissioned by VMware found that 76% of respondents say they're \"too invested in legacy apps to change.\"",
    "Navigating a vast legacy portfolio to define and plan your transformation strategy is daunting. Going down too many wrong turns will waste valuable time and resources while risking getting stuck. You want to, essentially, create a two-by-two matrix that categorizes apps by the importance to business and the technical difficulty to change the apps. This will quickly seed your decision framework on which apps to do first and how far you should transform your apps. Automated technical analysis and this pragmatic classification empower you to align your modernization within weeks, not months.",
    "Hand in hand with the modernization program for applications, should be a mindset of modernization, where the organization changes how it thinks of and uses software as a strategic tool within the business. This involves a mindshift from the old way of thinking about software to the new way of thinking about how each app supports the business. Which applications deliver the most support? Are they business critical because they're supporting revenue, or because somebody says so? Shifting the mindset during the app modernization process is essential to the speed and delivery of the project.",
    "Organizations are struggling with app modernization complexity. Understanding which apps take priority and are business critical, and therefore take priority, when starting out on this journey is essential.",
    "Being able to deliver a more scalable approach to app modernization helps to break down the task into smaller more manageable chunks. One of the key insights we've gained in the past ten years of DevOps think is that doing smaller chunks of work, more frequently, yields a higher chance of success than one big chunk. The app modernization journey is the same: start small, but deliberately so.",
    "Over time as you modernize your stack, \"legacy\" apps won't be a liability, they'll become an asset, maybe even core to your competitive advantage and success as a business. There has never been a better, more urgent time to start modernizing."
  ],
  "headers": {
    "3": "Modernizing applications",
    "5": "What transformation journey are you on?",
    "8": "Speed is of the essence",
    "10": "Making the mindset modernization",
    "11": "Final thoughts"
  },
  "links": {
    "software": "https://www.techradar.com/best/best-open-source-software",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "app": "https://www.techradar.com/best/best-iphone-apps-2021",
    "employees": "https://www.techradar.com/best/best-employee-scheduling-software",
    "customer experience": "https://www.techradar.com/best/cx-tools",
    "data": "https://www.techradar.com/best/best-data-migration-tools",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "DevOps": "https://www.techradar.com/best/best-devops-tools"
  }
}