{
  "source": "https://www.techradar.com/news/teslas-driver-safety-scoring-system-could-be-a-game-changer-for-car-insurance",
  "title": "Tesla’s driver safety scoring system could be a game-changer for car insurance",
  "category": "car-tech",
  "updated": "2021-10-13T13:23:04Z",
  "author": "axel-metz",
  "summary": "How safely do you drive, out of 100?",
  "article": [
    "Tesla CEO Elon Musk has claimed that the automaker’s driver safety testing system “will be refined continuously until it is an extremely good predictor of crash probability” – which could be a game-changer for the car insurance industry.",
    "At present, the system awards Tesla drivers a score between 0-100 that reflects how safely they operate their car over a given period, a figure which is then used to determine whether a driver qualifies for certain software updates.",
    "For instance, a recent major software update to Tesla’s Full Self-Driving Mode (FSD) – a system which allows a vehicle to maneuver around other objects and onto highway ramps without the need for driver intervention – was only distributed to around 1,000 Tesla owners “with perfect 100/100 safety scores.”",
    "Musk also suggested that “further refinements” were “definitely” coming to the company’s safety scoring system – which is still in early beta stage – in response to a tweet asking whether this would be “the same [...] system used for Tesla insurance.”",
    "In its current state, the system uses five metrics, called Safety Factors, to calculate the likelihood that a Tesla owner's driving could result in a future collision. Most drivers are expected to have a Safety Score of 80 or above, according to the company.",
    "Tesla currently only offers insurance packages to vehicle owners in California, though it plans to expand the service to Texas in October and then “aspirationally” to “most of the US” by the end of 2021.",
    "Right now, the automaker claims that its rates are “up to 30% cheaper” than the competition, though Musk’s comments suggest its fledgling safety scoring system could play a major part in determining what premiums its customers can expect to pay when the service does roll out en masse – presumably, the better a driver’s safety score, the cheaper their insurance.",
    "Of course, this isn’t an entirely new system. For years, insurance companies have fitted so-called ‘black box’ systems to vehicles as a means of monitoring driver behaviour – a method often used to promote the safety of younger drivers.",
    "But Musk seems to be suggesting that his company’s in-built safety scoring system – which, as mentioned, is currently being used as a measure of update eligibility – might double as a ‘black box’ system as Tesla’s insurance division grows.",
    "If so, the move might encourage the implementation of similar systems in vehicles produced by rival automakers in an effort to eliminate the need for insurance companies entirely.",
    "If the manufacturer of a car can offer its customers accurate insurance premiums based on the safety of their driving behaviour – or “crash probability,” as Musk puts it – why would those customers shop elsewhere for the same cover?",
    "This is, of course, all merely speculative at this point – but Musk’s comments nonetheless allude to a simpler, hassle-free and fairer future of car insurance."
  ],
  "headers": {
    "7": "A fairer system?"
  },
  "links": {
    "claimed": "https://twitter.com/elonmusk/status/1446124536978546692",
    "according": "https://www.tesla.com/support/safety-score",
    "expand the service": "https://electrek.co/2021/10/08/tesla-insurance-expands-to-texas-next-week-aspirationally-most-of-the-us-next-year/"
  }
}