{
  "source": "https://www.techradar.com/news/nokia-g300-is-the-cheapest-5g-phone-yet-with-a-big-65-inch-display",
  "title": "Nokia G300 is the cheapest 5G phone yet with a big 6.5-inch display",
  "category": "phones",
  "updated": "2021-10-14T04:06:14Z",
  "author": "david-lumb",
  "summary": "Cheap 5G, 6.5-inch display, fast speeds",
  "article": [
    "The Nokia G300 is the company’s next budget phone, and at $199 (around £145 / AU$269), it’s one of the cheapest 5G phones on the US phone market.",
    "The phone has a 6.5-inch HD Plus 20:9 ratio display, 6GB of RAM, and 64GB of storage (expandable up to 1TB of storage) – which is more than you’ll get from the 32GB that come standard on most budget phones. For rear cameras, it has a 16MP f/1.8 camera, 5MP ultrawide, and 2MP depth sensor, along with an 8MP front-facing shooter.",
    "The phone’s design isn’t too advanced, which is to be expected from a budget device, with a teardrop notch and thick chin bezel that look a bit dated. But the enlarged lock button with fingerprint sensor is a nice touch, it packs a 3.5mm jack, and the phone looks reasonably sleek.",
    "5G connectivity is the highlight of the Nokia G300, but its other specs put it competitively with other smartphones at its price tier. Our best cheap phone around the same cost is the Moto G Fast – but since it runs Android 11 out of the box, the Nokia G300 has the edge.",
    "Of course, with Android 12 just coming out, we’re eager to see which budget phones get the upgrade first. Budget phones are often the last to get updated, and the cheapest phones usually don’t get more than a single OS upgrade, so what comes in the box is nearly the extent of what they’ll ever have. But for their price, like the G300, they’re the cheapest ways to get 5G speeds."
  ],
  "headers": {
    "3": "Budget phones: now with 5G!"
  },
  "links": {
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "best cheap phone": "https://www.techradar.com/best/best-cheap-phones#section-under-200"
  }
}