{
  "source": "https://www.techradar.com/news/confusion-grows-as-oneplus-9-lite-gets-yet-another-possible-name",
  "title": "Confusion grows as OnePlus 9 'Lite' gets yet another possible name",
  "category": "phones",
  "updated": "2021-02-25T09:38:13Z",
  "author": "tom-bedford",
  "summary": "Learning your OnePlus 9a's, 9b's, 9c's.",
  "article": [
    "A tiring amount of the smartphone leak cycle involves trying to guess the names of upcoming phones - case in point, we've just heard yet another possible name for the affordable version of the OnePlus 9 that we're expecting to see soon.",
    "Well-regarded leaker Evan Blass has found code referencing the 'OnePlus 9R', as posted on his Voice channel - it's not clear where this code is from, or if this is just his creative way of sharing leaked info he obtained from other means.",
    "So now 'OnePlus 9R' joins the ever-growing list of names we've heard for this possible phone, alongside OnePlus 9 Lite, OnePlus 9E, OnePlus Lite, OnePlus 9 SE and various Nord-related names (Nord is OnePlus' line of affordable phones).",
    "This affordable OnePlus 9 model is expected to come with slightly lesser specs than its 'vanilla' counterpart, and is expected to launch alongside that handset and a OnePlus 9 Pro sometime in March or April.",
    "If you're keen to keep up with the pre-launch news on this affordable OnePlus 9 model, you might be wondering 'what should I search for?' - instead of running through the whole list of possible names, it would probably take you less time just to wait for the launch.",
    "It's worth pointing out that this confusion comes not from OnePlus, but from phone leakers, as these various names are all coming from different sources.",
    "Let's hope OnePlus chooses a logical name for this device though, as phone brands can often choose perplexing names for budget models, which can confuse those who don't keep up with phones news.",
    "OnePlus itself did this with its Nord N10 and N100 devices - if you're not au fait with the company's phones, you may as well toss a coin as guess which of those is the more premium device.",
    "So hopefully we'll see a OnePlus 9 Lite, or 9 SE at a stretch, and not the 9E or 9R, or the even-vaguer 'OnePlus Lite'. Using the same language as other phone brands will enable OnePlus to signal to potential customers where particular phones fit into its lineup.",
    "We don't have an idea of timing yet, but we're hoping to see the OnePlus 9 line launch some time in March or April, or perhaps May at a stretch - we'll have to wait until then to see what this budget phone is called, or if it actually exists at all."
  ],
  "headers": {
    "4": "What's in a name"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Voice channel": "https://www.voice.com/post/@evan/goodbye-oneplus-9eselite-1614178629-1058507976",
    "Nord N10": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "N100": "https://www.techradar.com/news/oneplus-nord-n10-5g-and-n100-announced-as-two-new-super-cheap-phones"
  }
}