{
  "source": "https://www.techradar.com/news/best-xbox-series-x-optimized-games",
  "title": "Best Xbox Series X optimized games",
  "category": "gaming",
  "updated": "2021-12-06T16:02:12Z",
  "author": "stephen-lambrechts",
  "summary": "The best next-gen enhanced games on Xbox Series X",
  "article": [
    "It's well known that the Xbox Series X's powerful hardware is capable of providing automatic improvements to a large number of titles from previous Xbox generations.",
    "That said, next-gen optimization is truly the powerhouse console's main attraction, delivering Series X-specific enhancements to the console's launch titles, along with a number of games from Microsoft's back catalog – many of which will be automatically available on the Series X via Xbox Smart Delivery, which essentially ensures you receive the best version of a game for the platform you're playing on.",
    "But which games have received Series X optimization so far? And what can you expect from the enhanced versions of these titles? Features like faster loading and 'Quick Resume' are a given, but the enhancements run far deeper than that.",
    "We've taken the liberty of testing a wide selection of Xbox Series X's available games which have already received Xbox Series X optimization so that we can provide you with a list of the best enhanced titles so far.",
    "While some of the titles listed below need to be purchased outright, there are a number of optimized games which you can already download and try for yourself right now on Xbox Games Pass Ultimate.",
    "Arguably the best racing game of the year thus far, EA and Codemasters' F1 2021 blasts off the starting line with a number of great next-gen optimization features on Xbox Series X.",
    "Players have the option of choosing between two graphical settings – both of which keep the game's beautiful presentation intact. First up is the game's Graphics mode, which delivers native 4K resolution at 60fps during gameplay. In this setting, you can expect razor sharp images which do not come at the expense of the game's silky smooth framerate.",
    "That said, if you've got a fancy new television with HDMI 2.1 and want to put it through its paces, the game also offers a Performance mode, which provides blisteringly fast 120fps gameplay at the reduced resolution of 1440p. We imagine this mode will be popular with simulation fanatics.",
    "Mass Effect Legendary Edition brings one of the most celebrated sci-fi trilogies of all-time to Xbox Series X in a newly remastered form, offering a number of visual and performance upgrades that will give fans all the reason they need to relive this magnificent space saga.",
    "All three games in the collection have received enhancements across the board, including full HDR support, improved character models, new shaders, more realistic lighting and full-resolution audio. Players have the option of selecting one of two visual modes: Favour Quality brings 60fps at 4K, while Favour Performance delivers up to 120fps at 1440p.",
    "In terms of gameplay enhancements, players get a number of quality of life upgrades, with improvements across aiming and weapons balance, general input and control, sound effects, squad behavior and more. Fans will also be pleased to hear that the generally preferred version of Femshep from Mass Effect 3 is now available to select in all three titles.",
    "While Xbox 360 versions of the Mass Effect trilogy have been available to play via backwards compatibility for quite a while, the Mass Effect Legendary Edition provides more than enough of an upgrade to make rebuying these games a no-brainer.",
    "Arriving at the tail end of the last console generation, Crash Bandicoot 4: It's About Time's beautiful graphics were hampered somewhat by a locked frame rate that maxed out at 30fps. Normally, this wouldn't be much of an issue, but since the game is question is a hard-as-nails platformer that requires quite a bit of precision, it really would benefit from a jump to 60fps.",
    "Thankfully, that's exactly what's happened with the game's latest upgrade patch, which allows it to run at twice its original frame rate on Xbox Series X and PS5 consoles. Now, six months on from its release, Crash Bandicoot 4 is able to run at an incredibly smooth 60fps without sacrificing its glorious 4K resolution – and may we just say: it's about time.",
    "Halo: The Master Chief Collection has officially receives its Xbox Series X/S upgrade, bringing with it 120fps gameplay with a maximum resolution of 4K on Series X (depending on your TV's capabilities) and 1080p on Series S. Of course, if your 4K television isn't HDMI 2.1 compliant, you may still use the 120Hz mode at a 1440p resolution.",
    "The game has also received improved draw distances and an FOV (field of view) slider. Apart from the officially optimization, Halo: The Master Chief Collection also benefits from the Series X's SSD, making load times much, much shorter, as well as the console's Auto-HDR functionality, which gives the game more vibrant colors than we saw on Xbox One X.",
    "Perhaps through some form of wizardry, developers Treyarch and Raven Software have delivered an Xbox Series X-optimized version of Call of Duty: Black Ops Cold War that truly feels like the 'next-gen' we were promised.",
    "Cold War on Xbox Series X simultaneously offers 60fps gameplay, ray tracing and a resolution that targets 4K, meaning you won't have to sacrifice any one thing to get an absolutely gorgeous and buttery smooth experience on console.",
    "Additionally, the game offers a 120Hz refresh rate in its settings (with ray tracing disabled), however, we've been unable to switch this mode on despite having access to a capable TV with variable refresh rate (VRR) support. We'll update you as soon as we find a solution.",
    "One of the most beautiful Xbox titles to date, the fantastic open-world racing game Forza Horizon 4 has received a tune-up for its Xbox Series X debut.",
    "While the Xbox One X version of the game forced players to choose between resolution and frame rate, Forza Horizon 4 now gives players the best of both worlds on Series X via Smart Delivery, offering a native 4K experience at 60fps.",
    "On top of this, Forza Horizon 4 now boasts better draw distances and higher fidelity graphics (including increased shadow, reflection, and particle effects quality), similar to what you'd get on a beastly gaming PC at ultra settings. Additionally, you also get Ferrari-fast loading times and Quick Resume functionality.",
    "As one of the biggest titles to launch alongside Xbox Series X, Assassin's Creed Valhalla feels like a true next-gen showcase.",
    "Taking full advantage of the console's power, Valhalla offers a native 4K resolution and 60fps frame rate – a first for any Assassin's Creed game on console. While ray tracing is not among the next-gen version's enhancements, the game still looks gorgeous even without the much-hyped tech.",
    "Making great use of the Xbox Series X, Dirt 5 offers next-gen optimization features which don't force you to sacrifice anything significant – regardless of whether you choose to prioritize image quality or frame rate, you will still get a full 4K/60fps experience.",
    "Despite this, the two modes offer a fairly different experience. Image Quality mode is locked at 60fps and offers a dynamic 4K resolution, allowing for more realistic shadows, puddle reflections and terrain textures, larger crowds. In other words, you get settings equivalent to a high-end gaming PC.",
    "Meanwhile, the Prioritize Framerate setting allows for 120fps at reduced quality settings when your console is set to 120Hz mode. If your TV is HDMI 2.1 compliant, this mode will still target a full 4K resolution. Otherwise, it will drop down to 1080p (so long as your television supports the 120Hz refresh rate).",
    "On Xbox Series X, Gears 5 has received a fairly significant upgrade via Smart Delivery, with the game now displaying an equivalent experience to that of the PC version running at Ultra settings.",
    "That means you get deeper shadows, higher particle counts, and increased texture resolutions. Additionally, the game now runs at 4K/60fps – a step up from the Xbox One X version's 30fps limit.",
    "Now officially available on Xbox Series X via Smart Delivery, the upgraded version of Gears Tactics is able to offer a native 4K resolution and 60fps for gameplay, along with your choice of 60fps or 30fps for cinematics.",
    "In an interview with The Verge, The Coalition's technical director Cam McRae said this was done “not for any performance reason but more for just personal taste.”",
    "Along with faster load times across the board, the upgraded Xbox Series X version of Sea of Thieves provides players with a native 4K resolution and a frame rate of 60fps – twice that of the Xbox One X version. Now that's what I call smooth sailing!!",
    "As we've noted previously, The Touryst is the dark horse of the Xbox Series X launch games lineup. Not only is the game unbelievably charming, it actually makes terrific use of the next-gen console's power.",
    "Thanks to a simple voxel-based art style, The Touryst can internally render 4K resolution visuals at 120fps per second (if your TV allows for it) or 6K resolution at 60fps.",
    "This, combined with the game's gorgeous, sun-kissed color palette and stunning HDR capability, makes The Touryst a standout title among the Xbox Series X's launch lineup.",
    "Just like The Touryst, Ori and the Will of the Wisps has received next-gen enhancements that make full use of the Xbox Series X's immense power, such as native 4K resolution at 120fps for those with HDMI 2.1 compliant TVs.",
    "Additionally, players can opt to render the game in a 6K \"supersampled\" mode, which is then displayed at 4K resolution and 60fps. It's said that the benefit of this mode is an even higher level of visual fidelity, which outshines even that of the standard 4K mode.",
    "We hope you have space on your Xbox Series X's SSD, because NBA 2K21 comes it an a whopping 101GB. Luckily, the game is able to deliver a substantial amount of extras because of that install size, and they aren't just technical enhancements.",
    "Apart from the expected 4K/60fps optimizations, NBA 2K21 offers far more convincing crowds in its new Lower Bowl presentation, including 150 AI characters adding to the realism. Expect fans interacting with each other, improved on-camera interviews with reporters, and more.",
    "Additionally, NBA 2K21 offers modes which are exclusive to the next-gen version of the game, such as an expanded WNBA experience that includes the series' first WNBA MyPLAYER career mode, as well as The City, an open-world map with multiple districts that's much, much larger than the Neighbourhods of previous titles."
  ],
  "headers": {
    "5": "F1 2021",
    "8": "Mass Effect Legendary Edition",
    "12": "Crash Bandicoot 4: It's About Time",
    "14": "Halo: The Master Chief Collection",
    "16": "Call of Duty: Black Ops Cold War",
    "19": "Forza Horizon 4",
    "22": "Assassin's Creed Valhalla",
    "24": "Dirt 5",
    "27": "Gears 5",
    "29": "Gears Tactics",
    "31": "Sea of Thieves",
    "32": "The Touryst",
    "35": "Ori and the Will of the Wisps",
    "37": "NBA 2K21"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "automatic improvements": "https://www.techradar.com/news/best-xbox-series-x-backwards-compatible-games",
    "Xbox Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "Xbox Games Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "The Verge": "https://www.theverge.com/21528481/gears-tactics-xbox-series-x-s-vs-one-pc-coalition-interview",
    "The Touryst is the dark horse of the Xbox Series X launch games lineup": "https://www.techradar.com/news/the-touryst-is-the-dark-horse-of-the-xbox-series-x-launch-games-lineup",
    "open-world map": "https://www.techradar.com/news/beyond-the-court-why-nba-2k21-on-xbox-series-x-and-ps5-has-an-open-world-city"
  }
}