{
  "source": "https://www.techradar.com/news/cisco-webex-aims-to-help-you-break-through-the-language-barrier",
  "title": "Cisco Webex aims to help you break through the language barrier",
  "category": "computing",
  "updated": "2021-03-02T18:08:29Z",
  "author": "anthony-spadafora",
  "summary": "Real-time translation is now available in preview in Cisco Webex",
  "article": [
    "Before a truly global, hybrid workforce can become a reality, language barriers first need to be eliminated which is why Cisco Webex is adding AI-powered, real-time translation to its video conferencing software.",
    "The new feature is currently in preview beginning this month and the the US technology giant has also expanded the language library of Webex from 10+ to more than 100 languages ranging from Armenian to Zulu.",
    "Users will also be able to create their own personalized Webex meeting experience by quickly and easily selecting the language of their choice from the most commonly used languages which include Arabic, Dutch, French, German, Japanese, Korean, Mandarin, Russian and Spanish. However, there is also support for localized languages such as Danish, Hindi, Malay, Turkish and Vietnamese.",
    "The personalized language experience in Cisco Webex will allow businesses worldwide to overcome the language barrier which can often be one of the major hurdles when operating on a global scale.",
    "For businesses there's also a talent and cost benefit of this new feature as it enables them to focus on finding the best talent for the job regardless of wherever they call home or their native language.",
    "According to a recent report from Mertigy on intelligent virtual assistants, nearly 24 percent of participants have meetings that include non-English native speakers and of these, more than half have been using third-party services to translate meetings into other languages which leads to an average additional cost of $172 per meeting.",
    "SVP and GM of security and applications at Cisco, Jeetu Patel explained in a press release how Webex's latest feature can help lead to a more inclusive future, saying:",
    "\"The inclusive features of Webex help create a level playing field for users regardless of factors like language or geography. Enabling global Real-Time Translations is another step toward powering an Inclusive Future, and an important component of driving better communication and collaboration across teams. AI technologies play an integral role in delivering the seamless collaboration, smart hybrid work and intelligent customer experiences that Cisco is known to deliver.”"
  ],
  "headers": {
    "3": "New languages, new opportunities"
  },
  "links": {
    "Cisco Webex": "https://www.techradar.com/reviews/cisco-webex-meetings",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "language barrier": "https://www.techradar.com/news/brother-adds-document-translation-to-its-devices",
    "report from Mertigy": "https://www.cisco.com/c/dam/en/us/solutions/collateral/collaboration/the-benefit-of-intelligent-virtual-assistants.pdf?ccid=",
    "virtual assistants": "https://www.techradar.com/best/virtual-assistant-services",
    "press release": "https://newsroom.cisco.com/press-release-content?type=webcontent&articleId=2145444"
  }
}