{
  "source": "https://www.techradar.com/news/the-hundred-2021-live-stream-how-to-watch-online-free-options-format-explained",
  "title": "The Hundred 2021 live stream: how to watch online, free options, format explained",
  "category": "computing",
  "updated": "2021-07-21T16:25:52.557Z",
  "author": "aatif-sulleyman",
  "summary": "100-ball format promises to be compelling and controversial",
  "article": [
    "Cricket ushers in a brave new era with the inaugural edition of The Hundred, a rapid-fire 100-ball cricket tournament dreamed up by the ECB to inject fresh life into the sport. It's a potential landmark moment in the long history of the bat-and-ball game, so read on to discover how to watch a 2021 The Hundred live stream no matter where in the world you are - including ways to see it absolutely FREE.",
    "Traditionalists are dead set against it, arguing that T20 cricket is short-form enough, though it's hard to imagine The Hundred being anything other than utterly gripping, with games expected to run to around two and a half hours, teams being restricted to a single innings each.",
    "The Hundred's eight newly formed city-based teams will face off in a round-robin format, each team playing everyone else once - though local rivals will face off twice.",
    "After 32 games, the team at the top of the standings will qualify for the final, while second and third will battle it out in an eliminator, with the winner going on to face them in the grand finale.",
    "It's going to be intriguing to see England stars Ben Stokes, Eoin Morgan and Moeen Ali tangle with each other, and here's how you can live stream The Hundred 2021 cricket action from wherever you are in the world.",
    "All times BST. One additional game TBC.",
    "Wednesday, July 21 2021",
    "Thursday, July 22 2021",
    "Saturday, July 24 2021",
    "Sundayday, July 25 2021",
    "Saturday, July 31 2021",
    "Sunday, August 1 2021",
    "Tuesday, August 10 2021",
    "Wednesday, August 11 2021",
    "Saturday, August 14 2021",
    "Sunday, August 15 2021",
    "Tuesday, August 17 2021",
    "Friday, August 20 2021",
    "Saturday, August 21 2021",
    "If you're abroad during The Hundred, you'll likely find you're unable to access your domestic cricket coverage like you would at home. This isn't necessarily cause for alarm, but rather the result of geo-blocking - best understood as digital borders that restrict certain services and content to certain parts of the world.",
    "Fortunately, there's a convenient way around this in the form of a VPN. This is a nifty bit of software that lets you swerve around these digital borders, thereby allowing you to globe trot and still access your preferred The Hundred live stream. It's a very affordable workaround and super easy to use - allow us to explain more.",
    "Use a VPN to watch a 2021 The Hundred live stream from anywhere",
    "Using a VPN is as easy as one-two-three...",
    "1. Download and install a VPN - as we say, our top choice is ExpressVPN",
    "2. Connect to the appropriate server location - open the VPN app, hit 'choose location' and select the appropriate location",
    "3. Go to the broadcaster's live stream - so if you're from the UK, just head to BBC iPlayer or Sky Go",
    "Thee Hundred comprises eight teams of 15 players, with overseas participation capped at three players per team.",
    "Each team has both a women's and a men's side, who play double-headers at the same venue on each match-day.",
    "The Hundred teams are as follows:",
    "Each of the eight teams has their own ground, and will play four home matches and four away matches. The Hundred venues are as follows:",
    "Both the men's and the women's Eliminator games eill be played at The Oval, and both Finals will be played at Lord's.",
    "The Hundred takes its name from the 100-ball format it uses, where each team gets a single innings, restricted to a maximum of 100 balls, to score as many runs as they can.",
    "Each bowler gets to deliver a maximum of 20 balls per game, and the bowling team is entitled to a strategic timeout of up to two and a half minutes.",
    "It feels a little stange having a favourite for an entirely new format, but Southern Brave are being hotly tipped, despite lingering injury concerns around main man Jofra Archer.",
    "That's largely becuase they're being coached by Mahela Jayawardene, who led the Mumbai Indians to three IPL titles in four years.",
    "The Hundred will witness some T20 starts from all over the globe. Among a few notable T20 stars, here are some to watch out for: Joe Root, Ben Stokes, Rashid Khan, Quinton de Kock, Faf du Plessis, Sunil Narine, Adam Milne, Sarah Taylor, Amy Jones, Kate Cross, Imran Tahir, Eoin Morgan, Moeen Ali and Jonny Bairstow.",
    "To buy tickets for a match, you need to create an account on The Hundred website, which requires basic personal details like your name, date of birth, email address and post code.",
    "Once that's done, it's as simple as finding the game you'd like to attend and hoping that tickets are still available.",
    "Attendees are also required to complete a Covid declaration at least 24 hours before the match."
  ],
  "headers": {
    "5": "2021 The Hundred fixtures on the BBC",
    "19": "How to watch a cricket live stream from outside your country",
    "26": "Who are The Hundred teams?",
    "29": "Where are The Hundred 2021 venues?",
    "31": "How does The Hundred cricket work?",
    "33": "Who are the favorites for The Hundred 2021?",
    "35": "The Hundred 2021: players to watch out for",
    "36": "How can I buy The Hundred tickets?"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "head to BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "The Hundred website": "https://accounts.thehundred.com/#/registration"
  }
}