{
  "source": "https://www.techradar.com/news/save-up-to-dollar-150-with-these-record-breaking-ipad-pro-deals",
  "title": "Save up to $150 with these record breaking iPad Pro deals",
  "category": "tablets",
  "updated": "2021-04-29T14:00:35Z",
  "author": "tabitha-baker",
  "summary": "Record low prices on WiFi and Cellular iPad deals",
  "article": [
    "iPad Pro deals are slashing their prices this week, with a range of discounts at Amazon all offering record savings on the luxury tablets. These offers started out by slipping just below the previous lowest price, however since then we've seen them plummet to some fantastic positions. You'll want to move fast, though, we don't know how long these iPad deals will hold out.",
    "The cheapest iPad deal available this week is the 11-inch, 128GB iPad Pro at $699.94 (was $799). Previously we'd only seen this device drop down to $729 so you're getting a stunning discount here, even if it was $20 cheaper over the weekend.",
    "However, many of these iPad Pro deals have never been cheaper, and we're seeing larger configurations sitting at record low prices right now. You'll find the 256GB 11-inch model available for $769 (was $899) and the 12.9-inch sitting at just $999 (was $1,099).",
    "However, if you're looking for extra connectivity wherever you are there are plenty of cellular iPad Pro deals seeing their cheapest prices yet as well. The 11-inch model now starts at just $849 (was $949), or you can upgrade to 12.9-inches for $1,079.99 (was $1,149). These prices are changing all the time, though, so move fast to grab these offers.",
    "We're rounding up all these iPad Pro deals just below, with a wide range of discounts across the full spectrum of configurations.",
    "Not in the US? Scroll down for more cheap iPad deals in your region.",
    "The iPad Pro 2021 will launch for pre-order on April 30, with shipping beginning in mid-May. That means the 2020 iPad Pro will soon be off the shelves, which is why we're seeing such low prices this week. However, whether or not you should wait for the new model instead of grabbing these cheap iPad Pro deals largely depends on how you will use your device and which version you are buying.",
    "With a blindingly fast M1 chip at the helm (Apple suggests it will offer a 50% jump in performance over 2020's offerings), as well as a redesigned display and 5GB LTE capabilities, there's certainly plenty of tech under the hood to lure you to the shiny new range.",
    "Plus, the new 11-inch iPads start out at the same prices as we've seen with the previous generation. You'll find the 128GB model available for $799, 256GB for $899 and 512GB for $1,099. However, as we move up the price bracket these tablets do diverge from the 2020 version's price.",
    "The larger 12.9-inch iPad Pro and the bigger storage configurations have seen price increases from between $100 and $300. That means those shopping in this higher-end category, but who don't feel like they need the extra power for better gaming features and a sharper screen can save themselves some serious cash by going with these cheaper offers.",
    "However, if you are browsing in the lower end there's plenty more value in the upcoming releases. You'll be spending a little more than these discounted prices, but if you're going to be using your new iPad for heavy duty apps and more professional pursuits we'd recommend holding off. However, it should be noted we might not see iPad deals like these on the newer generation for some time.",
    "We're rounding up plenty more cheap tablet deals right here, but you can check out all the latest Samsung tablet prices for a look at the competition, or the latest Surface Pro 7 deals for something that can run Windows."
  ],
  "headers": {
    "6": "Should you wait for the new 2021 iPad Pro?",
    "11": "More iPad deals"
  },
  "links": {
    "$699.94 (was $799)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-iPad-11-inch-Wi-Fi-128GB%2Fdp%2FB08631S3BP%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1177942061298702800-20",
    "$769": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0863358NV%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2692285425197452000-20",
    "(was $899)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0863358NV%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9879729495597566000-20",
    "$999 (was $1,099)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08628L463%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1332296847429176800-20",
    "$849 (was $949)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-iPad-11-inch-Wi-Fi-128GB%2Fdp%2FB0863BW6YD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3007808994931206000-20",
    "for $1,079.99 (was $1,149)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08636SCMX%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1314615574364796000-20",
    "cheap iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "cheap tablet deals": "https://www.techradar.com/deals/the-best-cheap-android-tablet-deals",
    "Samsung tablet prices": "https://www.techradar.com/news/mobile-computing/tablets/samsung-galaxy-tab-deals-1295910",
    "Surface Pro 7 deals": "https://www.techradar.com/deals/surface-pro-deals-bundles"
  }
}