{
  "source": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
  "title": "The Elder Scrolls 6 trailer, news and rumors",
  "category": "gaming",
  "updated": "2021-12-01T18:28:20Z",
  "author": "gerald-lynch",
  "summary": "Everything we know so far about The Elder Scrolls 6",
  "article": [
    "The Elder Scrolls 6 is in development and it will be released. Exactly when that release date will be, though, is the question on everyone's lips.",
    "Since the game's initial reveal back in 2018, things have been pretty quiet as far as official news is concerned. This is partly down to the prioritisation of sci-fi RPG epic, Starfield, which is due out on November 11, 2022 on PC and Xbox as a console exclusive. We’re really only just beginning to learn more about Starfield while The Elder Scrolls 6 is still mostly a mystery so it's looking like we'll still have a while to wait before we learn about our next adventure in Tamriel in any great detail.",
    "With the tenth anniversary of The Elder Scrolls 5: Skyrim in the rearview mirror, it’s safe to say that fans are hungry for news about where the series will go next. It’s actually looking increasingly likely that one place it won’t go is PS5. After Microsoft’s acquisition of Bethesda, fans have wondered whether or not The Elder Scrolls 6 will be an Xbox exclusive and recent comments have us thinking that will be the case.",
    "There’s still a bunch we have to learn about The Elder Scrolls 6 but we've scoured the web to find the latest news and rumors about the game and collected everything here in this handy guide so that you can stay up to date. We'll be updating regularly as news comes in so make sure you keep checking back.",
    "Don't hold your breath for The Elder Scrolls 6 release date – you won't be exploring its dungeons any time soon.",
    "Despite being announced at Bethesda's E3 2018 conference, little more than a logo was revealed. We don't even have a subtitle or a release year. Todd Howard said that the game will be coming after Starfield, the company's next big IP, while Xbox Head Phil Spencer has said it won't release until after Fable 4. Given Starfield isn't releasing until November 2022, and Fable doesn't even have a release date yet, the wait for Elder Scrolls 6 is set to be a very long one.",
    "Bethesda Games Studios director Todd Howard supported this in a 2021 interview with The Telegraph, stating: \"It’s good to think of The Elder Scrolls 6 as still being in a design [phase]… but we’re checking the tech: 'Is this going to handle the things we want to do in that game?' Every game will have some new suites of technology so Elder Scrolls 6 will have some additions on to Creation Engine 2 that that game is going to require.\"",
    "As such, tentatively expect The Elder Scrolls 6 to release in 2024 at the earliest, after Bethesda has given Starfield at least a couple of years in the spotlight.",
    "The only footage we have of Elder Scrolls 6 is a very short clip of the game's logo. Other than that, you might be waiting a while to see more.",
    "Here's the announcement trailer:",
    "Bethesda wants to take its time to get it right",
    "The Elder Scrolls 6 is probably still a few years away yet but that’s not because Bethesda is deliberately dragging its heels. In an interview with IGN, when discussing the gap between Skyrim and its follow up, Howard said “Would you plan to have the kind of gap we're having between Skyrim and the follow-up? I can't say that's a good thing. Do I wish I could wave a wand and the game we wanted to make [...] just came out? Absolutely.”",
    "According to Howard, however, the time felt right for Bethesda to try something new with Starfield and the Elder Scrolls Online meant that the Elder Scrolls franchise was in a relatively good place.",
    "“That being said,” he added, “everything takes longer than we would like as well, but we want to make sure that we get it right. Hopefully Elder Scrolls 6, you don’t want to say hey, that it’s worth that kind of wait, but that it does stand up to the series as it has been in a really big, impactful way for when it comes out.”",
    "Xbox exclusivity wouldn't be about \"punishing\" PS5 players, says Xbox boss",
    "While The Elder Scrolls 6's console exclusivity still hasn't been confirmed, Xbox boss Phil Spencer mentioned in an interview with GQ that if the game were to be exclusive, it wouldn't be to punish fans looking to play on PS5.",
    "\"It’s not about punishing any other platform, like I fundamentally believe all of the platforms can continue to grow,\" said Spencer. \"But in order to be on Xbox, I want us to be able to bring the full complete package of what we have. And that would be true when I think about Elder Scrolls 6. That would be true when I think about any of our franchises.\"",
    "Todd Howard wants The Elder Scrolls 6 to be a \"decade game\"",
    "In the same interview with GQ, linked above, Bethesda game director Todd Howard spoke on following up the legacy of Skyrim, which has enjoyed a decade of re-releases, upgrades and no shortage of fan-created mods on both PC and consoles.",
    "Seemingly thinking ahead about The Elder Scrolls 6's longevity, Howard said: \"I think that would drive me crazy to try to say, 'Okay, this is the thing you have to top,'\" in reference to Skyrim. \"But then you realise, like, The Elder Scrolls 6 has got to be a 'decade game.' How do you make a game where you go into it, like, 'people have to play it for a decade?'\"",
    "The adage of \"if you build it, they will come\" has almost always applied to The Elder Scrolls franchise, at least since the series exploded in popularity with the release of the third entry, Morrowind. To this day, fans are still creating mods and total conversions for Morrowind, Oblivion and Skyrim, so we think Howard shouldn't be all that concerned with how to make the next entry a 'decade game,' as it will likely naturally become that through the modding scene, as well as with official support from Bethesda.",
    "Reportedly an Xbox exclusive like Starfield",
    "Starfield has been confirmed as an Xbox exclusive but for many question marks still remain around The Elder Scrolls 6 as nothing has been explicitly confirmed by Bethesda or Microsoft just yet. Well, according to GamesBeat reporter Jeff Grubb, The Elder Scrolls 6 is also “planned” as an Xbox exclusive. Grubb tweeted this in response to a user who suggested that Starfield and other Bethesda games could still have a chance of a PS5 release:",
    "\"Very different\" to Avowed Upcoming Xbox exclusive Avowed has drawn some comparisons with the Elder Scrolls series in terms of its appearance but Phil Spencer has said there are “distinct differences” between the games.",
    "When asked on a recent IGN podcast if Avowed will play an Elder Scrolls role for Xbox, given the Elder Scrolls 6 is quite a while off yet, Spencer responded, “I think the games are very different, so maybe I struggle a little bit to say that's our version of this, just knowing what [Obsidian studio head Feargus Urquhart] and the team are going off to do. But when I think about our lineup, and I think about that more core fantasy RPG setting, I think Avowed is gonna be an awesome entrance there.”",
    "You’ll play Fable 4 first Speaking during a recent IGN podcast, Phil Spencer intimated that we’ll probably play the next Fable game before we play Elder Scrolls 6. Speaking about the tone of Fable, Spencer said, “Fable’s always been a little more light-hearted and a little more British, I think I could say, and I think Playground will keep it there,” adding, “Elder Scrolls 6 is further out, and when that comes out I think it's going to be incredible.”",
    "Still in the early stages We could still be waiting quite a while before we get the chance to play Elder Scrolls 6, as Bethesda Games Studios director, Todd Howard, has confirmed that the next chapter in the open-world fantasy saga is still in the early stages of development.",
    "Howard told the Telegraph that: “It’s good to think of The Elder Scrolls 6 as still being in a design [phase]… but we’re checking the tech: 'Is this going to handle the things we want to do in that game?' Every game will have some new suites of technology so Elder Scrolls 6 will have some additions on to Creation Engine 2 that that game is going to require.”",
    "If we take Howard at face value, it seems unlikely that we’ll see Elder Scrolls 6 any time soon, with the game still being in the conceptual stages, and the team at Bethesda Game Studios still getting to grips with the new Creation Engine 2.",
    "E3 2021 no-show E3 2021 was a blast, and went with the Microsoft/Xbox show being one of the event's highlights.",
    "But sadly, it didn't bring with it any new news on The Elder Scrolls 6, apart from the fact that it was still in development. Instead, Bethesda's main focus during the show was on revealing in-engine footage of the alluring Starfield. We'll have to wait a bit longer to find out more on that key franchise then.",
    "The Elder Scrolls 6 may not come to PS5 Xbox boss Phil Spencer has confirmed that future Bethesda games will be exclusive to \"platforms where Game Pass exists\", meaning PS5 players will miss out.",
    "During the \"Bethesda Joins Xbox\" roundtable on March 11, Spencer addressed speculation around whether the acquisition will see future Bethesda titles, such as Starfield and The Elder Scrolls 6, becoming Xbox exclusives following Microsoft's acquisition of ZeniMax Media.",
    "\"If you’re an Xbox customer, the thing I want you to know is that this is about delivering great exclusive games for you that ship on platforms where Game Pass exists,\" Spencer explained. \"That’s our goal, that’s why we’re doing this, that’s the root of this partnership that we’re building.",
    "However, games under contractual obligations from before the acquisition, such as Deathloop, will still land on PS5 – while games that currently exist on other platforms will continue to be supported.",
    "\"Obviously I can’t sit here and say every Bethesda game is exclusive, because we know that’s not true,\" Spencer said. \"There are contractual obligations that we’re going to see through, as we always do in every one of these instances. We have games that exist on other platforms, and we’re gonna go support those games on the platforms they’re on. There are communities of players and we love those communities and we’ll continue to invest in them. And even in the future, there might be things that have contractual things or legacy on different platforms that we’ll go do.\"",
    "Though it's worth noting that The Elder Scrolls 6 may not fall under this Xbox Game Pass exclusivity umbrella if Sony has already secured the games on its platform, it is entirely possible that a big hitter like this will only be available on Xbox and PC – for a time, at least – especially given platforms haven't been confirmed for either yet. That's certainly the case with Starfield, now a confirmed Xbox-only exclusive.",
    "Leaked footage seems likely fake A video claiming to be early test footage from The Elder Scrolls 6 has appeared online but its authenticity is suspect. Posted to Reddit (via GamesRadar) , the footage is extremely short (a grand total of 10 seconds) and only gives a first-person view of a figure running across grass and past rocks.",
    "There’s very little to indicate that the footage is the genuine article and there’s also very little to the footage full stop, even if it was the real thing. It seems to us that, as much as we wish we were getting a look at The Elder Scrolls 6 in action, the safest thing to do is take this with a pinch of salt and assume it’s fake.",
    "An Xbox Game Pass day one title According to Todd Howard, Xbox Game Pass subscribers will get access to The Elder Scrolls 6 from day one as part of their subscription .",
    "New Indiana Jones game won't delay Elder Scrolls 6 development Bethesda has recently announced that it’s working with MachineGames on a new Indiana Jones game, with Bethesda Game Studios director Todd Howard taking on an executive producer role for the game.",
    "Those worried, however, that this additional work might have an impact on The Elder Scrolls 6, on which he’s also working, need not fret.",
    "Responding to a tweet about Todd Howard’s involvement in multiple projects, Bethesda’s Pete Hines said “Todd is currently EP on many BGS and other projects, such as the Fallout TV show. His main focus remains directing the upcoming Starfield and TES6 games, which aren’t affected by today’s news.”",
    "Is it Hammerfell? 2021 looks set to be a better year for Elder Scrolls 6 news than 2020 after the official Elder Scrolls account tweeted something that may or may not be a tease for The Elder Scrolls 6. The tweet, which reads “Transcribe the past and map the future. Here’s to a Happy New Year!”, includes a picture of a map with three lights on it.",
    "The lights are placed on different areas of Tamriel, with one on a box above the map, another on Skyrim and another, interestingly, on an unmapped area below Skyrim: Hammerfell. It’s long been rumored that The Elder Scrolls 6 will be set in Hammerfell, home of the Redguard, but nothing has actually been confirmed yet. Naturally, many fans are taking this image as a hint that the rumors about the setting are true.",
    "Another point of interest, picked up on by PCGamer, is the date on the map: 4E 182. This is actually only a few years before the events of Skyrim in around 4E 201 and hints that the 5th and 6th games in the series could be closely connected.",
    "We can’t know for sure that any of this is accurate or even related to Elder Scrolls 6 (and not Elder Scrolls Online) until official word comes from Bethesda but given the phrase “map the future” and the fact that Hammerfell on the map in the photo is yet to be mapped and explored, this is certainly a very leading Tweet.",
    "Even PlayStation isn’t sure about The Elder Scrolls' PS5 future Last we heard, PlayStation boss Jim Ryan said that even he’s still unsure whether The Elder Scrolls 6 will come to PS5, following Microsoft’s acquisition of the publisher’s parent company ZeniMax.",
    "In an interview with Russian publication TASS (via GamesRadar) in November 2020, Ryan said that it’s still uncertain as to whether The Elder Scrolls 6 will come to PlayStation or whether it’ll be a Microsoft exclusive.",
    "“That’s a decision that is out of our hands,” Ryan said. “We’ll wait and see what happens. I look forward to learning about that.”",
    "Ryan also explained that Sony approaches things differently to Microsoft when it comes to making studio acquisitions.",
    "“We just take a different approach,” Ryan said. “Our emphasis has been to focus on really steady, slow, but constant organic growth of our studios, selectively bolstered by acquisitions. We respect the steps taken by our competition, they seem logical and sensible. But we’re equally happy and confident, we’ve got a better launch lineup than we’ve ever had at any of our console launches.”",
    "It appears, then, that the ball is in Microsoft’s court when it comes to The Elder Scrolls 6's release. At the very least, Todd Howard has said in an interview with Gamesindustry.biz that he finds it “hard to imagine” a title like The Elder Scrolls 6 not coming to multiple platforms. Though he also made it clear that, at the time, these kinds of decisions had not been made just yet.",
    "The Elder Scrolls 6 will use a brand new engine Bethesda has confirmed it is overhauling its current engine specifically for Elder Scrolls 6.",
    "Imagine if Elder Scrolls 6 looked and ran like Skyrim. This is a thought which belongs somewhere firmly shut behind the Gates of Oblivion.",
    "According to GamesRadar, the engine reportedly has the same name, but it will bring new renders, lighting, animations (hallelujah), landscape system and photogrammetry.",
    "Todd Howard spoke about the engine after the announcement of the Microsoft merger, saying \"it's led to our largest engine overhaul since Oblivion, with all new technologies powering our first new IP in 25 years, Starfield, as well as The Elder Scrolls 6.\"",
    "Speaking at the Develop: Brighton conference, Howard gave more information on the overhauled Creation Engine, saying that it’s been “a significant overhaul,” adding that “It’s taken us longer than we would have liked, but it’s going to power everything we’re doing with Starfield and Elder Scrolls 6. When people see the results, they’ll hopefully be as happy as we are with what’s on the screen and also how we can go about making our games.”",
    "The Elder Scrolls 6 will be coming after Starfield Starfield will be Bethesda's next big release in November 2022 and we won't be able to play The Elder Scrolls 6 until after that.",
    "Todd Howard explained in 2019 that Bethesda is “still hard at work” on both The Elder Scrolls 6 and Starfield. He said that “Starfield is playable, Elder Scrolls VI not in that way yet.”",
    "The prime focus for Bethesda is Starfield. In an interview with Bethesda Game Studios, executive producer Tom Howard spoke to IGN, who warned \"I think everyone should be very patient.\"",
    "\"The gap in between [Elder Scrolls games] is going to be long, It already is,\" continued Howard.",
    "Job listings Some job listings for Bethesda Game Studios have led to rumors that work on Starfield could be wrapping up and that The Elder Scrolls 6 could be heading into full production soon. As of October 23, 2020, it seems like the position is still taking applicants.",
    "First spotted by a Reddit user, a job listing for Gameplay Programmers at the studio calls for \"talented programmers to join our team that is pushing the bleeding-edge of RPG development for the PC and consoles\". As part of the team, they'll \"Collaborate on the implementation of new gameplay features: player and characters’ behaviors, combat and powers mechanics, user interface, etc.\"",
    "While there's no mention of The Elder Scrolls in this listing, it does seem to be a recruitment call for something in its early stages, rather than a project that's been underway for a while like Starfield.",
    "Adding fuel to the fire, there's also a listing for a Video Editor on the Bethesda site which some have taken as a sign that work on Starfield is in its final stages and that the developer will soon be looking to create video marketing material such as trailers.",
    "Skyrim Grandma We already know that Skyrim Grandma, also known as Shirley Curry, will be coming to The Elder Scrolls 6 as an NPC. But it looks like she'll be brought into The Elder Scrolls V, her namesake game, first thanks to a new mod. The mod, due early this year, will make Shirley a follower in Skyrim with unique commentary and interactions and the plan is that down the line she'll have her very own quest. It'll even have Shirley's voice as she worked with the creators of the mod. You can get a look at the mod itself in its teaser trailer. The creators are aiming for an Xbox release for both the classic and special editions of Skyrim.",
    "The Redfall trademark dispute has been resolved - and explained ZeniMax Media's dispute with Bookbreeze over the trademark of Redfall has now been resolved. Bethesda's parent company had attempted to trademark the name back in 2018 leading fans to believe that The Elder Scrolls 6 could finally have a name. Redfall is also, however, the name of a science fiction series published by Bookbreeze so the claim was naturally contested in February 2019.",
    "However, we now know that Bethesda was hunting the trademark not for Elder Scrolls 6 purposes, but instead as the title for Arkane Studio's upcoming vampire-themed team shooter.",
    "The resolution is reported (via Gamasutra) as being amicable and \"mutually beneficial\" for both parties but it remains confidential.",
    "Photogrammetry technology will be used In that 25th anniversary panel which dashed the E3 dreams of so many, Bethesda did at the very least give fans a glimpse of some of the technology that will be used in the development of The Elder Scrolls 6. We got a peek at the use of photogrammetry which involves scanning real-life objects and environments to bring them into the game in detailed 3D. The technology will make its first outing in Starfield before the latest iteration is used for Elder Scrolls.",
    "Elder Scrolls 6 goes official Bethesda is a busy studio: not only is it working on Starfield, it's also continuing to develop for Elder Scrolls Online and it's taking on the long commitment of Fallout 76. And that's only in its main RPG franchises. It's still got plenty going on elsewhere with mobile games, Dishonored, Prey and others.",
    "Thanks to Todd Howard, we know Bethesda is working on two huge new titles simultaneously, though their developments are staggered.",
    "Having returned to Skyrim after some time away, Howard compared it to seeing an old friend from high school, adding that the time away had given him the chance to see Skyrim as a gamer for the first time.",
    "This, to us, would be the perfect time to start applying this new perspective to the next title in the series.",
    "At the very least we can say we know it won’t just be called Elder Scrolls 6. There’s going to be a colon and another word to round the title off if previous releases are anything to go by.",
    "We’re willing to bet that like all the other games in the series The Elder Scrolls 6 is going to be set in the continent of Tamriel, the map of which is above.",
    "Previous games have taken us to High Rock, Hammerfell, Morrowind, Cyrodil, and Skyrim. Valenwood, Elsweyr and Black Marsh are the biggest places left to explore. However, even though these areas are prime spots for exploration, that's not to say that Bethesda won't return to areas from previous games.",
    "Rumors online have previously heavily pointed towards Black Marsh, the home of the world’s reptilian Argonian race but there wasn't actually any solid reason for this rumor. Black Marsh's swampy marshlands and network of islands would make for an interesting geographic change for the series, though it’s a geography that would leave itself open to comparison with the Witcher 3. It’s probably the region of Tamriel that we know the least about so Bethesda would have plenty of room to be creative.",
    "That said, if we're just going by where might be interesting to explore, Elsweyr would also be a candidate with its dry plains and harsh badlands that the Khajit call home.",
    "It would certainly be nice to find out more about the culture of either the Khajit or the Argonians so both of these extremely different settings have an understandable appeal to fans.",
    "There was also a strong rumor that the Elder Scrolls 6 could be set in Valenwood, the home of the Bosmer and it’s an area of Tamriel that Bethesda hasn’t explored much.",
    "The rumor that the game will be set here is based on a reported internal Bethesda memo from all the way back in 2014. In this memo, Bethesda employees were reportedly warned against using the terms Fallout: Nuka World, Elder Scrolls VI or Project Greenheart.",
    "Though it was initially believed to be a fake, Fallout: Nuka World ended up being a big DLC release for Fallout 4 which gave slightly more weight to rumor that Project Greenheart is in fact the codename for the next Elder Scrolls title. The fact that Greenheart is a city in the verdant region of Valenwood made this even more interesting.",
    "However, after the brief announcement trailer for Elder Scrolls 6 was released during E3 2018, many fans began to move away from the idea of a Valenwood setting as the landscape shown in the trailer didn't reflect Valenwood all that much.",
    "It's hard to tell from the short E3 clip we have of the game but since it was shown general opinion has started to move towards the idea that the Elder Scrolls 6 will be set in either Hammerfell or High Rock.",
    "Adding credence to the Hammerfell rumor is a post from the official Elder Scrolls Twitter account at the end of 2020 which says \"transcribe the past and map the future\" and shows an image with an unmapped Hammerfell region. There is, however, a chance that this teaser doesn't relate to Elder Scrolls 6 at all.",
    "In an interview with Eurogamer, Todd Howard confirmed the team has settled on the location - but he won't tell us where yet.",
    "Details are, of course, exceptionally sparse at the moment. All we have are rumors to go off of, which doesn't form the basis of, well, anything really.",
    "Obviously, those of us who know the world of Tamriel thanks to Morrowind, Oblivion, Skyrim and yes, even Elder Scrolls Online, the entire world is a veritable expanse of different lands and settings where the game could be set.",
    "We do know one thing for certain; wherever it does end up being set, we can expect to be fulfilling a great many side quests.",
    "Homebuilding A feature that we’re fairly certain will be included in the game to some degree is house building or town creation. Skyrim introduced the idea of designing and maintaining a homestead with its Hearthfire DLC, which Fallout 4 expanded upon with the introduction of its settlement mechanic and the Elder Scrolls online built upon again with its Homestead DLC. This leads neatly into a further expansion of such features in the next Elder Scrolls title as it felt not-quite-finished in Fallout.",
    "It would be a feature that would actually fit in particularly well with the rumored Valenwood setting, if it involved the player adapting to the wilderness in the way the resident Bosmer have with their treetop cities. In a similar way the player used debris and junk to craft their settlement in Fallout, they could use their natural environment to do so in Elder Scrolls in a nice contrast.",
    "A whole new story In an interview with Gamespot, Todd Howard said that Bethesda is looking into how exactly it tells stories in its games.",
    "Howard noted that Skyrim and Fallout 4 take slightly different approaches to stories, with Skyrim leaving things more open to the player’s vision and Fallout guiding them more firmly through a story",
    "Now he says the studio is looking at how to “tell a better story in an open world.” He said “each of our games we've had successes and failures and if you ask us internally, we have new ideas that we want to explore in the future because we feel like we haven't really cracked it yet the way we think it could be.”",
    "Being aware of the differences between Skyrim and Fallout’s approaches to storytelling and the fact that both have positives and negatives suggests that the next Elder Scrolls title could strike some kind of balance between giving the player completely free reign and telling a story around their character.",
    "It’s hard to deny that The Witcher 3 has had a massive impact on what players expect in terms of including an engaging story in an open-world game.",
    "Though we don’t in any way want Bethesda to just churn out a Witcher copy (we’re not sure it’d be possible anyway) it does put a certain amount of pressure on Bethesda when it comes to achieving high-quality environmental and quest-based storytelling.",
    "No multiplayer Something we don’t expect to see, though, is multiplayer. Skyrim certainly doesn’t suffer from a lack of multiplayer and it wouldn’t really make all that much sense to incorporate any online multiplayer gameplay with the Elder Scrolls Online still rolling along.",
    "Virtual reality It's not a certainty by any means but the fact that Bethesda released a full VR experience for Skyrim means it's not out of the question down the line if not immediately.",
    "Improved graphics and reduced bugginess The remastered version of Skyrim showed just how far things have come visually since the game’s first release so we fully expect any title following on from it to be of that standard if not much higher, depending on how far away the game is.",
    "We know that the new engine will be used, thankfully, giving Bethesda's games a much-needed boost in its delivery.",
    "More fluid combat - taking advantage of new consoles Everyone knows and loves the animations delivered from Oblivion, Skyrim and Fallout, but seeing them on an Xbox Series X or PS5 or high-end PCs would be nothing short of embarrassing. To this end, we expect to see a far more fluid combat experience and, considering how powerful the new consoles are purporting to be, a richly detailed open world to explore.",
    "Replayability During an interview with IGN Howard gave a small update on what people can expect from the game.",
    "He said: \"I think when they eventually see the game and what we have in mind, they'll understand the gap more in terms of technology and what we want it to do... We're eight years post-Skyrim. It lets us know going into Elder Scrolls 6 that this is a game we need to design for people to play for a decade at least.\"",
    "From this, we know that Elder Scrolls 6 is being developed with longevity in mind. Of course, games like Skyrim and Oblivion are kept alive to this day purely by fans who make mods or those who simply can't get enough of it.",
    "If this means there's more emphasis on replayability with branching and far-reaching consequences from certain decisions remains to be seen, but this could be one of the ways to keep the game interesting overtime."
  ],
  "headers": {
    "4": "The Elder Scrolls 6: everything you need to know"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "only just": "https://www.techradar.com/news/starfields-newest-video-introduces-the-games-setting-and-its-backstory",
    "tenth anniversary of The Elder Scrolls 5: Skyrim": "https://www.techradar.com/news/skyrim-is-about-to-get-its-fourth-re-release-since-launching-10-years-ago",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "recent comments": "https://www.techradar.com/news/elder-scrolls-6-exclusivity-wouldnt-be-about-punishing-ps5-players-says-xbox-boss",
    "Fable 4": "https://www.techradar.com/news/fable-4-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "The Telegraph": "https://www.telegraph.co.uk/gaming/news/first-pitched-game-lucas-2009-todd-howard-talks-indiana-jones/",
    "IGN": "https://www.youtube.com/watch?v=nPttE_fvjZM",
    "GQ": "https://www.gq-magazine.co.uk/culture/article/xbox-phil-spencer-todd-howard-interview",
    "it wouldn't be to punish": "https://www.techradar.com/news/elder-scrolls-6-exclusivity-wouldnt-be-about-punishing-ps5-players-says-xbox-boss",
    "Avowed": "https://www.techradar.com/news/avowed-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "IGN podcast": "https://www.youtube.com/watch?v=WG84Sxjdy1Q",
    "Fable": "https://www.techradar.com/news/fable-4-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "confirmed": "https://www.techradar.com/news/the-elder-scrolls-6-release-date-could-be-years-away",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Bethesda Joins Xbox\" roundtable": "https://youtu.be/YJneU_qBMPM",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "GamesRadar": "https://www.gamesradar.com/uk/elder-scrolls-6-release-date-location-news-races/",
    "Todd Howard": "https://www.youtube.com/watch?v=I9GA8lsH8ls",
    "new Indiana Jones game": "https://www.techradar.com/news/new-indiana-jones-game",
    "said": "https://www.techradar.com/news/will-elder-scrolls-6-and-starfield-come-to-ps5-sony-is-still-unsure",
    "PCGamer": "https://www.pcgamer.com/bethesda-teases-the-future-of-the-elder-scrolls-with-a-map-and-a-cryptic-tweet/",
    "acquisition of the publisher’s parent company ZeniMax": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "TASS": "https://tass.com/economy/1225233",
    "Gamesindustry.biz": "https://www.gamesindustry.biz/articles/2020-10-28-todd-howard-the-next-generation-is-about-access",
    "Develop: Brighton conference": "https://www.youtube.com/watch?v=I9GA8lsH8ls&feature=emb_title",
    "Reddit": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/eqt1hn/bethesda_is_hiring_new_roles_that_definently/",
    "Gameplay Programmers": "https://jobs.zenimax.com/requisitions/view/1284",
    "Video Editor": "https://jobs.zenimax.com/requisitions/view/1460",
    "teaser trailer": "https://www.youtube.com/watch?v=phRnvAZEhGQ&feature=emb_logo",
    "Redfall": "https://www.techradar.com/news/redfall-trailer-gameplay-release-date-and-more",
    "Gamasutra": "https://www.gamasutra.com/view/news/343260/Zenimax_settles_Redfall_trademark_dispute_with_book_publisher.php",
    "internal Bethesda memo": "http://m.static.newsvine.com/servista/imagesizer?file=fb-frednelson123881A189E4-D43C-93ED-48C1-A953ACC58543.jpg",
    "post": "https://twitter.com/ElderScrolls/status/1344674735901339648",
    "Eurogamer": "https://www.eurogamer.net/articles/2018-06-28-yes-todd-howard-and-team-have-settled-on-a-region-for-the-elder-scrolls-6",
    "Gamespot": "http://www.gamespot.com/articles/skyrim-and-fallout-4-still-have-millions-of-daily-/1100-6448014/"
  }
}