{
  "source": "https://www.techradar.com/news/get-an-ipad-pro-magic-keyboard-for-dollar150-off-with-this-black-friday-deal",
  "title": "Get an iPad Pro Magic Keyboard for $150 off with this Black Friday deal",
  "category": "tablets",
  "updated": "2021-11-23T17:53:26Z",
  "author": "david-lumb",
  "summary": "Save $150 on an iPad Pro keyboard with a Best Buy Black Friday deal",
  "article": [
    "Got an iPad Pro 12.9-inch and want to spruce up your productivity this Black Friday? Pick up an iPad Pro-Magic Keyboard for $150 off with this early Black Friday Best Buy deal. (Not in the US? Check below for deals in your region.)",
    "To be clear, this Magic Keyboard is specifically for the 3rd-generation iPad Pro released in 2018, which is the same size as the 4th-generation iPad Pro (2020) and ever-so-slightly thinner than the newest 5th-generation iPad Pro (which is 0.5mm thicker). The difference isn’t drastic enough to make them incompatible – it just won’t ‘precisely fit,’ according to Apple’s own official documents, meaning it won’t fold closed completely snugly.",
    "But the Magic Keyboard should work just fine in all other aspects, from typing to charging to folding up (almost) flush. In other words, 5th-generation iPad Pro owners should still consider this deal, since it saves them a ton on one of the best accessories for the iPad Pro.",
    "This iPad Pro Magic Keyboard deal is strictly for the 12.9-inch model, and there isn't a similar deal for the iPad Pro 11-inch model, sadly – nor for Magic Keyboards built for the newest iPad Pro 5th-generation models. As we've said, this isn't that big of a deal, but it's good to keep in mind.",
    "By comparison, here's the smart keyboard folio, which doesn't perch the keyboard on an intelligent stand nor does it have a USB-C cable pass-through."
  ],
  "headers": {
    "3": "Today's best iPad Pro Magic Keyboard deals",
    "5": "iPad Pro 12.9 Magic Keyboard deals"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday Best Buy deal": "https://www.techradar.com/black-friday/best-buy-black-friday-deals",
    "according": "https://www.techradar.com/news/older-apple-magic-keyboards-will-work-with-new-129-inch-ipad-pro-but-wont-precisely-fit"
  }
}