{
  "source": "https://www.techradar.com/news/xbox-series-x-games-are-already-benefiting-from-amds-not-so-secret-weapon",
  "title": "Xbox Series X games are already benefiting from AMD’s not-so-secret weapon",
  "category": "gaming",
  "updated": "2021-08-18T12:02:41Z",
  "author": "adam-vjestica",
  "summary": "The Myst is starting to clear",
  "article": [
    "Myst is coming to Xbox One, Xbox Series X|S, PC and Xbox Game Pass on August 26, and it might be the first console game to benefit from AMD’s new FidelityFX Super Resolution technology (FSR) on Microsoft’s current-gen consoles.",
    "If you have no idea what FSR is, here’s a quick explainer: AMD’s new tech lets developers boost framerates and achieve higher resolutions by using a special rendering technique. FSR essentially renders frames at a lower resolution, and then uses a super sampling process to sharpen the image. It’s similar to how Nvidia’s DLSS works, though Nvidia’s solution uses an AI algorithm and isn’t open-source.",
    "In the case of Myst on Xbox Series X and Xbox Series S, FSR allows the game to run at 60fps on Microsoft’s flagship console using the highest graphics settings available, and at 1440p at 60fps on Xbox Series S.",
    "In a blog post on Xbox Wire, developer Cyan’s marketing and brand manager Jeff Lanctot said FSR delivers an almost 75% increase in performance on Xbox Series X|S, without sacrificing much in the way of visual fidelity.",
    "When FSR is used effectively, the visual changes should be subtle when compared side-by-side with a native resolution image. But the slight drop in image quality is worth it due to the massive performance increase it offers.",
    "FSR means that developers (and gamers) don’t have to pick between either great performance or fancy graphics, as AMD’s technology in Myst means players can enjoy a crisp image and smooth experience on all Xbox platforms.",
    "You check out a full-sized comparison of how FSR looks in Myst here.",
    "FSR is still a rather new technology, and much like DLSS, it’s likely to improve over time. The rendering technique has the potential to dramatically improve performance in Xbox Series X and Xbox Series S games, which only bodes well for developers who want to maintain good image quality without sacrificing a game’s framerate.",
    "While FSR isn’t quite as sophisticated as Nvidia’s DLSS, which can have a transformative effect in graphically intensive titles like Red Dead Redemption 2, it’s great to see that the technology is already being implemented into console games.",
    "FSR could prove particularly beneficial on Xbox Series S, which is starting to achieve impressive results after a slightly underwhelming start. More games are now targeting the console’s promised resolution of 1440p instead of 1080p, and we’re seeing more games consistently hit 60fps or 120fps in a number of titles. FSR will only help get a higher quality image and better framerates out of upcoming games, so it’s good news for console gamers in general."
  ],
  "headers": {
    "7": "Analysis: what can we expect from FSR in the future?"
  },
  "links": {
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "FidelityFX Super Resolution": "https://www.techradar.com/news/amd-finally-takes-on-dlss-with-fidelityfx-super-resolution",
    "DLSS": "https://www.techradar.com/news/dlss-games-top-titles-that-support-nvidias-exciting-tech",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-3489035391188466000&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F08%2F17%2Fmyst-is-coming-august-26-with-xbox-game-pass%2F%3Fsf248641504%3D1",
    "here": "https://cyan.com/full-sized-fsr-comparison-images/",
    "Xbox Series S games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-gets-nvidia-dlss-support-to-make-it-run-better-on-your-pc",
    "120fps": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support"
  }
}