{
  "source": "https://www.techradar.com/news/worlds-smallest-airport-to-be-built-for-autonomous-drones",
  "title": "World's smallest airport to be built for autonomous drones",
  "category": "appliances",
  "updated": "2021-02-03T12:48:33Z",
  "author": "rhys-wood",
  "summary": "Sadly, it won’t fly you to Malaga",
  "article": [
    "Airports have a reputation for being enormous, labyrinthine nightmares. Especially when you’re quintuple checking your gate of departure, only to end up at the same overpriced store time and again.",
    "However, a more experimental airport is now underway in Coventry, UK, of all places. Unfortunately, it won’t be for humans – its relative size is that of a postage stamp compared to the likes of Charles de Gaulle. Instead, it's for drones.",
    "Enter tech startup Urban-Air Port. With support from manufacturer Hyundai, they’ve been awarded a £1.2 million ($1.64 million US) grant through the UK government, and their Future Flight Challenge program.",
    "The real objective of the world’s smallest airport is to test how eVTOL (electric vertical take-off and landing) aircraft like delivery drones and air taxis can be integrated into a city’s wider mobility infrastructure. The airport is getting ready to be operational by November 2021.",
    "But why exactly is this project something the UK government saw fit to invest in? Sunil Budhdeo, Transport Innovation Manager for Coventry City Council, shed some light on what the world’s smallest airport hopes to achieve.",
    "“One of the reasons we are at the forefront of this project is because of our obligations to reduce congestion and emissions,” Budhdeo said in a statement to Cities Today. He went on to explain that the project could test the effectiveness of drones being utilized in emergency services.",
    "“If there’s an accident and someone needs emergency treatment and we’ve got a drone close by that can go and pick the passenger up and take them to the hospital, it would be more efficient than having a great big helicopter where you’d have to close the roads or close the traffic to make sure that the helicopter lands safely.”",
    "Budhdeo is correct to be concerned about emissions. The increase in delivery vehicles on the road will have an obviously negative effect on the environment. While our current struggle with the COVID-19 pandemic has led to more people staying home, this is consequently increasing the volume of home deliveries. More large delivery vehicles on the road means carbon emissions are still a threat.",
    "The environmental impact this project might have can’t go understated, either. If emergency services are able to employ drones to airlift people to a hospital, this will surely cut down on carbon emissions caused by helicopters and a build-up of traffic. While this may not immediately be an issue with many more people staying home, it could be a good method for Coventry and other participating cities to future proof themselves when roads do become much busier again.",
    "Air mobility comes with its own added risks, however. Naturally there are several features that producers of drones and other air-based vehicles must absolutely nail such as navigation and knowing not to collide with other vehicles or potentially even pedestrians below.",
    "Should all go well, Urban-Air Port has plans to install over 200 more sites worldwide in response to growing calls to cut emissions and reduce traffic congestion."
  ],
  "headers": {
    "3": "Droning On",
    "7": "Environmentally Engaged"
  },
  "links": {
    "Cities Today": "https://cities-today.com/coventry-to-host-worlds-smallest-airport-for-air-taxis-and-drones/",
    "increasing the volume of home deliveries": "https://www.essentialretail.com/news/covid-royal-mail-increase-parcel/"
  }
}