{
  "source": "https://www.techradar.com/news/facebook-portal-back-to-school-sale-buy-any-two-portal-devices-save-dollar100",
  "title": "Facebook Portal back to school sale: buy any two Portal devices, save $100",
  "category": "smart-home",
  "updated": "2021-08-18T15:07:51Z",
  "author": "mackenzie-frazier",
  "summary": "Stock up and save on Facebook's lineup of smart home displays",
  "article": [
    "Stock up and save big at the Facebook Portal back to school sale that's happening right now. For a limited time, you can save $100 when you buy two Portal devices, which include the Portal TV, Portal Mini, Portal, and Portal Plus. The Portal lineup is part of Facebook's mission to improve video calling by making it completely hands- and distraction-free. Each Portal device allows you to make video calls and features a smart camera that automatically pans and zooms to keep up with the action, allowing you to move and talk freely while always staying in frame. The Alexa-enabled Portal also works with other smart home devices so you can see who's at the front door, watch the news, check the weather, and more. Facebook knows that privacy is a big concern, so it's enabled controls that allow you to easily disable the camera and microphone while ensuring video calls are always encrypted. Facebook's back to school sale not only includes $100 in savings on any two Portal devices, but you'll also receive free two-day shipping and returns. This limited-time offer ends this Saturday, so you should take advantage now before it's too late.",
    "See more smart home display deals with our roundup of the best cheap Amazon Echo prices and deals that are happening now. You can also shop for more bargains with our guide to the best Labor Day sales and the best back to school sales that are happening right now."
  ],
  "headers": {
    "1": "Facebook Portal back to school sale:"
  },
  "links": {
    "you can save $100 when you buy two Portal devices": "https://click.linksynergy.com/fs-bin/click?id=kXQk6*ivFEQ&offerid=662444.207&type=3&subid=trd-us-1245511720172263400",
    "cheap Amazon Echo prices and deals": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020",
    "back to school sales": "https://www.techradar.com/news/best-back-to-school-sales-2020"
  }
}