{
  "source": "https://www.techradar.com/news/new-lenovo-thinkpad-workstations-pack-some-serious-intel-power",
  "title": "New Lenovo ThinkPad workstations pack some serious Intel power",
  "category": "computing",
  "updated": "2021-06-16T23:30:11Z",
  "author": "anthony-spadafora",
  "summary": "Lenovo has redesigned its mobile workstations for hybrid and remote work",
  "article": [
    "As businesses around the world prepare to return to the office and implement hybrid working policies, Lenovo has introduced the next generations of its ThinkPad P1, ThinkPad P15 and ThinkPad P17 mobile workstations.",
    "These new devices come equipped with the latest 11th generation Intel Core and Xeon mobile processors and can be outfitted with up to a Nvidia RTX A5000 GPU to help boost the productivity of today's mobile professionals.",
    "Just like with the rest of the workstations in Lenovo's portfolio, the ThinkPad P1, P15 and P17 are all ISV certified and tested at the highest level to pass MIL-spec standards so that users can work from anywhere.",
    "Lenovo has completely redesigned the ThinkPad P1 for those working from home while maintaining the device's thin and light appearance. The ThinkPad P1 now features 5G connectivity, a larger 90WHr battery, a newly engineered keyboard design with a larger touch pad, a higher resolution FHD camera for improved video conferencing and a top-firing Dolby Atmos speaker system.",
    "Creating and view content is also easier on the new device which now includes a new 16-inch UHD+ display with narrow bezels, low-blue light technology and a 16:10 aspect ratio for increased screen real estate all in a portable 15-inch footprint. The ThinkPad P1 can even be outfitted with either a Nvidia RTX A5000-level GPU or a Nvidia GeForce RTX 3080.",
    "The ThinkPad P15 and P17 have also received a major overhaul from Lenovo and these two new mobile workstations provide the configurability and versatility that professional users require. While the ThinkPad P15 features a 15.6-inch UHD OLED display, the ThinkPad P17 offers the largest workspace of any of the company's mobile workstations with a 17.3-inch color calibrated display.",
    "VP and GM of Lenovo's global workstation and client AI business Rob Herman explained in a press release how the pandemic has led to increased demand for mobile workstations, saying:",
    "“There is no doubt that the global pandemic accelerated a shift toward mobile workstations as most of the world quickly moved to a remote work environment. As mobile workstations have taken on an all-new importance to our end users, we’ve greatly enhanced the ThinkPad P1 Gen 4 to drive as much performance into this thin & light chassis as technically possible. We did this by greatly improving its thermal cooling capabilities with a vapor chamber in addition to traditional heat pipes. We also developed a keyboard that allows for air intake through hidden inlets to maximize the performance of the CPU and GPU. There was no stone left unturned when we rebuilt this chassis from the ground up – our customers spoke and we listened.”",
    "All three of Lenovo's new mobile workstations are also Nvidia Studio validated and will be available to purchase beginning in July. The ThinkPad P1 has a starting price of $2099 (around £1,500), the ThinkPad P15 starts at $1749 (around £1,250) and the ThinkPad P17 starts at $1779 (around £1,272)."
  ],
  "headers": {
    "5": "ThinkPad P15 and P17"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Lenovo": "https://www.techradar.com/news/the-best-lenovo-laptops-2018",
    "mobile workstations": "https://www.techradar.com/news/best-mobile-workstations",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "ThinkPad P1": "https://www.techradar.com/news/lenovo-unveils-most-powerful-thinkpad-workstations-to-date",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "press release": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7703282368232955000&xs=1&url=https%3A%2F%2Fnews.lenovo.com%2Fpressroom%2Fpress-releases%2Fnew-mobile-workstations-innovative-solutions-user-experience-productivity%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnew-lenovo-thinkpad-workstations-pack-some-serious-intel-power"
  }
}