{
  "source": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals",
  "title": "The best cheap Amazon Echo deals and sales for December 2021",
  "category": "audio-visual",
  "updated": "2021-12-01T08:41:42Z",
  "author": "mackenzie-frazier",
  "summary": "Your guide to the best Amazon Echo deals happening today",
  "article": [
    "Our best Amazon Echo deals roundup is here to sort you out with one of the best voice-controlled smart speakers money can buy. These great little devices have been responsible for bringing smart home functionality into millions of homes, and it's easy to see why they are so popular.",
    "There's an Echo speaker for every occasion now, thanks to Amazon's ever-increasing lineup of releases adding new additions every few years. We're also seeing some great updates to older models, which bring a range of speaker upgrades as well as new software. As always, though, the diminutive Amazon Echo Dot deals start the list at the cheaper end today, offering a great starting point to any smart home. If you're looking for pure Alexa functionality, we've also got the best Echo Flex prices going as well.",
    "We've also got prices for the larger versions, including the Amazon Echo, Echo Studio, and more. If you want a visual element too, then we've got you covered with all three sizes of the Amazon Echo Show or the bedside table-friendly Echo Spot, all of which include a screen.",
    "Although Amazon designed and built these smart devices, they're actually on sale at a large number of stores, which means they're never far away from a discount. We'll also list the standard price of each of these Amazon Alexa-powered speakers so you can get a better idea of how good the latest discounts in the comparison charts are.",
    "Equally spherical, but much smaller, is the endearingly cute new Echo Dot – the fourth generation in the long line of excellent budget smart speakers from Amazon. Launching at just $49.99 / £49.99 / AU$79, it's remaining one of the cheapest ways to get your hands on a voice assistant this year, but almost disappointingly, aside from its new eye-catching spherical design, improvements are mostly iterative.",
    "That said, the new inclusion of Alexa Voice Profiles for Kid is a fantastic little feature if you've got kids in the house. This new child-friendly tech can recognize when a younger person is giving voice commands and tailors it's reception accordingly. So, if the child asks Alexa a question, they'll get an appropriate response, animal sound alarms, and even help with their homework should they need it. Read our Amazon Echo Dot review for more info.",
    "The 2020 Amazon Echo is the fourth generation in the long line of excellent smart speakers from the tech giant. No, your eyes don't deceive you, it is indeed much, much more spherical than the 2019 iteration, but luckily all that extra space around the waist has been put to good use with some upgraded internals.",
    "A new speaker array looks to provide an all-around much higher fidelity experience for music lovers, while the inclusion of the new Amazon Sidewalk and Zigbee support should help with smart home device compatibility across the board. You're also getting a new 'AZ1 Neural edge' processor onboard, which Amazon claims helps speed up voice-command recognition by double - not bad considering this latest iteration is retailing for the same price as last year's release.",
    "The older, standard 3rd iteration of the Echo Dot comes in three colors - charcoal, heather grey, and sandstone (that'll be black, grey, or white to the rest of us). The hockey-puck-shaped speaker has a more refined look thanks to the fabric finish - far better than the older all-plastic version. The speaker driver is much larger too, going from 1.1-inches in diameter to 1.6-inches. It's 70% louder than the previous version and keeps the aux 3.5mm connection for a secondary speaker. You can also connect it wirelessly to external speakers via Bluetooth.",
    "The Echo Show 10 was released in February of this year and is Amazon's latest and most powerful smart display with a starting price of $249.99/£239.99. The 3rd generation Echo Show features a 10-inch HD display that automatically turns to face you. The 13MP camera will follow you around, so whether you're making a video call, watching a movie, or following a recipe, the Echo Show 10 is always within your gaze. The smart display also features auto-framing, so you'll stay front and center on video calls, and features a new design with a floating touchscreen above a cylindrical base.",
    "The all-new Amazon Echo Show 5 is now available to order with a retail price of $84.99 / £74.99/ AU$119, which is actually cheaper than the starting price of the 2019 model. The 5.5-inch display works with Amazon Alexa, so you can use your voice to ask questions, play music and videos, and control other compatible smart home devices. The 2nd Generation Echo Show has an upgraded HD 2MP camera with twice as many pixels as the previous version. You're also getting new home security features with Alexa Guard, so you can keep an eye on your home from the display and get alerts to your phone when motion or sound is detected. The 2021 Echo Show 5 is now made entirely of post-consumer recycled fabric and comes in charcoal, glacier white, and a new deep sea blue color.",
    "The 2021 Echo Show 8 is now available to purchase and will set you back $129.99 / £119.99 / AU$199, which is the same starting price as the 2019 version. The all-new Echo Show features an 8-inch HD touchscreen display and works with Amazon Alexa to play movies, stream music, view photos, and control compatible smart home devices completely hands-free. The new and improved Echo Show 5 comes with an updated 13MP camera that automatically pans, zooms, and frames for improved video calling. The smart display also has a new processor resulting in faster performance and is available in two colors, Charcoal and Glacier White.",
    "Not long after the release of the Show 5, Amazon came along with the Amazon Echo Show 8 and a larger screen. So while you may prefer the smaller Echo Show 5 for a bedside table, the new Show 8 works better in larger spaces.",
    "If you're looking for some hands-free recipe guidance in the form of kitchen video tutorials, then this is ideal. The Echo Show second-generation does offer a larger screen, but that 10-inch display comes at a significant price jump. This 8-inch screen is perfect for larger use than you'd need from a bedside table, without offering a hefty price tag to match.",
    "You're also getting the superior display and audio quality of the Echo Show (2nd Gen) with all the privacy and app benefits that came with the Show 5. It's an amalgamation of the best bits of the last two models that comes out with a price tag sitting closer to the cheaper end than the premium 2nd Generation.",
    "This is the cheapest Amazon Echo Show you'll find out in the wild right now. It comes with a smaller five-inch screen than the other Echo Show deals in this list, but if you're after something for a bedside table display, or you simply don't need another intrusive screen in your living room, the Echo Show 5 sit perfectly.",
    "Compared to its bigger siblings, or Google's rival offerings, you might find the screen a little small depending on where you're going to be seeing it from after requesting something via the Alexa voice commands. Plus, you'll be missing out on the improved display and audio quality of the more recent Show 8 as well. The huge selection of how-to videos are super handy though if you can plug it in close by, especially in the kitchen. Check out our full Amazon Echo Show 5 review if you want to learn more about this budget-friendly smart speaker display.",
    "If you've been watching the Echo Sub for a while wishing you could just add the smart speaker into the fantastic sound for a complete package, you'll want to check out 2019's Echo Studio. The massive Echo smart speaker works as a complete high quality audio solution that not only offers impressive sound quality for its price tag but can also easily create a home cinema with a Fire stick.",
    "Amazon have pitched their Echo Studio as low as possible in price - excellent times for all the bargain hunters out there. Don't be fooled by that relatively low price either, this is a powerful speaker. While the 3D audio can be hit and miss, we found that the Echo Studio offered fantastic value for money with powerful sound and a wealth of features.",
    "See more bargains with our roundup of the best Amazon deals that are happening right now."
  ],
  "headers": {
    "4": "The best Amazon Echo deals"
  },
  "links": {
    "Amazon Echo Dot review": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Amazon Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5-2nd-generation",
    "Echo Show 8": "https://www.techradar.com/reviews/amazon-echo-show-8-2nd-gen",
    "Amazon Echo Show 8": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5-2nd-generation",
    "Amazon Echo Show 5 review": "https://www.techradar.com/reviews/amazon-echo-show-5",
    "Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "Amazon deals": "https://www.techradar.com/deals/best-amazon-sales-deals-discounts"
  }
}