{
  "source": "https://www.techradar.com/news/google-ceo-admits-calling-chrome-incognito-mode-private-was-his-call",
  "title": "Google CEO admits calling Chrome Incognito mode “private” was his call",
  "category": "computing",
  "updated": "2021-09-27T16:02:18Z",
  "author": "mayank-sharma",
  "summary": "$5 billion lawsuit seeks to depose Sundar Pichai as Google CEO",
  "article": [
    "Despite being flagged, Google’s decision to stick with the description of Google Chrome’s Incognito browsing mode as \"private\" came right from the top, new reports have claimed.",
    "Court filings have revealed that Google CEO Sundar Pichai was made aware of the fallacy in calling Incognito mode as “private” in 2019.",
    "Yet Pichai decided to maintain the status quo because he “didn't want to put incognito under the spotlight,” the documents allege.",
    "In June 2020, Google was hit with a $5 billion class action lawsuit regarding its collection of user data even when operating the popular web browser in the incognito mode.",
    "The company is contesting the charges arguing that it clearly describes that the Incognito mode only stops data from being saved to a user's device.",
    "According to Reuters, attorneys for the users noted they \"anticipate seeking to depose\" Pichai and Google Chief Marketing Officer Lorraine Twohill, in a written update on trial preparations filed with the district court last week.",
    "Citing Google documents, the attorneys allege that Pichai \"was informed in 2019 as part of a project driven by Twohill that Incognito should not be referred to as 'private' because that ran 'the risk of exacerbating known misconceptions about protections Incognito mode provides.'\"",
    "However, Pichai didn’t address the issues because “as part of those discussions, Pichai decided that he 'didn't want to put incognito under the spotlight,'” according to the filing.",
    "In response, Google spokesman José Castañeda told Reuters that the filing \"mischaracterizes emails referencing unrelated second and third-hand accounts.\"",
    "Last month, the attorney’s for the users deposed Google vice president Brian Rakowski, described in the filing as \"the 'father' of Incognito mode,\" who testified that user’s expectation from the Incognito mode \"may not match\" up with the reality, claims the plaintiffs' write-up.",
    "Google's attorneys rejected the summary of Rakaowski’s deposition, stating that Rakowski also said terms including \"private,\" \"anonymous,\" and \"invisible\" with proper context \"can be super helpful\" in explaining Incognito.",
    "Via Reuters"
  ],
  "headers": {
    "5": "Covert coverage?"
  },
  "links": {
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "$5 billion class action lawsuit": "https://www.techradar.com/news/google-incognito-mode-is-not-as-private-as-you-might-like-to-think",
    "web browser": "https://www.techradar.com/best/browser",
    "Reuters": "https://www.reuters.com/technology/google-ceo-sought-keep-incognito-mode-issues-out-spotlight-lawsuit-alleges-2021-09-24/"
  }
}