{
  "source": "https://www.techradar.com/news/sonos-speakers-are-getting-more-expensive-for-no-real-reason",
  "title": "Sonos speakers are getting more expensive... for no real reason",
  "category": "audio-visual",
  "updated": "2021-09-13T16:49:44Z",
  "author": "olivia-tambini",
  "summary": "Has Sonos shot itself in the foot?",
  "article": [
    "Sonos has confirmed that some of its wireless speakers and soundbars will become more expensive, in a strange move that sees the company increasing the price of existing devices.",
    "We've reached out to Sonos to find out why it would deem it appropriate to do this to products that have been on the market for, in some cases, years - but we're still awaiting a response.",
    "The full list of price changes follows below:",
    "One of the biggest price increases around the world is coming the the company's flagship Dolby Atmos soundbar, the Sonos Arc, which is now $100 / £100 / AU$100 more expensive than before. Saying that, UK buyers are rather unfairly being treated to a hefty £149 price increase for the Sonos Sub, too.",
    "In a statement released to The Verge, Sonos says that it has and will continue to evaluate pricing on a \"market-by-market\" basis, and that the price increases are part of its promise to sustainably grow the business and maintain \"the easy, connected experience\" its customers expect.",
    "The company also cited supply and demand as factors in its decision to raise prices - something The Verge has speculated may refer to the ongoing chip shortage that's affecting everything from car manufacturers to computer companies.",
    "That will be little consolation for anyone who's been saving up for a Sonos speaker and is now significantly short of the money they now need to pay.",
    "In fact, we're struggling to get our heads around this announcement at all. Rarely do you hear of a company increasing the prices of existing hardware - it's far more common for brands to permanently lower the cost of its devices in a bid to lure in more customers.",
    "Either Sonos is incredibly assured of its ecosystem's allure and wants to gamble on losing a few customers for the chance to make lots more money, or it was really struggling to meet its costs at the prices it has been offering.",
    "However, in a recent earnings call, Sonos claimed that its speaker sales had thrived during Q3 2021, saying that revenue was up 58% year-over-year, thanks to \"the introduction of the Roam the continued success of the Arc and Sub\".",
    "Weirdly enough, the Arc and the Sub have seen some of the biggest price increases of all.",
    "In our view, price increases shouldn't happen without a material upgrade to the the products, whether that's improved connectivity, better sound, or longer battery lives. Even if materials are scarce, how can anyone feel like they're paying a fair price for these Sonos speakers when we know how much less the company believed they were worth last week?",
    "Whether this puts of potential buyers remains to be seen, but we daresay the undeniably brilliance of some of Sonos' products will continue to rake in a steady stream of customers - and more income for a company that reported a 13% revenue increase just last month.",
    "Our advice? Hang on until Black Friday 2021 if you want to a buy a Sonos speaker. You can (almost) guarantee that prices will come down again once the holiday shopping season kicks off."
  ],
  "headers": {
    "3": "What the hell, Sonos?"
  },
  "links": {
    "wireless speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079/uk/news/best-speaker",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "The Verge": "https://www.theverge.com/2021/9/10/22667044/sonos-speaker-price-increases-announce-september-12",
    "recent earnings call": "https://s22.q4cdn.com/672173472/files/doc_financials/2021/q3/FINAL-SONO-3Q21-Conference-Call-Transcript.pdf",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}