{
  "source": "https://www.techradar.com/news/apple-music-vs-spotify-vs-amazon-music-hd-vs-tidal-hi-fi-which-music-streaming-service-is-the-best",
  "title": "Apple Music vs Spotify vs Amazon Music HD vs Tidal Hi-Fi: which music streaming service is the best?",
  "category": "audio-visual",
  "updated": "2021-05-17T18:00:00Z",
  "author": "axel-metz",
  "summary": "Which music streaming service is best for you?",
  "article": [
    "Both Apple and Amazon have announced updates to their respective music streaming services – Apple Music and Amazon Music – with Apple Music’s entire library set to become available to stream in hi-res audio, and a select catalogue of songs also set to be compatible with Dolby Atmos.",
    "Meanwhile, Amazon Music HD, the company’s hi-res tier, is now available to all subscribers for free, having previously cost customers an extra $5 / £5 per month.",
    "So, how do they both now compare to rival music streaming platforms?",
    "We know Spotify is planning to launch a similar CD-quality audio service later in the year – called Spotify HiFi – but with the upgrade not expected to arrive until the end of 2021, most folks will be wondering how Apple and Amazon’s music streaming services now compete with the standard Spotify premium subscription available today.",
    "Throw Tidal into the mix, which already offers a high-fidelity subscription option, and audiophiles are spoilt for choice when looking for a music streaming service with a focus on exceptional sound quality.",
    "In this guide, we compare all four services – Apple Music, Amazon Music, Spotify, and Tidal HiFi – as they exist now, with a focus on their price, availability and features.",
    "Arriving for subscribers in June 2021, spatial and lossless audio options will become part of Apple’s existing Apple Music plans at no extra cost. That means users will have access to the new audio formats for the standard price of $9.99 / £9.99 / AU$11.99 per month, or $14.99 / £14.99 / AU$17.99 for a family subscription for up to six people. A cheaper plan is also available for students ($4.99 / £4.99 / AU$5.99).",
    "Unlike Apple Music – which requires a paid subscription beyond a free timed trial – Spotify offers a free version of its platform, though the intrusion of ads and inability to listen to tracks offline means many opt for Spotify’s Premium plan, which costs $9.99 / £9.99 / AU$11.99.",
    "Family and student plans are also available worldwide, priced at $15.99 / £16.99 / AU$17.99 and $4.99 / £5.99 / $5.99, respectively. Spotify Premium Duo, designed for couples or two friends, costs $12.99 / £13.99 / AU$15.99 a month for two accounts. It’s worth noting that these prices reflect recent increases imposed by Spotify, so don’t expect them to change any time soon.",
    "Given that Apple Music by-and-large remains the same price as Spotify, then, even in spite of the audio upgrades arriving for the former, you’re actually getting a better deal from Apple right now – which isn’t something we can say often.",
    "Like Apple, Amazon is also offering a high-res upgrade for its music streaming service for no extra cost. Amazon Music is priced at $7.99 / £7.99 / AU$6.99 per month for Prime members and $9.99 / £9.99 / £11.99 per month for non-Prime customers, with similar discounts available for the Family Plan. The Amazon Music HD tier was previously an additional cost per month for subscribers to the Individual or Family Plan, but Amazon recently scrapped the charge.",
    "If you’re a Prime subscriber, then, Amazon Music is still the cheapest of the major streaming platforms, offering value for money which is made even more apparent when compared to Tidal.",
    "Of the three hi-res music streamers in this guide, Tidal Hi-Fi remains the most expensive at $19.99 / £19.99 / AU$23.99 per month – double the $9.99 / £9.99 / $11.99 monthly cost of its standard offering – with the justification of improved audio quality somewhat undermined by Apple and Amazon’s now-equivalent high-res services.",
    "Tidal is only available in 61 countries, too, with large markets like India and China yet to gain access to the platform.",
    "The latest upgrade to Apple Music offers subscribers the same level of access as the standard subscription – a library of around 75 million songs – as well as Apple-exclusive radio stations like Apple Music 1 (formerly Beats 1), Apple Music Hits and Apple Music Country.",
    "Impressively, Apple says every one of those songs will soon become available to stream in lossless audio, with several thousand also available in Spatial Audio format. More compatible tracks are expected to be added in the future.",
    "The same is true of Amazon Music, which is set to bring lossless audio to its entire 70 million-song library alongside access to a rapidly-growing catalog of tracks remixed in 3D Audio formats such as Dolby Atmos and Sony 360RA. Seven million of those tracks are available in Ultra-HD, or true hi-res audio.",
    "Spotify, in comparison, boasts an equally large library of around 70 million tracks, though a patchy track record when it comes to paying royalties has meant some big-name artists – including Taylor Swift, Jay-Z and The Beatles – have occasionally withdrawn their songs from the service.",
    "Most of this music finds its way back into the Spotify library, mind, but it’s worth mentioning that the service has endured some high-profile withdrawals in its history.",
    "Like Spotify, Tidal boasts a library of more than 70 million tracks, though the same is also true of specific artists occasionally withdrawing their music from the service (or never arriving at all). As with all four platforms, it’s worth checking beforehand whether your favourite music-maker is available to stream on your chosen service.",
    "One particular benefit to Tidal, though, is its collection of video content. It has a section dedicated to videos – more than 250,000, apparently – which includes full-length concerts and classic music videos.",
    "Naturally, the biggest differentiator between the four titans of music streaming is their ability (or inability) to stream high-res audio.",
    "With the imminent upgrade to Apple Music, Apple is giving subscribers the opportunity to stream its entire library of tracks in lossless audio, a format which better preserves the integrity of original audio files.",
    "The platform’s new lossless format starts at CD quality, which is 16 bit at 44.1 kHz, and goes all the way up to 24 bit at 192 kHz, depending on the selection of the user. In layman’s terms, that means every song on Apple Music is getting the studio treatment.",
    "As well as lossless audio, though, Apple is bringing Spatial Audio with support for Dolby Atmos – technology which aims to mimic surround sound – to Apple Music. By default, the service will automatically play Dolby Atmos tracks on all AirPods and Beats headphones with an H1 or W1 chip, as well as the built-in speakers in the latest versions of iPhone, iPad, and Mac.",
    "Like Apple, Amazon Music HD is set to benefit from a similar library-wide audio upgrade, with all tracks available to stream in CD-quality. In addition to lossless and Dolby Atmos enhancements, customers will also be able to stream more than 7 million songs in Ultra HD (which Amazon says is better than CD-quality), with a depth of 24 bits and a sample rate of up to 192 kHz – that’s the same as the highest resolution coming to Apple Music, though Amazon’s hi-res library is far more limited.",
    "With Spotify yet to launch its equivalent HiFi service, then, the audio quality offered by Spotify Premium is expectedly less impressive. Subscribers can choose between five sound quality levels: automatic (which changes quality based on your network connection), low, normal, high, and very high.",
    "At the low setting, music streams at 24kbps. At the normal setting – which is enabled by default, and likely what most users are exposed to – that figure increases to 96kbps. Switch to the high-quality setting and the bit-rate bumps up to 160kbps, while the very high setting uses 320kbps, which is the closest to lossless streaming as you’ll get with the platform right now.",
    "That’s not to say audio quality on Spotify is bad – it more than competes with the standard variant of Tidal, for example – but you won’t be exposed to the same CD-level sound as you’ll find on Tidal Hi-Fi, and now Apple Music and Amazon Music HD.",
    "For comparison, Tidal Hi-Fi offers nearly four times the data per song as the highest setting available on Spotify. The service streams at 1411kbps and uses FLAC format, which doesn’t strip back aspects of original recordings which might otherwise be lost by MP3’s tendency to compress files.",
    "For a more in-depth look at what makes hi-res audio so much better than MP3, check out our guide, but perhaps the best way to describe the difference is the comparison between standard definition (SD) and high definition (HD) displays. Before the arrival of the latter, most TV-watchers were satisfied with the quality the picture offered by SD – and then HD came along to prove what the technology was capable of.",
    "The same is true of high-res audio. For those not in-the-know when it comes to sound quality, the MP3 audio offered by the likes of Spotify’s standard subscription might seem competent enough – it’s only when you directly compare it with CD-quality sound that MP3 comes up short.",
    "With the arrival of lossless and Dolby-enhanced audio on Apple Music and Amazon Music alongside Tidal Hi-Fi – not to mention the impending arrival of Spotify Hi-Fi – high-res music listening is primed to become more widespread than ever.",
    "As of June 2021, both Apple Music and Amazon Music will hands-down offer the best value for money when it comes to high-quality music streaming.",
    "For no extra cost, subscribers to either platform will be able to enjoy high-res audio quality similar to that which is currently offered by Tidal Hi-Fi at double the price.",
    "For most, Spotify’s premium plan will still offer a good value service and access to a huge library of songs, but if you’re after superior audio quality without breaking the bank, it’s hard to look past Apple Music and Amazon Music as the kings of the music streamers – for now, at least."
  ],
  "headers": {
    "6": "Price and availability",
    "14": "Music catalogue",
    "21": "Sound quality",
    "33": "So, which is best?"
  },
  "links": {
    "announced updates": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "recent increases": "https://www.techradar.com/news/bad-news-for-spotify-family-subscribers-as-price-hike-looms",
    "high-res": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "guide": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}