{
  "source": "https://www.techradar.com/news/how-to-attract-last-minute-holiday-shoppers-4-ideas-to-try",
  "title": "How to attract last-minute holiday shoppers: 4 ideas to try",
  "category": "pro",
  "updated": "2021-11-15T17:57:53Z",
  "author": "francesca-nicasio",
  "summary": "Get the most out of last-minute holiday shopper sales with four creative ideas.",
  "article": [
    "Attracting last-minute holiday shoppers should be top of your strategic retail and e-commerce agendas as an SMB owner. Last-minute seasonal shoppers are extremely likely to purchase at least one product, and they're usually more open to present suggestions as they take the mental strain off of their already busy to-do list. Make it even faster for them to buy from you with the best POS systems.",
    "Holiday shopping started much earlier last year. Worried about crowds in the Covid-19 era, shoppers started stockpiling gifts in September. Yet, even with a global health crisis, the average shopper still left 53% of their shopping to December 2020. That suggests that regardless of global events, you can rely on late seasonal shoppers to drive your sales every winter.",
    "In fact, with Covid-19 vaccination rates on the rise in 2021, late shoppers are likely to make a confident comeback. A global study highlighted by Internet Retailing.com predicts, \"the first unrestricted Christmas since Covid-19 began will see retail sales rise by 6.3% in the six weeks running up to Christmas, compared to the £79,7bn spent over the same period in 2020.\" What a difference a year makes.",
    "The headline for your business in all of this? Late holiday shoppers are great news, since they give you the opportunity to capture some last-minute sales, both online and off. Read on to try these four easy methods for cashing in on last-minute holiday shopping crowds.",
    "Last-minute shoppers are harried and often out of ideas. An easy way to capture them is to offer some inspiration for the gift they’ve been looking for.",
    "To do that, consider creating a gifting guide. Put together a collection of your products that would make excellent gifts, particularly items that can be sold together as a gift set. For instance, if you sell a duvet, include some pillows and sheets in the gift guide so your customers can give the gift of 'the perfect night’s sleep.'",
    "Placement of the guide can increase last minute sales opportunities too. Try offering the gift guide at your store entrance to offer customers ideas as they shop. Placing the guide by your POS system can also offer inspiration if the customer is looking to purchase for another friend or family member. Online retailers can put their gift guide together as a landing page, like Modcloth’s.",
    "Selling offline? Brick-and-mortar stores should set gift guides up visually. Display gifting ideas in the front windows, as well as where the items are located. Use descriptive signage to point people in the right direction. You could, for example, organize and label your displays based on price point (e.g., “gifts under $50” or persona “gifts for her”).",
    "Nordstrom is doing just that in the example below. The department store created several displays which contain gifts for different types of people. In this photo, we’re seeing gift ideas for beauty buffs.",
    "Inc. reports that same-day or next-day delivery is crucial for last-minute holiday consumers. In fact, around 50% of holiday shoppers are more likely to purchase from a store offering same-day delivery. Fast shipping is even more important to last-minute shoppers than free shipping!",
    "And this year, offering speedy shipping options may be a true make-or-break for potential customers. Because many people are going to celebrate the holidays virtually, it’s quite possible 2020 will see more mailed gifts than usual.",
    "This year, try partnering with a last-mile delivery service like Shipt, to offer same-day and next-day shipping services right up to December 25th. Shipt is able to provide speedy delivery for a relatively inexpensive fee. Currently, it’s $9.99/order at Target for non-Shipt members, for instance.",
    "The countdown for shoppers to get their package in time for Christmas is on. Based on 2020 guidance, for USPS, the first deadline is December 15th and the final deadline is the 23rd, depending on which of their services you’re using.",
    "Display these deadlines prominently in your digital ads. Couple it with a free shipping offer if you can. This messaging will drive the viewer’s sense of urgency. (And it’ll act as a nifty public service announcement so they don’t forget to buy gifts in time.)",
    "Check out this example from the jewellery retailer Alex and Ani, which contains the key “order by” dates that shoppers need to know. Alex and Ani also included the shipping option (i.e., standard, priority, or expedited shipping) that shoppers should select to ensure that they receive their items in time for Christmas.",
    "The angle is focused on how Alex and Ani are looking out for their customers. That way, the announcement of the deadline is providing value to the shopper, not just creating urgency.",
    "Make sure to be constantly updating your ads as the various dates come and go. Have them set to automatically shut off on the days that the ad expires so you do not have angry customers.",
    "Anything you can do to reduce the number of things on a last-minute shopper’s to-do list will help you win their sale, and hopefully even loyalty. In fact, gift wrapping is such a popular service that a variety of outlets will compile a list of retailers offering it each year.",
    "Gift-wrapping services can be offered both online and in-store, though many companies only offer free gift wrapping on in-store purchases.",
    "Gift-wrapping is a fairly simple and cheap service to offer for even very small shops. Jeffrey Michael from Moriarty’s Gem Art says that they purchase their gift wrapping supplies from a big-box store on discount when the holidays are over.",
    "Once you’ve got supplies, all you need to do is train your employees on how to wrap gifts and you’re ready to go. If you’re not sure how to wrap gifts yourself, there are hundreds of tutorials on YouTube to get you started.",
    "Up-to-date retail technology is absolutely key to providing last-minute shoppers with an easy, relaxing experience.",
    "Mobile POS, for instance, can ring up a customer anywhere in the store, reducing wait times at the register. (In 2020, mPOS also handily reduces crowding at the register.) mPOS can also create an endless aisle so that customers can purchase from inventory that is only stocked online or at another store, reducing the headache of shopping multiple locations or remembering to make the online purchase when they get home.",
    "Derric Haynie, founder of Ecommercetech.io, recommends that retailers connect their POS systems to their loyalty programs and capture contact information at each sale. Holiday shoppers are often new to your brand, making them ideal candidates for your loyalty program. Haynie says, “By getting the customer activated today, you start them on a journey of staying true to your brand.”",
    "Modern inventory management software, as well, will give your store employees a real-time view of what products are available and where. Older systems often take 24 hours to update inventory levels, which makes it common for sales associates to have to phone up multiple stores before an item can be located. It’s a miserable and lengthy experience for any customer, let alone one out on holiday errands.",
    "So, do your customers and business a favor by choosing a modern POS system that provides real-time data, along with powerful customer management tools to help you attract and convert shoppers.",
    "Last-minute holiday shoppers are in search of help figuring out what presents should round out their shopping. If you’re able to provide these customers with the convenience and ease they’re looking for, you’ll win their sales."
  ],
  "headers": {
    "4": "1. Create a gift guide",
    "9": "2. Offer fast shipping",
    "17": "3. Offer gift wrapping",
    "21": "4. Use updated POS software for the best experience",
    "26": "Wrapping up"
  },
  "links": {
    "best POS systems": "https://www.techradar.com/news/the-best-pos-system",
    "shoppers started stockpiling gifts in September": "https://apnews.com/article/virus-outbreak-pandemics-shopping-holidays-archive-a7ddd75b2696ded64dab74c2e3d6449f",
    "53% of their shopping": "https://www.thinkwithgoogle.com/consumer-insights/last-minute-shopper-behavior/",
    "POS system": "https://www.techradar.com/news/the-best-pos-system",
    "like Modcloth’s": "https://apnews.com/article/virus-outbreak-pandemics-shopping-holidays-archive-a7ddd75b2696ded64dab74c2e3d6449f",
    "Inc. reports": "https://www.inc.com/peter-roesler/study-finds-faster-shipping-times-appeal-to-last-minute-holiday-shoppers.html",
    "Shipt": "https://www.shipt.com/partner/",
    "for USPS": "https://www.usps.com/holiday/holiday-shipping-dates.htm",
    "variety": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6406865975889640000&xs=1&url=https%3A%2F%2Fwww.retailmenot.com%2Fblog%2Fgift-wrapping-services.html&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-attract-last-minute-holiday-shoppers-4-ideas-to-try",
    "of": "https://www.iheart.com/content/2019-12-09-here-are-all-the-stores-that-will-wrap-your-gifts-this-holiday-season/",
    "outlets": "https://www.prnewswire.com/news-releases/these-36-stores-will-wrap-your-gifts-for-yousometimes-for-free-300571891.html",
    "Moriarty’s Gem Art": "https://www.tanzanitejewelrydesigns.com/",
    "Ecommercetech.io": "https://ecommercetech.io/",
    "connect their POS systems to their loyalty programs and capture contact information at each sale": "https://www.techradar.com/news/9-inspiring-ideas-on-how-to-use-pos-system-customer-data",
    "choosing a modern POS system": "https://www.techradar.com/news/how-to-choose-the-right-pos-system-for-your-business"
  }
}