{
  "source": "https://www.techradar.com/news/netflixs-resident-evil-series-gets-an-intense-new-trailer-and-release-date",
  "title": "Netflix's Resident Evil series gets an intense new trailer and release date",
  "category": "entertainment",
  "updated": "2021-05-19T10:31:54Z",
  "author": "stephen-lambrechts",
  "summary": "Prepare yourself for Infinite Darkness",
  "article": [
    "Hot off the success of Resident Evil Village, the latest game in Capcom's long-running Resident Evil franchise, comes the first full trailer for Netflix's highly-anticipated anime adaptation, Resident Evil: Infinite Darkness.",
    "The CG-animated show, which will be the first serialized drama in the franchise's 25-year history, will see fan-favorite characters Leon S. Kennedy and Claire Redfield return to face new terrors.",
    "Fans of the of the Resident Evil 2 remake will be pleased to hear that Netflix has nailed the series' casting, with Nick Apostolides and Stephanie Panisello both returning to voice the roles of Leon and Claire respectively.",
    "The trailer sees the pair team up once again in the face of another possible outbreak, as Claire attempts to uncover a conspiracy that goes all the way to the White House.",
    "Along with a generous helping of action and suspense, culminating in an appearance from a mysterious green tyrant, the trailer also reveals the series' release date: July 8, 2021.",
    "In addition to Netflix's upcoming Resident Evil: Infinite Darkness series, fans also have a live-action Resident Evil movie reboot to look forward to with a title that should delight fans."
  ],
  "headers": {},
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Resident Evil 2 remake": "https://www.techradar.com/reviews/resident-evil-2-remake-review",
    "Netflix has nailed the series' casting": "https://www.techradar.com/news/netflix-nails-resident-evil-series-casting-with-some-help-from-the-games",
    "should delight fans": "https://www.techradar.com/news/new-resident-evil-movie-title-should-delight-fans"
  }
}