{
  "source": "https://www.techradar.com/news/new-star-wars-movie-rogue-squadron-takes-a-major-step-forwards",
  "title": "New Star Wars movie Rogue Squadron takes a major step forwards",
  "category": "entertainment",
  "updated": "2021-06-29T09:57:23Z",
  "author": "samuel-roberts",
  "summary": "The project reportedly has a screenwriter",
  "article": [
    "Disney and Lucasfilm's first new Star Wars movie since 2019, Rogue Squadron, has reportedly found a screenwriter. Matthew Robinson, who is also working on the upcoming sequel to Tom Cruise time loop movie Edge of Tomorrow, is apparently writing the movie.",
    "The aim is to start filming in 2022, with pre-production starting later this year, according to The Hollywood Reporter, which says that Lucasfilm had no comment on Robinson's involvement in the film. The writer also worked on the comedy The Invention of Lying with Ricky Gervais, and the live-action Dora the Explorer movie from a couple of years back.",
    "Wonder Woman director Patty Jenkins is behind Star Wars: Rogue Squadron, which is scheduled to release on December 23, 2023. The movie is about a new generation of pilots in the Star Wars galaxy, and takes the story to what's been described as the 'future era' – presumably some time after the events of Episode 9: The Rise of Skywalker.",
    "Here's hoping that Squadrons is better than that film was – or Jenkins' Wonder Woman 1984.",
    "Since the logo depicts an X-Wing, we're expecting these pilots to exist as part of some future form of the Resistance from the sequel trilogy. As it stands, this is an era of Star Wars history we've never seen on screen before.",
    "Back in May, we said that Star Wars doesn't need to exist as a movie series any more – after The Mandalorian and the final season of The Clone Wars, it felt like Lucasfilm was finding more satisfying ways to tell these stories on the small screen. So far, its live-action shows have demonstrated that they have the same level of special effects as the movies.",
    "So, what's going to make people go out and spend big cash on a movie set in that universe? That's the big question here. Diminishing box office returns on Solo: A Star Wars Story led to Disney scaling back its efforts on big screen, and now its most exciting projects are all coming to TV: Obi-Wan Kenobi, Andor and a selection of Mandalorian spin-offs.",
    "Essentially, a new movie has to compete with all of that – so it needs to show viewers something they don't feel like they're getting elsewhere, which is a big challenge for Jenkins and Lucasfilm.",
    "That said, the dramatic ending to Rogue One aside, we haven't seen nearly enough large-scale starfighter combat in Disney's Star Wars projects. Perhaps that's one way Rogue Squadron can differentiate itself."
  ],
  "headers": {
    "5": "Analysis: Does Star Wars even need movies now?"
  },
  "links": {
    "Star Wars movie": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/star-wars-patty-jenkins-rogue-squadron-gets-a-writer-exclusive-1234973788/",
    "Episode 9: The Rise of Skywalker": "https://www.techradar.com/news/im-still-annoyed-by-star-wars-the-rise-of-skywalker-three-months-later",
    "Wonder Woman 1984": "https://www.techradar.com/news/why-wonder-woman-1984-is-disappointing",
    "Star Wars doesn't need to exist as a movie series": "https://www.techradar.com/news/why-lucasfilm-doesnt-need-to-make-star-wars-movies-any-more",
    "Andor": "https://www.techradar.com/news/star-wars-tv-show-andor-wont-feature-this-iconic-character-at-first-anyway",
    "Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far"
  }
}