{
  "source": "https://www.techradar.com/news/star-treks-tv-future-has-been-secured-for-the-next-five-years",
  "title": "Star Trek TV shows sound like they have a long and healthy future ahead",
  "category": "entertainment",
  "updated": "2021-08-02T10:10:53Z",
  "author": "samuel-roberts",
  "summary": "Trek show overseer Alex Kurtzman signs a new deal with CBS Studios",
  "article": [
    "Star Trek's TV overseer Alex Kurtzman has struck a massive deal to work with CBS Studios until 2026. This is significant for Trek fans, in the sense that Kurtzman has led the franchise's revival on the small screen as a producer – starting with Star Trek: Discovery in 2017, and soon growing it to five totally different shows, including the upcoming Strange New Worlds.",
    "The deal is apparently worth around $150 million, according to Deadline. Kurtzman doesn't just work on Trek, hence his high value. His studio, Secret Hideout, has also produced TV series The Comey Rule, and he's also filmed a new TV version of The Man Who Fell to Earth starring Chiwetel Ejiofor.",
    "Star Trek, though, is clearly very important for Paramount Plus, as it represents the majority of the rebranded streamer's biggest exclusive shows. Alongside Picard, Discovery, Strange New Worlds and the animated adult comedy Lower Decks (which returns for season 2 on August 13), a new kid-friendly series called Star Trek: Prodigy is also in the works. Deadline's report also mentions that Section 31 is in development, a long-gestating Discovery spin-off.",
    "\"Alex’s vision and leadership of the Star Trek franchise and his ability to create artistic and commercial series across all platforms put him in a special class of creative talent,\" said George Cheeks, president and CEO of CBS.",
    "Kurtzman's previous deal was apparently worth around $25 million – the escalation in his value is no doubt motivated by the success of Trek and his other projects, but it's also a reflection of the bidding wars streamers are having on major behind-the-scenes talent. Ryan Murphy, for example, the creator of Ratched, has a $300 million deal with Netflix. It's a hot market, and the $150 million deal reflects that.",
    "It's likely more Trek shows will follow in future. \"I think we’re just getting started,\" Kurtzman told The New York Times as the deal was announced. \"There’s just so much more to be had.\"",
    "Intriguingly, he references a pitch for a Worf-focused project from Portlandia writer Graham Wagner, which suggests they're on the lookout for more Trek shows.",
    "Kurtzman says if it was up to him, he'd be pushing the boundaries of Trek further than \"most people\" would actually want, and be doing stranger stuff with it. \"I think we might get there. Marvel has actually proven that you can. But you have to build a certain foundation in order to get there and we’re still building our foundation.\"",
    "Trek, then, looks like it has a healthy future on the small screen.",
    "Kurtzman's got an interesting history leading up to Trek. Early in his career, he was a writer on the series Alias with future Star Trek movie director JJ Abrams – this led to him co-writing the screenplay to the very Alias-esque movie Mission Impossible 3, and eventually, co-writing Abrams' 2009 Star Trek reboot starring Chris Pine.",
    "He also cut his teeth as a director: first on the so-so drama People Like Us, also starring Pine, and then with the Tom Cruise dud The Mummy back in 2017.",
    "In 2009, Kurtzman started working with CBS, when he co-created the successful Hawaii Five-0 reboot for the network. It was in 2015, though, that he was tasked with revitalizing Trek for the small screen – by which point he'd worked on the script for the second Abrams Trek movie, Into Darkness.",
    "When Star Trek: Discovery premiered in 2017, it led to the biggest day, week and month of sign-ups for the then-named CBS All Access streaming service – which is now called Paramount Plus. From there, Kurtzman's Trek footprint has only grown, with a vast network of collaborators helping to bring the different projects to life."
  ],
  "headers": {
    "9": "Analysis: How Kurtzman came to lead Trek"
  },
  "links": {
    "Strange New Worlds": "https://www.techradar.com/news/star-trek-strange-new-worlds",
    "Deadline": "https://deadline.com/2021/08/alex-kurtzman-mega-overall-deal-cbs-studios-secret-hideout-stephen-king-1234806977/",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "Picard": "https://www.techradar.com/news/star-trek-picard-season-2",
    "Discovery": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Section 31": "https://www.techradar.com/news/star-trek-section-31-release-date-cast-plot-how-it-ties-into-canon-and-more",
    "Ratched": "https://www.techradar.com/news/ratched-season-2",
    "The New York Times": "https://www.nytimes.com/2021/08/01/business/media/alex-kurtzman-paramount-cbs-star-trek.html"
  }
}