{
  "source": "https://www.techradar.com/news/psvr-2-may-already-have-a-massive-advantage-over-the-original-playstation-vr",
  "title": "PSVR 2 may already have a massive advantage over the original PlayStation VR",
  "category": "gaming",
  "updated": "2021-10-29T16:18:39Z",
  "author": "jamel-smith",
  "summary": "A big library of VR games from day one? Yes, please",
  "article": [
    "The PSVR 2 could already be a more tempting proposition than its predecessor if a new rumor is to be believed.",
    "According to a post on ResetEra, Sony’s PSVR 2 headset might be backward compatible with current PSVR games, which means those who buy the new virtual reality headset will have access to hundreds of games at launch.",
    "One of the problems that can often face new technologies is the lack of support or content for early adopters. For example, buying an 8K TV right now is a future-proofing option rather than a necessity, due to the lack of 8K content available.",
    "Backward compatibility for older games would be a huge boon for the PSVR 2, then, and could encourage more consumers to try out virtual reality for the very first time.",
    "Like any rumor, though, it’s best to heed this claim with caution. Although the member who posted the news is verified on ResetEra and a marketing specialist, there’s nothing to prove that they have ties to PlayStation in any way.",
    "Sony recently announced that PS Plus members will receive three bonus PSVR games for free, which are available to download until January 3, 2022. Sony has been giving away more PSVR games over the last year too, including the excellent Astro Bot Rescue Mission.",
    "PlayStation’s new VR headset does sound promising, and it appears that Sony isn’t done with exploring virtual reality just yet. Unlike the first PlayStation VR unit, the PSVR 2 will support dedicated motion controllers which include haptic feedback and adaptive triggers, just like on the PS5 DualSense controller.",
    "The new PlayStation VR headset will also undoubtedly take advantage of the PS5’s increased graphical power, which should provide a better resolution for games and higher refresh rates.",
    "Better still, it would be nice if older PS VR games look and run better on the PSVR 2, but we’ll have to wait to see if the headset is indeed backward compatible before we get too excited.",
    "Via GamesRadar"
  ],
  "headers": {
    "6": "A promising device"
  },
  "links": {
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "ResetEra": "https://www.resetera.com/threads/playstation-plus-november-2021-knockout-city-first-class-trouble-kingdoms-of-amalur-re-reckoning-the-persistence-until-you-fall-twd-s-s.506712/page-3#post-76057857",
    "PSVR games": "https://www.techradar.com/best/best-playstation-vr-games",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "dedicated motion controllers": "https://www.techradar.com/news/psvr-2-controllers-revealed-heres-what-vr-on-ps5-will-feel-like",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "DualSense": "https://www.techradar.com/news/dualsense-ps5-controller-deals-price-sales",
    "Via GamesRadar": "https://www.gamesradar.com/psvr-ps5-will-apparently-be-backwards-compatible-with-current-psvr-games/"
  }
}