{
  "source": "https://www.techradar.com/news/microsoft-is-killing-off-one-of-the-best-windows-10-work-tools",
  "title": "Microsoft is killing off one of the best Windows 10 work tools",
  "category": "computing",
  "updated": "2021-05-25T09:03:39Z",
  "author": "mike-moore",
  "summary": "Windows 10 Timeline feature is ending soon",
  "article": [
    "One of the most useful tools for working in Windows 10 is set to be killed off within the next few weeks, Microsoft has confirmed.",
    "The Timeline tool allowed user activity to be synced across multiple Windows 10 devices, meaning users could quickly and easily pick up on one device where they had left off beforehand.",
    "The feature was especially popular with hybrid workers, who could switch between locations and devices with no interruption or need for lengthy syncing processes.",
    "Despite its popularity, Microsoft has confirmed that Timeline syncing will be ending soon for Microsoft Account users, with the recent Windows 10 20H2 update sounding the bell for the feature.",
    "New Microsoft Support documentation showed that Timeline will be going away for all supported versions of Windows 10, starting from Windows 10 20H2, from July 2021.",
    "\"Note: Starting in July 2021, if you have your activity history synced across your devices through your Microsoft account (MSA), you’ll no longer have the option to upload new activity in Timeline,\" the notice read.",
    "\"You’ll still be able to use Timeline and see your activity history (information about recent apps, websites and files) on your local device. AAD-connected accounts won’t be impacted.\"",
    "The end of Timeline had been expected for some time, with Microsoft hinting in April 2021 that the feature would be dropped soon - although many thought this would not occur until the launch of the Windows 10 21H2 update sometime later this year.",
    "Microsoft has reassured users that Timeline will remain a local service, with the feature and all user local activity history such as recent apps, files and websites visited, remaining on Windows 10. However with Timeline seemingly designed for those workers who switch devices or locations regularly, it's not known quite how this will be a benefit going forward.",
    "Via WindowsLatest"
  ],
  "headers": {
    "3": "Darkest Windows 10 Timeline"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "hybrid workers": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Windows 10 20H2": "https://www.techradar.com/news/windows-10-20h2-update",
    "the notice": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-2761505734301982000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Fwindows%2Fget-help-with-timeline-febc28db-034c-d2b0-3bbe-79aa0c501039",
    "end of Timeline": "https://www.techradar.com/news/microsoft-could-be-calling-time-on-one-of-windows-10s-more-useless-features",
    "WindowsLatest": "https://www.windowslatest.com/2021/05/25/windows-10-microsoft-will-restrict-timeline-feature-for-everyone-in-july/"
  }
}