{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-may-15",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-05-14T22:31:37Z",
  "author": "axel-metz",
  "summary": "What's worth watching this weekend on Netflix and other streamers?",
  "article": [
    "Given the relative quietude of last weekend’s streaming service arrivals, you’ll be pleased to learn that the likes of Netflix, Amazon Prime and HBO Max have seen fit to double-down on their roster of new movies and TV shows dropping over the next few days. In short: a good weekend is ahead.",
    "While there’s a noticeable absence of superheroes flying into libraries – which is a breath of fresh air, if we’re honest – there is a large collection of highly-anticipated dramas, miniseries and claustrophobic thrillers to keep you busy this May.",
    "Below, we round up seven of the biggest highlights coming to streamers this weekend – from new sci-fi animations to powerful historical dramas.",
    "It’s always nice to kick the weekend off with some claustrophobia, isn’t it?",
    "Mélanie Laurent stars in Oxygen, a French-language thriller about a woman who wakes up in a cryogenic pod and must figure out who she is and how she got there before running out of oxygen. By the looks of things, it’s a cross between Buried and Prometheus – which is an interesting combination, to say the least.",
    "Critics have near-universally praised the movie for its high-tension drama and Laurent’s solitary performance, so this one could be worth checking out even if only to alleviate your own pandemic-induced sense of isolation.",
    "Now available to stream on Netflix",
    "Produced by Parks & Recreation's Mike Schur and written by Broad City creators Paul W. Downs, Lucia Aniello and Jen Statsky, Hacks follows Jean Smart as a washed-up Las Vegas stand-up comic who becomes an unlikely mentor to a young comedy writer.",
    "Critics have lauded Smart’s performance in this one, who has enjoyed a career revival of late thanks to supporting roles in dramas like Fargo, Watchmen and Mare of Easttown. Kaitlin Olson and Carl Clemons-Hopkins also star, so expect some suitably hilarious hijinks.",
    "Episodes 1 and 2 are now available to stream on HBO Max, with further episodes streaming weekly",
    "Much has been made of Halston, a five-episode adaptation of the unauthorized biography of the late celebrity fashion designer Roy Halston. His family have called the Netflix series “an inaccurate, fictionalized account”, while Ewan McGregor – who leads its cast – has been praised for a role which proves the actor’s often unspoken versatility.",
    "In any case, expect sex, drugs and plenty bright clothes in this flamboyant trip through the New York fashion scene in the 1970s and 1980s. Besides, McGregor playing a hedonistic gay icon can only be good prep for the Obi-Wan series on Disney Plus, right?",
    "Now available to stream on Netflix",
    "Volume 2 of the excellent Love, Death & Robots anthology series returns to Netflix this weekend, with eight more delightfully whacky episodes likely to prove that less is often more when it comes to good storytelling.",
    "Expect beautifully rendered character designs, vibrant worlds and voice cameos from big-name actors including Michael B. Jordan. We’re a little disappointed to see a much smaller episode count this time around – compared to Volume 1’s 18 (!!!) episodes – but we’ve no doubt Love, Death & Robots’ new additions will keep our eyes wide and jaws open.",
    "I mean, have you seen this trailer?",
    "Now available to stream on Netflix",
    "Coinciding with a brief theatrical release, Those Who Wish Me Dead marks a return to the fray for writer-turned-director Taylor Sheridan (Sicario, Wind River) and actress Angelina Jolie. It follows Hannah, a wilderness firefighter (or smokejumper, as they’re officially known) reeling from the loss of three lives she failed to save.",
    "Critics have praised the movie’s premise and spectacle, though expect a healthy helping of dialogue cheese and disaster flick clichés. Nicholas Hoult, Aiden Gillen, Tyler Perry and Jon Bernthal also star.",
    "In the UK, unfortunately, you won't have the ability to stream it – it's releasing in cinemas on May 17.",
    "Now available to stream on HBO Max",
    "Barry Jenkins (of Moonlight fame) directs all 10 episodes of Amazon's latest big budget – and highly anticipated – drama series, The Underground Railroad. An adaptation of Colson Whitehead's Pulitzer-winning novel of the same name, it depicts an alternate 19th century American South where a subterranean railroad serves as an escape route for slaves.",
    "South African newcomer Thuso Mbedu, who leads the series, has earned heaps of praise for her portrayal of the young Cora, starring alongside the likes of Joel Edgerton and The Good Place's William Jackson Harper.",
    "This one has already been described as “simply one of the most powerful pieces of television you will ever see” – so we’re betting it’s definitely worth the watch.",
    "Now available to stream on Amazon Prime Video",
    "Based on A.J. Finn's acclaimed novel, The Woman in the Window stars Amy Adams as a woman frightened by the outside world who becomes obsessed with her new neighbors – and solving a brutal crime she witnesses from her window.",
    "Joe Wright (Darkest Hour, Atonement) directs an all-star cast including Julianne Moore, Gary Oldman and Jennifer Jason Leigh in a movie originally intended for release several years ago (it was re-edited after poor test screenings and a pandemic-induced delay).",
    "As is frequently the case with dubious theatrical propositions, Netflix swooped in to secure the movie’s rights – so there must be something here, at least.",
    "Now available to stream on Netflix"
  ],
  "headers": {
    "3": "Oxygen (Netflix)",
    "7": "Hacks (HBO Max)",
    "10": "Halston (Netflix)",
    "13": "Love, Death & Robots Vol. 2 (Netflix)",
    "17": "Those Who Wish Me Dead (HBO Max)",
    "21": "The Underground Railroad (Amazon Prime Video)",
    "25": "The Woman in the Window (Netflix)"
  },
  "links": {
    "last weekend’s": "https://www.techradar.com/news/6-new-movies-and-tv-shows-on-netflix-disney-plus-hbo-max-and-more-this-weekend-may-8-2021",
    "Obi-Wan": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Love, Death & Robots": "https://www.techradar.com/news/netflix-drops-surprise-trailer-for-love-death-and-robots-vol-2",
    "Those Who Wish Me Dead": "https://www.techradar.com/news/hbo-maxs-those-who-wish-me-dead-is-aggressively-disposable-and-thats-okay"
  }
}