{
  "source": "https://www.techradar.com/news/fitbit-sense-drops-to-record-low-price-in-this-weekends-smartwatch-deals",
  "title": "Fitbit Sense drops to record low price in this weekend's smartwatch deals",
  "category": "wearables",
  "updated": "2021-05-22T15:35:54Z",
  "author": "tabitha-baker",
  "summary": "Fitbit Sense deals have never been this cheap",
  "article": [
    "Fitbit deals have been knocking the Fitbit Sense price down for a few months now, but Amazon's latest smartwatch sales have taken things a step further, offering up a brand new record low. This saving is only available on the white/gold model, but at just $239.99 (was $329.95), you're getting a fantastic price on a sophisticated smartwatch.",
    "The cheapest we'd previously seen Fitbit deals dropping this model to was $245, and that sales price has only been seen once before, in April. Usually, you would be looking at between $260 and $320 for this model.",
    "Even with the discounts, the Fitbit Sense is still a premium smartwatch, going up against the likes of the Apple Watch SE and Samsung Galaxy Watch 3 in its price range. If, however, you're looking for a massive spectrum of health stats over the iPhone compatibility of the Apple Watch or the durability and classic design of the Samsung Galaxy Watch, this is an excellent buy.",
    "This Fitbit Sense deal also brings the powerful smartwatch well below its competitors in price right now, making for a compelling all-in-one package. However, if you need LTE compatibility or you're not interested in the Fitbit Premium subscription (optional but necessary for a few key features), we'd recommend picking up another option.",
    "Not in the US? Scroll down for more Fitbit sales and other smartwatch deals in your region.",
    "If the Fitbit deals above don't suit, iPhone users may want to check out the Apple Watch deals below. The Apple Watch SE comes in at a similar price to the Fitbit Sense but does offer extra iOS compatibility, a wide range of apps, and an LTE option. However, you're dropping some of the key health features that Fitbit has to offer while also losing a little screen size as well.",
    "Typically a little pricier than the Fitbit Sense and Apple Watch SE (though currently on sale), the Samsung Galaxy Watch 3 features a far more classic design, with a circular watch face that will blend a little better. Samsung's model also offers enhanced durability, extra size options, as well as fall detection on top of a range of fitness and health monitoring features. However, it's worth noting you're dropping a little battery life here, down to two or three days versus Fitbit's six.",
    "Of course, we expect to see far more smartwatch deals in this year's upcoming Amazon Prime Day deals. However, for something a little sooner, keep an eye out for the latest Memorial Day sales."
  ],
  "headers": {
    "5": "More smartwatch deals"
  },
  "links": {
    "at just $239.99 (was $329.95)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFitbit-Advanced-Smartwatch-Management-Temperature%2Fdp%2FB08DFLG5SP%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6012195976014920000-20",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Fitbit sales": "https://www.techradar.com/news/cheap-fitbit",
    "Apple Watch deals": "https://www.techradar.com/news/cheap-apple-watch-deals",
    "smartwatch deals": "https://www.techradar.com/deals/smartwatch-deals-sales-prices",
    "Amazon Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021"
  }
}