{
  "source": "https://www.techradar.com/news/netflix-may-go-all-in-on-gaming-says-report",
  "title": "Netflix may go all-in on gaming, says report (updated)",
  "category": "gaming",
  "updated": "2021-05-21T16:10:43Z",
  "author": "henry-st-leger",
  "summary": "Video games on Netflix? It just might work",
  "article": [
    "Update: A Netflix spokesperson sent over this statement after we published the story below. \"Our members value the variety and quality of our content. It’s why we’ve continually expanded our offering - from series to documentaries, film, local language originals and reality TV. Members also enjoy engaging more directly with stories they love - through interactive shows like Bandersnatch and You v. Wild, or games based on Stranger Things, La Casa de Papel and To All the Boys. So we’re excited to do more with interactive entertainment.\"",
    "Original story: Netflix may be putting together a new gaming division, if latest reports are anything to go by.",
    "The Information has reported that \"Netflix is looking to hire an executive to oversee an expansion into videogames, a sign it is stepping up its efforts to grow beyond traditional filmed entertainment, according to people familiar with the situation.\" (The report is stuck behind quite a high paywall, just to warn you, though Reuters has condensed it.)",
    "There's no official job listing for this role (at least, not that we've spotted), but the report's authors claim that various gaming industry execs have been approached about a potential role at the company.",
    "It won't be the first foray into games from Netflix, with crossovers found in the Stranger Things video game, or even the number of choose-your-own-adventure flicks on the platform, like Black Mirror: Bandersnatch, or even the finale of The Unbreakable Kimmy Schmidt.",
    "But it does sound like Netflix may have even bigger things in store.",
    "If the report is true, it shows a somewhat different stance from Netflix, which appeared to keep a respectful distance from game development for the most part, being content to adapt hit game franchises into flagship series like The Witcher, or titles based on Tomb Raider or even Resident Evil.",
    "CEO Reed Hastings has acknowledged the draw of big games like Fortnite, acknowledging that the battle royale shooter is a bigger competitor for users' time than any of the other big TV streaming services: “We compete with (and lose to) Fornite more than HBO.”",
    "Back in 2019, though, Hastings spoke at the New York Times' Dealbook conference, and made it clear that, despite increased interest in game streaming by many major players in the tech and entertainment worlds (Google Stadia, Project xCloud) Netflix wasn't planning on getting in on the action.",
    "\"We're really focused on doing incredible series and films and unscripted,\" Hastings said, shutting down the idea of Netflix setting up a standalone platform just for streaming games.",
    "We don't know for sure whether Netflix would be looking to publish its own games based on existing Netflix IP, or offer something of a platform for third-party titles. The report does state that \"One option the company has discussed is offering a bundle of games\" in a similar vein to Apple Arcade. Apparently, the games won't feature advertising, the report says.",
    "Netflix is the master of the casual binge, and we don't expect to see it releasing long-haul open-world games, as such. More plausible are downloadable games, in the same way Netflix subscribers can download episodes for offline viewing, but we'd be surprised if game streaming wasn't a big part of Netflix's strategy going forward – streaming being the technology that Netflix is built on, after all.",
    "One issue Netflix has been mindful of is the quality of users' internet connections – it offers a low-resolution basic plan that lets viewers watch its content without needing a high-speed fibre optic connection, while more recently we've seen Netflix offer mobile-only streaming plans to ensure that subscribers can gain easy (and cheap) access to low-resolution content on a small screen.",
    "Gaming will only be more demanding on home internet, though rising connection speeds and external server hosting for game streams (as with Google Stadia) may offer a solution here.",
    "A big part of Netflix's streaming strategy over the past few years has been in producing its own content – ensuring it doesn't have to pay as many licensing fees to other studios, and can rely increasingly on Netflix-made content.",
    "If Netflix is looking to delve more into gaming, then, it might be that we see it create its own in-house studio, though the failure of other players in this area should possibly give it pause.",
    "Amazon has famously spent years failing to get its gaming division in order, with multiple cancelled projects including team shooter Crucible (which only got as far as Early Access) and a highly problematic / colonial MMO called New World.",
    "Gaming may be where the money is, but Netflix would do well to defer to some established developers if it's looking to bring gaming to its homescreen."
  ],
  "headers": {
    "6": "Swimming upstream",
    "14": "Owning it"
  },
  "links": {
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1251615402243214600&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Fnetflix-seeks-executive-to-expand-game-efforts&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnetflix-may-go-all-in-on-gaming-says-report",
    "Reuters": "https://www.reuters.com/technology/netflix-looking-hire-executive-gaming-expansion-information-2021-05-21/",
    "Black Mirror: Bandersnatch": "https://www.techradar.com/news/the-black-mirror-movie-bandersnatch-hits-netflix-on-december-28-2018",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Tomb Raider": "https://www.techradar.com/news/netflix-is-making-a-tomb-raider-animated-tv-show",
    "Resident Evil": "https://www.techradar.com/news/netflixs-resident-evil-series-gets-an-intense-new-trailer-and-release-date",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "TV streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "New York Times' Dealbook conference": "https://www.youtube.com/watch?v=8oVl3gyIaeI",
    "mobile-only streaming plans": "https://www.techradar.com/news/netflix-tries-out-a-mobile-only-streaming-plan-as-subscriber-growth-slows",
    "which only got as far as Early Access": "https://www.techradar.com/news/amazons-crucible-game-takes-a-pause-to-stay-in-pre-season-phase",
    "highly problematic / colonial MMO called New World": "https://www.techradar.com/news/amazons-colonialist-mmo-shouldnt-exist-but-for-reasons-other-than-controversy"
  }
}