{
  "source": "https://www.techradar.com/news/red-dead-redemption-2-gets-nvidia-dlss-support-to-make-it-run-better-on-your-pc",
  "title": "Red Dead Redemption 2 gets Nvidia DLSS support to make it run better on your PC",
  "category": "gaming",
  "updated": "2021-07-07T16:26:14Z",
  "author": "darren-allan",
  "summary": "Red Dead Online’s big ‘Blood Money’ update next week brings in DLSS",
  "article": [
    "Red Dead Redemption 2 and the multiplayer spin Red Dead Online will very soon get support for Nvidia DLSS.",
    "Rockstar announced that Red Dead Online is set to get a big update for the summer by the name of ‘Blood Money’ which arrives on July 13 and will also pack DLSS functionality.",
    "That means the single-player and online games will benefit from smoother frame rates thanks to Nvidia’s clever AI-powered upscaling chops – although naturally you’ll need an RTX graphics card.",
    "DLSS is slowly coming to more big-name games on the PC and lately that includes Rainbow Six Siege, Call of Duty: Warzone and Doom Eternal. It’s very much a case of the more, the merrier, because DLSS really does shift things up a gear in performance terms with supported titles.",
    "The Blood Money update for Red Dead Online introduces ‘crimes’, a fresh type of work that can be tackled solo or with a group, and includes the ability to carry out multistage robberies among other nefarious deeds.",
    "Free Roam mode will also open up the possibility of pillaging camps and homesteads.",
    "Further bits and pieces coming with the July 13 update include ‘Quick Draw Club’ passes, of which there will be four. Rockstar notes: “Purchasing each membership entitles you to rewards, bonuses, and items to help live life on the fringe of the law – starting with Dutch’s outfit, The Redcliff. With each consecutive pass you purchase, you’ll earn additional perks and rewards for continuing the journey.”",
    "Those who buy the full complement of four passes will get a neat freebie, namely the incoming Halloween Pass 2."
  ],
  "headers": {
    "4": "It’s a crime…"
  },
  "links": {
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-is-now-vr-compatible-but-theres-a-catch",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-on-linux-is-straight-up-witchcraft-and-pulls-ever-closer-to-windows",
    "Rainbow Six Siege": "https://www.techradar.com/news/nvidia-dlss-22-has-already-been-silently-released-in-rainbow-six-siege",
    "Doom Eternal": "https://www.techradar.com/news/nvidia-dlss-has-arrived-on-linux-will-this-tempt-gamers-to-switch-from-windows-10",
    "notes": "https://www.rockstargames.com/newswire/article/9k1o55a5475aka/earn-your-blood-money-across-a-series-of-daring-robberies"
  }
}