{
  "source": "https://www.techradar.com/news/elden-ring-can-be-challenging-but-that-doesnt-mean-it-should-be-inaccessible",
  "title": "Elden Ring can be challenging - but that doesn't mean it should be inaccessible",
  "category": "gaming",
  "updated": "2021-06-17T12:00:34Z",
  "author": "samuel-tolbert",
  "summary": "FromSoftware's signature style won't be diluted by making the game more approachable.",
  "article": [
    "It's safe to say Elden Ring is one of the most-anticipated games in hardcore gaming circles. It's not an unfounded hype either, as Japanese studio FromSoftware has earned its hardcore audience through games like Dark Souls, Bloodborne and Sekiro: Shadows Die Twice, games lauded for their brilliant gameplay mechanics, and near-unrelentingly brutal gameplay. It's a game I'm extremely excited for — but I hope others can be too.",
    "I'm not interested in rehashing the tired arguments that resurface every time a game based around challenging difficulty is released. Instead, I want to emphasize that FromSoftware can keep its artistic vision intact and still provide meaningful accessibility options.",
    "The industry as a whole is getting better about this, to an extent. It's rare I see a big AAA game launch without colorblindness options or subtitle size settings but there's far more that can be done, options that would be especially meaningful in a game based around providing a rewarding experience through difficult opposition.",
    "In particular, I'd point to Gears 5 and The Last of Us Part 2 at stellar examples of big games providing accessibility options. Just a few things above the basics would be a good start, such as audio cues for those with poorer vision that might miss and otherwise be unable to react to specific animations with incredibly small windows, or on the flip side, small visual icons for players that are hard-of-hearing to key in on, so they never feel like they're at a disadvantage when fighting the different monsters, dragons and demigods the developers have in store.",
    "FromSoftware has some of the most brilliant game designers around, so I'm sure they can figure out different options that would enable people who don't meet the same physical demands to still enjoy the game.",
    "I want to see Elden Ring played by as many people as possible, including those players with disabilities who may have been cautious about approaching this studio's games in years past. They deserve to be treated as equals to others already in the FromSoftware audience. The only way that can happen is by providing specific options for them.",
    "Thematically, it makes sense for this game to be a starting point of inclusivity as well. While the reveal trailer makes it clear that Elden Ring is drawing on the past influences of multiple games, especially Dark Souls 3 and Sekiro: Shadows Die Twice, it's also something new. A new beginning of a world for players to explore, a world that's been written in part by A Song of Ice and Fire author George R.R. Martin, which will no doubt draw in many curious newcomers. It's the perfect time to be as welcoming as possible.",
    "There are many oft-overused memetic phrases eagerly embraced by the \"Soulsborne\" crowd (myself included) such as Git Gud and Jolly Cooperation. The latter in particular is a rallying cry of the games as veteran players help guide newcomers. With four-player co-op confirmed to be a part of Elden Ring, we're not going to achieve true Jolly Cooperation unless as many players as possible are included in this exciting new world."
  ],
  "headers": {},
  "links": {
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review",
    "The Last of Us Part 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "four-player co-op confirmed": "https://www.techradar.com/news/elden-ring-supports-four-player-online-multiplayer"
  }
}