{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s8-leaks-are-focusing-on-what-but-not-why",
  "title": "Samsung Galaxy Tab S8 leaks are focusing on 'what', but not 'why'",
  "category": "tablets",
  "updated": "2021-09-17T09:02:25Z",
  "author": "tom-bedford",
  "summary": "More of the same leaks",
  "article": [
    "The Samsung Galaxy Tab S8 is expected to launch alongside the Galaxy S22 series in early 2022, and the biggest news surrounding the series is that it could get a top-tier 'Ultra' entry alongside the standard and Plus ones, which previous Galaxy Tabs have come in.",
    "A new leak from popular leaker Ice Universe has provided some details of the Ultra tablet: apparently it'll have a 2960 x 1848 resolution, an 11,500mAh battery, and a 14.6-inch screen. Those are all things we'd already heard, save for the resolution, which we could basically guess based on the screen size.",
    "So no news here, just the same top specs being repeated again and again - even Ice Universe has provided this information before. But something is missing: while we've heard the Samsung Galaxy Tab S8 Ultra's specs time and time again, we're still waiting for an explanation as to why we need them in the first place.",
    "If the repeated rumors of the Galaxy Tab S8 Ultra's 14.6-inch screen are true, that'll end up being the biggest tablet on the market by some margin, much bigger than the 12.9-inch iPad Pro.",
    "When it comes to tech 'bigger' and 'better' are linked tangentially if at all, and when we hear the 14.6-inch display rumors, we're not thinking 'wow that's big, it must be cool', but 'why do I need a tablet that big?'.",
    "A tablet with a 12.something screen, like the iPad Pro or Samsung Galaxy Tab S7 Plus, is generally more than enough for most use cases like gaming, streaming movies or split-screening tabs for work. An extra two inches feels like unnecessary heft.",
    "We need to start hearing rumors that don't reiterate the same claims, but explain why we need a screen this big. After all, the biggest complaint people make about Android tablets is that the software doesn't always work intuitively on bigger screens.",
    "Hopefully, Samsung has developed tweaks and changes to stock Android so that the software works better on the big screen, and so that the 14.6-inch panel doesn't exacerbate Android's existing tablet issues.",
    "We've seen similar solutions recently on the Xiaomi Pad 5, where the company developed a fork of its MIUI software to work on the Pad, with changes to the notification list and multi-screening apps that make the software smoother to use on the big screen.",
    "Samsung really needs to have something similar planned, so the 14.6-inch Galaxy Tab S8 Ultra feels like a useful work device, instead of a novelty super-big slate for people with more money than sense, that coasts on its big size rather than its usefulness for tasks."
  ],
  "headers": {
    "3": "Analysis: 'what' but not 'why'"
  },
  "links": {
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Ice Universe": "https://twitter.com/UniverseIce/status/1438410266778030085",
    "12.9-inch iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Samsung Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Xiaomi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review"
  }
}