{
  "source": "https://www.techradar.com/news/google-cloud-announces-new-suite-of-data-products",
  "title": "Google Cloud announces new suite of data products",
  "category": "computing",
  "updated": "2021-05-26T17:16:16Z",
  "author": "mayank-sharma",
  "summary": "Google has previewed three new services",
  "article": [
    "Google Cloud has previewed three new cloud database and cloud analytics services to help customers architect unified data platforms.",
    "The three services, named Datastream, Dataplex and Analytics Hub, were announced at Google’s inaugural Data Cloud Summit.",
    "Quoting a recent Gartner survey that found poor data quality costs organizations millions of dollars every year, Google says the new solutions will help companies not just break free from data silos, but also generate actionable insights.",
    "“Data must be thought of as an ability that integrates all aspects of working with it. Every industry is accelerating their shift of being digital-first as they recognize data is the essential ingredient for value creation and the key to advancing their digital transformation,” said Google Cloud’s Vice President and General Manager of Databases, Data Analytics and Looker, Gerrit Kazmaier.",
    "The first of the new services, Datastream, is a serverless data capture and replication service that will essentially help businesses feed data from Oracle and MySQL databases into any of the various Google Cloud services, in real time.",
    "Then there’s Dataplex, which reportedly combines the best of the Google Cloud Platform and open source to help businesses manage, monitor, and analyze data at scale across data lakes, data warehouses and databases.",
    "Finally, there’s Analytics Hub, built atop BigQuery, which businesses can use to share data sets and models.",
    "All three services are currently available in preview, presumably to a select few clients, and its not yet clear when they will enter general availability."
  ],
  "headers": {
    "4": "The new services"
  },
  "links": {
    "cloud database": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "databases": "https://www.techradar.com/best/best-database-software"
  }
}