{
  "source": "https://www.techradar.com/news/you-might-soon-be-able-to-pay-for-your-amazon-purchases-with-bitcoin",
  "title": "You might soon be able to pay for your Amazon purchases with Bitcoin",
  "category": "computing",
  "updated": "2021-07-26T18:41:24Z",
  "author": "anthony-spadafora",
  "summary": "Bitcoin support is reportedly coming to Amazon soon",
  "article": [
    "Amazon is preparing to accept payments in Bitcoin by the end of this year though the ecommerce giant is also working on developing its own digital token according to a source familiar with the matter.",
    "As first reported by City AM, the news outlet discovered one of the company's job listings over the weekend looking for a “cryptocurrency and blockchain lead”.",
    "While AWS already offers a number of blockchain programs and services, this is the first time that Amazon itself has expressed an interest in adopting cryptocurrencies.",
    "According to the job posting, the company is looking for someone that can “leverage domain expertise in blockchain, distributed ledger, central bank digital currencies and cryptocurrency”. However, Amazon also wants to “develop the case for the capabilities which should be developed, drive overall vision and product strategy, and gain leadership buy-in and investment for new capabilities”.",
    "Although the job posting discovered by City AM doesn't mention that Amazon will accept cryptocurrencies outright, the news outlet also spoke with an insider who provided further insight on the ecommerce giant's plans regarding crypto, saying:",
    "“This isn’t just going through the motions to set up cryptocurrency payment solutions at some point in the future – this is a full-on, well-discussed, integral part of the future mechanism of how Amazon will work. Ethereum, Cardano and Bitcoin Cash will be next in line before they bring about eight of the most popular cryptocurrencies online. It won’t take long because the plans are already there, and they have been working on them since 2019.”",
    "While Jeff Bezos is no longer the CEO of Amazon, apparently the company's plan to accept Bitcoin and other cryptocurrencies comes directly from him and is integral to its future.",
    "Once Amazon has added support for a number of cryptocurrencies, it could also create its own native token according to the insider. However, whether or not the company decides to go through with these plans will depend on how successful its rollout of Bitcoin payment support goes.",
    "We'll have to wait for a formal announcement from Amazon to be sure but you could possibly soon be paying for goods and services on its online marketplace using Bitcoin.",
    "Via ITPro"
  ],
  "headers": {
    "4": "Making payments in cryptocurrency"
  },
  "links": {
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "first reported": "https://www.cityam.com/amazon-definitely-lining-up-bitcoin-payments-and-token-confirms-insider/",
    "AWS": "https://www.techradar.com/news/aws",
    "blockchain programs and services": "https://www.techradar.com/news/aws-blockchain-service-now-interoperable-with-ethereum",
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "CEO of Amazon": "https://www.techradar.com/news/amazon-ceo-jeff-bezos-to-step-down-after-26-years-heres-whats-next",
    "online marketplace": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "ITPro": "https://www.itpro.co.uk/business/business-operations/360356/amazon-set-to-accept-cryptocurrencies-payments"
  }
}