{
  "source": "https://www.techradar.com/news/exclusive-the-most-popular-vpn-services-on-android-might-just-surprise-you",
  "title": "Exclusive: The most popular Android VPN apps might just surprise you",
  "category": "computing",
  "updated": "2021-03-30T12:48:35Z",
  "author": "joel-khalili",
  "summary": "The largest VPN companies in the world are nowhere to be seen",
  "article": [
    "Although there are hundreds of VPN services out there to choose from, companies such as ExpressVPN, NordVPN and Surfshark dominate the market from a brand recognition perspective.",
    "However, data shared exclusively with TechRadar Pro suggests this isn't necessarily a reliable indicator of popularity. According to app intelligence company 42matters, when it comes to the most popular Android VPN services, these renowned providers are nowhere to be seen.",
    "In February, an app called VPN Master was the most popular VPN service on the Google Play Store, downloaded by more than 7 million people across the month. In second place was Speed VPN Pro with 6.7 million downloads, followed by Free VPN Tomato with 6.2 million.",
    "A common theme soon becomes apparent: all of the most popular VPN apps are free to use. Of the top 15 most downloaded Android VPNs last month, none are paid services.",
    "Although free VPNs offer a quick (and obviously cost-effective) way to conceal your browsing activity from your ISP, there are a number of drawbacks to consider. After all, there’s no such thing as a free dinner.",
    "Unlike premium services, free VPNs usually offer only a limited number of servers in a small selection of locations and the apps themselves are rarely feature-rich. Download speeds are also likely to be much lower, which means streaming geo-restricted VOD content (one of the main reasons users seek out a VPN) may be off the table from the get-go.",
    "Perhaps the most important consideration, however, is data privacy. Although many free VPNs have extensive no-logging policies, you cannot be certain the provider lives up to its promises unless a third-party audit has taken place.",
    "Without independent confirmation, the company operating the free VPN service could be collecting all manner of information, including websites visited, connection timestamps, bandwidth usage and even original IP address.",
    "For anyone using a VPN to circumvent government-mandated internet censorship, the potential this kind of information could be held by the provider should be a serious concern.",
    "In July 2020, for example, it was discovered that seven separate Hong Kong-based VPN services had been gathering user data, despite all claiming to collect no user logs. More than one terabyte of this data was exposed online via an unprotected database.",
    "Ultimately, running a VPN service is not cheap, so the for-profit company operating your free VPN service is likely to be making money out of you somehow.",
    "The figures below represent the number of downloads of each VPN application via the Google Play Store in February 2021."
  ],
  "headers": {
    "4": "Are free VPNs too good to be true?",
    "11": "Top 10 most popular Android VPNs"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "Android VPN": "https://www.techradar.com/vpn/best-vpn-for-android-our-5-top-choices",
    "free VPNs": "https://www.techradar.com/vpn/best-free-vpn",
    "gathering user data": "https://www.techradar.com/vpn/best-vpn"
  }
}