{
  "source": "https://www.techradar.com/news/disney-and-advertising-giants-pledge-to-strip-targeted-ads-from-childrens-apps",
  "title": "Disney and advertising giants pledge to strip targeted ads from children's apps",
  "category": "computing",
  "updated": "2021-04-14T13:00:58Z",
  "author": "sead-fadilpasic",
  "summary": "Class-action lawsuits could prompt industry-wide change",
  "article": [
    "Disney and Viacom, together with a group of advertising firms, have settled three class-action lawsuits requiring them to make substantial changes to advertising that targets children via mobile apps.",
    "As reported by the New York Times, the companies were accused of “insidious and manipulative forms of marketing\". They were said to have added tracking software into mobile games played by children, in violation of both state privacy and fair business practice laws.",
    "The lawsuits claimed these trackers could be used to profile children, who could then be targeted with ads and encouraged to make in-app purchases.",
    "A judge at the US District Court for the Northern District of California has now approved a settlement which will see the companies remove or disable the relevant tracking software.",
    "“This is going to be the biggest change to the children’s app market that we’ve seen that gets at the business models,” said Josh Golin, Executive Director of the Campaign for a Commercial-Free Childhood. “On thousands of apps, children will no longer be targeted with the most insidious and manipulative forms of marketing.”",
    "This does not mean children’s apps and mobile games will be devoid of any advertising, however; the companies will still be allowed to show ads based on the app’s content.",
    "Despite agreeing to settle, the companies did not admit to any wrongdoing. Viacom (owner of the Llama Spit Spit game), Kiloo (co-developer of Subway Surfers), and Disney (owner of multiple apps available in the US) are yet to comment.",
    "The Federal Trade Commission has been seeking to better regulate advertising in children’s apps for quite some time now and will hope these latest lawsuits can prompt genuine industry-wide change.",
    "Via New York Times"
  ],
  "headers": {
    "3": "Industry-wide change"
  },
  "links": {
    "in-app purchases": "https://www.techradar.com/news/best-mobile-payment-app",
    "New York Times": "https://www.nytimes.com/2021/04/13/technology/advertising-children-privacy.html"
  }
}