{
  "source": "https://www.techradar.com/news/apple-app-store-is-apparently-still-littered-with-malicious-apps",
  "title": "Apple App Store is apparently still littered with malicious apps",
  "category": "phones",
  "updated": "2021-02-09T15:59:55Z",
  "author": "mike-moore",
  "summary": "Multi-million dollar scams are operating in plain sight, expert claims",
  "article": [
    "Apple's App Store may be playing host to a number of scam apps that are raking in millions for criminals across the world, a developer has claimed.",
    "Kosta Eleftheriou says that a host of malicious apps are present on the App Store, and has accused Apple of failing to act and protect its users.",
    "Many of the scam apps follow the same formula, Eleftheriou says, with fake reviews and ratings helping to boost their status on the App Store and lure in more vicitims.",
    "Eleftheriou, a developer who has created several hit services for Apple devices, has highlighted a number of suspect apps over the past few weeks on his Twitter account.",
    "One of the most prevalent suspects is an app called KeyWatch, which Eleftheriou says is a blatant copy of his own FlickType Apple Watch keyboard typing tool. He noted that KeyWatch initially launched as a shell app, with no actual functionality, but once his own service began growing in popularity, the scammers advertised their own service using video of his original app masquerading as their work.",
    "However, when downloading the fake app, users were confronted with a blank interface except for an \"Unlock now\" button, which when clicked directed to an Apple purchase page where users were told they could download the full service for $8 a week. This app was boosted with fake app ratings and reviews, purchased from fellow criminals in bulk, and according to Eleftheriou was making around $2 million a year.",
    "“It’s surprising more people don’t know about this. The extent to which this has been going on and is currently going on is absolutely mind-blowing,” Eleftheriou told The Verge. “In particular now with the App Store, which is my main concern, the problem has grown to such an extent that having the rating and review system is making it worse. It gives consumers a false sense of security and a false idea that the app is great as you’re entering it through a glowing App Store page with raving reviews.”",
    "Following Eleftheriou's initial findings, Apple removed KeyWatch and several other scam apps, but has yet to take action against other services from the same developer, a company called ReadIQ.",
    "Eleftheriou has since highlighted several other scam apps on the App Store, under the thread, \"How to spot a $5M/year scam on the @AppStore in 5 minutes flat\". Several other top app developers and companies have chimed in with their experiences of similar rip-offs, and called on Apple to take more action.",
    "“I’m not gonna stop. Whenever I see a scam, I’m going to call them out,” Eleftheriou went on to tell The Verge. “I just can’t wait for some actual proper change from Apple to make me feel like I should concentrate on what I should be concentrating on, which is app development.”",
    "Via The Verge"
  ],
  "headers": {
    "3": "App Store scam apps"
  },
  "links": {
    "App Store": "https://www.techradar.com/news/best-free-iphone-apps",
    "Twitter account": "https://twitter.com/keleftheriou/status/1357938977748078594?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1357938977748078594%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.theverge.com%2F2021%2F2%2F8%2F22272849%2Fapple-app-store-scams-ios-fraud-reviews-ratings-flicktype",
    "The Verge": "https://www.theverge.com/2021/2/8/22272849/apple-app-store-scams-ios-fraud-reviews-ratings-flicktype?scrolla=5eb6d68b7fedc32c19ef33b4"
  }
}