{
  "source": "https://www.techradar.com/news/adobe-photoshop-now-runs-natively-on-windows-10-arm",
  "title": "Adobe Photoshop now runs natively on Windows 10 ARM",
  "category": "computing",
  "updated": "2021-05-17T16:37:05Z",
  "author": "daryl-baxter",
  "summary": "Adobe gains another ARM",
  "article": [
    "Adobe has removed the beta tag from Photoshop thanks to a recent update, which enables the application to work natively on ARM devices.",
    "Back in November 2020, Adobe committed to bringing its Creative Cloud suite of apps to Windows ARM devices, in order to run natively on ARM hardware. This began with Photoshop being released in a beta version.",
    "Now however, Photoshop on ARM devices is ready to go, albeit with some limitations for Creative Cloud members.",
    "Back in 2016, Microsoft announced that work had begun on Windows 10 ARM, which runs on the same chip as many Android smartphones, alongside Apple’s iPhones, iPads, and new Apple M1 Macs.",
    "This was actually its second foray into making Windows available on ARM devices, as it had released Windows RT back in 2012, but that OS was incredibly limiting, mainly due to the fact that there were only a handful of apps to download, and only from the Windows Store.",
    "Now though, this second iteration looks to be much less convoluted and easier to use. ARM architecture as a whole allows for much longer battery life, faster results in exporting content, and much more.",
    "Launch the Creative Cloud Suite app, and there will be an option to download and install Photoshop ARM on your device.",
    "It should be noted however, that not all features are available as yet. Some such as embedded video layers, a Shake Reduction filter, and more aren’t included at the moment, but Adobe have noted that they will be in future releases.",
    "Via NeoWin"
  ],
  "headers": {
    "3": "What is Windows ARM?",
    "6": "How to download Photoshop on ARM"
  },
  "links": {
    "limitations": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-1005507569486875400&url=https%3A%2F%2Fhelpx.adobe.com%2Fphotoshop%2Fkb%2Fwindows-arm-support.html",
    "not all features are available": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-3908241205424799000&url=https%3A%2F%2Fhelpx.adobe.com%2Fphotoshop%2Fkb%2Fwindows-arm-support.html",
    "NeoWin": "https://www.neowin.net/news/adobe-photoshop-now-runs-natively-on-windows-10-on-arm/"
  }
}