{
  "source": "https://www.techradar.com/news/get-unlimited-data-and-pound100-cashback-with-these-cheap-samsung-galaxy-s21-deals",
  "title": "Get unlimited data and £100 cashback with these cheap Samsung Galaxy S21 deals",
  "category": "phones",
  "updated": "2021-06-17T11:15:59Z",
  "author": "alex-hughes",
  "summary": "Costing just £34.99 a month, this is a fantastic offer",
  "article": [
    "Samsung Galaxy S21 deals have come down in price considerably since they first launched back in January this year. However, out of all of the contracts we've seen on this device, iD Mobile's latest offer is easily one of the best.",
    "iD Mobile is offering the Samsung Galaxy S21 for just £34.99 a month. That's one of the cheapest prices on the market right now for this device. Despite that low price point, iD is supplying a completely unlimited data, calls and texts plan.",
    "Reducing that price even further, Samsung is currently offering £100 in cashback when you purchase this device. That effectively brings the cost of this device down to around £30.82 a month.",
    "Samsung Galaxy S21: The cheapest of the three handsets in Samsung's flagship series, the S21 is a 5G handset at a price that rivals the iPhone 12 and is much cheaper than the S20 was on launch.",
    "Despite that lower price tag, you're getting Samsung's new Exynos 2100 processor. That's a super-powerful chip powering Samsung's already impressive camera software and operating system.",
    "The camera is an incremental upgrade on what the S20 provided, boosting the 8K video software, super steady video, and an improved 60fps 'Director's View'. Thanks to the new processor, the camera's AI software is working better than ever.",
    "However, Samsung hasn't managed to improve the battery capacity which could prove a problem with all of this new software.",
    "iD Mobile doesn't quite have the name recognition of Three or EE, but it's actually Carphone Warehouse's very own network. It specialises in affordable plans and while it normally offers smaller data plans for low costs, it has gone all out for this unlimited data offer.",
    "iD piggybacks off the Three network. This means you'll get exactly the same speeds, coverage and reach that is offered by Three.",
    "On top of this, there is the obvious benefits of the 1-month rolling contracts on certain plans, use of tethering, unlimited calls and texts and roaming in 50 destinations across the world."
  ],
  "headers": {
    "3": "What's the Samsung Galaxy S21 range like?",
    "7": "Is iD Mobile a good network?"
  },
  "links": {
    "Samsung Galaxy S21 deals": "https://www.techradar.com/deals/best-samsung-galaxy-s21-deals",
    "for just £34.99 a month": "https://eur01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.idmobile.co.uk%2Fbuy%3Fdeal%3D108902501%26affiliate%3Didmobile-hidden&data=04%7C01%7Charry.brookebarnett%40awin.com%7C62b9af28fee1443431f308d9302678ab%7C5a9ab2d37b5845259851d1727266bad7%7C0%7C0%7C637593764049651122%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=%2FlY7%2B5U1slzvaq%2B7mZbJ9wUasyq1wdvBb%2F69I7xnwwk%3D&reserved=0",
    "£100 in cashback": "https://www.awin1.com/awclick.php?awinmid=17946&awinaffid=103504&clickref=trd-us-1640843562358200000&p=https%3A%2F%2Fwww.samsung.com%2Fuk%2Fcashback-offer%2F",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}