{
  "source": "https://www.techradar.com/news/intel-arc-gpus-could-finally-give-amd-and-nvidia-something-to-worry-about",
  "title": "Intel Arc GPUs could finally give AMD and Nvidia something to worry about",
  "category": "computing",
  "updated": "2021-08-25T09:42:26Z",
  "author": "matt-hanson",
  "summary": "Overclocking support is planned",
  "article": [
    "Ever since we heard about Intel’s plans for dedicated Arc graphics cards, we’ve been wondering just how much of a threat they could be to Nvidia and AMD, but with news that the GPUs will offer some sort of support for overclocking, it looks like that threat level has just risen for the two established GPU makers.",
    "In case you’re not aware, overclocking is a process that allows users to push their hardware to their very limits and eke out even more performance. By overclocking your CPU or GPU, you can get some noticeable performance improvements for no extra cost.",
    "The process does have its risks, however, as if done incorrectly it can lead to components overheating, the PC becoming unstable and even (in some extreme cases) the components getting damaged. That’s why many manufacturers have tools that makes the process easier and safer.",
    "So, when Roger Chandler, Intel's Vice President and General Manager of Client Graphics Products and Solutions, mentions in a recent blog post that the company is “integrating overclocking controls into the driver UI to give enthusiasts the tools they need to push the hardware to the limit,” we got pretty excited.",
    "While Intel has been in the GPU game for a long while now, most noticeably with its integrated graphics that come with its processors, Intel Arc represents a more concerted effort to woo PC gamers and enthusiasts, a market that Nvidia and AMD dominate in.",
    "The news we’ve been hearing about Intel Arc has certainly been promising – including information that means it could take on the Nvidia RTX 3070 and AMD RX 6700 XT. The first Intel Arc GPU, codenamed 'Alchemist’, is due in the first quarter of 2022 and will offer features such as ray tracing lighting effects.",
    "The ability to overclock these GPUs in some capacity will make them more appealing to enthusiasts and gamers, then. This is Intel’s biggest challenge: breaking the gamer mindset that Nvidia and AMD GPUs are the only ones worth buying for the ultimate gaming experience.",
    "So, while overclocking won’t be the most important feature for a lot of people, it does show enthusiasts that Intel is getting serious, and that should worry Nvidia and AMD.",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "4": "Going for the enthusiasts"
  },
  "links": {
    "dedicated Arc graphics cards": "https://www.techradar.com/news/intel-arc-unveiled-but-how-will-it-stack-up-against-nvidia-and-amd",
    "mentions in a recent blog post": "https://medium.com/intel-tech/the-next-chapter-in-our-graphics-story-intel-arc-high-performance-graphics-f68e7d2dc068",
    "the Nvidia RTX 3070 and AMD RX 6700 XT": "https://www.techradar.com/news/intels-arc-gpu-could-defeat-the-nvidia-rtx-3070-and-amd-rx-6700-xt",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/intel-arc-overclocking"
  }
}