{
  "source": "https://www.techradar.com/news/star-trek-strange-new-worlds",
  "title": "Star Trek: Strange New Worlds: everything we know about the Star Trek prequel",
  "category": "entertainment",
  "updated": "2021-11-20T13:56:32Z",
  "author": "richard-edwards",
  "summary": "The latest intel on Original Series prequel Strange New Worlds – including release date speculation and the return of Uhura.",
  "article": [
    "Captain Christopher Pike, Spock and Number One have been exploring the cosmos even longer than Captain James T Kirk. Now Star Trek: Strange New Worlds is set to continue their story.",
    "The trio originally appeared in unaired Star Trek pilot ‘The Cage’, and went on to play key roles in Star Trek: Discovery’s second season. They proved so popular that the Trek overlords decided to bring them back for their own series.",
    "“When we said we heard the fans’ outpouring of love for Pike, Number One and Spock when they boarded Star Trek: Discovery, we meant it,” executive producer Alex Kurtzman told StarTrek.com. “These iconic characters have a deep history in Star Trek canon, yet so much of their stories have yet to be told.”",
    "Star Trek: Strange New Worlds will be set on board the legendary USS Enterprise, around a decade before Kirk takes command. And we now know that the show’s core trio will be joined by more familiar faces from the 1960s, including Nurse Chapel, Dr M'Benga and – most excitingly of all – the legendary Uhura, who'll be a cadet on the Enterprise in this prequel to the original series. Another member of the crew, La'an Noonien-Singh, has a surname with special resonance for Star Trek fans...",
    "Plot specifics are currently hidden behind Starfleet’s protective shields, but we do know that Star Trek: Strange New Worlds will be more episodic than Discovery and Picard, and is coming some time in 2022. Here’s everything we know about the latest eagerly anticipated Trek spin-off…",
    "What is it? A Star Trek: Discovery spin-off following the adventures of Captain Christopher Pike, science officer Spock and first officer Una Chin-Riley (better known as Number One) on the USS Enterprise, around a decade before James T Kirk takes command.",
    "Release date: Star Trek: Strange New Worlds is expected to release some time in 2022 – a spring debut is likely, after Star Trek: Discovery season 4 and Star Trek: Picard season 2 have aired.",
    "Cast: Alongside its familiar trio of lead characters (still played by Discovery's Anson Mount, Ethan Peck and Rebecca Romijn), six new crew members will be taking their places on the Enterprise bridge. Read more about them below.",
    "Having been held up by coronavirus delays, Star Trek: Strange New Worlds belatedly went into production in Toronto in March 2021. According to the City of Toronto website, the season will run for 10 episodes.",
    "In October 2021, star Anson Mount appeared in a video confirming that production on season one had wrapped.",
    "“All of our footage now gets to go over to our incredible post-production team to begin their process,” he said. “And hopefully we'll be getting something out to you some time... next year. Not exactly sure when but we'll figure it out and let you know.”",
    "Paramount Plus is yet to confirm officially when in 2022 the Star Trek: Strange New Worlds release date is going to be – though the streamer's chief content officer for scripted originals, David Nevins, did tell Deadline that, “Strange New Worlds will be on the air next spring”.",
    "With Star Trek: Discovery season 4 currently airing in the US and Canada, and Star Trek: Picard season 2 due to leave Spacedock in February 2022, it seems likely that Strange New Worlds will launch when they're both done – simply because the streaming service is unlikely to have two shows from its flagship Star Trek franchise airing simultaneously, and will probably air the three shows one after the other.",
    "The smart money, then, would be on the Star Trek: Strange New Worlds release date being some time in May.",
    "While we know Strange New Worlds will stream on Paramount Plus in the US, it may vary depending on where you are. The streamer is set to launch in the UK in 2022, and we'd expect to see Strange New Worlds debuting on there – especially after the recent controversial announcement that Discovery's fourth season has been shifted from its traditional international home on Netflix, to help launch Paramount Plus around the world.",
    "Disappointingly, Star Trek Day didn't unveil a full Star Trek: Strange New Worlds trailer. It did, however, provide a brief teaser introducing the cast. It also contains a few stills from the new series, including a glimpse at the new-look USS Enterprise uniforms – a modern riff on the classic gold, blue and uniforms we saw in ’The Cage’ and the original series.",
    "Going back even further in time, leads Anson Mount, Ethan Peck and Rebecca Romijn beamed in an announcement video in May 2020:",
    "As you’d expect, the party line was very much that the show exists because of fan demand. “Without you this wouldn’t be happening,” says Peck, while Mount explains a bit about the tone of the series. “[It’s] a classic Star Trek show that deals with optimism and the future.”",
    "The principal Star Trek: Strange New Worlds cast looks like this:",
    "Ever since Star Trek: Strange New Worlds was confirmed in 2020, we've known that three actors would be reprising their roles from Discovery.",
    "Anson Mount is back in the captain’s chair as Captain Christopher Pike. Meanwhile, after proving himself worthy of donning the pointy ears that once belonged to Leonard Nimoy, Ethan Peck returns as Spock. Rebecca Romijn continues as first officer/helmsperson Number One.",
    "A ‘start of production’ video released in March 2021 introduced five other members of the cast:",
    "The five new additions to the USS Enterprise bridge crew are Melissa Navia (from Dietland), Celia Rose Gooding (Jagged Little Pill), Christina Chong (Doctor Who, Line of Duty), Babs Olusanmokun (Black Mirror), and Jess Bush (Skinford).",
    "At the Star Trek Day panel in September 2021, it was finally confirmed who each of them would be playing. We also learned that the full name of Number One is Una Chin-Riley – the first time this has been confirmed in the character’s 55-year history.",
    "Intriguingly, three of the new cast members are playing characters established in the 1960s. The most famous of these roles goes to Celia Rose Gooding, who plays a younger version of Nyota Uhura, the Enterprise communications officer famously played by Nichelle Nichols in the original series and first six Star Trek movies. (Guardians of the Galaxy's Zoe Saldana took on the role in JJ Abrams' rebooted Trek.)",
    "Babs Olusanmokun plays Dr M'Benga (originally played by Booker Bradshaw), a character who filled in as the Enterprise's chief medical officer when Dr McCoy was absent in the original series. Jess Bush, meanwhile, inherits the role of Nurse Christine Chapel, who worked alongside McCoy in the Enterprise Sick Bay.",
    "Chapel is one of two Strange New Worlds characters who were originally played by Majel Barrett-Roddenberry back in the 1960s – the other is Number One, who made her one-and-only original vintage Trek appearance in 'The Cage'. (Barrett-Roddenberry also went on to play Lwaxana Troi and voice the Enterprise computers in The Next Generation.)",
    "Of the Trek newcomers, we can see that Bruce Horak's Hemmer is an Andorian – though the fact that he's wearing a red shirt – aka Star Trek's sartorial kiss of death – doesn't bode well for his life expectancy. The same could be said for Melissa Navia's Lt Erica Ortega.",
    "The most mysterious addition to the cast, however, is Christina Chong's La'an Noonien-Singh. The fact she shares a surname with The Wrath of Khan's Big Bad can't be a coincidence, but seeing as Trek canon tells us the cryogenically frozen 20th century villain won't be thawed out until after Kirk has taken command of the Enterprise, it's uncertain how they're connected. Perhaps she's a long-lost descendant...",
    "Star Trek: Discovery spoilers ahead – proceed with caution if you haven't seen season 2.",
    "Pike, Spock and Number One have been part of the Star Trek story even longer than James T Kirk – they were on board the Enterprise in original Star Trek pilot ‘The Cage’, unaired in the ’60s and set more than a decade before Kirk’s famous five-year mission. Jeffrey Hunter, Leonard Nimoy and Majel Barrett originated the three roles.",
    "While we know that the trio have been together at least three years by the time Star Trek: Strange New Worlds kicks off and that a tragic fate awaits Pike – more on that later – most of their voyages remain undocumented. That means it’s prime storytelling territory and – after the more serialized Discovery and Picard – a chance for Trek to get back to the standalone stories of its earlier years.",
    "“We’re going to try to harken back to some classical Trek values, to be optimistic, and to be more episodic,” executive producer Akiva Goldsman (and director of the Strange New Worlds pilot episode) told Varietyin May 2020. “Obviously, we will take advantage of the serialized nature of character and story building. But I think our plots will be more closed-ended than you’ve seen in either Discovery or Picard.”",
    "The ability to visit a huge galaxy of, well, strange new worlds, should allow the show to feel different from week to week – after all, this versatile formula is a big reason for the franchise’s longevity.",
    "“We want to do Star Trek in the classic mode; Star Trek in the way Star Trek stories were always told,” fellow EP Henry Alonso Myers said at a Star Trek Day panel (via TrekMovie). “It's a ship and it's traveling to strange new worlds and we are going to tell big ideas science fiction adventures in an episodic mode. So we have room to meet new aliens, see new ships, visit new cultures...\"",
    "Strange New Worlds won't be entirely devoid of serialization, however, as writer Akela Cooper explained: “While we'll have individual one-off plots, the character arcs are what's going to carry us through in a more serialized fashion. There's probably one point that we will be sprinkling through this series until we actually get to the episode. And that's all I can say about that.”",
    "Goldsman explained a bit more about the structure of the show in an interview with the Hollywood Reporter in April: “If you think back to the original [Star Trek] series, it was tonally more liberal – I don‘t mean in terms of politics but it could sort of be more fluid. Like sometimes Robert Bloch would write a horror episode. Or Harlan Ellison would have ‘City on the Edge of Forever’, which is hard sci-fi. Then there would be comedic episodes like 'Shore Leave’ or ‘The Trouble with Tribbles’. So [co-showrunner] Henry Alonso Myers and myself are trying to serve that. We’ve all become very enamored, myself included, with serialized storytelling. Picard is deeply serialized but Strange New Worlds is very much adventure-of-the-week, but with serialized character arcs.”",
    "Going on Mount’s performance in Discovery, Pike is the ideal captain for an optimistic mission of exploration. We can also expect to see a Spock more prone to displays of emotion than his Original Series counterpart, as the younger version of the character struggles to balance his logical Vulcan side with his human urges.",
    "Indeed, in ‘The Cage’, Number One was the more buttoned-up, logical member of the crew – her personality traits passing to the Vulcan when Star Trek went to series. “She's way more complex than y'all know,” actor Rebecca Romijn teased in the cast introduction video released on Star Trek Day, and she expanded on the theme in the panel.",
    "“'The Cage' being such an old pilot, the writers have this very unique opportunity where they've had this character that's existed since the beginning of the canon, but she's never been written,” Romijn pointed out. “I can't wait to find out how vast her skill set is. What are the arrows in her quiver? My number one question is, 'What's her backstory?’ [The writer's room] floated an idea for Number One's backstory that I'm not going to share right now because it blew my mind when they said it.”",
    "Despite being made more than half a century after the Original Series, the look of Star Trek: Strange New Worlds will echo those early ’60s designs – from the Enterprise starship interiors to the Starfleet uniforms.",
    "“It’s a fine line because, obviously, we want to keep continuity with the storytelling and the style, but we also want Strange New Worlds to be a different show,” Goldsman told the Hollywood Reporter. “It’s not Discovery. There are a few more reach-backs [to the Original Series] and the uniforms have been adjusted slightly, the sets are slightly different. Remember, the Enterprise existed as a little piece [of Star Trek: Discovery], but now it’s its own object. When you close your eyes and think of the key sets and situations that you think of the Original Series, that’s what we’re looking to do.”",
    "Intriguingly, at this point in the Star Trek timeline, Kirk and other members of the original crew must be out there somewhere in the universe, so the smart money would be on a few headline-grabbing (recast) guest appearances – as the older members of the Original Series line-up, McCoy and Scotty would seem prime candidates. We’d also be very surprised if James Frain doesn’t reprise his Discovery role as Spock’s dad, Sarek – though Starfleet regulations may prevent them from talking about Spock’s adoptive sister, Michael Burnham, after her top secret one-way mission to the distant future in Discovery.",
    "And then there’s Pike’s tragic story…",
    "When we meet him in Original Series two-parter ‘The Menagerie’, it’s revealed that he’s been left severely disabled by a radiation leak. In Discovery, he’s forced to endure a vision of that future, so it'll be intriguing to see how that knowledge preys on his mind, and how much it plays into Star Trek: Strange New Worlds’ story.",
    "“The most honest thing I can say is, I'm still figuring out,” Mount explained at Star Trek Day. “Pike didn't just learn how he dies, he learns in what circumstances. So we do know that at some point he's going to be presented with a promotion opportunity to Fleet Captain. And he has to accept that in order for the fate to come into existence. So what is it that's going to allow him, both in terms of circumstance and emotion, to accept that promotion? It's a tough question but I think we'll figure it out together.”"
  ],
  "headers": {
    "8": "Star Trek: Strange New Worlds release date: spring 2022",
    "15": "Is there a Star Trek: Strange New Worlds trailer?",
    "18": "Star Trek: Strange New Worlds cast: who’s beaming onto the Enterprise bridge?",
    "29": "What can we expect to see in the Star Trek: Strange New Worlds story?"
  },
  "links": {
    "StarTrek.com": "https://intl.startrek.com/news/star-trek-strange-new-worlds-anson-mount-rebecca-romijn-ethan-peck-cbs-all-access",
    "City of Toronto website": "https://www.toronto.ca/business-economy/industry-sector-support/film/current-productions-and-news/",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "Deadline": "https://deadline.com/2021/11/paramount-plus-programming-plans-future-david-nevins-interview-paramount-tv-studios-dexter-new-blood-fatal-attraction-grease-1234869202/",
    "Star Trek: Discovery season 4": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Star Trek: Picard season 2": "https://www.techradar.com/news/star-trek-picard-season-2",
    "recent controversial announcement": "https://intl.startrek.com/news/star-trek-discovery-moves-to-paramount-internationally",
    "Variety": "https://variety.com/2020/tv/news/star-trek-strange-new-worlds-spock-pike-episodic-1234608181/",
    "TrekMovie": "https://trekmovie.com/2020/09/08/star-trek-strange-new-worlds-will-reveal-number-ones-mind-blowing-backstory/",
    "Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-news/star-trek-producer-reveals-strange-new-worlds-plan-evolving-q-for-picard-4164064/"
  }
}