{
  "source": "https://www.techradar.com/news/smbs-are-more-worried-about-cybersecurity-now-than-they-were-pre-pandemic",
  "title": "SMBs are more worried about cybersecurity now than they were pre-pandemic",
  "category": "computing",
  "updated": "2021-09-28T11:07:27Z",
  "author": "sead-fadilpasic",
  "summary": "Remote working is fueling fears among SMB bosses",
  "article": [
    "IT decision-makers (ITDMs) in small and medium-sized enterprises (SME) are more worried about cybersecurity now than they were before the Covid-19 pandemic, new research has claimed.",
    "A survery from Avast claims that the bigger the SME, the bigger the worry, having surveyed 500 ITDMs in the UK and 500 in Germany, as well as 1000 SMB workers in the UK and 1000 in Germany. Among SMBs with up to five employees, nearly a third (32%) were concerned about their organization’s security posture, growing to 76% among those with 100-300 employees.",
    "The key driver for this level of concern, Avast noted, is the growing number of employees working out of the office. Before the pandemic, 22% of workers and 27% of ITDMs worked remotely. Now, the number has grown to almost two-thirds (64%).",
    "With such a dispersed workforce, the network perimeter has been widened drastically, the company says, and securing it, as difficult as it is nowadays, has become a top strategic priority for many SMBs.",
    "There are multiple challenges ITDMs are looking to overcome, in their quest to secure their remote workforce. They are mostly concerned about employees working on unsecured connections, and using personal devices for work - devices on which they do all kinds of risky things (for example, download pirated software or visit potentially risky internet sites).",
    "Furthermore, employees working from home means ITDMs have less visibility of their IT systems.",
    "Employee education, often touted as the best way to keep a company safe from intrusions, turns out to be easier said than done. More than half (56%) said it’s “difficult” to keep employees educated about cyber-risks, and how to avoid them while working from home.",
    "These fears are not without merit, Avast further states, as the number of businesses encountering a cyberattack in the last year grew by almost a quarter (24%). There’s been a 20% increase in ransomware attacks worldwide, with the Remote Desktop Protocol, together with a weak password, being the most popular way for criminals to breach a network and deploy ransomware.",
    "“It’s clear hybrid working patterns are here to stay, and as every device can be an entry point to the corporate network, SMBs need to develop a robust and comprehensive approach to cyber security. This doesn’t always have to be managed in-house, as professionally managed service providers can help manage and secure SMBs’ infrastructures remotely,” commented Marc Botham, VP Worldwide Channel & Alliances at Avast."
  ],
  "headers": {
    "6": "Hackers on the move"
  },
  "links": {}
}