{
  "source": "https://www.techradar.com/news/an-upcoming-vivo-phone-could-have-a-mini-camera-drone-inside",
  "title": "An upcoming Vivo phone could have a mini camera drone inside",
  "category": "phones",
  "updated": "2021-07-02T10:36:20Z",
  "author": "david-nield",
  "summary": "We're ready for this",
  "article": [
    "We're happy to applaud any kind of innovation when it comes to smartphones, and a newly filed patent from Vivo certainly fits: it details an integrated camera drone that can take off from your handset and capture the perfect selfie from the air.",
    "As spotted by LetsGoDigital, the patent shows the drone popping out of the top of the phone with four miniature rotors on board. It features infrared sensors for avoiding nearby obstacles, and not one but two cameras for taking snaps during flight.",
    "From the diagrams included, it looks as though you might have to manually pull out the drone before setting it on its way – but having it take to the skies with a button push would be really cool. Unfortunately our Chinese isn't good enough to make much sense of the accompanying documentation.",
    "We're assuming that the drone would be controlled with an app on your smartphone, enabling you to adjust its position and take photos and videos on demand, but it's likely that all these details still need to be worked out by the team at Vivo.",
    "While we might not have too many details about this smartphone camera drone right now, it'll have to work within certain limitations: it's going to have to be very small and light, so don't expect too much in the way of range or battery life.",
    "We wouldn't be surprised if this camera drone was marketed for indoor use only as well, because a gust of wind could easily send it flying. You would still be able to use it for some impressive group shots at the next wedding or party you go to though – just set it off, frame the photo with your phone, and take a snap.",
    "To date, Vivo phones have been better known for their low prices and value for money rather than their cutting-edge technology, but a smartphone with an actual drone inside would certainly change that – if the company is able to pull it off.",
    "Like every patent that we cover, while this gives us an idea of what Vivo is thinking about when it comes to future products, there's no guarantee that its engineers will be able to figure out how to make this work – but let's hope that it becomes a reality one day.",
    "Via SlashGear"
  ],
  "headers": {},
  "links": {
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/vivo-smartphone-vliegende-camera/",
    "Vivo phones": "https://www.techradar.com/news/what-is-vivo-a-brief-overview-of-the-company-and-its-smartphones",
    "SlashGear": "https://www.slashgear.com/vivo-patents-a-smartphone-with-a-camera-mini-drone-inside-02680807/"
  }
}