{
  "source": "https://www.techradar.com/news/how-to-watch-the-bad-batch-and-stream-new-star-wars-animated-series-online",
  "title": "How to watch The Bad Batch: stream new Star Wars animated series online now",
  "category": "entertainment",
  "updated": "2021-05-04T09:58:56Z",
  "author": "aatif-sulleyman",
  "summary": "The Clone Wars are over... here comes The Bad Batch",
  "article": [
    "Strap in for an action-packed romp through the galaxy with Clone Force 99, as Hunter and his motley crew of genetically-enhanced clone troopers break free from the shackles of Admiral Tarkin and learn their place in the new order in the immediate aftermath of the Clone War. Read on as we explain below how you can now watch The Bad Batch online with Disney Plus.",
    "Each member of the experimental squad - an experiment that didn't foster anywhere near enough obedience for Tarkin's liking - has their own unique and extraordinary ability.",
    "Hunter is an expert tracker, Tech is the brains, Wrecker is the chaos-addicted brawn, Crosshair the toothpick-chewing sniper, and former ARC trooper Echo, who became Clone Force 99's fifth member after being rescued by the squad, is the perfect half-droid, half-clone partner for Tech.",
    "Declared enemies of the state after the execution of Order 66, yet another order that Clone Force 99 appears to have defied, Hunter and his crew embark on their biggest mission yet - one of survival and self-discovery.",
    "Joined by the mysterious Omega, they'll meet some beloved character along the way, including Fennec Shand and Saw Gerrera. Here's how to watch The Bad Batch online with Disney Plus.",
    "In addition to being the exclusive streaming home of The Bad Batch, the service provides access to Disney’s huge back catalog: tonnes of iconic animated movies like Beauty and the Beast, The Lion King and Cinderella. It’s also home to Pixar’s award-winning animations (Toy Story I-IV, Inside Out, Soul) – mind-opening National Geographic documentaries, and every broadcast season of The Simpsons. Then there’s Marvel and the ever-expanding MCU, which includes Black Panther and The Falcon and the Winter Soldier, plus the entire Star Wars saga, from 1977 up to original series The Mandalorian.",
    "It’s also the exclusive home of Pixar’s extraordinary Soul, and offers Disney Plus Premier Access to subscribers: allowing them to purchase highly-anticipated new films like Raya and the Last Dragon and Cruella before anyone else – for a one-off fee.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "Read more:"
  ],
  "headers": {
    "5": "What else should I know about Disney+?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/how-to-watch-the-falcon-and-the-winter-soldier-online-stream-avengers-spin-off",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device"
  }
}