{
  "source": "https://www.techradar.com/news/5-areas-for-successful-borderless-recruitment",
  "title": "Where to find employees : 5 areas for successful borderless recruitment and hiring",
  "category": "computing",
  "updated": "2021-12-06T21:17:20Z",
  "author": "yuko-adachi",
  "summary": "Increasing international recruiting post pandemic",
  "article": [
    "International recruiting is not a novel concept that should be credited to the pandemic. Even before COVID-19, conglomerates like Amazon were already pioneering the hiring of employees in different countries to work remotely across national borders.",
    "However, the pandemic allowed for the plausibility of working from anywhere (WFA) to become a reality as working from home (WFH) became the new norm. As the world went into lockdown, for the first time, businesses globally became increasingly open to recruiting talent from places they hadn’t considered before, bringing in more diverse voices to the team and inevitably reaping the benefits that come with hiring people from different backgrounds.",
    "Finding the right talent has always been a major requisite for businesses looking to drive impact. For IT and tech companies, in particular, the scarcity of experts in AI and analytics makes those who work in the field a hot demand as they have the most sought-after skills to many of these companies.",
    "If anything for the sector, borderless recruitment has become an opportunity, enabling the industry to solve its two most pervasive problems, the shortage of talent and lack of diversity.",
    "While there’s a strong business case for borderless recruitment, businesses looking to jump on the WFA trend should consider these five areas to succeed: reinvigorate recruiting strategy; collaborate with new global recruiting firms; adapt the hiring criteria to attract eligible candidates; increase social media presence and make the case to get the buy-in from c-executives.",
    "The first step for businesses to reinvigorate their recruiting strategy is to broaden the search location of where to find and recruit talent.",
    "Luckily, in an increasingly globalized world, IT professionals are now distributed everywhere. A recent Gartner’s TalentNeuron research found that the top 10 countries for experienced Python engineers include the mainstays of China, India and the US, but also Argentina, Brazil, the Philippines and South Africa. By broadening the location to include these countries, leaders can tap into a bigger pool of talent, increasing their chances to find the right candidate.",
    "Finding the best international talent, no matter how much an organization broadens their search location, still comes with its hurdles. Understanding whether the candidate will be the right fit for an organization or possess the skills and expertise needed for that role is already challenging enough in traditional recruiting - adding geography to the crumble won’t make it any easier. How are businesses to know the candidate is the right fit if they can’t see them?",
    "Partnering up with international recruitment agencies will help organizations address this. Global recruitment agencies can be a viable way to source new talent as they have more experience to find the right remote candidate for a company compared to local recruiters. Similar to when businesses conduct a request of information (RFI) for technology procurement, the same can be done with international recruiters to ensure these agencies can locate the candidate that fits with the company's values and matches their skills needs.",
    "Remote recruitment demands a new hiring criteria. Businesses should debunk traditional hiring standards to a more holistic one that’s not simply focused on professional experience and academic career. In borderless recruitment, organizations must remember that a candidate’s career or educational background won’t mean much because each country has a different educational system, rendering college comparisons redundant. The people you’re seeking may have limited experience - but mind-blowing skills. As such, businesses must modify their hiring criteria and be brave enough to remove irrelevant requisites.",
    "Organizations must also play their best social media game. In borderless recruitment, having a social media presence will be critical for candidates to know about a company's existence - how are candidates supposed to know about a business if it's not operating within their locality? Having social media visibility will be pertinent to find international talent and businesses should leverage their social channels to build their brand credibility and develop personal connections with prospective employees.",
    "Finally, borderless recruitment needs buy-in from different stakeholders and executive leaders. The question of why we choose to hire someone from another time zone, and the inevitable complexities that come with it – including payroll complications and employer-employee compliance – instead of the person next door will always pop up. Having a compelling business argument to back the decision will be critical. The arguments below are some useful pointers that leaders should consider when making the case for borderless recruitment to their senior stakeholders:"
  ],
  "headers": {
    "5": "Reinvigorating recruiting strategy",
    "7": "Invite new recruiting firms",
    "9": "Adapting the hiring criteria",
    "10": "Increasing the social media game",
    "11": "Make the case, get the buy-in"
  },
  "links": {
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "working from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "Python": "https://www.techradar.com/best/python-online-courses",
    "payroll": "https://www.techradar.com/best/best-payroll-software"
  }
}