{
  "source": "https://www.techradar.com/news/apple-october-event-5-things-you-might-have-missed-at-unleashed",
  "title": "Apple October event: 5 things you might have missed at Unleashed",
  "category": "computing",
  "updated": "2021-10-19T00:16:08Z",
  "author": "david-lumb",
  "summary": "What, were you expecting the Apple M1 Pro and M1 Max?",
  "article": [
    "Apple’s October event was all about computing with a decent amount of audio thrown in for good measure. While the reveals of the new 14-inch and 16-inch MacBook Pros took the spotlight, there was plenty of news if you weren’t paying close attention.",
    "There were revelations about the successor to Apple’s M1 chipset, its first in-house computer silicon. Or rather, successors – both the M1 Pro and the surprise M1 Max, which Apple claims are leaps and bounds more powerful than the M1, though we’ll have to do a lot of testing to find out exactly how much.",
    "Even beyond the chipset, it’s clear that both the new MacBook Pro 14-inch and MacBook Pro 16-inch have improved on their predecessors simply thanks to backtracking on some design ‘innovations’ of the last few years, like adding back in HDMI and MagSafe ports as well as a headphone jack. The oft-maligned Touch Bar is gone, replaced with basic function keys.",
    "At long last, we got new AirPods, which incorporate some of the best features of the AirPods Pro (but not noise-cancelling, sadly). And the HomePod mini now comes in more colors, great for those tired of the uniform black and gray hues of every other smart speaker on the market.",
    "Those were all the highlights that you probably got just from the headlines bouncing around after the event, but here’s five things you might have missed at Apple Unleashed.",
    "While nothing tops the Mac Pro M1 in terms of options that can extravagantly escalate the list price, the new MacBook Pro models have more selections at checkout than their predecessors that can rapidly raise the price. These include options for more RAM and storage, for instance, but also something new: the option to pick between up to five chipset configurations for the 14-inch and three for the 16-inch MacBook Pro.",
    "You won’t just be picking between the M1 Pro and the ultimate M1 Max, either. The 14-inch model starts at an Apple M1 Pro with an 8-core CPU and 14-core GPU, which can be boosted to a 10-core CPU and 16-core GPU for a little extra cost. The two higher upgrade tiers switch to an M1 Max chipset, which tops out at a 10-core CPU and 32-core GPU. The 16-inch model just has the top-tier M1 Pro model (10-core CPU and 16-core GPU) along with both M1 Max configurations.",
    "While we still don’t know much about the differences between the two chipsets, we know they have a difference in capability due to their memory controllers: the M1 Pro supports up to 32GB of unified memory for up to 200GB/s of memory bandwidth, while the M1 Max supports up to 64GB of unified memory and up to 400GB/s memory bandwidth. As another TechRadar colleague pointed out, the M1 Max means you won’t need a gaming laptop for video editing anymore.",
    "Load up all the options for the most expensive MacBook Pro 16-inch and you’re looking at a price tag of $6,100 / £5,899 / AU$ 9,149. Wow.",
    "Yes, Apple boasted about the new MacBook Pro models’ battery life, claiming that the 14-inch got up to 17 hours of video playback, while the 16-inch was capable of up to 21 hours. Presumably, that’s while watching video media without engaging in any more strenuous activity; if you instead do some ‘wireless web browsing,’ as Apple seems to call casual to moderate activity, expect your battery to last more like 11 hours in the 14-inch and 14 hours in the 16-inch, per its website.",
    "Those are still impressive numbers – in our own testing, we found the MacBook Pro 16-inch (2019), the new laptop’s predecessor, to get around 11 hours. At the lowest end, that’s 27% better battery life! While credit will likely be due to better efficiencies all around as well as using the new M1 Pro and M1 Max chipsets, that’s not the only good news on the battery front: fast charging (via the 96W USB-C charger included in the higher-tier configurations) can juice up the new MacBook Pros by 50% in 30 minutes, Apple claimed.",
    "The AirPods 3 were revealed at Apple’s event with a host of new features – but one thing we didn’t expect was for the earbuds it was succeeding, the AirPods 2, to be kept in the product lineup and get a price drop – from $179 / £139 / AU$‎228 to just $129 / £129, AU$219.",
    "That’s a bigger price drop in some regions than others (or Apple simply hasn’t updated its pricing in all of its sites), but for US buyers, it’s a serious discount. We’ll have to see if it gets better during Black Friday.",
    "Apple introduced a new tier for its Apple Music subscription service: Apple Voice. The new lowest-priced level of the service at $5 / £5 / AU$6 per month, Voice seems like a great deal, though the fine print explains what you give up by opting for the tier that costs just as much as a Student subscription and half that of an Individual plan. So what do you give up with Voice?",
    "Apple pitched the Voice tier as a Siri-focused version of the service, but it’s unclear how much of Apple Music you’ll be able to access through the smartphone app. For instance, will you be able to search for songs visually, or is it only accessible via a vocalized search through Apple’s voice assistant? Subscribers will get “a customized in-app experience with suggestions based on the listener’s music preferences,” according to a blog post introducing the Voice tier – suggesting they’ll get a more limited version of the normal Apple Music app.",
    "It does seem like Apple is pitching this tier as a streamlined option for folks who lean on the automation side of Apple Music – the company is adding “hundreds of new mood and activity playlists” that “are fully optimized just for voice,” per the blog post. You can still search for individual songs or artists – you just may have to do it via Siri, not manually browsing on your phone.",
    "Voice tier subscribers also can’t use Apple Music on non-Apple devices, don’t get spatial audio with Dolby Atmos, won’t have access to lossless audio, can’t see lyrics, and aren’t able to download songs to their library, according to the Apple Music tier descriptions. Those are all present in Student/Individual tiers and above; we’re unsure if you can pick songs in the Voice tier without Siri because that ‘perk’ in the tier descriptions was just added – compare the current one with last week’s descriptions archived in The Wayback Machine.",
    "Are you an Apple AirPower truther, holding out dogged hope that Apple will one day release its cancelled charging mat that was intended to recharge three devices at once? Not only are we pretty sure it’s dead, the newest feature of the AirPods 3 reinforces its lingering demise: the case for the new true wireless earbuds charges via MagSafe.",
    "Not the MagSafe 3 that charges the new MacBook Pro models, of course – the drink coaster-shaped magnetic chargers that clamp on to the backs of iPhone 12 and iPhone 13 devices. While AirPods 2 and AirPods Pro have been able to use wireless charging, the AirPods 3 can now benefit from the magnetic attachment charging that debuted in 2020’s iPhones, suggesting Apple may stick with this hardware perk for a while. And who knows if it’ll come to any other device – iPad, anyone?"
  ],
  "headers": {
    "5": "MacBook Pro has multiple configurations that push the price ... way up",
    "9": "The MacBook Pro battery life may last up to 21 hours... but probably more like 14",
    "11": "With AirPods 3 launch, the AirPods 2 sees a price drop",
    "13": "Apple Music Voice seems limited to voice controls",
    "17": "AirPods 3 can use the iPhone 13’s MagSafe chargers"
  },
  "links": {
    "pointed out": "https://www.techradar.com/news/the-apple-m1-max-means-you-dont-need-a-gaming-laptop-for-video-editing-anymore",
    "website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2434403515769577500&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fmacbook-pro-14-and-16%2F",
    "MacBook Pro 16-inch (2019)": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "AirPods 2": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "price drop": "https://www.techradar.com/news/apple-just-made-airpods-a-bestseller-this-black-friday",
    "blog post": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1169291448754894600&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F10%2Fapple-introduces-the-apple-music-voice-plan%2F",
    "tier descriptions": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1389168371808637000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fapple-music%2F",
    "The Wayback Machine": "https://web.archive.org/web/20211012014508/www.apple.com/apple-music/"
  }
}