{
  "source": "https://www.techradar.com/news/skate-4-wont-be-at-ea-play-but-a-little-something-is-on-the-way",
  "title": "Skate 4 won't be at EA Play, but 'a little something' is on the way",
  "category": "gaming",
  "updated": "2021-07-19T11:28:44Z",
  "author": "axel-metz",
  "summary": "The wheels are moving",
  "article": [
    "We know for certain that some sort of Skate-related project is in the works over at EA, and while there won’t be any announcements from developer Full Circle at EA Play Live, fans can expect a “little something” by way of an update later today.",
    "The tease comes from a tweet posted by the official Skate Twitter account, which clarified that a team is \"working hard on a new game\" but that it’s \"not ready for prime time just yet\" – which we presume to mean neither a release date nor full-blown trailer is on the cards any time soon.",
    "The message did, however, conclude by saying \"[the team] are stoked to share a little something [with the fans]\" on July 19. Can we expect confirmation of the game’s name, at least? We’re hoping so.",
    "It’s been 11 years (eleven!) since the release of Skate 3, and back in June last year the game’s developers sent fans of the franchise into delirium after announcing that they were “back” to develop a new Skate title.",
    "We still don’t know for sure whether that game will turn out to be Skate 4, or some sort of remaster project in the vein of Tony Hawk's Pro Skater 1 + 2, so it figures that this \"little something\" may simply be an announcement clarifying that fact.",
    "Still, it’s exciting to learn that the wheels are well and truly moving on a project which has been kept in limbo for over a decade. It’s promising, too, that developer Full Circle is \"committed to doing this thing right,\" which is why the project is \"gonna take some time.\"",
    "Given that slither of an official update, then, we don’t expect a new Skate game to land any time before late 2022, with 2023 a more conservative prediction. By that point, we wouldn’t anticipate the game arriving on last-gen systems like the PS4 and Xbox One, so it would make sense for Full Circle to be developing the project exclusively for PS5, Xbox Series X and PC.",
    "A new Skate game isn’t the only title confirmed as a no-show for EA Play Live 2021.",
    "There won’t be any appearances from new Star Wars games, either, meaning we won’t get a better look at projects including the in-development Jedi Fallen Order 2 or the long-rumored Star Wars Knights of the Old Republic remake.",
    "What’s more, neither Dragon Age 4 nor a new Mass Effect game will feature, with the only major announcements expected to revolve around Battlefield 2042, Apex Legends and (potentially) a Dead Space remake.",
    "In any case, TechRadar will be on hand to analyse anything and everything that is revealed at this year’s showcase event, which begins at 10am PT / 1pm ET / 6pm BST on July 22, or at 3am on July 23 in Australia.",
    "Via VG24/7"
  ],
  "headers": {
    "7": "Not the only no-show"
  },
  "links": {
    "tweet": "https://twitter.com/skateEA/status/1416804987645022216?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1416804987645022216%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.vg247.com%2F2021%2F07%2F19%2Fskate-4-ea-play-live-something-teaser%2F",
    "announcing": "https://twitter.com/SkateEA/status/1273765304993083392?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1273765304993083392%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.gamesradar.com%2Fuk%2Fskate-4-release-date%2F",
    "Tony Hawk's Pro Skater 1 + 2": "https://www.techradar.com/reviews/tony-hawks-pro-skater-1-2-review-ps4-xbox-one-pc",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Star Wars games": "https://www.techradar.com/news/dont-expect-the-star-wars-knights-of-the-old-republic-remake-at-ea-play-live",
    "Jedi Fallen Order 2": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "Star Wars Knights of the Old Republic remake": "https://www.techradar.com/news/the-new-star-wars-knights-of-the-old-republic-is-reportedly-in-the-works-outside-of-ea",
    "Dragon Age 4": "https://www.techradar.com/news/dragon-age-4-release-date-news-and-rumors",
    "new Mass Effect game": "https://www.techradar.com/news/bioware-confirms-theres-a-new-mass-effect-game-in-development",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Dead Space remake": "https://www.techradar.com/news/new-dead-space-game-is-reportedly-a-reimagining-of-the-originals",
    "VG24/7": "https://www.vg247.com/2021/07/19/skate-4-ea-play-live-something-teaser/"
  }
}