{
  "source": "https://www.techradar.com/news/marvel-wolverine-ps5",
  "title": "The Wolverine PS5 trailer is here, bub – this is Insomniac’s next Marvel game",
  "category": "gaming",
  "updated": "2021-09-17T11:20:04Z",
  "author": "nick-pino",
  "summary": "Excelsior! Marvel and Insonmiac Games are making a Wolverine game",
  "article": [
    "After finding massive success with its Marvel Spider-Man franchise, Insomniac Games has announced that it will be making a Marvel Wolverine game on PS5.",
    "We got our first teaser trailer for the game during Sony’s PlayStation Showcase event and while none of it is direct gameplay, it does certainly have the right tone to match one of Marvel’s most ornery mutants.",
    "The bad news? Insomniac didn't drop a release date alongside the trailer... which probably makes sense considering how early in development it is.",
    "According to a post on the PlayStation Blog, Marvel's Wolverine is a standalone game that's being directed by Brian Horton and Cameron Christian, who recently led the team on Marvel's Spider-Man: Miles Morales.",
    "That bodes pretty well for the game as Miles Morales was well-received, but there's definitely a big difference between Marvel's friendly neighborhood Spider-Man and Weapon X.",
    "While we can't speak to what the game may look like, we'll give Insomniac the benefit of the doubt on this and get preemptively hyped about the game.",
    "Any developer might have a decent shot of making a Wolverine game, Insomniac has proven itself to be a huge Marvelite, capable of bringing the pages of the comics to life.",
    "Its last game, Marvel's Spider-Man: Miles Morales, has an 85 overall rating on the aggregrator site Metacritic, and scored a 4.5 out of 5 in our Marvel's Spider-Man: Miles Morales review.",
    "There's no guarantee that Wolverine will win as many accolades as its web-slinging predecessor, but we're hoping that's the case – and we'll certainly be keeping our eyes out and claws up for any more morsels of information as they drop."
  ],
  "headers": {
    "5": "Opinion: We've been dreaming of another Insomniac-made Marvel game"
  },
  "links": {
    "Marvel Wolverine game": "https://www.techradar.com/news/marvels-wolverine",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PlayStation Showcase": "https://www.techradar.com/news/playstation-showcase-2021-everything-we-want-to-see",
    "PlayStation Blog": "https://blog.playstation.com/2021/09/09/marvels-spider-man-2-and-marvels-wolverine-revealed/",
    "Metacritic": "https://www.metacritic.com/game/playstation-5/marvels-spider-man-miles-morales",
    "Marvel's Spider-Man: Miles Morales review": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review"
  }
}