{
  "source": "https://www.techradar.com/news/cant-get-an-rx-6900-xt-amd-gaming-laptops-might-be-here-soon",
  "title": "Can't get an RX 6900 XT? AMD gaming laptops might be here soon",
  "category": "computing",
  "updated": "2021-03-11T12:15:38Z",
  "author": "hamish-hector",
  "summary": "If you can get one",
  "article": [
    "With many of the best GPUs on the market almost impossible to buy, you might find that the latest generation of AMD gaming laptops can satiate your PC gaming needs. Thankfully, you might not have long to wait as a Radeon RX 6600M has been spotted in a leaked benchmark, suggesting that ‘Big Navi’ could be hitting our laptops sooner than we thought.",
    "The leaked device will supposedly feature both an AMD CPU - the Ryzen 5 Pro 5650U - and AMD GPU - the Radeon RX 6600M. This would be the first time we’ve seen the RX 6600M - or any mobile 6000 series GPU - in the wild, though early reports suggest this one’ll be a mid-range graphics card at best.",
    "The leaked image was provided by a known data miner APISAK, who has previously supplied many GPU and CPU-related information via their Twitter page. As with all rumors, take all this with a healthy serving of salt as we can’t confirm anything that didn’t come from an official source.",
    "For those desperate to get their hands on AMD’s flagship Radeon RX 6900 XT and 6800 XT to boost their PC’s power, this new laptop might not quite be what you want. However the leak suggests an announcement could be on the way soon - with the potential to get more powerful options too.",
    "In short, no, these new graphics cards won’t slow down the rate at which AMD’s best desktop options are produced. This is because, according to manufacturers, the main issue with the ongoing GPU shortage is demand and not a supply of raw materials.",
    "The demand is so much higher than expected because not only are gamers looking to upgrade their hardware, but cryptominers also want the graphics cards so they can use the GPU’s style of processing to mine Bitcoin, Ethereum and Dogecoin.",
    "There’s a decent chance that the top grade laptops could also sell out as quickly as AMD’s best GPUs. We’ve already seen the same happen with the RTX 3000 laptops in China, with miners looking to invest in processing power however they can.",
    "Hopefully efforts by GPU manufacturers to inhibit important mining stats and introducing crypto specific hardware will help, but we’ll have to wait and see on those fronts.",
    "To be in with your best shot at grabbing the tech you want, make sure to keep an eye out for any AMD announcements, and be ready to snag one of their laptops the moment they are officially released.",
    "Via Notebook Check"
  ],
  "headers": {
    "4": "Will laptop GPUs stop me getting one for my desktop?",
    "6": "Could there be a shortage of AMD laptops?"
  },
  "links": {
    "best GPUs": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "APISAK": "https://twitter.com/TUM_APISAK/status/1369837571560284163?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1369837571560284163%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.techradar.com%2F",
    "RX 6900 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6900-xt-find-stock-here",
    "6800 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6800xt-find-stock-here",
    "cryptominers": "https://www.techradar.com/news/amd-and-nvidia-take-note-gpus-will-soon-become-obsolete-for-crypto-mining",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Ethereum": "https://www.techradar.com/news/ethereum-20-goes-live-next-month-heres-why-thats-a-huge-deal",
    "Dogecoin": "https://www.techradar.com/news/what-is-dogecoin-all-you-need-to-know-about-the-meme-cryptocurrency-explained",
    "RTX 3000 laptops": "https://www.techradar.com/news/cryptominers-bulk-buying-rtx-3000-laptops-in-china-to-mine-ethereum",
    "Notebook Check": "https://www.notebookcheck.net/AMD-Radeon-RX-6600M-GPU-joins-surprising-choice-of-Ryzen-5000-CPU-as-gaming-benchmark-leak-hints-at-upcoming-Zen-3-RDNA-2-laptop.527267.0.html"
  }
}