{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-update-brings-camera-improvements-and-more",
  "title": "Samsung Galaxy S21 update brings camera improvements and more",
  "category": "phones",
  "updated": "2021-04-27T08:39:59Z",
  "author": "tom-bedford",
  "summary": "To the S21, S21 Plus and S21 Ultra",
  "article": [
    "If you own a Samsung Galaxy S21, S21 Plus or S21 Ultra it's probably worth checking your system update status, because a new update is rolling out, bringing a few key improvements to your smartphone.",
    "As spotted by a few users in Europe (and reported by Gizchina), the May security patch for Galaxy S21 phones is currently rolling out, and the install menu tells us all about the new features it brings.",
    "The headline improvement is that camera performance is being improved - we don't actually know what shape these improvements will take, but the phrasing suggests that the camera app will be faster to use.",
    "Other changes include security updates, bug fixes, and improvements to the speed of Quick Share, which lets you share the files on your phone with other Samsung devices, which could be useful if you own a laptop or tablet from the company.",
    "Samsung Galaxy S21 users in Europe are reporting the update rolling out to the three eligible phones, and other regions will likely get it soon.",
    "To update your phone with the new tools, simply head to the Settings app and then find the Software Update option - this will tell you if you can update the phone yet, or whether you're on the newest software available for your phone.",
    "While this Galaxy S21 update won't revolutionize the way you use your phone, any upgrades are always welcome, especially if they improve the speed of the phone."
  ],
  "headers": {
    "4": "How to download the new Galaxy S21 update"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Gizchina": "https://www.gizchina.com/2021/04/26/galaxy-s21-receives-a-new-firmware-update-brings-camera-improvements-more/"
  }
}