{
  "source": "https://www.techradar.com/news/google-has-a-few-tricks-up-its-sleeve-for-the-newsletter-platform-department",
  "title": "Google has a few tricks up its sleeve for the newsletter platform department",
  "category": "computing",
  "updated": "2021-09-24T22:00:34Z",
  "author": "anthony-spadafora",
  "summary": "Creators will be able to create and publish newsletters in Google Drive with Museletter",
  "article": [
    "As more journalists and writers are turning to newsletters to distribute their content online, Google is working on its own newsletter platform that will leverage its existing collaboration tools.",
    "As reported by TechCrunch, the search giant's internal R&D division Area 120 has developed a new project called Museletter. This makes a great deal of sense as other tech giants including Facebook and Twitter have launched their own newsletter platforms recently.",
    "While a launch date has not yet been announced for Google's new newsletter offering, Museletter already has lot going for it as users of the upcoming service will be able to publish Google Drive files as blogs or newsletters to either their public Museletter profile or to an email list.",
    "Museletter's arrival comes at time when smaller newsletter platforms including Substack, Ghost, Revue and others have become increasingly popular among journalists and writers that would rather be independent as opposed to working for and having to follow the direction of larger news outlets.",
    "When TechCrunch reached out to Google's Area 120 for a comment on Museletter, a company spokesperson explained that the project is still in its early stages and is one of many experiments in development at the search giant's internal R&D division.",
    "Still though, a lot can be learned about the new newsletter platform from the Museletter website which explains creators can monetize Google Drive in a way that sets Google's newsletter offering apart from the competition. For instance, in addition to writing newsletters in Google Docs, the company's other software could also be used to provide readers with additional content such as presentations in Google Slides or spreadsheets in Google Sheets.",
    "By creating a public profile in Google Drive, creators would essentially have a landing page where they can showcase their work and market subscriptions to their readers. While using Museletter will be free for creators, they can easily monetize their content by offering paid subscriptions to their readers.",
    "Museletter could also provide Google with a new way to sell ads as ads placed inside newsletters created on the platform could be much more niche and directly tied to their content.",
    "Although the company hasn't announced a launch date for its new newsletter platform, interested creators can request early access using this form.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "Museletter"
  },
  "links": {
    "newsletters": "https://www.techradar.com/news/hey-world-lets-you-run-newsletters-and-blogs-from-your-email-account",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "reported": "https://techcrunch.com/2021/09/16/googles-rd-division-experiments-with-newsletters-powered-by-google-drive/",
    "Area 120": "https://www.techradar.com/news/googles-airtable-rival-is-now-officially-a-google-cloud-product",
    "Facebook": "https://www.techradar.com/news/it-looks-like-facebook-is-getting-into-the-newsletter-game-too",
    "Twitter": "https://www.techradar.com/news/twitter-might-soon-start-sending-out-email-newsletters",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "Substack": "https://www.techradar.com/news/substack-wants-to-help-liven-up-your-boring-newsletters",
    "Museletter website": "https://museletter.area120.google.com/",
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "Google Slides": "https://www.techradar.com/reviews/google-slides",
    "Google Sheets": "https://www.techradar.com/reviews/google-sheets",
    "landing page": "https://www.techradar.com/best/landing-page-creator",
    "using this form": "https://museletter.area120.google.com/",
    "TechCrunch": "https://techcrunch.com/2021/09/16/googles-rd-division-experiments-with-newsletters-powered-by-google-drive/"
  }
}