{
  "source": "https://www.techradar.com/news/nintendo-switch-2-could-release-before-march-2022-according-to-new-report",
  "title": "Nintendo Switch 2 could release before March 2022, according to new report",
  "category": "gaming",
  "updated": "2021-03-16T02:45:17Z",
  "author": "stephen-lambrechts",
  "summary": "'Pro' Switch console may launch early next year",
  "article": [
    "Recently, we received word that Nintendo is reportedly working on an updated Switch console with a 7-inch OLED screen, 4K output capability and a tentative 2021 release date.",
    "That report came via Bloomberg, and while the financial and media company is sticking to its guns regarding the new Switch's hardware upgrades, it has adjusted its proposed release window, with a new report suggesting the device will now arrive before the end of March 2022.",
    "As per the report, it's believed that \"Kyoto-based Nintendo is planning for sales of its signature Switch game console to be flat or slightly higher in the fiscal year ending March 2022\", and that the introduction of a new 'Pro' Switch console will help it achieve that goal.",
    "That said, some analysts believe there will be a major downturn in sales of games hardware next year, as life begins to return to some semblance of normalcy post Covid-19.",
    "Bloomberg Intelligence's Matthew Kanterman says that “With or without an upgraded Switch, Nintendo’s hardware sales would probably decrease in the year from April.”",
    "Thankfully, Nintendo's new console will be backed by a strong lineup of exclusive game releases leading up to or near its launch, including Mario Golf Super Rush, Splatoon 3, and a HD remaster of The Legend of Zelda: Skyward Sword."
  ],
  "headers": {},
  "links": {
    "updated Switch console": "https://www.techradar.com/news/nintendo-switch-2-launch-news-and-features",
    "That report": "https://www.bloomberg.com/news/articles/2021-03-04/nintendo-plans-switch-model-with-bigger-samsung-oled-display",
    "a new report": "https://www.bloomberg.com/news/articles/2021-03-15/nintendo-is-said-to-target-record-year-in-switch-game-sales",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news"
  }
}