{
  "source": "https://www.techradar.com/news/a-windows-11-tax-dell-laptops-get-surprising-price-hike",
  "title": "Here's why Dell is charging more for some Windows 11 laptops",
  "category": "computing",
  "updated": "2021-10-15T12:55:57Z",
  "author": "desire-athow",
  "summary": "[Updated] It's all about deeper discounts",
  "article": [
    "Dell replied with the following statement to our story: \"The starting price of the equally configured Windows 10 vs 11 XPS 13 laptops are the same, but we have applied a larger discount on the Windows 10 version of this particular XPS 13 model to clear out inventory. Keep in mind, Windows 11 is still a free upgrade on the Windows 10 model.\"",
    "Dell is charging customers extra for choosing Microsoft’s latest Windows 11 operating system on some of its most popular laptops, according to research carried out by TechRadar Pro.",
    "The findings shed light on a curious and controversial “Windows 11 tax” that is perplexing given Microsoft’s crystal-clear statement that Windows 10 users will be able to upgrade to Windows 11 for free.",
    "For example, one of the company's best laptops right now, the award winning Dell XPS 13, costs $881.99 with WiIndows 11 home and $734.99 with Windows 10 Home (both prices at the time of writing).",
    "That’s a 20% price difference or $147. In the UK, there is a more reasonable price difference (£50 or 5.9%) between Windows 11 Home and Windows 10 Home for the same product but “justified” by an upgrade from 256GB to 512GB SSD.",
    "Other models where we’ve noticed such discrepancies include the Dell Inspiron 15 and the Inspiron 13 (2-in-1). Windows 10 Pro, Windows 10 S, desktops and professional products (business laptops, mobile workstations) haven’t been impacted.",
    "No other major vendors (HP and Lenovo) have similar issues so it is likely that this is a misprice or an innovative pricing strategy. We reached out to Dell to find out why that was the case and will update the article when we get an official statement from them.",
    "To Dell’s credit though, it is the only major vendor that offers multiple Windows SKUs (up to six) for a significant number of its products.",
    "Windows 11 is the first major operating system launch for Microsoft in five years and has been viewed as a mixed bag. Our reviews point out the fact that system requirements are still confusing and the redesign seems more like a reskin."
  ],
  "headers": {
    "5": "Misprice or deliberate strategy?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Dell XPS 13": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1165007618390242000/https://www.dell.com/en-us/member/shop/dell-laptops/xps-13-laptop/spd/xps-13-9305-laptop/xn9305ezwkh",
    "Dell Inspiron 15": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9861890045667610000/https://www.dell.com/en-us/member/shop/dell-laptops/new-inspiron-15-laptop/spd/inspiron-15-5510-laptop/nn5510esjes?view=configurations",
    "Inspiron 13 (2-in-1)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1341314863261084400/https://www.dell.com/en-us/member/shop/2-in-1-laptops/inspiron-13-2-in-1-laptop/spd/inspiron-13-7306-2-in-1-laptop/n27306ejtzh",
    "Windows 10 Pro": "https://www.techradar.com/news/windows-10-pro-vs-windows-10-home-all-the-differences-explained",
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "mobile workstations": "https://www.techradar.com/news/best-mobile-workstations"
  }
}