{
  "source": "https://www.techradar.com/news/super-bowl-tv-deals-at-walmart-get-this-70-inch-4k-roku-tv-on-sale-for-just-dollar448",
  "title": "Super Bowl TV deals at Walmart: get this 70-inch 4K Roku TV on sale for just $448",
  "category": "televisions",
  "updated": "2021-01-29T19:26:06Z",
  "author": "mackenzie-frazier",
  "summary": "Our top Super Bowl TV picks starting at just $199.99",
  "article": [
    "Super Bowl TV sales are happening right now at Walmart with incredible deals on a range of 4K TVs with prices starting at just $265. One of the best bargains we've spotted is this Onn. 70-inch 4K TV that's on sale for $448 - an incredible price for a big-screen 4K Roku TV. You can also see more offers from retailers like Amazon and Best Buy with our guide to the best Super Bowl TV deals of 2021.",
    "While this 70-inch Onn. set might not be the best TV in the world, it does feature 4K Ultra HD resolution, which displays four times the number of pixels as a Full HD display. The 70-inch TV also has the Roku experience built in, which gives you access to over 500,000+ movies and TV shows that you can stream from your TV's home screen. You're also getting the Google Assitant so you can control your TV and compatible smart home devices completely hands-free. See more of the best Super Bowl TV deals from Walmart below, and keep in mind, these are limited-time offers, so we recommend taking advantage of now before it's too late.",
    "You can see more bargains with our roundup of the best Super Bowl TV deals and the best cheap TV deals that are currently available. Find out how to watch the game with our guide to the Super Bowl live stream 2021."
  ],
  "headers": {
    "1": "Super Bowl TV deal of the day",
    "2": "More Super Bowl TV deals"
  },
  "links": {
    "on sale for $448": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-8446042026254989000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2Fonn-70-Class-4K-UHD-2160P-LED-Roku-Smart-TV-HDR-100012588%2F826377921",
    "Super Bowl TV deals": "https://www.techradar.com/news/best-super-bowl-tv-deals-201",
    "best TV": "https://www.techradar.com/news/best-tv",
    "best Super Bowl TV deals": "https://www.techradar.com/news/best-super-bowl-tv-deals-201",
    "best cheap TV deals": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales",
    "Super Bowl live stream 2021": "https://www.techradar.com/news/watch-super-bowl-live-stream-2021-free-online"
  }
}