{
  "source": "https://www.techradar.com/news/this-intel-and-nvidia-rival-can-run-everything-from-hyperscale-data-centers-to-your-web-hosting",
  "title": "This Intel and Nvidia rival can run everything from hyperscale data centers to your web hosting",
  "category": "computing",
  "updated": "2021-02-25T10:30:36Z",
  "author": "mayank-sharma",
  "summary": "Prodigy universal processor will be launched later this year",
  "article": [
    "Chip giant Tachyum has launched a live production website powered by its home-brewed Prodigy processor, which can already run Artificial Intelligence (AI) and high-performance computing (HPC) workloads.",
    "The new website runs atop Tachyum’s software emulation system that powers a native Apache v2.4 web server on top of a native Linux kernel v5.10.",
    "In what it claims as a major step towards the goal of delivering a truly universal processor, Tachyum’s founder and CEO Dr. Radoslav Danilak said that he anticipates a good chunk of the Prodigy usage will come in massive web deployments: “By having our software emulation systems readily available for testing by partners, we are continuing to make Prodigy field-proven in hyperscale environments.”",
    "In the past, Tachyum has claimed its software emulation technology can run Arm and RISC-V code better than modern processors based on these architectures. The launch of this new website extends the use of the processor to handle traditional data center workloads as well.",
    "The company claims that being able to seamlessly handle different kinds of workloads atop the same processor will help make data centers more efficient and cost effective. It should also help reduce maintenance costs, as data centers will no longer need a mix of CPU, GPU and TPU processors to address the different workloads.",
    "Tachyum claims 125 HPC Prodigy racks can deliver 32 tensor EXAFLOPS, which helps it beat NVIDIA’s fastest GPU in HPC, as well as AI training and inference workloads. Furthermore, it says that the universal processor can also outperform the fastest Intel Xeon processors while consuming about 10x less power.",
    "Tachyum’s Prodigy software emulation system is now available to partners for evaluation and development. “This additional testing will show customers that Prodigy is well-positioned for deployment in production-quality web servers at product launch later this year,” notes the company in the release."
  ],
  "headers": {
    "3": "Efficient data centers"
  },
  "links": {
    "Tachyum": "https://www.techradar.com/news/this-processor-can-run-any-code-you-need-faster-than-intel-and-nvidia",
    "production website": "https://www.techradar.com/news/the-best-website-builder",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "claimed": "https://www.techradar.com/news/this-processor-can-run-any-code-you-need-faster-than-intel-and-nvidia",
    "NVIDIA’s fastest GPU": "https://www.techradar.com/news/nvidia-geforce",
    "fastest Intel Xeon processors": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "software emulation": "https://www.techradar.com/best/best-virtual-machine-software"
  }
}