{
  "source": "https://www.techradar.com/news/iphone-13-could-opt-for-thicker-bezels-so-it-can-ditch-the-notch",
  "title": "iPhone 13 could opt for thicker bezels so it can ditch the notch",
  "category": "phones",
  "updated": "2021-01-31T12:30:57Z",
  "author": "david-nield",
  "summary": "Smaller notch or no notch?",
  "article": [
    "We're not expecting to see the iPhone 13 until September, but there's already been plenty of speculation about the changes that Apple's next flagship handset might bring with it – and the latest rumor is that it could do away with the front display notch entirely.",
    "According to @MauriQHD on Twitter, one of the more well-known and reliable tipsters out there, Apple has a prototype iPhone 13 device that doesn't have a notch but that does have slightly thicker bezels around all four sides to compensate.",
    "However, there's no guarantee that this is going to make it to the iPhone 13, due later in 2021. The notch-less design that Apple is working on might not be finalized and ready until the iPhone 14 rolls around, the same source says.",
    "The notch has been a feature of the iPhone ever since the iPhone X broke cover in 2017, although Apple still sells the iPhone SE that makes use of the older Apple smartphone design – thicker bezels, no notch, and a home button underneath the display.",
    "The rumors we've been hearing around the iPhone 13 so far have certainly been notch-heavy: the idea that the phone will have a smaller notch is one that has been floated several times by different people in the know.",
    "It certainly makes sense that after four years Apple would have refined the camera tech inside the notch to be able to make it a little bit more compact. Even if it gets smaller, it could add more sensors – including, perhaps, a LiDAR scanner.",
    "Big strides forward are also being made across the industry in terms of in-screen camera technology, which could eventually remove the need for a notch altogether. It doesn't seem likely that Apple would have that sort of tech ready this year, however.",
    "We'll have to wait and see what Apple is planning for the iPhone 13 and how it might position the front-facing cameras and sensors with no notch – presumably they would go inside that thicker bezel. Expect plenty more to be revealed between now and September."
  ],
  "headers": {
    "4": "To notch or not to notch"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "@MauriQHD": "https://twitter.com/MauriQHD/status/1354867790696603649?",
    "due later in 2021": "https://www.techradar.com/news/iphone-13-tipped-to-be-launching-in-september-2021-as-normal",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "have a smaller notch": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "floated several times": "https://www.techradar.com/news/iphone-13-tipped-to-have-a-smaller-notch-and-a-thicker-design",
    "a LiDAR scanner": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-even-more-camera-sensors",
    "in-screen camera technology": "https://www.techradar.com/news/a-future-samsung-phone-could-have-an-under-display-camera-based-on-this-patent",
    "to be revealed": "https://www.techradar.com/news/iphone-13-might-have-even-more-internal-storage-than-an-ipad"
  }
}