{
  "source": "https://www.techradar.com/news/rocket-league-mobile-is-now-a-thing-and-were-not-terribly-impressed",
  "title": "Rocket League mobile is now a thing, and we're not terribly impressed",
  "category": "phones",
  "updated": "2021-12-01T11:41:24Z",
  "author": "rhys-wood",
  "summary": "Football with cars comes to your pocket",
  "article": [
    "Rocket League Sideswipe is now available on Android and iOS devices, offering a free-to-play mobile alternative to the online multiplayer phenomenon. Rocket League Sideswipe maintains the orange vs. blue head-to-head setup of its console counterpart, but instead takes place from a side-on perspective, as opposed to a fully 3D environment.",
    "As reported by GSMArena, Rocket League Sideswipe looks to be a paired down version of the main game. Teams are capped at two players instead of four, general movement is slower and the physics seem greatly simplified. However, these look to be conscious decisions on the part of developer Psyonix in order to make the game more digestible for smartphone play.",
    "Rocket League Sideswipe keeps the general rules of the original game intact. Each match features a time limit in which the team that scores the most goals is declared the winner. This is achieved by guiding the large metal ball into your opponent's goal by smacking it about with your rocket-powered battle car.",
    "What's perhaps most noticeable about Sideswipe is that it looks great for a mobile game. The trailer shows that the game maintains the iconic, richly colorful look of the original, albeit with somewhat paired down fidelity.",
    "Rocket League is also known for its cosmetics, and this feature, too, returns in full force. Sideswipe looks to feature a wealth of customization options from hats for your car to unique goal scoring animations.",
    "Unless you count the Nintendo Switch version, there isn't really a portable option available for Rocket League, especially if you still want to play online. Rocket League Sideswipe provides a solution to this, albeit in a way that we don't think everyone will be on board with.",
    "While Rocket League Sideswipe does look mighty impressive for a mobile game, the allure of the original console and PC release is that because of the intricate physics and movements systems, no two games of Rocket League are the same. This is something that appears to be scaled back in this mobile version.",
    "It's possible that 4v4 play in Rocket League Sideswipe may have been a tad too chaotic for a phone's relatively small display. That, and most phone CPUs may have struggled to render such action at a stable framerate, so we can hardly complain about Psyonix's decision to scale gameplay back to a more reliable 2v2 format.",
    "That said, Rocket League is arguably at its best when eight cars are on the pitch, all vying for control of the ball, working in tandem to pull off the kinds of mind-bending trick shots you'll only ever achieve once. We're not saying that won't be possible in Sideswipe, but limiting the number of players will have an adverse effect on the kinds of manoeuvres you're able to pull off, intentionally or not."
  ],
  "headers": {
    "5": "Analysis: Who is Rocket League Sideswipe for?"
  },
  "links": {
    "Android": "https://www.techradar.com/best/best-android-phones",
    "iOS": "https://www.techradar.com/news/ios-15-update",
    "GSMArena": "https://www.gsmarena.com/rocket_league_sideswipe_now_available_worldwide_for_ios_and_android-news-52077.php",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc"
  }
}