{
  "source": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
  "title": "HDR TV: what is HDR, and what does High Dynamic Range mean for your TV?",
  "category": "televisions",
  "updated": "2021-07-08T13:24:44Z",
  "author": "adrian-justins",
  "summary": "Higher contrast, vivid colors and brighter images are coming",
  "article": [
    "What is HDR? It means high dynamic range and it's a term you've probably heard before here on TechRadar or if you've been looking for a new TV for your home over the past few years.",
    "The problem is, it's used everywhere but rarely explained – at least not enough for those without a lot of TV tech know-how to get their heads around.",
    "You know it's something good to have on your new TV, but you're probably less sure about precisely what it means. To make things easier, we like to think of it a bit like the audio-visual (AV) world's equivalent of 'organic'.",
    "But before we dig into the details, what's essential to learn is that HDR could change the way you watch TV – and even movies on your phone, too – for good.",
    "For starters, let's look at 4K TVs. 4K TV displays tend to get most of the attention, as they produce four times the number of pixels of any HD TV on the market. But is more necessarily better when it comes to pixels? Do you care how many pixels there are if none of them look any good?",
    "That's where HDR comes in. What HDR does is get more dynamic pictures and quality out of those many, many pixels. This means your viewing experience is better. With an HDR TV, bright whites look brighter, dark blacks look darker, and 10-bit panels can finally display the 1 billion colors you never realized you could see.",
    "Simply put, 4K describes the quantity of pixels, but it's HDR that describes their exceptional quality. Both are just as important as each other, but 4K without HDR won't look as good or be as fun to watch.",
    "HDR is used in a few different contexts.",
    "So let's clear up some confusion: the kind of high dynamic range that your HDR TV is capable of shouldn't be confused with the HDR photography options that have recently been added to smartphone cameras.",
    "Sure, they're similar. Both result in images that have a greater contrast between light and dark. But the way they work is slightly different.",
    "For example, high-end cameras and recent smartphone apps utilize HDR by combining several photos taken during a single burst of many photos.",
    "Separate photos are taken at different exposures during the process. These are called stops, and the amount of light is doubled from one to the next. So while the first stop produces an extremely dark image, the last result is exceptionally bright, lending better luminosity to the final portmanteau photo.",
    "But that's not the same for video.",
    "Yes, you're still getting an expanded color gamut and contrast ratio when it comes to video, but you're not doing it by combining several images or videos. It all has to do with the way an image is displayed on the screen and the source content used to do it.",
    "So although it might share a name and common points with photography, clearly HDR video is different to smartphone photography.",
    "The end result, an image with more contrast between its lightest and darkest areas is the same, but instead of combining separate images this effect is produced using better camera technology to capture the best possible footage in the first place.",
    "The improvements you'll see with an HDR image compared to a normal image are numerous.",
    "Whereas on a standard display everything below a certain brightness is the same shade of black, an HDR TV's display range goes further, allowing you to tell the difference between something that's really really dark, and something that's just dark. (Go put on a horror movie and you'll be able to tell the difference immediately.)",
    "For example, a wide shot of a campfire at night could have subtle details in the flame rather than appearing 'blown out', along with palpable definition to objects that are barely lit in the gloomy surroundings at the edge of the frame.",
    "As Panasonic's training manager Michael Price says, \"It's about control, not just extra brightness and results in more natural expressions of light and shadow.\"",
    "When we caught up with Hollywood cinematographer Vanja Cernjul he was positively brimming with excitement about HDR, saying that: \"The whole composition is affected by the increased detail in brightness.",
    "\"You no longer have to choose whether to expose for the highlights or the shadows, so when I shoot I try and include a light source in the shot, which I can play within the HDR grading session.\"",
    "In post-production Cernjul will tinker with the levels of exposure, brightness, contrast and colour saturation, making them look as good as possible on an HDR-compatible screen.",
    "He thinks that filmmakers will, like him, be attracted to work on TV with the possibilities of HDR. Having just completed shooting the second season of Marco Polo in HDR, Cernjul sees streaming services as the natural home for HDR production, because of the number of original shows being commissioned by the likes of Netflix and Amazon.",
    "HDR is bringing media closer to what the human eye sees, and by doing so, is creating more realistic images, from scenes bleached with sunlight to nighttime shots on city streets.",
    "Here's the big takeaway: HDR TVs and content will display a more realistic color range, with an expanded contrast ratio to make black parts of the image look closer to 'true' black.",
    "Watch some carefully crafted HDR, like Cernjul's short showcase movie, Converging Beams, made for Panasonic, and you can see the potential. You get so accustomed to simultaneously seeing shadow detail and details in the highlights that you may come to find watching standard images a bit flat and dissatisfying.",
    "Not only that, but HDR has some extra zip to it compared with standard viewing. There's a new level of dynamism to images, something hugely evident in a film like the Lego Movie.",
    "When we went from standard definition to HD, screen sizes were a lot smaller and just having the extra pixels was enough to transform the picture. Now that screens are so much bigger, however, it's not enough to simply add more pixels, as there are other aspects of the image that can be improved.",
    "What HDR adds in terms of additional colours, better clarity in shadows and highlights, is subtle but significant – and it delivers a much more visually satisfying picture than simply having extra pixels. The overall effect is a punchiness that's tantamount to creating a 3D image.",
    "But the tech still needs to catch up to the promise. Some cheaper LCD HDR screens struggle with displaying bright objects against sharply darker backgrounds, causing streaks of light to run down the screen or create halos around bright objects.",
    "These issues are of less concern on the kind of OLED screens made by LG, Panasonic or Sony, where each pixel generates its own light and can go completely dark.",
    "HDR is an end-to-end technology, so every step from creation to distribution to the screen in your home needs to be HDR-compatible, which means that legacy TVs can't show it.",
    "When you go out shopping for a TV screen you may notice an Ultra HD Premium logo on it. This means that the screen offers a level of performance that's guaranteed to get the most out of an HDR source. In terms of specification the screen must have 3840 x 2160 pixels (although this is no different to any other UHD screen) plus it must be able to display a vast number of unique color shades captured within an image.",
    "The other key metric for a Premium-badged panel is a contrast ratio of at least 1,000 nits peak brightness and less than 0.05 nits black level.",
    "Nits are a term that's been adopted by the TV industry to indicate the brightness of a display. 1 nit is approximately equal to the light from a single candle.",
    "Most TV screens in use today offer between 300 and 500 nits, so that gives you a good idea of the greater luminosity required to show HDR.",
    "The above applies to LED-lit LCD screens while for OLED screens (which have lower average brightness and much lower black levels than LCD) it's 540 nits peak brightness and less than 0.0005 nits black level.",
    "Panasonic's Price says that edge-lit LED screens cannot produce high enough contrast and you need direct lighting (from behind the picture, a less-common method of lighting screens) to get enough dynamic range to meet Premium HDR requirements.",
    "In fact, the vast majority of LCD screens on sale aren't equipped to deliver the level of brightness required for a Premium badge so manufacturers are tending to simply sell non-premium models.",
    "Since manufacturers aren't obliged to reveal the number of nits (brightness) their screens achieve, or the contrast ratio, it's up to them to decide for themselves if a non-Premium screen has enough brightness and contrast to deliver a meaningful HDR image.",
    "The consumer electronics industry has previous form when it comes to offering similar but different standards, as while it was a lot easier to understand the difference between HD-Ready and Full HD the gap between \"regular\" UHD and UHD Premium displays is more fluid.",
    "But the bottom line is that the Ultra HD Premium branding is the most reliable way of ensuring you see what the creator intended.",
    "Another issue is that it's not compulsory to use the UHD Premium logo – others are (confusingly) using their own branding.",
    "Sony's product training specialist Gavin McCarran says: \"What the Ultra HD Premium logo doesn't do is show all the range of models that can receive an HDR signal.\"",
    "Maybe Sony thinks the Premium accreditation will put people off buying the non-premium models because, after all, would you buy a bottle of Moet & Chandon champagne if it were watered down to make it cheaper?",
    "The Ultra HD Premium hallmark can also be used on Ultra HD Blu-ray players and discs as HDR is a mandatory part of the Ultra HD Blu-ray spec.",
    "UHD screens without HDR compatibility will still show a 4K picture in SDR (standard dynamic range) from an Ultra HD Blu-ray but they won't be able to access the HDR metadata carried within the picture.",
    "Offering bit-rates up to 100 Mb/sec (approximately five times that used for streamed movies), in terms of content, Ultra HD Blu-ray is best placed to deliver the HDR goods.",
    "All HDR screens are able to display what's called HDR10, which has the same specification as the UHD Premium standard. It's compulsory on all Ultra HD Blu-rays, plus it appears on HDR dramas streamed by Netflix and Amazon.",
    "But there's another reason to be careful about which brand of HDR screen you buy and it's all down to the fact that there are several varieties of HDR being used by content creators.",
    "Dolby has an HDR10 rival called Dolby Vision, which has increased color depth (it's 12-bit rather than 10) and \"up to\" 10,000 nits peak brightness (which is far brighter than any current TV can offer). It also offers a feature known as 'dynamic tone mapping' which adjusts the brightness and contrast of scenes depending on how bright or dark they need to be. This dynamic mastering process is all done when the film is being edited, which means all you need to do is sit back and enjoy the fruits of someone else's hard labor.",
    "Only screens and players equipped with Dolby Vision decoding will be able to show Dolby Vision's 'improved' version of HDR. All of LG's OLED sets support it, as does Sony's flagship A1E OLED (two other Sony sets, the XE93 and XE94 are due to receive Dolby Vision support in a forthcoming firmware update).",
    "But Dolby Vision isn't the only player in the field of advanced HDR.",
    "There's Advanced HDR by Technicolor, a nascent HDR format from the people who brought you colored cartoons; Hybrid Log Gamma, which is the standard designed to work with broadcast television; and finally, HDR10+, a new standard that builds some of the benefits of Dolby Vision into an open-standard akin to HDR10.",
    "Technicolor and Philips are working together on another system that creates and delivers HDR and normal versions simultaneously, so that separate streams won't have to be created and graded. The correct content will be automatically chosen to match the screen's peak brightness and dynamic range.",
    "Finally, the BBC and NHK Japan are co-developing a version of HDR that can be used in conventional broadcasts. Called Hybrid Log Gamma, the interesting thing about the standard is that it's backwards compatible, meaning that if an SDR television receives this HDR signal, it will still be able to display an image (though obviously not an HDR one).",
    "While the big screen might be the best way to indulge in high dynamic range content, it's not the only way to watch it.",
    "HDR has been on most flagship phones since around 2017 with big names, like Apple and Samsung, ensuring the viewing tech is on their newest devices.",
    "What's more, YouTube recently made HDR videos available to certain mobile phones, including the the Google Pixel, LG V30, Samsung Galaxy S8, Samsung Galaxy Note8 and Sony Xperia XZ Premium.",
    "Interestingly, LG's handsets are compatible with the more advanced Dolby Vision standard, although you'll need to use Netflix (see below) to find any compatible content.",
    "If you want to find some YouTube HDR videos you can find a curated list of them here.",
    "Of course, YouTube isn't the only place to get HDR on the go: Netflix has also recently released the news that it too supports mobile HDR on the Samsung Galaxy Note8, LG V30, Sony Xperia XZ1 and Sony Xperia XZ Premium as well.",
    "If you're an Apple user, iTunes movies are also now available to watch on your phone with HDR, which is mostly to push people to Apple TV+, but still brings good quality viewing to your iPhone.",
    "Read our HDR on a smartphone guide for more.",
    "One of the reasons getting your head around HDR can be confusing is because there are lots of different types and terms to learn – and there are new ones announced every year. We haven't included them all in this guide, but one we think it’s worth finding out more about is HDR10+ Adaptive.",
    "HDR10+ Adaptive is a type of TV tech that’s featured in many high-end TVs. Simply put, it’s a way to calibrate picture settings on HDR10+ content in response to the intensity of light in the room around your TV screen.",
    "So for example, let’s say you want to watch something but there’s sunlight pouring in the window, well HDR10+ Adaptive calibrates picture settings in response to the intensity of light in the room around your TV screen. This might seem like a subtle difference to you, but it means you get a much better viewing experience.",
    "HDR is a landmark in home entertainment history. Think about it, we can now watch movie content in our home with the same colour grading as in the cinema – that's incredible, even if you're not a movie-lover.",
    "We can't wait for the time when broadcasters adopt HDR for the same reasons – imagine watching live sport broadcast from a stadium split between shadow and bright sunlight without a sudden jump in the exposure as the ball goes into the brighter section.",
    "Cinematically, it's going to have a significant effect too, with the director no longer needing to choose between exposing for the shadows or the sunlight. We think it'll soon be possible to say HDR has finally put the ultra into UHD viewing, and all the issues over different standards will have been resolved.",
    "However, as always there are format wars ongoing. Most hardware manufacturers are backing HDR10 (the official standard) but Dolby is a powerful force and has the content creators on its side too.",
    "It's not impossible that both standards will continue to co-exist (after all Dolby and DTS share the Blu-ray audio market) but the way to play it safe would be to choose new kit with Dolby Vision because HDR10 can always be shown on it.",
    "It's available right now and has been for some time. In fact, if you've bought a new TV over the past few years there's a good chance it's a 4K TV with HDR built-in and is one of the UHD Alliance-certified TVs.",
    "But how can you use it to watch HDR content? Well, if you own an Ultra HD Blu-ray player, are a member of either Amazon Prime, Netflix, Apple TV+ or Disney+ – or just watch the occasional video on YouTube.",
    "Those major streaming providers have also both pledged to bring the technology to new series going forward.",
    "HDR has also been included as standard in the Ultra HD Blu-ray format. The amount of discs available, not to mention the number of players, is currently slim, but as more and more films get released in the format HDR is set to hit the mainstream very soon indeed.",
    "If you're streaming, you'll need a broadband connection of at least 25Mbits to watch streamed HDR, although Netflix uses something called adaptive streaming that gives the advanced screen tech priority over resolution in the case of insufficient bandwidth.",
    "Sky Q HDR was announced by Sky, along with Spotify integration and a lot more 4K UHD content, near the start of 2018. After some wait, all of those features have now arrived – yes, including an upgraded Sky Q box for HDR.",
    "Editor's note: Additional reporting by Dave James, Nick Pino and Jon Porter"
  ],
  "headers": {
    "7": "What is HDR?",
    "26": "So what's HDR like to watch?",
    "32": "How do I get HDR?",
    "49": "HDR Standards – another cause for confusion",
    "57": "HDR isn't just for TVs, it's on your phone, too",
    "65": "What's HDR10+ Adaptive?",
    "68": "What's the verdict on HDR?",
    "73": "When will HDR be available?"
  },
  "links": {
    "4K TV": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Converging Beams": "https://www.youtube.com/watch?v=5p4UPiK-egs",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Ultra HD Premium": "https://www.techradar.com/news/television/uhd-premium-the-standard-that-wants-to-take-the-stress-out-of-your-next-tv-purchase-1322815",
    "A1E OLED": "https://www.techradar.com/reviews/sony-bravia-a1e",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "YouTube": "https://www.techradar.com/news/youtube-hdr-samsung-galaxy-note-8-lg-v30-google-pixel",
    "Google Pixel": "https://www.techradar.com/reviews/google-pixel-review",
    "LG V30": "https://www.techradar.com/reviews/lg-v30",
    "Samsung Galaxy S8,": "https://www.techradar.com/reviews/samsung-galaxy-s8-review",
    "Samsung Galaxy Note8": "https://www.techradar.com/reviews/samsung-galaxy-note-8-review",
    "Sony Xperia XZ Premium": "https://www.techradar.com/reviews/sony-xperia-xz-premium-review",
    "curated list of them here": "https://www.youtube.com/playlist?list=PL0ajMRlXs96pT13tWnQQf_uG7p2Elqy4z",
    "supports mobile HDR": "https://www.techradar.com/news/netflix-adds-hdr-streaming-support-to-the-samsung-galaxy-note-8",
    "Sony Xperia XZ1": "https://www.techradar.com/reviews/sony-xperia-xz1-review",
    "HDR on a smartphone": "https://www.techradar.com/news/hdr-on-a-smartphone-is-it-really-worth-having",
    "HDR10+ Adaptive": "https://www.techradar.com/news/new-samsung-tvs-will-calibrate-hdr10-movies-in-response-to-ambient-light",
    "Apple TV+": "https://www.techradar.com/reviews/apple-tv-plus",
    "Disney+": "https://www.techradar.com/reviews/disney-plus-review",
    "watch the occasional video on YouTube": "https://www.techradar.com/news/youtube-finally-justifies-your-hdr-tv-purchase",
    "was announced": "https://www.techradar.com/news/spotify-hdr-and-thousands-of-hours-of-ultra-hd-content-coming-to-sky-q",
    "upgraded Sky Q box for HDR.": "https://www.techradar.com/how-to/how-to-upgrade-your-sky-q-box-for-hdr"
  }
}