{
  "source": "https://www.techradar.com/news/one-of-the-best-android-phones-may-get-a-master-edition-that-removes-its-best-bits",
  "title": "One of the best Android phones may get a 'Master Edition'... that removes its best bits",
  "category": "phones",
  "updated": "2021-07-05T12:18:17Z",
  "author": "tom-bedford",
  "summary": "Realme GT Master Edition sounds like a downgrade",
  "article": [
    "If you've read our Realme GT review, you'll know that we were impressed by the phone's snappy processor, captivating design and low price - in fact, we liked it so much, we put it on our list of the best Android phones. Now, it sounds like Realme is making a new version of the phone... but with some baffling changes.",
    "Tech site 91mobiles has published some early information on this Realme GT Master Edition, as it's apparently called - the information comes from prolific leaker Steve Hemmerstoffer, so there's a good chance it's accurate, but as with all leaks take it with a little pinch of salt.",
    "Though the name 'Master Edition' suggests this new Realme GT is a Pro-style specced-up version of the phone, you might be disappointed to know that isn't the case at all. In fact, this phone misses out on all the GT's key selling points.",
    "The Realme GT had a top-end Snapdragon 888 chipset, which was surprising as that made it supremely powerful for a phone at its price point. The new version, however, apparently only has the mid-range Snapdragon 778. If true that's quite the downgrade, making the 'Master Edition' less enticing than its 'standard' counterpart.",
    "In addition, the renders show versions of the device that's plain white or black, missing out on the base GT's super-distinctive yellow faux-leather back broken up by a big black stripe. Without this design, the 'Master Edition' looks like your standard 'chocolate-bar' Android phone, and doesn't stand out from the crowd in any way.",
    "In most other areas, it sounds like the Realme GT Master Edition is the same as its 'vanilla' counterpart - well, there's one other difference, that partially justifies the aforementioned changes - the price.",
    "Apparently, the Realme GT Master Edition is set to start at €399 (roughly $470, £340, AU$630), which is fractionally cheaper than the €449, (about $550, £390, AU$710) launch price of the Realme GT. That Master Edition price gets you 8GB of RAM and 256GB of storage - you can bump that RAM up to 12GB, and that increases the phone's price to the same as the Realme GT.",
    "According to the leak, Realme was also working on a version with 6GB of RAM that would be cheaper, but this probably won't see the light of day.",
    "So for a downgraded processor and design, you're not really saving much money with the Realme GT Master Edition. If this phone really does exist, we hope there are some other changes that weren't detailed in the leak, to justify the downgrades and price, otherwise the phone might not be worth buying compared to the standard GT."
  ],
  "headers": {
    "3": "Realme GT Mediocre Edition"
  },
  "links": {
    "Realme GT review": "https://www.techradar.com/reviews/realme-gt",
    "best Android phones": "https://www.techradar.com/best/best-android-phones",
    "91mobiles": "https://www.91mobiles.com/hub/realme-gt-master-edition-renders-price-specs-exclusive/"
  }
}