{
  "source": "https://www.techradar.com/news/atandts-latest-apple-watch-deals-can-bag-you-a-free-apple-watch-se-heres-how",
  "title": "AT&T's latest Apple Watch deals can bag you a free Apple Watch SE - here's how",
  "category": "wearables",
  "updated": "2021-03-09T19:30:22Z",
  "author": "alex-whitelock",
  "summary": "Go cellular and save big this week",
  "article": [
    "A new batch of Apple Watch deals has just landed over at the AT&T site this past week which gives the option to potentially bag a free Apple Watch SE - with a few steps of course.",
    "Right now, if you purchase two Apple Watch devices at the official AT&T site and activate a new line on them ($20 each), then the carrier will throw in an Apple Watch SE - for free! While that's a few hoops to jump through, this device is worth $330 by itself, and we believe you can also make use of AT&T's trade-in program to cut the costs on those two purchases by up to $200 as well.",
    "Both the Apple Watch SE and Apple Watch Series 6 are great buys if you're on the hunt for a new smartwatch, with the former being more 'budget friendly' and a better option for those who simply want great performance, media streaming, and fitness apps. The Series 6 has a beefier processor though, and will be the one to go for if you're eager to try out the new ECG app or Blood Oxygen monitoring features.",
    "AT&T deals are normally the reserve of the latest cell phones and the carrier's postpaid plans, however, if you're shopping for accessories and other gadgets too the site can have some really strong offerings. If you were thinking about picking up a cellular smartwatch and you're already on AT&T, this is an especially good option since you can add a device to your existing plan for just $10 a month currently.",
    "Looking for an unlocked Apple Watch or outside the US? See the best Apple Watch deals in your region just down below.",
    "If you'd like to compare these AT&T offers to the other top retailers this week, then please feel free to read our main Apple Watch deals page. We've also got this week's best Samsung Galaxy Watch Active deals - which are a great alternative to consider if you're on the hunt for smartwatches in general."
  ],
  "headers": {
    "5": "Apple Watch deals at AT&T"
  },
  "links": {
    "at the official AT&T site": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3508386298169118700/https://www.att.com/buy/wearables/",
    "AT&T deals": "https://www.techradar.com/deals/the-best-att-deals",
    "for just $10 a month": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1308681419870048500/https://www.att.com/plans/unlimited-data-plans/",
    "Apple Watch deals": "https://www.techradar.com/news/cheap-apple-watch-deals",
    "Samsung Galaxy Watch Active deals": "https://www.techradar.com/news/the-best-samsung-galaxy-watch-active-prices-and-sales"
  }
}