{
  "source": "https://www.techradar.com/news/microsoft-surface-pro-7-vs-surface-pro-8-is-it-time-to-upgrade",
  "title": "Microsoft Surface Pro 7 vs Surface Pro 8: is it time to upgrade?",
  "category": "computing",
  "updated": "2021-10-15T04:20:42Z",
  "author": "matt-hanson",
  "summary": "Is the new Microsoft Surface Pro 8 worth the upgrade?",
  "article": [
    "If you're wondering which portable Surface device is the right one for you, the Microsoft Surface Pro 7 vs Microsoft Surface Pro 8, you're not alone.",
    "With the release of the Surface Pro 8, there are a lot of Surface Pro 7 owners who might be looking at their devices and wondering if its time for an upgrade.",
    "Others might not have either device and want to know if the discounts we're likely to see on the last-gen Microsoft Surface Pro 7 make it a more attractive purchase than the latest and greatest that Microsoft has to offer.",
    "Whatever the reason, there are some important differences between the two devices that might not be obvious if you're just looking at the basic spec sheet in the store or online.",
    "Fortunately, we're here to help you make sense of the the pros and cons of each device so you can pick between the two tablet computers and get the right model for your needs and budget.",
    "When it comes to the Microsoft Surface Pro 7 vs the Microsoft Surface Pro 8, the biggest difference you are likely to see is the price, which shouldn't surprise anyone.",
    "The Surface Pro 7 is an older model, which means that this is going to be the model that's less in-demand than the Surface Pro 8 so the price will come down even further from its starting price of $749 / £799 / AU$1,249 for the base model. As the Microsoft Surface Pro 8 starts hitting shelves, there is going to be a lot of pressure to move that old inventory, so the Microsoft Surface Pro 7 might be an absolute bargain come Black Friday 2021 and Cyber Monday 2021.",
    "The entry-level configuration comes with a tenth-gen Intel Core i3 i3-1005G1, 4GB RAM, and 128GB storage. The prices on the Surface Pro 7 steadily go up as you climb the spec tree. The other available configurations are as follows.",
    "These were the specs that were available at launch, so availability of a particular model might vary from region to region or even city to city.",
    "The Surface Pro 8 starts off higher, at $1,099 (around £810, $1,500), but it comes with an Intel Core i5-1135G7, 8GB, and a 128GB SSD, which is a major step up in price but the specs definitely justify it, and quite frankly, this should be considered the bare minimum of what you're need to run Windows 10/11.",
    "The Surface Pro 7 and Surface Pro 8 both run full versions of Windows, not S-mode, so it's going to be more resource hungry than an S-Mode laptop or tablet, and while 4GB is considered the minimum standard amount of RAM you need for Windows 11, this is not going to be enough RAM, pure and simple.",
    "For the Surface Pro 8, you can upgrade all the way up to an Intel Core i7, 32 GB RAM and 1TB SSD, which will cost $2,599 in the US. The top UK model is the same, only it tops out at 16GB RAM instead of 32, and that's priced at £2,059. We haven't heard about Australian availability or pricing yet, but we'll update all our guides once we hear something, even unofficially.",
    "The other major change between the Microsoft Surface Pro 7 vs Microsoft Surface Pro 8 is the design. When we reviewed the Surface Pro 7, we felt that the bezels were simply too big for a tablet-hybrid device in 2019, and thankfully Microsoft listened. The bezels aren't eliminated, buy they are at least more pleasing to look at.",
    "The Surface Pro 7 measured in at 11.5 x 7.9 x 0.33 inches (292 x 201 x 8.5mm) and weighing 1.7lbs (0.77kg), and the Surface Pro 8 comes in at 11.3 x 8.2 x 0.37 ins (287 x 208 x 9.3 mm) and weighing a bit more at 1.96 lbs (0.9 kg).",
    "The Surface 8 also has an extra 11% of screen real estate thanks to the slimmer bezels, making the whole device look much bigger than the Surface Pro 7.",
    "There have also been updated ports with the new Surface Pro 8, including two new Thunderbolt 4 ports, a 3.5mm headphone jack and the Surface Connect port. It does lose the USB 3.0 Type-A port, which the Surface Pro 7 has, but this is first and foremost a tablet, so dropping the USB Type-A if the natural choice.",
    "The slimmer bezels on the Surface Pro 8 help make the screen absolutely pop with a 2,880 x 1,920p resolution, sitting right between 4K and 1440p. The screen also has a 120 MHz refresh rate, so everything on the Surface Pro 8 is going to look great and run smoothly.",
    "The Microsoft Surface Pro 7, meanwhile, is slightly less sharp at 2736 x 1824p. This is still a gorgeous screen, though, and both the Microsoft Surface Pro 7 and Microsoft Surface Pro 8 feature a 3:2 aspect ratio.",
    "The screens on the Microsoft Surface Pro have always been one of the major wow factors for the product line, so you can rest assured that whichever model you ultimate decides on, you're going to get a fantastic looking screen.",
    "So our biggest pet peeve of the Surface Pro line is that when you buy it, you're only buying the tablet. The Type Cover ($129, £149, AU$249) and Surface Pen ($99, £99, AU$139) are not included, and all mice are all sold separately as well.",
    "This applies to both Surface Pro 7 and Surface Pro 8, so whichever way you go, you'll have to spend some extra money to get an actual computer, rather than just an overpowered tablet.",
    "The Surface Pro 7 doesn't have Thunderbolt 3 support, unfortunately, while the Surface Pro 8 has Thunderbolt 4 support, which means it will have access to a whole host of peripherals like external GPUs that the Surface Pro 7 won't be able to use.",
    "Ultimately, all of the Surface Pro 7 vs Surface Pro 8 talk can be boiled down to a pretty simply flow chart.",
    "If you don't need an especially powerful tablet-hybrid device and you want to save yourself a good bit of money, then the Microsoft Surface Pro 7 is definitely worth a look (except the entry-level Core i3, 4GB model, definitely avoid this model and go for an i5 with 8GB minimum.",
    "If you're looking for some more modern hardware that can start really taking on some of the kinds of creative and business oriented tasks traditionally reserved for full laptop systems, then the Microsoft Surface Pro 8 is definitely worth the investment.",
    "Fortunately, both models are still available, so wherever you fall on the Surface Pro 7 vs Surface Pro 8 spectrum, there's likely to be a Surface Pro product that will satisfy your needs and budget."
  ],
  "headers": {
    "5": "Price and specs",
    "12": "Design",
    "16": "Display",
    "19": "Peripherals",
    "22": "Microsoft Surface Pro 7 vs Microsoft Surface Pro 8: which one should you buy?"
  },
  "links": {
    "Microsoft Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "Microsoft Surface Pro 8": "https://www.techradar.com/reviews/microsoft-surface-pro-8",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday 2021": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}