{
  "source": "https://www.techradar.com/news/intel-core-i7-12700-leak-shows-a-cpu-thats-a-potential-threat-to-amd",
  "title": "Intel Core i7-12700 leak shows a CPU that’s a potential threat to AMD",
  "category": "computing",
  "updated": "2021-08-25T13:32:35Z",
  "author": "darren-allan",
  "summary": "Alder Lake chip keeps pace with AMD Ryzen 7 5800X in leaked benchmark",
  "article": [
    "One of Intel’s Alder Lake processors has been spotted being benchmarked, with the purported Core i7-12700 producing some interesting results – and having an interesting core count for that matter.",
    "The Intel Core i7-12700 was spotted in a Geekbench result, as flagged by BenchLeaks on Twitter, and according to the listed spec of this CPU, it has 8-cores and 16-threads. That means the chip has 8 full-power cores (with hyperthreading), but no power-efficient cores.",
    "Now, the rumored Core i7-12700K is purportedly going to offer eight full cores plus four low-power cores, for a total thread count of 20, so if the spec info provided via Geekbench is correct, the vanilla 12700 will do away with the 4 ‘small’ power-efficient cores.",
    "Clock speeds are indicative of a pre-release sample CPU with a base clock of 2.1GHz and boost to 4.8GHz, but that’s very common with early leaks (remember, Alder Lake isn’t due until later in the year, maybe around October going by the rumor mill).",
    "As for the actual result – assuming it’s genuine – the Core i7-12700 managed a score of 1,595 in single-core, with 10,170 recorded in multi-core. The former score doesn’t look great, and indeed lags behind the current Core i7-11700, which is of course disappointing on the face of it (more on that in a moment).",
    "Multi-core is a more positive showing here with the Alder Lake processor offering a 15% uptick compared to its predecessor, and coming pretty close to the performance of the Ryzen 7 5800X. This is something to get a bit more excited about, of course, particularly given that the Alder Lake silicon is a sample, so we can expect more pep than this from the final version (And remember, Windows 11 is set to fine-tune performance of Intel’s 12th-gen CPUs, too).",
    "As ever with these kinds of early benchmark leaks, we definitely can’t read too much into what is just a sample chip, and there’s only so much a single benchmark can tell us anyway.",
    "The single-core result is disappointing as mentioned, but this is symptomatic of an engineering sample, where typically scores can pitch considerably lower than what we should expect from the finished product. Indeed, there’s clearly no way Intel would release a successor CPU which was slower than the current model for single-core performance, as that just wouldn’t make any sense.",
    "As for the prospect of the Core i7-12700 doing away with power-efficient cores compared to the ‘K’ model, that’s a move to be skeptical around in our opinion. The ‘K’ variant of an Intel processor is always capable of better performance, but it does that with higher clock speeds, and being unlocked for overclocking – while the core configuration remains identical to the vanilla (non-K) offering.",
    "So, either Intel is seriously changing things up here, or the CPU’s configuration is being misread by the software – or indeed this could be a result of the 12700 shown here being an early sample chip. The latter possibilities seem more likely, so we wouldn’t get hung up on purported differences in the actual core count, and it’s surely likely the vanilla 12700 will offer 4 ‘little’ cores just like its 12700K sibling.",
    "There may be other Alder Lake CPUs which drop the power-efficient cores from the mix, as per the rumor mill, but we’d be surprised to see such a variation between K and non-K models.",
    "Via VideoCardz"
  ],
  "headers": {
    "6": "Analysis: Be careful not to read too much into all this"
  },
  "links": {
    "Intel’s Alder Lake processors": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "maybe around October going by the rumor mill": "https://www.techradar.com/news/intel-hints-at-october-27-launch-for-alder-lake-cpus-so-amd-might-want-to-get-its-skates-on",
    "Windows 11 is set to fine-tune performance of Intel’s 12th-gen CPUs": "https://www.techradar.com/news/windows-11-may-finally-be-worth-upgrading-to-thanks-to-intel",
    "processor": "https://www.techradar.com/news/best-processors",
    "other Alder Lake CPUs": "https://www.techradar.com/news/intels-alder-lake-cpus-could-be-gaming-powerhouses-eventually",
    "VideoCardz": "https://videocardz.com/newz/intel-core-i7-12700-non-k-alder-lake-cpu-is-almost-as-fast-as-ryzen-7-5800x-in-leaked-geekbench-score"
  }
}