{
  "source": "https://www.techradar.com/news/apple-watch-7-vs-apple-watch-6",
  "title": "Apple Watch 7 vs Apple Watch 6: what’s different and why you’ll love it",
  "category": "wearables",
  "updated": "2021-09-14T23:01:44Z",
  "author": "carrie-marshall",
  "summary": "Small refinements that could make all the difference",
  "article": [
    "The Apple Watch 7 has arrived and the more outlandish renders and rumors turned out not to be accurate, but while it doesn’t look dramatically different the new model is nevertheless an impressive upgrade.",
    "Apple has managed to make the screen much bigger without making the Apple Watch 7 look like you’ve strapped a dinner plate to your wrist, it charges much more quickly, and it comes in some cool new colors.",
    "Best of all, more screen doesn’t mean more money or having to throw out your existing Apple Watch bands. So what’s new? Let’s look at the key differences between this and the Apple Watch 6.",
    "The Apple Watch 6 was an evolution of the familiar Apple Watch design, with a brighter always-on Retina display and a choice of 40mm or 44mm cases. It was available in three metals - aluminum, stainless steel and titanium, and it added blue aluminum and red to the existing choice of colors. There was also a new strap, the Solo Loop.",
    "So much for the rumour factory: the radical redesign many pundits expected to see in the Apple Watch 7 didn’t make it. The new model doesn’t look dramatically different from before and it comes in the same sizes, but by reducing the borders to just 1.7mm it increases the available screen area by 20% compared to the Series 6 and offers 50% more than the Apple Watch 3.",
    "That means there’s room for 50% more text when you’re reading email or messages, and it enables you to cram more information into your watch face. The new faces make good use of that, with the dynamic Contour face pouring into the corners and the new Modular face boasting room for two large complications.",
    "The crystal covering has been redesigned to make it more crack resistant than before, and the display is brighter than before, delivering 70% higher indoor brightness. Plus, in addition to 50 meter water resistance (also offered by the Apple Watch 6) the Apple Watch 7 gets IP6X certification for dust resistance.",
    "We wonder whether the newer, tougher crystal and dust resistance explain the rumors of an 'Explorer Edition' designed for outdoor sports types; according to Bloomberg, though, there may still be such a watch, but not before 2022.",
    "There are five colors this time around: midnight, starlight, green, blue and PRODUCT(RED). That’s for the aluminum version. Stainless steel models come in silver, graphite or gold, and titanium ones come in natural or space black. There’s also a new Nike sports loop and some new Hermes bands for high rollers. All models are compatible with existing Apple Watch bands.",
    "The Apple Watch 6 added blood oxygen monitoring and ECG, sleep tracking, and tight integration with Apple’s Fitness Plus service. It also introduced Family Setup for GPS+Cellular models, which makes it easier to set up and control younger family members’ watches.",
    "There are no headline-grabbing new sensors in the Apple Watch 7, but there is a new fall detection feature for cyclists and an improved algorithm to better track e-bike rides.",
    "The larger display also makes it possible to have a full on-screen keyboard that you can type or swipe on, and it uses machine learning to try and predict what you’re going to type next.",
    "Where the Apple Watch 6 currently runs watchOS 7, you can upgrade it to the same watchOS 8 as the Apple Watch 7 when the OS is released, on September 20. Its battery is rated for 18 hours of normal use.",
    "The Apple Watch 6 has an Apple S6 chipset, a dual-core processor based on the A13 Bionic from the iPhone 11, alongside Apple’s W1 wireless chip and U1 ultra-wideband processor. It has Bluetooth 5.0 and dual-band Wi-Fi up to 802.11n, and the cellular model has 4G LTE.",
    "Apple hasn’t published details of the Apple Watch 7's processor and internals yet, but the emphasis this year appears to be more on energy efficiency than on raw performance.",
    "The battery life in the Apple Watch 7 is also 18 hours but it charges much more quickly – 33% faster, says Apple – thanks to a new USB-C charger. 8 minutes of charge will give you enough juice for 8 hours of sleep tracking.",
    "The Apple Watch 6 range started at $399 / £379 /AU$599 for the aluminum version, but the price rose with more storage of if you wanted stainless steel or titanium. Certain case and strap combinations were also more expensive, especially the Hermes editions.",
    "The Apple Watch 7 also starts at $399 for Wi-Fi and $499 for cellular, with prices in other regions not yet confirmed, but likely to be similar to the Apple Watch 6's launch price.",
    "It looks like the rumored display issues have indeed affected the Apple Watch 7: while the iPhone 13 range is shipping within a week of launch, the Apple Watch 7 is only promised for “fall”, which officially runs until late December.",
    "When the Apple Watch 7 ships, the Apple Watch range will consist of three models: the Apple Watch SE, the Apple Watch 3 and the Apple Watch 7, so if you do want the Apple Watch 6 you'll either have to buy it soon or get it from a third-party retailer.",
    "There’s nothing here to make Apple Watch 6 owners rush to the Apple Store with their credit cards twitching in anticipation of life-changing upgrades, but there’s no doubt that the Apple Watch 7 is the most attractive of all the Apple Watch models: it’s more useful, it has more screen, and it’s much faster to charge than ever before.",
    "The Apple Watch has gone from a “what does it do? Who knows? Let’s find out!” product to something more settled, and what the Apple Watch 7 lacks in excitement it delivers in refinement.",
    "It may not look dramatically different from its predecessors, but when you compare them side by side it is noticeably smoother and more elegant; those narrower borders make the same difference to the Apple Watch 7 as the thinner bezels of the iPhone 13 do to differentiate it from the iPhones of a few years ago.",
    "Going purely by the specs and the design then, if you aren’t already wearing an Apple Watch 6, we think you’re going to love the Apple Watch 7."
  ],
  "headers": {
    "3": "Apple Watch 7 vs Apple Watch 6: design and display",
    "9": "Apple Watch 7 vs Apple Watch 6: fitness and features",
    "12": "Apple Watch 7 vs Apple Watch 6: OS, power and battery",
    "16": "Apple Watch 7 vs Apple Watch 6: price",
    "20": "Takeaway"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review"
  }
}