{
  "source": "https://www.techradar.com/news/industry-chief-warns-severe-dram-shortage-wont-be-ending-any-time-soon",
  "title": "Industry chief warns 'severe' DRAM shortage won't be ending any time soon",
  "category": "computing",
  "updated": "2021-04-02T09:14:27Z",
  "author": "mayank-sharma",
  "summary": "The limited supply will drive up prices",
  "article": [
    "Computer memory and data storage manufacturer Micron has admitted that measures to tackle the current Taiwan drought will have a lasting impact on the supply of memory.",
    "Micron’s announcement follows news that Taiwan, in its efforts to grapple with the island’s worst drought in over half a century, has reduced water supply to several industrial areas, including one that is a hub of semiconductor manufacturing.",
    "This has forced Taiwanese fabrication units to curb operations. The industry was bracing for the impact of this drop in supply, though Micron is the first to acknowledge the impact publicly.",
    "\"As a result of the strong demand and limited supply, the DRAM market is currently facing a severe undersupply, which is causing DRAM prices to increase rapidly. We see the DRAM market tightening further through the year,\" said Micron CEO Sanjay Mehrotra on an earnings call.",
    "It’s turning out to be a tough year for Micron. The company recently bowed out of its collaboration with Intel on 3D XPoint memory, owing to poor sales. It also put up its under-utilized manufacturing unit for sale.",
    "Seen in light of the recent developments, it stands to reason that the company wants to optimize the use of its limited supply of silicon.",
    "Micron's CFO, David Zisner, is also said to have acknowledged that the company’s inventory was “pretty lean” during the call, adding that it doesn’t have enough to meet the demands of its customers.",
    "Micron is one the biggest manufacturers of RAM, which accounts for over 70% of its revenue, and the lack of supply will have a cascading effect and drive up prices of laptops and workstations.",
    "Via The Register"
  ],
  "headers": {
    "4": "Brace for impact"
  },
  "links": {
    "Micron": "https://www.techradar.com/reviews/micron-1tb-c200-microsd-uhs-i-card",
    "memory": "https://www.techradar.com/news/best-ram",
    "bowed out": "https://www.techradar.com/news/major-blow-for-intel-as-micron-pulls-3d-xpoint-memory",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "The Register": "https://www.theregister.com/2021/04/01/dram_shortage_micron/"
  }
}