{
  "source": "https://www.techradar.com/news/microsoft-teams-could-leave-its-rivals-in-the-dust-but-it-wont",
  "title": "Microsoft knows about the worst Teams problems, but can’t decide how to fix them",
  "category": "computing",
  "updated": "2021-10-18T15:03:53Z",
  "author": "joel-khalili",
  "summary": "Pipeline for new Microsoft Teams updates is chock-full of good ideas, but not all will make it",
  "article": [
    "New features for Microsoft Teams are being held back, despite having the potential to make the collaboration platform the undisputed market leader.",
    "In various threads on the Teams User Voice forum, an official channel for customers to submit ideas for consideration, the company has acknowledged the validity of users’ complaints. However, solutions for many of these issues do not appear to be forthcoming.",
    "Although some of the most upvoted ideas have already been implemented by Microsoft (like ability to reply to a specific chat message, which received 50,000 votes) and others are under active development, many more projects appear to have stalled completely.",
    "A common complaint on the User Voice forum is that Teams is not optimized for use in a small window, unlike rival applications such as Slack. The problem was first noted in 2016 and the forum post has since accrued almost 21,000 upvotes.",
    "“The current chat layout is not suited for professional chats; it’s way too space-consuming,” complained the original poster, who called for a more compact design to accommodate different types of monitor setup.",
    "Members of the Microsoft team have posted in the thread on 25 occasions, calling for further feedback, announcing the issue was under review and providing updates on progress. However, the latest post (from June) simply updated the status to “Planned”, without providing any further details, to the annoyance of some forum members.",
    "Another post, which calls for the ability to move a project channel from one team to another, has even more public support, with 32,000 upvotes. The thread was also created in 2016, but the latest post from Microsoft (which is itself now a year and a half old) explains that the item has been put on hold for the foreseeable future.",
    "“This continues to be on our backlog due to the prioritization of other work items. We will update when there is more to share,” wrote a member of the Teams engineering department.",
    "This is not to suggest Microsoft hasn’t invested sufficient energy and resources into Teams; since the pandemic began, the company has pushed out a bounty of new features for the platform. However, the stagnant forum posts do call into question the effectiveness of the company’s user feedback mechanisms.",
    "TechRadar Pro has asked Microsoft for comment on its specific plans with regards to the most popular ideas from the User Voice forum."
  ],
  "headers": {
    "3": "Microsoft Teams feedback"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "most upvoted ideas": "https://microsoftteams.uservoice.com/forums/555103-public/filters/top",
    "Slack": "https://www.techradar.com/reviews/slack",
    "forum post": "https://microsoftteams.uservoice.com/forums/555103-public/suggestions/17408641-compact-mode",
    "monitor": "https://www.techradar.com/news/best-business-monitor",
    "thread": "https://microsoftteams.uservoice.com/forums/555103-public/suggestions/16939708-move-a-project-channel-from-one-team-to-another"
  }
}