{
  "source": "https://www.techradar.com/news/ring-video-doorbell-pro-2-vs-arlo-video-doorbell-which-doorbell-camera-is-right-for-you",
  "title": "Ring Video Doorbell Pro 2 vs Arlo Video Doorbell: Which doorbell camera is right for you?",
  "category": "smart-home",
  "updated": "2021-12-05T08:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "A ding-dong battle",
  "article": [
    "The best video doorbells ensure that you never miss a delivery again (and that you can give cold callers the cold shoulder) by enabling you to see and speak to whoever is on your doorstep from your smartphone, even when you’re not at home.",
    "Arlo and Ring are two of the biggest names in the video doorbell market right now, and each offers a flagship video doorbell that captures footage in an aspect ratio that ensures you can see the full length of someone on your doorstep, and any packages at their feet - ideal if you’re doing your holiday shopping online.",
    "The Arlo Video Doorbell will set you back $149.99 / £179.99 / AU$289.99, while the Ring Video Doorbell Pro 2 is a good bit more expensive at $249.99 / £219 / AU$399.99. You may be wondering whether spending an additional $100 / £40 / AU$110 will result in a better experience when conversing with people at your threshold, so we pitted the Ring Video Doorbell Pro 2 against the Arlo Video Doorbell to help you choose the best video doorbell for your home.",
    "Read on to find out how these doorbell cameras compare – or, if you already know which smart doorbell you want to buy, you can check out the current best prices for both products below:",
    "Wen it comes to cost, the Arlo Video doorbell is more affordable than Ring’s top-of-the-range smart doorbell. As we’ve mentioned, Arlo’s model is priced at $149.99 / £179.99/ AU$289.99, while the Ring Video Doorbell Pro will set you back $249.99 / £219 / AU$399.99.",
    "Both models are mains powered, although Arlo does offer a wireless version of its doorbell, which costs $199.99 / £179.99 / AU$329. In the US and Australia, the Arlo Essential is $50 / AU$40 more expensive than the wired doorbell, while in the UK the two are the same price.",
    "Ring doesn’t offer a battery-powered version of the Ring Video Doorbell Pro 2. If you want a wire-free option, you’ll need to invest in the Ring Video Doorbell 4, which doesn’t offer the same video quality or aspect ratio as the Pro model, but is more affordable at $199.99 / £179 / AU$329.",
    "To get the most out of both doorbells, and review footage recorded by the camera at a later date, you’ll need to subscribe to the relevant online storage service. In the case of Ring Video Doorbell, this is Ring Protect, which is priced from $3 / £2.50 /AU$4 per month. For Arlo devices, you’ll need an Arlo Secure subscription, which starts at $2.99 / £2.79 / AU$4.49 per month.",
    "While both video doorbells are compact, with a small footprint, each has a distinct look. The Ring Video Doorbell Pro 2 has a rectangular design, which combines a glossy black fascia with a slim silver surround, which is removable and can be swapped for alternatives in an array of colors including red, blue, and gold. The Arlo Video Doorbell sports a rounded design with a stylish monochrome finish.",
    "Both doorbells feature a button that illuminates when pressed and have a built-in camera, microphone, and speaker that enable you to see and speak to anyone on your doorstep. The Ring Video Doorbell’s lens has a 150-degree field of view, and captures footage at a resolution of 1536 x 1536p, while the Arlo Video Doorbell has the same resolution but a wider 180-degree field of view.",
    "As mentioned, both doorbells are mains-powered and need to be connected to existing doorbell wiring, although in the UK the Ring Video Doorbell Pro 2 is available with an adapter that enables you to plug it into a power outlet. If you have an existing chime in your home, both doorbells will activate this when they’re pressed.",
    "If you don’t already have a chime, both Ring and Arlo offer an additional plug-in chime that connects to the doorbell wirelessly. The Ring Chime will set you back $29.99 / £29.99 / AU$59, while the Arlo Chime is priced at $49.99 / £44.99 / AU$79.",
    "Alternatively, both video doorbells can be connected to a smart speaker or smart display to sound an alert in your home. However, in the case of the Ring Video Doorbell Pro 2, this only applies to Amazon’s range of Echo smart speakers and Echo Show smart displays. Arlo’s doorbell, meanwhile, is compatible with Amazon’s devices, as well as those that use Google Assistant, and also has HomeKit support for those invested in Apple’s ecosystem.",
    "When it comes to essential functionality, the Ring Video Doorbell Pro 2 and Arlo Video Doorbell are evenly matched. Both will send an alert to your smartphone and will activate a connected chime when the doorbell is pressed, or motion is detected in the field of view.",
    "On receiving this alert you can either log in and view the doorbell’s live feed from your smartphone or, provided that you’ve subscribed to the relevant storage service, review the footage at a later date.",
    "During testing, we were impressed with the quality of video captured by both doorbells. The footage was clear, and audio was in sync with the picture. Ring’s doorbell has an advantage over Arlo’s here, as it captures colorized night-vision footage when it’s dark. While there’s no built-in LED (a feature that many of Ring and Arlo’s home security cameras offer), the doorbell uses ambient light in the camera’s field of view to apply a simulated color to the image and provide more detailed footage. This comes in handy if you don’t have a porch light, or it’s not always on. However, the Arlo doorbell’s wider field of view means more of your driveway is captured in the video.",
    "Both video doorbells allow you to set activity zones so that you’re only notified about motion in these areas, although as with many of the other features this does require a subscription. The Arlo doorbell is slightly better at distinguishing between different types of motion, and can identify people, animals, vehicles, and packages, while Ring’s video doorbell can identify people, but not animals and vehicles; it does have a package detection mode, but this is more fiddly to set up than on Arlo’s doorbell.",
    "We also found that the notifications Arlo’s video doorbell sends when the doorbell is pressed are harder to miss. The doorbell places a Voice over IP (VoIP) call to your smartphone, rather than just sending an alert. On test, once this call was answered it was slightly faster to load the live feed from the doorbell’s camera than the feed from the Ring Video Doorbell Pro 2.",
    "Ring also offers a couple of features not found on the Arlo Video Doorbell. 3D Motion uses radar to identify the distance of a person, animal, vehicle, or another source of motion from your door, and only sends a notification when the motion is within a certain range so that you’re not plagued by unwanted alerts. The Bird’s Eye View feature provides an aerial map charting the path of any motion, which can be useful in working out where a delivery person went with your package if you weren’t home, for example.",
    "When it comes to choosing the best video doorbell, both the Ring Video Doorbell Pro 2 and the Arlo Video Doorbell perform their basic tasks equally well.",
    "For those on a tighter budget, or who want a video doorbell that prioritizes speed of alerts and offers the widest field of view, the Arlo Video Doorbell is the better choice.",
    "However, the Ring Video Doorbell Pro 2 is better suited to those who want color night vision, or a device that’s loaded with features to reduce unwanted alerts, and track motion once the source leaves the doorbell’s field of view."
  ],
  "headers": {
    "3": "Best Ring Video Doorbell Pro 2 and Arlo Video Doorbell deals",
    "4": "Price",
    "8": "Design",
    "13": "Features",
    "19": "Verdict"
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "Arlo Video Doorbell": "https://www.techradar.com/reviews/arlo-video-doorbell-review",
    "Ring Video Doorbell Pro 2": "https://www.techradar.com/reviews/ring-video-doorbell-pro-2-review",
    "Ring Video Doorbell 4": "https://www.techradar.com/reviews/ring-video-doorbell-4",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "smart displays": "https://www.techradar.com/best/best-smart-displays"
  }
}