{
  "source": "https://www.techradar.com/news/ps5s-dualsense-gets-two-new-color-options-and-you-can-pre-order-them-now",
  "title": "PS5's DualSense gets two new color options – and you can pre-order them now",
  "category": "gaming",
  "updated": "2021-05-14T18:16:21Z",
  "author": "stephen-lambrechts",
  "summary": "Say hello to Cosmic Red and Midnight Black",
  "article": [
    "Say what you will about the PS5 console’s design, but more or less everyone agrees that Sony’s DualSense controller is pretty impressive, thanks in particular to its excellent haptic feedback and next-gen adaptive triggers.",
    "Like the PS5 console, the DualSense controller has only been available in white since launch, which is one of the gamepad’s only points of contention amongst gamers.",
    "That’s all about to change, though, with the announcement that Sony is releasing two new DualSense color options, named Cosmic Red and Midnight Black respectively.",
    "Given how many people have been champing at the bit for Sony to release a black PS5 console, or even just black face plates (inspiring some companies to create and sell their own third-party ‘darkplates’), we imagine the Midnight Black controller option will sell like hot cakes.",
    "Meanwhile, the Cosmic Red color brings an increased boldness to the controller, admittedly looking a little closer to magenta than a true Ferrari-style red.",
    "Surprisingly, one of the controllers is priced slightly higher than the other, with the Cosmic Red version priced at $74.99 (£64.99 / AU$119) and the Midnight Black version priced at $69.99 (£59.99 / AU$109).",
    "Both controllers are available to pre-order now from most major gaming retailers, and are set for release on June 18, according to Amazon."
  ],
  "headers": {
    "3": "It’s about time!"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "black PS5": "https://www.techradar.com/news/okay-so-i-kind-of-love-the-darkplates-that-have-given-me-a-black-ps5",
    "create and sell their own third-party ‘darkplates’": "https://www.techradar.com/news/okay-so-i-kind-of-love-the-darkplates-that-have-given-me-a-black-ps5",
    "according to Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FPlaystation-Dualsense-Midnight-Black-Wireless-Controller%2Fdp%2FB094WL86N5%2Fref%3Dsr_1_1%3Fbrr%3D1%26dchild%3D1%26qid%3D1621016135%26rd%3D1%26s%3Dvideogames%26sr%3D1-1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7792237091587462000-20"
  }
}