{
  "source": "https://www.techradar.com/news/oneplus-9t-might-be-gone-in-favor-of-a-cheap-phone-in-weird-twist",
  "title": "OnePlus 9T might be gone in favor of a cheap phone, in weird twist",
  "category": "phones",
  "updated": "2021-08-19T15:15:18Z",
  "author": "tom-bedford",
  "summary": "The OnePlus 9 RT, apparently?",
  "article": [
    "You might not have heard of the OnePlus 9R, as the sibling of the 9 and 9 Pro didn't actually launch in all regions, but according to a rumor OnePlus' end-of-year phone isn't the OnePlus 9T, but a spin-off of this R device.",
    "This comes from Android Central, which backs up rumors the OnePlus 9T has been canceled, but also suggests it'll be replaced the 'OnePlus 9 RT' in October. According to the site, this will only be released in regions the OnePlus 9R was, and most countries (like the US and UK) will get nothing.",
    "The site has some specs for the phone too; apparently it'll have a Snapdragon 870 chipset, a 120Hz screen, a 4,500mAh battery, 65W charging and a 50MP camera. It sounds like a competitive mid-range phone, making it a shame if it doesn't come to a global market.",
    "Finally, apparently the phone will debut OxygenOS 12, OnePlus' take on Android 12, which would make it one of the first handsets to run Google's newest operating system straight out the box. OxygenOS 12 is available in beta form for a few devices, but it seems the OnePlus 9 RT could be among the first devices with it installed.",
    "It's almost hard to find a OnePlus phone that's readily available in all regions.",
    "If the OnePlus 9 RT is exclusive to India and China, it'll join the 9R in that regard. Many of the Nord series devices are only buyable in Europe and India, but some of the Nord N handsets (the cheapest the company offers) are only available to buy in the US.",
    "In fact, only the main-series phones are available globally.",
    "This can make it hard for prospective phone buyers to easily find a OnePlus phone that they want to buy. Recommendation websites like Reddit, forums and even TechRadar operate in many regions, so you might see a glowing review of a phone from the company, and set your heart on it, only to find it can't be bought where you live.",
    "OnePlus isn't the only company to operate in this confusing way - Motorola and Xiaomi offer the same phones in different countries under different names, which is an unnecessary way to trip up customers (and annoy journalists).",
    "We can't say for sure how many people have been put off by OnePlus' scattergun phone availability, but it'd definitely put us off the company if we were an average buyer. Why try to deduce which phone is available where, if you can just jump to another company and buy a readily-available device?"
  ],
  "headers": {
    "4": "Analysis: too many region exclusives"
  },
  "links": {
    "OnePlus 9R": "https://www.techradar.com/reviews/oneplus-9r",
    "9": "https://www.techradar.com/reviews/oneplus-9-review",
    "9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "Android Central": "https://www.androidcentral.com/oneplus-9-rt-october-oxygenos-12",
    "OnePlus 9T has been canceled": "https://www.techradar.com/news/oneplus-9t-may-be-canceled-says-leaker",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "OnePlus phone": "https://www.techradar.com/news/best-oneplus-phones"
  }
}