{
  "source": "https://www.techradar.com/news/is-hawkeye-affected-by-the-multiverse-mcu-shows-director-and-producer-weigh-in",
  "title": "Is the multiverse coming to Hawkeye? Its director and producer weigh in",
  "category": "entertainment",
  "updated": "2021-11-24T11:34:06Z",
  "author": "tom-power",
  "summary": "Exclusive: 'You'll find out one way or another'",
  "article": [
    "Hawkeye director Rhys Thomas has refused to confirm or deny if the next MCU Disney Plus show will be impacted by the multiverse's arrival.",
    "Speaking exclusively to TechRadar ahead of the series' November 24 launch, Thomas teased the possibility that Clint Barton's solo adventure may or may not be affected by the growing threat of the multiverse.",
    "Marvel's Phase 4 plans are centered around the multiverse's arrival in the MCU, with the likes of WandaVision, Loki and What If...? season 1 ushering it into the fold. The multiverse will fully take effect in Spider-Man: No Way Home before it's explored at length in Doctor Strange 2 in May 2022.",
    "With Hawkeye set to land on Disney's streaming platform before No Way Home and Doctor Strange 2 are released, though, Marvel fans have wondered whether the TV show will be affected by the multiverse. Asked if this would be the case by TechRadar, though, Thomas remained tight-lipped on the prospect.",
    "\"I mean, I can't speak to that,\" Thomas said, before jokingly adding: \"I will tell you that I don't understand the multiverse, if that helps answer the question! But yeah, I don't want to say yay or nay because, you know, we'll keep people guessing.\"",
    "Thomas' comments were backed up by Hawkeye executive producer Trinh Tran. When we put a similar question to the Avengers: Endgame producer in a separate interview, Tran was equally hesitant to give anything away.",
    "\"You'll have to stay tuned,\" Tran teased. \"You'll find out! One way or another, these storylines are connected, whether or not it's multiverse related or not. I think you'll find out soon.\"",
    "Hawkeye takes place post-Endgame, with Clint Barton trying to make up for lost family time after his wife and kids were erased from existence by Thanos in Avengers: Endgame.",
    "At the time of writing, the series isn't out for another six days. But, having seen the first two episodes, we can confirm that it's set in the present – although there's no indication of how much time has passed between Endgame and the start of the Hawkeye TV show.",
    "If it takes place around the same time as Loki and Spider-Man: No Way Home, it's inevitable that the multiverse will affect Hawkeye's standalone story in some fashion. If it's set before that Disney Plus series and MCU movie, however, it may not be impacted by the multiverse's arrival – just like Falcon and the Winter Soldier wasn't.",
    "Right now, it's hard to predict either way. But, if you believe rumors swirling around who might appear in Hawkeye, you may already know the answer.",
    "We're about to dig into potential spoilers for Hawkeye. If you want to go into the series with no prior knowledge of who may show up, don't read past the image below.",
    "According to speculation that's circulated online for months, Wilson Fisk will appear in Hawkeye. Not only that, but the iconic Marvel supervillain – who also goes by the name Kingpin – will be portrayed by Vincent D'Onofrio, who played the character in Netflix's acclaimed Daredevil TV series.",
    "Just recently, D'Onofrio retweeted an official teaser trailer for Hawkeye, captioning it with \"This is going to be fun. I love these @Marvel series\". Immediately, some fans took this to mean that D'Onofrio would be appearing as Fisk in the Disney Plus show.",
    "This isn't the first time that D'Onofrio has teased his potential involvement. Four months ago, D'Onofrio liked a tweet that said he'd be reprising his role as Fisk in Hawkeye. Less than a day later, too, the actor had unliked the tweet, lending further veracity to the claims. Other apparent in-the-know individuals have also suggested that Fisk will be part of Hawkeye's cast.",
    "Add in the fact that Marion Dayre, who is the lead writer on Marvel's upcoming Echo Disney Plus show – Alaqua Cox will portray Echo/Maya Lopez in Hawkeye, too – has teased that Kingpin and Daredevil will be part of Echo's cast, and Fisk's appearance in Hawkeye isn't so outlandish. Echo's own TV adventure may follow on from Hawkeye, who Echo potentially enlisting Daredevil's help to track Fisk down.",
    "So let's bring it back around to Hawkeye. If D'Onofrio is reprising his role as Fisk/Kingpin in Hawkeye, and if he's the same version of the character that we saw in Daredevil, then we have our answer. If both of those things are true, the Hawkeye TV show will be affected by the multiverse.",
    "Hawkeye's first two episodes launch exclusively on Disney Plus on Wednesday, November 24."
  ],
  "headers": {
    "7": "Analysis: Hawkeye's place on the MCU timeline may hold the key"
  },
  "links": {
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "Marvel's Phase 4": "https://www.techradar.com/news/marvel-phase-4",
    "Loki": "https://www.techradar.com/news/loki-season-2",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "liked a tweet": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/oqdfvh/vincent_donofrio_likes_a_tweet_reporting_that_he/",
    "in-the-know individuals": "https://www.thecosmiccircus.com/is-vincent-donofrio-returning-as-kingpin-in-hawkeye/"
  }
}