{
  "source": "https://www.techradar.com/news/why-android-is-the-os-of-choice-for-emergency-services",
  "title": "Why Android is the OS of choice for emergency services",
  "category": "computing",
  "updated": "2021-06-24T14:36:39Z",
  "author": "margaret-reynolds",
  "summary": "Emergency services migrating to Android OS",
  "article": [
    "As Microsoft phases out support for its mobile operating systems (OS) many Emergency Services that previously relied on Windows-based mobile computers are evaluating strategies to migrate to Android.",
    "Android has an 85% market share globally, which makes it very user-friendly. It also offers a number of key benefits to enterprise users that aren’t available with other OS options. Of course, migrating to a new technology is not as easy as buying a mobile device from a local retail store or wireless carrier. Emergency Services IT professionals should prioritize their unique security and operational needs when shopping for a new handheld mobility solution. Here are some key questions to ask when evaluating the various OS options and comparing consumer-grade, business-grade and enterprise-grade rugged mobile computers.",
    "Emergency Services organizations, especially police and fire departments, require rugged communications devices to support a wide range of use cases. And their mobile applications range from highly secure voice communications and real-time navigation, asset and inventory tracking and more. The users may require different form factors based on their applications needs. Devices may need to be used with gloved hands, in bright sunlight or inclement weather conditions such as rain or snow – and they may require robust batteries that last through long shifts. Not all devices marketed as rugged are designed to withstand these challenges.",
    "It is vital to ensure that a technology solution can comply with an organization's existing IT guidelines. For example, some Emergency Services have limitations on whether their professionals can carry devices that access the cloud – either for security reasons or because they don’t have enough resources to support a cloud-based deployment.",
    "In this case, consumer devices purchased from a wireless carrier may not be adequate, as applications commonly pre-loaded on consumer devices – such as Google Mobile Services (GMS) – often operate through the cloud. Selecting an enterprise-grade device that can restrict access to applications and services such as GMS can provide Emergency Services with a higher security level without requiring any additional IT resources.",
    "As another enhanced security measure, an IT department may want to consider privilege-based access and trusted execution environment controls, which give IT full control over which applications are installed and what data those applications can access. Some Emergency Services may want to disable Bluetooth® or USB ports, which make devices more vulnerable to attacks and allow the easy transfer of sensitive data. Others may want the option to insert a Smart Card/Common Access Card (CAC) for access control.",
    "Often, enterprise-grade devices provide customization tools that enable a wide variety of productivity, security, management and application development options for Emergency Services IT departments. Some tools allow the customization of Wi-Fi settings for specialized environments. Others support zero-touch device provisioning for faster technology deployments and include private cloud or side loading off network. Still, others allow users to create a custom keyboard that supports an agency’s unique vocabulary without requiring any third-party software. Some enterprise-grade devices even offer data wedge tools that allow the test of barcode, RFID or even basic voice recognition with existing applications.",
    "Emergency Services should take into consideration the average device lifecycle as part of the evaluation process. Agencies simply cannot afford to replace devices every 24 months, which is about the typical consumer device lifecycle. The reality is that many consumer device vendors only guarantee security support for two to three years. In sharp contrast, some enterprise device vendors guarantee OS support for up to 10 years. With purpose-built devices, Emergency Services can rest assured knowing they will not have to replace their existing devices before they are ready.",
    "With consumer devices, OS updates are typically forced upon device users. Management tools may offer to postpone updates, but the window for this is only a short period of time, forcing users to upgrade whether they want to or not. In some cases, this can cause unexpected and often costly operational issues. For many enterprise solutions, quite the opposite is true. Emergency Services IT departments have control over their OS upgrades, which means upgrades can be delayed until all suppliers or application partners are ready to migrate to the newest OS. IT can even revert back to a past release if an issue arises. Besides, some enterprise vendors will continue to issue OS patches long after an OS upgrade is available.",
    "In a recent Zebra Technologies survey , 72% of respondents said they are concerned they are not investing in new mobile technology fast enough. The survey also revealed that the adoption of mobile devices will increase quickly over the next three years, as 95% of a will deploy rugged tablets without keyboards, 90% will use rugged 2-in-1 tablets, 95% will invest in rugged smartphones, and 91% will have mobile printers on the field., There has never been a better time for Emergency Services to migrate to Android-based enterprise-grade mobile devices that offer more security, productivity and lifecycle benefits than legacy solutions – and today’s consumer-grade devices."
  ],
  "headers": {
    "2": "What applications does your Emergency Services require?",
    "3": "Can this solution be customized to comply with current IT and security requirements?",
    "6": "What extra features can I implement with this solution?",
    "7": "What is the lifecycle of the technology solution I am considering?",
    "8": "Do I have control over OS upgrades?",
    "9": "Looking forward"
  },
  "links": {
    "mobile": "https://www.techradar.com/best/best-mobile-app-development-software",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "applications": "https://www.techradar.com/best/best-android-apps-2021",
    "navigation": "https://www.techradar.com/news/best-sat-nav-the-ultimate-gps-units-on-the-market-right-now",
    "cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "data": "https://www.techradar.com/best/best-data-recovery-software",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "rugged tablets": "https://www.techradar.com/news/the-best-rugged-tablets"
  }
}