{
  "source": "https://www.techradar.com/news/this-top-of-the-line-garmin-smartwatch-is-at-its-lowest-price-ever",
  "title": "This top-of-the-line Garmin smartwatch is at its lowest price ever",
  "category": "wearables",
  "updated": "2021-12-07T12:24:40Z",
  "author": "jamel-smith",
  "summary": "Head over to Amazon to get this deal",
  "article": [
    "Despite Cyber Monday being behind us, Amazon still has some incredible deals available, like this $200 discount on the Garmin Fenix 6X Pro, which is at its lowest price ever. (Not in the US? Scroll down for deals in your region.)",
    "The Fenix 6X Pro normally sells for $699.99, but Amazon has slashed the price by 28% to $499.99. This is one of the best multisport smartwatches on the market, and has a 1.4-inch Gorilla Glass display plus 32GB of storage. You won’t be limited by battery life either, as it can last up to 21 days without charging in smartwatch mode and 80 days in battery saver mode.",
    "Along with this come heart rate and pulse ox sensors that’ll give you insights into your fitness activities. There’s also a Dynamic PacePro feature that will help you run smarter over different types of terrain.",
    "This smartwatch also includes Garmin Pay – its own form of Apple Pay – a contactless payment solution that will make you breeze through checkout lines. Plus, the Fenix 6X Pro supports music streaming services like Spotify.",
    "No matter where you live, you'll find all the lowest prices for the Garmin Fenix range from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "More Garmin Fenix 6 deals"
  },
  "links": {
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "price by 28% to $499.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FGarmin-Multisport-features-Grade-Adjusted-Guidance%2Fdp%2FB07W69KKHV%2Fref%3Dsr_1_4%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2519720750925988000-20"
  }
}