{
  "source": "https://www.techradar.com/news/leak-details-how-a-portless-iphone-13-could-be-reset-without-a-lightning-cable",
  "title": "Leak details how a portless iPhone 13 could be reset without a Lightning cable",
  "category": "phones",
  "updated": "2021-02-28T14:30:15Z",
  "author": "david-nield",
  "summary": "No computer required",
  "article": [
    "One of the many iPhone 13 rumors that have come our way in the last few months is the idea that the device could ditch the Lightning connection entirely and go completely portless – and we just got some more details about how this might be achieved.",
    "According to information obtained by Appleosophy, Apple hardware and software engineers are exploring a method of iPhone recovery over the internet, which would use Wi-Fi or Bluetooth rather than a physical cable to reset an iPhone.",
    "At the moment, you can return an iPhone to its factory settings through iOS, but if the device won't turn on or the software is corrupted, you need to connect it to a PC or Mac. Under the new system, that physical connection wouldn't be required.",
    "Instead the iPhone would broadcast a sort of help signal via Wi-Fi or Bluetooth, which would enable a computer connection, Appleosophy reports. Alternatively, the smartphone could launch and go through the recovery process all by itself, once it gets online.",
    "These ideas are still being explored within Apple, apparently, and the Bluetooth option is currently the least popular among engineers because of the possible security issues (someone resetting your phone without your permission, perhaps).",
    "It doesn't sound as though Apple has come to a decision about how this is going to be handled, but this 'Internet Recovery' approach is one way that the iPhone 13 or another future iPhone could ditch the Lightning port for good.",
    "Charging would have to be exclusively wireless as well of course, and we're presuming that Apple would eventually make the same move with the iPad. Appleosophy says Apple has learned from the Apple Watch, which can't be easily reset if the software is unresponsive without returning it to Apple.",
    "Appleosophy isn't a source we've heard a huge amount from recently, so don't take this as definitive just yet – but the rumor does fit in with previous reports about Apple wanting to make the iPhone portless in the next few years.",
    "Via Apple Insider"
  ],
  "headers": {
    "4": "To be confirmed"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Appleosophy": "https://appleosophy.com/2021/02/26/exclusive-portless-iphone-13-recovery-process/",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-6-review",
    "fit in with previous reports": "https://www.techradar.com/news/iphone-13-once-again-rumored-to-be-portless-but-not-all-models",
    "Apple Insider": "https://appleinsider.com/articles/21/02/27/portless-iphone-13-could-restore-ios-without-needing-a-cable"
  }
}