{
  "source": "https://www.techradar.com/news/new-visa-services-turn-traditional-banks-into-bitcoin-exchanges",
  "title": "New Visa services turn traditional banks into Bitcoin exchanges",
  "category": "computing",
  "updated": "2021-02-04T20:00:11Z",
  "author": "anthony-spadafora",
  "summary": "Financial institutions can now use Visa's platform to expand into crypto",
  "article": [
    "Visa has announced that it has entered into a partnership with the digitally native neobank First Boulevard which will be the first to pilot the financial giant's new suite of crypto APIs.",
    "As part of the agreement between the two companies, First Boulevard's customers will be able to purchase, custody and trade digital assets such as bitcoin held by the federally chartered digital asset bank Anchorage.",
    "The pilot will serve as the first step in supporting API capabilities which will allow other Visa customers to access and integrate crypto features into their products later this year.",
    "Developing Visa's crypto APIs is the next phase of the company's digital currency strategy which is focused on expanding its role as a network-of-networks. During this initial test and learn phase, Visa will explore ways in which financial institutions without their own digital currency infrastructure can use its platform to tap into the growing world of crypto assets and blockchain networks.",
    "Chief product officer at Visa, Jake Forestell provided further insight on the company's entrance into the cryptocurrency market and the progress it has made in the space in a press release, saying:",
    "“We set out to make Visa the bridge between digital currencies and our global network of 70 million merchants and today we are the leading network for crypto wallets with 35 crypto platforms choosing to issue with Visa. With this pilot program, we want to extend the value of Visa to our neobank and financial institution clients by providing an easy bridge to crypto assets and blockchain networks.”",
    "Financial institutions interested in partnering with Visa to allow their customers to purchase and trade digital assets can sign up for the company's waitlist here to pilot these new capabilities once they become available."
  ],
  "headers": {
    "3": "Digital currency strategy"
  },
  "links": {
    "Visa": "https://www.techradar.com/news/visa-snaps-up-payment-giant-plaid-for-dollar53bn",
    "bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "digital currency strategy": "https://www.techradar.com/news/some-visa-credit-cards-will-soon-support-cryptocurrency-transactions",
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "press release": "https://usa.visa.com/about-visa/newsroom/press-releases.releaseId.17721.html",
    "here": "https://usa.visa.com/solutions/crypto.html"
  }
}