{
  "source": "https://www.techradar.com/news/xbox-series-x-is-now-home-to-every-sports-game-thanks-to-xbox-game-pass-ultimate",
  "title": "Xbox Series X is now home to every sports game, thanks to Xbox Game Pass Ultimate",
  "category": "gaming",
  "updated": "2021-04-30T14:16:32Z",
  "author": "adam-vjestica",
  "summary": "If you love sports, Xbox Game Pass Ultimate has you covered",
  "article": [
    "Xbox Series X owners who love their sports games will be delighted to hear that yet another top-tier sports title is on the way to Xbox Game Pass Ultimate.",
    "FIFA 21 joins the service as part of EA Play on May 6 (which is included as part of Xbox Game Pass Ultimate), and now means that Microsoft’s subscription platform is home to every major sports game fans could wish for.",
    "Xbox Game Pass Ultimate already lets users download NBA 2K21, Football Manager 2021, MLB: The Show 21, Madden NFL 2021, NHL 21, UFC 3 and PES 2021. Whether you’re a basketball, baseball, football, soccer, hockey or ultimate fighting fan, then, Xbox Game Pass Ultimate has you well and truly covered.",
    "It’s unclear as to whether FIFA 21 will include the Xbox Series X and Xbox Series S optimized version when it comes to Xbox Game Pass Ultimate and EA Play, as we’ve seen that games like NBA 2K21 have sadly only included the last-gen version. Still, FIFA 21 is extremely popular regardless, and is yet another feather to Microsoft’s premium subscription service which may encourage new users to subscribe.",
    "Xbox Game Pass continues to grow in popularity, with more games releasing on the service on day one. Outriders, Octopath Traveler and MLB: The Show 21 are notable examples, and every first-party title from Microsoft launches day one on Xbox Game Pass, which includes the likes of Halo Infinite.",
    "Xbox Game Pass Ultimate lets you access hundreds of games on Xbox and PC for $15 / £10.99 / AU$15.95, as well as the ability to stream games via the cloud on Android and iOS devices (which is currently being tested). Xbox Game Pass Ultimate also includes EA Play as part of the deal, and gives subscribers various perks and discounts to enjoy."
  ],
  "headers": {
    "4": "Game Pass growth"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "NBA 2K21": "https://www.techradar.com/reviews/nba-2k21",
    "Madden NFL 2021": "https://www.techradar.com/reviews/madden-21",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Outriders": "https://www.techradar.com/reviews/outriders-review",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Android": "https://www.techradar.com/best/best-android-phones"
  }
}