{
  "source": "https://www.techradar.com/news/bitcoin-miners-raked-in-more-than-dollar1-billion-in-revenue-last-month",
  "title": "Bitcoin miners raked in more than $1 billion in revenue last month",
  "category": "components",
  "updated": "2021-02-01T21:46:29Z",
  "author": "anthony-spadafora",
  "summary": "Bitcoin mining revenue is almost back at its 2017 peak",
  "article": [
    "Mining bitcoin is finally profitable again as new data has revealed that miners were able to bring in $1.09bn in revenue last month.",
    "This is significant due to the fact that bitcoin revenue in January reached its highest point since December of 2017 before the cryptocurrency bubble crashed later that month.",
    "At the same time, the revenue for bitcoin miners in January of 2021 also surpassed the level seen during the same time period in 2018 when miners were able to rake in $1.02bn. However, both last month and January 2018 failed to surpass the monthly revenue of $1.25bn for bitcoin miners recorded during December 2017.",
    "Of the over $1bn in revenue made from mining bitcoin last month, $977m came from the network's block subsidies. These block subsidies increased sharply as the cryptocurrency's price jumped above $30k to reach a high of $42k.",
    "Mining bitcoin has also become more expensive recently due to a bidding war for the latest ASIC mining equipment including Bitmain's AntMiner S19 Pro and S19. According to The Block, some customers who preordered the latest ASIC machines due to be delivered last month tried to resell them at premiums of at least 75 percent.",
    "The supply shortage coupled with bitcoin's recent rise lead to miners' daily revenue per each terahash second (TH/s) of computing power increasing to as much as $0.25 which has not been seen since mid-2019.",
    "If you have an unused bitcoin mining rig lying around, now may be the perfect time to fire it up again.",
    "Via The Block"
  ],
  "headers": {
    "3": "Mining bitcoin"
  },
  "links": {
    "bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "ASIC": "https://www.techradar.com/best/asic-devices",
    "S19": "https://www.techradar.com/news/bitcoin-cash-halving-event-could-cause-many-miners-to-give-up",
    "The Block": "https://www.theblockcrypto.com/linked/93215/bitcoin-miners-billion-january-revenue",
    "bitcoin mining rig": "https://www.techradar.com/best/mining-rigs"
  }
}