{
  "source": "https://www.techradar.com/news/apple-continues-legal-battle-with-security-firm-days-after-settling-case",
  "title": "Apple apparently isn't giving up on this legal battle",
  "category": "computing",
  "updated": "2021-08-22T15:43:51Z",
  "author": "mayank-sharma",
  "summary": "Apple won't give up its fight against Corellium",
  "article": [
    "Tech giant Apple has apparently kickstarted a new legal battle with Corellium despite apparently settling with the cybersecurity firm over its original lawsuit.",
    "At the center of Apple's complaint is a virtualized environment created by Correlium that enables security researchers to hunt for bugs, instead of jailbreaking an actual iPhone.",
    "In December 2020 a judge dismissed Apple’s claims that alleged Corellium’s virtualized environment infringed its copyright.",
    "According to Cyberscoop, Apple has now filed an appeal challenging the December dismissal, drawing criticism from security researchers.",
    "Last week, the Washington Post reported that the two companies had reached a settlement as far as Corellium circumventing the Digital Millennium Copyright Act (DMCA) to create its software environment was concerned.",
    "Many thought that it was a sign that Apple was dropping its lawsuit against Corellium. However, Apple has now dispelled these doubts through its notice of appeal for copyright infringement, much to the chagrin of ethical hackers.",
    "“It raises the specter that all sorts of security research activity could be vulnerable to copyright infringement claims. It’s incredibly chilling that Apple is pursuing this,” Blake Reid, a professor at University of Colorado’s law school told Cyberscoop.",
    "Apple’s move comes even as it vowed to work with members of the security establishment to help lend legitimacy to its controversial new child-abuse image scanning function. Interestingly, Corellium has announced a $5000 initiative to probe Apple’s new system.",
    "Via Cyberscoop"
  ],
  "headers": {
    "4": "Apple deal?"
  },
  "links": {
    "Apple": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Corellium": "https://www.techradar.com/news/you-can-now-run-linux-on-apple-m1-devices",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "Washington Post reported": "https://www.washingtonpost.com/technology/2021/08/10/apple-drops-corellium-lawsuit/",
    "work with members of the security establishment": "https://www.wsj.com/articles/apple-executive-defends-tools-to-fight-child-porn-acknowledges-privacy-backlash-11628859600",
    "$5000 initiative": "https://www.corellium.com/blog/open-security-initiative",
    "Cyberscoop": "https://www.cyberscoop.com/apple-corellium-hacking-case/"
  }
}