{
  "source": "https://www.techradar.com/news/you-wont-be-playing-gta-6-any-time-soon-heres-why",
  "title": "Sorry, you probably won’t be playing GTA 6 any time soon",
  "category": "gaming",
  "updated": "2021-06-28T11:59:20Z",
  "author": "vic-hood",
  "summary": "A leaker has shared a load of possible GTA 6 details",
  "article": [
    "It may be even longer than we thought before we get our hands on GTA 6, a leaker has suggested.",
    "Notable leaker Tom Henderson, who is primarily known for his (mostly) accurate leaks on Battlefield and Call of Duty, recently posted a video sharing a bunch of alleged GTA 6 details. In the video, Henderson predicts that GTA 6 isn't going to release until between 2024 and 2025, based on his sources - nearly 12 years after GTA 5 first launched.",
    "There are a few reasons for this, according to Henderson. The biggest is that apparently Rockstar Games has been focusing heavily on \"employee wellbeing\" for the past 15 to 16 months, with the developer aiming to avoid crunch culture. Rockstar reportedly doesn't want to announce the game until it's confident that it will hit its release date, with an aim to avoid any delays, but wants to do so without making employees work extremely long hours to meet a deadline.",
    "In addition, Henderson claims that GTA 6 will only release on PS5, Xbox Series X/S and PC. Given the current PS5 and Xbox Series X shortages, Rockstar Games is apparently waiting until there is a \"big enough market\" for these consoles - in other words, until the majority of players can actually get their hands on them.",
    "The third key reason Henderson gave for this predicted 2024/2025 release date is the popularity of GTA 5, claiming that Rockstar would likely not want to release GTA 6 while its predecessor is still so successful.",
    "The reasons make sense, but it's still disappointing that we may not get our hands on GTA 6 for another four years.",
    "In addition to a release date prediction, Henderson also shared some other alleged details on GTA 6 that he has picked up from his sources.",
    "According to Henderson, GTA 6 will not be set in the 80s or 90s, as previous rumors have suggested. Instead, the new GTA will have a modern setting. This, Henderson claims, is to allow the base game to \"fit\" with GTA Online, with developers wanting \"as much freedom as possible to release as many DLCs as possible\".",
    "Henderson also claims that Vice City will be coming to GTA 6 in some capacity, something that has been rumored for some time, but that the map isn't as big as previous leaks have made it out to be.",
    "In addition, the leaker claims that GTA 6 will take the same approach to GTA 5 and feature \"multiple playable characters\", including one female character who is set to be the \"bright one\", with a focus on technology and hacking.",
    "But it's not just GTA 6 that Henderson shared details on. The leaker claims that GTA Online, accompanying GTA 6's release, will feature an evolving map that could change each time new GTA 6 DLC is released. Henderson compared this map to that of Fortnite's and also claimed that GTA 6's release will see additions made to the \"default\" GTA Online map, including new areas and an expansion to the map.",
    "It's worth noting that Henderson did caveat that he is \"not known for GTA 6 leaks\" and that viewers should take these rumors will a grain of salt, as his sources may be \"less reliable\" than those of his Call of Duty and Battlefield leaks. Henderson did accurately leak several details about Battlefield 2042 before its reveal but, with GTA still in early development, it's likely that even if some of these details are accurate right now, they could change.",
    "We're hoping to hear more about GTA 6 in the near future, but if Henderson's claims are correct, we could be waiting a while yet."
  ],
  "headers": {
    "6": "But that's not all"
  },
  "links": {
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "posted a video": "https://youtu.be/b5kSp88_a2Y",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5 and Xbox Series X shortages,": "https://www.techradar.com/news/ps5-and-xbox-series-x-shortages-could-last-until-the-end-of-2021-says-new-report",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042"
  }
}