{
  "source": "https://www.techradar.com/news/running-windows-apps-such-as-zoom-in-chrome-os-is-getting-a-lot-easier",
  "title": "Running Windows apps such as Zoom in Chrome OS is getting a lot easier",
  "category": "computing",
  "updated": "2021-04-27T15:37:56Z",
  "author": "darren-allan",
  "summary": "Parallels Desktop for Chrome OS now supports the latest Intel and AMD Chrome devices",
  "article": [
    "The new version of Parallels Desktop for Chrome OS (PDC) now allows users to run fully-featured Windows desktop versions of video conferencing apps such as Zoom, Cisco WebEx and GoToMeeting.",
    "Thanks to support for camera and microphone redirection, PDC users can now enjoy key features in apps that aren’t available in web-based versions, such as drawing tools, whiteboard, and always-on control panel in Go to Meeting, in addition to remote-control features in Zoom and Cisco WebEx.",
    "Chromebooks have enjoyed a resurgence in the pandemic with the prevalence of remote-first work environments. However, although newer Chromebook models sport powerful hardware, industry experts have reasoned that they’ll need to run full-fledged desktop operating systems for wide-scale adoption in the enterprise.",
    "“As they become more prevalent in the broader market, Chromebooks will increasingly need to offer the functionality and capabilities embedded in full-featured Windows applications, an ability most simply offered by application and desktop virtualisation,” said Shannon Kalvar, IDC Research Manager.",
    "In addition to support for camera and microphone redirection, the new version of PDC also adds support for AMD Ryzen 5 and Ryzen 7 processors, and can also now run on a dozen new Chromebook and Chromebox devices from Acer, Asus, Dell, HP, and Lenovo.",
    "Furthermore, the new release also offers enterprise and education organizations support for 21 Chrome Enterprise devices, which can now be used to run full-featured Windows apps via PDC.",
    "“With Parallels Desktop for Chrome OS, we make it simple for enterprises and education organizations to securely run fully featured Windows applications on powerful new Chrome Enterprise devices,” said Christa Quarles, CEO of Corel, which owns Parallels.",
    "PDC is available now from £49.99."
  ],
  "headers": {
    "4": "More coverage"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "Cisco WebEx": "https://www.techradar.com/reviews/cisco-webex-meetings",
    "GoToMeeting": "https://www.techradar.com/reviews/gotomeeting",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Acer": "https://www.techradar.com/reviews/pc-mac/pc-mac-desktops/acer-chromebox-cxi-1282998/review",
    "Asus": "https://www.techradar.com/reviews/asus-chromebox-4",
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "HP": "https://www.techradar.com/news/mobile-computing/laptops/what-s-the-best-hp-laptop-904710",
    "Lenovo": "https://www.techradar.com/news/the-best-lenovo-laptops-2018",
    "Windows apps": "https://www.techradar.com/how-to/10-essential-free-windows-10-apps"
  }
}