{
  "source": "https://www.techradar.com/news/this-dolby-atmos-soundbar-is-one-of-the-cheapest-weve-ever-seen",
  "title": "This Dolby Atmos soundbar is one of the cheapest we've ever seen",
  "category": "audio-visual",
  "updated": "2021-06-10T13:13:29Z",
  "author": "rhys-wood",
  "summary": "Monoprice’s new soundbar won’t break the bank",
  "article": [
    "Monoprice has just released its new SB-300 soundbar with virtual Dolby Atmos surround sound. While the soundbar doesn’t offer true Dolby Atmos sound (it’s lacking any surround speakers or upward-firing drivers), you’re getting a virtual version of the immersive audio technology, and it’s been made available at a price point that’s hard to argue with.",
    "The Monoprice SB-300 is available to buy now for $179 (around £129 / AU$229) through the company’s store page, and offers a range of features that could be perfect for first-time soundbar purchasers.",
    "First of all, the Monoprice SB-300 isn’t lacking in connection options. Including two HDMI inputs, an HDMI eARC output, and a 3.5mm audio jack as well as coaxial and digital audio inputs, the soundbar should easily hook up to your TV or AV receiver. Bluetooth and USB connectivity are available, too, if you’re keen to minimize wired connections.",
    "The Monoprice SB-300’s price is actually quite impressive considering what you get. The soundbar’s virtual Dolby Atmos integration features DSP audio modes paired with psychoacoustics, allowing the device to attempt to produce that heightened, vertical sound you’d find in a cinema or home theater.",
    "With these sound features and the aforementioned wealth of connectivity options, the Monoprice SB-300 seems to stack up quite well against its competitors, such as the Sony HT-X8500 and the Samsung HW-Q90R, both of which we considered to be best in class in our reviews. The Monoprice SB-300 is cheaper than both.",
    "While the Monoprice SB-300 does lack the full Dolby Atmos audio experience of Samsung’s HW-Q90R, and the beastly subwoofer of the HT-X8500, we can’t deny that the SB-300 is an appealing option, especially for first-time soundbar buyers turned off by the high price of other models."
  ],
  "headers": {
    "3": "Affordable soundscapes"
  },
  "links": {
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "store page": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5874305292194231000/https://www.monoprice.com/product?p_id=42033",
    "Sony HT-X8500": "https://www.techradar.com/reviews/sony-ht-x8500-soundbar",
    "Samsung HW-Q90R": "https://www.techradar.com/reviews/samsung-hw-q90r-soundbar"
  }
}