{
  "source": "https://www.techradar.com/news/apple-introduces-a-fix-for-macbook-pro-notch-haters",
  "title": "Apple introduces a fix for MacBook Pro notch haters",
  "category": "computing",
  "updated": "2021-10-28T13:55:35Z",
  "author": "darren-allan",
  "summary": "A clunky fix, but it'll do",
  "article": [
    "The new MacBook Pro models with Mini-LED screens have run into further controversy around the notch, with Apple having to introduce what seems to be a quick workaround for apps that run into trouble with said notch.",
    "As spotted by @Jatodaro on Twitter, there are scenarios with some apps where details put in the top bar which runs alongside the notch, can actually end up being placed in the area where the notch is – where there’s no screen (just the webcam) – so these icons or options effectively disappear.",
    "The video embedded in the tweet shows the issue, and as @Jatodaro further elaborates, Apple has a solution – or rather what looks like a hastily applied band-aid. Users suffering at the hands of the notch obscuring details along the top can select the problematic app, choose ‘File’, then ‘Get Info’ and then the option to ‘Scale to fit below built-in camera’ as described in an Apple support document.",
    "This does exactly what it says, namely scales the desktop down so it fits under the notch and top bar, effectively making the top bezel larger – and not just the top bezel, but the side ones too. The whole desktop is scaled down, and this continues to be the case when running the app, even if it’s in the background, with things reverting to normal when the application in question (requiring the scaling) is closed.",
    "With this fix from Apple, then, any issues around the notch obscuring options or content from apps can be side-stepped, but you’re obviously getting chunkier bezels all-round, making the MacBook look distinctly less nifty as a result. It’s not clear why Apple couldn’t plump for a more elegant solution whereby only the top menu bar was clipped off (rather than scaling the entire screen area down).",
    "However, the seemingly clunky nature of this solution may not really matter that much, given that very few apps will actually run into this problem. Apple likely views this as a simple stopgap measure that’ll only need to be employed in some very niche cases, and the firm expects devs to get around to updating affected macOS apps soon to cure any such notch collisions.",
    "As Apple states: “If a developer updates their app for compatibility with your Mac, the ‘Scale to fit below built-in camera’ setting no longer appears. You can contact the developer of the app to learn whether an update is available or planned.”",
    "This seems to be a roundabout way of saying get on these developers’ cases now, because this is something they need to sort out pronto.",
    "Naturally, this won’t help all the confusion and, in some cases, hatred springing up around the notch. As you may have seen earlier this week, some enterprising developers are already making apps specifically designed to hide the notch.",
    "As we’ve observed elsewhere, in a lot of ways all this controversy feels overblown, and the notch certainly didn’t blot the laptop landscape for us in the case of our glowing Apple MacBook Pro 14-inch (2021) review. Some folks, however, just can’t seem to get over the appearance of the notch and the apparent distraction and annoyance its simple presence causes them – and maybe, more to the point, they don’t find Apple’s explanation for why the notch was implemented satisfactorily.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Analysis: No notch, but embiggened bezels"
  },
  "links": {
    "new MacBook Pro models": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "controversy around the notch": "https://www.techradar.com/news/macbook-pro-notch-is-getting-a-lot-of-hate-but-apple-wont-care",
    "Apple support document": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1898354945008079400&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT212842",
    "macOS apps": "https://www.techradar.com/news/software/applications/30-best-mac-apps-for-just-about-everything-712511",
    "hatred": "https://www.techradar.com/news/macbook-pro-notch-is-getting-a-lot-of-hate-but-apple-wont-care",
    "already making apps specifically designed to hide the notch": "https://www.techradar.com/news/cant-stand-the-macbook-notch-theres-an-app-for-that",
    "Apple MacBook Pro 14-inch (2021) review.": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "Apple’s explanation for why the notch was implemented satisfactorily": "https://www.techradar.com/news/apple-exec-defends-macbook-pro-notch-calling-it-smart-and-seamless",
    "The Verge": "https://www.theverge.com/2021/10/28/22750236/apple-macbook-pro-hide-notch-fix-scale-to-fit"
  }
}