{
  "source": "https://www.techradar.com/news/nvidia-geforce-now-service-is-offering-crysis-remastered-for-free-starting-this-week",
  "title": "Nvidia GeForce Now service is offering Crysis Remastered for free starting this week",
  "category": "computing",
  "updated": "2021-11-18T14:00:47Z",
  "author": "allisa-james",
  "summary": "As well as several other games added to the service",
  "article": [
    "Nvidia GeForce Now has been steadily growing for the last year, and now Nvidia is giving Crysis Remastered to both new and old RTX 3080 memberships, as well as six-month Priority members.",
    "If you already have an RTX 3080 tier subscription, you'll receive a free code for the game in the next several days. And those who preordered the service but haven’t been activated will get a code once the membership actually starts.",
    "The Nvidia GeForce Now video game streaming service added a brand new RTX 3080 tier earlier this month and has been adding in some goodies for subscribers. Hopefully this will help Nvidia’s streaming service keep up with the likes of Google Stadia and Xbox Cloud Gaming.",
    "GeForce Now offers quite the selection of PC titles through its service, and continues to add more games each week. This week is no exception, with several new titles joining in:",
    "Last month the service also offered one of the hottest PC games as well, Amazon Games’ exclusive MMO New World. The GeForce Now library of over 1000 supported games is worth the price of admission alone.",
    "But it’s not just the list of supported games that gives this service value. Offering dedicated PC gamers a way to stream games using incredibly powerful GPUs that they don’t have to pay for themselves is a great incentive. Especially considering the inflated prices due to the global scarcity, which makes a RTX 3080 out of reach for most people."
  ],
  "headers": {
    "3": "Analysis: What makes GeForce Now worth it?"
  },
  "links": {
    "Nvidia GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "Priority members": "https://www.techradar.com/news/nvidia-geforce-now-is-limiting-frame-rates-on-some-games-for-priority-members",
    "RTX 3080 tier": "https://www.techradar.com/news/nvidia-geforce-now-rtx-3080-top-tier-membership-is-now-live",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Xbox Cloud Gaming": "https://www.techradar.com/news/xbox-cloud-gaming-is-now-available-for-xbox-insiders-to-test",
    "quite the selection": "https://www.techradar.com/news/cant-buy-a-graphics-card-geforce-now-gets-rtx-3080s-in-for-game-streaming-heres-what-that-means",
    "New World": "https://www.techradar.com/news/new-world-is-still-bricking-nvidia-graphics-cards-with-no-fix-on-the-horizo"
  }
}