{
  "source": "https://www.techradar.com/news/intel-core-i9-11900k-cpu-spotted-overclocked-to-a-massive-7ghz",
  "title": "Intel Core i9-11900K CPU spotted overclocked to a massive 7GHz",
  "category": "computing",
  "updated": "2021-03-28T16:31:55Z",
  "author": "darren-allan",
  "summary": "Rocket Lake is already flying in pre-release overclocks",
  "article": [
    "Intel’s flagship Rocket Lake processor has been spotted with a huge overclock – fueled by exotic cooling, naturally – ahead of the launch of the 11th-gen desktop CPU range in just a couple of days on March 30.",
    "The Core i9-11900K was clocked at over 7GHz, or 7048MHz to be precise, when juiced up with 1.873 volts in an Asus ROG Maximus XIII Apex motherboard, as witnessed on the CPU-Z Validation website (as reported by VideoCardz).",
    "That report also highlights another major overclock featuring the Core i9-11900K separately recorded by PC Wale, an Indian YouTube channel, hitting 6.5GHz with 1.678 volts (with the ROG Maximus XIII Hero motherboard).",
    "Both of these efforts used liquid nitrogen cooling, so obviously don’t represent anything like the kind of overclock that will be possible outside of these kind of scenarios (meaning those using normal liquid or air cooling).",
    "We may well see higher clocks than this reached with fancy cooling using the Core i9-11900K after it’s released.",
    "When the Comet Lake flagship went on sale, the Core i9-10900K (which has 10-cores) was clocked as high as 7.7GHz just after release (with liquid helium cooling), and the 9900K previous to that hit around 7.6GHz when pushed to the max by renowned overclocker Der8auer.",
    "Enthusiast overclockers who are wanting to give their hobby a shot with the 11900K, or other Rocket Lake chips, should bear in mind that Intel has ditched its overclocking insurance going forward – simply because demand has apparently dwindled for the service.",
    "Rocket Lake will have a pretty short reign holding the title of Intel’s cutting-edge processor series, due to the fact that its successor, Alder Lake, will be out later in 2021 – possibly as soon as September."
  ],
  "headers": {
    "5": "Blazing clocks"
  },
  "links": {
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "in just a couple of days on March 30": "https://www.techradar.com/news/intel-finally-confirms-its-new-rocket-lake-s-processors-will-launch-on-march-30",
    "VideoCardz": "https://videocardz.com/newz/intel-core-i9-11900k-overclocked-to-7ghz-at-1-83v",
    "Comet Lake": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "demand has apparently dwindled for the service": "https://www.techradar.com/news/intel-scraps-insurance-plans-for-cpu-overclockers-and-the-reason-might-surprise-you",
    "possibly as soon as September": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september"
  }
}