{
  "source": "https://www.techradar.com/news/evernote-home-wants-to-help-you-organize-all-your-content-in-one-place",
  "title": "Evernote Home wants to help you organize all your content in one place",
  "category": "computing",
  "updated": "2021-01-21T20:01:43Z",
  "author": "anthony-spadafora",
  "summary": "A one-stop dashboard for all your most relevant content",
  "article": [
    "Evernote is making it easier for users to see and manage their content in its productivity app with the rollout of a new one-stop dashboard called Home.",
    "Evernote Home gives users access to their most relevant content including important notes, tags and shortcuts which are now instantly available and neatly organized upon opening the app. However, the new feature also gives users the freedom to organize their content however they want so that they can work faster and stay focused without feeling overwhelmed.",
    "In a press release, the company's CEO Ian Small explained that Home is just the first of many new features that will be coming to the new Evernote, saying:",
    "“When we began rolling out the new Evernote in September we promised that it was just the start of the journey and that we were laying the groundwork for new features and faster innovation in the future, the first of which is Home. Over time we’ll be making these widgets more powerful, more flexible and more helpful, adapting them to the wide variety of uses users rely on to manage their busy lives. We’ll also be introducing additional widgets that reach deeper into Evernote and explore new capabilities, making Home the perfect place to start the day.”",
    "When opening Home for the first time, Evernote Basic and Premium users will have access to three default widgets in the form of Notes, Scratch Pad and Recently captured.",
    "While Notes allows users to access their “Recent” notes so they can quickly pick up where they left off, they can also choose “Suggested” notes to let Evernote's AI surface the content they need. Scratch Pad on the other hand can be used to quickly jot down notes right from Evernote Home. The Recently captured widget shows users all of the content they've saved recently such as web clips, images, documents, audio and emails.",
    "Evernote Premium and Business users will also have access to widgets for Notebooks, Pinned Note, Tags and Shortcuts. They can also customize their home background image to fit their personal style.",
    "Evernote Home is rolling out to Mac, Windows and Evernote Web customers over the next few weeks and the new feature will also be coming to iOS and Android later in the year."
  ],
  "headers": {
    "4": "Evernote Home"
  },
  "links": {
    "productivity app": "https://www.techradar.com/best/best-productivity-apps",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know"
  }
}