{
  "source": "https://www.techradar.com/news/why-dragon-age-4-wasnt-at-ea-play-live-2021",
  "title": "Why Dragon Age 4 wasn't at EA Play Live 2021",
  "category": "gaming",
  "updated": "2021-07-23T11:19:14Z",
  "author": "vic-hood",
  "summary": "Dragon Age is reportedly on track to release in 2023",
  "article": [
    "Dragon Age 4 may not have made an appearance at EA Play Live 2021, but a new report may have shed light on why - and when we'll get our hands on BioWare's highly-anticipated fantasy RPG.",
    "According to a report by GamesBeat's Jeff Grubb, sources familiar with Dragon Age 4's development told the publication that the new Dragon Age is on track for release in 2023. EA declined to comment on the report.",
    "The report also claims that EA held back from providing a Dragon Age 4 at EA Play Live 2021, to enable it to \"get the game into position to begin marketing in earnest\".",
    "In addition, the report corroborates Bloomberg's report from earlier this year that BioWare has decided to drop plans for a Dragon Age 4 live-service model, instead opting to build the new Dragon Age as a single-player experience, like its predecessors. However, the report does additionally suggest that Dragon Age 4 will have an online multiplayer element, similar to Dragon Age: Inquisition.",
    "A 2023 release window for Dragon Age 4 does line up with EA's previous comments. During an earnings call in 2019 (via Eurogamer), EA's chief financial officer Blake Jorgensen stated that Dragon Age 4 \"probably comes after fiscal '22\", meaning the earliest we could see the new Dragon Age is April 2022 - when the next fiscal year begins.",
    "It's actually welcome news that Dragon Age 4 could be on track for a 2023 release - even if it seems a long time away. Given the development issues caused by the Covid-19 pandemic, a multitude of games have been delayed in the past year, while PS5 and Xbox Series X consoles have been difficult to get hold of.",
    "But, by the time of Dragon Age's release, those issues should have settled down, hopefully meaning Dragon Age 4 won't suffer delays - though that's not a cert right now - and that more players will have been able to get their hands on the new consoles (which EA could exclusively, alongside PC, choose to target).",
    "If we are expecting Dragon Age 4 in 2023 then marketing will likely begin to ramp up from early 2022, offering further details on what we can expect from the next Dragon Age installment - and how it will utilize the power of the latest console hardware. So, while Dragon Age 4 wasn't at EA Play Live 2021, we expect a chunky update at EA Play Live 2022.",
    "It's worth noting that neither EA nor BioWare has confirmed a release date for Dragon Age 4, so this release window could still slip."
  ],
  "headers": {
    "4": "Analysis: a long but usurprising wait"
  },
  "links": {
    "Dragon Age 4": "https://www.techradar.com/news/dragon-age-4-release-date-news-and-rumors",
    "EA Play Live 2021": "https://www.techradar.com/news/ea-play-games-list-here-are-all-the-ea-play-2021-game-trailers",
    "GamesBeat": "https://venturebeat.com/2021/07/22/dragon-age-4-is-on-track-for-a-potential-2023-release/",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-02-25/electronic-arts-pivots-on-dragon-age-game-removes-multiplayer?sref=HrWXCALa",
    "drop plans for a Dragon Age 4 live-service model": "https://www.techradar.com/news/dragon-age-4-is-going-to-be-a-solo-experience-after-eas-change-of-heart",
    "Eurogamer": "https://www.eurogamer.net/articles/2019-10-30-looks-like-dragon-age-4-could-be-released-sometime-late-2022",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}