{
  "source": "https://www.techradar.com/news/pokemon-go-developers-new-ar-pikmin-bloom-game-has-arrived",
  "title": "Pokemon Go developer’s new AR Pikmin Bloom game has arrived",
  "category": "gaming",
  "updated": "2021-10-27T03:15:05Z",
  "author": "harry-domanski",
  "summary": "Niantic’s latest mobile title arrives in Australia ahead of global rollout",
  "article": [
    "Earlier in the year we learned that Niantic, the creators of smash-hit mobile AR game Pokemon Go, were working with Nintendo again on a similar title in the Pikmin universe.",
    "Pikmin Bloom launched today in Australia and Singapore on the series' 20th anniversary and will be rolling out to other regions around the globe in \"the next few days\", according to a tweet from the company.",
    "As with Pokemon Go, the new Pikmin Bloom title features gameplay that encourages and heavily relies on the player walking and exploring their real world surroundings – a reality that is much more possible as global vaccine rollouts reinstate freedoms in a Covid world.",
    "Although somewhat light on gameplay, the launch video shows a Nintendo Mii-esque avatar walking through a virtual rendition of streets while the titular Pikmin plant flowers as you rack up your steps in the real world.",
    "As Niantic states, the game is intended to \"inspire people to go outside, explore their neighborhoods, and have fun at the same time\", all the while encouraging the obvious benefits of walking for your physical and mental health.",
    "Check out Apple's App Store or the Google Play Store to see if Pikmin Bloom has landed for you and, if it hasn't, rest assured it should be arriving in the near future.",
    "For those that sighed when they learned another AR mobile game in the same vein as Pokemon Go had been released, it's alright – you don't have to play it. But do the cynics have a point? Do we need another reason for people to bury their face in smartphones as they walk the streets?",
    "While the case against increasing smartphone usage for the sake of physical and mental health is certainly a strong one, some studies conducted on the effects of Pokemon Go specifically have found the opposite to be true for this app.",
    "One such research paper found that users were, on average, taking around 2,000 more steps per day, while another discovered an overall reduction (albeit minor) in psychological distress for players of the game.",
    "Corporate success and addictive qualities aside, if we're going to be presented with smartphone games that truly entrance us, the mental and physical health benefits of those that get us out and about surely should hold preference over those that don't encourage physical and social interaction whatsoever."
  ],
  "headers": {
    "6": "Do we need another Pokemon Go?"
  },
  "links": {
    "Pokemon Go": "https://www.techradar.com/news/pokemon-go-developer-teases-what-the-future-holds-for-the-popular-mobile-game",
    "working with Nintendo again on a similar title in the Pikmin universe": "https://www.techradar.com/news/pokemon-go-developers-new-pikmin-app-wants-you-take-a-hike",
    "tweet": "https://twitter.com/NianticLabs/status/1453151870042591238",
    "research paper": "https://www.ahajournals.org/doi/10.1161/jaha.116.005341",
    "another": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7195715086346248000&xs=1&url=https%3A%2F%2Fwww.nature.com%2Farticles%2Fs41598-017-11176-2&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fpokemon-go-developers-new-ar-pikmin-bloom-game-has-arrived"
  }
}