{
  "source": "https://www.techradar.com/news/tour-de-france-2021-heres-the-technology-thats-making-this-years-race-the-most-interactive-yet",
  "title": "Tour de France 2021: Here's the technology making this year's race the most interactive yet",
  "category": "computing",
  "updated": "2021-06-26T09:36:06Z",
  "author": "mike-moore",
  "summary": "'Digital twin' of Tour de France route gives fans more data when they need it",
  "article": [
    "With the Tour de France 2021 set to roll out this weekend, this year's race looks set to be the most interactive ever thanks to a host of new experiences and services designed to help fans get (virtually) closer to the action.",
    "This weekend sees the 108th edition of the world's biggest cycling event start in Brittany, in the north-west of France, with 184 riders travelling 3300km over the course of the next three weeks.",
    "After a year in which fans have been starved of in-person action, and with an expected global television audience numbering in the hundreds of millions, this year's Tour is looking to utilize big data like never before to offer fans a whole new view of the race.",
    "NTT, the official technology partner to race organizers Amaury Sport Organisation (ASO) since 2015, will once again look to offer broadcasters, digital channels and fans a wealth of real-time data on the race.",
    "Using small sensors mounted beneath the saddle (pictured below), NTT is able to provide real-time data on speed and GPS location of each rider in the race every 400 milliseconds.",
    "This data is transmitted using a moving mesh-network through gateways on the television motorbikes, helicopters and aircraft, where it is multiplexed with the broadcast video and transmitted to NTT's own \"Big Data Truck\".",
    "Here, the data is augmented on the NTT cloud platform with 53 calculated attributes such as course gradient, weather data, group calculations, and time gaps in order to offer fans and broadcasters alike the key information they need to stay up to date with the race.",
    "To supplement this, NTT has revealed that in 2021 it is creating a ‘digital twin’ of the race using IoT sensors, edge compute and networks alongside its own platforms and mapped against a geo-location model of each stage of the Tour. This will enable real-time visibility of key locations and assets, COVID-19 contact tracing and in-the-moment updates of caravan and race arrival times.",
    "The company notes that the race is effectively the world’s largest connected stadium, albeit one that moves around France every day for three weeks, including savage mountain terrain in the Alps and the Pyrenees. It says creating a digital twin will offer detailed visualizations of the race as it happens, as well as improving digital experiences such as the ASO's live Race Center tracker system for fans.",
    "\"Every year we have been able to take the technology to the next level, this year we are creating what is essentially a digital twin of the event,\" notes Peter Gray, Senior Vice President, Advanced Technology Group, Sport at NTT Ltd. \"It’s a highly dynamic and changing environment that requires immediate access to information to ensure continuous and smooth operations, resulting in more informed and engaged fans.”",
    "“Technology plays a vital part in helping us innovate at the speed fans expect from their mobile and cloud-based applications, all the while providing event insights, rich analytics and intelligent digital solutions,\" added Yann Le Moenner, Chief Executive, ASO.",
    "\"Since 2015, we’ve brought a whole host of digital enhancements to the event to create the best ‘connected fan’ experience. This year is no different, delivering a data-driven experience across any device, wherever you are in the world.”"
  ],
  "headers": {
    "3": "Real-time data",
    "7": "Digital twin"
  },
  "links": {
    "Tour de France 2021": "https://www.techradar.com/news/tour-de-france-2021-live-stream-how-to-watch-every-stage-free-from-anywhere",
    "race organizers Amaury Sport Organisation": "https://www.techradar.com/news/tour-de-france-2020-how-ntt-is-helping-solve-the-biggest-challenges-ever"
  }
}