{
  "source": "https://www.techradar.com/news/how-to-watch-dollface-online-stream-the-hit-show-with-star-on-disney-plus-today",
  "title": "How to watch Dollface online: stream the hit show with Star on Disney Plus today",
  "category": "computing",
  "updated": "2021-03-05T09:53:34Z",
  "author": "kevin-lynch",
  "summary": "Comedy series gets global debut with Star on Disney Plus",
  "article": [
    "Already a hit in the US and Canada when it was released back in 2019 on Hulu and Crave, global audiences at last get the chance to watch female friendship comedy Dollface now it's been released worldwide on the new Star on Disney Plus channel. Follow our guide as we explain how to watch Dollface online and stream the comedy show on Star via Disney Plus from just £7.99/AU$11.99 a month.",
    "The show follows web designer Jules as she metaphorically re-enters the world of women, rekindling the female friendships she left behind. With Jules prone to regular bouts of daydreaming, Dollface is regularly interspersed with off-the-wall CGI sequences as she drifts away from focusing on her problems.",
    "The show sees Amphibia’s Brenda Song play Jules' lapsed friend Madison with “Prety Little Liars” Shay Mitchell playing her pal Stell.",
    "Created by Jordan Weiss and executive-produced by Margot Robbie and her husband, Tom Ackerley, the show has already been green lit for a second season on its original network, Hulu in the US, and offers some more recent programming to the largely retro offering of Disney Plus' new Star service.",
    "Follow our guide below as we explain how to watch Dollface online and stream season 1 of the comedy show via a great value Disney Plus subscription right now! With a second season ordered and due out on Hulu later this year, now's the time to catch up!",
    "Disney Plus is already a fair deal cheaper than competing streaming services like Netflix but you can save even more when you sign up for an annual subscription which gives you 15% off the monthly price. Obviously you have to splash the cash at the start, but with so much content to get stuck in to we very much doubt you'll run out of things to watch before the 12 months are up. You're looking at $69.99/£79.90/AU$119.99 for the year.",
    "Or if your interests are farther reaching (and you're in the US), then we'd seriously suggest looking at the fantastic value bundle package. It adds Hulu and ESPN+ to your subscription price. The Hulu element opens up a world of Hulu Originals such as The Great, Upload, Helstrom and Normal People. While ESPN+ brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $12.99 a month.",
    "Disney Plus is showing no signs of slowing down since the service first launched last November. Dollface is just the latest in a string of recent releases exclusive to the platform, including Soul, The Mandalorian, Mulan, Hamilton, and much more.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "In addition, now that Disney has set the precedent of releasing movies like its live-action Mulan remake on the service instead of in theaters through its Premiere Access program, expect the company to keep bring more blockbuster films that were originally intended to be shown on the big screen to Disney Plus in 2021.",
    "The already vast amount of content available on Disney Plus has just doubled in many regions, thanks to its new Star on Disney Plus channel, which will bring much of the content the House of Mouse now owns through its Fox acquisition to the service.",
    "This means the platform will finally offer a more healthy amount of grown-up shows and movies, with Family Guy, Solar Opposites, Love, Victor, Big Sky and Helstrom among the content that's going to be available on Disney Plus Star.",
    "Read more:"
  ],
  "headers": {
    "5": "How to save money on Disney+",
    "7": "What else should I know about Disney+?"
  },
  "links": {
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained",
    "Disney Plus from just £7.99/AU$11.99": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1808776923102626800&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "Disney Plus subscription": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1093019788377704800&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "$69.99/£79.90/AU$119.99 for the year": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-5074409455025024000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN+": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $12.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1300138496978755000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Premiere Access program": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-9129036212573665000&sharedId=trd-us&u=https%3A%2F%2Fhelp.disneyplus.com%2Fcsp%3Fid%3Dcsp_article_content%26sys_kb_id%3Db0e20693db921c50b1e6c28d1396191a"
  }
}