{
  "source": "https://www.techradar.com/news/cyberpunk-2077s-next-major-update-has-been-detailed-by-cd-projekt-red",
  "title": "Cyberpunk 2077’s next major patch has been detailed by CD Projekt Red",
  "category": "gaming",
  "updated": "2021-12-02T11:27:25Z",
  "author": "emma-boyle",
  "summary": "But no release date yet",
  "article": [
    "CD Projekt Red has detailed some of the changes and improvements that players should expect from Cyberpunk 2077’s second major update: Patch 1.2.",
    "After being forced to delay Patch 1.2 following a cyber attack in February 2021, developer CD Projekt Red has posted a development update to the official Cyberpunk site. Framed as a news report from Night City’s N54 News, the post covers three major areas for improvement: police response, vehicle control and key binding.",
    "When Patch 1.2 releases, players will find that Night City’s police department won’t appear on the scene quite as quickly when a crime is committed. According to CD Projekt Red, law enforcement now won’t spawn behind players’ backs which will “create an impression that it takes some time for police to arrive at the crime scene after the crime has been reported”. A new drone unit has also been added to the game “to create the feeling of the police assessing the situation.”",
    "As far as driving is concerned, players should see an improvement in control and fluidity. After receiving feedback on issues with steering, particularly “from players using keyboards on PC or were on platforms with lower frame rates”, CD Projekt Red found that “when experiencing lower frame rates, our cars were harder to control.”",
    "As a result, the developer has added a Steering Sensitivity Slider allowing “the steering speed for all vehicles and all input devices to be slowed down, without affecting the maximum turn radius.” Steering speed will also be “consistent from 20 to over 60 FPS” and individual cars have been tweaked to improve performance in low frame rates.",
    "To solve the issue of cars getting randomly stuck on environmental objects in Night City, an “Unstuck feature” will also be added. With this, players will be able to hold down the accelerator and rock their vehicle forward and back as well as rotate it left and right to get free.",
    "Last but not least, the post reveals that players will gain more control over keyboard bindings. Specifically referencing dodging, the post admits that dodging by double-tapping a movement key isn't always ideal so it'll be possible to turn this off. Players will still be able to dodge by double-tapping the Crouch action key and overall “It should now be more feasible to move WASD bindings around the keyboard.\" Remaining problems with bindings \"should be fixed in upcoming patches.”",
    "At the moment, Patch 1. 2 still doesn’t have a release date and there’s no word on how big the update is going to be in terms of download size. When its release was initially delayed from February, CD Projekt Red said that it was aiming for the “second half of March” so it’s very likely we won't have to wait too much longer to see it implemented.",
    "Based on CD Projekt Red’s roadmap shown earlier this year, after the release of Patch 1.2 the next stage for Cyberpunk 2077 involves the release of free DLC, followed by a free update to enhance the game on Xbox Series X/S and PS5. Though there aren’t any dates for these releases just yet, the roadmap shows that the intention is to have them available to players by the end of 2021."
  ],
  "headers": {
    "7": "What's next?"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "forced to delay Patch 1.2": "https://www.techradar.com/news/cyberpunk-2077-patch-12-delayed-with-cd-projekt-red-cyber-attack-to-blame",
    "development update": "https://www.cyberpunk.net/en/news/37768/whats-new-in-night-city-patch-1-2-development-insight",
    "shown earlier this year": "https://youtu.be/O3V4UBZmC9o?t=244",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}