{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-lite-could-be-among-devices-announced-on-august-11",
  "title": "Samsung Galaxy Z Flip 3 Lite could be among devices announced on August 11",
  "category": "phones",
  "updated": "2021-07-06T08:50:23Z",
  "author": "james-rogerson",
  "summary": "Don't count on it",
  "article": [
    "August 11 looks to be a big day for Samsung, as rumors suggest it's when we’ll see the Samsung Galaxy Z Fold 3, Samsung Galaxy Watch 4, and Samsung Galaxy Z Flip 3, and potentially other devices. But yet another phone is now rumored to be in the mix, namely the Samsung Galaxy Z Flip 3 Lite.",
    "That’s according to The Korea Herald, citing industry sources, and if true it could help make foldable phones a lot more affordable. The Galaxy Z Flip range is already cheaper than the Galaxy Z Fold range, and a Lite model would be cheaper still, though an exact price hasn’t been put forward here.",
    "It’s worth noting however that this claim should be taken with a serious helping of salt, as while there have been occasional rumors of a Samsung Galaxy Z Flip 3 Lite, it’s not something we’ve heard much about, and recently Ross Young (a leaker with a good track record) claimed that the Galaxy Z Flip 3 Lite had been canceled due to the ongoing chipset shortage.",
    "Still, even if we don’t get a Galaxy Z Flip 3 Lite, the Samsung Galaxy Z Flip 3 itself could be cheaper than its predecessor. Several leaks have pointed in this direction, including a recent one from leaker @FrontTron, who claimed that the Samsung Galaxy Z Flip 3 5G will cost $1,249 (around £900 / AU$1,650) for a model with 8GB of RAM and 256GB of storage.",
    "For reference, the original Galaxy Z Flip sold for $1,380 / £1,300 / AU$1,800, so this would be a significant reduction if true.",
    "We should find out soon, because all signs point to Samsung announcing its upcoming devices in August – originally we thought August 3, but both The Korea Times and another recent report now point to August 11.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "Lower prices are likely"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "The Korea Herald": "http://www.koreaherald.com/view.php?ud=20210705000817",
    "claimed that the Galaxy Z Flip 3 Lite had been canceled": "https://twitter.com/DSCCRoss/status/1409347256533368834",
    "@FrontTron": "https://twitter.com/FrontTron/status/1411673678593417218",
    "Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "we thought August 3": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
    "another recent report": "https://www.techradar.com/news/samsung-may-launch-the-z-fold-3-z-flip-3-galaxy-watch-and-more-on-august-11",
    "Phone Arena": "https://www.phonearena.com/news/samsung-z-flip-3-lite-cheap-foldable-phone-unpacked-event_id133348"
  }
}