{
  "source": "https://www.techradar.com/news/nvidia-could-sacrifice-this-popular-gpu-to-make-more-rtx-3000-cards",
  "title": "Nvidia could sacrifice this popular GPU to make more RTX 3000 cards",
  "category": "computing",
  "updated": "2021-06-14T10:08:44Z",
  "author": "darren-allan",
  "summary": "RTX 2060 to become thinner on the ground to boost Ampere production?",
  "article": [
    "Nvidia is set to increase production levels of its Ampere graphics cards, according to a fresh rumor, with that capacity being opened up by making fewer numbers of a previous-gen – but still popular – Turing GPU.",
    "IT Home, a Chinese tech site, has apparently obtained info from inside sources over in Asia (as spotted by Wccftech) that claims Nvidia is set to notch down RTX 2060 production in order to make breathing room to manufacture more RTX 3000 GPUs.",
    "Indeed, according to the report, those older graphics cards will have their shipping numbers cut in half in order to afford better availability for Ampere models.",
    "As you might recall, Nvidia previously rekindled RTX 2060 GPUs back at the start of 2021, shortly after their discontinuation, bringing in these graphics cards as a kind of damage control for stock shortages – given that this is a relatively cheap card to make and offer as a solid model for the mainstream. Plus as Wccftech notes, this also occurred possibly to help deal with crypto demand.",
    "In the latter case, this rumored reversal of the situation would make sense now that Nvidia has dedicated (CMP) crypto-mining GPUs to cope with the pressure on that front.",
    "Whatever’s going on behind the scenes isn’t clear, naturally, and we shouldn’t get carried away with the theorizing – although we can obviously keep our fingers crossed that more RTX 3000 stock is on the way.",
    "Even if that’s true, how much difference this move would make is another arguable point, because no one is expecting the GPU shortage to go away any time soon; we can only hope for some element of mitigation at best in the short-term, realistically. After all, Nvidia itself has admitted that stock of its graphics cards is likely to continue to come up short of demand for the rest of 2021."
  ],
  "headers": {
    "3": "Rekindled GPU"
  },
  "links": {
    "Ampere graphics cards": "https://www.techradar.com/news/nvidia-ampere",
    "but still popular": "https://www.techradar.com/news/nvidia-geforce-gtx-1650-rtx-2060-and-rtx-3080-are-dominating-their-respective-gpu-generations",
    "IT Home": "https://www.ithome.com/0/556/188.htm",
    "Wccftech": "https://wccftech.com/nvidia-to-cut-rtx-2060-supply-this-month-will-increase-production-capacity-of-geforce-rtx-30-series-gpus/",
    "RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "RTX 3000 GPUs": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "Nvidia previously rekindled RTX 2060 GPUs": "https://www.techradar.com/news/nvidia-to-fix-rtx-3000-gpu-stock-issues-by-launchingthe-geforce-rtx-2060",
    "shortly after their discontinuation": "https://www.techradar.com/news/nvidia-rtx-2060-and-2060-super-have-reportedly-been-discontinued-despite-rtx-3000-stock-issues",
    "CMP": "https://www.techradar.com/news/gigabyte-cmp-30hx-officially-announced-but-price-and-release-date-still-a-mystery",
    "Nvidia itself has admitted": "https://www.techradar.com/news/even-nvidia-doesnt-think-youll-get-an-rtx-3080-this-year"
  }
}