{
  "source": "https://www.techradar.com/news/8k-tvs-have-basically-tripled-in-number-this-year",
  "title": "8K TVs have basically tripled in number this year",
  "category": "televisions",
  "updated": "2021-07-26T15:03:20Z",
  "author": "henry-st-leger",
  "summary": "8K TVs are proliferating like never before",
  "article": [
    "8K TVs are having a moment, it seems. The 8K Association – a body dedicated to the promotion and standardisation of 8K resolution screens – has now certified over seventy 8K TVs, with the vast majority of them having been launched only this year.",
    "With 50 of those screens having released \"in the first half of 2021\", it's clear that production has ramped up on different 8K models, with TV makers keen to stoke and capitalize on any emerging interest in the Ultra HD resolution.",
    "The 8K Association puts most of that growth down to Hisense, Samsung and TCL – three of the largest TV manufacturers working today – though with both Sony and LG also putting out the odd 8K screen, it's clear that none of the major players are keen to be left out of the action.",
    "From Samsung's QN900A flagship to the Hisense U80G ULED, there are more 8K screens available than ever – and a common certification between them should only inspire confidence among consumers, even if it's not the only thing you need to keep in mind when buying an 8K TV.",
    "The 8K Association's certification isn't the be-all and end-all, of course – you could certainly have an 8K TV without it. But the purpose of the certification is to ensure a minimum level of quality and hardware specification for every 8K TV purchase, so that consumers are never caught unawares with an underperforming model.",
    "This standardization is important, if just for setting expectations. Some 8K TVs will be better than others, but there should be firm benchmarks in place to make sure 8K looks like 8K, and anyone paying through the nose for a high-end 8K screen isn't disappointed.",
    "As a relatively nascent technology, 8K screens are still pretty pricey, and manufacturers are betting big on people's willingness to be early adopters and pay big for the next big thing before it becomes commonplace.",
    "Prices are dropping, but slowly, and we're nowhere near the level of market saturation needed to see truly affordable prices. We had hoped that the new TCL 6-Series 8K model would make for the USA's first budget 8K screen, but its starting price of $2,199 (around £1,600 / AU$3,000) shows that even an affordable manufacturer isn't able to drastically undercut the competition just yet."
  ],
  "headers": {
    "4": "Analysis: Early days in the age of 8K"
  },
  "links": {
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "8K Association": "https://8kassociation.com/seventy-plus-8k-tvs-now-certified-by-the-8k-association/",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Ultra HD": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "QN900A": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "Hisense U80G": "https://www.techradar.com/reviews/hisense-u80g-uled-8k-tv",
    "TCL 6-Series 8K": "https://www.techradar.com/reviews/tcl-6-series-2021-8k-qled-tv-review"
  }
}