{
  "source": "https://www.techradar.com/news/amd-radeon-rx-6500-with-navi-23-could-arrive-in-april-to-take-on-nvidia-rtx-3060",
  "title": "AMD Radeon RX 6500 with Navi 23 could arrive in April to take on Nvidia RTX 3060",
  "category": "computing",
  "updated": "2021-03-19T10:08:37.801Z",
  "author": "jess-weatherbed",
  "summary": "But will that solve AMD's stock shortage?",
  "article": [
    "AMD has only just released its Radeon RX 6700 XT graphics card, but that hasn't stopped fresh rumors appearing for the currently unreleased RX 6500 series, projected to use AMD's Navi 23 architecture. The leaked GPU is listed as 'Dimgrey Cavefish', which is the internal codename used by AMD for the Navi 23 we heard circulating last year. This will be the third addition to the Navi family and the smallest of the lineup, with a die size reported to be around 236mm2.",
    "The details on this have come from a reputable leaker @KittyYYuko, previously known as KittyCorgi. The information that has historically been leaked onto Twitter from this individual has been incredibly accurate to date, but as with all speculated information that doesn't come from the original source, we shouldn't take any of this as gospel. Given its small size compared to the rest of the Navi family, Navi 23 is anticipated to provide a premium 1080p experience. This sounds about right considering the Navi 21 (or 'Big Navi') seen in graphics cards like the Radeon RX 6800, RX 6800 XT and RX 6900 XT is marketed for 4K and the recent Navi 22 GPU targets the 1440p market with the Radeon RX 6700 line. The price for the alleged RX 6500 XT is listed on the Twitter post as 2499 CNY which ends up around $350 / £250 / AU$450, placing it in direct competition with Nvidia's GeForce RTX 3060.",
    "A new entry-level GPU should be a welcome update given how expensive the top line offerings currently are from both AMD and Nvidia, but due to bots and cryptominers its unlikely that many of us will be able to purchase these graphics cards at what should be an affordable price",
    "AMD has certainly shot up in popularity given its success with the CPU market, but Nvidia still dominates the GPU market. With GeForce cards being scalped for similarly high prices, the inclusion of DLSS and better ray tracing performance makes them a more attractive offering to gamers, though getting your hands on any GPU is near impossible right now – let alone a preferred model. The price is far from officially confirmed, but at around $350 it's higher than expected for a 1080p GPU going against the RTX 3060. We would hope that when more official information is released by AMD that the anticipated RX 6500 series will hit the shelves for a lower price tag, or else toppling Nvidia's crown will prove difficult.",
    "Via WCCFTEch"
  ],
  "headers": {
    "1": "Big Navi, Little Navi",
    "2": "Team Red vs Team Green"
  },
  "links": {
    "Radeon RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "@KittyYYuko": "https://twitter.com/KittyYYuko/status/1372609049942913025",
    "Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "RX 6900 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6900-xt-find-stock-here",
    "Radeon RX 6700": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "Nvidia's GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "WCCFTEch": "https://wccftech.com/amd-radeon-rx-6500-series-gpus-navi-23-detailed-up-to-2048-cores-8-gb-memory-tackle-nvidia-rtx-3060/"
  }
}