{
  "source": "https://www.techradar.com/news/microsoft-brings-autofill-password-manager-to-ios",
  "title": "Microsoft brings Autofill password manager to iOS",
  "category": "computing",
  "updated": "2021-02-08T11:52:11Z",
  "author": "barclay-ballard",
  "summary": "The Autofill tool will be included in Microsoft Authenticator",
  "article": [
    "Microsoft has officially launched its password manager Autofill solution, making it available through the Microsoft Authenticator app.",
    "Although the tool was already available as part of Microsoft’s beta program, it will now be accessible to anyone with a Microsoft account, whether they use Windows PCs, Macs, Android, or iOS devices.",
    "For Apple fans, Microsoft Authenticator is available for download from the App Store for anyone with a device running iOS 11 or later. A Google Chrome extension has also been launched, while the Autofill feature will be included as standard for Edge users with a Microsoft account.",
    "“Autofill stores your passwords under your Microsoft account,” Vishnu Nath, Partner Director of Program Management for Microsoft mobile apps and experiences, said. “To get started with autofill on mobile, open the Microsoft Authenticator app, and then sign-in on the Passwords tab with your Microsoft account. If you have passwords saved under your Microsoft account on Microsoft Edge, they will sync to the Authenticator app.”",
    "Password management has become an increasingly important issue as the number of passwords that users need to remember has gone up and up. This leads to many individuals getting “password fatigue” and using easy to guess credentials or simply reusing passwords across multiple accounts. This leaves them at greater risk of data breaches or brute force attacks.",
    "Although other forms of authentication are being trialed, such as biometric credentials, passwords remain the most common form of online identification. As such, password management tools like the Microsoft Authenticator app are becoming increasingly popular.",
    "The fact that the Autofill feature is now available for Microsoft Authenticator across multiple operating systems reflects the fact that many individuals use a variety of digital devices. Also, if they have previously used another password manager, they can import their credentials into Microsoft Autofill using a CSV file.",
    "Via 9to5Mac"
  ],
  "headers": {
    "4": "Avoiding password fatigue"
  },
  "links": {
    "password manager": "https://www.techradar.com/best/password-manager",
    "iOS": "https://www.techradar.com/news/ios-15-update",
    "9to5Mac": "https://9to5mac.com/2021/02/05/microsoft-officially-launches-autofill-password-manager-for-ios-and-other-platforms/amp/"
  }
}