{
  "source": "https://www.techradar.com/news/heres-why-a-new-realme-phone-has-that-surprising-design-choice",
  "title": "Here's why a new Realme phone has a surprising design choice",
  "category": "phones",
  "updated": "2021-08-18T14:23:05Z",
  "author": "tom-bedford",
  "summary": "A curved-edge display on a Realme phone",
  "article": [
    "Chinese tech company Realme has just launched two brand-new phones, the GT Master Edition and GT Explorer Master Edition. These two handsets straddle the existing Realme GT, one of our favorite Android phones you can buy right now.",
    "Fans of Realme phones might have noticed something interesting about one of the new phones, the mid-range Explorer Master Edition. It has one particular design feature that barely any devices from the brand have used up until this point.",
    "No, we're not talking about the curious suitcase-style ribbed rear that certain types of the new phones use, though that's certainly a novel design feature. We're in fact talking about how the phone has a screen that curves at the edge.",
    "Curved-edge screens are commonplace for premium phones, but with Realme generally making budget and mid-range devices, it rarely uses the design feature. In fact, the company hasn't launched a single angled-screen phone in Europe, and the Explorer Master Edition will be the first if it launches there.",
    "During an interview with Realme CEO Madhav Sheth - we've already reported on another comment made, about how the Realme GT line is replacing the X series, and we've got more stories to come from the discussion - the topic of these new phones, and the thinking behind them, came up.",
    "While the Realme GT series seemed like a bolt from the blue from a consumer perspective, it turns out Realme was planning the series for a while - we asked if the Master and Explorer devices were in the pipeline before the original came out, or if the GT's success prompted some spin-offs. Sheth told us:",
    "\"It was planned - definitely it was planned. We wanted to expand the GT series; we didn't want to stick to the triple-8 version [referring the the Snapdragon 888 chipset used in the original Realme GT], we wanted to bring some more chipsets into this series as well\".",
    "If it wasn't clear from that quote, Sheth emphasized \"GT is about the performance\". One of our favorite aspects of the premier phone was its top-end chipset, which was surprising given it was an affordable handset. In the same way that top cameras are a staple of Huawei P phones, or big, high-res screens are a Sony Xperia flagship feature, it sounds like top performance will be GT phones' main trait.",
    "So why, then, do the Master and Explorer phones not use the 888, but the 778G and 870 respectively? \"We wanted to make sure we embraced [all] the chipsets at this particular price,\" Sheth explained, \"so people can experience the best of 5G, even if the services are not rolled out, without compromising on the price as well as the performance.\"",
    "Sheth's point about embracing various chipsets rings true because, while the 888 is top in terms of processing power, it's not necessarily the 'best' overall. That's because the 888 has well-reported overheating issues while the 870 doesn't, and that lower-number chipset isn't too far off the top-end model in terms of performance power.",
    "So presumably Realme opted for these lower-end chipsets because that resulted in cheaper phones, without providing a noticeably different user experience.",
    "Now onto the curved screen, a surprisingly premium feature for this Realme phone. Turns out, this has been a long time coming: \"we have been trying, on the curved screens, for a really long time.\" Sheth told us.",
    "\"I believe that display is going to be the most important aspect in the near future.\" Sheth explained, echoing comments he made at a similar interview with TechRadar a year prior, except that was about charging speed. \"I think post-pandemic, that one of the most important aspects we are learning about people is that they're looking for a bigger, better, brighter and more responsive screen, and the expectation for the screen has been much higher than it was before\".",
    "The word 'bigger' is interesting, as Realme phones tend to be pretty small, with the GT devices all sitting at 6.4 inches diagonally, while lots of the industry tends towards 6.7 or 6.8 inches. It's something we've liked about the phones, making them easy to use one-handed, but evidently, some prefer wider displays.",
    "It's also intriguing to see Realme edge towards curved-edge screens, given lots of the industry is taking steps away - the Samsung Galaxy S21 phones had smaller curves than their predecessors, and the Motorola Edge 20 series doesn't have the feature at all despite the name.",
    "When we spoke to Xiaomi about its Mi 10T in 2020, the decision to use a flat display instead of a curved-edge one was justified with a stat - apparently 60% of people polled by the brand said they preferred flat to curved edges.",
    "The reasoning is that curved-edge displays are prone to accidental touches along the edge, which can sometimes trigger unintended functions - some brands have found software solutions to this problem, while others have just stuck to flat edges. In the defense of the curvy screen, it feels nicer to hold in the hand, and looks more premium too.",
    "We asked Sheth if future Realme phones will continue with the feature, to the response \"I would love to,\" - that's certainly not a confirmation either way, but it should give fans of the feature hope.",
    "As such a new series, the future of the Realme GT line remains unclear. We could see new entries all the time, or perhaps just at one or two points in the year - we'll have to wait to see."
  ],
  "headers": {
    "5": "What makes a Master or an Explorer?",
    "11": "The curving of the screen"
  },
  "links": {
    "GT Master Edition and GT Explorer Master Edition": "https://www.techradar.com/news/realmes-new-device-takes-one-of-the-best-android-phones-and-makes-it-even-cheaper",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "the Realme GT line is replacing the X series": "https://www.techradar.com/news/exclusive-realme-is-ending-one-of-its-phone-lines-and-for-an-exciting-reason",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Motorola Edge 20 series": "https://www.techradar.com/reviews/motorola-edge-20-pro-review",
    "spoke to Xiaomi": "https://www.techradar.com/news/xiaomi-mi-10t-doesnt-have-a-flagship-phone-screen-but-for-a-great-reason",
    "Mi 10T": "https://www.techradar.com/reviews/xiaomi-mi-10t-pro-review"
  }
}