{
  "source": "https://www.techradar.com/news/hisenses-new-laser-tv-promises-the-best-home-cinema-experience-in-2021",
  "title": "Hisense's new laser TV is pricey, but could prove its best home cinema experience yet",
  "category": "televisions",
  "updated": "2021-09-01T13:01:31Z",
  "author": "hamish-hector",
  "summary": "Hisense's laser TVs keep getting better",
  "article": [
    "Hisense has just announced its latest laser TV, the new L9G. In what promises to be a premium home entertainment device, the L9G TriChroma laser TV will use a 3000 Lumen ultra-short throw projection to create a razor-sharp and color-accurate image.",
    "You’ll be able to enjoy that image in one of two sizes, either 100-inch or 120-inch, with each model packaged with an Ambient Light Rejecting (ALR) screen, so you have everything you need to get the best experience from your new laser TV.",
    "The 100-inch L9G model will be available with either an ALR Daylight screen (designed for living rooms and bright spaces) or an ALR Cinema screen (designed for darker rooms like home theaters), while the 120-inch model will only be packaged with the Cinema screen.",
    "With other premium features like 40W Dolby Atmos sound and a full Android TV platform – a step up from the 30W speakers and Vidaa U operating system of the L5 laser TV – it’s no surprise that the L9G will set you back quite a bit. If you’re interested in trying the L9G laser TV for yourself the 100-inch model is available to buy now for $5499.99. The larger 120-inch version will cost $5999.99 and will become available later in the year.",
    "Laser TV is a bit of a misnomer as it’s really ultra-short throw projector. Unlike normal projectors that are often some distance back from a surface, an ultra-short throw projector is often placed right below an ALR to create a stunning image that blends the best of TVs and Projectors.",
    "Generally, laser TVs can expand beyond the traditional size of an OLED or LCD screen and they’re able to output a brighter image than normal projectors too. This makes them perfect for almost any home cinema be they in a dedicated space or part of your living room.",
    "Because of all the advantages they bring though, laser TVs are incredibly expensive. If you have the budget they’re well worth considering for your next home cinema upgrade. You can find out more and get answers to more of your laser TV questions in our guide: should I buy a laser TV?",
    "Hisense’s L9G Laser TV is jam-packed with premium features to deliver what it promises is an amazing experience. We haven’t been able to try one of these devices out for ourselves yet, but we’re impressed with the specs we’ve seen.",
    "Thanks to the inbuilt 40W Dolby Atmos sound you probably won’t be longing for a soundbar, as Atmos is designed to help create a 360-degree bubble of sound to immerse you in what you’re watching. However, the L9G is also WiSA ready if you’re desperate to integrate your wireless surround sound system.",
    "You won’t just be getting a glorified soundbar, as the L9G has the hardware and software to create a splendid image too. A digital micromirror device tool should let the laser TV create more fluid motion in your favorite films, games, and sports matches. Thanks to the incredibly bright projection you should be able to get the most out of the HDR too, giving a wide range of colors and better definition in darker scenes. The L9G will provide its image for a long time too, as Hisense promises its X-Fusion laser light technology provides up to 25,000+ hours of entertainment.",
    "All of this is powered by the Android TV OS, and the L9G is designed to integrate with your home’s smart speakers to give you even more ways to enjoy the streaming services you love."
  ],
  "headers": {
    "4": "What is a laser TV?",
    "7": "What else can the L9G laser TV do?"
  },
  "links": {
    "ultra-short throw projection": "https://www.techradar.com/news/should-i-buy-an-ultra-short-throw-projector",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "should I buy a laser TV?": "https://www.techradar.com/news/should-i-buy-a-laser-tv"
  }
}