{
  "source": "https://www.techradar.com/news/alan-wake-remastered-has-been-seemingly-leaked-for-nintendo-switch",
  "title": "Alan Wake Remastered has been seemingly leaked for Nintendo Switch",
  "category": "gaming",
  "updated": "2021-09-21T12:02:17Z",
  "author": "jamel-smith",
  "summary": "The horror epic could be coming to your Switch",
  "article": [
    "It seems as if Remedy Entertainment’s thriller, Alan Wake Remastered, will be making its way onto the Nintendo Switch alongside the previously-announced PS5, PS4, Xbox Series X/S, Xbox One and PC versions.",
    "Spotted by a journalist on Twitter, the Brazilian rating board recently listed a Nintendo Switch version of Alan Wake Remastered. Announced at Sony’s PlayStation September showcase, there was no mention of Alan Wake Remastered coming to the Switch, so if this listing is accurate, it will come as nice a surprise for Nintendo Switch fans who were feeling left out.",
    "Alan Wake Remastered will be running on the PS5 and Xbox Series X with improved graphics, higher resolutions and faster frame rates than the original game, but we likely won’t see the same visual and performance upgrades with the remaster on the Nintendo Switch – if it is indeed coming to the console.",
    "The Nintendo Switch’s games often have lackluster visuals and performance compared to games on the PS5 and Xbox Series X/S, with the framerates of some games on the Switch teetering around 30fps, and hitting resolutions as low as 540p, which means it’s quite likely we’ll see very few gamers pick up the Nintendo Switch version of Alan Wake Remastered over the next-gen consoles versions, if they have the choice."
  ],
  "headers": {
    "2": "Opinion: Visuals and performance reign supreme"
  },
  "links": {
    "Alan Wake Remastered": "https://www.techradar.com/reviews/alan-wake-remastered",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Twitter": "https://twitter.com/necrolipe/status/1440015786584723456"
  }
}