{
  "source": "https://www.techradar.com/news/galax-launches-rtx-3060-and-rtx-3060-ti-gpus-with-crytomining-limiter",
  "title": "Galax launches RTX 3060 and RTX 3060 Ti GPUs with crytomining limiter",
  "category": "computing",
  "updated": "2021-05-14T15:15:40Z",
  "author": "carly-page",
  "summary": "The RTX 3060 cards are limited to a 50% hash rate",
  "article": [
    "Galax has launched a new line of GeForce RTX 3060 and RTX 3060 Ti graphics cards that come kitted out with Nvidia’s hash-rate limiter.",
    "The low hash-rate (LHR) cards are based on the GA106-302 and GA104-202 GPUs, respectively, which means they are limited to a 50% hash rate in cryptocurrency mining - making them unprofitable to mine Ethereum. Galax has confirmed that the RTX 3060 LHR and RTX 3060 Ti LHR feature hash rates of 25MH/s and 20MH/s, respectively.",
    "This should, in theory, make the graphics cards less appealing to cryptominers, which means it might finally be easier for PC gamers to get their hands on an Nvidia RTX 3000-series GPU.",
    "Beyond the added hash-rate limiter, the rest of GPUs’ specs remain unchanged. The RTX 3060 features 3,584 CUDA cores, a boost clock speed of 1.78 GHz, a 192-bit memory bus, and a TDP of 170W.",
    "The RTX 3060 Ti, on the other hand, has 4,864 CUDA cores and a higher 256-bit memory bus, but a slower clock speed of 1.67 GHz",
    "The launch of the RTX 3060 LHR and RTX 3060 Ti comes just days after Galax introduced its RTX 3070 LHR and RTX 3080 LRD graphics cards. Videocardz notes that this seems to suggest that the entire RTX 3000 lineup will be getting an LRH refresh - with exception of the Nvidia RTX 3090.",
    "The report also notes that, while Galax is first to market, other board partners are preparing to refresh their RTX 3000-series lineups. MSI, for example, is planning to launch a Plus-monikered series, which will also include a refresh of its Radeon RX 6000 series lineup. AMD, however, is expected to introduce a similar Ethereum limiter",
    "Via: Videocardz"
  ],
  "headers": {},
  "links": {
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Videocardz": "https://videocardz.com/newz/galax-launches-geforce-rtx-3060-ti-and-rtx-3060-with-cryptomining-limiter",
    "Radeon RX 6000": "https://www.techradar.com/news/amd-big-navi"
  }
}