{
  "source": "https://www.techradar.com/news/bitdefender-is-ending-its-free-antivirus",
  "title": "Bitdefender free antivirus is closing - here's all you need to know",
  "category": "computing",
  "updated": "2021-12-10T12:03:48Z",
  "author": "anthony-spadafora",
  "summary": "Bitdefender Antivirus Free Edition will be discontinued at the end of 2021",
  "article": [
    "Some Bitdefender customers will soon need to look for a new way to keep their computers protected against the latest threats and viruses after the company announced it would be closing the free version of its antivirus software.",
    "While Bitdefender has a number of paid antivirus solutions to help users protect their PCs, the company also offers Bitdefender Antivirus Free Edition. However, in an email sent to its customers seen by TechRadar Pro, the company has revealed that it will soon end support for its free antivirus.",
    "In the email, Bitdefender explained that immense changes in the security industry have upended many of its plans for product development and unfortunately, beginning January 1 2022, Bitdefender Antivirus Free Edition will officially be discontinued and will no longer be available for use.",
    "“We are focusing product development around multi-platform protection and as a result, we are retiring Bitdefender Antivirus Free for Windows starting on December 31, 2021. Current users will be supported through June 30, 2022,\" the company told TechRadar Pro in a statement.",
    "\"Bitdefender values its customers and user base; all existing Antivirus Free users will receive privately (via email) a special discounted offer for Bitdefender Total Security.”",
    "Although Bitdefender is discontinuing its free antivirus, the company says that it will continue to offer tech support for the product until June 30 of next year. This will give its customers more than enough time to install an alternative antivirus solution to keep their devices protected.",
    "For those that want to continue using Bitdefender's silent “set-in-and-forget-it” style of antivirus protection, the company is running a promotion where it will upgrade the subscriptions of its free users to Bitdefender Total Security.",
    "Normally a one year subscription to the software costs £69.99 but Bitdefender will provide Free Edition users with a 5 device / 1 year subscription for just £8.98. However, this offer is only available to Free Edition users and will expire on December 31 of this year, so if you want to keep using Bitdefender to protect your PC, now is the time to claim it.",
    "Alternatively, Microsoft Defender is another free antivirus software solution that comes built-in with every Windows PC though it doesn't include nearly as many features as Bitdefender Total Security like a VPN and mobile apps for Android and iOS.",
    "We've also highlighted the best antivirus, best malware removal software and best endpoint protection software"
  ],
  "headers": {
    "3": "Time for an upgrade"
  },
  "links": {
    "antivirus software": "https://www.techradar.com/best/best-antivirus",
    "Bitdefender Antivirus Free Edition": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "free antivirus": "https://www.techradar.com/news/is-free-antivirus-safe",
    "Bitdefender Total Security": "https://www.techradar.com/news/bitdefender-total-security",
    "Microsoft Defender": "https://www.techradar.com/reviews/windows-defender",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best antivirus": "https://www.techradar.com/best/best-antivirus",
    "best malware removal software": "https://www.techradar.com/best/best-malware-removal",
    "best endpoint protection software": "https://www.techradar.com/news/best-endpoint-security-software"
  }
}