{
  "source": "https://www.techradar.com/news/your-iphone-may-one-day-have-a-disappearing-notch",
  "title": "Your iPhone may one day have a disappearing notch",
  "category": "phones",
  "updated": "2021-08-04T09:08:03Z",
  "author": "james-peckham",
  "summary": "A moving display to hide the front-facing camera tech",
  "article": [
    "The notch is expected to stick around for the iPhone 13 series, but a new patent suggests Apple is experimenting with ways it can get rid of the front-facing camera tech for future smartphones.",
    "A new patent spotted by Patently Apple shows a moving display that would be able to hide the Face ID elements, front-facing camera and more from view when it's not in use.",
    "This was filed with the US Patent and Trademark office, and it refers to the technology as \"adjustable display windows\". That's because there are two different ways of achieving this effect, according to the patent.",
    "The first is a flap using a flexible display that would rotate on a hinge to open up where the camera will sit. This would only be visible when you're using features that need the front-facing camera tech.",
    "The second idea in the patent is moveable display that would slide down to make the camera components visible. These would likely sit near the top of the screen (similar to where the notch is on the iPhone 12 series).",
    "This would all happen under the glass of the display, if this patent pans out.",
    "As ever, patents don't mean we're set to see this technology debut on a new iPhone. In fact, a lot of patented technology never even sees the light of day, so while this is something Apple is clearly experimenting with don't take this as confirmation it'll appear on the iPhone 14.",
    "We're expecting the iPhone 13 to land next month, and so far the leaks and rumors suggest there will continue to be a notch on all four handsets. It is set to be smaller though, with some rumors suggesting it'll be around 30% slimmer.",
    "That means more screen space as the notch takes up less room at the top of your iPhone, but it still means a good percentage of your smartphone's display will be taken up by this technology.",
    "This new patent doesn't seem to be something we'll see in the near future. Some previous rumors have suggested the 2022 iPhone series may be set to move to a punch-hole design for its camera instead.",
    "Other leaks have also suggested Apple is eyeing under-display selfie camera technology. That is a rarity in the smartphone market right now - you can only get this on ZTE smartphones like the Axon 20 - and it hasn't impressed us with the results so far.",
    "Apple is likely looking at a variety of options to work out what to do with the notch in the coming years, and any of these could be viable options.",
    "We'd expect Apple to go with the most seamless technology, and by the time of an iPhone in 2022, 2023 or beyond it may be the company is ready to embrace under-display camera technology.",
    "Via MacRumors"
  ],
  "headers": {
    "7": "Analysis: what is Apple doing with the notch?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Patently Apple": "https://www.patentlyapple.com/patently-apple/2021/08/apple-wins-a-patent-for-an-expandable-display-that-hides-the-iphones-cameras-eliminates-the-notch-on-demand.html",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Axon 20": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "MacRumors": "https://www.macrumors.com/2021/08/03/apple-researching-ways-to-hide-the-notch/"
  }
}