{
  "source": "https://www.techradar.com/news/oneplus-10-pro-renders-specs-and-surprisingly-early-release-date-leaked",
  "title": "OnePlus 10 Pro renders, specs and surprisingly early release date leaked",
  "category": "phones",
  "updated": "2021-11-16T10:01:47Z",
  "author": "james-rogerson",
  "summary": "It's likely landing soon",
  "article": [
    "There’s big OnePlus 10 Pro news today, as most of the key details of the phone have just been leaked, giving us a full look at its likely design, along with some possible specs and a release time frame.",
    "Renders, some of which you can see below, have been shared by Zouton in collaboration with OnLeaks (a leaker with a good track record).",
    "They show what’s apparently the final design of the phone from all sides, revealing a curved screen with a punch-hole camera in the top left corner, and a distinctive triple-lens camera block on the back.",
    "According to this source, the OnePlus 10 Pro will come in black, white and light blue shades (despite the renders including a green model), and will have a 6.7-inch screen with a 120Hz refresh rate and a 20:09 aspect ratio.",
    "It's also said to have a 5,000mAh battery, 125W charging (as we’ve heard before), 8GB or 12GB of RAM, 128GB or 256GB of storage, and dimensions of 163.0 x 73.8 x 8.5mm (or 10.3mm including the camera bump).",
    "Elsewhere, 91Mobiles claims to have learned from leaker Yogesh Brar that the OnePlus 10 range has entered private testing in Europe and China, and that it’s likely to launch in either late January or early February.",
    "We would of course take all of this with a pinch of salt, especially the release date, as that would be less than a year after the OnePlus 9 range landed, and it’s the first release date rumor we’ve really heard.",
    "But it could well be accurate, and the leaked specs and design are in line with things we’ve seen and heard previously.",
    "If the OnePlus 10 range really does land in late January or early February then it’s likely to have the Samsung Galaxy S22 range for company, as that is also rumored to be landing in early February.",
    "These two behemoths launching new phones so close together is an unusual occurrence, but it could make sense for OnePlus.",
    "For one thing, there hasn’t been a OnePlus 9T, so while a late January or early February launch would seem a bit early for the company to launch a new numbered model, it’s actually been longer than OnePlus usually waits between flagships.",
    "Plus, launching closer to the Samsung Galaxy S22 range could even benefit it. While that will be some tough competition, and steal some of the media attention away from OnePlus, it does mean that potential buyers won’t have been swayed by the Galaxy before the OnePlus 10 range is even unveiled. They’ll be able to make an informed choice instead.",
    "Via GSMArena"
  ],
  "headers": {
    "8": "Analysis: get ready for a flagship showdown"
  },
  "links": {
    "OnePlus 10 Pro": "https://www.techradar.com/news/oneplus-10",
    "Zouton": "https://zouton.com/news/oneplus-10-pro-first-complete-final-leaks-renders-specs-latest-design-camera-exclusive-edition",
    "we’ve heard before": "https://www.techradar.com/news/oneplus-10-pro-and-four-other-phones-tipped-to-get-125w-charging-in-2022",
    "91Mobiles": "https://www.91mobiles.com/hub/oneplus-10-series-testing-launch-timeline-exclusive/",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "GSMArena": "https://www.gsmarena.com/oneplus_10_series_design_specs_and_supposed_launch_timeframe_revealed-news-51837.php"
  }
}