{
  "source": "https://www.techradar.com/news/google-docs-update-makes-collaboration-less-of-a-chore",
  "title": "Google Docs update makes collaboration less of a chore",
  "category": "computing",
  "updated": "2021-08-25T19:15:23Z",
  "author": "anthony-spadafora",
  "summary": "Forget coming up with clever replies to comments and let Google do it for you instead",
  "article": [
    "Google is adding a new feature to Google Docs that will make it easier to work together with your co-workers using the company's online collaboration software.",
    "Back in 2017, the search giant added Smart Reply to Gmail to save users of its email service time by suggesting quick responses to their messages. Now Google is bringing this same functionality to its office software to help those still working from home be more productive.",
    "Commenting on a document is an easy way to let other contributors know that something needs to be changed or updated. However, responding to every comment can be a chore especially when working with a large distributed workforce.",
    "For this reason, Google Docs will now suggest relevant replies to comments in a document so that you can respond quickly and get back to the task at hand.",
    "When this new feature rolls out to Google Docs, Smart Reply suggestions will begin appearing below the reply box on comment threads in English. From here, users will be able to choose a suggested reply though they will still have the ability to write their own.",
    "Earlier this year, Google added Smart compose and spelling autocorrect to comments in Google Docs to help users compose comments quickly and with confidence. Smart Reply takes things a step further though by automatically creating relevant replies for you.",
    "In a new post on the Google Workspace blog, Google revealed that this feature will begin rolling out to Rapid Release domains beginning on August 24 and to Scheduled Release domains starting on September 13.",
    "Smart Reply suggestions will be enabled by default in Google Docs but you can disable them by going to Tools > Preferences > Show Smart Reply suggestions and toggling the feature off."
  ],
  "headers": {
    "4": "Smart Reply in Google Docs"
  },
  "links": {
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "online collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "email service": "https://www.techradar.com/news/best-email-provider",
    "office software": "https://www.techradar.com/best/free-office-software",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "spelling autocorrect": "https://www.techradar.com/news/google-docs-can-now-predict-what-youre-going-to-type-next",
    "new post": "https://workspaceupdates.googleblog.com/2021/08/save-time-replying-to-comments-in.html",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace"
  }
}