{
  "source": "https://www.techradar.com/news/huaweis-smartwatches-are-about-to-get-much-much-better",
  "title": "Move over Apple Watch: smartwatches from Huawei just got a top feature",
  "category": "wearables",
  "updated": "2021-02-24T16:32:06Z",
  "author": "tom-bedford",
  "summary": "Thanks to third-party apps",
  "article": [
    "While Huawei's smartwatches like the Huawei Watch GT 2 Pro look great and have plenty of health and fitness features, they're often rather limited in the lifestyle feature department. This is because they don't support third-party apps (those made by companies other than Huawei).",
    "That's about to completely change though, as Huawei has announced its wearables will now support apps from all developers, as long as the smartwatch app is run through Huawei's AppGallery.",
    "This change blows the functionality of Huawei smartwatches wide open, and now they can truly complete with Google or Apple's wearables. New smartwatch apps could include bespoke fitness platforms, music streaming services, maps and possibly even games.",
    "The first third-party Huawei smartwatch app is already live - it's called Fitify, and it's a wristwatch version of the fitness mobile app with over 5 million installs from the Google Play Store. The app lets you track and analyze a wide variety of workouts.",
    "Fitify is just the first of many, but we won't see new apps on Huawei smartwatches straight away. That's because we need to see developers port their platforms into a watch app - for some, who already have Wear OS or watchOS versions, this presumably won't be much work, but some developers might need to put a lot of effort into creating their first smartwatch app.",
    "As such, some developers might deem the time and money it would take to create a smartwatch app unnecessary, so we'll need to wait and see how many third-party Huawei watch apps we see pop up over time.",
    "One thing's for sure though - this further cements Huawei smartwatches as some of the top wearables you can buy right now."
  ],
  "headers": {
    "3": "When could we see more apps?"
  },
  "links": {
    "Huawei Watch GT 2 Pro": "https://www.techradar.com/reviews/huawei-watch-gt-2-pro-review"
  }
}