{
  "source": "https://www.techradar.com/news/lenovo-reveals-new-thinkpad-and-thinkvision-devices-for-hybrid-working",
  "title": "Lenovo reveals new ThinkPad and ThinkVision devices for hybrid working",
  "category": "computing",
  "updated": "2021-06-24T04:59:26Z",
  "author": "anthony-spadafora",
  "summary": "New devices aim to boost productivity at home and in the office",
  "article": [
    "Lenovo has given its top of the line mobile workstation a complete redesign and the 4th-generation ThinkPad X1 Extreme now features the latest Intel processors and can even be outfitted with a Nvidia GeForce RTX 3080.",
    "The ThinkPad X1 Extreme Gen 4 delivers more power than the previous generation thanks to the inclusion of the latest 11th Gen Intel Core i9 H-Series vPro processors and Nvidia's latest GeForce RTX Laptop GPUs. The device can also be equipped with up to 64GB of DDR4 memory, dual SSDs and 5G Wireless Wan.",
    "In order to help cool the Nvidia RTX configured models, Lenovo's engineers developed three new complementary cooling systems. The first is a hybrid cooling system that uses both traditional heat pipes as well as a large vapor chamber, the second is a keyboard air intake and the third is dual bypass design that allows air to flow over the top and bottom of the device's components.",
    "The latest iteration of the ThinkPad X1 Extreme has also been designed with collaboration in mind and the device delivers exceptional video conferencing performance thanks to its edge-to-edge 16-inch screen, a new FHD webcam, dual noise-canceling headphones and a user-facing Dolby Atmos Speaker System that is 20 percent larger than the one found in the previous generation.",
    "For additional screen real estate, the ThinkPad X1 Extreme Gen 4 can be paired with Lenovo's new ThinkVision M15 mobile monitor. The15.6-inch portable monitor weights just 860 grams and easily connects to a Lenovo laptop via a USB Type-C cable.",
    "The ThinkVision M15 also features an ergonomic height adjustment stand, low blue light technology and comes with a protective sleeve so users can bring it with them along with their other hybrid working tech.",
    "For those looking for a larger fixed business monitor, Lenovo has added the 23.8-inch FHD ThinkVision T24m-20 to its lineup as well. In addition to being a monitor, the device also works as a laptop dock that supports data, video/audio, Ethernet and up to 90W power delivery. Multiple ThinkVision T24m-20 monitors can even be daisy chained together for a multi monitor configuration with a mirrored power button which can turn on a compatible connected PC.",
    "Users can also outfit any current ThinkVision P or T series monitor with Lenovo's new business webcam. The ThinkVision MC50 Monitor Webcam delivers 1080p video and built-in dual noise-canceling microphones ensure you'll always be heard in a video call. Letting other know you're busy is also easy since the device features a red light on the top of the webcam that turns on while video conferencing.",
    "The ThinkPad X1 Extreme Gen 4 will be available in August starting at $2,149 (around £1,540) while the ThinkVision M15 Mobile Monitor, ThinkVision T24m-20 and ThinkVision Mc50 Monitor Webcam will be available in the third quarter of this year."
  ],
  "headers": {
    "4": "ThinkVision monitors and webcam"
  },
  "links": {
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "ThinkPad X1 Extreme": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-extreme-mobile-workstation",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "portable monitor": "https://www.techradar.com/news/best-portable-monitor",
    "Lenovo laptop": "https://www.techradar.com/news/the-best-lenovo-laptops-2018",
    "hybrid working tech": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "business monitor": "https://www.techradar.com/news/best-business-monitor",
    "laptop dock": "https://www.techradar.com/news/the-best-laptop-docking-stations",
    "business webcam": "https://www.techradar.com/best/best-business-webcams"
  }
}