{
  "source": "https://www.techradar.com/news/wear-os-update-may-not-be-available-to-all-current-watches",
  "title": "Wear OS update may not be available to all current watches",
  "category": "wearables",
  "updated": "2021-05-19T09:40:53Z",
  "author": "james-rogerson",
  "summary": "Nothing is certain",
  "article": [
    "Google has announced a big – and long overdue – update to Wear OS, coming later this year, but if you have a Wear OS watch strapped to your wrist right now, there’s no guarantee that you’ll be able to get the update.",
    "That’s because when 9to5Google asked the company directly whether current Wear OS watches would get the update, the reply was as follows: 'We will have more updates to share on timelines once the new version launches later this year.'",
    "It’s a reply that somewhat dodges the question, suggesting that at least some current Wear OS models probably won’t get the update. But it also provides hope that others will. Whatever the case though, we’ll have to wait to find out for sure.",
    "Obviously we wouldn’t expect every Wear OS device that has ever launched to get the update, so perhaps Google is just being careful not to give a blanket 'yes' until it’s worked out the details. We’d certainly hope that more recent models like the TicWatch Pro 3 would be eligible.",
    "That said, as noted this sounds like a big update, one that could fundamentally change the look, feel and features of Wear OS, so it’s possible that some wearables would struggle to run it.",
    "All we can do for now is wait, but with all this uncertainty, coupled with exciting new wearables like the Samsung Galaxy Watch 4 probably launching soon, you might want to hold off on buying a new smartwatch until things become clearer."
  ],
  "headers": {
    "3": "There's hope for some"
  },
  "links": {
    "update to Wear OS": "https://www.techradar.com/news/wearos-is-finally-getting-an-update-that-might-make-its-smartwatches-good-again",
    "9to5Google": "https://9to5google.com/2021/05/18/wear-os-revamp-current-models/",
    "TicWatch Pro 3": "https://www.techradar.com/reviews/ticwatch-pro-3",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review"
  }
}