{
  "source": "https://www.techradar.com/news/ev-battery-size-charge-speeds-and-range-explained",
  "title": "EV battery size, charge speeds and range explained",
  "category": "car-tech",
  "updated": "2021-07-30T15:00:34Z",
  "author": "alistair-charlton",
  "summary": "Important information you need when buying an electric car",
  "article": [
    "When it comes to buying an electric car, any knowledge you have about horsepower, gears, and petrol or diesel consumption can be left at the kerb.",
    "Instead, you'll need to learn what feels like a whole new language of kilowatts, volts, range, charge rate and kilowatt-hours. Miles-per-gallon is replaced with miles-per-kilowatt, or kilowatt-hours per 100km.",
    "But fear not, because while there's a lot to learn, TechRadar is here to help. In this article we'll unpack three key areas of electric car technology.",
    "These include battery sizes, the various charging speeds available from public and private chargers, and how to understand the all-important range, including the three different efficiency tests used globally, and how your range is affected by driving style, road surface and even the weather.",
    "Let us kick off with one of the simplest electric car stats; the size of the battery. This is measured in kilowatt-hours, shortened to kWh, and is sometimes included in the name of the vehicle.",
    "Although it now uses a different naming convention, older Tesla cars are called, for example, the Model S P90, which means the Performance version of the Model S, with a 90kWh battery pack.",
    "Generally speaking, the size of the car is reflected by the size of its battery pack. A larger battery tends to equal more range, but diminishing returns are at play here, as larger battery packs are incredibly heavy – over 500kg in some cases – so unlike a tank of petrol that decreases in weight as the miles tick by, a battery weighs the same whether it is full or empty.",
    "An example of an electric car with a small battery is the Honda e, which has a 35.5kWh pack. A larger city car like the Vauxhall Corsa-e has a 50kWh pack, and the Volkswagen ID.3 has a range of battery options, spanning from 58kWh to 77kWh.",
    "Stepping up a gear, and the Porsche Taycan offers battery sizes ranging from 79.2kWh to 93.4kWh.",
    "Tesla fits its Model S with a 100kWh pack, and Rivian is to offer a 135kWh option for its R1T pick-up truck.",
    "General Motors has outlined plans for eventually fitting 200kWh batteries to future vehicles, and Tesla says its Semi, an articulated lorry, will have a massive 500kWh pack.",
    "Although a small detail, it is worth remembering that some car manufacturers quote the total or actual battery capacity, and others quote the usable capacity.",
    "For example, the largest battery fitted to a Porsche Taycan has an actual capacity of 93.4kWh, but a usable capacity of 83.7kWh.",
    "It's only a small difference, but worth knowing if you see what appears to be a conflicting set of numbers for the same vehicle.",
    "Filling a car with petrol or diesel takes just a couple of minutes, and doesn't vary a great deal from one vehicle to another. But with electric cars, not only are the batteries of vastly different size, but charger speeds differ too.",
    "There is such a difference, in fact, that a Porsche Taycan with the largest battery plugged into a wall socket at home might take an entire day to charge, while that same battery can be filled to 80% in about 22 minutes from the fastest type of public charger.",
    "The Porsche can achieve such a fast recharge time because it uses a 800 volt architecture, compared to the 400 volt systems used by most other electric cars. A higher voltage allows for a lower current to be used while charging, which reduces heat and increases charge speed.",
    "But unlocking that high-speed charging requires a certain type of charger; namely, a CCS charger that can deliver energy at 270kW, which is the maximum the Taycan can accept.",
    "The Ionity network in the UK and Europe (and Electrify America in the US) have a handful of 350kW chargers, but the majority of public chargers are slower than this.",
    "Even the fastest chargers offered by Shell and BP are 100kW or 150kW, while many public 'rapid' chargers are 50kW, and the chargers found on residential streets can be as slow as 7kW – the same as a charger you might install at home.",
    "As for refill times, an EV with a 75kWh battery will be filled in under an hour using a 150kW charger, in around two hours using a 50kW charger, and in 11 hours using a 7kW charger.",
    "Chargers of 100kW and over are perfect for topping up the battery on a long journey, while slower chargers are best for overnight refills.",
    "There is also a difference in current between chargers. Less powerful chargers use AC (alternating current), while quicker ones use DC (direct current). The difference here is how electric cars use their onboard converter to turn AC into DC, while the current from a DC charger can be fed directly into the battery.",
    "Faster chargers, like those offering 50kW and above, use DC while slower and domestic chargers use AC.",
    "One final note for this section is how empty batteries charge more quickly than ones that are almost full. This is why many manufacturers quote a charge time when filling a battery from under 20 percent to 80 percent.",
    "The first few percent are topped up very quickly, in some cases at a rate of over 1,000 miles of range per hour, but after 80 percent things slow down significantly, and the last few percent usually aren't worth your time.",
    "We've tried to avoid acronyms so far, but for this section there are three we need to delve into.",
    "These all refer to test cycles that are used to determine the energy consumption of a vehicle. They can be used to work out the miles per gallon or litres per 100km of internal combustion cars, and are also used to work out the energy efficiency of electric vehicles.",
    "EPA is the US Environmental Protection Agency, WLTP is the Worldwide Harmonised Light Vehicle Test Procedure, and the NEDC is the New European Driving Cycle.",
    "Now for a dose of irony with a side of confusion. The New European Driving Cycle isn't new in the slightest, was last updated in 1997, and has effectively been replaced by WLTP.",
    "But the Worldwide of this test isn't accurate either, because car manufacturers in the United States quote their consumption figures using their native EPA test.",
    "What's even more fun is how the results of these – the predicted range of an electric vehicle – is different for each test. Generally speaking, the EPA test is the toughest and results in a lower range figure than when the same vehicle is tested using the WLTP standard.",
    "As an example of how much these figures can differ, the Tesla Model 3 Performance has an EPA range of 315 miles and a WLTP range of 352 miles.",
    "It's a similar story for the Jaguar I-Pace (246 miles EPA vs 292 miles WLTP) and every other electric car. To further confuse things, Porsche prefers to state the kWh/100km figure, which is the electrical equivalent of miles per gallon. In the case of the Taycan Turbo S, this is 25.6 to 24.3 kWh/100km.",
    "Lastly, these figures are affected by many outside factors. Higher speed on an uphill road with a rough surface will result in less mileage than a slower cruise on a flat, smooth road.",
    "Drive down hill for long enough and the remaining range of an EV can increase, thanks to the regenerative braking system. Ambient temperature also plays a role, as lithium batteries perform less well when cold, resulting in reduced EV range in the winter months."
  ],
  "headers": {
    "4": "EV battery sizes explained",
    "14": "EV charging speeds explained",
    "26": "EV range explained"
  },
  "links": {
    "Porsche Taycan": "https://www.techradar.com/news/porsche-taycan-4s-review",
    "for its R1T pick-up truck": "https://www.techradar.com/news/amazon-backed-rivian-to-open-second-factory-report"
  }
}