{
  "source": "https://www.techradar.com/news/nintendos-latest-switch-controller-could-tease-the-return-of-these-classic-games",
  "title": "Nintendo’s latest Switch controller could tease the return of these classic games",
  "category": "gaming",
  "updated": "2021-09-17T13:51:13Z",
  "author": "hamish-hector",
  "summary": "We hope the N64 rumors are true",
  "article": [
    "A new FCC filing suggests that Nintendo has an announcement coming soon, and we hope it’s the long awaited release of N64 games on the Switch.",
    "The filing (discovered by VGC) is for a “game controller” but most details have been kept private at the request of Nintendo. However, that privacy is only set to last for six months, so we'll likely know what the controller looks like before long – likely in early 2022. With all the secrecy, though, we believe it could be an N64-style controller to pair with the arrival of N64 games on Nintendo Switch Online.",
    "This would make sense, as Nintendo previously released NES and SNES controllers for the Switch when games from those systems were added to its Online service. The need to keep the controller’s details private will help ensure any surprises aren’t spoiled, as the N64 controller has a distinct three-pronged design that any gamer would recognize instantly.",
    "We’ll have to wait for Nintendo to release official details to find out what’s really going on, but there’s a chance we’ll know more by the end of the month. Nintendo normally hosts a September Nintendo Direct, so we're optimistic that it will keep up with tradition to bring us new announcements soon.",
    "We reached out to a Nintendo representative but they declined to comment – in line with Nintendo's usual stance on rumor and speculation.",
    "If the new controller really is an N64 controller then that likely means games from that console will be headed to the Nintendo Switch soon. If that’s the case we have some picks for the games we most want to see.",
    "Mario Party 1, 2 and 3 The N64 was home to three Mario Party games and as some of the best entries in the series we hope they are added to Nintendo’s Online subscription service. With the possibility of online functionality on the cards, it could mean we’ll be able to enjoy classic multiplayer Mario Party without needing to meet up in person too.",
    "Banjo-Kazooie This is perhaps a bit of a pipe dream, but with Banjo and Kazooie featured in Super Smash Bros Ultimate there’s a chance Microsoft, Rare, and Nintendo were able to organize the return of everyone’s favorite bear-bird duo to Nintendo consoles. We aren’t holding our breath for this one, but without Banjo-Kazooie it just wouldn’t feel like a true N64 games collection.",
    "Legend of Zelda: Ocarina of Time We know you’re tired of hearing how much everyone loves Ocarina of Time, but we want to say it at least once more here. This epic N64 adventure was one of the best games on the system and still comes in most people’s top three of the best Zelda games of all time – despite being nearly 23 years old. If this game isn’t included in Nintendo Switch Online’s N64 lineup it will be an absolute travesty."
  ],
  "headers": {
    "5": "What N64 games do we want on Nintendo Switch Online?"
  },
  "links": {
    "N64 games on the Switch": "https://www.techradar.com/news/nintendo-switch-online-could-get-n64-games-soon-but-itll-cost-you",
    "VGC": "https://www.videogameschronicle.com/news/nintendo-is-planning-a-new-switch-controller/",
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer",
    "Super Smash Bros Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review"
  }
}