{
  "source": "https://www.techradar.com/news/firefox-mozilla-is-preparing-to-take-a-massive-gamble",
  "title": "Firefox: Mozilla is preparing to take a massive gamble",
  "category": "computing",
  "updated": "2021-09-20T11:17:17Z",
  "author": "joel-khalili",
  "summary": "Microsoft Bing could become the default search engine in Firefox",
  "article": [
    "Mozilla is running a study to assess whether users of its web browser Firefox are likely to tolerate a new default search engine.",
    "Currently, search queries punched into the Firefox address bar are delivered to Google by default. However, Mozilla has temporarily switched the default search engine to Microsoft Bing for a small pool of users.",
    "The company says this “experiment” affects 1% of desktop users and will continue for a number of months, likely wrapping up in January.",
    "The fact Mozilla is considering a switch to Microsoft Bing comes as somewhat of a surprise, given the lucrative deal the company holds with Google, which has historically accounted for more than three quarters of its annual revenue.",
    "Mozilla has previously stated it intends to build out new revenue streams (e.g. from subscription products like Mozilla VPN), but to abandon its relationship with Google would be a significant step.",
    "One might speculate that the move has something to do with Mozilla’s new focus on user privacy, an arena in which Google is not seen to excel. For example, the company has already moved to distance itself from Google’s plans to reform the digital advertising industry, which it says are fundamentally flawed.",
    "Mozilla has not yet responded to a request for clarification over the rationale. But irrespective of the strategy, a switch to Bing is likely to annoy a large section of Firefox users, who will be required to fiddle with settings to reinstate Google as the default.",
    "According to the latest data from Statcounter, Google is far and away the most popular search engine, with 92.03% market share. Microsoft Bing, meanwhile, handles just 2.48% of search queries and has failed to improve upon its position in any material way in recent years.",
    "Admittedly, the size of Google’s advantage has plenty to do with its financial agreements with browser companies. However, many users simply prefer Google due to the quality of search results, and will want to continue to use their favorite search product.",
    "Of course, nothing is set in stone; Mozilla is still currently testing the impact of a switch. But if the company does take the decision to make Microsoft Bing the default, a significant backlash is surely inevitable.",
    "Update: September 20 Mozilla has since provided the following statement, which offers only a vague explanation of the rationale: “As a part of optimizing the Firefox experience we regularly run studies. We are currently running a study that may cause some users to notice that their default search engine has changed. To revert back to their search engine of choice, users can follow these steps.”"
  ],
  "headers": {
    "3": "Firefox search engine"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "Mozilla VPN": "https://www.techradar.com/reviews/mozilla-vpn",
    "distance itself": "https://blog.mozilla.org/en/privacy-security/privacy-analysis-of-floc/",
    "data from Statcounter": "https://gs.statcounter.com/search-engine-market-share",
    "follow these steps": "https://support.mozilla.org/en-US/kb/change-your-default-search-settings-firefox"
  }
}