{
  "source": "https://www.techradar.com/news/google-pixel-6-event",
  "title": "Google Pixel 6 event: everything to expect on October 19",
  "category": "phones",
  "updated": "2021-10-19T10:32:53Z",
  "author": "tom-bedford",
  "summary": "Not just the Pixel 6 at the Pixel Fall Launch",
  "article": [
    "It's official: the Google Pixel 6 is getting an unveiling today (October 19) at a bespoke event - though we already know lots of information about the phone and its Pro relative due to Google teasing them copiously.",
    "The launch starts at 10am PT / 1pm ET / 6pm BST on October 19, (that's 4am in AEDT on October 20). To follow along with the launch as it happens you can either head to our Pixel 6 launch live blog, or learn how to watch the Pixel 6 live stream.",
    "So the Google Pixel 6 and 6 Pro will definitely show up (well, you'd hope, at their own event) but what else could we see? Some rumors point to some likely additions, and others dream of some more unlikely surprises.",
    "We've made some guesses, and categorized them below by how likely they are: some are almost definite, some are possible, and some are less-than-likely. Let's start off with the most likely announcements at the Pixel 6 event on October 19.",
    "If the Google Pixel 6 doesn't show up at its own launch event, something has gone seriously wrong on Google's end. Did it stay out too late the night before and wake up with no memory of the night before, and have to go through some Vegas-themed comedy set pieces to find the Pro before the launch event?",
    "Less has come out about the Pixel 6 than its big sibling. It'll possibly have a 50MP main and 12MP ultra-wide camera, a screen with a 90Hz refresh rate, 8GB of RAM and 33W charging.",
    "We know the device will have the same Tensor chipset as the Pro, which is one made by Google itself, but we don't actually know how good this is just yet.",
    "We know a bit more about the Pixel 6 Pro than its basic counterpart - it sounds like a flashier phone, making it a better target for leakers.",
    "Apparently it'll have a 6.67-inch screen with a 120Hz refresh rate, the same cameras as the standard phone but with a 48MP telephoto snapper, a 5,000mAh battery and perhaps up to 12GB of RAM.",
    "This is expected to be Google's anticipated return to the premium phone market after positioning the Pixel 5 as a mid-ranger, with lots of homemade software, including one particular thing lots of people are anticipating...",
    "Google usually releases the yearly update to Android - this year Android 12 - to older Pixel phones when the newest one releases. Admittedly that's been a bit complicated this year since the code has already been unveiled, but the new software isn't actually available to download on phones just yet.",
    "We know all the Android 12 features, the flagship of which is the Material You theme which lets you set a house style for all your phone's menus and screens, but so far it's only available in beta mode.",
    "Hopefully at the Pixel 6 event, Android 12 will get released to the first few phones, or we'll at least hear a release date.",
    "Rumors of the Google Pixel Fold have been circulating for a while - this is expected to be Google's first foldable phone, one that takes inspiration from the Pixel 6 but... well, folds.",
    "Lots of rumors have been pointing to a late-2021 unveiling, but that doesn't necessarily mean it'll get shown off during the October launch - and these rumors could be totally wrong, of course.",
    "There have been lots of rumors and reports over several years, which is one of the reasons we're anticipating it, yet we still have a very unclear image of the phone. A full unveiling is very unlikely, but perhaps a tease is possible?",
    "We already saw the Google Pixel Buds A-series earlier this year, but it's possible the company is working on a yearly update to its top-end Pixel Buds (2020).",
    "We haven't heard much about these true wireless earbuds - in fact, we haven't really heard any rumors suggesting they're coming at all.",
    "So why are these buds in the 'possible' column? Well, because we didn't hear much about Google's other Pixel Buds before they launched either, so there's precedent for silence. And they're also more likely than some of the other products we have on this list.",
    "This one is a little different, and we've only learned about it through a major leak around a week ahead of the October 19 Pixel launch. According to a source, Google is set to launch a new yearly upgrade system called Pixel Pass.",
    "There are similarities to Apple One (that's a service that includes a variety of Apple's services under one cost) but this would also adapt in \"regular updates\" for your Pixel smartphone alongside access to Google's services.",
    "While it's not entirely clear, we think that means you'd be able to upgrade your phone through the service to the Pixel 7 and beyond when new hardware arrives. On top of that, you'd get access to Google Play Pass, YouTube Premium, Google One and Google Fi.",
    "We've been hearing reports of the Google Pixel Watch from before written history began, but still it's never shown up. At this point, we're not really confident that it'll ever show up.",
    "This was expected to be a Google smartwatch that showcased Wear OS in its purest form - Wear OS has been through various iterations since we started hearing the rumors though.",
    "Maybe we'll be surprised, and Google will finally decide to show off its first-ever smartwatch. But since the company recently bought Fitbit, it's likely saving its wearable efforts for devices under that brand - and the latest leaks suggest that the Pixel Watch won't arrive before 2022.",
    "The a-series of Pixel phones often come out around six months after the originals, and offer similar features and designs at a lower price, with some corners cut to keep them affordable.",
    "As a result, we wouldn't expect to see the Pixel 6a at the October event - it'll much more likely show up in March or April 2022.",
    "Not only would a Pixel 6a compete with the Pixel 6 and 6 Pro, which would have similar features but cost more, but with an ongoing global shortage of chipsets and other tech components, Google likely doesn't want to be making three separate phones at the same time."
  ],
  "headers": {
    "4": "1. Google Pixel 6",
    "7": "2. Google Pixel 6 Pro",
    "10": "3. Android 12",
    "13": "1. Google Pixel Fold",
    "16": "2. Google Pixel Buds (2021)",
    "19": "3. Google Pixel Pass",
    "22": "1. Google Pixel Watch",
    "25": "2. Google Pixel 6a"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 6 launch live blog": "https://www.techradar.com/news/live/google-pixel-6-launch-live-blog",
    "how to watch the Pixel 6 live stream": "https://www.techradar.com/news/live/google-pixel-6-launch-live-blog",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "code has already been unveiled": "https://www.techradar.com/news/android-12-is-sort-of-out-but-you-cant-get-it-yet",
    "Google Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "Google Pixel Buds A-series": "https://www.techradar.com/reviews/google-pixel-buds-a-series-review",
    "Pixel Buds (2020)": "https://www.techradar.com/reviews/google-pixel-buds-2020",
    "Pixel Pass": "https://www.techradar.com/news/what-is-google-pixel-pass",
    "Apple One": "https://www.techradar.com/news/apple-one-subscription-service-release-date-price-and-news",
    "Google Play Pass": "https://www.techradar.com/news/google-play-pass",
    "Google One": "https://www.techradar.com/news/everything-you-need-to-know-about-google-one",
    "Google Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "won't arrive before 2022": "https://www.techradar.com/news/dont-expect-the-google-pixel-watch-at-the-pixel-6-launch"
  }
}