{
  "source": "https://www.techradar.com/news/oneweb-satellites-could-provide-laser-alternative-to-undersea-cables",
  "title": "OneWeb satellites could provide laser alternative to undersea cables",
  "category": "computing",
  "updated": "2021-03-30T11:38:16Z",
  "author": "steve-mccaskill",
  "summary": "Satellite technology could provide backup in emergency",
  "article": [
    "Satellites operated by OneWeb, the British-based firm part-owned by the UK government, could use its technology to provide an emergency backup to undersea cables in the event of a natural disaster or foreign attack.",
    "Undersea cables were first used in the 19th century to transmit telegrams across oceans and have since provided the foundation for global telephone and internet networks.",
    "There are now hundreds of thousands of miles of these cables across the world, with 380 carrying more than 99.5% of transoceanic data.",
    "The growing importance of connectivity to consumers, businesses and governments means the Ministry of Defence considers these cables to be of key strategic importance and should be protected from any foreign threats.",
    "It’s why the government is building a new Royal Navy surveillance ship to guard undersea communications cables across the world. However, it has been suggested that satellite technology could provide a reliable backup.",
    "Airbus, which builds OneWeb’s Low Earth Orbit (LEO) satellites, has created superfast laser satellite communications that can detect oil spills and map wildfires among other applications. Richard Franklin, the firm’s UK Managing Director of defence and space, told the Mail on Sunday that lasers in space could create an “unjammable backstop” should anything happen to vital undersea cables.",
    "“There's a perceived vulnerability of the very high throughput fibre optic cables,” he is quoted as saying. “How do you create a satellite backbone that could in part create resilience for those? We see that happening through the use of lasers in space.”",
    "When asked about the feasibility of such a plan by TechRadar Pro, OneWeb said the combination of its constellation and laser technology could be used either as an alternative or a backup to cables.",
    "LEO satellites are a significant upgrade from traditional satellite technologies, offering significant advances in speed, connectivity, and latency. This has the potential to transform rural broadband and in-flight Wi-Fi services.",
    "OneWeb has 146 satellites in orbit and hopes to launch a total of 650 – provided it can receive additional funding. The company faced bankruptcy last year before it was rescued through a takeover by Indian telco Bharti Airtel and the Department for Business, Energy, and Industrial Strategy. The government now owns a third of the company after investing £400 million.",
    "The deal has faced significant scrutiny, meaning any additional benefit the government can identify will allow it to justify its intervention in the market.",
    "Via Mail on Sunday"
  ],
  "headers": {
    "3": "UK OneWeb"
  },
  "links": {
    "internet": "https://www.techradar.com/broadband/fibre-broadband-deals",
    "Mail on Sunday": "https://www.thisismoney.co.uk/money/markets/article-9410041/OneWebs-space-lasers-scheme-safeguard-broadband.html"
  }
}