{
  "source": "https://www.techradar.com/news/disney-plus-is-already-close-to-hitting-100-million-subscribers",
  "title": "Disney Plus is already close to hitting 100 million subscribers",
  "category": "entertainment",
  "updated": "2021-02-11T23:34:04Z",
  "author": "nick-pino",
  "summary": "Disney’s streaming service has half of Netflix’s subscriber numbers after just a little over a one year",
  "article": [
    "In just a year and a half since it launched, Disney Plus is already on the verge of reaching 100 million subscribers – half of what Netflix gained in over a decade – in a tenth of the time.",
    "According to Disney, its streaming service now has 94.9 million subscribers around the world, a number the company predicted it would hit sometime in 2024.",
    "That figure was announced today as part of Disney’s 2021 Q1 earnings report where the company said Disney Plus had gained around 8 million new subscribers in just the last two months, since its investor day event held in December.",
    "Part of that, most likely, came from the season finale of The Mandalorian and release of WandaVision, as well as the Disney/Pixar hit, Soul. With more big-budget shows and films just on the horizon, Disney has some strong momentum and is closing the gap to Netflix quickly.",
    "This is a tricky one to answer, but basing it off of popular streaming services the answer is, well, both. More subscribers puts more money into the pockets of the streaming service company, who – more than likely – invests a good portion of that back into content.",
    "More content is, without a doubt, a good thing.",
    "The downside to all this is that, as streaming services get more subscribers, they tend to raise the cost of the service. That’s happened with Netflix repeatedly over the years, and is now happening to Disney Plus – which will soon cost $7.99 per month (£7.99 / AU$11.99) or $79.99 / £79.90 / AU$119.99 per year starting on February 23 in the UK and Australia, and March 26 in the US.",
    "Gaining even more subscribers could tempt Disney into raising the prices again sooner rather than later, especially now that the company has a half-dozen new Star Wars and Disney series in production."
  ],
  "headers": {
    "4": "Are more subscribers a good thing or a bad thing?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}