{
  "source": "https://www.techradar.com/news/psa-super-mario-3d-all-stars-wont-be-available-on-nintendo-switch-after-today",
  "title": "PSA: Super Mario 3D All-Stars won't be available on Nintendo Switch after today",
  "category": "gaming",
  "updated": "2021-03-31T14:20:32Z",
  "author": "samuel-tolbert",
  "summary": "If you haven't bought these Switch games yet, time is running out",
  "article": [
    "Super Mario 3D All-Stars on Nintendo Switch includes ports of Super Mario Sunshine, Super Mario Galaxy and Super Mario 64 in one fun package.",
    "However, if you haven't bought Super Mario 3D All-Stars yet but you still want to, you'll need to move extremely quick. After the end of today (March 31), these games are being pulled from the Nintendo Switch eShop, while additional physical copies of the game will not be produced.",
    "Super Mario 3D All-Stars isn't the only title that will disappear, either. Super Mario Bros. 35 will also be removed the Nintendo Switch eShop, so you might want to grab it before it's gone for good.",
    "If you're looking for a solid explanation as to why this is happening... there really isn't one. Nintendo's comments have been restrained to saying that this was a limited time celebration of Mario's 35th anniversary. As a result, the internet has amusingly started to refer to March 31 as the day Mario dies.",
    "It's worth noting that if you've bought the game digitally, you'll continue to be able to redownload it even after March 31.",
    "Looking ahead to later in the year, more Nintendo remasters are on the way, with The Legend of Zelda: Skyward Sword confirmed with a release date of July 16, 2021. Meanwhile, credible rumors indicate that Wind Waker and Twilight Sword are also being ported to the Nintendo Switch sometime later this year.",
    "Our Super Mario 3D All-Stars review found that while it's a neat collection of titles, the games certainly could've used more polish and refinement to make them more enjoyable on a modern platform."
  ],
  "headers": {
    "3": "Why are they disappearing? Good question"
  },
  "links": {
    "Super Mario 3D All-Stars": "https://www.techradar.com/reviews/super-mario-3d-all-stars",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "The Legend of Zelda: Skyward Sword": "https://www.techradar.com/news/legend-of-zelda-breath-of-the-wild-2-wasnt-announced-but-skyward-sword-hd-is-coming",
    "rumors": "https://www.techradar.com/news/zelda-twilight-princess-and-wind-waker-are-rumored-for-nintendo-switch-in-2021",
    "Super Mario 3D All-Stars review": "https://www.techradar.com/reviews/super-mario-3d-all-stars"
  }
}