{
  "source": "https://www.techradar.com/news/legend-of-zelda-breath-of-the-wild-2-wasnt-announced-but-skyward-sword-hd-is-coming",
  "title": "Legend of Zelda: Breath of the Wild 2 is elusive, but Skyward Sword HD is coming",
  "category": "gaming",
  "updated": "2021-02-18T14:52:46.843Z",
  "author": "david-lumb",
  "summary": "Skyward Sword on Switch is coming July 16",
  "article": [
    "The February Nintendo Direct didn’t have any news about Legend of Zelda: Breath of the Wild 2 – but we did find out that a Wii-era game from the series is coming: Legend of Zelda: Skyward Sword HD is headed to the Nintendo Switch on July 16, and you can preorder it now.",
    "While Twilight Princess was technically the first game in the series to launch on the Wii in 2006 and have motion controls, Skyward Sword followed in 2011 with even more refined and precise gesture inputs using the Wiimote and Nunchuck controllers.",
    "These have been recreated using the Joy-Cons on the Switch (for sword-slashing, shield-blocking, and bow-shooting); in the Switch version’s trailer (below), Zelda producer Eiji Aonuma assured that the controls have been tightened up.",
    "Players can also opt for button-only controls (tilting the right thumbstick will approximate gesture controls), making the game playable for Switch Lite owners...or those who don’t want to deal with motion controls.",
    "As Aonuma pointed out, Skyward Sword was the last mainstream Zelda game to debut on consoles before Breath of the Wild launched with the Switch in early 2017, and several of the game’s signature elements – like sail gliding, item upgrading, and the stamina gauge – actually debuted in Skyward Sword.",
    "Alongside the Skyward Sword HD news, Nintendo announced that Zelda would be gracing the Switch in other ways – physical ways, really, with a new Joy-Con design.",
    "The right Joy-Con has a purple-ish hue modeled after the Master Sword, while the left is a true blue with red accents following the classic Hylian Shield color scheme – which is fitting, given those map to sword-slashing and shield-blocking gesture controls you'll be making in Skyward Sword HD.",
    "The Zelda Joy-Cons come out July 21 just after Skyward Sword HD and, for now, we'll just keep waiting for Breath of the Wild 2 news."
  ],
  "headers": {
    "5": "Still itching for Zelda? How about Zelda Joy-Cons?"
  },
  "links": {
    "Zelda: Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2"
  }
}