{
  "source": "https://www.techradar.com/news/sonic-2-movie-has-cast-its-knuckles-and-were-totally-on-board-with-its-choice",
  "title": "Sonic 2 movie has cast its Knuckles – and we're totally on board with it",
  "category": "entertainment",
  "updated": "2021-08-11T08:57:37Z",
  "author": "tom-power",
  "summary": "Analysis: We echidna not, it's a superb choice",
  "article": [
    "The Sonic the Hedgehog 2 movie has cast its Knuckles – and we, along with the rest of the internet it seems, couldn't be more excited about who will voice the fan favorite echidna.",
    "Taking to his personal social media accounts on August 10, Idris Elba – yes, he of Luther and The Suicide Squad fame – confirmed that he'll voice Knuckles in Paramount Pictures' forthcoming sequel.",
    "Posting an image of one of Knuckles' infamous gloved hands alongside a simple \"knock, knock\" caption, Elba broke the internet as scores of Sonic fans (us included) had our minds simultaneously blown by the reveal.",
    "Check out Elba's tweet below:",
    "Paramount is yet to provide official confirmation on Elba's casting, but we suspect that the actor was given the go-ahead by the studio to make the announcement.",
    "The plot of Sonic 2 is currently unknown but, given that Tails and Knuckles are set to make the live-action-CGI hybrid debuts in the action-adventure sequel, we wouldn't be surprised if it involves the Chaos Emeralds somehow.",
    "Historically, Knuckles is the guardian of the Master Emerald, a massive gemstone that controls all of the other Chaos Emeralds in the Sonic universe.",
    "He made his debut in 1994 video game Sonic the Hedgehog 3, and was one of the title's antagonists after he was tricked by Dr. Eggman (then known as Dr. Robotnik) into fighting Sonic and Tails. Knuckles eventually sees through Dr. Eggman's lies, though, and joins forces with the iconic duo – and they've been friends ever since.",
    "With Jim Carrey's Dr. Eggman still out there in the universe following Sonic the Hedgehog's ending, we suspect that Sonic 3's video game plot will carry over into the forthcoming movie adaptation. That would see Eggman convince Knuckles that Sonic and Tails are after the Chaos Emeralds and lead to some (hopefully) fun set pieces and quips between Knuckles and his temporary foes.",
    "As for Elba, he's an exciting fit for Knuckles. Up until 2001, Knuckles had possessed a higher pitched voice in the three animated productions he co-starred in.",
    "Since Scott Dreier entered the recording booth for the Sonic TV show that ran from 2001 to 2004, though, Knuckles' voice has deepened. More recent Knuckles voice actors – Dan Green and Travis Willingham – have made the character's vocals more gravelly, too.",
    "This certainly plays into Elba's own vocals. As an actor whose voice is on the deeper end of the vocal register, Elba appears to be a perfect fit for a Sonic character who needs a more serious and determined tone compared to his counterparts.",
    "Leaked set images had already revealed that Knuckles would show up in the Sonic the Hedgehog 2 movie, but it's terrific to finally get confirmation on who will voice the character now.",
    "We think Elba is a stellar fit and, if his Bloodsport portrayal in The Suicide Squad is anything to go on, he'll be a brilliant, straight-faced foil to Ben Schwartz's fast-talking, wise-cracking Sonic.",
    "Sonic the Hedgehog 2 is currently set to land in theaters on April 8, 2022."
  ],
  "headers": {},
  "links": {
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-ending-and-post-credits-scene-explained",
    "Leaked set images": "https://twitter.com/DreamcastGuy/status/1384683525949902852"
  }
}