{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-deals-return-to-record-low-prices-at-amazon",
  "title": "Samsung Galaxy Watch deals return to record low prices at Amazon",
  "category": "wearables",
  "updated": "2021-06-09T14:31:56Z",
  "author": "tabitha-baker",
  "summary": "A return to the lowest price yet on the LTE model",
  "article": [
    "Samsung Galaxy Watch 3 deals have been dropping down to some impressive prices over the last few months, but if you missed out on the record low $299 sales price earlier in the year, you've got another chance to scoop up a discount this week. The LTE Samsung Galaxy Watch 3 is now back down to its lowest ever price at just $299.99 (was $449.99). That's particularly compelling, considering this is only the third time we've seen that price this year.",
    "Of course, you can also save on the Bluetooth model if you don't need that extra data contract. However, at $249.99 (was $399.99), this is currently $20 above the cheapest price we've seen in previous Samsung Galaxy Watch deals. That means we'll likely see a slightly larger discount in this year's Prime Day deals, but if you're after a new smartwatch sooner rather than later, this is still excellent value today.",
    "These are record low prices on the LTE models, which means further Samsung Galaxy Watch deals over Prime Day this year will likely only offer an extra few dollars off the final price - if they don't simply repeat this offer, that is.",
    "Not in the US? Scroll down for more Samsung Galaxy Watch prices in your region.",
    "We're rounding up plenty more cheap fitness trackers right here on TechRadar, but you'll also find a range of Fitbit sales and Apple Watch price drops available as well."
  ],
  "headers": {
    "4": "More of today's best Samsung Galaxy Watch deals"
  },
  "links": {
    "$299.99 (was $449.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB089DMR9LD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9040142851936971000-20",
    "$249.99 (was $399.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB089DPMDNM%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3088594873015526400-20",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Samsung Galaxy Watch prices": "https://www.techradar.com/news/the-best-samsung-galaxy-watch-active-prices-and-sales",
    "cheap fitness trackers": "https://www.techradar.com/best/best-cheap-fitness-trackers",
    "Fitbit sales": "https://www.techradar.com/news/cheap-fitbit",
    "Apple Watch price": "https://www.techradar.com/news/cheap-apple-watch-deals"
  }
}