{
  "source": "https://www.techradar.com/news/paypay-announces-a-rise-in-merchant-fees-for-some-transactions",
  "title": "PayPal announces a rise in merchant fees for some transactions",
  "category": "computing",
  "updated": "2021-06-21T13:31:47Z",
  "author": "rob-clymo",
  "summary": "Merchants will pay more from August on Venmo and more",
  "article": [
    "PayPal is set to raise fees for some of its most widely-used products, including digitial payments and Venmo, as it looks to bring them in line with other e-commerce products and services around today.",
    "The changes will mean that US merchants will soon be paying more per transaction, compared to PayPal’s original flat rate system for sellers processing payments.",
    "Previously, merchants were charged a 2.9% of the transaction price fee when sellers processed payments, with a one-off 30-cent fee on top.",
    "From August 2, however, higher rates will be attached to newer PayPal products, including PayPal Checkout and Pay with Venmo.",
    "With around 392 million active accounts the move could prove lucrative for PayPal, while also underlining how it has become a more substantial full-service commerce solution rather than the simple payment processing tool it started out as.",
    "The news was revealed in a blog post from senior VP Dan Leberman, with the company already having started notifying merchant customers of the news, but full details will also be available on the company’s Policy Updates page.",
    "Leberman explained that the move was “to better align our pricing with the value that our products and services provide. Our goal is to be transparent and upfront with our customers about the changes.”",
    "The main changes are as follows:",
    "PayPal Digital Payments: For PayPal payment products (such as PayPal Checkout, Pay with Venmo, PayPal Credit, Pay in 4, PayPal Pay with Rewards, Checkout with crypto), which include Seller Protection on eligible transactions, the rate for online transactions will be 3.49% + $0.491 per transaction. In-person Payments: For PayPal and Venmo QR code transactions over $10, the rate will be 1.90% + $0.10, and for such transactions $10 and under, the rate will be 2.40% + $0.05. For certain in-person debit and credit transactions the rate will be 2.29% + $0.09. Credit and Debit Card payments: Online credit and debit card transactions will be 2.59% + $0.491 per transaction without Chargeback Protection, or 2.99% + $0.49 with Chargeback Protection.",
    "Charity Transactions: Fees for charity transactions will be 1.99% + $0.49 for confirmed charities (subject to application and pre-approval).",
    "Non-standard Pricing: For U.S. merchants who have custom, non-standard pricing, rates will remain unchanged for those services as agreed.",
    "PayPal says that the price rises can be justified by the amount its products and services can benefit merchants - particularly small businesses.",
    "The company says consumers who choose PayPal are 60% more likely to convert and nearly three times as likely to complete a purchase using its services. Similarly, PayPal’s recently announced Buy Now, Pay Later solutions have helped to give a 15% lift in payment volumes for business users.",
    "The company also points out that its revised fee structure still costs less compared to close e-commerce rivals including Stripe and Authorize.net."
  ],
  "headers": {
    "5": "PayPal fees"
  },
  "links": {
    "e-commerce": "https://www.techradar.com/news/best-ecommerce-hosting",
    "processing payments": "https://www.techradar.com/how-to/how-to-take-card-payments-contactless-or-pin-based/best/best-payment-gateways",
    "PayPal Checkout": "https://www.techradar.com/news/internet/web/paypal-speeds-up-online-payments-132367",
    "Venmo": "https://www.techradar.com/best/best-money-transfer-apps",
    "commerce solution": "https://www.techradar.com/best/best-shopping-cart-software",
    "blog post": "https://newsroom.paypal-corp.com/2021-06-18-Upcoming-Changes-for-Some-US-Businesses",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "Authorize.net": "https://www.techradar.com/reviews/authorizenet"
  }
}