{
  "source": "https://www.techradar.com/news/garmin-launches-new-entry-level-running-watch-the-garmin-forerunner-55",
  "title": "New Garmin Forerunner 55 is beginner-friendly but packed with training tools",
  "category": "fitness",
  "updated": "2021-06-02T11:00:00Z",
  "author": "cat-ellis",
  "summary": "Garmin's entry-level GPS watch gets a big boost",
  "article": [
    "Garmin has launched a new entry-level running watch – the Forerunner 55 – with a set of new training tools.",
    "Like the Forerunner 45 before it, the new Garmin is designed for runners of all abilities, and is particularly well suited to anyone investing in their first sports watch, and includes on-board GPS location tracking (a feature missing from many similarly priced fitness trackers).",
    "Many of the Forerunner 55's new features are designed for people aiming to complete their first race, or improve their times. The new PacePro tool helps you adjust your runs to suit a particular course or distance, while the finish time estimator suggests how long it will take you to complete a particular distance without the need to consult a separate app or website.",
    "The Forerunner 45 could track cadence, but the Forerunner 55 can also alert you when you've drifted away from your target cadence to help you maintain good running form and avoid overstriding, which can make you more susceptible to injury.",
    "The new watch also features more advanced recovery tools, and will let you know how long you should rest before your next big training session.",
    "The Forerunner 55 is available now direct from Garmin in aqua, black and white colorways, and costs £179.99 (about $250 / AU$330 ).",
    "Garmin has launched a raft of new watches in recent months, including the women-focused Garmin Lily, the excellent Garmin Venu 2 smartwatch, and the Garmin Approach S42 golf watch.",
    "It's possible that we may soon see another new arrival, too – the long awaited Forerunner 955, a successor to the Forerunner 945, which would sit at the top of the company's line of dedicated running watches. Hints suggesting that such a device may be on the way were discovered in the Garmin app's installation files last year, but so far there's been no sign.",
    "However, with the arrival of the new entry-level watch, we may be about to see a series of new launches as the company releases a new generation of Forerunners covering the entire range.",
    "Garmin isn't in the habit of leaking details of new watches ahead of time, so we'll have to wait and see, but it will be very interesting to see what new features the company could add to what is already an extremely powerful watch."
  ],
  "headers": {
    "6": "What's next?"
  },
  "links": {
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "running watch": "https://www.techradar.com/best/running-watches",
    "45": "https://www.techradar.com/reviews/garmin-forerunner-45",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "direct from Garmin": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4119651905045653000/https://www.garmin.com",
    "Garmin Lily": "https://www.techradar.com/reviews/garmin-lily",
    "Garmin Venu 2": "https://www.techradar.com/reviews/garmin-venu-2",
    "Garmin Approach S42": "https://www.techradar.com/reviews/garmin-approach-s42",
    "golf watch": "https://www.techradar.com/best/best-golf-watch",
    "Forerunner 955": "https://www.techradar.com/reviews/garmin-forerunner-945-review/news/garmin-forerunner-955-could-launch-in-september-new-hints-suggest"
  }
}