{
  "source": "https://www.techradar.com/news/sonys-downscaling-of-japan-studio-is-a-mistake-it-sadly-wont-regret",
  "title": "Sony’s downscaling of Japan Studio is a mistake it sadly won’t regret",
  "category": "gaming",
  "updated": "2021-03-14T12:00:52Z",
  "author": "rhys-wood",
  "summary": "Opinion: the loss of PlayStation’s Japan Studio is a bigger casualty than you might think",
  "article": [
    "Last month, Sony confirmed that Japan Studio, its first-party developer based in Tokyo, is undergoing a reshuffle. Sony elaborated on this in a statement to IGN, saying that Japan Studio will be re-centered around Team ASOBI, who you might know as the developer behind PlayStation 5 launch title Astro’s Playroom.",
    "Japan Studio is responsible for some of the most revered games in PlayStation’s history including Shadow of the Colossus, Ape Escape, Gravity Rush, PaRappa the Rapper and Everybody’s Golf. The studio also co-produced Bloodborne, considered by many to be one of the best PS4 games of all time",
    "Sources told VGC that most of Japan Studio’s staff have already been laid off, leaving behind a skeleton crew of business and localization staff as well as Astro Bot series developer Team ASOBI.",
    "While Team ASOBI’s output has been fantastic (I particularly love Astro Bot Rescue Mission for PSVR) I can’t help but feel like Sony’s first party output will grow far more predictable and far less creative as it focuses more on its Western developed releases.",
    "In fairness, Sony’s decision is perfectly understandable from a business perspective. According to those sources cited on VGC, Japan Studio simply wasn’t profitable enough, and this is unfortunately true.",
    "Gravity Rush 2, while being incredibly well-received, simply failed to meet sales expectations worldwide. The Last Guardian similarly underperformed, despite positive reception. I can totally see why Sony and Japan Studio staff might be frustrated with these results. Great games, unfortunately, don’t necessarily make for great sales.",
    "But therein lies the issue: it’s all too easy for titles to be considered failures by publishers when they fail to sell as well as they’d like. It’s not a sentiment exclusive to Sony, though, as plenty of publishing giants give the impression that they prefer quantity over quality.",
    "Remember when Capcom felt around five million copies sold for Resident Evil 6 wasn’t quite good enough? More recently than that, EA was infamously disappointed when Battlefield 5 sold a more than respectable 7.3 million copies.",
    "Sony itself shut down Studio Liverpool (formerly Psygnosis) in 2012, citing a focus on its “investment plans on other studios that are currently working on exciting new projects.” Sound familiar? This decision at the time effectively axed the Wipeout series, often considered an important cornerstone in British game development history.",
    "These are bigger budget examples, to be sure, but the idea that games have to meet often ludicrous sales targets has trickled all throughout the industry, and it looks like that sentiment isn’t going anywhere soon, as evidenced by the restructuring of Japan Studio and Sony’s alleged comments regarding the developer’s underperformance.",
    "While Japan Studio was never really a household name in the same way that, say, Naughty Dog or Sucker Punch are today, that didn’t stop the developer from pumping out highly polished, incredibly fun games.",
    "I’d actually compare Japan Studio somewhat to Nintendo in its desire to think outside the box (Gravity Rush), experiment with more unique aesthetics and gameplay mechanics (LocoRoco and Patapon), and generally avoid tried-and-true conventions set by triple-A releases (Shadow of the Colossus and The Last Guardian).",
    "Sure, not every game from Japan Studio was a hit, and the company developed the occasional stinker (looking at you, Knack), but the beauty of Japan Studio is that you never really knew what to expect from the company. For me, its games were often a welcome oasis in a desert of samey triple-A open-world character action games, the likes of which are now Sony’s bread and butter.",
    "That’s not to take anything away from the hard work developers put into big-name games like The Last of Us: Part 2, Horizon: Zero Dawn and Ghost of Tsushima. There absolutely should be a space for these games as they consistently sell well, are of an exceptionally high quality and keep the exclusives game locked down for Sony.",
    "These titles are so successful that it’s immensely frustrating that Japan Studio’s output doesn’t always hit desirable sales targets, and as such is deemed to have no place among Sony’s big hitters.",
    "On the contrary, I absolutely think Japan Studio had earned its place. Sure, it was never going to push sales of PS5 consoles, and its games weren’t ever likely to consistently sell in the millions, but it was a valuable ace up Sony’s sleeve regardless.",
    "Was it really that much of a hassle to keep the studio in operation? Japan Studio typically made relatively lower budget titles that by no means were breaking the bank for Sony. Japan Studio helped to greatly diversify Sony’s first party library, and I felt its games perfectly complemented Sony’s triple-A output, feeling much like a fine wine to be enjoyed with a delectable main course.",
    "I hope that Sony won’t abandon the IPs Japan Studio worked on. It would be a massive shame to not see excellent series like Everybody’s Golf and Gravity Rush make appearances on the PS5.",
    "Just the thought of how Gravity Rush’s reality-bending worlds could look and play on PS5 is enough to get me excited. These games don’t need massive audiences - they already have solid cult fan bases that would support and appreciate the output - and considering the consistent success of Sony’s triple-A games, they don’t even need to sell all that well, either.",
    "Microsoft’s approach to supporting its first-party developers has certainly been more admirable. Rare, Obsidian Entertainment and Double Fine Productions aren’t necessarily putting out cutting-edge triple-A gamechangers, but the games those companies make are given adequate budget and time, and will likely enjoy much longer shelf lives thanks to Xbox Game Pass.",
    "Even Nintendo treats its first-party developers with a bit more respect. Xenoblade Chronicles 2 has sold roughly 1.5 million copies to date, which is pretty respectable for its niche. Its developer, Monolith Soft, is now in the driver’s seat developing The Legend of Zelda: Breath of the Wild 2. Instead of letting go of its staff for not selling millions upon millions of copies, it’s now taking the reins on one of the most anticipated upcoming releases in all of gaming.",
    "It just feels like Sony has thrown Japan Studio under the bus. Japan Studio has never enjoyed the opportunity to grow into something greater, and has rarely been afforded the marketing pushes afforded to Sony’s western studios.",
    "Personally, I think it’s a huge missed opportunity in the same vein as the PlayStation Vita. Sony’s neglected handheld console lacked proper marketing and support over the course of its short life. This is in spite of the advantages the device had over the Nintendo 3DS like dual analog sticks, HD handheld gaming long before the release of the Nintendo Switch, and a stunning OLED display that is enviable to this day.",
    "While it’s easy to say Sony might have shot themselves in the foot with the Japan Studio restructure, I ultimately don’t think it will hurt them at all, at least monetarily. Sony will be just fine with its current first-party game strategy, it’s just a huge shame that one of its most creative development studios won’t be around to continue growing and deliver great games that you simply couldn’t get from any other developer.",
    "Rest in peace, Japan Studio. In this world of inflated triple-A budgets and stringent sales targets, your willingness to challenge modern game design tropes in favor of more quirky, unique experiences will be sorely missed."
  ],
  "headers": {
    "4": "Talking business",
    "10": "What made Japan Studio so special?",
    "17": "Sony is failing where other publishers succeed"
  },
  "links": {
    "in a statement to IGN": "https://www.ign.com/articles/playstation-reportedly-downscales-sony-japan-studio",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "Astro’s Playroom": "https://www.techradar.com/news/astros-playroom-will-make-you-fall-in-love-with-the-ps5-dualsense-controller",
    "Shadow of the Colossus": "https://www.techradar.com/news/shadow-of-the-colossus-review",
    "PaRappa the Rapper": "https://www.techradar.com/news/parappa-the-rapper-on-ps4-signals-the-revival-of-playstations-famous-faces",
    "Bloodborne": "https://www.techradar.com/news/games-of-the-generation-bloodborne-is-a-lovecraftian-nightmare-that-will-keep-you-coming-back-for-more",
    "VGC": "https://www.videogameschronicle.com/news/sources-playstation-is-winding-down-sony-japan-studio/",
    "Astro Bot Rescue Mission": "https://www.techradar.com/news/games-of-the-generation-astro-bot-rescue-mission-does-for-vr-what-mario-64-did-for-3d",
    "sales expectations": "https://www.gravityrushcentral.com/2017/02/26/a-closer-look-at-gravity-rush-2s-sales-numbers/",
    "The Last Guardian": "https://www.techradar.com/news/the-last-guardian-review",
    "Resident Evil 6": "https://v1.escapistmagazine.com/news/view/121869-Capcom-is-Disappointed-With-Resident-Evil-6",
    "Battlefield 5": "https://hexus.net/gaming/news/industry/127241-ea-disappointed-73-million-battlefield-v-sales/#:~:text=Behind%20the%20significant%20share%20price,not%20helped%20by%20lowered%20forecasts.",
    "shut down Studio Liverpool": "https://www.eurogamer.net/articles/2012-08-22-sony-closes-wipeout-developer-sony-liverpool-report",
    "The Last of Us: Part 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Horizon: Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "Xenoblade Chronicles 2": "https://www.techradar.com/news/smash-bros-dlc-adds-two-unexpected-characters-that-arent-from-fire-emblem",
    "The Legend of Zelda: Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "PlayStation Vita": "https://www.techradar.com/reviews/gaming/handheld-consoles/ps-vita-1202627/review"
  }
}