{
  "source": "https://www.techradar.com/news/godaddy-update-smbs-no-longer-need-a-website-to-take-online-payments",
  "title": "GoDaddy update: SMBs no longer need a website to take online payments",
  "category": "computing",
  "updated": "2021-08-18T14:42:57Z",
  "author": "abigail-opiah",
  "summary": "GoDaddy is promising no monthly minimums or hidden fees",
  "article": [
    "GoDaddy has released an update for its payments service to help support small businesses without access to an ecommerce solution.",
    "With the new update, small businesses will have the option to take online and remote payments without the requirement of a website or an online store.",
    "GoDaddy notes that businesses using social media as a platform to sell goods and products will be able to use the new Pay Links and Virtual Terminal solutions to take payments, replacing bank transfers, cash transactions or PayPal.",
    "GoDaddy's Pay Links feature lets SMBs create a link or QR code that directs to a secure checkout page, which can be shared with customers via email, social media or text. There is also an option to personalize these pages with images and product logos.",
    "The other new feature, GoDaddy's Virtual Terminal, turns devices with a web browser into a payment terminal, to equip small businesses with the tools to take payments over the phone.",
    "Speaking on the new features, Kasturi Mudulodu, Vice President of Product, said: \"At GoDaddy we understand small businesses need solutions that are flexible and particularly when it comes to commerce, one size rarely fits all.\"",
    "\"Our newest GoDaddy Payments offerings, Pay Links and Virtual Terminal, give small businesses that live and thrive offline the ability to transact online and remotely over-the-phone as well.\"",
    "\"GoDaddy is committed to improving the day-to-day operations of our customers, now enabling businesses both on and offline to sell everywhere and make their customers' experiences as seamless as possible.\"",
    "Housed within the GoDaddy Payments service, both Pay Links and Virtual Terminal support all major credit and debit cards, including Visa, Mastercard, American Express, and Discover."
  ],
  "headers": {
    "3": "Payments for SMBs"
  },
  "links": {
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "payments service": "https://www.techradar.com/news/godaddy-launches-payment-processing-services-for-smbs",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "PayPal": "https://www.techradar.com/reviews/paypal-commerce-platform"
  }
}