{
  "source": "https://www.techradar.com/news/audacity-alternative-abandoned-after-developer-subjected-to-stalking-and-harassment",
  "title": "Audacity alternative abandoned after developer allegedly subjected to stalking and harassment",
  "category": "computing",
  "updated": "2021-07-08T11:37:01.945Z",
  "author": "joel-khalili",
  "summary": "Audacity fork will need to find itself a new chief maintainer",
  "article": [
    "The programmer behind a fork of audio editor Audacity has abandoned the project after receiving a torrent of abuse.",
    "Known by the pseudonym “cookieengineer”, the developer published his Audacity alternative to GitHub earlier this week, amid a backlash against changes to the Audacity privacy policy. The new audio editor, called Tenacity, is built atop Audacity source code and effectively rolls back the software to a build that preceded the controversial changes.",
    "However, a row over the name of the breakaway project appears to have spiralled out of control, with members of anonymous bulletin board 4chan reportedly turning up at the developer’s home to express their disapproval.",
    "“I really thought long about this, and I haven’t slept in two days due to ongoing harassments of 4chan,” wrote cookieengineer in a GitHub post.",
    "“As the first people were literally arriving at my place of living, where they knocked on my doors and windows to scare us, I am hereby officially stepping down as a maintainer of this project. The safety of my family is worth more than an open source project.”",
    "The developer goes on to claim that the intruders were physically violent as well as verbally abusive, even slitting his arm with an illegal butterfly knife. Members of the 4chan community suggest these allegations are not truthful, however, and there is no evidence on the forum to show the developer's address was passed around.",
    "The latest Audacity saga was sparked by changes to the privacy policy made by Muse Group, the new owner. Members of the community worried that the tweaks would give the company carte blanche to gather as much user data as they pleased; some even went as far as to call Audacity “spyware”.",
    "Ever since Muse Group acquired Audacity earlier this year, relations between the company and the open source community have been strained.",
    "First, the software firm had to backtrack on plans to introduce an option to collect telemetry data after a backlash from contributors. The company put the incident down to an error of communication.",
    "Later, Muse Group ruffled feathers with a new Contributor License Agreement (CLA) for Audacity, which contributors were required to sign if they wanted to continue to work on the project. This new agreement also stipulated that Muse Group must be given unrestricted rights to all contributions.",
    "The privacy policy update proved to be the final straw for many frustrated users, ultimately leading to the creation of Tenacity.",
    "Problems arose, however, after cookiengineer disregarded the results of a poll that was supposed to determine the name of the project, but was swayed by an influx of votes from members of the 4chan community.",
    "The initial reaction was to create a second Audacity fork called Sneedacity, which 4chan users felt was the rightful name, based on the poll. A section of the community, however, appears to have taken more extreme action.",
    "The Tenacity developer says an investigation into the harassment is currently ongoing, involving both Github and the German federal police. Meanwhile, a new project maintainer will need to be elected.",
    "Via The Register"
  ],
  "headers": {
    "6": "Audacity controversy"
  },
  "links": {
    "audio editor": "https://www.techradar.com/news/the-best-free-audio-editor",
    "changes to the Audacity privacy policy": "https://www.techradar.com/news/audacity-denies-spyware-claims-but-users-have-had-enough-anyway",
    "GitHub post": "https://github.com/tenacityteam/tenacity/issues/99",
    "new Contributor License Agreement (CLA) for Audacity": "https://github.com/audacity/audacity/discussions/932",
    "The Register": "https://www.theregister.com/2021/07/07/tenacity_maintainer_quits_4chan_harassment/"
  }
}