{
  "source": "https://www.techradar.com/news/gmail-sign-in-page-just-made-one-small-but-signficiant-change",
  "title": "Gmail sign in page just made one small, but signficant change",
  "category": "computing",
  "updated": "2021-07-08T10:06:36Z",
  "author": "mike-moore",
  "summary": "New branding appears on Gmail sign in page",
  "article": [
    "Gmail users may spot a slight difference in how their signing in process is displayed after Google made a minor but potentially very important change to the login page.",
    "The company's email service now displays Google Workspace branding when processing a user's login, rather than the Gmail view previously seen.",
    "As spotted by 9to5Google, the new splash appears on both personal and paid enterprise Gmail accounts - and also on the Gmail for iOS client following a recent app update.",
    "The change is part of the continued transition to Google Workspace across the company's web-based services and tools as it looks to move users to one unified platform.",
    "Formerly known as G Suite, Google Workspace brings together all the company's most popular offerings, including Docs, Sheets, Meet, Drive and of course Gmail, into one place. The company said its impetus behind the decision was to create a more “deeply integrated user experience”, by improving the interoperability of its various productivity software for a more fluid feel.",
    "Competing directly with the likes of Microsoft 365, Google Workspace has also attempted to place itself firmly at the heart of the new hybrid working world, aiming to offer users a more flexible way to collaborate and be productive together.",
    "The company also recently remvoed some of the limits on unpaid accounts, meaning that anyone with a Google account will now have access to the full Google Workspace experience as part of its 'Google Workspace to Everyone' drive.",
    "Unlike Microsoft 365, which requires a subscription, Workspace is now available to anyone with a Google account which means that friends, family or groups of any kind can stay connected, work together and share helpful information from a single place.",
    "And to make working online simpler, Google also recently revealed a new \"smart canvas\" approach, which should mean the various apps and services tie together much more seamlessly, hopefully meaning users aren't constantly hunting around for key parts of information.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "Google Workspace"
  },
  "links": {
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "email": "https://www.techradar.com/news/best-email-provider",
    "Google Workspace": "https://www.techradar.com/news/google-workspace-help",
    "G Suite": "https://www.techradar.com/news/g-suite-gets-massive-overhaul-rebranded-as-google-workspace",
    "some of the limits on unpaid accounts": "https://www.techradar.com/news/google-workspace-update-wants-to-bring-all-your-work-tools-together",
    "new \"smart canvas\" approach": "https://www.techradar.com/news/google-workspace-update-wants-to-bring-all-your-work-tools-together",
    "9to5Google": "https://9to5google.com/2021/07/07/gmail-google-workspace-splash-screen/"
  }
}