{
  "source": "https://www.techradar.com/news/sony-vs-samsung-tv-choosing-the-tv-brand-for-you",
  "title": "Sony vs Samsung TV: choosing the right TV brand for you",
  "category": "televisions",
  "updated": "2021-06-29T10:51:08Z",
  "author": "henry-st-leger",
  "summary": "Spot the difference",
  "article": [
    "Samsung or Sony? If you're considering one of these two top TV brands, then we wouldn't be surprised if you're finding it tricky to decide which one is right for you.",
    "Sony and Samsung are two of the biggest TV brands in the business. That means we wouldn't blame you for thinking they might seem similar. After all, they both offer a mix of 4K and 8K TVs at a number of different price points, right?",
    "But the truth is they're both different. Although most shoppers will probably be happy buying from either, there are distinct differences in terms of which premium technologies they're pushing (OLED vs. QLED), how their sets generate sound, what format support you'll find, their processing strengths, and much more.",
    "Sure, any TV you buy nowadays tends to offer the same basic viewing function. What's more, there's usually not too much of a discrepancy when you're buying on a smaller budget. But individual specs can have a huge impact – and the difference may not be overly apparent when you're skimming product pages for a brand new television.",
    "That's why we've put together this in-depth comparison of Sony and Samsung, to make sure you know what you're getting – or forfeiting – by choosing one over the other.",
    "Of course, there's more work to be done after that. You'll still need to pick a model out of the Sony TV 2021 and Samsung TV 2021 ranges – but it's certainly a good start.",
    "If you're still considering LG TVs, Panasonic TVs, Hisense TVs, or TCL TVs, you may want to read our guide to the best TVs 2021 across all brands instead.",
    "However, if you have your heart set on Samsung or Sony, the guide below will help you to tell the difference between Samsung and Sony televisions and, hopefully, find out which one is right for you.",
    "Before we look at the tech, let's explore the brands. Samsung is a South Korean manufacturer, and by far the largest maker of televisions worldwide, followed next by LG and TCL.",
    "Sony, however, isn't far behind – and the Japanese manufacturer is still a force to contend with.",
    "Sony and Samsung cater to budgets of all sizes, and manufacture everything from 32-inch small TVs through to massive 75-inch screens (with even a few 85-inch models too), with an annual product cycle refreshing most of these sets each year. The majority are 4K TVs, though you can find the odd cheap HD display with either brand. Between them, Sony and Samsung make some of the best TVs on the market.",
    "They sell televisions globally, with presences in both the UK and US – unlike Panasonic or Philips, who don’t have licenses in North America.",
    "Both brands make a lot of consumer products outside of televisions too. You wouldn't have a shiny new PS5 or a PSVR without Sony. Be assured, too, that Sony is making televisions capable of showing off everything the PS5 can do – and both TV makers offer flagship TVs with 8K resolution too.",
    "Sony and Samsung are also fighting over territory in the highly competitive smartphone market: both manufacture Android phones, though we won’t be comparing their handsets in this particular guide. (We have separate pages for the best Sony phones or Samsung phones, if you're interested.)",
    "There tends to be a different smart TV platform for each make of television these days, each with its own unique flavor.",
    "Samsung goes with its Tizen OS for its mid-range and premium televisions. Tizen is fast to navigate and generally uncluttered – with a constantly refreshing 'recent' box that enables you to keep track of your most-used apps. Overall, a pretty competent experience, though the universal search function isn't as accomplished as LG's webOS platform.",
    "Sony, on the other hand, uses Android TV, which offers somewhat more content and menu panes than its competitor. It's a bit more cluttered, but that also means there's more at your fingertips to choose from. It's really up to your preference – though Android TV is also known to be slightly buggier and prone to crashes than other smart TV platforms.",
    "But what of voice assistants? Advanced Sony TVs will come with Google Assistant integration – which makes sense, given Android TV is a Google-developed platform.",
    "However, Sony has now added an Amazon Alexa Music, Cameras and TV Control app to its more recent TVs, and some mid-range models from previous years. This will let you control third-party smart home products and speakers through some basic Alexa capability – like the Amazon Echo, or Ring security cameras – and use Alexa voice commands for the TV's power and volume functions.",
    "Samsung's Bixby voice assistant can be found on mid-range sets and above, though it's known to lag behind Alexa or Google Assistant in terms of smarts or voice recognition. However, it's more than enough for the minimal TV controls you're likely to be using Bixby for – and you can always link up your television with an Alexa speaker if you really want to.",
    "Today’s premium television market is divided into two panel technologies: OLED and QLED (basically an LED-LCD screen with quantum dots).",
    "QLED is only really used in Samsung TVs and the brand has been pushing its QLED screens for a few years now, which are known for their bright 1,000-2,000 nit screens, enabling vivid HDR scenes and high impact TV images.",
    "They're certainly a lot brighter than the OLED (organic LED) displays used by Sony for its high-end sets, which struggle to get brighter than around 800 nits – though it's not quite a fair comparison.",
    "While OLED screens tend to be dimmer, they achieve a much more natural color contrast, given the organic film used in production. OLED displays are also self-emissive, meaning that each individual pixel emits its own light, allowing for incredibly precise control of light and darkness across the screen. Blacks really look like blacks, and while overall brightness suffers, the bright sections also don't bleed into surrounding areas of the screen (as is often the case with LED).",
    "There’s often talk of ‘burn in’ images on OLED screens, but much of this is anecdotal, and you’d probably need to be working the set very hard for this to become a problem.",
    "We’ve gone into this debate in more detail in our QLED vs OLED guide, though for now it’ll be enough to say that OLED is generally suited to high-quality video formats in dark viewing environments, while Samsung’s sets lag on contrast (comparatively) but make up for it with a bright and impactful display. Keep in mind though, both are highly impressive premium panel technologies, and most people will be very happy with either.",
    "If you're buying a mid-range television up to one of the top-of-the-line sets, it will likely come with support for high dynamic range (HDR), but you may not realise that HDR comes in several different forms.",
    "There's a base HDR10 format supported on every HDR TV – which has a wider color gamut and improved contrast compared to regular SDR television. Most TV content these days is still in SDR, but more movies, shows and programmes are made in HDR every year.",
    "But beyond that are two HDR formats that add 'dynamic metadata' to improve TV images by altering the TV's picture settings depending on the scene you're watching and the kinds of images onscreen.",
    "The first was Dolby Vision, which is backed by Sony as well as LG, and found in TVs across Vizeo, TCL, and Hisense among others. Then there's HDR10+, which is backed by Samsung and Panasonic – though the latter has now pivoted to offer both formats on its mid-range and premium TVs.",
    "The quick version? Samsung TVs have HDR10+, and Sony TVs have Dolby Vision.",
    "Dolby Vision is really the more advanced format, with 12-bit color gamut instead of the 10-bit HDR10+, and is also more commonly found (both the Google Chromecast with Google TV and Apple TV 4K take advantage of Dolby Vision).",
    "Admittedly, preferred HDR format is only really a concern at the higher end of the price range, but those spending big should think carefully about which services they’re likely to want HDR content on.",
    "Sony and Samsung are also increasingly at loggerheads over the best solutions for built-in audio.",
    "Sony has been shipping sets with its Acoustic Surface Audio technology for a few years now, which vibrates the TV panel itself to emit sound. It sounds like a smart solution on the surface, though glass isn't usually the best material for channeling audio – and the sound can be somewhat imprecise. Nonetheless, you'll find it in most of Sony's premium television lineup these days.",
    "Samsung’s rival TV sound system is OTS (Object Tracking Sound), which, like Acoustic Surface Audio, adds directionality to onscreen movement. It uses software allied to tiny conventional drivers to achieve the effect.",
    "These features are very much at the premium end, though – largely for 8K QLEDs for Samsung and 4K OLEDs for Sony – and there's far less difference between the TV brands' average 20W speakers at the mid-range.",
    "For more, read our Sony Acoustic Surface Audio vs Samsung OTS guide.",
    "Not sure on either? Both Sony and Samsung are capable mainstream TV makers, and you're unlikely to get screwed over by a purchase from one or the other. Most of our complaints for Sony and Samsung's premiums sets gear around format support – the picture quality is generally brilliant either way. And if you're committed to Dolby Vision or HDR10+ as an HDR format, that may well make your decision for you.",
    "Samsung's QLED sets will go big on brightness, and if you're more of a daytime viewer than a huddle-in-the-dark cinephile, the brighter displays may be more what you're after. Otherwise Sony's OLEDs will offer a crisp picture with incredible contrast more suited to your late night movie sessions.",
    "It's worth noting that Samsung's 2019 QLEDs brought in a new Ultra Viewing Angle technology, making for vastly improved off-axis viewing. Sony on the other hand is usually pretty competent at upscaling from low-resolution sources, and motion handling in fast-moving shots.",
    "Samsung sets will also generally be a bit cheaper for what they offer – hence how Samsung managed to overtake Sony despite being something of an upstart in the TV market not too long ago. OLEDs especially will cost more than an equivalent QLED, even if that could change in the coming years.",
    "And while Sony tends to play around with TV casings and stand design more than most – with some ill-advised tilted screens, like the otherwise incredible AF9 OLED – it has come back to its senses since then. The A8H is a brilliant mid-range OLED new for 2020, and its towering A9G OLED has now got a 48-inch size that brings in within reach of more reasonable budgets.",
    "Samsung's push in 2020 is towards 8K TVs, with the Q800T, Q900T, and Q950TS all offering high-end 8K pictures – though that means its flagship 4K set, the Q95T, doesn't benefit from the latest processing, as its the 8K models that get the goods.",
    "So, is Sony or Samsung for you? Here are some TV deals from both manufacturers that you might want to choose between:"
  ],
  "headers": {
    "8": "Sony vs Samsung TV: overview",
    "14": "Smart TV: Tizen vs Android TV",
    "20": "QLED or OLED?",
    "26": "Dolby Vision vs HDR10+",
    "33": "OTS vs Acoustic Surface Audio",
    "38": "Samsung vs Sony TV: which should you choose?"
  },
  "links": {
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Sony TV 2021": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "Samsung TV 2021": "https://www.techradar.com/news/best-samsung-tv",
    "LG TVs": "https://www.techradar.com/news/lg-tv-2021",
    "Panasonic TVs": "https://www.techradar.com/news/panasonic-tv-2021",
    "Hisense TVs": "https://www.techradar.com/news/new-hisense-tv-2021",
    "TCL TVs": "https://www.techradar.com/news/tcl-tv-catalog-2019",
    "best TVs 2021": "https://www.techradar.com/news/best-tv-uk",
    "small TVs": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660",
    "75-inch screens": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "85-inch models": "https://www.techradar.com/news/sonys-stunning-85-inch-8k-tv-headlines-its-new-master-series-range",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "best TV": "https://www.techradar.com/news/best-tv",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Android phones": "https://www.google.com/search?q=lg+samsung+phone+techradar&oq=lg+samsung+phone+techradar&aqs=chrome..69i57.4056j0j7&sourceid=chrome&ie=UTF-8",
    "Sony phones": "https://www.techradar.com/news/best-sony-phones",
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Advanced Sony TVs will come with Google Assistant integration": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Bixby voice assistant": "https://www.techradar.com/how-to/what-is-bixby-our-guide-to-samsungs-voice-assistant",
    "QLED vs OLED": "https://www.techradar.com/news/oled-vs-qled",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Google Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Sony Acoustic Surface Audio vs Samsung OTS": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "if that could change in the coming years": "https://www.techradar.com/news/you-should-wait-until-2020-to-buy-a-cheaper-oled",
    "AF9 OLED": "https://www.techradar.com/news/you-should-wait-until-2020-to-buy-a-cheaper-oled"
  }
}