{
  "source": "https://www.techradar.com/news/lenovo-leaks-new-amd-ryzen-5000-pro-apus-and-reveals-specs",
  "title": "Lenovo leaks new AMD Ryzen 5000 Pro APUs and reveals specs",
  "category": "computing",
  "updated": "2021-03-04T21:39:10Z",
  "author": "john-loeffler",
  "summary": "Ryzen 5000 Pro APUs may be coming to Lenovo enterprise laptops",
  "article": [
    "An update to a Lenovo product page reportedly reveals that two unreleased AMD Ryzen 5000 Pro-series APUs will be making their way to Lenovo ThinkPad laptops soon.",
    "A Lenovo ThinkPad P14 spec page lists both the Ryzen 5 Pro 5650U and Ryzen 7 Pro 5850U, suggesting that the two SKUs are definitely on their way to Lenovo business laptops this year after several leaked benchmarks hinted at their imminent release and an HP product page confirmed the SKUs existed. There hasn't been an official announcement from AMD about the release, though, so it's possible it could just be a placeholder.",
    "The product page also gives us some details about the specs of the chips themselves. The Ryzen 7 Pro 5850U is an eight-core, 16-thread CPU with a base clock of 2.0GHz, with a Boost clock of 4.4GHz and a 12MB cache. The Ryzen 5 Pro 5650U is a six-core, 12-thread CPU with a higher base clock of 2.2GHz, but as lower boost frequency of 4.2GHz, and comes with an 11MB cache. Both processors have a 10W to 25W TDP and AMD Radeon integrated graphics.",
    "The P14s spec page doesn't answer every question, as Wccftech notes. We don't know much about the Radeon GPU in these latest Pro series chip, including how many GPU cores it'll have. There also isn't a release date, but now that AMD's Radeon RX 6700 XT is official, hopefully we'll get more news on these rumored APUs.",
    "Now that AMD has caught up to Intel in desktop processor market share, it likely won't be long before AMD starts to pivot more of its focus towards the mobile computing market, where Intel still enjoys a dominant market position.",
    "With the growth of mobile computing only expected to soar in the years ahead, desktop hardware is going to become less relevant to the business workforce, where mobility is going to be increasingly important in the post-pandemic era where a mix of work-from-home and office use is going to be more of the norm than it was only a year ago.",
    "We're starting to see more AMD processors in business laptops, like the outstanding Lenovo ThinkPad C13 Yoga Chromebook, so it'll be interesting to see how well AMD's latest business-centered processors fare against Intel's Evo platform in the enterprise space."
  ],
  "headers": {
    "4": "AMD Ryzen Pro series release should challenge Intel's mobile computing dominance"
  },
  "links": {
    "Lenovo ThinkPad P14 spec page": "https://thinkstation-specs.com/thinkpad/p14s-gen-2-amd/",
    "Wccftech": "https://wccftech.com/lenovo-confirms-two-unreleased-amd-ryzen-5000-pro-series-apus-and-lists-the-specifications/",
    "Radeon RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "caught up": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years",
    "Lenovo ThinkPad C13 Yoga Chromebook": "https://www.techradar.com/reviews/lenovo-thinkpad-c13-yoga-chromebook"
  }
}