{
  "source": "https://www.techradar.com/news/the-microsoft-store-in-windows-11-already-has-tiktok-and-obs-available-to-download",
  "title": "The Microsoft Store in Windows 11 already has TikTok and OBS available to download",
  "category": "computing",
  "updated": "2021-07-01T09:00:51Z",
  "author": "daryl-baxter",
  "summary": "Store now open for business",
  "article": [
    "One of the big surprises from Windows 11 was the complete redesign of the Microsoft Store and the relaxed restrictions of apps that can now be downloaded from it, and it has resulted in some great new apps appearing..",
    "The Microsoft Store has become something of an epitome of abandonware, with confused rules for users and confused guidelines for developers since its appearance in Windows 8.",
    "However, the store is finally seeing a redesign, making it much easier for users to find their apps in one place rather than having to perform multiple searches from their web browser.",
    "The start of this store relaunch is already occurring, even before Windows 11 is officially released to everyone publicly, with well-known apps already available on the new store.",
    "With a renewed focus on making the store available for everyone, this now means that not just Win32 apps can be downloaded. From web apps, to UWP, to React Native, and even Android’s APK apps will be available once Windows 11 launches later this year.",
    "Now, Zoom, Canva, TikTok and OBS Studio are available on the store, ready to download either from the app or from the web through the ‘pop-up’ store, another feature of the redesign if you’re away from your Windows 11 device.",
    "Even with the release date of Windows 11 rumored to be in October, it’s encouraging to see developers be enthusiastic towards the new store, enabling users to make it much easier to find and download apps.",
    "While the new store isn’t available on Windows 10, you can try out the Insider release at your discretion to see just what else is available on the store.",
    "Via Windows Latest"
  ],
  "headers": {
    "4": "What’s in the Store?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "try out the Insider release": "https://www.techradar.com/news/how-to-download-windows-11",
    "Windows Latest": "https://www.windowslatest.com/2021/06/29/windows-11-store-gets-obs-studio-canva-after-microsoft-policy-change/"
  }
}