{
  "source": "https://www.techradar.com/news/these-oled-tv-deals-are-slashing-prices-on-one-of-the-best-displays-on-the-market",
  "title": "These OLED TV deals are slashing prices on one of the best displays on the market",
  "category": "televisions",
  "updated": "2021-01-27T14:37:43Z",
  "author": "tabitha-baker",
  "summary": "The top dog takes a price drop",
  "article": [
    "OLED TV deals are dropping to some of their lowest prices yet this week, as retailers in both the US and UK offer up further discounts on the hugely popular LG CX OLED display. With excellent image quality, a super-fast refresh rate, and that crucial HDMI 2.1 port for next-gen gaming, it's easy to see why this display has exploded in popularity over the last few months, and you can get your hands on one of the best TVs on the market for less right now.",
    "In the US, Amazon is your best bet for finding the best OLED TV deals this week. The 55-inch LG CX has just hit $1,396.99 (was $1,699.99), knocking an extra $3 off the usual $1,399 sales price. Best Buy isn't quite there yet - still offering the display for $1,399.99, but if Amazon's stock runs low, you've got a second option as well.",
    "Over in the UK, AO has the best price going this week. We'd usually see this model on sale for £1,299, but you'll find it available for just £1,288 this week. Considering other retailers have already put their price back up to £1,399, we'd move quickly on this one.",
    "You'll find both of these OLED TV deals just below, with more offers available further down the page as well.",
    "LG's line of OLED TVs continues to be one of the more affordable options for those after premium displays without breaking $2,000 / £2,000. While the larger devices do tend to steer towards those lofty price heights, the 55-inch model has proven itself as the sweet spot between price and quality. The Alpha 9 Gen 3 processor, 3840 x 2160 resolution, Nvidia G-Sync, HDMI 2.1 and 120Hz refresh rate all make for an incredibly high quality package - perfect for cinema level streaming and ultra-fast gaming.",
    "If you're working with a slightly smaller budget, you'll find plenty of cheap TV deals up for grabs right now. Or, get prepared for the upcoming Presidents Day sales with early deals dropping on a range of products right now."
  ],
  "headers": {
    "4": "Today's best OLED TV deals",
    "5": "More OLED TV deals"
  },
  "links": {
    "$1,396.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0829RYP8V%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3241656444255868400-20",
    "offering the display for $1,399.99": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-8052226699418972000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Flg-55-class-cx-series-oled-4k-uhd-smart-webos-tv%2F6401851.p&article_name=These%20OLED%20TV%20deals%20are%20slashing%20prices%20on%20one%20of%20the%20best%20displays%20on%20the%20market&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthese-oled-tv-deals-are-slashing-prices-on-one-of-the-best-displays-on-the-market",
    "available for just £1,288 this week": "https://www.awin1.com/awclick.php?awinmid=19526&awinaffid=103504&clickref=trd-us-2712119497739361000&p=https%3A%2F%2Fao.com%2Fproduct%2Foled55cx5lb-lg-tv-silver-79559-108.aspx",
    "OLED TV deals": "https://www.techradar.com/deals/best-oled-tv-prices-deals",
    "cheap TV deals": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales",
    "Presidents Day sales": "https://www.techradar.com/news/presidents-day-sales-deals-2021"
  }
}