{
  "source": "https://www.techradar.com/news/my-favorite-board-game-is-on-sale-for-black-friday-and-i-highly-recommend-you-buy-it",
  "title": "My favorite board game is on sale for Black Friday and I highly recommend you buy it",
  "category": "gaming",
  "updated": "2021-11-26T18:30:41Z",
  "author": "nick-pino",
  "summary": "Opinion: The best board game at the best price? Looks that way to me",
  "article": [
    "Black Friday has already seen a slew of awesome board game deals: yesterday, GameStop announced that over 1,100 board games and puzzles would be on sale today while Amazon and Target also lowered their prices this weekend as well.",
    "Among all the deals out there today, though, one stands above the rest – and that’s Gloomhaven by Cephalofair Games at Amazon.",
    "Often priced at more than $100 / £100 / AU$190, this massive boxed set contains an entire world of character classes, quests, items and random encounters that make you feel like you’re in the most well-orchestrated of D&D games without requiring one person to play DM.",
    "It’s honestly my favorite board game of all-time, and at just $85 / £75 (around AU$119, but it isn't on sale in Australia), I highly recommend you give it a shot.",
    "(Not in the US or UK? Keep scrolling to see the deals in your region.)",
    "Gloomhaven is a cooperative game for one to four players where you explore the world in search of gold and glory – you know, traditional RPG stuff. What makes Gloomhaven better than your average RPG are the unlockables inside the box. Better items, weapons and characters unlock as you advance through the story, and your actions truly shape how the world turns out and how your party is treated.",
    "D&D minus the DM? Sign us up.",
    "Not in the US and UK but still want to try this awesome board game? Here are the best deals in your region:"
  ],
  "headers": {
    "7": "Here are the best Gloomhaven deals happening right now",
    "8": "Looking for more Black Friday deals? We've got them"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "on sale": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com.au%2FCephalofair-Games-Gloomhaven-Revised-Discontinued%2Fdp%2FB01LZXVN4P%2Fref%3Dsr_1_2%3Fkeywords%3Dgloomhaven%26qid%3D1637951148%26s%3Dtoys%26sr%3D1-2%26th%3D1%26tag%3Dhawk-future-22%26ascsubtag%3Dtrd-us-1380526453397829600-22"
  }
}