{
  "source": "https://www.techradar.com/news/facebook-just-made-a-major-contribution-to-open-source",
  "title": "Facebook just made a major contribution to open source",
  "category": "computing",
  "updated": "2021-09-01T12:05:57Z",
  "author": "mayank-sharma",
  "summary": "Expect major developments in the next few months, says project leader",
  "article": [
    "Facebook has announced that it’s transferring the already open-sourced Ent project, an entity framework for the Go programming language, to the Linux Foundation.",
    "Ent was conceptualized at Facebook as a means to streamline the process of building and maintaining applications that involve large data-models, and was released under the Apache license in 2019.",
    "After fostering Ent’s community for a couple of years, Facebook has now decided to move the project under the governance of the vendor-neutral Linux Foundation.",
    "“With the move to the Linux Foundation’s neutral governance model, we (on behalf of myself and the rest of the Ent maintainers) hope to double-down on growing Ent into the industry standard for data-access in Go,” said Ariel Mashraki, Ent’s creator and lead maintainer.",
    "Created by the Facebook Connectivity team, Ent was reportedly inspired by an entity framework that’s used internally at Facebook.",
    "Since the project was open-sourced, leading technology companies such as GitHub, Mail.ru, Scaleway, and others, have contributed code to Ent, together with Facebook. Besides these companies, various open source projects and groups such as the Linux Foundation’s Cloud Native Computing Foundation (CNCF) have rolled Ent into their development assembly line.",
    "That it isn’t surprising says Mashraki given that Ent offers a “unique and compelling value proposition” to companies with complex technology stacks as it lends itself to various use cases.",
    "“This additional step of enabling open source contributors to take direct ownership of a project’s technical vision is part of our longstanding commitment to open and sustainable innovation,” said Michael Cheng, product manager at Facebook.",
    "Mashraki, who’s recently launched a company that'll create a data fabric solutions provider built on Ent, expects to see a lot of “exciting developments” over the next six months from the project.",
    "Via VentureBeat"
  ],
  "headers": {
    "4": "Unique value proposition"
  },
  "links": {
    "open-sourced": "https://www.techradar.com/best/best-open-source-software",
    "Linux Foundation": "https://www.techradar.com/news/the-linux-kernel-may-not-be-quite-as-secure-as-it-should-be",
    "move the project": "https://www.linuxfoundation.org/press-release/ent-joins-the-linux-foundation/",
    "VentureBeat": "https://venturebeat.com/2021/08/31/facebook-contributes-ent-project-to-the-linux-foundation/"
  }
}