{
  "source": "https://www.techradar.com/news/amd-ryzen-9-5900-and-ryzen-7-5800-cpus-could-be-inbound-but-only-in-prebuilt-pcs",
  "title": "AMD Ryzen 9 5900 and Ryzen 7 5800 CPUs could be inbound – but only in prebuilt PCs",
  "category": "computing",
  "updated": "2021-01-10T11:12:56Z",
  "author": "darren-allan",
  "summary": "Rumor has it that these chips will only be supplied to OEMs – and not sold directly to consumers",
  "article": [
    "AMD’s Ryzen 9 5900 and Ryzen 7 5800 are purportedly waiting in the wings, and rumored specs of these processors have been shared – although the chips will apparently only be sold to PC system builders.",
    "The CPUs have been rumored before, and now one of Twitter’s regular hardware leakers, @momomo_us, has tweeted some details of the processors which as ever must be treated with a healthy amount of caution.",
    "Theoretically, then, the Ryzen 9 5900 will be a 12-core CPU with 64MB of L3 cache, alongside 2MB of L2 cache. As Wccftech observes, this chip could have a base clock speed of 3GHz with boost running up to 4.7GHz, but that’s where a hefty pinch of salt needs to come in (in terms of whether this is the final spec, even if the leak is genuine).",
    "The vanilla 5900 will supposedly have a TDP of 65W, which is considerably leaner than the 105W TDP of the existing 5900X (so clock speeds would be slower as a result – the latter has a base clock of 3.7GHz for comparison, and boost to 4.8GHz).",
    "As for the purported Ryzen 7 5800, that’s shaping up to be an 8-core chip with 32MB of L3 cache, plus 4MB of L2 cache, and a base clock of 3.4GHz with boost to 4.6GHz (compared to 3.8GHz and 4.7GHz respectively for the existing 5800X). The TDP will again be 65W compared to 105W for the ‘X’ version of the chip.",
    "In short, performance should be fairly close to the existing 5900X and 5800X, although not quite there – the benefits being less power consumption, and of course a cheaper asking price. As a result, this pair of AMD CPUs could represent a tempting prospect in terms of value proposition.",
    "However, remember that the rumor mill contends that these chips are just going to be supplied to system builders, so consumers won’t be able to buy them off the shelves. You will only be able to get hold of one of these pieces of silicon as part of a prebuilt PC.",
    "Of course, some of the Ryzen 5000 CPUs which are already out there are still difficult to buy, anyway – even though they’re available for standalone purchase in theory – simply due to stock issues. Although some of those inventory problems are easing, at least going by the latest we’ve heard from one major European retailer."
  ],
  "headers": {
    "5": "Close enough"
  },
  "links": {
    "Wccftech": "https://wccftech.com/amd-ryzen-9-5900-12-core-ryzen-7-5800-8-core-zen-3-65w-desktop-cpu-specifications-leak-out/",
    "AMD CPUs": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Ryzen 5000 CPUs": "https://www.techradar.com/news/amd-ryzen-5000",
    "some of those inventory problems are easing": "https://www.techradar.com/news/amd-cpu-sales-get-even-stronger-as-ryzen-5000-stock-issues-ease"
  }
}