{
  "source": "https://www.techradar.com/news/xiaomis-newest-cheap-phone-has-a-huge-battery-and-5g-but-little-else-in-its-favor",
  "title": "Xiaomi's newest cheap phone has a huge battery and 5G but little else in its favor",
  "category": "phones",
  "updated": "2021-05-19T12:30:26Z",
  "author": "tom-bedford",
  "summary": "The Poco M3 Pro 5G",
  "article": [
    "If you love keeping tabs on all the cheap phones that Xiaomi puts out - a task that's basically a full-time job at this point - we've got another for your list, as the new Poco M3 Pro 5G has been unveiled.",
    "This new Xiaomi phone has been confirmed for the UK, with a 'late June' release date and no price attached so far. It's the first Poco M series phone to hit the chalky shores, with previously only the F- and X- lines available.",
    "This follows the Poco F3 and Poco X3 Pro release very recently, and other low-cost Xiaomi phones like the Mi 11 Lite 5G, Redmi Note 10 Pro and Redmi Note 9T launched earlier in the year.",
    "We'll run you through the specs below, and will test out the phone for a full review when we can. The specs list doesn't show any huge selling points, other than a fairly big battery and 5G compatibility, but when we hear a final price we'll be better placed to judge the device.",
    "The Xiaomi Poco M3 Pro 5G uses the MediaTek Dimensity 700 chipset we've already seen in phones like the Oppo A55 and Realme 8, which promises mid-tier power. It's paired with 4GB or 6GB of RAM depending on which version of the phone you opt for. As the name suggests, the device is 5G-enabled, though at this point there are plenty of cheap phones that are.",
    "There's a 48MP main camera joined by a 2MP depth-sensing and 2MP macro snapper; round the front there's an 8MP camera.",
    "The screen is 6.5 inches across, with a 90Hz refresh rate and a 1080 x 2400 resolution. It's broken up by a punch-hole cut-out at the top.",
    "You'll find a big battery in the Poco M3 Pro, at 5,000mAh. It charges at 18W, though curiously the in-box charger supports up to 22.5W. There's a 3.5mm headphone jack too.",
    "One potential selling point is the phone's appearance, as its two-tone design might appeal to some. Our eyes were drawn to the yellow version of the handset, though there's also a black or blue option.",
    "We'll have to wait for a final word on the phone's price, and some hands-on time, to see if it's worth your money or not. The specs list isn't particularly inspirational, but if the phone has a low enough price it could be a winner."
  ],
  "headers": {
    "4": "Xiaomi Poco M3 Pro 5G specs"
  },
  "links": {
    "cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "Poco F3": "https://www.techradar.com/reviews/xiaomi-poco-f3",
    "Poco X3 Pro": "https://www.techradar.com/reviews/xiaomi-poco-x3-pro",
    "Mi 11 Lite 5G": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "Redmi Note 9T": "https://www.techradar.com/reviews/xiaomi-redmi-note-9t-review"
  }
}