{
  "source": "https://www.techradar.com/news/apple-watch-7s-bigger-screen-just-how-does-it-compare-to-older-apple-watches",
  "title": "Apple Watch 7's bigger screen: just how does it compare to older Apple Watches?",
  "category": "wearables",
  "updated": "2021-10-15T16:04:02Z",
  "author": "james-rogerson",
  "summary": "20% makes all the difference",
  "article": [
    "One of the headline upgrades on the Apple Watch 7 is its larger screen, which is roughly 20% bigger than on the Apple Watch 6. That’s achieved through a slightly larger body (41mm or 45mm compared to 40mm or 44mm) coupled with much smaller bezels of just 1.7mm.",
    "So although the Apple Watch 7 is larger on your wrist than the equivalent Apple Watch 6, we found in our Apple Watch 7 review that the difference is negligible, while the screen itself is quite a lot bigger here.",
    "This makes the display on the Apple Watch 7 easier to interact with, since it’s less cramped. In fact, it’s big enough for a full (albeit tiny) QWERTY keyboard.",
    "To give you a better idea of how the screens on these two wearables compare, we’ve put them side by side so you can see for yourself. You can see the 45mm Apple Watch 7 on the left, and the 44mm Apple Watch 6 on the right.",
    "As you can see, the screen on the Apple Watch 7 isn’t just easier to operate, it’s also - thanks to the smaller bezels - more attractive, since no one likes bezels. With a black background they’re not always super obvious on the Apple Watch 6, but on the Apple Watch 7 they’re barely even present.",
    "This comparison holds true for the Apple Watch SE as well, as that's the same size as the Apple Watch 6.",
    "The difference is even more pronounced compared to the Apple Watch 3, which is still on sale. The Apple Watch 7 has a display that’s over 50% larger than that watch. In fairness, the Apple Watch 3 is a substantially more compact device, with either a 38mm or 42mm body, but it also has far bigger bezels, as you can see in the picture below.",
    "With its huge bezels and square shape, the Apple Watch 3 looks enormously dated compared to the new model, and its screen is significantly more cramped.",
    "So coming from the Apple Watch 3, the Apple Watch 7 is a huge upgrade on this front, and even compared to the Apple Watch 6 it’s quite a substantial change, which is a good thing too, because there aren’t all that many other significant differences between these two wearables."
  ],
  "headers": {},
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch 7 review": "https://www.techradar.com/reviews/apple-watch-7",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review"
  }
}