{
  "source": "https://www.techradar.com/news/twitter-might-soon-start-sending-out-email-newsletters",
  "title": "Twitter might soon start sending out email newsletters",
  "category": "computing",
  "updated": "2021-01-26T18:27:44Z",
  "author": "anthony-spadafora",
  "summary": "Revue acquisition will bring editorial newsletters to the social network",
  "article": [
    "As writers and other content creators often turn to Twitter to promote their work, the social network has announced that it has acquired the editorial newsletter tool Revue to help them grow and better connect with their audience on its platform.",
    "Revue offers both a free and paid service that allows anyone to publish editorial newsletters. The acquisition will allow Twitter to accelerate its work of helping people stay informed about their interests while also giving all types of writers a way to monetize their audience.",
    "With Revue writers can quickly and easily compose newsletters and the service even allows them to drag links, videos, Tweets and other media into an issue.",
    "Through its acquisition of Revue, Twitter aims to make it easier for writers to connect with their subscribers while also helping readers better discover new writers and their content.",
    "The company is already planning several ways to achieve this such as by allowing users to sign up for newsletters right from their favorite follows to adding new settings for writers to host conversations with their subscribers.",
    "Twitter is also creating a durable incentive model through paid newsletters. By bringing Revue to its platform, writers will be able to grow their paid subscribers while at the same time being incentivized to produce engaging and relevant content to drive conversations on Twitter. Audience-based monetization is an area the company plans to continue to develop with Revue going forward.",
    "Finally, Twitter is making Revue's Pro features free for all accounts and lowering the paid newsletter fee to five percent. The company will continue to invest in Revue as a standalone service and its team will remain focused on improving how writers create newsletters, build their audience and get paid for their work."
  ],
  "headers": {
    "3": "Revue acquisition"
  },
  "links": {
    "Twitter": "https://www.techradar.com/news/twitter-acquires-podcasting-app-breaker-in-order-to-focus-on-social-audio",
    "newsletters": "https://www.techradar.com/news/substack-wants-to-help-liven-up-your-boring-newsletters"
  }
}