{
  "source": "https://www.techradar.com/news/amd-ryzen-pro-5000-mobile-chips-bring-zen-3-power-to-business-users-at-last",
  "title": "AMD Ryzen Pro 5000 Mobile chips bring Zen 3 power to business users at last",
  "category": "computing",
  "updated": "2021-03-16T15:43:35Z",
  "author": "mayank-sharma",
  "summary": "Laptops based on AMD Ryzen Pro 5000 processors will be available later this year",
  "article": [
    "AMD has announced a new line of Zen 3 processors based on the Ryzen 5000 series designed specifically to cater to business users.",
    "The R7 5850U, R5 5650U, and R3 5450U Mobile processors come with an extra dollop of security and stability features to make them more enticing to business users. Besides the business-centric features, the new processors don’t get any performance advantages over the non-Pro Cezanne processors.",
    "An AMD spokesperson confirmed to TechRadar Pro that the “performance between R7 PRO 5850U and R7 5800U is comparable and any difference in performance is due to natural variation in the products.\"",
    "All Pro processors feature the same number of up to eight cores and sixteen threads as their non-Pro customer variants. Furthermore, both families of processors have the same base and boost frequencies.",
    "The only advantage of the Pro processors are the features for business users. Security features are one of the noteworthy additions that are highlighted by AMD. The PRO processors come equipped with AMD’s Shadow Stack technology, which adds protection against malware directly into the hardware.",
    "AMD also extends two years of guaranteed processor availability for the Pro processors and they also get AMD Memory Guard that’s enabled by default on all secured-core Windows devices.",
    "“The new AMD Ryzen Pro 5000 Series Mobile Processors significantly increase the capabilities of ultrathin enterprise notebooks and deliver best-in-class user experiences with leadership performance, exceptional battery life and robust security features for every work environment,” said Saeid Moshkelani, senior vice president and general manager, Client Business Unit, AMD.",
    "AMD added that the new processors will be rolled into business laptops from vendors including HP and Lenovo hitting the shelves from Q2 2021."
  ],
  "headers": {
    "3": "Business features"
  },
  "links": {
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "processors": "https://www.techradar.com/news/best-processors",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "ultrathin enterprise notebooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "HP": "https://www.techradar.com/news/mobile-computing/laptops/what-s-the-best-hp-laptop-904710",
    "Lenovo": "https://www.techradar.com/news/the-best-lenovo-laptops-2018"
  }
}