{
  "source": "https://www.techradar.com/news/fitbit-charge-5-vs-fitbit-luxe",
  "title": "Fitbit Charge 5 vs Fitbit Luxe: the two most stylish Fitbits compared",
  "category": "fitness",
  "updated": "2021-10-11T09:55:46Z",
  "author": "cat-ellis",
  "summary": "Not sure which Fitbit to choose? We're here to help",
  "article": [
    "The Fitbit Charge 5 and the Fitbit Luxe are two of the best fitness trackers you can buy today, and if you're trying to decide between the two, we're here to help you make the right choice.",
    "Ultimately, it boils down to where your priorities lie. Are you looking for a slim, stylish Fitbit that you can wear every day, with any outfit, and which will gently nudge you towards developing healthier habits? If so, the Fitbit Luxe will likely be the right device for you.",
    "Alternatively, if you're looking for something to keep tabs on your workouts (whether that's running, cycling, or hitting the gym), the Fitbit Charge 5 will probably be the one to pick It's also a great choice if you're trying to manage your stress levels, or keep tabs on your heart health. It is, however, also more expensive than the Luxe thanks to its extra features.",
    "Those aren't all the differences though, so read on to find out everything you need to know about both the Charge 5 and the Luxe.",
    "The Fitbit Luxe became available to pre-order directly from Fitbit in April 2021, and started shipping in July, priced at $149.95 / £129.99 / AU$199.95. We've not seen any huge discounts on its price so far, but it's possible that there could be some considerable price drops for Black Friday 2021.",
    "The Fitbit Charge 5 was released in September 2021, priced at $179.95 / £169.99 / AU$269.95. Because it's so new, we're not likely to see any significant price discounts for a while yet.",
    "In short, if you're on a tight budget, the Luxe is the cheaper option, and that's unlikely to change for a while.",
    "The Fitbit Luxe is the more elegant of the two devices thanks to its slimmer design and optional linked stainless steel bracelet, but the Charge 5 is a good-looking fitness tracker as well.",
    "Both the Fitbit Charge 5 and Luxe have a sleek stainless steel case, with a soft silicone Infinity Band strap as standard, and are available in lunar white with a soft gold stainless steel case, or black with a graphite stainless steel case. The Luxe also comes in orchid pink with a platinum stainless steel case, and the Charge 5 comes in steel blue with a platinum stainless steel case.",
    "There’s a special edition Fitbit Luxe with a soft gold colored stainless steel link bracelet from jewelry designer Gorjana.",
    "If you’d like something completely different, Fitbit also sells extra bands for both watches, including metal. leather, woven fabric, and perforated silicone designs.",
    "Both the Fitbit Charge 5 and Fitbit Luxe have a bright AMOLED display, which can dim and brighten dynamically depending on ambient lighting conditions. Both watches also have an 'always on' mode, though using this will reduce the watch's battery life.",
    "The Fitbit Charge 5's display is larger, measuring 1.04in diagonally compared to 0.74in for the Fitbit Luxe. This allows you to see more data at once, and read more of a text message or WhatsApp notification before choosing whether to dismiss it or open it on your phone.",
    "Neither the Fitbit Charge 5 nor the Luxe are fully fledged smartwatches (for that, you'll need either the Fitbit Versa 3 or Fitbit Sense), but they still provide plenty of tools you'll find useful throughout the day.",
    "For example, both will push smartphone notifications to your wrist, so you never miss a call, text, or incoming WhatsApp message. The Charge 5 also offers Fitbit Pay, which allows you to make contactless purchases using only your fitness tracker, though it's worth noting that neither device allows you to control your phone's music player, or stream tunes from a service like Spotify.",
    "Both devices have a do-not-disturb mode as well, so you won't be distracted by alerts when you need to concentrate. They have a sleep mode as well, which prevents them giving alerts during the hours you're likely to be asleep.",
    "It's capped off with smart alarms, which rouse you during light sleep so you don't wake feeling groggy. The silent alarm function will make the watch vibrate gently on your wrist, which avoids disturbing your partner.",
    "Both watches can measure blood oxygen saturation (SpO2) while you sleep, and measure your heart rate 24 hours a day. However, only the Charge 5 will give alerts if your heart rate",
    "While both the Charge 5 and Luxe can track workouts, only the Charge 5 has on-board GPS, which allows it to track your route, distance and pace while you run, walk, or cycle outdoors, without the need to connect to your phone.",
    "The Fitbit Luxe only has connected GPS, which means it uses your phone’s location tracking. This is less accurate than on-board GPS, and means you can’t keep tabs on your routes and pace unless you’re carrying your handset.",
    "The Fitbit Charge 5 also has an EDA (electrodermal activity) sensor, which allows it to detect small changes in the conductivity of your skin caused by adrenal activity – a useful way of estimating stress levels. The more EDA responses measured during a period of time, the more stressed you’re likely to be.",
    "This is a feature only offered by the Fitbit Charge 5 and Fitbit Sense, and works best if you also have a Fitbit Premium subscription, which gives you access to a range of guided breathing and meditation sessions that can help you relax.",
    "The Charge 5 has an ECG (electrocardiogram) sensor as well, though this wasn’t enabled at the time of its release. We’ll test it once it’s unlocked, and update this article accordingly.",
    "The Charge 5 can send you personalized health and wellness reminders for tasks like drinking more water or finding time to exercise, and if you're a Fitbit Premium subscriber, both the Fitbit Luxe and Fitbit Charge 5 will soon give you a daily a Readiness Score as well.",
    "Each morning, this tells you how energized and well recovered you are, based on your sleep, recent activity, and heart rate variability. It also uses this data to suggest some activities for you to try from the Fitbit app's catalog of workouts, meditation sessions, and breathing exercises.",
    "For example, if you're well rested and have lots of energy, the app may suggest a tough run, but if you're more tired it might suggest you try some active recovery with a gentle yoga session. The Readiness Score tool will only be available to Fitbit Premium subscribers though, so it's worth factoring this extra cost into your decision-making.",
    "This feature wasn't available at the time of writing, but we'll be putting it to the test soon."
  ],
  "headers": {
    "7": "Design",
    "11": "Display",
    "13": "Smartwatch features",
    "17": "Fitness tracking"
  },
  "links": {
    "Fitbit Charge 5": "https://www.techradar.com/reviews/fitbit-charge-5",
    "Fitbit Luxe": "https://www.techradar.com/reviews/fitbit-luxe",
    "best fitness trackers": "https://www.techradar.com/best/best-fitness-trackers/best/best-fitness-trackers",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for"
  }
}