{
  "source": "https://www.techradar.com/news/accenture-hit-by-massive-ransomware-attack",
  "title": "Accenture hit by massive ransomware attack",
  "category": "computing",
  "updated": "2021-08-12T11:14:48Z",
  "author": "mayank-sharma",
  "summary": "Threat actors briefly shared stolen files before restarting their counter",
  "article": [
    "Accenture, counted amongst the world’s largest IT consultancy firms, has confirmed that its network has been breached by the LockBit ransomware.",
    "The news of the attack, first reported by CNBC Senior Washington correspondent Eamon Javers on Twitter, has since been confirmed by Accenture itself.",
    "“These people are beyond privacy and security. I really hope that their services are better than what I saw as an insider. If you’re interested in buying some databases, reach us,” reads LockBit’s post on the dark web according to Javers, hinting that the attack was a classic double-extortion campaign where the hackers not only encrypt sensitive data, but also exfiltrate it with threats to leak, for additional pressure.",
    "Accenture is the latest of the high-profile victims of ransomware operators who are now actively targeting billion-dollar corporations. In fact the number of ransomware attacks in 2021 has already surpassed last years’ total since businesses aren’t averse to paying the threat actors to prevent data leaks.",
    "Notably, while LockBit didn’t initially put up any proof of the stolen data, Javers tweeted that the group published over two thousand documents after the expiry of the initial countdown.",
    "Soon after however, the files were replaced by another countdown timer, leading to speculation that the leak was enough to convince Accenture to negotiate with the threat actors.",
    "While acknowledging the attack, Accenture played down its impact, assuring customers that it was on top of the situation.",
    "“Through our security controls and protocols, we identified irregular activity in one of our environments. We immediately contained the matter and isolated the affected servers. We fully restored our affected systems from backup. There was no impact on Accenture’s operations, or on our clients’ systems,” assured Accenture in a statement to Reuters."
  ],
  "headers": {
    "4": "Negotiations underway?"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Eamon Javers on Twitter": "https://twitter.com/EamonJavers/status/1425476619934838785",
    "dark web": "https://www.techradar.com/news/what-is-the-dark-web-how-safe-is-it-and-how-to-access-it-your-questions-answered",
    "targeting billion-dollar corporations": "https://www.techradar.com/news/ransomware-is-now-going-after-billion-dollar-targets",
    "already surpassed last years’ total": "https://www.techradar.com/news/ransomware-attacks-in-2021-have-already-surpassed-last-year",
    "aren’t averse to paying": "https://www.techradar.com/news/most-businesses-would-consider-paying-in-the-event-of-a-ransomware-attack",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "backup": "https://www.techradar.com/best/best-backup-software",
    "in a statement": "https://www.reuters.com/technology/accenture-restores-affected-systems-after-reported-ransomware-attack-2021-08-11/"
  }
}