{
  "source": "https://www.techradar.com/news/our-favorite-video-editing-app-has-just-been-named-apples-ipad-app-of-the-year",
  "title": "Our favorite video editing app has just been named Apple's iPad App of the Year",
  "category": "cameras",
  "updated": "2021-12-02T19:00:59Z",
  "author": "mark-wilson",
  "summary": "Lumafusion is a deserved winner",
  "article": [
    "Apple has just announced its App Store Awards 2021, which highlight its favorite apps and games of the year – and our best video editing app has just won its iPad App of the Year category.",
    "LumaFusion, which first arrived on Apple's tablet back in 2017, deservedly picked up the title, with Apple stating that the app makes \"video editing faster, less intimidating, and more portable for creators at every level\".",
    "It may have been around for a few years, but Lumafusion has matured nicely in recent times, adding features like HDR support and, in July 2021, a handy new video stabilization feature. As our review says, it's now \"the mobile app that's synonymous with desktop-grade video editing\".",
    "The reason why LumaFusion is so popular is because, rather than stripping out features to create a dumbed-down mobile experience, it makes complex features more accessible to a wider audience.",
    "For example, there's a versatile multi-track editor that lets you create six tracks for your video, graphics and audio, plus another six for extra effects like music or voiceovers. The app's magnetic timeline is also speedy and responsive, even when you're working with 4K footage, and there are lots of extra tools to make further tweaks.",
    "Another bonus, particularly when compared to Adobe apps, is that LumaFusion is one-off payment, rather than an ongoing subscription. At $29.99 / £25.99 / AU$46.99, it's not exactly cheap, but it is good value considering the app's power. That said, if you're looking to edit just a single clip, rather than put together a multi-layered video, then LumaFX ($0.99 / 99p / AU$1.49) is a more affordable alternative.",
    "Apple's App Store Awards are editorial picks, rather than being based entirely on the number of downloads, so they can be a good way to discover apps that aren't necessarily riding high at the top of the charts.",
    "In more recent years, there's usually been a photography or video-related app in Apple's picks. For example, in 2019 its iPhone App of the year was Spectre Camera, which lets you create long exposure photo effects, while in 2018 its top Mac app was the image editor Pixelmator Pro.",
    "Lumafusion isn't exactly an up-and-coming app, but Apple's decision to give it a gong in this year's App Store Awards shows both the booming popularity of mobile video editing and the increasing, desktop-level power of its tablets.",
    "The latest iPad Pro 11 (2021), for example, is more than capable of being your only video editing machine, while apps like Lumafusion will comfortably run on more affordable iPads, as long as they're running iPadOS 14.4.1 or later.",
    "If you'd like to see which apps have been the most outright popular in terms of downloads this year, though, then Apple has also published that list. From star constellation finders to recipe organizers, there are some good ones in there – and it's always good to know that your homescreen is freshly stocked with the best apps out there."
  ],
  "headers": {
    "6": "Analysis: A worthy winner that shows the editing power of the latest iPads"
  },
  "links": {
    "best video editing app": "https://www.techradar.com/best/best-video-editing-apps",
    "Spectre Camera": "https://www.techradar.com/news/exclusive-how-to-master-long-exposure-photos-with-apples-favorite-iphone-app-of-2019",
    "iPad Pro 11 (2021)": "https://www.techradar.com/reviews/ipad-pro-11-2021-review",
    "published that list": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7153612337417487000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fstory%2Fid1594411245%2F",
    "best apps": "https://www.techradar.com/best/best-iphone-apps-2021"
  }
}