{
  "source": "https://www.techradar.com/news/ford-launches-truck-of-the-future-f-150-lightning-and-its-a-beast",
  "title": "Ford launches ‘truck of the future’ F-150 Lightning – and it’s a beast",
  "category": "car-tech",
  "updated": "2021-05-20T09:36:44Z",
  "author": "axel-metz",
  "summary": "Power and practicality",
  "article": [
    "Ford has announced an all-electric version of North America’s best-selling vehicle, the F-Series pick-up truck.",
    "The Ford F-150 Lightning will arrive in 2022 for the US and Canada, and marks “a defining moment” for the American car industry, according to chairman Jim Ford.",
    "The announcement comes as Ford plans to dramatically increase its EV sales in the US, with the F-150 Lightning primed to rival the likes of the Tesla Cybertruck when it goes on sale early next year.",
    "The Lightning borrows its name from a previous performance-focused iteration of the F-Series and boasts similarly impressive on-the-road specs. Thanks to a 555bhp four-wheel-drive powertrain, the electric truck can sprint from 0-60mph in just 4 seconds and offers 775 lb ft of torque – the most yet on an F-150.",
    "It will be available in two battery capacities, offering official ranges of up to 230 and 300 miles, respectively. Ford will also throw in an at-home charging station as standard, which the company says will be capable of 150kW DC fast-charging, allowing the Lightning to gain 15-80% charge in just 41 minutes.",
    "The truck also offers a power-at-home function, which gives owners the option to use 9.6kW of its battery charge to – you guessed it – power a home during a power outage. Impressively, Ford says the Lightning is capable of powering the average home for up to 10 days, and can also provide charge to electrical equipment.",
    "Naturally, the Lightning is a pretty strong machine, too. The standard, 18-inch wheel variant boasts a maximum payload of 907kg, along with a towing capacity of up to 4536kg. To add some perspective, that means the Lightning could comfortably tow an adult Hippopotamus behind it – or two-thirds of a T-Rex, if you can find one.",
    "The Ford F-150 Lightning is no slouch when it comes to interior design, either.",
    "Inside, the truck will pack a 15.5-inch touchscreen display alongside a 12-inch digital instrument cluster – not dissimilar to the configuration we’ve seen in the GMC Hummer EV – both of which will utilise Ford's new SYNC 4A infotainment system. The Lightning’s main display is portrait, mind, while the Hummer’s is landscape.",
    "That new system employs natural voice control, cloud-connected navigation and wireless access to popular in-car services – specifically Apple CarPlay, Android Auto, integrated Amazon Alexa and SYNC AppLink apps.",
    "The Lightning will also utilize BlueCruise as part of Ford’s Co-Pilot 360 technology, allowing true hands-free driving on more than 100,000 miles of pre-qualified divided highways in the US and Canada. Ford says more hands-free ‘Blue Zones’ are on the way in the future, too.",
    "“It really is the smartest F-150 we’ve ever made,” said Darren Palmer, general manager of Battery Electric Vehicles at Ford.",
    "The F-150 Lightning will launch in the US and Canada between March and May next year, with a starting price of $39,974 – which puts it alongside its combustion engine counterparts, price-wise.",
    "It won't be offered in the UK, though, so no Hippopotamus-towing for the Brits."
  ],
  "headers": {
    "7": "Bells and whistles"
  },
  "links": {
    "GMC Hummer EV": "https://www.techradar.com/news/google-uses-monster-hummer-ev-screen-to-show-off-new-in-car-android-features",
    "Apple CarPlay": "https://www.techradar.com/news/best-apple-carplay-apps",
    "Android Auto": "https://www.techradar.com/reviews/android-auto-review",
    "integrated Amazon Alexa": "https://www.techradar.com/news/ford-f-150-and-mustang-mach-e-will-get-a-free-amazon-alexa-update-this-year"
  }
}