{
  "source": "https://www.techradar.com/news/bose-quietcomfort-45-headphones-revealed-in-fcc-filing",
  "title": "Bose QuietComfort 45 headphones revealed in FCC filing",
  "category": "audio-visual",
  "updated": "2021-07-20T23:43:07Z",
  "author": "harry-domanski",
  "summary": "Imminent successor to the popular QC35 II ANC cans",
  "article": [
    "The successor to Bose's revolutionary QuietComfort QC 35 noise-cancelling headphones could be just around the corner, if this official filing is anything to go by.",
    "Spotted by German tech news publication WinFuture, the audio company has submitted an FCC filing for the QuietComfort 45, including some images that show a rather familiar design.",
    "While the original Bose QuietComfort 35 headphones did get a successor in the way of the QC 35 II, this was more of a refinement rather than a true upgrade and offered very few changes over the original, so we're hoping that the new QC 45 naming signals a greater feature shift.",
    "Very little is revealed in the FCC filing and its accompanying images, but we can at least see that we'll finally be getting a USB-C port to replace the dated micro-USB port on the QC 35 II.",
    "Otherwise, the photos of the new headphones make them appear near-identical to their forebears, so we can only assume that the internal hardware and software is where the real improvements are taking place.",
    "The original QC 35 cans were some of the first headphones to offer noise-cancelling to the standard we have it today, presenting a new market for commuters and office workers alike, so we expect Bose will be targeting this feature once again.",
    "Given the ANC success of both the QuietComfort Earbuds and the awkwardly-named Noise Cancelling Headphones 700, we're hoping Bose can refine its noise-cancelling tech even further and give the Sony WH-1000XM4 a run for their money.",
    "We expect Bose won't want to cannibalise its more recently released Headphones 700 ($399 / £349 / AU$599), so we're hoping that the QC 45 will land with a price point more in line with the QC35 II at launch ($350 / £330 / AU$499), or ideally even lower."
  ],
  "headers": {
    "5": "Quiet heights"
  },
  "links": {
    "Bose's revolutionary QuietComfort QC 35 noise-cancelling headphones": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "WinFuture": "https://winfuture.de/news,124100.html",
    "FCC filing": "https://fccid.io/A94437310",
    "QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones"
  }
}