{
  "source": "https://www.techradar.com/news/clubhouse-android-app-is-about-to-get-a-global-launch",
  "title": "Clubhouse Android app is about to get a global launch",
  "category": "phones",
  "updated": "2021-05-17T10:16:25Z",
  "author": "james-rogerson",
  "summary": "But you still need an invite",
  "article": [
    "It’s been a long time coming, but Clubhouse is finally getting rolled out globally on Android, with Japan, Brazil and Russia getting it on Tuesday 17, Nigeria and India getting it on Friday 21, and the rest of the world (presumably including both the UK and Australia) getting it throughout this week.",
    "Supposedly the launch will be complete by Friday afternoon, with the Clubhouse Android app available worldwide by then. That’s according to a tweet from the company.",
    "This follows a US launch around a week earlier, and an iOS launch over a year ago, so Android users have been waiting quite a while for it. That said, you might still be waiting now, as even once you can download Clubhouse for Android, you need an invite from an existing user to actually access it.",
    "Clubhouse for Android also currently lacks a lot of the iOS features, such as the option to follow specific topics, create or manage a club, make payments, link your Twitter or Instagram accounts, and more.",
    "These features will hopefully be added before long, but for now not being able to access the Android version might not be the biggest loss – especially as alternative services like Twitter’s Spaces are now cropping up.",
    "For those who don’t know, Clubhouse is a mix of social network, hangout app, and live podcasting app, with the twist that all of your interactions are spoken. There’s no typing and no video. You can join ‘clubs’ and take part in live discussions, or just listen to other people talk."
  ],
  "headers": {},
  "links": {
    "Clubhouse": "https://www.techradar.com/how-to/what-is-clubhouse",
    "a tweet": "https://twitter.com/Clubhouse/status/1393968237239545856",
    "Clubhouse for Android": "https://www.techradar.com/news/clubhouse-for-android"
  }
}