{
  "source": "https://www.techradar.com/news/moto-g200",
  "title": "Moto G200 release date, price, features, specs and news",
  "category": "phones",
  "updated": "2021-11-18T16:00:20Z",
  "author": "james-rogerson",
  "summary": "A mid-range phone with high-end power",
  "article": [
    "The Moto G200 has been unveiled and it packs the best chipset available to Android phones, plus a super-high refresh rate and other impressive specs, all for a mid-range price.",
    "Sound too good to be true? Well, not every aspect of the Moto G200 is cutting-edge, as you’ll see below.",
    "We’ve detailed the phone’s specs in full, along with information on when it will go on sale, what countries it’s set to be available in, and how much it will cost.",
    "The Moto G200 has been announced already, and it’s set to go on sale in the UK sometime in December.",
    "The exact date hasn’t yet been revealed, but we know that it will start at £399.99 (around $540 / AU$740). That’s for a version with 8GB of RAM and 128GB of storage. There’s also a version with 256GB of storage, but we don’t have pricing for that, and at the time of writing it’s not visible on Motorola’s UK site, so it may not be widely available.",
    "The Moto G200 isn’t expected to land in the US or Australia – other than the UK it’s only confirmed for other parts of Europe and for Latin America.",
    "The Moto G200 has a fairly conventional design, with a mostly all-screen front, though there’s a noticeable bezel below the display. It has a punch-hole camera in the top-center of the screen, while on the back there’s a triple-lens camera in the top left corner.",
    "The back is slightly curved and has the near-iconic Motorola dimple in the center, and the phone comes in at 168.07 x 75.53 x 8.89mm and 202g. It will be available in Stellar Blue and Glacier Green shades.",
    "Whichever color you pick the back and sides will be plastic, which is presumably one way that Motorola has kept the price down. Another will be in the lack of any substantial water resistance, with just an IP52 rating offered – that might be enough to survive very light rain but not much more.",
    "As for the screen, that’s rather more impressive, being a big 6.8-inch 1080 x 2460 LCD display with a 20:9 aspect ratio and a 144Hz refresh rate, which means scrolling and other interactions should feel extra smooth. That’s an even higher refresh rate than flagships like the Samsung Galaxy S21 Ultra and iPhone 13 Pro (both of which top out at 120Hz).",
    "Some phones do have a refresh rate that high, but the majority of them are gaming handsets – though the Motorola Edge 20 also has a 144Hz refresh rate, so this isn’t a totally new thing for the company.",
    "The display also has 396 pixels per inch, and DCI-P3 and HDR10 certification, so it sounds like a high-quality component.",
    "The camera on the Moto G200 includes a 108MP f/1.9 main sensor, an 8MP f/2.2 ultra-wide one (which has a 120-degree field of view and doubles as a macro lens) and a 2MP depth sensor.",
    "The main camera uses 9-in-1 pixel binning to capture 12MP photos by default, though we’d imagine you’ll be able to take 108MP shots if you’d prefer.",
    "You can also record video in up to 8K quality at 30fps, and record 960fps slow motion video, while on the front there’s a 16MP f/2.2 camera that can shoot video in up to 1080p at 30fps.",
    "The Moto G200’s battery is 5,000mAh, and the company claims it can last for up to 1.5 days between charges. When you do charge it, that can be done at up to 33W.",
    "One big highlight of the Moto G200 is its chipset, as it has a Snapdragon 888 Plus one. That’s the best Android chipset available in 2021 and it’s one that we’ve seen in few phones. It’s even more powerful than the chipsets used in the Samsung Galaxy S21 range and the OnePlus 9 range, so it’s surprising to see it in a mid-range phone.",
    "It’s paired here with 8GB of RAM and either 128GB or 256GB of storage. Beyond that, the Moto G200 supports 5G, runs Android 11, and has a fingerprint scanner, a dedicated Google Assistant key, and support for Dolby Atmos audio – though there’s no headphone jack.",
    "It’s also worth noting that like the Moto G100 before it, the Moto G200 supports Ready For. This allows you to connect your Moto G200 to a monitor or TV, so you can view content on a larger screen. This is especially handy if you want to transform your phone into a makeshift desktop to get some work done."
  ],
  "headers": {
    "3": "Moto G200 release date and price",
    "6": "Design and display",
    "12": "Camera and battery",
    "16": "Specs and features"
  },
  "links": {
    "has been unveiled": "https://www.techradar.com/news/moto-g200-unveiled-with-enormous-power-and-a-mid-range-price-and-its-not-alone",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Motorola Edge 20": "https://www.techradar.com/news/motorola-edge-20",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Ready For": "https://www.techradar.com/news/ready-for-what-is-motorolas-dex-alternative-and-how-does-it-work"
  }
}