{
  "source": "https://www.techradar.com/news/new-box-shuttle-tools-make-it-easier-and-cheaper-to-migrate-content-to-the-cloud",
  "title": "New Box Shuttle tools make it easier and cheaper to migrate content to the cloud",
  "category": "computing",
  "updated": "2021-06-15T19:32:13Z",
  "author": "anthony-spadafora",
  "summary": "Cloud migration made easy with new self-service tools",
  "article": [
    "After releasing the all-new Box Shuttle earlier this year, the cloud storage provider Box has released a new set of self-service migration tools for the service to help organizations move their content to the cloud.",
    "With the company's new self-service offering, organizations can move not only content but related version histories, metadata and permission structures to the cloud as well.",
    "Box has even sweetened the deal by allowing organizations to move up to ten terabytes of content to the cloud through Box Shuttle for free. The free version of the company's self-service migration tools can bring files from network file shares, OneDrive, Google Drive, Dropbox and SharePoint Online.",
    "However, it's worth noting this solution can only migrate content with simple metadata such as file and folder names, size, creation and modified dates. For more complex migrations, Box users will need to use Box Shuttle's advanced tooling instead.",
    "Organizational content that is more complex or needs to be re-platformed when moved to Box will require Box Shuttle's advanced tooling. However, customers can move all of their content to the cloud storage service at petabyte scale with no volume limits for only $500 per terabyte.",
    "Box's advanced tooling supports all of the systems and services from the free plan as well as SharePoint On-Premises, Citrix Sharefile, FTP, Egyte, AWS, GCP and Microsoft Azure.",
    "For organizations tasked with large migration projects that are more complex, the company also offers Box Shuttle migration services which have already been used to deliver more than 600 successful migrations for companies and government agencies such as Intuit, the US Forest Service and Coalfire.",
    "With Box Shuttle managed services, the Box team works hand-in-hand with internal resources, delivers the migration and ensures successful outcomes for any project no matter how small or large, simple or complex. Box Shuttle enablement services on the other hand provide an organization's employees with the internal resources necessary to use the Box Shuttle migration tool along with an overview of migration best practices."
  ],
  "headers": {
    "4": "Complex migrations and migration services"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Box": "https://www.techradar.com/reviews/box",
    "Box Shuttle": "https://www.techradar.com/news/box-shuttle-makes-it-easier-than-ever-to-move-your-business-data-to-the-cloud",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "petabyte scale": "https://www.techradar.com/news/box-shuttle-makes-it-easier-than-ever-to-move-your-business-data-to-the-cloud",
    "AWS": "https://www.techradar.com/news/aws",
    "GCP": "https://www.techradar.com/news/google-cloud-sees-huge-surge-in-business-despite-overall-loss",
    "Microsoft Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "migration": "https://www.techradar.com/best/best-data-migration-tools"
  }
}