{
  "source": "https://www.techradar.com/news/why-galaxy-bespoke-should-have-you-excited-for-the-samsung-galaxy-s22",
  "title": "Why Galaxy Bespoke should have you excited for the Samsung Galaxy S22",
  "category": "phones",
  "updated": "2021-10-24T08:00:50Z",
  "author": "tom-bedford",
  "summary": "A colorful launch",
  "article": [
    "At some point in the next few months Samsung is expected to unveil the Galaxy S22, its new series of flagship smartphones, but if the jump from the Galaxy S10 to S20 or S20 to S21 has taught us anything, it's that it probably won't be a huge upgrade.",
    "There could be a reason to care though, thanks to something unveiled recently. At an otherwise quiet Galaxy Unpacked event in October, Samsung launched a new service for its devices, called Galaxy Bespoke, and it could point towards the future of Samsung phones.",
    "In fact, more so than any other leak or tease we've seen so far, Galaxy Bespoke could give us a reason to care about the upcoming Samsung Galaxy S22 series of smartphones.",
    "There's a big problem with many modern smartphones: they look too boring. We're not talking about the actual appearance - in the grand scheme of it, there's very little difference between how most non-folding phones look - we're talking about colors.",
    "The vast majority of phones come in pretty bland shades like gray, navy or black - there's very little vibrancy. Even the outliers can be a bit dull: the Google Pixel 6 colors are all just soft pastel colors, and some of them are fairly attractive, but none of them are particularly eye-catchingly bright or bold.",
    "Some could consider the Galaxy S21 colors an exception: the choice between black, white, pink or purple gave two interesting colors. But they were still quite soft, pastel hues, not enough to turn heads or blind onlookers.",
    "Samsung's actually one of the better companies when it comes to bold phone colors, with the Galaxy S20 FE in particular coming in loads of fabulous shades. But there's still more that could be done.",
    "Galaxy Bespoke gives Samsung a chance to do even better in the colors department.",
    "Galaxy Bespoke lets you customize the colors and design of a new gadget from the company, so you can pick which hues and shades specific parts of the device have in order to make it feel 'yours'.",
    "At the moment it's available for the Galaxy Z Flip 3 and Galaxy Watch 4 (including the Watch 4 Classic), but it seems the company is going to offer the service for more products going forward.",
    "The Samsung Galaxy S22 would be a prime candidate for this kind of treatment, and the fact that the company is making a big deal of Galaxy Bespoke - there's an entire section of the Samsung website dedicated to it - suggests it could come to the future devices.",
    "The Galaxy Z Flip 3 customization tool lets you change the color of the hinge as well as the front and back. The system wouldn't work as well on a generic looking smartphone, with fewer parts to color, but it could still work.",
    "The Galaxy S21 had a colored rear as well as a highlight section around the camera bump and phone frame - this was gold on each Galaxy S21. Perhaps if Samsung let you choose the shades of the S22, you could get this nice highlight pattern with colors of your choosing.",
    "Alternatively, perhaps Samsung could let you design your own rear of the phone, picking patterns and colors or specific logos, icons and decals. Going even further, the company could potentially let you import your own designs (like your own photos, or images you whip together on Microsoft Paint).",
    "Of course, this could bring with it some problems; you could draw something rude and have it imprinted in your phone, for example - but then again there's nothing stopping you just doing this with a sharpie anyway (except, y'know, common sense).",
    "For the existing Bespoke Edition devices, you have to pay a little more, and that's just for Samsung picking out certain color panels for its phones; if you designed your own mobile, it'd likely cost you quite a bit more than the standard edition.",
    "Some people really care about the appearance of their phone though, and would be willing to pay. Either way, it seems very possible that Galaxy Bespoke will be open for the S22, and if it lets you customize your mobile to a meaningful degree, it could make the device tempting for people who care about the design of their phones.",
    "Moreover, if the Samsung Galaxy S22 isn't a big specs upgrade over the S21, Galaxy Bespoke will likely be the big selling point, to tempt people who don't need the newer specs."
  ],
  "headers": {
    "3": "Looking dull",
    "8": "Bespoke",
    "13": "Colorful thinking"
  },
  "links": {
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones",
    "Google Pixel 6 colors": "https://www.techradar.com/news/every-google-pixel-6-color",
    "Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review"
  }
}