{
  "source": "https://www.techradar.com/news/how-t-pain-utilized-pc-gaming-to-further-his-pop-culture-legacy",
  "title": "How T-Pain utilized PC gaming to further his pop culture legacy",
  "category": "computing",
  "updated": "2021-09-02T15:48:55Z",
  "author": "ural-garrett",
  "summary": "He doesn’t care much for the chipset wars either",
  "article": [
    "Clever use of technology has always been T-Pain’s modus operandi. Making his summer 2005 debut with the platinum selling single I’m Sprung, the Tallahassee-native utilized auto-tune in a way that didn’t cover-up a perceived lack of vocal ability (as a 2014 NPR Tiny Desk performance proved). Instead, the vocal-pitch tech was used in more of a stylish homage to legendary funk-outlet Zapp who were known for utilizing a “talk-box” effect on classic songs like Computer Love. This led to a string of Billboard Hot 100 hits between 2005 and 2009 thanks to tracks ranging from “Buy U A Drank (Shawty Snappin')” featuring Young Joc to lending some assistance on Kanye West’s Grammy winning single Good Life.",
    "It’s fascinating to think that one of modern pop music’s most polarizing and influential artists would still spend the later half of his career evolving from hardcore gaming enthuistist to Twitch streamer through his own Nappy Boy Gaming channel. And, it really started with his transition years ago to PC gaming for some fairly practical reasons.",
    "“I used to be one of them people that traveled around with a PS4 and Xbox,” explained T-Pain in a Zoom conference with TechRadar. “So it became a necessity because that shit's heavy... And now they're all shaped weird and shit, and you can't sit there carrying an Xbox in his backpack.”",
    "Avoiding potential back problems, T-Pain also spoke on a PC exclusive he doesn’t necessarily remember besides eventually dwindling down his load to three laptops for creating music, DJing and gaming of course.",
    "Around the time Amazon purchased Twitch for nearly $1 Billion in 2014, T-Pain’s manager introduced him to the world of streaming according to an MTVNews interview. Starting on YouTube playing games like Overwatch and Doom (2016) some time later, he eventually moved to Twitch. Since then, he’s garnered over 600,000 subscribers and a lucrative sponsorship with Corsair as well. According to T-Pain, it’s actually allowed him to cross-pollinate both his streaming and music fanbases.",
    "“I think streaming has just showcased the personality I've had my entire career and people just didn't even fucking know, because even the people that know me as the musician come over to the streams like Bro, I didn't know you was this fucking cool,” he said. “I get people tweeting like every day, if you check my mentions, there's always somebody in there everyday that's like, \"I don't even f*ck with T-Pain's music, but this dude is funny on his stream. Even the people that know me as the musician come over to the streams like, ‘Bro, I didn't know you was this f*cking cool.’”",
    "The same entertainment value T-Pain has presented in his music and various acting appearances definitely shows in his streams. Sometimes he’s playing Forza Horizon 4 or Among Us. Other times, he's making beats live in FL Studio. And usually, there’s some type of alcohol in the mix.",
    "Regardless of what he’s doing, it’s never short of amusing. One of T-Pain’s Twitch sessions of Call of Duty: Black Ops Cold War this year even went viral after he helped slaughter an entire team of gamers using racial slurs.",
    "The life of a full-time streamer is more than hectic, but T-Pain still releases music on a consistent basis. Most recently, he released the single featuring Kehlani “I Like Dat” and will be releasing an untitled album soon – though it doesn't have a set release date. He’s also catching up with all the requested features he missed by not checking his Instagram DMs, hosting his Nappy Boy Radio podcast and releasing a drink-book “Can I Mix You A Drink” through Penguin Random House.",
    "Speaking with TechRadar, Mr. “Teddy PenderAss” discusses his love of performance over visuals, his favorite drink during gaming sessions, the viral Call of Duty moment and his thoughts on this year’s E3.",
    "You went viral after slaughtering a group of racist gamers in Call of Duty: Black Ops Cold War. Looking back , did you think that was going to re- open up the conversation of harassment and disrespect that people of color deal with when gaming online?",
    "I wasn't even the best on my team dude and that was the crazy part. They got fucked up though. I wasn't even the best because my homeboy Big Cheese, he's on Nappy Boy Gaming too, got more kills than me that round. That was amazing. He does all melee and doesn’t even use guns.",
    "I’m fine with the conversation it started as long as it's organic. It's not like, 'Hey, we need to talk about racism on this platform.’ And it's like, if I can put out that video and be like, \"Okay, you see? You see what I'm saying? You see what I'm saying? This happens all the time. It's not just something I'm just making up and talking about, we got video evidence, this is not some sh*t we are making up.\"",
    "It's better when it's organic and you can, you know, have that proof and just have the examples instead of just... You know, because the first thing you're going to say is \"When? When did it happen?\" You know what I'm saying? And you're just like, \"Exhibit A, motherf*cker.\" So it helps to have those things organically happen. I mean, obviously it's organic coming from a racist all the time, but you know, just to see me chilling, I'm not provoking nobody, I wasn't like asking people to come play with me... none of that shit. We really just went into a random lobby that shit just went off, and I was like, \"You know what? Okay.\"",
    "For someone who has been PC gaming for years now, have you found yourself choosing sides between graphics cards or processor competitors like Nvidia vs. AMD or Intel vs. AMD?",
    "I'm more on the Intel side, you know, only because it's been working for me my whole life and I know AMD comes cheaper. You know, cheaper prices for faster things. And you know, it teeters both ways every time. If you think Intel ain't coming with something crazy next year you're out of your mind. We're always going to be in that battle. Everybody's going to do something better. Like, you know, I'm sure when Intel saw the sh*t that AMD did, it was like, \"Oh, we going there? I didn't know we was going that far. Let's f*cking do it then.",
    "So it's always going to be that. There are still people saying that there are better graphics cards than NVIDIA. I get it but it's been working for me. Like, don't come look at my f*cking four set-ups and tell me I built all these wrong. I got what I prefer in my shit. Let people enjoy things. Shut the f*ck up and let people just f*cking enjoy the parts they were able to get at the time god damn it cause that chip shortage is serious.",
    "That whole battle of who's better, what company is better and all that sh*t, it's like do your thing, man. Whatever parts you can get – whatever's available. Just let people enjoy things and shut the hell up.",
    "Do you favor high frame rates or higher resolution and visuals?",
    "Frame rate for sure. Absolutely, gotta have that. It's about reaction time... I got [Nvidia GeForce RTX] 3080s all around my house, so I'm going to be able to see, so I'm good on that. When it comes to the frame rate, I got to be able to have that reaction time. I need that.",
    "Outside of Call of Duty, you’ve done Twitch streams of Overwatch, Mario Party, Among Us, Animal Crossing and Forza Horizon 4. What other games have you been recently enjoying on PC?",
    "Man, I don't know what's happening in my body, but it's something telling me that I have to 100% all the Hitman games. All of them. Yeah, and it's not going well, I got to tell you. It's really not going well. I'm not good at that game. I need to figure it out, but... you know, trying to do the mastering thing, all the challenges, and there's some things that are redacted, and I'm one of them people that even if it's something that's supposed to be, I'm not going to Google it. You know what I'm saying? I'm really sitting and trying to figure it out.",
    "Do you have anything from E3 this year that you’re excited about?",
    "Yeah, I was in it for a second so I had to watch it. Me and my wife, we didn't have a schedule so we just watched the whole thing just to see when my part was happening. It's way, way at the fucking end. It was like the last day and sh*t.",
    "But yeah... I'm pretty excited. I will say this, Xbox came out f*cking swinging. They didn't give a shit about nobody. They came out kicking babies on that bitch. Boy, they didn't fuck around. I think the thing I'm most excited about from the entire conference is Forza. I haven't done my driving streams in a long time. When that drop, oh I'm into it. My motion rig, I'm going to be in that b*tch.",
    "Also “Chopped N Skrewed” featuring Ludacris from the “Three Ringz” album was like one of my favorite joints during my underground years. One of my favorite joints from you ever. Do you have a top three gaming soundtracks list?",
    "I do. In no particular order, Journey, Streets of Rage 2 and The Legend of Zelda: Breath of the Wild.",
    "You also use Twitch to stream live Fruity Loops sessions. How has game streaming changed your approach to music creation?",
    "It really has broadened it a little bit because you know, for a while I would only use Mac products and Apple stuff. So I would always, you know, stick to my guns and stick to my old ways and stuff like that and not really try to venture out, but now that I'm able to game and, you know, make beats and produce on the same computer, it kind of carries over into things, like I'll be playing a game and get inspired by something and literally be able to, you know, alt-tab to Fruity Loops and... get to it. It doesn't take a lot of thought process. I don't have to pull out another laptop and hook up a hard drive, an external or anything like that... It's streamlined my process a lot for real. So yeah, it's really going hand in hand now and not so much going in the game room and then coming to the studio... it's alt-tab and it's right there.",
    "I’ve seen you drink wine during some sessions and you’re set to release a drink book with my good friend Kathy Indoli titled Can I Mix You A Drink. Do you have a favorite drink to sip on before playing gaming?",
    "I've been into wine for gaming lately. Yeah, I don't get drunk as fast so I can actually play the game for longer. But yeah, wine, cheap wine has been like my jam for a little bit now, I've been doing that on stream. But you know, once I get to the third bottle of wine and playing Call of Duty sh*t gets aggressive. That wine seems to be the thing."
  ],
  "headers": {
    "4": "Getting into streaming"
  },
  "links": {
    "I’m Sprung,": "https://www.youtube.com/watch?v=rxRvDpF2FDA",
    "2014 NPR Tiny Desk performance": "https://www.youtube.com/watch?v=CIjXUg1s5gc",
    "Computer Love.": "https://www.youtube.com/watch?v=0lDR_PNPXCk",
    "polarizing": "https://www.usatoday.com/story/entertainment/music/2021/06/21/t-pain-reveals-how-comment-from-usher-kicked-off-depression/5300714001/",
    "influential": "https://theundefeated.com/features/t-pain-popularized-auto-tune-but-it-came-at-a-cost/",
    "Twitch streamer through his own Nappy Boy Gaming": "https://www.twitch.tv/tpain",
    "Amazon purchased Twitch for nearly $1 Billion": "https://www.techradar.com/news/internet/twitch-is-apparently-now-the-object-of-amazon-s-desire-1262649",
    "MTVNews interview": "http://www.mtv.com/news/3130735/t-pain-twitch-streaming/",
    "helped slaughter an entire team of gamers using racial slurs": "https://www.billboard.com/articles/columns/hip-hop/9565672/t-pain-racial-slurs-call-of-duty-revenge-video/",
    "not checking his Instagram DMs": "https://www.revolt.tv/news/2021/4/29/22409505/t-pain-instagram-dm-messages-video",
    "“Can I Mix You A Drink” through Penguin Random House.": "https://www.penguinrandomhouse.com/books/688058/can-i-mix-you-a-drink-by-t-pain/",
    "Big Cheese": "https://www.instagram.com/bigcheesekit/?hl=en",
    "Yeah, I was in it for a second": "https://www.gamesradar.com/e3-2021-talent-includes-t-pain-mass-effects-jennifer-hale-mythic-quest-and-more/"
  }
}