{
  "source": "https://www.techradar.com/news/google-is-working-on-a-mega-quantum-computer",
  "title": "Google is working on a mega quantum computer",
  "category": "computing",
  "updated": "2021-05-19T15:00:47Z",
  "author": "mayank-sharma",
  "summary": "Promises to deliver a commercial-grade quantum computer before the decade is out",
  "article": [
    "Google CEO Sundar Pichai has vowed to build a commercial-grade quantum computer by 2029.",
    "With the announcement at its Google I/O 2021 event, the company joins the likes of IBM, which has promised to deliver a 1000 qubit quantum computer by 2023 and Japanese tech giant Fujitsu that’s recently announced a new initiative to also build 1000 qubits quantum computer within the next few years.",
    "Google, which has been toying with quantum computing for several years now, is reportedly planning to offer its quantum-computing services over the cloud.",
    "“Quantum computing represents a fundamental shift, because it harnesses the properties of quantum mechanics and gives us the best chance of understanding the natural world,” Pichai said at I/O 2021 whilst announcing the roadmap for its platform.",
    "Dr. Hartmut Neven, the Google scientist in charge of its Quantum AI program, told the Wall Street Journal that the search giant has recently expanded its California-based campus to focus on the program.",
    "As per reports, the campus houses Google's first quantum data center, hardware research laboratories, and facilities to fabricate the quantum processor chips.",
    "Researching quantum computing at Google since 2006, Dr. Neven says that the company now has the “important components” and feels confident to execute its roadmap.",
    "Neven suggests that besides the cloud, Google wants to harness quantum computing for several other uses such as to build more energy-efficient batteries, as well as to speed up training for machine learning.",
    "Via Wall Street Journal"
  ],
  "headers": {
    "4": "Executing the roadmap"
  },
  "links": {
    "quantum computer": "https://www.techradar.com/news/a-fridge-thats-colder-than-outer-space-could-take-quantum-computing-to-new-heights",
    "IBM": "https://www.techradar.com/news/ibm-launches-quantum-computing-developer-certification",
    "quantum computer by 2023": "https://www.techradar.com/news/ibm-has-big-plans-for-the-future-of-quantum-computing",
    "new initiative": "https://www.techradar.com/news/fujitsu-takes-on-ibm-in-race-for-most-powerful-quantum-computer",
    "Wall Street Journal": "https://www.wsj.com/articles/google-aims-for-commercial-grade-quantum-computer-by-2029-11621359156"
  }
}