{
  "source": "https://www.techradar.com/news/big-tech-backs-new-app-security-standard-for-vpns-iot-devices",
  "title": "Big Tech backs new app security standard for VPNs, IoT",
  "category": "computing",
  "updated": "2021-04-16T17:48:10Z",
  "author": "anthony-spadafora",
  "summary": "New app security standard aims to bring improved transparency and visibility",
  "article": [
    "The Internet of Secure Things (ioXt) Alliance, the global standard for IoT security, has announced that will expand its ioXt Compliance Program with a new mobile application profile that also covers VPN services.",
    "These new security standards for mobile apps and VPN services aim to bring improved transparency and visibility to both consumer and enterprise buyers in an effort to advance security in the IoT industry as a whole.",
    "Big tech has also backed the ioXt Alliance's new security standards as they were defined collaboratively by tech giants such as Google and Amazon in partnership with security labs NowSecure, NCC Group, DEKRA, Onward Security and 7layers and they also align with the initiatives set forth by the VPN Trust Initiative.",
    "By expanding the ioXt Certification Program to cover mobile apps, rigorous testing will be conducted at scale to identify and mitigate potential security risks. Going forward, all apps submitted through the ioXt Alliance's Certification Portal will be automatically scanned by the mobile security firm NowSecure.",
    "By including VPN services in its Certification Program, the ioXt Alliance will help make the internet a safer place while also preserving the reputations of VPNs to provide consumers with greater trust, transparency and security.",
    "The VPN Trust Initiative (VTI) and the standards it has created and adapted for the ioXt Alliance's profile are critical to this mission. Chair of the VTI and VP of ExpressVPN, Harold Li explained why the VTI is working together with the ioXt Alliance on its Compliance Program in a press release, saying:",
    "“VPNs are central to internet privacy, security, and rights, but the members of the VTI know well that we can't provide those protections without trust and transparency. That's why we're so excited to be involved in launching the expansion of the ioXt Compliance Program to include VPN services. This Program will give consumers more control and confidence in choosing solutions for protecting themselves online.”",
    "In order to further increase the level of security in their products, Afero, Comcast, ExpressVPN, Leviton, NordVPN, OpenVPN Community, McAfee, Private Internet Access and VPN Private have partnered with the ioXt Alliance to test and certify several mobile apps and VPN platforms. However, Google has gone a step further by certifying Google One and it is the first white box label tested product to receive ioXt certification."
  ],
  "headers": {
    "4": "IoXt Certification Program"
  },
  "links": {
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "VPN Trust Initiative": "https://www.techradar.com/news/top-vpn-brands-join-security-initiative",
    "NowSecure": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-you-re-using-wi-fi-your-samsung-phone-could-be-hacked-1297050",
    "ioXt Alliance": "https://www.techradar.com/news/consumer-iot-devices-certified-by-ioxt-alliance-to-hit-shelves-in-third-quarter",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "press release": "https://www.ioxtalliance.org/news-events-blog/ioxt-alliance-expands-certification-program-for-mobile-and-vpn-security",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "VPN Private": "https://www.techradar.com/reviews/vpn-private",
    "Google One": "https://www.techradar.com/news/everything-you-need-to-know-about-google-one"
  }
}