{
  "source": "https://www.techradar.com/news/xbox-series-x-games-could-look-even-better-with-this-amd-tech",
  "title": "Xbox Series X games could look even better with this AMD tech",
  "category": "computing",
  "updated": "2021-06-07T11:22:59Z",
  "author": "rhys-wood",
  "summary": "Super Resolution could come to Xbox",
  "article": [
    "Xbox Series X and S gamers might soon enjoy a boost to their favorite games’ visuals with AMD’s Super Resolution, a feature that’s part of the company’s FidelityFX suite of graphical enhancements. While Super Resolution will be available for use on PC from June 22, it looks like the tech could also make its way to Microsoft’s flagship consoles.",
    "What exactly is Super Resolution? According to AMD itself, it’s an upscaling technology that can boost framerates and resolution for games that support it, without the need to purchase more powerful hardware such as a new console or graphics card.",
    "Speaking to IGN, a Microsoft spokesperson had the following to say about Super Resolution: “At Xbox, we’re excited by the potential of AMD’s FidelityFX Super Resolution technology as another great method for developers to increase framerates and resolution. We will have more to share on this soon.”",
    "While Super Resolution hasn’t outright been confirmed for consoles just yet, then, it’s entirely possible for Xbox to touch on the feature during its upcoming E3 2021 presentation, and we’d love to see AMD’s tech work hand in hand with other fantastic Xbox features like Auto HDR.",
    "It’s worth noting that Xbox Series X/S development kits already have FidelityFX built-in, complementing the AMD graphical and processing hardware that powers the consoles. Super Resolution could be yet another feature that helps boost the performance of upcoming, anticipated Xbox games like Fable, Forza Motorsport and Everwild without sacrificing precious framerate.",
    "Super Resolution would also be a huge win for gamers who own an Xbox Series S. This entry-level, digital-only machine isn’t quite as powerful as the beefy Series X, but FidelityFX and Super Resolution may help to bridge the gap between the two by creating a visual experience greater than what was originally intended."
  ],
  "headers": {
    "3": "Xbox and AMD go hand in hand"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Super Resolution": "https://www.techradar.com/news/amd-finally-takes-on-dlss-with-fidelityfx-super-resolution",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "AMD itself": "https://www.amd.com/en/technologies/radeon-software-fidelityfx-super-resolution",
    "IGN": "https://www.ign.com/articles/xbox-series-x-s-amd-fidelity-fx-super-resolution-support-confirmed",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Auto HDR": "https://www.techradar.com/news/what-is-xbox-series-x-auto-hdr-microsofts-game-changing-feature-explained",
    "FidelityFX built-in": "https://www.techradar.com/news/the-latest-amd-tech-is-coming-to-your-xbox-series-x-in-a-blow-for-the-ps5",
    "Fable": "https://www.techradar.com/news/fable-4-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "Everwild": "https://www.techradar.com/news/everwild-release-date-trailers-news-rumors",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}