{
  "source": "https://www.techradar.com/news/your-microsoft-office-subscription-price-might-be-about-to-see-a-major-hike",
  "title": "Your Microsoft Office subscription price might be about to see a major hike",
  "category": "pro",
  "updated": "2021-12-07T13:14:08Z",
  "author": "sead-fadilpasic",
  "summary": "Prices could rise 20% for Office 365 customers paying on a monthly basis",
  "article": [
    "Microsoft is preparing changes to how it charges its cloud-based productivity suite Microsoft 365 (formerly known as Office 365) that could leave many customers facing higher software bills.",
    "CNBC reports that the “New Commerce Experience for Office” offering, set to be introduced in January 2022 will result in prices for the productivity suite spiking 20% for customers who pay on a monthly basis.",
    "Furthermore, Microsoft seems to be eliminating the option to scale the subscription back. If customers decide, halfway through the subscription, to stop using the service, they will still need to pay for the remainder of the term.",
    "CNBC claimed the news has been distributed through third parties and via several Microsoft employees who did not want to be named.",
    "Microsoft’s official statement is that the company “provides flexible purchasing options to meet our customers’ diverse needs, and we don’t publicly disclose information around our premium and pricing approach for partners.”",
    "Discussing the matter with the publication, one Microsoft partner said its customers had already raised concerns about the changes. Intivix co-founder Rob Schenk said he’s been notifying clients about the 20% increase for month-to-month arrangements, and the responses have been “mixed”, with some clients saying they “don’t like it at all”.",
    "Some people have also taken to Reddit and to Change.org, to voice their dissatisfaction with the changes and to try and urge Microsoft into abandoning the idea.",
    "Initially, the company planned on implementing the New Commerce Experience in October this year, but pushed it to January. From March 2022, all new orders will have to go through New Commerce Experience, with renewals having until July.",
    "For the first half of the year, Microsoft will charge the same price for both monthly and yearly offers - with those who opt for an annual subscription apparently spared the price hike.",
    "Having multiple payment options, as well as the ability to scale up and down easily, proved to be essential for the survival of many businesses during the pandemic."
  ],
  "headers": {
    "3": "Unhappy customers"
  },
  "links": {
    "Office 365": "https://www.techradar.com/best/free-office-software",
    "CNBC": "https://www.cnbc.com/2021/12/06/microsoft-will-charge-more-for-office-customers-paying-month-to-month.html",
    "productivity suite": "https://www.techradar.com/best/best-productivity-apps",
    "payment options": "https://www.techradar.com/best/best-payment-gateways"
  }
}