{
  "source": "https://www.techradar.com/news/the-ps5s-apple-tv-plus-trial-is-a-rare-example-of-a-genuinely-great-freebie",
  "title": "The PS5's Apple TV Plus trial is a rare example of a genuinely great freebie",
  "category": "entertainment",
  "updated": "2021-08-30T02:00:08Z",
  "author": "samuel-roberts",
  "summary": "Six months of free streaming",
  "article": [
    "I watched Boys State at the weekend on Apple TV Plus. Have you seen Boys State? I would guess you probably haven't – not that it's much of a metric, but it's got just over 4,200 ratings on IMDb, compared to around 19,000 for Netflix's American Factory.",
    "More people should watch Boys State. It's about an American Legion-sponsored program where a bunch of teenagers essentially simulate the experience of running for political office, across two parties, where they set the agendas for each in groups. It functions as a microcosm for American politics in general: the mud-slinging that goes into the election cycle, the glimmers of genuine optimism and the cynical exploitation of hot-button subjects for votes. But it's weirdly wholesome, and genuinely riveting. I'm so glad I took the time to watch it.",
    "Why am I telling you this? Well, I only watched Boys State this past weekend because I own a PS5, and Apple is running a promotion where you get six months of the Apple TV Plus service for free if you log in using the console. It doesn't matter if you've previously subscribed to Apple's streamer. The only strings attached are that it'll auto-renew if you forget to turn it off when the six months are over.",
    "You log in with your Apple details, get the free trial, and you're good to go. That's as simple as these things should always be (here's Sony's official page on it).",
    "Xbox, to its credit, has done something similar with the anime service Funimation Now, which offers two months of the streamer's premium tier for Xbox Game Pass Ultimate subscribers. It's also ran two trial tie-ins with Disney Plus – but that promotion is nowhere near as good as the Apple TV Plus one, since it requires a new Disney Plus account to get it, which is somewhat inconvenient, and the trial only lasts for 30 days. What it should actually do is pause auto-renewal on your account by a month.",
    "Apple and Sony have done it right, here. Six months feels like a genuine treat – and this is a pretty good time to get involved with Apple TV Plus, which has previously suffered from a few quiet spells for content since it launched in late 2019.",
    "The simplicity and length of the trial is what makes this such a good offer. It's a savvy move to get the service into the homes of people who don't normally use Apple's devices, which is where many users have been watching to date – thanks to some extended free trials than have been running since launch.",
    "I don't have an iPhone, and until late last year, the only device I had that even worked with Apple TV was my creaky original iPad Air.",
    "While I've used the streaming service before to watch Mythic Quest in a single 7-day trial stretch, I've never actually paid for it. We're getting close to the point where I would pay for it monthly, but we aren't there yet, which is why this deal is so perfectly timed. The release of Ted Lasso season 2 means it's a lucrative time for a promotion like this – the soccer comedy is largely considered Apple's biggest hit, so this is a way for curious viewers to check it out.",
    "But it also means subscribers get to enjoy future shows like sci-fi blockbuster Foundation (September 24), Will Ferrell/Paul Rudd dark comedy The Shrink Next Door (November 12), or The Morning Show season 2 (September 17), without spending any extra money. These last few months of 2021 are going to be extremely busy for Apple – so this is arguably the best time to date to have an extended trial to the service.",
    "Not all of it looks stellar, but this is as strong a line-up as streamers are likely to get in 2021:",
    "While the Apple TV Plus catalogue is still shallow compared to its older competitors, it's packed with enough stuff to make that six-month trial feel valuable. Next up for me is Beastie Boys Story, another well-reviewed documentary that a colleague described as the \"first great reason\" to get the service, and For All Mankind, the alternate history drama that's drawn a lot of acclaim for its second season this year.",
    "I'm also keen to get through the second season of Mythic Quest, which like season 1, features a flashback episode that's meant to be a real highlight. That show, which is about a game development studio behind a popular MMO, deserves the same popularity as Ted Lasso.",
    "If the service has a strength, it's that it prioritizes big swings above all else – Apple TV Plus isn't about the sheer volume of varied stuff so far like Netflix is. Using the service is more about picking a few shows out that you think you'll like, or that feature a star or two you know. By the end of that six months, you'll know how much of a place it actually has in your streaming life, and you'll have easily binged your personal highlights.",
    "This trial is a good move for all involved. Apple needs to find new viewers outside its own hardware ecosystem, Sony has yet another reason to incentivize buying a PS5 (not that it needed it), and you get to watch Ted Lasso without actually paying for it.",
    "Everyone wins. Just don't forget when your trial ends."
  ],
  "headers": {
    "6": "Why Apple can afford it",
    "11": "Shallow, but solid"
  },
  "links": {
    "IMDb": "https://www.imdb.com/title/tt11095742/",
    "six months of the Apple TV Plus service for free": "https://www.techradar.com/news/apple-tempts-ps5-gamers-with-free-six-months-of-apple-tv-plus",
    "here's Sony's official page on it": "https://www.playstation.com/en-gb/deals/6-months-trial-apple-tv-ps5-offer/",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "iPad Air": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-air-1191350/review",
    "Ted Lasso season 2": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know",
    "Foundation": "https://www.techradar.com/news/foundation-on-apple-tv-plus-release-date-plot-cast-and-what-we-know-so-far",
    "Beastie Boys Story": "https://www.techradar.com/news/beastie-boys-story-is-the-first-great-reason-to-get-apple-tv"
  }
}