{
  "source": "https://www.techradar.com/news/starfield-will-be-an-xbox-series-x-exclusive-new-rumors-suggest",
  "title": "Starfield will be an Xbox Series X exclusive, new rumors suggest",
  "category": "gaming",
  "updated": "2021-05-17T12:42:22Z",
  "author": "adam-vjestica",
  "summary": "Bethesda’s Starfield won’t release on PS5, apparently",
  "article": [
    "Starfield, Bethesda’s upcoming space-faring RPG, is set to be exclusive to Xbox consoles and PC, according to an industry insider.",
    "GamesBeat journalist Jeff Grubb has confidently stated that Starfield won’t be coming to PS5 and PS4 – “period” – and that the game will soon be confirmed as an Xbox and PC exclusive.",
    "In a tweet, Grubb said: “Starfield is exclusive to Xbox and PC. This is me confirming that.”",
    "Starfield’s future on PlayStation platforms has been in doubt ever since Microsoft’s acquired ZeniMax Media, the parent company of Bethesda, for $7.5 billion. It’s led to many suggesting that future Bethesda published titles, which includes the likes of Fallout, Wolfenstein, The Evil Within, The Elder Scrolls and more, will be exclusive to Xbox Series X, Xbox Series S and PC or have some sort of timed-exclusivity moving forward.",
    "Ultimately, though, details on Starfield as a whole are still thin on the ground. The game was revealed at E3 2018 and despite being tipped for a 2021 release, little is known about the single-player RPG. Its exclusivity, then, almost seems like a moot point at this stage.",
    "The lack of information around Starfield isn’t unprecedented for a Bethesda-developed game, though. Fallout 4 was shown at E3 2015 and released just three months later, so there’s a good chance Starfield could follow a similar trajectory. We’d be shocked if Starfield wasn’t shown at this year’s E3, then, which Microsoft is attending.",
    "Microsoft recently added 20 Bethesda titles to its Xbox Game Pass service, and it’s likely that any future games from the studio will release on Xbox Game Pass on day one. That includes Starfield, but it remains to be seen if the game will be released on PS5.",
    "Head of Xbox Phil Spencer has previously said that future Bethesda games will be released on other platforms on a “case by case basis” and that Microsoft would ensure that, “We will want Bethesda content to show up the best as – on our platforms.”",
    "An interesting example of this is Deathloop and Ghostwire: Tokyo, which were announced as PS5 exclusives before Microsoft's acquisition. The games are tipped to come to Xbox Series X at a later date, but we'll have to see how generous Microsoft will be with other Bethesda games moving forward."
  ],
  "headers": {
    "6": "Gazing upon the stars"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "acquired ZeniMax Media": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "The Elder Scrolls": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Fallout 4": "https://www.techradar.com/news/gaming/fallout-4-the-good-the-bad-and-the-ugly-of-the-boston-wastelands-1308511",
    "E3": "https://www.techradar.com/news/e3-2021",
    "20 Bethesda titles to its Xbox Game Pass": "https://www.techradar.com/news/skyrim-comes-to-xbox-game-pass",
    "future Bethesda games": "https://www.techradar.com/news/xbox-will-be-home-to-new-and-exclusive-bethesda-games",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review"
  }
}