{
  "source": "https://www.techradar.com/news/microsoft-teams-is-getting-beauty-filters-but-you-shouldnt-use-them",
  "title": "Microsoft Teams is getting beauty filters, but you shouldn’t use them",
  "category": "computing",
  "updated": "2021-07-14T09:45:54Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams video filters are the last thing we all need",
  "article": [
    "Microsoft is working on a new feature for collaboration platform Teams that will allow users to customize their appearance before joining a video call.",
    "In an update to the product roadmap, the company explains that Teams users will soon gain access to a number of different video filters, which will give them the ability to dial up and down certain aspects of their feed.",
    "“Before joining a meeting, you can use filters to subtly adjust lighting levels and smooth out facial features to customize your appearance,” wrote Microsoft.",
    "The company first announced its intention to introduce video filters in summer last year, but is now targeting an August 2021 release window.",
    "The new Microsoft Teams feature is bound to be useful to a range of users, especially those working out of a dimly lit home office or using a poor-quality webcam.",
    "There is an argument to be made, however, that such a feature could also counteract some of the progress made since the start of the pandemic where expectations of employees are concerned.",
    "By decoupling staff from the carefully controlled office environment, the pandemic has shattered the myth of the perfect office worker - someone who is ever-composed, always well-groomed and unwaveringly professional.",
    "In its place, there is a new acceptance that employees are often juggling multiple other aspects of their life while fulfilling their professional responsibilities; maybe they have children or pets to take care of, or a family crisis to manage.",
    "Before the pandemic, it was newsworthy for a child to interrupt an interview on live television, but interludes during video meetings have become a celebrated norm.",
    "These additional responsibilities might prevent someone from putting on a full face of make-up before a meeting, but the remote working experiment has proved they have little impact on their productivity and quality of work.",
    "The pandemic has changed people’s relationship with work, for both better and worse. But by introducing a feature designed to help workers reconstruct the pernicious illusion of perfection, Microsoft is unintentionally pulling against one of the most positive outcomes: a healthier perspective on the relationship between work and everyday life."
  ],
  "headers": {
    "4": "Myth of the perfect office worker"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "video call": "https://www.techradar.com/best/best-video-conferencing-software",
    "an update": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46194&u1=trd-us-7163632390798907000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-in%2Fmicrosoft-365%2Froadmap%3Ffilters%3DMicrosoft%2520Teams%252CIn%2520development%26searchterms%3D65944",
    "webcam": "https://www.techradar.com/best/best-business-webcams",
    "interrupt an interview on live television": "https://www.youtube.com/watch?v=Mh4f9AYRCZY"
  }
}