{
  "source": "https://www.techradar.com/news/volvos-latest-electric-car-update-gives-the-xc40-recharge-a-free-range-boost",
  "title": "Volvo's latest electric car update gives the XC40 Recharge a free range boost",
  "category": "car-tech",
  "updated": "2021-10-19T16:48:31Z",
  "author": "axel-metz",
  "summary": "XC40 Recharge drivers, rejoice",
  "article": [
    "Volvo is preparing to supply XC40 Recharge drivers with an over-the-air software update that will add a range-enhancing app to their vehicle.",
    "A beta version of the Range Assistant feature, currently available exclusively in the C40 Recharge and Polestar 2, will soon be added to the brand's electric SUV, improving the XC40's battery management and regeneration performance.",
    "Volvo hasn't yet detailed how much extra range XC40 Recharge drivers can expect from the new feature, but this nonetheless marks the Swedish automaker's most significant over-the-air software update yet, and bodes well for its commitment to offering owners of its upcoming electric vehicles over 550 miles of range within five years.",
    "At present, the most premium XC40 Recharge model, the Recharge Twin, offers drivers up to 259 miles of range, a competitive figure when compared to its rivals, which is only set to increase with the addition of Range Assistant.",
    "Drivers won’t need to visit a dealership or workshop to install it, either. By their very nature, over-the-air updates are performed remotely, so all XC40 Recharge owners will need to do is follow the step-by-step instructions that are due to appear on their car’s infotainment screen.",
    "When downloaded, the Range Assistant will appear as a new icon in the main app menu and offer drivers the chance to view electric energy consumption in real time.",
    "Sanela Ibrovic, head of connected experience at Volvo Cars, said in a statement: \"Through in-house development of software and over-the-air updates, we can constantly improve our cars and make sure that your electric Volvo stays fresh.\"",
    "\"The Range Assistant app is a great example of how quick development and deployment of new features can improve the Volvo customer experience every day,\" Ibrovic added.",
    "Volvo says the update will become available to XC40 Recharge owners \"immediately\" and expects all applicable models to be updated by the end of October."
  ],
  "headers": {
    "4": "How to get the range update"
  },
  "links": {
    "C40 Recharge": "https://www.techradar.com/news/volvo-c40-recharge-first-drive",
    "Polestar 2": "https://www.techradar.com/news/polestar-2-review",
    "its commitment": "https://www.techradar.com/news/volvos-fully-electric-cars-will-offer-over-550-miles-of-range-within-five-years"
  }
}