{
  "source": "https://www.techradar.com/news/star-wars-the-bad-batch-trailer-teases-some-awesome-cameos",
  "title": "Star Wars: The Bad Batch trailer teases some awesome cameos",
  "category": "entertainment",
  "updated": "2021-03-30T15:49:51Z",
  "author": "hamish-hector",
  "summary": "\"Strap in kid\"",
  "article": [
    "The Bad Batch is the next animated TV show set in the Star Wars universe. With just one month until its Disney Plus release, fans have now been treated to a new trailer. It’s only two minutes long, but the released footage provides a surprising number of details about the upcoming series - including some surprising cameos.",
    "In the trailer, we see Clone Force 99 (aka The Bad Batch) being put through various tests on what appears to be Kamino – the home planet of the clones – by Grand Admiral Tarkin. It appears that Tarkin and Clone Force 99 don’t get along well though, and it looks like tensions might cause The Bad Batch to defect from the Empire.",
    "As the trailer shows, we’ll also see Clone Force 99 teaming up with some Star Wars characters we've already seen before. A young Saw Gerrera – a prominent Rebel played by Forest Whitaker in Rogue One: A Star Wars Story – and Fennec Shand, who we last saw in The Mandalorian, are just two such individuals.",
    "Shand, who will be played once more by Ming-Na Wen, and she seems to have a prominent role here, perhaps gearing her story up in preparation for The Book of Boba Fett live-action series that she’ll be appearing in later this year.",
    "The trailer also featured a young child, though we still don’t yet know who they are or what role they’ll be playing. We have a feeling they might be important, but we’ll probably have to wait for The Bad Batch to release on May 4 to find out more.",
    "Clone Force 99 earn their title as 'The Bad Batch' because they are a squadron of defective clones. However, rather than being left on the side-lines, the Republic chose to bring them into the field after realizing what makes these clones different is also what makes them a force to be reckoned with.",
    "They first appeared in Season 7 of The Clone Wars animated series where fans were introduced to the team’s members. Their leader - Hunter - has heightened senses making him an excellent tracker, Crosshair is an expert sniper who’s proficient with most blasters, Wrecker is a brute with ridiculous strength, and Tech has a knack for all things mechanical.",
    "They’re also joined by Echo, a clone who was kidnapped by the Separatist Army and experimented on. After being rescued, Echo no longer felt like he could fit in with his old crew and chose to join Clone Force 99.",
    "It looks like the Star Wars Galaxy has a lot to throw The Bad Batch's way and we can't wait to see what they'll face next."
  ],
  "headers": {
    "5": "Who are the Bad Batch?"
  },
  "links": {
    "The Bad Batch": "https://www.techradar.com/news/star-wars-the-bad-batch-release-date-cast-and-what-we-know-about-the-disney-plus-show",
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1108320639141552300&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "Fennec Shand": "https://www.techradar.com/news/new-star-wars-tv-show-features-a-mandalorian-fan-favorite-heres-a-first-look",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know"
  }
}