{
  "source": "https://www.techradar.com/news/windows-10x-could-be-delayed-until-later-in-2021-as-microsoft-tries-to-get-it-right",
  "title": "Windows 10X could be delayed until later in 2021 as Microsoft tries to get it right",
  "category": "computing",
  "updated": "2021-03-19T10:10:10Z",
  "author": "darren-allan",
  "summary": "Microsoft is supposedly making sure the lightweight spin on its OS is ‘ready and robust’",
  "article": [
    "Windows 10X was thought to be arriving earlier in 2021, but now it seems that Microsoft has pushed the launch of its lightweight operating system back to the second half of the year.",
    "Previous chatter from the rumor mill had indicated that Microsoft was aiming for Windows 10X to be launched in the first half of 2021 (in the spring), and indeed in recent times we’ve seen leaks of what was supposedly a nearly finished build of the OS (for single-screen devices, rather than the original target, dual-screen machines). That leakage (and other bits) certainly made it seem like the new spin on the OS might just be imminent.",
    "That’s not the case, according to a reliable Microsoft leaker (and indeed the source of the aforementioned leaked build), Zac Bowden of Windows Central fame, who now claims that his sources are expecting Microsoft to sign off on a finished ready to ship build of Windows 10X in the late spring.",
    "It will be some considerable time later before we actually see the operating system on a (single-screen) laptop that hits the shelves, and Bowden reckons this won’t happen until the second half of the year, as mentioned.",
    "Microsoft is apparently taking some time to fine-tune things and making sure everything is right for the launch, and that the “product is ready and robust for a smooth release”, which sounds like a sensible plan.",
    "The first impressions that Windows 10X makes will be crucial, really, given Microsoft has something of a history of going awry with lightweight versions of its desktop OS (just look at Windows 10 S, or indeed Windows RT). Any perceived weak spots in Windows 10X could lead to it immediately being written off as another streamlined spin that fails to hit the mark just like those previous efforts.",
    "Bowden further informs us that Microsoft will launch Windows 10X initially on low-cost single-screen laptops aimed at the education and enterprise sectors. In other words, don’t get excited about seeing 10X on consumer notebooks in its initial form – it may be some time afterwards before the OS is introduced for consumer-targeted portables – if Bowden is right.",
    "Microsoft is, of course, delivering the big Windows 10 21H2 update with a total revamp of the desktop interface, and that’ll have to be enough to keep consumers happy, it would seem.",
    "Finally, Bowden underlines the fact that Microsoft is taking the extra time to hone and tweak Windows 10X, and not to introduce new features – if you were wondering whether support for traditional Windows applications (Win32 apps) was going to be added in time for launch. Rumor still holds that this will be a post-launch addition, and the last speculation we heard was that 2022 was the target date for this happening."
  ],
  "headers": {
    "5": "First impressions last"
  },
  "links": {
    "Windows 10X": "https://www.techradar.com/news/windows-10x",
    "what was supposedly a nearly finished build of the OS": "https://www.techradar.com/news/windows-10x-leak-shows-us-microsofts-os-in-all-its-glory-but-with-some-apparent-disappointments",
    "and other bits": "https://www.techradar.com/news/windows-10x-shown-running-on-a-surface-pro-7-and-it-looks-pretty-cool",
    "Windows Central": "https://www.windowscentral.com/microsoft-eyes-windows-10x-launch-later-year",
    "Windows 10 S": "https://www.techradar.com/news/windows-10-cloud-release-date-news-and-rumors",
    "total revamp of the desktop interface": "https://www.techradar.com/news/windows-10-will-get-a-whole-new-look-in-2021",
    "2022 was the target date for this happening": "https://www.techradar.com/news/windows-10x-could-launch-early-next-year"
  }
}