{
  "source": "https://www.techradar.com/news/sony-fx3-vs-sony-a7s-iii-which-is-the-best-4k-camera-for-you",
  "title": "Sony FX3 vs Sony A7S III: which is the best 4K camera for you?",
  "category": "cameras",
  "updated": "2021-02-28T18:48:14.217Z",
  "author": "mark-wilson",
  "summary": "How do Sony's two best compact 4K cameras compare?",
  "article": [
    "The Sony FX3 has just officially landed – and on paper, it's one of the best compact cinema cameras you can buy.",
    "But the FX3 is also potentially confusing for anyone in the market for a small, pro video camera. After all, Sony already makes one of its closest rivals, the excellent Sony A7S III. So what's the difference between the two cameras, and which should you buy?",
    "The FX3 is effectively a redesigned version of the A7S III, so there are actually more similarities than differences between the two cameras. The FX3 is also the first camera to straddle the line between Sony's Cinema and Alpha camera lines, which traditionally separate its video and stills-focused cameras.",
    "But even though the Sony FX3 has an Alpha badge, it is a more filmmaking-focused camera than the A7S III. So we've rounded up the six key ways its differs from the A7S III to help you split the two highly capable cameras and decide which one suits your shooting style the best.",
    "Yes, the Sony FX3 and A7S III share the 12.1MP full-frame same sensor and Bionz XR processor, but they also differ in a few key ways...",
    "The main clue that the Sony FX3 is even more video-focused than the A7S III is its design. The Sony A7S III is mainly renowned for its video skills, but its body is based on the traditional Alpha style that's grown from Sony's still cameras. This means it has a viewfinder hump and that signature black finish.",
    "The FX3 drops the electronic viewfinder, a decision that may also put off some filmmakers, in favor of a smaller body that's designed for run-and-gun filmmaking, particularly using its detachable handle.",
    "The FX3 is still beefier and heavier than a mirrorless camera like the Sony A6600, but not by much – and it looks small compared to DSLR-sized rivals like the Canon EOS C70.",
    "In practice, the size difference between the FX3 and A7S III will be negligible, with the cameras respectively weighing in at 715g and 699g (including batteries). Instead, the design differences are simply tailored towards different shooting styles...",
    "While it's possible to add a cage to the Sony A7S III, it's mainly designed to be used handheld in a similar style to a stills camera – and that's where it differs from the FX3.",
    "The FX3 comes bundled with a detachable handle, which isn't just for holding the camera steadily from above. This handle also includes twin XLR/TRS terminals, which are the standard for pro audio – and are something that the A7S III lacks out of the box.",
    "Sony does sell an XLR adapter kit, which lets you add two XLR jacks to A7S III, but it's expensive and arguably a little more clunky than the handle that comes with the FX3. Out of the box, there's no doubt the FX3 is the more advanced camera for those who need high-quality audio to go with their 4K video.",
    "A couple of other potential advantages for filmmakers on the FX3 are its inclusion of a tally lamp and zoom lever, which are both lacking on the Sony A7S III.",
    "A tally lamp is a small light that lets both the camera operator and subjects know that the camera's recording. The Sony A7S III doesn't have this, though there is an alternative in the form of its 'Emph display during rec' option in the menus, which puts a red frame around the screen when you're recording.",
    "Slightly more curious is the FX3's inclusion of a zoom lever. We say curious because only two Sony lenses – the FE PZ 28-135mm f/4 and FE C 16-35mm T3.1 – currently have a built-in power zoom motors that will work with this lever.",
    "But Sony says that its electronic Clear Image Zoom function – which lets you get 2x zoom with any lens by intelligently creating pixels, rather than simply cropping – is very popular with pro filmmakers, and this function will also work with the FX3's zoom lever.",
    "The Sony A7S III impressed us with its ability to handle the heat generated from recording long 4K clips – in fact, we were able to shoot continuous 4K video for well in excess of 30 minutes and didn't once see an over-heating warning.",
    "But the Sony FX3 promises to take this even further thanks to its inclusion of an active cooling fan. It's not the only small, full-frame camera with a fan like this – the Panasonic Lumix S1H also has a fan chamber to help it shoot video for longer periods. And like the S1H, the FX3's fan doesn't affect its resistance to moisture or dust, either.",
    "But it does mean that the FX3 is promising completely 'uninterrupted' 4K/60p shooting, which might push it ahead of the A7S III for those who regularly shoot long clips like one-shots or interviews.",
    "The FX3 also has the same 13-hour maximum continuous recording time as the A7S III. All of which means that card capacities and battery life are likely to be more of a limiting factor than overheating.",
    "Another useful, filmmaker-friendly design feature on the FX3 are its thread holes, which effectively mean it has a built-in cage to help you turn it into a mobile video rig.",
    "You get five of these 1/4-20 UNC thread holes on the body, and a further three on the bundled handle. Unlike the Sony A7S III, this means you're unlikely to need to add a cage in order to add accessories like a cold-shoe mount for adding, for example, a wireless microphone to your setup.",
    "It's possible to get a similar setup on the A7S III with an additional cage, but it's another example of how much more pro video-oriented the Sony FX3 is out of the box compared to its Alpha counterpart.",
    "The Sony A7S III is more affordable than the FX3, and not just because it's a little older, having arrived in July 2020.",
    "The A7S III's recommended retail price back then was $3,499 / £3,800 / AU$5,999 and it hasn't really shifted from that yet. The FX3 is a fair chunk pricier at $3,899 / £4,200 (around AU$7,485).",
    "But when you factor in the price of an XLR adapter for the A7S III, which comes bundled with the FX3, then the two costs around the same. This makes sense, as the FX3 lacks a viewfinder, but compensates with features like active cooling. Which means your choice between the two is likely more down to your shooting style than your budget.",
    "The Sony FX3 and Sony A7S III are variants on the same concept – they're both small, 4K full-frame cameras that are particularly strong in low-light and offer highly compact setups for solo shooters.",
    "But while the FX3 is capable of shooting stills, there's no doubt it's the more video-oriented cinema camera. It has the bundled handle, XLR audio jacks and active cooling that make it, on paper, a more complete camera for filmmakers out of the box.",
    "While those who splashed out the A7S III might feel slightly aggrieved that the FX3 has arrived just six months on, they will largely be hybrid shooters with slightly different needs.",
    "Sony says the A7S II remains targeted at those who need a mix of video and stills, like wedding photographers who don't need to make large prints, concert photographers and astrophotographers. For those kind of shooters, the A7S III's 4K video powers are important, but the FX3 is a camera that's really built around them.",
    "It's a subtle difference, but we're looking forward to seeing how the Sony FX3 stacks up against other rivals like the Canon EOS C70 and Blackmagic Pocket Cinema Camera 6K Pro soon."
  ],
  "headers": {
    "5": "1. The FX3 is smaller, but lacks a viewfinder",
    "9": "2. The FX3 comes with a handle that has XLR ports",
    "12": "3. The FX3 has a tally lamp and zoom lever",
    "16": "4. The FX3 has cooling fans for longer record times",
    "20": "5. The FX3 has built-in thread holes for accessories",
    "23": "6. The Sony FX3 is pricier than the A7S III",
    "26": "Takeaway"
  },
  "links": {
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Canon EOS C70": "https://www.techradar.com/news/canon-eos-c70-is-a-cross-between-a-canon-eos-r5-and-cinema-camera",
    "Blackmagic Pocket Cinema Camera 6K Pro": "https://www.techradar.com/news/blackmagic-pocket-cinema-camera-6k-pro-arrives-with-flagship-filmmaking-tools"
  }
}