{
  "source": "https://www.techradar.com/news/microsoft-has-edged-out-internet-explorer-in-new-windows-10-preview",
  "title": "Microsoft has Edged out Internet Explorer in new Windows 10 Preview",
  "category": "computing",
  "updated": "2021-05-25T13:00:14Z",
  "author": "daryl-baxter",
  "summary": "One browser to run them all",
  "article": [
    "Microsoft has removed its legacy Internet Explorer browser from the latest preview build of Windows 10, with only Microsoft Edge now the default web browser available to use.",
    "For a browser that belonged more in the 90s than the present day, it made less and less sense for Internet Explorer to be kept alive, especially with the advancements that the Edge browser now has.",
    "So, with it being built on a very old foundation, it’s not surprising to already see it disappear from the Insider Dev Channel. While it may be a source of nostalgia for some, it was a bugbear for many others.",
    "Since Microsoft announced that Windows 10 would be an ongoing platform instead of being succeeded by a Windows 11 in the future, there would be major updates released to the operating system over the years. But the Insider program was a way of allowing users to download versions of Windows 10 in development with new features, before they would be rolled out into the official channels.",
    "It’s also allowed events such as the Bug Bash program to reward users in finding any bugs through a series of tasks. It's also said to be showcasing the upcoming features that Build 2021 may be announcing.",
    "This also applies to depreciated applications, such as Internet Explorer. Its Insider developer build version 21387 states that ‘The Internet Explorer 11 desktop application is now retired as of this Insider Preview build.’",
    "With Microsoft Edge now being the company’s default browser since 2015, it didn’t make sense to have two browsers being installed concurrently on Windows 10, even though Internet Explorer is officially retiring next year.",
    "Internet Explorer has always been seen as the black sheep of Microsoft’s product line, ever since version 6.5. It’s hard to imagine that Microsoft didn’t have a browser with tabbed windows until Mozilla’s Firefox browser forced its hand back in 2006.",
    "Microsoft Edge is seen as a fresh start in the company’s web browser space. Internet Explorer has far too many negative connotations, which means it’s a bit of a surprise that it’s lasted as long as it has.",
    "However, time will tell if Edge will ever regain the market share that Internet Explorer once held, especially with the many varied platforms that we use to browse the web in these modern times.",
    "Via CNET"
  ],
  "headers": {
    "3": "Which Build is Internet Explorer disappearing from?",
    "7": "Analysis: A tale of two browsers"
  },
  "links": {
    "Bug Bash program": "https://www.techradar.com/news/microsoft-relaunches-bug-bash-challenge-for-windows-insider-how-to-enter",
    "Build 2021": "https://www.techradar.com/how-to/how-to-watch-the-microsoft-build-2021-keynote-live",
    "Insider developer build version 21387 states that": "https://blogs.windows.com/windows-insider/2021/05/21/announcing-windows-10-insider-preview-build-21387/",
    "officially retiring next year": "https://www.techradar.com/news/microsoft-officially-retiring-internet-explorer-next-year-moving-on-to-edge",
    "CNET": "https://www.zdnet.com/article/microsoft-drops-ie-11-with-latest-windows-10-preview/"
  }
}