{
  "source": "https://www.techradar.com/news/windows-10-could-be-getting-a-modern-redesign",
  "title": "Maybe Windows 11 won't be as ugly as Windows 10",
  "category": "computing",
  "updated": "2021-06-14T14:53:42Z",
  "author": "jess-weatherbed",
  "summary": "Out with the old, in with the new update",
  "article": [
    "Over the last few months we've heard whispers regarding project 'Sun Valley' (officially Windows 10 21H2), a huge upcoming update expected to overhaul many aspects of the existing operating systems user interface. A job listing for a 'Senior Program Manager' role from back in April 2021 was discovered by Windows Latest on the Microsoft careers website hints towards progress on this, with responsibilities listing \"you will be building new parts and modernizing existing parts of the Windows UX, conducting user research to understand users’ needs.\" It's been suggested that the upcoming Sun Valley refresh will officially be renamed as Windows 11, though this is just speculation right now. We do know that Microsoft is planning to end all support for Windows 10 by October 14 2025, so it would make little sense to put this much work into the current Windows 10, but we're expecting to find out more on June 24 when Microsoft will be holding a special event for \"the next generation of Windows.\"",
    "It was originally claimed that Windows 10 would be the \"last version of Windows,\" which makes the current pool of rumors and leaks a little confusing, but this could remain technically true if Windows 11 (also speculated to be called 'Windows 365', or simply 'Windows') is actually a massive overhaul of the existing Windows 10 framework, rather than an entirely new operating system built from the ground up. The job role is no longer taking applications, but the position also mentions that the position is within the Windows shell team, stating \"the Windows team builds the core interaction experiences in Windows – these range from iconic UI like Start & Taskbar to the touch, voice, and pen+ink interaction models, as well as features like snap and windowing.\" We know that Windows 10 21 is a sizeable update, currently expected to release in late 2021. Given Microsoft typically has at least two major updates every year, it's still possible that these updated features being refreshed in Windows 10 are actually a means of testing the waters prior to an entirely new OS being released. We've seen plenty of fan-made mockups for the Sun Valley refresh that do look delightful, but we ultimately won't know what this refresh will look like until it rolls out. It's likely that members of the Windows Insider Program will be the first to see the updated designs given that most updates are tested in this way before a full rollout. You can sign up for yourself if you want to get an early heads up for these anticipated changes, as well as other future Microsoft updates before they go live to the general public."
  ],
  "headers": {
    "1": "What should we expect?"
  },
  "links": {
    "'Sun Valley'": "https://www.techradar.com/news/windows-10-21h2-update",
    "A job listing for a 'Senior Program Manager'": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8907795176862608000&xs=1&url=https%3A%2F%2Fcareers.microsoft.com%2Fus%2Fen%2Fjob%2F1019115%2FSenior-Program-Manager&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-10-could-be-getting-a-modern-redesign",
    "Windows Latest": "https://www.windowslatest.com/2021/06/14/microsoft-wants-to-modernize-existing-parts-of-windows-10-ux/",
    "Windows 11": "https://www.techradar.com/news/windows-11/news/did-microsoft-just-tease-windows-11-at-build-2021",
    "end all support for Windows 10": "https://www.techradar.com/news/microsoft-is-planning-to-kill-off-windows-10-in-2025-does-this-confirm-windows-11",
    "the next generation of Windows": "https://www.techradar.com/news/did-microsoft-just-tease-windows-11-at-build-2021",
    "last version of Windows": "https://www.techradar.com/news/software/operating-systems/microsoft-confirms-there-will-be-no-windows-11-1293309",
    "fan-made mockups for the Sun Valley": "https://www.techradar.com/news/is-this-what-the-future-of-windows-10-will-look-like",
    "Windows Insider Program": "https://insider.windows.com/en-us/"
  }
}