{
  "source": "https://www.techradar.com/news/xiaomi-could-have-a-new-tablet-coming-to-rival-the-entry-level-apple-ipad",
  "title": "Xiaomi could have a new tablet coming to rival the entry-level Apple iPad",
  "category": "tablets",
  "updated": "2021-02-08T17:19:54Z",
  "author": "tom-bedford",
  "summary": "A new mid-range Android tablet.",
  "article": [
    "If you're looking for a mid-range tablet you'll find one of Apple's entry-level slates, like the iPad 10.2 (2020), one of your only choices, due to the slim pickings of that market segment. However that might be able to change soon thanks to Chinese tech company Xiaomi.",
    "Xiaomi stopped making tablets in 2018, but that's changing in 2021 according to company CEO Lei Jun. Speaking in a video posted on the company's Weibo page (a Chinese social media network), Jun confirmed that the company is reviving both its tablet and Mi Mix phone lines this year.",
    "The last Xiaomi tablets were the Mi Pad 4 and 4 Plus in 2018, which were low-cost Android slates with specs to match. The Mi Mix line were smartphones that sat below the company's Mi line, but above its Redmi budget phones, and the last time we saw those was in early 2019 with the Mi Mix 3 - that's not including the Mi Mix Alpha, a concept device that never launched outside China, which had a screen that wrapped nearly all the way around the phone's body.",
    "In the last few years Xiaomi has made a name for itself as a champion of the mid-range smartphone market, with handsets like the Mi 10T Pro, Mi Note 10 and Poco F2 Pro bringing top specs at relatively low prices.",
    "However we've also seen the company tip-toeing into the pricier premium category too, with phones like the Xiaomi Mi 10 Pro. With the revival of the Mi Mix line, the company could continue to produce mid-range phones while more clearly positioning the standard Mi line as top-end devices.",
    "Perhaps the more intriguing news, though, is Xiaomi's tablet ambitions. As we've mentioned, there aren't too many mid-range tablets to choose from right now, with Apple's entry-level iPad line ruling the roost. If Xiaomi could replicate its smartphone formula, and put out a tablet with good specs but a relatively low cost, it could give Apple a run for its money in the more affordable end of the market.",
    "We still need to see if Jun's announcements are referring to Xiaomi's global plans, though - the company often announces products solely for the Chinese market, and doesn't launch them worldwide.",
    "Time will tell exactly what Xiaomi plans for both tablets and smartphones are this year, and when we hear more we'll be make sure to bring it to you."
  ],
  "headers": {
    "3": "Why this is big"
  },
  "links": {
    "iPad 10.2 (2020)": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "company's Weibo page": "https://weibo.com/1771925961/K0RnI2fZw?type=comment",
    "Mi Mix 3": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
    "Mi Mix Alpha": "https://www.techradar.com/news/mi-mix-alpha-xiaomis-curved-oled-concept-is-fresh-but-lacks-a-purpose",
    "Mi 10T Pro": "https://www.techradar.com/reviews/xiaomi-mi-10t-pro-review",
    "Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review",
    "Poco F2 Pro": "https://www.techradar.com/reviews/xiaomi-poco-f2-pro-review",
    "Xiaomi Mi 10 Pro": "https://www.techradar.com/reviews/xiaomi-mi-10-pro-review"
  }
}