{
  "source": "https://www.techradar.com/news/wolverine-on-ps5-will-have-a-mature-tone-befitting-the-fan-favorite-character",
  "title": "Wolverine on PS5 will have a 'mature tone' befitting the fan-favorite character",
  "category": "gaming",
  "updated": "2021-09-13T11:47:49Z",
  "author": "vic-hood",
  "summary": "Opinion: He's the best at what he does, but what he does isn't very nice",
  "article": [
    "Further details on Marvel's Wolverine are slowly trickling out, following the PS5 exclusive's announcement at the PlayStation Showcase last week. The latest news will likely not come as a surprise to those who have watched the short teaser trailer for Insomniac Games' Wolverine game - but may prove a relief for Marvel fans.",
    "According to Marvel's Wolverine's Creative Director, Brian Horton, James 'Logan' Howlett's standalone adventure on PS5 will be a full-size game with a \"mature tone\". Horton confirmed this in response to a fan on Twitter asking whether Wolverine on PS5 will be \"big or a 'miles morales' size game\".",
    "There has already been speculation that Marvel's Wolverine will offer a more mature tone than Insomniac Games' Spider-Man titles, with the teaser trailer for the title featuring knife-wielding thugs, alcohol and bloody knuckles. But, as a Marvel fan, it's a relief to have confirmation that the Wolverine game will have a tone befitting its brooding protagonist.",
    "Wolverine arguably has one of the saddest and darkest origin stories of any Marvel character (with Magneto claiming my personal first spot). His backstory sees him killing both his biological father and childhood friend with the bone claw mutation that he can't control, living with wolves, and undergoing excruciating experiments as part of the Weapon X program that sees his bones being fused with adamantium - and that's just some highlights. It's a series of events that ultimately lead to the brooding, grizzled Logan many of us are familiar with.",
    "It's unclear exactly when Marvel's Wolverine will be set in Logan's timeline. But, in the teaser trailer, we see Wolverine unleashing his metallic claws which means that we can likely expect Insomniac's Wolverine game to be set sometime after the Weapon X program.",
    "The teaser trailer shows a destroyed bar, with injured men lying on the floor, before cutting to a back view of a man in a cowboy hat and checkered shirt drinking at the bar - his knuckles and surrounding area covered in blood. In the background, we see one of the injured men getting up and pulling out a knife. Sensing the assailant, the man at the bar, clenches his fist, resulting in long metallic claws appearing from them.",
    "When Insomniac unveiled Marvel's Wolverine, I had a degree of trepidation about it, even though the trailer seemed to hint at a more mature tone. While Marvel's Spider-Man and Miles Morales are critically acclaimed, there's no denying they're pretty family-friendly - after all, Spider-Man himself is your \"friendly neighborhood Spidey\". Wolverine, however, is a different character altogether and his dark past makes him a more interesting (albeit troubled) character.",
    "Telling that story in a more \"family-friendly\" way simply wouldn't do it (or the character) the justice it deserves. Sure, we've seen Wolverine make his way to film and TV with little bloodshed shown, but it's about time the character was explored with no limitations (more akin to 2017's Logan film) for an adult audience. After all, Wolverine's catchphrase is: \"I'm the best there is at what I do, but what I do best isn't very nice\" and the brutality of his mutation is such a key aspect of his character and backstory.",
    "The confirmation that Wolverine on PS5 will have a mature tone comes as a relief, then. I can't wait to see how Insomniac Games brings Logan to life and explores his story with its own fresh take."
  ],
  "headers": {
    "3": "Opinion: a dark origin story"
  },
  "links": {
    "Marvel's Wolverine": "https://www.techradar.com/news/marvels-wolverine",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PlayStation Showcase": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "Twitter": "https://twitter.com/BrianHortonArt/status/1437066535839809544?s=20"
  }
}