{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-wont-work-with-iphone-and-thats-not-the-only-problem",
  "title": "Samsung Galaxy Watch 4 won’t work with iPhone, and that's not the only problem",
  "category": "wearables",
  "updated": "2021-08-12T13:49:15Z",
  "author": "james-rogerson",
  "summary": "A bad start",
  "article": [
    "The Samsung Galaxy Watch 4 and Samsung Galaxy Watch 4 Classic could be two of the most exciting smartwatches we’ve seen in years, packing a new version of Wear OS, a new chipset, and new health features. But if you have an iPhone you won’t be able to experience any of this.",
    "Samsung confirmed as much to ArsTechnica, saying that you won’t be able to pair an iPhone with either the Galaxy Watch 4 or the Samsung Galaxy Watch 4 Classic. That’s a major change, as previous Samsung Galaxy Watch models did work with iPhone (and will continue to do so according to this report).",
    "Of course, these new ones run Wear OS rather than Tizen, but previous Wear OS watches also work with iOS, so it’s still a surprising change. What’s not yet clear is whether other watches running the new version of Wear OS (dubbed Wear OS 3) will work with iPhones or not, but we’d guess they won’t, otherwise this would be an even odder restriction for Samsung to place on its new wearables.",
    "That said, it's worth noting that the Galaxy Watch 4 range runs a modified version of Wear OS 3 dubbed One UI Watch 3, so it's possible that's causing iOS compatibility issues that won't be present in other Wear OS 3 watches.",
    "But that’s not the only problem potential buyers might encounter, as Samsung also confirmed to Android Central that many of the health tracking features – including the ECG, blood pressure monitoring, and body composition – will only work if you pair a Galaxy Watch 4 or Watch 4 Classic with a Samsung smartphone.",
    "This is less surprising, since Samsung placed similar restrictions on previous models in the range, but it does mean that some of the key selling points won’t be available to most Android users.",
    "Finally, these watches also seemingly won't work with most Huawei phones, as they require a handset with Google Mobile Services, which all remotely recent Huawei ones lack.",
    "Wear OS has so far had a bumpy ride, with smartwatches that run it often suffering from poor performance, and Google not updating the platform as often as it probably should have done. With the new Wear OS 3 the company has the chance to revitalize the platform, but to do that it needs as few barriers to entry as possible.",
    "A lack of iOS support then is a big problem, given how many people own iPhones. And sure, most of them would probably buy an Apple Watch, but by making Wear OS a tempting alternative, Google and Samsung could probably convert a good number of buyers.",
    "Of course, it remains to be seen whether Wear OS 3 will support iOS on other smartwatches, but we’re not optimistic.",
    "Samsung’s decision to limit features to users of Samsung phones meanwhile will hurt the Galaxy Watch 4 range more than Wear OS as a whole, but with these watches being the first and currently only ones to run Wear OS 3, all eyes are going to be on them, so this isn’t a great first impression.",
    "There may be technical reasons for some of this, but none of it inspires confidence that Wear OS will finally be a platform to rival watchOS – or even Tizen."
  ],
  "headers": {
    "7": "Analysis: these restrictions are the last thing Wear OS needs"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review",
    "ArsTechnica": "https://arstechnica.com/gadgets/2021/08/samsung-announces-new-galaxy-watch-4-drops-ios-support/",
    "Wear OS 3": "https://www.techradar.com/news/wear-os-3-name-announced",
    "Android Central": "https://www.androidcentral.com/galaxy-watch-4-health-features-only-available-samsung-galaxy-phones",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch"
  }
}