{
  "source": "https://www.techradar.com/news/why-the-fossil-gen-6-didnt-convince-me-to-switch-away-from-my-apple-watch",
  "title": "Why the Fossil Gen 6 didn't convince me to switch away from my Apple Watch",
  "category": "wearables",
  "updated": "2021-10-10T21:00:08Z",
  "author": "david-lumb",
  "summary": "The Fossil Gen 6 is good, but Wear OS isn’t good enough",
  "article": [
    "As I tested the new Fossil Gen 6 smartwatch, I was struck by how Wear OS has calcified into a middling software platform that really hasn’t convinced me to move away from my iOS ecosystem. I’m not saying the Apple Watch is for everyone, but it still feels like the best option out there, and I’m not convinced to switch.",
    "Unfortunately, my opinion is largely affected by the odd territoriality of smartwatches and phone operating systems: Apple Watches only work with iPhones, while the latest Samsung Galaxy Watch 4 only works with Androids (bucking its predecessor’s trend of multi-OS compatibility). The watches that support both mobile operating systems, however, are stuck with Wear OS 2.0, which hasn’t been upgraded in years.",
    "It’s an unfortunate reality, and one that forces consumers to pick their exclusive ecosystem in ways that are as unnecessary as they are embarrassingly retrograde. It’s never been cool for Apple to keep Apple Watch compatibility solely with iOS devices, though we can begrudgingly understand how much more seamless you can make interactions by focusing on just your in-house operating system. But locking Galaxy Watch 4 out of iOS feels like a loss, especially as it prevents the new Wear OS 3 from going toe-to-toe with watchOS.",
    "The Fossil Gen 6 is the compromise that works with both Android and iOS devices, but unfortunately, it won’t be upgraded to Wear OS 3 until 2022. In the meantime, prospective buyers are stuck in a limbo of dealing with the current Wear OS 2.0, which hasn’t had a big refinement in years, while they wait for new features and integrations with Android 12 (like a watch face that matches your phone color palette through Material You).",
    "All of the Fossil Gen 6’s speed via its Snapdragon Wear 4100 Plus chipset is wasted on an aging interface – those smooth transitions are only switching between some basic downloaded-by-default apps. I also have to manually reconnect the watch to my iPhone on a somewhat frequent basis, a condition that may not extend to Android phones. And it’s not like switching to a Samsung Galaxy Watch 4 is a good alternative – I’d literally have to switch phone operating systems, which is easy to do as a reviewer but a hard ask for most consumers, especially since some features are only accessible if you have a Samsung phone.",
    "And really, what I’m arguing here isn’t about what is the absolute best smartwatch you can buy – I’m talking about inertia, and that there isn’t much of a reason to switch away from a setup that works because watch evolution seems even more glacial than it is in phones. By and large, smartwatches didn’t get any big new features in 2021, and the year before only added blood oxygen measurements via SpO2 sensors, following the wide adoption of ECG in 2019 – which are important features for users specifically concerned about sleep apnea or heart arrhythmia, but not terribly useful for most folks.",
    "Instead, what keeps me using my Apple Watch 5 is inertia, and the lack of an exciting reason to upgrade, let alone jump to a Wear OS watch. What would it take? The same continuous connection with my phone, for starters, but also some of the other benefits of seamless integration, like intuitively adopting the same Focus mode as my iPhone is set to (or at least going on Do Not Disturb), integrating my calendar appointments, and sharing simple tasks like timers. Having an app to work as a shutter button for the phone’s cameras is the kind of touch I'm talking about.",
    "It’s a shame, as I genuinely think the Fossil Gen 6 and Samsung Galaxy Watch 4 are the classiest smartwatches you can buy – they have the panache of traditional timepiece design that’s absent on the bulbous, squared-off Apple Watch. In many ways, the Fossil Gen 6 is the best traditional-looking watch we’ve gotten that still works with iOS and Android phones (just above the TicWatch Pro 3, in my opinion), but I ultimately value interoperability more than looks.",
    "Other folks might think differently, and that’s okay – in this post, at least, I’m not trying to steer buyers in one direction or another. (If you’re on the hunt, check our best smartwatches page for actual buying advice.) But the wearable market’s options are few, and even fewer now that Samsung has folded its Tizen OS into Google’s Wear OS 3. If you haven’t felt motivated to upgrade to a new, pricey smartwatch, I don’t blame you – and I’m waiting just as much to get swept off my feet with showstopping watch features."
  ],
  "headers": {
    "5": "My Apple Watch stays until I have a good reason to switch"
  },
  "links": {
    "Fossil Gen 6": "https://www.techradar.com/news/fossil-gen-6-smartwatch-release-date-price-news-and-features",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Wear OS 3": "https://www.techradar.com/news/wear-os-3-name-announced",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "TicWatch Pro 3": "https://www.techradar.com/reviews/ticwatch-pro-3",
    "best smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074"
  }
}