{
  "source": "https://www.techradar.com/news/aquaman-2s-cast-tease-that-filming-may-begin-very-soon",
  "title": "Aquaman 2's cast tease that filming may begin very soon",
  "category": "entertainment",
  "updated": "2021-04-20T15:26:35Z",
  "author": "tom-power",
  "summary": "Ocean Master and Mera are ready to ride the waves in Aquaman 2",
  "article": [
    "Aquaman 2, the follow-up to Warner Bros.' $1 billion grossing superhero film starring Jason Momoa, appears to be ramping up preparations ahead of filming.",
    "The movie won't be out until late next year, but it seems like the cast from the first film are preparing to reprise their roles if some recent Instagram posts are anything to go by.",
    "Patrick Wilson, who portrayed the villainous Orm Marius/Ocean Master in Aquaman, confirmed that he would be returning for the sequel via social media. The Conjuring and Watchmen actor posted an image of his first day of training for the role alongside a caption that could hint at where Orm's allegiances lie in Aquaman 2.",
    "Check out Wilson's post below:",
    "Wilson's revelation comes a day after Amber Heard, who played Mera in the aquatic DCEU movie, also teased her involvement in Aquaman 2. The actress posted a picture of her reading a book on a film set, with part the image's caption containing the hashtag #gettingakindleforAquaman2.",
    "You can see Heard's Instagram post below:",
    "While he was the adversary of Arthur Curry - aka Aquaman - in the first film, it's possible that Orm may be his ally in the sequel.",
    "For those who may have forgotten, Aquaman's finale saw Arthur defeat Orm in a one-on-one contest after the pair's armies had clashed for the fate of Atlantean throne. Aquaman spares his half-brother's life, and Orm accepts being imprisoned for his crimes after Arthur confirms that their mother Atlanna (Nicole Kidman) is alive and well.",
    "Right now, it's unclear what role Orm will have in director James Wan's sequel. However, a hashtag in Wilson's Instagram post may allude to the possibility that he'll be a good guy in Aquaman 2. As part of his post, Wilson has written #brothersdontshakehandsbrothersgottahug, which might imply that Orm and Arthur will be on good terms at some point in Aquaman 2.",
    "It's certainly a possibility, and one that has previous for happening in DC comics. In DC's Mera: Queen of Atlantis comic run, Orm temporarily finds himself on a path to redemption before returning to his villainous ways. Aquaman 2 could borrow from this series run and bring Orm to the good side, albeit in a short-term capacity.",
    "Wilson's and Heard's social media posts come a month after a Discussing Film report, which alleges that filming on Aquaman 2 will begin in the UK in June 2021. The duo and Momoa are said to be joined by Pilou Asbaek for the sequel, too, with Deadline claiming that the Game of Thrones actor is in talks to feature in some capacity.",
    "Aquaman 2 is currently set to land in theaters on December 16, 2022."
  ],
  "headers": {
    "6": "Orm may join Mera as Arthur Curry's ally in Aquaman 2"
  },
  "links": {
    "Discussing Film": "https://discussingfilm.net/2021/03/12/aquaman-2-eyes-june-2021-filming-start-in-uk-exclusive/",
    "Deadline": "https://deadline.com/2021/04/aquaman-2-game-of-thrones-pilou-asabek-jason-momoa-1234735236/"
  }
}