{
  "source": "https://www.techradar.com/news/this-upcoming-smartwatch-will-have-an-in-depth-soccer-tracking-mode",
  "title": "This upcoming smartwatch will have an in-depth soccer tracking mode",
  "category": "phones",
  "updated": "2021-03-01T09:27:31Z",
  "author": "tom-bedford",
  "summary": "Red Magic, or black-and-white magic?",
  "article": [
    "When we first heard about the Nubia Red Magic Watch, we presumed it was a gaming-themed smartwatch - that would keep it in fitting with Red Magic's gaming niche. However, a new confirmed feature shows it could be great for soccer players.",
    "Nubia president Ni Fei has been teasing the Red Magic Watch frequently on his Weibo account (a Chinese social media platform) so we know lots of details from that, but this new piece of information was reported by GizChina.",
    "The Red Magic Watch is apparently set to have a mode that tracks you through a match of the game, and will provide you with a heat map of your performance, including details like where you ran for the match, and the conditions of the game.",
    "This isn't the first soccer mode we've seen as Google Fit has an option for tracking your performance for the game, but it only captures limited statistics like time and heart rate. Red Magic's mode sounds like the first really in-depth soccer-focused tracking software we've seen.",
    "We've heard the Nubia Red Magic Watch will have a grand total of 16 sports tracking modes including soccer, basketball and cricket, as well as the standard ones you see on most smartwatches like running, swimming and cycling.",
    "Could these other ball game modes return as detailed information as the soccer tracking? Possibly, but it hasn't been confirmed for now either way.",
    "The watch is waterproof up to 50 meters, useful for swimmers (the swim-tracking modes would be a little useless otherwise), and has a battery life of 15 days, though we'd imagine daily soccer games could drain it a bit faster than that.",
    "We're expecting the Nubia Red Magic Watch to formally launch on March 4, alongside the Red Magic 6 gaming smartphone, and when it does we'll bring you all the details on this curious new device."
  ],
  "headers": {
    "4": "Other sports modes?"
  },
  "links": {
    "we presumed it was a gaming-themed smartwatch": "https://www.techradar.com/news/could-this-be-the-first-gaming-focused-smartwatch",
    "Weibo": "https://weibo.com/niflyhigh?is_all=1#_rnd1614589621229",
    "GizChina": "https://www.gizchina.com/2021/02/28/red-magic-smartwatch-supports-the-first-football-sports-mode/",
    "Google Fit": "https://www.techradar.com/news/google-fit-all-about-the-smartwatch-and-phone-fitness-app-and-what-sports-it-tracks",
    "Red Magic 6": "https://www.techradar.com/news/nubia-red-magic-6-gaming-phone-launches-soon-and-some-features-have-been-teased"
  }
}