{
  "source": "https://www.techradar.com/news/microsoft-fixes-one-of-windows-10s-most-annoying-bugs",
  "title": "Microsoft fixes one of Windows 10’s most annoying bugs",
  "category": "computing",
  "updated": "2021-06-24T09:45:38Z",
  "author": "matt-hanson",
  "summary": "Your PC will no longer scream in pain",
  "article": [
    "As far as Windows 10 problems go, a recent bug might have been the most annoying, as it caused some PCs to emit a high-pitched screeching noise when certain apps were used. Thankfully, though, it’s now been fixed by Microsoft.",
    "The issue was introduced in the KB5000842 update, released in March 2021, as well as updates that came after it, and affected people who used 5.1 surround sound devices.",
    "As Microsoft explains on its Windows 10 Known issues web page, “After installing KB5000842 or later updates, 5.1 Dolby Digital audio may play containing a high-pitched noise or squeak in certain apps when using certain audio devices and Windows settings.”",
    "While the vast majority of PC users will be using stereo setups, and are not affected, for those who are suffering from this problem, it can be an annoying – and alarming – issue, especially if you have your volume whacked up high.",
    "So, it’s good news that Microsoft has now released the Windows 10 KB5003690 preview cumulative update, which includes a fix for the issue.",
    "As the appropriately-named Bleeping Computer website points out, the KB5003690 update is optional, so it won’t be installed automatically.",
    "So, if you are experiencing the issue, you need to open up the Windows Update app (search for Windows Update in the Start menu) then click ‘Check for updates’.",
    "You should then see the KB5003690 update displayed. Click ‘Download and install’ to apply the update. The audio issue should now be fixed.",
    "With Microsoft planning on announcing Windows 11 at an event later today, it’s a bit concerning that Windows 10 is still suffering from annoying issues like this."
  ],
  "headers": {
    "5": "How to fix the Windows 10 audio issue"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 10 Known issues": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1147348905426136400&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fwindows%2Frelease-health%2Fstatus-windows-10-2004%231605msgdesc",
    "Bleeping Computer website points out": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-high-pitched-noise-bug-in-windows-10/"
  }
}