{
  "source": "https://www.techradar.com/news/microsoft-drops-biggest-windows-11-hint-yet",
  "title": "Microsoft drops biggest Windows 11 hint yet",
  "category": "computing",
  "updated": "2021-06-11T09:52:40Z",
  "author": "darren-allan",
  "summary": "Windows 11’s possible imminent reveal has been hinted at again",
  "article": [
    "Windows 11 could be the name of the revamped OS that Microsoft is about to reveal as Windows 10’s successor, with a number of hints dropped recently suggesting that’s the case – and here’s another.",
    "As spotted by Windows Latest, Microsoft just uploaded a YouTube video which teases folks about being excited for the upcoming big reveal planned for later in June, providing a way to ‘relax’ if you’re overly worked up about the prospect of, well, maybe Windows 11.",
    "Microsoft says: “Having trouble relaxing because you’re too excited for the June 24th Microsoft Event? Take a slow trip down memory lane with the Windows 95, XP, and 7 startup sounds slowed down to a meditative 4,000% reduced speed.”",
    "The key point here is that the clip is 11 minutes long – 11:00 bang on – which combines with a number of other 11-based hints we’ve already heard.",
    "Remember that Microsoft’s event is scheduled for 11am on June 24 (bear in mind that 11 in the morning is not typical timing for a Microsoft press event). Also, a previous teaser video appears to show the number ‘11’ in a shadow, too – kind of – and some prominent leakers, like Evan Blass, have already asserted that Windows 11 is imminent.",
    "The length of this YouTube clip isn’t the only clue here, either. The video contains a lot of gentle backgrounds, which include a plain blue one, plus some photos of the sky and clouds.",
    "However, there’s also a pastoral valley scene bathed in sunlight right at the start of the video (well, eight seconds in), and another scene of the same nature at around the four minute mark – with similar takes on this following, clearly depicting a number of green valleys with some blazing rays of sunshine for good measure.",
    "So, those could be seen as references to ‘Sun Valley’, the codename for the big revamp of Windows 10 which will see the interface visited with major (supposedly revolutionary) changes, and the big name switch – presumably to Windows 11.",
    "All of these supposed hints may mean absolutely nothing, and could just be coincidences, although at this point it now seems a coincidence or two too many. There’s also the possibility that Microsoft might be pranking us and throwing some red herrings around…",
    "We’ll know in just a couple of weeks, of course, but given that Microsoft has let us know that support is officially ending for Windows 10 in 2025, it now seems to be certain that the OS will have a successor; whether it’s Windows 11 or not. Other possibilities for new names which have been floating around include just plain ‘Windows’, or Windows 365, or even Windows Sun Valley (the latter clues of the valley scenes are present in this new video clip, too, of course)."
  ],
  "headers": {
    "5": "Valley views"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "suggesting that’s the case": "https://www.techradar.com/news/rip-windows-10-windows-11-could-be-unveiled-by-microsoft-in-a-few-weeks",
    "Windows Latest": "https://www.windowslatest.com/2021/06/11/is-windows-11-on-the-way-microsoft-drops-another-hint/",
    "previous teaser video": "https://www.techradar.com/news/rip-windows-10-windows-11-could-be-unveiled-by-microsoft-in-a-few-weeks",
    "Sun Valley": "https://www.techradar.com/news/windows-10-21h2-update",
    "revolutionary": "https://www.techradar.com/news/windows-10-will-get-a-revolutionized-new-look-according-to-microsoft",
    "Microsoft has let us know that support is officially ending": "https://www.techradar.com/news/microsoft-is-planning-to-kill-off-windows-10-in-2025-does-this-confirm-windows-11",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "have been floating around": "https://www.techradar.com/news/rip-windows-10-windows-11-could-be-unveiled-by-microsoft-in-a-few-weeks"
  }
}