{
  "source": "https://www.techradar.com/news/zooms-mega-takeover-deal-of-five9-facing-federal-examination",
  "title": "Zoom's mega takeover deal of Five9 facing federal examination",
  "category": "computing",
  "updated": "2021-09-22T20:30:01Z",
  "author": "anthony-spadafora",
  "summary": "Multi-billion dollar deal is under review since Five9 is a Russian-owned company",
  "article": [
    "Zoom's efforts to expand beyond video conferencing software could now be in jeopardy as a US government committee is currently reviewing the company's proposed Five9 acquisition.",
    "Back in July of this year, Zoom announced its plans to purchase the cloud-powered call center software provider Five9 for approximately $14.7bn.",
    "While the company's business saw a huge surge during the pandemic with more employees working from home than ever before, organizations are now implementing hybrid work policies and asking their employees to return to the office.",
    "By acquiring Five9 though, Zoom will be able to diversify its business and remain profitable even if organizations begin using video conferencing software less than they did during the pandemic.",
    "According to a new report from the Wall Street Journal, the FCC asked the Committee for the Assessment of Foreign Participation in the United States Telecommunications Service Sector to review Zoom's acquisition of Five 9 in a letter dated August 27.",
    "The reason for the review is due to the fact that Five9 is a Russian-owned company and the Justice Department's David Plotinsky provided further details in his letter to the FCC, saying:",
    "“USDOJ believes that such risk may be raised by the foreign participation (including the foreign relationships and ownership) associated with the application, and a review by the Committee is necessary to assess and make an appropriate recommendation as to how the Commission should adjudicate this application.”",
    "The committee responsible for sending the letter, which was formerly known as Team Telecom, was formalized last year through an executive order signed by former President Trump. It provides advice to the FCC regarding potential threats to telecommunications networks and is separate from the Committee on Foreign Investment in the United States (CFIUS).",
    "Despite this new review, Zoom still believes that its Five9 acquisition will close during the first half of next year as it has “made filings with the various applicable regulatory agencies” according to a company spokesperson who spoke with CNBC via email.",
    "Via CNBC"
  ],
  "headers": {
    "4": "Team Telecom"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "proposed Five9 acquisition": "https://www.techradar.com/news/zoom-snaps-up-cloud-call-center-firm-five9",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "call center software": "https://www.techradar.com/best/best-call-center-software",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "new report": "https://www.wsj.com/articles/zooms-nearly-15-billion-deal-for-five9-under-u-s-government-review-over-china-ties-11632247337?mod=tech_lead_pos1",
    "a letter": "https://licensing.fcc.gov/cgi-bin/ws.exe/prod/ib/forms/reports/related_filing.hts?f_key=-468940&amp;f_number=ITCT/C2021073100112",
    "FCC": "https://www.techradar.com/news/ajit-pai-issues-china-warning-as-he-leaves-fcc",
    "Team Telecom": "https://www.techradar.com/news/us-set-to-block-activation-of-controversial-undersea-web-cable",
    "CFIUS": "https://www.techradar.com/news/this-is-how-chinese-firms-like-huawei-can-access-crucial-cpu-ip-despite-restrictions",
    "CNBC": "https://www.cnbc.com/2021/09/21/us-committee-reviews-zooms-planned-14point7-billion-five9-acquisition.html"
  }
}