{
  "source": "https://www.techradar.com/news/this-new-gmail-update-will-help-you-avoid-hybrid-working-confusion",
  "title": "This new Gmail update will help you avoid hybrid working confusion",
  "category": "computing",
  "updated": "2021-11-16T13:25:53Z",
  "author": "mike-moore",
  "summary": "Virtual or in-person meeting? Gmail wants to help",
  "article": [
    "Showing up alone to an in-person meeting could soon be a thing of the past thanks to a new Gmail update.",
    "With workers across the world slowly returning to office life (if they haven't adopted hybrid working of course) physical meetings are unfortunately becoming more common once again.",
    "But as many workforces balance home and office working, this can lead to confusion about who will actually be at a meeting in-person, and who will be there virtually - something Gmail and Google Calendar now hope to have fixed.",
    "Going forward, Gmail users will now be able to specify whether they will be attending a meeting either virtually or in-person in their email RSVP.",
    "The function had initially been added to Google Calendar back in July 2021, but is now available within Gmail RSVPs for extra functionality. Users will now see a drop-down arrow next to the \"Yes\" option in a meeting invite where they can select \"Yes\", \"Yes, in a meeting room\" and \"Yes, joining virtually\" choices.",
    "\"With these RSVP options, you can indicate how you plan to join a meeting—in the meeting room, or virtually,\" a Google Workspace blog announcing the feature noted. \"Then, both the organizer and guests will be able to see how attendees are planning to attend the meeting in the event detail. This will help meeting attendees know what to expect when joining a meeting, and prepare accordingly.\"",
    "The blog did highlight that the new RSVP options are not shared with contacts on other platforms, such as Microsoft Outlook.",
    "Google says the feature has begun rolling out now, and will be available to all Google Workspace customers, as well as G Suite Basic and Business customers, within the next few weeks.",
    "The news comes shortly after the launch of a new \"Focus time\" feature in Google Calendar that will allow users to block out periods of time where they can avoid meetings and get their heads down for actual work.",
    "Setting such a marker in your Google Calendar will also allow users to automatically decline meetings, meaning no last-minute rush to finish off work.",
    "Need extra help? These are the best calendar apps around"
  ],
  "headers": {
    "3": "RSVP in Gmail"
  },
  "links": {
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "email": "https://www.techradar.com/news/best-email-provider",
    "blog": "https://workspaceupdates.googleblog.com/2021/11/indicate-whether-youll-join-meeting.html",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "\"Focus time\" feature in Google Calendar": "https://www.techradar.com/news/google-workspace-update-now-lets-you-block-off-calendar-time-to-focus",
    "best calendar apps": "https://www.techradar.com/best/best-calendar-apps"
  }
}