{
  "source": "https://www.techradar.com/news/the-google-pixel-6-could-be-powered-by-the-newly-leaked-snapdragon-775-chip",
  "title": "The Google Pixel 6 could be powered by the newly leaked Snapdragon 775 chip",
  "category": "phones",
  "updated": "2021-03-06T11:30:00Z",
  "author": "david-nield",
  "summary": "Specs spotted early",
  "article": [
    "While the processor needs of high-end flagships such as the Realme GT are well catered for with the Qualcomm Snapdragon 888 chipset, we're still waiting to hear what the mid-range Android phones of 2021 are going to come running – and the newly leaked Snapdragon 775 and 775G could give us an answer.",
    "As revealed by tipster XiaomiUI on Telegram, the two chips reportedly have the reference number SM7350, and will be the successors to the Snapdragon 765 and 765G from Qualcomm (the G indicates slightly better gaming performance).",
    "The Snapdragon 765 series was used in handsets such as the OnePlus Nord and the Google Pixel 5, offering powerful performance without adding quite as much to the price of a handset as the premium Snapdragon 865 CPU.",
    "It looks as though the Snapdragon 775 and 775G will be deployed in the same way, which has us wondering if this new chipset is going to make an appearance in the Google Pixel 6, as well as many other upper-to-mid-range Android handsets during 2021.",
    "According to sources speaking to XDA Developers, the specs that have leaked for the Snapdragon 775 and 775G aren't fully up to date, so don't take anything here as official until Qualcomm comes out and actually confirms it.",
    "The Snapdragon 775 series is set to be manufactured using a 5 nanometer process, compared to the 7 nm one used by its Snapdragon 765 predecessor – that should equal better performance with less drain on the battery.",
    "The chip is also said to be able to support up to three 28MP cameras simultaneously, and might also be able to capture 4K video at 60 frames per second. As you would expect, 5G will be supported on phones running the Snapdragon 775 and 775G.",
    "If and when the chipset does get announced officially, we're looking forward to the handsets that take advantage of it – close to top level performance for a mid-range price is an appealing combination for a smartphone, and the Snapdragon 775 series should help provide it.",
    "Via XDA Developers"
  ],
  "headers": {
    "4": "Home on the mid-range"
  },
  "links": {
    "Realme GT": "https://www.techradar.com/news/realmes-new-smartphone-seems-like-a-super-powerful-oneplus-nord-rival",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "XiaomiUI": "https://t.me/xiaomiui/7666",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "XDA Developers": "https://www.xda-developers.com/qualcomm-snapdragon-775-leak-mid-premium-soc/"
  }
}