{
  "source": "https://www.techradar.com/news/10-things-to-stream-on-netflix-amazon-prime-hbo-max-and-more-in-august-2021",
  "title": "10 things to stream on Netflix, Amazon Prime, HBO Max and more in August 2021",
  "category": "entertainment",
  "updated": "2021-08-01T16:18:09Z",
  "author": "tom-power",
  "summary": "From The Suicide Squad to Nine Perfect Strangers, these are the best shows and movies to catch this month",
  "article": [
    "After a slow-ish beginning to the summer (or winter for those in the southern hemisphere) streaming season, things are starting to heat up in August 2021.",
    "Netflix, Amazon Prime Video, HBO Max and other streamers are releasing some heavy hitters this month, so you won't be short on new movies and TV shows to check out if the weather isn't ideal where you are.",
    "Below, we've rounded up the biggest and best films and TV series that you'll want to watch this August. From a new Warner Bros DCEU movie to a couple of new intriguing Amazon Prime TV shows, there's something for everyone to enjoy.",
    "Read on for our TV show and movie picks for August 2021.",
    "When to stream it: Friday, August 6 (with an ad-free HBO Max subscription)",
    "Director James Gunn trades Marvel for DC in his first superhero (or should that be supervillain?) movie for Warner Bros.",
    "With an all-star cast including Margot Robbie as Harley Quinn, Idris Elba as Bloodsport and John Cena as Peacemaker, The Suicide Squad sees a group of iconic and lesser-known DC supervillains tasked (by the US government) with infiltrating the fictional island of Corto Maltese to stop a potentially world-ending threat.",
    "Expect plenty of graphic violence, bad language and other mature content in a comic book movie where no one, not even Harley Quinn, is safe from the chopping block.",
    "For UK viewers, The Suicide Squad is already available to watch in theaters. HBO Max subscribers on the $14.99 ad-free tier can check this one out alongside its theatrical release, though it'll leave the service after a month.",
    "When to stream it: Friday, August 6 (first two episodes, new entries weekly)",
    "Apple TV Plus has produced lots of top tier streaming content of late – Ted Lasso and For All Mankind to name just two – and this new comedy-drama series may be its next big hit.",
    "Created, directed by and starring Gordon-Levitt, the series follows Mr. Corman, an anxious and lonely high school teacher whose life hasn't panned out the way he had hoped.",
    "A TV show that blends real-life drama with dark humor and beautifully constructed daydream sequences, coupled with a stellar supporting cast including Lord of the Rings' Hugo Weaving and Ted Lasso's Juno Temple, Mr. Corman could be another endearing comedy series for Apple's growing library.",
    "When to stream it: Wednesday, August 11 (new episodes weekly)",
    "The introduction of the Marvel Cinematic Multiverse (MCM) in Loki's season 1 finale has opened a seemingly infinite number of doors for Marvel Studios to explore.",
    "Before films like Spider-Man: No Way Home and Doctor Strange 2 explore the multiverse in more detail, a new Marvel Disney Plus animated show offers a glimpse into its alternate realities and dimensions.",
    "Starring Jeffrey Wright (The Batman, James Bond) as The Watcher, Marvel's What If...? will explore iconic Marvel events that may have played out differently.",
    "From Peggy Carter becoming Captain Britain (after she's injected with the super soldier serum) to Black Panther's Eric Killmonger saving Tony Stark in Iron Man 1, What If...? is a show that MCU fans won't want to miss. There's even an episode dedicated to Marvel's fan favorite Zombies comic series.",
    "When to stream it: Thursday, August 12 (first three episodes, new episodes weekly)",
    "Warner Bros. has enjoyed success with its mature superhero team series since it debuted in October 2018, so it's unsurprising that subsequent seasons have been greenlit since.",
    "This, though, is the first time that a new season will premiere on HBO Max rather than the studio's niche DC Universe app, so season 3 will be available to more viewers than the previous two instalments.",
    "The third season of Titans will pick up where its predecessor left off, and see the likes of Nightwing, Starfire and Raven trade San Francisco for Gotham City. There, they'll team up with Barbara Gordon and try to learn from the \"mistakes of their parents\", according to showrunner Greg Walker. So we can expect plenty of more R-rated superhero capers, twists and turns in season 3.",
    "When to stream it: Friday, August 13",
    "If superhero productions aren't your idea of a good time, how about the return of Amazon's rom-com anthology series?",
    "Based on The New York Times column of the same name, Modern Love season 2 will tell eight brand-new stories that explores love in its various forms.",
    "Game of Thrones' Kit Harington, Will & Grace's Minnie Driver and Triple Frontier's Garrett Hedlund are just three of season 2's stars, but there are plenty of recognizable names to look out for in Modern Love's next instalment. Just make sure you have a box of tissues ready for the series' more emotional moments.",
    "When to stream it: Friday, August 13",
    "Based on the novel of the same name by Todd Grimson, Brand New Cherry Flavor looks like it could be one of 2021's most surreal TV shows.",
    "Billed as a horror drama series, Brand New Cherry Flavor will star Rosa Salazar (Alita: Battle Angel, Undone) as Lisa Nova, a filmmaker who heads to Hollywood in the 1990s to make a name for herself. It isn't long, though, before Hollywood sinks its claws in Lisa, and she ends up, according to Netflix's synopsis, \"falling down a hallucinatory rabbit hole of sex, magic, revenge – and kittens.\"",
    "It sounds weird and looks like nothing else we've seen this year – and we can't wait to see more of it.",
    "When to stream it: Friday, August 20 (with an ad-free HBO Max subscription)",
    "Hugh Jackman returns in his first major movie role since 2019's Bad Education in this gorgeous looking, neo-futuristic sci-fi thriller.",
    "Reminiscence follows Nick Bannister (Jackman), a soldier-turned-private investigator who lives on the fringes of the flooded Miami coast and specializes in helping rich clients to relive any memory they desire.",
    "When a young woman named Mae (Rebecca Ferguson) upends his life in more ways than one – and then disappears without a trace – Nick uses his expertise to uncover a violent conspiracy that places him in harm's way.",
    "UK film fans will be able to catch Reminiscence in theaters on the same day.",
    "When to stream it: Friday, August 20 (first three episodes with new episodes weekly)",
    "Based on Liane Moriarty's 2018 novel of the same name, Nine Perfect Strangers is a drama series that will immediately draw the attention of Big Little Lies fans.",
    "The show tells the tale of nine city dwellers who, under the guidance of the mysterious Masha (Nicole Kidman), seek to come to terms with their personal issues and trauma during a 10-day retreat at the Tranquillum House health and wellness resort.",
    "With the likes of Melissa McCarthy, Michael Shannon, Luke Evans and Bobby Cannavale also among its A-list cast, Nine Perfect Strangers certainly has the star power to entice viewers. Its mysterious plot and thematically dense questions, such as how far you'd go to become a better person, means it should be a riveting watch, too.",
    "Nine Perfect Strangers will be available to stream on Hulu in the US and Amazon Prime Video in the UK.",
    "When to stream it: Friday, August 20",
    "Jason Momoa lends his star power to this action-thriller movie that looks and sounds more mature than it initially appears.",
    "The Aquaman and See actor stars as Ray Cooper, a devoted family fan who seeks vengeance against a pharmaceutical company who pull potentially life-saving treatment from the market before his cancer-stricken wife dies. When his search for the truth puts his daughter Rachel in danger, though, Ray has to decide where his priorities lie – get justice for his wife or protect his daughter.",
    "Netflix has enjoyed success with similar movies – Extraction and The Old Guard to name two – so Sweet Girl, with a big name actor behind it, should hit the mark, too.",
    "When to stream it: Monday, August 23",
    "The Witcher season 2 doesn't arrive until December, but this animated prequel movie will tide us over until Geralt and company are back on our screens.",
    "An origins tale focusing on Vesemir, The Witcher: Nightmare of the Wolf will see Geralt's mentor face off against a powerful new threat that threatens the Continent.",
    "The anime film, which has been developed by Netflix and Studio Mir (Batman: Soul of the Dragon, Mortal Kombat Legends: Scorpion's Revenge), will act as a primer for viewers before Vesemir's live-action debut in The Witcher season 2 – so it's a film that fans will want to catch."
  ],
  "headers": {
    "4": "The Suicide Squad (HBO Max)",
    "9": "Mr. Corman (Apple TV Plus)",
    "13": "Marvel's What If...? (Disney Plus)",
    "18": "Titans season 3 (HBO Max)",
    "22": "Modern Love season 2 (Amazon Prime Video)",
    "26": "Brand New Cherry Flavor (Netflix)",
    "30": "Reminiscence (HBO Max)",
    "35": "Nine Perfect Strangers (Hulu/Amazon Prime Video)",
    "40": "Sweet Girl (Netflix)",
    "44": "The Witcher: Nightmare of the Wolf (Netflix)"
  },
  "links": {
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Amazon Prime Video": "https://www.techradar.com/news/amazon-prime-video-free-trial",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "DCEU movie": "https://www.techradar.com/how-to/how-to-watch-the-dceu-movies-in-order",
    "Amazon Prime TV shows": "https://www.techradar.com/best/best-amazon-prime-shows",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-release-date-plot-cast-trailer-and-more",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Ted Lasso": "https://www.techradar.com/news/what-time-is-ted-lasso-season-2-released-on-apple-tv-plus",
    "Loki's season 1 finale": "https://www.techradar.com/news/loki-episode-6-ending-explained",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Titans": "https://www.techradar.com/news/titans-season-3-release-date-cast-story-trailer-and-what-we-know",
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix"
  }
}