{
  "source": "https://www.techradar.com/news/ubiquiti-hit-by-data-breach-change-your-uicom-passwords-now",
  "title": "Ubiquiti hit by data breach, change your UI.com passwords now",
  "category": "computing",
  "updated": "2021-01-12T18:15:23.800Z",
  "author": "anthony-spadafora",
  "summary": "User data may have been accessed by an intruder",
  "article": [
    "Ubiquiti Networks has begun notifying its customers that it recently fell victim to a data breach that could put the information stored in their UI.com accounts at risk.",
    "The networking equipment and IoT device maker informed customers in an email that it recently became aware of unauthorized access to its information technology systems hosted by a third party cloud computing provider.",
    "The servers that were accessed stored information about user profiles on the company's UI.com web portal. The site itself is used to manage devices from a remote location and as a support portal for the company's customers.",
    "Ubiquiti provided further details on the types of data that may have been accessed by the intruder in the email it sent out to customers, saying:",
    "“We are not currently aware of evidence of access to any databases that host user data, but we cannot be certain that user data has not been exposed. This data may include your name, email address, and the one-way encrypted password to your account (in technical terms, the passwords are hashed and salted). The data may also include your address and phone number if you have provided that to us.”",
    "Ubiquiti customers were taken aback when they first received the email and some users on the company's community page even believed it may have been a phishing attempt.",
    "At this time, it is still unclear as to whether the “unauthorized access” was the result of a malicious threat actor or a security researcher who found the exposed data.",
    "According to Ubiquiti, it has not seen any unauthorized access to its customer accounts as a result of the data breach. However, the company is still asking UI.com users to change the passwords to their accounts and to enable two-factor authentication.",
    "We'll likely hear more on the incident once Ubiquiti conducts a full investigation into who was responsible for accessing its servers.",
    "Via ZDNet"
  ],
  "headers": {
    "5": "Unauthorized access"
  },
  "links": {
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "community page": "https://community.ui.com/questions/possibly-breach/55bc757a-9caf-4889-a2c4-9ad5d8af75ce#answer/968f8450-6780-4a22-93c3-be8410bf874a",
    "security researcher": "https://www.techradar.com/news/how-one-security-researcher-is-working-to-secure-vulnerable-iot-devices",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "ZDNet": "https://www.zdnet.com/article/ubiquiti-tells-customers-to-change-passwords-after-security-breach/"
  }
}