{
  "source": "https://www.techradar.com/news/raspberry-pi-4-is-now-being-used-to-run-entire-smart-housing-developments",
  "title": "Raspberry Pi 4 is now being used to run full IoT systems",
  "category": "computing",
  "updated": "2021-01-18T16:15:17Z",
  "author": "mayank-sharma",
  "summary": "The housing is designed for industrial uses and will be ready for sale soon",
  "article": [
    "Using Raspberry Pi-powered kit to run IoT applications such as smart homes is set for a major boost thanks to a new set of hardware tools.",
    "The ClusBerry 9500-CM4 is an upcoming cluster board that can stack up to eight Raspberry Pi Compute Modules 4 (CM4).",
    "While there are several options that’ll help hook up multiple Raspberry Pi’s into a server rack, the ClusBerry 9500-CM4, as its name suggests, is designed to house CM4 modules. The company argues this makes their new product an ideal option for all kinds of IoT applications.",
    "“The ClusBerry 9500-CM4 opens up completely new capabilities of utilizing cluster solutions for Industrial Automation and server applications,” argues Poland-based TECHBASE Group, which manufactures IoT and other devices for industrial applications.",
    "According to the company, the new cluster will hold up to eight CM4 modules in an industrial-grade DIN-Rail mount.",
    "In addition to the CM4 modules, the housing is designed to be customizable and can also hold a number of wired and wireless interfaces, along with various I/O controllers, as well as the Coral Edge Tensor Processing Units (TPUs), in various configurations. It’ll also be equipped with a wide range of expansion cards.",
    "TECHBASE believes that “fully configurable devices are something desirable in the IoT market, where high performance and low cost is a key factor to success of implementation.” Heaping praise on CM4, the company says that their ClusBerry 9500-CM4 mount will make it possible to utilize the device to “construct and maintain effective hardware matrix solutions.”",
    "The company is still working on the first prototypes of the mount, and there are no details about its pricing. However, the company promises to ship the various configurations of the mount within two months, subject to the availability of CM4 modules, and the selected expansion cards."
  ],
  "headers": {
    "3": "Configurable and customizable"
  },
  "links": {
    "Raspberry Pi": "https://www.techradar.com/reviews/raspberry-pi-4-model-b",
    "Compute Modules 4 (CM4)": "https://www.techradar.com/news/the-new-raspberry-pi-compute-module-is-smaller-faster-and-has-greater-connectivity",
    "multiple Raspberry Pi’s": "https://www.techradar.com/news/this-homemade-server-is-pure-raspberry-pi",
    "ClusBerry 9500-CM4": "https://modberry.techbase.eu/compute-module-4/first-modular-industrial-pc-and-powerful-cluster-server-in-one/",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "Tensor Processing Units (TPUs)": "https://www.techradar.com/news/computing-components/processors/google-s-tensor-processing-unit-explained-this-is-what-the-future-of-computing-looks-like-1326915"
  }
}