{
  "source": "https://www.techradar.com/news/irs-delays-tax-filing-deadline-by-almost-a-month",
  "title": "IRS delays tax filing deadline by almost a month",
  "category": "computing",
  "updated": "2021-03-19T18:30:42Z",
  "author": "rob-clymo",
  "summary": "Tax payers are getting more time to file",
  "article": [
    "The Internal Revenue Service (IRS) has delayed the deadline date for its annual Tax Day, moving it from April 15 to May 17.",
    "While many tax filers in the US will doubtless be relieved to have more time in order to get their tax affairs and accounting paperwork in order, the delay suggests there are wider issues involved when it comes to challenges being faced by the government agency.",
    "The IRS is currently heavily involved with the American Rescue Plan Act of 2021, the nationwide recovery plan designed to help the US get back on its feet in the wake of the coronavirus pandemic.",
    "\"This continues to be a tough time for many people, and the IRS wants to continue to do everything possible to help taxpayers navigate the unusual circumstances related to the pandemic, while also working on important tax administration responsibilities,\" said IRS Commissioner Chuck Rettig.",
    "\"Even with the new deadline, we urge taxpayers to consider filing as soon as possible, especially those who are owed refunds. Filing electronically with direct deposit is the quickest way to get refunds, and it can help some taxpayers more quickly receive any remaining stimulus payments they may be entitled to.\"",
    "However, the added workload involved in processing and distributing monthly payments to families in the form of tax credits has placed the IRS under increasing pressure. Adding to its woes have been a substantial reduction in staff numbers and a decrease in funding.",
    "Back in 2010 the IRS had a total budget of $14.9 billion, adjusted for inflation. However, the funding had been cut to just $11.3 billion by 2019, with Congress opting to trim back the annual spend by a nearly a quarter or 24%.",
    "The government agency is still expected to harvest almost $4trillion in tax revenue this year, which will form a vital part of bolstering the country’s GDP of over $22 trillion.",
    "Personnel numbers have dropped dramatically too, with the IRS having shrunk from an original core of 95,000 full-time staff a decade ago down to 74,000 by 2018.",
    "Replenishment of staff is complicated due to the length of time required to fully train IRS personnel, leaving a glaring gap with around 46% of the workforce becoming eligible to retire in the near future.",
    "Following the announcement of the deadline extension the IRS says that it will be providing formal guidance in the coming days."
  ],
  "headers": {
    "4": "Tax deadline"
  },
  "links": {
    "tax affairs": "https://www.techradar.com/best/best-tax-software",
    "accounting": "https://www.techradar.com/best/accounting-software-small-business",
    "tax revenue": "https://www.techradar.com/best/best-expense-trackers"
  }
}