{
  "source": "https://www.techradar.com/news/amazon-echo-show-8-1st-gen-vs-amazon-echo-show-8-2nd-gen-which-smart-display-should-you-buy-this-black-friday",
  "title": "Amazon Echo Show 8 (1st gen) vs Amazon Echo Show 8 (2nd gen): which smart display should you buy this Black Friday?",
  "category": "smart-home",
  "updated": "2021-11-21T08:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Is the Echo Show 8 (2nd gen) better than the original?",
  "article": [
    "The best smart display offers a way to see as well as hear the information being served up by a voice assistant. Amazon currently has two versions of its 8-inch Echo Show smart display - the original iteration, which was launched in November 2019, and the Echo Show 8 (2nd gen), which was launched in June this year, on the market.",
    "Both smart displays have been discounted several times this year, and with Black Friday and Cyber Monday just days away, you’re probably wondering just which of these two 8-in smart speakers with built-in screens you should be buying?",
    "Will spending $20 / £20 / AU$30 more on the list price of these smart displays really make a difference to your experience at home? We pitted the Echo Show 8 (1st gen) against the Echo Show 8 (2nd gen) to find out, so you can confidently riffle through the best Black Friday Echo deals and nab yourself a bargain.",
    "Read on to find out just how these smart displays compare – or, if you know which Alexa smart speaker and screen in one you want, check out the best prices right now for both products below:",
    "When it comes to cost, the two 8-inch displays don’t vary dramatically. The Amazon Echo Show 8 (1st gen) is priced at $109.99 / £99.99 / AU$169, while the Amazon Echo Show 8 (2nd gen) will set you back $129.99 / £119.99 / AU$199.",
    "As smart displays go, both the Amazon Echo Show 8 models are slightly more expensive than their closest rival from Google, the Google Nest Hub (2nd gen), which costs $99 / £89 / AU$149. However, this is understandable given both models of the Amazon Echo Show 8 have a built-in camera for video calls - not something the Google Nest Hub offers.",
    "On the surface, the two Amazon Echo Show 8 models look very similar - the 8-inch display, which has a 1280 x 800 resolution, is positioned at an angle on the front of the device, while the wedge-shaped back, which houses the speakers, is covered in either mesh fabric. In the case of the Amazon Echo Show 8 (1st gen) there’s a choice of Charcoal (a dark grey) fabric or Sandstone, which has more of a cream hue about it.",
    "Meanwhile, the Amazon Echo Show 8 (2nd gen) is available in Charcoal or Glacier White, which is, well, white. Both smart displays have the same compact footprint that means it fits neatly on a shelf or window ledge, too.",
    "However, under the hood, the two devices differ slightly. The Amazon Echo Show 8 (1st gen) has a paltry 1MP camera, while the Echo Show 8 (2nd gen) has the same upgraded 13MP camera found on the Echo Show 10, that’s one of the best we’ve seen on a smart display to date.",
    "The second-gen Show 8 uses the newer, faster MediaTek MT8183 processor, compared to the MediaTek MT8163 chip found in the original Echo Show 8. This means the smart display should be smoother when swiping through settings or using Alexa, however in real life it's unlikely you will notice the tiny difference.",
    "You’ll also find a privacy cover for the camera, which also mutes the four microphones located in the smart displays, microphone, to quell any fears the privacy-conscious may have, on both devices, along with 2-inch dual speakers with passive bass radiator.",
    "When it comes to the most basic tasks you’d use a smart display for, the pair are evenly matched. Alexa is built into both, obviously, and on the test we had the same responses to the questions we posed to the voice assistant, and they were delivered at the same speed.",
    "As well as offering up the information audibly, it’s also displayed on screen with additional detail. For example, when we asked for the weather report, Alexa told us the current temperature, while on-screen an hour-by-hour breakdown was displayed along with the wind speed and real-feel temperature.",
    "Both the Echo Show 8 (1st gen) and the Echo Show 8 (2nd gen) offer the ability to listen to music streaming services including Spotify and Prime Music or watch Netflix and Prime Video on the display. As we’ve already mentioned, the upgraded processor provides a minuscule jump in speed, but in everyday use, it’s just not obvious.",
    "However, the camera is what really sets the two smart displays apart. During the test video calls, we made on the Echo Show 8 (2nd gen) the recipients remarked on just how clear and sharp we looked compared to when we used the Echo Show 8 (1st gen).",
    "We also stayed in shot, even when moved during the call, because the second-gen’s camera automatically pans and zooms to follow you - again not something the Echo Show 8 (1st gen) offers.",
    "When it comes to choosing between the Echo Show 8 (1st gen) and the Echo Show 8 (2nd gen) as both smart displays perform the most basic tasks equally, the first-gen smart display is a clear choice here.",
    "Well, unless your sole reason for investing in the smart display is for video calls. If you’re a regular at keeping in touch over video with friends and family, the upgraded camera of the Echo Show 8 (2nd gen) will be well worth the additional investment."
  ],
  "headers": {
    "3": "Best Amazon Echo Show 8 (1st gen) and Amazon Echo Show 8 (2nd gen) deals",
    "4": "Price",
    "6": "Design",
    "11": "Features",
    "16": "Verdict"
  },
  "links": {
    "best smart display": "https://www.techradar.com/best/best-smart-displays",
    "Echo Show 8 (2nd gen)": "https://www.techradar.com/reviews/amazon-echo-show-8-2nd-gen",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Echo Show 8 (1st gen)": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "best Black Friday Echo deals": "https://www.techradar.com/news/black-friday-amazon-echo-deals-new-releases-hit-lowest-prices-yet",
    "Google Nest Hub (2nd gen)": "https://www.techradar.com/reviews/google-nest-hub-2nd-generation-review",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review"
  }
}