{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-leak-shows-where-the-s-pen-goes",
  "title": "Samsung Galaxy S21 Ultra leak shows where the S Pen goes",
  "category": "phones",
  "updated": "2021-01-12T10:49:58Z",
  "author": "david-lumb",
  "summary": "The Samsung S21 Ultra’s S Pen could get stored in a regular, non-folio case",
  "article": [
    "While CES 2021 blazes on, the Samsung Galaxy S21 phones are days away from being revealed on January 14, but we’re still seeing leaks – including a new one for the S21 Ultra showing exactly where its S Pen will be stored.",
    "We’ve heard several rumors that the S21 Ultra will support the S Pen, but as it’s not expected to have a physical slot to house the stylus like the Note 20 series, we didn’t know where it would be stored... until a recent leak suggested it could be stored in a folio case with a cover. But new images released by WinFuture show a regular case with the same functional S Pen slot on the side:",
    "We don’t have to belabor how much more popular a standard case will be over a folio – not everyone wants a flap over their flagship phone, especially with a handset like the S21 Ultra that’s massive enough to have an expected 6.8-inch display. It also looks like a slimmer case overall, with just enough room to tuck a stylus.",
    "And yes, these images (which may be renders and not press photos) show an S Pen similar to those that come with the Tab series of Samsung tablets, unlike the styluses with pop-up buttons at the end to help pry them out of Note phones.",
    "We’ve heard a ton of rumors about the Samsung S21 phone design, prices, and release dates. Based on several reports, the S21 will have a 6.2-inch display, the S21 Plus a 6.7-inch display, and both will max out at Full HD resolution to save cost – which another rumor suggested will have Korean pricing at 990,000 won (around $904 / £666 / AU$1,163) for the S21, and the S21 Plus will cost 1,199,000 won (around $1,095 / £807 / AU$1,410). Even with currency conversions, that’s lower than last year’s Samsung Galaxy S20 launch prices.",
    "The same rumor claimed the S21 Ultra is also getting a price cut to 1,450,000 won (around $1,324 / £976 / AU$1,706), down from the previous year’s 1,595,000 won pricetag ($1,399 / £1,199 / AU$1,999) for the S20 Ultra. In addition to the larger 6.8-inch display and S Pen integration, the S21 Ultra is rumored to have top specs – and per another rumor, may finally be able to support 120Hz refresh rate and WQHD Plus resolution at the same time.",
    "Via AndroidCentral"
  ],
  "headers": {
    "4": "Samsung S21: the latest on the soon-to-launch phones"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "suggested": "https://www.techradar.com/news/new-leak-hints-s21-ultra-could-pack-an-s-pen-in-an-unusual-spot",
    "WinFuture": "https://winfuture.de/news,120513.html",
    "rumor": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-may-finally-reach-120hz-at-its-highest-wqhd-resolution",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "AndroidCentral": "https://www.androidcentral.com/galaxy-s21-ultra-leak-gives-us-another-look-optional-s-pen-case?utm_source=ac_tw&utm_medium=tw_card&utm_content=98277&utm_campaign=social"
  }
}