{
  "source": "https://www.techradar.com/news/has-oleds-burn-in-problem-been-fixed",
  "title": "Has OLED's burn-in problem been fixed?",
  "category": "televisions",
  "updated": "2021-09-11T13:00:50Z",
  "author": "jennifer-allen",
  "summary": "As time goes on, burn-in solutions are only improving",
  "article": [
    "If you've been researching the best TVs on the market with a focus on the best OLED TVs, you may have noticed a trend regarding the risk of OLED burn-in. Historically regarded as a major problem for such screens, OLED burn-in – also known as image retention – sounds incredibly off-putting if you're looking to buy a high-end TV.",
    "Burn-in is when an image or sequence is played so often and continuously on your TV that it leaves a permanent mark on the panel, ruining the look of anything else you may end up watching.",
    "But is it actually a problem? Many manufacturers including LG explain that \"it is rare for an average TV consumer to create an environment that could result in burn-in\" but the worry is still there when a quick Google can still bring up plenty of not so positive anecdotes regarding the issue.",
    "We've taken a deeper look at the history behind burn-in and image retention and looked at whether it's still an issue for the average user, and whether it's a risk worth taking at all.",
    "Screen burn-in isn't a new phenomenon. It's been around for as long as screens have existed with even the old-fashioned CRT-type computer monitors potentially suffering from permanent ghost-like images after spending too long displaying the same image. Such issues are what led to the rise of the screensaver – a mainstay of computer screens to this day.",
    "Following that came plasma displays, which were highly susceptible to burn-ins at a time when LCD-based displays were less likely to suffer from the issue. However, LCD screens were more liable to have pixels fail or become 'stuck' causing a different type of issue for regular TV watchers.",
    "For now, at least, the problem is never going to be 100% solved – but manufacturers are working on mitigation practices to minimise the issue and it's certainly improved over the years.",
    "TV manufacturers have been keen to ensure that people still want to buy OLED TVs and don't worry about burn-in. LG has a whole section on its website explaining its approach to OLED TV reliability reassuring customers that it really isn't an issue.",
    "LG explains that it has a screen saver feature on all its TVs that turns on automatically if the TV detects that a static image is displayed for approximately two minutes. There's also the Clear Panel Noise feature that preserves the quality of the image on he display panel by resetting the TV so that it clears pixels, and there's Logo Luminance Adjustment which can detect static logos on screen and reduce brightness to help decrease the risk of image retention.",
    "Most significantly of all is the Screen Shift feature, which moves the screen slightly at regular intervals to minimise the risk of burn-in too.",
    "Sony and Panasonic TVs also use LG-supplied OLED panels, so the same principle applies here. Typically, all you need to know is that the latest OLEDs are far less prone to burn-in than ever before and those odds are only improving over time.",
    "It's not just LG that's working on new technologies though. Philips has recently unveiled new OLEDs for 2021 with anti burn-in technology standardized across the range.",
    "Other types of screens are also embracing OLED with Nintendo launching the Nintendo Switch OLED later this year. We talked to an expert in the field – OTI Lumionics CEO Michael Helander – about what that would mean in terms of image burn-in and he was unphased by any potential issues. \"Modern OLED display panels have active compensation that will prevent the effect of burn-in. This records how much time each pixel has been turned on individually and will then in the back-end hardware adjust the output signal [...] to ensure that screen output remains uniform and effect of burn-in is eliminated,\" he explained.",
    "He also referenced that the PS Vita also offered an OLED panel in the past and there were few complaints regarding any burn-in back then – and that continues to be the case. The PS Vita is an ageing console that used an older form of OLED than we’re seeing now, so the latest OLED panels should be even more reliable.",
    "And what if you do run into an issue? Warranty policies are a little vague as to whether you're covered. While LG OLED TVs have a 5 year warranty for panel faults, a spokesperson for LG pointed out recently that image retention \"is not a product defect\" but doesn't quite allude to whether that includes permanent screen burn-in, referring instead to it being a rare issue. You may have a fight on your hands if you're one of the unlucky ones as it's often considered to be general wear and tear.",
    "In contrast, Samsung has a 10-year screen burn-in warranty. The warranty is a non-issue with Samsung, though, as the company Samsung uses LED or QLED technology in its TVs rather than OLED, making for fewer potential issues with image retention and screen burn-in in the first place.",
    "Not really. Screen burn-in is most likely to happen on display units in showrooms of retail stores, or if you watch the same static image all the time.",
    "Granted, that could be a minor issue if you watch a lot of rolling news or sport and there's a ticker always on display, but technology like Screen Shift should circumvent that issue quite easily. Crucially, it should take so long for it to be a noticeable issue that you'll end up upgrading your TV long before it becomes a problem. One study by LG believes that the expected life of an OLED display is about 100,000 hours of use, in comparison to LCD panels with LED backlights that have a life expectancy of six to 10 years.",
    "However, you should be aware of temporary image retention issues. This isn't a permanent problem but you may notice it once in a while. It's likely that it'll go away on its own rather than turn into permanent burn-in. Fortunately, there are plenty of ways to fix this and to avoid image retention or the risk of burn-in in future too.",
    "The best way to avoid burn-in is to keep watching varied content. Don't leave your TV on the same image all the time and definitely don't leave anything paused for hours on end. It should take a huge number of hours to become a problem but you may end up with some temporary image retention issues and a bit of paranoia that you've messed up.",
    "Alternatively, turn the brightness down or choose a dimmer picture mode from your TV's options such as Cinema instead of Vivid. You don't need to do this all the time, though – only if you're playing the same game for hours on end or watching rolling news for most of the day.",
    "Also, check your TV settings and enable features like LG’s Screen Shift – or Pixel Shift, in the case of Sony. Run Pixel Refresh or Panel Refresh to reset the pixels to avoid image retention."
  ],
  "headers": {
    "4": "The history of burn-in",
    "7": "What are TV manufacturers doing to combat the issue?",
    "16": "Should I be worried about it when buying an OLED TV?",
    "19": "What can I do to avoid burn-in?"
  },
  "links": {
    "best TVs": "https://www.techradar.com/news/best-tv",
    "best OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "LG explain that \"it is rare for an average TV consumer to create an environment that could result in burn-in\"": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1332782708500738600&xs=1&url=https%3A%2F%2Fwww.lg.com%2Fus%2Fexperience-tvs%2Foled-tv%2Freliability&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhas-oleds-burn-in-problem-been-fixed",
    "explaining its approach to OLED TV reliability": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7258307707396837000&xs=1&url=https%3A%2F%2Fwww.lg.com%2Fus%2Fexperience-tvs%2Foled-tv%2Freliability&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhas-oleds-burn-in-problem-been-fixed",
    "recently unveiled new OLEDs for 2021 with anti burn-in technology standardized across the range": "https://www.techradar.com/news/new-philips-oled-tvs-look-slick-but-should-you-wait-for-mini-led",
    "what that would mean in terms of image burn-in": "https://www.techradar.com/news/nintendo-switch-oled-burn-in",
    "5 year warranty for panel faults": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1851577807348593400&xs=1&url=https%3A%2F%2Fwww.lg.com%2Fuk%2Foled-tvs%2F2021%2Foled-warranty&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhas-oleds-burn-in-problem-been-fixed",
    "spokesperson for LG pointed out recently that image retention \"is not a product defect\"": "https://www.engadget.com/lg-extends-2021-g1-oled-warranty-five-years-175840084.html",
    "10-year screen burn-in warranty": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1137741759966932000&xs=1&url=https%3A%2F%2Fimages.samsung.com%2Fis%2Fcontent%2Fsamsung%2Fp5%2Fin%2Ftvs%2Fqled-tv%2F4k%2Fpdf%2Ftnc-10year-nsbin-warranty.pdf&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhas-oleds-burn-in-problem-been-fixed",
    "study by LG believes that the expected life of an OLED display is about 100,000 hours of use": "https://www.flatpanelshd.com/news.php?id=1465304750&subaction=showfull",
    "LCD panels with LED backlights that have a life expectancy of six to 10 years": "https://www.sciencedirect.com/science/article/pii/S0956053X1530101X"
  }
}