{
  "source": "https://www.techradar.com/news/we-found-16-cheap-walmart-black-friday-deals-under-dollar50-you-cant-miss",
  "title": "We found 16 cheap Walmart Black Friday deals under $50 you can't miss",
  "category": "audio-visual",
  "updated": "2021-11-27T22:37:20Z",
  "author": "mo-harber-lamond",
  "summary": "On a budget? Walmart's offering tons of bargains for under $50",
  "article": [
    "We've spent the last 48 hours or so constantly trawling the web for all the best Walmart Black Friday deals (you can thank us later), and while there's a huge amount on offer, many people haven't got $1,000 to spend on a new TV - even if it is half price.",
    "So, here we've rounded up all the best cheap Black Friday deals we could find that come in under $50, and some are as low as $15!",
    "We've got kitchen gadgets, perfect presents for little ones, super-useful items you might simply not have had the chance to pick up yet, and even this year's surprise restroom bestseller - you'll know which one we mean when you get to it!",
    "If you're on a budget, these are just about the best Black Friday deals available from Walmart this year, and all you need to do is keep scrolling to find out. If you're keen for more live info, check out out Black Friday deals live blog for up-to-the-minute posts on the latest deals from al retailers.",
    "See more bargains with our guides to the best Black Friday Best Buy deals and the best Amazon Black Friday deals."
  ],
  "headers": {
    "4": "Black Friday deals: all retailers' quick links"
  },
  "links": {
    "Walmart Black Friday deals": "https://www.techradar.com/news/live/walmart-black-friday-deals-launch-today-and-were-live-updating-all-the-top-sales",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday deals live blog": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday Best Buy deals": "https://www.techradar.com/black-friday/best-buy-black-friday-deals",
    "Amazon Black Friday deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals"
  }
}