{
  "source": "https://www.techradar.com/news/competition-watchdog-expresses-concerns-at-three-uk-mast-sale",
  "title": "Competition watchdog expresses concerns at Three UK mast sale",
  "category": "phones",
  "updated": "2021-07-15T12:43:15Z",
  "author": "steve-mccaskill",
  "summary": "CK Hutchison wants to sell Three's masts to Cellnex",
  "article": [
    "CK Hutchison’s plans to sell Three’s mobile towers in the UK have hit a stumbling block after competition watchdogs expressed concerns about the deal.",
    "The company hopes the sale of its European tower assets will release capital to invest in 5G networks and struck a €10 billion deal for CK Hutchison’s masts in Austria, Denmark, Ireland, Italy, Sweden, and the UK last year.",
    "The transactions in the five other countries have gone ahead, the Competition and Markets Authority (CMA) fears Cellnex will command too much of the market for independent mobile infrastructure.",
    "“It’s important that services provided to mobile networks remain competitive so that the millions of businesses and consumers across the UK that use mobile phones can enjoy lower prices,” said Mike Walker, Chief Economic Adviser at the CMA.",
    "“Cellnex is already the largest independent supplier of mobile towers in the UK. We’re concerned that this deal could help to lock in this position and prevent the emergence of new direct competition.”",
    "Spanish-based Cellnex leases out access to ‘passive’ infrastructure such as mobile towers to mobile operators so they can install their active equipment such as antennas to power their services. As an independent operator, Cellnex can maximise the value of these assets by securing arrangements with multiple providers.",
    "The company completed a series of transactions over the past year to strengthen its offering, most notably the acquisition of Arqiva’s masts in 2020. The CMA fears that the combination of Arqiva and Three’s masts would give Cellnex a huge advantage in the UK that could ultimately impact consumers and businesses.",
    "It believes that CK Hutchison could have secured an alternative buyer for its assets – a move that would have maintained competition in the UK market.",
    "The authority has given both parties five days to suggest remedies its concerns or the deal could be referred to a ‘Phase 2’ investigation."
  ],
  "headers": {
    "3": "Cellnex Three"
  },
  "links": {
    "sell Three’s mobile towers in the UK": "https://www.techradar.com/news/three-parent-ck-hutchison-to-sell-european-mobile-towers",
    "5G networks": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}