{
  "source": "https://www.techradar.com/news/paramount-plus-is-yet-another-streaming-service-do-you-actually-need-it",
  "title": "Paramount Plus is yet another streaming service – do you actually need it?",
  "category": "entertainment",
  "updated": "2021-03-04T18:10:40Z",
  "author": "samuel-roberts",
  "summary": "First impressions of Paramount Plus",
  "article": [
    "Paramount Plus feels like a bit of a soft launch. What was previously known as CBS All Access has transformed into a new streaming service as of March 4, though your old login will still work fine. All the Star Trek shows like Discovery and Picard are still here, and are now branded Paramount Plus originals rather than CBS All Access originals.",
    "But what if you're already subscribed to some combination of Netflix, Amazon Prime Video and Disney Plus? Do you need this in your life?",
    "Well, like a lot of streamers out there, Paramount Plus feels like something you can live without as it stands – it doesn't have the vast original content stockpile that Netflix does, and despite having a few good movies, the range available of films on HBO Max right now is immediately more exciting.",
    "Paramount Plus will build out the movie side over time, however, and you can enjoy the Indiana Jones films on there right now, along with a bunch of other classics.",
    "That said, CBS All Access did have a few USPs, which carry over here. As with Peacock, sports and news are part of the equation – in addition, Paramount Plus boasts a complete selection of Star Trek movies and shows, which is still cool, with more shows to come. You can also watch new CBS shows after they air on here, like The Equalizer and Clarice – though these are also available with ads on CBS.com.",
    "The app is $5.99 per month with commercials, or $9.99 without. You also get access to live TV with the latter option, as well as the option to download videos to watch on the go. In June 2021, the Limited Commercials option will drop to an even more competitive $4.99 per month – which might be a good time for the curious to check it out.",
    "If you're an existing CBS All Access subscriber, the previous app has become Paramount Plus, and if you're asked to log in again, your account details will work.",
    "What the service lacks right now is a Trojan horse-like blockbuster show in the vein of The Mandalorian – a big original that gets the world to take notice. It's something both HBO Max and Peacock lacked when they arrived in 2020, and it's hard not to wonder if this rebrand might've been a bigger deal with the Halo TV show, Star Trek: Strange New Worlds or the upcoming Frasier reboot in tow.",
    "These all could've fit the bill nicely – but they each feel far away.",
    "Still, among the originals, you do get a new SpongeBob prequel series as well as the recent Spongebob CG movie, which will both no doubt be exciting to the series' vast audience. '90s MTV fans might also appreciate The Real World Homecoming: New York, a reunion of the original people who featured in that show. Offbeat docuseries For Heaven's Sake is also worth a look. Animated series Tooning Out the News is available, too.",
    "Still, varied as these are, they do collectively lack the wow factor of one Mandalorian. And if the streaming wars are all about grabbing attention, having this sort of shiny new original to show off at launch really does matter.",
    "Like CBS All Access, the Paramount Plus app is perfectly fine to use, with branded tiles on the homepage for CBS, BET, Comedy Central, MTV, Nickelodeon and Smithsonian Channel to categorize content. You can download up to 25 videos at once, according to Paramount Plus, assuming you've opted for the higher-priced tier.",
    "The library is deep enough that you'll find a few older shows you like – Cheers and Frasier are on here in full, for example, if you haven't watched them to death elsewhere. When it comes to kids TV, too, Paramount Plus is absolutely no slouch thanks to its connection to Nickelodeon. SpongeBob is the centerpiece, of course, but the likes of Paw Patrol and Peppa Pig on-demand will surely be exciting to parents with small children. Even older viewers might enjoy having easy access to episodes of Kenan & Kel and Hey Arnold.",
    "In reality, Paramount Plus is just getting started. As competitors have rushed in to the space, it's felt like all of them could've benefitted from having more to show at launch – this is no exception, based on the originals available now. Still, CBS All Access has provided a fairly solid base of content to get started with at launch, and the slate of stuff to come does look pretty good.",
    "That said, if you're trying to keep your streaming service spending down right now and you're up-to-date on the numerous Star Trek series, it's hard to get too excited about Paramount Plus at the moment.",
    "We'll follow up with a full review next week with a deeper verdict on this new streamer."
  ],
  "headers": {
    "7": "The Mandalorian factor",
    "11": "Still, the app is fine"
  },
  "links": {
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Halo TV show": "https://www.techradar.com/news/the-halo-tv-show-finally-has-a-tentative-release-date-and-a-new-streaming-home",
    "Star Trek: Strange New Worlds": "https://www.techradar.com/news/star-trek-strange-new-worlds",
    "Frasier reboot": "https://www.techradar.com/news/8-paramount-plus-tv-shows-and-movies-worth-checking-out-this-weekend"
  }
}