{
  "source": "https://www.techradar.com/news/google-docs-is-getting-a-simple-upgrade-that-will-soothe-your-collaboration-headaches",
  "title": "This Google Docs upgrade will soothe all your collaboration headaches",
  "category": "computing",
  "updated": "2021-02-23T12:23:51Z",
  "author": "joel-khalili",
  "summary": "Locating relevant comments in Google Docs should soon be easier than ever",
  "article": [
    "Google is in the process of rolling out an update for its cloud-based word processing software that should allow users to compare notes and work together more efficiently.",
    "As per a company blog post, Google Docs will soon feature two additional ways to locate comments posted by other collaborators that require attention.",
    "“New comment activity since the last time you viewed a document will be ‘badged’ with a blue dot. Additionally, when you hover over the blue dot, you’ll see a ‘New’ banner,” explained the firm.",
    "On top of the new badging system, the comment history menu (Ctrl+Alt+Shift+A) will also receive new filtering options: “For you”, “All comments” and “Resolved”. This way, users will be able isolate only the information that is relevant to them and that still needs to be acted upon.",
    "Users that fall under the Rapid Release track, which gives Google Workspace customers the option to receive new features as soon as available, will receive the update within the next two weeks. All other users, meanwhile, should see the changes take effect by the end of March.",
    "When collaborating on a document - especially when a large number of colleagues are involved - it can be easy to lose track of which comments have been addressed, which are new and which require your attention specifically.",
    "Although the imminent Google Docs update may appear small, the ability to more clearly distinguish between relevant and irrelevant comments will be a relief to many users, especially with so many people still working remotely.",
    "“We hope these improvements make collaboration easier by enabling you to quickly navigate to and take action on important comments and conversations,” Google added.",
    "The move to refine the comments history menu will also be welcomed by anyone that works on documents extensively with a range of different collaborators.",
    "In its current form, comments and suggested edits are positioned in chronological order, but the menu feels crowded and information is difficult to digest. By introducing the ability to filter comments, however, Google will address at least the former concern."
  ],
  "headers": {
    "5": "Google Docs update"
  },
  "links": {
    "word processing software": "https://www.techradar.com/best/best-document-editing-management-software",
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "explained the firm": "https://workspaceupdates.googleblog.com/2021/02/improvements-for-locating-new-comments-important-conversations-google-docs.html",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "working remotely": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}