{
  "source": "https://www.techradar.com/news/cloud-storage-could-end-up-being-much-greener-than-data-centers",
  "title": "Cloud storage could end up being much greener than data centers",
  "category": "computing",
  "updated": "2021-11-10T15:41:33Z",
  "author": "sead-fadilpasic",
  "summary": "Moving apps to public clouds cuts down on carbon emissions says AWS",
  "article": [
    "By using business apps that reside on public cloud, rather than on-prem data centers, EU businesses could cut energy consumption and significantly curb carbon emissions, claims Amazon Web Services (AWS).",
    "Working with 451 Research, AWS looked to analyze the state of carbon emissions in the enterprise, and how public clouds could help.",
    "Polling more than 300 companies across Europe, it found migrating business applications to the public cloud could reduce energy consumption by 80%, and carbon emissions by 96%.",
    "This could be due to the fact that public cloud data centers, located in the European Union, are roughly three times more efficient than the average EU company. AWS claims to be five times more energy efficient.",
    "These data centers use renewable energy sources and work hard to optimize hardware performance, often through the use of Artificial Intelligence, as well. By employing public clouds, businesses could downsize their on-prem application footprint, and consequently - lower their carbon emissions.",
    "The report found a 1-megawatt corporate data center (about 1,000 square meters, at an assumed 30% electrical utilization rate) could reduce emissions by about 1,079 metric tons of carbon dioxide per year. That’s equal to offsetting the annual electricity emissions of 50 average EU households, or to the removal of 500 cars from the roads.",
    "That number rises to as much as 1,293 metric tons of carbon dioxide when a cloud provider is powered by 100% renewable energy.",
    "“This report shows the great potential that cloud offers businesses in Europe to improve energy efficiency while cutting costs and carbon emissions at the same time,” said Chris Wellise, Director of Sustainability at AWS.",
    "“AWS is proud to collaborate with businesses and governments to help meet their sustainability goals. We believe we have responsibilities to the communities where we operate, and to us, that means sustainability and environmental stewardship. AWS is continuously working on ways to increase the energy efficiency of facilities and equipment, as well as innovating the design and manufacture of servers, storage, and networking equipment to reduce resource use and limit waste.”",
    "Fire up your storage with the best cloud backup services around"
  ],
  "headers": {
    "3": "Public cloud boost",
    "5": "Opportunity for a greener future"
  },
  "links": {
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "AWS": "https://www.techradar.com/news/aws",
    "best cloud backup": "https://www.techradar.com/best/best-cloud-backup"
  }
}