{
  "source": "https://www.techradar.com/news/new-zealand-vs-australia-live-stream-how-to-watch-5th-t20-cricket-match-anywhere",
  "title": "New Zealand vs Australia live stream: how to watch 5th T20 cricket match anywhere",
  "category": "computing",
  "updated": "2021-03-09T02:11:32Z",
  "author": "james-laird",
  "summary": "Aussies with all the momentum heading in to today's decider",
  "article": [
    "Wellington seems to suit Australia's cricketers, as the Baggy Greens have fought back from an 0-2 series hole this week to level things heading in to today's 5th and final T20 match. It's winner takes all and the tourists now have all the momentum, so follow our guide below as we explain how to get a New Zealand vs Australia live stream - watch every ball of the 5th T20 cricket match, wherever you are in the world right now.",
    "New Zealand's strong start saw the hosts jump out to an impressive 2-0 lead and grabbed the cricketing world's attention, coming as it did off the back of an equally assured 2-0 Test win over Pakistan. Australia, on the other hand, looked lost and like they were still reeling from their bitter 2-1 series defeat at home to India.",
    "However, the Aussies have turned it around in stunning fashion and could complete a remarkable comeback with a third straight win today, after they beat the Kiwis by 50 runs in Friday's fourth game.",
    "That result levelled things at 2-2 and means it all comes down to this Sunday's match, which is once again being played at Wellington Regional Stadium without fans, due to current Covid-19 regulations in New Zealand. Not even the most callous Baggy Greens fan wants to see their Antipodean neighbors facing a renewed threat from the pandemic, yet the fact remains the Black Caps' two wins came when they had their supporters cheering them on.",
    "A decisive T20 shootout between these two countries is pretty much as high-octane as cricket gets. Read on as we explain how to watch a New Zealand vs Australia live stream for the 5th match of the thrilling series.",
    "In the UK, Australia, New Zealand, India or the US? We've got you covered below with your official broadcasting options.",
    "But if you're out of the country and are still desperate to tune into certain matches, you'll quickly find that online access is geo-blocked. In order to get around that (and assuming it complies with the Ts&Cs of the broadcaster in question), you can download and use a VPN.",
    "Use a VPN to watch New Zealand vs Australia T20 cricket anywhere",
    "First T20: 22nd February, Hagley Oval (Christchurch) - won by New Zealand",
    "Second T20: 25th February, University of Otago Oval (Dunedin) - won by New Zealand",
    "Third T20: 3rd March, Wellington Regional Stadium (Wellington) - won by Australia",
    "Fourth T20: 5th March , Wellington Regional Stadium (Wellington) - won by Australia",
    "Fifth T20: 7th March, Wellington Regional Stadium (Wellington), 12pm NZDT / 10am AEDT / 4.30am IST / 11pm GMT (Sat) / 6pm ET (Sat)"
  ],
  "headers": {
    "5": "How to watch New Zealand vs Australia from outside your country",
    "8": "New Zealand vs Australia 2021: T20 series schedule, results, dates and times"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}