{
  "source": "https://www.techradar.com/news/halo-comes-to-your-car-with-master-chief-as-navigator",
  "title": "Halo comes to your car with Master Chief as navigator",
  "category": "gaming",
  "updated": "2021-08-04T09:18:14.391Z",
  "author": "axel-metz",
  "summary": "Turn left, Spartan",
  "article": [
    "Microsoft and Google have teamed up to bring a variety of Halo-themed features to navigation app Waze, including the option to have Master Chief give you directions.",
    "The move comes as part of a promotional push for Halo Infinite, which is due for release later this year and recently began technical previews for its multiplayer component.",
    "Drivers can also enable the voice of Escharum, Halo Infinite’s main antagonist, and have their vehicle appear in the Waze app as either a Warthog or Ghost, depending on which character they choose to play navigator.",
    "The Halo experience is enabled by tapping the ‘Drive with Master Chief’ button in the Waze app menu, where users are then prompted to select their ‘Mood’ – allegiance to either the UNSC or Banished, basically.",
    "That’s about all the fun you can have with the app update, which is more of a novelty than any sort of experience-enhancer – though you could conceivably host a Warthog vs Ghost race?",
    "It’s worth noting that, although the promotion is available to Waze users worldwide, the official Xbox blog post announcement clarifies that Master Chief and Escharum’s voice directions are only applicable in English, Spanish, French or Portuguese (no Greek – sorry, Spartans).",
    "The blog also confirms that the Halo-themed experience is a limited time promotion, so get driving while you can.",
    "As harmless as this particular promotion seems to be, caution should be applied when searching for Halo-themed content on the web, especially with the game still months away from release (November is our best guess).",
    "A mistake in the build of Halo Infinite’s first technical preview meant spoiler-filled campaign files were leaked online, with 343 Industries' Joseph Staten describing the situation as “painful for the dev team.”",
    "Of course, we haven’t detailed the spoilers anywhere on TechRadar (the above news story simply reports on the fact of the leak), but we would suggest following our guide to muting words on Twitter if you’re keen to keep Halo Infinite unspoiled ahead of its release.",
    "In the meantime, why not go for a drive with Master Chief?",
    "Via The Verge"
  ],
  "headers": {
    "7": "Analysis: Some Waze to go until Halo Infinite"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "technical previews": "https://www.techradar.com/news/halo-infinite-beta-is-finally-up-and-running-and-the-bots-are-hilarious",
    "Xbox blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1161948063347644700&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F08%2F03%2Fbanish-traffic-with-halo-waze-content%2F",
    "were leaked online": "https://www.techradar.com/news/halo-infinite-campaign-spoilers-leak-from-technical-preview",
    "muting words on Twitter": "https://www.techradar.com/how-to/how-to-mute-people-and-words-on-twitter",
    "The Verge": "https://www.theverge.com/2021/8/3/22607927/waze-master-chief-halo-infinite-maps-promotion-warthog"
  }
}