{
  "source": "https://www.techradar.com/news/marvels-eternals-merchandise-teases-first-look-at-the-mcu-movies-potential-villains",
  "title": "Marvel's Eternals merchandise teases first look at the MCU movie's potential villains",
  "category": "entertainment",
  "updated": "2021-03-08T15:32:24.104Z",
  "author": "tom-power",
  "summary": "Will Kro and Arishem be the film's antagonists?",
  "article": [
    "Marvel's Eternals is still on course for its November 5 release this year. We're yet to receive confirmation on which villains are involved in the movie, but a new online merchandise drop has teased who that might be.",
    "A bunch of Eternals t-shirts recently landed on American department store Kohl's website (h/t ComicBook.com). The clothing line shows off a number of comic book-inspired designs and the movie's logo, but there are two particular motifs that stand out from the rest.",
    "Scroll down the Eternals page, and you'll come across t-shirts depicting Kro the Deviant and the Celestial known as Arishem the Judge. These two characters have played vital roles in the Eternals' comic history. If the duo have their own T-shirt designs, it's possible they'll play a prominent role in Chloé Zhao's upcoming movie adaptation.",
    "Check out their designs in the tweet below, and then read on to find out why Kro and Arishem might be integral to the Eternals' plot:",
    "For those unfamiliar with the Eternals' comic history, they're a group of immortal beings who were created by the Celestials. These extremely powerful cosmic beings visited Earth millions of years ago and experimented on humanity's early ancestors. Three species were born from that event – humans, the Eternals, and the Deviants.",
    "The Deviants are abnormal, disfigured beings who possess DNA mutations, which can lead to changes in skin color, behavioral issues, and other deformations. Thanos belongs to the Deviant race in the comics, so we've technically seen this race in the MCU prior to Marvel's Eternals.",
    "Kro is considered to be another powerful Deviant. In the comics, he's been a Deviant warlord, was king for a brief spell, and even had a relationship with the Eternal known as Thena. Angelina Jolie portrays Thena in Marvel's Eternals, so expect her storyline to feature Kro is some capacity. Kro could be an outright villain, or a Loki-type character who teams up with the Eternals to prevent a bigger universal threat.",
    "Speaking of a potentially bigger foe, Arishem could be that individual. In the comics, Arishem has the power to judge civilizations and decide which ones may live or die. They make their decision based on how a planet's primary species is evolving, adapting, or advancing. If they deem that a certain civilization isn't living up to its potential, Arishem can wipe them out, which can set a species back thousands – if not millions – of years back on the evolutionary path.",
    "We've seemingly already had a glimpse of Arishem in action in the MCU. 2014's Guardians of the Galaxy showed a Celestial wiping out a race when The Collector revealed that Starlord's ragtag bunch had the Power Stone in their possession. If this was Arishem carrying out the task, it stands to reason that they will return to Earth in the wake of Avengers: Endgame to potentially carry out a similar act.",
    "Why would they do such a thing? Well, Thanos wiped out half of the universe by acquiring most of the Infinity Stones on Earth. If Arishem thinks Earth's human population, the Avengers, or the Eternals should have done more to stop him first time around, they may judge humanity harshly and send them back to the Stone Age.",
    "Alternatively, Arishem may show up to 'politely' ask why the Eternals didn't step in when Thanos, a Deviant enemy of theirs, rocked up and carried out his genocidal plan.",
    "Whatever Kro's and Arishem's roles are, we'll know for sure when Marvel's Eternals arrives on November 5."
  ],
  "headers": {
    "4": "What role will Kro and Arishem play in Marvel's Eternals?"
  },
  "links": {
    "Marvel's Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know",
    "Kohl's website": "https://kohls.sjv.io/c/221109/362118/5349?subId1=trd-us-1199724990492947200&sharedId=trd-us&u=https%3A%2F%2Fwww.kohls.com%2Fsearch.jsp%3Fsubmit-search%3Dweb-regular%26search%3Deternals%26kls_sbp%3D53298474415817235114413550063637693727",
    "ComicBook.com": "https://comicbook.com/marvel/news/wandavision-finale-interview-aerospace-engineer-quicksilver-multiverse-matt-shakman/"
  }
}