{
  "source": "https://www.techradar.com/news/the-new-fire-tv-stick-remote-goes-all-in-on-netflix-hulu-and-disney-plus",
  "title": "Amazon Fire TV Stick gets a new Alexa Voice Remote – here's what's different",
  "category": "televisions",
  "updated": "2021-03-26T12:11:26Z",
  "author": "henry-st-leger",
  "summary": "Amazon gives in to the competition",
  "article": [
    "Amazon's range of Fire TV Sticks is getting a new, updated remote, and it could be the biggest change to come to the clicker since its inception.",
    "Photos of the new Fire TV Stick remote show off four dedicated shortcut buttons to TV streaming services such as Netflix, Disney Plus, and Hulu, as well as Amazon Prime Video.",
    "It's a fascinating concession for Amazon to make, given its own Prime Video platform is sharing space with its competition. The Fire TV platform is well known for aggressively pushing Prime Video content and affiliates channels, even if it doesn't banish the likes of Netflix entirely.",
    "The new remote is far more akin to the Roku remote, both in its shortcuts and the more colorful appearance. Amazon's Fire TV Stick remote has traditionally been an all-black affair, but this updated model has a decent splash of color to differentiate it from previous iterations.",
    "There's now even a blue Alexa button near the top of the remote, for those wanting to jump straight into voice commands, as well as a button for accessing a live TV guide.",
    "The new Alexa remote will come packaged in with the latest Fire TV Stick (2020) model for now, though not other models in the Fire TV range at present. The cheaper Fire TV Stick Lite makes do with a simplified remote without volume or AV controls, in order to lower costs, so we don't expect it see it come to that model at this time – though the Fire TV Stick 4K and Fire TV Stick Cube are likely contenders down the line.",
    "The remote will be available from April 14 in the US, and shoppers will also have the option to buy it separately from any streamer, in case you just want to upgrade your current setup. It's not currently listed on Amazon UK, but it's pretty certain we'll see a global rollout later in the year.",
    "It doesn't look to be enough of an overhaul for us to say it's an essential purchase, though – and be warned that the now-discontinued Fire TV streamer and first-gen Fire TV Stick aren't compatible with the new remote.",
    "Via CNET"
  ],
  "headers": {
    "5": "Where, when, and how much"
  },
  "links": {
    "Fire TV Stick (2020)": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Fire TV Stick Lite": "https://www.techradar.com/reviews/amazon-fire-tv-stick-lite",
    "Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Fire TV Stick Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "in the US": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB08D6WJYD9%2Fref%3Das_li_ss_tl%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1846180663316186400-20",
    "Fire TV": "https://www.techradar.com/reviews/amazon-fire-tv-2017-review",
    "CNET": "https://www.cnet.com/news/amazons-new-fire-tv-remote-features-buttons-for-netflix-disney-plus-hulu-and-prime-video/#ftag=CAD590a51e"
  }
}