{
  "source": "https://www.techradar.com/news/loki-is-the-wild-buddy-cop-mcu-show-we-didnt-know-we-needed",
  "title": "Loki is the wild buddy cop MCU show we didn’t know we needed",
  "category": "entertainment",
  "updated": "2021-06-08T16:00:00Z",
  "author": "tom-power",
  "summary": "We’ve seen Loki’s first two episodes – here’s our spoiler-free review",
  "article": [
    "Remember when the MCU had a villain problem? As good as Marvel’s Phase 1 and 2 movies are, the lack of investable antagonists (or ones who weren’t carbon copies of each film’s heroes) was a regular criticism that many fans and critics had.",
    "Marvel Studios fixed this issue with its Phase 3 offerings – Eric Killmonger and Thanos are two such examples – but there was one villain that Marvel did get right in its earlier MCU projects: Loki.",
    "Now, a decade after Tom Hiddleston’s debut as the God of Mischief in 2011’s Thor (and after his Avengers: Infinity War death), Loki is back and, this time, he’s taking center stage.",
    "Loki will star in his own MCU TV show when it launches on Disney Plus on June 9 – and, frankly, after seeing the first two episodes, we think it’s the best (and most important) Marvel TV series yet.",
    "Loki picks up straight after Avengers: Endgame. As a result of the Avengers’ slightly botched time travel heist in Endgame, the 2012 version of Loki (Hiddleston) has escaped with the Tesseract and prepares to concoct a new plan to conquer Earth.",
    "Or so he thinks. Loki is immediately detained by the Time Variance Authority (TVA), a bureaucratic organization that oversees every timeline in the Marvel Cinematic Multiverse (MCM), for removing the Tesseract from its proper point in time.",
    "Charged with disrupting the Sacred Timeline (the MCM’s main timeline as decreed by the Time Keepers), Loki is labeled a “time variant” and looks set to be deleted from existence. That is, until Agent Mobius (Owen Wilson) offers him a way out: help the TVA track down a greater threat to the timeline and his sentence may not be so extreme.",
    "From the outset, it’s clear that Hiddleston relished the opportunity to revisit 2012-era Loki and dig into the many facets that make up his complex character. Loki’s pre-Thor: The Dark World persona is back at its brazen best and it’s fun to see Hiddleston dive back into that side of Loki once more, even if the character’s ego takes a humorous beating from the TVA’s unperturbed workforce.",
    "It’s this clashing of Loki’s cocky attitude with the TVA’s unflappable employees that makes for many humorous moments early on, too. There are slapstick incidents aplenty, but the verbal sparring between Loki and Mobius, in particular, is a highlight. It plays out like a chess match as the pair strategically try to outmaneuver each other and, just as equally, sets the stage for the duo’s burgeoning bromance-style relationship to come.",
    "In truth, it’s pleasing to see Marvel’s signature humor make a return. Enjoyable as WandaVision and The Falcon and the Winter Soldier were, both were somewhat lacking in the comedy stakes. In contrast (largely thanks to Hiddleston’s performance), Marvel’s latest series unleashes its humor from the get-go, and it’s all the better for it.",
    "That isn’t to say that the series trades heartfelt drama for comedy. Loki is a tragic character, and seeing his arrogant facade stripped away by Mobius during the first episode is surprisingly heart wrenching. This is a villain-turned-antihero who believes he’s destined for greatness but, through Mobius’ psychoanalysis, has his sense of identity challenged and deep-seated trauma brought to the surface.",
    "It’s tough to watch, particularly when Mobius uses MCU flashbacks and flash-forwards to stick the knife in, but it feels necessary. Audiences want a lead character they can invest in and, though charismatic as Loki is, leaning into his vulnerable side is a solid way for the show’s writing team to get viewers on side and root for him to succeed.",
    "Speaking of Mobius, Wilson is on top form here. Loki is the actor’s first major TV role, but it feels like it was tailor made for him, with his soft-but-stern approach to Mobius key to keeping Loki in line (or at least trying to anyway). Wilson and Hiddleston’s chemistry is natural and buddy cop-esque without coming across as trite, too, and seems like it’ll be central to the show’s overarching plot.",
    "Add in strong performances from other cast members – Gugu Mbatha-Raw and Wunmi Mosaku are scene stealers as Ravonna Renslayer and Hunter B-15 respectively – and there isn’t a weak link to be seen.",
    "Production wise, Loki is as visually impressive as any preceding Marvel TV project. Its retro modern sci-fi aesthetic, especially where the TVA is concerned, is not only an homage to sci-fi movies like Brazil and Metropolis, but also helps Loki’s TV series to feel unique in the realm of the MCU.",
    "That distinctive approach to Loki is evident through its genre-spanning plot, too.",
    "Marvel has developed a knack for incorporating various genres into its many productions, and the same is true here. Loki may be comedy-centric to begin with, but it soon veers into other genre territories including mystery thriller, crime drama and trippy space opera.",
    "The seamless transition between these isn’t novel for Marvel but, here, it works extremely well. Each genre switch feels organic, and there are shades of Doctor Who, Se7en, Blade Runner, Men in Black and even horror films like Alien within Loki’s plot and multiple settings.",
    "Like WandaVision and The Falcon and the Winter Soldier before it, Loki is pretty devoid of action sequences in its opening act – but that’s a good thing. Combat-heavy moments are certain to come but, given the amount of world building and exposition that’s detailed in the first two episodes, the inclusion of major action sequences would have been unnecessary.",
    "What is unavoidable early in Loki’s six-episode run, though, is ties to the MCM – and it has plenty of them. Numerous callbacks are made to previous Marvel movies within its first episode alone (WandaVision is indirectly referenced, too) but what’s far more intriguing is how Loki appears to set up future Marvel productions.",
    "Without spoiling anything, it’s clear that Loki will impact upcoming films, even if it doesn’t appear that it’ll do so directly. We already know of two Marvel movies that will explore the MCM in more detail, and Loki certainly alludes to events that are yet to transpire. It’ll be enthralling, then, to see how Mobius’ explanation of Marvel timelines – or Loki’s series as a whole – will inform those films when they arrive.",
    "Loki feels like a Marvel TV series that will break new ground. It’s grander in scope, bigger in scale by way of its multiverse exploration, and so far feels like a six-hour movie rather than a near 60-minute, six-episode TV show.",
    "It may not be as inventive as WandaVision with its novel use of sitcoms, nor does it deal with major real-world issues like The Falcon and the Winter Soldier, and its examination of racism when it comes to who gets to be Captain America.",
    "Loki, though, is far bigger and more important, from a multiverse perspective, than its predecessors. It raises the bar about what we should expect from Marvel TV shows moving forward while delivering an enjoyable, thrilling and surprisingly emotional adventure that will create plenty of online debate and fan theories.",
    "It’ll be fascinating to see how the rest of Loki pans out but, if its first two episodes are anything to go by, we’re in for a wild, amusing and surreal ride with plenty of twists and turns along the way.",
    "Loki launches exclusively on Disney Plus on Wednesday, June 9."
  ],
  "headers": {
    "4": "Burdened with glorious purpose",
    "14": "Leading the multiverse charge",
    "21": "What we think"
  },
  "links": {
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place"
  }
}