{
  "source": "https://www.techradar.com/news/ericsson-well-placed-to-capture-5g-momentum-as-sales-rise-again",
  "title": "Ericsson 'well placed' to capture 5G momentum as sales rise again",
  "category": "phones",
  "updated": "2021-04-21T13:08:48Z",
  "author": "steve-mccaskill",
  "summary": "Ericsson benefits from accelerated 5G rollouts",
  "article": [
    "The acceleration of 5G deployments around the world has allowed Ericsson to produce another set of encouraging results during the first quarter of 2021.",
    "The Swedish telecoms equipment manufacturer has benefited significantly from the rollout of next-generation networks, the pace of which has increased thanks to the elevated role of connectivity in society during the pandemic.",
    "Governments in particular believe 5G will be a key enabler of the post-Covid economic recovery.",
    "Along with Huawei and Nokia, Ericsson is one of the ‘big three’ telecoms equipment manufacturers, offering radio, core and other networking technologies to mobile operators. It has invested significant resources into the development of its 5G portfolio and is reaping the rewards.",
    "Ericsson has also benefited from the exclusion of Huawei in the rollout of 5G in several countries, including the UK.",
    "Although reported revenues remained static at 49.8 billion SEK (£4.23bn), the figure increases to 10% when it is adjusted for comparable units and currency fluctuations. Notably, network sales were up 15%, while the increased margins on the sales of 5G gear have improved the overall profitability of the business. Pre-tax earnings rose from 4.6 billion SEK to 5.3 billion SEK (£450m) – an increase of 16%.",
    "Ericson CEO Börje Ekholm said the figures were validation of its strategy and product portfolio and noted that the company had been able to overcome a global chip shortage currently impacting the mobile industry.",
    "One blot on the copybook, however, was a fall in licensing income. Ericsson says this was due to expired contracts and lower volumes with one licensee in particular, reported to be Samsung. Ekholm said that both “legal and negotiation processes” were ongoing.",
    "“We are well positioned to take advantage of the continued market momentum with a competitive 5G product portfolio and cost structure,” he declared.",
    "“The ongoing global pandemic has fast-forwarded the digitalization of societies, placing a significant economic and social premium on high-quality network connectivity. A resilient global digital infrastructure is critical. We see positive signs of governments and enterprises increasingly recognizing 5G as a preferred choice for connectivity with accelerating deployment.”",
    "“There is strong momentum in the global 5G demand with lead markets moving forward at high pace, creating opportunities for us to grow our core business. To that end we continue to invest in further strengthening our portfolio and growing our global footprint.”"
  ],
  "headers": {
    "3": "Ericsson 5G sales"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}