{
  "source": "https://www.techradar.com/news/horizon-forbidden-west-developer-guerilla-games-could-be-working-on-a-multiplayer-project",
  "title": "Horizon Forbidden West developer could be working on a multiplayer project",
  "category": "gaming",
  "updated": "2021-09-29T17:35:48Z",
  "author": "jamel-smith",
  "summary": "Aloy and Erend co-op?",
  "article": [
    "Some recent job postings on Guerilla Games’ website are sparking our imaginations that we could see some form of multiplayer coming to the Horizon world.",
    "The job posting for a senior social systems designer (spotted by VGC) mentions features that’ll allow players to form “guild-like groups” to “explore the world together and design features and systems that promote health and fun experiences for our player community”.",
    "The other job posting on the site is for a senior games writer that’s looking for people who have extensive knowledge of stories and narrative design in open-world RPG games, online games, and MMORPGs.",
    "It’s unclear whether these new job postings could be for Horizon or something totally different, like a new IP. But VGC previously reported that a co-op mode was originally planned for Horizon Zero Dawn, but to everyone’s dismay, was scrapped so Guerilla Games could focus on other areas of the first game.",
    "Guerilla Games’ next highly anticipated title, Horizon Forbidden West, arrives exclusively on PS4 and PS5 on February 18, 2022.",
    "In the last few years we’ve gotten a number of fantastic single-player experiences on PS4 and, more recently, on PS5. Titles that come to mind are God of War from Santa Monica Studios, the Uncharted games from Naughty Dog, and the Horizon series from Guerilla Games.",
    "But, if these job postings are anything to go by, Sony might be chasing more multiplayer experiences from its developers.",
    "The recent Ghost of Tsushima: Legends is probably one the best free DLC’s ever released, providing a fun-but-challenging multiplayer mode for Ghost of Tsushima owners. Just this week, Naughty Dog has confirmed they’re working on a Last of Us 2 multiplayer project, delighting fans of the multiplayer mode from the first Last of Us game. The evidence suggests that developers are trying to put more multiplayer experiences in these traditionally single-player-only games.",
    "That said, we’ll be looking forward to seeing what Guerilla Games has in store for gamers in the future, whether it’ll be a multiplayer add-on, or a standalone multiplayer game. Either way, we’re excited for it."
  ],
  "headers": {
    "5": "Analysis: Does Sony want more multiplayer experiences from its developers?"
  },
  "links": {
    "VGC": "https://www.videogameschronicle.com/news/it-looks-like-guerrilla-could-be-working-on-a-horizon-multiplayer-game/",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "multiplayer mode for Ghost of Tsushima": "https://www.techradar.com/news/ghost-of-tsushima-dev-is-seemingly-making-a-ps5-multiplayer-game",
    "Last of Us 2 multiplayer project,": "https://www.techradar.com/news/yes-the-last-of-us-2-multiplayer-game-is-still-happening"
  }
}