{
  "source": "https://www.techradar.com/news/even-more-new-ipads-like-the-ipad-mini-6-could-be-on-the-way-soon",
  "title": "Even more new iPads, like the iPad Mini 6, could be on the way soon",
  "category": "tablets",
  "updated": "2021-04-30T09:22:56Z",
  "author": "tom-bedford",
  "summary": "According to documents",
  "article": [
    "When the iPad Pro (2021) launched people were expecting the iPad Mini 6 to get announced too - that didn't happen, but it looks like Apple has a few more tablets that could be coming soon.",
    "This comes from a Eurasian Economic Committee (EEC) listing, as spotted by MySmartPrice, which seems to list a load of new iPads. EEC listings typically only go up in the weeks preceding a launch.",
    "While no names are included in the listing, it refers to 'Apple tablets' that are 'running iPadOS 14' so Sherlock isn't needed to figure out that these are iPads we're looking at.",
    "There are eleven model numbers included: A2459, A2460, A2461, A2568, A2569, A2589, A2604, A2377, A2378, A2567 and A2602. Those identifiers don't give us much, but the similarities between some suggest they're not completely new tablets, but variations - perhaps a cellular and Wi-Fi-only version of the same slate, for example.",
    "Since all iPad model numbers are around the A2XXX or A3XXX mark, we can't even point to a specific range these slates belong to. We can do some deductions to guess, though.",
    "We're not expecting the iPad Air 5 for at least six months, and possibly even a year, so it would be a surprise if that was referred to. The 2021 iPad isn't expected until the end of the year either, so that's pretty unlikely too, though the odds of us seeing a new entry in that line at some point in 2021 are much higher than of the Air.",
    "Our money is on the iPad Mini 6, which has been rumored for a while, as the last entry is two years old now. The reason for loads of model numbers could be different versions of it - or an iPad Mini Pro, which some leakers think is coming.",
    "We'll have to wait to know for sure, and all we can do for now is guess - though this EEC listing does make it seem likely that one or more new tablets of some kind are on their way."
  ],
  "headers": {
    "3": "So which iPads are these?"
  },
  "links": {
    "iPad Pro (2021)": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPad Mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "MySmartPrice": "https://www.mysmartprice.com/gear/apple-ipad-eurasian-database-eec-upcoming-ipad-mini-ipad-2021/",
    "iPad Air 5": "https://www.techradar.com/news/ipad-air-5",
    "2021 iPad": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "iPad Mini Pro": "https://www.techradar.com/news/ipad-mini-pro-could-launch-this-year-as-well-as-the-ipad-mini-6"
  }
}