{
  "source": "https://www.techradar.com/news/microsoft-outlook-will-soon-stop-you-sending-tone-deaf-emails",
  "title": "Microsoft Outlook will make you think twice before sending your next email",
  "category": "computing",
  "updated": "2021-08-19T17:56:04Z",
  "author": "joel-khalili",
  "summary": "Outlook tone detector should spare a few blushes",
  "article": [
    "Microsoft is building a new feature for Outlook that should minimize the opportunity for miscommunications over email.",
    "According to a new entry in the company’s product roadmap, the Outlook web client will soon be equipped with a tone detector.",
    "“Microsoft Editor in Outlook on the web will now offer writing refinements and suggest conversation tone,” the post explains.",
    "Microsoft is still putting finishing touches on the new feature, which should become available to users next month.",
    "With the rise of remote working during the pandemic, the ability to communicate effectively over email and text-based chat has become a vital attribute for employees. But for many people, this is easier said than done.",
    "Without voice intonation, body language and facial prompts to add context to interactions, nuances are often lost and intended tone misinterpreted. Sarcasm, for example, is much more difficult to communicate over virtual channels, and feedback is difficult to frame without appearing overly critical.",
    "Although details remain scant, it appears the new Outlook feature will intervene when someone is about to fire off a message that is likely to be misinterpreted in one way or another, as well as policing for errors of grammar and spelling.",
    "In theory, the Outlook tone detector will give users a chance to revisit messages, which may have been composed in a hurry or in a state of frustration, and make revisions if necessary - for the sake of diplomacy.",
    "Microsoft has said nothing about the underlying technology that will make the new Outlook feature possible, but TechRadar Pro has asked for further clarification."
  ],
  "headers": {
    "4": "Microsoft Outlook update"
  },
  "links": {
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "email": "https://www.techradar.com/news/best-email-provider",
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6839924190675335000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D86539",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}