{
  "source": "https://www.techradar.com/news/windows-11-system-requirements-are-bad-news-for-old-laptops-and-pcs",
  "title": "Windows 11 system requirements are bad news for old laptops and PCs",
  "category": "computing",
  "updated": "2021-06-24T16:03:33Z",
  "author": "matt-hanson",
  "summary": "Now 64-bit only",
  "article": [
    "As expected, Microsoft has announced Windows 11 at its event today, and it also revealed the system requirements that are needed to run the new operating system.",
    "These system requirements, which we list below, are bad news for people with older laptops and PCs, as it may mean you can’t upgrade to Windows 11. However, you’ll still be able to use Windows 10 for the next few years at least – with Microsoft supporting the OS until October 14, 2025.",
    "The bump in hardware required can also been seen as good news for anyone who was hoping for a more revolutionary and ambitious update from Microsoft as well. You can also download the Windows PC Health Check to see if your current PC meets the requirements to run the new Windows 11 OS, though this doesn't appear to be accurate at the time of writing, displaying that folk using even a Ryzen 9 5900X CPU and 32GB of RAM don't meet the current system requirements.",
    "Perhaps the biggest issue for people running older hardware is that 32-bit systems are not able to run Windows 11.",
    "This may not come as a huge surprise. Most modern systems are 64-bit these days, and the limits of 32-bit hardware has meant other operating systems, such as many Linux distros, to ditch 32-bit support.",
    "By being 64-bit only, Windows 11 can be more ambitious and not held back by catering for 32-bit systems.",
    "However, this probably won’t be too much comfort for people using 32-bit hardware, who will now have to completely upgrade their gadgets to get Windows 11.",
    "Another big change is that Windows 11 Home users will need to be connected to the internet when they first set up their device. They will also need to have a Microsoft Account – local accounts won’t be accepted.",
    "While Microsoft claims this will help Windows 11 Home be a more connected operating system which is better customised to your interests, and you’ll only need to be connected to the internet during the initial setup, this will still be concerning for some people.",
    "If you live in an area with poor internet connectivity, for example, then this could cause problems. For people who don’t want a Microsoft Account, this could also prove annoying, but at least they are free.",
    "This only affects Windows 11 Home – Windows 11 Pro will continue to allow offline setup."
  ],
  "headers": {
    "3": "Bye bye 32-bit",
    "7": "Internet connection required"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "with Microsoft supporting the OS until October 14, 2025": "https://www.techradar.com/news/microsoft-is-planning-to-kill-off-windows-10-in-2025-does-this-confirm-windows-11",
    "Windows PC Health Check": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1115223329174451800&xs=1&url=https%3A%2F%2Fdownload.microsoft.com%2Fdownload%2F1%2Fd%2Fd%2F1dd9969b-bc9a-41bc-8455-bc657c939b47%2FWindowsPCHealthCheckSetup.msi&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-11-system-requirements-are-bad-news-for-old-laptops-and-pcs"
  }
}