{
  "source": "https://www.techradar.com/news/new-firefox-update-brings-increased-privacy-protection-to-mozillas-browser",
  "title": "New Firefox update brings increased privacy protection to Mozilla's browser",
  "category": "computing",
  "updated": "2021-02-23T18:40:37Z",
  "author": "anthony-spadafora",
  "summary": "Total Cookie Protection protects users from being tracked across the web",
  "article": [
    "With more employees working from home than ever before, the internet continues to play a much larger role in our daily lives which is why Mozilla is bringing new multi-tasking and privacy protection features to Firefox.",
    "To help prevent users from being tracked on the web, the company has announced Total Cookie Protection for Firefox. This feature stops cookies from tracking users across the web by creating a separate cookie jar for each website.",
    "Total Cookie Protection is the latest tool in Mozilla's suite of privacy protections called Enhanced Tracking Protection. By combining this new feature with Firefox's recently announced supercookie protections, the browser now offers comprehensive protection against cookie tracking on desktop and on mobile for smartphones running Android.",
    "SVP of Firefox, Selena Deckelmann provided further insight on how Mozilla has been working to prevent cookies from tracking its users in a blog post, saying:",
    "\"In our ongoing commitment to bring the best innovations in privacy, we are working tirelessly to improve how Firefox protects our users from tracking. In 2019, Firefox introduced Enhanced Tracking Protection (ETP) which blocks cookies from known, identified trackers, based on the Disconnect list. To bring even more comprehensive protection, Total Cookie Protection confines all cookies from each website in a separate cookie jar so that cookies can no longer be used to track you across the web as you browse from site to site.\"",
    "Last year Mozilla released a Picture-in-Picture feature for its browser which received high praise from Firefox users and even managed to top the company's Best of Firefox 2020 features list. However, some users wanted more than just one picture-in-picture view.",
    "For this reason, Mozilla has added multiple picture-in-picture views to its desktop browsers for Mac, Linux and Windows with keyboard controls for fast forward and rewind.",
    "This new feature could certainly help those who work with a lot of videos multi-task but it's also launching ahead of one of the biggest sporting events of the year, March Madness.",
    "To get started using Total Cookie Protection or multiple picture-in-picture views, you can download the latest version of Firefox on Mozilla's website."
  ],
  "headers": {
    "5": "Multiple Picture-in-Picture"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "Enhanced Tracking Protection": "https://www.techradar.com/news/mozilla-firefox-update-protects-users-against-redirect-tracking",
    "supercookie": "https://www.techradar.com/news/these-tiny-icons-could-be-tracking-you-across-the-internet",
    "blog post": "https://blog.mozilla.org/blog/2021/02/23/latest-firefox-release-includes-multiple-picture-in-picture-and-total-cookie-protection/",
    "Best of Firefox 2020 features list": "https://blog.mozilla.org/blog/2020/12/15/our-year-in-review-how-weve-kept-firefox-working-for-you-in-2020/",
    "multiple picture-in-picture views": "https://www.techradar.com/news/firefox-will-soon-let-you-have-multiple-picture-in-picture-video-windows",
    "March Madness": "https://www.techradar.com/news/March-madness-tv-sales-2021-final-deals"
  }
}