{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-will-end-with-a-massive-dc-cameo-but-who-will-it-be",
  "title": "Zack Snyder's Justice League will end with a massive DC cameo – but who will it be?",
  "category": "entertainment",
  "updated": "2021-02-23T15:10:51Z",
  "author": "tom-power",
  "summary": "Which superhero will show up?",
  "article": [
    "Zack Snyder’s Justice League will include a superhero appearance that fans aren’t expecting, according to a recent report.",
    "In an extensive Vanity Fair feature, which explores the inside story behind the director’s original vision for the DCEU movie, author Anthony Breznican revealed that Snyder has re-shot the film’s ending with a “hero cameo that will blow hard-core fans’ minds”. As you might expect from such a tease, the internet is rife with speculation as to which character may rock up when the Snyder Cut launches on March 18.",
    "Many fans had suspected that Ryan Reynolds would reprise his role as Hal Jordan – aka Green Lantern – from 2011’s panned adaptation. However, Reynolds has taken to Twitter to refute those claims in typically droll fashion, so it remains unclear who might show up.",
    "Check out Reynolds’ tweet below, and keep scrolling for our theories on who this mysterious cameo could be.",
    "Reynolds could be bluffing to throw fans off the scent, but who else might appear if Hal Jordan doesn’t show up in Justice League?",
    "The obvious choice would be Martian Manhunter, but we already know that character will feature in the upcoming HBO Max movie. Snyder and General Swanwick actor Harry Lennix have confirmed that the high-ranking army officer is a ruse for J’onn J’onzz, aka Martian Manhunter, with Lennix telling Variety that he has filmed scenes for the character’s Justice League reveal. With J’onn J’onzz’s appearance confirmed, this probably won't be the massive cameo that’s been hinted at.",
    "While Reynolds’ Green Lantern incarnation won’t return, it’s possible that another Green Lantern may show up. Alan Scott, the original bearer of the ring, might appear, or a Bronze Age Green Lantern such as John Stewart may reveal themselves to the world. Green Lantern is the only member of the comic book’s original Justice League lineup who hasn’t made an appearance yet, so this would be a cool inclusion.",
    "A left-field possibility could be Shazam. The 2019 Zachary Levi-starring superhero movie included a Superman Easter egg during its final scene – even though Henry Cavill didn't reprise his role – and Shazam has been part of the Justice League in the comics.",
    "Snyder won’t be returning for future DC movies, so this could just be a fun little nod to Warner Bros’ wider comic book universe as he heads off to pursue other creative endeavors."
  ],
  "headers": {
    "4": "Who could Justice League’s secret cameo be?"
  },
  "links": {
    "Zack Snyder’s Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "Vanity Fair": "https://www.vanityfair.com/hollywood/2021/02/the-true-story-of-justice-league-snyder-cut",
    "confirmed": "https://vero.co/zacksnyder/pvxw-918PTrN3fZwGHjH8t2t",
    "Variety": "https://variety.com/2021/film/news/harry-lennix-martian-manhunter-justice-league-joss-whedon-zack-snyder-1234910668/"
  }
}