{
  "source": "https://www.techradar.com/news/windows-11-warning-mentions-possible-damage-to-unsupported-pcs",
  "title": "Windows 11 warning mentions possible ‘damage’ to unsupported PCs",
  "category": "computing",
  "updated": "2021-10-06T09:09:43Z",
  "author": "darren-allan",
  "summary": "Warning pop-up also confirms no updates for unsupported systems",
  "article": [
    "Windows 11 is now out, and it’s only supported on PCs which meet the specified system requirements (naturally) – but it is still possible to install it on a machine that falls short, although you will be warned against doing so.",
    "Now that the new OS is out, Microsoft has implemented a cautionary pop-up that tells users intending to install Windows 11 on a PC below the minimum spec exactly what they might be letting themselves in for. And that includes the confirmation of no updates for the operating system – including crucial security updates, the ones that fix freshly discovered vulnerabilities and exploits – which is obviously bad news in itself.",
    "Check out the warning below:",
    "As you can see, as well as missing out on vital updates, the pop-up makes it clear that putting Windows 11 on an unsupported PC may result in compatibility issues, and due to those, possible ‘damage’ that may be caused to your system which won’t be covered by any manufacturer warranty.",
    "Elsewhere in a support document, as highlighted by Windows Latest, Microsoft clarifies: “Your device might malfunction due to these compatibility or other issues. Devices that do not meet these system requirements will no longer be guaranteed to receive updates, including but not limited to security updates.”",
    "We already knew this from the beta testing of Windows 11, of course, but it’s interesting to see Microsoft spelling things out so clearly in this warning and related support material.",
    "So now we know for sure that users running Windows 11 on unsupported hardware do so not only with clear risks on the compatibility front – as you might expect – but no security updates, and the apparent possibility of something pretty nasty going awry somehow (the mention of warranties and ‘damage’ is telling in terms of trying to put would-be experimenters off).",
    "Certainly we’d heed those points of caution, particularly in the early stages of deployment for Windows 11 which was freshly launched yesterday, and in all honesty we’d recommend not installing it on any PC just yet. As we’ve discussed elsewhere, it’s best to wait a little while and see how things pan out for early adopters rather than immediately taking the plunge.",
    "That’s true even if you’re offered the new operating system by Windows Update, and particularly if you are going to side-step Microsoft’s AI-powered rollout process – which will be highly throttled to begin with – and go for a manual installation.",
    "Even for those who can’t get Windows 11 due to their device falling short of the system requirements, there’s far from any immediate problem with staying on Windows 10, as support for the OS runs through until 2025. At that point, you may well need a hardware upgrade anyway…"
  ],
  "headers": {
    "5": "Analysis: Spelling out the potential perils clearly"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "meet the specified system requirements": "https://www.techradar.com/news/windows-11-system-requirements-is-your-pc-compatible",
    "Windows Latest": "https://www.windowslatest.com/2021/10/06/microsoft-warns-against-installing-windows-11-on-unsupported-pcs/",
    "clarifies": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46194&u1=trd-us-8090221635944980000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-au%2Fwindows%2Finstalling-windows-11-on-devices-that-don-t-meet-minimum-system-requirements-0b2dc4a2-5933-4ad4-9c09-ef0a331518f1",
    "Windows 11 which was freshly launched yesterday": "https://www.techradar.com/news/windows-11-is-available-to-download-now-even-though-it-comes-out-tomorrow",
    "As we’ve discussed elsewhere": "https://www.techradar.com/news/dont-install-windows-11-today",
    "and go for a manual installation": "https://www.techradar.com/news/how-to-download-windows-11",
    "support for the OS runs through until 2025": "https://www.techradar.com/news/major-windows-10-update-is-coming-to-more-pcs-whether-you-want-it-to-or-not"
  }
}