{
  "source": "https://www.techradar.com/news/adata-reveals-seriously-fast-next-gen-ddr5-ram-optimized-for-intel-motherboards",
  "title": "Adata reveals seriously fast next-gen DDR5 RAM optimized for Intel motherboards",
  "category": "computing",
  "updated": "2021-01-07T12:34:53Z",
  "author": "darren-allan",
  "summary": "MSI and Gigabyte are fine-tuning the memory for overclocking on Intel motherboards",
  "article": [
    "As part of CES 2021, Adata has announced that it is ramping up to the launch of its DDR5 system memory modules, and working in conjunction with a couple of big-name motherboard manufacturers to ensure that performance for this next-gen RAM meets expectations on Intel chipsets.",
    "Specifically, Adata has partnered with MSI and Gigabyte to ensure that both of these motherboard makers’ incoming Intel products – likely boards for Alder Lake CPUs, as that’s the Intel platform which is expected to bring in DDR5 support – work optimally when overclocking its DDR5 RAM.",
    "Motherboards with DDR5 support from MSI and Gigabyte will be launched at the same time that Adata makes its DDR5 memory available.",
    "Adata’s DDR5 RAM will be manufactured in modules of up to 64GB capacity, and as to the speed you might expect from the memory, it’ll reach up to 8400MT/s, the company claims. The RAM will also have ECC (error-correcting code that should improve overall stability) on-board, and promises impressive power-efficiency levels.",
    "Inevitably, the initial iteration of a new RAM standard doesn’t see the fastest speeds achieved – that happens as manufacturers work to hone products in time – but the promise of 8400MT/s out of the gate is an enticing starting point (even if it’s a performance level that you will doubtless have to pay a premium for, again as ever with the debut of fresh memory modules).",
    "At this point we don’t know when Adata’s DDR5 RAM will be available, as no timeframe was mentioned in the CES announcement. However, Intel’s Alder Lake platform is expected to be launched later in 2021 (although that schedule could change, particularly given that Alder Lake is a big shift to a whole new way of thinking by all accounts, and its predecessor Rocket Lake isn’t even out yet – the latter is rumored to debut in March).",
    "Samsung has previously said that its DDR5 memory will go into mass production at some point in 2021, as well as SK Hynix, and Teamgroup plans to unleash a DDR5 product possibly as early as Q3 of 2021."
  ],
  "headers": {
    "4": "Promising beginnings"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "expected to bring in DDR5 support": "https://www.techradar.com/news/intels-12th-generation-desktop-processors-could-support-ddr5-ram-before-amd",
    "expected to be launched later in 2021": "https://www.techradar.com/news/intel-alder-lake-processors-could-bring-big-changes-but-youll-have-to-wait-until-the-end-of-2021",
    "Alder Lake is a big shift": "https://www.techradar.com/news/intel-alder-lake-12th-gen-cpus-could-usher-in-a-new-socket-in-2021-leaving-z490-motherboards-out-in-the-cold",
    "rumored to debut in March": "https://www.techradar.com/news/intels-rocket-lake-cpus-could-arrive-in-march-to-combat-amd-ryzen-5000-threat",
    "Samsung has previously said that its DDR5 memory": "https://www.techradar.com/news/samsungs-superfast-ddr5-ram-will-arrive-in-2021-but-dont-plan-to-upgrade-your-pc-just-yet",
    "as well as SK Hynix": "https://www.techradar.com/news/amd-zen-4-cpus-arriving-in-2022-will-be-boosted-by-faster-ddr5-ram-rumor-claims",
    "Teamgroup plans to unleash a DDR5 product": "https://www.techradar.com/vpn/pcs-with-16gb-ram-likely-to-be-standard-in-2021-as-ddr5-hits-mainstream"
  }
}