{
  "source": "https://www.techradar.com/news/netflix-is-bringing-a-classic-horror-movie-series-back-from-the-dead",
  "title": "Netflix is bringing a classic horror movie series back from the dead",
  "category": "entertainment",
  "updated": "2021-09-02T05:02:08Z",
  "author": "samuel-roberts",
  "summary": "The Texas Chainsaw Massacre is coming to Netflix",
  "article": [
    "Netflix has announced it's bringing a new movie in the Texas Chainsaw Massacre series to the streaming service. It doesn't offer a release date, but this is a movie that actually already filmed last year – so presumably you won't have to wait too long to see it.",
    "Netflix acquired the worldwide rights to the movie from Legendary Pictures, meaning you should be able to watch it wherever you are. It's the first in the series since 2017's Leatherface, and stars Elsie K Fisher, Sarah Yarkin and Jacob Latimore – and it has the simple title of Texas Chainsaw Massacre.",
    "What's interesting is that it takes a similar approach to 2018's Halloween movie, which ignored all of the first film's dodgy sequels to present a more credible follow-up. This movie is set in the present day, but \"returns to the roots\" of the original 1974 movie from director Tobe Hooper, according to Netflix.",
    "The original Texas Chainsaw Massacre movie was an influential and important horror film, and saw Leatherface – a man wearing human skin remains of his victims as a mask – chasing down his victims with a chainsaw (the title gives it away). Hooper himself made a sequel in 1986, but none of the series' subsequent entries have reached the same critical success as the original, though some reviewers enjoyed 2017's origin story about the Leatherface character.",
    "David Blue Garcia directs this new version, while Don't Breathe director Fede Álvarez is producing it.",
    "While Netflix hasn't got an official release date for the film right now, hopefully we'll see Texas Chainsaw Massacre land in time for Halloween.",
    "2021 is likely to end as a solid year for horror movies. As well as the Fear Street series on Netflix – which wasn't that scary, but proved to be a solid Goosebumps-level fright fest for younger viewers – the follow-up Candyman just hit theaters around the world.",
    "Earlier this year, we saw the releases of the third movie in The Conjuring series and the flawed Saw revival film Spiral. July also brought us The Forever Purge, as cinemas started reopening after a long dormant period caused by the pandemic.",
    "Saw and The Conjuring director James Wan, meanwhile, will soon roll out the horror movie Malignant – which is designed to take Wan back to his indie horror roots. That's releasing in theaters worldwide, and on HBO Max in the US, on September 10. We also have the upcoming sequel Halloween Kills to look forward to, which has every chance of being the biggest horror movie event of the year.",
    "Assuming The Texas Chainsaw Massacre releases this year on Netflix, then, 2021 will end up being a much bigger year for blockbuster-style horror than 2020 was. However, even that year brought us highlights like The Invisible Man, Relic, Possessor, His House and Host – all of which need to be on any horror fan streaming list."
  ],
  "headers": {
    "6": "Analysis: Horror is getting into high gear again"
  },
  "links": {}
}