{
  "source": "https://www.techradar.com/news/google-pixel-6-vs-samsung-galaxy-s21-stylish-almost-flagship-phones-face-off",
  "title": "Google Pixel 6 vs Samsung Galaxy S21: stylish almost-flagship phones face off",
  "category": "phones",
  "updated": "2021-12-05T23:59:32Z",
  "author": "jon-mundy",
  "summary": "Small phones in a big battle",
  "article": [
    "The Google Pixel 6 is upon us, and it's instantly jumped to the top (or near enough) of the desirable upper-mid-range smartphone charts. Or at least, it has in our hype-fueled minds.",
    "It's going to have to contend with a seasoned veteran of the format if it's to succeed, though. The Samsung Galaxy S21 might be getting on a bit now, but it's still one of the best phones of its kind.",
    "So which of these two competitively priced almost-flagships is likely to be the better buy? Our full Pixel 6 review isn't ready just yet, but we've got some initial thoughts on this particular battle based on the specs and early hands-on experience.",
    "Google Pixel 6 deals will be available from October 28, with prices starting from $599 / £599 / AU$999 for 128GB. There's also a 256GB model that will set you back AU$1,129, with pricing in other regions still to be confirmed at the time of writing.",
    "The Samsung Galaxy S21 landed on January 29, 2021, with prices starting from $799 / £769 / AU$1,249 for the 128GB model. The 256GB model arrived at $849.99 / £819 / AU$1,349.",
    "These prices still apply on the official Samsung website, despite the age of the handset. However, you'll almost certainly be able to find a better deal on this phone if you shop around the usual third-party suspects.",
    "Even so, the Pixel 6 is clearly the more affordable phone of the two out of the gate. Round one to Google, it seems.",
    "The Google Pixel 6 isn't a small phone by any means. Its footprint of 158.6 x 74.8mm isn't especially large, but it's quite a thick handset at 8.9mm, and it weighs a not inconsiderable 207g.",
    "Contrast that with the Samsung Galaxy S21, which measures a mere 151.7 x 71.2 x 7.9mm, and weighs a piddling 169g.",
    "One reason the Samsung is so lightweight is the adoption of a new 'Glasstic' material for the rear cover, which is basically a slightly classier-feeling plastic. Google has gone with a more premium glass and metal sandwich approach.",
    "We loved the Galaxy S21's swooping camera module design, but Google has gone with its own distinctive lens array with the Pixel 6. Its width-spanning 'visor' module doesn't quite look like any other phone on the market.",
    "On the color front, Samsung offers Phantom Gray, Phantom White, Phantom Pink, and Phantom Violet. Google goes with Stormy Black, Sorta Seafoam, and Kinda Coral. These are two of the brightest selections out there.",
    "Both phones give you an IP68 dust and water resistance rating, as well as Gorilla Glass Victus protecting their flat displays. Both phones position their punch-hole cameras to the center of the display, too, which lends a certain sense of symmetry to things.",
    "Both of these phones have relatively compact displays, at least by the standards of modern Android flagships.",
    "The Google Pixel 6 gives you a 6.4-inch OLED while the Samsung Galaxy S21 goes with a 6.2-inch OLED. Both have 1080 x 2400 (FHD+) resolutions.",
    "Samsung wins on the smoothness front, however. It gets a 120Hz refresh rate compared to the Pixel 6's 90Hz. We're a little disappointed with the latter, in truth. Similarly priced and positioned phones like the OnePlus 9 give you the full 120Hz treatment, after all.",
    "Another way in which the Galaxy S21's display is more advanced than the Pixel 6's is through its use of LTPO technology, which lets it scale back to 48Hz when the situation dictates. You'd have to upgrade to the Google Pixel 6 Pro to get a similar feature on the Google side of things.",
    "Meanwhile, it remains to be seen if the Google Pixel 6 can match the Samsung Galaxy S21's peak brightness of around 1300 nits.",
    "We'll have to wait for the final hardware to see if the Pixel 6's display is any good then. Based on specs alone, though, it still falls a little short of the dinky Galaxy S21.",
    "Google and Samsung have always handled cameras a little differently. Google has been all about the software and algorithmic mastery, while Samsung tends to go all in with the hardware.",
    "The Pixel 6 shows signs of change. After several years of stagnation, Google has finally upped its hardware game with a new 1/1.31-inch 50MP wide camera that produces 1.2μm pixels. This is accompanied by an f/1.85 aperture.",
    "Samsung's phone is led by a 1/1.76-inch 12MP f/1.8 wide sensor that produces larger 1.8μm pixels, though it's worth pointing out that Google's system will use pixel binning to combine the information of multiple pixels into one.",
    "Both phones go with 12MP ultra-wides with f/2.2 apertures. But while the Pixel 6 lacks a dedicated telephoto sensor, the Galaxy S21 gives you a meaty 64MP sensor with a 3x hybrid optical zoom. Advantage Samsung.",
    "Neither phone lacks software tricks. With the Pixel 6, Face Unblur cleans up blurry human subjects, while Magic Eraser smartly removes unwanted background elements for those perfectly composed shots.",
    "The Galaxy S21 is all about the video, with Director's View presenting a live view of all three rear lenses at once and enabling you to hop between them, while Vlogger View enables you to record video from the front and rear cameras simultaneously.",
    "Talking of video, the Samsung Galaxy S21 can manage 8K at 24fps or 4K at 60fps, while the Google Pixel 6 can hit 4K at 60fps.",
    "Not that the Pixel 6 is lacking on the video front, with Live HDR+ using the Tensor chipset to enhance colors and tones, and Speech Enhancement pulling out voices amongst the background noise.",
    "On the front, you get a 10MP f/2.2 camera on the Samsung Galaxy S21, and an 8MP f/2.0 one on the Pixel 6.",
    "It remains to be seen what Google's first attempt at a custom processor, the Google Tensor, can do.",
    "Hopefully it's better than Samsung's Exynos 2100, which powers the international model of the Galaxy S21. Don't get us wrong, it's a capable chipset, but it lags slightly behind the off-the-shelf Snapdragon 888 that powers the US and Chinese models (not to mention most Android rivals).",
    "Both of these phones run 8GB of LPDDR5 RAM, and both offer the choice of either 128GB or 256GB of internal storage.",
    "For all these various hardware considerations, perhaps the biggest differentiating factor between the Pixel 6 and Samsung Galaxy S21 relates to software.",
    "The Pixel 6 runs Android 12 out of the box, and it's as pure a take on Google's operating system as you can get. This time around that includes the new Material You UI - a bold, widget-heavy interface that features a smart theming system.",
    "In the other corner, Samsung supplies its own custom One UI currently based on Android 11. It's not everyone's favorite Android skin, but it is fluid and highly customizable.",
    "It's unlikely that Samsung is going to match Google's promise of a minimum of five years of security updates, though.",
    "The Google Pixel 6 packs a 4,614mAh battery, which is a fair bit larger than the Samsung Galaxy S21's 4,000mAh cell.",
    "True, the Pixel 6's display is a little larger. But Samsung's screen runs at a higher refresh rate.",
    "Google is promising an ambitious 48-hour battery life, though that's when using its Extreme Battery Saver mode. In normal usage, we're hoping for comfortable all-day life, even under intensive usage – especially given that Google is now using its own custom processor and boasting about greater efficiency.",
    "In our review we found that the Galaxy S21 could generally last through a full day of usage on a single charge, but that employing GPS and conducting power-intensive tasks could empty that battery before bedtime. If the Pixel 6 doesn't top that, it will be a bit of a let-down.",
    "Google would already appear to have a clear edge when it comes to recharging. The Pixel 6 supports 30W wired charging and 21W wireless charging. The Samsung Galaxy S21, by comparison, supports 25W wired and 15W wireless. You'll have to buy any chargers separately in both cases, however.",
    "The likes of Xiaomi and OnePlus offer 65W (and beyond) chargers in the box, so we're pretty unimpressed with Google and Samsung on this one.",
    "Google is bringing an exciting new contender to one of the most exciting areas of the market with the Pixel 6. It promises to undercut the Samsung Galaxy S21 on price, and would appear to offer broadly competitive specs as well.",
    "Samsung's phone still seems to have the edge in terms of camera versatility and display fluidity, but we'll have to spend some serious time with the Pixel 6 to be sure.",
    "Right now, the Pixel 6's exciting new design and bold Material You UI is enough to make us hopeful, while we're dying to see the benefits Google's Tensor chipset can bring to performance and power efficiency.",
    "Whether it can give Samsung's own smartly configured 'affordable flagship' a bloody nose in the process remains to be seen.",
    "You might also want to check out the Samsung Galaxy S21 vs Samsung Galaxy S20 comparison."
  ],
  "headers": {
    "3": "Google Pixel 6 vs Samsung Galaxy S21 price and availability",
    "7": "Design",
    "13": "Display",
    "19": "Camera",
    "28": "Specs and performance",
    "35": "Battery",
    "41": "Takeaway"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Google Pixel 6 deals": "https://www.techradar.com/deals/best-google-pixel-6-deals-and-google-pixel-6-pro-deals-to-pre-order",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Google Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Samsung Galaxy S21 vs Samsung Galaxy S20": "https://www.techradar.com/news/samsung-galaxy-s21-vs-samsung-galaxy-s20"
  }
}