{
  "source": "https://www.techradar.com/news/beosound-explore-portable-speaker-launches-to-rival-the-sonos-roam",
  "title": "Beosound Explore portable speaker launches to rival the Sonos Roam",
  "category": "audio-visual",
  "updated": "2021-05-20T09:13:31Z",
  "author": "olivia-tambini",
  "summary": "The Bluetooth speaker is designed for the outdoors",
  "article": [
    "Bang & Olufsen has launched its latest portable Bluetooth speaker to rival the Sonos Roam. The Beosound Explore has been built with durability in mind, made from anodized aluminum for improved scratch resistance.",
    "The outdoor speaker also comes with an IP67 dust and water resistance rating, so you can take it camping or to the beach without the fear that a little sand or water will ruin your music.",
    "Its ridged design certainly stands out from other portable speakers on the market, and it comes in black, green, and gray – something Bang & Olufsen says is \"reminiscent of forests, glaciers and fjords typically found in Scandinavian landscapes\".",
    "An aluminum carabiner means you can hook the speaker onto your backpack, as well as an integrated strap, and at 631g / 1.3lbs, it should be lightweight enough to carry around all day. On top of the Beosound Explore is a user interface that the company says can be easily used with gloves in cold conditions.",
    "Bang & Olufsen says that the speaker will last 27 hours while playing music at \"a typical listening volume\", which should easily cover you for a day of tunes.",
    "As for the sound? Inside the Besound Explore are dual 1.8-inch full range drivers that should deliver a powerful sound. According to Bang & Olufsen, special attention has been given to the speaker's bass response, and as a result it can deliver 59dB in the lower frequency range, which should be ideal for outdoor listening.",
    "You're also getting true 360-degree sound, so the speaker should sound great no matter where you're positioned in relation to it.",
    "The Sonos Roam is our pick for the best Bluetooth speaker you can buy in 2021, and naturally, we're interested to see how the Beosound Explore compares.",
    "It seems as though these are two very different speakers; while the Sonos Roam is designed for a seamless transition between indoor and outdoor listening, the Beosound Explore is fully focussed on use in the great outdoors.",
    "Unlike the Roam, the new Bang & Olufsen speaker doesn't come with a voice assistant on board, and it won't integrate into a wider wireless speaker setup – though you can stereo pair two Beosound Explore speakers. All in all, it's a simpler speaker that could suit those who just want to hook up their phone via Bluetooth 5.2, and press play.",
    "In spite of its simpler set up, the Beosound Explore is pricier than the Sonos Roam, coming in at $199 / £169 (around AU$250). It's available to buy now in black and green, with the gray design coming later this year."
  ],
  "headers": {
    "7": "How does it compare to the Sonos Roam?"
  },
  "links": {
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Sonos Roam": "https://www.techradar.com/reviews/sonos-roam",
    "outdoor speaker": "https://www.techradar.com/news/best-waterproof-speaker",
    "portable speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079"
  }
}