{
  "source": "https://www.techradar.com/news/today-is-your-last-chance-to-get-dollar200-credit-on-a-galaxy-z-fold-3-and-flip-3-pre-order",
  "title": "Today is your last chance to get $200 credit on a Galaxy Z Fold 3 and Flip 3 pre-order",
  "category": "phones",
  "updated": "2021-08-26T10:22:34Z",
  "author": "alex-whitelock",
  "summary": "Last chance to score yourself a nice little bonus on the house",
  "article": [
    "Samsung Galaxy Z Fold 3 and Galaxy Z Flip 3 pre-orders officially end today. That means it's your last chance to score up to $200 of store credit for free by pre-ordering either device over at the official Samsung site.",
    "It's $200 for a pre-order on the Fold 3 and $150 for the Flip 3 to be exact - not exactly chump change and a useful thing to have if you're looking to bundle that new device up with any number of accessories. Samsung's own range of products includes excellent smartwatches, wireless earbuds, and tablets. Plus, you could even use the credit to get a discount on a new TV.",
    "Another option is to put some of that credit towards upgrading your phone's storage capacity. A useful perk on the Samsung site will allow you to spend $100 to upgrade a Fold 3 from 256GB to 512GB, and $50 to upgrade a Flip 3 from 128GB to 256GB.",
    "As always on the Samsung site, hefty trade-in rebates are also up for grabs on both unlocked and carrier devices. These aren't unique to the pre-orders stage, but they are highly recommended as the maximum saving is currently a whopping $800 on the Fold 3 and $500 on the Flip 3.",
    "Outside the US? See the best cell phone deals in your region below.",
    "Both the Samsung Galaxy Z Fold 3 and Samsung Galaxy Z Flip 3 are pricey devices indeed but they're easily at the cutting edge of what's possible with a smartphone.",
    "They're both more durable than previous entries, come with an extremely powerful Snapdragon 888 chipset, and feature a ton of excellent software and overall design upgrades to make them far more polished. In short, they're still significant investments, but these devices aren't just being carried by the novelty of featuring foldable screens.",
    "If you'd like to check out what other leading retailers are offering, head on over to our main Samsung Galaxy Z Fold 3 deals and Samsung Galaxy Z Flip 3 deals pages. It's also worth reading our page on the upcoming Labor Day sales."
  ],
  "headers": {
    "5": "Are these devices worth the money?"
  },
  "links": {
    "$200 of store credit for free": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-3159605776240923600&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fsmartphones%2Fgalaxy-z-fold3-5g%2Fbuy%2Fgalaxy-z-fold3-5g-256gb-unlocked-sm-f926uzkaxaa%2F%3FmodelCode%3DSM-F711UZKAXAA&article_name=Today%20is%20your%20last%20chance%20to%20get%20%24200%20credit%20on%20a%20Galaxy%20Z%20Fold%203%20and%20Flip%203%20pre-order&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ftoday-is-your-last-chance-to-get-dollar200-credit-on-a-galaxy-z-fold-3-and-flip-3-pre-order",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Samsung Galaxy Z Fold 3 deals": "https://www.techradar.com/deals/samsung-galaxy-z-fold-3-deals",
    "Samsung Galaxy Z Flip 3 deals": "https://www.techradar.com/deals/samsung-galaxy-z-flip-3-deals",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020"
  }
}