{
  "source": "https://www.techradar.com/news/ios-147-is-ready-for-your-iphone-and-itll-help-you-use-a-new-iphone-12-accessory",
  "title": "iOS 14.7 is ready for your iPhone, and it'll help you use a new iPhone 12 accessory",
  "category": "phones",
  "updated": "2021-07-20T08:37:11Z",
  "author": "james-peckham",
  "summary": "Plus Apple Card is getting some upgrades",
  "article": [
    "Apple's iOS 14.7 is officially here, and the latest upgrade to your iPhone is set to bring a host of smaller changes to your smartphone rather than any big game-changing updates.",
    "If you own an iPhone 12, iPhone 12 mini, iPhone 12 Pro or iPhone 12 Pro Max you'll find the updated software makes your smartphone compatible with the new MagSafe battery pack from the company.",
    "The other bigger upgrade is the ability to combine credit limits within its Apple Card Family service. You can also now share a co-owned account with an existing Apple Card user, which is a small change but important for some people.",
    "Other tweaks from Apple include air quality information for an extended list of countries, including Canada, France and Italy. Plus, a new tweak to the podcasts app allows you to only view your followed shows rather than seeing them all in one place.",
    "Finally, the Home app now has the ability to manage timers on your HomePod. It's baffling that this wasn't already an option before in the Home app on your iPhone, but this update will make using your HomePod's timers easier than ever.",
    "Other changes include some bug fixes around your iPhone, including changes to Apple Music on some devices.",
    "The odd element of the iOS 14.7 update is the lack of an iPadOS 14.7 upgrade landing on Apple's tablet range. Ever since Apple introduced iPadOS, it has kept up with updates arriving at the same time as they do on iPhone.",
    "That doesn't mean there won't be an upcoming upgrade for iPads, but it does suggest there may be a little delay if these features are set to come to Apple's tablet family."
  ],
  "headers": {},
  "links": {
    "iOS 14.7": "https://www.techradar.com/news/ios-147",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "MagSafe battery pack": "https://www.techradar.com/news/apple-magsafe-battery-pack-iphone-12-launch",
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Apple Music": "https://www.techradar.com/reviews/apple-music"
  }
}