{
  "source": "https://www.techradar.com/news/microsoft-sees-the-future-of-work-as-truly-hybrid",
  "title": "Microsoft sees the future of work as truly hybrid",
  "category": "computing",
  "updated": "2021-06-17T17:30:06Z",
  "author": "mike-moore",
  "summary": "Microsoft goes all-in on hybrid working with latest updates",
  "article": [
    "Microsoft has thrown its weight behind the hybrid working revolution, with a senior executive calling it “a once-in-a-generation shift”.",
    "Speaking at a company event, Jared Spataro, Corporate Vice President, Microsoft 365, laid out the company’s view on hybrid working as he unveiled a series of upgrades for some of its most popular tools to support the change.",
    "“Hybrid work isn’t just a new way to work, it’s literally the rewiring of how things get done - and the biggest shift in work in a generation,” he said.",
    "“I believe we have the chance to make it a win-win for everyone if we seize the opportunity, take advantage of new innovations and embrace a growth mindset - that’s how we’ll create a better world of work for everyone.\"",
    "Spataro noted that Microsoft’s customers have mainly been asking three questions when it comes to hybrid working; how to “rewire” their business to embrace flexibility, how to ensure every employee has a seat at the table whether they’re working remotely or in the office, and ultimately ”how to make the future of work the best it can be for everyone\".",
    "“Our team has spent a lot of time thinking about these questions,\" he noted. \"The hybrid workplace will require us all to embrace flexibility in when, where and how people work...as we move into the next chapter of work, asynchronous collaboration will become an increasingly important part of how we work with others.”",
    "Spataro was speaking at the launch of a wide range of Microsoft 365 updates, including fluid components for Teams and Outlook (as well as Whiteboard and OneNote) that allow collaboration either in real-time or asynchronously, including tools such as checklists, task lists, agendas, paragraphs and tables that all stay up to date as everyone contributes their piece.",
    "For Spataro, these new features are perfectly designed to “level the playing field” for all employees - whether they’re working remotely or at the office. He highlighted how before the pandemic, dialling in remotely to a group call often left workers feeling marginalized, but the new updates to Microsoft Teams allow workers to get a better feeling of physical presence in a meeting room.",
    "“Effective hybrid meetings start by designing for people who aren’t in the room,” he said. “When business leaders listen to their employees and what they want, and make thoughtful, conscious decisions about how they move forward and embrace flexibility, then we can pull forward the best of both worlds, in-office and remote.”",
    "Microsoft began welcoming some employees back to its office as early as March 2021, but the company has fully embraced hybrid working, encouraging employees to look after their well-being as well as investing in cloud devices and security systems."
  ],
  "headers": {
    "4": "Hybrid future"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Teams": "https://www.techradar.com/news/microsoft-teams-update-gives-you-absolutely-nowhere-to-hide"
  }
}