{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-looks-to-have-top-tier-specs-unlike-the-original",
  "title": "Samsung Galaxy Z Flip 3 looks to have top-tier specs, unlike the original",
  "category": "phones",
  "updated": "2021-07-15T08:53:08Z",
  "author": "james-rogerson",
  "summary": "No compromises this time",
  "article": [
    "One disappointment with the original Samsung Galaxy Z Flip was that it had a slightly dated chipset, despite carrying a very high price. That was remedied for the Galaxy Z Flip 5G, but we worried that it would be repeated with the Samsung Galaxy Z Flip 3. Now though, we have evidence that this upcoming phone won’t compromise on power.",
    "A handset with the model number SM-F711U has been spotted on Geekbench (a benchmarking platform), and this is believed to be the US version of the Samsung Galaxy Z Flip 3. As with all Geekbench listings, it includes some specs, key among which is the Snapdragon 888 chipset.",
    "That’s the same high-end chipset as you’ll find in US models of the Samsung Galaxy S21 range, among a number of other 2021 flagship phones, so it’s reassuring to see it here. Technically it’s no longer the best Snapdragon chipset – that’s the Snapdragon 888 Plus – but it’s in line with most of this year’s flagships.",
    "Along with that, the benchmark also mentions 8GB of RAM and Android 11, with the phone achieving a single-core score of 1,015 and a multi-core result of 3,161. Those are solid results if not quite the best we’ve seen, but we’re reluctant to read too much into benchmark numbers, especially pre-release ones.",
    "We would of course also take all of this with a pinch of salt, but if the Samsung Galaxy Z Flip 3 really does have a Snapdragon 888 chipset then that’s very good news, especially as the phone is also rumored to actually be cheaper than its predecessor was at launch.",
    "The less than top-tier power in the original Galaxy Z Flip presumably helped keep the price a lot more reasonable than the Samsung Galaxy Z Fold 2’s, so if Samsung can get the price lower still here while offering genuinely flagship specs, then this could end up being the closest thing to a mainstream foldable phone we’ve seen so far.",
    "We should find out for sure whether Samsung’s achieved that on August 11, as that’s when the company is rumored to be unveiling the Galaxy Z Flip 3, likely alongside the Samsung Galaxy Z Fold 3, the Samsung Galaxy S21 FE, and the Samsung Galaxy Watch 4 range.",
    "Via GSMArena"
  ],
  "headers": {
    "4": "Powerful and affordable"
  },
  "links": {
    "Samsung Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Geekbench": "https://browser.geekbench.com/v5/cpu/8820975",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Snapdragon 888 Plus": "https://www.techradar.com/news/snapdragon-888-plus-5g-processor",
    "Android 11": "https://www.techradar.com/news/android-11",
    "cheaper than its predecessor was": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-could-be-surprisingly-affordable",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "rumored to be unveiling": "https://www.techradar.com/news/samsung-may-launch-the-z-fold-3-z-flip-3-galaxy-watch-and-more-on-august-11",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_z_flip3_specs_revealed_on_geekbench-news-50055.php"
  }
}