{
  "source": "https://www.techradar.com/news/afl-finals-2021-where-to-watch-the-qualifiers-live-online",
  "title": "AFL finals 2021: where to watch the semi-finals live online",
  "category": "entertainment",
  "updated": "2021-09-03T07:36:26Z",
  "author": "jasmine-gearie",
  "summary": "The semi-finals get underway this weekend",
  "article": [
    "We’re now heading into the Australian Football League’s semi-finals, with the Geelong Cats set to face the GWS Giants, and the Brisbane Lions coming up against the Western Bulldogs.",
    "After winning their respective games in last weekend’s qualifiers, the Melbourne Demons and Port Adelaide are already through to the preliminary final, and are one step closer to grand final day, with a well earned rest this weekend.",
    "The Giants and the Cats will go head-to-head in Perth on Friday, September 3, after GWS narrowly defeated their cross-city rivals the Sydney Swans by one point last weekend. Geelong has a tough slog ahead, as the team has lost three of its past four games.",
    "GWS looks much stronger, though they’ll be without star forward Toby Greene for the remainder of the season. Greene was handed a three-match suspension after intentionally making contact with the umpire during the Giants game against the Swans.",
    "So while the Cats had a shocker against Port Adelaide last weekend – losing 86-43 – the Giants losing Greene may be just what Geelong needs to make it through.",
    "On Saturday, September 4, the Lions will play the Bulldogs at the Gabba in Queensland. Brisbane will be the only team fortunate enough to play on its home ground this weekend, as the ongoing Covid lockdown for Sydney and Melbourne has forced games to move to Queensland and Western Australia.",
    "That means the Lions will have the luxury of a home ground advantage, and the fact they’ve won their last nine games at the Gabba bodes well. They did lose to Melbourne last weekend though, 93-60.",
    "The Bulldogs had a dominant win over Essendon in last weekend’s qualifiers, and have come out relatively unscathed. The Bulldogs broke their three back-to-back losses in last week’s victory, but defeating the Lions on their home turf will be a tough ask.",
    "Every finals game will be broadcast live on free-to-air and Fox Footy, with all games shown live and on-demand on Kayo as well. If you’re overseas, there are options for you too. Here’s how you can watch it all unfold in the lead up to the grand final.",
    "Arguably the best place to catch all this year’s semi-finals live online is on Kayo. This streaming service is dedicated to sports so there won’t be any distractions, with the exception of a few ad breaks perhaps.",
    "If you are interested in taking up a subscription, the basic tier on Kayo gets you access to over 50 sports streamed simultaneously on two screens for just AU$25 a month.",
    "If you reckon you’ll be watching across more devices, then the premium tier for AU$35p/m allows for three simultaneous streams. There’s no lock-in contract, so you’re free to cancel anytime. Kayo also comes with a free 14-day trial, so you can try out the service for yourself at no cost.",
    "The Seven Network has broadcast rights to all the qualifier games during the Finals Series. They’ll be available to watch live and free on Channel 7 or 7Mate, depending on which state you’re in.",
    "That means you’ll also be able to stream the games on the Channel 7’s catch-up app, 7Plus. This platform is available on a web browser, and has apps for both Android and iOS.",
    "If you’re a footy fan who happens to be living outside of Australia, New Zealand or the Pacific Islands, don’t worry. You can watch every single AFL game this season no matter where you are on the Watch AFL streaming service.",
    "Like Kayo, Watch AFL is also a subscription service and has three different plans to choose from:",
    "Weekly: US$17 / £13 / €17 / AU$25 Monthly: US$33 / £25 / €33 / AU$39 Annual: US$165 / £130 / €155 / AU$199",
    "For the Finals Series, Watch AFL has a new option called the Finals Pass, which temporarily replaces the monthly plan. It gives customers the ability to watch all the matches during the Finals Series as well as the grand final live.",
    "If you’re outside Australia and still want to tune into the matches, you’ll quickly find that online access is geo-blocked. In order to get around that – and assuming it complies with the Ts & Cs of the broadcaster in question – you can download and use a VPN.",
    "How to use a VPN:",
    "1. Download and install a VPN: as we say, our top choice is ExpressVPN",
    "2. Connect to the appropriate server location: open the VPN app, hit 'choose location' and select the appropriate location",
    "3. Go to the broadcaster's live stream: so if you’re an Aussie abroad, just head to Kayo and stream like you were back at home"
  ],
  "headers": {
    "9": "How to live stream AFL Finals Series 2021 in Australia",
    "12": "How to live stream AFL Finals Series 2021 for free",
    "14": "How to live stream AFL Finals Series 2021 from anywhere"
  },
  "links": {
    "Kayo": "https://goto.kayosports.com.au/c/338476/515039/8808?subId1=trd-us-1118158632560518800&sharedId=trd-us&u=https%3A%2F%2Fkayosports.com.au%2F",
    "a free 14-day trial": "https://goto.kayosports.com.au/c/338476/515039/8808?subId1=trd-us-4889673249319802000&sharedId=trd-us&u=https%3A%2F%2Fkayosports.com.au%2F",
    "Watch AFL streaming service": "https://www.watchafl.com.au/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn"
  }
}