{
  "source": "https://www.techradar.com/news/secretlab-is-releasing-an-rgb-desk-to-complete-your-gaming-setup",
  "title": "Secretlab is releasing an RGB desk to complete your gaming setup",
  "category": "gaming",
  "updated": "2021-04-28T11:51:39Z",
  "author": "jess-weatherbed",
  "summary": "Expanding into the furniture market",
  "article": [
    "You may know Secretlab from its line-up of luxury gaming chairs, frequently seen in the videos of popular Twitch and YouTube stars and used by famous Esports teams. Clearly not just satisfied with chairs, the Singapore-based company is expanding into other areas of gaming furniture with its latest release, the Magnus desk. Constructed from solid metal, the Magnus measures 59 inches (150cm) across, but there are also plans to release a smaller 47-inch (120cm) version down the line. Not only does the metal construction presumably result in a sturdy build, but magnetic accessories can be used to tidy cables and keep your workstation tidy without permanently sticking anything to the tabletop.",
    "You may have also noticed from the images but the Magnus also has the option to include a magnetic RGB strip of lighting that connects to the rear of the desk, as well as a desk mat to cover the surface of the tabletop. Dubbed the Magpad Desk Mat, this also fixes magnetically to prevent any distracting shifting, coming in a 'signature stealth' design or emblazoned with the logo of popular Esports teams Team Liquid or Cloud9. Secretlab described the Magnus as having a modular ecosystem of magnetic accessories, with items like a headphone stand seen in promotional images, though, we don't yet have any prices for the mentioned products or even the desk itself. This does look to be a great addition to the Secretlab family, so if you're interested in grabbing on for yourself you can register your interest here to kit out your gaming space."
  ],
  "headers": {},
  "links": {
    "luxury gaming chairs": "https://www.techradar.com/reviews/secretlab-titan-gaming-chair",
    "register your interest here": "https://secretlab.co.uk/pages/magnus-metal-desk"
  }
}