{
  "source": "https://www.techradar.com/news/new-nintendo-switch-controller-looks-set-for-reveal-in-tonights-direct",
  "title": "New Nintendo Switch controller looks set for reveal in tonight's Direct",
  "category": "gaming",
  "updated": "2021-09-23T08:59:33Z",
  "author": "hamish-hector",
  "summary": "A new controller is likely being revealed tonight",
  "article": [
    "The FCC filing for a mysterious new Nintendo controller has been updated, making it almost certain we’ll hear details about it at tonight’s Nintendo Direct (September 23).",
    "We reported on the filing last week, but were short of details given that Nintendo had requested for the FCC to keep them private until around March 2022 – or until Nintendo officially announces the device themselves. Now, that the privacy agreement has been amended to end tomorrow, Friday September 24.",
    "With the Nintendo Direct taking place later today it looks almost certain that we’ll see the new controller shown off tonight, and if it really is a N64 controller – for playing N64 games on Nintendo Switch Online – this looks like a Direct you’ll want to tune in to.",
    "Obviously, we’d love to see N64 games finally launch on the Nintendo Switch, and who wouldn’t want to play them on a newly announced N64-style controller? However, this feels all but confirmed now thanks to the recent news, so what are some of our other predictions?",
    "There’s a strong chance we’ll hear new details about already announced games like Super Mario Party Superstars, Pokémon Brilliant Diamond and Shining Pearl, and perhaps Splatoon 3. Less likely would be Breath of the Wild 2, though with 40 minutes of time to fill – much longer than a typical Nintendo Direct – Nintendo could be pulling out all the stops to wow us with the event.",
    "Much less likely than anything above is new Mario Kart content. DLC for Mario Kart 8 Deluxe seems almost impossible at this point (even if it would be amazing) but a new Mario Kart 9 announcement could be on the way. Mario Kart is one of the main Nintendo Franchises to not yet have a dedicated Switch version – just a port of a Wii U game – so it may be time to get those engines ready for a new instalment.",
    "The Nintendo Direct takes place at 3 PM PT / 6 PM ET / 11 PM BST and you can watch via Nintendo’s YouTube Channel."
  ],
  "headers": {
    "3": "What do we expect to see from the Nintendo Direct?"
  },
  "links": {
    "mysterious new Nintendo controller": "https://www.techradar.com/news/nintendos-latest-switch-controller-could-tease-the-return-of-these-classic-games",
    "Nintendo Direct": "https://www.techradar.com/news/a-surprise-nintendo-direct-drops-tomorrow-but-will-we-see-breath-of-the-wild-2",
    "Pokémon Brilliant Diamond and Shining Pearl": "https://www.techradar.com/news/pokemon-diamond-and-pearl-remakes",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "DLC for Mario Kart 8 Deluxe": "https://www.techradar.com/news/new-mario-kart-8-deluxe-dlc-is-a-golden-opportunity-for-nintendo-so-where-is-it",
    "Nintendo’s YouTube Channel": "https://www.youtube.com/c/nintendo"
  }
}