{
  "source": "https://www.techradar.com/news/microsoft-teams-reveals-it-will-automatically-delete-your-old-calls-if-you-let-it",
  "title": "Microsoft Teams reveals it will automatically delete your old calls - if you let it",
  "category": "computing",
  "updated": "2021-07-30T15:07:40Z",
  "author": "mike-moore",
  "summary": "Microsoft Teams clarifies exactly what will happen to your old call recordings",
  "article": [
    "Users looking to access recordings of past Microsoft Teams calls will need to make sure they don't wait too long to do so, the company has warned.",
    "Microsoft recently revealed that the video conferencing service would automatically delete recordings of calls after a set period of time if users took no action with their files, such as downloading or listening back.",
    "The company has now confirmed that this period of time will be set at 60 days, so users will need to interact with the recordings they need within a matter of weeks, or face losing the files for good.",
    "Microsoft says the 60-day limit was chosen after the company found this was the average time past which most meeting recordings are never watched again.",
    "Users and admins can still change the default expiration date, although the setting will not immediately be accessible.",
    "Microsoft Teams revealed plans to begin recording all calls automatically back in June 2021, replacing an earlier process where users had to opt-in to call recording.",
    "The feature is particularly useful for organizations that need to capture meeting interactions in order to comply with industry regulations or local laws.",
    "Meeting participants see a warning displayed at the start of a call to alert them that the meeting is being recorded, with the recording available to download and listen back to after the call has ended.",
    "The company also recently revealed an update that would allow Teams admins to set meeting recordings stored on OneDrive and SharePoint to expire automatically.",
    "Set to roll out in September, the feature will allow the creation of a default Teams policy setting on automatic deletion, although admins will be able to modify the default meeting recording expiration time through a setting in the Teams Admin Portal or by modifying policy attributes using Powershell scripts.",
    "The feature will bring Microsoft Teams up to speed with rivals services such as Zoom, which have offered call recording (and call deletion) for some time.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Microsoft Teams call deletion"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "recording all calls automatically": "https://www.techradar.com/news/microsoft-teams-update-will-mean-theres-always-a-backup-plan",
    "to expire automatically": "https://www.techradar.com/news/microsoft-teams-update-will-stop-you-overloading-your-cloud-storage",
    "MSPowerUser": "https://mspoweruser.com/you-will-soon-be-able-to-automatically-delete-meeting-recordings-in-microsoft-teams-2/"
  }
}