{
  "source": "https://www.techradar.com/news/its-been-another-huge-year-of-growth-for-aws",
  "title": "It's been another huge year of growth for AWS",
  "category": "computing",
  "updated": "2021-04-30T11:44:12Z",
  "author": "mayank-sharma",
  "summary": "AWS continues to be a lucrative source of income",
  "article": [
    "Amazon Web Services (AWS) clocked a 32% year-on-year growth in Q1 2021 helping parent company Amazon record a 44% increase in quarterly revenue.",
    "Amazon is the latest tech giant that has managed to beat earning estimates for the first quarter of 2021 due to a boost in its cloud computing business.",
    "Thanks to record Azure sales, Microsoft clocked in over $40 billion in sales for the second straight quarter. Similarly, Internet giant Google also recorded a boost in its quarterly revenues thanks to the pandemic-induced move to the cloud.",
    "The growth of AWS beat industry estimates and outpaced the 28% growth recorded in the previous quarter.",
    "“We have firm confidence that we offer a lot of advantages to AWS customers, from functionality to a vibrant and robust partner ecosystem,” said Brian Olsavsky, Amazon’s finance chief, on a conference call with analysts.",
    "One of the earliest cloud computing players, the AWS division is one of Amazon’s most successful subsidiaries and is considered by analysts to be Amazon’s most reliable source of income.",
    "The company has recently revealed how it has worked closely with Walt Disney, since a year before the launch of its Disney+ video streaming service, which banks on its cloud infrastructure to serve millions of customers across the world.",
    "The AWS unit delivered $13.50 billion in Q1 2021 revenue, which makes up for 12% of Amazon’s total quarterly revenue.",
    "This year will see the head of AWS, Andy Jassy, replace Jeff Bezos as Amazon’s CEO, while former AWS executive Adam Selipsky would come back to the e-commerce giant to run AWS.",
    "Via CNBC"
  ],
  "headers": {
    "4": "Cloud-powered"
  },
  "links": {
    "Amazon Web Services (AWS)": "https://www.techradar.com/news/aws",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "clocked in over $40 billion": "https://www.techradar.com/news/azure-success-once-again-pushes-microsoft-results-to-new-highs",
    "Google also recorded": "https://www.techradar.com/news/google-cloud-sees-huge-surge-in-business-despite-overall-loss",
    "recently revealed": "https://www.techradar.com/news/aws-is-helping-make-disney-even-bigger",
    "Disney+": "https://www.techradar.com/reviews/disney-plus-review",
    "streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "replace Jeff Bezos": "https://www.techradar.com/news/amazon-ceo-jeff-bezos-to-step-down-after-26-years-heres-whats-next",
    "Adam Selipsky would come back": "https://www.techradar.com/news/aws-reveals-adam-selipsky-as-new-ceo",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "CNBC": "https://www.cnbc.com/2021/04/29/aws-earnings-q1-2021.html"
  }
}