{
  "source": "https://www.techradar.com/news/yamahas-latest-wireless-headphones-could-be-apple-airpods-max-rivals",
  "title": "Yamaha's latest wireless headphones could be Apple AirPods Max rivals",
  "category": "audio-visual",
  "updated": "2021-07-15T09:48:55Z",
  "author": "olivia-tambini",
  "summary": "They come with 3D audio support",
  "article": [
    "Yamaha has announced its latest wireless headphones – and with a focus on immersive spatial audio and head-tracking, they could be an alternative to the Apple AirPods Max.",
    "The YH-L700A come with Yamaha's 3D Sound Field with head tracking technology, which the company says will transform stereo audio from \"virtually any source\" into a 360-degree sound field.",
    "You'll be able to customize this effect by choosing from a series of sound modes, including Cinema, Drama and Music Video, and Outdoor Live and Concert Hall.",
    "Unlike the AirPods Max, the technology works with both iOS and Android devices, as the audio processing takes place inside the headphones.",
    "The 3D sound is made even more immersive thanks to the headphones' head tracking capabilities, which means the playback will automatically adjust based on the position of your head.",
    "According to Yamaha, this will make listeners feel \"as if they are actually there – such as the best seat in a movie theater or the front row of a live concert\".",
    "Aside from 3D audio, the Yamaha YH-L700A come with a host of cool features, including Listening Optimiser, which analyses the fit of the headphones and adjusts the sound accordingly, and Listening Care, which is designed to protect your hearing health by allowing for a full range of frequencies to be heard at low volumes.",
    "They also come with active noise cancellation and an Ambient Sound mode, for when you want to be able to tune into your surroundings.",
    "So, how will they sound? Well, Yamaha says that the headphones' 40mm dynamic drivers offer a \"natural sound and clear definition\", while Bluetooth 5 and aptX Adaptive should provide high quality streams. And, if you're using the headphones with a wired connection, you'll get hi-res audio with a frequency range of 8Hz to 40kHz.",
    "While they're not a complete carbon copy of the AirPods Max, there are some echoes of Apple's over-ear headphones in the design of the Yamaha YH-L700A, which feature swiveling square(ish) earcups and an adjustable headband, covered in a soft fabric that looks pretty comfortable.",
    "You get a hard carrying case, USB-C cable, audio cable, and flight adapter in the box and with a 34-hour battery life, the YH-L700A could be ideal for use during long haul flights.",
    "If you were hoping that the Yamaha YH-L700A would be cheaper than the AirPods Max, you won't be disappointed. They'll be available from August for £449 / AU$699 (about $620), while Apple's noise-cancelling headphones cost $549 / £549 / AU$899 – still, that's pretty expensive for a pair of over-ear headphones, and they'll have to sound fantastic to really justify that price."
  ],
  "headers": {
    "6": "Optimized sound"
  },
  "links": {
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Apple AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490"
  }
}