{
  "source": "https://www.techradar.com/news/this-hellblade-ray-tracing-comparison-video-shows-why-i-always-turn-rt-off",
  "title": "This Hellblade ray tracing comparison video shows why I always turn RT off",
  "category": "gaming",
  "updated": "2021-08-10T09:14:47Z",
  "author": "adam-vjestica",
  "summary": "Can you really spot the difference?",
  "article": [
    "Ninja Theory’s Hellblade: Senua’s Sacrifice received a surprise update for Xbox Series X and Xbox Series S on August 9, which introduced a number of next-gen optimizations for the game such as ray tracing, a higher resolution target and a 120fps mode. However, it looks like Hellblade will be yet another game where I simply turn ray tracing off.",
    "You see, for as exciting as ray tracing is for developers and gaming as a whole, it’s an extremely taxing and resource-intensive feature to implement. It’s taken a number of years along with more powerful graphics cards for ray tracing to become viable on PC, and while we’ve seen some superb uses of the tech on PS5, such as in the excellent Ratchet and Clank: Rift Apart, it usually requires a massive trade-off in framerate to achieve.",
    "In the video below, YouTube user Cycu1 shows the difference between ray tracing on and ray tracing off in Hellblade: Senua’s Sacrifice. And honestly, despite having an understanding of the benefits of the technology and why it’s important, I’m hard-pressed to tell the difference.",
    "Yes, the reflections across the water look slightly more convincing, but if it wasn’t for this side-by-side comparison I wouldn’t have noticed. Even then, it’s not something I’d be focusing on for more than a few seconds at a time.",
    "What is noticeable, though, is how you’ll need to sacrifice half the framerate to have ray tracing enabled. With ray tracing off, Hellblade’s new update runs at a silky-smooth 60fps; turn on ray tracing, however, and the framerate plummets to 30fps.",
    "After pining for more 60fps titles on consoles for the past few generations, there’s no way I can stomach going back to the sludgy, unresponsive feeling of 30fps unless I have absolutely no choice – especially as PCs have been capable of hitting 60fps for over a decade now. One of the best aspects of the PS5 and Xbox Series X is that the majority of games either target 60fps outright, or offer excellent performance modes. Something which I really don’t want to change.",
    "Of course, it would be nice to have the extra bit of subtle eye candy that ray tracing can provide and hit 60fps. RT performance modes in Spider-Man: Miles Morales and Ratchet and Clank: Rift Apart do a great job in achieving this, and some titles like Metro Exodus hit 60fps and offer ray tracing to boot.",
    "But right now, ray tracing feels like it’s a step too far for consoles, at least if you value performance. It’s a graphical feature that can have superb results, granted, but developers have become so skilled at creating convincing lighting and reflections in their games that ray tracing doesn’t always have the dramatic impact some might expect.",
    "Credit to developer Ninja Theory, though. The Xbox Series X and Xbox Series S optimizations for Hellblade are completely free to those who own the game, and it’s also available to download from Xbox Game Pass if you’re a subscriber. This isn’t the approach we’ve seen from Sony, unfortunately, who have opted to charge a premium for next-gen upgrades in the form of “Director’s Cut” versions of its games like Ghost of Tsushima and Death Stranding.",
    "Whether you play with ray tracing on or off, then, there’s never been a better time to play Hellblade: Senua’s Sacrifice, and players thankfully have the option to prioritize performance or graphics. I know which one I’ll be going for."
  ],
  "headers": {
    "4": "Dirty thirties",
    "8": "Another freebie"
  },
  "links": {
    "Hellblade: Senua’s Sacrifice": "https://www.techradar.com/news/hellblade-senuas-sacrifice-just-got-a-big-upgrade-for-xbox-series-xors",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "120fps mode": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Metro Exodus": "https://www.techradar.com/news/metro-exodus-enhanced-edition-sounds-great-if-you-have-an-expensive-nvidia-gpu",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Ghost of Tsushima": "https://www.techradar.com/news/ghost-of-tsushima-directors-cut-locks-ps5-features-behind-a-paywall-and-thats-dishonorable",
    "Death Stranding": "https://www.techradar.com/news/death-stranding-directors-cut-confirmed-for-ps5"
  }
}