{
  "source": "https://www.techradar.com/news/playing-diablo-2-resurrected-makes-me-want-diablo-4-more-than-ever",
  "title": "Playing Diablo 2: Resurrected makes me want Diablo 4 more than ever",
  "category": "gaming",
  "updated": "2021-04-09T10:45:53Z",
  "author": "gerald-lynch",
  "summary": "Diablo 2 remaster is a tantalizing tease for the truly new Diablo 4",
  "article": [
    "Click. Kill. Loot. Repeat. It’s good to be back, adventuring among the demon-filled fields of Old Tristram in Diablo 2: Resurrected. But revisiting these familiar blood-soaked caverns and crumbling ruins made me long for what’s coming next with Diablo 4, more than anything else.",
    "The classic action-RPG (ARPG), which first released way back in 2000, is back this weekend in its remastered form as developer Blizzard puts the game through its paces in a “technical alpha” stress-test for a select number of players. Those able to access the test will be able to play through two acts of the campaign (in single-player only), and have access to three of the final seven character classes – the Barbarian, Amazon and the Sorceress.",
    "It’s a generous chunk of game to show off, considering there’s still no release date for the re-release beyond a rough “2021” window. I've been slashing my way through its fantasy killing fields and, while it's as addictive as it ever was under its new lick of paint, it has made the wait for Diablo 4 all the more unbearable.",
    "For the uninitiated, Diablo 2 was / is the daddy of ARPG titles. You take a lowly hero, click-to-kill thousands of demonic baddies, loot them of their gear to amass a better arsenal of weapons and armor, and upgrade your characters' skills, moves and stats to allow you to take on even more ghastly beasts. It has become the basis for many competitors (Torchlight, Path of Exile) and inspired a whole genre in itself, spawning looter-shooters like Borderlands, Destiny and Outriders.",
    "Diablo 2 is still incredibly addictive – so much so that the game has retained a hardcore player base for the past two decades. And everything that made Diablo 2 so special remains intact for Resurrected – this is an incredibly faithful remaster, playing almost identically to the original with just a few small modernization tweaks.",
    "These include auto-collecting gold (which can be toggled on and off), and a well-considered gamepad control option – partly inspired by the sequel, Diablo 3, and actually my preferred way to play Resurrected, as it allows easier access to your range of skills, individually mapped to face buttons. Otherwise, everything from the 8-way character direction movement to the harsher-than-you-remembered inventory management remains the same as it did many moons ago.",
    "So what has changed? There’s 7.1 remastered audio, a shared item stash for your characters, cross progression with the eventual console releases, a new modding system, the benefits of modern Battle.net integration and some features not quite ready for this alpha release – including all-new cutscenes and accessibility features including a colorblind option.",
    "But the biggie, as you might have expected, is a completely overhauled 4K facelift for the game’s graphics. With the push of the ‘G’ button, you’ll swap from the low-res pixel graphics of the original release, to a brand new 3D rendering of Diablo 2, complete with dynamic lighting effects and detailed character models.",
    "It’s really nicely done. We’ve seen similar instant-remake-visual transitions happen before (the Halo remasters being the perfect example), and being able to swap to and fro on the fly shows you how far we’ve come in the 20 years since the original release. You’ll now see believable shadows cast by light sources, shiny and reflective puddles, and really nasty-looking monster skins, from the blood red Fallen to the furry shag of the Gargantuan Beasts. It’s all in keeping with the original vision of the game – dark, gothic and moody.",
    "It’s perhaps a bit more realistic, which could be jarring for veteran players. Like a good book brought to life on the screen, the space for imagination between those crude pixels of the original game might not quite match up with the fully-realized characters of Resurrected.",
    "I’ve played a nice chunk of the first act of Diablo 2: Resurrected, and it’s been a blast so far. Despite being a technical alpha, it’s stable to play, with no major bugs, and all the elements that are available to try right now work just fine. It’s like climbing into a comfy bed that’s just had fresh sheets put on it – it’ll be hard to go back to the legacy version of Diablo 2 after this, preserving everything that was great about the original, while touching up some pain points that have endured over the years.",
    "And yet, more than anything, playing Diablo 2: Resurrected has made me all the more desperate to get my hands on Diablo 4. I know it has its detractors, but I’m a big fan of Diablo 3, and have spent my time with that successive game more than Diablo 2 in recent years. I was surprised how many little features I’d grown to take for granted from Diablo 3 that were missing from Diablo 2: ‘Massacre’ killstreak multipliers, quick-view loot stats, destructible environments, action-oriented dodges on the console versions, a full range of motion beyond the 8-way directions – and that’s just off the top of my head. It had a difficult launch, but Diablo 3 over the years has grown into a stonking dungeon crawler.",
    "So my longing for something brand new is now greater than ever – something that takes the learnings of Diablo 3, and wraps that in the gothic, gory atmosphere that made Diablo 2 so imitable and inviting. And, from what we’ve heard about and seen so far from Diablo 4, that’s exactly what it will be, bringing open-world mechanics, slick visuals and always-online drop-in-and-out multiplayer on top of all the modern advancements the series has built up over Diablo 3's lifespan.",
    "Diablo 2: Resurrected shows just how rich the heritage of this series is, and feels like it's well worth investing in for fans craving a fresh(ish) Diablo hit. Now we just can’t wait to see what comes next."
  ],
  "headers": {
    "3": "Diablo 2 remaster is a return to a classic",
    "6": "What’s new in Diablo 2: Resurrected?",
    "11": "A glimpse of the past, and a hope for the future"
  },
  "links": {
    "Diablo 2: Resurrected": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "technical alpha": "https://www.techradar.com/news/diablo-2-resurrected-technical-alpha-kicks-off-this-weekend-heres-how-to-apply"
  }
}