{
  "source": "https://www.techradar.com/news/sports-watch-brands-your-complete-guide-to-garmin-polar-suunto-and-coros",
  "title": "Sports watch brands: your complete guide to Garmin, Polar, Suunto and Coros",
  "category": "fitness",
  "updated": "2021-08-16T14:14:25Z",
  "author": "michael-sawh",
  "summary": "Overwhelmed by options? We're here to help",
  "article": [
    "While smartwatches now do a much better job of tracking runs, swims and big Sunday cycling sessions, a sports watch still feels like the most reliable companion to strap on to keep tabs on that time when you’re getting that heart pumping.",
    "Like smartwatches though, there are a lot of sports watches out there – and good ones too. Most cover the bases of letting you track runs with GPS, measure effort levels with heart rate monitors and will let you share data with third party apps.",
    "Garmin, Polar, Suunto and now Coros make really formidable options across price ranges. So you can spend big or spend less and get something to track those Parkruns or make sure you can find your way home when you head out for a big hike.",
    "If you’re overwhelmed by the options to pick from, we take you through what to expect from the big sports watch names and what you get from going Polar over Garmin or even trying something new from Coros.",
    "Garmin is perhaps the best known of all the sports watch brands simply because it has comfortably the biggest collection of watches available. GPS and tracking your location was Garmin’s big play when it got into the electronics game and its watches definitely aim to offer a more balanced mix of sports tracking and smartwatch features compared to its rivals.",
    "Forerunner is arguably its most well known range and there’s both affordable and pricey, feature-packed options to choose from. At the cheaper end you’ve got the likes of the Forerunner 55, which is a small, light watch with those key tracking features like GPS, heart rate monitoring and software features like Garmin Coach to help you train for running distances like 5k and 10k distances.",
    "Spend a little more and you have the Forerunner 245, which is the successor to the 235, one of Garmin’s most popular watches. That gives you all you get on the 55, but with the addition of smartwatch features like Garmin Pay, a built-in music player and more advanced training insights.",
    "In the middle of the Garmin range you have watches like its Vivoactive and the Venu series, which feel like its most smartwatch-like devices and both ranges share a lot of the same features. The Venu, square Venu Sq and Venu 2 are the only watches in Garmin’s range that offer full colour touchscreen displays.",
    "When you’re thinking more about how you train, when you train and training for longer, then you’ll be wanting to look at the likes of the Forerunner 745 and the 945. These offer Garmin’s more insightful analysis like training load and training balance and start to veer into serious athlete territory. With the 945, you’re also getting full mapping support where cheaper Forerunner watches will offer more simpler breadcrumb navigation support where you can’t view full maps but you can upload routes to follow in a more simpler fashion.",
    "When you want to spend big and want something built for endurance-style pursuits or outdoor activities like trail running, hiking and open water swimming, then there’s the Fenix series and the new Enduro. The Fenix essentially takes what you get in the Forerunner 945 and wraps it up in more high grade case materials. It also comes in a solar charging option if you like the idea of having a watch that can go longer.",
    "If you want a watch that can go far, then the Enduro is the one you want. It’s capable of going for more than a month in smartwatch mode and 70-80 hours of full GPS battery life. It largely matches the Fenix feature set minus the music player and full topographical maps you will get on the Pro version of the Fenix 6 series.",
    "The Finnish brand’s heritage lies in heart rate monitoring and was the first company to launch a wireless heart rate monitor. It continues to evolve that technology inside of its sports watches and it also goes big on providing big training and analysis features driven by heart rate and other metrics for those who like to take a more professional approach to training.",
    "That’s not to say it doesn’t offer a more accessible option like the Polar Ignite and Ignite 2, which are designed for general fitness types, and offer features like GPS and Polar’s Precision Prime heart rate sensor technology to track effort levels during exercise. You also get access to Polar’s FitSpark suggested workouts feature, and sleep tracking, which includes its nightly recharge measurements to assess whether you’re fit to train.",
    "Up from the Ignite series you have the Vantage M2, which bolsters the training and analysis features you have at your disposal over the Ignite. That includes Training Load Pro letting you pay closer attention to how hard you’re working during workouts.",
    "Then you get to the Vantage V2 and the Grit X, which sit at the top of the Polar watch family. The Vantage V2 is designed for serious athletes, think dedicated marathon runners, ultrarunners and triathletes. It offers access to features like Training Load Pro and Training Recovery Pro to delve deeper into your workout data to help better shape training plans and when to take rest days.",
    "It also includes tests to better assess how well recovered your leg muscles are from training. It offers 40 hours of full GPS battery life and the smartwatch features you’ll find on the Vantage M2 like music controls, weather forecasts and notifications.",
    "The Grit X is Polar’s first outdoor watch that has all of the features found in the Vantage V2 and puts it inside of a more rugged design. It offers features like the ability to upload routes to enjoy turn-by-turn navigation and its FuelWise recommendations, which smartly reminds you to eat during endurance-style activities based on heart rate and data like age, weight and gender.",
    "Like Polar, Suunto is based out of Finland, and while it’s a big maker of dive watches, it has a sizable collection of multisports watches in its collection too.",
    "Its watches are clearly designed with outdoor adventurers in mind and built with rugged, durable designs, offer rich environmental data and generally promise big battery life too. They’re a little light on smartwatch features, though the recent arrival of the Suunto 7 has signalled a shift in offering something that’s a stronger mix of sports watch and smartwatch.",
    "Sitting at the cheapest end of its collection is the Suunto 3, which is clearly a Suunto aimed at beginners that offers core sports tracking modes and includes built-in GPS, an optical heart rate monitor and 24/7 fitness tracking and sleep tracking. It also offers adaptive training plans that are generated from your fitness level and logged workouts and will adjust plans if you miss a session.",
    "At the top end of the Suunto family is the Suunto 9 Peak, which takes the Suunto 9 and gives it a slimmer and lighter design. The 9 gives you everything Suunto has to offer. That includes up to 170 hours of GPS battery life with intelligent battery modes for those who want to track for days plus the ability to monitor blood oxygen to assess acclimation to altitude. That makes it a good fit for climbers.",
    "You’re also getting 80 sports modes, and you can upload routes via GPS files to access navigation features like real-time breadcrumb trails.",
    "Sitting somewhere in between those two watches is the Suunto 7, the company’s first proper smartwatch. It runs on Google’s Wear OS, though it’s not clear yet if it will be upgradeable to the next version of the operating system, which Google is building with Samsung.",
    "Right now, it gives you all of those Wear staples like making payments, downloading apps and accessing Google Assistant. You’re also getting some of Suunto’s own sports tracking, including the ability to access full colour maps that can be stored for offline use and use heatmaps to find popular running or riding routes. Unlike other Suunto models, you’ll have to contend with having around a day of battery life when using it in full smartwatch mode.",
    "Coros is new to the sports watch space and has designed all of its watches to be primarily designed for triathletes with some models likely to appeal more to runners or to those who like hitting the trails, hiking or climbing.",
    "Unlike Garmin, it offers less on the smartwatch front, instead prioritizing offering strong sports tracking features, big battery life with GPS and in standby mode, connecting with third party apps like Strava and giving you plenty of stats and analysis to dig into after you’re done working out. It does try to offer largely the same software features across all of its watches too.",
    "The Coros Pace 2 is the most affordable option in the small Coros watch family, but it still packs a punch for the price. It’s the smallest and lightest option and offers core tracking modes for runs, cycling (indoor and outdoor) and swims (pool and open water). It also offers modes for activities like paddleboarding and indoor rowing. Coros also offers strength training and rep counting like Garmin gives you advanced running metrics and its Evolab training insights.",
    "It won’t give you the ability to follow routes on the watch, so you’ll need to step up to the Coros Apex and Apex Pro to get those features along with giving you bigger battery life than the Pace 2."
  ],
  "headers": {
    "4": "Garmin",
    "11": "Polar",
    "17": "Suunto",
    "24": "Coros"
  },
  "links": {
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "heart rate monitor": "https://www.techradar.com/best/best-heart-rate-monitor",
    "Polar Ignite": "https://www.techradar.com/reviews/polar-ignite",
    "Ignite 2": "https://www.techradar.com/reviews/polar-ignite-2",
    "Vantage M2": "https://www.techradar.com/news/new-polar-ignite-2-and-vantage-m2-smartwatches-blend-fashion-and-fitness",
    "Vantage V2": "https://www.techradar.com/reviews/polar-vantage-v2",
    "Suunto 7": "https://www.techradar.com/reviews/suunto-7",
    "Suunto 9 Peak": "https://www.techradar.com/news/suuntos-latest-sports-watch-is-super-thin-super-tough-and-super-expensive",
    "Suunto 9": "https://www.techradar.com/reviews/suunto-9",
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "Coros Pace 2": "https://www.techradar.com/reviews/coros-pace-2",
    "Coros Apex": "https://www.techradar.com/reviews/coros-apex"
  }
}