{
  "source": "https://www.techradar.com/news/sony-tvs-are-finally-catching-up-with-the-ps5",
  "title": "Sony TVs are finally catching up with the PS5",
  "category": "televisions",
  "updated": "2021-12-06T00:52:35Z",
  "author": "henry-st-leger",
  "summary": "Finally, some ports!",
  "article": [
    "It’s been a momentous year for Sony, what with that PS5 console everybody’s talking about being released. But, when it comes to Sony TVs, it’s been something of a different story – and it’s surprising that the company behind the PS5 hasn’t been focused on compatibility across its different product arms.",
    "What do I mean by that? In 2020, new Sony TVs trailed behind the efforts of Samsung and LG to cater to the capabilities and requirements of next-gen consoles like the PS5 and Xbox Series X – specifically support for HDMI 2.1, the cable standard that allows for 4K video passthrough at a mighty 120Hz refresh rate, or even 8K resolution video at 60Hz.",
    "Last year’s high-end Samsung TVs packed in at least one HDMI 2.1 port, for one, while LG’s OLED range offered a royal flush with four HDMI 2.1 ports on every set.",
    "Not so with Sony.",
    "Out of Sony’s multiple new 4K and 8K TVs that launched in 2020, only one shipped with a working HDMI 2.1 port – and that’s the Z8H/ZH8 8K TV. It still didn’t launch with all the specifications of HDMI 2.1, though, only getting full support for 4K/120fps and 8K/60fps late in the year, alongside HDMI eARC (enhance audio return channel, for lossless audio to a soundbar).",
    "One 4K TV, the Sony X900H/XH90, did get an over-the-air update to add 4K/120fps and eARC – without 8K passthrough, for obvious reasons – but both sets still lack either VRR (variable refresh rate, for a smooth picture) or ALLM (auto low latency mode, to reduce lag). And this piecemeal approach to next-gen cabling stands can be confusing, if not outright contradictory.",
    "Why does a mid-price XH90 LCD TV offer HDMI 2.1, while the more expensive XH95 doesn’t? Even Sony’s premium OLEDs, like the A8H/AH8 or the 48-inch A9S/A9, launched without a single HDMI 2.1 port, and the absence is notable in a market where that standard is increasingly becoming, well, standardised.",
    "It’s hard to understate the potential impact to resolution and refresh rate over cable transfer that HDMI 2.1 offers. While there aren’t many opportunities to plug-and-play 8K content – you’ll only get 4K Blu rays right now, and no 8K games to speak of – the boost to 4K is much more notable.",
    "Getting 4K resolution video at 120Hz is a real boon for sport, films, and games alike, with four times the number of pixels over Full HD and twice the frame rate compared to 60Hz. Who doesn’t want more detail and more smoothly-moving images?",
    "Anyone buying a PS5 (well done, if you’ve managed to!) is futureproofing for the games of tomorrow: not just games that have yet to release, but the ability of any games to max out the capabilities of such a high-spec gaming machine. 4K games are already here, as are 120Hz games, but not always together – and we’re going to see a gradual shift towards this standard as time goes on.",
    "If you don’t have a TV that can display these advances, though, there’s not much benefit to having the console – other than to access exclusive titles like Ratchet & Clank: Rift Apart, God of War: Ragnarok, or Horizon Forbidden West – beyond something of a brute boost to processing power.",
    "Sony is starting to correct this with its 2021 TV range, with multiple HDMI 2.1 ports confirmed for the Sony A90J OLED, and one for the step-down A80J OLED model. There’s a new Sony Z9J Master Series 8K LCD model on its way, too, with HDMI 2.1 support.",
    "It means there are options to those connecting a next-gen games console, even among more mid-range sets. Both the X950J/XJ95 and X900J/XJ90 LCD 4K TVs will support 4K/120Hz ports too.",
    "It’s good to see this changing, even if Sony has been a little late to its own party. And the constricted supply of PS5 and Xbox Series X consoles may even have mitigated the effect of those looking for a suitably next-gen TV, as people wait to get one into their homes.",
    "The most important thing here is that HDMI 2.1 is becoming the norm, across Sony, Samsung, and LG alike – and once console supply starts picking up again, none of them will want to be left out in the cold. That means players will have a plethora of options for a suitable gaming TV, and Sony has a chance of offering as good a choice as any.",
    "You might also want to check out the capabilities of HDMI on PS5."
  ],
  "headers": {
    "7": "The promise of HDMI 2.1"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Sony TVs": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "PS5 and Xbox Series X": "https://www.techradar.com/news/ps5-vs-xbox-series-x-which-next-gen-console-should-you-buy",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "Z8H/ZH8 8K TV": "https://www.techradar.com/reviews/sony-z8hzh8-8k-tv",
    "HDMI eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Sony X900H/XH90": "https://www.techradar.com/reviews/sony-xh90-kd-75xh9005-4k-tv",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "A8H/AH8": "https://www.techradar.com/reviews/sony-bravia-a8h-oled-tv",
    "48-inch A9S/A9": "https://www.techradar.com/news/sony-a9s-48-inch-oled-price-specs-and-features",
    "4K Blu rays": "https://www.techradar.com/news/video/blu-ray/the-best-4k-ultra-hd-blu-ray-movies-1329414",
    "buying a PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "4K games": "https://www.techradar.com/news/gaming/5-best-4k-games-the-best-looking-titles-to-play-in-4k-1296513",
    "Ratchet & Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Sony A90J OLED": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "A80J OLED": "https://www.techradar.com/news/sony-a80j-oled-price-specs-release-date",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "gaming TV": "https://www.techradar.com/news/best-gaming-tv",
    "HDMI on PS5": "https://www.techradar.com/news/hdmi-on-ps5"
  }
}