{
  "source": "https://www.techradar.com/news/the-boys-spin-off-show-reveals-season-3-details-and-may-tease-its-release-date",
  "title": "The Boys spin-off show reveals season 3 details – and may tease its release date",
  "category": "entertainment",
  "updated": "2021-07-08T11:53:04Z",
  "author": "hamish-hector",
  "summary": "It's time for Seven on 7",
  "article": [
    "The first spin-off show of The Boys has been released, and you can watch the whole first episode for free right now. It takes the form of an in-universe news show called Seven on 7, an extremely patriotic propaganda machine run by Vought International.",
    "Importantly, it'll tease plot elements that lead into The Boys season 3.",
    "Putting aside the show's less-than-subtle satirical jabs at certain American news outlets, Seven on 7 does perform a very key function for the Amazon Prime Video hit, according showrunner Eric Kripke. Speaking with The Wrap, Kripke explains that Seven on 7 not only “bridges the story gap between seasons 2 and 3” but introduces us to important new characters.",
    "The Boys season 3 will prominently feature the “fair and balanced patriots” who work for VNN (Vought News Network), including Cameron Coleman (Matthew Edison), who is the star of Seven on 7.",
    "This first episode of Seven on 7 gives us an insight into how the general public in the world of The Boys may understand the events of season 2. Coleman is obviously angered by the hiring of \"terrorist\" Hughie Campbell (Jack Quaid) to the Office of Supe Affairs, yet is happily spreading lies about the whereabouts of Blindspot – a superhero who was seriously injured by Homelander in season 2 of The Boys.",
    "A new episode of Seven on 7 will be released on the seventh of each month, until The Boys season 3 releases.",
    "If you're interested in checking out Seven on 7 for yourself, you can find it on the Vought International YouTube account (alongside an official music video for Starlight's 'Never Truly Vanish').",
    "Alternatively, you can watch episode 1 right here in the video below:",
    "While we don’t yet know when season 3 of The Boys will be released, some fans believe Seven on 7’s peculiar release schedule could be a clue from Amazon.",
    "Given the overuse of the number seven, some suspect we could get seven episodes of Seven on 7. That would wrap up the series on January 7, 2022 and could then lead straight into a new series of The Boys on the same day. Alternatively, internet theorists suggest we could see the first episode drop a week (or seven days) later on January 14.",
    "Both of these days in January are Fridays, the perfect time to drop a new series, especially now that rival Disney Plus has shifted the release of its major shows to Wednesdays. We’ll have to wait and see what Amazon has planned for The Boys season 3, but at least we now have something to enjoy while we wait."
  ],
  "headers": {
    "6": "How to watch Seven on 7 with Cameron Coleman",
    "8": "Seven months until The Boys season 3?"
  },
  "links": {
    "Seven on 7": "https://www.youtube.com/watch?v=8PrnILnYOj4",
    "The Boys season 3": "https://www.techradar.com/news/the-boys-season-3",
    "The Wrap": "https://www.thewrap.com/the-boys-season-3-digital-series-seven-on-7-vought-news-network-vnn-cameron-coleman-matthew-edison-video/",
    "Vought International": "https://www.youtube.com/channel/UCekYgu4qTiqVtLcxgBbhjnw",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review"
  }
}