{
  "source": "https://www.techradar.com/news/google-cloud-wants-to-make-it-easier-than-ever-for-developers-to-get-up-and-running",
  "title": "Google Cloud wants to make it easier than ever for developers to get up and running",
  "category": "computing",
  "updated": "2021-02-08T16:13:59Z",
  "author": "barclay-ballard",
  "summary": "Code samples are now easier to find",
  "article": [
    "Google Cloud has added a number of new features that should make it easier for cloud computing developers to start new projects. In particular, it should be more straightforward for them to find existing code samples, which they can then use or tweak for their own software solutions.",
    "“We've added new features to our documentation to provide quick and easy ways to search and browse all code samples that are available for Google Cloud,” Jonathan Simon, a machine learning engineer at Google, said. “When getting started with a new technology, are you the type of developer who immediately looks for code samples? If so, you'll be happy to check out these new features.”",
    "The first addition to the Google Cloud platform is a new search page featuring all code samples, containing more than 1,200 code sample tiles, along with the programming languages that each one is available in and the relevant Google Cloud product that it is associated with. Filters and a text-based search box make it easy to find samples quickly.",
    "Another new feature sure to interest developers is the ability to see all the code samples for a particular Google Cloud product, integrated within that product’s existing documentation. For example, if software engineers want to see all the code samples relating to BigQuery, it is now easy to see associated documentation and view the sample on GitHub.",
    "Google Cloud also confirmed that as its team adds more open source samples to its GitHub repositories, it will also add new standalone code sample pages to its documentation to reflect these additions.",
    "The new code sample features for Google Cloud should speed up the development of new projects and make coding efforts for existing projects progress more smoothly."
  ],
  "headers": {
    "3": "Seek and you shall find"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Google Cloud": "https://www.techradar.com/news/what-is-google-cloud-storage",
    "said": "https://cloud.google.com/blog/topics/developers-practitioners/search-and-browse-google-cloud-code-samples"
  }
}