{
  "source": "https://www.techradar.com/news/ovhcloud-drops-new-paas-web-hosting-plan",
  "title": "OVHcloud drops new PaaS web hosting plan",
  "category": "computing",
  "updated": "2021-06-22T13:37:14Z",
  "author": "abigail-opiah",
  "summary": "Web PaaS web hosting solution will help European startups expand quickly",
  "article": [
    "Cloud computing and web hosting giant OVHcloud has launched its Web PaaS solution with the help of Platform.sh as it looks to help facilitate the development of applications and sites across the web.",
    "Web PaaS, powered by Platform.sh, will be fully integrated into OVHcloud’s portfolio of solutions.",
    "The Web PaaS solution has been integrated into the OVHcloud Control Panel, enabling teams of developers to focus on their projects and coding, using infrastructure managed by OVHcloud.",
    "The launch of the Web PaaS solution comes as both companies decided there was a need to build a European cloud alternative. The solution will be 100% hosted in Europe and will meet all the requirements of the General Data Protection Regulation (GDPR).",
    "In a written release, OVHcloud highlighted that the Web PaaS solution will enable easier production and higher security of websites and web applications in an open and reversible cloud.",
    "Platform.sh technology is compatible with all popular web platforms, such as Drupal, Magento, WordPress, Symfony, and can be used to deploy components written in PHP, Node.js, Python, Go, Rust, .Net or Java.",
    "Speaking on the Web PaaS solution powered Platform.sh, by Michel Paulin, CEO of OVHcloud said that the collaboration between the two companies demonstrates the strength and importance of the ecosystem.",
    "\"Data control continues to be a concern for users, and we would like to support the changing needs in PaaS with trusted solutions, without compromising on performance,\" he added.",
    "\"We are now taking an important step by jointly deploying a solution that is revolutionising the development of web projects - using a public cloud platform that can guarantee that its users have full reversibility of their data. By integrating Platform.sh technology, we are confirming our move towards PaaS and are offering our European customers a solution that combines data sovereignty, simplicity and agility.\"",
    "With the solution, users will have the ability to develop applications based on their choice of runtime or web service environment, utilizing pre-defined templates to get their projects off the ground.",
    "Frédéric Plais, CEO Platform.sh mentioned that the Web PaaS comes after a year of collaboration between the two companies' teams to design and integrate the solution.",
    "\"The PaaS web hosting plan will enable European startups to expand quickly, allowing them to focus on their core products rather than infrastructure management,\" Plais commented.",
    "\"And finally, because we share our convictions on the importance of offering Europeans a product made in Europe by European companies, providing all the necessary guarantees on compliance with European data and laws.\""
  ],
  "headers": {
    "3": "Web PaaS solution"
  },
  "links": {
    "Cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "OVHcloud": "https://www.techradar.com/reviews/ovh",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "PaaS": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}