{
  "source": "https://www.techradar.com/news/sony-is-skipping-e3-again-but-what-does-that-mean-for-ps5",
  "title": "Sony is skipping E3 again - but what does that mean for PS5?",
  "category": "gaming",
  "updated": "2021-04-07T09:18:37Z",
  "author": "adam-vjestica",
  "summary": "The ESA has released a statement to TechRadar",
  "article": [
    "Update: The ESA released the following statement to TechRadar, confirming that Sony will not be attending E3 2021:",
    "“While, much like previous years, Sony does not plan to participate in E3, we continue to focus on delivering the leading and reimagined showcase for video game news, announcements, reveals, networking and interactivity that has made E3 a beloved experience for decades.”",
    "Original Story: E3 2021 returns on June 12, but it looks like Sony won’t be present for the second year running.",
    "The show will be online-only, running from June 12 to June 15, and promises that developers will be “showcasing their latest news and games directly to fans around the world”, and despite initial speculation, E3 will be “available to everyone for free”.",
    "Xbox, Nintendo, Capcom, Konami, Ubisoft, Take-Two, Warner Bros. and Koch Media are all confirmed to be making an appearance at E3 this year, however, Sony is noticeably absent from the ESA's list of early commitments, alongside EA, Activision Blizzard, Sega, Bandai Namco and Square Enix.",
    "While neither Sony nor the ESA has officially ruled out Sony's attendance at the event, the company's absence from this confirmed list suggests it will not be appearing at E3 2021. What's more, this isn’t the first time Sony has ditched E3, with the platform holder opting out of last year’s event in favor of its own State of Play and PS5 events, which closely mimic Nintendo’s successful Nintendo Direct presentation style. Sony also skipped E3 2019 entirely.",
    "Even though Sony likely won’t be in attendance, it’s an impressive show of support for E3 2021, with many speculating that the online-only event would be largely ignored by the biggest companies in the industry. Having Xbox and Nintendo in attendance is a boon to the Entertainment Software Association (ESA), whose event was seen by many as 'the Christmas of gaming announcements' has diminished in recent years.",
    "In a press release, ESA CEO Stanley Pierre-Louis said: \"For more than two decades, E3 has been the premier venue to showcase the best that the video game industry has to offer, while uniting the world through games. We are evolving this year's E3 into a more inclusive event, but will still look to excite the fans with major reveals and insider opportunities that make this event the indispensable center stage for video games.\"",
    "So what does Sony’s likely E3 absence mean for PS5? Well, we’ll still see new PS5 games from other publishers at the show, such as Ubisoft and Capcom, but it means the first-party exclusives that so many PlayStation fans are craving information about won’t be present.",
    "It’s likely that Sony will host its own E3-styled event, where it can control the messaging, format and news cadence without the type of investment needed to be present at E3. However, it could also choose not to share anything at this time like last year, which would give Microsoft and Nintendo a week of almost unrivaled attention for Xbox Series X and Nintendo Switch announcements.",
    "We’ve seen that a number of publishers, including EA and Square Enix, transition into hosting their own tailored events. Again, we wouldn’t be surprised if these publishers still have plans to deliver a smorgasbord of gaming news during June, but ultimately we’ll have to wait and see.",
    "It’s a shame that Sony likely won’t be present at E3 as it’s always been a celebration of major announcements and exclusive reveals, and with the platform holder not being involved directly, it dilutes the sense of occasion slightly. It also means that we’re left to speculate when Sony might reveal more information on its upcoming games like God of War: Ragnarok, Gran Turismo 7 and Horizon: Forbidden West.",
    "TechRadar has contacted Sony and the ESA for comment."
  ],
  "headers": {
    "8": "PlayStation now"
  },
  "links": {
    "E3 will be “available to everyone for free”": "https://www.techradar.com/news/e3-2021-will-be-a-free-event-for-all-attendees-but-could-offer-extra-content-behind-paywall",
    "State of Play": "https://www.techradar.com/news/sony-state-of-play-when-is-the-next-playstation-event-and-what-to-expect",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "new PS5 games": "https://www.techradar.com/news/new-ps5-games",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Square Enix": "https://www.techradar.com/news/square-enix-showcase-will-premiere-new-life-is-strange",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Gran Turismo 7": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers",
    "Horizon: Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer"
  }
}