{
  "source": "https://www.techradar.com/news/the-google-pixel-watch-will-be-exactly-what-wear-os-needs",
  "title": "The Google Pixel Watch will be exactly what Wear OS needs",
  "category": "wearables",
  "updated": "2021-12-04T12:00:30Z",
  "author": "david-nield",
  "summary": "We're all-in on Google's own-brand smartwatch",
  "article": [
    "According to people familiar with the matter, Google is bringing out a Pixel Watch next year – a flagship device showing off Wear OS in the same way that the Pixel series of phones show off the Android mobile operating system.",
    "First of all this has been a long time coming: rumors of a Pixel Watch have been swirling for several years at this point. There aren't many gadgets that have remained as rumors for quite as long as the Pixel Watch has, except perhaps Apple's augmented reality glasses.",
    "And it feels as though the timing is right. Google's Wear OS software got a major update this year, and Google is on a roll after the success of the Pixel 6 and the Pixel 6 Pro. The company's hardware division now seems to have the momentum and the expertise to take on a new product category like this.",
    "What's more, we think that a Pixel Watch could be exactly what Wear OS needs. The Apple Watch continues to be a huge success, while smartwatches from the likes of Fitbit and Garmin have proved popular with users too. In comparison, Wear OS is lagging way behind in terms of both sales and attention.",
    "The likes of Fossil and TicWatch have done a commendable job at pushing out Wear OS smartwatches, but the clout that Google carries would put the Pixel Watch on another level – and bring Google's smartwatch OS to a much wider audience.",
    "Wear OS – previously known as Android Wear – has been around since 2014, but it has never really caught the imagination in the same way as watchOS has. Apple has shown how a smartwatch can be a natural extension of a smartphone, and now Google needs to follow that lead.",
    "Recently added features such as the ability to install watch apps from your phone suggest that Google is finally committing a substantial amount of time and effort to improving the software and consequently all the devices that it runs on.",
    "With a Pixel Watch, the connection between watch and phone could be even more seamless. We might even see some special Pixel Watch exclusives offered to tempt in more consumers, which is something Google has done with its Pixel phones.",
    "By introducing hardware alongside the software, Wear OS should benefit from additional investment, as Google looks to keep its flagship wearable and its operating system as polished and appealing as possible. We might even start seeing yearly updates, which is what happens with watchOS.",
    "Remember that Samsung has now gone back to Wear OS on its own smartwatches. Add in a Pixel Watch as well, and Android users could finally be getting the companion device for their smartphones that they deserve."
  ],
  "headers": {
    "5": "Ready to Wear OS"
  },
  "links": {
    "bringing out a Pixel Watch": "https://www.techradar.com/news/report-google-pixel-watch-coming-in-2022",
    "Pixel series": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "for several years": "https://www.techradar.com/news/google-pixel-watch-could-be-coming-alongside-the-pixel-4",
    "Apple's augmented reality glasses": "https://www.techradar.com/news/apple-glasses",
    "major update": "https://www.techradar.com/news/wear-os-3-name-announced",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-7",
    "Fitbit": "https://www.techradar.com/reviews/fitbit-sense",
    "Garmin": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Fossil": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
    "TicWatch": "https://www.techradar.com/reviews/ticwatch-pro-3",
    "watchOS": "https://www.techradar.com/news/watchos-8-update",
    "install watch apps from your phone": "https://www.techradar.com/news/wear-os-smartwatch-update-just-quietly-brought-a-huge-new-feature",
    "gone back to Wear OS": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review"
  }
}