{
  "source": "https://www.techradar.com/news/ps-plus-free-games-for-august-have-been-leaked",
  "title": "PS Plus free games for August have confirmed following leak",
  "category": "gaming",
  "updated": "2021-07-29T10:10:10Z",
  "author": "vic-hood",
  "summary": "These are your PS Plus free games for August",
  "article": [
    "Update: Sony has now confirmed August's free PS Plus games following a leak last weekend.",
    "Original Story: Sony has seemingly leaked its PS Plus free games for August, ahead of an official announcement.",
    "The official PlayStation website seems to have been prematurely updated at the weekend (thanks Eurogamer), revealing that August's PS Plus free game lineup includes Plants vs. Zombies: Battle for Neighborville (PS4), Tennis World Tour 2 (PS4), and Hunter's Arena: Legends (PS5).",
    "The updated information has since been removed, with the website now once again showing July's free game offering, but not before players spotted the apparent mistake.",
    "Sony typically announces its PlayStation Plus free games near the end of the month, with an official blog post and video, with games available to download sometime in the first week of the month following. In this case, August's free PS Plus games will apparently be available from August 3.",
    "Given that this update was only to the website, and has now been removed, we can assume it was a mistake on Sony's part.",
    "While Sony hasn't officially confirmed that these are officially the PS Plus games for August at the time of writing, we assume it won't be long before it does. We also imagine that this leaked list, given that it's been a mistake by Sony itself, is probably quite accurate.",
    "So what are PS Plus subscribers (potentially) getting their hands on in August?",
    "Plants vs. Zombies: Battle for Neighborville is a whacky first-person shooter that sees you partaking in a suburban skirmish, fighting for (you guessed it) either brainless zombies or fierce plantlife. Plants vs. Zombies is ridiculous fun and offers the perfect opportunity for players to jump into online multiplayer madness that doesn't take itself too seriously.",
    "For those who have had their tennis pro aspirations fueled by Wimbledon, Tennis World Tour 2 is well worth a go. Playing as the world's top players, Tennis World Tour sees you setting out to dominate the world circuit - topspinning, backhanding and serving your way to the top.",
    "Last, but certainly not least, we have Hunter's Arena: Legends. Hunter's Arena: Legends is a battle royale set in Ancient Asia, featuring 30-player PvP and PvE combat. If you love a battle royale, but have grown weary of Fortnite, Apex Legends and PUBG, then Hunter's Arena is well worth a go.",
    "Remember, while it looks like Plants vs. Zombies and Tennis World Tour 2 will be PS4 versions, you can also play these PS4 games on PS5 through backwards compatibility – though it looks like PS4 players won't be able to play Hunter's Arena: Legends, which is a PS5 title.",
    "This isn't the best PS Plus games lineup we've seen and it's honestly a tad disappointing – particularly when it comes to the apparent PS5 game offering.",
    "Hunters Arena doesn't quite stack up when we compare it to months when brand new PS5 exclusives like Destruction Allstars and Soulstorm were on offer. However, Plants vs Zombies looks to be a real standout here and is definitely worth your time.",
    "While we would usually say to take any PS Plus game leaks with a heap of salt, as they've been proven wrong in the past, we imagine this one's pretty legit, as it came from Sony itself. All we need to do now is wait for the official announcement.",
    "You need to be an active PlayStation Plus subscriber to pick up these free PS Plus games – and they're yours to play whenever you want as long as you remain a subscriber.",
    "Being a PS Plus subscriber means you can play online with friends, but also lets you take advantage of discounts and free games each month. It's a great way to try PlayStation games you might not otherwise have played, whether they're indie titles that slipped under your radar, or titles that were too expensive to buy at launch.",
    "Each month we see Sony offering a mix of PS4 and PS5 games, so it's worth getting even if you haven't upgraded yet."
  ],
  "headers": {
    "6": "So what's (potentially) up for grabs?",
    "12": "Opinion: not the best PS Plus offering",
    "15": "A worthwhile investment"
  },
  "links": {
    "confirmed": "https://blog.playstation.com/2021/07/28/playstation-plus-games-for-august-hunters-arena-legends-plants-vs-zombies-battle-for-neighborville-tennis-world-tour-2/",
    "PS Plus free games": "https://www.techradar.com/news/playstation-plus-free-games",
    "official PlayStation website": "https://www.eurogamer.net/articles/2021-07-24-playstation-website-reveals-ps-plus-august-games",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-07-24-playstation-website-reveals-ps-plus-august-games",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "backwards compatibility": "https://www.techradar.com/news/what-is-backwards-compatibility-the-key-ps5-and-xbox-series-x-feature-explained",
    "Destruction Allstars": "https://www.techradar.com/news/destruction-allstars-is-worth-a-spin-but-lacks-longevity",
    "Soulstorm": "https://www.techradar.com/news/soulstorms-messy-start-nearly-made-me-give-up-im-glad-i-didnt"
  }
}