{
  "source": "https://www.techradar.com/news/wandavision-episode-5-and-big-twists-teased-in-exciting-new-trailer",
  "title": "New WandaVision episode 5 trailer hints at big reveals ahead",
  "category": "entertainment",
  "updated": "2021-02-01T17:19:13Z",
  "author": "samuel-roberts",
  "summary": "Get hyped for the rest of the season",
  "article": [
    "Disney Plus and Marvel have released a new look at what's coming up in WandaVision episode 5 – and beyond. If you want to go into the next few episodes without knowing anything, we'd recommend giving it a miss, though it doesn't give away any major plots twists coming up.",
    "Scroll down for a little spoiler-y analysis of what the minute-long teaser tells us.",
    "In the past four episodes of the show, WandaVision has set up a mystery around the New Jersey town of Westview, which, according to the events of episode 4, doesn't actually exist (Eastview does, though. Go Eastview!). In a Twilight Zone-y twist, the town is surrounded by some kind of barrier, and people are afflicted with a mental block that compels them not to enter Westview.",
    "The town's keeper, of course, is Wanda Maximoff. The entire town is seemingly manipulated by her reality-altering powers – we expect the reason is over the grief of losing Vision to Thanos at the end of Avengers: Infinity War. But it's also likely that this is not the only thing at work, here, and we can't wait to see how the mystery is unpacked.",
    "Here's the teaser, and note again that spoilers are ahead:",
    "What we're seeing in this teaser is likely from the next few episodes of WandaVision, rather than just the next one. We know that because we can see multiple riffs on different sitcom eras in there – including a brief reference to The Office as Wanda speaks directly to the camera in that show's mockumentary style. WandaVision has so far riffed on a single sitcom era per episode.",
    "The teaser also shows us that the residents of Westview have a little more self-awareness about what's going on in this strange, Wanda-controlled town than we originally realized. At one point, Agnes (Kathryn Hahn) asks Wanda if she should \"take it from the top\", suggesting she's well aware that the sitcom reality is fake. The residents' understanding that something is amiss was previously hinted at in the show's third episode.",
    "Agnes is largely speculated to secretly be the Marvel villain Agatha Harkness in the show – who, in the comics, has acted as both mentor and enemy to Wanda. Could she be involved with what's actually going on here?",
    "Vision, meanwhile, will evidently become aware that Westview is not as it seems at some point during the series, as he's seen trying to break the barrier between Westview and the rest of the world in this teaser.",
    "Finally, we see someone walking through the barrier, where SWORD is waiting. Could that be Wanda, in full Scarlet Witch garb? Over the next month, we'll hopefully uncover every secret that Marvel has planted in the show."
  ],
  "headers": {
    "5": "What does the WandaVision episode 5 trailer tell us?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "WandaVision episode 5": "https://www.techradar.com/news/wandavision-episode-9-release-date-on-disney-plus-when-is-the-season-finale",
    "episode 4": "https://www.techradar.com/news/wandavision-episode-4-recap-review",
    "SWORD": "https://www.techradar.com/news/sword-in-wandavision-explained"
  }
}