{
  "source": "https://www.techradar.com/news/hacked-florida-water-plant-was-still-using-windows-7",
  "title": "Hacked Florida water plant was still using Windows 7",
  "category": "computing",
  "updated": "2021-02-11T13:04:19Z",
  "author": "mayank-sharma",
  "summary": "Investigators call attack on Oldsmar water supply system “unsophisticated”",
  "article": [
    "More details have emerged about the recent cyberattack on a water treatment utility in the city of Oldsmar, Florida, with the facility involved apparently still using outdated Windows 7 PCs.",
    "Reports quote investigators as saying that “the cyber actors likely accessed the system by exploiting cybersecurity weaknesses, including poor password security and an outdated Windows 7 operating system to compromise software used to remotely manage water treatment.”",
    "The hack, which could have caused a major catastrophe had it not been for an alert supervisor, has once again brought the spotlight on the threat to operational technology in civil infrastructure.",
    "Microsoft ended mainstream support for Windows 7 on January 13, 2015, though it continued to receive security updates. However, Windows 7 finally reached end-of-life over a year ago on January 14, 2020 when Microsoft ceased to provide any update for the operating system, urging users to switch to Windows 10.",
    "Despite this millions of users still haven’t updated from Windows 7. As it turns out, the Oldsmar county’s water treatment plant is one of them.",
    "Dubbing the attack as “relatively unsophisticated”, the investigators shared that the attacker likely used the TeamViewer remote desktop sharing software to make his way into the system.",
    "Speaking to TechRadar Pro, Eddie Habibi, Founder of PAS, which provides software solutions to prevent exploitation of operational technology, agreed, adding that “while much of the coverage of the cyber risk to critical infrastructure to date has focused on the age of many industrial control systems and the fact that they were not designed and deployed with security in mind, in this case, the attack vector appears to have been the increased level of remote access enabled by the Florida county.”",
    "Via: Engadget"
  ],
  "headers": {
    "3": "Poorly configured systems"
  },
  "links": {
    "cyberattack on a water treatment utility": "https://www.techradar.com/news/florida-city-tartgeted-by-hacker-who-tried-to-poison-water-supply",
    "Windows 7": "https://www.techradar.com/news/ahead-of-windows-7s-death-you-can-still-upgrade-to-windows-10-for-free-heres-how-to-get-it",
    "password security": "https://www.techradar.com/best/password-manager",
    "Windows 7 finally reached end-of-life": "https://www.techradar.com/news/windows-7-end-of-life-everything-you-need-to-know-about-the-death-of-windows-7",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "millions of users still haven’t updated": "https://www.techradar.com/news/millions-of-users-still-havent-updated-from-windows-7",
    "remote desktop sharing software": "https://www.techradar.com/news/best-remote-desktop-software",
    "Engadget": "https://www.engadget.com/hacked-water-plant-computer-had-shared-passwords-andofdate-windows-os-082552973.html"
  }
}