{
  "source": "https://www.techradar.com/news/arkane-austins-new-game-redfall-brings-vampires-in-summer-2022",
  "title": "Arkane Austin's new game Redfall brings vampires in 2022",
  "category": "gaming",
  "updated": "2021-06-13T20:39:55Z",
  "author": "samuel-tolbert",
  "summary": "Sink your teeth in",
  "article": [
    "During today's Xbox and Bethesda Games Showcase at E3 2021, the next game from Arkane Austin was unveiled. Named Redfall, it's a shooter that pits one or multiple players against vampires and it's coming exclusively to Xbox Series X, Xbox Series S and PC sometime in Summer 2022, commonly defined as between June and August.",
    "You can check out the trailer below:",
    "While co-op is part of it, there is a proper campaign for players to enjoy. Redfall takes place in a world ruled by vampires, a race of vampires born out of science-fiction, not mythology.",
    "“We wanted players to have an Arkane experience, but with the option of playing with friends this time,” says Co-Creative Director Ricardo Bare.",
    "Arkane Austin makes up half of Arkane Studios, with the second half composed of Arkane Lyon in France, currently working on Deathloop. Amusingly, Deathloop is currently a timed console exclusive to PS5, thought it'll be coming to Xbox platforms a year after launch.",
    "Players choose between four characters: Layla Ellison, Jacob Boyer, Remi de la Rosa and Devinder Crousley. They face off against vampires weak not to garlic or crosses, but good ol' fashioned stakes through the heart.",
    "“Vampires are perennially fun, classical villains, because they’re ripe for every generation to reinvent and experience in a new light,” says Bare. “In our case, Redfall vampires are science-inspired, triggered by biotech longevity experimentation.”"
  ],
  "headers": {
    "5": "Meet the cast"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}