{
  "source": "https://www.techradar.com/news/iphone-13-range-could-get-a-much-needed-battery-boost-but-it-might-not-be-enough",
  "title": "iPhone 13 range could get a much-needed battery boost, but it might not be enough",
  "category": "phones",
  "updated": "2021-08-13T09:10:09Z",
  "author": "james-rogerson",
  "summary": "More power and better 5G could also be planned",
  "article": [
    "One thing that we’ve heard repeatedly about the iPhone 13 range is that the upcoming phones could all have larger batteries than their predecessors, and now there’s yet more evidence of that.",
    "A report from TrendForce (a market intelligence company) suggests that Apple is changing the circuit board design for the iPhone 13 range, switching from a rigid-flex one to a flexible one, which should take up less space in the phone, thereby leaving room for bigger batteries.",
    "We’ve heard similar before, with reputable analyst Ming-Chi Kuo for example saying that Apple will use a space-saving design to allow for bigger batteries. So it seems quite likely that this will happen.",
    "That’s not all this new report says either. It also echoes previous claims that the iPhone 13 range will use an A15 Bionic chipset, supposedly set to be built on a 5nm+ manufacturing process. That doesn’t sound like much of an improvement on the 5nm process used by the A14 Bionic in the iPhone 12 range, but TrendForce reckons it will still allow for improved performance and efficiency.",
    "This report also follows others in saying that the range will support mmWave 5G beyond the US. That’s a faster form of 5G than the sub-6GHz that iPhone 12 models purchased outside the US are limited to, though to make use of it the right infrastructure also needs to be in place, which it isn’t yet in many countries.",
    "Finally, the report states that Apple will retain its current “aggressive pricing strategy” in order to improve sales. While it doesn’t name specific prices, that talk of retaining the current strategy suggests the iPhone 13 range might cost exactly the same as the iPhone 12 range. The same site has made this claim before, so it’s standing by it.",
    "Everything in this report has been rumored before and is fairly likely to happen, but in the case of the battery size increase it doesn’t sound like the change will be very significant.",
    "We can’t imagine that a smaller circuit board would allow for much larger batteries, and indeed a previous leak suggests that the change might be minor, with the arguable exception of the iPhone 13 Pro Max, which is rumored to have a 4,325mAh battery, up from 3,687mAh in the iPhone 12 Pro Max.",
    "For reference, the iPhone 13 and iPhone 13 Pro both apparently have 3,095mAh ones (up from 2,805mAh), and the iPhone 13 mini is said to have a 2,406mAh one (up from 2,277mAh).",
    "All of those capacities - including the rumored iPhone 13 Pro Max one – are low compared to Android handsets, many of which reach 5,000mAh and some of which get even higher. Of course, numbers aren’t everything, but battery life is one thing that iPhones often struggle with, and most models don’t offer much more than average life.",
    "So this is something that we really want to see Apple make big strides with, and based on what we’re hearing so far, it sounds like the improvements will be minor at best.",
    "In fact, given that the iPhone 13 Pro models are rumored to have power-hungry 120Hz screens, we wouldn’t be surprised if they actually have worse battery life than their predecessors.",
    "Via Phone Arena"
  ],
  "headers": {
    "6": "Analysis: bigger batteries are better, but the change might be small"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "TrendForce": "https://insider.trendforce.com/2021/08/12/iphone-shipment-resumes-its-upward-trajectory-in-3q21-with-30-yoy-increase/",
    "Apple will use a space-saving design": "https://www.techradar.com/news/iphone-13-leak-says-battery-life-will-be-better",
    "use an A15 Bionic chipset": "https://www.techradar.com/news/iphone-13s-a15-chip-production-could-start-soon-but-the-upgrades-might-be-small",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "will support mmWave 5G beyond the US": "https://www.techradar.com/news/iphone-13-may-support-faster-5g-but-that-could-come-at-a-cost",
    "made this claim before": "https://www.techradar.com/news/iphone-13-price-might-not-be-any-higher-than-the-iphone-12s",
    "previous leak": "https://www.techradar.com/news/iphone-13-battery-leak-shows-improvements-but-its-still-not-great",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "rumored to have power-hungry 120Hz screens": "https://www.techradar.com/news/two-iphone-13-models-look-set-to-have-a-120hz-screen-built-by-samsung",
    "Phone Arena": "https://www.phonearena.com/news/iphone-13-feature-bigger-batteries-same-prices-efficient-a15-bionic_id134308"
  }
}