{
  "source": "https://www.techradar.com/news/cyberpunk-2077-vr-mod-will-probably-be-out-before-the-games-current-gen-update",
  "title": "Cyberpunk 2077 VR mod will probably be out before the game's current-gen update",
  "category": "gaming",
  "updated": "2021-12-02T12:24:11Z",
  "author": "rhys-wood",
  "summary": "The mod's creator aims for an early 2022 release",
  "article": [
    "Love it or hate it, Cyberpunk 2077's Night City can be a pretty compelling, immersive open world to explore. So much so that we'd genuinely love to see it through the lenses of some of the best VR headsets. Thankfully, renowned modder Luke Ross is working on a Cyberpunk 2077 VR mod right now, and the best part is that it's potentially launching soon.",
    "As reported by PC Gamer, Ross told the outlet: \"If nothing goes wrong, I'd say it should come out in January.\" That's surprisingly early for a mod of such scope, and a little strange to wrap one's head around the idea that Ross's Cyberpunk 2077 VR mod will likely release long before CD Projekt Red's own current-gen upgrade for the game that was pushed back into 2022.",
    "Luke Ross is known for also having created stellar VR mods for both GTA 5 and Red Dead Redemption 2, so it certainly isn't the modder's first rodeo. Plus, Cyberpunk 2077 bears some unique pros and cons to its VR compatibility worth thinking about, as Ross explains.",
    "\"One major bonus about CP2077 is that it's already played in first person, which is very good for VR immersiveness, unlike for example the Mafia Trilogy where I had to implement my own 'fake-first-person' camera.",
    "\"Now that my modding framework is approaching some level of maturity, I can probably release one game per month (on average),\" Ross continues. \"Of course that depends on the specific challenges that each game poses, and there's always a possibility that a certain game turns out not to be moddable at all due to some unforeseen issues.\"",
    "And in fairness, it's said 'unforeseen issues' that have defined Cyberpunk 2077 in the public space. The game's notoriously rushed development cycle led to game-breaking bugs, graphical glitches, half-baked gameplay systems, and a boatload of undelivered promises in general.",
    "Cyberpunk 2077 has improved over the past year thanks to stability and quality-of-life patches, but this doesn't speak to its compatibility with VR at all. And despite potentially lending itself well to a VR conversion thanks to its first-person viewpoint, Cyberpunk 2077 as a whole was not designed with virtual reality in mind.",
    "This could lead to all sorts of unforeseen issues, as Ross admitted. And while the modder's VR work, in general, has been mighty impressive, there seems to be only so much one can do in the face of a game like Cyberpunk 2077 that is already plagued by a litany of issues, VR compatibility notwithstanding.",
    "That's not to say we detest the idea. In fact, we're hard pressed to find a better fit for VR than the vibrant seediness of Night City and the surrounding Badlands. Patrolling areas like the neon-drenched streets of Watson to the noisy, cramped markets of Jig-Jig Street sounds like it could be a phenomenally immersive experience, so long as Cyberpunk's myriad problems don't threaten to ruin it."
  ],
  "headers": {
    "6": "Cyberpunk 2077 in VR is enticing, but will it actually work?"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "best VR headsets": "https://www.techradar.com/best/the-best-vr-games/news/the-best-vr-headset",
    "PC Gamer": "https://www.pcgamer.com/uk/cyberpunk-2077-vr-mod-should-come-out-in-january-says-creator/",
    "GTA 5": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-is-now-vr-compatible-but-theres-a-catch"
  }
}