{
  "source": "https://www.techradar.com/news/cryptominers-bulk-buying-rtx-3000-laptops-in-china-to-mine-ethereum",
  "title": "Cryptominers bulk buying RTX 3000 laptops in China to mine Ethereum",
  "category": "computing",
  "updated": "2021-02-08T21:18:41Z",
  "author": "john-loeffler",
  "summary": "Even laptops are mining as Cryptocurrencies boom",
  "article": [
    "With the price of Ethereum tripling in as many months, cryptominers in China are finding it profitable to buy up new Nvidia GeForce RTX 3000-series laptops to mine for the world’s second-largest cryptocurrency.",
    "Several pictures of brand new RTX 3000-series laptops are shown to be hard at work grinding out Ethereum, according to a post by user BTCer on the Chinese social media site Weibo.",
    "After tripling in value just since last November, there is a cryptorush on Ethereum right now, which – paired with the limited stock availability of RTX 3000 desktop cards normally used in cryptomining – makes new RTX 3000 mobile GPUs a profitable option for miners.",
    "That also means that availability is that much more limited for anyone hoping to get a new RTX 3000 laptop like the Gigabyte Aero 17 (2021) or the Alienware m17 (2021), at least in China. So far, there haven’t been many reports of laptop shortages broadly speaking, but with desktop RTX 3060 Ti, RTX 3070, RTX 3080, and RTX 3090 supply still falling far short of demand, it may only be a matter of time before laptop availability starts feeling the pinch.",
    "The RTX 3000 laptop market might face some pressure in China, but good news: it’s unlikely to be as bad as the desktop GPU market. As Videocardz points out, an RTX 3070 laptop isn't exactly cheap, and the profitability of mining Ethereum on dozens of brand new Ampere laptops is largely a function of the soaring price of the cryptocurrency.",
    "That would make mining on a laptop much more sensitive to price fluctuations that cheaper desktop GPUs might be better able to absorb. An RTX 3070 laptop can cost three times what a desktop card would cost you – and it wouldn't be as powerful, so you wouldn't be able to make as much profit mining cryptocurrency.",
    "That is, of course, if you can find an RTX 3070 desktop card. This is easier to do in China, where many of Nvidia's production partners are located. There's more opportunity to simply buy the cards directly from the factory in bulk, but it's still a challenge there, too.",
    "Hopefully, this means that there won't be a run on RTX 3000-series laptops outside of China. That said, if cryptocurrency prices continue to soar, laptop availability is likely to crash harder than a digital currency selloff."
  ],
  "headers": {
    "4": "Cryptomining likely to bite into RTX 3000 laptop supply"
  },
  "links": {
    "Ethereum": "https://www.techradar.com/news/what-is-bitcoin",
    "post": "http://weibointl.api.weibo.com/share/201483273.html?weibo_id=4601566546101801",
    "cryptomining": "https://www.techradar.com/best/mining-rigs",
    "Gigabyte Aero 17 (2021)": "https://www.techradar.com/reviews/gigabyte-aero-17-2021-review",
    "Alienware m17 (2021)": "https://www.techradar.com/reviews/alienware-m17-r4-2021",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Videocardz": "https://videocardz.com/newz/chinese-gpu-miners-are-now-bulk-buying-geforce-rtx-30-laptops-to-mine-ethereum",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere"
  }
}