{
  "source": "https://www.techradar.com/news/best-horror-movies-tv-shows-hbo-max",
  "title": "10 best horror movies and TV shows on HBO Max for Halloween 2021",
  "category": "audio-visual",
  "updated": "2021-10-29T15:59:56Z",
  "author": "daniel-pateman",
  "summary": "HBO Max will fill your nights with frights this Halloween",
  "article": [
    "The nights are drawing in and there's something sinister in the air. It can only mean one thing. It's time to grab a bowl of popcorn (and a cushion to hide behind) and watch a horror movie or two to celebrate our favorite holiday of the year - Halloween.",
    "Thankfully for dedicated streaming service subscribes, HBO Max has a plethora of ghoulish content to see you through. From psychological thrillers to comedy horrors, classic movies and modern reboots, it's all readily available for a sleepless night.",
    "Below you'll find our top 10 horror movies and TV shows on HBO Max for you to pick from this Halloween. Now all you need to do is lock the door, turn off the lights, and prepare to stream!",
    "Saw co-creator Leigh Whannell took the premise of the 1897 sci-fi novel by H.G. Wells and turned it into a brutally resonant, #MeToo-inspired masterpiece. It’s packed with chilly tension from the start as Cecilia (Elizabeth Moss) escapes from the clutches of her millionaire boyfriend – optics expert Adrian Griffin (Oliver Jackson-Cohen) – only to find herself, her family and friends being victimized by an invisible entity.",
    "Unlike the entertainingly camp original, this lean, muscular thriller is full of creeping paranoia in which threat lurks just out of sight – shockingly demonstrated during a crowded restaurant scene. It’s brilliantly executed, and superbly acted by Moss as a woman whose transformation from traumatised victim to vengeful femme fatale is thrilling to watch. Perhaps the most impressive aspect, though, is the repurposing of H.G. Wells tale into a timely commentary on coercive relationships and patriarchal power structures.",
    "Nothing screams “Halloween” like a loosely linked compendium of terrifying tales in the vein of Creepshow, and Trick ‘r Treat is a one of the best examples of the genre.",
    "This 2007 horror anthology movie from director Michael Dougherty tells four unique but interlinked tales, all taking take place in the town of Warren Valley, Ohio one Halloween night. In each segment appears the mysterious figure of Sam – his head shrouded in a burlap sack – who attacks those who break the sacred “rules” of All Hallows Eve.",
    "This jet-black horror comedy is bursting with seasonal ambience and features a modestly A-list cast. Dylan Baker (Happiness) is a principal with a dark secret buried in his backyard; Brian Cox (X2, The Ring) is bad-tempered old neighbour Mr Kreeg, who finds himself grappling with a demonic entity, while True Blood’s Anna Paquin gives a serial killer more than he bargained for. It’s gleefully ghoulish, entertainingly creepy, and full of subversive twists – a real Halloween treat!",
    "Diabolique follows the kind but frail Christina and the strict Nicole, two teachers at a run-down Paris school bonded by their hatred of the same man, the cruel headmaster Michel. Tired of his abuse, both wife and mistress plot his murder – drowning him in a bathtub and dumping his corpse in the school’s neglected pool. But when the body fails to surface, they’re haunted by the suspicion that he might not be dead after all.",
    "This moody black and white French shocker from acclaimed director Henri-Georges Clouzot was considered the most artful and frightening horror movie ever, until Psycho slashed its way into screening rooms in 1960. Fiendishly plotted with an atmosphere of dread, and featuring one of cinema’s most memorable endings, Diabolique proved to be hugely influential – particularly on the “Master of Suspense” himself, Alfred Hitchcock.",
    "“One, two, Freddy’s coming for you.” Wes Craven reinvigorated the tired slasher movie sub-genre with this tale of razor-gloved, pizza-faced Freddy Kruger, a child murderer immolated by vigilante parents who returns to haunt the slumber of their offspring.",
    "Starring Heather Langenkamp as Nancy Thompson and Johnny Depp in his film debut as boyfriend Glen, it follows four young friends terrorised in their dreams by a disfigured man with “knives for fingers”. One by one, and in a number of imaginative ways, they literally succumb to sleep – being dragged across ceilings or pulled down into their bed – until only resourceful Final Girl Nancy remains to face off with Freddy in the real world.",
    "Nightmare’s success helped established a film studio (New Line Cinema was called “The House that Freddy Built”) and led to six lucrative sequels, a remake, and a crossover with Friday the 13th (Freddy vs. Jason). And although few of those captured Freddy’s initial malevolence, or the original’s surreal confusion between reality and fantasy.",
    "Before finding mainstream success with comic book movie Spider-Man, Sam Raimi was best known for his gory Evil Dead movies – the first entry being made on a tiny budget of $375,000 and becoming notorious as an X-Rated “Video Nasty”.",
    "The bare bones of it concerns five university students visiting an isolated cabin in the woods on vacation. There they discover the ancient Book of the Dead and an audio recorder, which when played recites an incantation that exhumes evil spirits from the surrounding woods. As each of the students gets possessed, Ash – played with manic energy by cult actor Bruce Campbell – must defend himself from the demonic onslaught and survive until sunrise.",
    "Despite the tiny budget, The Evil Dead remains a propulsive thrill-ride. Cameras hurtle through the trees and shiver down windows from the “deadites” POV, with wildly tilted camera angles implying a full-on assault against reality. It’s a splatter-fest, but its bloody excesses – exploding organs and severed limbs – are tempered by the movies OTT absurdity.",
    "This original HBO Max show won acclaim for its imaginative depiction of America’s Jim Crow past, with its human characters usually more terrible than the abysmal Lovecraftian creatures that occasionally feature.",
    "Based on Matt Ruff’s 2016 novel of the same name, H.P. Lovecraft’s literary legacy provides an imagined geography in which to explore the harsh reality of Black life in the 1950s, with racism manifesting itself via corrupt cops, segregated neighborhoods, and Sundown towns in which Black people are chased out after dark.",
    "Produced by Get Out's Jordan Peele, we follow Atticus “Tic” Freeman (Jonathan Majors) and his friend Leticia Lewis (Jurnee Smollett) as they drive cross-country to uncover the mystery of Tic’s recently disappeared father. The series blends multiple genres, incorporating elements of science fiction, fantasy, and horror to highlight more diverse and empowering narratives about Black life. Standout episode “A Strange Case” riffs off another iconic author, to provide an icky, body-horror metaphor about white privilege and power.",
    "Christopher Landon takes the core concept of family classic Freaky Friday and combines it with Friday the 13th, to hilariously subversive effect. When the notorious Blissfield Butcher (Vince Vaughan) attacks a student after a high-school football match, he stabs her with a mystical dagger that causes them to swap bodies. Now in the guise of a teenage girl, The Butcher has carte blanche to eviscerate the high school students without drawing suspicion, while Millie Kessler (Kathryn Newton) has until midnight to save her friends and get her body back.",
    "Like Scream before it, it’s amusingly aware of the ‘rules’ of the slasher movie and full of tongue-in-cheek dialogue, which Josh articulates to his friend Nyla while fleeing The Butcher (“I’m gay, you’re black, we are so dead.”) It feels pretty progressive for a horror movie, a feat facilitated by the role reversal at the heart of the movie, allowing Landon to present identity, gender and sexuality in a refreshingly fluid way. It’s a bloody fun ride – in particular Vaughan as an insecure teenage girl with a high school crush.",
    "The “based on a true story” origin of this supernatural chiller only serves to heighten the frights. It recounts the supposed real-life experiences of the Lutzes, a family who moved into a home that had been the scene of a grizzly mass murder. 28 days later, the Lutz family fled the property, claiming to have been plagued by paranormal phenomena.",
    "Starring Josh Brolin and Margot Kidder, and released just a year before The Shining, this is a similar tale of a husband driven mad by a building’s violent history – and crushing mortgage payments. Yet the spooky disturbances feel more troubling here, located in the ordinary suburban environment.",
    "From out of a sense of normalcy the film builds to a terrifying crescendo. George finds himself constantly freezing. He wakes up at 3.15am every night – at the same time the DeFeo family were murdered. A sash window breaks his son’s hand. And the priest called in to bless the house hears a threatening voice tell him to “get out!”.",
    "Did we mention the walls ooze blood? Yeah, this film will definitely give you the heebie-jeebies.",
    "Rob Reiner’s adaptation of the 1987 novel by Stephen King was one of the most suspenseful movies of the 90s, and this claustrophobic thriller remains a riveting watch over thirty years later.",
    "That’s largely thanks to the one-two punch of Kathy Bates – who delivers an incredible, Oscar-winning performance as the frumpy ex-nurse with an explosive temper – and James Caan as wily romance novelist Paul Sheldon, who’s kept captive in the home of his “number one fan” after his car careens off the road during a snow storm.",
    "It’s the only Stephen King adaptation to win an Academy Award, thanks to Bates’s unhinged performance as the psychologically troubled Annie, and aided by William Goldman’s taut, focused screenplay. We think it’s a cock-a-doodie classic – and we’ll hobble anyone who says otherwise.",
    "From Taika Waititi and Jermaine Clement, the Kiwi duo responsible for 2014’s What We Do in the Shadows, comes the comedy TV spin-off about a top-secret division of the Wellington police department charged with investigating the city’s paranormal phenomena.",
    "Inducted into this murky world are Officers Minogue and O’Leary, who made their rib-tickling debut in the aforementioned 2014 movie while following up a noise complaint at the vampires’ residence and oblivious to their undead tendencies. They respond to all manner of supernatural sightings here – including Māori sea monsters, werewolves, aliens and zombie cops – all of which they approach with an indifferent air of by-the-books professionalism (like when Satan is accidentally summoned to be a department store Santa).",
    "It’s a drily humorous tonic to your typical horror movie mayhem. Plus, actor Maaka Pohatu is brilliant as the department’s police sergeant, whose case load includes reports of a haunted sock, scary umbrellas, and a possessed futon.",
    "Discover more:"
  ],
  "headers": {
    "3": "The Invisible Man (2020)",
    "5": "Trick ‘r Treat (2007)",
    "8": "Diabolique (1955)",
    "10": "A Nightmare on Elm Street (1984)",
    "13": "The Evil Dead (1981)",
    "16": "Lovecraft Country (2020)",
    "19": "Freaky (2020)",
    "21": "The Amityville Horror (1979)",
    "25": "Misery (1990)",
    "28": "Wellington Paranormal (2018)"
  },
  "links": {
    "HBO Max show": "https://www.techradar.com/news/best-hbo-max-shows"
  }
}