{
  "source": "https://www.techradar.com/news/how-to-watch-what-we-do-in-the-shadows-season-3-online-from-anywhere",
  "title": "How to watch What We Do in the Shadows season 3 online from anywhere",
  "category": "computing",
  "updated": "2021-09-03T00:01:55Z",
  "author": "daniel-pateman",
  "summary": "The acclaimed FX horror-comedy is back!",
  "article": [
    "Based on the 2014 film of the same name, this Emmy-nominated horror-comedy follows four peevish bloodsuckers who share an apartment in modern day Staten Island. They’ve contended with chain emails and werewolves. Now season 3 ups the supernatural stakes with gargoyles, sirens, and the allure of Atlantic City casinos. Below we explain how to watch What We Do in the Shadows season 3 online from anywhere now.",
    "At the end of the last season, Latino familiar Guillermo (Harvey Guillén) saved Nandor, Nadja, Colin Robinson and Laszlo from certain death at the Nouveau Théâtre des Vampires. But after turning their captors to dust in a bravura, Buffy-like ambush, the group found out he was descended from Abraham Van Helsing, the infamous vampire hunter.",
    "Season 3 begins with Guillermo’s fate in the balance after the undead quartet are inducted into the ranks of the Vampiric Council. Meanwhile, Colin Robinson (Mark Proksch) celebrates his centenary: something which leads 758-year-old Nandor (Four Lion’s Kayvan Novak) to have a mid-life crisis and redouble his efforts at dating in the modern world.",
    "Matt Berry is back as lusty English nobleman Laszlo Cravensworth, alongside Natasia Demetriou as Romani vampire Nadja. Plus viewers should anticipate some brilliant cameo appearances, given that Tilda Swinton, Wesley Snipes, Danny Trejo, and Evan Rachel Wood all featured in just one prior episode.",
    "Fancy this witches’ brew of gore and guffaws? Then read on as we break down how to watch What We Do in the Shadows season 3 online from anywhere.",
    "If you’re abroad when What We Do in the Shadows season 3 airs, you’ll be unable to watch the show on your usual streaming platform, thanks to annoying regional restrictions.",
    "Luckily, there’s an easy solution. Downloading a VPN will allow you to stream the latest season online no matter where you are. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch What We Do in the Shadow season 3 from anywhere"
  ],
  "headers": {
    "5": "How to watch What We Do in the Shadows season 3 online from outside your country",
    "8": "How to watch What We Do in the Shadows season 3 online in Australia"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}