{
  "source": "https://www.techradar.com/news/best-indie-games-on-pc-and-consoles-2020-the-greatest-hidden-gems",
  "title": "Best indie games on PC and consoles 2021: the greatest hidden gems",
  "category": "gaming",
  "updated": "2021-02-25T01:10:41Z",
  "author": "dan-griliopoulos",
  "summary": "These are some of the best indie games out right now",
  "article": [
    "Don’t underestimate the best indie games. They may not come with the same kind of high-profile launch or level of production as the most popular titles out there, but they can be every bit as entertaining as their big-budget AAA counterparts. Better yet, they can have as much depth as the best AAA games and provide the same level of immersion.",
    "The best indie games can also offer something that their big blockbuster games can’t. Because they’re free to experiment the way AAA games cannot, they can offer a different perspective or a unique type of gameplay, which typically earns them high spots among the best Steam games.",
    "You don't have to have a large corporation footing the bill to put out a game with a great story, visuals, and most especially, gameplay. The best indie games are proof of this, and you owe it to yourself to check them out. From classic examples like Braid and Dwarf Fortress to newer titles like Obra Dinn and Outward, you’re guaranteed to have an amazing time. If you can, experience them on the best gaming PCs for a truly immersive experience.",
    "Who knew Norse purgatory could be so much fun? Whether you want a game where you can explore a procedurally generated world, build your own castles, or just fight monsters, Valheim is the one for you. Throw in some survival elements, like needing to eat a balanced diet, and this game proves to be a deep and multi-faceted one. Not to mention, you can play with up to nine other people on a map.",
    "It’s also a gorgeous game. You can expect to get lost in the game as you explore and level up your character. Valheim is all the more impressive for being an Indie game. In fact, it was made with just a team of 5. Considering the game is in early access, we can only expect an already great game to get better.",
    "If you’re tired of dystopian post-apocalyptic games piling up in your gaming backlog, take a look at Carto. The game is a charming one that makes heavy use of puzzles to unlock and explore the adventure that the title character goes on. Instead of battling monsters, you use her cartography skills to meet and learn about new characters.",
    "Not only is the gameplay unique but its look is as well. The almost hand-drawn look relies more on art than realism, giving it a gorgeous, colorful atmosphere that doesn’t rely heavily on a powerful graphics engine. That’s great for anyone wanting to play Carto on a less-than-powerful machine since you can still boot it up without having the latest and greatest from Nvidia or AMD.",
    "Carto is also a relaxing game. If you’re a fan of games that let you chill out instead of stress out, then dig into this game.",
    "Ooblets has been on our radar for a long time thanks to its charming art style and intriguing concept and as of July 2020 it's finally available in early access. Developed by first-time studio Glumberland and published by Double Fine, the game is a kind of mash up of Pokémon, Harvest Moon and Stardew Valley so if you're a fan of games of that ilk your interest has likely been piqued.",
    "In the game, you can train and battle your ooblets against other ooblet trainers. At the same time, you’ll have to balance your ooblet training with the real-world responsibilities of being a farmer, helping to put your old farmhouse and your town back together. It all comes across as very sweet and gentle, a perfect feel-good antidote to a hard day.",
    "Ooblets early access is available on Xbox and through the Epic Games Store. Being in early access means the game is not in perfect condition just yet and it's not known exactly how long Ooblets will be in early access before it gets its final release.",
    "Who knew an untitled game about a goose could be so fun? A bit of an unexpected hit, Untitled Goose Game quickly went viral after its brand of avian nuisance-making was unveiled to the world.",
    "Set in a dopey village in the English countryside, you play as a goose tasked with terrorizing your human neighbours: stealing their crops, locking them in closets, and honking all the way through. Inspired by the stealth-action series Hitman, but with its own charm, it’s hardly a surprise that the Untitled Goose Game became a huge hit. You'll zip through the game in a handful of hours, but it's very much work throughout the journey.",
    "Taking adorable design cues from titles like Animal Crossing: New Horizons, this innocent-looking PS5 game delivers family-friendly fun with a snack-filled gameplay twist. Created by the same developers behind the hit game, Octodad: Dadliest Catch, this quirky game is also available on PC and Mac, downloadable via the Epic Store.",
    "In Bugsnax, you play as (mostly) bipedal animals and critters that eat food favorites, like fruit and sausages – and oddly become those snacks. Arms will turn into hotdogs, hands will turn into strawberries… that sort of thing. It sounds weird... but entertaining and delicious.",
    "From family-owned and operated Studio MDHR, Cuphead has resonated with millions of people around the world, many of whom normally wouldn’t touch a run-and-gun platformer with a ten-foot pole.",
    "While its gameplay was inspired by classic games such as Mega Man and Contra, most gamers will likely compare it to a Fleischer Studios cartoon like Betty Boop. Because Cuphead uses a hand-drawn art style similar to a 1930s animation, it’s been universally praised for its gorgeous visuals.",
    "Cuphead is more than just its stunning visuals, however. It’s a series of 19 challenging and engaging bosses, with platforming bits interspersed between them. To make matters even better, there's a DLC expected in 2020.",
    "Gris is a beautiful game in so many senses, offering arresting hand-drawn visuals, a stirring soundtrack and a subtle story that manages to engage and resonate without the need for dialogue.",
    "For all that, it's also a fun, side-scrolling platformer with clever and creative puzzles, therefore making it a prime example of how indie games can refresh and invigorate long-standing genres.",
    "Unsurprisingly, Gris has been a big success for developer Nomada Studio and publisher Devolver Digital. You can find it on a host of platforms, including Nintendo Switch, macOS, PC and PS4.",
    "This dark and moody action-adventure stealth game by Asobo Studio is hauntingly beautiful.",
    "Set in the 1340s during the Black Death pandemic in the French countryside, you’re Amicia, a young noble girl whose parents were killed by the Inquisition. You must now traverse battlefields and villages with her brother Hugo to find a cure for his mysterious ailment. Along the way, you must scare away ravenous rats as well as stun (or kill) guards and hostile villagers with your sling and special ammunition supplies.",
    "Despite the ghastliness and rawness of the Middle Ages and the Plague, A Plague Tale: Innocence is a complete stunner and a game who almost never want to end.",
    "Among the hardcore gamers we know, Spelunky is the go-to drug. Even today, several years after its release, some of them still play it consistently, despite having completed it many times over. That's because this ostensibly rogue-like platformer with a definite end is tough, varied and highly randomized.",
    "It also has more dark secrets than a presidential candidate, which means that there are a number of ways to finish it, and its daily challenges are a sure-fire way to public humiliation.",
    "Does humor belong in video games? Well, if the Stanley Parable has its way, it’s a resounding ‘yes’. This game is hilarious without being dumbed down. Players follow (or don’t) a very British narrator who changes the world around you, based on your choices.",
    "No choice is punished, and every playthrough will be fresh with new humor and weird goings-on. In fact, being trapped in the closet in The Stanley Parable is more moving and funny than the majority of other games, indie and otherwise.",
    "If you missed out on this ironic gem back when it first launched, you’ll be happy to know that the developer announced the Stanley Parable Ultra Deluxe edition for 2020, touting fresh content, more endings and a console release. This Ultra Deluxe edition actually sounds pretty tempting, even for us – and we played it a whole lot when it first came out.",
    "It’s no surprise that co-op games have made their way to the indie scene – who wouldn’t want to beat up hordes of enemies alongside friends? One of the best indie co-op games out there is newcomer Deep Rock Galactic, which only officially hit the streets in May 2020. Although it is an infant next to these classics on our list, it’s already built quite a fanbase. That’s how good this game is.",
    "In the game, you’re playing with three others (or you can also play on your own, if you’re a loner) to dig and shoot your way through a procedurally-generated cave network. But, you’re not only battling alien swarms here - there are also resources to collect and a goal to finish. The best part, however, is that there’s no set path so you can complete your mission as creatively as you want, so long as you work together. Well, that and those awesome weapons you can have in your arsenal.",
    "Deep Rock Galactic is simply the coolest co-op FPS game to hit Steam in 2020, and definitely among the best indie games we’ve played this year.",
    "It took more than nine years to make, but Owlboy is certainly worth the wait. Originally designed for PCs and released in late 2016, this clever indie game masterpiece is now available to experience on Mac and Linux as well – and there’s even a Nintendo Switch version! Owlboy revolves around a race of owl-human hybrid characters called, aptly enough, Owls. Of them, you control Otis, an Owl who is censured by his mentor for his inept flying skills.",
    "The story sees Otis’ village destroyed by pirates who have conflict with the Owls. As a result, Otis has to work with an assortment of villagers in-game to take out enemies. Of course, before the boss battles arise, you’ll need to manage allies accordingly, as each character comes with their own set of unique skill sets to use in conjunction with one another. If you’ve ever played and enjoyed a Kid Icarus game, this is one’s for you. If not, well… play it anyway.",
    "Similar to The Stanley Parable, Gone Home falls into the unofficially christened ‘walking simulator’ genre. Where it diverts from the clever and philosophical Stanley Parable, however, is its focus on life’s difficult realities, as opposed to light humor.",
    "After coming home to your childhood house following an overseas visit, you play as 21-year-old Kaitlin Greenbriar who is greeted by an empty house. While gameplay is limited to scavenging through notes to find out where your family is, the compelling story is extremely emotional and gripping, as long as you keep an open mind. After all this time, Gone Home still stands out as one of the best indie games out there.",
    "Only SpaceChem has mixed learning with entertainment as successfully as The Kerbal Space Program. The game is simple - design and build a spacecraft to take the cutesy Kerbals to the Mun and beyond.",
    "Its intelligent use of real physics, however, means that you'll find yourself following NASA as you’re building multi-stage rockets and space stations as well as exploring the Kerbal's strange universe on EVAs, before bringing your discoveries back for research on the Kerbal planet - that's if you can get off the ground at all. It's a huge, complex, challenging and fun game that manages to be super smart without being preachy.",
    "The Binding of Isaac: Rebirth is the exact opposite of something like Kerbal Space Program – it’s an action roguelike par excellence. You play as a young boy forced to kill his damned siblings, mother and possibly the Devil, using only tears that he shoots from his eyes, naturally. This indie games is matched only by the equally visceral Nuclear Throne. With dozens of weird items to collect, endless procedurally-generated levels and many secrets, the Binding of Isaac is a very dark take on the exploratory model established by Spelunky.",
    "Don’t let its pixel art graphics put you off – Undertale isn’t a game that would have fit on the Super Nintendo. That’s because, in Undertale, the decisions you make have a huge impact on how the game ends and, more importantly, how it continues in New Game Plus.",
    "While playing Undertale, you’ll realize just how much freedom the game gives you. Despite its highly inspired and very intense boss matches, you’ll make it through the entire nine or so hours of Undertale as a total pacifist, if you choose to. Plus, when you go through the game a second time, you’ll bear the weight of the consequences from your previous run. What’s even better is that Undertale is out now on the Nintendo Switch, so you can take this masterpiece of game design wherever you go.",
    "From developer Playdead, Inside is very much like its predecessor, Limbo, in some ways, only with an added layer of depth that often inspires wonder. This is mostly a result of the unspoken narrative, which revolves around yet another nameless boy. In Inside, the boy is running away from a group of men who – if you fail to stay out of their sights – will try to mercilessly kill you.",
    "It isn't quite clear why the boy is running from these men or why you should even care since you don't know who he is, so Inside will leave you begging for answers. The bleak, lifeless setting of Inside is more than worth the price of admission. Its minimalist art style alone is avant-garde enough to feel right at home in a museum. Factor in the fact that this game is both fun to play and dripping with curiosity, and you won’t doubt that Inside is one of the best indie games money can buy.",
    "Developed single-handedly by Eric Barone, Stardew Valley is a technical feat for that little fact alone. If you’ve ever played a Harvest Moon game, you’re already familiar with its premise – you may just not know it yet. Stardew Valley is an addictive farming simulator, which lets you interact with townees to the point where you can literally marry them.",
    "Stardew Valley isn’t just farming, however – it’s a whole bunch of other things at the same time. You can go fishing, you can cook, you can craft stuff. You can even go explore procedurally-generated caves to mine for items and even fight slime-monster-things. You should keep in mind that your health and energy are finite however, so you'll want to keep your character rested and fed to avoid suffering from exhaustion. Pass out, and you’ll lose a considerable amount of money and items you’ve worked hard to attain. Stardew Valley will have you playing for hours on end, for better or worse. (Definitely better.)",
    "From Canadian game developer Alec Holowka, creator of the award-winning Aquaria (also featured on this list), and independent artist/animator Scott Benson, Night in the Woods is an unconventional side-scrolling adventure game that revolves around a 20-year-old protagonist named Mae who drops out of college and moves back in with her parents.",
    "Featuring a story largely based around dialog choices and mini games that put a spin on mundane tasks, like carrying boxes up the stairs and eating perogies, Night in the Woods is a timeless coming-of-age tale. Not only will you experience middle class America through the eyes of a personified cat, but virtually every interaction in-game will have you laughing aloud. And now that it’s available on the Nintendo Switch, you can take it wherever you go.",
    "If you’re a fan of games inspired by Dark Souls, you’ll absolutely love Hollow Knight. You take control of the Hollow Knight, and lead them through the deceptively adorable landscape to take on bosses and other difficult challenges. Much like Dark Souls, it’s not immediately clear what you’re actually supposed to be doing as the narrative is intentionally obtuse.",
    "The Dark Souls inspirations don’t end there, either. It also embraces Dark Souls’s ‘tough but fair’ philosophy, and the game is only as hard as you make it. In fact, you can overcome anything as long as you have patience and learn from your mistakes. Hollow Knight takes these lessons from Dark Souls and injects them into a Metroidvania, with all the side-scrolling and upgrades you could possibly want. You can even play it on the Nintendo Switch now.",
    "If you’re looking for a game that’s as unforgiving as it is fun, look no further than Dead Cells. It takes gameplay inspiration from so many places – from roguelikes to MetroidVania. There’s even a hint of Dark Souls in there, creating a unique action game that will test your limits and skills.",
    "Each time you play this game, it will feel new. And, while you’ll lose some progress each time you die – and you will die a lot – the game will become even more rewarding as the complex and fluid combat becomes second nature. In the final release of the game, you get access to over 90 weapons, skills and abilities that will let you tailor your gameplay however you want.",
    "Whatever you do, don’t get discouraged if you fail. Get up and try again, as Dead Cells will only reward you in the end.",
    "Dwarf Fortress is its own genre and its own industry. This is a game that has to generate the entire geography, mythology and history of its massive world before you set foot in it. It then tracks every single one of the dwarfs you're managing down to the hairs on their legs, and the particular horrible elephant murder that they’ve witnessed and are now carving on an ornamental chair.",
    "Your task is simple: to keep the dwarves alive as they carve out their subterranean kingdom. Though given that insanity, monsters and starvation plague them at every stage, it isn’t easy. Plus, dwarves, always, always mine too deep.",
    "Run. Jump. Die. Repeat. That’s basically the gameplay loop of Super Meat Boy, a fiendishly addictive 2D platformer that’s also bloody hard, with an emphasis on bloody. Gallons of blood is spilled as the game’s eponymous meaty hero leaps over deadly drops, spinning saws and walking chainsaws in a bid to rescue his girlfriend, Bandage Girl, from the evil Dr Foetus. Obviously.",
    "With solid controls, lots of humor and vibrant graphics, Super Meat Boy leapt onto the PS4, Vita, and Nintendo Switch in style.",
    "It might not be Playdead’s most recent game, but Limbo is eternal. Five years after its release, and the game’s haunting storyline still has an effect on us. You play the Boy, a child with glowing eyes who is cast into Limbo to find his sister. Making your way through a bleak and dangerous world full of hostile silhouettes, giant spiders and deadly gravitational fields, you’ll need to think on your feet and perfectly time your movements, if you were to survive.",
    "Limbo is much more than a simple platformer: it's an experience, and one that will have you pondering the very essence of life by the time you finish. Deep, profound and absorbing, it's among the best indie games that everybody should take time out to play.",
    "If you're looking for a retro-inspired multiplayer archery combat game (aren't we all?), TowerFall: Ascension is the pick of the lot. Fast, frenetic and teeth-gnashingly hard in hardcore mode, the game's mechanics are simple: fire arrows at your enemies or jump on their heads to stay alive until the round ends.",
    "Arrows that don't hit are embedded in walls, making for tense scenarios when you have to traverse the map while dodging enemies to retrieve them. As such, practicing until you achieve Robin Hood-esque levels of accuracy is key. Ascension is best experienced with friends in local multiplayer mode, which is reminiscent of Super Smash Bros' most manic moments.",
    "It’s not often that a platformer is able to balance challenging and engaging gameplay with an emotional and thought-provoking narrative. Celeste, however, pulls it off, making it one of our best indie games picks. From the developers of Towerfall, Celeste follows the story of Madeline, a young girl who decides to face her mental health issues by climbing to the top of the mysterious Celeste Mountain. In doing so, she learns more not only about the mountain, but about herself as well throughout the process.",
    "An inevitable classic, Celeste integrates the obvious jump, air-dash and climb controls into a brutal series of platforming challenges in upwards of 700 unique screens. If that’s too easy, you’ll unlock B-side chapters along the way, designed for only the most intrepid of hardcore players. You don’t even have to worry about waiting an eternity between each respawn, as Celeste brings you back from the grave in an instant, a welcome departure from the typically extensive load screens.",
    "Have you ever wanted to land on an alien planet, and build a factory? Yes, it’s an unusual premise, but we promise that it works in Satisfactory. You’ll land on one of three planets of varying difficulty, where you’ll be tasked with building and automating a factory to exploit the world around you.",
    "The premise sounds bland, but being able to roam these beautiful worlds in first person while scavenging materials and fighting off hostile wildlife makes it all that more exciting. Plus, is there anything better than sitting back and admiring something you worked hard on?",
    "Satisfactory is in early access right now but if you can get past all that, you’re sure to get hours of wholesome simulation out of it.",
    "After the raging success that was the original Nidhogg, it’s a shame to see the superior sequel get thrown under the bus. Nevertheless, despite its controversial art style, Nidhogg 2 packs a refined, stunning look that the first version, a cult-classic, wouldn’t dare compete with, which is one of the reasons why it’s on our best indie games list.",
    "In still frames, we can see how this could get misconstrued, but fortunately, it’s the fun and addictive local multiplayer gameplay that makes Nidhogg, well, Nidhogg. And it’s all there in Nidhogg 2. Additionally, every time you respawn, you get one of four unique weapons that only bolster the challenge.",
    "Esteemed indie designer Jon Blow's follow up to Braid may look like a wholly different adventure, being 3D and all. However, the two are more thematically alike than you might think. The Witness, at its core, is another puzzle game that tells an absorbing story through said puzzles.",
    "This puzzler takes place in an almost equally impressionist – albeit heavily Myst-inspired – world, but it's story is far more nuanced and mysterious than Blow's earlier work. At almost every corner of this island that you've simply woken up on (or beneath), there is a clue as to how you got onto this island and why you're here.",
    "Don’t get us wrong, we liked Bastion. Still, we can’t deny that Transistor was SuperGiant Games’ best work to date – not to mention, one of the best indie games to hit the streets today. Much of that has to do with the combination of action-based and turn-based RPG elements contained within its cyberpunk futurescape. Likewise, in classic SuperGiant fashion, those mechanics are complemented with a stunning art style and a music score so stunning it’ll make you want to buy the soundtrack.",
    "Leaving key gameplay beats up to the player, the story isn’t so variable. Transistor’s main character, Red, is a renowned singer in the city of Cloudbank. However, she’s been attacked by a group of vicious robots who call themselves the Process, operated by another group called the Camerata. In her journey, she finds the Transistor, a mysterious sword with the voice of a man. Soon enough, she’ll learn more about him and how he will shake up her world.",
    "It’s weird to think that Oxenfree came out before the first season of Stranger Things, and yet, the two coincidentally have a lot in common. The 80s-inspired heavy synth music composed by scntfc, for one, highlights some truly gripping sci-fi horror revolving around – you guessed it – a group of teenagers stuck on an island.",
    "The story involves a handful of uniquely written characters, namely the main character Alex, along with her stoner friend Ren, her newfound stepbrother Jonas, her dead brother Michael’s ex-girlfriend Clarissa and her best friend Nona, with whom Ren happens to be in love with.",
    "The plot is explained through branching speech dialogues, kind of like Life is Strange or modern-day Telltale games, and it offers five different endings depending on your choices.",
    "Exploring a surreal wilderness seems to be the trend these days – and not just in real life. Developer Campo Santo's debut, Firewatch, only serves to keep it going in gaming. Set in the wilderness of 1989 Wyoming, you're playing Henry, a fire lookout that's all alone in the woods after exploring something strange in the distance.",
    "That is, except for your partner on the other line of a walkie-talkie: Delilah. She's your only point of contact as you explore the wilderness. Will you make it back alive? Will the decisions you make help or harm the relationship with your only lifeline to the outside world, your boss? But don't worry about those questions just yet – as with any adventure in the Great Outdoors, take some time to appreciate those forestscapes first!",
    "Rust is one of the more successful indie titles – not to mention, one of the best indie games – of recent times. By the end of 2015, it had sold more than 3 million copies. That’s not too shabby considering it wasn’t even finished — the game has been on Steam's Early Access scheme since being released in December 2013.",
    "It seems people can't get enough of the Day Z-inspired survival sim. It sees you use your wits and bearings to survive its harsh open world, with nothing but a rock… at least, in the beginning. After gathering the resources you need to build a house and weapons to fend off attackers (other online players, in other words), Rust progressively becomes more intense as you defend your growing base — or attempt to breach others'.",
    "Fans of the original Overcooked will not be disappointed by its second installment in the chaotic couch co-op series from British indie game developer Team17.",
    "This time around, your mission is to defeat the 'Un-Bread' (zombie baked goods) that have taken over the Onion Kingdom, by battling through brand new recipes including sushi, pizza and burgers in increasingly chaotic kitchens with up to three other people.",
    "To add to the frenetic fun, you must deal with obstacles including random fires, collapsing floors and interfering passers by, all while getting your orders out to the pass in time.",
    "Things get complicated incredibly quickly. Relationships, friendships and family bonds will be tested as you work together to complete your recipes on time. Overcooked 2 is a fun and challenging couch co-op game that will make you truly understand the meaning of \"too many cooks spoil the broth” and is well-deserving of its spot in our best indie games list.",
    "The natural progression of survival games, SCUM takes what predecessors like Rust and PlayerUnknown’s Battlegrounds both succeeded at, only better by iterating in impressive ways. It offers a unique twist, combining the frenetic gameplay of battle royale games with the slow, thoughtful tactical of a survival sim.",
    "SCUM, unlike other similar games, is very heavy on the simulation side of things, however. You shouldn’t expect to run in guns blazing, as you’re going to get tired quickly (just as you would if you tried running outside in person with a ton of stuff in your backpack). But, if heavy statistic systems is something your into, this might be one of the best indie games for you. It’s like spreadsheets with a physics engine.",
    "Just don’t go in expecting a polished experience, not for now. However, developer Croteam promises to add more features over time, and as they’re backed by Devolver, you can trust that the game is going to shape up into something great.",
    "Every so often, there’s a game that perfectly balances aesthetic, gameplay and narrative – where everything feels like it just fits like puzzle pieces. The best indie games always excel at this, and Return of the Obra Dinn is the epitome of that. A mystery taking place on a derelict ship, your mission is to figure out how the crew of this lost ship died, disappeared or worse.",
    "The entire game has this old-school visual styling that, combining it with the simple controls and gameplay technique that make it feel like a nostalgic sort of adventure. Right from the settings menu, you’ll get to choose what kind of monitor you’d like to emulate – we picked an old school Macintosh option – that should give you an idea of the type of retro revivalism on offer here.",
    "Critical thinking, exploration and a ton of reading is essential in Return of the Obra Dinn. If that all sounds appealing to you, and you’re happy with retro aesthetics, you will love this game. In fact, it’s one of the best indie games in a season marked with AAA decadence.",
    "If you’re anything like us, you’ve probably spent hundreds of hours playing Roller Coaster Tycoon during your childhood. These days, while there have been plenty of amusement park simulators over the last few years, they’ve never quite hit that spot. That is, until Parkitect.",
    "Parkitect might just be the closest we have to those early aughts park simulators currently, and we’re absolutely in love. From the cartoonish art style to the realistic simulation and Steam Workshop integration, Parkitect is one of the best indie games 2020 has to offer.",
    "For years, thatgamecompany has been behind some of the best indie games on the market, but most of them had been exclusive to PlayStation. One such game was Flower. Serving as a kind of a precursor to the beloved Journey, Flower puts you in command of a flower petal, surfing through the wind.",
    "You’ll activate different colors of flower beds to affect the environment, which will also get you different colored petals, until you have an entire trail of color surfing the wind. It’s an incredibly relaxing and creative experience, which also gives you an insight on the industrial world we all find ourselves living in. Trust us, give it a shot as it’s one of the best – not to mention, most legendary – indie games ever."
  ],
  "headers": {
    "3": "Valheim",
    "5": "Carto",
    "8": "Ooblets",
    "11": "Untitled Goose Game",
    "13": "Bugsnax",
    "15": "Cuphead",
    "18": "Gris",
    "21": "A Plague Tale: Innocence",
    "24": "Spelunky",
    "26": "The Stanley Parable",
    "29": "Deep Rock Galactic",
    "32": "Owlboy",
    "34": "Gone Home",
    "36": "Kerbal Space Program",
    "38": "The Binding of Isaac: Rebirth",
    "39": "Undertale",
    "41": "Inside",
    "43": "Stardew Valley",
    "45": "Night in the Woods",
    "47": "Hollow Knight",
    "49": "Dead Cells",
    "52": "Dwarf Fortress",
    "54": "Super Meat Boy",
    "56": "Limbo",
    "58": "Towerfall: Ascension",
    "60": "Celeste",
    "62": "Satisfactory",
    "65": "Nidhogg 2",
    "67": "The Witness",
    "69": "Transistor",
    "71": "Oxenfree",
    "74": "Firewatch",
    "76": "Rust",
    "78": "Overcooked 2",
    "82": "SCUM",
    "85": "Return of the Obra Dinn",
    "88": "Parkitect",
    "90": "Flower"
  },
  "links": {
    "best Steam games": "https://www.techradar.com/news/the-best-steam-games",
    "best gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Valheim": "https://store.steampowered.com/app/892970/Valheim/",
    "Carto": "https://store.steampowered.com/app/1172450/Carto/",
    "Animal Crossing: New Horizons": "https://www.techradar.com/reviews/animal-crossing-new-horizons",
    "co-op games": "https://www.techradar.com/news/best-co-op-games-2020-top-games-you-can-share-with-friends-on-console-and-pc",
    "Dead Cells": "https://store.steampowered.com/app/588650/Dead_Cells/",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Satisfactory": "https://epicgames.com/store/en-US/product/satisfactory/home",
    "SCUM": "https://store.steampowered.com/app/513710/SCUM/",
    "Return of the Obra Dinn": "https://store.steampowered.com/app/653530/Return_of_the_Obra_Dinn/",
    "Parkitect": "https://store.steampowered.com/app/453090/Parkitect/"
  }
}