{
  "source": "https://www.techradar.com/news/apple-arcades-latest-game-nuts-is-like-firewatch-for-david-attenborough-fans",
  "title": "Apple Arcade's latest game Nuts is like Firewatch for David Attenborough fans",
  "category": "gaming",
  "updated": "2021-03-04T09:25:17Z",
  "author": "gerald-lynch",
  "summary": "A walking simulator for squirrel-skeptics...",
  "article": [
    "Firewatch for David Attenborough? Pokemon Snap with added squirrel action? However you want to describe Nuts, a single player surveillance mystery, this week’s new addition to Apple Arcade, and soon to hit PC via Steam, one thing’s for certain – you’ll never quite feel the same about squirrels ever again.",
    "You’re reading Download This, TechRadar’s new weekly guide to the must-have downloads to fill your phones, tablets, consoles and computers with. Games, eBooks, albums, apps or movies – we’ve got you covered.",
    "To those who have ever tried to win a staring competition with a squirrel (haven't we all?), you'll know there's something else going on behind those obsidian peepers. If they're not Avenger-dropping out of trees, they're burying nuts in secret stashes – the only land mammal known to hide, rather than scoff, its Christmas treats. We may never know precisely what the squirrel army is planning (and whatever it is, you can bet it isn't good), but Nuts will let you peer maybe just a little deeper into what makes those jumped up rats tick.",
    "A first-person adventure made by Joon, Pol, Muuutsch, Char & Torfi, you’re a rookie field researcher from Viago University, sent to the remote Melmoth Forest to observe the increasingly-bizarre behaviour of the woodland’s native squirrel population. With a big business looking to level the area to make way for luxury accommodation (what I like to call the 'Goonies' Call to Arms'), you’ll soon find yourself on the scent of a mystery that could shake everyone involved.",
    "So how do you go about uncovering the truth? No, not with a pocket full of sunflower seeds, but instead by laying traps of the photographic kind. Your boss, Dr Nina Scholz, will call the cabin every now and again, giving direction to your lonely days, steering you towards where the squirrels might be holding court, and what they might be planning. It’s then up to you to take your in-game DSLR and tripod and stake out the best spots to catch a glimpse of the squirrels, making sure your cameras can cover off any path the squirrels may take – the Pine Tree Paparazzi.",
    "You’ll leave the footage recording overnight, then assess it for clues the next day, faxing still shots to Scholz in order to piece together the intentions of the nut-stashing rodents.",
    "There’s a lovely, methodical rhythm to proceedings – excellent sound design lets you get lost in the forest, moving at your own pace to enjoy the tranquil scenery and figure out how best to set up the day’s shot. At a time when the outside world is closed off to many of us, being able to trek through a stylised forest, separated from the horrors of both work-from-home claustrophobia and real-world Covid-angst is refreshingly meditative – even if the tranquility is punctuated by some rather strange goings-on.",
    "Some light point-and-click style elements are littered throughout too – you won’t be able to even get started until you’ve filled the cabin’s generator from a jerry can, while fully voice-acted conversations with Scholz help you better understand the more personal side of the story.",
    "It’s also a gorgeous looking game. There’s an inky, hand-drawn-sketch feel to the art style, with stark outlines to objects and highly-contrasting pastel colors bringing your attention to points of interest around the forest. It’s like a playable Instagram filter (and that’s said without any of the condescension that association with the social network might imply), letting me remember, if only for a moment, that a time and a season will one day exist where I can not only see the brown leaves of autumn, but trudge through them like a five year old, too.",
    "One thing to be aware of though is performance issues on older hardware. Played on a first-generation iPad Pro 9.7, Nuts suffered from a choppy framerate that could make some its finer interactions a little laborious, at least when paired with a DualShock 4 PS4 controller. That might not be such an issue when playing on newer devices (or using the game’s touchscreen controls, rather than on-screen cursor, to interact with smaller buttons and details). But be aware that mileage will vary from device to device.",
    "Still, there’s a great, slow-burn mystery feel to proceedings here. If you’ve played a few so-called ‘Walking Simulators’, it’ll feel familiar, but the surveillance mechanic adds something new to the genre. Apple Arcade, with its first birthday well behind it now, continues to drip insightful and unusual adventures out to its subscription service at a cadence weighted with pinpoint accuracy, enough to keep your finger well clear of that unsubscribe button. Just remember however that a game all about squirrels might not be as cute as it first appears to be…"
  ],
  "headers": {},
  "links": {
    "Apple Arcade": "https://www.techradar.com/best/best-apple-arcade-games",
    "Download This": "https://www.techradar.com/tag/download-this",
    "Joon": "http://joon.be/",
    "Pol": "https://polclarissou.com/",
    "Muuutsch": "http://almutschwacke.de/",
    "Char": "http://alphachar.com/",
    "Torfi": "https://twitter.com/torfias",
    "Goonies' Call to Arms": "https://www.google.com/search?q=goonies+plot&oq=goonies+plot&aqs=chrome..69i57j0l2j0i22i30l3j69i64.2844j1j4&sourceid=chrome&ie=UTF-8",
    "iPad Pro 9.7": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-pro-9-7-1317466/review",
    "DualShock 4 PS4 controller": "https://www.techradar.com/news/gaming/consoles/dualshock-4-deals-find-a-cheap-ps4-controller-today-1298590"
  }
}