{
  "source": "https://www.techradar.com/news/intel-ceo-suggests-its-gaming-gpus-will-be-a-serious-threat-to-nvidia",
  "title": "Intel CEO suggests its gaming GPUs will be a serious threat to Nvidia",
  "category": "computing",
  "updated": "2021-09-06T09:54:22Z",
  "author": "darren-allan",
  "summary": "Intel Arc graphics cards set to “really put pressure on Nvidia”",
  "article": [
    "Intel’s CEO Pat Gelsinger has been talking up Team Blue’s incoming processors and discrete graphics cards, insisting that the latter is set to give Nvidia a real run for its GPU money.",
    "Gelsinger made various comments stoking the hype train in an interview with financial analyst Pierre Ferragu, as Wccftech reports, and that included the aforementioned warning shot at Nvidia.",
    "Gelsinger said: “We have our GPU architecture where we are gonna start being in a position to really put pressure on Nvidia for the first time ever.”",
    "That is, of course, a reference to Intel Arc GPUs which are the firm’s discrete high-end graphics cards that are expected to arrive in Q1 of 2022. These cards will, of course, go up against AMD as well as Nvidia, but it’s the latter that very much holds the lion’s share of the desktop graphics card market.",
    "Gelsinger further asserted that incoming Alder Lake processors, which are due to debut later in 2021 – the rumor mill believes we’re looking at an October launch, then mid-November on-sale date – will offer something special too, and indeed a step forward in line with the one AMD took with its original Zen processors.",
    "When interviewer Ferragu asks about whether there’ll “be a Zen moment for Intel”, Gelsinger replies: “We have a number of things going on over here ... We are rolling out the heterogenous architecture that is part of Alder Lake where we have big and little cores, you know AMD only has one. We’ll have a higher performance and a more energy-efficient version of the core, pretty compelling…”",
    "Of course, AMD believes that it only needs one type of core (at least for now), but still, there’s no doubting that what we’ve been hearing about Alder Lake performance does indeed sound enticing.",
    "Gelsinger further boasts that there are other major architectural developments “cooking back in the labs” for the future that are a “pretty dramatic step forward and well beyond anything that was talked about yet”.",
    "Some of those innovations won’t be unveiled for a couple of years, though, he observes, so it would seem a good bet that he’s referencing Meteor Lake here, which will be Intel’s big move to 7nm expected to happen in 2023 if things stay on track.",
    "Naturally, it’s the CEO’s job to talk up the prospects of their company and incoming products, but it’s clear enough that Intel is now on a push to start seriously hyping the incoming Intel Arc GPUs, following the recent official announcement of the discrete graphics cards (and some further revelations around the branding of these offerings).",
    "The indication that Intel is aiming squarely at Nvidia to ‘really’ put some pressure on Team Green is ambitious, for sure. What we don’t know is how that pressure will be applied – and what we might hope for is that Intel’s attack could come at least partially on the pricing front. Frankly, the cost of graphics cards has got pretty ridiculous in recent times, and the rumor mill reckons that Nvidia’s next-gen cards – due to turn up later in 2022 (maybe very late) – might be even pricier.",
    "At the very least, having a third player in the market and more discrete gaming GPUs on the table will be a massive boon just purely in terms of increased choice and stock levels, particularly as we keep hearing that the chip shortage might drag on and on throughout 2022, and maybe even into 2023…"
  ],
  "headers": {
    "9": "Analysis: GPU pressure on the pricing front, maybe?"
  },
  "links": {
    "processors": "https://www.techradar.com/news/best-processors",
    "Nvidia": "https://www.techradar.com/news/nvidia-geforce",
    "Wccftech": "https://wccftech.com/intel-ceo-says-alder-lake-cpus-will-have-three-major-amd-zen-like-architectural-announcements-arc-alchemist-xe-hpg-gpus-to-put-pressure-on-nvidia/",
    "that are expected to arrive": "https://www.techradar.com/news/intel-arc-unveiled-but-how-will-it-stack-up-against-nvidia-and-amd",
    "Alder Lake processors": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "we’re looking at an October launch": "https://www.techradar.com/news/intel-hints-at-october-27-launch-for-alder-lake-cpus-so-amd-might-want-to-get-its-skates-on",
    "mid-November on-sale date": "https://www.techradar.com/news/intel-alder-lake-cpus-could-go-on-sale-november-19",
    "what we’ve been hearing about Alder Lake performance": "https://www.techradar.com/news/intels-alder-lake-cpus-could-be-gaming-powerhouses-eventually",
    "Intel’s big move to 7nm expected to happen in 2023": "https://www.techradar.com/news/watch-out-amd-intels-finally-powering-towards-7nm-as-meteor-lake-cpu-design-comes-together",
    "recent official announcement": "https://www.techradar.com/news/intel-arc-unveiled-but-how-will-it-stack-up-against-nvidia-and-amd",
    "further revelations around the branding of these offerings": "https://www.techradar.com/news/intel-arc-gpus-kick-off-with-the-alchemist-which-weve-just-caught-a-glimpse-of",
    "might be even pricier": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-could-turn-up-earlier-than-expected-in-2022",
    "maybe even into 2023": "https://www.techradar.com/news/global-chip-shortage-could-drag-on-until-2023"
  }
}