{
  "source": "https://www.techradar.com/news/wfh-phishing-threats-are-on-the-risk",
  "title": "WFH phishing threats are on the rise",
  "category": "computing",
  "updated": "2021-01-22T16:24:07Z",
  "author": "barclay-ballard",
  "summary": "Phishing emails utilize some common methods",
  "article": [
    "New research has supported previous assertions that phishing attacks are increasing in response to the number of employees working from home.",
    "A new report by cybersecurity training provider KnowBe4 has revealed a concerning surge in phishing attempts across the fourth quarter of 2020.",
    "The new report also outlined which phishing methods were likely to prove most effective. Based on KnowBe4’s simulated phishing tests, LinkedIn-related content was the most effective social media messaging used in phishing campaigns, deceiving 47% of recipients. In addition, 25% of individuals were tricked by email messages urging them to change their password.",
    "As part of its simulated phishing attempts, KnowBe4 used a variety of email subject lines. These included “Password Check Required Immediately,” “Vacation Policy Update,” “COVID-19 Remote Work Policy Update,” and “You have been added to a team in Microsoft Teams.”",
    "In-the-wild phishing attempts made across the fourth quarter were also analyzed and covered similar themes, with popular subject lines including “Twitter: Security alert: new or unusual Twitter login,” “Amazon: Action Required | Your Amazon Prime Membership has been declined,” and “Zoom: Scheduled Meeting Error.”",
    "Evidently, threat actors are attempting to leverage the disruption caused by home working to add legitimacy to their phishing attempts. As businesses and individuals continue to get used to the “new normal,” it seems that cyberattackers will continue to exploit the situation.",
    "“It’s no surprise that phishing attacks related to working from home are increasing given that many countries around the world have seen their employees working from home offices for nearly a year now,” said Stu Sjouwerman, CEO of KnowBe4.",
    "“Just because employees may be more used to their home office environment doesn’t mean that they can let their guard down. The bad guys deploy manipulative attacks intended to strike certain emotions to cause end-users to skip critical thinking and go straight for that detrimental click.”"
  ],
  "headers": {
    "3": "Change the subject"
  },
  "links": {
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it"
  }
}