{
  "source": "https://www.techradar.com/news/google-and-intel-partner-to-accelerate-5g-app-deployment",
  "title": "Google and Intel partner to accelerate 5G app deployment",
  "category": "computing",
  "updated": "2021-02-24T14:41:17Z",
  "author": "steve-mccaskill",
  "summary": "Google and Intel to combine expertise to help push 5G",
  "article": [
    "Google is partnering with Intel to create reference architectures and tools that will make it easier for operators to deploy 5G and edge applications.",
    "The ultrafast speeds, enhanced capacity, and ultra-low latency of 5G will allow mobile networks to power mission-critical applications for the first time and facilitate the creation of entirely new use cases.",
    "However, operators must rearchitect networks away from centralised, legacy core infrastructure and towards the cloud if they are to achieve these characteristics.",
    "By virtualising network functions, operators can rollout new services more rapidly, dynamically allocate resources to where they are most needed, and bring processing capabilities closer to the point of collection. This decentralisation also allows for the deployment of edge services that can revolutionise industries and public services.",
    "This architectural shift has accelerated convergence between the telecoms and technologies industries in recent years as vendors from both spheres collaborate to create joint-offerings that mix and match various IT and network technologies.",
    "Google itself has announced plans to deliver more than 200 partner applications from the edge and created Anthos for Telecom as a platform for delivering workloads to the edge on Google Cloud.",
    "“We believe that by partnering across the telecommunications stack—with application providers, carriers and communications service providers, hardware providers, and global telecoms—we can decrease the cost and time-to-market needed for the telecommunications industry to shift to cloud-native 5G, and open new lines of business for communications service providers as they deliver cloud-native 5G for enterprises.”",
    "This latest collaboration will see the creation of tools to facilitate the deployment of virtualised Radio Access Network (vRAN) and Open RAN technologies that will allow operators to deliver the necessary performance for mission critical applications.",
    "Software-based vRAN provides greater efficiency, flexibility and scalability, simplifying network rollouts and enabling cost savings. Meanwhile, Open RAN technology allows operators to mix and match products from different vendors, benefiting from innovations and reducing vendor lock in.",
    "The combination of Google’s Cloud infrastructure and Anthos for Telecom platform along with Intel’s FlexRAN and OpenMESS will make it easier to deploy vEAN at scale, while a joint network functions validation lab will allow operators to test core network functions so they can optimise their applications strategy.",
    "The two companies believe this will accelerate the deployment of 5G applications and ensure the advantages are realised as soon as possible. Businesses and customers benefit from better services, while operators gain additional revenues.",
    "“The next wave of network transformation is fuelled by 5G and is driving a rapid transition to cloud-native technologies,” added Dan Rodriguez, general manager of Intel’s Network Platforms Group.",
    "“As CSPs build out their 5G network infrastructure, our efforts with Google Cloud and the broader ecosystem will help them deliver agile, scalable solutions for emerging 5G and edge use cases.”"
  ],
  "headers": {
    "3": "Google Cloud Intel 5G"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}