{
  "source": "https://www.techradar.com/news/outriders-patch-is-here-early-at-least-on-pc-and-playstation",
  "title": "Outriders patch is here early – at least on PC and PlayStation",
  "category": "gaming",
  "updated": "2021-04-14T14:32:31Z",
  "author": "darren-allan",
  "summary": "Delivers crossplay between those platforms, but Xbox gamers are still waiting",
  "article": [
    "Outriders has got its first major patch slightly earlier than expected, fixing a number of bugs including some crossplay issues, although it has only arrived for PC and PlayStation – with Xbox gamers still waiting on its debut.",
    "The big patch (with notes provided on Reddit) now allows PC gamers and those on the PlayStation to team up, but with the patch not arriving on Xbox, crossplay between Xbox and PC/PlayStation isn’t yet possible.",
    "On the subject of the Xbox patch, Square Enix notes that it’s “a little bit delayed”, so hopefully should be imminent (although to be fair, the patch itself was originally scheduled for next week, so has turned up earlier than expected on the other platforms).",
    "Square Enix states: “We are hoping to have this patch ready for Xbox very soon and will update you the moment we have news.”",
    "There’s no mention of the status of the patch on Google Stadia.",
    "The other big changes are better stability for matchmaking, and a host of fixes for various crash bugs, including random crashes, with Square Enix observing: “We are confident that these fixes will address the majority of crashes reported, as there are only a handful of root causes but the crashes they generate appear in a number of places.”",
    "A load of other glitches have been cured, including the HUD disappearing and players getting stuck or falling through the world.",
    "Those playing Outriders on the PC will also doubtless be pleased to hear that a performance issue where the graphics card wasn’t being fully used has been solved, and Square Enix says that this “should help with stuttering and DX11/12 issues”, which have been well-documented.",
    "Fingers crossed that this is indeed the case, although we have seen some complaints that stuttering is still a problem post-patch – although Square Enix didn’t say this was a definitive fix (it ‘should help’). Some folks are still complaining about crashing, too, and the nasty inventory wipe bug isn’t addressed here, so there’s still work to do – and of course the Xbox rollout of this first patch.",
    "Square Enix says: “Additional fixes and changes are being worked upon to be delivered via our later follow up patch.”",
    "Via Windows Central"
  ],
  "headers": {
    "7": "Stutter solution"
  },
  "links": {
    "Outriders": "https://www.techradar.com/reviews/outriders-review",
    "Reddit": "https://www.reddit.com/r/outriders/comments/mmrf7d/outriders_post_launch_dev_news_updates/gtt1efp/",
    "originally scheduled for next week": "https://www.techradar.com/news/outriders-patch-scheduled-for-next-week-launch-window-players-getting-free-loot",
    "nasty inventory wipe bug": "https://www.techradar.com/news/outriders-inventory-wipe-bug-remains-unfixed-and-a-seriously-scary-prospect",
    "Windows Central": "https://www.windowscentral.com/first-outriders-patch-releases-today-pc-players-xbox-follow-soon"
  }
}