{
  "source": "https://www.techradar.com/news/the-best-steam-games",
  "title": "The best Steam games 2021",
  "category": "computing",
  "updated": "2021-09-28T12:29:18Z",
  "author": "dom-reseigh-lincoln",
  "summary": "New gems and bona fide classics",
  "article": [
    "Steam’s catalogue is massive and extensive, touting over 23,000 PC games and growing, many of which will appeal to your discerning tastes. Still, narrowing down that list to the best games on Steam that will give that new gaming PC a good workout is a bit of a tall order, especially since it’s impossible to test every single game and give each a fair chance at a spot.",
    "But, we try, finding the most talked about games as well as the most recent releases and taking them on to see if their gameplay, graphics, and overall experience are up to your high standards. Choosing the best games Steam has to offer is a tough job, but somebody’s gotta do it.",
    "From the best MMO games and the best open world games to the best co-op PC games to play with friends, we’ve gathered all the greats Steam has to offer. Whatever type of gamer you are, whether you’re looking for something new or a time-tested classing, you’ll find the best Steam game for you on this list. Get ready for an epic adventure.",
    "The newest entry in this terrifying series, Resident Evil 8 moves away from just zombies by putting you, as Ethan Winters, in the middle of a village filled with all sorts of mutated enemies to find his kidnapped daughter. Whether it’s facing off against werewolf-like creatures or running away because you’ve run out of ammunition, the newest Resident Evil keeps everything that made the original games so engaging and frightening while placing you in an exotic setting reminiscent of a snow-covered Trannsylvania. And, since this game is a direct sequel to Resident Evil 7, if you’ve been keeping up with the series, you’ll want to give this a go. Just make sure to turn the lights off first.",
    "Groundhog Day has never been so fun. Deathloop is kind of like the 90s movie, but in game form. It’s a stylish first-person shooter from Arkane Lyon with a fun little twist and some strategy. You play as Colt, an assassin who’s stuck in a time loop and on an island with a rival. And, your objective is to break that time loop. Sounds easy enough? Not quite, as you need to kill eight key targets before the day ends and starts over again. Luckily, every new cycle offers an opportunity to explore new paths, acquire new weapons and abilities, and figure out new strategies until you find the best way to break the loop.",
    "Not every great game needs to take advantage of ray tracing to be engaging. Deltarune Chapter 2, just like its developer’s previous game, Undertale, has more in common with the best RPGs to grace The Nintendo systems of the 90’s with its top-down point of view and pixelated graphics than the big AAA titles of today. You play as a human named Kris who travels to the “Dark World” to save the world. But, it’s more than just a typical RPG as the gameplay will sometimes change, including puzzles and bullet hell gameplay. The best part is that the first and second chapters are free.",
    "Not every top Steam game is an epic open world title that will set you back $60 on PS4 and Xbox One. Into the Breach is a sophisticated sci-fi strategy blast that you can play on your lunch break at work.",
    "It is made by the team behind Faster than Light, still one of our favourite PC games of the last decade. And for the handheld gaming veterans out there, there are shades of Advance Wars to it too.",
    "Earth has been attacked – and almost occupied – by aliens. In Into the Breach, you control groups of mechs sent from the future to reverse this fate. That may sound like a mind-bending premise, but it actually proves that the plot doesn’t matter too much sometimes. We know Earth will come out tops, it’s just a matter of how.",
    "Each encounter takes in an 8x8 block grid, your battlefield. Play unfolds in turns, and your mechs have to stop aliens from obliterating too many of the field’s buildings and outposts. It has the tactical purity of chess. As you play, you can upgrade your mechs to improve your chances.",
    "Like FTL, Into the Breach is moreish, smart and deceivingly deep.",
    "Some screenshots make Surviving Mars look like The Sims: Red Planet edition. However, this best steam game is, in fact, more like Sim City meets The Martian. You build an outpost on a barren patch of Mars, and have to keep it running to avoid your colonists from dying on the planet’s harsh surface. And, it’s harder than it sounds.",
    "That is, while mismanaging resources in Sim City or Civilization may make your inhabitants angry or lower your income, in Surviving Mars it can cause a chain reaction that sees life support systems fail. You’ll hear “a colonist has died”, and be left scrambling to fix the problem before other inhabitants start dying like bubbles popping as they touch the ground.",
    "Surviving Mars’s interface leaves something to be desired, but its survivalist approach to “city” building is absorbing.",
    "After the massive multiplayer Final Fantasy XIV, Square Enix finally got back to their series’ single player roots with Final Fantasy XV. It came to PS4 in late 2016, but was only ported to PC in March 2018. However, you do get all the DLC released on the consoles and, if your PC is beefy enough, you’ll experience better frame rates.",
    "Final Fantasy XV is somewhat different from the FF games of old. You travel around an open world, often by car, packed with Americana-style buildings, all your companions are human and the combat plays out in real time, not as turns. Still, you can tell this is a Final Fantasy game just by catching a 15-second clip of it in action.",
    "It Takes Two is more than just a Mary Kate and Ashley classic from the 90’s. It’s a new co-op platformer from EA where every level is unique. You might be taking on swarms of wasps, navigating an environment using magnets, or manipulating time. Whatever you’re doing, it will be something new.",
    "In It Takes Two, you control either May or Cody, parents who have decided to divorce at the beginning of the game. In a magical twist of fate, their daughter Rose accidentally turns them into dolls who have to overcome challenges conceived by Dr. Hakim, a talking self-help book attempting to bring May and Cody back together.",
    "The PC tends to get linked with the kind of games that sit you down – for hours on end until your eyes are red and part of you start to regret your life choices. However, it isn’t always that way.",
    "With Descenders, you can play in quick blasts. If you can drag yourself away from its moreish-ness, anyway. You’re a downhill free rider who has to get down procedurally generated courses with as much style as possible, preferably using a gamepad. It might remind you of the heyday of Tony Hawk games, or snowboard console classic SSX.",
    "The use of generated “tracks” means you can’t master courses, which means that it’s the mastery of the bike’s physics you need to be shooting for. A career mode pits you against a series of courses in the same style of environment, each with objectives. Finish the “boss course,” and you unlock a new terrain. But you have limited lives for the whole run. A mix of mobile game style and merciless old-school progression mechanics gives Descenders a fresh feel, just one of the many reasons why it’s made our best steam game list.",
    "Not every game has to be about destroying aliens or gunning down unnamed soldiers. For instance, American Truck Simulator, one of the best steam games to play in 2019, feels like mindfulness meditation next to those games.",
    "You drive a big 18-wheeler-style truck over the long highways of the US, transporting cargo from A to B. Breaking the traffic codes doesn’t end in a GTA-style police chase, just a fine. This is the sort of game you can put on like cozy slippers after a long day at work.",
    "Yet there’s also a business side to it, giving it depth. You start as a lowly contractor, but can earn enough money to build your own shipping empire.",
    "PC gamers who have been playing since the ‘90s might remember all the fuss surrounding the Baldur’s Gate titles. In fact, some of their most loyal fans still get teary-eyed reminiscing about their favorite side characters.",
    "Isometric role-playing games like Baldur’s Gate don’t cut it in the AAA world anymore. However, Pillars of Eternity brings back the spirit of those games to the Steam crowd. This is a challenging, slightly retro-flavoured RPG in which you control a band of classic fantasy-style adventurers. It’s made by Obsidian, the team behind Fallout: New Vegas. Pillars of Eternity II is on the horizon too.",
    "If you like your RPGs fantasy-themed, also consider Torment: Tides of Numenera.",
    "Another throwback to a style of game that has all but disappeared, Legend of Grimrock 2 is a dungeon crawler where you move in blocks, as opposed to freely. Why would you want that? It changes your relationship with the environment, making it feel more like an intricate puzzle instead of an open world a texture artist had been let loose on.",
    "There are an awful lot of actual puzzles involved here too, in-between the bouts of classic \"Dungeons & Dragons\" style combat encounters. Plus, as retro as the play style is, Legend of Grimrock 2 looks incredible, with many outdoors areas to prevent you from getting bogged down in dimly-lit dungeons.",
    "When it comes to in-vogue games, few titles continue to capture the zeitgeist (and fill it full of bullet holes) the way PlayerUnknown’s Battlegrounds does. It may have one of the worst acronyms ever, but that hasn’t stopped PUBG from putting the ‘battle royale’ subgenre on the map and turning itself into a phenomenon in the process. Sure, there’s a lot of hype still surrounding it, but the game behind all the coverage and Twitch fascination is still one of the most addictive on Steam, as well as one of the best steam games this 2019.",
    "That simple premise – parachute into a map with no gear, scavenge for weapons and armour, and fight for survival with a single life in a continually shrinking map – is still engrossing, even if it has a few too many bugs. Whether you’re teaming up with friends or braving its maps by your lonesome, PUBG remains one of the most fun shooters on the market in 2019.",
    "One of the latest releases on our best Steam games list, Kingdom Come: Deliverance boasts an experience that’s both reassuringly familiar and deeply alien. Set in a fictional Medieval Europe, it’s a first-person RPG where dialogue choices mold your world as much as your ability to problem solve and your skills in melee combat. It’s a game of unbelievable freedom, allowing you to carve a path through the Dark Ages however you see fit.",
    "You might get off your face on schnapps and get in a fight with the town drunk. You may start filling your pockets with the gold of unsuspecting townsfolk, Thief-style, or stain your blade with blood in the battlefield. Part Elder Scrolls, part Dark Souls, part something else entirely, it’s an action-RPG that punishes as much as it empowers. It also runs best on PC (with the right specs, obviously) so get it on the download pronto.",
    "Who knew, way back in 2015, that a Tom Clancy game would become one of the industry’s biggest success stories. But here we are, four years later, with a game that has over 25 million registered players and in its fourth year of consecutive content updates as well as premium bells and whistles. Rainbow Six: Siege is one of those success stories that keeps on succeeding, and for one very important yet simple reason: it’s fun as hell to play.",
    "Paring back the Rainbow Six formula to its roots - two teams fight in the same map, one protecting an objective while the other attacking and fighting their way in - no two matches in Siege are ever the same. You’ll be barricading doors, breaching through walls, blasting through ceilings and building an operator that’s attuned to your playstyle. It might not be groundbreaking. However, add in the limited time Outbreak mode (think Siege plus zombies), and you’ve got one of Steam’s most complete packages.",
    "From the indie team that gave us TowerFall and TowerFall Ascension comes one of the most rewarding pixel platformers in years. As you climb the titular mountain, flame-haired heroine Madeline battles her innermost demons just as much as the harsh and dangerous conditions around her. In its simplest form, Celeste is a tight, 2D, twitch-style platformer, but in reality it’s one of the most unforgettable games we’ve come across in many years.",
    "As poignant in narrative as it is unforgiving in gameplay, Celeste has over 700 ‘scenes’ to traverse, a myriad of secrets to uncover and a story that will grip you as much as the muscle-memory building formula of its platforming. For a game built around the simple mechanics of jump, air-dash and climb, there’s an incredible amount of depth to be found as you claw your way to the summit in more ways than one, which is why it warrants a spot on our best steam games list.",
    "When Divinity: Original Sin 2 was released in 2017, it had quite the legacy to live up to, that of its predecessor, which incidentally happens to be one of the most accomplished RPGs of all time. Then what does developer Larian Studios do? It only goes and follows it up with one of the most important additions to the genre in years. Divinity: Original Sin 2 is an enthralling fantasy world with a deep and complex combat model and one of the most riveting stories you’ll experience outside of a 1,000 page tome.",
    "The big selling point, and the main ingredient of Divinity: Original Sin 2’s secret sauce, is the complexity of its combat. You control a party of characters together with your own custom avatar, and utilize each one individually in battle. With countless skills and attributes to mix and match, the breadth of tactics available makes this a daunting yet deeply rewarding way to test your RPG abilities.",
    "The grand and operatic strategy genre has given us some true classics on PC, experiences that consoles have consistently failed to duplicate. From Crusader Kings to Europa Universalis, these are games with bucket loads of tactics and guile.",
    "Well, it just so happens the developer of those very games has taken that deeply immersive concept and put it in the dark ocean of space. Enter Stellaris, an evolution of the genre that takes the space exploration of EVE Online and Mass Effect and hits the hyperdrive button.",
    "You’ll traverse through countless of procedural galaxies, filled with thousands of planets and a myriad of alien species, each one possessing unique traits, economies and social strata. Whether it’s the power (and consistent balancing act) of interstellar diplomacy or the deep customisation of starship designs, there’s a wealth of sci-fi lore and mechanics to delve into with Stellaris.",
    "By far one of the oldest games on the list - well, that is if you consider 2013 old - Valve’s MOBA (multiplayer online battle arena), Dota 2, is still one of the most addictive titles on Steam. It’s also the only game on this list that’s free-to-play, so you don’t even need to have a healthy bank balance to enjoy its addictive battles. Age aside, Valve has been constantly updating and overhauling the game since launch, making it one of the most evolved MOBAs on the market.",
    "If you’ve never played it before, it’s a simple yet intoxicating setup: two teams of five players face off in a large map. Each one is defending a base with an ‘Ancient’ inside that must be protected at all costs. Find your opponent’s base and raze it to the ground to win. Anticipate to experience brilliant hero v hero showdowns, brutal ambushes, tactical plays and nonstop action.",
    "Run and gun platformers have carved a niche out for themselves on mobile, but they’re few and far between on PC. Luckily, this one was built to be a Microsoft exclusive with Xbox One in mind and the result is one of the most unique gaming experiences you’ll ever come across. Intended to capture the look and atmosphere of 1930s cartoons, Cuphead places you in the shoes of the titular hero and tasks you with battling across three distinct worlds and bosses that will capture your imagination with their ingenuity that crush your resolve with their difficulty.",
    "Recommending a notoriously tough game might sound counter-intuitive, but the steep difficulty curve is part of its appeal. With a distinctive soundtrack and those standout visuals at your side, you’ll earn every stage clearance like a piece of territory in a war, each victory feeling that much more satisfying. Brutal and beautiful in equal measure, Cuphead is a must have Steam title.",
    "Another somewhat fresh release on this list, Subnautica has already made waves (pardon the pun) despite having only dropped in January of this year. A survival game set deep in the ocean on an alien world, its unique twist on the classic template makes for a game that’s both entrancing to watch and challenging in its many interconnected mechanics. You’ll explore shallow reefs, dangerous trenches on the seabed and everything in between, all the while managing your precious oxygen supply.",
    "Oh, and there’s an entire ecosystem of alien marine life to contend with. Plenty of these fishy and mammalian critters want to add you to their menu, so you’ll need to outsmart and avoid them while scavenging for resources to build new equipment and tools. Like all the best survival games, the very best materials lie in the most dangerous of places. Do you dare swim deep enough to find them?",
    "With so many multiplayer shooters sharing the spolight in this feature, it seemed high time to pay homage to one of the best single-player FPS games ever made.",
    "MachineGames gave Wolfenstein a bloody, alt-history revival in the form of 2014’s The New Order, so it had its work cut out for it when it came to bettering all that visceral Nazi slaying. Then along comes 2017’s The New Colossus, dialing up the violence and the depth of storytelling that it would make most Call Of Duty titles look at the floor in humiliation.",
    "What makes The New Colossus so vital is how it doesn’t stray from its formula, but polishes and expands on it in almost every way. Bigger and more challenging bosses; intense set-pieces; myriad weapons that spit glorious death; a story that asks far more questions and presents some bold answers. It’s also rock hard, and consistently unforgiving, so lock and load at your peril...",
    "It’s not often that a franchise as significant as Resident Evil gets a new lease of life – especially when you consider the zombie-loving license had fallen into a lifeless parody over the past decade – but here we are with a truly terrifying horror game with the words ‘Resident Evil’ in the title. What a world, eh?",
    "While us PC folk aren’t allowed to scare ourselves half to death in VR yet (RE7 is a PSVR at the moment), that doesn’t mean it’s any less frightening. Dropping the third-person perspective that’s felt tired and rote for awhile now, RE7 embraces the first-person view that’s helped Outlast and company re-energize the horror genre, and boy does it make for one chilling 8-10 hour scare fest.",
    "With Capcom’s big budget, a creepy swamp setting (honestly, just go with it) and a storyline that feeds back into the series’ winding mythology, you’d be crazy not to add this to your Steam library.",
    "How could we make this list of games to play on Steam and not include the most recent offering from the master of turn-based strategy and tactical simulation? The Civilization series has gone through many forms over the years, but the sixth entry takes all the best bits from those earlier incarnations, smooths off the edges and serves up one of the most rewarding turn-based video games ever made.",
    "There’s nothing quite like building a nation from a fledgling settlement and nurturing it into a worldwide powerhouse, and Civilization VI gives you more freedom and control than ever. Eliminating the pre-set paths that hampered the still stellar Civ V, Civ VI transforms into a landscape that rewards intrepid explorers and self-assured conquerors with the opportunity to expand their budding society with new technologies and alliances. Sid Meier’s name alone is part of PC gaming’s lofty heritage, so owning this little doozy is a no-brainer.",
    "Undertale is one of those games that stays with you. A work of digital art whose charm and creativity never fails to keep its edge, no matter of how many times you play it through. And considering just how many innocuous JRPGs are out there right now, that’s a pretty extraordinary feat in unto itself.",
    "So why is Undertale so superb? It takes all the best elements from the ever-evolving RPG genre and weaves a world built on choice, consequence and compassion. As a child dropped into an underground world filled with terrors, you’ll have to face a whole host of monsters to make it home. How you face them and what choices you make, define your journey.",
    "And its Telltale-esque consequence system doesn’t just extend to dialogue choices – you can spare monsters after a fight, forging possible crucial alliances for later in the game. You can even end fights by telling your opponent jokes. It’s a game of such warm and pleasant quality you’d almost believe it was a JRPG from the earliest heyday of the genre.",
    "For years, one game sat atop the dark and misty mountain of action-RPGs. Skyrim was its name, and no other franchise, be it Dragon Age or Dark Souls, could even come close to breaking its iron-clad grip upon the genre. Then along came Geralt of Rivia, riding atop The Witcher 3: Wild Hunt with a confident swagger, ready to give The Elder Scrolls a good thrashing.",
    "If you’re looking for a game that strikes a perfect balance between length of play (you could easily spend 100+ hours across its unbelievably diverse map – one that’s a good 20% bigger than poor old Skyrim) and sheer quality, then The Witcher 3 is a must. There are just so many virtues The Witcher 3 has to its name. Brilliant writing, memorable quests, truly challenging beasts and a pair of DLC expansions (Hearts of Stone, and Blood and Wine) make this one of the best games of this or any other generation.",
    "Inside will break your heart. Fair warning. If you’re not off-putted by that, then see it rather as a mystery to be solved scene by heart-wrenching scene. Created by the same studio that made the wonderful 2.5D platformer Limbo – you know, the one about a little boy stuck in a nightmare world where a giant spider chases him endlessly – it should come as a huge shock to learn that Inside will leave you just as tearful as its predecessor.",
    "Thing is, Inside is a brilliant piece of art. Without a scrap of dialogue, you’ll explore a world in a similar platforming vein as Limbo, overcoming various ingenious environmental puzzles and evading both the flashlights of an oppressive government and the shadow of a conspiracy that’s clearly not going to end well.",
    "But it’s worth every second. There’s a reason it won many a GOTY award in 2016, so you’d be a fool not to add this to your Steam library. Just remember to pack a few tissues.",
    "Once upon a time there was a little game on PlayStation 3 called Supersonic Acrobatic Rocket-Powered Battle-Cars. It was all about using remote control-esque cars to knock a giant football around a makeshift pitch. Thing is, no one played it and the game slowly faded into obscurity.",
    "Then Rocket League came along, which was fundamentally the same thing, albeit with fine-tuned physics and a larger focus on multiplayer. One trip into PlayStation 4’s PS Plus lineup later and the game went supernova.",
    "And with good reason, too. It’s a modest concept but it just works – it’s a place where skill shines through as you boost your little RC car and hit the motorized equivalent of a bicycle kick. It’s magnificent, offering one of the best ways to play online (whether with friends or a bunch of strangers). Come on, who doesn’t want to spend their evening chasing a football with a car? FIFA? Pfft.",
    "Portal, back in its day, was groundbreaking. Sure, it sounds like we’re filling out boots with hyperbole, but back in 2007 all those portals, companion cubes and sociopathic AIs were blowing our minds over and over. Then Portal 2 came along and made the original look like a crossword puzzle in The Sun.",
    "Okay, the first Portal is still remarkable, but Portal 2 took a truly revolutionary concept and twisted it into something new. Everything in this game works without a hitch - the ebb and flow of its story, the growing difficulty of the puzzles and the new ways you’re forced to make your mind think with portals. It’s even got Stephen Merchant and JK Simmons in it!",
    "Portal 2 manages to take a brilliant recipe and somehow make it even more delicious, sprinkling in all new depths of platforming and puzzle flavour. If you haven’t played it, buy it now. If you have, play it again.",
    "The incredibly charming Stardew Valley is an indie farming RPG which sees you moving from the bustling city to your grandfather's old, run-down farm near sleepy Pelican Town. You’ll get to uncover the secrets of the mysterious town while growing a thriving farming empire.",
    "Stardew Valley's pixelated retro graphics, unique soundtrack and kooky characters make for a relaxed and fun game which combines elements such as farming simulation, adventure, dating simulation and crafting.",
    "Get ready to become emotionally attached because once you step foot in Pelican Town, it's hard to ever leave."
  ],
  "headers": {
    "3": "Resident Evil 8",
    "4": "Deathloop",
    "5": "Deltarune Chapter 2",
    "6": "Into the Breach",
    "11": "Surviving Mars",
    "14": "Final Fantasy XV",
    "16": "It Takes Two",
    "18": "Descenders",
    "21": "American Truck Simulator",
    "24": "Pillars of Eternity",
    "27": "Legend of Grimrock II",
    "29": "PlayerUnknown's Battlegrounds",
    "31": "Kingdom Come: Deliverance",
    "33": "Rainbow Six: Siege",
    "35": "Celeste",
    "37": "Divinity: Original Sin 2",
    "39": "Stellaris",
    "42": "Dota 2",
    "44": "Cuphead",
    "46": "Subnautica",
    "48": "Wolfenstein II: The New Colossus",
    "51": "Resident Evil 7: Biohazard",
    "54": "Sid Meier’s Civilization VI",
    "56": "Undertale",
    "59": "The Witcher 3: Wild Hunt",
    "61": "Inside",
    "64": "Rocket League",
    "67": "Portal 2",
    "70": "Stardew Valley"
  },
  "links": {
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "best MMO games": "https://www.techradar.com/best/best-mmo-games",
    "best open world games": "https://www.techradar.com/news/gaming/10-best-open-world-games-on-pc-today-1320363",
    "best co-op PC games": "https://www.techradar.com/news/best-co-op-games-2020-top-games-you-can-share-with-friends-on-console-and-pc",
    "Resident Evil 8": "https://store.steampowered.com/app/1196590/Resident_Evil_Village/",
    "Deathloop": "https://store.steampowered.com/app/1252330/DEATHLOOP/",
    "Deltarune Chapter 2": "https://store.steampowered.com/app/1671210/DELTARUNE/",
    "Into the Breach": "https://store.steampowered.com/app/590380/Into_the_Breach/",
    "Surviving Mars": "https://store.steampowered.com/app/464920/Surviving_Mars/",
    "Final Fantasy XV": "https://store.steampowered.com/agecheck/app/637650/",
    "It Takes Two": "https://store.steampowered.com/app/1426210/It_Takes_Two/",
    "Descenders": "https://store.steampowered.com/app/681280/Descenders/",
    "American Truck Simulator": "https://store.steampowered.com/app/270880/American_Truck_Simulator/",
    "Pillars of Eternity": "https://store.steampowered.com/app/291650/Pillars_of_Eternity/",
    "Legend of Grimrock 2": "https://store.steampowered.com/app/251730/Legend_of_Grimrock_2/",
    "PlayerUnknown’s Battlegrounds": "https://store.steampowered.com/app/578080/PLAYERUNKNOWNS_BATTLEGROUNDS/",
    "Kingdom Come: Deliverance": "https://www.techradar.com/news/kingdom-come-deliverance",
    "Rainbow Six: Siege": "https://store.steampowered.com/app/359550/Tom_Clancys_Rainbow_Six_Siege/",
    "Celeste": "http://store.steampowered.com/app/504230/Celeste/",
    "Divinity: Original Sin 2": "https://store.steampowered.com/app/435150/Divinity_Original_Sin_2__Definitive_Edition/",
    "Stellaris": "https://store.steampowered.com/app/281990/Stellaris/",
    "Dota 2": "https://store.steampowered.com/app/570/Dota_2/",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Cuphead": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Subnautica": "https://store.steampowered.com/app/264710/Subnautica/",
    "The New Colossus": "https://www.techradar.com/news/wolfenstein-ii-the-new-colossus-review",
    "Resident Evil": "https://store.steampowered.com/app/418370/RESIDENT_EVIL_7_biohazard__BIOHAZARD_7_resident_evil/",
    "Civilization VI": "http://store.steampowered.com/app/289070/",
    "Undertale": "http://store.steampowered.com/app/391540/",
    "The Witcher 3: Wild Hunt": "http://store.steampowered.com/app/292030/",
    "Inside": "http://store.steampowered.com/app/304430/agecheck",
    "Rocket League": "http://store.steampowered.com/app/252950/",
    "Portal 2": "http://store.steampowered.com/app/620/",
    "Stardew Valley": "https://store.steampowered.com/app/413150/Stardew_Valley/"
  }
}