{
  "source": "https://www.techradar.com/news/huawei-uk-revenues-fall-as-5g-ban-makes-impact",
  "title": "Huawei UK revenues fall as 5G ban makes impact",
  "category": "phones",
  "updated": "2021-06-14T11:06:47Z",
  "author": "steve-mccaskill",
  "summary": "Annual accounts provide insight into 5G network ban",
  "article": [
    "Huawei UK’s annual accounts have shown revenues fell by 27.5% during 2020, offering the first indication of the financial impact of the British government’s decision to ban the company from participating in the rollout of 5G.",
    "Last July, the government reversed its previous policy and confirmed all mobile operators would be forbidden from purchasing new Huawei 5G radio gear from 2021 and must remove all equipment installed in their 5G networks by 2027.",
    "Although operators who had planned to use Huawei as a supplier for 5G had six months to stockpile equipment, most decided to make alternative arrangements. BT, for example, has signed major deals with Nokia and Ericsson, while Vodafone is also pressing ahead with Open RAN.",
    "Accordingly, Huawei’s UK turnover fell from £1.26 billion to £913 million, while operating profit before interest and tax declined by 25.5% to £29.7 million.",
    "The figures would also have been hit by separate US sanctions on Huawei that have limited its access to American technologies such as chips and Google applications, affecting device development and the desirability of its handsets to UK consumers. With the ban now in effect, it is probable that Huawei’s 2021 accounts will make for even more grim reading.",
    "The Chinese vendor has had a presence in the UK for two decades and it was the awarding of a contract by BT in 2005 that accelerated the firm’s international expansion. Since then, Huawei had become a supplier for all four mobile operators.",
    "Despite its recent difficulties, Huawei retains a presence in the UK thanks to its research facilities and academic partnerships, while it is pressing ahead with a revived device strategy focused around its own HarmonyOS operating system. The company is also considering a shift towards software and cloud services."
  ],
  "headers": {
    "3": "Huawei UK 5G"
  },
  "links": {
    "ban the company": "https://www.techradar.com/news/huawei-banned-from-uk-5g-networks"
  }
}