{
  "source": "https://www.techradar.com/news/apple-mac-mini-drops-to-all-time-low-price-at-amazon-this-weekend",
  "title": "Apple Mac Mini drops to all-time low price at Amazon this weekend",
  "category": "computing",
  "updated": "2021-02-19T16:47:39Z",
  "author": "tabitha-baker",
  "summary": "Extra discounts make for big price drops",
  "article": [
    "It's not every day that you see Apple Mac Mini deals dropping to brand new price lows at Amazon, but right now, an extra $69 discount at Amazon is offering just that.",
    "You'll find the M1-equipped 2020 Mac Mini on sale for just $599.99 right now (was $699) - the first time the desktop Mac has dropped down to such a low price. Not only are you getting that blindingly fast processor, but with 8GB RAM and a 256GB SSD under the hood, this entry-level model is offering particularly good value this week.",
    "This extra Mac Mini deal comes on top of the $30 discount shared across a number of retailers over the course of the month, leaving us with a full $100 saving overall. That means there's never been a better time to grab a pocket-sized Apple computer.",
    "Not in the US? Scroll down for more Mac Mini and MacBook deals in your region.",
    "If you're after a more portable setup, you'll want to take a look at the latest MacBook Pro deals and cheap MacBook Air sales. We're rounding up all the best prices from around the web just below.",
    "Of course, the Apple tax is very real - if you're after something a little further down on the budget scale we'd recommend checking out this week's best cheap laptop deals, or taking a look at all the latest Chromebook sales."
  ],
  "headers": {
    "4": "This weekend's best MacBook deals"
  },
  "links": {
    "for just $599.99 right now (was $699)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-Mini-Chip-256GB-Storage%2Fdp%2FB08N5PHB83%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9795898735850062000-20",
    "MacBook deals": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699",
    "MacBook Pro deals": "https://www.techradar.com/news/the-best-cheap-macbook-pro-deals",
    "cheap MacBook Air sales": "https://www.techradar.com/deals/cheapest-macbook-air-prices-sales-and-deals",
    "best cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "Chromebook sales": "https://www.techradar.com/news/cheap-chromebook-deals"
  }
}