{
  "source": "https://www.techradar.com/news/microsoft-has-just-updated-all-of-its-surface-devices-ahead-of-windows-11-launch",
  "title": "Microsoft has just updated all of its Surface devices ahead of Windows 11 launch",
  "category": "computing",
  "updated": "2021-09-27T20:27:36Z",
  "author": "allisa-james",
  "summary": "Surface Go 2, Surface Pro 7, Surface Book 3, and Laptop Go receive firmware updates",
  "article": [
    "Microsoft is gearing for the launch of its Surface Pro 8 and Surface Laptop Studio, which will both ship just in time for Windows 11’s own release. But if you’re still using an older device, Microsoft just released firmware for the Surface Laptop Go, Surface Pro 7, Surface Book 3 and Surface Go 2.",
    "The new firmware updates, spotted by Wccftech, are meant to beef up the Windows 10 OS by improving system performance and system stability, along with addressing critical security vulnerabilities. Each device will be getting its own update addressing unique security issues.",
    "For instance, those with a Surface Pro 7 are getting firmware update 13.0.1763.7, while those with Surface Laptop Go are getting version 13.0.1763.7. Both the Surface Book 3 and Surface Go 2 are getting several firmware updates that will fix a multitude of Windows 10 problems.",
    "In order to install a firmware update, simply go to Settings, then select Update and Security, then finally Windows Update. After that, restart your device in order to complete the installation. Note, however, that once an update has been installed on any of these devices, it cannot be reverted back to an older build or uninstalled altogether.",
    "Meanwhile, the Surface Pro 8, Surface Laptop Studio, and the upcoming Windows 11 are all set to launch on October 5th, and you can preorder them today. Windows 11 will feature plenty of quality of life changes and improvements including layout, better security, more app availability, 40% smaller updates, improvements to gaming, and more."
  ],
  "headers": {},
  "links": {
    "Surface Pro 8": "https://www.techradar.com/reviews/microsoft-surface-pro-8",
    "Surface Laptop Studio": "https://www.techradar.com/reviews/microsoft-surface-laptop-studio",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Wccftech": "https://wccftech.com/surface-firmware-updates-are-live-for-surface-go-2-pro-7-and-more/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Wccftechcom+%28WCCFtech.com%29",
    "Windows 10 problems": "https://www.techradar.com/how-to/100-common-windows-10-problems"
  }
}