{
  "source": "https://www.techradar.com/news/new-windows-10-patch-preps-users-for-the-next-major-update",
  "title": "New Windows 10 patch preps users for the next major update",
  "category": "computing",
  "updated": "2021-04-28T10:02:36Z",
  "author": "rhys-wood",
  "summary": "More Windows 10 updates are coming very soon",
  "article": [
    "Windows 10 will begin transitioning over to the Spring 2021 update soon, and some users are already seeing a reliability patch to prepare their Windows 10 PCs for the big update.",
    "Reported by Windows Latest, the patch, titled KB4023057, specifically aims to make the Windows Update feature more reliable, while also attempting to make free space on your PC to facilitate future updates. The patch has been around since 2018, and rolls out with each major update to help make the process more seamless.",
    "Some users have noted that the patch adds and updates Microsoft Update Health Tools on the system, which attempts to make Windows 10 update as smoothly as possible by fixing corrupted files, freeing up disk space, analyzing network settings and more.",
    "The Windows 10 November 2019 update will stop being supported in May 2021, which means you might find Microsoft’s push to update your PC more aggressive than usual. If you haven’t updated since then, or since the May 2020 or October 2020 updates, be on the lookout for update notifications on your taskbar.",
    "The official documentation for the patch states that the update will respect any user-configured sleep options, as well as your most active hours, so there should be no fear in regards to the update sporadically happening while you’re in the middle of an important task.",
    "If you’re usually reluctant when it comes to updating Windows 10, this is one you might want to bite the bullet on, as it will prepare you for the 21H2 ‘Sun Valley’ update releasing later in 2021. The year’s second major update will feature a UI refresh and an all-new Start menu among other changes."
  ],
  "headers": {
    "3": "Opening the window"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows Latest": "https://www.windowslatest.com/2021/04/27/windows-10-reliability-patch-rolling-out-to-prepares-pcs-for-the-feature-update/",
    "Windows 10 November 2019 update": "https://www.techradar.com/news/windows-10-november-2019-update-is-here-but-you-might-be-disappointed",
    "stop being supported in May 2021": "https://www.techradar.com/news/microsoft-will-soon-kill-off-windows-10-november-2019-update",
    "official documentation": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9677071864904280000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Ftopic%2Fkb4023057-update-for-windows-10-update-service-components-fccad0ca-dc10-2e46-9ed1-7e392450fb3a",
    "21H2 ‘Sun Valley’": "https://www.techradar.com/news/windows-10-21h2-update"
  }
}