{
  "source": "https://www.techradar.com/news/star-wars-lego-prime-day-deals-include-the-cheapest-tie-fighters-and-x-wings",
  "title": "Star Wars Lego Prime Day deals include the cheapest Tie Fighters and X-Wings",
  "category": "appliances",
  "updated": "2021-06-28T14:56:53Z",
  "author": "tom-bedford",
  "summary": "X-Wings? More like Sav-ings this Prime Day",
  "article": [
    "There are plenty of fantastic Amazon Prime Day deals this year, and some of the best are on Lego Star Wars sets - like a good bounty hunter, we've hunted down the top savings for you.",
    "We're not completely surprised by the slew of Prime Day Lego deals, since Black Friday last year brought plenty, but Prime Day is a bit different. We say this because, while the Black Friday discounts reduced the price of a huge number of kits, Prime Day cuts affect fewer sets, but knock loads more money off them.",
    "There are great savings available on these Lego Star Wars deals, including some new-low prices on popular sets. So if you're a Star Wars fan this is a great opportunity to save some cash.",
    "(Not in the US or UK? Scroll down to find Prime Day deals in your region.)",
    "Most of these Lego Star Wars deals are on starships, with three of the most recognizable vehicles from the original trilogy getting some pretty hearty price cuts.",
    "Quite a big surprise is the discount on Baby Yoda - we've seen this kit reduced quite a few times, including during Black Friday last year, so the fact the set is getting a new low price is important. If you've been holding out on buying the kit, this might be the motivation you need to get it.",
    "Compared to some Lego ranges, there aren't a huge number of Lego Star Wars deals - Technic and City both have way more - but Black Friday brought loads, so there's some balance here.",
    "No matter where you live, you'll find all the lowest prices for Lego Star Wars sets from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Lego Star Wars deals on Prime Day in the UK",
    "7": "More Lego Star Wars deals",
    "8": "More Amazon Prime Day deals"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}