{
  "source": "https://www.techradar.com/news/reordering-reality-how-retailers-can-emerge-stronger",
  "title": "Reordering reality: how retailers can emerge stronger",
  "category": "computing",
  "updated": "2021-03-31T11:01:46Z",
  "author": "matt-candy",
  "summary": "Audi UK partners with IBM iX to reimagine customer's digital journey",
  "article": [
    "Long before the language of global pandemics and lockdowns entered our every-day vocabulary, it was important for organizations and brands to stand for something. They needed to create customer journeys that engendered the affinity and trust that leads to customer love. Customer experiences needed to be personalized and responsive, answering needs their customers didn’t realize they had – and so meaningful, that they drove incredible advocacy.",
    "Today, a year into the COVID-19 pandemic, these customer experiences are more critical than ever. In many markets, consumers continue to face restricted physical access to non-essential retail and instead are forced online. This reordered reality has left many retailers scrambling to respond to the needs of the now, whilst also working to emerge stronger from this crisis.",
    "Across retail and other industries, companies recognize that accelerating their digital transformation is an opportunity to enhance the human connection with their customers. Businesses will proactively and more decisively reassess their current physical footprint and, instead, focus on customer facing digital channels. In this era of social and business distancing, digital closeness can help mitigate sales decline, maintain and grow key B2B relationships, and transform enterprise go-to-market activities. This requires new thinking, new ways of working, and using data and AI powered platforms to improve workflows and infuse insight and intelligence into all customer experiences and digital touchpoints. Handled effectively, disruptions such as COVID can be fertile ground for marketing and sales innovation.",
    "One industry not traditionally known for its distance-based experiences is the automotive industry, which relies heavily on face-to-face customer engagements. Consumers are typically unwilling to make purchases without test drives and in-person viewings. As car dealerships had to close or limit operations, consumers put their car purchases on hold - car sales plunged 29% in the UK in one year. Yet how then did Audi UK see a 59% increase in leads year over year?",
    "Audi UK, working in partnership with IBM, recognized the need to embrace digital solutions that helped them to reimagine the customer’s online journey. They invested to improve this digital customer experience to meet evolving customer behavior, needs, and expectations, an essential service for success during the pandemic. Seeking digital transformation and smarter pre- and post purchase experiences, Audi UK created a roadmap to deliver customer-centric tools that enhance the user experience and provide new innovations to the Audi website. At IBM, we refer to this as a “CX North Star.”",
    "A CX North Star is more than a vision – it’s a guide for doing business. What separates the most durable businesses from the others is knowledge that technology alone is not enough to accelerate and deliver the digital transformations now required across all organizations. It requires massive instantaneous change, across all levels of the enterprise. By embracing new ways of working including enterprise-wide agility, Audi UK cut development cycles and moved to a continuous delivery engine of new customer requested functionality and tools, such as a test-drive booking app, vehicle maintenance scheduler and part exchange calculator. This enabled them to deliver more relevant functionality up to 75% faster - all of which served to improve the customer experience and encourage brand loyalty.",
    "Adopting this customer centric approach requires an organization to put the human at the center of all they do. The Audi UK team involved customers in design discussions and tested prototypes with user groups. They then iterated based on that feedback before scaling.",
    "Data analytics, enabled by a cloud platform, provided Audi with marketing insights and helped them pinpoint and mitigate technical issues, reducing customer submission errors by 90%. Audi can now make business and customer-experience decisions based on data rather than assumptions with a full view into how consumers interact with the new site.",
    "Audi UK now tailors the customers’ online experience to their prime motivations for car-buying – be it price, driving experience, technology or safety. Visitors are now asked fewer questions, can reach relevant information more quickly, and are offered more contact options to take their inquiry further than they could before. Audi is now better able to understand its visitors and, as a result, give a much more tailored and improved experience.",
    "Audi embraced the challenge to reinvent and evolve its brand’s digital touchpoints, which set the tone for the whole customer journey. Not even a pandemic is going to stop Audi from providing the best customer experience.",
    "As they emerge stronger, retailers will need the agility to be able to respond faster than ever to any type of disruption they are managing including unanticipated consumer behavior, increased demand and a heightened awareness of sustainability.",
    "Today’s consumers want three things: effortless experiences, contactless payment options, and personalized content and offers. By embracing cloud computing technologies, data analytics and new ways of working, retailers can accelerate their digital transformation using online platforms that meets each customer’s differing needs, delivering a smarter, more engaging experience that puts them firmly in the driver’s seat."
  ],
  "headers": {
    "3": "Embracing digital solutions",
    "6": "Customer centric approach",
    "10": "Accelerating digital transformation"
  },
  "links": {
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools",
    "Customer experiences": "https://www.techradar.com/best/cx-tools",
    "data": "https://www.techradar.com/best/best-data-migration-tools",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}