{
  "source": "https://www.techradar.com/news/computex-2021",
  "title": "Computex 2021 dates, keynotes and all the breaking news",
  "category": "computing",
  "updated": "2021-06-02T09:32:55Z",
  "author": "bill-thomas",
  "summary": "Computex 2021 is happening, here's what we expect",
  "article": [
    "Computex 2021 is now in full swing, though this year it's online-only. Although things had been up in the air due to the pandemic – the conference was cancelled in 2020 – the Taipei computer expo is back with a packed lineup that includes some of the biggest names in computing.",
    "All of its keynotes will be online, rather than big in-person showcases. The good news is that big names like Nvidia, AMD and Intel all had big Computex keynotes, and companies like Acer, Arm and Gigabyte will all have a presence at the show. That means that there’s definitely a lot to enjoy – we suspect many of these companies have been using the worldwide lockdown very productively.",
    "It's sure to be an eventful show, even if it's all online this year, and the event has got off to a strong start already thanks to keynotes by Intel, AMD and Nvidia.",
    "Be sure to bookmark this page as we will be updating it with any big news that reaches our desks.",
    "Intel has announced a pair of new U-series chips, one of which will be the series' first 5GHz processor, at Computex 2021.",
    "These are the Intel Core i5-1155G7 and the Core i7-1195G7. The Core i5-1155G7 will become Intel's most powerful i5 chip, while the i7-1195G7 becomes the first low-powered chip that can be cranked up to 5Ghz. Acer, Asus, and HP have been announced as some of the first hardware vendors who’ll offer laptops based on the new Tiger Lake processors later this year.",
    "HP has announced new business PCs in its Elite and Pro ranges powered by the latest AMD Ryzen PRO 5000 desktop chips at Computex 2021.",
    "According to HP, these are the \"world's smallest and most powerful AMD-based Ultra Small Form Factor business-class” computers, and will run almost silently as well, so there should be no distracting fan noise.",
    "At AMD’s Computex 2021 keynote, the chipmaker confirmed that the latest generation of Tesla’s infotainment system – arriving in both the new Tesla Model S and X – is powered by an AMD Ryzen processor and AMD RDNA 2 GPU.",
    "This means you could play graphically-demanding AAA games in the car – as long as you're not driving, of course.",
    "Nvidia has announced several Artificial Intelligence (AI) computing initiatives designed for enterprises at its Computex 2021 keynote.",
    "AI has been a key focus point of Nvidia’s presence at the event, and the company argues that its announcements will enable all kinds of enterprises to power their AI workloads on traditional datacenter infrastructure.",
    "While Team Green's new GPUs are getting the lion's share of hype, its AI business is booming, and doing some very interesting things as well.",
    "While Nvidia's announcements about its new GPUs (see below) were the biggest stories from the company's Computex keynote, there was also some pleasing news for Linux gamers.",
    "Nvidia and Valve will be bringing DLSS to Proton, which will enable the system in Windows games played on Linux. This could have drastic performance benefits, allowing Windows-only games to be played on Linux with (hopefully) impressive results.",
    "So, the rumors were true - at its Computex 2021 keynote, Nvidia showed off two new graphics cards, the powerful (and expensive) RTX 3080 Ti, and the more affordable RTX 3070 Ti.",
    "During the keynote, Team Green also revealed new games that will be benefitting from its RTX technology, including an update to Doom Eternal. It also showcased its enterprise and AI solutions, but we were too excited about the new GPUs to care.",
    "Alienware's new X-series of gaming laptops were shown off at Computex, and promise to combine thin and light designs with some of the most powerful components you'll find in a laptop.",
    "Both the X15 and X17 come with either an 11th-gen Intel Core i7 11800H or 11900HK processor paired with Nvidia RTX 30-series graphics. The smaller model ships with up to an 8GB Nvidia RTX 3080, while the 17-inch version offers a higher-spec 16GB model.",
    "We can't wait to try these new laptops ASAP.",
    "AMD has unveiled laptop versions of its Radeon RX 6000-series graphics cards, which aim to take on Nvidia’s mobile RTX 30-series GPUs.",
    "The high-end AMD Radeon RX 6800M will come with 12GB GDDR6 memory and a 145W TGP, and the company promises some very impressive results with the mobile GPU.",
    "We got our hands on the Asus ROG Strix G15 AMD Advantage Edition, one of the first laptops to be powered with the AMD Radeon RX 6800M, and we were suitably impressed.",
    "It was a long time coming, but AMD has finally revealed FidelityFX Super Resolution at Computex 2021, which will be available for gamers on June 22.",
    "AMD's alternative to Nvidia's DLSS (deep learning super sampling), FidelityFX Super Resolution intelligently upscales a game's resolution for improved visuals and better performance.",
    "In a surprise, but welcome, twist, AMD announced that FidelityFX Super Resolution will work on any relatively recent GPU, not just its own cards, and showed Godfall running on an Nvidia GeForce GTX 1060.",
    "At a virtual session at Computex 2021, Intel CEO Pat Gelsinger, has said it could take several years before the current global shortage of semiconductors is resolved.",
    "While this could be bad news for consumers looking to get new gadgets, Intel has got plans in place, and the company is also hoping that this leads to a shakeup in the global semiconductor supply chain, which is dominated by East Asian foundries.",
    "Computex 2021 officially kicks off on May 31, and technically goes throughout the month of June. However, in terms of new launches, we're probably going to hear about most of them within the first week. That's when the big keynotes will be delivered, with Nvidia, Intel and AMD all delivering their keynotes on the first day.",
    "We expect other manufacturers to announce new products throughout the first week, but news will likely dry up after that. Either way, we'll be sure to update this page with any big announcements throughout the entire month.",
    "AMD CEO Lisa Su is giving a keynote address at Computex 2021, which has definitely become a tradition. However, we're not quite sure what Team Red is going to have in store for us at Computex, given that all of its major generational products are already out.",
    "It's possible that we'll see Radeon RX 6600 XT, though. We've seen a ton of rumors circling around over the last month, and Computex would be the perfect place to debut the assumed mainstream graphics card.",
    "We also still haven't heard anything about its mobile graphics solutions for the best gaming laptops, even though they were hinted at all the way back at CES 2021. Could we get some AMD gaming laptops at Computex?",
    "Another possibility - and we have no reason to believe this will actually happen - is Threadripper 5000. It has been a while since we've seen new high-end desktop (HEDT) processors from Team Red. This is a long shot, but we'd love to see it.",
    "Nvidia is headlining several keynotes throughout the first week of Computex 2021, but its the first one that you should pay attention to. Nvidia is calling its opening keynote \"The Transformational Power of Accelerated Computing, From Gaming to the Enterprise Data Center\". So, while the event is definitely going to take a turn towards data centers and AI, gaming is absolutely going to be one of the focuses of the event.",
    "We're just not sure what that actually means. We have seen a ton of rumors around the Nvidia GeForce RTX 3080 Ti and RTX 3070 Ti, with rumored release dates for the week after Computex kicks off. So, definitely possible that Team Green will grace us with another graphics card that no one will actually be able to buy.",
    "Beyond that, however, we expect to hear about the usual suspects, like new G-Sync displays, ray tracing and DLSS and how those technologies are changing video games forever. And, with E3 2021 taking place a couple weeks after Computex, we might get a hint about major upcoming games that will take advantage of Nvidia RTX tech.",
    "Intel also has a major keynote on the first day of the event, but we aren't holding our breath for anything particularly exciting. Team Blue has already launched most of its major consumer products, with 11th-gen Tiger Lake-H and Rocket Lake-S already at large.",
    "It's possible that Intel will throw a couple of surprises our way, though. Just like AMD, it's been a while since we've seen an HEDT launch from Intel, so we could see a hint there. We could also see Intel talking a little bit more about its Xe graphics, as it's still not competitive with discrete graphics from AMD or Nvidia. We've been hearing some rumblings about a high-end Intel Xe DG2, so hopefully we can see it in action at Computex 2021."
  ],
  "headers": {
    "4": "Intel 11th Gen processors takes the fight to AMD with 5.0GHz speeds",
    "6": "HP brings the power with new Elite and Pro desktop PCs",
    "8": "Tesla’s new in-car gaming system is basically a mini PS5",
    "10": "Nvidia reveals AI software dev platform, new AI servers",
    "13": "Nvidia and Steam are making Linux gaming great again",
    "15": "Nvidia announces RTX 3080 Ti",
    "17": "Alienware’s new gaming laptops are its thinnest and most powerful yet",
    "20": "AMD Radeon RX 6000 mobile GPUs are here to take on Nvidia",
    "23": "AMD finally takes on DLSS with FidelityFX Super Resolution",
    "26": "Even Intel thinks the global chip shortage could last years",
    "28": "Computex 2021 date",
    "30": "AMD at Computex 2021",
    "34": "Nvidia at Computex 2021",
    "37": "Intel at Computex 2021"
  },
  "links": {
    "though this year it's online-only": "https://www.techradar.com/news/computex-goes-online-only-for-the-second-year-running-here-are-the-dates",
    "cancelled in 2020": "https://www.techradar.com/news/computex-2020-is-officially-canceled-due-to-covid-19",
    "has announced a pair of new U-series chips": "https://www.techradar.com/news/intels-latest-11th-gen-processor-brings-50ghz-speeds-to-thin-and-light-laptops",
    "Acer": "https://www.techradar.com/news/the-best-acer-laptops",
    "Asus": "https://www.techradar.com/news/best-asus-laptops",
    "HP": "https://www.techradar.com/news/mobile-computing/laptops/what-s-the-best-hp-laptop-904710",
    "has announced new business PCs in its Elite and Pro ranges": "https://www.techradar.com/news/hp-expands-elite-and-pro-desktop-pc-line-ups",
    "is powered by an AMD Ryzen processor and AMD RDNA 2 GPU": "https://www.techradar.com/news/teslas-new-in-car-gaming-system-is-basically-a-mini-ps5",
    "has announced several Artificial Intelligence (AI) computing initiatives": "https://www.techradar.com/news/nvidia-reveals-ai-software-dev-platform-new-ai-servers",
    "Nvidia and Valve will be bringing DLSS to Proton": "https://www.techradar.com/news/nvidia-and-steam-are-making-linux-gaming-great-again",
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "RTX 3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "Alienware's new X-series of gaming laptops": "https://www.techradar.com/news/alienwares-new-gaming-laptops-are-its-thinnest-and-most-powerful-yet",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "AMD has unveiled laptop versions of its Radeon RX 6000-series graphics cards": "https://www.techradar.com/news/amd-radeon-rx-6000-mobile-gpus-are-here-to-take-on-nvidia",
    "Asus ROG Strix G15 AMD Advantage Edition": "https://www.techradar.com/reviews/asus-rog-strix-g15-amd-advantage-edition",
    "AMD has finally revealed FidelityFX Super Resolution": "https://www.techradar.com/news/amd-finally-takes-on-dlss-with-fidelityfx-super-resolution",
    "Intel CEO Pat Gelsinger, has said": "https://www.techradar.com/news/even-intel-thinks-the-global-chip-shortage-could-last-years",
    "AMD CEO Lisa Su is giving a keynote address": "https://www.amd.com/en/events/computex",
    "We've seen a ton of rumors circling around over the last month": "https://www.techradar.com/news/new-rumours-about-amds-new-rx-6600-xt-gpu-emerge-could-it-compete-with-nvidia",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "\"The Transformational Power of Accelerated Computing, From Gaming to the Enterprise Data Center\"": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-1012792143908823700&murl=https%3A%2F%2Fblogs.nvidia.com%2Fblog%2F2021%2F05%2F18%2Fcomputex-executive-keynote%2F",
    "the Nvidia GeForce RTX 3080 Ti": "https://www.techradar.com/news/nvidia-will-be-at-computex-but-dont-expect-an-rtx-3080-ti",
    "rumored release dates for the week after Computex": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-again-rumored-for-early-june-launch-with-rtx-3070-ti-to-follow",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Intel Xe DG2": "https://www.techradar.com/news/intel-xe-high-end-gaming-gpu-could-be-faster-than-nvidias-rtx-3070"
  }
}