{
  "source": "https://www.techradar.com/news/best-mini-keyboards-the-best-60-and-75-keyboards-for-gaming",
  "title": "Best mini keyboards: the best 60% and 75% keyboards for gaming",
  "category": "computing",
  "updated": "2021-06-11T14:54:09Z",
  "author": "michelle-rae-uy",
  "summary": "Tiny but mighty",
  "article": [
    "Move over, TKL keyboards; there’s a new compact gaming keyboard in town. The best mini keyboards come in a much smaller form factor, dropping certain keys that have been deemed “not widely used” in order to shrink down to almost half the size of a full-sized keyboard. And, just like that, they’re taking over the optical and mechanical keyboards arena.",
    "Whether they’ve completely abandoned everything to the right of the Enter key (60% keyboard) or kept the arrow and special keys as a compromise while also preserving that compact form (75% keyboard), the best mini keyboards are just the ticket for those with a smaller desk space or want a solid gaming keyboard solution when traveling. But, just because they’re travel-friendly, it doesn’t mean that they lack some of the functionalities of a full-sized keyboard. On the contrary, thanks to their FN key shortcuts, some of them have those and more.",
    "Space-saving and just as reliable as the best full-sized keyboards (although there’s a bit of a learning curve due to their FN shortcuts), the best mini keyboards have us convinced. If you’re also ready to switch, these are the best ones we’ve tested so far, just in time for Amazon Prime Day.",
    "If Razer’s Huntsman Elite keyboard has impressed you, then be prepared to be blown away by its little brother. The Razer Huntsman Mini might be the cutest little keyboard you’ve ever seen, but it’s also among the best gaming keyboards out there, regardless of size.",
    "With a 1,000Hz polling rate, n-key rollover with anti-ghosting, and optical switches rated at 100 million keystrokes, there’s definite power in its performance as well as longevity – two things you wouldn’t expect just by looking at it. Those optical switches don’t just perform beautifully; they also feel amazing, adding to your comfort whether you’re gaming away for hours or squeezing in some work between sessions. We only wish it was a little cheaper, but then again most mini keyboards will set you back more than $100/£100 these days.",
    "Read the full review: Razer Huntsman Mini",
    "Perhaps because most people can’t get used to the lack of arrow keys on a 60% keyboard, Razer has taken a slightly different approach on its mini keyboard offering. Fresh from the oven, the Razer BlackWidow V3 Mini Hyperspeed goes for the 65% layout, incorporating those arrow keys to ensure that its mini gaming keyboard is just as great for gaming as it is for doing work.",
    "That’s not its biggest strength, however. Unlike most mini keyboards out there, this one offers both 2.4GHz wireless and Bluetooth connectivity, and it does both so well. It uses Razer’s Hyperspeed wireless technology to push out highly-responsive, low-latency performance on par with a wired keyboard, especially when it comes to gaming. In fact, you won’t be able to see any difference in performance between its wireless and wired connections – even with fast-paced games. You’ll also appreciate that you can easily connect up to and switch between three devices via Bluetooth.",
    "Read the full review: Razer BlackWidow V3 Mini Hyperspeed",
    "As impressive as the Razer Huntsman Mini is, it has nothing on the Corsair K65 RGB Mini’s hyper-responsiveness. This little-keyboard-that-could boasts a polling rate of up to 8,000Hz – the current average is 1,000Hz – making it extremely fast and therefore ideal for fast-paced games. Rounding that out are its 1.2mm actuation distance, full N-Key Rollover, and 100% Anti-Ghosting technology. You’ll be hard-pressed to find a mini keyboard this responsive.",
    "The Cherry MX switches feel extremely satisfying to pound away on, which you can do at your heart’s content considering their 100 million keystrokes rating. Perhaps the only thing that’s keeping this keyboard from being the ultimate mini keyboard champion is its form. Not only is it a little too thick to be comfortable on the wrist, but it also has no extra feet for a bit of tilt. Still, it’s definitely giving the Huntsman Mini a good run for its money.",
    "Read the full review: Corsair K65 RGB Mini",
    "RGB fans will want to check out the HyperX Alloy Origins 60. While it has all the makings of one of the best mini keyboards, the one thing that perhaps makes it stand out is its extra vibrant RGB lighting. Beyond that, the aircraft-grade aluminum body and double shot PBT keycaps are a testament to its build, its three adjustable keyboard angles and multi-platform compatibility speak to its versatility. Plus HyperX’s intuitive Ingenuity software does what it can to make it pop out even more.",
    "100% anti-ghosting and N-key rollover functionalities contribute to its winning performance, and while its longevity is rated lower than others, 80 million presses is hardly a joke. Recording macros is naturally on hand, as is usual with mini keyboards, though a tad simplistic. If you don’t care about that, however, this one’s a worthy contender, especially at that price.",
    "Read the full review: HyperX Alloy Origins",
    "Let’s face it; not every gamer makes use of key remaps or macros. In fact, many casual gamers rarely bother with it (unless you’re playing Cuphead and the default controls are whacked). That’s where Whirlwind FX Atom comes in. Whirlwind FX Element’s little brother has come out to play, but unlike its rivals, it comes with zero fuss and more fun. This 60% mechanical gaming keyboard doesn’t bother with macro recording and key remapping; its FN shortcuts, after all, is enough for a lot of users.",
    "What it does focus on are its incredible and immersive lighting presets. Via the app, you have access to a long menu of lighting presets, some of which are game-specific. It lights up fiery orange, for example, when you’re getting warm and toasty (and next to a campfire) in Valheim. Despite all the fun, this keyboard performs well, thanks to its Gateron mechanical switches, 3,000Hz polling rate, and N-key rollover.",
    "There’s a lot going for the Cooler Master SK622. Its design is among the best we’ve seen on mini keyboards – it’s got a slimmer profile for comfort and portability, as well as a lightbar wrapped around it for more immersion. While Cooler Master describes it as a 60% keyboard, it’s got dedicated arrow keys as well as some of the special keys while touting an even slimmer profile than its rivals. And, it has multi-platform compatibility, customizable RGB lighting, and key remapping and macro recording capabilities.",
    "But, what really makes this one the most versatile of all the best mini keyboards is its ability to switch from wired to wireless. Wired, its performance is top-notch. Wireless, it’s got an impressive range and multi-device connectivity, which means you can use one portable keyboard for up to three devices. Switching from one device to another is painless as well, thanks to its FN shortcuts, of which there’s a long list."
  ],
  "headers": {},
  "links": {
    "gaming keyboard": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "mechanical keyboards": "https://www.techradar.com/news/best-mechanical-keyboards",
    "keyboards": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Razer’s Huntsman Elite": "https://www.techradar.com/reviews/razer-huntsman-elite",
    "Razer Huntsman Mini": "https://www.techradar.com/reviews/razer-huntsman-mini",
    "Razer BlackWidow V3 Mini Hyperspeed": "https://www.techradar.com/reviews/razer-blackwidow-v3-mini-hyperspeed-review",
    "Corsair K65 RGB Mini": "https://www.techradar.com/reviews/corsair-k65-mini-keyboard",
    "HyperX Alloy Origins": "https://www.techradar.com/reviews/hyper-x-alloy-origins-mechanical-gaming-keyboard",
    "Whirlwind FX Element": "https://www.techradar.com/reviews/whirlwind-fx-element-keyboard"
  }
}