{
  "source": "https://www.techradar.com/news/amazfits-three-new-smartwatches-are-affordable-apple-watch-7-alternatives",
  "title": "Amazfit's three new smartwatches are affordable Apple Watch 7 alternatives",
  "category": "wearables",
  "updated": "2021-10-12T08:47:04Z",
  "author": "tom-bedford",
  "summary": "The GTR 3, GTS 3 and GTR 3 Pro",
  "article": [
    "If you've been considering buying a new smartwatch and find the Apple Watch 7 too pricey, and also don't want to wait for the Black Friday smartwatch deals, then perhaps Amazfit has something for you.",
    "The company has unveiled not one, not two but three new smartwatches: these are the GTS 3 (a successor to the GTS 2), the GTR 3 (you can guess how this relates to the GTR 2) and also a GTR 3 Pro with better specs than the non-Pro version (as you'd expect).",
    "These are all affordable smartwatches in the spirit of Amazfit's output: the GTS 3 and GTR 3 cost $179.99 / £149.99 / AU$359, and that goes up to $229.99 / £179.99 / AU$439 for the GTR 3 Pro, all of which make the $399 / £369 / AU$599 starting price of the Apple Watch 7 look bank-account-achingly expensive.",
    "The Amazfit GTS 3 is the closest to Apple's smartwatch design-wise with a square 1.75-inch screen, but it also has a 12-day battery life (something Apple Watches haven't come close to with their daily charge cycle).",
    "The GTS 3 is a bit more barebones in terms of features, with only a Bluetooth connection, no calling and no music storage, but it has the company's suite of 150 sports modes and is also very light at 24.4g.",
    "Next up, the GTR 3 has a rounded 1.39-inch display. It has the same feature set as the GTS 3 but bumps the battery life up to a lengthy 21 days, and also weighs more at 32g.",
    "Finally, the Amazfit GTR 3 Pro has a similar appearance to its non-Pro sibling but bumps the display up to 1.45 inches diagonally. It has a 14-day battery life, a speaker, Wi-Fi connectivity, 2.3GB of music storage, support for Bluetooth calls, and the same sports modes as the other smartwatches we've listed.",
    "We haven't tested any of Amazfit's new smartwatches just yet but will publish full reviews of each when we do, so you can see if they're worth the money and are competitors to the Apple Watch 7 that you should consider."
  ],
  "headers": {
    "3": "Much better battery life than an Apple Watch"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Black Friday smartwatch deals": "https://www.techradar.com/news/black-friday-smartwatch-deals",
    "GTS 2": "https://www.techradar.com/reviews/amazfit-gts-2",
    "GTR 2": "https://www.techradar.com/reviews/amazfit-gtr-2"
  }
}