{
  "source": "https://www.techradar.com/news/these-gopro-hero-8-black-bundles-combine-big-savings-and-plenty-of-accessories",
  "title": "These GoPro Hero 8 Black bundles combine big savings and plenty of accessories",
  "category": "cameras",
  "updated": "2021-08-06T12:23:20Z",
  "author": "tabitha-baker",
  "summary": "Save up to $80 on the previous generation",
  "article": [
    "GoPro Hero 8 Black deals are a regular sight these days, however we've spotted two bundles on offer this weekend that can offer even better value than normal. Those looking to get up and running with a range of accessories straight from the get go should head to Amazon, where you'll find a $349.99 price on a bundle that typically sells for around $400.",
    "That's $50 saved on a massive collection of accessories, including a shorty, head strap, 32GB SD card, and two rechargeable batteries. However, if you're not looking to spend quite so much, GoPro's own Hero 8 Black deals are back with a cheaper bundle.",
    "For $279.99 you can pick up the camera itself (usually $299.99), a year's GoPro subscription (worth $49.99), and a 32GB SD card (available for around $10). That's a total saving of $79.99 and the lowest price currently available. We generally tend to see GoPro offering bigger bundles than this, with accessories included that bring the total closer to the $349.99 price offered by Amazon. However, those looking to spend as little as possible are getting even better value right now.",
    "Not in the US? Scroll down for more GoPro deals in your region.",
    "If you're looking for something with a top of the line resolution, better battery life, and improved stabilization, the GoPro Hero 9 Black might be a better choice. You're also picking up that new front facing display, and Hindsight capture which can roll back footage up to 30 seconds from before you hit record.",
    "If you're not looking to spend quite so much, take a look at the best cheap action camera deals available right now, or for those who want to take it to the next level, we're also rounding up all the latest drone deals as well."
  ],
  "headers": {
    "4": "More GoPro deals"
  },
  "links": {
    "find a $349.99 price": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0854GSWZY%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2882095879370214400-20",
    "$279.99 you can pick up": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8762992754156768000/https://gopro.com/en/us/shop/cameras/hero8-black/CHDHX-801-master.html",
    "GoPro deals": "https://www.techradar.com/news/photography-video-capture/camcorders/cheap-gopro-deals-1296815",
    "best cheap action camera deals": "https://www.techradar.com/deals/the-best-cheap-action-camera-prices-sales-and-deals-in-february-2020",
    "drone deals": "https://www.techradar.com/deals/the-best-cheap-drone-deals"
  }
}